{"TopicId":22673,"ForumId":34,"TopicTitle":"[1.0] Figaro Global Navigation Satellite System - Launch a Working GPS System","CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2013-04-19T01:02:29Z","PageNum":7,"Articles":[{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2014-03-02T18:26:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PakledHostage\u0022 data-cite=\u0022PakledHostage\u0022\u003E\u003Cdiv\u003EWhat do you readers of this thread think?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think it would be right to follow Squad\u0027s idea about this: users should be able to influence the factors that come into play. Stuff randomly blowing up is no fun. So as long as the extra complexity and errors can be negated by users through certain actions I can not think of a good reason not to do it. It would also be nice if this is incremental, so that users can ease into it, although there might be some ultimate task that requires you to do everything right at once.\u003C/p\u003E\u003Cp\u003EI play KSP and use mods like this one because I want to learn about real technology and design challenges. I do not want to be shielded from difficulties you face when actually doing this, but it should be doable without being a real life expert. Facing a proper challenge is fine though.\u003C/p\u003E\u003Cp\u003EO yeah, I have been wanting to ask: with kOS going through a new development spurt, would you consider making GPS/latitiude/longitude data only available for the kOS unit when in contact with a proper constellation? I have been working on control logic for a while now, and I feel it would be very interesting if I would have to deal with signal loss and other real life problems.\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2014-03-03T20:48:13Z","Content":"\n\u003Cp\u003EOK. I\u0027m a bit busy right now in life outside of KSP but I will think about how I could add \u003Ca href=\u0022https://en.wikipedia.org/wiki/GNSS_augmentation\u0022 rel=\u0022external nofollow\u0022\u003ESBAS\u003C/a\u003E type augmentation to the mod over the coming weeks. Maybe I\u0027ll have it ready in time for the next version of the game.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Camacha\u0022 data-cite=\u0022Camacha\u0022\u003E\u003Cdiv\u003EO yeah, I have been wanting to ask: with kOS going through a new development spurt, would you consider making GPS/latitiude/longitude data only available for the kOS unit when in contact with a proper constellation? I have been working on control logic for a while now, and I feel it would be very interesting if I would have to deal with signal loss and other real life problems.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe capability already exists but it needs to be implemented by the developer of kOS. I exposed the number of visible satellites plus lat, lon and altitude in response to a request from SirJodelstien for his Persistent Trails mod. Those same variables could be used by the developer of kOS to do what you are requesting.\u003C/p\u003E\n"},{"CreatedByName":"kiwiak","CreatedById":82796,"CreatedDateTime":"2014-03-08T14:24:05Z","Content":"\n\u003Cp\u003EToo bad that i can check my position with engineer redux all the time. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EWell i can always choose not to.\u003C/p\u003E\u003Cp\u003EBut it woudl be nice if it somehow blocked engineer from showing me this if i dont have proper gps fix.\u003C/p\u003E\u003Cp\u003Eby the way, isnt 23 mb too much for two small parts?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-08T14:28:28Z\u0022 title=\u002203/08/2014 02:28  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 8, 2014\u003C/time\u003E by kiwiak\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"burglarnoone","CreatedById":108243,"CreatedDateTime":"2014-04-10T19:43:00Z","Content":"\n\u003Cp\u003EHi , this mod had a couple issues for me working with 23.5, the satellite gives a Nan error on its electrical readings, which screws with the electrics for other parts on the same vehicle. \u003C/p\u003E\u003Cp\u003EFor anyone with the same issues. Add the code using notepad etc to the part.cfg file located in the FigaroTransmitter folder.\u003C/p\u003E\u003Cp\u003EWhen you open the part.cfg delete all the lines below maxTemp = 3200, and paste the code below in their place.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003ERESOURCE\u003Cbr\u003E{\u003Cbr\u003E    name = ElectricCharge\u003Cbr\u003E    amount = 5\u003Cbr\u003E    maxAmount = 5\u003Cbr\u003E    }\u003Cbr\u003EMODULE\u003Cbr\u003E    {\u003Cbr\u003E        name = ModuleGenerator\u003Cbr\u003E        isAlwaysActive = True\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E        INPUT_RESOURCE\u003Cbr\u003E        {\u003Cbr\u003E           name = ElectricCharge\u003Cbr\u003E           rate = 0.03\u003Cbr\u003E        }    \u003Cbr\u003E}\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ENo idea if this is the optimal way to restore functionality until the author updates, but it works for me.\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2014-04-12T18:10:54Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EUPDATE\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EI have rebuilt the plugin for v0.23.5 of the game. It has already been posted to Spaceport.\u003C/p\u003E\u003Cp\u003EI have not yet implemented support for SBAS satellites although it is on my list of things to do.\u003C/p\u003E\u003Cp\u003EThe time displayed in the UT field is now shown in Kerbin days, hours and minutes. I haven\u0027t had a chance to figure out how to read whether the \u0022Earth Time\u0022 setting is set in a user\u0027s game, so I have only implemented a work around for those who want to use Earth time. Change the \u0022EarthTime\u0022 in the FigaroReceiver part\u0027s Part.cfg file to \u0022TRUE\u0022 if you would rather have the receiver display times in 24 hour days.\u003C/p\u003E\n"},{"CreatedByName":"burglarnoone","CreatedById":108243,"CreatedDateTime":"2014-04-12T18:59:38Z","Content":"\n\u003Cp\u003EThanks for the update, it\u0027s appreciated.\u003C/p\u003E\u003Cp\u003EI\u0027m pretty new to ksp and it\u0027s mods, is there a reason why your mod needs to be put in the /parts and /plugins folders, rather than the /gamedata folder, not that it\u0027s an issue was just wondering.\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2014-04-14T15:55:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022burglarnoone\u0022 data-cite=\u0022burglarnoone\u0022\u003E\u003Cdiv\u003EIs there a reason why your mod needs to be put in the /parts and /plugins folders, rather than the /gamedata folder, not that it\u0027s an issue was just wondering.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m not really sure. I haven\u0027t paid much attention to how the game has changed since about v0.18 because I haven\u0027t really played it since then [gasp!]. In the early days of modding, parts and plugins were required to go into those directories for security. The game limited a mod\u0027s access to things like the internet and storage on people\u0027s computers outside of the game installation directory. I was aware that some of that had changed but didn\u0027t realise that some mods are now installed elsewhere.\u003C/p\u003E\u003Cp\u003EIn short, it is a throwback to the old way of doing it. I don\u0027t think it causes any problems, does it? Indeed the installation instruction template in Spaceport that I use still shows the old way of doing it.\u003C/p\u003E\n"},{"CreatedByName":"futrtrubl","CreatedById":77310,"CreatedDateTime":"2014-04-20T20:23:21Z","Content":"\n\u003Cp\u003EJust three balance issues with the receiver.\u003C/p\u003E\u003Cp\u003EVisual balance: It seems you intentionally shift the receiver to the side which to me makes things look unbalanced and also causes issues with CoM balance. For this I set node_attach = 0.0, 0.0, 0.0, 0.0, 0.0, -1.0\u003C/p\u003E\u003Cp\u003EBalance with stock parts: I raised mass to 0.005 as I don\u0027t think an industrial space-worthy GPS receiver should mass less than a temperature sensor.\u003C/p\u003E\u003Cp\u003ECoM balance with stock parts: Even with it\u0027s mass the same as the other 0.005 mass science parts placing this part symmetrically oposite one of those parts unbalances a ship\u0027s CoM and causes a torque when thrusting. For this I added CoMOffset = 0, 0, -0.05 to the part.cfg\u003C/p\u003E\u003Cp\u003EEdward\u003C/p\u003E\n"},{"CreatedByName":"C.A.Sizemore","CreatedById":111232,"CreatedDateTime":"2014-06-06T07:34:17Z","Content":"\n\u003Cp\u003ESo where does this wonderful toy live in the tech tree, but I can\u0027not yet access it in sandbox but not in career mode? How and where should I spend my science? Before launching my Mun mapping fleet.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2014-06-06T17:29:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PakledHostage\u0022 data-cite=\u0022PakledHostage\u0022\u003E\u003Cdiv\u003EIn short, it is a throwback to the old way of doing it. I don\u0027t think it causes any problems, does it? Indeed the installation instruction template in Spaceport that I use still shows the old way of doing it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI am just not too sure how long the legacy directory system will be in use. I thought it was already taken out, actually.\u003C/p\u003E\n"},{"CreatedByName":"LitaAlto","CreatedById":110917,"CreatedDateTime":"2014-06-16T13:11:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022C.A.Sizemore\u0022 data-cite=\u0022C.A.Sizemore\u0022\u003E\u003Cdiv\u003ESo where does this wonderful toy live in the tech tree, but I can\u0027not yet access it in sandbox but not in career mode? How and where should I spend my science? Before launching my Mun mapping fleet.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s under Electronics, one of the 300-point nodes in the tech tree.\u003C/p\u003E\n"},{"CreatedByName":"x_men","CreatedById":103269,"CreatedDateTime":"2014-06-26T20:06:20Z","Content":"\n\u003Cp\u003EWhat\u0027s stopping me from flying these GPS satellites beyond Minmus, but still within Kerbin\u0027s SOI, and form a constellation way out there instead so 1 constellation will serve all Kerbin, mun, and Minmus? I guess what\u0027s the range of the transmitter? With 24 satellites in 6 different planes I\u0027m sure even if Kerbin rotates faster than the satellite can encircle it, there\u0027s still at least 4 visible satellites at all time, no?\u003C/p\u003E\u003Cp\u003EI\u0027ve just spent 4 hours deploying my constellation over Kerbin last night, and thinking how I can make things a bit easier for mun and minmus, maybe less satellites (12 instead of 24, in 2-3 planes instead of 6), or 1 set of 24 satellites for the whole system...\u003C/p\u003E\u003Cp\u003EAnyone tried?\u003C/p\u003E\n"},{"CreatedByName":"Ralathon","CreatedById":71537,"CreatedDateTime":"2014-06-26T20:19:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022x_men\u0022 data-cite=\u0022x_men\u0022\u003E\u003Cdiv\u003EWhat\u0027s stopping me from flying these GPS satellites beyond Minmus, but still within Kerbin\u0027s SOI, and form a constellation way out there instead so 1 constellation will serve all Kerbin, mun, and Minmus? I guess what\u0027s the range of the transmitter? With 24 satellites in 6 different planes I\u0027m sure even if Kerbin rotates faster than the satellite can encircle it, there\u0027s still at least 4 visible satellites at all time, no?\u003Cp\u003EI\u0027ve just spent 4 hours deploying my constellation over Kerbin last night, and thinking how I can make things a bit easier for mun and minmus, maybe less satellites (12 instead of 24, in 2-3 planes instead of 6), or 1 set of 24 satellites for the whole system...\u003C/p\u003E\u003Cp\u003EAnyone tried?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI haven\u0027t tried, but 10 bucks says it checks for vehicles within the SoI. So a network like that wouldn\u0027t work for Minmus and the Mun.\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2014-06-27T00:04:40Z","Content":"\n\u003Cp\u003ERalathon would win that bet... \u003C/p\u003E\u003Cp\u003EFor what it is worth, the mod is intended as a science mod. There are things that I should get around to improving but for now it serves its intended purpose of illustrating that being able to get accurate position fixes in real-time requires infrastructure and technology. The technology behind this mod closely mirrors (and suffers the same limitations as) the GPS and Galileo global navigation satellite systems.\u003C/p\u003E\n"},{"CreatedByName":"x_men","CreatedById":103269,"CreatedDateTime":"2014-06-27T16:01:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PakledHostage\u0022 data-cite=\u0022PakledHostage\u0022\u003E\u003Cdiv\u003ERalathon would win that bet... \u003Cp\u003EFor what it is worth, the mod is intended as a science mod. There are things that I should get around to improving but for now it serves its intended purpose of illustrating that being able to get accurate position fixes in real-time requires infrastructure and technology. The technology behind this mod closely mirrors (and suffers the same limitations as) the GPS and Galileo global navigation satellite systems.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes! For science! \u0022Would be\u0022 cool if we can use it to autopilot some stuff but that\u0027s not what I expect from this mod (my challenged friend would need such bait to carry out this mod). I\u0027m doing it for fun and I also put antenna on my transmitter sat to get them to relay communication too (remotetech). But other thing occurs. I know that with the seismometer you can put 6 of them, 2 at poles and 4 at each 90 degrees increment around equator, and maximize the science gathered when collecting impact data. I\u0027m not sure how accurate it needs to be, but hey if there\u0027s a GPS network telling me exactly where I am then I can be \u0026lt;1 degree off. Just a thought... \u003C/p\u003E\u003Cp\u003EWhat\u0027s the range of these things though? Can I deploy 12 satellites in 2 or 3 planes, say 120 degrees inclination at geosync orbit or higher, would it still work?\u003C/p\u003E\n"},{"CreatedByName":"Mechie_PhD","CreatedById":104557,"CreatedDateTime":"2014-06-27T17:48:08Z","Content":"\n\u003Cp\u003EAmazing Mod....Thank you!!!\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2014-06-27T19:52:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022x_men\u0022 data-cite=\u0022x_men\u0022\u003E\u003Cdiv\u003E\u0022Would be\u0022 cool if we can use it to autopilot some stuff but that\u0027s not what I expect from this mod (my challenged friend would need such bait to carry out this mod).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe mod\u0027s DLL already exposes position data and whether or not it has a valid fix. Other mods can use that information for their own purposes but it would have to be implemented by the authors of those mods. For example, SirJodelstein\u0027s \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/49216-0-23-5-Persistent-Trails-record-share-and-replay-track-data!-%28May-14-V1-1%29\u0022 rel=\u0022external nofollow\u0022\u003EPersistent Trails mod\u003C/a\u003E already offers users the option of interfacing that mod with their GNSS systems.\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2014-06-27T20:00:29Z","Content":"\n\u003Cp\u003EI should add that I appreciate the feedback! It is nice to know that people are enjoying the challenge of launching their own GNSS networks. It makes the effort of developing and maintaining a mod worthwhile.\u003C/p\u003E\n"},{"CreatedByName":"diomedea","CreatedById":93700,"CreatedDateTime":"2014-06-28T12:30:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PakledHostage\u0022 data-cite=\u0022PakledHostage\u0022\u003E\u003Cdiv\u003EI should add that I appreciate the feedback! It is nice to know that people are enjoying the challenge of launching their own GNSS networks. It makes the effort of developing and maintaining a mod worthwhile.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECertainly you deserve to receive some feedback on this excellent addon. \u003C/p\u003E\u003Cp\u003EI tend to always find lots of things to do in KSP, so just lately got a window of opportunity to launch my GNSS constellation. Going to try with 6 satellites on each of 4 orbital planes (don\u0027t want to copy exactly the GPS arrangement). Here is the first of my satellite carriers in orbit, ready to let the GNSS satellites detach at apoapsis, one at a time in 6 orbits, and then land:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/GBSQvd4.png\u0022 alt=\u0022GBSQvd4.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHope to be able soon to show the whole constellation.\u003C/p\u003E\n"},{"CreatedByName":"RayneCloud","CreatedById":11227,"CreatedDateTime":"2014-07-15T07:03:10Z","Content":"\n\u003Cp\u003ESo glad this is still working and being updated, \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Higgi91","CreatedById":8380,"CreatedDateTime":"2014-07-19T10:19:38Z","Content":"\n\u003Cp\u003EJust found and downloaded this, been looking for something like this for ages and can\u0027t wait to try it. Hoping it works ok on 0.24 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EEDIT: Can I just confirm this is how it works?\u003C/p\u003E\u003Cp\u003EShould the test craft (with no GPS) be able to know where it is at all? (Probe btw)\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/IUsPjgW,j5wLb77\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/IUsPjgW,j5wLb77\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnd this is how it is supposed to work in the tracking station (I guess because of no GPS, this makes sense)\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/j5wLb77.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/j5wLb77.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ECheers.\u003C/p\u003E\u003Cp\u003E...and now got 7 hours of work \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E wishing I was on KSP.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-19T10:28:04Z\u0022 title=\u002207/19/2014 10:28  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 19, 2014\u003C/time\u003E by Higgi91\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Entropius","CreatedById":104709,"CreatedDateTime":"2014-07-21T09:42:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Higgi91\u0022 data-cite=\u0022Higgi91\u0022\u003E\u003Cdiv\u003EJust found and downloaded this, been looking for something like this for ages and can\u0027t wait to try it. Hoping it works ok on 0.24 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003Cp\u003EEDIT: Can I just confirm this is how it works?\u003C/p\u003E\u003Cp\u003EShould the test craft (with no GPS) be able to know where it is at all? (Probe btw)\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/IUsPjgW,j5wLb77\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/IUsPjgW,j5wLb77\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnd this is how it is supposed to work in the tracking station (I guess because of no GPS, this makes sense)\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/j5wLb77.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/j5wLb77.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ECheers.\u003C/p\u003E\u003Cp\u003E...and now got 7 hours of work \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E wishing I was on KSP.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe way it works is basically like this: A craft needs a GPS Receiver part to see it\u0027s own position, but the GPS Receiver part needs 4 satellites with GPS transmitter antennas to be in line of sight. More than 4 also makes it more accurate than with just the bare-minimum of 4. \u003C/p\u003E\u003Cp\u003EThe way it works is essentially the same as how real GPS works: \u003Ca href=\u0022https://en.wikipedia.org/wiki/Trilateration\u0022 rel=\u0022external nofollow\u0022\u003ETrilateration.\u003C/a\u003E Therefore, 4 satellites that are tightly clustered in the same place in the sky will result in more error than 4 satellites spread around in different parts of the sky.\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2014-07-21T13:31:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Entropius\u0022 data-cite=\u0022Entropius\u0022\u003E\u003Cdiv\u003EThe way it works is basically like this: ...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks, Entropius, for jumping in to help out with the tech support! \u003C/p\u003E\u003Cp\u003EAnd Higgi91, you should also have a look at the first post in this thread. There is a FAQ and a couple of videos there that should be useful.\u003C/p\u003E\u003Cp\u003EUpdate for v0.24 of the game is imminent. It usually takes me a week or so to get around to it after I get my hands on a new version, but I am not one of those guys who downloads a new version of the game the second it is released.\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2014-07-21T16:53:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PakledHostage\u0022 data-cite=\u0022PakledHostage\u0022\u003E\u003Cdiv\u003EUpdate for v0.24 of the game is imminent. It usually takes me a week or so to get around to it after I get my hands on a new version, but I am not one of those guys who downloads a new version of the game the second it is released.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cstrong\u003EUPDATE:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ll download v0.24 of the game later today and will have a look at how to implement a rudimentary contract for building a GNSS network. Maybe some of you here who have played the newest version of the game already can offer suggestions on how much reputation and money should be awarded for launching a constellation around Kerbin?\u003C/p\u003E\u003Cp\u003EHopefully I\u0027ll have a new release of the mod ready for early next week (the week of July 28th).\u003C/p\u003E\u003Cp\u003EP.S. If someone wants to collaborate with me and take over development of a contract class for this mod, I\u0027d be happy to consider it. Just send me a PM.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-21T16:58:53Z\u0022 title=\u002207/21/2014 04:58  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 21, 2014\u003C/time\u003E by PakledHostage\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Entropius","CreatedById":104709,"CreatedDateTime":"2014-07-21T20:18:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PakledHostage\u0022 data-cite=\u0022PakledHostage\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003EUPDATE:\u003C/strong\u003E\u003Cp\u003EI\u0027ll download v0.24 of the game later today and will have a look at how to implement a rudimentary contract for building a GNSS network. Maybe some of you here who have played the newest version of the game already can offer suggestions on how much reputation and money should be awarded for launching a constellation around Kerbin?\u003C/p\u003E\u003Cp\u003EHopefully I\u0027ll have a new release of the mod ready for early next week (the week of July 28th).\u003C/p\u003E\u003Cp\u003EP.S. If someone wants to collaborate with me and take over development of a contract class for this mod, I\u0027d be happy to consider it. Just send me a PM.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI can\u0027t take over any development, and I don\u0027t play in Career mode as I\u0027m strictly a Sandbox guy, but I can suggest 4 ideas for contracts off the top of my head to whomever would be interested in implementing it.\u003C/p\u003E\u003Cp\u003E(1) Obviously a contract for setting up the GPS network on Kerbin should be a thing, but (2) you could have contracts generated for other celestial bodies too. On top of that you could also have (3) procedurally generated \u003Cstrong\u003Eground-truthing contracts\u003C/strong\u003E. Stuff like Ã¢â‚¬Å“Take a Figaro GPS-reciever equipped craft to these Lat,Lon coordinates to sample the GPS error at that positionÃ¢â‚¬Â. Finally, you could have contracts for (4) setting up base-stations, essentially like the ground-truthing idea, but instead you\u0027re putting a transmitter-equipped craft there. Probably on mountains or other high elevation spots with good line of sight.\u003C/p\u003E\n"}]}