{"TopicId":22673,"ForumId":34,"TopicTitle":"[1.0] Figaro Global Navigation Satellite System - Launch a Working GPS System","CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2013-04-19T01:02:29Z","PageNum":9,"Articles":[{"CreatedByName":"lextacy","CreatedById":107955,"CreatedDateTime":"2014-12-08T00:38:23Z","Content":"\n\u003Cp\u003Ewhats the best way to use this mod to land at other air strips?\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2014-12-08T04:56:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lextacy\u0022 data-cite=\u0022lextacy\u0022\u003E\u003Cdiv\u003Ewhats the best way to use this mod to land at other air strips?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOnce you\u0027ve launched your GNSS constellation, you can place a Figaro receiver on your craft. You can then enter the lat/Lon of any point on Kerbin (or whatever other celestial body your constellation orbits) and the Figaro receiver will display the heading and distance to that point. Both values are along the great circle (shortest route) between your current location and your destination. Just fly that heading on the navball.\u003C/p\u003E\n"},{"CreatedByName":"Papa Stefano","CreatedById":128456,"CreatedDateTime":"2014-12-08T06:02:05Z","Content":"\n\u003Cp\u003EI love the idea of launching realistic(ish) satellite constellations, and I have used this mod before. However, I never found any gameplay or utility value in it. I never found a way to -use- it. What can I do with this to make things more interesting, challenging, realistic, and so forth?\u003C/p\u003E\n"},{"CreatedByName":"Yaivenov","CreatedById":81754,"CreatedDateTime":"2014-12-08T17:29:26Z","Content":"\n\u003Cp\u003EHow hard would it be to make MechJeb only display GPS info if a proper constellation is in place?\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2014-12-08T19:41:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Papa Stefano\u0022 data-cite=\u0022Papa Stefano\u0022\u003E\u003Cdiv\u003EWhat can I do with this to make things more interesting, challenging, realistic, and so forth?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI am not really sure. I originally wrote the Figaro plugin in response to a challenge on the challenge thread and then decided to make it available to the masses when MrPwner offered to make some parts for it (you have him to thank for the Figaro receiver part and the GNSS transmitter part). I know that this mod is a bit simple and lacks a lot of functionality that might be \u0022nice to have\u0022, but it is intended first and foremost as a science mod. It is intended to get people thinking about where their navigation information comes from. Mods like Mechjeb and even the stock game are great but they abstract the very real technological problem of accurately determining position so that you can do all of the things the map view and Mechjeb allow you to do. If you\u0027ve already launched a constellation that gives you good coverage and accuracy, then you\u0027ve met the intent of the mod.\u003C/p\u003E\u003Cp\u003EI have suggested, through one of their former staff members, that Squad incorporate the idea as a contract into the stock game but I was told that they weren\u0027t interested. Something about how mods like this one and RemoteTech differ from their vision for the game. That\u0027s fine with me. I\u0027ll continue to support it myself, but I don\u0027t have enough time or motivation to make it into anything more than it already is.\u003C/p\u003E\u003Cp\u003EThe only thing I can suggest, therefore, would be that you ask other modders to integrate their mods with Figaro. I\u0027ve exposed some variables that other mod makers could read to add the type of functionality that Yaivenov requested in his/her post above, but the authors of those mods have to make the changes on their end.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-08T19:52:14Z\u0022 title=\u002212/08/2014 07:52  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 8, 2014\u003C/time\u003E by PakledHostage\u003C/strong\u003E\n\u003Cbr\u003ESpelling.\n\u003C/span\u003E\n"},{"CreatedByName":"Mecripp","CreatedById":181994,"CreatedDateTime":"2014-12-08T20:21:49Z","Content":"\n\u003Cp\u003ETry\u0027ed to use the stock ModuleAnimateGeneric as it\u0027s better then what looks stock on your but you can\u0027t turn it off any chance in updating the Module ?\u003C/p\u003E\n"},{"CreatedByName":"Yaivenov","CreatedById":81754,"CreatedDateTime":"2014-12-09T02:01:57Z","Content":"\n\u003Cp\u003EI was thinking about it and it seems that this would compliment SCANSat and RemoteTech but needs one more part (well technically two).\u003C/p\u003E\u003Cp\u003EFirst off, for a satellite to help you figure out where you are, or to map a planet for you, it needs to know where it is. Around Earth--err Kerbin the first half of this problem is solved by many fixed known-location ground stations broadcasting signals which the satellites calibrate themselves from. In game terms all your Kerbin GPS/mapping satellite would need is it\u0027s radio receiver (remotetech) to know where it is.\u003C/p\u003E\u003Cp\u003EHowever should you want to setup a GPS constellation or conduct mapping of a non-Kerbin rock how will your satellite know where it is? Enter the Star Tracker (\u003Ca href=\u0022http://www.ballaerospace.com/page.jsp?page=104\u0022 rel=\u0022external nofollow\u0022\u003Ereal thing\u003C/a\u003E), or in my own terms, the electro-optical sextant. Slap this bad boy on your space craft and it\u0027s no longer tied to the multitude of ground stations to figure out where it is and where it\u0027s going. Oh, but I did mention this was the first half, right?\u003C/p\u003E\u003Cp\u003EEnter the second half: Time. The satellite needs a very high degree of chronological accuracy. Either this is provided by a regular signal (remotetech again) or you\u0027ll need to research the miniturized high precision atomic clock and install that on your bird.\u003C/p\u003E\u003Cp\u003ESo there you have it, remote tech to provide time and/or spatial location for the birds, substitutional by the star tracker and atomic clock parts. The known location and time provides the satellites the ability to accurately map (scansat) or transmit their location (gps).\u003C/p\u003E\u003Cp\u003EFinally, why bother building a GPS network if you can just take a star tracker and clock with you? Good question, in this case my handwavium answer will be that the star trackers don\u0027t work in an obscuring atmosphere. So while that might help you on the Mun, you\u0027ll need to setup the constellation for Eve, Duna, Laythe, etc. In that way the GPS receiver becomes the primary (only?) means of telling your own location down on the surface or flying around in a rock with air.\u003C/p\u003E\n"},{"CreatedByName":"Positr0n","CreatedById":132658,"CreatedDateTime":"2015-01-15T21:39:09Z","Content":"\n\u003Cp\u003EAny report on if this mod works with 0.90 or if a release will be planned?\u003C/p\u003E\n"},{"CreatedByName":"stryker2279","CreatedById":112576,"CreatedDateTime":"2015-01-30T15:57:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Yaivenov\u0022 data-cite=\u0022Yaivenov\u0022\u003E\u003Cdiv\u003EI was thinking about it and it seems that this would compliment SCANSat and RemoteTech but needs one more part (well technically two).\u003Cp\u003EFirst off, for a satellite to help you figure out where you are, or to map a planet for you, it needs to know where it is. Around Earth--err Kerbin the first half of this problem is solved by many fixed known-location ground stations broadcasting signals which the satellites calibrate themselves from. In game terms all your Kerbin GPS/mapping satellite would need is it\u0027s radio receiver (remotetech) to know where it is.\u003C/p\u003E\u003Cp\u003EHowever should you want to setup a GPS constellation or conduct mapping of a non-Kerbin rock how will your satellite know where it is? Enter the Star Tracker (\u003Ca href=\u0022http://www.ballaerospace.com/page.jsp?page=104\u0022 rel=\u0022external nofollow\u0022\u003Ereal thing\u003C/a\u003E), or in my own terms, the electro-optical sextant. Slap this bad boy on your space craft and it\u0027s no longer tied to the multitude of ground stations to figure out where it is and where it\u0027s going. Oh, but I did mention this was the first half, right?\u003C/p\u003E\u003Cp\u003EEnter the second half: Time. The satellite needs a very high degree of chronological accuracy. Either this is provided by a regular signal (remotetech again) or you\u0027ll need to research the miniturized high precision atomic clock and install that on your bird.\u003C/p\u003E\u003Cp\u003ESo there you have it, remote tech to provide time and/or spatial location for the birds, substitutional by the star tracker and atomic clock parts. The known location and time provides the satellites the ability to accurately map (scansat) or transmit their location (gps).\u003C/p\u003E\u003Cp\u003EFinally, why bother building a GPS network if you can just take a star tracker and clock with you? Good question, in this case my handwavium answer will be that the star trackers don\u0027t work in an obscuring atmosphere. So while that might help you on the Mun, you\u0027ll need to setup the constellation for Eve, Duna, Laythe, etc. In that way the GPS receiver becomes the primary (only?) means of telling your own location down on the surface or flying around in a rock with air.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis. This needs to be done. I demand it. I must have awesomeness like this in my game! Only thing I could think of would be to make mechjeb virtually useless unless it had gps or connection to some point around it, so like you would have a base on kerbin needing supplies, mechjeb would either use satellites to tell it where it is, or it would use crafts in its line of sight to make a prediction of where it is by moving in relation to another object in its line of sight, such as three flags spaced apart. First part is kind of easy, but the second would be hard, but I would imagine for starters it would need a line of sight to an object. I\u0027d love to explain this idea further to anyone interested, and feel free to use this idea, I guess! My vision is dependent on mechjeb, this mod(duh) and remotetech\u003C/p\u003E\n"},{"CreatedByName":"nightingale","CreatedById":119307,"CreatedDateTime":"2015-02-12T22:14:45Z","Content":"\n\u003Cp\u003EI\u0027ve been considering making a \u0022build a GPS network\u0022 contract for some time (using \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/101604\u0022 rel=\u0022external nofollow\u0022\u003EContract Configurator\u003C/a\u003E, naturally). I never did simply because it didn\u0027t seem to have enough content to stand on its own. All this time though, I was completely unaware of Figaro\u0027s existence! If I were to create the cfg file, would you be interested including it in your mod? It creates a soft-dependency on Contract Configurator (if the player doesn\u0027t have Contract Configurator installed, they simply won\u0027t get the contract).\u003C/p\u003E\n"},{"CreatedByName":"Stone Blue","CreatedById":77721,"CreatedDateTime":"2015-02-15T03:53:07Z","Content":"\n\u003Cp\u003EI made a new GPS antenna/receiver part, and i would like to make it and the transmitter use electricity...I\u0027ve tried messing with the part.cfgs, but nothing works...Would this be something that has to be changed in the code, as well as just the part configs?\u003C/p\u003E\u003Cp\u003EHere\u0027s a shot of my new antenna...Basically just a textured Frisbee...lol\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/6E1JTO1.jpg\u0022 alt=\u00226E1JTO1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/p1PnaJT.jpg\u0022 alt=\u0022p1PnaJT.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Entropius","CreatedById":104709,"CreatedDateTime":"2015-04-28T19:55:14Z","Content":"\n\u003Cp\u003EDoes anyone know if this mod works in KSP 1.0?\u003C/p\u003E\n"},{"CreatedByName":"StoryMusgrave","CreatedById":131938,"CreatedDateTime":"2015-04-28T19:58:33Z","Content":"\n\u003Cp\u003EHow about instead of asking, try it yourself, and report back.\u003C/p\u003E\n"},{"CreatedByName":"RayneCloud","CreatedById":11227,"CreatedDateTime":"2015-04-28T20:54:12Z","Content":"\n\u003Cp\u003EAny word from Pak?\u003C/p\u003E\n"},{"CreatedByName":"Entropius","CreatedById":104709,"CreatedDateTime":"2015-04-28T22:40:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022StoryMusgrave\u0022 data-cite=\u0022StoryMusgrave\u0022\u003E\u003Cdiv\u003EHow about instead of asking, try it yourself, and report back.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGiven that my satellite constellation didn\u0027t survive the update and will take a while to rebuild, and maybe somebody else\u0027s survived the update, I didn\u0027t think it was an unreasonable question to ask. \u003C/p\u003E\u003Cp\u003EWhile I can eventually test it myself, it\u0027s going to be a while.\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2015-04-28T23:00:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Damion Rayne\u0022 data-cite=\u0022Damion Rayne\u0022\u003E\u003Cdiv\u003EAny word from Pak?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m around but I haven\u0027t downloaded v1.0 yet. Please give me some time. I\u0027ve got a 3 month old who demands most of my non-working waking hours (as well as many of my sleeping hours) and who gets in the way of such things as updating mods.\u003C/p\u003E\n"},{"CreatedByName":"shoe7ess","CreatedById":114974,"CreatedDateTime":"2015-04-28T23:11:34Z","Content":"\n\u003Cp\u003EI haven\u0027t gone through this entire thread, but if it hasn\u0027t been suggested yet, it\u0027d be cool if you could at least make it an option to need these GPS sats setup before the navball is visible. Kind of like how remotetech will make you lose control of a probe-controlled rocket when out of range/sight of a signal, you could make the navball appear only when a GPS satellite is within line of sight. This would pair amazingly with an RO playthrough, at least in my opinion. Just a thought, I just like difficult tasks in my playthroughs though, so it may just be me.\u003C/p\u003E\n"},{"CreatedByName":"m4v","CreatedById":67965,"CreatedDateTime":"2015-04-28T23:28:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022shoe7ess\u0022 data-cite=\u0022shoe7ess\u0022\u003E\u003Cdiv\u003EI haven\u0027t gone through this entire thread, but if it hasn\u0027t been suggested yet, it\u0027d be cool if you could at least make it an option to need these GPS sats setup before the navball is visible. Kind of like how remotetech will make you lose control of a probe-controlled rocket when out of range/sight of a signal, you could make the navball appear only when a GPS satellite is within line of sight. This would pair amazingly with an RO playthrough, at least in my opinion. Just a thought, I just like difficult tasks in my playthroughs though, so it may just be me.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA gyroscope doesn\u0027t need a GPS network to work, how are you going to put your first GPS sat in orbit without the navball anyway?\u003C/p\u003E\n"},{"CreatedByName":"Stone Blue","CreatedById":77721,"CreatedDateTime":"2015-04-29T08:09:51Z","Content":"\n\u003Cp\u003EYeah...Going without the navball is a bit much I think...But yes, I would like to see SOME way of making GPS more useful in KSP....I wish i was a modder...I have a couple ideas, I just cant implement them... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003EI had mentioned to nightingale about somehow integrating his Waypoint mod, this mod, and possibly Persistent Trails mod...But nothing came of it....I dont blame him...It would probably be pretty involved. Would be nice if someone created a Contract Configurator pack, integrating those three mods, and maybe even RemoteTech, and maybe even MechJeb.... I would also like to see this mod somehow integrated into RPM for IVA usage...\u003C/p\u003E\u003Cp\u003EAs to Figaro GPS working in 1.0....???\u003C/p\u003E\u003Cp\u003EI think YES!!!!... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EI put up a hasty, not very pretty 10 sat constellation this evening...and threw my GPS antenna on the stock skycrane/rover, and launched it on the KSC Launch Pad....I let it set for a few minutes, and the best it could get was only 4 sats visible... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E ... However, the accuracy was between 4.0m down to 0.3m... (mostly 0.5-0.3 once it settled down)...I checked the coords and altitude from previous readings, and they match!.. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/bc85bXT.jpg\u0022 alt=\u0022bc85bXT.jpg\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/2oNk20E.jpg\u0022 alt=\u00222oNk20E.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m beat, so i\u0027ll try driving the rover around tomorrow, and throw some more sats up and see how it goes.\u003C/p\u003E\u003Cp\u003EAlso, I am running Exception Detector mod, along with 18 other plug-in mods, and 1 small part mod...No exceptions from Figaro so far...i also checked my KSP.log for errors and warnings, and nothing from Figaro there either.... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI guess Pak nailed this WAAYYYY-back, and Squad must not have had to make any API or coding changes that have affected this mod...\u003C/p\u003E\u003Cp\u003ENice job, Pak! :thumbsup:\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-04-29T08:13:16Z\u0022 title=\u002204/29/2015 08:13  AM\u0022 data-short=\u00229 yr\u0022\u003EApril 29, 2015\u003C/time\u003E by Stone Blue\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2015-04-29T15:41:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Stone Blue\u0022 data-cite=\u0022Stone Blue\u0022\u003E\u003Cdiv\u003EAs to Figaro GPS working in 1.0....???\u003Cp\u003EI think YES!!!!... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks for the update. There are one or two little niggling bugs that I\u0027d like to get to solving. I\u0027ll recompile, linking to the latest libraries when I do. Hopefully that will be soon.\u003C/p\u003E\u003Cp\u003EFor the time being, I\u0027ve updated the OP of this thread. If anyone runs into problems with this mod in v1.0 of the game, please post a detailed description and screen shots here.\u003C/p\u003E\n"},{"CreatedByName":"Creideiki","CreatedById":68436,"CreatedDateTime":"2015-04-30T18:56:50Z","Content":"\n\u003Cp\u003ESorry to be a bother, I think I may have missed this information.\u003C/p\u003E\u003Cp\u003EBut I\u0027m trying to see about adding the transmitter function to another part. Namely the lovely TRANSIT 2A satellite model made by raidernick (since it a recreation of a satellite used in the old US Navy TRANSIT/NAVSAT network). And I\u0027m not quite clear on how to add the transmitter function to the part. Any help would greatly be appreciated.\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2015-05-01T21:42:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Creideiki\u0022 data-cite=\u0022Creideiki\u0022\u003E\u003Cdiv\u003EAny help would greatly be appreciated.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe transmitter part doesn\u0027t have any functionality. Only the receiver part uses the plugin module. The receiver part looks for spacecraft that contain the transmitter part. It identifies the transmitter part by name.\u003C/p\u003E\u003Cp\u003EIf you want to use a different part as a transmitter part, just change the name of your replacement transmitter part to that of the old transmitter part that comes with the mod. You can do this in the Part.CFG file. Any text editor (such as Notepad) is all you need to edit it.\u003C/p\u003E\n"},{"CreatedByName":"loppnessmonsta","CreatedById":58525,"CreatedDateTime":"2015-05-07T01:06:32Z","Content":"\n\u003Cp\u003EAny chance of enabling this for CKAN? no idea what\u0027s required, but CKAN has spoiled me and I\u0027d like to streamline as much as possible.\u003C/p\u003E\n"},{"CreatedByName":"TranceaddicT","CreatedById":73653,"CreatedDateTime":"2015-05-19T17:21:57Z","Content":"\n\u003Cp\u003EIt is in the CKAN database. It\u0027s just listed as not compatible with 1.0.2.\u003C/p\u003E\u003Cp\u003EUntil the database is updated you have to install manually. Once updated CKAN will automatically list it as compatible and you can install from there (after manually removing from GameData).\u003C/p\u003E\n"},{"CreatedByName":"loppnessmonsta","CreatedById":58525,"CreatedDateTime":"2015-05-20T06:39:02Z","Content":"\n\u003Cp\u003EInteresting! I didn\u0027t realize that. Thanks!\u003C/p\u003E\n"}]}