{"TopicId":22703,"ForumId":34,"TopicTitle":"(0.23) Wayland Corp. Development and released download Thread (new parts)","CreatedByName":"Devo","CreatedById":22750,"CreatedDateTime":"2013-04-19T02:17:56Z","PageNum":64,"Articles":[{"CreatedByName":"Devo","CreatedById":22750,"CreatedDateTime":"2013-12-29T21:41:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Voidryder\u0022 data-cite=\u0022Voidryder\u0022\u003E\u003Cdiv\u003ESeems a few modders are having glitches with hatches lately. Did Squad (or is it Unity) ever change that 1m from center rule? Maybe that\u0027s the problem? Like I said I can\u0027t fly your beautiful ships worth a dang (Dammit Devo, I\u0027m a rocket-jockey, not some stick-and-rudder pilot!), but will be glad to help out on EVA, etc if needed. You\u0027ll lick this problem I\u0027m sure.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanking you.. I am just working on the new cockpit now, ill add some new lights and see if I can get them working too, should have a new one to test out in an hour or so.\u003C/p\u003E\n"},{"CreatedByName":"Devo","CreatedById":22750,"CreatedDateTime":"2013-12-29T22:10:07Z","Content":"\n\u003Cp\u003EOk.. fingers crossed, this is fixed now..\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www./download/sgva5dcbb9q5ukj/PX2_CockpitFix.zip\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./download/sgva5dcbb9q5ukj/PX2_CockpitFix.zip\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAlso can you please IVA and see if it is bright enough in there now compared to the near pitch black last version?\u003C/p\u003E\n"},{"CreatedByName":"Voidryder","CreatedById":57308,"CreatedDateTime":"2013-12-29T23:19:27Z","Content":"\n\u003Cp\u003ESuccess!! All 3 out and in via hatch\u0027s and portraits\u0027 EVA button. No clones and no freezing.\u003C/p\u003E\u003Cp\u003ESame as before - on vanilla KSP, nothing else installed. \u003C/p\u003E\u003Cp\u003EStill getting the camera thrown to the other side of runway view, when clicking on EVA. Both on hatch click and portrait click. Maybe it\u0027s the Coriolis Force? Since I\u0027m Northern and you\u0027re Southern Hemisphere. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs to IVA:\u003C/p\u003E\u003Cp\u003ELighting is good in my opinion. Maybe a tad bright for a cockpit, but hey that\u0027s personal taste. Not a game breaker. One effect I did notice was a jagged edge shimmering along the top of the windscreens. Below the edge, the glass was tinted light gray. Above the edge, it was clear. Say it was about top 1/8 of glass. \u003C/p\u003E\u003Cp\u003EAlso on hatch side exterior, there was a faint purple-ish (lavender? violet? blue-ish white?) (Dammit Devo, I\u0027m a EVA test monkey, not a interior decorator!) glow, like the light from the cockpit was bleeding through. But this only happened with a crew member outside. When all were buttoned up, no light was a\u0027showing.\u003C/p\u003E\u003Cp\u003ECongrats on fixing the hatch.\u003C/p\u003E\u003Cp\u003ESee ya in The Black!\u003C/p\u003E\n"},{"CreatedByName":"Devo","CreatedById":22750,"CreatedDateTime":"2013-12-29T23:47:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Voidryder\u0022 data-cite=\u0022Voidryder\u0022\u003E\u003Cdiv\u003ESuccess!! All 3 out and in via hatch\u0027s and portraits\u0027 EVA button. No clones and no freezing.\u003Cp\u003ESame as before - on vanilla KSP, nothing else installed. \u003C/p\u003E\u003Cp\u003EStill getting the camera thrown to the other side of runway view, when clicking on EVA. Both on hatch click and portrait click. Maybe it\u0027s the Coriolis Force? Since I\u0027m Northern and you\u0027re Southern Hemisphere. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs to IVA:\u003C/p\u003E\u003Cp\u003ELighting is good in my opinion. Maybe a tad bright for a cockpit, but hey that\u0027s personal taste. Not a game breaker. One effect I did notice was a jagged edge shimmering along the top of the windscreens. Below the edge, the glass was tinted light gray. Above the edge, it was clear. Say it was about top 1/8 of glass. \u003C/p\u003E\u003Cp\u003EAlso on hatch side exterior, there was a faint purple-ish (lavender? violet? blue-ish white?) (Dammit Devo, I\u0027m a EVA test monkey, not a interior decorator!) glow, like the light from the cockpit was bleeding through. But this only happened with a crew member outside. When all were buttoned up, no light was a\u0027showing.\u003C/p\u003E\u003Cp\u003ECongrats on fixing the hatch.\u003C/p\u003E\u003Cp\u003ESee ya in The Black!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E thanks mate, I have no idea about the camera thing... I think I have lost enough hair with just the EVA on this thing Im going to leave it and just get on with the next ship, I just didnt want to leave it broken. There are probably 500 things I would like to do to improve that ship, but it\u0027s easier to just make a new shuttle. \u003C/p\u003E\u003Cp\u003EI really want to add a launch system and also make the thing more compact, I big ships, but also small more maneuverable ship are cool too, I always wanted to make a complete solution pack, shuttle rover, launch system.. im sorta working on bits and pieces right now, just getting over a bad pneumonia bout.. still bit groggy\u003C/p\u003E\u003Cp\u003E\\\u003C/p\u003E\n"},{"CreatedByName":"Logan.Darklighter","CreatedById":7375,"CreatedDateTime":"2013-12-30T00:06:15Z","Content":"\n\u003Cp\u003EOoh. Just checked back in and seeing a new cockpit is up. Downloading to test now.\u003C/p\u003E\n"},{"CreatedByName":"Logan.Darklighter","CreatedById":7375,"CreatedDateTime":"2013-12-30T00:32:21Z","Content":"\n\u003Cp\u003EOkay - first commentary - \u003C/p\u003E\u003Cp\u003E- I very much like the lights in the cockpit. I don\u0027t think they are too bright. They\u0027re just fine. \u003C/p\u003E\u003Cp\u003E- Not hugely important, but something I just now noticed: None of the 3 Kerbals are sitting exactly in the seats. They seem to be sitting in the air at about the level of the armrests. Not important unless you feel OCD about that sort of thing. \u003C/p\u003E\u003Cp\u003E- Confirmed exit and re-boarding of Kerbals can go smoothly. The camera whip-around doesn\u0027t really bug me. That seems to happen on ALL ships, not just yours. \u003C/p\u003E\u003Cp\u003E- however - there is still something a little odd. There\u0027s no \u0022Grab\u0022 function with the hatch. There\u0027s only (F) to Board. I had the shuttle sitting flat on the ground with the gear up flush so Jeb and crew could simply walk up to the hatch. When they walked into it, there was the (F) Board function pop up. But if they continued to walk into it as I did trying to find the (F) Grab? Then they intersect with the hull and get stuck like before. A little wiggling pops them loose no problem seems like. But I\u0027ve seen that actually BREAK the ship before. So it could be dangerous to the ship if a Kerbal gets stuck there.\u003C/p\u003E\u003Cp\u003EEDIT: Ugh... also happens with ladders. I placed one just underneath the hatch. Had Bob go on EVA. He fell to the ground. Got up. Climbed the ladder to the hatch and then got stuck. Propelled up into the nosecone in fact.\u003C/p\u003E\u003Cp\u003EEDIT EDIT: Hmm. Might be where you place the ladder. I placed it the second time on more of an angle flush with the hull and seemed to be fine.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-30T01:00:28Z\u0022 title=\u002212/30/2013 01:00  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 30, 2013\u003C/time\u003E by Logan.Darklighter\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Voidryder","CreatedById":57308,"CreatedDateTime":"2013-12-30T01:03:21Z","Content":"\n\u003Cp\u003EAnd the Master Test Pilot is BACK! Yay! I\u0027ll just retire to the other end of the hanger and go back to sorting washer, nuts and bolts. Glad you\u0027re back Mr. Darklighter. Was afraid Devo was going to have to make do with my ham-fisted testing.\u003C/p\u003E\u003Cp\u003E(I\u0027ll see if I can get the same results of no grab and colliding. Didn\u0027t see it happening with the last cockpit download, but I\u0027m a rookie at this testing.)\u003C/p\u003E\n"},{"CreatedByName":"Deathsoul097","CreatedById":77396,"CreatedDateTime":"2013-12-30T05:03:28Z","Content":"\n\u003Cp\u003EJust as a request, would you ever consider working on something from Halo?\u003C/p\u003E\u003Cp\u003ELike maybe a \u003Ca href=\u0022http://th03.deviantart.net/fs70/PRE/f/2012/126/4/4/44fe6bc349395ab09f4bb299f2d5c3f7-d4yprjo.jpg\u0022 rel=\u0022external nofollow\u0022\u003EPelican\u003C/a\u003E, or maybe a \u003Ca href=\u0022http://static2.wikia.nocookie.net/__cb20111001031422/halo/images/2/2b/Sabre-class_Starfighter_Angle1.png\u0022 rel=\u0022external nofollow\u0022\u003Esabre\u003C/a\u003E, or \u003Ca href=\u0022http://images4.wikia.nocookie.net/__cb20110429212405/halo/es/images/c/c0/Sabre_Concep.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ethis\u003C/a\u003E?\u003C/p\u003E\n"},{"CreatedByName":"Logan.Darklighter","CreatedById":7375,"CreatedDateTime":"2013-12-30T07:09:04Z","Content":"\n\u003Cp\u003ECan\u0027t speak directly for Devo. But I think the idea is that the PX Shuttle Devo\u0027s currently kicking the bugs out of - and the dropship from Aliens that also needs working on - are kinda the thing you\u0027re looking for in terms of what would do similar jobs. \u003C/p\u003E\u003Cp\u003EYou might have (understandably) missed it due to the length of the Wayland thread, but Devo\u0027s previously expressed a lack of interest in \u0022re-inventing the wheel\u0022 when it comes to ships doing very similar jobs. The pelican essentially does the same job as the Colonial Marines dropship. And the dropship is STILL needing a lot of bug-fixing on the basic model and flight dynamics as well as some fixing that\u0027s become necessary to update it after a couple of game updates from Squad have broken what was already done. It\u0027s a complex, twitchy bird that\u0027s made more complex by the fact that you\u0027re trying to get a specific end-result in terms of performance - what you see it do in the movie - out of it when you\u0027re dealing with a (relatively) realistic set of physics in KSP. \u003C/p\u003E\u003Cp\u003E(By comparison, the Space 1999 Eagle was EASY. And it\u0027s STILL taken almost a year to get it right!)\u003C/p\u003E\u003Cp\u003ENot to say it wouldn\u0027t ever be done. After all the work and lessons learned on the various other projects, I wouldn\u0027t be surprised if Devo or someone else eventually took on the task. But I wouldn\u0027t expect it to be anytime soon. Devo\u0027s main project after all the bug fixes and updates of the current stuff is the Serenity from Firefly. And THAT\u0027s going to be interesting in terms of just getting the model right! (All those reflective surfaces!)\u003C/p\u003E\n"},{"CreatedByName":"Devo","CreatedById":22750,"CreatedDateTime":"2013-12-30T21:29:24Z","Content":"\n\u003Cp\u003E^ Yup pretty much what he said \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe only other sci fi ship currently in the works is the Valkyrie from Avatar, other than that no more sci fi ships really, i need to fix what I\u0027ve made and also do some more original ships.\u003C/p\u003E\n"},{"CreatedByName":"Voidryder","CreatedById":57308,"CreatedDateTime":"2013-12-31T04:31:34Z","Content":"\n\u003Cp\u003EOk, tried the new PX-2 cockpit again as Mr. Darklighter tested. Except it was flat on the runway, no gear. And yep, he\u0027s right. No grab, just F board. Could keep moving forward, but no getting stuck in the hull. They did however knocked the ship quite a wallop, got all it all jiggy and then they bounced off to the right side, going rag doll. Sorry Devo, thought it was licked. I\u0027ll just go back to sweeping up.\u003C/p\u003E\n"},{"CreatedByName":"Logan.Darklighter","CreatedById":7375,"CreatedDateTime":"2013-12-31T10:46:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Voidryder\u0022 data-cite=\u0022Voidryder\u0022\u003E\u003Cdiv\u003EOk, tried the new PX-2 cockpit again as Mr. Darklighter tested. Except it was flat on the runway, no gear. And yep, he\u0027s right. No grab, just F board. Could keep moving forward, but no getting stuck in the hull. They did however knocked the ship quite a wallop, got all it all jiggy and then they bounced off to the right side, going rag doll. Sorry Devo, thought it was licked. I\u0027ll just go back to sweeping up.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWere you just testing the cockpit by itself? without the rest of the ship? Cause I was testing it with the whole ship. \u003C/p\u003E\u003Cp\u003EThat just gave me an idea. BRB...\u003C/p\u003E\n"},{"CreatedByName":"Logan.Darklighter","CreatedById":7375,"CreatedDateTime":"2013-12-31T11:45:42Z","Content":"\n\u003Cp\u003EOkay. That\u0027s interesting. The idea you gave me was that maybe the interaction with the hatch might be due to it being close to the back end of the model and thus close to the colliders with whatever might be attached there. But no, it\u0027s just the model itself. I had just the cockpit pod, on the runway. No other parts. And I got the same or similar behavior. The interesting part is that there\u0027s like this \u0022auto-grab\u0022 force that \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Eyanks\u003C/span\u003E the kerbal into the model once the helmet intersects just a small amount. Better than half the time it then spits him out the BACK of the pod at like a 90 degree turn.\u003C/p\u003E\n"},{"CreatedByName":"Logan.Darklighter","CreatedById":7375,"CreatedDateTime":"2013-12-31T13:26:24Z","Content":"\n\u003Cp\u003ENew discovery about the PX Shuttle parts: The PX 2 Carrier Command Bay - that\u0027s the central cargo pod with the Ventral TB2 style lift that\u0027s actually got command pod function and is in the Command pod section. It shares its model with the PX-2 Cargo Bay Mk 3 that\u0027s in \u0022fuel and engines\u0022 section. Well it\u0027s not the same scale as the rest of the parts. It\u0027s significantly bigger. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/VtamO28.png\u0022 alt=\u0022VtamO28.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/mCi95Ag.png\u0022 alt=\u0022mCi95Ag.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHOWEVER. May I ask that instead of resizing that part, that you consider - just consider! - Making duplicates of all the other shuttle parts at the larger scale for a PX-2 \u003Cspan style=\u0022text-decoration:underline;\u0022\u003EMark 5\u003C/span\u003E Super-Sized shuttle? \u003C/p\u003E\u003Cp\u003ECause this, my friend - this has... \u003Cstrong\u003E\u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003Epossibilities\u003C/span\u003E\u003C/em\u003E\u003C/strong\u003E written all over it! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ThoCiHe.png\u0022 alt=\u0022ThoCiHe.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/6aou49c.png\u0022 alt=\u00226aou49c.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/XelT799.png\u0022 alt=\u0022XelT799.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EDevo - if you didn\u0027t \u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003Eplan\u003C/span\u003E\u003C/em\u003E that perfect fit of the Eagle on the platform of that large cargo pod - you \u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003Eshould have\u003C/span\u003E\u003C/em\u003E! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Devo","CreatedById":22750,"CreatedDateTime":"2014-01-01T00:16:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Logan.Darklighter\u0022 data-cite=\u0022Logan.Darklighter\u0022\u003E\u003Cdiv\u003ENew discovery about the PX Shuttle parts: The PX 2 Carrier Command Bay - that\u0027s the central cargo pod with the Ventral TB2 style lift that\u0027s actually got command pod function and is in the Command pod section. It shares its model with the PX-2 Cargo Bay Mk 3 that\u0027s in \u0022fuel and engines\u0022 section. Well it\u0027s not the same scale as the rest of the parts. It\u0027s significantly bigger. \u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/VtamO28.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/VtamO28.png\u003C/a\u003E\u003Ca href=\u0022http://i.imgur.com/mCi95Ag.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/mCi95Ag.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EHOWEVER. May I ask that instead of resizing that part, that you consider - just consider! - Making duplicates of all the other shuttle parts at the larger scale for a PX-2 \u003Cspan style=\u0022text-decoration:underline;\u0022\u003EMark 5\u003C/span\u003E Super-Sized shuttle? \u003C/p\u003E\u003Cp\u003ECause this, my friend - this has... \u003Cstrong\u003E\u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003Epossibilities\u003C/span\u003E\u003C/em\u003E\u003C/strong\u003E written all over it! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/ThoCiHe.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/ThoCiHe.png\u003C/a\u003E\u003Ca href=\u0022http://i.imgur.com/6aou49c.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/6aou49c.png\u003C/a\u003E\u003Ca href=\u0022http://i.imgur.com/XelT799.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/XelT799.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EDevo - if you didn\u0027t \u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003Eplan\u003C/span\u003E\u003C/em\u003E that perfect fit of the Eagle on the platform of that large cargo pod - you \u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003Eshould have\u003C/span\u003E\u003C/em\u003E! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ewow.. and no, I never planned an eagle fit... \u003C/p\u003E\u003Cp\u003EHmm you have got me seriously thinking now.... The only thing I can think of with a rescale is the cockpit will go out of whack or the internals, if you rescale that stuff you get some pretty wierd results - BUT that does not mean I can completely do a new cockpit thats scaled from unity, then just rescale the parts via config, I think that should work.. \u003C/p\u003E\u003Cp\u003EI need to fix that cockpit and the grab thing anyway (and the kerbals sitting too high int he seats) (which is now going to be in a totally different spot) so i\u0027ll see how I go in doing that, its a pretty big job, I might switch between that and serenity every day or so.\u003C/p\u003E\u003Cp\u003ESerenity is going well, that\u0027s all I\u0027m saying for now \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E It is not at the flying stage yet, but I will say that the entire ship has been completed!\u003C/p\u003E\u003Cp\u003ENow, I did say I was going to be picky about this ship. I\u0027m not in a hurry, but at the same time the ship is not reliant on anything other than Infernal Robotics for the rotating engines, which is working for KSP0.23, so I can sort of start the initial testing of it soon. Texturing it is the next step which actually wont be hard, considering the thing is so shiny, so it will be bumped specular chrome for most of it.\u003C/p\u003E\u003Cp\u003ESince the Serenity is so heavily reliant on those two side engines for everything, I spent alot of time modelling them, and then realised that they sucked, only to find a 3D model of a WW2 bomb casing that sort of looked a bit like the ends of the engine pods, and I thought.. **** I can do a bit of a mix up here, so I mixed the bomb casing (which had some cool piping and wiring in low poly on it) with my original attempt, so yeah, the trick part was done, now the hanger bay door that opens like a ramp etc.. and the custom landing legs which I havent started yet but thats no sweat, legs I can do , landing gear with wheels I still suck at.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.devogeninteractive.com/picup/image.php?id=01CB_52C35D18\u0026amp;jpg\u0022 alt=\u0022image.php?id=01CB_52C35D18\u0026amp;jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"sirkut","CreatedById":57229,"CreatedDateTime":"2014-01-01T01:00:47Z","Content":"\n\u003Cp\u003ENice work Devo.\u003C/p\u003E\n"},{"CreatedByName":"Voidryder","CreatedById":57308,"CreatedDateTime":"2014-01-01T01:40:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Logan.Darklighter\u0022 data-cite=\u0022Logan.Darklighter\u0022\u003E\u003Cdiv\u003EOkay. That\u0027s interesting. The idea you gave me was that maybe the interaction with the hatch might be due to it being close to the back end of the model and thus close to the colliders with whatever might be attached there. But no, it\u0027s just the model itself. I had just the cockpit pod, on the runway. No other parts. And I got the same or similar behavior. The interesting part is that there\u0027s like this \u0022auto-grab\u0022 force that \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Eyanks\u003C/span\u003E the kerbal into the model once the helmet intersects just a small amount. Better than half the time it then spits him out the BACK of the pod at like a 90 degree turn.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat you said, but a heck of a lot clearer than how I said it.\u003C/p\u003E\u003Cp\u003EEDIT: If I understood how Kerbals are actually treated in the game (object like a part?), then maybe I could offer some intelligent comment here. But maybe it does have something to do with the colliders? The Kerbals do seemed to be being yanked by a force.\u003C/p\u003E\u003Cp\u003EEDIT2: And yes, good work Devo. Looking forward to Serenity...even though I\u0027m sure I won\u0027t be able to fly it. Just no piloting skills.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-01T01:50:16Z\u0022 title=\u002201/01/2014 01:50  AM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 1, 2014\u003C/time\u003E by Voidryder\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Logan.Darklighter","CreatedById":7375,"CreatedDateTime":"2014-01-01T02:14:32Z","Content":"\n\u003Cp\u003EGood job on the engine pods, there, Devo. Comparing with the source material it\u0027s a close match!\u003C/p\u003E\u003Cp\u003EEDIT: \u003C/p\u003E\u003Cp\u003EOh yeah. Devo? Saw this and thought of you: \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://dailycakeblog.files.wordpress.com/2013/03/lord-grant-me-the-serenity.jpg\u0022 alt=\u0022lord-grant-me-the-serenity.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Devo","CreatedById":22750,"CreatedDateTime":"2014-01-01T03:08:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Logan.Darklighter\u0022 data-cite=\u0022Logan.Darklighter\u0022\u003E\u003Cdiv\u003EGood job on the engine pods, there, Devo. Comparing with the source material it\u0027s a close match!\u003Cp\u003EEDIT: \u003C/p\u003E\u003Cp\u003EOh yeah. Devo? Saw this and thought of you: \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://dailycakeblog.files.wordpress.com/2013/03/lord-grant-me-the-serenity.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://dailycakeblog.files.wordpress.com/2013/03/lord-grant-me-the-serenity.jpg\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E soon soon.. Really, the tough parts are done. I have to admit to pinching the odd part off other models here and there, but thats sorta the feel of Serenity, it\u0027s a bit of a hogwash ship, I also am getting that rear engine to spin, might just be eye candy for the time being, but it will spin.\u003C/p\u003E\u003Cp\u003EIn between packing house to move and doing all sorts of crap to move.. I also am getting the Valkyrie pretty much done.\u003C/p\u003E\u003Cp\u003EI decided not to make landing gear because it was literally stalling the whole project. Instead, I will be using simply re-scaled stock landing gear, it will save me alot of time and effort. There will still be retracting bays for the gear, so when they go in, they go all the way in so there will be a bit more than your average landing stock gear.\u003C/p\u003E\u003Cp\u003ETextures are done (simple as they are) just finishing cockpit, getting engines sorted and the control surfaces for the winglets that are missing from the pictures\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.devogeninteractive.com/picup/image.php?id=BCB4_52C38554\u0026amp;jpg\u0022 alt=\u0022image.php?id=BCB4_52C38554\u0026amp;jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.devogeninteractive.com/picup/image.php?id=FA83_52C38554\u0026amp;jpg\u0022 alt=\u0022image.php?id=FA83_52C38554\u0026amp;jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"KerbCo","CreatedById":99624,"CreatedDateTime":"2014-01-02T19:36:22Z","Content":"\n\u003Cp\u003Eis any of these mods updated for 0.23.0\u003C/p\u003E\n"},{"CreatedByName":"KerbCo","CreatedById":99624,"CreatedDateTime":"2014-01-02T19:44:15Z","Content":"\n\u003Cp\u003Eoh yah i forgot to tell you i am running a Mac 2011 with OS X mavericks and KSP 0.23.0 and i tried your pegasus and the cargo bay w/fuel and all the other things except for the cockpit, the second i layer my cursor over it everything expanded rapidly until it didn\u0027t fit my screen any more.\u003C/p\u003E\u003Cp\u003E KerbCo\u003C/p\u003E\n"},{"CreatedByName":"Devo","CreatedById":22750,"CreatedDateTime":"2014-01-02T20:40:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerbCo\u0022 data-cite=\u0022KerbCo\u0022\u003E\u003Cdiv\u003Eis any of these mods updated for 0.23.0\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIs the Pope a Catholic?\u003C/p\u003E\n"},{"CreatedByName":"Voidryder","CreatedById":57308,"CreatedDateTime":"2014-01-02T21:05:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Devo\u0022 data-cite=\u0022Devo\u0022\u003E\u003Cdiv\u003EIs the Pope a Catholic?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell it certainly helps him get the job if he is. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"wasmic","CreatedById":64885,"CreatedDateTime":"2014-01-02T21:42:42Z","Content":"\n\u003Cp\u003EI like how you do things, Devo. \u0022Nope, the Serenity is not ready yet, but look here, I\u0027ve got a Valkyrie that\u0027s almost done, and while you\u0027re waiting, play around with these RAPIER engines I made. Oh, and also take the forklift, just for good measure.\u0022\u003C/p\u003E\u003Cp\u003EI can feel that you really want us to have fun with the stuff that you make.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EI\u0027m still sad that we haven\u0027t seen anything of the MSI animator, though.\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"Devo","CreatedById":22750,"CreatedDateTime":"2014-01-02T23:34:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022wasmic\u0022 data-cite=\u0022wasmic\u0022\u003E\u003Cdiv\u003EI like how you do things, Devo. \u0022Nope, the Serenity is not ready yet, but look here, I\u0027ve got a Valkyrie that\u0027s almost done, and while you\u0027re waiting, play around with these RAPIER engines I made. Oh, and also take the forklift, just for good measure.\u0022\u003Cp\u003EI can feel that you really want us to have fun with the stuff that you make.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EI\u0027m still sad that we haven\u0027t seen anything of the MSI animator, though.\u003C/span\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESirkut is working out a few things on it, he has been busy with real life stuff, so that sorta takes priority. There are new parts just waiting to come out.. as soon as that plugin is done then i\u0027ll get to work finishing the other 58 odd new parts that have been made. Wasmic, message me your email, ill send you some things to test.\u003C/p\u003E\u003Cp\u003EIt\u0027s funny you mention that about me wanting you guys to have the stuff to play with. Something that really got to me along time ago here was watching a WIP progress of something and waiting sometimes years for it to be completed. I don\u0027t really like waiting until its 200 percent perfect, mainly because I\u0027m not trying to impress Squad (they probably have not seen half the mods that get made by people here as they dont use mods admittedly) i\u0027m not doing it to land a job, I\u0027m just doing it for fun. If I make something that seems useful in any way possible, I will release it, as long as it doesn\u0027t look too shonky. Sure, there might be bugs but at least its something new to try, I don\u0027t make complicated stuff so it doesn\u0027t break your game if I get something too wrong \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EHalf the fun is seeing something from a movie, or some wild contraption that really shouldn\u0027t fly, and making it fly somehow .. sure my engines might be a bit cheaty but i\u0027ve never been one known for my scientific prowess.\u003C/p\u003E\n"}]}