{"TopicId":22888,"ForumId":34,"TopicTitle":"[1.0.5] FASA 5.44","CreatedByName":"frizzank","CreatedById":57210,"CreatedDateTime":"2013-04-19T17:33:17Z","PageNum":139,"Articles":[{"CreatedByName":"Pappystein","CreatedById":85755,"CreatedDateTime":"2014-08-22T04:38:04Z","Content":"\n\u003Cp\u003EFrizzank. Curiosity question. Should the H-1 engine be more efficient than the RL-10? For grins I put them on the Centaur plate and got better efficiency out of them (I did have to enable collision avoidance during construction to pull this off.) I get that the INITIAL RL-10-RD-xx variants were not as efficient as the H-1 (hence the sub out of the J-2 and H-1s for the RL-10s on various Saturn proposals.) But the later RL-10-RD-xxs that were used on Centaur are more efficient than the H-2s (at least I thought so.) \u003C/p\u003E\u003Cp\u003EOr is this something that would only be seen with additional mods like Real Fuels due to the different Fuel fraction mass caused by switching to H2-O2 based fuel?\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-08-22T05:18:04Z","Content":"\n\u003Cp\u003EAll RL-10s ever were about 1.5x as efficient as the H-1 on its best day.\u003C/p\u003E\u003Cp\u003EEven the early prototype RL-10s got ~420-430s vacuum, and later got to 440 or more. H-1 was lucky to hit 290 in vacuum (rated at 289 although the RS-27A derivative did better), and launched at 255.\u003C/p\u003E\n"},{"CreatedByName":"Cdodders","CreatedById":85280,"CreatedDateTime":"2014-08-22T10:49:02Z","Content":"\n\u003Cp\u003EDoes the standard Gemini capsule and SM have enough fuel to lift off from the Mun ÃƒÂ and return to Kerbin?\u003C/p\u003E\n"},{"CreatedByName":"Pappystein","CreatedById":85755,"CreatedDateTime":"2014-08-23T05:54:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cdodders\u0022 data-cite=\u0022Cdodders\u0022\u003E\u003Cdiv\u003EDoes the standard Gemini capsule and SM have enough fuel to lift off from the Mun and return to Kerbin?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWith a lot of maneuver point planning I did a straight run in at Kerbin ONCE with the now titled \u0022Easy\u0022 Gemini pack. I had the \u0022gemini Lander\u0022 stage below it with spearatrons so that when I was less than 50m above Mun surface I kicked it to the side and had just enough time to maintain my typical 3.5m/s landing speed. Using the Vertical Velocity mod was essential to me landing that as it provides accurate VERTICAL speed (rather than angular speed the nav ball has.) \u003C/p\u003E\u003Cp\u003EWith the realistic SRB one I don\u0027t think you can make it unless you have 4 or 6x the RCS propellant and external 3D RCS thrusters (Not the 2D thrusters that are Gemini standard.) I just do not think it has enough Delta/V to pop off the surface, Break munar orbit and do a direct approach of Kerbin. \u003C/p\u003E\u003Cp\u003EGenerally I don\u0027t Use Gemini itself as a lander unless it is a game I am willing to use something like Hyperedit on. I have however landed the whole stack (Capsule \u002B CSM components with the lander legs) on Kerbin. i was using some of BAC9\u0027s Air breaks as well as 5 Parachutes (Main, Drogue on the nose and 3 on the perimeter just below the RCS skirt.) Co-incidentally even though I no longer run B9 Aerospace, the standard Airbrake is a common fixture in my game now (created my own folder for such gems.) If you are putting the Air break on your capsule FLIP it UPSIDE DOWN because otherwise it will point your Capsule NOSE FIRST.... (Ignore this for Winged Gemini/) While I don\u0027t use Deadly Re-entry or similar mods, I DO like my capsule to fly properly. Two on the Gemini Capsule does amazing and since it unlocks before the Drogue chute, I use them (1 pair) as a drogue chute analog for my Gemini capsules.\u003C/p\u003E\n"},{"CreatedByName":"Pappystein","CreatedById":85755,"CreatedDateTime":"2014-08-23T07:37:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NathanKell\u0022 data-cite=\u0022NathanKell\u0022\u003E\u003Cdiv\u003EAll RL-10s ever were about 1.5x as efficient as the H-1 on its best day.\u003Cp\u003EEven the early prototype RL-10s got ~420-430s vacuum, and later got to 440 or more. H-1 was lucky to hit 290 in vacuum (rated at 289 although the RS-27A derivative did better), and launched at 255.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIs that ISP with H2\u002BO2 or with O2\u002BKerosene? After all the fuel energy is a major percentage of the ISP calculation.\u003C/p\u003E\u003Cp\u003EI will try to work up a Engineer balance sheet and a mod maker balance sheet. It won\u0027t be pretty at first but It might be a useful tool.\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-08-23T08:22:01Z","Content":"\n\u003Cp\u003EYou try running a H-1 on LH2, or a RL-10 on kerosene, and see what happens. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EThat said, H-1 is a booster engine with a low area ratio (optimized for low-altitude), running on an open cycle (gas generator, and the exhaust is just dumped; J-2 and F-1 at least exhaust into the nozzle). RL-10 is a vacuum engine with a high area ratio (in fact, it will flame out if you try to run it at sea level, or at least Very Bad Things will happen--flow separation is not fun) running on an expander cycle (much more efficient, only works with LH2 and with \u0026lt;300kN thrust).\u003C/p\u003E\u003Cp\u003EYou\u0027re going to want to treat the H-1 as the Mainsail, basically (with slightly lower Isp than the F-1), and the J-2 more like an LV-Tx with 200s sea level Isp, and the RL-10 as a megapoodle with 0 sea level Isp.\u003C/p\u003E\n"},{"CreatedByName":"frizzank","CreatedById":57210,"CreatedDateTime":"2014-08-25T00:56:51Z","Content":"\n\u003Cp\u003EYea the thrust is way off from realistic, I will play with the values to get a more accurate experience to how they were designed.\u003C/p\u003E\u003Cp\u003EThe RL-10 is suppose to be the 1960\u0027s version and not the more modern variation.\u003C/p\u003E\n"},{"CreatedByName":"m1919","CreatedById":58334,"CreatedDateTime":"2014-08-25T02:12:08Z","Content":"\n\u003Cp\u003EAny chance of adding F-1 engine fairings without the fins? I believe later production Saturn Vs would have deleted these as they might not have been required and were only dead-weight.\u003C/p\u003E\u003Cp\u003EWould also be great for building some of the other planned Saturn variants like the C-3, which had only two and later three F-1s on the first stage.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-25T02:14:53Z\u0022 title=\u002208/25/2014 02:14  AM\u0022 data-short=\u00229 yr\u0022\u003EAugust 25, 2014\u003C/time\u003E by m1919\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Bruce In KC","CreatedById":55768,"CreatedDateTime":"2014-08-25T03:01:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jack Wolfe\u0022 data-cite=\u0022Jack Wolfe\u0022\u003E\u003Cdiv\u003EI\u0027m not sure what I may have done wrong, but obviously I\u0027ve mucked something up to get this phenomena of the pre-deployed pool toys:\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/kPfUnPb.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/kPfUnPb.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI have removed and reinstalled the Apollo CSM files to no avail, so something else must be afoot. Any ideas?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHi Jack, I ran into the same problem. I removed all of the add-ons from the game data folder except for the ones that came with KSP, and FASA. I added the previously removed add-ons in one at a time and restarted the game each time until the problem reappeared. The culprit seems to be the modulemanager 2.2.1.dll file. Now my Skylab Saturn IB crew transfer missions don\u0027t have the floatation collar and righting bags flopping in the wind for the ride uphill.\u003C/p\u003E\u003Cp\u003EBruce in KC\u003C/p\u003E\n"},{"CreatedByName":"KyleofKerbin","CreatedById":96229,"CreatedDateTime":"2014-08-26T01:58:15Z","Content":"\n\u003Cp\u003EHey Frizzank, I would like to ask this:\u003C/p\u003E\u003Cp\u003ECan I use your engine models as a BASE for creating my own? They won\u0027t look like yours and I\u0027ll make different textures, but I want to use them because they are so good and so that I can learn how to code KSP engines right! Let me know soon. I\u0027ve got Blender ready! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"j-tk","CreatedById":29598,"CreatedDateTime":"2014-08-27T01:33:00Z","Content":"\n\u003Cp\u003EI\u0027ve seen this answer before and can\u0027t find it now (of course).\u003C/p\u003E\u003Cp\u003EWith the LEM, once you touch down, I know you have to IVA to get out, otherwise it states hatch blocked-\u003C/p\u003E\u003Cp\u003Eanyone know exactly where the lever is?\u003C/p\u003E\n"},{"CreatedByName":"raidernick","CreatedById":97711,"CreatedDateTime":"2014-08-27T01:54:22Z","Content":"\n\u003Cp\u003EThere is a yellow lever on the door as well as a black circular knob on each side above the door. You can open it both ways.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-27T02:15:29Z\u0022 title=\u002208/27/2014 02:15  AM\u0022 data-short=\u00229 yr\u0022\u003EAugust 27, 2014\u003C/time\u003E by raidernick\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"j-tk","CreatedById":29598,"CreatedDateTime":"2014-08-27T01:59:14Z","Content":"\n\u003Cp\u003EThanks Raid!\u003C/p\u003E\n"},{"CreatedByName":"RocketBlam","CreatedById":103420,"CreatedDateTime":"2014-09-08T00:09:03Z","Content":"\n\u003Cp\u003EI\u0027m trying to build the Saturn/Apollo rocket and I can\u0027t find the \u0022LEM decoupler\u0022. Where is it?\u003C/p\u003E\u003Cp\u003EAnd is there a .craft file I can download where it is assembled?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-08T00:24:22Z\u0022 title=\u002209/08/2014 12:24  AM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 8, 2014\u003C/time\u003E by RocketBlam\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sp1989","CreatedById":105359,"CreatedDateTime":"2014-09-08T01:29:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RocketBlam\u0022 data-cite=\u0022RocketBlam\u0022\u003E\u003Cdiv\u003EI\u0027m trying to build the Saturn/Apollo rocket and I can\u0027t find the \u0022LEM decoupler\u0022. Where is it?\u003Cp\u003EAnd is there a .craft file I can download where it is assembled?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere should be a bunch of craft file in the download.\u003C/p\u003E\n"},{"CreatedByName":"RocketBlam","CreatedById":103420,"CreatedDateTime":"2014-09-08T06:57:28Z","Content":"\n\u003Cp\u003EI think I figured out how to build this. You place the \u0022LEM Stage Separator\u0022 first (what the instructions call the \u0022LEM decoupler\u0022 - the reason I couldn\u0027t find it), and build the LEM starting with the LEM Docking Cone, and build it from there. So you place the LEM Docking Cone, then the landing module, then the ascent engine, then the decoupler, etc. This is the only way I\u0027ve found to place the LEM in the stage separator and have it pointed the right way.\u003C/p\u003E\u003Cp\u003EThe problem with this is that the LEM Docking Cone doesn\u0027t seem to work any more when I do this. I launch it, then separate the CSM, turn it around and attempt to dock, and it just won\u0027t connect. It\u0027s like the docking cone doesn\u0027t remember that it is a docking device.\u003C/p\u003E\n"},{"CreatedByName":"RocketBlam","CreatedById":103420,"CreatedDateTime":"2014-09-08T12:26:18Z","Content":"\n\u003Cp\u003EI think I know why this is now. Since you place the docking nose cone first, it is \u0022attached\u0022 to something, so the game assumes it is already docked.\u003C/p\u003E\n"},{"CreatedByName":"frizzank","CreatedById":57210,"CreatedDateTime":"2014-09-08T15:36:26Z","Content":"\n\u003Cp\u003EIts a bit easier if you build the lem as a sub assembly and then place the whole thing on top of the decoupler in the bay under the CM. just make sure its not attached to the engine.\u003C/p\u003E\n"},{"CreatedByName":"Ksynix","CreatedById":121266,"CreatedDateTime":"2014-09-11T02:51:40Z","Content":"\n\u003Cp\u003EIs the Saturn V going to be useable with Realism Overhaul in the future? At this point I am unable to load the craft when I have RO installed, and when I try to build it myself some dimension aren\u0027t correct (clipping fairings for example).\u003C/p\u003E\n"},{"CreatedByName":"GoldForest","CreatedById":77770,"CreatedDateTime":"2014-09-11T03:22:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ksynix\u0022 data-cite=\u0022Ksynix\u0022\u003E\u003Cdiv\u003EIs the Saturn V going to be useable with Realism Overhaul in the future? At this point I am unable to load the craft when I have RO installed, and when I try to build it myself some dimension aren\u0027t correct (clipping fairings for example).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFrizzank doesn\u0027t have a Realism Overhaul file for his crafts/parts(that I know of), but you can search the forums. Dozens of other modders have made configs for pretty much every mod for Realism Overhaul. You just have to look. You the search box while in the addon release page.\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-09-11T03:25:43Z","Content":"\n\u003Cp\u003EIf you\u0027re going to talk about RO, \u003Cstrong\u003Eplease\u003C/strong\u003E go to the RO topic. (And yes, FASA is well-enough supported by RO. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E )\u003C/p\u003E\n"},{"CreatedByName":"frizzank","CreatedById":57210,"CreatedDateTime":"2014-09-15T20:20:29Z","Content":"\n\u003Cp\u003EDeploy-able rovers for your mun missions.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/86343-Portable-Rover-Components-New-project-from-ASET-%28up-29-07-14%29\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/86343-Portable-Rover-Components-New-project-from-ASET-%28up-29-07-14%29\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"sp1989","CreatedById":105359,"CreatedDateTime":"2014-09-16T22:13:50Z","Content":"\n\u003Cp\u003ECould you do pass on the TAC support for the capsules. Only 9 minutes of oxygen in the Gemini Capsule. Also I think there is a real chute problem or atleast the most recent version of real chute. In RO the chute start deployed and non RSS and RO the airbags are deployed. I made a big mistake and deleted the previous version. So if anyone can be so kind to post an older version of RC I would appreciate it. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/AsrSvTC.png\u0022 alt=\u0022AsrSvTC.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-09-16T23:32:34Z","Content":"\n\u003Cp\u003EPlease don\u0027t report RO issues here. If you checked the RO thread, where they belong, you\u0027d see it\u0027s a known issue in RealChutes, and RedAV8R is working on an RO-side fix until stupid_chris has time to fix the RealChutes patch.\u003C/p\u003E\u003Cp\u003EThe TACLS change is because in v0.9pre and v0.10 (current released version) TACLS switched to 1 unit = 1 liter, which means any parts offering TACLS compatibility will need to radically revise their resource complements.\u003C/p\u003E\n"},{"CreatedByName":"sp1989","CreatedById":105359,"CreatedDateTime":"2014-09-17T00:05:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NathanKell\u0022 data-cite=\u0022NathanKell\u0022\u003E\u003Cdiv\u003EPlease don\u0027t report RO issues here. If you checked the RO thread, where they belong, you\u0027d see it\u0027s a known issue in RealChutes, and RedAV8R is working on an RO-side fix until stupid_chris has time to fix the RealChutes patch.\u003Cp\u003EThe TACLS change is because in v0.9pre and v0.10 (current released version) TACLS switched to 1 unit = 1 liter, which means any parts offering TACLS compatibility will need to radically revise their resource complements.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI was just mentioning it. I was the one who posted it in the RO thread. The deployed landing bags is an issue with stock KSP. Again I just mentioned the deployed parachutes. Also I can\u0027t imagine it being a problem mentioning it here that the parachutes are not working in RSS and RO.\u003C/p\u003E\n"}]}