{"TopicId":23555,"ForumId":34,"TopicTitle":"[0.21.1] KAS v0.4.3 - Struts, pipes, part storage, containers, merged winches \u0026amp; more","CreatedByName":"KospY","CreatedById":33868,"CreatedDateTime":"2013-04-22T19:15:03Z","PageNum":17,"Articles":[{"CreatedByName":"Railgunner2160","CreatedById":67181,"CreatedDateTime":"2013-06-06T21:16:53Z","Content":"\n\u003Cp\u003EThat would be alt- Right click for default keybinds, just so there\u0027s no confusion.....\u003C/p\u003E\n"},{"CreatedByName":"hollyghost","CreatedById":30066,"CreatedDateTime":"2013-06-07T08:58:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fyrem\u0022 data-cite=\u0022Fyrem\u0022\u003E\u003Cdiv\u003Eby \u0027normal\u0027 we mean, click on first part, then ALT-click on the second part.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ethx a lot! It works \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"John Nowak","CreatedById":67890,"CreatedDateTime":"2013-06-07T21:21:09Z","Content":"\n\u003Cp\u003EMy apologies if this came up before, but I can\u0027t seem to find it. \u003C/p\u003E\u003Cp\u003EI\u0027ve got the keys used to EVA a Kerbal mapped to match the translation keys for a spacecraft: IJKL and HN. How can I change the key mapping for the winch system so they don\u0027t conflict?\u003C/p\u003E\u003Cp\u003EThanks in advance!\u003C/p\u003E\n"},{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2013-06-08T19:28:34Z","Content":"\n\u003Cp\u003EThis mod is just fantastic, KSP wouldn\u0027t be complete without it!!\u003C/p\u003E\u003Cp\u003EI have only one issue with it, and I\u0027m sure its due to how I\u0027m using it, but I wonder if others have had this and know of a solution. \u003C/p\u003E\u003Cp\u003EBasically I have a small rover that has a KAS winch with a magnet mounted on the end of a dammed robotic movable arm. I\u0027m using this rover to lift modules off a lander and position them. Each module has a hex-strut part which I connect the magnet to, but unless the magnet is brought up to the hex strut at a specific position it causes the rover be violently rotated either 90 or 180 degrees (sometimes breaking the rover or the module). If I line the magnet up perfectly with the hex strut it usually flips the rover upside down, if I move the magnet so its slightly off-center to the hex-strut then it generally works perfectly, but I\u0027ve not found a reliable position that works on each module. I guess when you use a magnet that is extended on the rope it doesn\u0027t matter as it can rotate without rotating the entire connected craft/rover, but that won\u0027t really work in this case.\u003C/p\u003E\u003Cp\u003EIs there some notion of \u0022top\u0022 on the magnet, that should be aligned with the \u0022top\u0022 of whatever it\u0027s being connected to?\u003C/p\u003E\n"},{"CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2013-06-08T19:39:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022katateochi\u0022 data-cite=\u0022katateochi\u0022\u003E\u003Cdiv\u003EThis mod is just fantastic, KSP wouldn\u0027t be complete without it!!\u003Cp\u003EI have only one issue with it, and I\u0027m sure its due to how I\u0027m using it, but I wonder if others have had this and know of a solution. \u003C/p\u003E\u003Cp\u003EBasically I have a small rover that has a KAS winch with a magnet mounted on the end of a dammed robotic movable arm. I\u0027m using this rover to lift modules off a lander and position them. Each module has a hex-strut part which I connect the magnet to, but unless the magnet is brought up to the hex strut at a specific position it causes the rover be violently rotated either 90 or 180 degrees (sometimes breaking the rover or the module). If I line the magnet up perfectly with the hex strut it usually flips the rover upside down, if I move the magnet so its slightly off-center to the hex-strut then it generally works perfectly, but I\u0027ve not found a reliable position that works on each module. I guess when you use a magnet that is extended on the rope it doesn\u0027t matter as it can rotate without rotating the entire connected craft/rover, but that won\u0027t really work in this case.\u003C/p\u003E\u003Cp\u003EIs there some notion of \u0022top\u0022 on the magnet, that should be aligned with the \u0022top\u0022 of whatever it\u0027s being connected to?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIve never had this happen when using a magnet. Honestly though, those hex struts are of the devil, pure evil sir! They have been the culprit in many other issues....Id steer clear of them. (FYI don\u0027t ever attach a docking port to those things.....)\u003C/p\u003E\u003Cp\u003EIf possible you should rebuild your landing vehicles to work a different way, use a connector port and the plug instead of a magnet maybe, just plug it undocked. Maybe just a little structural plate instead of hex strut if you need to use magnet.....\u003C/p\u003E\n"},{"CreatedByName":"sumghai","CreatedById":66272,"CreatedDateTime":"2013-06-08T23:07:18Z","Content":"\n\u003Cp\u003EFantastic stuff KospY - I had hours and hours of fun making cranes and tethered microsats \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EJust something I was wondering, though - I configured certain parts (such as trusses) to grabbable because I wanted to emulate realistic truss construction in space (rather than flying it all up in a ridiculously large rocket). Although your grab and attach system does work, I\u0027m a bit concerned about the lack of accuracy in my placement even with the debug rotation options open.\u003C/p\u003E\u003Cp\u003EWould it be possible to extend the generic part-grabbing feature to have the option of using the same attachment node system as in VAB / SPH? No doubt it would make EVA construction a whole lot easier.\u003C/p\u003E\n"},{"CreatedByName":"Sathurn","CreatedById":58040,"CreatedDateTime":"2013-06-09T02:44:17Z","Content":"\n\u003Cp\u003EFirst I would like to say awesome mod.\u003C/p\u003E\u003Cp\u003EI was thinking about how to build a base, and I came up with what I think is a great idea. This idea would fit perfectly with this mod. EVA connected docking ports. So if your base is on unlevel ground, put a \u0022unlevel\u0022 docking port on it. Now docking ports are too big for Kerbals to move. So here is what I was thinking, have a radial connector DOCKING port (dismountable) and a Dockingport that \u0022plugs\u0022 into it.\u003C/p\u003E\u003Cp\u003EYour Kerbal would mount the small docking port where you want the docking port to go. Then a crane would raise the larger docking port up to the connector. Then presto you have a \u0022standard docking port\u0022 ready to receive the next part of the base.\u003C/p\u003E\u003Cp\u003EI hope you like the idea, and can incorporated into the mod. As I feel this is a natural fit. Thankyou for reading either way.\u003C/p\u003E\n"},{"CreatedByName":"MR4Y","CreatedById":66897,"CreatedDateTime":"2013-06-09T02:54:25Z","Content":"\n\u003Cp\u003EIs there an option to lock the cable to a lenght?\u003C/p\u003E\n"},{"CreatedByName":"MDBenson","CreatedById":65560,"CreatedDateTime":"2013-06-09T08:49:05Z","Content":"\n\u003Cp\u003EQuick, an slightly stupid, question?\u003C/p\u003E\u003Cp\u003EWhat\u0027s the farthest you can run a cable using KAS and will it drop slack on the ground and stay there if I unroll it then walk back towards the reel like a real winch? Also, is there a way to attach a winch to an already in place structure?\u003C/p\u003E\u003Cp\u003EThe reason I ask is a concept NASA developed for Martian exploration in the Constellation program called for a fission power plant (a grown up version of what\u0027s powering MSL Curiostiy, I suspect) and a solar power array to be delivered on the cargo flight then a cable to run 1.5km or so back to the colony, presumably to save the astronauts in the event of a \u0027malfunction\u0027 or radiation leak from the nuclear device. I know KAS can transfer resources, but I don\u0027t want rubber-band tight cables everywhere putting tension on all my buildings and threatening to kill passing Kerbals on rovers \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"MR4Y","CreatedById":66897,"CreatedDateTime":"2013-06-09T08:58:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MDBenson\u0022 data-cite=\u0022MDBenson\u0022\u003E\u003Cdiv\u003EQuick, an slightly stupid, question?\u003Cp\u003EWhat\u0027s the farthest you can run a cable using KAS and will it drop slack on the ground and stay there if I unroll it then walk back towards the reel like a real winch? Also, is there a way to attach a winch to an already in place structure?\u003C/p\u003E\u003Cp\u003EThe reason I ask is a concept NASA developed for Martian exploration in the Constellation program called for a fission power plant (a grown up version of what\u0027s powering MSL Curiostiy, I suspect) and a solar power array to be delivered on the cargo flight then a cable to run 1.5km or so back to the colony, presumably to save the astronauts in the event of a \u0027malfunction\u0027 or radiation leak from the nuclear device. I know KAS can transfer resources, but I don\u0027t want rubber-band tight cables everywhere putting tension on all my buildings and threatening to kill passing Kerbals on rovers \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI believe the limit was 50 m?\u003C/p\u003E\n"},{"CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2013-06-09T12:18:22Z","Content":"\n\u003Cp\u003EDefault cable limit is 50meters, but it can be changed, thought it seems to create issues if you try and make it to long. Did some light testing and 100meter cables seems to work just fine. And a cable can be made to have slack in it, don\u0027t have to be tight all the time.\u003C/p\u003E\n"},{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2013-06-09T12:36:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KhaosCorp\u0022 data-cite=\u0022KhaosCorp\u0022\u003E\u003Cdiv\u003EIve never had this happen when using a magnet. Honestly though, those hex struts are of the devil, pure evil sir! They have been the culprit in many other issues....Id steer clear of them. (FYI don\u0027t ever attach a docking port to those things.....)\u003Cp\u003EIf possible you should rebuild your landing vehicles to work a different way, use a connector port and the plug instead of a magnet maybe, just plug it undocked. Maybe just a little structural plate instead of hex strut if you need to use magnet.....\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ethanks KhaosCorp, yeah I\u0027ve seen those hex struts (and the little cube ones) do strange things before, and I don\u0027t generally trust them! But I\u0027d tested this system using other parts and without any specific connection part on the module being connected to and I got the same issue. At one point I\u0027d tried not using the KAS system at all and just having clampotron jr ports on the module and on the rovers DR arm, but that caused the arm to get miss aligned on dock and become immovable after undocking so I\u0027d given up with the docking port idea. Unfortunately I can\u0027t do what you suggested, which I think would work, but this part of the mission is unmanned and I think that can only be done with EVA (right?). \u003C/p\u003E\u003Cp\u003EI have found a solution which works perfectly now and is a combination of KAS and DR. Basically DR has issues when the docking port is on the end of a movable arm, so to get round this I have the KAS winch on the end of the DR arm, the winch has a stack connector attached to it and a docking port connected to that, the modules to be moved have docking ports. Before it can be used I have to first release the winch a little, then wind it back in which then allows me to change the connected mode to undocked. That is the key, then I have a docking port which is not part of the rover with the DR arm but is moved by it so docking doesn\u0027t mess up the DR parts. That can then reliably connect to the modules without problems. I just have to switch to the module once its in position to undock it.\u003C/p\u003E\n"},{"CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2013-06-09T12:44:11Z","Content":"\n\u003Cp\u003EYou are correct sir, the port and plug method would require a green dude on EVA. My bad for assuming it was a manned mission. Good to hear you got it worked out.\u003C/p\u003E\u003Cp\u003EOn a side note, just a little FYI for yall....DO NOT try and use KAS to make a \u0027pipeline\u0027 that goes past unload distance...bad things will happen.....very, very bad...\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-06-09T13:54:05Z","Content":"\n\u003Cp\u003ELOL. Who would need a cable over 2 kilometers long?\u003C/p\u003E\n"},{"CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2013-06-09T14:00:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Scotius\u0022 data-cite=\u0022Scotius\u0022\u003E\u003Cdiv\u003ELOL. Who would need a cable over 2 kilometers long?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat, but also doing several cables....the \u0027pipeline\u0027 test I did was only using 100meter cables....hooked the last one up and the whole thing exploded though Kerbin (as in it fell though the planet) and ended up on escape orbit from sun...bad things will happen, green dudes will die\u003C/p\u003E\n"},{"CreatedByName":"MDBenson","CreatedById":65560,"CreatedDateTime":"2013-06-09T15:32:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Scotius\u0022 data-cite=\u0022Scotius\u0022\u003E\u003Cdiv\u003ELOL. Who would need a cable over 2 kilometers long?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENASA, apparently \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E I thought of using KAS because it allows resource transfer along the cable so I could connect power stations to the habitat modules. I guess I will just have to land my nuclear reactor and move it on wheels to where I can plug it into the hab module.\u003C/p\u003E\u003Cp\u003EAnother question: can you stick attachment points to objects using a robot arm to pick them up and then stick them on, or do I have to use an EVA?\u003C/p\u003E\n"},{"CreatedByName":"entaran","CreatedById":67823,"CreatedDateTime":"2013-06-09T15:43:40Z","Content":"\n\u003Cp\u003EYou have to EVA\u003C/p\u003E\n"},{"CreatedByName":"ahappydude","CreatedById":458,"CreatedDateTime":"2013-06-09T21:11:33Z","Content":"\n\u003Cp\u003EHmm the config menu doesnt want to show up, i got the // lines removed but still no menu\u003C/p\u003E\n"},{"CreatedByName":"MR4Y","CreatedById":66897,"CreatedDateTime":"2013-06-09T21:25:35Z","Content":"\n\u003Cp\u003EPerhaps a third option would be added to lock the cable after it has been extended?\u003C/p\u003E\n"},{"CreatedByName":"IRkorpus","CreatedById":70040,"CreatedDateTime":"2013-06-10T00:19:31Z","Content":"\n\u003Cp\u003Ehi guys. im new to KSP and game mods. i was wondering if someone could help me with the sound files? ive tried different sound folders but i cant find the right one (im new to PC\u0027s). im playing on steam. this is a great game \u0026amp; mod that will be even fun if i can get the sound folder in the right spot. i would be grateful for any help\u003C/p\u003E\n"},{"CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2013-06-10T01:01:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022IRkorpus\u0022 data-cite=\u0022IRkorpus\u0022\u003E\u003Cdiv\u003Ehi guys. im new to KSP and game mods. i was wondering if someone could help me with the sound files? ive tried different sound folders but i cant find the right one (im new to PC\u0027s). im playing on steam. this is a great game \u0026amp; mod that will be even fun if i can get the sound folder in the right spot. i would be grateful for any help\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eshouldn\u0027t need to mess with that bud, just drop KAS folder from download and put it in KSP/GameData folder\u003C/p\u003E\n"},{"CreatedByName":"mentality9","CreatedById":69197,"CreatedDateTime":"2013-06-10T02:31:38Z","Content":"\n\u003Cp\u003EHi everyone, I\u0027m having problems using this mod properly and I need some help. When I am in orbit and I do an EVA to try and grab the connector, I am unable to. I tested it out on the surface of Kerbin and it worked fine but once I get into orbit it no longer lets me grab the connector. There is an option for unplug and grab but doing that does nothing and there isn\u0027t just a grab option present. What am I doing wrong?\u003C/p\u003E\n"},{"CreatedByName":"Tiron","CreatedById":51836,"CreatedDateTime":"2013-06-11T00:09:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mentality9\u0022 data-cite=\u0022mentality9\u0022\u003E\u003Cdiv\u003EHi everyone, I\u0027m having problems using this mod properly and I need some help. When I am in orbit and I do an EVA to try and grab the connector, I am unable to. I tested it out on the surface of Kerbin and it worked fine but once I get into orbit it no longer lets me grab the connector. There is an option for unplug and grab but doing that does nothing and there isn\u0027t just a grab option present. What am I doing wrong?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHmm, there shouldn\u0027t be an unplug option unless it thinks it\u0027s already plugged into something (I\u0027ve seen it happen, mostly when it HAD been plugged into something, but usually only after saving the craft and reloading it...but it only caused problems with the ports for me, fixed by \u0027unplugging\u0027.) Have you tried right clicking on the winch instead of the connector? It gets a little funny about which you have to click sometimes...\u003C/p\u003E\u003Cp\u003EAlso, I\u0027ve noticed a bit of an issue myself: It\u0027s impossible to make a connection between either of the radial connector ports and a connector while in the hangar, in either direction. It works with the stackable port but not the radial ports. Not sure why, probably a cfg issue...I\u0027ll look into it in a sec.\u003C/p\u003E\n"},{"CreatedByName":"InfiniteDice","CreatedById":57451,"CreatedDateTime":"2013-06-11T02:50:45Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i39.tinypic.com/2z3oyev.png\u0022 alt=\u00222z3oyev.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI knew the new KAS would come in handy...\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2013-06-11T06:10:33Z","Content":"\n\u003Cp\u003EWhat am I doing wrong here? I cannot get any winch to work, at all. It will invariably declare that I\u0027ve installed the attachment part upside-down, no matter how I install it. After I tell it to turn on, it changes to \u0022ERROR: Pre-attached\u0022, which sounds like a pretty nonsense error to me! Can someone explain to me what I\u0027m missing here?\u003C/p\u003E\u003Cp\u003EEDIT: So it turns out the part was upside-down. The direction of the connector part looks \u0022wrong\u0022 when it\u0027s on right!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-11T06:15:05Z\u0022 title=\u002206/11/2013 06:15  AM\u0022 data-short=\u002211 yr\u0022\u003EJune 11, 2013\u003C/time\u003E by SkyRender\u003C/strong\u003E\n\u003C/span\u003E\n"}]}