{"TopicId":28245,"ForumId":34,"TopicTitle":"[0.23.5] Spherical and Toroidal Tank Pack (Updated 05/02/14) (New download link)","CreatedByName":"Talisar","CreatedById":62035,"CreatedDateTime":"2013-05-23T00:22:39Z","PageNum":39,"Articles":[{"CreatedByName":"Tallinu","CreatedById":57810,"CreatedDateTime":"2014-04-19T11:11:49Z","Content":"\n\u003Cp\u003EAlright, like I suspected, you definitely have a better handle on the math involved than I do. Interesting information, certainly.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022taniwha\u0022 data-cite=\u0022taniwha\u0022\u003E\u003Cdiv\u003Ethe mass of a tank is not proportional to its surface area, but rather to its volume. As you increase the volume of the tank, you must also increase the thickness of its walls in order to contain the same internal pressure.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat certainly makes more sense in relation to the stock tank volumes and masses - like the same-length tanks of different diameter having the same change to mass and volume, instead of what I had expected.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022taniwha\u0022 data-cite=\u0022taniwha\u0022\u003E\u003Cdiv\u003Ecylinder width (torus minor radius) certainly does, but a quick glance at the equations indicates that wall thickness being proportional to just the minor radius would keep the tank mass proportional to the tank volume.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFrom Wikipedia (\u003Ca href=\u0022https://en.wikipedia.org/wiki/Pressure_vessel):\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Pressure_vessel):\u003C/a\u003E \u0022No matter what shape it takes, the minimum mass of a pressure vessel scales with the pressure and volume it contains and is inversely proportional to the strength to weight ratio of the construction material (minimum mass decreases as strength increases[5]).\u0022 It sounds like the length doesn\u0027t matter, maybe? There\u0027s also a bunch of math I don\u0027t have the context to compare between for various shapes. But KSP certainly treats it like cylinder height doesn\u0027t affect the mass ratio, so it seems reasonable to follow that rule in this case even if it doesn\u0027t always hold fast in reality.\u003C/p\u003E\u003Cp\u003ESo, comparing the \u0022large\u0022 torus (the one with a 1m minor diameter or 0.5m minor radius) with the stock 1.25m diameter tanks (radius of .625m), and assuming that they\u0027re built with similar materials and methods, wouldn\u0027t this actually imply that the toroidal tank\u0027s mass ratio would be similar to that of the stock tank? And that a toroidal tank with a minor radius of 0.625m would definitely have exactly the same mass ratio as the stock 1.25m diameter tanks?\u003C/p\u003E\u003Cp\u003EAs an aside, with the values I plugged into my config files giving them the stock mass ratios, I was able to make this beautiful (if undoubtedly a bit fuel-inefficient) \u0027lander\u0027 which turned out to be capable not only of landing but also of SSTO takeoff from Kerbin.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/IFofIXi.png\u0022 alt=\u0022IFofIXi.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/egcbS3A.png\u0022 alt=\u0022egcbS3A.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/wnxaJkT.png\u0022 alt=\u0022wnxaJkT.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, Talisar, Taniwha, this is one reason I want tori with larger minor diameters. A single XL variant with capacity similar to the two of these would cut out the KW pancake tank in the middle as well as looking better and wasting less space between the 3.75m engine and the inner edge of the toroidal tank. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2014-04-19T12:46:05Z","Content":"\n\u003Cp\u003EWell, since I included the the struts in both the mass and the volume, larger volume but smaller major radius toroids would probably make for slightly higher efficiency.\u003C/p\u003E\u003Cp\u003EHere are the posts I did for \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/30673?p=902033\u0026amp;viewfull=1#post902033\u0022 rel=\u0022external nofollow\u0022\u003Eskin thickness\u003C/a\u003E and the actual \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/30673?p=903556\u0026amp;viewfull=1#post903556\u0022 rel=\u0022external nofollow\u0022\u003Etank masses\u003C/a\u003E.\u003C/p\u003E\n"},{"CreatedByName":"Tallinu","CreatedById":57810,"CreatedDateTime":"2014-04-19T13:16:41Z","Content":"\n\u003Cp\u003EThanks. 4.128 eh? So, slightly under 1/4 dead weight compared to 1/9 stock. \u0022Not as bad as 1/3 dead weight\u0022 is, unfortunately, not a stellar review (no offense). I\u0027ll just keep using the stock mass ratios for now, so that I can actually effectively employ these parts in functional ships and not just \u0022concept craft\u0022 aka futuristic art projects. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd out of curiosity, RE: \u0022Also, it turns out that the jumbo-64 is about right at 4t assuming a skin thickness of 9mm and being made of iron (and a few other not too unreasonable assumptions).\u0022 Does this hold true for the 1.25m tanks as well, or the smaller 2.5m tanks, since they all have the same mass ratio?\u003C/p\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2014-04-19T13:34:30Z","Content":"\n\u003Cp\u003EAny shorter tanks in the same series should have lower mass ratios, but the FL-T800 \u003Cem\u003Eis\u003C/em\u003E a scaled version of the Jumbo-64 (1/2 scale, 1/8 mass/volume), so it is right.\u003C/p\u003E\u003Cp\u003EThose other assumptions are mainly in reference to the tank\u0027s internal structure (hemispherical ends on the internal tanks).\u003C/p\u003E\u003Cp\u003ETitanium alloy should get you pretty close to the same mass ratio, so I can\u0027t say you\u0027re cheating, but do keep in mind that I was aiming at keeping things consistent.\u003C/p\u003E\n"},{"CreatedByName":"Tallinu","CreatedById":57810,"CreatedDateTime":"2014-04-19T14:04:28Z","Content":"\n\u003Cp\u003EThe way I see it, choosing to use a mod part with such a poor mass ratio is about the same as shooting yourself in the foot. The same effect (having extra fuel mounted out around the center) could be achieved using purely stock parts without resulting in nearly that much dead weight - just radially attach three Rockomax X200-32 tanks and slap on fuel pipes as needed. You could even hook them up as drop tanks for a measly 0.05 ton decoupler apiece. Presto, similar fuel to an XL torus and no excess dead weight.\u003C/p\u003E\u003Cp\u003EBut that\u0027s ugly.\u003C/p\u003E\u003Cp\u003EThese tanks look much nicer, as well as being an interesting change of pace, but I don\u0027t want to be forced to severely nerf my craft performance-wise just for aesthetic purposes.\u003C/p\u003E\u003Cp\u003ESo, if you say it would require better materials than what the stock tanks are made of to construct them... then let there be titanium alloy. Honestly, if the \u0022realistic\u0022 mass ratio wasn\u0027t *quite* so bad in comparison to stock tanks, like around 7:1, I wouldn\u0027t bother messing with it. In fact I might set mine somewhere around there instead. Just because \u0022these particular tank models\u0022 (which are admittedly not an expert\u0027s work, even if I do like how they look) have extraneous stuff like bicycle rims doesn\u0027t mean a more realistic design would. It\u0027s just pixels. So if it\u0027s theoretically possible to design a toroidal tank with a better mass ratio, then why not fiddle with it to make it so?\u003C/p\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2014-04-19T15:01:17Z","Content":"\n\u003Cp\u003EYou know, I just noticed a flaw in my calculations. I used 9mm walls on a 0.5m radius tank. That 9mm is from the 1.25m radius Jumbo-64. A quick pass through python (my calculator) indicates the mass ratio should be close to 8.8 (actually higher because I didn\u0027t adjust the capacity by the reduced wall thickness).\u003C/p\u003E\u003Cp\u003EI now need to do another pass through blender to get accurate volumes :/. But not tonight: it\u0027s nearly midnight and I\u0027m tired.\u003C/p\u003E\u003Cp\u003EMore simple calcs in python indicate 9.01...\u003C/p\u003E\u003Cp\u003E\u0026gt;\u0026gt;\u0026gt; (14.8375\u002B0.6082*0.6)/(0.6082*7.8*0.4)\u003C/p\u003E\u003Cp\u003E8.011460889214918\u003C/p\u003E\u003Cp\u003E0.4 is from 0.5/1.25 and 0.6 from 1-0.4. Other numbers from TO-L-1 in the second link.\u003C/p\u003E\u003Cp\u003EBTW, I am not admitting defeat, but claiming victory... over the problem itself \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E. It bugged me that the ratio was so bad when everything else I had done showed it shouldn\u0027t be, yet the math showed it was. The math was right, just the tanks were seriously over-engineered. Built like tanks, I guess.\u003C/p\u003E\u003Cp\u003E[edit]add 1 to the above ratio to get the mass ratio.\u003C/p\u003E\n"},{"CreatedByName":"Tallinu","CreatedById":57810,"CreatedDateTime":"2014-04-19T15:09:02Z","Content":"\n\u003Cp\u003EHah, I guess this whole crazy discussion had some unexpected benefits then!\u003C/p\u003E\u003Cp\u003ESleep well in your silly timezone where it\u0027s midnight instead of morning, and congrats on catching the problem. I look forward to seeing the revised stats.\u003C/p\u003E\n"},{"CreatedByName":"AntiMatter001","CreatedById":100129,"CreatedDateTime":"2014-04-19T16:56:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Talisar\u0022 data-cite=\u0022Talisar\u0022\u003E\u003Cdiv\u003EI personally love MFT, but if you don\u0027t have it installed the tanks in this mod will default to containing only Liquidfuel/Oxidizer. You just won\u0027t be able to switch out the contents unless you change the config manually.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eoh... but will there be rcs tanks or will i have to re-config them into life? (like copying the .cfg then renaming resources and such to get what i want)\u003C/p\u003E\n"},{"CreatedByName":"Talisar","CreatedById":62035,"CreatedDateTime":"2014-04-20T12:29:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AntiMatter001\u0022 data-cite=\u0022AntiMatter001\u0022\u003E\u003Cdiv\u003Eoh... but will there be rcs tanks or will i have to re-config them into life? (like copying the .cfg then renaming resources and such to get what i want)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027ll have to manually copy and configure a separate tank config file to make RCS versions if you don\u0027t use MFT.\u003C/p\u003E\n"},{"CreatedByName":"JTG","CreatedById":106203,"CreatedDateTime":"2014-04-21T07:28:34Z","Content":"\n\u003Cp\u003EToroidal and sphere tanks alike look nice on stations and provide a handsome amount of storage. Nice idea!\u003C/p\u003E\n"},{"CreatedByName":"DivisionByZero","CreatedById":62591,"CreatedDateTime":"2014-04-22T02:16:57Z","Content":"\n\u003Cp\u003EI just want to double check something:\u003C/p\u003E\u003Cp\u003EThis mod includes \u0022storage tanks\u0022 in the utility section of the VAB. However, I can\u0027t seem to do anything with them except change a texture. Is it the case that I need modular fuel tanks mod to change those tanks to hold whatever it is I need?\u003C/p\u003E\u003Cp\u003EAlso, is this able to handle new resources from other mods? I\u0027m thinking specifically of the KSP Interstellar mod and making some alternative tanks for argon/etc.\u003C/p\u003E\u003Cp\u003EThanks on both counts. Love the mod, by the way.\u003C/p\u003E\u003Cp\u003ECheers,\u003C/p\u003E\n"},{"CreatedByName":"Talisar","CreatedById":62035,"CreatedDateTime":"2014-04-22T02:34:23Z","Content":"\n\u003Cp\u003EYou will be able to fill those storage tanks with resources for TAC Life Support and/or Extraplanetary Launchpads as long as you have that mod and Modular Fuel Tanks installed. Otherwise they will be just dead weight.\u003C/p\u003E\u003Cp\u003EYou could easily set them up to hold resources for KSPI or any other mod, either through a direct config edit or a ModuleManager config. Or, if you\u0027d like to be able to adjust the contents as you need them in-game, you could make up a custom tanktype for MFT that includes those resource definitions.\u003C/p\u003E\u003Cp\u003EGlad you like the tanks \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"DivisionByZero","CreatedById":62591,"CreatedDateTime":"2014-04-22T02:47:19Z","Content":"\n\u003Cp\u003EWell, I was trying to remake something like \u003Ca href=\u0022https://en.wikipedia.org/wiki/Project_Daedalus\u0022 rel=\u0022external nofollow\u0022\u003Ethis\u003C/a\u003E ship and the spherical tanks are perfect.\u003C/p\u003E\n"},{"CreatedByName":"Aedile","CreatedById":104353,"CreatedDateTime":"2014-04-26T17:27:06Z","Content":"\n\u003Cp\u003EI think the Toroidal Tank Hub XLarge and Large need update for the node definition size. They seem to be size 1 which makes them somewhat floppy...\u003C/p\u003E\n"},{"CreatedByName":"JeBuSBrian","CreatedById":66324,"CreatedDateTime":"2014-04-27T20:39:35Z","Content":"\n\u003Cp\u003EThey are very floppy, and my ships fall apart when using them. But I suppose if the node sizes increased, it\u0027d be that much harder to actually place tanks on the nodes, since they\u0027re so close together as is.\u003C/p\u003E\n"},{"CreatedByName":"Talisar","CreatedById":62035,"CreatedDateTime":"2014-04-29T22:03:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Aedile\u0022 data-cite=\u0022Aedile\u0022\u003E\u003Cdiv\u003EI think the Toroidal Tank Hub XLarge and Large need update for the node definition size. They seem to be size 1 which makes them somewhat floppy...\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JeBuSBrian\u0022 data-cite=\u0022JeBuSBrian\u0022\u003E\u003Cdiv\u003EThey are very floppy, and my ships fall apart when using them. But I suppose if the node sizes increased, it\u0027d be that much harder to actually place tanks on the nodes, since they\u0027re so close together as is.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, the larger nodes do make attachment very difficult. Starwaster is using a plugin on his on his MTV Copernicus pack that lets the nodes be size 0 in the VAB and then resizes them to be the appropriate size when launching. I need to check that out and see if it would help with this.\u003C/p\u003E\n"},{"CreatedByName":"Tallinu","CreatedById":57810,"CreatedDateTime":"2014-04-29T22:51:29Z","Content":"\n\u003Cp\u003EIt would be nice if there was a way to \u0027squash\u0027 the nodes from spheres into... erm... flattened spheres? The shape of some pills, like advil. And not just visually, but to make them have a smaller grab range along that axis, so that closely spaced nodes wouldn\u0027t be as difficult to attach things to, without losing the visual representation of the node size. But if all else fails, making all nodes appear size 1 or even 0 would be far preferable to size 2 and 3 nodes overlapping so much that they\u0027re a pain to connect things to like they are currently. I wonder if that could be done with a VAB editor plugin with a toggle function, so you could enable or disable it at will...\u003C/p\u003E\n"},{"CreatedByName":"Justin Kerbice","CreatedById":101695,"CreatedDateTime":"2014-04-30T07:34:09Z","Content":"\n\u003Cp\u003EA tips for nodes attachment issue in the VAB: put the camera in order to have node side in front of the point of view like:\u003C/p\u003E\u003Cp\u003E _______________\u003C/p\u003E\u003Cp\u003E /-|\\\u003C/p\u003E\u003Cp\u003E \\-|/ part\u003C/p\u003E\u003Cp\u003E |-----------------\u003C/p\u003E\u003Cp\u003E node\u003C/p\u003E\u003Cp\u003Eput the part to attach the same way and be easy with snapping.\u003C/p\u003E\u003Cp\u003Ethis way you avoid to become =\u0026gt; \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_angry.gif\u0022 alt=\u0022:mad:\u0022\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Tallinu","CreatedById":57810,"CreatedDateTime":"2014-05-01T00:16:15Z","Content":"\n\u003Cp\u003EIf you\u0027re talking about parts that can surface-mount and having trouble getting them to attach to a node instead of a surface, like docking ports, I figured that trick out ages ago. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Doesn\u0027t hurt to restate it, of course. I was talking about parts like the hubs with three large nodes that overlap significantly though. It\u0027s still possible to get parts like the toroidal tanks to attach to the center node, but it\u0027s very, very tricky unless you attach parts to the top and bottom nodes first (or at least whichever of them is taking higher priority over the center node).\u003C/p\u003E\n"},{"CreatedByName":"Justin Kerbice","CreatedById":101695,"CreatedDateTime":"2014-05-01T08:03:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tallinu\u0022 data-cite=\u0022Tallinu\u0022\u003E\u003Cdiv\u003EIf you\u0027re talking about parts that can surface-mount and having trouble getting them to attach to a node instead of a surface, like docking ports, I figured that trick out ages ago. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Doesn\u0027t hurt to restate it, of course. I was talking about parts like the hubs with three large nodes that overlap significantly though. It\u0027s still possible to get parts like the toroidal tanks to attach to the center node, but it\u0027s very, very tricky unless you attach parts to the top and bottom nodes first (or at least whichever of them is taking higher priority over the center node).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s not only for surface mount part (don\u0027t know what\u0027s wrong but with my testbed 0.23 install, I have plenty of node connection issues either in SPH or VAB. For engines, fuel tanks or batteries for example. Most of the time, the zealous idiot editor/node snap do a real mess and I have often two batteries merged together which are impossible to disassemble.\u003C/p\u003E\u003Cp\u003EIt mostly occurred with large node which have an \u0022OP\u0022 gravitational snapping SOI I might say, the big nodes attract everything in sight like a black-hole.\u003C/p\u003E\u003Cp\u003EWe should have a key to switch from every nodes on target part, like the [ ] for switching vessels in view.\u003C/p\u003E\u003Cp\u003ETo go back to your issue, I see what you mean and, from my point of view, it\u0027s the same node snap issue as I describe above (maybe I was not clear in the first place). The node select by key may be the easiest feature tu add by plug-in if node already done by editor extension plug-in.\u003C/p\u003E\n"},{"CreatedByName":"JeBuSBrian","CreatedById":66324,"CreatedDateTime":"2014-05-01T19:31:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Talisar\u0022 data-cite=\u0022Talisar\u0022\u003E\u003Cdiv\u003EYeah, the larger nodes do make attachment very difficult. Starwaster is using a plugin on his on his MTV Copernicus pack that lets the nodes be size 0 in the VAB and then resizes them to be the appropriate size when launching. I need to check that out and see if it would help with this.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis would be great. I simply cannot get the toroidal tanks into space, currently. No matter how many struts I apply, at some point during the launch, they just go floppy. Still attached to the ship, but wobbling around like crazy, throwing off the center of mass, making it impossible to fly.\u003C/p\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2014-05-02T01:29:08Z","Content":"\n\u003Cp\u003ETalisar: I\u0027ve redone the toroidal tank balancing. I used the same prodedure as \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/30673-0-23-Spherical-and-Toroidal-Tank-Pack-%28Updated-01-12-14%29?p=903556\u0026amp;viewfull=1#post903556\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E (more or less: I took some shortcuts as I needed only the new thicknesses, thus I reused the values that wouldn\u0027t change). The new values are as follows:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003EName    Capcity   Shell  Dry Mass\u003Cbr\u003ETO-S-1   0.2374  0.0039   0.0307\u003Cbr\u003ETO-M-1   3.7093  0.0616   0.4806\u003Cbr\u003ETO-L-1  15.1932  0.2524   1.9687\u003Cbr\u003ETO-XL-1 51.2771  0.8519   6.6444\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ECapacity and Shell volumes are in m\u003Csup\u003E3\u003C/sup\u003E, Dry mass is in tons.\u003C/p\u003E\u003Cp\u003EThis gives mass ratios of 8.717. Not quite as good as cylindrical tanks, but I suspect that\u0027s the extra details causing the inefficiency. Still, \u003Cem\u003Emuch\u003C/em\u003E better than the previous 4.128\u003C/p\u003E\n"},{"CreatedByName":"Talisar","CreatedById":62035,"CreatedDateTime":"2014-05-02T04:01:12Z","Content":"\n\u003Cp\u003EThanks for that taniwha! I\u0027ll adjust the values and push an update. I\u0027ll also adjust the node sizes on the hubs and toroidal tanks at the same time.\u003C/p\u003E\n"},{"CreatedByName":"Tallinu","CreatedById":57810,"CreatedDateTime":"2014-05-02T05:00:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022taniwha\u0022 data-cite=\u0022taniwha\u0022\u003E\u003Cdiv\u003EThis gives mass ratios of 8.717. Not quite as good as cylindrical tanks, but I suspect that\u0027s the extra details causing the inefficiency. Still, \u003Cem\u003Emuch\u003C/em\u003E better than the previous 4.128\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHooray! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Talisar","CreatedById":62035,"CreatedDateTime":"2014-05-02T05:55:17Z","Content":"\n\u003Cp\u003EMinor update \u003Ca href=\u0022http://kerbalspaceprogram.com/?p=37332\u0022 rel=\u0022external nofollow\u0022\u003EHERE\u003C/a\u003E. Main post updated as well.\u003C/p\u003E\u003Cp\u003EChangelog:\u003C/p\u003E\u003Cp\u003Ev3.12\u003C/p\u003E\u003Cp\u003E- Updated masses for toroidal tanks, they are much lighter now (taniwha again to the rescue!)\u003C/p\u003E\u003Cp\u003E- Increased node sizes for toroidal tanks and hubs to take advantages to changes in joints introduced by the KSP v0.23.5 update.\u003C/p\u003E\n"}]}