{"TopicId":32396,"ForumId":34,"TopicTitle":"[0.22] Extraplanetary Launchpads Legacy Thread","CreatedByName":"skykooler","CreatedById":60459,"CreatedDateTime":"2013-06-11T04:17:27Z","PageNum":32,"Articles":[{"CreatedByName":"Bone White","CreatedById":34752,"CreatedDateTime":"2013-08-03T21:16:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022skykooler\u0022 data-cite=\u0022skykooler\u0022\u003E\u003Cdiv\u003EYes, there seems to be a problem here; I\u0027m looking into it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks for the effort, this mod has become one of the few mandatory mods for playing ksp imo. I can\u0027t wait for my ships to stop exploding on construction too \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_happy.png\u0022 alt=\u0022^_^\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"vasco","CreatedById":76096,"CreatedDateTime":"2013-08-03T21:53:14Z","Content":"\n\u003Cp\u003EI have a problem with exploding ships too.\u003C/p\u003E\u003Cp\u003EDebug shows:\u003C/p\u003E\u003Cp\u003Eputting ship to grounf: -0.2736415\u003C/p\u003E\u003Cp\u003Eship: ready to launch - waiting to start physics\u003C/p\u003E\u003Cp\u003Eship: ground contact! - error: -3.250m\u003C/p\u003E\u003Cp\u003EWhen EL launchpad is still on KSC launchpad sometimes it works, sometimes not but it never works if I move EL launchpad out off KSC launchpad.\u003C/p\u003E\u003Cp\u003EAnd my crafts spawn full of everything as well:)\u003C/p\u003E\n"},{"CreatedByName":"OdinYggd","CreatedById":26917,"CreatedDateTime":"2013-08-04T00:01:33Z","Content":"\n\u003Cp\u003EHaven\u0027t tried using my EPL pad yet, but I am using the EPL runway in debug mode to deploy modules for building a base out of the EPL pad. \u003C/p\u003E\u003Cp\u003EHere\u0027s what I have so far:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/fhENEp1.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/fhENEp1.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe little ship laying on the ground is one of the main pad landing assemblies, two of them were used to lower the pad onto level ground on minimus. Had to remove one to attach the lead arm, which uses a string of 4 cubic octostruts to provide flexibility and make it easy to dock to the pad proper. I\u0027ll eventually take the other one off. \u003C/p\u003E\u003Cp\u003EBut docked to that is the power array- 32000 units of battery with 8 gigantors to maintain it and an RTG for blackstart power if it ever does get emptied. \u003C/p\u003E\u003Cp\u003EAll that\u0027s missing is modules for drilling, smelting, and refining fuel and I can actually try launching from this.\u003C/p\u003E\u003Cp\u003EAlso, how does one recover debris in this version. I\u0027d like to reclaim that lander module that is sitting there.\u003C/p\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2013-08-04T00:02:50Z","Content":"\n\u003Cp\u003Evasco: that\u0027s being worked on. I\u0027ve got a setup that reliably explodes with the pad right beside the launchpad. I\u0027ve been poking at it finding various things that don\u0027t make much difference. Frement seems to know a bit more about how things work and I\u0027ve sent him my setup.\u003C/p\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2013-08-04T00:07:32Z","Content":"\n\u003Cp\u003EOdinYggd: you need to edit the part.cfg for the appropriate pad and add the following:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003EMODULE\u003Cbr\u003E{\u003Cbr\u003E\tname = Recycler\u003Cbr\u003E}\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"OdinYggd","CreatedById":26917,"CreatedDateTime":"2013-08-04T00:22:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022taniwha\u0022 data-cite=\u0022taniwha\u0022\u003E\u003Cdiv\u003EOdinYggd: you need to edit the part.cfg for the appropriate pad and add the following:\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003EMODULE\u003Cbr\u003E{\u003Cbr\u003E\tname = Recycler\u003Cbr\u003E}\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI see.\u003C/p\u003E\u003Cp\u003EThis module would make more sense to be included in the smelter though. \u003C/p\u003E\u003Cp\u003EIn real life old hardware is cast back into the fires from which it came and re-smelted back into new material, so your old hardware would be recycled to either metal or ore and then processed again that way instead of directly.\u003C/p\u003E\n"},{"CreatedByName":"BlazingAngel665","CreatedById":30182,"CreatedDateTime":"2013-08-04T00:33:39Z","Content":"\n\u003Cp\u003ESuggestion? Maybe if you recycle something you receive a resource \u0022Debris\u0022 as well as a fraction (say 95%) of fuel and mono propellant on the vehicle. This would add some additional realism to the process. It would also be nice if additional resources were required to create vehicles. Maybe add plastic (refined from Kethane) and circuitry that had to be created from ore and plastic. This way certain bits may be more difficult to fabricate.\u003C/p\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2013-08-04T00:47:21Z","Content":"\n\u003Cp\u003EOdinYggd: actually, I\u0027d say I agree. I was just repeating the previous instructions. You could add it to an RV-8 winglet if you really wanted to \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo yeah, add it to the smelter instead of a pad.\u003C/p\u003E\n"},{"CreatedByName":"OdinYggd","CreatedById":26917,"CreatedDateTime":"2013-08-04T01:38:54Z","Content":"\n\u003Cp\u003EAlright, made that change. For now it is on the pad and runway directly.\u003C/p\u003E\u003Cp\u003EAt the same time I solved a nagging problem- the fact that the runway is nigh impossible to attach anything to when laying directly on the ground, and as such is impossible to control. \u003C/p\u003E\u003Cp\u003EAdding the command pod module to it along with a 5 unit battery and an RTG should solve that, allowing debug-mode use of just the EPL hardware without anything attached. Outside of debug mode it makes sure that under no circumstances will the game treat it as debris, regardless of what falls off.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-04T01:41:47Z\u0022 title=\u002208/04/2013 01:41  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 4, 2013\u003C/time\u003E by OdinYggd\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kaa253","CreatedById":68628,"CreatedDateTime":"2013-08-04T03:14:07Z","Content":"\n\u003Cp\u003EVery promising mod, thank you skykooler, keep up the great work!\u003C/p\u003E\u003Cp\u003EI have been wishing for something just like this.\u003C/p\u003E\u003Cp\u003EI look forwards to the explosions being fixed and I am also getting all my new ships fully fueled up.\u003C/p\u003E\u003Cp\u003EI would like to see some power (electrical?) and time costs for recycling and it would be appropriate to have to wait for some assembly time at the pad as well. I think the idea of having some parts more like the size of silos is also warranted. 200 tonnes of rocket parts in one little package is too easy.\u003C/p\u003E\n"},{"CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2013-08-04T03:20:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BlazingAngel665\u0022 data-cite=\u0022BlazingAngel665\u0022\u003E\u003Cdiv\u003ESuggestion? Maybe if you recycle something you receive a resource \u0022Debris\u0022 as well as a fraction (say 95%) of fuel and mono propellant on the vehicle. This would add some additional realism to the process. It would also be nice if additional resources were required to create vehicles. Maybe add plastic (refined from Kethane) and circuitry that had to be created from ore and plastic. This way certain bits may be more difficult to fabricate.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is not possible yet, though it should be very soon.\u003C/p\u003E\u003Cp\u003EWhat your talking about is multi in / multi out resource conversion, right now the Kethane converter module/code can only handle 1 in 1 out (plus electric charge, but thats not changable).\u003C/p\u003E\u003Cp\u003EMany requests have been made, and Majiir has talked about trying to make it happen in a future kethane update (and Im sure he will).\u003C/p\u003E\u003Cp\u003ETill then its one in one out=(\u003C/p\u003E\n"},{"CreatedByName":"cools0812","CreatedById":77493,"CreatedDateTime":"2013-08-04T14:50:08Z","Content":"\n\u003Cp\u003EAn absolutely amazing mod. Finally i can build a real COLONY on another world, not just a so-called \u0022base\u0022 landed station. thanks so much!\u003C/p\u003E\u003Cp\u003EA little suggestion, maybe the launchpad should only have the function of a launchpad , and the function of VAB should be seperated into diffrent part, so we can assembly and expand the launch base part by part , making it more like a extraplanetary colonization.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-04T15:05:46Z\u0022 title=\u002208/04/2013 03:05  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 4, 2013\u003C/time\u003E by cools0812\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"urablahblah","CreatedById":46911,"CreatedDateTime":"2013-08-04T15:02:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BlazingAngel665\u0022 data-cite=\u0022BlazingAngel665\u0022\u003E\u003Cdiv\u003ESuggestion? Maybe if you recycle something you receive a resource \u0022Debris\u0022 as well as a fraction (say 95%) of fuel and mono propellant on the vehicle. This would add some additional realism to the process. It would also be nice if additional resources were required to create vehicles. Maybe add plastic (refined from Kethane) and circuitry that had to be created from ore and plastic. This way certain bits may be more difficult to fabricate.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFor now you can simply attach with KAS before recycling, which will allow you to get any fuel left in the debris. I also like your more advanced refining process, though I\u0027m unsure how you could easily calculate the cost of non-stock parts.\u003C/p\u003E\n"},{"CreatedByName":"urablahblah","CreatedById":46911,"CreatedDateTime":"2013-08-04T22:58:25Z","Content":"\n\u003Cp\u003ESo I am trying to modify an 8x8 panel from B9 to be a flat launchpad. I have it working, unfortunately the \u0022up\u0022 direction on the model is 90 degrees off what I would like it to be, so my rockets spawn facing the wrong way and clipped into the surface, resulting in a very large explosion and loss of Kerbal life. Does anyone know of a way to get EPL to spawn the direction I want it to (i.e. the rocket body along the normal vector to the 8x8 plane)? From preliminary investigation, I would have to re-export the model and collider in the direction I want. Does anyone have a better, possibly less involved answer?\u003C/p\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2013-08-04T23:52:39Z","Content":"\n\u003Cp\u003Eurablahblah: heh, I was wondering if that would ever happen. I guess I can throw in a rotation config for pads. No idea if/when skykooler will accept it though.\u003C/p\u003E\n"},{"CreatedByName":"urablahblah","CreatedById":46911,"CreatedDateTime":"2013-08-05T00:56:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022taniwha\u0022 data-cite=\u0022taniwha\u0022\u003E\u003Cdiv\u003Eurablahblah: heh, I was wondering if that would ever happen. I guess I can throw in a rotation config for pads. No idea if/when skykooler will accept it though.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027d be excellent. I just hate the current models, so I was tinkering around with using a different one. The 8x8 panel from B9 just LOOKS like a launchpad, not to mention it fits with the art style of everything else.\u003C/p\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2013-08-05T01:15:39Z","Content":"\n\u003Cp\u003EHave you tried the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/23774-0-21-Hooligan-Labs-Balloon-on-Duna-and-More%21\u0022 rel=\u0022external nofollow\u0022\u003Ehooligan labs\u003C/a\u003E pad? It\u0027s quite nice. That said, I\u0027ll definitely look into better configurability of launchpads.\u003C/p\u003E\n"},{"CreatedByName":"AncientGammoner","CreatedById":77111,"CreatedDateTime":"2013-08-05T01:56:02Z","Content":"\n\u003Cp\u003EBefore I realized that kethane scanners worked for ore (a fact which should probably be made more clear from the beginning), I had to build a fast scanner (aka lots of scanners once so you can warp) out of runways. Needless to say, it was a rather ungainly thing to launch:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s18.postimg.org/7ebf10hih/orescanner.png\u0022 alt=\u0022orescanner.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"nhnifong","CreatedById":12196,"CreatedDateTime":"2013-08-05T02:22:51Z","Content":"\n\u003Cp\u003EJust a suggestion, It would be nice to have a small pad to start out with, which can only spawn small ships. you would use that to spawn the parts to build a large pad, that way you don\u0027t have to land something the size of a building.\u003C/p\u003E\n"},{"CreatedByName":"Tyren","CreatedById":76757,"CreatedDateTime":"2013-08-05T07:01:01Z","Content":"\n\u003Cp\u003EI agree with Nhnifong, i am too dumb to get that big Launch pad to space, is there the possibility to get a compact \u0022production facility\u0022 (not even a launchpad, maybe sth. to build one)?\u003C/p\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2013-08-05T07:06:13Z","Content":"\n\u003Cp\u003EActually, I myself want such and I\u0027m working towards that goal (I\u0027m doing a lot of private hacking and sending my changes to skykooler), but getting ships to stop exploding is the priority right now. I\u0027ve sometimes gotten explosion chain reactions that would rip a whole base to shreds depending on connections \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kaa253","CreatedById":68628,"CreatedDateTime":"2013-08-05T08:30:52Z","Content":"\n\u003Cp\u003EYes please, make the explosions a priority! I really appreciate your work on this. At the moment it is almost possible to launch a kerbal sitting in a command chair directly into Minmus orbit by ship-spawning-partly-inside-the-launchpad generated explosion alone. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Bobhendly","CreatedById":70841,"CreatedDateTime":"2013-08-05T08:38:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022nhnifong\u0022 data-cite=\u0022nhnifong\u0022\u003E\u003Cdiv\u003EJust a suggestion, It would be nice to have a small pad to start out with, which can only spawn small ships. you would use that to spawn the parts to build a large pad, that way you don\u0027t have to land something the size of a building.[/QUO\u003Cp\u003EV3 Is gonna have a nice foldable Launchpad that is under 3m folded up.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Crater","CreatedById":48907,"CreatedDateTime":"2013-08-05T09:13:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022taniwha\u0022 data-cite=\u0022taniwha\u0022\u003E\u003Cdiv\u003EI\u0027ve sometimes gotten explosion chain reactions that would rip a whole base to shreds depending on connections \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kaa253\u0022 data-cite=\u0022Kaa253\u0022\u003E\u003Cdiv\u003EYes please, make the explosions a priority!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI can almost hear Jeb squealing with joy from here!\u003C/p\u003E\u003Cp\u003EUntil he realises that you are trying to \u003Cem\u003Estop\u003C/em\u003E them!\u003C/p\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2013-08-05T13:27:57Z","Content":"\n\u003Cp\u003ECrater: only so we can make even bigger explosions }:\u0026gt;\u003C/p\u003E\n"}]}