{"TopicId":35073,"ForumId":34,"TopicTitle":"[1.6] Davon Throttle Control systems mod [v088]","CreatedByName":"PrivateFlip","CreatedById":68273,"CreatedDateTime":"2013-06-28T00:42:09Z","PageNum":3,"Articles":[{"CreatedByName":"wasmic","CreatedById":64885,"CreatedDateTime":"2013-12-30T23:50:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Boamere\u0022 data-cite=\u0022Boamere\u0022\u003E\u003Cdiv\u003ECool mod! Does it work with dtobi\u0027s shuttle engines mod?\u003Cp\u003EEdit: did some testing, and no unfortunately... The mod has naturally angled engines(that can be pitched to any angle), which means it\u0027s possible for you to have a fuel tank attached without a rocket, but this mod can\u0027t angle the rockets to stabilise(here\u0027s a pic to help you understand)\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/8imE3dj.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/8imE3dj.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAs you can see when i decouple the boosters there will be a tank full of fuel and no rocket.\u003C/p\u003E\u003Cp\u003EIt would be awesome to see support for this kind of thing!(pitch-able vectoring etc.) Again great mod, just doesn\u0027t like working with shuttles \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut why do you even need this mod for that shuttle? It should be able to adjust itself, using just what dtobi made.\u003C/p\u003E\u003Cp\u003EEDIT: Oh, and this mod is going to be useful. Like, REALLY useful.\u003C/p\u003E\n"},{"CreatedByName":"SkyHook","CreatedById":31496,"CreatedDateTime":"2013-12-31T03:16:23Z","Content":"\n\u003Cp\u003EUrsa Shuttle LIIIIVES!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/akUVDr3.png\u0022 alt=\u0022akUVDr3.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"PrivateFlip","CreatedById":68273,"CreatedDateTime":"2013-12-31T16:59:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ratzap\u0022 data-cite=\u0022Ratzap\u0022\u003E\u003Cdiv\u003EOne thing I noticed trying this out just now is that using the centered thrust stops my sepatrons from firing. A normal run with mechjeb in control they fire off with each staging as usual. I put the control part for this on, configured the booster motors for centered thrust and the sepatrons don\u0027t fire when staging. I tried setting the sepatrons as \u0027ignore\u0027 and the net off but it still doesn\u0027t fire them.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThank you for reporting this Ratzap, this has been corrected.\u003C/p\u003E\n"},{"CreatedByName":"Boamere","CreatedById":68058,"CreatedDateTime":"2013-12-31T17:39:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022wasmic\u0022 data-cite=\u0022wasmic\u0022\u003E\u003Cdiv\u003EBut why do you even need this mod for that shuttle? It should be able to adjust itself, using just what dtobi made.\u003Cp\u003EEDIT: Oh, and this mod is going to be useful. Like, REALLY useful.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt doesn\u0027t auto adjust, it\u0027s almost impossible to get right :/\u003C/p\u003E\n"},{"CreatedByName":"blspblackdeath","CreatedById":20067,"CreatedDateTime":"2014-01-02T15:35:50Z","Content":"\n\u003Cp\u003EI have to report a bug. \u003C/p\u003E\u003Cp\u003EIf i have installed a basic jet engine on my shuttle. The diferential thrust module activates it when I thrust up before staging on the launchpad. (Before I press *space* to lift off)\u003C/p\u003E\u003Cp\u003EI\u0027m not sure if it gives thrust though but the grafics and sound of the activated jet engine can be seen and be heared.\u003C/p\u003E\u003Cp\u003EAnd I think your module does not count in solid rocket boosters. But I havn\u0027t tested it further.\u003C/p\u003E\n"},{"CreatedByName":"PrivateFlip","CreatedById":68273,"CreatedDateTime":"2014-01-03T13:25:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022blspblackdeath\u0022 data-cite=\u0022blspblackdeath\u0022\u003E\u003Cdiv\u003EI have to report a bug. \u003Cp\u003EIf i have installed a basic jet engine on my shuttle. The diferential thrust module activates it when I thrust up before staging on the launchpad. (Before I press *space* to lift off)\u003C/p\u003E\u003Cp\u003EI\u0027m not sure if it gives thrust though but the grafics and sound of the activated jet engine can be seen and be heared.\u003C/p\u003E\u003Cp\u003EAnd I think your module does not count in solid rocket boosters. But I havn\u0027t tested it further.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThank you for reporting this.\u003C/p\u003E\u003Cp\u003E-Mod has been modified so jet engines don\u0027t spool up before activation, they didn\u0027t provide thrust but now graphics and sound should be similar.\u003C/p\u003E\u003Cp\u003E-Solid boosters are now correctly taken into account for CoT calculation.\u003C/p\u003E\n"},{"CreatedByName":"blspblackdeath","CreatedById":20067,"CreatedDateTime":"2014-01-04T12:27:39Z","Content":"\n\u003Cp\u003EGreat thanks.\u003C/p\u003E\n"},{"CreatedByName":"spearsp","CreatedById":27499,"CreatedDateTime":"2014-01-06T15:50:58Z","Content":"\n\u003Cp\u003EThis works nicely for turbine and rocket engines alike, but doesn\u0027t seem to work on the multi-mode engines, such as the stock rapier engine or the B9 Sabre engines. Any chance of adding support for these?\u003C/p\u003E\n"},{"CreatedByName":"PrivateFlip","CreatedById":68273,"CreatedDateTime":"2014-01-06T20:50:25Z","Content":"\n\u003Cp\u003EThese engines do use a different partmodules although there are many similarities. I wouldnÃ‚Â´t be surprised if these new engine partmodules would become the standard for all engines at some point, so it is my intention to get the support for these sooner rather than later. (Not before the coming weekend, but maybe in a week or so)\u003C/p\u003E\n"},{"CreatedByName":"spearsp","CreatedById":27499,"CreatedDateTime":"2014-01-14T13:51:03Z","Content":"\n\u003Cp\u003EI look forward to it, with baited breath.\u003C/p\u003E\n"},{"CreatedByName":"ghost010","CreatedById":57302,"CreatedDateTime":"2014-01-14T14:46:59Z","Content":"\n\u003Cp\u003EI did not read all,and so far i only have seen shuttle/rockets.\u003C/p\u003E\u003Cp\u003EBut will this basically work for VTOL?\u003C/p\u003E\u003Cp\u003EI remember a mod that would do some throttle for VTOL.but it was a 2 engine mod only.\u003C/p\u003E\n"},{"CreatedByName":"kyle.mk.howard","CreatedById":22844,"CreatedDateTime":"2014-01-14T16:16:04Z","Content":"\n\u003Cp\u003EYou know it says mayor instead of major in the title of the thread, right?\u003C/p\u003E\n"},{"CreatedByName":"BigFatStupidHead","CreatedById":44217,"CreatedDateTime":"2014-01-14T18:58:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022kyle.mk.howard\u0022 data-cite=\u0022kyle.mk.howard\u0022\u003E\u003Cdiv\u003EYou know it says mayor instead of major in the title of the thread, right?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, it IS a thrust governor... \u003C/p\u003E\u003Cp\u003ETerrible, terrible puns aside, this looks like just what I need. It would be fantastic if you could have the extra throttle controls made to resemble the stock throttle gauge, and add key-binding to them as well.\u003C/p\u003E\n"},{"CreatedByName":"PrivateFlip","CreatedById":68273,"CreatedDateTime":"2014-01-18T00:33:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022spearsp\u0022 data-cite=\u0022spearsp\u0022\u003E\u003Cdiv\u003EI look forward to it, with baited breath.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ecompleted it this week, hope to do final testing this weekend.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ghost010\u0022 data-cite=\u0022ghost010\u0022\u003E\u003Cdiv\u003EI did not read all,and so far i only have seen shuttle/rockets.\u003Cp\u003EBut will this basically work for VTOL?\u003C/p\u003E\u003Cp\u003EI remember a mod that would do some throttle for VTOL.but it was a 2 engine mod only.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt depends on the design and your expectations.\u003C/p\u003E\u003Cp\u003EIf you have dedicated vertical engines you can have the center thrust balance those while setting the horizontal engines to be ignored by the center thrust mode. You would still need to manually adjust the thrust to for example hover and have some other means to control the orientation of the plane.\u003C/p\u003E\n"},{"CreatedByName":"PrivateFlip","CreatedById":68273,"CreatedDateTime":"2014-01-18T22:41:40Z","Content":"\n\u003Cp\u003EThis is the testing version of this mod\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/xsn5kw76486j29a/DavonTCsystemsModvtesting.zip\u0022 rel=\u0022external nofollow\u0022\u003Edropbox download link\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Esource code part of download, released under GPL (\u003Ca href=\u0022http://www.gnu.org/licenses/gpl.html\u0022 rel=\u0022external nofollow\u0022\u003EGNU General Public License\u003C/a\u003E)\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EThe reason for having a separate testing version for this plugin is that I prefer making small incremental changes than building towards a big new release over a longer time. Because the need to test all different components even after making small changes due to the interdependence between them, I find myself kinda putting of making changes and adding features despite the fact I really like to work on it. \u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EIn general this testing version will contain the features requested by often a single user or small additions i make on my own account. It will be a little buggier at times but the idea is that the user who requested the new feature will accept this in exchange for a faster implementation, other who did not want the feature will have a more stable version, and I will be motivated to add some new stuff instead of being burdened by the prospect to test every throttle setting, center thrust, engine type/layout combination.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E23-feb-2014 this testing version contains an overhaul of the center thrust mode.\u003C/p\u003E\u003Cp\u003E-it has a drastically faster response time to sudden changes in the Center of Thrust: the system is now fast enough to compensate mid-flight engine failures in an reasonable time (and will probably be even faster in future updates)\u003C/p\u003E\u003Cp\u003E-the size off the adjustments is now dynamically regulated: this means the user no more has to choose and set an adjustment size and the size of the adjustment is continuously adapted to the vessel and it\u0027s current situation.\u003C/p\u003E\u003Cp\u003E05-mar-2014\u003C/p\u003E\u003Cp\u003E-bugfixes\u003C/p\u003E\u003Cp\u003E25-mar-2014\u003C/p\u003E\u003Cp\u003E-bugfix\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-25T22:41:58Z\u0022 title=\u002203/25/2014 10:41  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 25, 2014\u003C/time\u003E by PrivateFlip\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"spearsp","CreatedById":27499,"CreatedDateTime":"2014-01-20T08:12:23Z","Content":"\n\u003Cp\u003EThat\u0027s great - thank you.\u003C/p\u003E\u003Cp\u003EIt is looking a whole lot better: The menu options are now available in mixed-mode and fixed mode engines. I encountered the following issues:\u003C/p\u003E\u003Cp\u003E1. Direction depends on all engines having the same direction of thrust. Is it not possible to pick up the direction of thrust for each engine, and calculate the moment of torque on the center of mass for each engine from that?\u003C/p\u003E\u003Cp\u003E2. It is doing something strange when there are more than 4 engines. I put 6 engines onto 2 Rockomax 64 tanks, almost evenly distributed. The center engines run at minimal thrust (around 20%). I expected the center engines to be maxed out, with either the engines at the back or the front maxed out, and the remaining pair reduced to establish the balance.\u003C/p\u003E\u003Cp\u003E3. Mechjeb vessel info is showing max acceleration and current acceleration in the order of micrometers, which does not happen without the plugin.\u003C/p\u003E\u003Cp\u003EI have not had enough to test further, although I have found that engines mounted at a slight angle seem to go haywire: I cannot keep the vessel balanced, no matter what RCS thrusters I have installed.\u003C/p\u003E\u003Cp\u003EI have no idea what sort of information is available from KSP, so I\u0027m not sure if this is possible or realistic: Instead of working on a trial-end-error basis for the individual throttle control for each engine, is it not possible to calculate the required thrust to net out torque, based on the current maximum thrust? If the current maximum thrust is, say, 160kN, and you need it to be 80kN in order to establish a balance, then setting the throttle for that engine to 50% should get you spot on? I guess what I\u0027m trying to ask is: Is the relationship between throttle and thrust linear, based on the engines maximum thrust for a given speed/atmospheric pressure?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-20T11:10:28Z\u0022 title=\u002201/20/2014 11:10  AM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 20, 2014\u003C/time\u003E by spearsp\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"PrivateFlip","CreatedById":68273,"CreatedDateTime":"2014-01-21T21:11:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022spearsp\u0022 data-cite=\u0022spearsp\u0022\u003E\u003Cdiv\u003E2. It is doing something strange when there are more than 4 engines. I put 6 engines onto 2 Rockomax 64 tanks, almost evenly distributed. The center engines run at minimal thrust (around 20%). I expected the center engines to be maxed out, with either the engines at the back or the front maxed out, and the remaining pair reduced to establish the balance.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI would like to investigate this, but based on your description I can\u0027t really picture the engine outlay. (as a fix you could set the back and front engines as designated and set the center thrust to only use designated engines.)\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022spearsp\u0022 data-cite=\u0022spearsp\u0022\u003E\u003Cdiv\u003E3. Mechjeb vessel info is showing max acceleration and current acceleration in the order of micrometers, which does not happen without the plugin.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI do not know what is causing this but i suspect it goes something like this: The max thrust of engines is often a nice round number and thrust percentage, under stock conditions, is a nice discrete number. This could results relatively rounded outcomes. This plugin can and does set the throttle levels of individual engines with a much higher precision which leads to longer outcomes. There\u0027s probably little to really fix these type of inter mod bugs, the developer of mechjeb is not going to implement rounding because some niche mod is causing longer outcomes, nor am I willing to make more discrete adjustments to prevent display issues in mechjeb.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022spearsp\u0022 data-cite=\u0022spearsp\u0022\u003E\u003Cdiv\u003E1. Direction depends on all engines having the same direction of thrust. Is it not possible to pick up the direction of thrust for each engine, and calculate the moment of torque on the center of mass for each engine from that?\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022spearsp\u0022 data-cite=\u0022spearsp\u0022\u003E\u003Cdiv\u003EI have not had enough to test further, although I have found that engines mounted at a slight angle seem to go haywire: I cannot keep the vessel balanced, no matter what RCS thrusters I have installed.\u003C/div\u003E\u003C/blockquote\u003E \u003Cp\u003EThe center thrust mode in this mod reduces the balance problem to a two dimensional plane. This limits the application to engines which are to be balanced to all face in the same direction. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022spearsp\u0022 data-cite=\u0022spearsp\u0022\u003E\u003Cdiv\u003EI have no idea what sort of information is available from KSP, so I\u0027m not sure if this is possible or realistic: Instead of working on a trial-end-error basis for the individual throttle control for each engine, is it not possible to calculate the required thrust to net out torque, based on the current maximum thrust? If the current maximum thrust is, say, 160kN, and you need it to be 80kN in order to establish a balance, then setting the throttle for that engine to 50% should get you spot on? I guess what I\u0027m trying to ask is: Is the relationship between throttle and thrust linear, based on the engines maximum thrust for a given speed/atmospheric pressure?\u003C/div\u003E\u003C/blockquote\u003E \u003Cp\u003EThe relationship between throttle and thrust is linear. However the issue does not lie in setting the engine to a specific thrust, but in calculating to what thrust an engine should be set. All the information, like engine direction, is all available and accesible in KSP, and like you suggested this could be used to calculate the moment of torque of every engine. ZRM\u0027s \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/29387-0-21-x-KerbCom-Avionics-0-3-0-6-Alpha-(29-August)-now-with-video!\u0022 rel=\u0022external nofollow\u0022\u003EKerbcom Avionics\u003C/a\u003E proved it is realistic to use such information to calculate the exact thrust for every engine in three dimensions, so you do have a good grip on the situation. Unfortunately I am not an expert mathematician like ZRM.\u003C/p\u003E\n"},{"CreatedByName":"spearsp","CreatedById":27499,"CreatedDateTime":"2014-01-22T08:00:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PrivateFlip\u0022 data-cite=\u0022PrivateFlip\u0022\u003E\u003Cdiv\u003EI would like to investigate this, but based on your description I can\u0027t really picture the engine outlay. (as a fix you could set the back and front engines as designated and set the center thrust to only use designated engines.)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ll PM my craft file to you. Basically a shuttle, with two B9 SABRE engines on a rotatron, slightly aft of the center of mass, and two pure turbine engines surface-mounted just behind the nose.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PrivateFlip\u0022 data-cite=\u0022PrivateFlip\u0022\u003E\u003Cdiv\u003Ethe developer of mechjeb is not going to implement rounding...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ll ping Mechjeb about this. You never know.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PrivateFlip\u0022 data-cite=\u0022PrivateFlip\u0022\u003E\u003Cdiv\u003EZRM\u0027s Kerbcom Avionics proved it is realistic to use such information to calculate the exact thrust for every engine in three dimensions, so you do have a good grip on the situation. Unfortunately I am not an expert mathematician like ZRM\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EZRM\u0027s solution is much closer to the mark, but there are several issues with it: He\u0027s not using a solution for individual moments of torque for each engine, because it does not support engines orientated along any axis - they need to be offset. This makes his solution unusable in my designs. The second problem is that there appears to be no way to override using differential thrust on the engines as a phased array for the gimble. That\u0027s a really nice concept when using rocket engines, but fails hopelessly when using turbines. Also, ZRM appears to have retreated, so I don\u0027t know when he\u0027s going to be updating KerbCom for .23 and multi-mode engines.\u003C/p\u003E\u003Cp\u003EI am busy studying your code. I\u0027m about halfway through, although it is hard reading code when I don\u0027t entirely understand the context and my C# aint that strong, although I did manage to find some documentation on the forum. My plan is to find some stock code online to calculate torque moments about a point, and then see how this can be implemented in the code. I\u0027m happy to help you with the maths - it\u0027s just that C# is not my language. I\u0027ll let you know my findings.\u003C/p\u003E\n"},{"CreatedByName":"PrivateFlip","CreatedById":68273,"CreatedDateTime":"2014-01-22T20:01:42Z","Content":"\n\u003Cp\u003E...I assume the math for something like this isn\u0027t going to be a picknick...\u003C/p\u003E\n"},{"CreatedByName":"spearsp","CreatedById":27499,"CreatedDateTime":"2014-01-23T08:07:06Z","Content":"\n\u003Cp\u003EWith a long and sordid history in vehicle tracking and GIS systems, it is not as hard as it looks. But I need some help getting there:\u003C/p\u003E\u003Cp\u003E1. I\u0027ve managed to find the CoM on the Vessel, but have no idea how this is represented in Vector3. Is this just an x;y;z array?\u003C/p\u003E\u003Cp\u003E2. For the life of me, I cannot see how to find the position and orientation of a part wrt the rest of the vessel.\u003C/p\u003E\u003Cp\u003E3. I\u0027m also struggling to find out the direction of thrust for the engine. I\u0027ve read elsewhere that the thrust is along the z-axis, but how does this work on engines like the B9 VTOL engine, or other engines whose thrust vector can be altered in flight?\u003C/p\u003E\u003Cp\u003EI\u0027m going to get cracking on the maths in the meantime. This may take a couple of days...\u003C/p\u003E\n"},{"CreatedByName":"PrivateFlip","CreatedById":68273,"CreatedDateTime":"2014-01-25T19:21:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022spearsp\u0022 data-cite=\u0022spearsp\u0022\u003E\u003Cdiv\u003EWith a long and sordid history in vehicle tracking and GIS systems, it is not as hard as it looks. But I need some help getting there:\u003Cp\u003E1. I\u0027ve managed to find the CoM on the Vessel, but have no idea how this is represented in Vector3. Is this just an x;y;z array?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYip, you can do something like vessel.Com[0], vessel.Com[1] or vessel.Com[2] to get x, y and z. This location not be in relation to the vessel itself.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022spearsp\u0022 data-cite=\u0022spearsp\u0022\u003E\u003Cdiv\u003E2. For the life of me, I cannot see how to find the position and orientation of a part wrt the rest of the vessel.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eyou do this with:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003Evessel.ReferenceTransform.InverseTransformPoint(part.transform.position)\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Eso the distance along the x-axis to the CoM is something like this\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E(vessel.ReferenceTransform.InverseTransformPoint(p.transform.position)[x] - vessel.ReferenceTransform.InverseTransformPoint(vessel.CoM )[x]);\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Efor direction there is Transform.InverseTransformDirection\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://docs.unity3d.com/Documentation/ScriptReference/Transform.html\u0022 rel=\u0022external nofollow\u0022\u003Erelevant unity documentation\u003C/a\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022spearsp\u0022 data-cite=\u0022spearsp\u0022\u003E\u003Cdiv\u003E3. I\u0027m also struggling to find out the direction of thrust for the engine. I\u0027ve read elsewhere that the thrust is along the z-axis, but how does this work on engines like the B9 VTOL engine, or other engines whose thrust vector can be altered in flight?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETo find the directions of thrust you would look for the thrust transforms in engines, this is a separate transform you add to engines which decides the direction of the thrust. So thrust is not necessarily along the z-axis of a part and that z-axis remark likely refers to the thrust transform.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003Eforeach (Transform tr in ModuleEngines.thrustTransforms)\u003Cbr\u003E{ \u003Cbr\u003E           tr.rotation\u003Cbr\u003E}\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EIn the my code look for the adjust() function. Slightly above is a brief comment which describes how the center thrust works and below are the relevant functions you would be interested in. All the other code before it is just GUI, saving and loading of profiles, keyboard and joystick support for throttles etcetera.\u003C/p\u003E\n"},{"CreatedByName":"spearsp","CreatedById":27499,"CreatedDateTime":"2014-01-30T08:12:59Z","Content":"\n\u003Cp\u003EVery helpful - thanks. You see, I would never have got that.\u003C/p\u003E\u003Cp\u003ESo I\u0027ve drawn lots of pictures and looked at this from several angles, and am slowly coming up with a plan. It occurred to me, pondering the pictures, that if you can resolve the forces in each plane (XY, XZ, YZ), then the calculation becomes a whole lot easier. This seems to be the most intuitive approach. Still working on common sense rather than Mathematics, it also occurs to me that:\u003C/p\u003E\u003Cp\u003E1. If a solution cannot be found that satisfies a balance on all three planes, then there is no solution.\u003C/p\u003E\u003Cp\u003E2. Where there are engines perpendicular to the plane, they have no effect on the torque on that plane. In other words, a solution on the XY plane may have multiple values, or \u0022Don\u0027t Care\u0022 elements, where engines are parallel to the Z axis.\u003C/p\u003E\u003Cp\u003EUsing the Euler angles in the thrust transform, you can determine the engine\u0027s angle to each axis. This is an assumption - please correct me if I\u0027m wrong. I really cannot get my head around quaternions.\u003C/p\u003E\u003Cp\u003EIf Euler angles (A; B; C) are the angles around the (x; y; z) axes respectively, then the force applied on the XY plane by an engine can be calculated as Thrust * CosA * CosB, where C is the direction of the resulting vector on the plane. We can then continue the torque calculation in 2D space, which renders the problem down to high-school mathematics.\u003C/p\u003E\u003Cp\u003EThe approach, then, is to solve each plane, skipping engines that are perpendicular to the plane in the calculation of the required adjustment. Then take the resulting values and check that the net torque is still zero on all three planes. If it is, then there is a solution, otherwise there is not. By way of example, take a space plane with two engines symmetrically mounted on the sides of the fuselage, below the center of mass. I\u0027m working on the assumption that Z is the direction of travel, X is horizontal across the direction of travel and Y is vertical. On the XZ plane, then (i.e. looking top down), there is a solution: As long as the engines have the same thrust, the net torque will be zero. Since the engines are parallel to the direction of travel, there are no forces on the XY plane, so all solutions will work. On the YZ plane (side view), however, both engines contribute torque in the same direction, so there is no solution.\u003C/p\u003E\u003Cp\u003EAdd another engine to the top of the fuselage. Now, there is still a solution on XZ, although the 3rd engine has no effect on torque, because its thrust vector goes straight through the center of mass. The other two engines still need to apply equal thrust to maintain balance. XY still has no forces. on YZ, the combined torque from the first two engines need to offset the torque from the new top engine. There is a solution on YZ. Then go back to XY and XZ, and make sure that the solution found for YZ hasn\u0027t thrown off the balance in one of the other two planes, and we\u0027re set.\u003C/p\u003E\u003Cp\u003EAny thoughts?\u003C/p\u003E\n"},{"CreatedByName":"PrivateFlip","CreatedById":68273,"CreatedDateTime":"2014-02-02T15:40:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022spearsp\u0022 data-cite=\u0022spearsp\u0022\u003E\u003Cdiv\u003EVery helpful - thanks. You see, I would never have got that.\u003Cp\u003ESo I\u0027ve drawn lots of pictures and looked at this from several angles, and am slowly coming up with a plan. It occurred to me, pondering the pictures, that if you can resolve the forces in each plane (XY, XZ, YZ), then the calculation becomes a whole lot easier. This seems to be the most intuitive approach. Still working on common sense rather than Mathematics, it also occurs to me that:\u003C/p\u003E\u003Cp\u003E1. If a solution cannot be found that satisfies a balance on all three planes, then there is no solution.\u003C/p\u003E\u003Cp\u003E2. Where there are engines perpendicular to the plane, they have no effect on the torque on that plane. In other words, a solution on the XY plane may have multiple values, or \u0022Don\u0027t Care\u0022 elements, where engines are parallel to the Z axis.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022spearsp\u0022 data-cite=\u0022spearsp\u0022\u003E\u003Cdiv\u003EUsing the Euler angles in the thrust transform, you can determine the engine\u0027s angle to each axis. This is an assumption - please correct me if I\u0027m wrong. I really cannot get my head around quaternions.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes this is possible. You can also assume that all other basic input you would need for this \u0027problem\u0027, like angles, positions and thrust, can directly derived from the game or calculated.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022spearsp\u0022 data-cite=\u0022spearsp\u0022\u003E\u003Cdiv\u003EIf Euler angles (A; B; C) are the angles around the (x; y; z) axes respectively, then the force applied on the XY plane by an engine can be calculated as Thrust * CosA * CosB, where C is the direction of the resulting vector on the plane. We can then continue the torque calculation in 2D space, which renders the problem down to high-school mathematics.\u003Cp\u003EThe approach, then, is to solve each plane, skipping engines that are perpendicular to the plane in the calculation of the required adjustment. Then take the resulting values and check that the net torque is still zero on all three planes. If it is, then there is a solution, otherwise there is not. By way of example, take a space plane with two engines symmetrically mounted on the sides of the fuselage, below the center of mass. I\u0027m working on the assumption that Z is the direction of travel, X is horizontal across the direction of travel and Y is vertical. On the XZ plane, then (i.e. looking top down), there is a solution: As long as the engines have the same thrust, the net torque will be zero. Since the engines are parallel to the direction of travel, there are no forces on the XY plane, so all solutions will work. On the YZ plane (side view), however, both engines contribute torque in the same direction, so there is no solution.\u003C/p\u003E\u003Cp\u003EAdd another engine to the top of the fuselage. Now, there is still a solution on XZ, although the 3rd engine has no effect on torque, because its thrust vector goes straight through the center of mass. The other two engines still need to apply equal thrust to maintain balance. XY still has no forces. on YZ, the combined torque from the first two engines need to offset the torque from the new top engine. There is a solution on YZ. Then go back to XY and XZ, and make sure that the solution found for YZ hasn\u0027t thrown off the balance in one of the other two planes, and we\u0027re set.\u003C/p\u003E\u003Cp\u003EAny thoughts?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes. Your approach seems to rely on the assumption it can be reduced to three 2D planes which can be solved separately or at least sequentially by first solving one and then the others and then maybe checking if the first one is still okay. \u003C/p\u003E\u003Cp\u003EIntuitively, in the sense that I haven\u0027t really analyzed it, I do not think you can solve the problem like that. The best way for me to articulate this intuition without resolving to calculations is to wonder how a human would approach balancing a complex configuration of engines in three dimensions. This would include engines with none right angles to the vessel. You can imagine a specific configuration in which the obvious engine which would balance thrust in one plane would not be a good decision because of the impact it would have on the others, therefore the planes cannot be looked at separate. \u003C/p\u003E\u003Cp\u003EYou can verify this by taking the whole thing one dimension lower and try to solve a two dimensional problem by only considering one dimension at a time.\u003C/p\u003E\u003Cp\u003E(Yot down 3-5 dots semi randomly around the origin of a graph, call the origin the CoM, give the engines a starting thrust and try imagine how you would solve it.\u003C/p\u003E\u003Cp\u003EWhen you look at this two dimensional graph it would be easy to see which engines would probably pave have to be tuned down to center the CoT on the CoM.\u003C/p\u003E\u003Cp\u003ENow limit yourself to only take into consideration one dimension, so only look at the X coordinates of the engines, CoT, in respect to the CoM. It will be quickly apparent the engine(s) which might look like the obvious pick to be adjusted to balance this one dimension would actually be suboptimal or bad picks when taking into account the two dimensional picture. Not in all cases, obviously, but there would be a non trivial amount of engine configurations in which this was the case. \u003C/p\u003E\u003Cp\u003EBalancing the Y dimension after balancing X would not solve the problem or bring you closer to a solution and cycling between dimension would only have you go around in circles.\u003C/p\u003E\u003Cp\u003EThese type of things tend to translate well to higher dimensional and therefore you probably can\u0027t solve a three dimensional problem by solving three two dimensional planes separately, unless all engines are at right angles and did not effect more than one plane.\u003C/p\u003E\n"},{"CreatedByName":"spearsp","CreatedById":27499,"CreatedDateTime":"2014-02-06T18:18:05Z","Content":"\n\u003Cp\u003EI don\u0027t entirely agree with your logic. Torque will always occur on a plane, whether you\u0027re working in 2 or 3 dimensions, and I am certain that if a solution satisfies all three axial planes, that it is a valid solution. When I\u0027m trying to balance a plane by eye-balling it, this is effectively what I\u0027m doing - checking that it is balanced from the left, from the top and from the back. However, that said, it\u0027s not you that I need to convince, but the results of the solution. And even once I have the Maths all worked out, I have no idea what sort of algorithms I\u0027m going to use to combine the planes into a workable solution.\u003C/p\u003E\u003Cp\u003EWhether or not this is the right approach for this problem remains to be seen. I am hoping that by the end of the calculation, I will end up with a set of simultaneous equations resolved as a ratio that each engine must contribute to the overall thrust in order to maintain equilibrium, but I\u0027m not seeing a way of doing this without using a brute force approach. I\u0027m afraid I\u0027ve stalled on this for the moment: Demands at work are astronomical at present, but I plan to spend some time on it next weekend, when things have quietened down a bit.\u003C/p\u003E\u003Cp\u003EAny idea what has happened to KerbCom Avionics? He seems to have fallen off the grid.\u003C/p\u003E\n"},{"CreatedByName":"PrivateFlip","CreatedById":68273,"CreatedDateTime":"2014-02-08T00:14:46Z","Content":"\n\u003Cp\u003EDon\u0027t know exactly what happened to KerbCom. There\u0027s a another \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/67270-Throttle-Controlled-Avionics-1-1-0-23\u0022 rel=\u0022external nofollow\u0022\u003Ethrottle control mod\u003C/a\u003E out by the way. It does involve calculating torque of each engine, so you might be interested in checking it out, although it takes a different approach from there on out.\u003C/p\u003E\n"}]}