{"TopicId":36371,"ForumId":34,"TopicTitle":"[1.2] Procedural Fairings 3.20 (November 8)","CreatedByName":"e-dog","CreatedById":73796,"CreatedDateTime":"2013-07-08T23:34:56Z","PageNum":41,"Articles":[{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-11-15T22:23:49Z","Content":"\n\u003Cp\u003Ee-dog: Oh, we can do that with the current single texture. I\u0027m just saying if the fairings used two textures, then the fairings could share outer textures with stretchy tanks, which would save a lot of RAM and texture-making time.\u003C/p\u003E\u003Cp\u003EMy specialty is writing the code to transform a model\u0027s stats into a realistic amount of fuel. Not so much the actual transforming of the model. :]\u003C/p\u003E\u003Cp\u003EThat\u0027s why I was either hoping you\u0027d do it (the visual side), or that I\u0027d just use the existing procedural interstage and accept it wouldn\u0027t look right if there were no parts above or below it.\u003C/p\u003E\u003Cp\u003EDREC has two issues. One the heat shields aren\u0027t re-rated for Real Solar System\u0027s earthlike (because earth-size) reentry, but rather they\u0027re still set for Kerbin\u0027s nice-and-cuddly not-really-deadly 2km/s reentry. The other is that one often loses the ability to click when all parts are destroyed; this is a stock issue that DREC exacerbates, and I have some idea as to how to mitigate it thanks to ideas from FlowerChild (which I will try in the next few days time permitting, along with new values for the heat shields). Other than that, it\u0027s quite solid: there are patches available for the heatshields, and the no-click bug can be gotten around by reverting, launching, and reverting again.\u003C/p\u003E\n"},{"CreatedByName":"e-dog","CreatedById":73796,"CreatedDateTime":"2013-11-15T22:47:07Z","Content":"\n\u003Cp\u003EI think I could make \u0022conical\u0022 tanks by refactoring your Stretchy SRB module (moving geometry calculations to methods) and then subclassing it. Do you use any version control system?\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-11-15T22:52:51Z","Content":"\n\u003Cp\u003EI usually use git[hub], but as I was continuing others\u0027 work in MFS, DRE, and ST, I hadn\u0027t posted my own repos. I\u0027ll do that now.\u003C/p\u003E\u003Cp\u003EThe ST code is a bit weird, mind; when I first added the SRB it was a real hack, because I\u0027m using the RT-10 model just for the nozzle. I never had the time to make my own nozzle and set it up in Unity. I mean, all my changes to ST started out as minor patches to AncientGammoner\u0027s code, so they\u0027re all rather hacky. I apologize for the mess. :S\u003C/p\u003E\n"},{"CreatedByName":"e-dog","CreatedById":73796,"CreatedDateTime":"2013-11-15T22:55:49Z","Content":"\n\u003Cp\u003EYeah, that\u0027s why I said it need refactoring \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m not sure about today, but I might look into that tomorrow.\u003C/p\u003E\u003Cp\u003ESend me a link to the repo when you have it.\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-11-15T22:58:43Z","Content":"\n\u003Ca href=\u0022https://github.com/NathanKell/StretchySRB\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/NathanKell/StretchySRB\u003C/a\u003E\n"},{"CreatedByName":"pina_coladas","CreatedById":9346,"CreatedDateTime":"2013-11-16T03:15:50Z","Content":"\n\u003Cp\u003EThanks for doing this you guys. It\u0027s so good to see deeper integration/synergy between all these must-have mods.\u003C/p\u003E\n"},{"CreatedByName":"7499275","CreatedById":70640,"CreatedDateTime":"2013-11-17T12:46:46Z","Content":"\n\u003Cp\u003EI have deadly reentry installed and my question is if I have this installed with fairings over my payload will the fairing take the heat or will the payload still take the heat?\u003C/p\u003E\n"},{"CreatedByName":"Lexif","CreatedById":65533,"CreatedDateTime":"2013-11-17T12:51:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00227499275\u0022 data-cite=\u00227499275\u0022\u003E\u003Cdiv\u003EI have deadly reentry installed and my question is if I have this installed with fairings over my payload will the fairing take the heat or will the payload still take the heat?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn my experience the fairings get hot, not the payload.\u003C/p\u003E\n"},{"CreatedByName":"7499275","CreatedById":70640,"CreatedDateTime":"2013-11-17T12:54:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Lexif\u0022 data-cite=\u0022Lexif\u0022\u003E\u003Cdiv\u003EIn my experience the fairings get hot, not the payload.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAlright, thank you. My SRB\u0027s on my launches commonly get a craft flying too fast and I get too much heat on the top of the pay load.\u003C/p\u003E\n"},{"CreatedByName":"HafCoJoe","CreatedById":80363,"CreatedDateTime":"2013-11-22T02:35:44Z","Content":"\n\u003Cp\u003EBIG BUG/Annoying bug\u003C/p\u003E\u003Cp\u003EIf you radially attach fairings (if you add a fairing to a tank attached to the side of your rocket rather than the middle) and add on covers, they infinitely expand thinking your rocket is infinitely wide. \u003C/p\u003E\u003Cp\u003EAlso if there was an option to make the fairings not stop at a minimum width that would be extremely useful as I cannot cover only part of my payload. (I want fuel tanks outside the fairing but the fairing only stops halfway through them.)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-22T20:11:08Z\u0022 title=\u002211/22/2013 08:11  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 22, 2013\u003C/time\u003E by Avera9eJoe\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"deepspacecreeper","CreatedById":84329,"CreatedDateTime":"2013-11-22T04:31:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022e-dog\u0022 data-cite=\u0022e-dog\u0022\u003E\u003Cdiv\u003EFairing colliders are very approximate because Unity isn\u0027t very good with concave colliders.\u003Cp\u003EYou should strut your payload or use Kerbal Joints Reinforcement mod. Or both.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ethen how should i strut the payload to the interior of fairing cones? the VAB won\u0027t let me do that.\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2013-11-22T08:03:23Z","Content":"\n\u003Cp\u003EStrut it to the Fairing base (start strut on the base to not have it stick to your payload after seperation) or anything else below - struts might poke out/into the fairing when doing the latter, but this does not necessarily look ugly. Should be enough to lower wobble.\u003C/p\u003E\n"},{"CreatedByName":"e-dog","CreatedById":73796,"CreatedDateTime":"2013-11-22T08:05:53Z","Content":"\n\u003Cp\u003EAlso \u003Ca href=\u0022http://kerbalspaceprogram.com/kerbal-joint-reinforcement/\u0022 rel=\u0022external nofollow\u0022\u003EKerbal Joint Reinforcement\u003C/a\u003E helps a lot, even without struts.\u003C/p\u003E\n"},{"CreatedByName":"HafCoJoe","CreatedById":80363,"CreatedDateTime":"2013-11-22T20:15:52Z","Content":"\n\u003Cp\u003EAnyone know a way to turn off auto-adjusting fairings? I am having troubles wit covering portions of a craft (I.E. a cargo bay surrounded by fuel tanks) becuase the fairing tries to cover the fuel tanks along with the bay. Also locking the fairing doesn\u0027t seem to work. Is it \u0022I\u0022 or \u0022L\u0022? I would guess L...\u003C/p\u003E\n"},{"CreatedByName":"softweir","CreatedById":2795,"CreatedDateTime":"2013-11-23T03:15:19Z","Content":"\n\u003Cp\u003E\u0022L\u0022 locks the shape. You could build your craft without the fuel tanks, place ONE fairing (turn off symmetry to do that), lock it\u0027s shape, pull it off, add the fuel tanks, then replace the fairing with symmetry on.\u003C/p\u003E\u003Cp\u003EYou can adjust the fairing shape by hovering over the fairing base, holding down \u0022R\u0022 and moving the mouse up/down to increase/reduce the radius.\u003C/p\u003E\n"},{"CreatedByName":"HafCoJoe","CreatedById":80363,"CreatedDateTime":"2013-11-23T06:09:41Z","Content":"\n\u003Cp\u003EThanks softweir I just found out how to lock on my own and I already knew the basic \u0022r\u0022 and \u0022y\u0022 and \u0022n\u0022 and the rest of the keys \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"ChronicSilence","CreatedById":19852,"CreatedDateTime":"2013-11-24T16:54:16Z","Content":"\n\u003Cp\u003EQuick question: can anyone tell me what the difference is between \u0022Interstage Fairing Adapter\u0022 and \u0022Interstage Shroud 2-side\u0022? Is it only that one has 4 fairings and one has 2, or is there something else?\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-11-24T17:29:53Z","Content":"\n\u003Cp\u003EThe shroud is something I added in RO: Until e-dog makes the floating-node decoupler toggleable (i.e. toggle between \u0022fairings hold payload in place\u0022 and \u0022firing decoupler actually decouples stage, even with fairings attached\u0022), I made that part to put the interstage decoupler on the nonfloating top node so you can decouple while keeping the shroud in place.\u003C/p\u003E\n"},{"CreatedByName":"LMA","CreatedById":75775,"CreatedDateTime":"2013-11-28T10:25:49Z","Content":"\n\u003Cp\u003EThis is a great mod.\u003C/p\u003E\u003Cp\u003EAny chance of a procedural heat shield to help with Deadly Reentry mod?\u003C/p\u003E\n"},{"CreatedByName":"e-dog","CreatedById":73796,"CreatedDateTime":"2013-11-28T10:27:40Z","Content":"\n\u003Cp\u003EYeah, heat shield is planned, but I think procedural shrouded decouplers and engine plates will come first.\u003C/p\u003E\n"},{"CreatedByName":"Umlüx","CreatedById":69703,"CreatedDateTime":"2013-11-28T11:40:23Z","Content":"\n\u003Cp\u003Eafter procedural fairings, wings and tanks... you know what would be awesome to have?\u003C/p\u003E\u003Cp\u003Eprocedural girders!\u003C/p\u003E\n"},{"CreatedByName":"e-dog","CreatedById":73796,"CreatedDateTime":"2013-11-28T11:43:31Z","Content":"\n\u003Cp\u003EYeah, but there are still no procedural wings with built-in procedural control surfaces. And I want procedural spaceplane fuselages and cargo bays.\u003C/p\u003E\n"},{"CreatedByName":"Umlüx","CreatedById":69703,"CreatedDateTime":"2013-11-28T13:57:42Z","Content":"\n\u003Cp\u003Eand soon we will have a whole new game. KSP - Kerbal Space Procedurals \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"AbeS","CreatedById":80644,"CreatedDateTime":"2013-11-28T15:14:56Z","Content":"\n\u003Cp\u003Ee-dog, shouldn\u0027t the interstage adapter decouple what is in the \u0027floating\u0027 node when using fuselage fairings? Because if I use normal fairings, and put them in a stage after the adapter\u0027s decoupler, I can decouple the stage without decoupling the fairings. But with the structural ones it won\u0027t decouple, shouldn\u0027t it be the same?\u003C/p\u003E\n"},{"CreatedByName":"e-dog","CreatedById":73796,"CreatedDateTime":"2013-11-28T15:17:16Z","Content":"\n\u003Cp\u003EIt might be auto-struts holding it. Anyway, I\u0027ll check that.\u003C/p\u003E\n"}]}