{"TopicId":37449,"ForumId":34,"TopicTitle":"[1.0.5] TAC Life Support v0.11.2.1 [12Dec]","CreatedByName":"TaranisElsu","CreatedById":57742,"CreatedDateTime":"2013-07-17T16:20:54Z","PageNum":112,"Articles":[{"CreatedByName":"HeckuvaTester","CreatedById":138862,"CreatedDateTime":"2015-04-30T02:53:31Z","Content":"\n\u003Cp\u003EYAYYY!! Proper life support for all!\u003C/p\u003E\n"},{"CreatedByName":"StevenJ","CreatedById":114626,"CreatedDateTime":"2015-04-30T03:05:23Z","Content":"\n\u003Cp\u003ETaranisElsu\u003C/p\u003E\u003Cp\u003Ethanks a lot for considering it. As with TAC LS I want the ability to refill life support off world. Then all i will need is a simple greenhouse mod and full sustainable colonies with minimal mod foot print is possible with TAC LS\u003C/p\u003E\n"},{"CreatedByName":"shmameron","CreatedById":78025,"CreatedDateTime":"2015-04-30T04:51:54Z","Content":"\n\u003Cp\u003EYes! Thank you! Looking forward to using this, and also looking forward to future compatibility with stock resources. Self-sustaining colonies will be awesome!\u003C/p\u003E\n"},{"CreatedByName":"munseeker","CreatedById":110850,"CreatedDateTime":"2015-04-30T05:02:22Z","Content":"\n\u003Cp\u003ETaranisElsu - Thanks for the great work. Love, love, love this mod!\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022StevenJ\u0022 data-cite=\u0022StevenJ\u0022\u003E\u003Cdiv\u003EThen all i will need is a simple greenhouse mod and full sustainable colonies with minimal mod foot print is possible with TAC LS\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E(Cough)... There is \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/84246-0-90-MunSeeker-Mk1-Greenhouse-%28TAC-Life-Support-0-10-1-add-on%29-Update-Nov-1-2014\u0022 rel=\u0022external nofollow\u0022\u003Emy simple Greenhouse\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m right now testing if it works with 1.0 and the new TAC LS release, but early indications are good. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2015-04-30T05:05:09Z","Content":"\n\u003Cp\u003EOne fast question, would it be plausible to have an converter from oxidizer to oxygen? This is more relevant now then we can mine oxidizer in stock.\u003C/p\u003E\u003Cp\u003EAdd fuel\u002B oxidizer into water too, same reason, even if fuel is a hydrocarbon you should get water as part of the output. \u003C/p\u003E\u003Cp\u003EYes this would simplify supply situation but you would still need food, the recylers make oxygen and water demands low compared to food anyway.\u003C/p\u003E\n"},{"CreatedByName":"StevenJ","CreatedById":114626,"CreatedDateTime":"2015-04-30T05:09:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022munseeker\u0022 data-cite=\u0022munseeker\u0022\u003E\u003Cdiv\u003ETaranisElsu - Thanks for the great work. Love, love, love this mod!\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E(Cough)... There is \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/84246-0-90-MunSeeker-Mk1-Greenhouse-%28TAC-Life-Support-0-10-1-add-on%29-Update-Nov-1-2014\u0022 rel=\u0022external nofollow\u0022\u003Emy simple Greenhouse\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m right now testing if it works with 1.0 and the new TAC LS release, but early indications are good. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes i have used your munar greenhouse before and it\u0027s nice and simple. Though I have taken a liking to MKS OKs in .90 but I don\u0027t like the part heavy direction rover dude is going. I got enough mods I want to install lol. I think I\u0027ll take it a bit \u0027simpler\u0027 this time and just use your module. It\u0027s awesome.\u003C/p\u003E\n"},{"CreatedByName":"Cairan","CreatedById":85361,"CreatedDateTime":"2015-04-30T05:41:50Z","Content":"\n\u003Cp\u003EI am -so- happy you upgraded this! Now I just need to write up some converter config files to convert \u0022Supplies\u0022 to Food, Water and Oxygen and vice versa for RoverDude\u0027s split from the TAC-LS resources with his Mulch/Supplies simplified model...\u003C/p\u003E\n"},{"CreatedByName":"greystork","CreatedById":131085,"CreatedDateTime":"2015-04-30T06:34:35Z","Content":"\n\u003Cp\u003EAwesome, thanks for the update!\u003C/p\u003E\u003Cp\u003ELet me just seize this opportunity to lobby for moving large containers to a more kerbonaut-centric node, like for instance Space Exploration...\u003C/p\u003E\u003Cp\u003EThanks again!\u003C/p\u003E\n"},{"CreatedByName":"Galileo Kerbonaut","CreatedById":65299,"CreatedDateTime":"2015-04-30T08:43:51Z","Content":"\n\u003Cp\u003EI am very happy this is updated. This is one of my essentials. Thanks.\u003C/p\u003E\n"},{"CreatedByName":"Shrike99","CreatedById":101993,"CreatedDateTime":"2015-04-30T09:10:31Z","Content":"\n\u003Cp\u003EIm trying to use TAC with the new horizons planet pack, and it seemed to be working fine, but i recently found that one of the planets that supposedly had a breathable atmosphere, Arin, However, it appears that as Tac is configured to only allow Kerbals on EVA to breathe on Kerbin, as Laythe has a toxic component in its air, and this setting seems to apply to other planets as well.\u003C/p\u003E\u003Cp\u003EAnyway, my questions is, how can i set an exception to this behavior?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-04-30T11:15:23Z\u0022 title=\u002204/30/2015 11:15  AM\u0022 data-short=\u00229 yr\u0022\u003EApril 30, 2015\u003C/time\u003E by Shrike99\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"diomedea","CreatedById":93700,"CreatedDateTime":"2015-04-30T10:34:42Z","Content":"\n\u003Cp\u003EThanks TaranisElsu for the update. This is one add-on I can\u0027t do without while playing KSP for myself.\u003C/p\u003E\n"},{"CreatedByName":"Luka 999","CreatedById":127252,"CreatedDateTime":"2015-04-30T14:18:39Z","Content":"\n\u003Cp\u003EDoes the mod work whit USI kolonization system?\u003C/p\u003E\n"},{"CreatedByName":"rabidninjawombat","CreatedById":108889,"CreatedDateTime":"2015-04-30T14:23:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Luka 999\u0022 data-cite=\u0022Luka 999\u0022\u003E\u003Cdiv\u003EDoes the mod work whit USI kolonization system?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt does. Though with Roverdudes new USI-Life support sytsem its no longer the default system. If you have TAC-LS installed the Kolonzation parts should automatically adapt to use TAC-LS\u003C/p\u003E\n"},{"CreatedByName":"OzoneGrif","CreatedById":142389,"CreatedDateTime":"2015-04-30T15:47:28Z","Content":"\n\u003Cp\u003EThanks for the update.\u003C/p\u003E\u003Cp\u003EIt would be amazing to have TAC parts in their own category, instead of in Utilities.\u003C/p\u003E\u003Cp\u003EInfernal Robotics did it for its parts, and it\u0027s just an amazing idea to clear up the editor.\u003C/p\u003E\n"},{"CreatedByName":"Bersagliere81","CreatedById":133821,"CreatedDateTime":"2015-04-30T16:42:53Z","Content":"\n\u003Cp\u003EOne of my most favourite mods ever.\u003C/p\u003E\u003Cp\u003EHowever I am experiencing an issue, and it is strange as yesterday it did work perfectly (i reinstalled everything again today)\u003C/p\u003E\u003Cp\u003EI have the mod unzipped in the ksp/gamedata folder as usual, having ksp/gamedata/ThunderAerospace and the 5 subdirectories. All subdirectories seem to be good, however according to the installation tutorial, the taclifesupport.dll is missing.\u003C/p\u003E\u003Cp\u003EIn fact, when I run the game, I don\u0027t get that \u0022info\u0022 pop up message the very first time, and I don\u0027t have the icon in the blizzy\u0027s toolbar\u003C/p\u003E\u003Cp\u003EEdit: I have found the -possible- issue. There are two downloadable links, the first one (curse link) appears to have the .dll file missing, but the second link is ok. However, while game is loading, a popup message says the .dll file is incorrect (or missing can\u0027t remember)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-04-30T17:24:24Z\u0022 title=\u002204/30/2015 05:24  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 30, 2015\u003C/time\u003E by Bersagliere81\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"jofwu","CreatedById":94705,"CreatedDateTime":"2015-04-30T17:42:34Z","Content":"\n\u003Cp\u003ECan anybody help me out with a MM config to put TAC LS resources in all parts that hold crew? That is, resources plus room for waste resources. Haven\u0027t played with MM configs in a while to remember how, and I\u0027m not sure what amounts would be balanced.\u003C/p\u003E\u003Cp\u003EI think the Hitchhiker doesn\u0027t come with any. And I use Stockalike Station Parts which include many crew-holding parts but no resources. I prefer to store TAC LS stuff in these sort of parts and only resort to the \u0022tanks\u0022 when necessary.\u003C/p\u003E\u003Cp\u003EAs an added hurdle, I suppose I don\u0027t want to write over parts that already include TAC LS resources, and I suppose the in-line airplane crew parts should be limited or skipped.\u003C/p\u003E\u003Cp\u003EAny help would be appreciated. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Cdr_Zeta","CreatedById":59015,"CreatedDateTime":"2015-04-30T18:11:43Z","Content":"\n\u003Cp\u003EHello,\u003C/p\u003E\u003Cp\u003EYa that is the @Part stuff in a CFG you can add; there should be example cfg like this in TACLIFE; simply add the part you want to have Life Support in ! In fact it should be there unless has crew cpacity is missing in the units you want food in etc...see the main cfg files in TACLIFE. There might be 2 or 3 cfg\u0027s from what I am looking at that you have to add to.\u003C/p\u003E\u003Cp\u003ECmdr Zeta\u003C/p\u003E\n"},{"CreatedByName":"jofwu","CreatedById":94705,"CreatedDateTime":"2015-04-30T22:51:38Z","Content":"\n\u003Cp\u003EThanks for the pointer! Another question... Anybody know of any code which puts the TAC LS parts into a separate category? (still under \u0022functions,\u0022 not one of the user created custom things) Like what RealChutes does? Sure would be nice to declutter that utilities category list...\u003C/p\u003E\n"},{"CreatedByName":"Sandworm","CreatedById":66244,"CreatedDateTime":"2015-05-01T02:00:04Z","Content":"\n\u003Cp\u003EI just updated the stockalike containers. Textures are not great yet but they are all 1.0-functional. \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/115126-Stockalike-TAC-Containers-09-04-2015-v0-1\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/115126-Stockalike-TAC-Containers-09-04-2015-v0-1\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"rennsport27","CreatedById":108383,"CreatedDateTime":"2015-05-01T03:31:00Z","Content":"\n\u003Cp\u003EDownloaded, and it seems to be working great so far. Thanks for the update!\u003C/p\u003E\n"},{"CreatedByName":"Andy81le","CreatedById":95393,"CreatedDateTime":"2015-05-01T12:45:22Z","Content":"\n\u003Cp\u003EWould it be possible to develop some way that, when a Kerbal is on a planet with a breathable atmosphere, he or she can \u0027remove\u0027 her suit in a sens as to deactivate life support since it is not necessary anymore (except maybe for water and food)?\u003C/p\u003E\u003Cp\u003EEdit: Nevermind, it does this already. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Cdr_Zeta","CreatedById":59015,"CreatedDateTime":"2015-05-01T16:44:32Z","Content":"\n\u003Cp\u003EHello,\u003C/p\u003E\u003Cp\u003EWell I dont know I thought Kerbin was the only planet to support them; Laythe is not supposed to have air; I could be wrong.\u003C/p\u003E\u003Cp\u003EI am looking at the update...the rate changes would affect my work...I will probly stick with what I have but I will look at it; I probly dont need to update I dont know a far as the dll...\u003C/p\u003E\u003Cp\u003ETACLIFE is my main resource for Life Support Thank You !\u003C/p\u003E\u003Cp\u003EWait til you see what I have done with it in my BioMass Greenhouse...\u003C/p\u003E\u003Cp\u003EI have added constraints now as well - Food/Water have a lifespan of 30 days; then they must be recycled if not used ! I use MRE\u0027s now !! Food is converted to freeze-dried MRE\u0027s which last...well a long time ! Those are my snacks - Ugh !\u003C/p\u003E\u003Cp\u003ECmdr Zeta\u003C/p\u003E\n"},{"CreatedByName":"Pyromaniacal","CreatedById":57241,"CreatedDateTime":"2015-05-01T19:50:46Z","Content":"\n\u003Cp\u003EHey, I just ran into a problem. I\u0027m running KSP 1.0.1, and as I try to start up the game, I keep getting a popup telling me that the version of KSP is unsupported. I have made sure that I have the latest version installed, but I have no idea what to do. Any suggestions?\u003C/p\u003E\n"},{"CreatedByName":"Silent_Thunder","CreatedById":734,"CreatedDateTime":"2015-05-01T20:16:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pyromaniacal\u0022 data-cite=\u0022Pyromaniacal\u0022\u003E\u003Cdiv\u003EHey, I just ran into a problem. I\u0027m running KSP 1.0.1, and as I try to start up the game, I keep getting a popup telling me that the version of KSP is unsupported. I have made sure that I have the latest version installed, but I have no idea what to do. Any suggestions?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe files have the version number inside them. Assuming the mod itself works fine, the update would just be changing that internal number to tell KSP it\u0027s all ok. I\u0027m getting that alert with some .9 mods that still work (graphical mods are much less version sensitive)\u003C/p\u003E\n"},{"CreatedByName":"Booots","CreatedById":62446,"CreatedDateTime":"2015-05-01T22:54:15Z","Content":"\n\u003Cp\u003EI\u0027m just getting into life support and so far I really like TAC-LS. Using EL, I typically colonize moons in short order and used to imagine them to be self-sustaining but now I have to ensure that they actually are. I\u0027ve seen biomass for food (and plan on getting it once it\u0027s updated), but are there any good mods for extracting water and oxygen or carbon dioxide from the atmospheres/crust/oceans of other planets and moons? Preferably using the new stock resource system if there are any in development for that. Thanks!\u003C/p\u003E\u003Cp\u003EEDIT: Or asteroids too!\u003C/p\u003E\n"}]}