{"TopicId":37449,"ForumId":34,"TopicTitle":"[1.0.5] TAC Life Support v0.11.2.1 [12Dec]","CreatedByName":"TaranisElsu","CreatedById":57742,"CreatedDateTime":"2013-07-17T16:20:54Z","PageNum":3,"Articles":[{"CreatedByName":"InfinityArch","CreatedById":66832,"CreatedDateTime":"2013-08-13T21:22:45Z","Content":"\n\u003Cp\u003EI\u0027d really like to use this mod, but there are two outstanding issues I see with it;\u003C/p\u003E\u003Cp\u003EA. The current parts have rather ugly models; hopefully at some point a seasoned modeler might be able to help you out.\u003C/p\u003E\u003Cp\u003EB. More importantly, there\u0027s no way to create a closed circle life support system, and this no way to have permanent off-world colonies. This also looks as if if\u0027d make interplanetary missions quite difficult.\u003C/p\u003E\u003Cp\u003EFor the second issue what I\u0027d suggest would be 5 modules for this purpose:\u003C/p\u003E\u003Cp\u003EFirst would be a fuel cell module, which consumes liquid fuel and oxidizer to produce electricity and water.\u003C/p\u003E\u003Cp\u003ESecond would be the compressor/decompressor module, which can be used to convert oxidizer into breathable \u0022oxium\u0022 (to use the Kerbal term for it), or vice-versa in the case of excess \u0022oxium\u0022 supplies. Compressing oxium to oxidizer naturally uses a lot of electricity, while decompressing it consumes significantly less, only requiring you to heat the oxium to usable temperatures.\u003C/p\u003E\u003Cp\u003EAfter that, we start getting into more advanced and long-term, but extremely heavy and power hungry life support systems capable of recycling the waste produced by kerbals.\u003C/p\u003E\u003Cp\u003EThe third part I had in mind would be the waste processing module, which would use electricity to recycle waste water into regular water plus solid waste which can be dumped or further defined.\u003C/p\u003E\u003Cp\u003EThe fourth module would be a waste processing module, which, with an input of electricity, converts waste into fertilizer.\u003C/p\u003E\u003Cp\u003EThe fifth and final of these life support related modules would be a hydroponics tank, which uses water, carbon dioxium, fertilizer derived from waste, and either sun exposure or electricity depending on the specific part used to produce food, oxium, and a refund of the water consumed by the module. This module would, unlike other life support systems, produce large amounts of its product at regular, albeit long intervals, rather than producing a steady trickle of product.\u003C/p\u003E\u003Cp\u003EFor the purposes of realism, I\u0027d suggest introducing a small \u0022leak\u0022 from the above cycle to represent inefficiencies, requiring either occasional resupply trips or utilization of locally available resources.\u003C/p\u003E\n"},{"CreatedByName":"goldenpeach","CreatedById":34566,"CreatedDateTime":"2013-08-13T22:13:59Z","Content":"\n\u003Cp\u003EI think that the three day worth of support in all pod is a little too much:I can make an apollo style munar mission without ading anything to my rocket designed in my main save(wich mean:without any life support added).\u003C/p\u003E\u003Cp\u003EIs there a way to edit that quantity of life support worth?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-13T22:26:03Z\u0022 title=\u002208/13/2013 10:26  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 13, 2013\u003C/time\u003E by goldenpeach\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sidfu","CreatedById":70409,"CreatedDateTime":"2013-08-13T23:16:45Z","Content":"\n\u003Cp\u003Ethe 3 days worth inside teh cabin is fine. this is to add some realism to the game not make it competely realistic. \u003C/p\u003E\u003Cp\u003E@infinityarch there no such thing as a compeltly closed loop system right now. always there is lose at one part of it or another. on textures of cans they are fine. better to do textures last and have working mod than awsome textures and a half-assed mod.\u003C/p\u003E\n"},{"CreatedByName":"goldenpeach","CreatedById":34566,"CreatedDateTime":"2013-08-13T23:36:53Z","Content":"\n\u003Cp\u003EThe three day is not realistic:the apollo command module(the pod) has only a few hours worth of life support.\u003C/p\u003E\n"},{"CreatedByName":"InfinityArch","CreatedById":66832,"CreatedDateTime":"2013-08-13T23:38:16Z","Content":"\n\u003Cp\u003E@sidfu: I\u0027m aware of that, but as I said, there should be, for the purpose of realism, some inefficiencies that cause you to gradually loose resources in this life support model. Even if it\u0027s 10% lost per cycle, that\u0027s still 10x longer endurance for a vessel, which will make missions to Jool significantly more forgiving on life support budgets.\u003C/p\u003E\n"},{"CreatedByName":"Climberfx","CreatedById":57126,"CreatedDateTime":"2013-08-13T23:58:49Z","Content":"\n\u003Cp\u003EGreat stuff, The complete perpetual circle will be perfect for long travels...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-27T07:21:35Z\u0022 title=\u002208/27/2013 07:21  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 27, 2013\u003C/time\u003E by Climberfx\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"InfinityArch","CreatedById":66832,"CreatedDateTime":"2013-08-14T00:21:43Z","Content":"\n\u003Cp\u003E@sidfu: I\u0027m aware of that, but as I said, there should be, for the purpose of realism, some inefficiencies that cause you to gradually loose resources in this life support model. Even if it\u0027s 10% lost per cycle, that\u0027s still 10x longer endurance for a vessel, which will make missions to Jool significantly more forgiving on life support budgets.\u003C/p\u003E\n"},{"CreatedByName":"goldenpeach","CreatedById":34566,"CreatedDateTime":"2013-08-14T00:25:57Z","Content":"\n\u003Cp\u003EIs there a way to edit the amount of life support in the commands pods?\u003C/p\u003E\u003Cp\u003EEven if there is no way to do that,it\u0027s a great mod that add some interesting challenge!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-14T00:40:50Z\u0022 title=\u002208/14/2013 12:40  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 14, 2013\u003C/time\u003E by goldenpeach\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RuBisCO","CreatedById":59540,"CreatedDateTime":"2013-08-14T00:52:24Z","Content":"\n\u003Cp\u003EI believe \u0022closed\u0022 cycles should be possible once on a planet and undertaking autonomous resource mining, Also virtually 100% closed cycles would make ark ships possible and as a matter of game play that would be fun, regardless if it arguable that no cycle could be 100% IRL.\u003C/p\u003E\n"},{"CreatedByName":"CoriW","CreatedById":57866,"CreatedDateTime":"2013-08-14T01:41:29Z","Content":"\n\u003Cp\u003EHey I was just looking at this forum thread and an idea hit me, if the Co2 is stored onboard with any excess being dumped into space, what if instead you make an RCS system that uses that stored Co2 instead of MonoPropellant? Since theoretically it should work in a very similar manner since either way your spraying a gas out into space to maneuver.\u003C/p\u003E\n"},{"CreatedByName":"InfinityArch","CreatedById":66832,"CreatedDateTime":"2013-08-14T17:45:28Z","Content":"\n\u003Cp\u003E^ The problem with that is that mono-propellant RCS systems actually involve a reaction. Generally what happens is the mono-propellant is passed across a catalyst which causes it to energetically decompose.\u003C/p\u003E\n"},{"CreatedByName":"goldenpeach","CreatedById":34566,"CreatedDateTime":"2013-08-14T19:22:10Z","Content":"\n\u003Cp\u003ESome RCS are made from pressurized gas,also I think it would be kerbal to use the CO2 as a RCS fuel.\u003C/p\u003E\u003Cp\u003Ebill:\u0022oh no! we\u0027re out of RCS,we can\u0027t dock with the CSM to return on kerbin!!!\u0022\u003C/p\u003E\u003Cp\u003Ejeb:\u0022breath,just breath\u0022\u003C/p\u003E\n"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2013-08-14T19:25:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022goldenpeach\u0022 data-cite=\u0022goldenpeach\u0022\u003E\u003Cdiv\u003ESome RCS are made from pressurized gas,also I think it would be kerbal to use the CO2 as a RCS fuel.\u003Cp\u003Ebill:\u0022oh no! we\u0027re out of RCS,we can\u0027t dock with the CSM to return on kerbin!!!\u0022\u003C/p\u003E\u003Cp\u003Ejeb:\u0022breath,just breath\u0022\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOr maybe Jeb takes one for the team by facing away from the direction they want to travel and opens up his helmet...\u003C/p\u003E\n"},{"CreatedByName":"goldenpeach","CreatedById":34566,"CreatedDateTime":"2013-08-14T22:58:34Z","Content":"\n\u003Cp\u003EI think jeb would make an EVA and use the \u0022jetpack\u0022 to control the craft.\u003C/p\u003E\u003Cp\u003EGood luck for docking that way!\u003C/p\u003E\n"},{"CreatedByName":"betaking","CreatedById":58281,"CreatedDateTime":"2013-08-15T07:20:23Z","Content":"\n\u003Cp\u003EI tend to think that perhaps capsules should have all the food they need to survive, but not the oxygen ect..\u003C/p\u003E\u003Cp\u003Ethough its hard to say due to the the currently clunky and kinda inflexible nature of parts in the game. \u003C/p\u003E\u003Cp\u003E(I for one hope we get some kind of in-game proceedural part maker, one that can make module exteriors and interiors, as well as the layer in between)\u003C/p\u003E\n"},{"CreatedByName":"nothke","CreatedById":51185,"CreatedDateTime":"2013-08-15T09:38:48Z","Content":"\n\u003Cp\u003EOk, here\u0027s several things I\u0027d like to add to this nice and promising mod:\u003C/p\u003E\u003Cp\u003E- It\u0027s not about how much there is, it is about how much it\u0027s consumed. Don\u0027t forget that there are X buttons for resources, if you prevent them from running out, the mod will still think everything is ok cause the resource is still there.. Except it\u0027s not consumed, it\u0027s not flowing. The LS clock will stop. Practically Kerbals now live forever.\u003C/p\u003E\u003Cp\u003E- Make the mod bound to the universal clock when leaving the craft. I don\u0027t know how hard is it to do this, but I guess it is possible. If your Kerbal is dying and you leave the craft and return, the clock will reset. There should be a way to run the clocks in the background. or at least mark the universal time when the clock runs out, and then on loading count if the Kerbals are dead now or not.\u003C/p\u003E\u003Cp\u003E- If a Kerbal enters a craft that has no LS resources from EVA, there will be a message stating \u0022there is no water/air/food\u0022, it\u0027s sort of strange cause the Kerbal had 12 hours of supplies during EVA and now has none.. If I were a Kerbonaut I\u0027d put my helmet on and stay inside rather than being out on the radiation and micrometeoroid shower. So right now, it\u0027s better to stay outside than inside. This problem doesn\u0027t need to be tackled cause it\u0027s ok in Kerbalworld, but I\u0027m just noting it\u0027s a bit silly\u003C/p\u003E\u003Cp\u003E- In my opinion, solid waste should not be transported over pipes. It\u0027s solid isn\u0027t it? Now you can basically connect the KAS cable to a ship and transport solid waste over it from a tank to a tank. In my opinion, you should think more when handling solid waste instead, so that you need to make detachable tanks that you can fill up with waste and throw out later or use upcoming \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/27587-WIP-KASPAR-Portable-Payload-Racks\u0022 rel=\u0022external nofollow\u0022\u003EKASPAR racks\u003C/a\u003E to move the waste from ship to ship.\u003C/p\u003E\u003Cp\u003EPS. I sent a message to TaranisElsu about modelling support, I\u0027d like to help. Not sure if you\u0027ve seen it =)\u003C/p\u003E\n"},{"CreatedByName":"kookoo_gr","CreatedById":57720,"CreatedDateTime":"2013-08-15T10:14:30Z","Content":"\n\u003Cp\u003Ea question how many resources does a kerbal consume per day?\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-08-15T10:22:10Z","Content":"\n\u003Cp\u003EI think it should be at most half of daily portion for a human. If i remember correctly it was calculated as (circa) 1,5 kilo of food, 2 liters of water. I don\u0027t remember how much oxygen a human uses in one day.\u003C/p\u003E\n"},{"CreatedByName":"InfinityArch","CreatedById":66832,"CreatedDateTime":"2013-08-15T16:04:02Z","Content":"\n\u003Cp\u003ESo I just noticed the tanks from this plugin say things like \u0022oxygen\u0022 and \u0022carbon dioxide\u0022, when the kerbal terms for those chemicals are \u0022oxium\u0022 and presumably \u0022carbon dioxium\u0022.\u003C/p\u003E\n"},{"CreatedByName":"Moon Goddess","CreatedById":57446,"CreatedDateTime":"2013-08-15T16:35:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022InfinityArch\u0022 data-cite=\u0022InfinityArch\u0022\u003E\u003Cdiv\u003ESo I just noticed the tanks from this plugin say things like \u0022oxygen\u0022 and \u0022carbon dioxide\u0022, when the kerbal terms for those chemicals are \u0022oxium\u0022 and presumably \u0022carbon dioxium\u0022.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t think we can assume that Oxium is just another word for oxygen. In the Kerbal universe water is made of Oxium and Propellium, and Propelliums doesn\u0027t operate in any way like hydrogen, closer to a hydrocarbon. \u003C/p\u003E\u003Cp\u003ESo I contend that the Kerbal universe has it\u0027s own chemistry, we know it\u0027s laws of physics are different than our dimension, clearly it\u0027s elements are too.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-15T16:41:16Z\u0022 title=\u002208/15/2013 04:41  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 15, 2013\u003C/time\u003E by Moon Goddess\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"InfinityArch","CreatedById":66832,"CreatedDateTime":"2013-08-15T17:03:23Z","Content":"\n\u003Cp\u003E^ How so? Propellium burning rockets have ISPs on par with LH2 rockets IRL, and there\u0027s no reason to assume it isn\u0027t stored cryogenically.\u003C/p\u003E\n"},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2013-08-15T22:00:27Z","Content":"\n\u003Cp\u003EQuick question here, what effect will this mod have on existing FLIGHTS? I have several manned relay stations on the surface for remote tech that I don\u0027t really \u0022maintain,\u0022 or want to. Will installing this suddenly cause them to consume resources in the background?\u003C/p\u003E\n"},{"CreatedByName":"Crater","CreatedById":48907,"CreatedDateTime":"2013-08-16T08:26:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CatastrophicFailure\u0022 data-cite=\u0022CatastrophicFailure\u0022\u003E\u003Cdiv\u003EQuick question here, what effect will this mod have on existing FLIGHTS? I have several manned relay stations on the surface for remote tech that I don\u0027t really \u0022maintain,\u0022 or want to. Will installing this suddenly cause them to consume resources in the background?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe bad news is that when you install the mod, all your existing crews develop a sudden interest in breathing, eating, and drinking.\u003C/p\u003E\u003Cp\u003EThe slightly better news is that, as it says in the OP\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TaranisElsu\u0022 data-cite=\u0022TaranisElsu\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E[*]Kerbals will not start requiring resources until the first time that you focus the vessel, or get close enough that it loads -- within the 2.3 km load distance.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhich means that once you install it, don\u0027t load any craft in flight until you\u0027re docking their first resupply vessel with them.... and resupply EVERYONE.\u003C/p\u003E\n"},{"CreatedByName":"alexustas","CreatedById":78632,"CreatedDateTime":"2013-08-20T22:42:39Z","Content":"\n\u003Cp\u003EHi,\u003C/p\u003E\u003Cp\u003Ei make 2 samples of tanks: radial and stack mounted\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/eNMmj19.jpg\u0022 alt=\u0022eNMmj19.jpg\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/2J5W7DJ.jpg\u0022 alt=\u00222J5W7DJ.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/DGMaPAp.jpg\u0022 alt=\u0022DGMaPAp.jpg\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/Dc3DJ0t.jpg\u0022 alt=\u0022Dc3DJ0t.jpg\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/ktDbPAx.jpg\u0022 alt=\u0022ktDbPAx.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/LwUZTmN.jpg\u0022 alt=\u0022LwUZTmN.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003Eif you need, i can make complete set of different tanks in same design for crew supply.\u003C/p\u003E\u003Cp\u003EP.S. Sorry my English ))\u003C/p\u003E\n"},{"CreatedByName":"snapsi","CreatedById":79763,"CreatedDateTime":"2013-08-21T08:10:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022alexustas\u0022 data-cite=\u0022alexustas\u0022\u003E\u003Cdiv\u003E\u003Cp\u003Eif you need, i can make complete set of different tanks in same design for crew supply.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThese look great \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E - please do!\u003C/p\u003E\n"}]}