{"TopicId":3871,"ForumId":34,"TopicTitle":"[1.0.2] NovaPunch 2.09. - May 6th - 1.0 Compatibility Update","CreatedByName":"Tiberion","CreatedById":8356,"CreatedDateTime":"2011-11-14T21:58:33Z","PageNum":83,"Articles":[{"CreatedByName":"Umbra","CreatedById":57964,"CreatedDateTime":"2013-10-30T17:06:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022deknk12\u0022 data-cite=\u0022deknk12\u0022\u003E\u003Cdiv\u003EI\u0027ve had NovaPunch since .20 without any issues. But since going to .22, I deleted the old version and installed the new version. No dice, freezes during load. Deleted all my mods and started fresh, still no dice with NovaPunch (or any mod other than FASA) in .22.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have the same problem. Does someone know how to fix this? Are more people having this issue?\u003C/p\u003E\n"},{"CreatedByName":"Tiberion","CreatedById":8356,"CreatedDateTime":"2013-10-30T17:49:28Z","Content":"\n\u003Cp\u003EDo a quick test and remove the Engines folder and then try to start KSP. If it loads then your computer is running out of memory when loading the parts (.22 has bigger memory requirements)\u003C/p\u003E\u003Cp\u003EIf so, then you can grab the texture reduction pack, which shrinks the textures in the pack: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/55114-NovaPunch-2-03a-Texture-Reduction-Pack-%28Extreme%29?highlight=Novapunch\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/55114-NovaPunch-2-03a-Texture-Reduction-Pack-%28Extreme%29?highlight=Novapunch\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Ewasmic: Next thing is a a revamp of the solid boosters so they\u0027re a \u0027set\u0027 (but maintain their functions) and finishing the last coupe of engines that need graphics updates. I\u0027m also working on some preliminary designs for a new capsule/lander system, and frizzank had an idea for something cool that we won\u0027t discuss yet.\u003C/p\u003E\n"},{"CreatedByName":"XNerd_Bomber","CreatedById":54332,"CreatedDateTime":"2013-10-30T20:08:21Z","Content":"\n\u003Cp\u003EWhatever happened to your awesome shuttles, Tiberion?\u003C/p\u003E\n"},{"CreatedByName":"Tiberion","CreatedById":8356,"CreatedDateTime":"2013-10-30T20:46:54Z","Content":"\n\u003Cp\u003ENothing? Just released a new version a few days ago. Link is in my signature...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/shL8vhj.png\u0022 alt=\u0022shL8vhj.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"XNerd_Bomber","CreatedById":54332,"CreatedDateTime":"2013-10-31T01:50:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tiberion\u0022 data-cite=\u0022Tiberion\u0022\u003E\u003Cdiv\u003ENothing? Just released a new version a few days ago. Link is in my signature...\u003Cp\u003E*snip*\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESorry, I hadn\u0027t seen the thread, and spaceport has it still marked for 18.4, which made me think that you stopped updating it.\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-10-31T02:00:57Z","Content":"\n\u003Cp\u003EHey Tiberion, you might find this useful:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://docs.google.com/spreadsheet/ccc?key=0AvHneDAy4k99dHlhdktvZW1NS1lndlhNNnRwd3FEblE\u0026amp;usp=drive_web#gid=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://docs.google.com/spreadsheet/ccc?key=0AvHneDAy4k99dHlhdktvZW1NS1lndlhNNnRwd3FEblE\u0026amp;usp=drive_web#gid=0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s the sheet we use to balance things in MFS. It\u0027ll let you easily see casing % weight for your SRBs, give suggested heat values (multiply by 2 for stock KSP), and it already has the NovaPunch SRBs inputted. Note that the mass and thrust on a couple are a bit off what stats you have (bold = changed value), but I\u0027m not suggesting you change things, just saying this might help you balance them.\u003C/p\u003E\u003Cp\u003EHeck, you can use it for engines too. See the docs page for details. This was built for MFSC, but no reason it might not be of help to you now.\u003C/p\u003E\n"},{"CreatedByName":"cxg2827","CreatedById":57380,"CreatedDateTime":"2013-10-31T03:21:36Z","Content":"\n\u003Cp\u003Edoes anyone have issues with the 3-man escape tower attached to a docking port? releasing the tower has been causing my docking port to break free from the command pod.\u003C/p\u003E\u003Cp\u003EThis has only started happening in 0.22\u003C/p\u003E\n"},{"CreatedByName":"Tiberion","CreatedById":8356,"CreatedDateTime":"2013-10-31T03:49:59Z","Content":"\n\u003Cp\u003EAre you sure you aren\u0027t decoupling the docking port itself?\u003C/p\u003E\u003Cp\u003EThe included craft files should have parachute -\u0026gt; docking node -\u0026gt; escape tower and worked when I tested them.\u003C/p\u003E\n"},{"CreatedByName":"cxg2827","CreatedById":57380,"CreatedDateTime":"2013-10-31T04:03:06Z","Content":"\n\u003Cp\u003EI have the action group highlighting only the escape tower and selecting activate engine and decouple. this assembly is a MK1-2 -\u0026gt;docking port -\u0026gt; escape tower.\u003C/p\u003E\u003Cp\u003EI do have kerbaljointreinforcement V1.0 installed as well, might try upgrading it, or testing without the mod.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-31T04:24:55Z\u0022 title=\u002210/31/2013 04:24  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 31, 2013\u003C/time\u003E by cxg2827\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-10-31T04:18:42Z","Content":"\n\u003Cp\u003EThe decoupling force is too high. I had that problem too, turn the force down to 250 and it\u0027ll work.\u003C/p\u003E\n"},{"CreatedByName":"Tiberion","CreatedById":8356,"CreatedDateTime":"2013-10-31T04:54:20Z","Content":"\n\u003Cp\u003ESounds like the joint mod isn\u0027t releasing the decoupler/docking node joint (it may be a special case) and is getting ripped off by the ejection force. As long as you don\u0027t turn it down so much that it won\u0027t separate from the rocket under acceleration, should be okay.\u003C/p\u003E\u003Cp\u003EOh and thanks for the spreadsheet, I\u0027ll look it over when we start crunching numbers.\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-10-31T05:40:09Z","Content":"\n\u003Cp\u003ETiberion: I was getting that problem months ago, long before KJR and anything else. A decoupler force of 2000 is liable to pull off whatever the decoupler is attached to, and possibly even the thing below that. Took me ages to figure out just going back below 500 or so was what was required.\u003C/p\u003E\u003Cp\u003EKJR might actually _solve_ the problem, eventually, dunno. The other thing might be making sure that a part\u0027s breakingForce is higher than the decouple force?\u003C/p\u003E\u003Cp\u003EAnd you\u0027re welcome; let me know if it\u0027s unclear or you need it tweaked for your use.\u003C/p\u003E\n"},{"CreatedByName":"MDBenson","CreatedById":65560,"CreatedDateTime":"2013-10-31T07:59:18Z","Content":"\n\u003Cp\u003EI\u0027ve been meaning to ask if you intend to put in an style inline 5m 5-engine block that can be used as a second stage ala Saturn V SII Stage engines (J-2 x5)? IT\u0027d knock the part count on a large rocket down a bit, I think \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-10-31T08:09:10Z","Content":"\n\u003Cp\u003EWell, there\u0027s the _old_ 5x Bearcat. Though that by rights is 3.75m.\u003C/p\u003E\u003Cp\u003EBut...yes, please, a J-2-alike and a 5x J-2-alike would be awesome! But could they be vac-nozzles?\u003C/p\u003E\n"},{"CreatedByName":"MDBenson","CreatedById":65560,"CreatedDateTime":"2013-11-01T22:10:28Z","Content":"\n\u003Cp\u003EAccording to Wikipedia, the J-2 second stage of Saturn V ignited at 42miles which isn\u0027t in vacuum. I dunno if that has any bearing on matters? I\u0027m guessing, tho, in KSP you\u0027d be nearly out fo the atmosphere by the time you ignited it, unless you were carrying some SERIOUS payload.\u003C/p\u003E\n"},{"CreatedByName":"wasmic","CreatedById":64885,"CreatedDateTime":"2013-11-01T23:24:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MDBenson\u0022 data-cite=\u0022MDBenson\u0022\u003E\u003Cdiv\u003EAccording to Wikipedia, the J-2 second stage of Saturn V ignited at 42miles which isn\u0027t in vacuum. I dunno if that has any bearing on matters? I\u0027m guessing, tho, in KSP you\u0027d be nearly out fo the atmosphere by the time you ignited it, unless you were carrying some SERIOUS payload.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEven though 42 kilometers isn\u0027t in vacuum, it is high enough that you\u0027d die without a pressure suit, even if you had oxygen with you. It\u0027s also too high for any vehicles requiring atmospheric lift to operate.\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-11-02T00:55:16Z","Content":"\n\u003Cp\u003E42 miles _is_ Kerbin\u0027s Karman line, actually, or near enough. Even if you scale 42 miles (67.6km) to Kerbin altitude--45km--it\u0027ll still be 99.99% vacuum (literally, 0.0001 pressure). You still get drag, but it shouldn\u0027t make a difference for exhaust expansion, and thus you\u0027d want a vacuum-optimized nozzle. (Though the J-2 didn\u0027t even have fully vacuum-optimized nozzle; it still got 200s at sea level.)\u003C/p\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2013-11-02T01:21:38Z","Content":"\n\u003Cp\u003EThe newly updated Nova Punch mods have been upgraded with several new engine types including some compact Nuclear powered ones. The mods will also integrate in a logical manner into career Mode.\u003C/p\u003E\u003Cp\u003ENow, for those already into Career Mode, no problem. The parts will not be available for use until you do the science research on them. For new careers, they will be imminently available on the parts tree in a logical order. If you don\u0027t want to use them, as they will give you quite an advantage right away, you can always make them unavailable by moving the mod folder out of the KSP game folder.\u003C/p\u003E\u003Cp\u003EHere are some screen shots of what is possible.\u003C/p\u003E\u003Cp\u003ENova Punch One in the first flight of Career Mode\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ml3EnxY.jpg\u0022 alt=\u0022ml3EnxY.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENova Punch Two in the first unlocked tier of Career Mode. Note, this can achieve low 70K orbit but may leave Jeb stranded if you are not careful.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/HzAqKbU.jpg\u0022 alt=\u0022HzAqKbU.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESome new designs, a SSTO launch vehicle with the new mini four engine. It was SSTO;\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/iAl0i96.jpg\u0022 alt=\u0022iAl0i96.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd, a NERVA powered interplanetary design with a near SSTO first stage. (Brace well.)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/zCjw17M.jpg\u0022 alt=\u0022zCjw17M.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EA very small burn from the NERVA completed the 100k orbit.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/n1GO38o.jpg\u0022 alt=\u0022n1GO38o.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENote, if you update with the 0.22 release of Nova Punch, expect some older designs to not load or work properly.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-02T02:00:50Z\u0022 title=\u002211/02/2013 02:00  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 2, 2013\u003C/time\u003E by SRV Ron\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tiberion","CreatedById":8356,"CreatedDateTime":"2013-11-02T20:07:17Z","Content":"\n\u003Cp\u003EHeh thanks Ron. I quoted your post and stuck it in the 2nd post on the 1st page. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"wasmic","CreatedById":64885,"CreatedDateTime":"2013-11-02T20:29:40Z","Content":"\n\u003Cp\u003EHey Tiberion, is there any chance of getting the ares-style 5m engine back? It was really cool. Oh, and some feedback on the tech tree integration: the 2.5m engines appear VERY early in the game. Like, before the stock poodle does.\u003C/p\u003E\n"},{"CreatedByName":"Tiberion","CreatedById":8356,"CreatedDateTime":"2013-11-02T20:48:06Z","Content":"\n\u003Cp\u003EMaybe, we\u0027ll see what can be done, lots of things to add, not much time. I would like a SLS engine and perhaps a J-2 2nd stage (though the matriarch serves that purpose pretty well)\u003C/p\u003E\u003Cp\u003EReally couldn\u0027t help having the 2.5m stuff show up earlier, if I did it at the same time as stock, then almost all of the big parts would have been in the final tier, which means most of Novapunch was skipped for the whole tech tree. I am pretty satisfied with how its set up, the amount of parts in NP ramps up the part count faster, but its still gradual, and I can\u0027t help where the stock parts are.\u003C/p\u003E\n"},{"CreatedByName":"Deltac","CreatedById":12493,"CreatedDateTime":"2013-11-03T03:32:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tiberion\u0022 data-cite=\u0022Tiberion\u0022\u003E\u003Cdiv\u003EMaybe, we\u0027ll see what can be done, lots of things to add, not much time. I would like a SLS engine and perhaps a J-2 2nd stage (though the matriarch serves that purpose pretty well)\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, the Matriarch does serve the technical purpose, but it does not serve the Aesthetic purpose. I think people just want to make more Saturn V reminiscent rockets, and the Matriarch is more reminiscent of the Soviet N1. This is purely aesthetic reasoning, so not a major issue \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E Keep up the good work.\u003C/p\u003E\n"},{"CreatedByName":"meopoka","CreatedById":91735,"CreatedDateTime":"2013-11-04T07:42:48Z","Content":"\n\u003Cp\u003Egood luck.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/zCjw17M.jpg\u0022 alt=\u0022zCjw17M.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"vidoq24","CreatedById":10004,"CreatedDateTime":"2013-11-07T12:03:40Z","Content":"\n\u003Cp\u003EWhy with Nova installed some of stock parts are gone invisible, and are making game crash \u003C/p\u003E\u003Cp\u003E i din\u0027t find it in post (too much to read all)\u003C/p\u003E\n"},{"CreatedByName":"wasmic","CreatedById":64885,"CreatedDateTime":"2013-11-07T12:17:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022vidoq24\u0022 data-cite=\u0022vidoq24\u0022\u003E\u003Cdiv\u003EWhy with Nova installed some of stock parts are gone invisible, and are making game crash \u003Cp\u003E i din\u0027t find it in post (too much to read all)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow many mods/addons do you have installed? If you install too many parts, KSP will run out of memory. You can fix this by either deleting the parts that you don\u0027t use, or going to settings -\u0026gt; graphics and set the texture resolution to half res.\u003C/p\u003E\n"}]}