{"TopicId":40183,"ForumId":34,"TopicTitle":"(KSP 1.10 \u002B 1.12 ) Mission Controller 3.2.0 (Final Version) (Updated 6/25/2021)","CreatedByName":"malkuth","CreatedById":57414,"CreatedDateTime":"2013-07-31T01:19:13Z","PageNum":50,"Articles":[{"CreatedByName":"Shogun Gunshow","CreatedById":66960,"CreatedDateTime":"2014-03-31T16:10:12Z","Content":"\n\u003Cp\u003EIs it possible to actually enter into a \u0027failure state\u0027 with this mod? I\u0027ve read some stuff about bankruptcy, but I\u0027m curious about when it happens, because I just took a few expensive rockets out on a joyride in a new career mode to test, and at negative 218k funds, I\u0027m still being allowed to build 66k ships with no hassle. Is this intended? What are the negative effects, other than lower mission payouts (which don\u0027t seem to matter because money doesn\u0027t actually serve as a limiter)?\u003C/p\u003E\n"},{"CreatedByName":"malkuth","CreatedById":57414,"CreatedDateTime":"2014-03-31T21:26:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Shogun Gunshow\u0022 data-cite=\u0022Shogun Gunshow\u0022\u003E\u003Cdiv\u003EIs it possible to actually enter into a \u0027failure state\u0027 with this mod? I\u0027ve read some stuff about bankruptcy, but I\u0027m curious about when it happens, because I just took a few expensive rockets out on a joyride in a new career mode to test, and at negative 218k funds, I\u0027m still being allowed to build 66k ships with no hassle. Is this intended? What are the negative effects, other than lower mission payouts (which don\u0027t seem to matter because money doesn\u0027t actually serve as a limiter)?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou can borrow as much money as you want at this point.. The problem is that the more deeper you go into dept, the more the bank takes away from you with mission payouts. At this point your joyrides have cost you 75% of all your Payouts and pretty much guarantess you will never have a positive Budget.\u003C/p\u003E\u003Cp\u003EOther then that, nothing more will happen, since its a plugin and only so much you can do to STOP people from playing on in a plugin. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI could make it for you cannot control your vessel anymore though... Thats about it.. Can still launch it though, can\u0027t stop that from happening (there is always a way around it)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-31T21:28:26Z\u0022 title=\u002203/31/2014 09:28  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 31, 2014\u003C/time\u003E by malkuth\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Drew Kerman","CreatedById":103177,"CreatedDateTime":"2014-04-01T01:46:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022malkuth\u0022 data-cite=\u0022malkuth\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI could make it for you cannot control your vessel anymore though...\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHahahaha I love this. Your engineers are pissed off they\u0027re not getting paid anymore and are sabotaging your rockets \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"malkuth","CreatedById":57414,"CreatedDateTime":"2014-04-01T02:53:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Gaiiden\u0022 data-cite=\u0022Gaiiden\u0022\u003E\u003Cdiv\u003EHahahaha I love this. Your engineers are pissed off they\u0027re not getting paid anymore and are sabotaging your rockets \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWould be a complete end game though.. At that point the player would have no way of getting out of debt... Even though with 75% of payments getting taken after missions... Pretty much same thing.\u003C/p\u003E\u003Cp\u003EWould be funny though... But I\u0027m sure someone would scream and call me names in the end... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Shogun Gunshow","CreatedById":66960,"CreatedDateTime":"2014-04-01T03:36:19Z","Content":"\n\u003Cp\u003EI wonder if certain parts could be locked when you pass certain debt levels. A little bit in debt, the government/banks don\u0027t care. Start getting more in the hole, however, and they\u0027ll stop shelling out money to let you build high-end goodies like atomic rockets and stuff from the Interstellar pack. As you go more and more into debt, you lose the ability to use more and more of the tech you have unlocked in the science tree, capping out where you only have some basic rocketry available (base tech plus the first tier), enough to recover your space program over time, but you might have to do a lot of the basic missions to get out of the hole.\u003C/p\u003E\u003Cp\u003EAn alternative to grinding lowbie stuff if this was implemented: when your space program gets deep in the hole, you start getting mission offers from the commercial/private sector. These missions offer little to no science, distasteful to the intellectual Kerbal, but have large payouts. Activities like putting a satellite into orbit to broadcast to the whole of Kerbol the latest episodes of Who Wants to be a Kerballionaire and The Real House Kerbettes of Atlanta, or maybe putting an advertisement on the Mun, planting a flag with \u0022DRINK KEPSI\u0022 on it. The scientists might scoff, and Jeb might hate having his precious rockets slapped with sponsorship logos, but maybe they shouldn\u0027t have launched a 100 ton fusion monstrosity without enough struts.\u003C/p\u003E\n"},{"CreatedByName":"Playful1510","CreatedById":68786,"CreatedDateTime":"2014-04-01T06:47:06Z","Content":"\n\u003Cp\u003EI asked around on Reddit, but nobody has gotten back to me yet, so I figure I can ask here. Does anybody know of mission packs that mesh well with RSS? I took a look at the default ones, and the payouts are far too low to be sustainable, and they call for orbits at altitudes that in RSS are still in the atmosphere...\u003C/p\u003E\n"},{"CreatedByName":"malkuth","CreatedById":57414,"CreatedDateTime":"2014-04-01T12:05:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Playful1510\u0022 data-cite=\u0022Playful1510\u0022\u003E\u003Cdiv\u003EI asked around on Reddit, but nobody has gotten back to me yet, so I figure I can ask here. Does anybody know of mission packs that mesh well with RSS? I took a look at the default ones, and the payouts are far too low to be sustainable, and they call for orbits at altitudes that in RSS are still in the atmosphere...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESomeone has to make them. I don\u0027t play RSS so I can\u0027t make missions for something I don\u0027t really use a lot (we don\u0027t want terrible ones) so if someone can make some missions that would be great! Also I wanted to add a RSS mode to MCE myself (IE up all the payouts for RSS) but again, I don\u0027t play it so I have no idea on how to balance it at all.\u003C/p\u003E\u003Cp\u003EI guess If someone could point me to the numbers and SOI for RSS I could figure some of it out. \u003C/p\u003E\u003Cp\u003EThe biggest problem now of course is that with the contracts system in place, I would have to balance MCE for RSS in that respect since the contract system is pretty much hardcoded.\u003C/p\u003E\n"},{"CreatedByName":"HoneyFox","CreatedById":19237,"CreatedDateTime":"2014-04-01T12:58:56Z","Content":"\n\u003Cp\u003ECan you add support for ModuleEnginesFX? currently it seems like only ModuleEngines modules are recognized...\u003C/p\u003E\n"},{"CreatedByName":"malkuth","CreatedById":57414,"CreatedDateTime":"2014-04-01T17:29:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022HoneyFox\u0022 data-cite=\u0022HoneyFox\u0022\u003E\u003Cdiv\u003ECan you add support for ModuleEnginesFX? currently it seems like only ModuleEngines modules are recognized...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFor the next update I been working on a lot of things. And totally forgot to look into the moduleEngineFX for pricing out new engines that use it.. So now it will be in.. Actually already made the changes.. And this is some of the differences in prices for MCE .60.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cstrong\u003EIn the images the Engines Prices in the parts Breakdown was broken.. Its been fixed.. 2nd picture shows the values it should be showing.\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/3ECsp3f.png\u0022 alt=\u00223ECsp3f.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EDo have to check why the engines are not showing right in the parts breakdown though. You are getting charge for them correct though.. Just now showing the right value in Engines.. So much work to do.. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cstrong\u003EThe image below has the fixed Engines Readout in Parts breakdown fixed.\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/6MUli4Y.png\u0022 alt=\u00226MUli4Y.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-01T17:42:40Z\u0022 title=\u002204/01/2014 05:42  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 1, 2014\u003C/time\u003E by malkuth\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"malkuth","CreatedById":57414,"CreatedDateTime":"2014-04-01T17:59:13Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EFor a rundown of the update that will hit when kerbal Space Program 23.5 Hits this is the changeLog so far.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cstrong\u003EThis is not a new update that is out. This update will not be released until *SP 23.5 Is out and had time to fix any issues that might cause!!\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EMCE .60\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E1. Fixed Payment Popup coming up for no reason.. \u003C/p\u003E\u003Cp\u003E2. The time Countdown has finally been fixed. In older version these would\u003C/p\u003E\u003Cp\u003Enot be persitent if you left the vessel.. Ie they would start over. Now\u003C/p\u003E\u003Cp\u003Eif you leave vessel, or game they will be saved. So when you restart\u003C/p\u003E\u003Cp\u003Eagain the Time Countdown will continue. If you go and do something else\u003C/p\u003E\u003Cp\u003Ethe time will continue to countdown for the Vessel the mission is\u003C/p\u003E\u003Cp\u003Eassigned too. Please note though, that you can only do 1 Timed mission\u003C/p\u003E\u003Cp\u003Eat a time. If you Start another Timed mission the timer will be set for\u003C/p\u003E\u003Cp\u003Ethe new mission and you will lose the old timer.\u003C/p\u003E\u003Cp\u003E3. 2 Brand new Mission Goals. Each goal has its own CountDown Timer and does not count toward the above Timer.. So you can have These running on seperate missions.. 1 Each.\u003C/p\u003E\u003Cp\u003ENew Mission RoverResearch. Land on planet and conduct Rover Researh or Lander Probe research. Is timed mission and is added to the Random Contract System for every Planet Body (new part).\u003C/p\u003E\u003Cp\u003ENew Mission OrbitalProbe Research. Orbit a planet and conduct Research in orbit on that Planet body selected. Added to Random Contract System for every Planet Body and is another seperate timed mission!(new Part)\u003C/p\u003E\u003Cp\u003E4. In editor if you have a MCE window open (excluding the Parts Breakdown) the editor will be loc*ed and you can freely select things in MCE menus without selecting things in the VAB or SPH.\u003C/p\u003E\u003Cp\u003E5. Random contracts have changed. This is something most of you might not notice because its a code change. In older version, MCE random contracts I had to have a seperate Base Contract for EVERYSINGLE PLANET IN GAME. Now I changed it for I only need 1 Base contract, and the Planet Bodies are randomley selected to be added to the Base Contract. Also includes a Base Pay Seletion for Every Planet!\u003C/p\u003E\u003Cp\u003E6. Added ModuleEngineFX to the Prices in MCE. And did some majore overwork on prices in MCE. Including adding support for Dmagic parts and some others that should be priced more heavy.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-01T18:03:31Z\u0022 title=\u002204/01/2014 06:03  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 1, 2014\u003C/time\u003E by malkuth\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"malkuth","CreatedById":57414,"CreatedDateTime":"2014-04-01T20:03:49Z","Content":"\n\u003Cp\u003ENo conflict issues with the new 23.5 version of KSP out. I will have the Update .60 version of MCE out as soon as I get the Redirect mission stuff going..\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-04-01T21:00:14Z","Content":"\n\u003Cp\u003EI just tried with KSP 0.23.5 (with the previous MCE code, not the new update that\u0027s not quite released yet) and discovered one thing that\u0027s behaving differently:\u003C/p\u003E\u003Cp\u003ENow when I use the \u0022circled arrow\u0022 button to revert flight, I don\u0027t get my money back.\u003C/p\u003E\n"},{"CreatedByName":"malkuth","CreatedById":57414,"CreatedDateTime":"2014-04-01T22:21:22Z","Content":"\n\u003Cp\u003EHmm that an internal code that should not be effected by changes in ksp. I will check it out.\u003C/p\u003E\n"},{"CreatedByName":"BioHaZarD.PT","CreatedById":106836,"CreatedDateTime":"2014-04-02T01:18:10Z","Content":"\n\u003Cp\u003EThe only issue I noticed with KSP 0.23.5 is that the new engines are way too cheap (not to mention so efficient that they make several old ones obsolete, even the KW ones that I installed yesterday). Fuel tanks seem to be about right. But you might want to check other new parts as well. \u003C/p\u003E\u003Cp\u003EI noticed the engine prices because I reduced fuel prices by about 1000 in MCE to reflect real world RP-1/LOX prices. According to wikipedia \u0022Elon Musk stated that fuel and oxygen for the Falcon 9 v1.0 rocket total about $200,000\u0022, 0.3% of the total cost. That\u0027s $200,000 for about 290 metric tons of RP-1/LOX (689$ per ton). LH2/LOX mix costs 8x that according to another source. \u003C/p\u003E\u003Cp\u003EStandard MCE perhaps assumes the Kerbals use N2O4/UDMH, like the Chinese, which does cost millions per rocket. I found two widely different prices for N2O4/UDMH mix, 39800$/ton and 63192$/ton. But even with those prices the 32 tons of fuel/ox mix in 1 orange tank would be about 1.3 to 2 million dollars, not 47 million. The Chinese Long March 3B uses around 375 tons of the stuff and they charge at 75 million USD to launch the whole rocket! \u003C/p\u003E\u003Cp\u003EWhat are the kerbals using? Gold??? Scratch that... even a ton of gold only costs 41 million USD! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E Of course Kerbin is a small planet and who knows what things cost there...\u003C/p\u003E\u003Cp\u003EFor balance I reduced mission payouts by half and I\u0027m considering reducing them further.\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2014-04-02T03:20:35Z","Content":"\n\u003Cp\u003EAny reason why suddenly MCE wont deduct the ship value from my budget even after leaving the pad? The plugin is enabled and ive done nothing different really..\u003C/p\u003E\n"},{"CreatedByName":"malkuth","CreatedById":57414,"CreatedDateTime":"2014-04-02T04:12:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Motokid600\u0022 data-cite=\u0022Motokid600\u0022\u003E\u003Cdiv\u003EAny reason why suddenly MCE wont deduct the ship value from my budget even after leaving the pad? The plugin is enabled and ive done nothing different really..\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot sure, the version Im working with now is working fine so far.. I have more testing to do, you might have to wait for new version tomorrow. But I had no ill effects with using 23.5 with my version..\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThe only issue I noticed with KSP 0.23.5 is that the new engines are way too cheap (not to mention so efficient that they make several old ones obsolete, even the KW ones that I installed yesterday). Fuel tanks seem to be about right. But you might want to check other new parts as well. \u003Cp\u003EI noticed the engine prices because I reduced fuel prices by about 1000 in MCE to reflect real world RP-1/LOX prices. According to wikipedia \u0022Elon Musk stated that fuel and oxygen for the Falcon 9 v1.0 rocket total about $200,000\u0022, 0.3% of the total cost. That\u0027s $200,000 for about 290 metric tons of RP-1/LOX (689$ per ton). LH2/LOX mix costs 8x that according to another source. \u003C/p\u003E\u003Cp\u003EStandard MCE perhaps assumes the Kerbals use N2O4/UDMH, like the Chinese, which does cost millions per rocket. I found two widely different prices for N2O4/UDMH mix, 39800$/ton and 63192$/ton. But even with those prices the 32 tons of fuel/ox mix in 1 orange tank would be about 1.3 to 2 million dollars, not 47 million. The Chinese Long March 3B uses around 375 tons of the stuff and they charge at 75 million USD to launch the whole rocket! \u003C/p\u003E\u003Cp\u003EWhat are the kerbals using? Gold??? Scratch that... even a ton of gold only costs 41 million USD! Of course Kerbin is a small planet and who knows what things cost there...\u003C/p\u003E\u003Cp\u003EFor balance I reduced mission payouts by half and I\u0027m considering reducing them further.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe new version has a re-balance of all prices.. It will be out on Wednesday if I find no more bugs.\u003C/p\u003E\n"},{"CreatedByName":"malkuth","CreatedById":57414,"CreatedDateTime":"2014-04-02T04:15:51Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003ESo I have to go to bed.. Just tested out and finished a ARM mission in MCE .60. Have a few more bug test to do and I will release on Wednesday hopefully. For now sneak peak at the new ARM mission.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ZmIUn29.png\u0022 alt=\u0022ZmIUn29.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHow does the new ARM mission work.\u003C/p\u003E\u003Cp\u003EIts a contract mission that is randomly generated. When you get the mission MCE will find a random Asteroid (not in Kerbin orbit) and select it as the mission target. You will have to fly to that specific asteroid (the mission is Name specific!!) and use the Grapple to connect to it... Then you will have to put it into a Kerbin orbit specified by the mission.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-02T04:19:29Z\u0022 title=\u002204/02/2014 04:19  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 2, 2014\u003C/time\u003E by malkuth\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Drew Kerman","CreatedById":103177,"CreatedDateTime":"2014-04-02T05:15:43Z","Content":"\n\u003Cp\u003ESo I added this to my custom change file:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003E@PART[FASAlaunchTower]:Final\u003Cbr\u003E{\u003Cbr\u003E  @CrewCapacity = 0\u003Cbr\u003E}\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThis way the launch tower, which has a 16 crew capacity, doesn\u0027t end up costing me almost $100,000 each launch! The whole idea behind the crew capacity is to walk the crew out to the ship, but I can do without that.\u003C/p\u003E\n"},{"CreatedByName":"malkuth","CreatedById":57414,"CreatedDateTime":"2014-04-02T12:50:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Gaiiden\u0022 data-cite=\u0022Gaiiden\u0022\u003E\u003Cdiv\u003ESo I added this to my custom change file:\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003E@PART[FASAlaunchTower]:Final\u003Cbr\u003E{\u003Cbr\u003E  @CrewCapacity = 0\u003Cbr\u003E}\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThis way the launch tower, which has a 16 crew capacity, doesn\u0027t end up costing me almost $100,000 each launch! The whole idea behind the crew capacity is to walk the crew out to the ship, but I can do without that.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELet me see if I can get a fix on that. In the meantime if the launchtower has a Special Module.. Like say ModuleTower, you can add a value in MCsettings with ModuleTower{addcost = -95000} that way you can keep the fuctions of your tower.\u003C/p\u003E\n"},{"CreatedByName":"malkuth","CreatedById":57414,"CreatedDateTime":"2014-04-02T23:02:16Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EMission Controller Version .60 is now Available.. You can download it from the front page of this forum thread!\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMCE .60\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E1. Fixed Payment Popup coming up for no reason.. \u003C/p\u003E\u003Cp\u003E2. The time Countdown has finally been fixed. In older version these would\u003C/p\u003E\u003Cp\u003Enot be persitent if you left the vessel.. Ie they would start over. Now\u003C/p\u003E\u003Cp\u003Eif you leave vessel, or game they will be saved. So when you restart\u003C/p\u003E\u003Cp\u003Eagain the Time Countdown will continue. If you go and do something else\u003C/p\u003E\u003Cp\u003Ethe time will continue to countdown for the Vessel the mission is\u003C/p\u003E\u003Cp\u003Eassigned too. Please note though, that you can only do 1 Timed mission\u003C/p\u003E\u003Cp\u003Eat a time. If you Start another Timed mission the timer will be set for\u003C/p\u003E\u003Cp\u003Ethe new mission and you will lose the old timer.\u003C/p\u003E\u003Cp\u003E3. 3 Brand new Mission Goals. Each goal has its own CountDown Timer and does not count toward the above Timer.. So you can have These running on seperate missions.. 1 Each.\u003C/p\u003E\u003Cp\u003ENew Mission RoverResearch. Land on planet and conduct Rover Researh or Lander Probe research. Is timed mission and is added to the Random Contract System for every Planet Body (new part).\u003C/p\u003E\u003Cp\u003ENew Mission OrbitalProbe Research. Orbit a planet and conduct Research in orbit on that Planet body selected. Added to Random Contract System for every Planet Body and is another seperate timed mission!(new Part)\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EAnd to take advantage of KSP 23.5 Asteroids a new random contract mission can be accepted.. The new ARM Mission (Asteroid redirect Mission)\u003C/span\u003E \u003C/p\u003E\u003Cp\u003EAll new missions are part of the random contract system. They will show up randomly from the Companies that offer them.\u003C/p\u003E\u003Cp\u003E4. In editor if you have a MCE window open (excluding the Parts Breakdown) the editor will be loc*ed and you can freely select things in MCE menus without selecting things in the VAB or SPH.\u003C/p\u003E\u003Cp\u003E5. Random contracts have changed. This is something most of you might not notice because its a code change. In older version, MCE random contracts I had to have a seperate Base Contract for EVERYSINGLE PLANET IN GAME. Now I changed it for I only need 1 Base contract, and the Planet Bodies are randomley selected to be added to the Base Contract. Also includes a Base Pay Seletion for Every Planet!\u003C/p\u003E\u003Cp\u003E6. Added ModuleEngineFX to the Prices in MCE. And did some majore overwork on prices in MCE. Including adding support for Dmagic parts and some others that should be priced more heavy.\u003C/p\u003E\u003Cp\u003E7. Changes to Repair Missions, they now take advantage of the new system that the ARM mission uses to ID and Make the player target a specific vessel.. in this case vessels with the RepairPart on them.\u003C/p\u003E\u003Cp\u003E8, Lots of bug fixes, and I\u0027m sure Bug additions!! Tried to get as many as possible but I\u0027m getting tired.. This update is pretty huge... Maybe to big.\u003C/p\u003E\u003Cp\u003E10. Major Update to all prices in MCE. Fuel prices have been brought way down.. And vessel parts have been brought way up. Some of the more expensive parts are Engines, and Crew Capsules and Pods. Science parts have been increased also. Tell me what you think.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EWant to know how the new ARM mission Works... and in other cases how the Repair Mission Works?\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EBoth are Randomly generated Contract missions in separate categories. The arm Missions are part of the Interplanetary Contracts and have about a 10% chance of Spawning... With Rover/Lander at about 25% and Orbital Research at 35%.. the void is filled with No Missions this round..\u003C/p\u003E\u003Cp\u003EThe actual asteroid is randomly chosen for you by MCE. When you get an ARM mission the Asteroid will be listed that the company wants you to capture! You must capture this Asteroid or you will not be able to finish the mission. Once you capped it, bring it into orbit.. And profit.\u003C/p\u003E\u003Cp\u003EThe Repair missions works the same way!.. The company will randomly choose a Vessel in space that has RepairPart on them and you will be tasked with repairing that vessel... And that vessel only!\u003C/p\u003E\u003Cp\u003EThat\u0027s it have fun.. I\u0027m completely expecting to have bugs in this that I missed.. Seriously it might not seem like it, but the update is huge code wise! So report what you might see.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-04-03T00:03:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Steven Mading\u0022 data-cite=\u0022Steven Mading\u0022\u003E\u003Cdiv\u003EI just tried with KSP 0.23.5 (with the previous MCE code, not the new update that\u0027s not quite released yet) and discovered one thing that\u0027s behaving differently:\u003Cp\u003ENow when I use the \u0022circled arrow\u0022 button to revert flight, I don\u0027t get my money back.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, whatever the problem was, the 0.60 update seems to have fixed it. Thanks.\u003C/p\u003E\n"},{"CreatedByName":"HoneyFox","CreatedById":19237,"CreatedDateTime":"2014-04-03T03:00:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022malkuth\u0022 data-cite=\u0022malkuth\u0022\u003E\u003Cdiv\u003ELet me see if I can get a fix on that. In the meantime if the launchtower has a Special Module.. Like say ModuleTower, you can add a value in MCsettings with ModuleTower{addcost = -95000} that way you can keep the fuctions of your tower.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ebut if i don\u0027t actually have that many kerbalnauts... this will actually turn into a cheat that can provide cash infinitely, well anyway...\u003C/p\u003E\n"},{"CreatedByName":"malkuth","CreatedById":57414,"CreatedDateTime":"2014-04-03T03:03:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022HoneyFox\u0022 data-cite=\u0022HoneyFox\u0022\u003E\u003Cdiv\u003Ebut if i don\u0027t actually have that many kerbalnauts... this will actually turn into a cheat that can provide cash infinitely, well anyway...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe problem is that KSP will automatically put kerbals into ships for you even if you don\u0027t have enough... And no not a cheat because MCE checks its Current Kerbals list with the Game list... If it changes then it charges you for the new kerbals... Even with the auto additions by KSP. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003ESometimes its really annoying when you forget how many kerbals you got...\u003C/p\u003E\u003Cp\u003EOh and PS another change in .60 is that you don\u0027t get charged until you get into flight scene.. Before you could be charged in any scene. But it seems KSP 23.5 introduced a strange way of adding kerbals in the VAB (before it was just flight) and I was having Pop Up spams of kerbals being hired when I was changing ships in the VAB. So... lol. Like i said in other post.. So much code changes that its mind boggling.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-03T03:05:32Z\u0022 title=\u002204/03/2014 03:05  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 3, 2014\u003C/time\u003E by malkuth\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Drew Kerman","CreatedById":103177,"CreatedDateTime":"2014-04-03T05:41:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022HoneyFox\u0022 data-cite=\u0022HoneyFox\u0022\u003E\u003Cdiv\u003Ebut if i don\u0027t actually have that many kerbalnauts... this will actually turn into a cheat that can provide cash infinitely, well anyway...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf I wanted cash I would open up my .sp file in a text editor and just give myself a bajillion dollars \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E There\u0027s really no way to prevent cheats/exploits if the user so desires to play that way. And if they do? Well that\u0027s their choice isn\u0027t it?\u003C/p\u003E\n"},{"CreatedByName":"HoneyFox","CreatedById":19237,"CreatedDateTime":"2014-04-03T05:56:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Gaiiden\u0022 data-cite=\u0022Gaiiden\u0022\u003E\u003Cdiv\u003EIf I wanted cash I would open up my .sp file in a text editor and just give myself a bajillion dollars \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E There\u0027s really no way to prevent cheats/exploits if the user so desires to play that way. And if they do? Well that\u0027s their choice isn\u0027t it?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E you are right.\u003C/p\u003E\n"}]}