{"TopicId":40365,"ForumId":34,"TopicTitle":"[0.25]KSP Interstellar (Magnetic Nozzles, ISRU Revamp) Version 0.13","CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2013-08-01T00:05:15Z","PageNum":381,"Articles":[{"CreatedByName":"nli2work","CreatedById":106805,"CreatedDateTime":"2014-05-21T15:29:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Toggl3\u0022 data-cite=\u0022Toggl3\u0022\u003E\u003Cdiv\u003EFirst off, let me apologize if this has been answered before, but with 950 pages, and the search function bringing me to about page 600, I don\u0027t have time to read ~350 pages of thread to find the answer.\u003Cp\u003EIs there any way to make the data gained from an impact collectable? I\u0027ve tried modifying the science.cfg to simply add the \u0022dataIsCollectable = True\u0022 and other lines from other parts, but to no avail. Like a dumbass I didn\u0027t put an antenna on my ship and have 875 science just sitting there...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eif you have KAS, you can add an antenna to the vehicle. If you are collecting the date, you\u0027d be close enough to add the antenna. You may have to add the line to the part on the vehicle in flightstate instead of the config file.\u003C/p\u003E\n"},{"CreatedByName":"BigD145","CreatedById":417,"CreatedDateTime":"2014-05-21T17:20:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rabada\u0022 data-cite=\u0022Rabada\u0022\u003E\u003Cdiv\u003EI edited my origional post with a work-around that I figured out. It was able to fix my sat!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/24970-0-21-Kosmos-Spacecraft-Design-Bureau-Updated-%289-27-13%29?p=1054262\u0026amp;viewfull=1#post1054262\u0022 rel=\u0022external nofollow\u0022\u003EYes it does work.\u003C/a\u003E Although I doubt it\u0027s ideal.\u003C/p\u003E\n"},{"CreatedByName":"LinAGKar","CreatedById":111517,"CreatedDateTime":"2014-05-21T17:29:27Z","Content":"\n\u003Cp\u003EAfter I installed this the game keeps crashing for me during startup. I\u0027m on openSUSE 13.1 64-bit and plays the game through Steam.\u003C/p\u003E\n"},{"CreatedByName":"Threadsinger","CreatedById":100886,"CreatedDateTime":"2014-05-21T18:11:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cy-one\u0022 data-cite=\u0022cy-one\u0022\u003E\u003Cdiv\u003EInspired by Manley\u0027s satellite... How big can a solar satellite be?\u003Cp\u003E\u003Ca href=\u0022http://i7.minus.com/iZBBo7v3Q4I8B.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i7.minus.com/iZBBo7v3Q4I8B.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EFoldable, of course.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat seems... excessive. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003E/very cool!\u003C/p\u003E\n"},{"CreatedByName":"Rabada","CreatedById":66044,"CreatedDateTime":"2014-05-21T18:15:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BigD145\u0022 data-cite=\u0022BigD145\u0022\u003E\u003Cdiv\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/24970-0-21-Kosmos-Spacecraft-Design-Bureau-Updated-%289-27-13%29?p=1054262\u0026amp;viewfull=1#post1054262\u0022 rel=\u0022external nofollow\u0022\u003EYes it does work.\u003C/a\u003E Although I doubt it\u0027s ideal.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThankyou for the link!! You are correct that it is not ideal, I was having issues with some of the solar panels saying that they were blocked from sunlight when they clearly were not. I was planning on having several solar sats around Kerbin anyways, so my Mark 2 sat uses the single Balka solar panels. It is also much much more stable, because I was able to strut it much better than my mk 1 sat.\u003C/p\u003E\u003Cp\u003EHere\u0027s a pic from a test flight of my solar power sat mk. 2:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imgur.com/LgbRKRR.jpg\u0022 alt=\u0022LgbRKRR.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s Simple but it works.\u003C/p\u003E\u003Cp\u003EThankyou for the advice also!!\u003C/p\u003E\n"},{"CreatedByName":"cy-one","CreatedById":74874,"CreatedDateTime":"2014-05-21T18:51:39Z","Content":"\n\u003Cp\u003EI have a question about the storage of tritium and deuterium. I just send a small unmanned mission to my minmus-base, carrying deuterium and tritium in those hexacans. The deuterium didn\u0027t get fewer, but the Tritium seems to have degraded a little bit.\u003C/p\u003E\u003Cp\u003EHow fast does that happen and does it happen slower with that cryotank-thingy?\u003C/p\u003E\n"},{"CreatedByName":"Rabada","CreatedById":66044,"CreatedDateTime":"2014-05-21T18:55:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cy-one\u0022 data-cite=\u0022cy-one\u0022\u003E\u003Cdiv\u003EI have a question about the storage of tritium and deuterium. I just send a small unmanned mission to my minmus-base, carrying deuterium and tritium in those hexacans. The deuterium didn\u0027t get fewer, but the Tritium seems to have degraded a little bit.\u003Cp\u003EHow fast does that happen and does it happen slower with that cryotank-thingy?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETritium decays into Helium 3 at a very slow rate. Helium 3 is great for fusion reactors. Note: This only happens on focused ships, to avoid having this happen, time warp with a flag or something then go back to your ship when you need to. I believe that Helium 3 has the potential to produce more power in fusion reactors than tritium, so what I would suggest you do is to keep a helium 3 container on your ship. I believe tritium yields Helium 3 in a 1:1 ratio.\u003C/p\u003E\u003Cp\u003EEdit: I should also point out that the cryotank is used for the IR telescope only. Also Tritium has a half life of 12.32 years so after that amount of time you should loose half your tritium.\u003C/p\u003E\n"},{"CreatedByName":"ArcFurnace","CreatedById":109240,"CreatedDateTime":"2014-05-21T19:18:32Z","Content":"\n\u003Cp\u003EThere\u0027s a cryogenic D-T tank as well as the Helium Cryostat. The D-T cryogenic tank holds more deuterium and tritium than the radial-mount tank (lower tank mass per amount stored), but requires power to keep it refrigerated, otherwise both resources will boil off. I believe the powered boil-off is zero. Tritium decay will be unaffected. \u003C/p\u003E\u003Cp\u003EI think tritium may actually still decay while the vessel is unfocused, but it doesn\u0027t properly produce Helium-3 like it should. If you timewarp for long periods of time with the vessel focused you should be able to see the tritum decaying into Helium-3. \u003C/p\u003E\u003Cp\u003EHelium-3 is only useful for the inertial confinement fusion reactors (the 0.625m and 1.25m ones). In those, pure He-3 fusion produces 100% Charged Particles, which can be converted into electricity by a Direct Conversion generator at 85% efficiency. For the larger tokamaks, it still produces 100% Charged Particles, but it also causes a massive drop in overall power output due to the increased difficulty of the fusion reaction over D-T.\u003C/p\u003E\u003Cp\u003EYou can also use D/He-3 fusion, which produces 80% charged particles but is otherwise similar to He-3 fusion.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-21T19:27:08Z\u0022 title=\u002205/21/2014 07:27  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 21, 2014\u003C/time\u003E by ArcFurnace\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2014-05-21T19:25:39Z","Content":"\n\u003Cp\u003ETritium decay into He-3 doesn\u0027t work unless the ship is focused. The tritium will decay but no He-3 is produced. This makes it effectively a non-feature. It happens, but not in any appreciable amounts.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-21T19:29:40Z\u0022 title=\u002205/21/2014 07:29  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 21, 2014\u003C/time\u003E by phoenix_ca\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"cy-one","CreatedById":74874,"CreatedDateTime":"2014-05-21T21:27:33Z","Content":"\n\u003Cp\u003Ethe 2.5m fusion reactor has not the right energy priority. It\u0027s 1, the same as (for example) the plasmathruster... Which means, I get warnings for the plasmaheating of the reactor.\u003C/p\u003E\u003Cp\u003EIs there a way to change the priority inside a cfg?\u003C/p\u003E\n"},{"CreatedByName":"Alewx","CreatedById":102791,"CreatedDateTime":"2014-05-21T21:35:36Z","Content":"\n\u003Cp\u003EAre you ready for the awesome sat?\u003C/p\u003E\u003Cp\u003EExcept the solar panels it is just slightly too big in diameter for the 3.75m fairings \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe ion engines are able to speed it up with 1m/s at a weight of 60t. The construction began as an overpowered communicationrelay, but it is easy to be used as a solarsat.\u003C/p\u003E\u003Cp\u003EAlso the wasteheat management is still untested, that might cause some problems. Does anyone have a basic formula for me about which radiators would be best/needed?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/m9nAU94.png\u0022 alt=\u0022m9nAU94.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"cy-one","CreatedById":74874,"CreatedDateTime":"2014-05-21T22:22:07Z","Content":"\n\u003Cp\u003EIn addition to my tokamak-priority-problem, my antimatter collectors do not work.\u003C/p\u003E\u003Cp\u003EThis\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i3.minus.com/iQyk2CrdDEKdj.png\u0022 alt=\u0022iQyk2CrdDEKdj.png\u0022\u003E\u003C/p\u003E\u003Cp\u003Eis currently orbiting Kerbin on a 900km orbit. Several days, not a single drop of antimatter.\u003C/p\u003E\u003Cp\u003EWhat am I doing wrong? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"DaveStrider","CreatedById":78109,"CreatedDateTime":"2014-05-21T22:30:41Z","Content":"\n\u003Cp\u003EYou probably need some fuel lines to the antimatter tanks, as those collectors aren\u0027t in the same stack as the tanks.\u003C/p\u003E\n"},{"CreatedByName":"cy-one","CreatedById":74874,"CreatedDateTime":"2014-05-21T22:40:29Z","Content":"\n\u003Cp\u003EWould it suffice to put lines from the collectors to the girder where they are mounted on? The station is modular, so a line directly to the tanks wouldn\u0027t work at this time.\u003C/p\u003E\u003Cp\u003EAlso, KAS claims pipes also work as fuel lines... Does somebody know if I can retrofit that station that way?\u003C/p\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2014-05-21T22:46:45Z","Content":"\n\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E@RESOURCE_DEFINITION[Antimatter]\u003Cbr\u003E{\u003Cbr\u003E  @flowMode = ALL_VESSEL\u003Cbr\u003E}\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EEnjoy no more antimatter fuel-routing shenanigans.\u003C/p\u003E\u003Cp\u003EThat\u0027s my solution anyway. Don\u0027t want to put-up with this nonsense.\u003C/p\u003E\n"},{"CreatedByName":"cy-one","CreatedById":74874,"CreatedDateTime":"2014-05-21T23:01:40Z","Content":"\n\u003Cp\u003EThank you, added it to my patch, works :3\u003C/p\u003E\n"},{"CreatedByName":"Einarr","CreatedById":4809,"CreatedDateTime":"2014-05-22T01:22:07Z","Content":"\n\u003Cp\u003ESo WaveFunctionP, how goes your Grand Tour Ship?\u003C/p\u003E\u003Cp\u003EMine\u0027s essentially complete and waiting for the transfer window to Duna. Got a rover and everything...though technically that rover would be a problem if I were using FAR...and I\u0027m not certain how well it would survive Deadly reentry. I\u0027ll be taking it on a shakedown cruise to the Mun and/or Minmus here shortly.\u003C/p\u003E\u003Cp\u003EI\u0027m not happy with the rover itself, or the placement, but the crane is nifty.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/6y6fX\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Atrius129","CreatedById":107132,"CreatedDateTime":"2014-05-22T06:34:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BigD145\u0022 data-cite=\u0022BigD145\u0022\u003E\u003Cdiv\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/24970-0-21-Kosmos-Spacecraft-Design-Bureau-Updated-%289-27-13%29?p=1054262\u0026amp;viewfull=1#post1054262\u0022 rel=\u0022external nofollow\u0022\u003EYes it does work.\u003C/a\u003E Although I doubt it\u0027s ideal.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThank you for posting that. You fixed my Balkas!\u003C/p\u003E\n"},{"CreatedByName":"tmbomber","CreatedById":104086,"CreatedDateTime":"2014-05-22T11:18:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ctbram\u0022 data-cite=\u0022ctbram\u0022\u003E\u003Cdiv\u003E[bUG] - My 3.75m fusion powered MW power station has stopped working. I was on a long mission and it was breeding tritium. I had 2 tanks of lithium and enough D/T tanks to hold all the trit that could be produced by the Li. When I returned I noticed I had no MW power so I checked and the fusion reactor was shutdown. Waste Heat is green. But the reactor and all the D/T tanks show completely full but have values of NaN/100 for the D/T tanks and NaN/800 for the reactor. I suspect they filled to overflow and there is a floating point issue in the code that could not deal with \u0026gt;100% capacity.\u003Cp\u003EMy ship mass is also showing NaN t.\u003C/p\u003E\u003Cp\u003EIs there anyway to fix this?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI ran into this one just last night...\u003C/p\u003E\u003Cp\u003EI have several orbital 3.75m fusion power stations. They\u0027re identical and were put up within a few hours of each other. Last night I noticed the power levels I was receiving was lower than expected so I went around checking fuel levels. One of my power stations was showing NaN for tritium and deuterium. \u003C/p\u003E\u003Cp\u003EI exited the game and fixed the values in the sfs file as suggested in post #8768. Tritium and deuterium levels on the other stations were somewhere around 60%, so I changed the NaN values to match, so my stations are back on line and everything\u0027s back to normal.\u003C/p\u003E\u003Cp\u003EI can tell you that only one of the stations went off line and that the other stations had nothing unusual going on. \u003C/p\u003E\u003Cp\u003ENo idea why or how it happened, but I can confirm the bug exists.\u003C/p\u003E\n"},{"CreatedByName":"cernakus","CreatedById":94456,"CreatedDateTime":"2014-05-22T13:06:49Z","Content":"\n\u003Cp\u003EHello, my problem is underpowered VISTA DT engine. As 3,75m part it really should gives more thrust then it does. (Idea is, that as open-cycle fusion engine, the delivered power should be more then 85GW, witch is less then closed cycle antimatter reactors). As an \u0022Endgame\u0022 content engine it should have parameters to compensate momentum transition caused by Warpdrive jumps. As in view of Isp, it is OK, behemont size interplanetary ship can easily achieve 100\u002Bkm/s delta-v, so plenty delta-v for several jumps across solar system. But acceleration is bad. Normally values around 1m/s-2 is quite enough, but not when you want to compensate 5km/s speed. It takes around 1,5 hours of real-time and with behemont size ships is hard to use physical time warp. Also 20 minutes real-time burn is not my idea of good game experience (that is why I dislike electric engines in KSP, yes it is realistic, but I really do not want an \u0022another Orbiter game\u0022 made from KSP). \u003C/p\u003E\u003Cp\u003ESo, my question is - will be possible to make Vista DT engine more powerful (even by mandatory upgrade like by large computer core)? Double, or triple thrust output should be fine.\u003C/p\u003E\u003Cp\u003EAlso I tried to do it by myself, but Vista DT thrust limit is hardcoded in WarpPlugin.dll. I checked sources and find out, that in source code is defined as conditional constant. So I tried to located this constant (1100 in dec, 44C in hex) in WarpPlugin.dll (there was luckily only one such value) and change to more convenient values (898 in hex). But result was disappointment. Luckily, I didnt damage warpplugin, but neither there was no change in Vista DT thrust.\u003C/p\u003E\u003Cp\u003EIs any easy way to modify this? Because honestly, I can somewhat understand c\u002B\u002B syntax but I not sure that I am capable to take sources, change same values and compile them to \u0022my own\u0022 WarpPlugin.dll (I assume that there are some dependencies which must be in compilation defined?).\u003C/p\u003E\u003Cp\u003EAny help or response will be appreciate. Also I am sorry in advance for my English skill, it is not my native language.\u003C/p\u003E\u003Cp\u003EPS: I can override DT Vista dependency on VistaEngineController and give more thrust in part.cfg, but then I lost radiation bio-hazard and also fancy variable specific impulse.\u003C/p\u003E\n"},{"CreatedByName":"Rabada","CreatedById":66044,"CreatedDateTime":"2014-05-22T13:37:56Z","Content":"\n\u003Cp\u003EIs there a limit on the inverse square law for solar panels in interstellar? I was bored so I turned on infinite fuel and brought one of my solar panel satellite to 100km above Kerbol. I was a little disapointed that the transitter on my sat never put out more than 1.22 GW. The same amount of power it puts out at 250Mm.\u003C/p\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2014-05-22T14:01:16Z","Content":"\n\u003Cp\u003EThat\u0027s a stock mechanic. I\u0027m pretty sure that the max output is the output value specified in the solar panel\u0027s part.cfg.\u003C/p\u003E\n"},{"CreatedByName":"Rabada","CreatedById":66044,"CreatedDateTime":"2014-05-22T14:12:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022phoenix_ca\u0022 data-cite=\u0022phoenix_ca\u0022\u003E\u003Cdiv\u003EThat\u0027s a stock mechanic. I\u0027m pretty sure that the max output is the output value specified in the solar panel\u0027s part.cfg.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMy Solar Sat uses 12 single Balka panels from Kosmos. I pulled up the .cfg, the word output was not in it, nor did I see anything similiar. I have not tried to use stock solar panels.\u003C/p\u003E\u003Cp\u003EWhen my sat was very low above Kerbol, the energy flow and the heat production of my panels both increased however my power transmission did not.\u003C/p\u003E\n"},{"CreatedByName":"Alewx","CreatedById":102791,"CreatedDateTime":"2014-05-22T14:30:11Z","Content":"\n\u003Cp\u003EI know the formula for calculating the space that is needed by the radiators is in the wiki of Interstellar, but how do I determine the temperatur at an specific orbit in the system, without having something there?\u003C/p\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2014-05-22T14:31:34Z","Content":"\n\u003Cp\u003Epart.cfg from solarPanels1 (squad)\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003EMODULE\u003Cbr\u003E{\u003Cbr\u003E\tname = ModuleDeployableSolarPanel\u003Cbr\u003E\u003Cbr\u003E\tanimationName = solarpanels\u003Cbr\u003E\u003Cbr\u003E\tresourceName = ElectricCharge\u003Cbr\u003E\u003Cbr\u003E\t[b][size=6]chargeRate = 2[/size][/b]\u003Cbr\u003E\u003Cbr\u003E\tpowerCurve\u003Cbr\u003E \t{\u003Cbr\u003E\t\tkey = 206000000000 0 0 0\u003Cbr\u003E\t\tkey = 13599840256 1 0 0\u003Cbr\u003E\t\tkey = 68773560320 0.5 0 0\u003Cbr\u003E\t\tkey = 0 10 0 0\u003Cbr\u003E \t}\u003Cbr\u003E}\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\n"}]}