{"TopicId":40365,"ForumId":34,"TopicTitle":"[0.25]KSP Interstellar (Magnetic Nozzles, ISRU Revamp) Version 0.13","CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2013-08-01T00:05:15Z","PageNum":125,"Articles":[{"CreatedByName":"AdmiralTigerclaw","CreatedById":92104,"CreatedDateTime":"2013-11-10T20:20:02Z","Content":"\n\u003Cp\u003EHey Fractal... Was discussing something with some friends here concerning fusion torch engines. They suggested working with you. Think you can give \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/57466-Electromagnetic-Reaction-Control-System-(Or-Reactionless-Control-System)?p=768013\u0026amp;viewfull=1#post768013\u0022 rel=\u0022external nofollow\u0022\u003Ethis post\u003C/a\u003E a once-over?\u003C/p\u003E\n"},{"CreatedByName":"Eadrom","CreatedById":91728,"CreatedDateTime":"2013-11-10T20:23:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Donziboy2\u0022 data-cite=\u0022Donziboy2\u0022\u003E\u003Cdiv\u003EThere is one drawback, you cannot use Quantum Plasma in atmosphere, you have to switch to normal propellents.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, I am experimenting with using argon and xenon drop tanks for launches on ships using plasma thrusters. Xenon looks like it requires quite a bit more propellant than argon, but I can make more xenon using my minmus kethane refinery. On the other hand, I don\u0027t typically have the need for standard propellants, so argon usually works. Moons/planets with a vacuum shouldn\u0027t interfere with a quantum plasma thruster afaik, so that leaves the handful of places with an atmo. I\u0027m thinking Xenon might be the go to fuel in those cases where I would want to land somewhere with an atmosphere since I can resupply on location via kethane.\u003C/p\u003E\u003Cp\u003EI don\u0027t know, I haven\u0027t made a decision on what I like using better as a launch fuel. More often than not, I\u0027ve just been using my standard, lower tech lifters to get my KSPI tech ships into orbit where my fancy tech takes over. I am enjoying the heck of a lot of options I have in this mod. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"pantheis","CreatedById":57108,"CreatedDateTime":"2013-11-10T20:25:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Eadrom\u0022 data-cite=\u0022Eadrom\u0022\u003E\u003Cdiv\u003EYeah, I am experimenting with using argon and xenon drop tanks for launches on ships using plasma thrusters. Xenon looks like it requires quite a bit more propellant than argon, but I can make more xenon using my minmus kethane refinery. On the other hand, I don\u0027t typically have the need for standard propellants, so argon usually works. Moons/planets with a vacuum shouldn\u0027t interfere with a quantum plasma thruster afaik, so that leaves the handful of places with an atmo. I\u0027m thinking Xenon might be the go to fuel in those cases where I would want to land somewhere with an atmosphere since I can resupply on location via kethane.\u003Cp\u003EI don\u0027t know, I haven\u0027t made a decision on what I like using better as a launch fuel. More often than not, I\u0027ve just been using my standard, lower tech lifters to get my KSPI tech ships into orbit where my fancy tech takes over. I am enjoying the heck of a lot of options I have in this mod. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhere are you getting argon from? I haven\u0027t been able to find any resource tanks that hold argon that are included with this mod.\u003C/p\u003E\n"},{"CreatedByName":"WAS","CreatedById":42674,"CreatedDateTime":"2013-11-10T20:27:59Z","Content":"\n\u003Cp\u003EThis looks amazing! Keep up the good work! Testing!\u003C/p\u003E\n"},{"CreatedByName":"Eadrom","CreatedById":91728,"CreatedDateTime":"2013-11-10T20:43:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022pantheis\u0022 data-cite=\u0022pantheis\u0022\u003E\u003Cdiv\u003EWhere are you getting argon from? I haven\u0027t been able to find any resource tanks that hold argon that are included with this mod.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you are playing in Career mode, it is unlocked in the Ion Propulsion node. If I remember correctly, it is in the Utility tab of the VAB/SPH.\u003C/p\u003E\n"},{"CreatedByName":"Donziboy2","CreatedById":74984,"CreatedDateTime":"2013-11-10T20:44:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Eadrom\u0022 data-cite=\u0022Eadrom\u0022\u003E\u003Cdiv\u003EYeah, I am experimenting with using argon and xenon drop tanks for launches on ships using plasma thrusters. Xenon looks like it requires quite a bit more propellant than argon, but I can make more xenon using my minmus kethane refinery. On the other hand, I don\u0027t typically have the need for standard propellants, so argon usually works. Moons/planets with a vacuum shouldn\u0027t interfere with a quantum plasma thruster afaik, so that leaves the handful of places with an atmo. I\u0027m thinking Xenon might be the go to fuel in those cases where I would want to land somewhere with an atmosphere since I can resupply on location via kethane.\u003Cp\u003EI don\u0027t know, I haven\u0027t made a decision on what I like using better as a launch fuel. More often than not, I\u0027ve just been using my standard, lower tech lifters to get my KSPI tech ships into orbit where my fancy tech takes over. I am enjoying the heck of a lot of options I have in this mod. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe numbers are slightly off since its based on an older version of KSPI but the ISP/MW requirements have not changed.\u003C/p\u003E\u003Cp\u003EYou could also just slap a normal thermal rocket engine onto the reactor and radially mount your plasma thrusters. The plasma\u0027s don\u0027t have to be directly attached to function.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/omF5f3q.png\u0022 alt=\u0022omF5f3q.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Makeone","CreatedById":79935,"CreatedDateTime":"2013-11-10T21:47:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Eadrom\u0022 data-cite=\u0022Eadrom\u0022\u003E\u003Cdiv\u003EI have a station at 300k kerbin orbit with only 16 collectors and use an antimatter reactor to power the containment pods and it still gains several antimatter per hour or so. I have an antimatter freighter in orbit around Jool at 9,000 km and with only 12 collectors on it, I can literally sit there in 1x time and I gain a unit of antimatter every couple seconds. It\u0027s insane how quickly you can gain antimatter at Jool. If you collect antimatter in the right spots, you can get lots of antimatter quickly. \u003Cp\u003EOne thing that might help you is to mod the config files to have the antimatter storage tanks start with some antimatter. I changed my tanks to start 1% full. I did this to basically simulate a ground based lab making antimatter. Keeps me from having to add a ground base to make antimatter and from having to use KAS to make antimatter fuel trucks. Basically saves me a bit of time and PC memory/processing from having to run the ground factory and an extra mod. I don\u0027t think it\u0027s too cheaty for me to do that. This way I can usually get my ships to my low orbit antimatter station to fuel up on antimatter gained in a legit manner.\u003C/p\u003E\u003Cp\u003Eedit:\u003C/p\u003E\u003Cp\u003EI also think some people might be underestimating how far antimatter can go. Every ship doesn\u0027t need a full tank of antimatter. I designed a long endurance ship with ~120 parts or so (maybe less) using an un-upgraded plasma thruster running off liquid fuel that has 38,000 delta V starting from a 700k orbit and has an acceleration of roughly 3m/s^2. If I remember correctly, it has a couple of the 62.5cm nuke reactors for backup power but the main drive is powered by an antimatter reactor. The ship only need 7,500 antimatter to spend alllll that delta V. That\u0027s less than 10% of the smallest antimatter tank. Most ships can probably get by with a few hundred to a couple thousand antimatter for the duration of their mission. When you look at only needing to supply a ship with those lower quantities of antimatter instead of filling each ship\u0027s tanks to full, the whole antimatter economy suddenly looks WAYYYY more manageable.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have a 20 collector ship at 900k orbit on kerbin, it doesn\u0027t collect anything whitout focus on it. \u003C/p\u003E\u003Cp\u003EYeah, editors are fun, also called as \u0027I-win-button\u0027 and then to next game....\u003C/p\u003E\u003Cp\u003EAnd yes, its true, that xenon is bit...too much, but i needed 11m/s2 to get my orbit done, it would taken lot\u0027s of chemical propellants and i really don\u0027t like 1000\u002B parts vessels.\u003C/p\u003E\n"},{"CreatedByName":"Makeone","CreatedById":79935,"CreatedDateTime":"2013-11-10T21:54:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Donziboy2\u0022 data-cite=\u0022Donziboy2\u0022\u003E\u003Cdiv\u003EOk so, 250k units of XenonGas is 25T. INSERT BrainFart Kraken, sorry Makeone my math is someone off sometimes.....EDIT... OK, so a 3.75m AM reactor could burn it that fast yes, you would get some crazy acceleration for a short amount of time. Xenon has poor ISP compared to the other fuels, and crazy thrust at high enough power levels. If your using AM you should not be using Xenon....\u003Cp\u003EAlso 3.75m AM reactors max fuel usage is 11.2units/s.\u003C/p\u003E\u003Cp\u003EMyself and many others have no problems collecting Antimatter, I will admit ground based collection can be a pain, and launching large collector sats is somewhat challenging. But it can be done, this is supposed to have challenges to it, not just \u0022Here have unlimited fuel and thrust forever without working towards it\u0022. A single collector in 900K orbit of Kerbin will give you almost 4 AM per day.\u003C/p\u003E\u003Cp\u003EIts a WIP Mod being used in an ALPHA game. There will be bugs.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESorry, alpha game? When has SQUAD mentioned that this is ALPHA? I\u0027m sorry, but since they sell it, this is RELEASE-version, not ready yet, but still. They treat us as final customers rather than alpha testers. Otherwise there would daily/weekly builds available to us to TEST at, but no. We do not TEST, we PLAY it and modders will eventually finish it.\u003C/p\u003E\u003Cp\u003EAnd yes, i know that the mod is WIP, but it still works well and Fractal keeps good care of us. I actually sometimes wonder if Fractal plays the game other than mod testing purposes? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E Good be, that programming is more \u0027fun\u0027...\u003C/p\u003E\n"},{"CreatedByName":"Eadrom","CreatedById":91728,"CreatedDateTime":"2013-11-10T22:03:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Makeone\u0022 data-cite=\u0022Makeone\u0022\u003E\u003Cdiv\u003EI have a 20 collector ship at 900k orbit on kerbin, it doesn\u0027t collect anything whitout focus on it. \u003Cp\u003EYeah, editors are fun, also called as \u0027I-win-button\u0027 and then to next game....\u003C/p\u003E\u003Cp\u003EAnd yes, its true, that xenon is bit...too much, but i needed 11m/s2 to get my orbit done, it would taken lot\u0027s of chemical propellants and i really don\u0027t like 1000\u002B parts vessels.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAre you using the most recent version of KSPI? I thought that was an issue in a previous version but was fixed. I can also put out there that I have no issues with getting antimatter on non-focused ships. Both lab generation and collector generation work in the background for me.\u003C/p\u003E\u003Cp\u003EAs far as changing the tanks to start 1% full, I hardly think that\u0027s an I-win button...you can easily get much more than that at launch from ground based antimatter generation. \u003C/p\u003E\u003Cp\u003ETo address your last point, I almost never try to launch a vessel with just a plasma thruster. I\u0027ll launch with a Vista primary stage or 4 radially mounted thermal boosters helping the plasma thruster. More often then not though, I\u0027ll slap one of my asparagus launchers on it. I don\u0027t have a great computer, so I don\u0027t like 1000\u002B part vessels either! lol I\u0027ve found that KSPI actually lets me do much, much more with FAR fewer parts per ship. YMMV.\u003C/p\u003E\u003Cp\u003EEdit:\u003C/p\u003E\u003Cp\u003EThis game is most definitely still in alpha...it\u0027s thoroughly put out there that it is. Even the version number points that it is not a release. Less than 1.0 = not a final release version.\u003C/p\u003E\u003Cp\u003EEdit 2:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://kerbalspaceprogram.com/about.php\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://kerbalspaceprogram.com/about.php\u003C/a\u003E Source for info that game is still under development.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-10T22:06:54Z\u0022 title=\u002211/10/2013 10:06  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 10, 2013\u003C/time\u003E by Eadrom\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Jim Kernan","CreatedById":84207,"CreatedDateTime":"2013-11-10T22:06:29Z","Content":"\n\u003Cp\u003EIs there a way to add the KAS mod to the campaign mode? The tree I\u0027m using does not seem to have it. It adds the American Pack mod just fine. I\u0027ve also got the Kethane mod installed but only the overlay shows in the game. I\u0027m using the KSP Interstellar Tree as per the install instructions. Thanks!\u003C/p\u003E\u003Cp\u003EUpdate: NVM - was doing some skimming and saw that it does not integrate into the campaign mode. 8(\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-10T23:11:56Z\u0022 title=\u002211/10/2013 11:11  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 10, 2013\u003C/time\u003E by Jim Kernan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Lalwcat","CreatedById":3041,"CreatedDateTime":"2013-11-10T22:10:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Makeone\u0022 data-cite=\u0022Makeone\u0022\u003E\u003Cdiv\u003ESorry, alpha game? When has SQUAD mentioned that this is ALPHA? I\u0027m sorry, but since they sell it, this is RELEASE-version, not ready yet, but still. They treat us as final customers rather than alpha testers. Otherwise there would daily/weekly builds available to us to TEST at, but no. We do not TEST, we PLAY it and modders will eventually finish it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAre you intentionally retarded or is it just accidental?\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://store.steampowered.com/app/220200/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://store.steampowered.com/app/220200/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u0022EARLY ACCESS GAME\u0022\u003C/p\u003E\u003Cp\u003EOr if you go to the kerbalspaceprogram.com page\u003C/p\u003E\u003Cp\u003E\u0022The game is currently under heavy development. This means the game will be improved on a regular basis, so be sure to check back for new updates. Right now, KSP is in Sandbox Complete state, but we want you to try it out and have fun with it. \u0022\u003C/p\u003E\u003Cp\u003EYou\u0027re not an alpha tester. You\u0027re playing an alpha. There\u0027s a significant difference. Alpha testers are in-house and ARE receiving daily/weekly test builds. I suggest learning something about the development process before mouthing off on an internet forum\u003C/p\u003E\n"},{"CreatedByName":"Eadrom","CreatedById":91728,"CreatedDateTime":"2013-11-10T22:33:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jim Kernan\u0022 data-cite=\u0022Jim Kernan\u0022\u003E\u003Cdiv\u003EIs there a way to add the KAS mod to the campaign mode? The tree I\u0027m using does not seem to have it. It adds the American Pack mod just fine. I\u0027ve also got the Kethane mod installed but only the overlay shows in the game. I\u0027m using the KSP Interstellar Tree as per the install instructions. Thanks!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EKethane is not integrated into the tech tree yet. You can manually edit the config files for each part adding in:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003ETechRequired = fuelSystems\u003Cbr\u003EentryCost = 0\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EWhere \u0022fuelSystems\u0022 is the name of the node you want the part to be unlocked. I put those two lines just above the line detailing cost and had no issues getting kethane to work in career. You can find more info about how to manually add in kethane parts to career mode over in the Kethane thread.\u003C/p\u003E\u003Cp\u003EI do not use KAS myself, but you if the parts are not assigned a tech node, then you can manually add them in exactly the same way as I mentioned above for the kethane parts. I think I remember someone saying that KAS isn\u0027t officially integrated into the tech tree yet, but that there were some unofficial config files floating around that add to the tree while people wait for a KAS update.\u003C/p\u003E\u003Cp\u003EIn either case, I\u0027d recommend hopping over to the Kethane and KAS threads and seeing if there\u0027s anything more useful that my little bit of info. As a side note, I have KW rocketry, procedural fairings, and deadly reentry installed on a copy of KSP I\u0027m using to kinda play along with Scott Manley in his new series, and the KW, PF, and DRE parts showed up in the tech tree perfectly fine with the KSPI tech tree selected. I\u0027m thinking that if parts aren\u0027t showing up in the tech tree when playing with KSPI, my money is first on that whatever mod you are trying to get to work isn\u0027t set up yet for tech tree integration.\u003C/p\u003E\n"},{"CreatedByName":"Donziboy2","CreatedById":74984,"CreatedDateTime":"2013-11-10T22:36:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Makeone\u0022 data-cite=\u0022Makeone\u0022\u003E\u003Cdiv\u003EI have a 20 collector ship at 900k orbit on kerbin, it doesn\u0027t collect anything whitout focus on it. \u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIts a known issue....\u003C/p\u003E\u003Cp\u003EWhat kind of ship are you using Makeone?\u003C/p\u003E\n"},{"CreatedByName":"Makeone","CreatedById":79935,"CreatedDateTime":"2013-11-10T23:48:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Donziboy2\u0022 data-cite=\u0022Donziboy2\u0022\u003E\u003Cdiv\u003EIts a known issue....\u003Cp\u003EWhat kind of ship are you using Makeone?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EKW-fueltank, bolted on that 4 Medium SABRE engine and top them 5 collector per engine. Top of the system is 1.25 nuke/generator combo and obviously a AM tank. My only mistake was casings (i use FAR), or more precisely, their bases that didn\u0027t have crossfeed enabled for start, hence nothing was happening, i noticed that on some point and they started to work. Ship has been orbit for 40 KSP days and has 450 or so AM in it.\u003C/p\u003E\n"},{"CreatedByName":"Makeone","CreatedById":79935,"CreatedDateTime":"2013-11-10T23:52:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Lalwcat\u0022 data-cite=\u0022Lalwcat\u0022\u003E\u003Cdiv\u003EAre you intentionally retarded or is it just accidental?\u003Cp\u003E\u003Ca href=\u0022http://store.steampowered.com/app/220200/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://store.steampowered.com/app/220200/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u0022EARLY ACCESS GAME\u0022\u003C/p\u003E\u003Cp\u003EOr if you go to the kerbalspaceprogram.com page\u003C/p\u003E\u003Cp\u003E\u0022The game is currently under heavy development. This means the game will be improved on a regular basis, so be sure to check back for new updates. Right now, KSP is in Sandbox Complete state, but we want you to try it out and have fun with it. \u0022\u003C/p\u003E\u003Cp\u003EYou\u0027re not an alpha tester. You\u0027re playing an alpha. There\u0027s a significant difference. Alpha testers are in-house and ARE receiving daily/weekly test builds. I suggest learning something about the development process before mouthing off on an internet forum\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESorry if my stupidity is too much for your excellent IQ. \u003C/p\u003E\u003Cp\u003EI just tend to get off, when people speak of alpha when it feels like released half-done and \u0022we\u0027ll finish it later\u0022-mentality. \u003C/p\u003E\u003Cp\u003EOh well, i\u0027ll be most likely long dead before KSP reaches 1.0.0.0.0 version...\u003C/p\u003E\n"},{"CreatedByName":"K3-Chris","CreatedById":61664,"CreatedDateTime":"2013-11-10T23:55:07Z","Content":"\n\u003Cp\u003ECan you upgrade parts in sandbox and if so, how?\u003C/p\u003E\n"},{"CreatedByName":"BananaDealer","CreatedById":60684,"CreatedDateTime":"2013-11-11T00:12:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K3|Chris\u0022 data-cite=\u0022K3|Chris\u0022\u003E\u003Cdiv\u003ECan you upgrade parts in sandbox and if so, how?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHaven\u0027t played a sandbox game since 0.22 came but I think they just start-off upgraded...\u003C/p\u003E\n"},{"CreatedByName":"Eadrom","CreatedById":91728,"CreatedDateTime":"2013-11-11T00:15:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K3|Chris\u0022 data-cite=\u0022K3|Chris\u0022\u003E\u003Cdiv\u003ECan you upgrade parts in sandbox and if so, how?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe parts are automatically upgraded, sans the computer core and the warp drive. I haven\u0027t played around with KSPI very much in 0.22 sandbox, but if you want to get science, I believe you have to get it via the manned science labs generating science. Once you get enough science, you can upgrade the warp drive or computer core of your choice. From what I have seen, sandbox is basically like you researched everything in career from the get go, including the nodes that upgrade KSPI parts.\u003C/p\u003E\n"},{"CreatedByName":"Srilania","CreatedById":70829,"CreatedDateTime":"2013-11-11T03:49:20Z","Content":"\n\u003Cp\u003EI keep having an issue. When I build anything with the science station, the screen goes black, I am shot to -666666 m high, and the screen graphics go wonko. Once that happens, I have to literally close down and restart.\u003C/p\u003E\n"},{"CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2013-11-11T13:50:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Srilania\u0022 data-cite=\u0022Srilania\u0022\u003E\u003Cdiv\u003EI keep having an issue. When I build anything with the science station, the screen goes black, I am shot to -666666 m high, and the screen graphics go wonko. Once that happens, I have to literally close down and restart.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECan you post a copy of your KSP.log file? I think this may signify some kind of bad interaction with another mod. What else do you have installed?\u003C/p\u003E\n"},{"CreatedByName":"Deathkeeperx","CreatedById":49851,"CreatedDateTime":"2013-11-11T14:27:34Z","Content":"\n\u003Cp\u003EHey guys I am new to this mod and I may be doing something wrong, but I can\u0027t get the science lab to actually collect any science, what exactly do I need to do to use the lab properly?\u003C/p\u003E\n"},{"CreatedByName":"NotCoach","CreatedById":91874,"CreatedDateTime":"2013-11-11T14:44:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Deathkeeperx\u0022 data-cite=\u0022Deathkeeperx\u0022\u003E\u003Cdiv\u003EHey guys I am new to this mod and I may be doing something wrong, but I can\u0027t get the science lab to actually collect any science, what exactly do I need to do to use the lab properly?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMake sure the lab is manned. Unlike pods it isn\u0027t automatically manned. Needs to be manually manned before putting your craft on the launchpad.\u003C/p\u003E\n"},{"CreatedByName":"Deathkeeperx","CreatedById":49851,"CreatedDateTime":"2013-11-11T14:45:52Z","Content":"\n\u003Cp\u003EI have it manned, but is there anyway to store the science? I tell it to start research but nothing happens.\u003C/p\u003E\n"},{"CreatedByName":"NotCoach","CreatedById":91874,"CreatedDateTime":"2013-11-11T14:58:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Deathkeeperx\u0022 data-cite=\u0022Deathkeeperx\u0022\u003E\u003Cdiv\u003EI have it manned, but is there anyway to store the science? I tell it to start research but nothing happens.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt should be working. There are no visual indicators, only the option to turn on research. But every time you focus on the lab it should send the science it collected to your science pool. Check how much science you have before focusing on the lab, and then focus on the lab after warping about 8 hours ahead (just to give it time to collect science). Then recheck your science again and compare values. You should see an increase in your accumulated science.\u003C/p\u003E\n"},{"CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2013-11-11T14:59:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Deathkeeperx\u0022 data-cite=\u0022Deathkeeperx\u0022\u003E\u003Cdiv\u003EI have it manned, but is there anyway to store the science? I tell it to start research but nothing happens.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt doesn\u0027t store science, it simply generate it straight into your R\u0026amp;D building pool.\u003C/p\u003E\u003Cp\u003EWhat do you mean by nothing happens? Does it say it say it is \u0022Researching\u0022 and does it give you a science rate per day or does it do something else? Please try and give lots of details about what is actually happening otherwise it\u0027s really hard to know if there is a problem and if there is, what it is.\u003C/p\u003E\n"}]}