{"TopicId":40365,"ForumId":34,"TopicTitle":"[0.25]KSP Interstellar (Magnetic Nozzles, ISRU Revamp) Version 0.13","CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2013-08-01T00:05:15Z","PageNum":347,"Articles":[{"CreatedByName":"singlet","CreatedById":103168,"CreatedDateTime":"2014-04-22T08:16:01Z","Content":"\n\u003Cp\u003EDear Fractal_UK,\u003C/p\u003E\u003Cp\u003EThere are two small problems in the ScienceDef.cfg.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E id = gasChromotographyMassSpectrometryExperiment\u003Cp\u003E title = Analyse Magnetosphere\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe \u0027id\u0027 contains a typo (Chrom\u003Cspan style=\u0022color:#FF0000;\u0022\u003Eo\u003C/span\u003Etography), and the \u0027title\u0027 line should be corrected. (e.g. \u0022Analyse Atmospheric Composition\u0022)\u003C/p\u003E\n"},{"CreatedByName":"Domfluff","CreatedById":64903,"CreatedDateTime":"2014-04-22T08:34:03Z","Content":"\n\u003Cp\u003EI may be being really dense, but I can\u0027t get the Radio telescope to produce \u0022Deep Field\u0022 science.\u003C/p\u003E\u003Cp\u003EI have the telescope, attached directly to a Helium tank (it reads \u00220.50 Science/Day\u0022 to begin with, and worse as the helium gets used, as you would expect), and this is attached to a reactor/generator/radiator combo, as well as a probe body and docking port.\u003C/p\u003E\u003Cp\u003EIt claims that it\u0027s providing science per day, but I haven\u0027t seen any evidence of this - I was expecting it to show up (as a line of text) on change of focus, like with the Science Lab, but this just doesn\u0027t seem to be happening. The science in the Science lab isn\u0027t being updated secretly either.\u003C/p\u003E\u003Cp\u003EI launched two to confirm that there was a problem - the latter also had a communications dish, in case this was the problem, but to no avail.\u003C/p\u003E\u003Cp\u003EUnless the \u0022Deep Field\u0022 scan has to be run for a length of time? I switched back to this halfway through a Jool mission (so, a couple of years) and this still wasn\u0027t updating science.\u003C/p\u003E\u003Cp\u003EAm I missing something here, or is this borked?\u003C/p\u003E\n"},{"CreatedByName":"artforz","CreatedById":108793,"CreatedDateTime":"2014-04-22T08:44:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Donziboy2\u0022 data-cite=\u0022Donziboy2\u0022\u003E\u003Cdiv\u003ESnipped Delusional Banter.... I was drowsy the first try lol.....\u003Cp\u003ELets try it again below.\u003C/p\u003E\u003Cp\u003EWell from what I can tell AM Collection and AM Reactors are acting pretty screwy.....\u003C/p\u003E\u003Cp\u003EItem number one, a 10 Collector AM sat with a 2.5 AM Reactor. As you can see its putting out 1.4GW of Thermal Power, now look at the AM Collector, it is collecting 4.612306e-5 AM per second. Now lets do the math here.... \u003C/p\u003E\u003Cp\u003E(AM Collection amount x Seconds in a day x number of collectors) 4.612306e-5 * 86400 * 10 = 39.85mg/day\u003C/p\u003E\u003Cp\u003EOk now the reactor can use up to 3.324 mg/second and output 120GW of power or 36.1011GW/mg\u003C/p\u003E\u003Cp\u003ENow lets do some more math here... (GW per mg * mg / seconds in a day) 36.1011 * 39.85 / 86400 = 0.01665GW/second Thermal Power\u003C/p\u003E\u003Cp\u003ESo the math says 16.65MW per second but the part says 1.4GW per second??????? \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EConfirmed, AM reactors produce way too much power when supply limited.\u003C/p\u003E\u003Cp\u003EThe more oversized the reactor relative to the amount supplied by collectors, the more pronounced the effect.\u003C/p\u003E\u003Cp\u003Esee \u003Ca href=\u0022https://github.com/FractalUK/KSPInterstellar/pull/37\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/FractalUK/KSPInterstellar/pull/37\u003C/a\u003E for a tentative fix\u003C/p\u003E\n"},{"CreatedByName":"wasmic","CreatedById":64885,"CreatedDateTime":"2014-04-22T10:04:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Domfluff\u0022 data-cite=\u0022Domfluff\u0022\u003E\u003Cdiv\u003EI may be being really dense, but I can\u0027t get the Radio telescope to produce \u0022Deep Field\u0022 science.\u003Cp\u003EI have the telescope, attached directly to a Helium tank (it reads \u00220.50 Science/Day\u0022 to begin with, and worse as the helium gets used, as you would expect), and this is attached to a reactor/generator/radiator combo, as well as a probe body and docking port.\u003C/p\u003E\u003Cp\u003EIt claims that it\u0027s providing science per day, but I haven\u0027t seen any evidence of this - I was expecting it to show up (as a line of text) on change of focus, like with the Science Lab, but this just doesn\u0027t seem to be happening. The science in the Science lab isn\u0027t being updated secretly either.\u003C/p\u003E\u003Cp\u003EI launched two to confirm that there was a problem - the latter also had a communications dish, in case this was the problem, but to no avail.\u003C/p\u003E\u003Cp\u003EUnless the \u0022Deep Field\u0022 scan has to be run for a length of time? I switched back to this halfway through a Jool mission (so, a couple of years) and this still wasn\u0027t updating science.\u003C/p\u003E\u003Cp\u003EAm I missing something here, or is this borked?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere is a bug that causes it to only generate science while you\u0027re focusing on it. So send something towards Jool and place the IR telescope in focus while timewarping.\u003C/p\u003E\n"},{"CreatedByName":"Domfluff","CreatedById":64903,"CreatedDateTime":"2014-04-22T10:09:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022wasmic\u0022 data-cite=\u0022wasmic\u0022\u003E\u003Cdiv\u003EThere is a bug that causes it to only generate science while you\u0027re focusing on it. So send something towards Jool and place the IR telescope in focus while timewarping.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAh great, thanks. I\u0027ll give that a go later.\u003C/p\u003E\n"},{"CreatedByName":"WaveFunctionP","CreatedById":104784,"CreatedDateTime":"2014-04-22T10:24:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022wasmic\u0022 data-cite=\u0022wasmic\u0022\u003E\u003Cdiv\u003EThere is a bug that causes it to only generate science while you\u0027re focusing on it. So send something towards Jool and place the IR telescope in focus while timewarping.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat should have been fixed with .11.\u003C/p\u003E\n"},{"CreatedByName":"EdisonMaxwell","CreatedById":98398,"CreatedDateTime":"2014-04-22T10:48:35Z","Content":"\n\u003Cp\u003EActually, if you stay at 10x or lower timewarp while transmitting you\u0027ll never run out of electricity.\u003C/p\u003E\u003Cp\u003EI have a question. What is the duterium/tritium cryostat for? We already have small containers for those.\u003C/p\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2014-04-22T11:13:28Z","Content":"\n\u003Cp\u003EI assume it\u0027s for carrying larger amounts of fusion fuels. Possibly in a more compressed state? I haven\u0027t looked much but that\u0027s possible. Squish it so it\u0027s liquid. Hold more of the stuff in the same area as a result.\u003C/p\u003E\n"},{"CreatedByName":"OctarineNoise","CreatedById":108671,"CreatedDateTime":"2014-04-22T11:49:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022EdisonMaxwell\u0022 data-cite=\u0022EdisonMaxwell\u0022\u003E\u003Cdiv\u003EWhat is the duterium/tritium cryostat for? We already have small containers for those.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe cryostat, as long as it\u0027s powered, has much lower boil-off.\u003C/p\u003E\n"},{"CreatedByName":"Sokar408","CreatedById":75557,"CreatedDateTime":"2014-04-22T11:50:03Z","Content":"\n\u003Cp\u003EI know I ask a lot of questions, but I just can\u0027t help myself! This mod is so amazing, and seem to leave so many things unanswered. For example, and I think I asked this before though I can\u0027t find it again; What is the range on the Gamma Ray Spectrometer? In the VAH, Thermal Nozzles and Turbojets and even Plasma Engines, has the exact same values lists, except for the maximum MW they can use, and their weight. However when used there seem to be a difference. How can this be? And if its just me over seeing something, then isn\u0027t there just a ton of parts that are obsolete?\u003C/p\u003E\n"},{"CreatedByName":"singlet","CreatedById":103168,"CreatedDateTime":"2014-04-22T11:56:20Z","Content":"\n\u003Cp\u003EDear Fractal_UK,\u003C/p\u003E\u003Cp\u003Eit seems that the impact experiment has been quite a source of dispute, so I would like to make a suggestion for the design of the impact experiment. How about splitting the process of determining the scientific value of each set of impact data into two separate processes?\u003C/p\u003E\u003Cp\u003EMy idea is like this. A \u0027base value\u0027 is determined by the primary body and the distribution of seismic sensors. In case of the Mun, for example, this \u0027base value\u0027 is always 850 if the sensors are perfectly distributed, regardless of the number of impacts. The value is saved in the WarpPlugin.cfg. When the data is being transmitted, the \u0027base value\u0027 is scaled according to the total science and remaining science, and become the true scientific value. As this system does not depend on the number of impacts, it has several advantages over the current system I think.\u003C/p\u003E\u003Cp\u003E1) There is no permanent loss of science. Suppose a first-time user of KSPI wants to make a test and puts 1 seismic sensor on Kerbin and performs an impact experiment. He/she just lost 62.5 science points permanently under the current system. (Yes, I did just that, and was quite embarrassed by the consequences.) In the system I described above, he/she can deploy more sensors and make more experiments and still can get the same amount of science because this system does not care about the number of impact experiments at all.\u003C/p\u003E\u003Cp\u003E2) The science cap shown in the science archive can exactly show the actual limit of total science gained through the experiment. The current system shows some discrepancy between the shown cap and the actual limit, and I guess it is somewhat cumbersome to exactly match the two under the current system. The proposed system does not suffer such a problem because the science value is scaled according to the remaining science.\u003C/p\u003E\u003Cp\u003E3) The problem reported by tmbomber(\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/43839-0-23-5-KSP-Interstellar-%28Toolbar-Integration-New-Models-New-Tech%29-Version-0-11?p=994609\u0026amp;viewfull=1#post994609\u0022 rel=\u0022external nofollow\u0022\u003ELINK\u003C/a\u003E) can be, at least partly, resolved because one can always run the experiment again. (I also experienced the symptom, and complete elimination of the problem is impossible for now I guess because that problem affects all kind of science experiments in KSP. I also use RT2, so it might be a problem that only happens to the users of RT2.) Actually it causes a lot of inconvenience for me too. Permanently losing 300-ish science points without any real cause is quite annoying.\u003C/p\u003E\u003Cp\u003ECould you consider this idea, Fractal?\u003C/p\u003E\u003Cp\u003Ep.s. English is not my native language, so sorry for the inconvenience if there is any trouble understanding my writing.\u003C/p\u003E\n"},{"CreatedByName":"BlackBird1696","CreatedById":109289,"CreatedDateTime":"2014-04-22T12:06:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Hremsfeld\u0022 data-cite=\u0022Hremsfeld\u0022\u003E\u003Cdiv\u003EThe amount of power it takes varies, as you\u0027ve seen. As undercoveryankee pointed out,\u003Cp\u003EGiven that each impact experiment can yield \u003Cem\u003Every\u003C/em\u003E large amounts of science, it also means it has a very large transmission size. This isn\u0027t particularly realistic, especially as it means the next impact under otherwise identical circumstances will only provide half the data, but it\u0027s how things are now. However, there is a bug in how transmissions work, where timewarping does \u003Cem\u003Enot\u003C/em\u003E speed them up - it does, however, speed up how quickly you recover electric charge. My Eve seismic probes had a single RTG for power generation, and no batteries to speak of, but at either 100 or 50x time warp, I was making more ec than I was using. Yes, it\u0027s not ideal to rely on a bug, but even the smallest fission reactor on an unupgraded reactor provides far more than enough electricity to transmit the entire thing. I can understand not wanting to slap a reactor on a probe for the purpose of transmitting a few reports, but the reason no one can give you a definite answer for how much power a given impact result will take to transmit is because no one can predict offhand how much data a given impact will generate. Each planet has a different pool, and both the number and the placement of your recorders will determine together how scientifically useful the impacts are.\u003C/p\u003E\u003Cp\u003EFractal: Are there plans to set the seismic transmissions to a set size? It \u003Cem\u003Edoes\u003C/em\u003E seem rather odd that one experiment would contain half the data of an identical experiment simply because the one came before the other.\u003C/p\u003E\u003Cp\u003EOnce you\u0027ve swapped fuels, you still need to restart the reactor. Quicksave, EVA another kerbal over to the reactor, and then hit restart. If you\u0027ve tried hitting Swap Fuels a few times, it\u0027s possible you filled it back up with Uranium - If this is the case, quickload, swap fuels one more time, and then restart your reactor.\u003C/p\u003E\u003Cp\u003EDue to limitations in the version of Unity that KSP is built on, you can only use approximately 3.7 Gb of RAM with KSP. A single bit more and the game crashes hard with an access violation error, and both Planet Factory and KSPI are big mods. Some mods come with optional texture reduction packs, and sometimes third parties release reduced texture packs for popular mods. Find and use those. If you already are, check out the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/59005-0-22-Release-1-1-Active-Memory-Reduction-Mod\u0022 rel=\u0022external nofollow\u0022\u003EActive Memory Reduction\u003C/a\u003E mod. I don\u0027t use it personally, but I\u0027ve heard good things about it. It\u0027ll take a \u003Cem\u003Elong\u003C/em\u003E time to load up the first time, but it\u0027ll cut your memory footprint down dramatically.\u003C/p\u003E\u003Cp\u003EEdited for typos and clarity.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ethanks for the help. I\u0027ll give it a try.\u003C/p\u003E\n"},{"CreatedByName":"DivisionByZero","CreatedById":62591,"CreatedDateTime":"2014-04-22T12:27:13Z","Content":"\n\u003Cp\u003EBased on earlier accounts, this looks like a problem interacting with RT 2 rather than KSPI.\u003C/p\u003E\u003Cp\u003EDoes this happen with RT 2 and a stock instrument?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-22T12:53:57Z\u0022 title=\u002204/22/2014 12:53  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 22, 2014\u003C/time\u003E by DivisionByZero\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2014-04-22T12:30:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sokar408\u0022 data-cite=\u0022Sokar408\u0022\u003E\u003Cdiv\u003EI know I ask a lot of questions, but I just can\u0027t help myself! This mod is so amazing, and seem to leave so many things unanswered. For example, and I think I asked this before though I can\u0027t find it again; What is the range on the Gamma Ray Spectrometer? In the VAH, Thermal Nozzles and Turbojets and even Plasma Engines, has the exact same values lists, except for the maximum MW they can use, and their weight. However when used there seem to be a difference. How can this be? And if its just me over seeing something, then isn\u0027t there just a ton of parts that are obsolete?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, but the tooltips for a lot of parts are out-of-date. Especially the ATTILA engines which don\u0027t actually give accurate information.\u003C/p\u003E\n"},{"CreatedByName":"singlet","CreatedById":103168,"CreatedDateTime":"2014-04-22T13:11:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DivisionByZero\u0022 data-cite=\u0022DivisionByZero\u0022\u003E\u003Cdiv\u003EBased on earlier accounts, this looks like a problem interacting with RT 2 rather than KSPI.\u003Cp\u003EDoes this happen with RT 2 and a stock instrument?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMod or stock, yes, any experiment with sufficiently large data size will more or less be vulnerable to this problem. So I guess it can be a problem of RT2. Still, the problem is only a slight inconvenience in case of other experiments, because all other experiments can be done again. It is not so in case of KSPI impactor experiment. When your 3rd impact is made, you can never run another 3rd impact. If you lose the 3rd impact data, you cannot recover. This is a KSPI problem.\u003C/p\u003E\u003Cp\u003EEDIT: Actually the RT2 problem is so minor that I had not been aware of the problem at all before the KSPI impactor experiment came. However, with the impact experiment, I usually permanently lose 10~20% of total science amount from the Mun impact experiments so the problem became very noticeable.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-22T13:20:07Z\u0022 title=\u002204/22/2014 01:20  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 22, 2014\u003C/time\u003E by singlet\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"db48x","CreatedById":66108,"CreatedDateTime":"2014-04-22T13:25:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ctbram\u0022 data-cite=\u0022ctbram\u0022\u003E\u003Cdiv\u003EOnce you run out of power and the transmission is broken you lose all remaining science! So you have to have a 100 percent transmission to get all the science!!!! And the author thinks that he is just ified in not sharing the formula because the power to transmit the stock experiments is not published. But all you need to transmit any of the stock experiments is not more then 500ec. His modified experiment draw a ridiculous amount of power to transmit so you can\u0027t just simply slap on a couple batteries you really need to know the total number of packets that will be sent so you can determine the fixed power rate of power generation needed to transmit 100 percent of the data. I am not asking for anything unreasonable!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve never had this happen. If you run out of charge, the antenna just waits until you get back to 10ec and sends the next packet. Once it\u0027s sent all of the packets you will have received all of the science points.\u003C/p\u003E\n"},{"CreatedByName":"Hremsfeld","CreatedById":23422,"CreatedDateTime":"2014-04-22T13:26:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sokar408\u0022 data-cite=\u0022Sokar408\u0022\u003E\u003Cdiv\u003EIn the VAH, Thermal Nozzles and Turbojets and even Plasma Engines, has the exact same values lists, except for the maximum MW they can use, and their weight. However when used there seem to be a difference. How can this be? And if its just me over seeing something, then isn\u0027t there just a ton of parts that are obsolete?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t know about the GRS, so I pruned that out of the quote.\u003C/p\u003E\u003Cp\u003EThe thermal turbojet, when upgraded, is identical to an equal-sized thermal nozzle but with the added ability to use the atmosphere (provided you have scoops). I \u003Cem\u003Ethink\u003C/em\u003E the different sizes of thermal nozzles all perform identically, except they have different attachment node sizes, which impacts ship stability. The Plasma engines all perform equally up until a set amount of power is given to them; a single large plasma thruster has 133% the thrust of an equivalent mass of the next smaller thrusters when all involved are fully powered. The Attila thrusters have the wrong tooltip text, this is a known error. Having not used them, I can\u0027t say how good they are or aren\u0027t or what the difference between the sizes is, but I presume it\u0027s similar to the regular plasma engines.\u003C/p\u003E\n"},{"CreatedByName":"ArcFurnace","CreatedById":109240,"CreatedDateTime":"2014-04-22T15:26:01Z","Content":"\n\u003Cp\u003EYeah, the only difference between different sizes of plasma thruster is the maximum electrical power they can accept (and thus the maximum thrust they can produce), and their mass. For the thermal rockets, I believe there\u0027s some special code that means they work best if attached to the appropriate size of reactor; if you try to attach, say, a 1.25m thermal rocket to the 3.75m reactor because it weighs less than the 3.75m nozzle, you won\u0027t get nearly as much thrust as you would if you used the heavier 3.75m nozzle (because the bigger one has more heat exchanger area to handle the higher throughput, or whatever). That was added in because Fractal wanted to make sure there was actually a reason to use the larger, heavier nozzles.\u003C/p\u003E\n"},{"CreatedByName":"Iforgotthis","CreatedById":102487,"CreatedDateTime":"2014-04-22T15:46:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rabada\u0022 data-cite=\u0022Rabada\u0022\u003E\u003Cdiv\u003EThe power network is not necessary for any of the engines I believe. You can attach reactors directly to thermal rocket engines, and you can attach reactors with generators to run plasma engines. Power networks are not required, but the work put into setting one up definitely pays off. Reactors can get very heavy and having a power network up allows you to use their power without any of their weight.\u003Cp\u003EEdit: Might I suggest watching the excellent Power Network tutorial video made by WaveFunctionP which can be found in \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/76917-Video-Tutorial-KSP-Interstellar-Power-Networks\u0022 rel=\u0022external nofollow\u0022\u003Ethis thread\u003C/a\u003E?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHmm... I suppose it would give me something to do whilst waiting for window openings... I\u0027ll take a look at that video. Thanks! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"BigD145","CreatedById":417,"CreatedDateTime":"2014-04-22T15:52:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022singlet\u0022 data-cite=\u0022singlet\u0022\u003E\u003Cdiv\u003EMod or stock, yes, any experiment with sufficiently large data size will more or less be vulnerable to this problem. So I guess it can be a problem of RT2. Still, the problem is only a slight inconvenience in case of other experiments, because all other experiments can be done again. It is not so in case of KSPI impactor experiment. When your 3rd impact is made, you can never run another 3rd impact. If you lose the 3rd impact data, you cannot recover. This is a KSPI problem.\u003Cp\u003EEDIT: Actually the RT2 problem is so minor that I had not been aware of the problem at all before the KSPI impactor experiment came. However, with the impact experiment, I usually permanently lose 10~20% of total science amount from the Mun impact experiments so the problem became very noticeable.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERT2 changes antenna\u0027s a great deal, from their electrical costs to their retract/extend state. It\u0027s VERY different from stock. It breaks normal stock behavior.\u003C/p\u003E\n"},{"CreatedByName":"bonesbro","CreatedById":104036,"CreatedDateTime":"2014-04-22T18:53:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Hremsfeld\u0022 data-cite=\u0022Hremsfeld\u0022\u003E\u003Cdiv\u003EI don\u0027t know about the GRS, so I pruned that out of the quote.\u003Cp\u003EThe thermal turbojet, when upgraded, is identical to an equal-sized thermal nozzle but with the added ability to use the atmosphere (provided you have scoops). I \u003Cem\u003Ethink\u003C/em\u003E the different sizes of thermal nozzles all perform identically, except they have different attachment node sizes, which impacts ship stability. The Plasma engines all perform equally up until a set amount of power is given to them; a single large plasma thruster has 133% the thrust of an equivalent mass of the next smaller thrusters when all involved are fully powered. The Attila thrusters have the wrong tooltip text, this is a known error. Having not used them, I can\u0027t say how good they are or aren\u0027t or what the difference between the sizes is, but I presume it\u0027s similar to the regular plasma engines.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI added a little information to the wiki about the ATTILA the other day: \u003Ca href=\u0022https://github.com/FractalUK/KSPInterstellar/wiki/ATTILA-thruster\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/FractalUK/KSPInterstellar/wiki/ATTILA-thruster\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"undercoveryankee","CreatedById":103505,"CreatedDateTime":"2014-04-22T22:00:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DivisionByZero\u0022 data-cite=\u0022DivisionByZero\u0022\u003E\u003Cdiv\u003EBased on earlier accounts, this looks like a problem interacting with RT 2 rather than KSPI.\u003Cp\u003EDoes this happen with RT 2 and a stock instrument?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWith RT2 and a stock experiment, if the file is large or transmission is delayed due to power, I sometimes see the \u0022Received data. Science added.\u0022 message partway through the transmission. It appears that when that happens, the experiment\u0027s multiplier updates at that point and I get reduced science for the remaining packets.\u003C/p\u003E\u003Cp\u003EIf that happens to a transmission of impact data, there may be a sequence of events where Interstellar interprets the post-update packets as an attempt to retransmit the same impact and zeros out the science, as ctbram reported.\u003C/p\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2014-04-22T22:12:38Z","Content":"\n\u003Cp\u003EAnd thus was there much complaining that KSPI is broken, when in fact, it is RT2...\u003Cstrong\u003Ewhich is labelled clearly as being broken in 23.5\u003C/strong\u003E.\u003C/p\u003E\u003Cp\u003EI mean really.\u003C/p\u003E\n"},{"CreatedByName":"BigD145","CreatedById":417,"CreatedDateTime":"2014-04-22T22:20:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022phoenix_ca\u0022 data-cite=\u0022phoenix_ca\u0022\u003E\u003Cdiv\u003EAnd thus was there much complaining that KSPI is broken, when in fact, it is RT2...\u003Cstrong\u003Ewhich is labelled clearly as being broken in 23.5\u003C/strong\u003E.\u003Cp\u003EI mean really.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERT2 is also broken in .23. Also .22.\u003C/p\u003E\u003Cp\u003EWhen it comes down to sending science, Interstellar and RemoteTech do things differently. Don\u0027t be surprised when they don\u0027t work together.\u003C/p\u003E\n"},{"CreatedByName":"terrendos","CreatedById":109359,"CreatedDateTime":"2014-04-22T22:59:40Z","Content":"\n\u003Cp\u003EIs anyone else getting a problem where their Alcubierre Drives won\u0027t leave warp? It makes them functionally useless. I\u0027m updated to 23.5, and it seems to exist whether I use old or new save files. Basically, the button to \u0022Activate Warp\u0022 doesn\u0027t switch to \u0022Deactivate Warp\u0022 when I hit the button.\u003C/p\u003E\n"}]}