{"TopicId":40365,"ForumId":34,"TopicTitle":"[0.25]KSP Interstellar (Magnetic Nozzles, ISRU Revamp) Version 0.13","CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2013-08-01T00:05:15Z","PageNum":256,"Articles":[{"CreatedByName":"ctbram","CreatedById":99635,"CreatedDateTime":"2014-02-06T23:40:38Z","Content":"\n\u003Cp\u003EFractal, \u003C/p\u003E\u003Cp\u003ESorry but it appears their is a new problem with the seizmic sensor mod. I did 2 impacts on mun and minmus yesterday with .2 installed and got 500, 300 science. I did two more on mun today and I did not see what I got for the third but for the forth I got 67.7. Then I installed the 0.10.3 update and sent an impactor to minmus. This would have been the 3rd impact, after checking one of the relays I only got 3 science. My friend also installed .3 and reported to me the same thing. He got little or no science.\u003C/p\u003E\u003Cp\u003EAlso, I tried to go to the science center to look at the archive to see what was reported there and there was nothing in the logs. \u003C/p\u003E\u003Cp\u003EI have rolled back to .2 because I was 200 science from completing the 2nd to last column of the science tree. I was able to get the 200 science with two more impacts to minmus. So either the curves were changed or their is a new bug in the impactor science in .3.\u003C/p\u003E\u003Cp\u003E-Rick m\u003C/p\u003E\n"},{"CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2014-02-07T00:11:22Z","Content":"\n\u003Cp\u003EI\u0027m sorry but I\u0027m not seeing the problem. If you aren\u0027t getting much science, are you sure your probe is not running out of charge to transmit? (I may need to revise the packet size slightly because it is quite high but then it\u0027s a relatively late sensor, so you should have plenty of power techs and batteries to power it).\u003C/p\u003E\u003Cp\u003EThis is a sequence of an impact experiment on Minmus, as you can see it works perfectly.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/KxEyYE5.png\u0022 alt=\u0022KxEyYE5.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/qayXWDJ.jpg\u0022 alt=\u0022qayXWDJ.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/0D3Z5Yc.jpg\u0022 alt=\u00220D3Z5Yc.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-07T00:15:29Z\u0022 title=\u002202/07/2014 12:15  AM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 7, 2014\u003C/time\u003E by Fractal_UK\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"123nick","CreatedById":27488,"CreatedDateTime":"2014-02-07T00:35:29Z","Content":"\n\u003Cp\u003Ewait, in the IR telescope, is 550\u0026lt; AU a misstype? you want me to go to 550 TIMES as far away as kerbin is from the kerbol? thats insanity! impossible! i dont think you can go that far without escaping kerbol sol! i need a picture or screenshot to see its possible.\u003C/p\u003E\n"},{"CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2014-02-07T00:36:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022123nick\u0022 data-cite=\u0022123nick\u0022\u003E\u003Cdiv\u003Ewait, in the IR telescope, is 550\u0026lt; AU a misstype? you want me to go to 550 TIMES as far away as kerbin is from the kerbol? thats insanity! impossible! i dont think you can go that far without escaping kerbol sol! i need a picture or screenshot to see its possible.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELook at the second screenshot on the first page...\u003C/p\u003E\u003Cp\u003EEdit: You can use the telescope without going that far out, it\u0027s just better if you do.\u003C/p\u003E\n"},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2014-02-07T00:47:35Z","Content":"\n\u003Cp\u003EFractal: Since you figure out how to increase speed in warp drive mode using solar sails.\u003C/p\u003E\u003Cp\u003EIt would not be time to adjust the ion engine to their real values. This mean more ISP, less energy consumption, less thrust.\u003C/p\u003E\n"},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2014-02-07T00:50:31Z","Content":"\n\u003Cp\u003EFractal: Since you figure out how to increase speed in warp drive mode using solar sails.\u003C/p\u003E\u003Cp\u003EIt would not be time to adjust the ion engine to their real values. This mean more ISP, less energy consumption, less thrust.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022123nick\u0022 data-cite=\u0022123nick\u0022\u003E\u003Cdiv\u003Ewait, in the IR telescope, is 550\u0026lt; AU a misstype? you want me to go to 550 TIMES as far away as kerbin is from the kerbol? thats insanity! impossible! i dont think you can go that far without escaping kerbol sol! i need a picture or screenshot to see its possible.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you reduce the solar sail mass from 1t to 0.1T, you can reach 75000 m/s in escape velocity, with that you can reach 550 AU in 1100 days. This mean 15 min in at full warp time mode? I am not sure.. But is not much.\u003C/p\u003E\n"},{"CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2014-02-07T00:53:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AngelLestat\u0022 data-cite=\u0022AngelLestat\u0022\u003E\u003Cdiv\u003EFractal: Since you figure out how to increase speed in warp drive mode using solar sails.\u003Cp\u003EIt would not be time to adjust the ion engine to their real values. This mean more ISP, less energy consumption, less thrust.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027d love to, Interstellar electric engines already use at least realistic energy consumption to thrust and Isp. Ion engine energy consumption and isp isn\u0027t unreasonable but the thrust is way too high.\u003C/p\u003E\u003Cp\u003EMain problem is that doing it for solar sails and engines is quite a different problem, the game doesn\u0027t allow real timewarp when the throttle is \u0026gt;0, which presents a problem. I probably can\u0027t use the base game engine modules to do it with, I\u0027d have to write an entirely new custom engine module with its own controls, so that could present compatibility problems.\u003C/p\u003E\n"},{"CreatedByName":"mdapol","CreatedById":98306,"CreatedDateTime":"2014-02-07T02:28:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JewelShisen\u0022 data-cite=\u0022JewelShisen\u0022\u003E\u003Cdiv\u003EFor everybody that has been complaning about the change to the stock accel sensor you can \u0022fix\u0022 it with just a tiny change that takes two seconds!\u003Cp\u003EJust find the science.cfg file in the WarpPlugin folder and remove the line that starts with !MODULE from it. Now you have the stock accel science sensor AND the KSPI impact sensor all in one.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EReally?! That\u0027s awesome! Thanks very much.\u003C/p\u003E\u003Cp\u003EAlthough if this is true it mystifies me even more why the stock science was nuked. It makes more sense to me to provide added functionality rather than replacing stock functionality. I really don\u0027t see any advantage to not having the stock science.\u003C/p\u003E\u003Cp\u003EThat being said, is there any way to modify the amount of science gotten through the impactor experiments? Since I am going to add stock functionality back in, I don\u0027t want to gain science too quickly for the end game. After all, FTL should take a long time to acquire.\u003C/p\u003E\n"},{"CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2014-02-07T02:58:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mdapol\u0022 data-cite=\u0022mdapol\u0022\u003E\u003Cdiv\u003EReally?! That\u0027s awesome! Thanks very much.\u003Cp\u003EAlthough if this is true it mystifies me even more why the stock science was nuked. It makes more sense to me to provide added functionality rather than replacing stock functionality. I really don\u0027t see any advantage to not having the stock science.\u003C/p\u003E\u003Cp\u003EThat being said, is there any way to modify the amount of science gotten through the impactor experiments? Since I am going to add stock functionality back in, I don\u0027t want to gain science too quickly for the end game. After all, FTL should take a long time to acquire.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere are two reasons: 1) Balance, there is already too much science available and adding more doesn\u0027t help matters and 2) Logic, a couple of worlds might be still seismically active, most of them will not be and on these worlds landing a seismic sensor without launching impactors is about as useful as landing a potato (Jeb is happy to eat either).\u003C/p\u003E\n"},{"CreatedByName":"AerospaceME","CreatedById":92841,"CreatedDateTime":"2014-02-07T04:17:49Z","Content":"\n\u003Cp\u003EScience feature requests:\u003C/p\u003E\u003Cp\u003E1) Track the mass and speed of impactors while doing the seismic experiment repeats and give bonus science (less fall off for repeats) for using subsequently larger and faster impacts, but only if this would actually be meaningful in real life. I\u0027m not a geologist, so I don\u0027t know if smashing 5 tons at 40 m/s vs. 500 and 400 m/s into a massive planetary body would yield data which was different in a meaningful way. No big deal if not, I\u0027ll still smash as big and as fast as I easily can just for my own edification. A main sail pile driving a few orange tanks into Kerbin is worth the price of admission just for the fireworks.\u003C/p\u003E\u003Cp\u003E2) Now that we have the concepts of interactive science and telescopes, how about coordinated experiments? You get X amount of science for doing an impact with seismic sensors, but you get significantly more if you observe it with a telescope. How much more can depend on the scope distance to the impact and, if we had more telescopes then just the IR, the spectrum detection width of the telescope. IIRC, when the 3rd stages of Saturn V impacted the moon, NASA didn\u0027t just watch the needles blip on the seismographs, they pointed cameras and telescopes at the impact point to study the composition of the body based on the ejected debris. While were on the subject of interactive science, how about an alternate version of the experiment based on intentionally detonating a small AM tank on the surface and in the atmosphere (for bodies with an atmosphere) and studying the results not only with the telescope and seismic sensor, but also the temperature and blast wave pressure with thermometers and barometers placed near by? I realize that\u0027s a heap of coding which might take a fair while to accomplish. Just some thoughts on what to do next with KSPI science. Actually blasting something into a planet after the work of deploying sensors and engineering craft for both is much more fun then just pulling up my standard lander, flying somewhere, landing, clicking, and repeating ad nauseam.\u003C/p\u003E\n"},{"CreatedByName":"Rizendell","CreatedById":67958,"CreatedDateTime":"2014-02-07T04:24:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fractal_UK\u0022 data-cite=\u0022Fractal_UK\u0022\u003E\u003Cdiv\u003EThere are two reasons: 1) Balance, there is already too much science available and adding more doesn\u0027t help matters and 2) Logic, a couple of worlds might be still seismically active, most of them will not be and on these worlds landing a seismic sensor without launching impactors is about as useful as landing a potato (Jeb is happy to eat either).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf there is such a problem with balance and there being too much science available, then maybe you should consider dumping the infinite science generating labs that have no real use, interaction, or entertainment. Just ensure that there is enough science to be gained between the impact experiments (separate part needed), IR tele, and the magnetometer (still cant remove the science data from this part) to fill out the additional nodes you added to the tree or put the lab further up in the tree so the balance isn\u0027t a question.\u003C/p\u003E\u003Cp\u003EThe real issue with not having a separate part/experiment is, I had already filled out all of the science I could get from the career mode before I started messing with KSPI. So when you changed the accelerometer, It basically granted me an additional experiment that I could easily complete and rack in another few thousand science to fill out the rest of the interstellar tree quite easily, essentially doubling the accelerometer science. So your argument that this is for balance just doesn\u0027t add up to people that have already done the stock science. You cant expect that everyone that uses KSPI is going to have it installed from day 1 and that this change isn\u0027t going to affect them when they try it.\u003C/p\u003E\u003Cp\u003EI cant count the number of complaints I\u0027ve heard from people that had missions sent out already, and then they got excited about your update and installed it, only to find out that the missions they sent would be essentially missing a key piece of equipment (i.e. stuff to smash).\u003C/p\u003E\u003Cp\u003EAnyways, there\u0027s my two cents.\u003C/p\u003E\n"},{"CreatedByName":"not-a-cylon","CreatedById":63398,"CreatedDateTime":"2014-02-07T07:53:27Z","Content":"\n\u003Cp\u003Ea little module manager tweak for those using ModularFuels. it adds the resources used as propulsion from the KSPI to most default tanks. I think it works and isn\u0027t OP, but let me know if there\u0027s anything wrong with it...\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E//adds the option to have Argon, Aluminium, Liquid Methane, Liquid Water, to fuel tanks with Modular fuels//\u003Cbr\u003E\u003Cbr\u003E@TANK_DEFINITION[Default]\u003Cbr\u003E{\u003Cbr\u003E\tTANK\u003Cbr\u003E\t{\u003Cbr\u003E\t\tname = Argon\u003Cbr\u003E\t\tmass = 0.005\u003Cbr\u003E\t\tamount = 0.0\u003Cbr\u003E\t\tmaxAmount = 0.0\u003Cbr\u003E\t}\u003Cbr\u003E\u003Cbr\u003E\tTANK\u003Cbr\u003E\t{\u003Cbr\u003E\t\tname = Aluminium\u003Cbr\u003E\t\tmass = 0.0135\u003Cbr\u003E\t\tamount = 0.0\u003Cbr\u003E\t\tmaxAmount = 0.0\u003Cbr\u003E\t}\u003Cbr\u003E\u003Cbr\u003E\tTANK\u003Cbr\u003E\t{\u003Cbr\u003E\t\tname = LqdMethane\u003Cbr\u003E\t\tmass = 0.00186456\u003Cbr\u003E\t\tamount = 0.0\u003Cbr\u003E\t\tmaxAmount = 0.0\u003Cbr\u003E\t}\u003Cbr\u003E\u003Cbr\u003E\tTANK\u003Cbr\u003E\t{\u003Cbr\u003E\t\tname = LqdWater\u003Cbr\u003E\t\tmass = 0.001\u003Cbr\u003E\t\tamount = 0.0\u003Cbr\u003E\t\tmaxAmount = 0.0\u003Cbr\u003E\t}\u003Cbr\u003E}\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2014-02-07T08:15:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rizendell\u0022 data-cite=\u0022Rizendell\u0022\u003E\u003Cdiv\u003EIf there is such a problem with balance and there being too much science available, then maybe you should consider dumping the infinite science generating labs that have no real use, interaction, or entertainment. Just ensure that there is enough science to be gained between the impact experiments (separate part needed), IR tele, and the magnetometer (still cant remove the science data from this part) to fill out the additional nodes you added to the tree or put the lab further up in the tree so the balance isn\u0027t a question.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERemoving the science lab makes not one jot of difference the problem, one science lab wil generate 4-6 science per year assuming it\u0027s deployed at one of the optimal locations so I don\u0027t really buy that generating up to 2000 science per year per lab in the very best locations, especially when you\u0027re competing against science experiments that generate more than 1000 science just by arriving and clicking the experiment button.\u003C/p\u003E\u003Cp\u003EWhen I see people actually making serious use of the labs for career mode progression it tends to be used as part of huge science complexes with large reactors powering some kind of huge offworld science complex and ultimately, that is quite cool. It\u0027s pretty difficult to send such large complexes to the best locations until late in the tech tree anyway\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rizendell\u0022 data-cite=\u0022Rizendell\u0022\u003E\u003Cdiv\u003EThe real issue with not having a separate part/experiment is, I had already filled out all of the science I could get from the career mode before I started messing with KSPI. So when you changed the accelerometer, It basically granted me an additional experiment that I could easily complete and rack in another few thousand science to fill out the rest of the interstellar tree quite easily, essentially doubling the accelerometer science. So your argument that this is for balance just doesn\u0027t add up to people that have already done the stock science. You cant expect that everyone that uses KSPI is going to have it installed from day 1 and that this change isn\u0027t going to affect them when they try it.\u003Cp\u003EI cant count the number of complaints I\u0027ve heard from people that had missions sent out already, and then they got excited about your update and installed it, only to find out that the missions they sent would be essentially missing a key piece of equipment (i.e. stuff to smash).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, it\u0027s quite possible that ongoing saves are going to be affected but I think the change is still worthwhile. To make a counter argument, one of most oft-heard complaints I\u0027ve heard about the stock science system is that there is no actual effort involved on behalf of the user, you simply fly to the world in question, generally loaded up with 5 or 10 copies of every science mission and learn everything there is to know about that place in one mission.\u003C/p\u003E\u003Cp\u003EFundamentally, the stock science system is a tutorial for new players to drip feed components until the player has got the hang of the game. Interstellar has a different audience by and large, players who play with mods tend to disproportionately be a bit more experienced so its no surprise that the focus of career mode should be slightly different to these players - the core idea of Interstellar in career mode is to try and provide a vaguely interesting progression from a 1960s style rocket program all the way up to having an advanced interstellar space program. I think, therefore, that for this audience, it\u0027s okay to make the science system a bit more involved.\u003C/p\u003E\n"},{"CreatedByName":"Lightwarrior","CreatedById":93585,"CreatedDateTime":"2014-02-07T08:56:06Z","Content":"\n\u003Cp\u003EStill experiencing some strange behaviour of nuclear fuel reprocession.\u003C/p\u003E\u003Cp\u003EIt starts and work without an issue until i switch to another craft or just go to space center. The problem is - when i switch back to vessel which is reprocessing fuel the process is interrupted (and message is displayed that fuel cannot be reprocessed) and need to be started again. \u003C/p\u003E\u003Cp\u003EAlso new warning about fusion reactor plasma heating is a bit annoying, in some cases, for example when power is being transmitted using microwave transceiver, it will stay on screen forever.\u003C/p\u003E\n"},{"CreatedByName":"Shad0wCatcher","CreatedById":98819,"CreatedDateTime":"2014-02-07T12:17:03Z","Content":"\n\u003Cp\u003E@not-a-cylon - -Liquid methane is already included in the newest iteration of real fuels; and argon is entirely too dense for its displacement. (I used Xenon as a template in my current game). Otherwise good stuff.\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-02-07T12:48:15Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@FractalUK\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EI was taking a look at the ISRU refinery, as it won\u0027t be too long before my Duna colonization fleet arrives and starts its work... (equipped with parts for orbital construction of new spacecraft, and the RocketParts from other mods to build the refineries among other things to deploy to the surface)\u003C/p\u003E\u003Cp\u003EI realized there is no way to recover the hydrogen (LiquidFuel) used to produce the LiquidMethane in the Sabatier process, as it is currently implemented.\u003C/p\u003E\u003Cp\u003EThe Sabatier Process (which is \u003Cstrong\u003EEXOTHERMIC\u003C/strong\u003E, in real life, and thus does not require massive amounts of electricity like you currently have it implemented- if sufficiently insulated it will produce its own heat, and only requires 300-400 degrees Celsius of heat to start it off), is of course: \u003Cstrong\u003E4 H2 \u002B CO2 --\u0026gt; CH4 \u002B 2 H2O \u002B Energy\u003C/strong\u003E, which is then typically followed up by electrolysis of the water (\u003Cstrong\u003E2 H2O \u002B Energy --\u0026gt; 2 H2 \u002B O2\u003C/strong\u003E)\u003C/p\u003E\u003Cp\u003EIn some real-world proposals to use Sabatier on Mars (what Duna is somewhat emulating), or even the International Space Station (for the life-support systems- to efficiently recycle waste CO2), the refineries would be equipped with the machinery to pyrolyze excess methane (the Sabatier produces more methane than there is enough oxygen produced to burn it with) back into hydrogen gas (which would be re-collected) and pyrolytic graphene (solid carbon). The graphene is then cleared by heating up Martian atmosphere (rich in carbon dioxide) to high temperatures and blasting it across the graphene to oxidize the carbon to carbon monoxide (\u003Cstrong\u003ECO2 \u002B C --\u0026gt; 2 CO\u003C/strong\u003E). In the case of the ISS, the graphene is manually removed (it is made to collect in a removable steel pipe) and disposed of with the next resupply vessel.\u003C/p\u003E\u003Cp\u003EIs it possible to see this functionality added to KSP-I? (LiquidFuel recovery from LiquidMethane- no need to add the complexities of a graphene resource...) This enables recovery of (almost) all hydrogen from the Sabatier, and essentially allows it to be utilized as a means to perform the net reaction \u003Cstrong\u003E2 CO2 \u002B Energy --\u0026gt; 2 CO \u002B O2\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThis could be extremely useful for a number of circumstances... One would be if I were to simply desire to produce Oxidizer locally on Duna to burn with LiquidFuel produced from Kethane, rather than having to produce it from alumina electrolysis on Ike and haul it from there (yes, I\u0027m aware this reduces my mass-leveraging over utilizing methane- but the combustion methane engines don\u0027t come in anything over a 2.5 meter size. The LFO engines, with NovaPunch2, scale up to 5 meters...) Another might possibly be for anyone with a life-support mod installed, as this would essentially allow them to produce oxygen directly out of the Duna atmosphere, as well as water, without ending up with any methane waste-byproduct... (although I\u0027m aware you can also pass it through chemical rocket nozzles directly)\u003C/p\u003E\u003Cp\u003EFinally, I noticed from your screenshots that it looks like the Sabatier process is producing more methane than it is enough oxygen to burn it with (like in real-life)- so the ability to recycle some of the LiquidMethane to recover LiquidFuel to produce more Oxidizer would essentially eliminate all the waste otherwise inherent in the process, and be VERY useful in that regard as well... (you just run extra cycles with hydrogen-recovery to produce the greater amounts of Oxidizer needed to burn all the methane)\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\u003Cp\u003EP.S. It would also be nice if you fixed the Sabatier process to it work like in real-life, where it is energetically-favorable. Just give it a start-up energy cost, like a fusion reaction, and then make it so it only requires a trickle of energy (to add the reactants and remove the products) to keep it running... (*NOT* a steady gush of 40 MW of power, as is currently implemented)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-07T13:14:28Z\u0022 title=\u002202/07/2014 01:14  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 7, 2014\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"JewelShisen","CreatedById":71737,"CreatedDateTime":"2014-02-07T13:15:52Z","Content":"\n\u003Cp\u003EOK so I have a problem with the IR Telescope. Namely the 550GM requirement for max science. It is impossible to do. I used HyperEdit on a test save that I keep going in sandbox and tried to HyperEdit up a ship with all the parts needed (And it would have been nice to know the FIRST time that the IR Telescope needs the Liquid Helium tank). Every time I did that I could get to 500\u002BGM but would have an orbital eccentricity of 1. The game physics can\u0027t handle that large of an orbit.\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-02-07T13:25:17Z","Content":"\n\u003Cp\u003EBy the way, here\u0027s a super-short article on the use of the Sabatier Process in the International Space Station to regenerate water from waste Carbon Dioxide (from respiration) and Hydrogen (from the existing electrolysis equipment for oxygen production)\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.nasa.gov/mission_pages/station/research/news/sabatier.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.nasa.gov/mission_pages/station/research/news/sabatier.html\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt certainly helps that the reaction is \u003Cstrong\u003EEXOTHERMIC\u003C/strong\u003E (*hint, hint*- please don\u0027t forget what I suggested before FractalUK), so it won\u0027t place hardly any additional strain on the station\u0027s electrical systems...\u003C/p\u003E\u003Cp\u003EI also recommend reading pages 155 onwards (the link is to page 156) from this book on In-Situ Resource Utilization. There is actually no need to make use of the complex process I described before utilizing methane-recycling (also described in this book) to produce O2 in net for methane combustion. You can simply make use of the Reverse Water Gas Shift (RWGS) reaction, which is well-known and commonly used in chemical operations on Earth already:\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECO2 \u002B H2 --\u0026gt; CO \u002B 2 H2O\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EYou just follow the RWGS reaction up with electrolysis (\u003Cstrong\u003E2 H2O \u002B Energy --\u0026gt; 2 H2 \u002B O2\u003C/strong\u003E), and feed back the hydrogen, for the net reaction:\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E2 CO2 \u002B Energy --\u0026gt; 2 CO \u002B O2\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThis would be a simpler way to allow In-Situ production of Oxidizer utilizing nothing but energy and Duna\u0027s CO2- which would, as mentioned, be very advantageous for a number of reasons previously mentioned, from LFO production to life-support to methane fuel production efficiency (combine it with the Sabatier Reaction and a bit of electrolysis, and you eliminate ALL the waste of producing more methane than you can burn.)\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-07T13:38:30Z\u0022 title=\u002202/07/2014 01:38  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 7, 2014\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"forsaken1111","CreatedById":2703,"CreatedDateTime":"2014-02-07T14:21:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JewelShisen\u0022 data-cite=\u0022JewelShisen\u0022\u003E\u003Cdiv\u003EOK so I have a problem with the IR Telescope. Namely the 550GM requirement for max science. It is impossible to do. I used HyperEdit on a test save that I keep going in sandbox and tried to HyperEdit up a ship with all the parts needed (And it would have been nice to know the FIRST time that the IR Telescope needs the Liquid Helium tank). Every time I did that I could get to 500\u002BGM but would have an orbital eccentricity of 1. The game physics can\u0027t handle that large of an orbit.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI cheated and it didn\u0027t work so it\u0027s impossible!\u003C/p\u003E\n"},{"CreatedByName":"db48x","CreatedById":66108,"CreatedDateTime":"2014-02-07T14:36:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JewelShisen\u0022 data-cite=\u0022JewelShisen\u0022\u003E\u003Cdiv\u003EOK so I have a problem with the IR Telescope. Namely the 550GM requirement for max science. It is impossible to do. I used HyperEdit on a test save that I keep going in sandbox and tried to HyperEdit up a ship with all the parts needed (And it would have been nice to know the FIRST time that the IR Telescope needs the Liquid Helium tank). Every time I did that I could get to 500\u002BGM but would have an orbital eccentricity of 1. The game physics can\u0027t handle that large of an orbit.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s not 550Gm, it\u0027s 550AU. An astronomical unit (AU) is the distance from earth to the sun, so in the game an AU is the distance from Kerbol to Kerbin, or 1.36e10 meters. 1.36e10 * 5.5e2 = 7.48e12, or 7.48Tm (shown in-game as 7480Gm).\u003C/p\u003E\u003Cp\u003EThere\u0027s a screenshot on the first page of the thread that shows a ship out that far, with an IR telescope using gravitational lensing. It sounds like you didn\u0027t use hyperedit correctly, and put yourself onto an escape trajectory instead of a circular orbit.\u003C/p\u003E\n"},{"CreatedByName":"TheTom","CreatedById":99271,"CreatedDateTime":"2014-02-07T14:36:11Z","Content":"\n\u003Cp\u003EI think he fails the math. MOving an objcect - maintaining the vector - from the homebase to that far away puts it into a very very very awkward orbit per definition. Orbital velocity that far out must be extremely low.\u003C/p\u003E\n"},{"CreatedByName":"Kaa253","CreatedById":68628,"CreatedDateTime":"2014-02-07T14:39:44Z","Content":"\n\u003Cp\u003EYes. I would love to know what was his time to periapsis?\u003C/p\u003E\n"},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2014-02-07T15:00:25Z","Content":"\n\u003Cp\u003EReading all the chemistry talk and minering, it really push me to install the full IQ package. But I still need to solve some bugs.\u003C/p\u003E\u003Cp\u003EThe only that I need like guide to start, if you people \u003Cstrong\u003Ehelp me to indentify some mods conflict that I may have.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EI dont wanna make spend time to anybody making analisys, I just was hoping a quick read to see if someone of you had problems with mods of this list before. Thanks.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EThis is my mod list:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ESquad \u003Cem\u003E(all tanks, adapters, chutes, aerodinamycs parts, cones and others parts remove)\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EReal Fuels 4.3\u003Cem\u003E (with chestbuster config engines)\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EStretchySRB_v8_1\u003C/p\u003E\u003Cp\u003EProceduralDynamics0.7 \u003C/p\u003E\u003Cp\u003EProcFairings_2.4.3 \u003Cem\u003E(I remove half of the parts)\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EB9_Aerospace_Pack_R4.0c \u003Cem\u003E(all aerodinamycs parts and extra tank fuel type remove, etc)\u003C/em\u003E\u003C/p\u003E\u003Cp\u003ENovaPunch2_03a \u003Cem\u003E(all tanks, adapters, or similar parts remove) \u003C/em\u003E\u003C/p\u003E\u003Cp\u003ERealChute-v0.3.3.2 \u003Cem\u003E(some parts remove)\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EALCOR Capsule-v0.7\u003C/p\u003E\u003Cp\u003EKAS_v0.4.5 \u003Cem\u003E(5 parts remove)\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EInfernalRobotics0.12 \u003Cem\u003E(like 15 parts remove)\u003C/em\u003E\u003C/p\u003E\u003Cp\u003ESmart-parts-v0.4 \u003Cem\u003E(3 parts remove)\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EHabitat Pack\u003C/p\u003E\u003Cp\u003ETarsierSpaceTech_2.4-VE\u003C/p\u003E\u003Cp\u003ESCANsat_b5\u003C/p\u003E\u003Cp\u003EToolbar 5.0\u003C/p\u003E\u003Cp\u003ERemoteTech2_Release_1.3.3\u003C/p\u003E\u003Cp\u003EFerramAerospaceResearch_v0.12.5.2\u003C/p\u003E\u003Cp\u003EDeadlyReentryCont_v4.3\u003C/p\u003E\u003Cp\u003ELifeSupportMode ECLSS 1.0.15\u003C/p\u003E\u003Cp\u003EAction Group Manager 1.3.2.0\u003C/p\u003E\u003Cp\u003ERaster Prop Monitor 0.14\u003C/p\u003E\u003Cp\u003EKSI MFD1_1a\u003C/p\u003E\u003Cp\u003Etargetron 1.3.4\u003C/p\u003E\u003Cp\u003Eeditor extensions 0.6\u003C/p\u003E\u003Cp\u003EKerbalAlarmClock_2.7.0.0\u003C/p\u003E\u003Cp\u003EEnhancedNavBall_1_2\u003C/p\u003E\u003Cp\u003EDockingPortAlignment_3.01\u003C/p\u003E\u003Cp\u003EMechJeb2-2.1.1.01\u003C/p\u003E\u003Cp\u003EKos 10\u003C/p\u003E\u003Cp\u003EMultipleSavesDA016\u003C/p\u003E\u003Cp\u003EKalculator-0.1\u003C/p\u003E\u003Cp\u003ERCSBuildAid_v0.4.4\u003C/p\u003E\u003Cp\u003ETacFuelBalancer_2.3.0.2\u003C/p\u003E\u003Cp\u003EThrottleControlledAvionics1.11\u003C/p\u003E\u003Cp\u003EVertVel131\u003C/p\u003E\u003Cp\u003ETweakableEverything-0-6-2\u003C/p\u003E\u003Cp\u003EKerbalJointReinforcement_v2.0\u003C/p\u003E\u003Cp\u003EVisualEnhancments-6-7 (pimp my clouds)\u003C/p\u003E\u003Cp\u003ETexture Remplacer (edraxial planets and moons, pimp my kerbals, skybox)\u003C/p\u003E\u003Cp\u003ETextureCompressor-2-15-aggressive\u003C/p\u003E\u003Cp\u003ELast ExsurgentEngineering.dll and Firespitter.dll\u003C/p\u003E\u003Cp\u003EWorks fine until I add Interstellar quest, then I have some graphics bugs if I go and back 2 or 3 times from launch to the VAH (maybe due to memory), or I can not end or delete vessels from Tracking Station, some other problems with part activations, etc.)\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003EFractal\u003C/strong\u003E: Main problem is that doing it for solar sails and engines is quite a different problem, the game doesn\u0027t allow real timewarp when the throttle is \u0026gt;0, which presents a problem. I probably can\u0027t use the base game engine modules to do it with, I\u0027d have to write an entirely new custom engine module with its own controls, so that could present compatibility problems.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI understand, you are right, There are different approach.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-07T15:02:33Z\u0022 title=\u002202/07/2014 03:02  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 7, 2014\u003C/time\u003E by AngelLestat\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"InfinityArch","CreatedById":66832,"CreatedDateTime":"2014-02-07T15:13:03Z","Content":"\n\u003Cp\u003ERegarding the Helium-3 Question:\u003C/p\u003E\u003Cp\u003EAh, I see. I hadn\u0027t tried yet, and it doesn\u0027t say that in the wiki. It would definitely be helpful to note that in the wiki.\u003C/p\u003E\n"},{"CreatedByName":"JewelShisen","CreatedById":71737,"CreatedDateTime":"2014-02-07T15:14:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022db48x\u0022 data-cite=\u0022db48x\u0022\u003E\u003Cdiv\u003EIt\u0027s not 550Gm, it\u0027s 550AU. An astronomical unit (AU) is the distance from earth to the sun, so in the game an AU is the distance from Kerbol to Kerbin, or 1.36e10 meters. 1.36e10 * 5.5e2 = 7.48e12, or 7.48Tm (shown in-game as 7480Gm).\u003Cp\u003EThere\u0027s a screenshot on the first page of the thread that shows a ship out that far, with an IR telescope using gravitational lensing. It sounds like you didn\u0027t use hyperedit correctly, and put yourself onto an escape trajectory instead of a circular orbit.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOk that was a minor typo. I do know how to use hyperedit and i am telling you that when i told it to put me into an orbit around the sun at the altitude needed, it did not work.\u003C/p\u003E\n"}]}