{"TopicId":40365,"ForumId":34,"TopicTitle":"[0.25]KSP Interstellar (Magnetic Nozzles, ISRU Revamp) Version 0.13","CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2013-08-01T00:05:15Z","PageNum":132,"Articles":[{"CreatedByName":"Eadrom","CreatedById":91728,"CreatedDateTime":"2013-11-15T12:49:29Z","Content":"\n\u003Cp\u003EI\u0027ve been very happy with my 1.25m and 2.5m warp ships (test and research ship, respectively). Now I want to build a big 3.75m warp freighter. I\u0027d like to the quantum plasma thruster as I\u0027ve enjoyed only having to fuel up with antimatter on the previous two classes of warp ships and still getting a nice amount of acceleration out of them (12-14 m/s^2). There isn\u0027t a 3.75m plasma thruster, so herein lies my question. Does anyone know offhand if I should just use a 2.5m plasma thruster or a bank of 4 1.25 plasma thrusters?\u003C/p\u003E\u003Cp\u003EI want to say that I read somewhere that there was some difference between the two sizes of plasma thruster so you would want to use the bigger one on 2.5m or larger ships, but I can\u0027t remember what, if any, those differences are.\u003C/p\u003E\u003Cp\u003EEdit:\u003C/p\u003E\u003Cp\u003EAlso, would adding a 3.75m-\u0026gt;2.5m structural adapter for aesthetic reasons have any meaningful impact on the effectiveness of the plasma thruster if I used one 2.5m PT?\u003C/p\u003E\u003Cp\u003EEdit 2:\u003C/p\u003E\u003Cp\u003EWell I launched my warp freighter and it weighs in at a little over 110 tons in orbit. I used a 3.75-\u0026gt;2.5 flat adapter from KW Rocketry to attach a 2.5m plasma thruster to the back of the warp drive (\u0022rear\u0022-most component in the central stack). I get an *insane* acceleration of over 22m/s^2. I could add a couple hundred tons of cargo and still have really nice TWR. So even if there was another configuration that would give more TWR, I\u0027m perfectly happy with the setup I have. lol\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-15T15:48:45Z\u0022 title=\u002211/15/2013 03:48  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 15, 2013\u003C/time\u003E by Eadrom\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NotCoach","CreatedById":91874,"CreatedDateTime":"2013-11-15T14:10:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Srilania\u0022 data-cite=\u0022Srilania\u0022\u003E\u003Cdiv\u003EReason we\u0027re not using it? There\u0027s too much money to be made with the current system. That\u0027s the ONLY reason.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think that is a gross oversimplification. However, this isn\u0027t the place to debate the politics of thorium reactors.\u003C/p\u003E\u003Cp\u003EFractal, with the introduction of thorium reactors would it be possible to have automatic on/off cycling? The benefit being reduced heat transfer requirements. The downside, of course, is reduced energy output. But it would add an interesting wrinkle to ship design I think. Your power production would be directly related to your radiator capacity, and a person would size their generators to their heat transfer capacity instead of to the size of their reactor (more or less). This would probably allow for more precise energy calculation needs on a vessel, and prolong the life of the fuel in your reactor.\u003C/p\u003E\n"},{"CreatedByName":"AeroEngy","CreatedById":92772,"CreatedDateTime":"2013-11-15T15:05:17Z","Content":"\n\u003Cp\u003EI just wanted to say again this mod is so much fun. See below for my latest missions.\u003C/p\u003E\u003Cp\u003ESent a Science Sat to Jool that is powered via antimatter collection. I used that to unlock the last science node. Then I set up a ground based antimatter fuel farm. Next built a spaceplane with 2x thermal turbojets, 1x plasma thruster, and an Alcubierre drive. I fueled it up on the runway with my farm and then flew to Eve and back. I flew diagonally across the system and had to do a 10k\u002B dV change when entering Eve\u0027s SOI. It all worked pretty well except for almost overheating on the 5g several minute long burn to get captured by Eve. I only have the small heat sinks for aesthetics but it is worth it.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/GIh7r\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-15T15:29:17Z\u0022 title=\u002211/15/2013 03:29  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 15, 2013\u003C/time\u003E by AeroEngy\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"XanderTek","CreatedById":92553,"CreatedDateTime":"2013-11-15T17:01:24Z","Content":"\n\u003Cp\u003EDoes anyone know how much power the antimatter tanks require? I seem to have run into a situation where I\u0027m feeding it enough power to keep up containment, but still get an error when trying to go over 50x time warp. I think perhaps I\u0027m right on the edge.\u003C/p\u003E\u003Cp\u003EEdit: Also, I may have found a bug. I have a 3.75m antimatter tank, antimatter reactor, and generator, and a 2.5m plasma engine. The engine seems to keep working, at least in some reduced capacity, after I run out of antimatter.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-15T18:24:42Z\u0022 title=\u002211/15/2013 06:24  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 15, 2013\u003C/time\u003E by XanderTek\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Eadrom","CreatedById":91728,"CreatedDateTime":"2013-11-15T20:55:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022XanderTek\u0022 data-cite=\u0022XanderTek\u0022\u003E\u003Cdiv\u003EEdit: Also, I may have found a bug. I have a 3.75m antimatter tank, antimatter reactor, and generator, and a 2.5m plasma engine. The engine seems to keep working, at least in some reduced capacity, after I run out of antimatter.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYour plasma drive will still work for a short period of time after you run out of antimatter as your power supply chain breaks down. You\u0027ll keep full engine power as you run out of antimatter, which means thermal power production stops. As the generator burns through the remaining thermal power, power levels will still remain level. If I remember correctly, it\u0027s when you run out of antimatter, and then thermal power, and then finally megajoules drop low is when you will experience engine power drop off.\u003C/p\u003E\u003Cp\u003EAre you referring to still keeping a few mm/s^2 of acceleration after running out of antimatter, thermal power, and megajoules? I think this was an issue that Fractal has already fixed in 8.0.\u003C/p\u003E\n"},{"CreatedByName":"XanderTek","CreatedById":92553,"CreatedDateTime":"2013-11-15T22:13:26Z","Content":"\n\u003Cp\u003EIt was after all the antimatter, thermal power, and megajoules were gone. It wasn\u0027t very much thrust. I didn\u0027t think it was that small, but I\u0027ll have to see if I can replicate it.\u003C/p\u003E\u003Cp\u003EAnother different odd occurance that I can\u0027t quite figure out: I took a warp drive to Jool, then performed a rather firy aerocapture. My radiators were retracted, and nothing broke off, but afterwards my antimatter drive refused to throttle up. I still had antimatter, and everything looked fine. Any thoughts?\u003C/p\u003E\n"},{"CreatedByName":"Srilania","CreatedById":70829,"CreatedDateTime":"2013-11-15T23:23:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fractal_UK\u0022 data-cite=\u0022Fractal_UK\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EDon\u0027t get me wrong, LFTR is a neat idea but there are lots of other good nuclear designs out there, Uranium and Thorium. Choosing between them on abudance grounds is pointless, there is enough Uranium available on land to power the world for thousands of years and enough in the sea for hundreds of thousands at only moderately increased cost - I estimate 40,000 tons of Uranium per year for 100,000 years - enough for 40,000 1GW plants (or 2.5x current worldwide energy useage). Breeder reactors might multiply that by another 100 or 200 so there\u0027s a fair bit of room to increase both supply and lifetime simultaneously. So, Thorium has plenty of time to catch up.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe issue is, it takes 150 tons of uranium ore, to make 35 tons of useable uranium fuel and 115 tons of \u0022depleted uranium\u0022 in order to create a 1GW year of power. The same can be done with one ton of thorium ore, which, is as common as lead, and is found in rare earth ores. Since we need rare earth ores for hard drives, electronics, wind turbines, electric motors, and many more of our modern things, this thorium right now is nothing more than a waste byproduct, with hundreds of thousands of tons already ready to just dig out of pits they were reburied into, and used for a reactor. Add to it the wastes are a lot shorter lived than what\u0027s in a Light Water uranium reactor, and the costs are less to construct and operate? makes more sense now to use them.\u003C/p\u003E\n"},{"CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2013-11-16T00:12:28Z","Content":"\n\u003Cp\u003EWill this work fine in sandbox mode if the tree loader plugin is not installed?\u003C/p\u003E\n"},{"CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2013-11-16T00:32:31Z","Content":"\n\u003Cp\u003ENot quite as productive a day in development as yesterday was but I did realise that in order to actually test out my new resource system and mine some Uranium/Thorium I was going to need to be able to reach some!\u003C/p\u003E\u003Cp\u003EThe markers on the ground are really useful for when you\u0027re in the vacinity but not so useful if you want to perform a targeted landing, many people, myself included, tend to resort to mechjeb to save time when a targeted landing is needed which means I needed to make sure the resources were visible from the map view.\u003C/p\u003E\u003Cp\u003ESame setup as before: if your vessel has line of sight to a deposit you can see it, otherwise not.\u003C/p\u003E\u003Cp\u003EThese are the thorium locations seen in the normal game view. Don\u0027t worry about the ones over the ocean, moving them is easy, it\u0027s all the backend stuff that is the hard work.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/kFNAOl3.png\u0022 alt=\u0022kFNAOl3.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ENow we can also see them on the map view\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/PZf7bAk.png\u0022 alt=\u0022PZf7bAk.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KhaosCorp\u0022 data-cite=\u0022KhaosCorp\u0022\u003E\u003Cdiv\u003EWill this work fine in sandbox mode if the tree loader plugin is not installed?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt will be fine. You don\u0027t strictly need TreeLoader even in career mode, it just improves the experience with the extended tech tree.\u003C/p\u003E\n"},{"CreatedByName":"AndreyATGB","CreatedById":62674,"CreatedDateTime":"2013-11-16T00:56:15Z","Content":"\n\u003Cp\u003ESince I\u0027ve installed this at the same time as Remote tech, I didn\u0027t get enough time to work on getting science. I\u0027ve got a question though, it looks like getting science will unlock new parts, but how do I upgrade current ones?\u003C/p\u003E\n"},{"CreatedByName":"Draft","CreatedById":72633,"CreatedDateTime":"2013-11-16T01:26:41Z","Content":"\n\u003Cp\u003EThey\u0027ll have a \u0027retrofit\u0027 option in their right-click menu when applicable\u003C/p\u003E\n"},{"CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2013-11-16T01:58:10Z","Content":"\n\u003Cp\u003EIs it just me or are the panel style radiators just WAY to fragile.....dont get me wrong, I agree they should get sheered off if deployed in lowwer atmo, but as is even the most frail solar panels you can get in KSP are about 3 times stronger. They seems off to me....these should be at least a bit more stout than solar panels..even if its not by much. I understand that these would be constructed of lightweight materials, as all things gettin fired off into space are...but I honestly cant see any logical reason why they would be weaker than solar panels. \u003C/p\u003E\u003Cp\u003EAlso a question about the microwave system, does this only relay megajouls, or will it also transfer good ol electric charge? And what kinda range does it have...will it work at any atl within SoI long as Line of Sight is maintained?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-16T02:07:49Z\u0022 title=\u002211/16/2013 02:07  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 16, 2013\u003C/time\u003E by KhaosCorp\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Sigma","CreatedById":77754,"CreatedDateTime":"2013-11-16T02:53:46Z","Content":"\n\u003Cp\u003EIn career mode, the lithium tank is locked off, it says I require an entry purchase in R\u0026amp;D. Is this normal?\u003C/p\u003E\n"},{"CreatedByName":"Patupi","CreatedById":71098,"CreatedDateTime":"2013-11-16T04:14:23Z","Content":"\n\u003Cp\u003EAll that means is you unlocked that tech node prior to installing the mod I believe? If you click it you receive it as I think all the modded items in this (and most mods) cost 0 research to unlock\u003C/p\u003E\n"},{"CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2013-11-16T16:34:30Z","Content":"\n\u003Cp\u003EI\u0027ve now added support for multiple resource textures so you can display different resources in different ways, making it easier to see at a glance which map you are looking at. I\u0027ve also improved the Kerbin resource maps to ensure that all the large deposits are found over land - and as much as possible in the sorts of areas you might expect to find them.\u003C/p\u003E\u003Cp\u003EThe resource system is pretty much finished now, it\u0027s just a matter of generating maps for every body now. Laythe and Eve are going to pose the same problems as Kerbin thanks to their oceans but thankfully the rest can be randomly generated.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#EE82EE;\u0022\u003E\u003Cstrong\u003EPurple\u003C/strong\u003E\u003C/span\u003E = Thorium\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022color:#FFD700;\u0022\u003EYellow\u003C/span\u003E\u003C/strong\u003E = Uranium\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/3Saz7Pt.jpg\u0022 alt=\u00223Saz7Pt.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/3PnLWwu.jpg\u0022 alt=\u00223PnLWwu.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/DLaFoWS.png\u0022 alt=\u0022DLaFoWS.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003EIf you\u0027re a modder and you\u0027re interested in hooking into this system, it\u0027s incredibly easy. You can generate planetary resources with a ConfigNode, like this:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003EPLANETARY_RESOURCE_DEFINITION\u003Cbr\u003E{\u003Cbr\u003E\tname = Uranium // The name you want to use to refer to the resource\u003Cbr\u003E\tcelestialBodyName = Mun // The name of the celestial body you want the map to apply to\u003Cbr\u003E\tresourceName = UF4 // The name of the in game resource that should be generated by exploiting this resource\u003Cbr\u003E\tmapUrl = WarpPlugin/PlanetResourceData/mun_uranium // Path of the image texture to parse as the resource map, grayscale values are read\u003Cbr\u003E\tresourceScale = LOG_SCALE // You can use LOG_SCALE or LINEAR_SCALE, linear uses amount = 1/255 * pixel value*scaleMultiplier, log uses scaleMultiplier*scaleFactor^(pixel value)/1000000\u003Cbr\u003E\tscaleFactor = 1.0311580936394657748190008944693 // the scale factor used above\u003Cbr\u003E\tscaleMultiplier = 2 // the scale multiplier used above\u003Cbr\u003E\tdisplayTexture = WarpPlugin/uranium_resource_point // the texture the displayed sphere will use\u003Cbr\u003E\tdisplayThreshold = 0.001 // the minimum amount of a resource at a particular point that is worth displaying\u003Cbr\u003E}\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EA resource map image might look something like this:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/fQsc6zQ.png\u0022 alt=\u0022fQsc6zQ.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EYou can then create some kind of scanner to detect that resource with this module added to a part.cfg\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003EMODULE\u003Cbr\u003E{\u003Cbr\u003E\tname = FNResourceScanner\u003Cbr\u003E\tresourceName = Uranium\u003Cbr\u003E\tmapViewAvailable = true\u003Cbr\u003E}\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-16T16:37:52Z\u0022 title=\u002211/16/2013 04:37  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 16, 2013\u003C/time\u003E by Fractal_UK\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"theSpeare","CreatedById":62144,"CreatedDateTime":"2013-11-16T16:49:31Z","Content":"\n\u003Cp\u003EThese resource maps are preset right? Which means it won\u0027t be random with each playthrough.\u003C/p\u003E\u003Cp\u003EFractal - have you ever thought about expanding a little bit more on how science is gathered with the science lab, or are you okay and completely finished with it?\u003C/p\u003E\n"},{"CreatedByName":"CAPFlyer","CreatedById":8575,"CreatedDateTime":"2013-11-16T16:58:11Z","Content":"\n\u003Cp\u003EIs this system going to be compatible with SCANSat? It would be nice to be able to have a unified scanning system as it\u0027ll reduce the workload a little bit on our computers.\u003C/p\u003E\n"},{"CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2013-11-16T17:00:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fractal_UK\u0022 data-cite=\u0022Fractal_UK\u0022\u003E\u003Cdiv\u003E I\u0027ve also improved the Kerbin resource maps to ensure that all the large deposits are found over land - and as much as possible in the sorts of areas you might expect to find them.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELooks great..a couple questions though.\u003C/p\u003E\u003Cp\u003EHow big are the deposits under the markers...or more importantly how pinpoint does the landing have to be on the deposit marker in order to harvest.\u003C/p\u003E\u003Cp\u003EAlso, why is everyone so put-off by off-shore drilling? Jeb loves to run around on the deck of drilling ships screaming \u0022Im BP yall muhahaha\u0022!!\u003C/p\u003E\u003Cp\u003EBut seriously, its more realistic and not that hard to get to underwater deposits. I\u0027ve drilled for kethane on Kerbin at depths of around 800meters using only stock parts, KAS, and of course kethane parts. The trick is keeping the root part of craft above water, and CoM above -200m or so.\u003C/p\u003E\n"},{"CreatedByName":"Patupi","CreatedById":71098,"CreatedDateTime":"2013-11-16T17:22:36Z","Content":"\n\u003Cp\u003EFrom what you said earlier Fractal_UK the maps dots are the peaks of ore strength, right? So the \u0027maps\u0027 for water worlds could be contructed from random conglomerations of fixed maps superimposed on each other, and as the various amplitudes overlap, adding (and maybe subtracting? Might include one partially negative map in the mix per planet?) to give a truly random spread of the peaks.\u003C/p\u003E\u003Cp\u003EIs this more or less what you are doing at present Fractal, or is it more (or less) complicated? I can see being simpler and just having a random selection between a few fixed maps per ocean planet, or even going the other whole way. ie A map of where land is and where ore concentrations should be more prevalent, then procedurally generating a map within those limits each time the save starts.\u003C/p\u003E\n"},{"CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2013-11-16T17:51:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KhaosCorp\u0022 data-cite=\u0022KhaosCorp\u0022\u003E\u003Cdiv\u003ELooks great..a couple questions though.\u003Cp\u003EHow big are the deposits under the markers...or more importantly how pinpoint does the landing have to be on the deposit marker in order to harvest.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe deposits are pretty large so if you land on the marker, you should be fine. You don\u0027t need to be directly on target either, the map has resource values for an entire planet and they tend to be somewhat concentrated so if you\u0027re trying to land on a high value target and miss, you won\u0027t get as much but there\u0027s a good chance you\u0027ll still be in area with a reasonable amount.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KhaosCorp\u0022 data-cite=\u0022KhaosCorp\u0022\u003E\u003Cdiv\u003EAlso, why is everyone so put-off by off-shore drilling? Jeb loves to run around on the deck of drilling ships screaming \u0022Im BP yall muhahaha\u0022!!\u003Cp\u003EBut seriously, its more realistic and not that hard to get to underwater deposits. \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMain problem with underwater deposits is detection, even with a gamma ray spectrometer (and gamma rays are very penetrating), there is no way you\u0027re going to get readings through even hundreds of metres of ocean. Almost any orbital detector you could imagine would have the same problems, localised detectors might function differently but it would require a lot of extra code to support making those kind of distinctions.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Patupi\u0022 data-cite=\u0022Patupi\u0022\u003E\u003Cdiv\u003EFrom what you said earlier Fractal_UK the maps dots are the peaks of ore strength, right? So the \u0027maps\u0027 for water worlds could be contructed from random conglomerations of fixed maps superimposed on each other, and as the various amplitudes overlap, adding (and maybe subtracting? Might include one partially negative map in the mix per planet?) to give a truly random spread of the peaks.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat I\u0027m doing at the moment is fractally generating resource maps, then trying to modify them to conform to the terrain of the planet. Since they\u0027re images, they\u0027re fairly easy to work with if I have a 2D map image of the planet at the same scale. For the planets with oceans, I\u0027m trying to avoid visible concentrations being automatically generated and placing them manually - that way I can try to put them in interesting places.\u003C/p\u003E\n"},{"CreatedByName":"Srilania","CreatedById":70829,"CreatedDateTime":"2013-11-16T19:04:48Z","Content":"\n\u003Cp\u003EA silly question, but instead of doing all that extra work, could you not simply use the Kethane plugin, since it has a setup for adding new resources to scan for?\u003C/p\u003E\n"},{"CreatedByName":"Patupi","CreatedById":71098,"CreatedDateTime":"2013-11-16T19:07:52Z","Content":"\n\u003Cp\u003EWouldn\u0027t help with oceans. I don\u0027t think any of Majiir\u0027s work can adjust for terrain features... yet.\u003C/p\u003E\n"},{"CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2013-11-16T19:24:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Srilania\u0022 data-cite=\u0022Srilania\u0022\u003E\u003Cdiv\u003EA silly question, but instead of doing all that extra work, could you not simply use the Kethane plugin, since it has a setup for adding new resources to scan for?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI could have but there are several issues with that idea, it adds dependencies meaning that people have to have Kethane installed in order to take advantage of primary features of this mod. Kethane doesn\u0027t support resources being available everywhere in varying quantities, it works off fixed deposits and elsewhere there is nothing. I have control over the exact positions of all resources which gives me certain options for future updates.\u003C/p\u003E\u003Cp\u003EI\u0027ve also set things up somewhat differently, these resources will be the same for everyone, which has both benefits and drawbacks but it does mean you can share and discuss good resource locations on each planet.\u003C/p\u003E\u003Cp\u003EI think both the Kethane and this resource system can happily sit side by side, each having slightly different applications.\u003C/p\u003E\n"},{"CreatedByName":"xfrankie","CreatedById":93378,"CreatedDateTime":"2013-11-16T23:46:55Z","Content":"\n\u003Cp\u003EHi guys, I have a slight problem with (probably) anti-matter reactor on my AM farm. \u003C/p\u003E\u003Cp\u003EIt has a sufficent supply of AM, generator attached, radiators deployed etc. but it doesn\u0027t generate any power...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/xodduFD.png\u0022 alt=\u0022xodduFD.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/EM8mLS2.png\u0022 alt=\u0022EM8mLS2.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAny idea how to fix it?\u003C/p\u003E\n"},{"CreatedByName":"Eadrom","CreatedById":91728,"CreatedDateTime":"2013-11-17T04:43:04Z","Content":"\n\u003Cp\u003EIt might be an issue where it has burned through all the antimatter in the tank the reactor \u0022sees\u0022 so while you might have antimatter in other tanks, it isn\u0027t gaining enough antimatter from your collectors to keep the MJ topped off.\u003C/p\u003E\u003Cp\u003ETry swapping the AM around in the tanks to see if that fixes the problem. It looks like you are drawing 1 MW for the computer core, and .2 for each of the large antimatter tanks. You should be able to supply such a small amount of draw very easily, so that leads me to think that while your reactor IS getting AM (since it doesn\u0027t say AM deprived), it is only getting a tiny amount from the those antimatter collectors, which appears to be not enough to keep power systems topped off.\u003C/p\u003E\u003Cp\u003EI\u0027m not an expert in the mod, and I have no idea how the code works in the background, but that would be my suggestion based on personal experience and the pics shown.\u003C/p\u003E\n"}]}