{"TopicId":40365,"ForumId":34,"TopicTitle":"[0.25]KSP Interstellar (Magnetic Nozzles, ISRU Revamp) Version 0.13","CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2013-08-01T00:05:15Z","PageNum":414,"Articles":[{"CreatedByName":"NeoAcario","CreatedById":24645,"CreatedDateTime":"2014-07-22T05:31:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022WaveFunctionP\u0022 data-cite=\u0022WaveFunctionP\u0022\u003E\u003Cdiv\u003EFinished a first pass on cost adjustments. Expect wildly inflated costs and relative weirdness. Feedback on SPECIFIC part costs is appreciated. Yes, cost is intended to somewhat prohibit what you are able to do. career != sandbox.\u003Cp\u003EResource costs( and recovery, hopefully), along with ongoing part cost adjustments are coming next.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s my man! Just what I\u0027ve been waiting for. Tell me, what\u0027s different in your version compared to the F-UK version? Have a change log? Do you have any plans for something like no selling back AM?\u003C/p\u003E\u003Cp\u003EDo you have the collapsible warp drives in there instead of the stock ones... or with the stock ones... at all?\u003C/p\u003E\u003Cp\u003E~Steve\u003C/p\u003E\n"},{"CreatedByName":"Kiithnaras","CreatedById":116290,"CreatedDateTime":"2014-07-22T05:41:32Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022color:#808080;\u0022\u003ECurious issue. Using upgraded KTEC generators don\u0027t seem to generate power from basic Fission reactors now in either Uranium or Thorium modes. Not sure if that always was, is an issue with x64, or is an issue with Experimental. Figured it\u0027d be worth mentioning.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#000000;\u0022\u003EAlright, pinned that one down - It seems that I fiddled with \u003C/span\u003E\u003Cem\u003E\u003Cspan style=\u0022color:#000000;\u0022\u003Esomething\u003C/span\u003E\u003C/em\u003E\u003Cspan style=\u0022color:#000000;\u0022\u003E in the VAB on a Deployable Phased Array, setting the transmit power up decently high. However, the transmit was disabled, and thermal power levels were just fine. Somehow, it decided that it was just going to make the generator unable to produce energy, no matter how much I toggled its power. Weird. Everything is working fine now.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#000000;\u0022\u003EAlso, having to wait for moderators to approve posts is a big PITA.\u003C/span\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-22T07:49:53Z\u0022 title=\u002207/22/2014 07:49  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 22, 2014\u003C/time\u003E by Kiithnaras\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"WaveFunctionP","CreatedById":104784,"CreatedDateTime":"2014-07-22T06:20:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NeoAcario\u0022 data-cite=\u0022NeoAcario\u0022\u003E\u003Cdiv\u003EThat\u0027s my man! Just what I\u0027ve been waiting for. Tell me, what\u0027s different in your version compared to the F-UK version? Have a change log? Do you have any plans for something like no selling back AM?\u003Cp\u003EDo you have the collapsible warp drives in there instead of the stock ones... or with the stock ones... at all?\u003C/p\u003E\u003Cp\u003E~Steve\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Echangelog is located in the folder.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/au307ai8xyi3lgz/changelog.txt\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/au307ai8xyi3lgz/changelog.txt\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"KvickFlygarn87","CreatedById":76314,"CreatedDateTime":"2014-07-22T06:42:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NeoAcario\u0022 data-cite=\u0022NeoAcario\u0022\u003E\u003Cdiv\u003ESo what\u0027s the deal with FracktalUK? Some people say he\u0027s on Vacation... Is he really on a vacation.. or just taking a break from KSP? Did I miss a post of his somewhere?\u003Cp\u003E~Steve\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo idea why he\u0027s gone but he is. It\u0027s been a month today since his last activity.\u003C/p\u003E\u003Cp\u003EEDIT: His last post at page 983 shows no indication that he\u0027s abandoned it. It shows quite the opposite; him getting people all hyped up for 0.12.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-22T06:50:45Z\u0022 title=\u002207/22/2014 06:50  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 22, 2014\u003C/time\u003E by KvickFlygarn87\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Atrius129","CreatedById":107132,"CreatedDateTime":"2014-07-22T06:51:32Z","Content":"\n\u003Cp\u003ESo glad to see work being done on this!\u003C/p\u003E\u003Cp\u003EI checked the changelog and didn\u0027t see anything relating to the costs. Have you added the updated your experimental version to include these yet?\u003C/p\u003E\n"},{"CreatedByName":"theSpeare","CreatedById":62144,"CreatedDateTime":"2014-07-22T07:13:15Z","Content":"\n\u003Cp\u003EYeah, wavefunction when will you be sending out the cost adjustments? Furthermore, are you just posting new experimental versions as you go or do you have a main post or thread somewhere holding the main links?\u003C/p\u003E\n"},{"CreatedByName":"WaveFunctionP","CreatedById":104784,"CreatedDateTime":"2014-07-22T08:34:03Z","Content":"\n\u003Cp\u003EI can\u0027t very well ask for feedback on changes that are not yet public. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe experimental version includes all changes I make as I make them.\u003C/p\u003E\n"},{"CreatedByName":"Lord DC","CreatedById":110588,"CreatedDateTime":"2014-07-22T12:09:59Z","Content":"\n\u003Cp\u003EWait a minute, Fractal_UK left Interstellar? NOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO!\u003C/p\u003E\n"},{"CreatedByName":"sam1133","CreatedById":107853,"CreatedDateTime":"2014-07-22T12:27:52Z","Content":"\n\u003Cp\u003EHi, love the mod, but ksp wont load past warpplugin models thingy...on 64bit, anyone know why please.\u003C/p\u003E\u003Cp\u003Ethanx\u003C/p\u003E\n"},{"CreatedByName":"KvickFlygarn87","CreatedById":76314,"CreatedDateTime":"2014-07-22T13:23:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Lord DC\u0022 data-cite=\u0022Lord DC\u0022\u003E\u003Cdiv\u003EWait a minute, Fractal_UK left Interstellar? NOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEh, no. Noone said that. He \u003Cem\u003Emight\u003C/em\u003E have but no certainties. He may just be on vacation or something.\u003C/p\u003E\n"},{"CreatedByName":"Konnor","CreatedById":95430,"CreatedDateTime":"2014-07-22T15:27:15Z","Content":"\n\u003Cp\u003EAn observation: Rapier engine overheats in air-breathing mode (exploding at about Mach 4.5) \u003Cem\u003Eeven with inline air intakes adjacent to precoolers\u003C/em\u003E (without radial intakes whatsoever). Happens in both 0.11 and WaveFunctionP\u0027s experimental. Did not try B9 precoolers yet, only stock radial engine body, may have something to do with 0.24 changes adding liquid fuel. But right click menu does display precooler status as active.\u003C/p\u003E\n"},{"CreatedByName":"Stratoroc","CreatedById":73987,"CreatedDateTime":"2014-07-22T15:41:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Konnor\u0022 data-cite=\u0022Konnor\u0022\u003E\u003Cdiv\u003EAn observation: Rapier engine overheats in air-breathing mode (exploding at about Mach 4.5) \u003Cem\u003Eeven with inline air intakes adjacent to precoolers\u003C/em\u003E (without radial intakes whatsoever). Happens in both 0.11 and WaveFunctionP\u0027s experimental. Did not try B9 precoolers yet, only stock radial engine body, may have something to do with 0.24 changes adding liquid fuel. But right click menu does display precooler status as active.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eprecoolers do something now? that\u0027s new.\u003C/p\u003E\n"},{"CreatedByName":"AndreyATGB","CreatedById":62674,"CreatedDateTime":"2014-07-22T15:42:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Stratoroc\u0022 data-cite=\u0022Stratoroc\u0022\u003E\u003Cdiv\u003Eprecoolers do something now? that\u0027s new.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s pretty old, I think even 0.10 had this.\u003C/p\u003E\u003Cp\u003EEDIT: yep, it\u0027s from 0.9.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-22T15:44:40Z\u0022 title=\u002207/22/2014 03:44  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 22, 2014\u003C/time\u003E by AndreyATGB\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"WafflesToo","CreatedById":71736,"CreatedDateTime":"2014-07-22T18:32:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nightdagger\u0022 data-cite=\u0022Nightdagger\u0022\u003E\u003Cdiv\u003EThe seismic accelerometer isn\u0027t allowing the recording of impact data, which I\u0027m pretty sure is a feature of Interstellar. And one of my favorite ones, I\u0027m sad it\u0027s not working, because I love parking seismic probes on heavenly bodies and then blasting them with glorified missiles \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003Cp\u003EAny chance of this being looked at soon, either in the official or unofficial builds?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think I know what\u0027s wrong. I had a very similar problem with the Magnetometer recently and darn near went bald trying to find the cause. Check for multiple science.cfg files in the game folders. Deleting all but the one in the WarpDrive folder fixed it for me.\u003C/p\u003E\n"},{"CreatedByName":"benkh","CreatedById":116153,"CreatedDateTime":"2014-07-22T18:53:35Z","Content":"\n\u003Cp\u003EExcuse me please if this question has been asked before, but has there been any information regarding Fractal_UK current status?\u003C/p\u003E\u003Cp\u003E~Ben\u003C/p\u003E\n"},{"CreatedByName":"Crim1","CreatedById":116163,"CreatedDateTime":"2014-07-22T20:14:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022benkh\u0022 data-cite=\u0022benkh\u0022\u003E\u003Cdiv\u003EExcuse me please if this question has been asked before, but has there been any information regarding Fractal_UK current status?\u003Cp\u003E~Ben\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERumor has it, that Fractal, Tupac Shakur, and Bruce Willis have been recruited to carry out a secret 1 way mission to Mars. (shrug) seems legit.\u003C/p\u003E\n"},{"CreatedByName":"benkh","CreatedById":116153,"CreatedDateTime":"2014-07-22T20:21:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Crim1\u0022 data-cite=\u0022Crim1\u0022\u003E\u003Cdiv\u003ERumor has it, that Fractal, Tupac Shakur, and Bruce Willis have been recruited to carry out a secret 1 way mission to Mars. (shrug) seems legit.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELet\u0027s hope that this is not true \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Talavar","CreatedById":75264,"CreatedDateTime":"2014-07-22T20:22:53Z","Content":"\n\u003Cp\u003EOK, Im lost in a sea of information and links. \u0022It\u0027s like I\u0027m screaming out against soul destroying winds!\u0022 Can someone pass me the link to the newest version and status information on Experimental Interstellar?\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-07-22T21:07:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022WaveFunctionP\u0022 data-cite=\u0022WaveFunctionP\u0022\u003E\u003Cdiv\u003EFinished a first pass on cost adjustments. Expect wildly inflated costs and relative weirdness. Feedback on SPECIFIC part costs is appreciated. Yes, cost is intended to somewhat prohibit what you are able to do. career != sandbox.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESome feedback \u003Cstrong\u003Especifically\u003C/strong\u003E on the Thermal Rocket Nozzles.\u003C/p\u003E\u003Cp\u003EFirst of all, so everybody else knows what I am talking about, their current costs from the experimental version linked to in your signature:\u003C/p\u003E\u003Cp\u003E3.75m = 675000\u003C/p\u003E\u003Cp\u003E2.5m = 125000\u003C/p\u003E\u003Cp\u003E1.25m = 25000\u003C/p\u003E\u003Cp\u003E0.625m = 5000\u003C/p\u003E\u003Cp\u003EThose costs are, as you warned they might be, \u003Cstrong\u003EWILDLY INFLATED.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EYou see, in real life, \u003Cstrong\u003Eone of the greatest advantages of thermal rockets is that they are cheaper than chemical rockets.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EYou read that right- \u003Cstrong\u003ECHEAPER\u003C/strong\u003E, *not* more expensive.\u003C/p\u003E\u003Cp\u003EThermal rockets have fewer moving parts than chemical rockets, and require less complex engineering. The materials costs are also lower.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EThe vast majority of the cost of thermal rocketry is in the power source, not in the heat exchangers themselves.\u003C/strong\u003E For instance, a nuclear thermal rocket is composed of a wildly expensive nuclear reactor coupled with a relatively cheap heat exchanger and nozzle.\u003C/p\u003E\u003Cp\u003EThe real-life costs are so wildly divergent between chemical and thermal rocketry that, even with Microwave Beamed Power, the cost of the heat exchanger \u002B microwave receiver is significantly \u003Cstrong\u003ELOWER\u003C/strong\u003E than that of a comparably-sized chemical rocket.\u003C/p\u003E\u003Cp\u003EA 1.25 meter Thermal Rocket Nozzle (currently priced at 25000) plus a 1.25 meter Thermal Receiver (haven\u0027t checked the price for that yet) should cost \u003Cstrong\u003ELESS\u003C/strong\u003E than a LV-T30 (currently priced at 850), for instance.\u003C/p\u003E\u003Cp\u003EWhat makes thermal rocketry expensive in real life, as well as in the game, is the cost of the power source.\u003C/p\u003E\u003Cp\u003EI.E. take the following cost-analysis of Microwave Beamed Power thermal rocketry:\u003C/p\u003E\u003Cp\u003E- Solar panels are heavy (for their power production) and expensive for the amount of power they produce- and even more expensive to beam that power to a Thermal Rocket (Microwave Transceivers, unlike Thermal Receivers, \u003Cstrong\u003Eshould\u003C/strong\u003E be expensive). More expensive STILL to build a rocket to launch a solar panel to near-solar orbit, though with a cheap enough launch system this should be capable of bringing down the overall price-per-watt.\u003C/p\u003E\u003Cp\u003E- Nuclear reactors are heavy (those much less mass per watt produced, compared to solar panels at 1 AU), and wildly expensive for the amount of power they produce (though comparable on the ground with solar, overall, reactors are cheaper in orbit in the short run, due to the lower mass-per-watt and associated launch costs). Nuclear reactors capable of operating in zero-gravity are especially expensive (though the Russians built and launched several for their low-altitude military satellites during the Cold War- so not inconceivably so). Transmitting the power to thermal rockets is still expensive (once again, due to the cost of the transmitters- the Thermal Receivers are dirt-cheap by comparison), and nuclear reactors have recurring fuel/maintenance costs (especially for a space-based reactor, which is going to require regular visits to remove Actinide build-up, or a lot of heavy radiation-shielding to build in into a manned craft) that solar panels don\u0027t, making them even more expensive in the long run...\u003C/p\u003E\u003Cp\u003EI choose to analyze Microwave Beamed Power thermal rockets here, because they are \u003Cstrong\u003EBY FAR\u003C/strong\u003E the cheaper alternative to attaching a nuclear reactor to each and every thermal rocket- since the same reactor can power an entire fleet of Microwave-Powered thermal rockets with beamed power, instead of just one rocket (and also adding its mass to that rocket, drastically increasing launch costs) for placing those reactors on the rockets using them.\u003C/p\u003E\u003Cp\u003EWith enough launches to amortize the cost of a nuclear reactor over, the cost of beamed-power thermal rockets falls well BELOW the cost of chemical rockets, due to the lower cost of the thermal rockets themselves...\u003C/p\u003E\u003Cp\u003EI suggest reading up on the economics of Beamed Power Thermal Rocketry a bit in this simple presentation (uses visible light lasers instead of microwaves- which are actually more expensive, but have lower transmission losses in space- making lasers more useful for boosting payloads to geosynchronous and higher orbits in a real solar system, instead of one Kerbal-sized)\u003C/p\u003E\u003Cp\u003ENote particularly the bullet-point on the second page: \u0022\u003Cstrong\u003EVery Low Marginal Cost to Orbit\u003C/strong\u003E\u0022 (the cost of the rockets themselves, vs. the ground infrastructure)\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.niac.usra.edu/files/library/meetings/fellows/mar04/897Kare.pdf\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.niac.usra.edu/files/library/meetings/fellows/mar04/897Kare.pdf\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnd in this Doctoral Thesis, if you have the time:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://thesis.library.caltech.edu/2405/1/Parkin-Thesis.pdf\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://thesis.library.caltech.edu/2405/1/Parkin-Thesis.pdf\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnd in some of the additional links in my forum thread about Next-Generation launch technologies:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/81147-Next-Generation-launch-technologies-achievable-with-CURRENT-technology?p=1210983\u0026amp;viewfull=1#post1210983\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/81147-Next-Generation-launch-technologies-achievable-with-CURRENT-technology?p=1210983\u0026amp;viewfull=1#post1210983\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EP.S.\u003C/strong\u003E Also, I noticed that the configs for the Thermal Rocket Nozzles all still have the phrase \u0022LV-T30 Liquid Fuel Engine\u0022 commented out at the top. My guess is that this is due to the configs originally being derived from those for the LT-T30 in some manner. However it is obviously inaccurate. The comments should either be changed to describe the *CORRECT* parts (the respective thermal rocket nozzles), or deleted altogether to make the configs a little shorter and easier to understand.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-22T21:34:49Z\u0022 title=\u002207/22/2014 09:34  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 22, 2014\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Talavar","CreatedById":75264,"CreatedDateTime":"2014-07-22T23:06:05Z","Content":"\n\u003Cp\u003EMaybe I\u0027m the only person who thinks this, but all of this stuff should be beyond the normal science tree. lets be honest.. you should build up in the stock game before you start hitting stuff that gives you basically \u0022Free science\u0022 And to North-star, While your application of prices are very informative, the cost could remain low, but we had regular rockets and such WAY before any of this came into study. The science for any of this crap should be immense considering alot of it is impractical, or completely beyond normal capabilities of applying such technolog. Also, you should be starting with the weakest fuel up to the highest consecutively moving to the higher form. Don\u0027t throw 2 of them out at once. It also helps with the learning curve of the mod to allow persons to acquire such technology slowly so they can get used to the new stuff. Just my two cents on the subject. I can always change the stuff myself, but thought, just maybe, you may see my point. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Keep this in mind.. the current cost of building a nuclear engine is estimated at 2 Billion and doesn\u0027t have launch capabilities! The current cost of launching a rocket is 500 million. So if your launching a small nuclear engine into space that cant launch itself, the cost should be roughly 4 times that of the launch itself. If your building one with launch capabilities... well.. heh... It\u0027s gonna be ALOT more than that.. lol\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-22T23:33:40Z\u0022 title=\u002207/22/2014 11:33  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 22, 2014\u003C/time\u003E by Talavar\u003C/strong\u003E\n\u003Cbr\u003Eadded info\n\u003C/span\u003E\n"},{"CreatedByName":"Shade0017","CreatedById":87044,"CreatedDateTime":"2014-07-22T23:55:28Z","Content":"\n\u003Cp\u003ESo Wavefunction, I just checked out your Interstellar videos. Yes I was still there, yes it was worth my time, can I have some more please? Oh and thank you. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"WafflesToo","CreatedById":71736,"CreatedDateTime":"2014-07-23T00:32:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Talavar\u0022 data-cite=\u0022Talavar\u0022\u003E\u003Cdiv\u003EMaybe I\u0027m the only person who thinks this, but all of this stuff should be beyond the normal science tree. lets be honest.. you should build up in the stock game before you start hitting stuff that gives you basically \u0022Free science\u0022 And to North-star, While your application of prices are very informative, the cost could remain low, but we had regular rockets and such WAY before any of this came into study. The science for any of this crap should be immense considering alot of it is impractical, or completely beyond normal capabilities of applying such technolog. Also, you should be starting with the weakest fuel up to the highest consecutively moving to the higher form. Don\u0027t throw 2 of them out at once. It also helps with the learning curve of the mod to allow persons to acquire such technology slowly so they can get used to the new stuff. Just my two cents on the subject. I can always change the stuff myself, but thought, just maybe, you may see my point. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Keep this in mind.. the current cost of building a nuclear engine is estimated at 2 Billion and doesn\u0027t have launch capabilities! The current cost of launching a rocket is 500 million. So if your launching a small nuclear engine into space that cant launch itself, the cost should be roughly 4 times that of the launch itself. If your building one with launch capabilities... well.. heh... It\u0027s gonna be ALOT more than that.. lol\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhere are you getting your information from? A great deal of this \u0022crap\u0022 exists now; the plasma thruster is a real thing, the arc thruster is a real thing, the thermal turbojet is from the 50s, microwave beaming is a real thing. A lot of this doesn\u0027t exist either because of a lack of funding or will to do so... and some of it doesn\u0027t exist because of politics (and face it, do you know anybody you\u0027d trust with a 400GW microwave emitter antenna? I sure don\u0027t).\u003C/p\u003E\u003Cp\u003EPersonally I think Northstar brings up a good point; most of the cost of a thermal engine is not in the engine; it\u0027s in the power source... though I really think he overstated his case just a smidge. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Jaxx","CreatedById":95312,"CreatedDateTime":"2014-07-23T00:37:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022WafflesToo\u0022 data-cite=\u0022WafflesToo\u0022\u003E\u003Cdiv\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe best argument is the one that\u0027s done thoroughly. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Please keep his information in mind and act on it, Wave. It\u0027s going to basically change if people actually view your mod as something attainable and therefore something they want.\u003C/p\u003E\n"},{"CreatedByName":"WaveFunctionP","CreatedById":104784,"CreatedDateTime":"2014-07-23T00:42:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Northstar1989\u0022 data-cite=\u0022Northstar1989\u0022\u003E\u003Cdiv\u003ESome feedback \u003Cstrong\u003Especifically\u003C/strong\u003E on the Thermal Rocket Nozzles.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFirst, I am glad that you took the time to write your post, and I don\u0027t wish to discourage others from providing feedback.\u003C/p\u003E\u003Cp\u003EHowever, real world value is of little interest to me. I designed the prices in part to reflect the part\u0027s relative performance. kspi outperform stock parts pretty much across the board. After you unlock fusion, there is little reason to ever use stock parts. The cost of kspi parts is meant to provide a reason to use stock parts and to limit the effect of kspi\u0027s wildly inflated performance. Make no mistake. KSPI breaks the game as early as basic fusion and it gets worse from there. The exponentially large inflation of part effectiveness outstrips the challenge of the game and makes it trivial.\u003C/p\u003E\u003Cp\u003EIf kspi parts aren\u0027t so easy to buy, then it becomes less of a problem. It also encourages the player to make decisions over how best to spend their excess funds intelligently. Otherwise you end up with this:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.twitch.tv/wavefunctionp/c/4534515\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.twitch.tv/wavefunctionp/c/4534515\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E4th mission STOs capable of landing on every single body except the sun and Jool in one single complete grand tour of the entire system. Even broken parachutes are much cause for concern.\u003C/p\u003E\u003Cp\u003ECost isn\u0027t the only factor that needs to be tweaked, otherwise kspi becomes a funds grind, but at least it helps to keep kspi in a more balanced state. With more resource limits on parts, perhaps the cost of some parts can be reduced. But of some sort of limitation either in infrastructure (resources) or funds is meant to be a balancing factor.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-23T00:45:17Z\u0022 title=\u002207/23/2014 12:45  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 23, 2014\u003C/time\u003E by WaveFunctionP\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Talavar","CreatedById":75264,"CreatedDateTime":"2014-07-23T01:43:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022WafflesToo\u0022 data-cite=\u0022WafflesToo\u0022\u003E\u003Cdiv\u003EWhere are you getting your information from? A great deal of this \u0022crap\u0022 exists now; the plasma thruster is a real thing, the arc thruster is a real thing, the thermal turbojet is from the 50s, microwave beaming is a real thing. A lot of this doesn\u0027t exist either because of a lack of funding or will to do so... and some of it doesn\u0027t exist because of politics (and face it, do you know anybody you\u0027d trust with a 400GW microwave emitter antenna? I sure don\u0027t).\u003Cp\u003EPersonally I think Northstar brings up a good point; most of the cost of a thermal engine is not in the engine; it\u0027s in the power source... though I really think he overstated his case just a smidge. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E Yes, some of it DOES exist. But most of it isn\u0027t even practical. And as I was saying before you tried to blow my comment to shreds with nothing but whatever you saw that wasn\u0027t there. I said we had rockets before any of this stuff.. not that (some of) it doesn\u0027t exist. But, no, some of it doesn\u0027t exist.. (warpdrive for instance) which is my point entirely.\u003C/p\u003E\n"}]}