{"TopicId":40365,"ForumId":34,"TopicTitle":"[0.25]KSP Interstellar (Magnetic Nozzles, ISRU Revamp) Version 0.13","CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2013-08-01T00:05:15Z","PageNum":203,"Articles":[{"CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2014-01-01T02:59:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Shad0wCatcher\u0022 data-cite=\u0022Shad0wCatcher\u0022\u003E\u003Cdiv\u003EBiggest issue I have with that is the guideline thread for resource naming conventions. I\u0027d like to keep my install fairly close with regards to that. On top of which when using say Near Future and KSPI both are using different definitions of Argon and won\u0027t play well together (already changed my install so that they would. Along those lines; running Real Fuels on top of everything you get into different storage mediums and could feasibly store different fuel-types in different phases for energy density for example.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHaving multiple resource definitions of the same type is problematic anyway, so Interstellar using ArgonGas or NFPP using Argon is a bad idea if only for that reason. It\u0027s possible to correct but that is best done with ModuleManager. RealFuels is a bit different because I\u0027ve done a fair bit of work to help NathanKell set up the compatibility there but it\u0027s tough to find the time to do that for a large number of mods.\u003C/p\u003E\u003Cp\u003EDonziboy: I\u0027m aware of the tritium breeding issue, I think I fixed it today but I haven\u0027t had time to test it yet.\u003C/p\u003E\n"},{"CreatedByName":"Shad0wCatcher","CreatedById":98819,"CreatedDateTime":"2014-01-01T03:14:16Z","Content":"\n\u003Cp\u003EOh for sure, I completely understand the time constraints myself. One thing I changed that I don\u0027t know if you want to look at with regards to your mod is Ammonia being defined as Ammonia vs LqdAmmonia. Without any config edits it won\u0027t work as a propulsion medium using real fuels (nor will mining it with the Refinery), and as it\u0027s cryogenic I think the standard is that it be defined as LqdAmmonia since @ STP it\u0027s a gaseous, stinky, eye-wateringly awful substance.\u003C/p\u003E\n"},{"CreatedByName":"Sigma","CreatedById":77754,"CreatedDateTime":"2014-01-01T04:43:37Z","Content":"\n\u003Cp\u003EWhat\u0027s the lethal radius of the Vista\u0027s radiation?\u003C/p\u003E\n"},{"CreatedByName":"Eadrom","CreatedById":91728,"CreatedDateTime":"2014-01-01T09:12:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sigma\u0022 data-cite=\u0022Sigma\u0022\u003E\u003Cdiv\u003EWhat\u0027s the lethal radius of the Vista\u0027s radiation?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022https://github.com/FractalUK/KSPInterstellar/wiki/DT-Vista-Inertial-Fusion-Engine\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/FractalUK/KSPInterstellar/wiki/DT-Vista-Inertial-Fusion-Engine\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EPer the wiki, it is 2km.\u003C/p\u003E\n"},{"CreatedByName":"JMBuilder","CreatedById":30493,"CreatedDateTime":"2014-01-01T13:31:50Z","Content":"\n\u003Cp\u003EThe only other mods I had installed were Hyperedit and Infernal Robotics and this mod still gave me trouble. I guess Hyperedit and Infernal Robotics are fairly large mods?\u003C/p\u003E\n"},{"CreatedByName":"Eadrom","CreatedById":91728,"CreatedDateTime":"2014-01-01T14:06:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JMBuilder\u0022 data-cite=\u0022JMBuilder\u0022\u003E\u003Cdiv\u003EThe only other mods I had installed were Hyperedit and Infernal Robotics and this mod still gave me trouble. I guess Hyperedit and Infernal Robotics are fairly large mods?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat issues were you having and have those two mods you had installed been updated for 0.23?\u003C/p\u003E\n"},{"CreatedByName":"CleverLikeMe","CreatedById":98361,"CreatedDateTime":"2014-01-01T14:38:13Z","Content":"\n\u003Cp\u003EAny chance we could see the science tools get a sweep to allow them to be collected while in EVA (like the stock science tools)?\u003C/p\u003E\n"},{"CreatedByName":"JMBuilder","CreatedById":30493,"CreatedDateTime":"2014-01-01T14:41:27Z","Content":"\n\u003Cp\u003EThe mods were up to date.\u003C/p\u003E\u003Cp\u003EAs for the issues, I had followed the installation instructions exactly, but things were still odd. While building in the SPH, the building was transparent. You could see through the walls, roof, and even the floor. After about two minutes of building, the game crashed.\u003C/p\u003E\n"},{"CreatedByName":"Eadrom","CreatedById":91728,"CreatedDateTime":"2014-01-01T15:23:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JMBuilder\u0022 data-cite=\u0022JMBuilder\u0022\u003E\u003Cdiv\u003EThe mods were up to date.\u003Cp\u003EAs for the issues, I had followed the installation instructions exactly, but things were still odd. While building in the SPH, the building was transparent. You could see through the walls, roof, and even the floor. After about two minutes of building, the game crashed.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve not had this happen before and I use a slew of mods (in my sig). I would recommend trying to run KSP with Interstellar and Hyperedit. See if that gives same issue. Run KSP with Infernal Robotics. See if that gives the same issue.\u003C/p\u003E\u003Cp\u003EMy money is on Hyperedit. I believe Scott Manley\u0027s current series, Interstellar Quest, includes Infernal Robotics in its mod list. I have no clue why you would be having this issue. You could also try a fresh install of KSP and all three mods. Remember that in your game data folder, Interstellar needs three separate folders and the Module Manager .dll.\u003C/p\u003E\u003Cp\u003E../Kerbal Space Program/GameData/WarpPlugin/\u003C/p\u003E\u003Cp\u003E../Kerbal Space Program/GameData/TreeLoader/\u003C/p\u003E\u003Cp\u003E../Kerbal Space Program/GameData/HexCans/\u003C/p\u003E\u003Cp\u003E../Kerbal Space Program/GameData/ModuleManager_1_5.dll\u003C/p\u003E\u003Cp\u003EDo not put the three folders that come in the KSPI download in one folder in GameData. They need to be installed like I have listed above.\u003C/p\u003E\n"},{"CreatedByName":"JMBuilder","CreatedById":30493,"CreatedDateTime":"2014-01-01T16:05:32Z","Content":"\n\u003Cp\u003ESo keep them inside the main GameData folder, but separate from each other, right?\u003C/p\u003E\n"},{"CreatedByName":"RussPixie","CreatedById":57271,"CreatedDateTime":"2014-01-01T17:15:19Z","Content":"\n\u003Cp\u003EOk, here\u0027s an interesting bug that i haven\u0027t seen mentioned yet... maybe it\u0027s only me.\u003C/p\u003E\u003Cp\u003EOn the \u0022Discovery\u0022 ship, as featured a couple of pages back, I\u0027ve started to reprocess the Thorium Actinides that have started to build up in the reactor. Unfortunately, they seem to be being reprocessed into Uranium. The 3.75m Reactor was set to Thorium in the VAB, with all Uranium removed from the reactor and replaced by Thorium using the Tweakables, and has 4 thorium/depleted fuel tanks physically attached to it.\u003C/p\u003E\u003Cp\u003EPics or it didn\u0027t happen...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-2.steampowered.com/ugc/883003003695885644/DBAF452803C6AB71410773E742165EACA3BE4B49/\u0022 alt=\u0022DBAF452803C6AB71410773E742165EACA3BE4B49\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m using the latest version of KSPI. \u003C/p\u003E\u003Cp\u003E\u003Cem\u003EOther mods are Kethane, Engineer, Void, Tac fuel balancer, Crew manifest, RCS build aid (VAB/SPH only plugin), Kerbal Alarm clock, THSS (Parts only tanks and structural stuff) and Clouds and City lights.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003ERuss\u003C/p\u003E\n"},{"CreatedByName":"Tygroux","CreatedById":75717,"CreatedDateTime":"2014-01-01T18:02:38Z","Content":"\n\u003Cp\u003ESimple question: does radiators convect on atmosphereless planets surfaces?\u003C/p\u003E\u003Cp\u003EDoes it radiate the heat to space, or convect to the ground?\u003C/p\u003E\u003Cp\u003EIE if i land a nuclear reactor on minmus or the mun, does an inline readiator suffice, or do i need a full load of radiator to handle it?\u003C/p\u003E\n"},{"CreatedByName":"Shad0wCatcher","CreatedById":98819,"CreatedDateTime":"2014-01-01T18:17:07Z","Content":"\n\u003Cp\u003EIn-line radiators only convect to atmosphere / space, not the ground. They\u0027ll work on any planet with an atmosphere; and no so well in anywhere that has vacuum.\u003C/p\u003E\n"},{"CreatedByName":"Kenken244","CreatedById":36865,"CreatedDateTime":"2014-01-01T20:10:33Z","Content":"\n\u003Cp\u003EThat might actually make a cool addition though, having some sort of drill used for heat convection to the surface of a planet. It would be useful for bases\u003C/p\u003E\n"},{"CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2014-01-01T22:20:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kenken244\u0022 data-cite=\u0022Kenken244\u0022\u003E\u003Cdiv\u003EThat might actually make a cool addition though, having some sort of drill used for heat convection to the surface of a planet. It would be useful for bases\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, it\u0027s actually something I have considered because it\u0027s an interesting idea and it\u0027s something else that encourages people to build bases and deploy infrastructure on other planets, things I like to encourage. It\u0027s not a top priority thing but don\u0027t rule out seeing it in the future.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RussPixie\u0022 data-cite=\u0022RussPixie\u0022\u003E\u003Cdiv\u003EOk, here\u0027s an interesting bug that i haven\u0027t seen mentioned yet... maybe it\u0027s only me.\u003Cp\u003EOn the \u0022Discovery\u0022 ship, as featured a couple of pages back, I\u0027ve started to reprocess the Thorium Actinides that have started to build up in the reactor. Unfortunately, they seem to be being reprocessed into Uranium. The 3.75m Reactor was set to Thorium in the VAB, with all Uranium removed from the reactor and replaced by Thorium using the Tweakables, and has 4 thorium/depleted fuel tanks physically attached to it.\u003C/p\u003E\u003Cp\u003EPics or it didn\u0027t happen...\u003C/p\u003E\u003Cp\u003EI\u0027m using the latest version of KSPI. \u003C/p\u003E\u003Cp\u003E\u003Cem\u003EOther mods are Kethane, Engineer, Void, Tac fuel balancer, Crew manifest, RCS build aid (VAB/SPH only plugin), Kerbal Alarm clock, THSS (Parts only tanks and structural stuff) and Clouds and City lights.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003ERuss\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, you\u0027re right, I just looked at this again and the logic I used is terrible (not sure what I was doing!) - you should definitely be getting Thorium too, so it isn\u0027t a total bust, but I\u0027ll try and figure out some better code for next time.\u003C/p\u003E\n"},{"CreatedByName":"RussPixie","CreatedById":57271,"CreatedDateTime":"2014-01-01T23:18:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fractal_UK\u0022 data-cite=\u0022Fractal_UK\u0022\u003E\u003Cdiv\u003EYeah, you\u0027re right, I just looked at this again and the logic I used is terrible (not sure what I was doing!) - you should definitely be getting Thorium too, so it isn\u0027t a total bust, but I\u0027ll try and figure out some better code for next time.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExcellent, thanks for the response.\u003C/p\u003E\u003Cp\u003ERuss\u003C/p\u003E\n"},{"CreatedByName":"Dreadp1r4te","CreatedById":98426,"CreatedDateTime":"2014-01-02T00:12:20Z","Content":"\n\u003Cp\u003EHey guys; not sure if I\u0027m doing something wrong or what the deal here is, but at the moment the KSPI tech I\u0027ve unlocked seems fairly inefficient when compared with stock KSP tech. I\u0027ve only gotten the fission reactors, thermal rocket, plasma jets, and electrical generators thus far, and I realize they probably get better with upgrades, but I haven\u0027t gotten to the science lab yet and I have to say it\u0027s kind of disappointing how useless these parts are when you get them. First I tried a nuclear rocket-powered probe, and while it had fantastic ISP (using pure hydrogen as fuel) it completely lacked the thrust to make any notable course corrections. It\u0027s presently stuck in an orbit around Duna, and the only reason it got there was because my 2nd stage 1.5m Orbital Achievement device put it there. I figured I just made an error in judgement, later tried a larger thermal rocket (2.5m) running LFO, which made decent thrust (more than the 2.5m Nerva) but weighed so much that it ran out of fuel before it got anywhere. Finally, I figured the mod\u0027s description of plasma jets indicated they were somewhat superior in thrust to the stock Ion engines, so I loaded up a probe with a tiny fission reactor, plasma jet, electrical generator, and a stack of xenon and some sensors. Total weight: 1.5 tons, and total thrust output? 0.0kn indicated. So, yeah. I get that this is supposed to be endgame stuff, but I really think I should be getting some better results, at least useful stuff, even if it could be better. For example, the thermal rockets should be a bit more powerful considering that each one of them MUST be attached to a nuclear reactor, so building a craft with more than one of them requires more than one reactor, plus cooling stuff for it. \u003C/p\u003E\u003Cp\u003EEither that or I\u0027m just doing something horribly wrong and misread something, so feel free to correct me if I\u0027ve missed something...\u003C/p\u003E\n"},{"CreatedByName":"Donziboy2","CreatedById":74984,"CreatedDateTime":"2014-01-02T00:38:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dreadp1r4te\u0022 data-cite=\u0022Dreadp1r4te\u0022\u003E\u003Cdiv\u003EHey guys; not sure if I\u0027m doing something wrong or what the deal here is, but at the moment the KSPI tech I\u0027ve unlocked seems fairly inefficient when compared with stock KSP tech. I\u0027ve only gotten the fission reactors, thermal rocket, plasma jets, and electrical generators thus far, and I realize they probably get better with upgrades, but I haven\u0027t gotten to the science lab yet and I have to say it\u0027s kind of disappointing how useless these parts are when you get them. First I tried a nuclear rocket-powered probe, and while it had fantastic ISP (using pure hydrogen as fuel) it completely lacked the thrust to make any notable course corrections. It\u0027s presently stuck in an orbit around Duna, and the only reason it got there was because my 2nd stage 1.5m Orbital Achievement device put it there. I figured I just made an error in judgement, later tried a larger thermal rocket (2.5m) running LFO, which made decent thrust (more than the 2.5m Nerva) but weighed so much that it ran out of fuel before it got anywhere. Finally, I figured the mod\u0027s description of plasma jets indicated they were somewhat superior in thrust to the stock Ion engines, so I loaded up a probe with a tiny fission reactor, plasma jet, electrical generator, and a stack of xenon and some sensors. Total weight: 1.5 tons, and total thrust output? 0.0kn indicated. So, yeah. I get that this is supposed to be endgame stuff, but I really think I should be getting some better results, at least useful stuff, even if it could be better. For example, the thermal rockets should be a bit more powerful considering that each one of them MUST be attached to a nuclear reactor, so building a craft with more than one of them requires more than one reactor, plus cooling stuff for it. \u003Cp\u003EEither that or I\u0027m just doing something horribly wrong and misread something, so feel free to correct me if I\u0027ve missed something...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe unupgraded reactors and thermal rockets are not meant to replace a Nerva, upgrade them and they will beat the NERVA. Add Antimatter to that and the Nerva will be a fart compared to them.\u003C/p\u003E\u003Cp\u003EThe parts you have unlocked are not endgame stuff, once you unlock more they will be..\u003C/p\u003E\n"},{"CreatedByName":"Dreadp1r4te","CreatedById":98426,"CreatedDateTime":"2014-01-02T00:53:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Donziboy2\u0022 data-cite=\u0022Donziboy2\u0022\u003E\u003Cdiv\u003EThe unupgraded reactors and thermal rockets are not meant to replace a Nerva, upgrade them and they will beat the NERVA. Add Antimatter to that and the Nerva will be a fart compared to them.\u003Cp\u003EThe parts you have unlocked are not endgame stuff, once you unlock more they will be..\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s exactly my point; if they offer little-to-no notable advantage (in any area) to a stock component of equal size and role, why unlock them in their un-upgraded state? Who would want to use them when the stock NERVAs (which you get in the same node, at least if you\u0027re not using the custom KSPI tech tree, not sure when you unlock them if you do use it) and stock ION engine is better in nearly every aspect? The only notable advantage the parts I have unlocked thus far is an obvious advantage in ISP, but at the cost of either so much extra weight or so little thrust that that advantage is completely wasted because you can\u0027t pump out enough delta-V to adjust your course in time. I\u0027m not complaining, merely offering some feedback that I think the parts should be at least somewhat useful in their unlocked-state, and then get improved upon even more in endgame, not be useless right up until endgame.\u003C/p\u003E\u003Cp\u003EThen again, I also think the science advancement in career mode is much too slow (hence why I\u0027m not using the custom KSPI tech tree, which adds all the KSPI parts after the end of the stock tree) and I rather dislike how part \u0022A\u0022 depends on the inclusion of part \u0022B\u0022 which is in a completely different node, meaning you effectively have to have 2-3x as much science to use a part that you\u0027ve unlocked. KSPI seems to compound this by making most of these parts lackluster until upgraded, and the science lab is quite a ways down the tree.\u003C/p\u003E\n"},{"CreatedByName":"Eadrom","CreatedById":91728,"CreatedDateTime":"2014-01-02T00:58:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JMBuilder\u0022 data-cite=\u0022JMBuilder\u0022\u003E\u003Cdiv\u003ESo keep them inside the main GameData folder, but separate from each other, right?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat is correct. Did you have them in one folder? And were you able to determine if improper Interstellar installation was the issue or is Interstellar having an issue with hyper edit? I confirmed last night that Scott Manley is indeed using Infernal Robotics in his interstellar quest series. That points to me either improper installation of one of those three mods you are using or some kind of incompatibility between KSPI and Hyperedit. You could also check the last few pages of the hyperedit thread and see if anyone else is having your same issue.\u003C/p\u003E\u003Cp\u003ELet us know if this helps or if you are still having issues. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"db48x","CreatedById":66108,"CreatedDateTime":"2014-01-02T01:12:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dreadp1r4te\u0022 data-cite=\u0022Dreadp1r4te\u0022\u003E\u003Cdiv\u003EThat\u0027s exactly my point; if they offer little-to-no notable advantage (in any area) to a stock component of equal size and role, why unlock them in their un-upgraded state? Who would want to use them when the stock NERVAs (which you get in the same node, at least if you\u0027re not using the custom KSPI tech tree, not sure when you unlock them if you do use it) and stock ION engine is better in nearly every aspect? The only notable advantage the parts I have unlocked thus far is an obvious advantage in ISP, but at the cost of either so much extra weight or so little thrust that that advantage is completely wasted because you can\u0027t pump out enough delta-V to adjust your course in time. I\u0027m not complaining, merely offering some feedback that I think the parts should be at least somewhat useful in their unlocked-state, and then get improved upon even more in endgame, not be useless right up until endgame.\u003Cp\u003EThen again, I also think the science advancement in career mode is much too slow (hence why I\u0027m not using the custom KSPI tech tree, which adds all the KSPI parts after the end of the stock tree) and I rather dislike how part \u0022A\u0022 depends on the inclusion of part \u0022B\u0022 which is in a completely different node, meaning you effectively have to have 2-3x as much science to use a part that you\u0027ve unlocked. KSPI seems to compound this by making most of these parts lackluster until upgraded, and the science lab is quite a ways down the tree.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey\u0027re useful for more than just engines. The small fission reactor makes a great power source for a long-duration mission to the outer system, for instance; it\u0027ll last a decade easily. The reason the reactor, generator, thruster are on different tech nodes is to give you more choice. You can research reactor\u002Bthruster, or you can research reactor\u002Bgenerator.\u003C/p\u003E\n"},{"CreatedByName":"Eadrom","CreatedById":91728,"CreatedDateTime":"2014-01-02T01:12:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dreadp1r4te\u0022 data-cite=\u0022Dreadp1r4te\u0022\u003E\u003Cdiv\u003EThat\u0027s exactly my point; if they offer little-to-no notable advantage (in any area) to a stock component of equal size and role, why unlock them in their un-upgraded state? Who would want to use them when the stock NERVAs (which you get in the same node, at least if you\u0027re not using the custom KSPI tech tree, not sure when you unlock them if you do use it) and stock ION engine is better in nearly every aspect? The only notable advantage the parts I have unlocked thus far is an obvious advantage in ISP, but at the cost of either so much extra weight or so little thrust that that advantage is completely wasted because you can\u0027t pump out enough delta-V to adjust your course in time. I\u0027m not complaining, merely offering some feedback that I think the parts should be at least somewhat useful in their unlocked-state, and then get improved upon even more in endgame, not be useless right up until endgame.\u003Cp\u003EThen again, I also think the science advancement in career mode is much too slow (hence why I\u0027m not using the custom KSPI tech tree, which adds all the KSPI parts after the end of the stock tree) and I rather dislike how part \u0022A\u0022 depends on the inclusion of part \u0022B\u0022 which is in a completely different node, meaning you effectively have to have 2-3x as much science to use a part that you\u0027ve unlocked. KSPI seems to compound this by making most of these parts lackluster until upgraded, and the science lab is quite a ways down the tree.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve made effective use of early KSPI tech. 3.75m fission reactor with one of the big orange tanks from KW Rocketry hauled 16 science labs out to Moho for epic science. My ship was essentially thermal nozzle, 3.75m fission reactor running on uranium (didn\u0027t have thorium in KSPI at the time), a few radiators strapped to the bottom of a 3.75m fuel tank, 2.5m fission reactor and generator, battery, and a command pod with a docking port. Strapped to the side of the fuel tank were the 16 labs. I got this behemoth to Moho before I had unlocked the better reactors and the better radiators. \u003C/p\u003E\u003Cp\u003EI\u0027ve found that with the first tech level fission reactors, if you want to use them for space propulsion systems, you either need to build BIG or very, very small and light. You can\u0027t simply replace your LV-N cluster with a 2.5m fission reactor with thermal nozzle and expect to get similar results. Engineering a vessel using early fission tech requires a different approach. Very minimalistic. \u003C/p\u003E\u003Cp\u003EKeep in mind that the first tech level fission reactors are still extremely useful for power generation and for atmospheric designs. Little 62.5cm fission reactor is usually enough to power a super satellite with 5 or 6 large kethane scanners going full tilt at 100x time warp on both day and night sides of the orbit. You can also design planes that are more stable than fuel consuming designs because a plane powered by a thermal turbo-jet never shifts center of mass from consuming fuel (uses atmosphere heated in reactor as propellant).\u003C/p\u003E\u003Cp\u003EJust like any part, there are great and useful applications for the early KSPI tech. You might have to think outside of your usual methods to get there.\u003C/p\u003E\n"},{"CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2014-01-02T01:21:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dreadp1r4te\u0022 data-cite=\u0022Dreadp1r4te\u0022\u003E\u003Cdiv\u003EThat\u0027s exactly my point; if they offer little-to-no notable advantage (in any area) to a stock component of equal size and role, why unlock them in their un-upgraded state? Who would want to use them when the stock NERVAs (which you get in the same node, at least if you\u0027re not using the custom KSPI tech tree, not sure when you unlock them if you do use it) and stock ION engine is better in nearly every aspect? The only notable advantage the parts I have unlocked thus far is an obvious advantage in ISP, but at the cost of either so much extra weight or so little thrust that that advantage is completely wasted because you can\u0027t pump out enough delta-V to adjust your course in time. I\u0027m not complaining, merely offering some feedback that I think the parts should be at least somewhat useful in their unlocked-state, and then get improved upon even more in endgame, not be useless right up until endgame.\u003Cp\u003EThen again, I also think the science advancement in career mode is much too slow (hence why I\u0027m not using the custom KSPI tech tree, which adds all the KSPI parts after the end of the stock tree) and I rather dislike how part \u0022A\u0022 depends on the inclusion of part \u0022B\u0022 which is in a completely different node, meaning you effectively have to have 2-3x as much science to use a part that you\u0027ve unlocked. KSPI seems to compound this by making most of these parts lackluster until upgraded, and the science lab is quite a ways down the tree.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis has come up many times in the past so I can\u0027t keep going over it in detail but to summarise:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EThe bigger reactors provide disproportionately more thrust than the small ones so while a 1.25m rocket might not be very good, a 3.75m one is very very good. You have to build in a slightly different style to stock KSP but the results can be very good.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EDifferent combinations of parts are useful for different things, a 1.25m fisison reactor might not be very useful with a thermal rocket but it makes a perfectly good long endurance aircraft.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EI\u0027m not going to legislate for people\u0027s patience by making parts unavailable until later because they have low thrust, some people do use very low thrust rockets because they have better Isp, I\u0027m not going to take away options from those people.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe reactors aren\u0027t just for propulsion so if you don\u0027t want to use the rockets as propulsion system at this stage, don\u0027t. You have plenty of other options and the reactors still have plenty of uses as power systems.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EFinally, not using the KSPI tech tree to get upgrades faster is not going to work. The vast majority of the parts upgrade on KSPI tech nodes so if you don\u0027t use the tech tree, you\u0027ll simply never get them. As an example, fission reactors upgrade on the fusion tech node so if you don\u0027t have that node because you don\u0027t have the KSPI tech tree, that condition will never be met and you will never get that upgrade.\u003C/p\u003E\n"},{"CreatedByName":"Donziboy2","CreatedById":74984,"CreatedDateTime":"2014-01-02T01:22:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dreadp1r4te\u0022 data-cite=\u0022Dreadp1r4te\u0022\u003E\u003Cdiv\u003EThat\u0027s exactly my point; if they offer little-to-no notable advantage (in any area) to a stock component of equal size and role, why unlock them in their un-upgraded state? Who would want to use them when the stock NERVAs (which you get in the same node, at least if you\u0027re not using the custom KSPI tech tree, not sure when you unlock them if you do use it) and stock ION engine is better in nearly every aspect? The only notable advantage the parts I have unlocked thus far is an obvious advantage in ISP, but at the cost of either so much extra weight or so little thrust that that advantage is completely wasted because you can\u0027t pump out enough delta-V to adjust your course in time. I\u0027m not complaining, merely offering some feedback that I think the parts should be at least somewhat useful in their unlocked-state, and then get improved upon even more in endgame, not be useless right up until endgame.\u003Cp\u003EThen again, I also think the science advancement in career mode is much too slow (hence why I\u0027m not using the custom KSPI tech tree, which adds all the KSPI parts after the end of the stock tree) and I rather dislike how part \u0022A\u0022 depends on the inclusion of part \u0022B\u0022 which is in a completely different node, meaning you effectively have to have 2-3x as much science to use a part that you\u0027ve unlocked. KSPI seems to compound this by making most of these parts lackluster until upgraded, and the science lab is quite a ways down the tree.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/43839-0-23-KSP-Interstellar-%28Tweakables-New-ISRU-Preecoolers%29-Version-0-9-2-%28Beta%29?p=873760\u0026amp;viewfull=1#post873760\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/43839-0-23-KSP-Interstellar-%28Tweakables-New-ISRU-Preecoolers%29-Version-0-9-2-%28Beta%29?p=873760\u0026amp;viewfull=1#post873760\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Dreadp1r4te","CreatedById":98426,"CreatedDateTime":"2014-01-02T01:23:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Eadrom\u0022 data-cite=\u0022Eadrom\u0022\u003E\u003Cdiv\u003EI\u0027ve made effective use of early KSPI tech. 3.75m fission reactor with one of the big orange tanks from KW Rocketry hauled 16 science labs out to Moho for epic science. My ship was essentially thermal nozzle, 3.75m fission reactor running on uranium (didn\u0027t have thorium in KSPI at the time), a few radiators strapped to the bottom of a 3.75m fuel tank, 2.5m fission reactor and generator, battery, and a command pod with a docking port. Strapped to the side of the fuel tank were the 16 labs. I got this behemoth to Moho before I had unlocked the better reactors and the better radiators. \u003Cp\u003EI\u0027ve found that with the first tech level fission reactors, if you want to use them for space propulsion systems, you either need to build BIG or very, very small and light. You can\u0027t simply replace your LV-N cluster with a 2.5m fission reactor with thermal nozzle and expect to get similar results. Engineering a vessel using early fission tech requires a different approach. Very minimalistic. \u003C/p\u003E\u003Cp\u003EKeep in mind that the first tech level fission reactors are still extremely useful for power generation and for atmospheric designs. Little 62.5cm fission reactor is usually enough to power a super satellite with 5 or 6 large kethane scanners going full tilt at 100x time warp on both day and night sides of the orbit. You can also design planes that are more stable than fuel consuming designs because a plane powered by a thermal turbo-jet never shifts center of mass from consuming fuel (uses atmosphere heated in reactor as propellant).\u003C/p\u003E\u003Cp\u003EJust like any part, there are great and useful applications for the early KSPI tech. You might have to think outside of your usual methods to get there.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot sure why it didn\u0027t occur to me to use an oversized nuke to power a ship, but for some reason that concept went right over my head. Gonna try that now on my first kerbal\u0027d Duna mission. I\u0027m gonna do an Apollo-style landing \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs for the power generation, oh yeah. Totally on that. Planning on attaching a nuke to my LKO station tonight. And some lights. XD\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fractal_UK\u0022 data-cite=\u0022Fractal_UK\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E(snip)\u003C/p\u003E\u003Cp\u003EFinally, not using the KSPI tech tree to get upgrades faster is not going to work. The vast majority of the parts upgrade on KSPI tech nodes so if you don\u0027t use the tech tree, you\u0027ll simply never get them. As an example, fission reactors upgrade on the fusion tech node so if you don\u0027t have that node because you don\u0027t have the KSPI tech tree, that condition will never be met and you will never get that upgrade.\u003C/p\u003E\u003Cp\u003E(snip)\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E...this would have been exceptionally nice to know BEFORE I got halfway through the R\u0026amp;D tree. Is there any way to alter my tree, or am I now boxed into starting a new tree because there was no mention that the altered tech tree is REQUIRED?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-02T01:28:16Z\u0022 title=\u002201/02/2014 01:28  AM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 2, 2014\u003C/time\u003E by Dreadp1r4te\u003C/strong\u003E\n\u003C/span\u003E\n"}]}