{"TopicId":40365,"ForumId":34,"TopicTitle":"[0.25]KSP Interstellar (Magnetic Nozzles, ISRU Revamp) Version 0.13","CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2013-08-01T00:05:15Z","PageNum":373,"Articles":[{"CreatedByName":"Kerbonautical","CreatedById":75532,"CreatedDateTime":"2014-05-13T20:14:45Z","Content":"\n\u003Cp\u003EOk, 7 power stations now and I still only get 200,000 MW at the best aspect angle. With or without a reactor I still can\u0027t get a proper supply of power beamed to me. Am I really supposed to need to keep just adding more and more until I finally have the power to get a plane to take off? I have reactors in space and right next to me at launch but I just can\u0027t get hardly any of their power. Each one is chucking out 60GW and for each three I add I get about 80,000MW beamed to me. This can\u0027t be right surely?\u003C/p\u003E\n"},{"CreatedByName":"Einarr","CreatedById":4809,"CreatedDateTime":"2014-05-13T20:15:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022philotical\u0022 data-cite=\u0022philotical\u0022\u003E\u003Cdiv\u003E[Form posted on reload an outdated post again.. - so I fill the space with something else useless]\u003Cp\u003EEdit:\u003C/p\u003E\u003Cp\u003E\u0022Honestly though, he is right but still tell him to take a pill..\u0022\u003C/p\u003E\u003Cp\u003EWhat ever you say - the second time today..\u003C/p\u003E\u003Cp\u003EOh btw: Have a look at the non existing star wars thruster effects:\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/6v5VahaEL7s?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003E(Hint, it\u0027s the red hot looking thingys on the back of the Rebel Fighters)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEngineGlow != EngineTrail\u003C/p\u003E\u003Cp\u003EBesides Engine Glow from the impulse engines is fairly common on Federation ships outside TOS.\u003C/p\u003E\u003Cp\u003ETOS was based far more on actual and theoretical science (for its time) than later Trek. Realistically, the Impulse Engines might produce a visible trail, but with TOS, they would have had to spend money from their tiny budget to create the special effect. It was not cheap back then, and they decided it wasn\u0027t important enough. Later Trek has not introduced an engine trail likely to avoid continuity issues. as to engine glow not being present in TOS, again, look at it from a production standpoint, that glow would be a special effect and have to be paid for from a very limited budget.\u003C/p\u003E\u003Cp\u003ELucas raised far more money for Star Wars than Roddenberry was able to for Trek, and even created Industrial Light and Magic specifically for Star Wars. This is the main reason that Star Wars had better special effects for its time than other science fiction productions, such as Trek.\u003C/p\u003E\u003Cp\u003ENow, seriously, can we move on, take it to PMs or whatever?\u003C/p\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2014-05-13T20:16:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Hughesdylan\u0022 data-cite=\u0022Hughesdylan\u0022\u003E\u003Cdiv\u003EWhoh whoh whoh! Sorry man, i should have been more specific. I meant make them dangerous as a \u003Cem\u003Egame play consideration\u003C/em\u003E. I didn\u0027t intend to imply that the actual power plants are somehow inherently less good than other systems. I was mainly thinking about using them in my off planet Kolony using the MKS mod. Building it off planet would reduce the ...silliness of launching one. It would also make a really neat \u0022refueling and processing\u0022 base kind of concept.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOkay, fair enough.\u003C/p\u003E\u003Cp\u003EI\u0027m still proud of my hamster line though.\u003C/p\u003E\n"},{"CreatedByName":"Einarr","CreatedById":4809,"CreatedDateTime":"2014-05-13T20:29:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kerbonautical\u0022 data-cite=\u0022Kerbonautical\u0022\u003E\u003Cdiv\u003EOk, 7 power stations now and I still only get 200,000 MW at the best aspect angle. With or without a reactor I still can\u0027t get a proper supply of power beamed to me. Am I really supposed to need to keep just adding more and more until I finally have the power to get a plane to take off? I have reactors in space and right next to me at launch but I just can\u0027t get hardly any of their power. Each one is chucking out 60GW and for each three I add I get about 80,000MW beamed to me. This can\u0027t be right surely?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAre you using both a MW Thermal Receiver and a regular MW Receiver/Transceiver on your craft? I expect the regular receiver might leech incoming power away...and generate a lot of heat whether you\u0027re using the power or not...\u003C/p\u003E\u003Cp\u003EIn any case, spaceplanes in KSP don\u0027t usually work well as heavy lifters. They require extra parts (wings are unused mass in space) and then all the struts needed to keep the things together... For heavy lift capability, I\u0027d suggest a more traditional rocket, perhaps with a Fusion/Antimatter Thermal Rocket SSTO twist. Many of my heavy payloads now are SSTOs and need no boosters or other stages.\u003C/p\u003E\n"},{"CreatedByName":"Deredere","CreatedById":96253,"CreatedDateTime":"2014-05-13T20:34:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Einarr\u0022 data-cite=\u0022Einarr\u0022\u003E\u003Cdiv\u003ENow, seriously, can we move on, take it to PMs or whatever?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESince endless \u0022why is muh stuff not working\u0022 posts are far more entertaining, right? Of course they are. You\u0027re right. Speaking of which...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kerbonautical\u0022 data-cite=\u0022Kerbonautical\u0022\u003E\u003Cdiv\u003EOk, 7 power stations now and I still only get 200,000 MW at the best aspect angle. With or without a reactor I still can\u0027t get a proper supply of power beamed to me. Am I really supposed to need to keep just adding more and more until I finally have the power to get a plane to take off? I have reactors in space and right next to me at launch but I just can\u0027t get hardly any of their power. Each one is chucking out 60GW and for each three I add I get about 80,000MW beamed to me. This can\u0027t be right surely?\u003C/div\u003E\u003C/blockquote\u003EIt sounds pretty accurate. The highest amount of power you\u0027ll get out of a 3.75m fusion reactor, which is what it sounds like you\u0027re using, is around 60% of its total energy output, if I recall correctly. You\u0027re losing 20% to charged particle generation (unless you have two generators attached, one of each type, which is generally impractical) and then losing another 50% or so of your thermal power to generator inefficiency, leading to a total output from each fusion microwave sat of about 30 gigawatts.\u003Cp\u003EAnd even one should be more than enough to blow any kind of spaceplane right out of the atmosphere and on its way out the solar system. Try using Xenon fuel if you\u0027re using plasma engines. Liquid fuel isn\u0027t going to cut it for a large craft unless you have the maximum size plasma engine and enough power in the network (which it sounds like you do).\u003C/p\u003E\u003Cp\u003EIf you\u0027re using thermal rockets I can\u0027t help you, you should be getting accelerations in the km/s range. I use thermal rockets as ghetto-rigged mass drivers.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-13T20:39:09Z\u0022 title=\u002205/13/2014 08:39  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 13, 2014\u003C/time\u003E by Deredere\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kerbonautical","CreatedById":75532,"CreatedDateTime":"2014-05-13T20:37:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Einarr\u0022 data-cite=\u0022Einarr\u0022\u003E\u003Cdiv\u003EAre you using both a MW Thermal Receiver and a regular MW Receiver/Transceiver on your craft? I expect the regular receiver might leech incoming power away...and generate a lot of heat whether you\u0027re using the power or not...\u003Cp\u003EIn any case, spaceplanes in KSP don\u0027t usually work well as heavy lifters. They require extra parts (wings are unused mass in space) and then all the struts needed to keep the things together... For heavy lift capability, I\u0027d suggest a more traditional rocket, perhaps with a Fusion/Antimatter Thermal Rocket SSTO twist. Many of my heavy payloads now are SSTOs and need no boosters or other stages.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJust a thermal receiver but I did try adding other types to see if I could increase my performance but even with a deployable array I couldn\u0027t increase the signal. I shall probably switch to heavy lifters since the planes aren\u0027t going well but it just seems I\u0027m not getting a proportional amount of power compared to what I should be. There\u0027s something like 420GW of power floating around Kerbin now and I can\u0027t even pick up a single GW at the pad, even with a reactor right next to it. I had toyed with a few other propulsion types on different installs and ran into the same issue, not enough power to launch. Except for one fluke install that I foolishly deleted where I could get plenty of GW at the pad. I do have an RSS plugin installed that adds a blue horizon to kerbin, I dunno if that could be somehow messing with the atmosphere so I may need to try removing that I think\u003C/p\u003E\n"},{"CreatedByName":"philotical","CreatedById":109390,"CreatedDateTime":"2014-05-13T20:38:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Deredere\u0022 data-cite=\u0022Deredere\u0022\u003E\u003Cdiv\u003EImpulse engines in Star Trek, including the ones on shuttles, are fusion-powered electro-rockets.\u003Cp\u003Ei.e the exact same thing as a plasma engine.\u003C/p\u003E\u003Cp\u003EYou could assume the exhaust doesn\u0027t emit in the visible spectrum if it bothers you.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI got this point allready when Hughesdylan and Einarr explained it to me in such a friendly way\u003C/p\u003E\u003Cp\u003EAnd even if it\u0027s irrelevant, I knew that before..\u003C/p\u003E\u003Cp\u003ESo since I have to reclaim my reputation just for one stupid post about star trek - let me explain my point.\u003C/p\u003E\u003Cp\u003EMaybe the angry kids will bulli someone else than..\u003C/p\u003E\u003Cp\u003EIn Space (that is where the Plasma works as you know) I have allready warp to simulate ST.\u003C/p\u003E\u003Cp\u003EBut to start/land from/to the ground, there could be a much more ST-like feeling as we have now.\u003C/p\u003E\u003Cp\u003EThat is not a feature request - it\u0027s just a fact.\u003C/p\u003E\u003Cp\u003E\u0022He said KSPI does not have all star trek features - let\u0027s attack him\u0022 \u003C/p\u003E\u003Cp\u003EI did not see the memo, that fractal claims KSPI is 100% star trek.\u003C/p\u003E\u003Cp\u003EI also did not read the memo where it says, I\u0027m not allowed to say that it is not.\u003C/p\u003E\u003Cp\u003EI mean we can aswell say \u0022Saturn 5 is like a Star Trek Shuttle, it too brought you into orbit\u0022\u003C/p\u003E\u003Cp\u003EI miss the ability to hover and than accellerate to orbit like a ST-Shuttle - does not/can not work with our plasmaengines..\u003C/p\u003E\u003Cp\u003Eagreed?\u003C/p\u003E\u003Cp\u003EI merly said I would be fond of a Impuls drive that can be used like the ST ones..\u003C/p\u003E\u003Cp\u003E(Than I was expelled from some goofy kids club where self-important people decide who may be a fan of what.)\u003C/p\u003E\u003Cp\u003EA ST shuttle can point it\u0027s thrust in all directions (several at once actually) and it can fully automatically cancel out gravity, it can also come to a halt in mid air without turning around to thrust backwards,\u003C/p\u003E\u003Cp\u003EAll that does not work with a static engine, with one thrust vector, mounted on the back of the craft. So Plasma is (no matter of it\u0027s functionality) out of the race!\u003C/p\u003E\u003Cp\u003EFor those who didn\u0027t get it that is science fiction - a fantasy, something we all dream about - KSPI is as close to \u0022our\u0022 science reality as possible and we all appreciate it for that.\u003C/p\u003E\u003Cp\u003EThat\u0027s why the KSPI plasma thruster can not do that - expecially not in the atmosphere.\u003C/p\u003E\u003Cp\u003ENo one said KSPI must allready have all from ST - so why does everyone claim it does?\u003C/p\u003E\u003Cp\u003ETo compare the non-atmosperic plasma function with a shuttle-impuls is just wishfull thinking.\u003C/p\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2014-05-13T21:05:05Z","Content":"\n\u003Cp\u003EWould you quit derailing this thread already? This is all pointless quibbling over things that don\u0027t even remotely matter.\u003C/p\u003E\u003Cp\u003EYou want a reason why an \u0022impulse\u0022 drive is a bad idea? Fine. It\u0027s functionally identical to the already implemented Alcubierre drive, combined with every other engine in the game. You want high thrust and the ability to steer? Okay. Put lots of plasma thrusters on and use xenon as a propellant. Done.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-13T21:07:18Z\u0022 title=\u002205/13/2014 09:07  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 13, 2014\u003C/time\u003E by phoenix_ca\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Deredere","CreatedById":96253,"CreatedDateTime":"2014-05-13T21:28:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI miss the ability to hover and than accellerate to orbit like a ST-Shuttle - does not/can not work with our plasmaengines..\u003Cp\u003Eagreed?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI do wish that ability was available; the inability to takeoff and land horizontally oriented VTOL craft in high gravitational fields without a considerable amount of caution and precision engineering is frustrating. With the amount of power available in KSPI via microwave networks and/or antimatter drives, a multi-axis high-energy thruster system to simulate an inertialess drive should be possible.\u003C/p\u003E\u003Cp\u003EBut I imagine that kind of adaptive propulsion system to hold potentially asymmetric craft motionless in an atmosphere would be quite the programming task, it\u0027s not as simple as just making a new engine.\u003C/p\u003E\n"},{"CreatedByName":"Sokar408","CreatedById":75557,"CreatedDateTime":"2014-05-13T22:21:03Z","Content":"\n\u003Cp\u003EFractal do you have any plans to make the mining processes of the ISRU happen without being the active vessel?\u003C/p\u003E\n"},{"CreatedByName":"Atrius129","CreatedById":107132,"CreatedDateTime":"2014-05-13T22:31:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kerbonautical\u0022 data-cite=\u0022Kerbonautical\u0022\u003E\u003Cdiv\u003EJust a thermal receiver but I did try adding other types to see if I could increase my performance but even with a deployable array I couldn\u0027t increase the signal. I shall probably switch to heavy lifters since the planes aren\u0027t going well but it just seems I\u0027m not getting a proportional amount of power compared to what I should be. There\u0027s something like 420GW of power floating around Kerbin now and I can\u0027t even pick up a single GW at the pad, even with a reactor right next to it. I had toyed with a few other propulsion types on different installs and ran into the same issue, not enough power to launch. Except for one fluke install that I foolishly deleted where I could get plenty of GW at the pad. I do have an RSS plugin installed that adds a blue horizon to kerbin, I dunno if that could be somehow messing with the atmosphere so I may need to try removing that I think\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECan you post pics of one of your transmitting craft and one of your spaceplane? I don\u0027t know if you have multiple receivers active on that ship or within the 2.3km , but that will mess things up.\u003C/p\u003E\n"},{"CreatedByName":"Atrius129","CreatedById":107132,"CreatedDateTime":"2014-05-13T22:48:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Deredere\u0022 data-cite=\u0022Deredere\u0022\u003E\u003Cdiv\u003EI do wish that ability was available; the inability to takeoff and land horizontally oriented VTOL craft in high gravitational fields without a considerable amount of caution and precision engineering is frustrating. With the amount of power available in KSPI via microwave networks and/or antimatter drives, a multi-axis high-energy thruster system to simulate an inertialess drive should be possible.\u003Cp\u003EBut I imagine that kind of adaptive propulsion system to hold potentially asymmetric craft motionless in an atmosphere would be quite the programming task, it\u0027s not as simple as just making a new engine.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESounds like a great idea for a new mod. VTOL thrusters that can maintain stability perfectly and allow you to translate up at a ridiculous velocity. It would be cool if it were incorporated into KSPi, to use it\u0027s power systems. \u003C/p\u003E\u003Cp\u003EReally though, this isn\u0027t the Star Trek/Wars/Craft/Ship Troopers mod so we should probably leave those on other pages (\u0022Fractal, why can\u0027t I mine Di-lithium crystals with my AT-AT and react them with my Vespene gas?\u0022) . Um... that would be an amazing idea for another mod though.\u003C/p\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2014-05-13T22:57:48Z","Content":"\n\u003Cp\u003EThere is already a mod that makes VTOLs more stable:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/67270-Throttle-Controlled-Avionics-1-3-0-23-5-%28April-6%29\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/67270-Throttle-Controlled-Avionics-1-3-0-23-5-%28April-6%29\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"philotical","CreatedById":109390,"CreatedDateTime":"2014-05-13T23:13:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Deredere\u0022 data-cite=\u0022Deredere\u0022\u003E\u003Cdiv\u003EI do wish that ability was available; the inability to takeoff and land horizontally oriented VTOL craft in high gravitational fields without a considerable amount of caution and precision engineering is frustrating. With the amount of power available in KSPI via microwave networks and/or antimatter drives, a multi-axis high-energy thruster system to simulate an inertialess drive should be possible.\u003Cp\u003EBut I imagine that kind of adaptive propulsion system to hold potentially asymmetric craft motionless in an atmosphere would be quite the programming task, it\u0027s not as simple as just making a new engine.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou got the point :-) \u003C/p\u003E\u003Cp\u003EI am working on the app layout for something like this - but currently just mapping out in my mind - because some other mod want\u0027s to be finished first..\u003C/p\u003E\u003Cp\u003EThe Game offers actually all we need - I\u0027ve checked allready - the rest is math..\u003C/p\u003E\n"},{"CreatedByName":"Threadsinger","CreatedById":100886,"CreatedDateTime":"2014-05-13T23:37:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Atrius129\u0022 data-cite=\u0022Atrius129\u0022\u003E\u003Cdiv\u003ESounds like a great idea for a new mod. VTOL thrusters that can maintain stability perfectly and allow you to translate up at a ridiculous velocity. It would be cool if it were incorporated into KSPi, to use it\u0027s power systems. \u003Cp\u003EReally though, this isn\u0027t the Star Trek/Wars/Craft/Ship Troopers mod so we should probably leave those on other pages (\u0022Fractal, why can\u0027t I mine Di-lithium crystals with my AT-AT and react them with my Vespene gas?\u0022) . Um... that would be an amazing idea for another mod though.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EActually, I was kind of hoping for some VTOL-inspired fusion engines. I\u0027ve played through, say, 80% of KSPi in Career mode and have LOVED it so far. It\u0027s better than the stock game, although I respect the design intent of KSP vanilla. \u003C/p\u003E\u003Cp\u003EHowever, right now I\u0027m trying to get SSTO\u0027s into orbit using the smaller diameter, upgraded laser fusion reactors (the 0.625 and the 1.25 OMEGA reactors), and to my great frustration, they are weaker in thrust than the little LV-909... I understand that some serious math has gone into balancing the science-fictional components in the game, (which is great!), and that some challenge is required otherwise KSP loses a lot of appeal. Everything else to this point felt very satisfying in balance and achievement when unlocked and later left behind for more advanced part. \u003C/p\u003E\u003Cp\u003EBut after all this advancement in the tech tree, I admit I\u0027m disappointed that all this advanced hardware and the fury of a baby star can\u0027t out compete a primitive thruster for lift (it comes close, but...) I\u0027m not looking to break the game challenge, but I was kinda hoping that this far down the tech tree I could manufacture some Halo-style dropships (or, more categorically, SSTO-capable light to medium craft), without having to resort to twenty of those to boost a fairly small craft or capsule into space, or perform VTOL maneuvers without again needing a hilarious amount of them. Or using a couple of hideously oversized 2.5 meter reactors/turbojets. (Although, on that note, some 0.625 and 3.5 meter turbojets would be fantastic and I hope to see them in a future build, but that\u0027s just to I can better use those 3.5 m monster reactors!)\u003C/p\u003E\u003Cp\u003EJust a loyal fans\u0027 comment here: any possibility of a thrust increase on the peak-end fusion thrusters to allow them to act as better VTOL/SSTO drives? Wouldn\u0027t have to be much, but even a small increase could realize some fun, futuristic sci-fi staple-capable craft once you get absurdly high into the tech tree. Also helps for those of us who are working on under the \u0027clean\u0027 space program ethos.\u003C/p\u003E\u003Cp\u003EI did manage to build this, however:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/fqyVsmn.jpg\u0022 alt=\u0022fqyVsmn.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EFun to fly, and comes with a built in funeral-pyre!\u003C/p\u003E\u003Cp\u003ERegardless, thanks again Fractal (and co.!) Looking forward to whatever else comes down the pipe!\u003C/p\u003E\u003Cp\u003E/also, just lost ALL my missions, satellites, starbases, beacons, flags, memorials today... time to declare war on the Space Kraken... feel free to develop nukes\u003C/p\u003E\n"},{"CreatedByName":"Kerbonautical","CreatedById":75532,"CreatedDateTime":"2014-05-14T00:01:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Atrius129\u0022 data-cite=\u0022Atrius129\u0022\u003E\u003Cdiv\u003ECan you post pics of one of your transmitting craft and one of your spaceplane? I don\u0027t know if you have multiple receivers active on that ship or within the 2.3km , but that will mess things up.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESure. here\u0027s the station. Sorry for the shot being slightly from the dark side of my ship but I wanted to get in both the display for my thermal power and antenna\u0027s transmission capability.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/qd4GITl.jpg\u0022 alt=\u0022qd4GITl.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd here\u0027s the plane on the runway. I\u0027ve tried various builds including larger planes with larger thermal receivers and every single transmitter receiver in KSPI. Also the thing in the background is another fusion reactor set to transmit. There shouldn\u0027t be anything else at all in my universe that is set to receive.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/yXfgcwj.jpg\u0022 alt=\u0022yXfgcwj.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI really hope it\u0027s just some stupid mistake I\u0027m making because I\u0027ve been trying to get around this for what feels like an eternity now\u003C/p\u003E\n"},{"CreatedByName":"Atrius129","CreatedById":107132,"CreatedDateTime":"2014-05-14T00:06:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kerbonautical\u0022 data-cite=\u0022Kerbonautical\u0022\u003E\u003Cdiv\u003ESure. here\u0027s the station. Sorry for the shot being slightly from the dark side of my ship but I wanted to get in both the display for my thermal power and antenna\u0027s transmission capability.\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/qd4GITl.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/qd4GITl.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnd here\u0027s the plane on the runway. I\u0027ve tried various builds including larger planes with larger thermal receivers and every single transmitter receiver in KSPI. Also the thing in the background is another fusion reactor set to transmit. There shouldn\u0027t be anything else at all in my universe that is set to receive.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/yXfgcwj.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/yXfgcwj.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI really hope it\u0027s just some stupid mistake I\u0027m making because I\u0027ve been trying to get around this for what feels like an eternity now\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIndeed! You are receiving about 83.2 GW of power. The thermal receivers don\u0027t display on the MJ manager. I would pop some more air intakes on that bad boy.\u003C/p\u003E\n"},{"CreatedByName":"Kerbonautical","CreatedById":75532,"CreatedDateTime":"2014-05-14T00:10:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Atrius129\u0022 data-cite=\u0022Atrius129\u0022\u003E\u003Cdiv\u003EIndeed! You are receiving about 83.2 GW of power. The thermal receivers don\u0027t display on the MJ manager. I would pop some more air intakes on that bad boy.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI am?! *facepalm* I never checked the math of how many MW to a GW so didn\u0027t realize that\u0027s how much power I was netting, I kind of figured the display would switch to GW accordingly, and that the air intake was holding that power back! Thanks man, time to see what this thing can really do!\u003C/p\u003E\n"},{"CreatedByName":"Deredere","CreatedById":96253,"CreatedDateTime":"2014-05-14T00:20:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kerbonautical\u0022 data-cite=\u0022Kerbonautical\u0022\u003E\u003Cdiv\u003EI am?! *facepalm* I never checked the math of how many MW to a GW\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/pnXOed1.jpg\u0022 alt=\u0022pnXOed1.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2014-05-14T00:48:04Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@Threadsinger:\u003C/strong\u003E I suggest reading the wiki page to get a good grasp of how thrust is calculated for thermal rockets in KSPI. \u003Ca href=\u0022https://github.com/FractalUK/KSPInterstellar/wiki/Thermal-Rocket-Nozzle-and-Thermal-Turbojet\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/FractalUK/KSPInterstellar/wiki/Thermal-Rocket-Nozzle-and-Thermal-Turbojet\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EOnce you\u0027ve done that you should be able to tweak the values in part files with relative ease to increase thrust provided by the reactors. Although you\u0027ll also necessarily be increasing power output too when using generators, because thermal power output is what determines thrust.\u003C/p\u003E\u003Cp\u003EHonestly a better option might be to go with B9\u0027s SABRE engines or the stock RAPIERs. They\u0027re great for SSTO flight.\u003C/p\u003E\u003Cp\u003EThat said it\u0027s not all bad news. Once you hit antimatter reactors, the TWR for the 1.25m reactors (Basic) is a whopping 23.62. Upgraded some weirdness happens: TWR drops to 15.49 (which is still pretty amazing), but ISP rockets up to 8379s, compared to the 1831s of the unupgraded versions.\u003C/p\u003E\u003Cp\u003EYour other, perhaps better option, would be to use the thermal rocket nozzles, not the turbojets, and use a propellant to get significantly more thrust. If you used LFO for your VTOL, you could get a thrust from your fusion rocket nozzles of 2.7 (quite respectable, and enough to be useful), with an ISP of a whopping 3226s.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@Kerbonautical:\u003C/strong\u003E MW to GW? That\u0027s easy. It\u0027s a 1GW = 1,000MW. Mega, Giga. \u003Ca href=\u0022https://en.wikipedia.org/wiki/International_System_of_Units#Prefixes\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/International_System_of_Units#Prefixes\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-14T01:03:59Z\u0022 title=\u002205/14/2014 01:03  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 14, 2014\u003C/time\u003E by phoenix_ca\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Woopert","CreatedById":84274,"CreatedDateTime":"2014-05-14T02:43:00Z","Content":"\n\u003Cp\u003EIf I just want to keep the magnetometer and the other spectrometers, my tech tree, and the other science progress, will this work without WarpPlugin.dll? And if I remove that, can I use Near Future Propulsion without any compatibility issues?\u003C/p\u003E\u003Cp\u003EWhat about all of the image files, could those be deleted if I just want the magnetometer and the other spectrometers? Will deleting the CFG files along with the WarpPlugin dll also set the settings back to stock? PlanetResource data folder can be deleted? In the Parts\\Resources\\ResourcesNuclear, can that be deleted?\u003C/p\u003E\u003Cp\u003EPhew, that was a lot of questions, sorry. Thanks in advance!\u003C/p\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2014-05-14T03:00:31Z","Content":"\n\u003Cp\u003EProbably not. The spectrometers definitely would stop working if you start eviscerating your KSPI install. The magnetometer has this:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003EMODULE\u003Cbr\u003E{\u003Cbr\u003E\tname = DTMagnetometer\u003Cbr\u003E\tanimName = deploy\u003Cbr\u003E}\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E...which if I\u0027m not mistaken is added by WarpPlugin.dll .\u003C/p\u003E\u003Cp\u003EIf you start pulling out files from KSPI, particularly the plugin itself, there\u0027s no guarantee you won\u0027t end-up breaking your persistence file, or just leave a bunch of junk data all over it.\u003C/p\u003E\n"},{"CreatedByName":"Hremsfeld","CreatedById":23422,"CreatedDateTime":"2014-05-14T04:18:45Z","Content":"\n\u003Cp\u003EI found a bug with the antimatter tanks: It\u0027s possible to get them to store small amounts of antimatter for free.\u003C/p\u003E\u003Cp\u003ETo reproduce: Lob up two 3.5m antimatter tanks connected in sequence to a collector (I haven\u0027t tried smaller sizes) and supply enough current to satisfy their maximum charging demands. Tell the tank farther back to stop charging, and then disable flow into the first tank. The second tank will hold up to 2.50 milligrams of antimatter without its power draw being reflected in the power manager. Above 2.60mg, however, it draws its full 400.00KW. On this note, an empty 3.5m antimatter tank will demand 200.00KW, even with 1000.00/1000.00 charge, unless you select \u0022Stop Charging.\u0022 Easy enough fix on the user\u0027s part, but still noteworthy.\u003C/p\u003E\n"},{"CreatedByName":"Einarr","CreatedById":4809,"CreatedDateTime":"2014-05-14T07:59:49Z","Content":"\n\u003Cp\u003EThe small antimatter bottles will also do this, even when completely full. I never used these tanks until I built an Antimatter Initiated Reactor test ship, then I noted I could stop charging both tanks and timewarp to my heart\u0027s content without the charge dropping from 1k. I looked into it when I realized that the ship doesn\u0027t actually have a means of producing MegaJoules. The reactor is for a Thermal Rocket Nozzle, and main power is from some NFP solar panels, 4 of \u0027em producing a whopping 9 EC/sec each. The craft is capable of SSTO performance on pure Liquid from the pad at KSC. There is no generator on the reactor, for weight and space savings.\u003C/p\u003E\n"},{"CreatedByName":"artforz","CreatedById":108793,"CreatedDateTime":"2014-05-14T12:35:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Einarr\u0022 data-cite=\u0022Einarr\u0022\u003E\u003Cdiv\u003EThe small antimatter bottles will also do this, even when completely full. I never used these tanks until I built an Antimatter Initiated Reactor test ship, then I noted I could stop charging both tanks and timewarp to my heart\u0027s content without the charge dropping from 1k. I looked into it when I realized that the ship doesn\u0027t actually have a means of producing MegaJoules.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs small AM bottles only require 0.5EC/s to maintain their charge, I suspect the solar panels were enough for that draw to not really show.\u003C/p\u003E\u003Cp\u003EUnless I\u0027m reading the code wrong, AM containers can hold 0.001% of their max capacity for free.\u003C/p\u003E\u003Cp\u003EIf they contain more than that, they will always consume MJ or if that isn\u0027t available EC to maintain 1000 charge, regardless of the \u0022Charging/Discharging/No Power Required\u0022 display.\u003C/p\u003E\u003Cp\u003EAnd yeah, there\u0027s a bit of a bug there:\u003C/p\u003E\u003Cp\u003EThe checks for \u0022should consume charge\u0022 and \u0022should consume MJ/EC to replenish charge\u0022 in OnFixedUpdate use (current_antimatter \u0026gt; 0.00001 * antimatter.maxAmount)\u003C/p\u003E\u003Cp\u003E The checks for buttons and display state in OnUpdate use (current_antimatter \u0026gt; 0.01) ...\u003C/p\u003E\u003Cp\u003Eedit: ... and another bug. A small AM bottle can\u0027t ever explode, as DoExplode() does nothing if current_antimatter is \u0026lt;= 0.1 ...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-14T14:08:17Z\u0022 title=\u002205/14/2014 02:08  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 14, 2014\u003C/time\u003E by artforz\u003C/strong\u003E\n\u003C/span\u003E\n"}]}