{"TopicId":40365,"ForumId":34,"TopicTitle":"[0.25]KSP Interstellar (Magnetic Nozzles, ISRU Revamp) Version 0.13","CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2013-08-01T00:05:15Z","PageNum":150,"Articles":[{"CreatedByName":"Myrten","CreatedById":92200,"CreatedDateTime":"2013-11-28T02:12:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fractal_UK\u0022 data-cite=\u0022Fractal_UK\u0022\u003E\u003Cdiv\u003EThe refinery attachment nodes are proving to be a nightmare, sorry about that. The stock game seems to only allow attachment nodes to work in pairs, so this is very much an issue I\u0027m grappling with and trying to find a solution to.\u003Cp\u003EDid you add Tritium tanks or Thorium tanks? You need Thorium tanks to mine ThF4. There isn\u0027t a very high abundance on the launchpad either so it won\u0027t fill up at all quickly, there is a good mining location not far west of KSC though, you should be able to find that with the Gamma Ray Spectrometer.\u003C/p\u003E\u003Cp\u003EIt was thorium with big TF4 label on tank and without these tanks refinery didn\u0027t displayed any production, sure there isn\u0027t much on launchpad but I warped for a few days and there wasn\u0027t even 0.01 increase in resources.\u003C/p\u003E\u003Cp\u003EDoes refinery have to touch the ground to mine resources?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fractal_UK\u0022 data-cite=\u0022Fractal_UK\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EHad you been using the reactor for a while? Basically, you can only swap fuels when the reactor is more or less empty of Actinides so if you\u0027ve been running the reactor with Uranium for a while, you need to do some reprocessing before you can change fuel type. I know this isn\u0027t clear at the moment and I\u0027ll try to make this system more transparent.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENope, it was on launchpad immediately after pressing launch in VAB and there was zero Actinides.\u003C/p\u003E\u003Cp\u003EAlso, does Microwave thermal receiver has to be facing satellite with transmitter straight to receive full power just like other receivers? I got like 20 GW on launch pad while during gravity turn it falls down to 8 GW.\u003C/p\u003E\u003Cp\u003ETBH I\u0027d suggest making receivers omnidirectional until you can make them like in RemoteTech where antenna direction is independent of ship orientation (or even better if it could auto adjust). Currently power I receive on my ships is very unstable and changes all the time.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-28T02:26:03Z\u0022 title=\u002211/28/2013 02:26  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 28, 2013\u003C/time\u003E by Myrten\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2013-11-28T02:44:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Myrten\u0022 data-cite=\u0022Myrten\u0022\u003E\u003Cdiv\u003EIt was thorium with big TF4 label on tank and without these tanks refinery didn\u0027t displayed any production, sure there isn\u0027t much on launchpad but I warped for a few days and there wasn\u0027t even 0.01 increase in resources.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is still not very surprising. If you aren\u0027t in a location that has at least a moderate amount of the resource then you\u0027re unlikely to see even a small increase for a very long time. There are some \u0022moderate\u0022 areas, usually close to the marked high value resource areas that are quite viable to mine despite not being marked but if you just pick \u0022any old spot,\u0022 it\u0027s not going to work unless you\u0027re prepared to wait for months or years.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Myrten\u0022 data-cite=\u0022Myrten\u0022\u003E\u003Cdiv\u003EDoes refinery have to touch the ground to mine resources?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe ship it is attached to has to be landed, yes.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Myrten\u0022 data-cite=\u0022Myrten\u0022\u003E\u003Cdiv\u003ENope, it was on launchpad immediately after pressing launch in VAB and there was zero Actinides.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThen like the other person who asked about this, did you have some UF4 tank capacity to store the old UF4 from your reactors? If you can\u0027t put the UF4 somewhere, you can\u0027t swap the fuel.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Myrten\u0022 data-cite=\u0022Myrten\u0022\u003E\u003Cdiv\u003EAlso, does Microwave thermal receiver has to be facing satellite with transmitter straight to receive full power just like other receivers? I got like 20 GW on launch pad while during gravity turn it falls down to 8 GW.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe thermal receiver functions best when it\u0027s side on a receiver. Imagine you\u0027re pointing a microwave beam at that receiver, if you\u0027re pointing at it from behind, you\u0027ve got engines blocking your line of sight, from the front there is the rest of the vessel so you need to hit it side on.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Myrten\u0022 data-cite=\u0022Myrten\u0022\u003E\u003Cdiv\u003ETBH I\u0027d suggest making receivers omnidirectional until you can make them like in RemoteTech where antenna direction is independent of ship orientation (or even better if it could auto adjust). Currently power I receive on my ships is very unstable and changes all the time.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERemoteTech functions the way it does because you are pointing one receiver at one transmitter, this system has the capacity to receive power from multiple receivers at the same time. You cannot point a receiver at transmitters that are in two different physical locations so using physical orientation is the only sensible solution - other than making it possible to receive power from both in front and behind the receiver at the same time, which isn\u0027t very sensible and I also don\u0027t really like.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022babbos\u0022 data-cite=\u0022babbos\u0022\u003E\u003Cdiv\u003EIs there a way to view the microwave network in the map view like the remote tech net?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot at present but I think adding this in the future could be viable.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022babbos\u0022 data-cite=\u0022babbos\u0022\u003E\u003Cdiv\u003EI\u0027m still not 100% if the tx/rx dishes need to be actually alligned between crafts or just open and have line of sight to work\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETransmitter orientation does not matter but receiver orientation does, so you should try and point your receivers in the direction of transmitting vessels.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-28T02:46:35Z\u0022 title=\u002211/28/2013 02:46  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 28, 2013\u003C/time\u003E by Fractal_UK\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"AdmiralTigerclaw","CreatedById":92104,"CreatedDateTime":"2013-11-28T03:15:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ERemoteTech functions the way it does because you are pointing one receiver at one transmitter, this system has the capacity to receive power from multiple receivers at the same time. You cannot point a receiver at transmitters that are in two different physical locations so using physical orientation is the only sensible solution - other than making it possible to receive power from both in front and behind the receiver at the same time, which isn\u0027t very sensible and I also don\u0027t really like.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERemote Tech operates the way it does in this capacity because vessel orientation as a mechanic is extremely limited. Since both time warp as well as leaving the focus halts all rotation, orientation likewise collapses the moment you go to do anything else. Especially if you go do something else that involves time-warp, and then come back later with the ship in an entirely new position. Remote tech\u0027s dish lock-on feature is probably one of the best functions for getting around this. However, if you\u0027re worried about getting signals in from multiple sources, then perhaps the creative stroke needed is to create an orientation \u0027cone\u0027.\u003C/p\u003E\u003Cp\u003ERT\u0027s dishes have a field of view cone, likewise, the microwave receivers can have a field of view cone. Lock onto say, the sun, and all transmitters in the field of view cone in the direction of the sun can be picked up for power. It might not be as \u0027realistic\u0027 as physically rolling the ship to present the receiver, but it plays nice with the game engine.\u003C/p\u003E\u003Cp\u003EReally, I\u0027d love for the engine to be able to handle the real-time orientation, AND even the AI of mech-jeb for each and every craft at all times in real time. But I don\u0027t think I want to experiment with melting my computer just yet. But if we had that, making ships hold orientations towards selected targets would be a snap.\u003C/p\u003E\n"},{"CreatedByName":"Patupi","CreatedById":71098,"CreatedDateTime":"2013-11-28T03:54:38Z","Content":"\n\u003Cp\u003EOK, I\u0027m having some odd issues that I don\u0027t think have been talked about with others. Bear in mind I haven\u0027t updated to 0.8.1 yet, still on 0.8. I will update but I wanted to give you data on what\u0027s happened to me.\u003C/p\u003E\u003Cp\u003EFirst issue is odd, but not critical. Resources are fine on the normal in flight screen, but on the map screen they shift away from the planet:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.clayspaces.com/videogames/Shifted%20Resources.jpg\u0022 alt=\u0022Shifted Resources.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis only happened once to me on the Mun as a probe was doing a flyby (that turned into a landing... that turned into a crash... but that\u0027s another story). I don\u0027t have the log from this one I\u0027m pretty sure. I\u0027ve included the log for the second problem I\u0027m having, but it\u0027s been a few days since this oddity happened so I doubt the log covers it.\u003C/p\u003E\u003Cp\u003ESecond issue: Exploding science labs.\u003C/p\u003E\u003Cp\u003EFor some reason when I put a Science lab on wheels then switch away, then back, sometimes they blow up... not entirely, just certain parts of the vessel. The rest of it stays behind like a ghost. I lost twelve of the best scientists on that to begin with, then recently it happened again with a one lab rover:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.clayspaces.com/videogames/Ghost%20vehicle.jpg\u0022 alt=\u0022Ghost vehicle.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.clayspaces.com/videogames/Overheating.jpg\u0022 alt=\u0022Overheating.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe second pic shows that the computer thinks it\u0027s overheating somehow. Note, the destruction happens immediately upon switching to the vessel, before even the physics are loaded. I don\u0027t even see the lab, it blows up instantly.\u003C/p\u003E\u003Cp\u003EHere is the log file if it helps (This is from the KSP_Data folder, right?):\u003Ca href=\u0022http://www.clayspaces.com/videogames/output_log.txt\u0022 rel=\u0022external nofollow\u0022\u003Eoutput_log.txt\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Imca","CreatedById":72278,"CreatedDateTime":"2013-11-28T04:17:29Z","Content":"\n\u003Cp\u003EAll my fusion reactors say duetrium/tritum deprived and provide no power, dispite having fuel\u003C/p\u003E\n"},{"CreatedByName":"maximusfive","CreatedById":16628,"CreatedDateTime":"2013-11-28T07:15:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fractal_UK\u0022 data-cite=\u0022Fractal_UK\u0022\u003E\u003Cdiv\u003EIs everything that requires megajoules working correctly on the ship around Jool, do you know? I have a suspicion what this could be.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m having the same problem as Jasmir, my ship at Jool will no longer produce electric charge or MegaJoules, I just recently upgraded all the Radiators and the Generator on it, if that makes a difference.\u003C/p\u003E\u003Cp\u003EAs far as parts that use MJ, the only one on this particular ship is its D-T Vista, and yes, its still working, and behaves as intended, draining my Stored MJ.\u003C/p\u003E\u003Cp\u003EAlso, it was working just fine until it entered Jool\u0027s SoI, however, shortly before I noticed this bug, I had been deleting mod parts to free up mem while trying to fix a unrelated bug on my Eeloo ship. \u003C/p\u003E\u003Cp\u003ESo I don\u0027t know if my part deletions may have caused this bug to appear, but I don\u0027t imagine it would, since the parts deleted were ones I never used, and were from different mods.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-28T07:21:22Z\u0022 title=\u002211/28/2013 07:21  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 28, 2013\u003C/time\u003E by maximusfive\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-11-28T07:19:54Z","Content":"\n\u003Cp\u003EFractal: your last BASIC_NTR_PROPELLANT (for Methane) is missing a name line.\u003C/p\u003E\u003Cp\u003EMM Patch for MFS, for anyone who is using both (Fractal\u0027s work, converted to ModuleManager format). Put this in your ModularFuelTanks/RealFuels folder; it will be stock as of 3.4 but I don\u0027t have that quite ready yet.\u003C/p\u003E\u003Cp\u003ELet me know if anything doesn\u0027t work right, I think I have it correct.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/u10orkb0peh8dbo/KSPI_MFS.cfg\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/u10orkb0peh8dbo/KSPI_MFS.cfg\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"wasmic","CreatedById":64885,"CreatedDateTime":"2013-11-28T07:51:12Z","Content":"\n\u003Cp\u003EI have a question/request: would it be possible to get other kinds of methane powered engines, and smaller lqdMethane tanks? Currently, it\u0027s only really good for first-stages, and I\u0027d like to be able to use it on upper stages, SpaceX style. Also, since it\u0027s meant for use as a refuelable fuel, it would be kool to have a lower-thrust higher-isp engine that uses lqdMethane.\u003C/p\u003E\n"},{"CreatedByName":"Xentoe","CreatedById":80083,"CreatedDateTime":"2013-11-28T07:54:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022zzz\u0022 data-cite=\u0022zzz\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Gfqt1Im.jpg\u0022 alt=\u0022Gfqt1Im.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www./?ewkw5zkzuss6s2h\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./?ewkw5zkzuss6s2h\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI\u0060m still a bit sad, that this cool model never found it\u0060s way official into the moddatabase. (Gets so easy lost in the giant topic)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"red_prime","CreatedById":83718,"CreatedDateTime":"2013-11-28T08:38:15Z","Content":"\n\u003Cp\u003EHi guys, I am having problems getting this mod to work. I have already installed it and when i start KSP all the parts load but as soon as the black screen with the \u0022Loading\u0022 message appears, the game crashes without giving any errors. this started to happen only after Installing Interstellar. If I remove it, everything starts working fine. Please help me as I really wanna try this out!\u003C/p\u003E\u003Cp\u003ECheers.\u003C/p\u003E\n"},{"CreatedByName":"Imca","CreatedById":72278,"CreatedDateTime":"2013-11-28T08:39:50Z","Content":"\n\u003Cp\u003EAre you running other mods?\u003C/p\u003E\u003Cp\u003ESounds like your hitting the 4 gig limit.\u003C/p\u003E\n"},{"CreatedByName":"Jasmir","CreatedById":76744,"CreatedDateTime":"2013-11-28T08:41:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fractal_UK\u0022 data-cite=\u0022Fractal_UK\u0022\u003E\u003Cdiv\u003EIs everything that requires megajoules working correctly on the ship around Jool, do you know? I have a suspicion what this could be.\u003C/div\u003E\u003C/blockquote\u003ENo, making science in the lab drain the MJ-Bar, and if the bar is empty, no further MJs are produced. (Reactor stays on 30%, Generator stays on 0).\n"},{"CreatedByName":"red_prime","CreatedById":83718,"CreatedDateTime":"2013-11-28T08:46:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Imca\u0022 data-cite=\u0022Imca\u0022\u003E\u003Cdiv\u003EAre you running other mods?\u003Cp\u003ESounds like your hitting the 4 gig limit.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have the following mods installed: B9 Aerospace, Deadly Re-entry, FAR, Kethane, KW rocketry, Navy Fish docking port alignment display, Chatterer, Remote Tech2 and Thunder Aerospace life support.\u003C/p\u003E\n"},{"CreatedByName":"Imca","CreatedById":72278,"CreatedDateTime":"2013-11-28T08:48:59Z","Content":"\n\u003Cp\u003EYup, your hitting the 4gig limit, B9 and KW alone will push it.\u003C/p\u003E\u003Cp\u003EUse the lower res textures for B9 in the zip the mod came in, since it requires the most ram, that should fix it.\u003C/p\u003E\n"},{"CreatedByName":"red_prime","CreatedById":83718,"CreatedDateTime":"2013-11-28T08:56:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Imca\u0022 data-cite=\u0022Imca\u0022\u003E\u003Cdiv\u003EYup, your hitting the 4gig limit, B9 and KW alone will push it.\u003Cp\u003EUse the lower res textures for B9 in the zip the mod came in, since it requires the most ram, that should fix it.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGreat! It started working. Thanks a lot mate \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"wasmic","CreatedById":64885,"CreatedDateTime":"2013-11-28T09:05:55Z","Content":"\n\u003Cp\u003EFrom the lqdMethane engine:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EElon Kerman\u0027s Space Exploration Corp.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI see what you did there.\u003C/p\u003E\n"},{"CreatedByName":"Imca","CreatedById":72278,"CreatedDateTime":"2013-11-28T09:14:23Z","Content":"\n\u003Cp\u003ENo problem, have had that issue sevral times myself, and ummm just so it does not get missed since two pages ago.\u003C/p\u003E\u003Cp\u003ENo fusion reactors work for me, they say \u0022Duetrium/Tritium deprived\u0022 even though they have fuel.\u003C/p\u003E\n"},{"CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2013-11-28T09:23:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Imca\u0022 data-cite=\u0022Imca\u0022\u003E\u003Cdiv\u003ENo problem, have had that issue sevral times myself, and ummm just so it does not get missed since two pages ago.\u003Cp\u003ENo fusion reactors work for me, they say \u0022Duetrium/Tritium deprived\u0022 even though they have fuel.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECan you provide more details about when this happens? How have you used them on your vessels? I\u0027m going to need more information to figure out what is causing that.\u003C/p\u003E\n"},{"CreatedByName":"Imca","CreatedById":72278,"CreatedDateTime":"2013-11-28T09:40:14Z","Content":"\n\u003Cp\u003Enot even got to use it yet.\u003C/p\u003E\u003Cp\u003EThe fusion reactors are doing it on the runway.\u003C/p\u003E\n"},{"CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2013-11-28T09:51:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Imca\u0022 data-cite=\u0022Imca\u0022\u003E\u003Cdiv\u003Enot even got to use it yet.\u003Cp\u003EThe fusion reactors are doing it on the runway.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOkay, but here is a picture of a fusion reactor working perfectly on the runway, so obviously the problem is more specific than building a ship with a fusion reactor and putting it on the runway, otherwise this wouldn\u0027t work. With the information you have given me, all I can say is: it works fine for me.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/unG1sw9.jpg\u0022 alt=\u0022unG1sw9.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Imca","CreatedById":72278,"CreatedDateTime":"2013-11-28T10:06:26Z","Content":"\n\u003Cp\u003EKinda figured it would or rlse there would be more complaints, but I just cant figure out WHAT is more specific then that.\u003C/p\u003E\u003Cp\u003EI kinda wonder if I am not suplying it enough MW for the laser, but does that give its own message or not?\u003C/p\u003E\u003Cp\u003EI will test one jumpstarted by an antimater reactor real fast hold on.\u003C/p\u003E\u003Cp\u003EEdit : Nevermind, I am an idiot.....\u003C/p\u003E\u003Cp\u003EThink it could get a diffrent message for when it does not have enough power for the laser in an update?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-28T10:11:56Z\u0022 title=\u002211/28/2013 10:11  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 28, 2013\u003C/time\u003E by Imca\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2013-11-28T10:47:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Imca\u0022 data-cite=\u0022Imca\u0022\u003E\u003Cdiv\u003EKinda figured it would or rlse there would be more complaints, but I just cant figure out WHAT is more specific then that.\u003Cp\u003EI kinda wonder if I am not suplying it enough MW for the laser, but does that give its own message or not?\u003C/p\u003E\u003Cp\u003EI will test one jumpstarted by an antimater reactor real fast hold on.\u003C/p\u003E\u003Cp\u003EEdit : Nevermind, I am an idiot.....\u003C/p\u003E\u003Cp\u003EThink it could get a diffrent message for when it does not have enough power for the laser in an update?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHmm, it should just turn itself off when there isn\u0027t sufficient power, you shouldn\u0027t be getting a resource deprived message.\u003C/p\u003E\n"},{"CreatedByName":"Imca","CreatedById":72278,"CreatedDateTime":"2013-11-28T11:01:33Z","Content":"\n\u003Cp\u003EI am though, would a screen shot help?\u003C/p\u003E\u003Cp\u003EI can get one in the morning.\u003C/p\u003E\n"},{"CreatedByName":"Tommygun","CreatedById":41293,"CreatedDateTime":"2013-11-28T11:29:59Z","Content":"\n\u003Cp\u003EI had a chance to play around with the microwave thermal rocket and it was quite fun.\u003C/p\u003E\u003Cp\u003EI started out with just four unlinked 2.5m nuclear rectors in orbit powering it and the power to weight ratio wasn\u0027t great.\u003C/p\u003E\u003Cp\u003EThen I launched six 3.75m reactors up with multiple transmitters and receivers to form a network, at that point I ended up with massive power ratios.\u003C/p\u003E\u003Cp\u003EIt is a little hard to guess at the delta V as it seems to depend partly on how long you let the rocket heat up on the launch pad.\u003C/p\u003E\u003Cp\u003EIt makes for a great SSTO craft.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-28T11:32:07Z\u0022 title=\u002211/28/2013 11:32  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 28, 2013\u003C/time\u003E by Tommygun\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"babbos","CreatedById":91911,"CreatedDateTime":"2013-11-28T11:35:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fractal_UK\u0022 data-cite=\u0022Fractal_UK\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ETransmitter orientation does not matter but receiver orientation does, so you should try and point your receivers in the direction of transmitting vessels.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThank you for your prompt and clear reply Fractal_UK! You are the best \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo add me to the supporters of making the rx antenna omni, time will come when you want to burn your thermal dependent ship to a vector that your dish is not properly oriented and you\u0027ll just stay there forever...\u003C/p\u003E\u003Cp\u003ECan someone post a picture of his / her refinery in a planet and describe the flow of refueling ships? Do you do it Kethane style or anything new has come up?\u003C/p\u003E\n"}]}