{"TopicId":40423,"ForumId":34,"TopicTitle":"[1.8.1] Docking Port Alignment Indicator (Version 6.8.5 - Updated 12/14/19)","CreatedByName":"NavyFish","CreatedById":77044,"CreatedDateTime":"2013-08-01T07:07:01Z","PageNum":18,"Articles":[{"CreatedByName":"Deadweasel","CreatedById":23123,"CreatedDateTime":"2014-04-04T16:44:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jmanidb\u0022 data-cite=\u0022jmanidb\u0022\u003E\u003Cdiv\u003EThis thread doesn\u0027t get a lot of activity. I think that is because this app has been so perfect that no one has had anything to say...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027re right, in that everything that can be said about this mod already has been said. It\u0027s darned near \u003Cem\u003Eperfect! \u003C/em\u003EI will swear by it for docking at all times, and since I\u0027ve installed it, I have \u003Cem\u003Enever \u003C/em\u003Ehad a docking that ended with the ships swaying and bouncing all over the place. In fact they come together so well that there\u0027s no movement induced in the receiving vessel whatsoever. Before this mod, I had to immediately do a quick timewarp to stop any rotation after docking, but now it\u0027s completely unnecessary.\u003C/p\u003E\u003Cp\u003E\u0026lt;3\u003C/p\u003E\n"},{"CreatedByName":"BigD145","CreatedById":417,"CreatedDateTime":"2014-04-04T16:58:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jmanidb\u0022 data-cite=\u0022jmanidb\u0022\u003E\u003Cdiv\u003EThis thread doesn\u0027t get a lot of activity. I think that is because this app has been so perfect that no one has had anything to say...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYup, works fine in 23.5.\u003C/p\u003E\n"},{"CreatedByName":"LameLefty","CreatedById":57336,"CreatedDateTime":"2014-04-04T22:59:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BigD145\u0022 data-cite=\u0022BigD145\u0022\u003E\u003Cdiv\u003EYup, works fine in 23.5.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGood to know! I started a new save and haven\u0027t played much since the update. As a result, I haven\u0027t had the chance to actually dock with anything yet. Good to know Navyfish\u0027s hard work remains viable.\u003C/p\u003E\n"},{"CreatedByName":"YolDovah","CreatedById":102979,"CreatedDateTime":"2014-04-06T15:37:49Z","Content":"\n\u003Cp\u003EIm guessing this as already been answered but when i click on the drop down arrow to unlock the position an size how do i get it to stay at the size because every time i let go of it it shrinks back to the small 1cm by 1 cm size.\u003C/p\u003E\u003Cp\u003ENote to everyone I\u0027m also using engineer which is docked onto the alignment window so i dont know if that could be causing the problem.\u003C/p\u003E\n"},{"CreatedByName":"YolDovah","CreatedById":102979,"CreatedDateTime":"2014-04-06T15:52:36Z","Content":"\n\u003Cp\u003EIm guessing this as already been answered but when i click on the drop down arrow to unlock the position an size how do i get it to stay at the size because every time i let go of it it shrinks back to the small 1cm by 1 cm size.\u003C/p\u003E\u003Cp\u003ENote to everyone I\u0027m also using engineer which is docked onto the alignment window so i dont know if that could be causing the problem.\u003C/p\u003E\n"},{"CreatedByName":"HeadHunter67","CreatedById":74121,"CreatedDateTime":"2014-04-06T16:51:58Z","Content":"\n\u003Cp\u003EThat\u0027s a toolbar question, best to ask Blizzy.\u003C/p\u003E\n"},{"CreatedByName":"Artorp","CreatedById":87642,"CreatedDateTime":"2014-04-07T00:39:40Z","Content":"\n\u003Cp\u003EI would also love for this tool to work with asteroids. Or - with the new addition of the claw - any target in general. Just having the relative lateral speed available would be awesome, the navball just doesn\u0027t cut it. Thinking aloud, unlike docking ports you can\u0027t use the asteroid\u0027s orientation as a reference since the approach angle would vary from asteroid to asteroid and maneuver to maneuver. Maybe you could use your own ship\u0027s?\u003C/p\u003E\n"},{"CreatedByName":"Tarophon","CreatedById":107946,"CreatedDateTime":"2014-04-07T17:52:20Z","Content":"\n\u003Cp\u003EI recently re-installed KSP and this mod, but the indicator doesn\u0027t show up when I target a docking port. The files are in the right locations and I only have MechJeb and Kerbal alarm clock installed. Anything else I could be doing wrong?\u003C/p\u003E\n"},{"CreatedByName":"NavyFish","CreatedById":77044,"CreatedDateTime":"2014-04-07T19:34:52Z","Content":"\n\u003Cp\u003EThis plugin currently requires blizzy\u0027s toolbar to be installed. In the next version, I will be removing this dependency (keeping integration optional). I apologize for the inconvenience.\u003C/p\u003E\n"},{"CreatedByName":"JedTech","CreatedById":104003,"CreatedDateTime":"2014-04-09T01:37:56Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003Eblizzy\u0027s toolbar is practically stock. Anyone not using it should really consider it.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EExcited for an update NavyFish! Let us know if you need any testing, ideas, or research.\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"NavyFish","CreatedById":77044,"CreatedDateTime":"2014-04-11T07:31:02Z","Content":"\n\u003Cp\u003EThanks jmanidb!\u003C/p\u003E\u003Cp\u003EIf anyone could tell me how to get an individual part\u0027s transform when it\u0027s greater than 200m away from the active vessel, that\u0027d be great! Time permitting, I\u0027ll be taking another whack at this, and if we can figure it out, I\u0027ll add a couple \u0022Target Port Cycle\u0022 buttons to the mod (including a HUD-style selection diamond over the selected port in-game), so that we no longer have to right-click the target docking port.\u003C/p\u003E\u003Cp\u003EAlso.. I\u0027ve added a donation button to the first post. I\u0027m not looking to quit my day job (yet.. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E), but after making a few contributions myself to other modders, I figured why not. I\u0027m not going to put up an AdFly link because advertisements are so very annoying. If you\u0027re feeling generous, a small contribution would be incredibly appreciated!\u003C/p\u003E\u003Cp\u003E-Navy\u003C/p\u003E\n"},{"CreatedByName":"Tommygun","CreatedById":41293,"CreatedDateTime":"2014-04-12T02:43:12Z","Content":"\n\u003Cp\u003ENavyFish, you seem to have an old version of Toolbar with your down load (the change log readme only list up to version 1.2.0).\u003C/p\u003E\u003Cp\u003EI wasn\u0027t getting MechJeb and Kerbal Engineer to display correctly with the version of Toolbar you had, so I updated to toolbar 1.7.1 and it works now.\u003C/p\u003E\u003Cp\u003EAlso I finally made my first manual docking!!! Thanks.\u003C/p\u003E\n"},{"CreatedByName":"NavyFish","CreatedById":77044,"CreatedDateTime":"2014-04-13T23:14:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tommygun\u0022 data-cite=\u0022Tommygun\u0022\u003E\u003Cdiv\u003ENavyFish, you seem to have an old version of Toolbar with your down load (the change log readme only list up to version 1.2.0).\u003Cp\u003EI wasn\u0027t getting MechJeb and Kerbal Engineer to display correctly with the version of Toolbar you had, so I updated to toolbar 1.7.1 and it works now.\u003C/p\u003E\u003Cp\u003EAlso I finally made my first manual docking!!! Thanks.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECongrats! Always nice to hear!\u003C/p\u003E\u003Cp\u003EI believe that was the current version of blizzy\u0027s toolbar when I last updated the plugin. The coming update will likely not even include the toolbar folder, as integration will be optional.\u003C/p\u003E\n"},{"CreatedByName":"NavyFish","CreatedById":77044,"CreatedDateTime":"2014-04-13T23:17:31Z","Content":"\n\u003Cp\u003EGentlemen, \u003Cspan style=\u0022font-size:18px;\u0022\u003EGREAT SUCCESS:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i164.photobucket.com/albums/u5/usnavyfish/longdistance.png~original\u0022 alt=\u0022longdistance.png~original\u0022\u003E\u003C/p\u003E\u003Cp\u003EIf I may, please draw your attention to the distance readout to the targeted docking port.\u003C/p\u003E\u003Cp\u003EI have discovered how to interact with docking ports beyond the \u0027default\u0027 200m radius. Ports can now be targeted up to ~2.25 km (or whatever your vessel load/unload distance is set to, via other mods).\u003C/p\u003E\u003Cp\u003EOf course, you can\u0027t right-click a port at that distance. Heck, I find it hard to right-click a port at anything more than 100m, particularly if there\u0027s relative motion involved. Thus, the next update will include the ability to cycle-through the list of docking ports on your target. Finally, there will be a reason for the toolbar integration \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E (although I will be making it optional, and provide a standalone button if blizzy\u0027s toolbar isn\u0027t present).\u003C/p\u003E\u003Cp\u003EHere\u0027s how I picture it all working... (Note that I\u0027m sharing this with you for feedback purposes. If you think there\u0027s a better way to do this, then speak up!)\u003C/p\u003E\u003Cp\u003EThis DPAI \u0027reticule\u0027 window will always be available, and its visibility can be toggled with the toolbar button. When visible, if the target is not loaded (beyond ~2.2 km), it will simply display a message in the window indicating that the target is too far away. Once you\u0027ve closed within the loading distance, the nearest port will automatically be targeted (A settings option will allow the DPAI to automatically pop-up whenever you\u0027re in docking range, if desired). Somewhere on the gauge will be a left and right arrow, which will allow you to cycle through the available docking ports. It will also likely display the human-readable name of the type of port that\u0027s selected. Finally, and this may not make it into the next version unless I can figure out how to do it soon, there may be a little \u0027diamond\u0027 reticle overlaid in world-space over the selected port, for quick visual identification of your selection. I\u0027ve experimented with part highlighting as an alternative, but I think it\u0027s just ugly.\u003C/p\u003E\u003Cp\u003EAs always, interested to hear your feedback. Free-time is very limited for me at the moment, so I can\u0027t give you a reliable estimate as to when the next update will come out, but stay tuned, I think sometime within the next 2 weeks will be reasonable.\u003C/p\u003E\n"},{"CreatedByName":"ZodiusInfuser","CreatedById":76163,"CreatedDateTime":"2014-04-14T00:10:59Z","Content":"\n\u003Cp\u003ESince the window can be opened when out of the 2.25km range, perhaps rather than be inactive it could act like the navball, in that the direction marker would be the line to the target? Once within that range it could then switch to the existing mode if docking ports are available, otherwise remain as is (useful for docking with asteroids).\u003C/p\u003E\u003Cp\u003EAs a possible extension to the new selection feature, would it be possible to specify primary axes of a target vessel, such as z up.I\u0027m thinking this may be beneficial for claw docking with craft without ports, as I had to do recently.\u003C/p\u003E\n"},{"CreatedByName":"LameLefty","CreatedById":57336,"CreatedDateTime":"2014-04-14T02:37:49Z","Content":"\n\u003Cp\u003EExcellent planned enhancements, Navyfish. Thank you. I look forward to seeing these new pieces of your excellent tool implemented. The ability to select the proper docking port from further away will be GREATLY appreciated!\u003C/p\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2014-04-14T08:46:57Z","Content":"\n\u003Cp\u003ENavyfish: I don\u0027t know what it\u0027s like now, but please break the dependency on the target being an actual docking port. EL\u0027s recycling bins are targetable in the same manner as docking ports. I believe you need only to find ITargetable objects and you can interact with those as appropriate.\u003C/p\u003E\n"},{"CreatedByName":"diomedea","CreatedById":93700,"CreatedDateTime":"2014-04-14T09:12:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NavyFish\u0022 data-cite=\u0022NavyFish\u0022\u003E\u003Cdiv\u003E...\u003Cp\u003ESomewhere on the gauge will be a left and right arrow, which will allow you to cycle through the available docking ports. It will also likely display the human-readable name of the type of port that\u0027s selected. Finally, and this may not make it into the next version unless I can figure out how to do it soon, there may be a little \u0027diamond\u0027 reticle overlaid in world-space over the selected port, for quick visual identification of your selection. I\u0027ve experimented with part highlighting as an alternative, but I think it\u0027s just ugly.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETruly impressive those new features, but that one to allow some form of identification of the aimed port is a must-have for me. I would like a way to name single parts (so to assign specific names to docking ports and be able to know what I am targetting), but having a visual aid on the selected port is possibly even better. It would save me the hassle of placing beacon lights close to the ports, and switch them on for the selected port to see which one I have to dock with (plus, I still have to target that port). Though, if there could be an interaction with the targeted port, so to simulate that having a lighting device attached, it could be even better IMHO.\u003C/p\u003E\n"},{"CreatedByName":"TMS","CreatedById":57134,"CreatedDateTime":"2014-04-14T09:52:19Z","Content":"\n\u003Cp\u003EYeah, it\u0027s a real shame that the game core doesn\u0027t allow you to name docking ports. One for \u0022tweakable everything\u0022, perhaps?\u003C/p\u003E\u003Cp\u003EOther \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/20604-Plugin-Parts-0-16-Orbital-Rendezvous-and-Docking-Assistant\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003Edocking\u003C/strong\u003E\u003C/a\u003E and \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/46956-0-23-Targetron-Target-or-command-vessel-from-a-list-of-active-flights!\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003Etargeting\u003C/strong\u003E\u003C/a\u003E mods of old provided a docking port list, but it tends to get cluttered if you\u0027re approaching a large space station with numerous ports. Visual highlighting can help in those cases, but I would agree that it does look incredibly ugly.\u003C/p\u003E\u003Cp\u003EIs part highlighting the only visual distinction that can be made? Could one generate a HUD-like reticle/crosshairs over the part?\u003C/p\u003E\n"},{"CreatedByName":"Rockstar04","CreatedById":83286,"CreatedDateTime":"2014-04-14T13:11:06Z","Content":"\n\u003Cp\u003ETMS brings up a good point, large space stations would have a TON of docking ports, would it be possible to only list docking ports that are open? (as in not currently docked to another space station module)\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-04-14T15:57:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rockstar04\u0022 data-cite=\u0022Rockstar04\u0022\u003E\u003Cdiv\u003ETMS brings up a good point, large space stations would have a TON of docking ports, would it be possible to only list docking ports that are open? (as in not currently docked to another space station module)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhy not also (as in doesn\u0027t have the shield open) for the shielded ports? You could keep them all closed by default, open one of them, and then your ship would only have one thing to target. Easy peasy.\u003C/p\u003E\n"},{"CreatedByName":"Pontiac","CreatedById":62216,"CreatedDateTime":"2014-04-14T20:56:29Z","Content":"\n\u003Cp\u003E- Kethane has the ability to store a planets resources values within the save file, so theoretically, a port COULD be named. How the code does it, I\u0027ve no clue, but its there. I do know that every time a part is loaded, it is given a new internal ID, which is useless, however, certain attributes to each part are carried across. A name value possibly could be stored.\u003C/p\u003E\u003Cp\u003E- You could limit the list of entries to be docked at by comparing what part you\u0027re controlling the active space craft from and seeing what parts are available on the targeted entity. Basically, you show the list of small docking ports only if the \u0022controlled from here\u0022 object is a small docking port.\u003C/p\u003E\u003Cp\u003E- I personally like the layout of Targetron, in which a list of items are selectable, and highlights what you\u0027re going to target on the receiving vessel.\u003C/p\u003E\n"},{"CreatedByName":"NavyFish","CreatedById":77044,"CreatedDateTime":"2014-04-14T21:48:49Z","Content":"\n\u003Cp\u003EAll good ideas. For a first pass, I\u0027ll generate a HUD reticule over the selected part, akin to the normal target diamond but probably a different color (orange?). It may be easy in code to distinguish between ports of different size. If so, I\u0027ll filter (with the settings option to not filter) the list of available ports to those matching in size. I\u0027ll take a look at shielded and docked ports - not sure how those are represented in code, but if I can parse them I\u0027ll include them as a filter option as well (with shielded ports likely defaulted to not filter, as it\u0027s more of an advanced usage case).\u003C/p\u003E\u003Cp\u003EPart naming, as far as I can tell, is a whole other monster. Module Manager may allow for it, but I won\u0027t have the time to research that before my desired release date - I\u0027ll be getting underway again for some time and would like to push these new features prior to that time.\u003C/p\u003E\u003Cp\u003ETargeting asteroids and other types of objects falls under this category as well, but I admit would be a very cool feature, so I\u0027ll look into it for the future.\u003C/p\u003E\n"},{"CreatedByName":"Crater","CreatedById":48907,"CreatedDateTime":"2014-04-15T11:55:41Z","Content":"\n\u003Cp\u003EThe secret of being able to name a port would be to create a new partmodule that only had one parameter, and that was the port name, so the config would look something like\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003EMODULE\u003Cbr\u003E{\u003Cbr\u003E    name = ModuleDockingPortName\u003Cbr\u003E    portName = Cargo Berth #1\u003Cbr\u003E}\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EKethane stores data in the savegame by using a SCENARIO {} node, but that\u0027s save-global, not craft specific, so for the ports on a single craft, I think you\u0027d have to go the partModule route, then use ModuleManager (or other witchcraft) to add your new partmodule to anything that had a docking port on it.\u003C/p\u003E\u003Cp\u003EIt might crumble when faced with single parts with multiple docking ports (such as PortWorks hab), but other than that, it should be pretty robust I think... but since I\u0027ve never written anything of any significance in C#, and never anything at all for KSP, I could be completely wrong, ofc.\u003C/p\u003E\n"},{"CreatedByName":"NavyFish","CreatedById":77044,"CreatedDateTime":"2014-04-15T15:18:41Z","Content":"\n\u003Cp\u003EThat sounds about right, though I\u0027ve also never modified or created a part module so there might be a few hidden snags. Regardless, the ability to name ports is sounding cooler each time I consider it. As always, time is the factor which determines whether or not this will make the next update, but if not, then I could see it coming out in the one following that.\u003C/p\u003E\u003Cp\u003EAs far as interface is concerned, I\u0027d probably look to add a rename button to the right-click GUI both in editor and in flight, and have that name reflect in both the right-click GUI as well as on the DPAI when targeted.\u003C/p\u003E\u003Cp\u003EOn an unrelated note, is anyone having issues with the precision of the indicator or any of its symbology? How about any confusion over the \u0027back hemisphere\u0027 (red CDI lines) mode? Any other \u0027core\u0027 functionality bugs/comments/requests?\u003C/p\u003E\u003Cp\u003EFinally, I\u0027m happy to report that I finalized the the logic for port cycling last night. My favorite aspect of this is that the closest port is automatically targeted whenever a ship is first targeted. I like this so much that I may add a \u0027target nearest port\u0027 button on the indicator, so you can retarget as appropriate with a single click on the DPAI as you navigate around a large station. Thoughts?\u003C/p\u003E\u003Cp\u003E\u0022Dock Safe\u0022\u003C/p\u003E\u003Cp\u003E-Navy\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-15T15:23:00Z\u0022 title=\u002204/15/2014 03:23  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 15, 2014\u003C/time\u003E by NavyFish\u003C/strong\u003E\n\u003C/span\u003E\n"}]}