{"TopicId":46894,"ForumId":34,"TopicTitle":"[1.02] KW Rocketry v2.7 Available - 1.02 Compatibility! - 16/05/2015","CreatedByName":"Kickasskyle","CreatedById":250,"CreatedDateTime":"2013-09-29T16:39:46Z","PageNum":3,"Articles":[{"CreatedByName":"PolecatEZ","CreatedById":58008,"CreatedDateTime":"2013-09-29T21:28:38Z","Content":"\n\u003Cp\u003EMy game started crashing randomly as well. There\u0027s issues with the new engine fairings in the KOSMOS pack also, where my framerate will drop like a rock when I try to use them in the VAB. I\u0027ll try putting in the manual fairings folder and see what happens for KW.\u003C/p\u003E\n"},{"CreatedByName":"Ratzap","CreatedById":75982,"CreatedDateTime":"2013-09-29T21:41:01Z","Content":"\n\u003Cp\u003ENice stuff but I just don\u0027t have 159MB to play with in my GameData :-/ Adding this new version I can\u0027t even start the game, it just runs out of memory loading. So I\u0027m afraid I ended up deleting 125MB worth that I\u0027ll probably never use. Too many mods, not enough memory for a 32 bit KSP to play with.\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2013-09-29T21:42:38Z","Content":"\n\u003Cp\u003EWe might be getting 64 bit with .22 but we do get plenty of other optimi-freaking-zation. Thank you Squad, it has been way too long without it.\u003C/p\u003E\n"},{"CreatedByName":"blubbermonkeys","CreatedById":61719,"CreatedDateTime":"2013-09-29T21:48:09Z","Content":"\n\u003Cp\u003ENoice. Great that it has been updated!\u003C/p\u003E\n"},{"CreatedByName":"Kickasskyle","CreatedById":250,"CreatedDateTime":"2013-09-29T21:50:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022UmlÃƒÂ¼x\u0022 data-cite=\u0022UmlÃƒÂ¼x\u0022\u003E\u003Cdiv\u003Ehm ok.. the filesize may be smaller, but the ingame memory footprint is bigger than ever. just did some testing. started a fresh KSP install with KWR only (no other mods). this is the KSP.exe memory usage on the title sceen\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell I am redoing the redux version currently. i\u0027ll dump all the textures down a size and tweak them so you don\u0027t get horrific seams and the like.\u003C/p\u003E\n"},{"CreatedByName":"zYnthethicz","CreatedById":5336,"CreatedDateTime":"2013-09-29T22:09:15Z","Content":"\n\u003Cp\u003EI tried the engines without autoshroud, but they don\u0027t show up in VAB.\u003C/p\u003E\u003Cp\u003EWhat do?\u003C/p\u003E\n"},{"CreatedByName":"Kickasskyle","CreatedById":250,"CreatedDateTime":"2013-09-29T22:22:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022zYnthethicz\u0022 data-cite=\u0022zYnthethicz\u0022\u003E\u003Cdiv\u003EI tried the engines without autoshroud, but they don\u0027t show up in VAB.\u003Cp\u003EWhat do?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m assuming you didn\u0027t delete the models/textures and simply overwrote the cfgs for the non autoshroud versions?\u003C/p\u003E\u003Cp\u003EOn another note, for the redux version I plan on packaging it so you can pick and choose which redux textures to install. So you could use the reduced textures but with the fullsize normal maps etc.\u003C/p\u003E\n"},{"CreatedByName":"Hiromoto","CreatedById":67638,"CreatedDateTime":"2013-09-29T22:32:04Z","Content":"\n\u003Cp\u003EI did a clean install and kept getting a run time error R6025. Re installed previous version ran fine.\u003C/p\u003E\n"},{"CreatedByName":"zYnthethicz","CreatedById":5336,"CreatedDateTime":"2013-09-29T22:46:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kickasskyle\u0022 data-cite=\u0022Kickasskyle\u0022\u003E\u003Cdiv\u003EI\u0027m assuming you didn\u0027t delete the models/textures and simply overwrote the cfgs for the non autoshroud versions?\u003Cp\u003EOn another note, for the redux version I plan on packaging it so you can pick and choose which redux textures to install. So you could use the reduced textures but with the fullsize normal maps etc.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, i did.\u003C/p\u003E\u003Cp\u003EAlso, if i don\u0027t remove the fairings, the game crashes when entering VAB.. \u003C/p\u003E\u003Cp\u003EAnd even if i have the nonautoshroud version the game occasionally crashes and huge fps drop. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003EEdit: Removing the pack makes everything smooth again, can load crafts just fine.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-29T22:51:31Z\u0022 title=\u002209/29/2013 10:51  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 29, 2013\u003C/time\u003E by zYnthethicz\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-09-29T22:47:29Z","Content":"\n\u003Cp\u003EThis looks great. I never bothered trying KW because all of the tanks I\u0027d seen had logos on them, but the engines are spectacular and you\u0027ve got a few odds and ends that I really like. Plus, the Soyuz-alike parts are awesome.\u003C/p\u003E\n"},{"CreatedByName":"Wait- Was That Important?","CreatedById":58359,"CreatedDateTime":"2013-09-29T23:27:37Z","Content":"\n\u003Cp\u003EI\u0027ve used KW religiously (even going so far as to delete the corresponding stock parts and use KW instead) since 0.18 and I can\u0027t express how happy I am that it\u0027s been re-released!\u003C/p\u003E\n"},{"CreatedByName":"B787_300","CreatedById":31055,"CreatedDateTime":"2013-09-29T23:59:55Z","Content":"\n\u003Cp\u003EChoirs of Alleluia has been initiated,\u003C/p\u003E\u003Cp\u003EThank Kickasskyle and Winston\u003C/p\u003E\n"},{"CreatedByName":"Firenexus13","CreatedById":67143,"CreatedDateTime":"2013-09-30T00:47:08Z","Content":"\n\u003Cp\u003EWoot Woot!\u003C/p\u003E\n"},{"CreatedByName":"LameLefty","CreatedById":57336,"CreatedDateTime":"2013-09-30T01:24:07Z","Content":"\n\u003Cp\u003EYou have NO IDEA how glad I am to see this new release. THANK YOU!!!\u003C/p\u003E\n"},{"CreatedByName":"Synthesis","CreatedById":26557,"CreatedDateTime":"2013-09-30T01:40:52Z","Content":"\n\u003Cp\u003EFirst thing first: your emblem graphic? Very slick!\u003C/p\u003E\u003Cp\u003ESecond, very excited about trying this new pack (with a smaller memory footprint). Excellent work!\u003C/p\u003E\u003Cp\u003EEDIT: Bummer, I\u0027m getting crashes on load now--I can use the old pack, but not the new pack. Not sure what might be causing it (not a memory error, since this one is smaller). I don\u0027t think KSP was patched recently, and deleting the whole directory and installing it didn\u0027t work. Using the non-auto shroud option doesn\u0027t work either.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-30T03:02:32Z\u0022 title=\u002209/30/2013 03:02  AM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 30, 2013\u003C/time\u003E by Synthesis\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Pesqueeb","CreatedById":83704,"CreatedDateTime":"2013-09-30T02:15:48Z","Content":"\n\u003Cp\u003EHi all, first post, sorry it\u0027s about a problem,\u003C/p\u003E\u003Cp\u003EI seem to be getting only parts of the Mod? Like, as in I get some parts but it doesn\u0027t seem like very many, not many new rockets, fuel tanks and a new fangled RCS, but I cant seem to find fairing stuff \u003Cem\u003Eat all\u003C/em\u003E. I\u0027ve watched the video, so I know it\u0027s supposed to be in structures, but the only parts I have are some new struts and the big adapters. There is no faring base, nose cone, or sidewalls that I can find, and I also find no new engines of any kind. I also cant find the \u0022ships\u0022 folder the installation directions refer to at all. I\u0027d be inclined to believe maybe I just got a bad download, but I\u0027ve deleted and re-downloaded 3 times now in addition to restarting the game maybe half a dozen times. I\u0027m new to the game, and the only other mod I\u0027ve installed is RendezMe, so it\u0027s certainly possible I\u0027m doing something wrong, but I can\u0027t tell what. Can anyone possibly give me some sort of direction or help? Am I not putting folders in the right place? Not extracting correctly? Sorry if I\u0027m being obtuse.\u003C/p\u003E\u003Cp\u003ECheers!\u003C/p\u003E\n"},{"CreatedByName":"Commander Gizmo","CreatedById":83616,"CreatedDateTime":"2013-09-30T04:08:39Z","Content":"\n\u003Cp\u003EThis is AWESOME! Thanks for the update!\u003C/p\u003E\u003Cp\u003EI oddly found that after installing the new KW, sans fairings, my game memory usage skyrocketed to 4GB from 3.2GB. After reducing all textures by 50%, it now fits snugly back into 3.2GB. It would appear that the new reduced size KW is actually larger! (I did use the KWPlus optimizations previously.) I don\u0027t really mind 50% sized textures though. I\u0027m off to try out the side mount tanks. I\u0027ve been needing those!\u003C/p\u003E\n"},{"CreatedByName":"missileman","CreatedById":68051,"CreatedDateTime":"2013-09-30T04:27:46Z","Content":"\n\u003Cp\u003EI too am getting crashes. No errors though, just instant exit to desktop.\u003C/p\u003E\u003Cp\u003EIt happens when I try to load a ship, or return to VAB from a flight.\u003C/p\u003E\n"},{"CreatedByName":"mwlue","CreatedById":68876,"CreatedDateTime":"2013-09-30T04:45:23Z","Content":"\n\u003Cp\u003EOh jesus~!! \u0022High Thrust version of the Thor SRB, Nearly twice as powerful as standard but with a 60 second burn time.\u0022 \u0026lt;=== i love that for my Katurn IIa\u003C/p\u003E\n"},{"CreatedByName":"Nightmare","CreatedById":63118,"CreatedDateTime":"2013-09-30T04:47:30Z","Content":"\n\u003Cp\u003EMemory usage skyrocketed arround 500 MB only by the new KW release sorry but this is bad for me and others I think, cause KW is not the only mod I got installed and I don\u0027t want to delete other mods for using KW sorry but I stick to the last relase before 2.5 as long as textures or other things that can be reduced to save memmory are not done.\u003C/p\u003E\u003Cp\u003ENo insult meant but it is as it is the memory usage of current version of KW ist TO BIG! \u003C/p\u003E\u003Cp\u003EMaybe this comes partly by the new bumbmaps.\u003C/p\u003E\u003Cp\u003EIf we hat a 64 bit KSP for windows i woould not mind but since it is 32 bit their is a hardcoded Borderline arround 3.8 GB Memory usage.\u003C/p\u003E\u003Cp\u003EMaybe an alternate release with resized textures to save memory would be nice to have?\u003C/p\u003E\n"},{"CreatedByName":"pfpants","CreatedById":72702,"CreatedDateTime":"2013-09-30T04:49:54Z","Content":"\n\u003Cp\u003EInstant CTD every time I enter the VAB. Deleted the mod, problem went away.\u003C/p\u003E\n"},{"CreatedByName":"Railgunner2160","CreatedById":67181,"CreatedDateTime":"2013-09-30T04:50:54Z","Content":"\n\u003Cp\u003EReally, REALLY nice parts pack!!! Any plans to make you own nuclear engines to complement the pack?? After the Redux pack ofcourse.....\u003C/p\u003E\n"},{"CreatedByName":"HeadHunter67","CreatedById":74121,"CreatedDateTime":"2013-09-30T05:02:26Z","Content":"\n\u003Cp\u003EI noticed that the RCS Quad in this pack does not properly apply lateral thrust when translating - at least, according to RCS Build Aid. It appears that the thrust vector for sideways thrust is actually directed 5-10 degrees to aft. Replacing with normal stock RCS quads shows the correct thrust direction. I\u0027d prefer the improved Isp of the KW ones, but not if it affects actual translation.\u003C/p\u003E\n"},{"CreatedByName":"jfx","CreatedById":37282,"CreatedDateTime":"2013-09-30T05:15:41Z","Content":"\n\u003Cp\u003ENeat. btw, from a marketing perspective you should say 62% less size \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"M5000","CreatedById":57096,"CreatedDateTime":"2013-09-30T05:28:59Z","Content":"\n\u003Cp\u003EOh god, why did I not know about this... \u003C/p\u003E\u003Cp\u003EKW Rocketry is my absolute favorite mod of all time, if I had to get rid of every mod except one, KW would be the one that sticks. \u003C/p\u003E\u003Cp\u003EHaving a run over with the parts, and doing a re-design of my baseline lifter, integrating said parts.\u003C/p\u003E\n"}]}