{"TopicId":48436,"ForumId":34,"TopicTitle":"Modular Fuel System Continued v3.3 (OBSOLETE)","CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-10-15T03:22:57Z","PageNum":19,"Articles":[{"CreatedByName":"AbeS","CreatedById":80644,"CreatedDateTime":"2013-11-23T05:06:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Morrigi\u0022 data-cite=\u0022Morrigi\u0022\u003E\u003Cdiv\u003EThe link to the realism overhaul release thread in the OP is broken.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJust add the \u0027:\u0027 after http, Nathan has the same problem with links on that thread too \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"dnulho","CreatedById":83752,"CreatedDateTime":"2013-11-23T05:12:24Z","Content":"\n\u003Cp\u003Eso at present there is no way to say that the part can hold a total of ### resources, regardless of what those resources are?\u003C/p\u003E\n"},{"CreatedByName":"dlrk","CreatedById":60033,"CreatedDateTime":"2013-11-23T05:12:48Z","Content":"\n\u003Cp\u003EOn the big radial engine, the buttons don\u0027t change/update when they\u0027re clicked, and the H2 button sometimes time changes the fuel to UDMH, which is not otherwise available. The smaller radial doesn\u0027t seem to work at all.\u003C/p\u003E\n"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2013-11-23T07:04:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022dnulho\u0022 data-cite=\u0022dnulho\u0022\u003E\u003Cdiv\u003Eso at present there is no way to say that the part can hold a total of ### resources, regardless of what those resources are?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s what amount and maxAmount to, they specify how much the tank can hold. I think you\u0027re making it harder on yourself than this actually is. You have three resources, You use TANKDEFINITION to define that it can hold those three resources. Then you define the three actual tanks that contain each resource with TANK, one for each. I\u0027d show you examples but I\u0027m on my iPad and cant go from memory righht now. Look at the files inthe RESOURCES folder for examples.\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-11-23T08:52:09Z","Content":"\n\u003Cp\u003EMorrigi: thanks. Fixed.\u003C/p\u003E\u003Cp\u003EDragon01: Ah, sorry. Forgot to add. Fixed.\u003C/p\u003E\u003Cp\u003Ednulho: If you set the tank volume to 100, you will never be able to exceed 100. That\u0027s how MFS works: can\u0027t add more than the ModularTank holds in individual resource tanks.\u003C/p\u003E\u003Cp\u003Estevron: already in, though hasn\u0027t been updated in a couple versions so it doesn\u0027t feature any new resource since MMH (it does support LOX, LH2, N2O4, and MMH, in addition to stock resources).\u003C/p\u003E\u003Cp\u003Edlrk: I\u0027ll check, You mean the white Rockomax one?\u003C/p\u003E\n"},{"CreatedByName":"dlrk","CreatedById":60033,"CreatedDateTime":"2013-11-23T19:02:53Z","Content":"\n\u003Cp\u003ENathan, affirm, and the little orange one doesn\u0027t seem to work at all. I think this issue might be related to Realism Overhaul, or perhaps Module Manager.\u003C/p\u003E\n"},{"CreatedByName":"dlrk","CreatedById":60033,"CreatedDateTime":"2013-11-23T19:08:43Z","Content":"\n\u003Cp\u003ESimilar problems seem to exist in the other engines and tanks, and it looks to be caused by RealismOverhaul.\u003C/p\u003E\n"},{"CreatedByName":"MNorman","CreatedById":64741,"CreatedDateTime":"2013-11-23T21:56:06Z","Content":"\n\u003Cp\u003EI am having problems with the interaction between realfuels this and the StretchySRBs. If I build a vehicle with stretchy SRBs of different sizes, if I try to launch the vehicle, or try to change the tech level, they are all set to the thrust of the most recently changed SRB. This did not happen without realfuels installed (removing the ModuleEngineConfigs from the stretchy SRBs)\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-11-23T22:08:25Z","Content":"\n\u003Cp\u003Edlrk: I\u0027ll try iwth the radials.\u003C/p\u003E\u003Cp\u003EAre you sure you deleted Engines.cfg first?\u003C/p\u003E\u003Cp\u003EMNorman: I\u0027ll check that out. I should be sendmessaging only the given part, but maybe it\u0027s bleeding out to the vessel as a whole.\u003C/p\u003E\n"},{"CreatedByName":"Dante80","CreatedById":91509,"CreatedDateTime":"2013-11-23T22:09:08Z","Content":"\n\u003Cp\u003EA question, does anyone have MFS configures for Bobcats russian engines?\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-11-23T22:40:27Z","Content":"\n\u003Cp\u003EThey already have them. They\u0027re backwards compatible with stock, so in the part chooser they have LF/Oxidizer. But if you actually add one, and go to action mode and click on it, you\u0027ll see it is correctly configured.\u003C/p\u003E\n"},{"CreatedByName":"Dante80","CreatedById":91509,"CreatedDateTime":"2013-11-23T22:47:22Z","Content":"\n\u003Cp\u003EWhen I\u0027m in the action group menu and click on an engine, the menu does not show. I just installed from Bobcat and applied the 0.64 size patch. \u003C/p\u003E\u003Cp\u003EAm I doing something wrong, or is it supposed to be like this?\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-11-23T23:03:40Z","Content":"\n\u003Cp\u003EThe 64% patch does not have MFS defines.\u003C/p\u003E\u003Cp\u003Edlrk: I just tried the radials and they work fine for me. Are you using RO and forgot to delete MFT/RealFuels/Engines.cfg?\u003C/p\u003E\n"},{"CreatedByName":"Dante80","CreatedById":91509,"CreatedDateTime":"2013-11-23T23:13:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NathanKell\u0022 data-cite=\u0022NathanKell\u0022\u003E\u003Cdiv\u003EThe 64% patch does not have MFS defines.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOkies, thanks a lot man...C:\u003C/p\u003E\n"},{"CreatedByName":"sephirotic","CreatedById":53469,"CreatedDateTime":"2013-11-24T13:22:00Z","Content":"\n\u003Cp\u003EOk, so last night i tried a probe mission to Titan using the RSS \u002B PF extra configs. It became clear that realistic manned mission are impossible to be reproduced in the game the way it is. Maneuver nodes are very limited and any gravity assists slightly more complex (more than two bodies, ore multi-moon gravity assists inside jupiter, for example) are nearly impossible to be planned. Partly because there isn\u0027t currently a tool that lets you plan launch windows with correct planet alignments, and part simply because of the rounding errors of timewarps. Nasa only needs correction burns in the order of couple of dozens m/s. after I timewarped in some parts of my trip to titan, the trajectory was so much different that I needed over 1k d/v of burn corrections. \u003C/p\u003E\u003Cp\u003EAerobraking in Saturn is also impossible since the realistic atmosphere cuts out abruptly, visiting any atmosphere-less moon is a no-no with conventional levels of d/v and chemical rockets.\u003C/p\u003E\u003Cp\u003ENevertheless i managed to land on Titan (after a final 2k d/v correction witch i needed to activate infinite fuel cheat to do so, nevertheless i managed to be assisted by jupiter\u0027s gravity and a intermediate MHN stage for corrections carrying 3k of d/v could be feasible).\u003C/p\u003E\u003Cp\u003EHere is some pics about my mission:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u0026lt;iframe class=\u0022imgur-album\u0022 width=\u0022100%\u0022 height=\u0022550\u0022 frameborder=\u00220\u0022 src=\u0022http://imgur.com/a/ssgqv/embed\u0022\u0026gt;\u0026lt;/iframe\u0026gt;\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EEDIT: How do i add those slides from IMGUR anyway?\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThis is all stuff related to the Real Solar System Thread, but now I want to discuss an alternate solution to theses serious limitations of the game witch comes in the scope of my previous discussion about the lack of practicality on the NTR here in this thread.\u003C/p\u003E\u003Cp\u003EMore efficient near-future rocket engines: As a more enthusiastic player of kerbal, i was always interested on rockets and interplanetary travel, even before the game, so i obviously read a little about some different types of proposed engine types. After my frustrated mission to Titan revealed so many difficulties on the game mechanics that severely limited the range of Manned missions to Saturn and Jupiter with direct insertion, it became obvious if I still wanted to play RSS \u002B MFS i would have to explore some different experimental and more efficient engine types.\u003C/p\u003E\u003Cp\u003EFirst I took a look at Starwaster extra mixtures and fuel types, because I also researched by myself different types of NTRs and fuel mixtures to come around the problem of limited storage of low density LH2 for more d/v interplanetary stages. \u003C/p\u003E\u003Cp\u003EI noticed Starwaster didnÃ‚Â´t add one of the most promissing solutions for more pratical NTR: LANTR; LOX Augmented Afterburner NTRs. \u003C/p\u003E\u003Cp\u003EBy adding a mixture ration of 4:1 of LOX at the exhaust of the H2 from a conventional solid core NTR, the exhaust speed is further increased thus increasing thrust by almost 4 times at the expense of slightly lessened ISP. \u003C/p\u003E\u003Cp\u003EThis is an interesting solution for more efficient stage-cycled NTR\u0027s design, like the used by russia on the RD0140 witch has naturally a higher ISP but lower thrust, 35KN, 2,5tons, 960isp. The thrust would exceed 120kn with this, extra fuel could be carried and the d/v would only be decreased to about 800ish witch is already what we have with the current setting of MFS. \u003C/p\u003E\u003Cp\u003EAnother option is using liquid and solid mixtures with the standard NTR like Starwaster added. I havenÃ‚Â´t tested yet, but LOX and Water are much more denser and still delivers higher ISP than high efficiency conventional LH2/LOX chemical rockets. I would have to test witch one is the best option\u003C/p\u003E\u003Cp\u003EI also further researched about other engine options.\u003C/p\u003E\u003Cp\u003EThe most obviously with we already are tired to know is the VASIMIR. But vasimir is very weak to be effectively used in a larger manned rocket and has problems of being very energy hungry and emitting too much heat.\u003C/p\u003E\u003Cp\u003EThere is actually a better type of electrical engine witch is actually even more advanced in development being already tested once in the ISS almost 10 years ago.\u003C/p\u003E\u003Cp\u003EMPD; MagnetoPlasmaDynamic Thruster. It needs less energy than VASIMIR and gives much more thrust even weighting less: A 200N MPD has already being tested and proved ready for operation and only needs 600kw of energy witch is fairly reasonable for current RTG of large solar panel technologies. It works at over 3000isp and can operate with either argon or xenon. \u003C/p\u003E\u003Cp\u003EBut the more interesting option I think is again, back into the NTR reign: \u003C/p\u003E\u003Cp\u003EThis is still havenÃ‚Â´t being build, but is a fairly mature concept and the favourite studied by NASA out of several subtypes of Nuclear propulsion: The Closed Quartz Gas Cycle, aka \u0022The Lighbulb\u0022. Closed nuclear cores insulated with quartz wall. Differently from Solid core, the radioactive fuel does not enter contact with the LH2. This insulation is due to the core operating at much higher temperatures witch gives higher exhausts speeds than regular SOLID core design and thus, higher ISP. It could operate at efficiency from 1900~3000s however, the problem is that due to the insulation of the cores, it is much heavier, with a TWR barely higher than 1:1. With this weight problem allied with the issue of low density of the LH2, I wonder if they could also be further accelerated with LOX afterbuner like the solid design, or even have different fuel mixtures at all.\u003C/p\u003E\u003Cp\u003ESo, i\u0027m going to add some fuel mixtures from Starwaster, mine for the LANTR, and I\u0027ll also grab the vasimir from the \u0022near-future\u0022 mod pack (tough i wonÃ‚Â´t install all those parts, since my game is already overflowing with too much parts) and the two nice Nuclear engines from Kommit witch I will respec as Gas cycle and MPD\u0027s.\u003C/p\u003E\u003Cp\u003EAfter some testing I\u0027ll report back witch option is the best.\u003C/p\u003E\u003Cp\u003EAnyone has any idea of any other near-futures high efficiency alternative engines that we could use? There is also the ORION, but i\u0027m rather skeptical about that one.\u003C/p\u003E\u003Cp\u003EAn interesting site with a huge compilation of different proposed efficient engines most of must already know:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.projectrho.com/public_html/rocket/enginelist.php\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.projectrho.com/public_html/rocket/enginelist.php\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Uzj936F.jpg\u0022 alt=\u0022Uzj936F.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-24T13:28:28Z\u0022 title=\u002211/24/2013 01:28  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 24, 2013\u003C/time\u003E by sephirotic\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2013-11-24T13:41:28Z","Content":"\n\u003Cp\u003ESephirotic: KSP interstellar has NTRs with realistic thermal power/mass ratios ~ 900 Isp and up to ~600kN with the largest reactors. You can probably figure out the real reactors the un-upgraded versions were based upon by their names. With research you can upgrade to nuclear lightbulbs, with no increased thrust but 2000\u002B Isp. Specific impulse scales with both reactor core temperature and molar mass of propellant. I\u0027ve also just added a reasonable simulation of the nuclear fuel life cycle in the latest version.\u003C/p\u003E\u003Cp\u003EIt also has an MPD but due to the realistic power figures, it requires a hell of a lot of power to get useable thrust out of. You can indeed use it with argon, hydrogen, lithium or xenon propellant.\u003C/p\u003E\u003Cp\u003EThere is a real fuels compatibility file on the first page of this thread, I\u0027ll update this soon to take advantage of some of the compatibility features I added in 0.8, this should support electrolysis of LiquidH2/LiquidOxygen and atmospheric scooping of those resources. Hopefully this will be done by the end of today.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-24T13:46:27Z\u0022 title=\u002211/24/2013 01:46  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 24, 2013\u003C/time\u003E by Fractal_UK\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ChronicSilence","CreatedById":19852,"CreatedDateTime":"2013-11-24T18:52:17Z","Content":"\n\u003Cp\u003ERegarding cryogenic fuels, what\u0027s the best way to provide insulation to prevent boiloff?\u003C/p\u003E\n"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2013-11-24T19:26:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ChronicSilence\u0022 data-cite=\u0022ChronicSilence\u0022\u003E\u003Cdiv\u003ERegarding cryogenic fuels, what\u0027s the best way to provide insulation to prevent boiloff?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ecryogenic tanks have reduced boiloff. for zero boiloff (ZBO) you need radiators for active cooling. the mod comes with some but they have no texturing. the interstellar mod has nicer ones that I posted a patch file to make them work with this mod. search the thread for radiator and you\u0027ll find it. if you cant I\u0027ll repost it but I cannot right now because I am posting from my ipad\u003C/p\u003E\n"},{"CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2013-11-24T19:31:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Starwaster\u0022 data-cite=\u0022Starwaster\u0022\u003E\u003Cdiv\u003Ecryogenic tanks have reduced boiloff. for zero boiloff (ZBO) you need radiators for active cooling. the mod comes with some but they have no texturing. the interstellar mod has nicer ones that I posted a patch file to make them work with this mod. search the thread for radiator and you\u0027ll find it. if you cant I\u0027ll repost it but I cannot right now because I am posting from my ipad\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have a similar issue with respect to posting at the moment but I\u0027ll look it up later and integrate that into my Interstellar patch for Real Fuels.\u003C/p\u003E\n"},{"CreatedByName":"sephirotic","CreatedById":53469,"CreatedDateTime":"2013-11-25T13:40:05Z","Content":"\n\u003Cp\u003E@Fractal_UK\u003C/p\u003E\u003Cp\u003EHmmm, very nice mod, some of your models looks very cool. I think i\u0027ll grab that plasma thruster and that nuclear reactor.\u003C/p\u003E\u003Cp\u003EBut for now my KSP installation is already running pretty heavy, i recently even deleted all fuel tanks parts that could be switched with theStretchy Tanks parts to save ram, even tough i personally think they look kinda ugly. so I was thinking on relying on most parts i already have and take advantage of the modularity of MFS. I\u0027ll take a look at your settings.\u003C/p\u003E\u003Cp\u003E@Nathan, Speaking of witch, I noticed the NTR\u0027s have a special .cfg file on the Realfuel folders separated from the Engines.cfg I was trying to edit it to add different fuel mixtures like I have already done sucesffuly with the Engine.cfg to some custom engines of my but this time i had no luck. I noticed this cfg does not have a \u0022ModuleEngineConfigs\u0022 module so i just trid to add it. THe game loads but when i go to the action groups, there are no options for customizing the game.\u003C/p\u003E\u003Cp\u003EMy config is like this:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003E//Squad_NTR_modularEngines.cfg\u003Cbr\u003E\u003Cbr\u003E@PART[nuclearEngine]\u003Cbr\u003E{\u003Cbr\u003E    @mass = 2.25\u003Cbr\u003E    @maxTemp = 2200\u003Cbr\u003E    @MODULE[ModuleEngines]\u003Cbr\u003E    {\u003Cbr\u003E\t@maxThrust = 60\u003Cbr\u003E\t@heatProduction = 300\u003Cbr\u003E\t@PROPELLANT[LiquidFuel]\u003Cbr\u003E\t{\u003Cbr\u003E\t\t@name = LiquidH2\u003Cbr\u003E        \t@ratio = 1.0\u003Cbr\u003E\t}\u003Cbr\u003E\t@PROPELLANT[Oxidizer]\u003Cbr\u003E\t{\u003Cbr\u003E\t\t@name = nuclearFuel\u003Cbr\u003E        \t@ratio = 0.00000000001\u003Cbr\u003E\t}\u003Cbr\u003E\t@atmosphereCurve\u003Cbr\u003E \t{\u003Cbr\u003E         @key,0 = 0 1000\u003Cbr\u003E  \t @key,1 = 1 430\u003Cbr\u003E \t}\u003Cbr\u003E\t}\u003Cbr\u003E//extra: these are the Lines and the module i added:\u003Cbr\u003E MODULE\u003Cbr\u003E {\u003Cbr\u003E  name = ModuleEngineConfigs\u003Cbr\u003E  origMass = 2.4\u003Cbr\u003E  techLevel = 3\u003Cbr\u003E  origTechLevel = 3\u003Cbr\u003E  engineType = L\u002B\u003Cbr\u003E  configuration = LiquidFuel\u002BLiquidOxygen\u003Cbr\u003E  modded = false \u003Cbr\u003E  CONFIG\u003Cbr\u003E  {\u003Cbr\u003E   name = LiquidH2\u002BLiquidOxygen\u003Cbr\u003E   maxThrust = 225\u003Cbr\u003E   heatProduction = 1000\u003Cbr\u003E\u003Cbr\u003E   PROPELLANT\u003Cbr\u003E   {\u003Cbr\u003E    name = LiquidH2\u003Cbr\u003E    ratio = 0.73\u003Cbr\u003E    DrawGauge = True\u003Cbr\u003E   }\u003Cbr\u003E   PROPELLANT\u003Cbr\u003E   {\u003Cbr\u003E    name = LiquidOxygen\u003Cbr\u003E    ratio = 0.27\u003Cbr\u003E   }\u003Cbr\u003E   IspSL = 0.45\u003Cbr\u003E   IspV = 0.65\u003Cbr\u003E   }\u003Cbr\u003E }\u003Cbr\u003E\u003Cbr\u003E//Extra addition end \u003Cbr\u003E\u003Cbr\u003E    MODULE\u003Cbr\u003E    {\u003Cbr\u003E\tname = ModuleAlternator\t\u003Cbr\u003E(... etc)\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EBut had no luck, I canÃ‚Â´t seen to add different fuel types to it. Starwaster configs are very nice, I wanted to add SOME of his lines, but not the whole .cfg Because i donÃ‚Â´t use Kethane.\u003C/p\u003E\u003Cp\u003EAny clues?\u003C/p\u003E\u003Cp\u003ECan i also add 3 types of fuel Mixture this way? So i can keep the Nuclear fuel? (LH2\u002BLOX\u002BNuclearFuel)?\u003C/p\u003E\u003Cp\u003EThanks\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-11-25T18:39:45Z","Content":"\n\u003Cp\u003ESephirotic: The NTRs already have modular engines, they\u0027re just done with the Hyrbid module (which means the same syntax for configs, but you can switch configs in flight). Look _below_ the Alternator module.\u003C/p\u003E\u003Cp\u003EStarwaster is working on revamping the NTRs; that\u0027ll be in the next MFS.\u003C/p\u003E\n"},{"CreatedByName":"ialdabaoth","CreatedById":57270,"CreatedDateTime":"2013-11-25T19:35:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NathanKell\u0022 data-cite=\u0022NathanKell\u0022\u003E\u003Cdiv\u003EMAKC: Because MFS rounds fuel quantity, and ST rescales in itty-bitty chunks (1% at a time), rounding errors add up during scaling. When you have approximately the right size tank, go into the tank editor, and remove and re-add your MFS fuel tanks; that will correct the ratios. The way it works internally is this:\u003Cp\u003EMFS normally rounds fuel quantities (to 4 sig figures, or to the nearest integer if \u0026gt; 1000). When you start rescaling a ST, rounding is turned off, but the rounded ratio (not the correct ratio) is the starting point. When you move your cursor off the tank, quantities are rounded again. That means you get rounding errors twice, but it\u0027s the price you pay for nice numbers in MFS. I\u0027m considering turning rounding off entirely, however, since AFAIK most people who use MFS use ST, and does it really matter if your amount of fuel isn\u0027t a nice round number?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt can, when you start with a procedurally filled tank and then want to edit it further. All those extra digits have to be deleted, which can be tedious.\u003C/p\u003E\u003Cp\u003ERecommendation: Have a value in the TANK_DEFINITION that determines whether rounding is enabled for that tank type or not, so that stretchy tanks can use a TANK_DEFINITION that disables rounding.\u003C/p\u003E\n"},{"CreatedByName":"sidfu","CreatedById":70409,"CreatedDateTime":"2013-11-25T22:25:14Z","Content":"\n\u003Cp\u003Ewas looking at the kethane .cfg and it doesnt have all the fuels that modular fuels make. would editing it be good to add the other fuels.\u003C/p\u003E\n"},{"CreatedByName":"Morrigi","CreatedById":25077,"CreatedDateTime":"2013-11-25T22:33:46Z","Content":"\n\u003Cp\u003EFor whatever reason you can\u0027t run the KSP Interstellar engines off LH2. Is this intended?\u003C/p\u003E\n"},{"CreatedByName":"sidfu","CreatedById":70409,"CreatedDateTime":"2013-11-25T22:36:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Morrigi\u0022 data-cite=\u0022Morrigi\u0022\u003E\u003Cdiv\u003EFor whatever reason you can\u0027t run the KSP Interstellar engines off LH2. Is this intended?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ethink he hasnt put out a updated interstaller .cfg yet\u003C/p\u003E\n"}]}