{"TopicId":48520,"ForumId":34,"TopicTitle":"[0.90]Kerbal Isp Difficulty Scaler v1.4.2; 12/16/14","CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-10-15T20:55:02Z","PageNum":3,"Articles":[{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-10-17T19:01:54Z","Content":"\n\u003Cp\u003ESorry, spent all my time last night on getting part costs working as read from cfg (for MCE) and then my hard drive started dying. I\u0027ll try to get the MFSC change done today!\u003C/p\u003E\n"},{"CreatedByName":"thorfinn","CreatedById":8349,"CreatedDateTime":"2013-10-17T20:12:53Z","Content":"\n\u003Cp\u003EFerram, this is very interesting and could make me switch to FAR for good, but I would respectfully make a suggestion: why don\u0027t you increase atmospheric density instead of killing Isp?\u003C/p\u003E\u003Cp\u003EWe (well, at least me) got used by now to Kerbin being a planet different from Earth, with its own balance of gravity and aerodynamics losses which is different from what we experience here. All the other planets are also inspired by the Solar System but not really copies. Why not trying to mantain that experience in FAR by embracing the fact that yes, we \u003Cstrong\u003Eare\u003C/strong\u003E flying through pea soup? Kerbin\u0027s atmosphere IS seven times taller than Earth\u0027s in proportion, after all.\u003C/p\u003E\u003Cp\u003EIt would also make spaceplanes comparatively more efficient, which should be good for people like us who install FAR in the first place \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-10-17T21:00:09Z","Content":"\n\u003Cp\u003EWhile I understand the reasoning behind increasing the atmospheric density, I myself have always thought of that as the single worst part of stock KSP The worst of part of rocket launches (for me at least) was always the 10km straight climb, which would come back with that higher atmospheric density; I can\u0027t be the only one who hated it with a passion. Yes, it does add a measure of difficulty to launches by requiring a specific flight path and adding more delta-V requirements, but when the source of the difficulty is so in-your-face obnoxious every single launch you become aware of just how arbitrary it is; a player who is aware that he is fighting through a stupidly thick atmosphere simply so that it is harder to reach orbit isn\u0027t going to have much fun. I switched to MechJeb when it came out solely to get out of doing that boring part of the game and get to the fun space maneuvering. Yes, the nerfed-to-hell Isps are arbitrary, but you don\u0027t spend an entire minute every launch having the lowness of the number mashed into your face like you do with the high density atmosphere.\u003C/p\u003E\u003Cp\u003EThen there are the unintended consequences for FAR users, which would include:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ERockets will flip more easily or go full lawn dart (depending on their stability), depending on how stable the rocket is and how much the engine gimballing can counteract the increased forces; this gets worse with larger rockets that may flex significantly at liftoff and would have to be corrected incredibly quickly.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EPlanes suddenly need a lot less wing to get in the air.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ELarger, quickly varying aerodynamic forces cause really nasty things to happen at higher timewarps / higher velocities, making the simulation less stable and the game less fun.\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EFinally, this doesn\u0027t leave me the option to make the game even more difficult, since I like to make things more difficult.\u003C/p\u003E\u003Cp\u003EWith that in mind, \u003Cstrong\u003Eversion 1.1\u003C/strong\u003E is out, which includes a thrust corrector, making Arcturus Thrust Corrector obsolete. When the thrust corrector is active, engines can either be vac-rated (makes rated thrust in vacuum) or atm-rated (makes rated thrust on the pad); by default engines with unscaled Isps below 385 s \u003Cem\u003Eand\u003C/em\u003E max thrusts above 300 kN will be atm-rated; all others will be vac-rated.\u003C/p\u003E\n"},{"CreatedByName":"CoriW","CreatedById":57866,"CreatedDateTime":"2013-10-17T21:30:45Z","Content":"\n\u003Cp\u003EHey ferram... I know this seems a bit sudden, but I love you. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 alt=\u0022:blush:\u0022\u003E\u003C/p\u003E\u003Cp\u003EI literally cannot play anymore without FAR and now I feel like that\u0027s going to be the same with KIDS as well. Thanks so much for your dedicated work on these plugins.\u003C/p\u003E\u003Cp\u003E(P.S. ~ The 1.1 update looks awesome, thanks for incorporating Thrust Corrector, really happy about that.)\u003C/p\u003E\n"},{"CreatedByName":"Diazo","CreatedById":81549,"CreatedDateTime":"2013-10-18T02:24:02Z","Content":"\n\u003Cp\u003EI have what I believe is a minor bug report on version 1.1 of this mod.\u003C/p\u003E\u003Cp\u003EWhen the VAB is loaded with this mod installed, the log continuously fills with \u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E[EXC 20:18:15.934] NullReferenceException: Object reference not set to an instance of an object\u003C/pre\u003E\u003Cp\u003E errors.\u003C/p\u003E\u003Cp\u003EAs soon as a part is placed in the VAB the errors stop scrolling and everything works as expected as best I can tell.\u003C/p\u003E\u003Cp\u003EI\u0027m assuming there is something being done to vessel parts in the VAB and a simple check for the presence of no parts needs to be added.\u003C/p\u003E\u003Cp\u003EThis does only qualify as an annoyance level bug, but I was working on a mod of my own and noticed the log filling with the errors so I figured I would let you know.\u003C/p\u003E\u003Cp\u003ED.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-18T02:27:24Z\u0022 title=\u002210/18/2013 02:27  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 18, 2013\u003C/time\u003E by Diazo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"velusip","CreatedById":60676,"CreatedDateTime":"2013-10-18T03:26:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003Eversion 1.1\u003C/strong\u003E is out, which includes a thrust corrector, making Arcturus Thrust Corrector obsolete.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u0022Thrust Varies with Isp\u0022\u003C/p\u003E\u003Cp\u003EDoes this option alone yield the effects of Project Arcturus Thrust Corrector? Is there any additional cutoff? Just wondering if it\u0027s worth adding a preset for it.\u003C/p\u003E\u003Cp\u003EGreat mod, Ferram4.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-10-18T05:38:17Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@Diazo: \u003C/strong\u003EFound the bug and squished it; fix will be in next release.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@velusip: \u003C/strong\u003EIt can add the same exact effects as Arcturus Thrust Corrector if you shut off the \u0022Isp Cutoff\u0022 and \u0022Thrust Cutoff\u0022 options, which will cause every engine to produce its rated thrust in vacuum, and less in atmosphere. The cutoffs are simply so you can add some real-world sanity to the function: why would the Mainsail (a heavy lift engine) be rated in vacuum? It would be rated for 1 atm since you\u0027d care more about how much it can lift at takeoff than you would about how it does in space.\u003C/p\u003E\n"},{"CreatedByName":"Spanier","CreatedById":57247,"CreatedDateTime":"2013-10-18T06:24:01Z","Content":"\n\u003Cp\u003EIs this mod compatible with modular fuels? If so I take it. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-10-18T06:37:11Z","Content":"\n\u003Cp\u003ENo(t yet). My old hard drive started dying, so I spent today fixing that (and then having my desktop out of commission as the drive imaged over) rather than adding the support ferram needs, apologies again (and to you, ferram!). I will have it up tomorrow for ferram, and then he can implement the other side on his end.\u003C/p\u003E\n"},{"CreatedByName":"Hodo","CreatedById":78218,"CreatedDateTime":"2013-10-18T06:38:28Z","Content":"\n\u003Cp\u003EIs the thrust corrector working with the B9 SABRE engines? That is the ONLY reason why I quit using the Arcturas version was because of the issues with the SABREs making them near useless for the rocket ability.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-10-18T08:53:54Z","Content":"\n\u003Cp\u003ENot currently; I\u0027ll look into adding support for the B9 SABRE engines when NathanKell gets his updated version of ModuleFuels up. Some legacy ModuleFuels engine code is very similar to the module used by the B9 engines, so I should be able to add support for those at the same time.\u003C/p\u003E\n"},{"CreatedByName":"a.g.","CreatedById":59470,"CreatedDateTime":"2013-10-18T09:11:08Z","Content":"\n\u003Cp\u003EFrom the code it looks like this only preserves two points in the atmospheric curve, but some atmospheric engines actually have more complex curves defined.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-10-18T10:09:29Z","Content":"\n\u003Cp\u003EThat would mess up jet engines... ok. I\u0027ll fix it.\u003C/p\u003E\n"},{"CreatedByName":"MedievalNerd","CreatedById":84735,"CreatedDateTime":"2013-10-18T14:10:04Z","Content":"\n\u003Cp\u003EI\u0027m having the strangest of problems with KIDS... I also use Lazor mod for the external camera part, but I noticed something rather funny. The Lazor Powered interface overlaps with the KIDS interface in the main screen of mission control. (When you see and can select all the buildings.) I tried to look if there were window coordinates in both but the coordinates seem to be hard coded within the plugin, just wondering if there is something that I could do to make this work lol.\u003C/p\u003E\u003Cp\u003EThoughts?\u003C/p\u003E\n"},{"CreatedByName":"TouhouTorpedo","CreatedById":30603,"CreatedDateTime":"2013-10-18T14:59:31Z","Content":"\n\u003Cp\u003ESome things I\u0027m pleased to see fixed here, But I don\u0027t get some people saying \u00221 stage to orbit is just wrong\u0022 It is somewhat feasible with advanced enough engines in real life, and just very large amounts of propellant. The big thing making orbit so much easier in KSP is the fact that the velocity differences for orbit between real life and KSP are so large, and the main thing making them as close as they are is the atmospheric treacle and poor drag modelling that FAR is intended to fix (making it even easier still to get to orbit).\u003C/p\u003E\u003Cp\u003EAs far as making \u0022KSP to real life\u0022 goes, is that just reducing the ISP significantly so you need a lot more fuel or stages?\u003C/p\u003E\n"},{"CreatedByName":"Hodo","CreatedById":78218,"CreatedDateTime":"2013-10-18T16:01:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003ENot currently; I\u0027ll look into adding support for the B9 SABRE engines when NathanKell gets his updated version of ModuleFuels up. Some legacy ModuleFuels engine code is very similar to the module used by the B9 engines, so I should be able to add support for those at the same time.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks, thats good to hear. As soon as thats fixed I may start a new save, install Ioncross, and KIDS... if only the Comm Tech plugin worked perfectly too.\u003C/p\u003E\n"},{"CreatedByName":"a.g.","CreatedById":59470,"CreatedDateTime":"2013-10-18T20:51:26Z","Content":"\n\u003Cp\u003ESpeaking of jet engines, they have huge isp, but it won\u0027t make sense for them to be rated for vacuum. Solid boosters also are used on the low stages, and the default cutoff values seem to ignore the starting level SRB.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-10-18T22:25:16Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@MedievalNerd: \u003C/strong\u003ENoted; I\u0027ll move the button somewhere else, probably the top right corner.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@Touhou: \u003C/strong\u003EThe \u0022to real life\u0022 versions are \u0022realistic\u0022 in the sense that getting from the launch pad to orbit requires realistic amounts of fuel. Since the delta V requirements are so low, it nerfs the Isps so that realistic mass ratios are necessary to reach orbit. Basically, it\u0027s intended to making SSTO possible, but only if you use a ton of fuel to do it.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@a.g.: \u003C/strong\u003EYeah, I set the thrust cutoff to 300kN by default rather than 200kN like I intended; that\u0027s been fixed in my build now. I also successfully fixed the \u0022losing Isp data\u0022 problem, but it may fail on modded engines with absurdly complicated Isp curves, primarily because I can\u0027t access the actual points in a FloatCurve (which is very frustrating) so I have to use a limited number of points to avoid swallowing RAM like crazy. Also, jet engines won\u0027t be thrust-corrected, since it results in dramatic changes in thrust that don\u0027t seem to make any logical sense (at least to me; I don\u0027t think that engine thrust should double because you went up a few km).\u003C/p\u003E\n"},{"CreatedByName":"EuSouONumero345","CreatedById":40840,"CreatedDateTime":"2013-10-19T01:31:59Z","Content":"\n\u003Cp\u003EKIDS: Kerbal Isp Difficulty Scaler\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-10-19T01:45:35Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EVersion 1.2\u003C/strong\u003E is out, which moves the button to the top right corner of the space center screen so it doesn\u0027t conflict with Lazor, accounts for more-complex-than-stock-rocket-engine Isp curves, exempts jet engines from the thrust corrector for balance reasons, and tweaks the default presets.\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-10-19T03:10:00Z","Content":"\n\u003Cp\u003EHey ferram, I\u0027m finally up and running with .22 and a new hard drive.\u003C/p\u003E\u003Cp\u003EBut now that you\u0027re sampling over a bunch of points...why not just do \u003C/p\u003E\u003Cp\u003EConfigNode temp;\u003C/p\u003E\u003Cp\u003Ee.atmosphereCurve.Save(temp)\u003C/p\u003E\u003Cp\u003Eand then pull the keys from the node? Change them in-place and do e.atmosphereCurve.Load(temp)\u003C/p\u003E\u003Cp\u003ELet\u0027s say you have a function correctKeys(), even. This will help.\u003C/p\u003E\u003Cp\u003EAs to handling integration, here\u0027s my idea. I looked again, and I _think_ you can actually do it all on your end.\u003C/p\u003E\u003Cp\u003Epublic static Dictionary\u0026lt;string, List\u0026lt;FloatCurve\u0026gt;\u0026gt; TLTIsps;\u003C/p\u003E\u003Cp\u003EIt was private, is now public. You can change all the floatcurves in it however you want.\u003C/p\u003E\u003Cp\u003EAs I gradually make all engines use this system, that will work for everything. But just to be sure you also get the ones I haven\u0027t hit yet, check for modules[whatever] field public List\u0026lt;ConfigNode\u0026gt; configs. Trawl through that to find all atmosphereCurve nodes and do correctKeys(). That will handle any ModuleEngineConfigs or ModuleHybridEngine that aren\u0027t using my techlevel system yet.\u003C/p\u003E\u003Cp\u003EFinally, to deal with ModuleHybridEngines, instead of a List\u0026lt;\u0026gt; you just have two ConfigNodes:\u003C/p\u003E\u003Cp\u003Epublic ConfigNode primaryEngine;\u003C/p\u003E\u003Cp\u003Eand secondaryEngine.\u003C/p\u003E\u003Cp\u003EIn any of these three cases, you need to not touch thrust; MFSC also has thrust correcting, and because I detect vac- or atmo-rating based on a field engineType, I\u0027d rather not have KIDS guessing how to correct it and override. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ENow, if you still want me to add extra stuff I\u0027m _way_ more than happy to (I owe you big for FAR!), just say the word; but you expressed an interest in doing at your end so I offer this explanation above. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-19T03:12:01Z\u0022 title=\u002210/19/2013 03:12  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 19, 2013\u003C/time\u003E by NathanKell\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-10-19T04:47:19Z","Content":"\n\u003Cp\u003EYeah, that would work. I\u0027ll switch the Isp adjustment system over to using a \u0022CorrectKeys()\u0022 method and I\u0027ll look into trying to get MFSC to work. I already have an exception to the thrust corrector for jet engines, so it shouldn\u0027t be difficult to rig it up to handle MFSC engines as well. I\u0027ll look into adding it tomorrow.\u003C/p\u003E\n"},{"CreatedByName":"MAKC","CreatedById":57186,"CreatedDateTime":"2013-10-20T17:50:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003ERaw reduces Isp so that a rocket that makes 9 km/s with stock will make 4.5 km/s, allowing it to just barely reach orbit. If that was enough to account for the differences between KSP and real life, that would be it. However, there are hidden complications:\u003Cp\u003EThere\u0027s a ratio that isn\u0027t often talked about in KSP, called the \u003Cem\u003Estructure ratio\u003C/em\u003E which is the fraction of the booster (note: no payload here) that is not fuel; this is the tank\u0027s dry mass, engine mass, decouplers, fins, separatrons, etc; the higher the number is, the less dV you can get out of the rocket. For math reference, the rocket equation, written in terms of structure ratio and another ratio, the \u003Cem\u003Epayload ratio\u003C/em\u003E, is:\u003C/p\u003E\u003Cp\u003EdV = Isp * g0 * ln((1 \u002B p) / (e \u002B p))\u003C/p\u003E\u003Cp\u003Ep = m_payload / (m_structure \u002B m_fuel) -- payload ratio; ratio of payload mass to mass of entire booster\u003C/p\u003E\u003Cp\u003Ee = m_structure / (m_structure \u002B m_fuel) -- structure ratio; ratio of structure mass to mass of entire booster\u003C/p\u003E\u003Cp\u003EIn real life, it\u0027s not \u003Cem\u003Etoo\u003C/em\u003E difficult to get structure ratio down to 0.1; the best I\u0027ve found is the Saturn V first stage, which was just under 0.06.\u003C/p\u003E\u003Cp\u003EIn KSP, the lowest structure ratio possible is 0.1111111... assuming that your rocket is all fuel tanks and the engine weighs nothing; for it to practical it has to at least have a TWR of 1 on Kerbin, and the lowest you can get that is ~0.14666666... which is a Mainsail pushing nothing but fuel tanks, no decouplers on top, no payload (read: totally useless as a booster), which puts a rather high lower limit on the structure ratio in KSP.\u003C/p\u003E\u003Cp\u003ESo the Adjusted preset tries to finagle away the obvious differences in dV that will result from a booster that has a structure ratio of 0.1 and one that has a structure ratio of 0.146666.... with a payload ratio of 0.05. Of course, this is technically wrong, since it\u0027s trying to use a single linear factor to account for a nonlinear difference, but it\u0027s close enough for Kerbal engineering.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ETL;DR: \u003C/strong\u003EKSP rockets are less fuel by percent mass than real life rockets, making them less efficient; Raw doesn\u0027t try to fix it, Adjusted tries to finagle the difference away.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat would be a realistic fuel tank fuel mass to dry mass ratio for KSP? Do you know?\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-10-20T19:04:35Z","Content":"\n\u003Cp\u003EIf memory serves, engine mass should be reduced to 1/6th what it is, and tank mass reduced to 1/3.\u003C/p\u003E\u003Cp\u003EAlso, ferram, for \u0022raw real\u0022 I support a vac Isp multiplier of 0.3333; that leads to realistic mass ratio requirements for Mun, Duna, and Jool (as Jupiter) transfers (since those in RL are approx 3x the dV requirement).\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-10-20T22:40:01Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@MAKC: \u003C/strong\u003EGo with NathanKell\u0027s numbers, I think. That should be close enough.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@NathanKell: \u003C/strong\u003EI\u0027m tempted to do that, but then we\u0027ll get the fun of rockets that will have similar Isp at the surface and in vacuum, so that might be a problem (particularly for aerospikes). I can do some math out and see if I can find a scalar that makes sense in the context that Isps in atmosphere should be lower than in vacuum by a noticeable amount.\u003C/p\u003E\n"}]}