{"TopicId":49950,"ForumId":34,"TopicTitle":"[1.2] VOID 1.1.0-beta - Vessel Orbital Informational Display","CreatedByName":"toadicus","CreatedById":67745,"CreatedDateTime":"2013-10-21T22:30:43Z","PageNum":21,"Articles":[{"CreatedByName":"Drew Kerman","CreatedById":103177,"CreatedDateTime":"2015-10-04T02:18:40Z","Content":"\n\u003Cp\u003ERrrrgh a day after a new release... don\u0027t kill me... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E It just happened to be today I finally started to define requirements for my upgraded telemetry streaming system for my flight tracker site. Could inclination, thrust and throttle be added to the logger? It\u0027s been a while since I launched anything to use it but will be doing so again \u003Ca href=\u0022http://www.kerbalspace.agency/Flights/craft.asp?db=dtp\u0022 rel=\u0022external nofollow\u0022\u003Esoon\u003C/a\u003E!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-04T02:27:28Z\u0022 title=\u002210/04/2015 02:27  AM\u0022 data-short=\u00228 yr\u0022\u003EOctober 4, 2015\u003C/time\u003E by Gaiiden\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"toadicus","CreatedById":67745,"CreatedDateTime":"2015-10-04T05:06:43Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003EGaiiden\u003C/span\u003E\u003C/strong\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003E, do you want the throttle as fractional (0..1) or percentage (0..100)? Most spreadsheets are handling that all pretty automatically these days, but I figured I\u0027d ask. \u003C/span\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EYou were too slow. Here\u0027s a quick update for you: \u003Ca href=\u0022http://ksp.hawkbats.com/VOID/VOID-latest.zip\u0022 rel=\u0022external nofollow\u0022\u003E[zip]\u003C/a\u003E \u003Ca href=\u0022http://ksp.hawkbats.com/VOID/VOID-latest.tar.gz\u0022 rel=\u0022external nofollow\u0022\u003E[tar.gz]\u003C/a\u003E \u003Ca href=\u0022http://ksp.hawkbats.com/VOID/VOID-latest.tar.xz\u0022 rel=\u0022external nofollow\u0022\u003E[tar.xz]\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI used the percentage, because spreadsheets play really nicely with it these days. If you want fractional I\u0027ll change it. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-04T05:18:30Z\u0022 title=\u002210/04/2015 05:18  AM\u0022 data-short=\u00228 yr\u0022\u003EOctober 4, 2015\u003C/time\u003E by toadicus\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Drew Kerman","CreatedById":103177,"CreatedDateTime":"2015-10-04T08:33:23Z","Content":"\n\u003Cp\u003Edamn you\u0027re quick. Thanks I did a quick test launch and it looks good except for one thing - precision. Some readouts have greater precision than others for some reason. I thought maybe it was because of how I had the readouts setup in the game (where you can change the precision for some) so I made them all read out in high precision but when I checked the log Apoapsis read out to two decimal places only up until 100m and then it was all whole numbers. Altitude consistently reads out to three decimal places but down range distance also reads to two then clamps to whole numbers past 100m. Most read out to three so it would be nice if they all read out to 3 decimal places, if possible. It didn\u0027t really matter to me before, but now I plan to use interpolation to really smooth out the data updating to the page and could use the extra precision.\u003C/p\u003E\n"},{"CreatedByName":"toadicus","CreatedById":67745,"CreatedDateTime":"2015-10-04T14:34:02Z","Content":"\n\u003Cp\u003ESo, the options I have for communicating precision come in two main flavors: fixed and variable floating point. The former lets me say \u0022always show this value to three places\u0022, for example \u00220.123\u0022 and \u0022123456789.123\u0022. The latter is \u003Cem\u003Emostly\u003C/em\u003E like \u0022show me this value to three significant figures\u0022, which would thus show numbers like \u00220.123\u0022, \u00221.23\u0022, \u0022123\u0022 and \u0022123000\u0022. Generally, for numbers that will vary significantly in magnitude, I prefer the latter. But, you\u0027re right that three sigfigs is not enough. How many would you like? Single-precision floats are theoretically good to about 9 digits in this sort of use. Double-precision are good to about 17 digits. I could give you the whole thing every time if you\u0027d like, or anywhere in between.\u003C/p\u003E\u003Cp\u003EUpdate: here\u0027s a quick example mostly using \u0022G9\u0022, or \u00229 sigfigs\u0022, with \u0022F3\u0022 or \u00223 fixed decimal places\u0022 for a few items that can be reasonably expected to stay within a small range: \u003Ca href=\u0022http://hastebin.com/unofayijac.csv\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://hastebin.com/unofayijac.csv\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-04T15:06:16Z\u0022 title=\u002210/04/2015 03:06  PM\u0022 data-short=\u00228 yr\u0022\u003EOctober 4, 2015\u003C/time\u003E by toadicus\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Stone Blue","CreatedById":77721,"CreatedDateTime":"2015-10-04T17:48:21Z","Content":"\n\u003Cp\u003E\nSorry if this is not relevent, but I use the Orbital Info CONSTANTLY....Now that I am exploring further to the edges of Kerbin SOI, I notice some of the distance readings show in different scales... ie Apo will read in km, but Pe will suddenly change from also km to just meters...Kind of annoying when you are talking large distances...Also when the longer number fluctuates the last few digits constantly...Makes it difficult to make small orbital corrections, when before, with only 4 or 5 digits showing, a quick tap on RCS gets me close enough...With the last 12 digits of a 13 digit number fluctuating QUICKLY all over the place, it makes it interesting to say the least... lol\n\u003C/p\u003E\n\u003Cp\u003E\nWould/could this be related to the precision discussion above?\n\u003C/p\u003E\n\u003Cp\u003E\nOh, and this is on .18.3a, not yesterdays update...\n\u003C/p\u003E\n\u003Cp\u003E\nAnd I dont know if I\u0027ve posted before Toadicus, but I LOVE VOID, and have used it for quite awhile...It seems a bit more intuitive the way its set up, so i can have less windows open, yet see (mostly) the same info as KER...Plus, as an amateur player, LESS info can be better than an overwhelming amount, much less when you dont even understand what half of it means...Not a dig on KER, but right now, I like less-is-best... \u003Cimg alt=\u0022:)\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-03-15T21:45:53Z\u0022 title=\u002203/15/2016 09:45  PM\u0022 data-short=\u00228 yr\u0022\u003EMarch 15, 2016\u003C/time\u003E by Stone Blue\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Drew Kerman","CreatedById":103177,"CreatedDateTime":"2015-10-04T21:46:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022toadicus\u0022 data-cite=\u0022toadicus\u0022\u003E\u003Cdiv\u003EUpdate: here\u0027s a quick example mostly using \u0022G9\u0022, or \u00229 sigfigs\u0022, with \u0022F3\u0022 or \u00223 fixed decimal places\u0022 for a few items that can be reasonably expected to stay within a small range: \u003Ca href=\u0022http://hastebin.com/unofayijac.csv\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://hastebin.com/unofayijac.csv\u003C/a\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh yea, that looks nice. What happened to Lat/Lng though? That used to be written out to G9 and now it\u0027s only showing to 3 in the example you gave.\u003C/p\u003E\n"},{"CreatedByName":"toadicus","CreatedById":67745,"CreatedDateTime":"2015-10-08T03:12:55Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EStone Blue\u003C/strong\u003E, that\u0027s not specifically related to the conversation at hand, but you still don\u0027t need to be sorry for asking. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E That said, similar to the data logger conversation, precision for those fields is specified in significant figures (more or less), so you don\u0027t tell it \u0022give the number in kilometers\u0022, you tell it \u0022give me the 2/5/8/11 most significant digits using the prefix needs the fewest filler zeroes\u0022 (or something like that; the description isn\u0027t perfect). So if you\u0027ve asked for 8 sigfigs and your apoapsis altitude is 1,234,567,890, it will calculate that it should divide the value by 1,000,000 and show you 1,234.5678 Gm (I think; . If you pull your apoapsis down to 987,654,321 m, the same setting will determine that it should divide the value by 1,000 and show you 987,654.32 km. This is intentional and is intended to reflect your preference for seeing a bunch of numbers before the decimal point, or just a few, as relevant. In general I try to put as few numbers after the decimal point as possible in each case.\u003C/p\u003E\u003Cp\u003EAs to the twitchy numbers, there\u0027s not much I can do about that. If you\u0027re in a highly eccentric orbit looking at your periapsis of about 1,000,000 m, with a sigfig setting of 11, it will generally show you the raw value in meters. Because Squad\u0027s integrator doesn\u0027t handle the edge cases for eccentricity (meaning very circular or very elliptical orbits) very gracefully, the value will be very twitchy. Theoretically I could smooth that myself with a rolling average or something similar, but I\u0027m not sure it\u0027s worth the overhead. Open to thoughts on that, though.\u003C/p\u003E\u003Cp\u003EGlad you\u0027re enjoying the mod! I enjoy making it and love that I get to share. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EGaiiden\u003C/strong\u003E, Lat/Lon were previously entirely unformatted; I made them F3 because the magnitude is known (always within 0-3 orders of magnitude), and the sort of instrument that measures it would not really be subject to loss of precision as the magnitude varies. But, since one arcsecond (around 30.87 meters on Earth\u0027s equator, so less on Kerbin) is 0.00027~ degrees, I should probably go down to at least F4. What\u0027s your preference?\u003C/p\u003E\n"},{"CreatedByName":"Drew Kerman","CreatedById":103177,"CreatedDateTime":"2015-10-08T04:56:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022toadicus\u0022 data-cite=\u0022toadicus\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003EGaiiden\u003C/strong\u003E, Lat/Lon were previously entirely unformatted; I made them F3 because the magnitude is known (always within 0-3 orders of magnitude), and the sort of instrument that measures it would not really be subject to loss of precision as the magnitude varies. But, since one arcsecond (around 30.87 meters on Earth\u0027s equator, so less on Kerbin) is 0.00027~ degrees, I should probably go down to at least F4. What\u0027s your preference?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEverything gets plotted on a map like \u003Ca href=\u0022http://www.kerbalmaps.com/\u0022 rel=\u0022external nofollow\u0022\u003EKerbalMaps\u003C/a\u003E, and it can take a full float integer like you would find in the SFS file so I liked having the unformatted lat/lon values. But if you want to cap them then at least F4 since that is what the cursor location data shows for the map\u003C/p\u003E\n"},{"CreatedByName":"toadicus","CreatedById":67745,"CreatedDateTime":"2015-10-17T23:07:18Z","Content":"\n\u003Cp\u003EHere ya go, Gaiiden; up to F5.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://ksp.hawkbats.com/VOID/VOID-dev.zip\u0022 rel=\u0022external nofollow\u0022\u003E[zip]\u003C/a\u003E \u003Ca href=\u0022http://ksp.hawkbats.com/VOID/VOID-dev.tar.gz\u0022 rel=\u0022external nofollow\u0022\u003E[tar.gz]\u003C/a\u003E \u003Ca href=\u0022http://ksp.hawkbats.com/VOID/VOID-dev.tar.xz\u0022 rel=\u0022external nofollow\u0022\u003E[tar.xz]\u003C/a\u003E \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Thorbane","CreatedById":76234,"CreatedDateTime":"2015-10-22T12:04:58Z","Content":"\n\u003Cp\u003EThe transaction log causes my game to pause for 10 minutes or so when it tries to load it.\u003C/p\u003E\u003Cp\u003EAlso I have a bazillion CURRENCY_TRANSACTION\u0027s with reason = VesselRollout. These are from VOID right? And is there a way to turn them off?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-22T12:26:31Z\u0022 title=\u002210/22/2015 12:26  PM\u0022 data-short=\u00228 yr\u0022\u003EOctober 22, 2015\u003C/time\u003E by Thorbane\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Drew Kerman","CreatedById":103177,"CreatedDateTime":"2015-11-01T01:49:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022toadicus\u0022 data-cite=\u0022toadicus\u0022\u003E\u003Cdiv\u003EHere ya go, Gaiiden; up to F5.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOne issue I hope you don\u0027t mind addressing:\u003C/p\u003E\u003Cp\u003ECan you change your logging interval pause to ensure that the data is logged at the \u003Cem\u003Estart\u003C/em\u003E of each interval rather than add the interval to the end of the last logged data time? To make it clearer what I mean, see \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/entries/3772-kOS-Logging-Data-Not-as-Simple-as-it-seems\u0022 rel=\u0022external nofollow\u0022\u003Ethis blog post\u003C/a\u003E I made. I was originally doing the same thing you are. This way outputs a consistent UT value interval that can be used as database keys\u003C/p\u003E\u003Cp\u003EAlso I don\u0027t know if it was intentional but Inclination now outputs only to two places whereas I have earlier log data versions showing it output to 3.\u003C/p\u003E\u003Cp\u003EEdit - I just realized doing it my way could potentially pose problems with millisecond intervals? I think a lower limit of the default 0.5s would be okay tho\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-01T02:04:54Z\u0022 title=\u002211/01/2015 02:04  AM\u0022 data-short=\u00228 yr\u0022\u003ENovember 1, 2015\u003C/time\u003E by Gaiiden\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"toadicus","CreatedById":67745,"CreatedDateTime":"2015-11-02T21:01:33Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EGaiiden\u003C/strong\u003E, I can be a bit more intentional about using UT elapsed time for metering the CSV output, but of course ultimately if the frame rates are slower than your desired output rate there\u0027s nothing I can do about it. I\u0027ll look into that once I\u0027ve caught up with 1.0.5 revisions. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Drew Kerman","CreatedById":103177,"CreatedDateTime":"2015-11-03T04:02:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022toadicus\u0022 data-cite=\u0022toadicus\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003EGaiiden\u003C/strong\u003E, I can be a bit more intentional about using UT elapsed time for metering the CSV output, but of course ultimately if the frame rates are slower than your desired output rate there\u0027s nothing I can do about it. I\u0027ll look into that once I\u0027ve caught up with 1.0.5 revisions. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBy frame rate are you actually referring to physics lag? I don\u0027t see how FPS would factor in here. Running the log off the game time, which I do with my kOS script, means that even if the game slows down the log data still outputs at a consistent rate. I\u0027ve already seen this when I play back the log data and watch it run faster than the video capture I took of the launch. That\u0027s okay, the length of the telemetry is still the same as the length of game time the launch took.\u003C/p\u003E\n"},{"CreatedByName":"Drew Kerman","CreatedById":103177,"CreatedDateTime":"2015-11-06T06:28:42Z","Content":"\n\u003Cp\u003EOk so my last request about the logging delay is moot now with the latest release of kOS, so toadicus if you thought it was something that would mainly only serve to make my life easier you can keep things as they are. I can now calculate everything I need via kOS.\u003C/p\u003E\n"},{"CreatedByName":"PhamNuwen","CreatedById":142697,"CreatedDateTime":"2015-11-07T17:54:18Z","Content":"\n\u003Cp\u003EMy heads up display is two columns of text only a couple of pixels wide extending allmost all the way to the bottom of the screen, instead of the other way around.\u003C/p\u003E\n"},{"CreatedByName":"toadicus","CreatedById":67745,"CreatedDateTime":"2015-11-07T18:07:33Z","Content":"\n\u003Cp\u003ETry using the HUD position reset in the VOID configuration menu. If that doesn\u0027t fix it, get me enough information to duplicate the bug myself (at least version info, other mods installed, and the output log).\u003C/p\u003E\n"},{"CreatedByName":"toadicus","CreatedById":67745,"CreatedDateTime":"2015-11-10T08:30:42Z","Content":"\n\u003Cp\u003EVOID has been updated to version 0.18.5! This version catches the rest of us up on Gaiiden\u0027s CSV updates, and is recompiled for KSP 1.0.5.\u003C/p\u003E\u003Cp\u003ECHANGELOG:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003Ev.0.18.5 [2015-11-10]\u003Cbr\u003E* VOID_DataLogger: Added orbital inclination, current thrust, and main throttle data items.\u003Cbr\u003E* Recompiled for 1.0.5\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"Tolos","CreatedById":71722,"CreatedDateTime":"2015-11-14T02:44:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022toadicus\u0022 data-cite=\u0022toadicus\u0022\u003E\u003Cdiv\u003EVOID has been updated to version 0.18.5! This version catches the rest of us up on Gaiiden\u0027s CSV updates, and is recompiled for KSP 1.0.5.\u003Cp\u003ECHANGELOG:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003Ev.0.18.5 [2015-11-10]\u003Cbr\u003E* VOID_DataLogger: Added orbital inclination, current thrust, and main throttle data items.\u003Cbr\u003E* Recompiled for 1.0.5\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHope you don\u0027t mind, I found a small issue in VOID_EditorHUD.cs. You missed a space in the delta-v readout for the Editor Hud. Below is the \u0027fixed\u0027 code...\u003C/p\u003E\u003Cp\u003Eorignal code:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003EhudString.Append(\u0022Bottom Stage Delta-V\u0022);\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Efix\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003EhudString.Append(\u0022Bottom Stage Delta-V: \u0022);\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"toadicus","CreatedById":67745,"CreatedDateTime":"2015-11-17T23:33:10Z","Content":"\n\u003Cp\u003E\nThanks \u003Cstrong\u003ETolos\u003C/strong\u003E! I\u0027ve \u003Ca href=\u0022https://github.com/toadicus/VOID/commit/9983faea\u0022\u003Egot that sorted\u003C/a\u003E now; it\u0027ll be in the next release. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-12-01T16:03:34Z\u0022 title=\u002212/01/2015 04:03  PM\u0022 data-short=\u00228 yr\u0022\u003EDecember 1, 2015\u003C/time\u003E by toadicus\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"PhamNuwen","CreatedById":142697,"CreatedDateTime":"2015-12-06T15:17:46Z","Content":"\n\u003Cp\u003E\nFound what was causing my problems, I was using an ancient version of the Toolbar.\n\u003C/p\u003E\n"},{"CreatedByName":"mielgato","CreatedById":113298,"CreatedDateTime":"2016-01-31T16:26:23Z","Content":"\n\u003Cp\u003E\nHi, I\u0027ve noticed that when using airbreathing engines, VOID (and Kerbal Engineer Redux for that matter) does not show TWR and D/V either in editor and flight. Even after correcting\n\u003C/p\u003E\n\u003Cpre class=\u0022ipsCode\u0022\u003E\nhudString.Append(\u0022Bottom Stage Delta-V\u0022)\u003C/pre\u003E\n\u003Cp\u003E\nIDK what\u0027s the trouble, I verified KSP\u0027s cache but nope, it don\u0027t want to show. And I wont put my nose in the code, this is chinese to me \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nedit : NVM, I just downloaded KER for 1.0.5 (was using 1.0.4 one) and the latest shows twr and d/v for jet engines, it\u0027s only a VOID thing ?... any hint ? (pretty sure VOID is up to date)\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-01-31T16:45:05Z\u0022 title=\u002201/31/2016 04:45  PM\u0022 data-short=\u00228 yr\u0022\u003EJanuary 31, 2016\u003C/time\u003E by mielgato\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"gamerscircle","CreatedById":151261,"CreatedDateTime":"2016-02-01T20:54:45Z","Content":"\n\u003Cp\u003E\nI have most likely an stupid question, I saw this:\u003Cbr\u003E\u003Ca href=\u0022http://imgur.com/a/24yeB\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/24yeB\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nWhich I think, is showing how I can take some of my currently drifting satellites and using VOID reduce thier drift.. for kind of ever?  Is this true?  and they don\u0027t have to be in a synchronous orbit, just circular?\n\u003C/p\u003E\n"},{"CreatedByName":"Stone Blue","CreatedById":77721,"CreatedDateTime":"2016-02-02T00:43:24Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/151261-gamerscircle/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022151261\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/151261-gamerscircle/\u0022\u003E@gamerscircle\u003C/a\u003E Ummm... that doesnt seem to be a really efficient way to do it...???  Yes, VOID is an EXCELLENT tool for getting the data you need, but other than that VOID doesnt actually do anything... And you\n\u003C/p\u003E\n"},{"CreatedByName":"toadicus","CreatedById":67745,"CreatedDateTime":"2016-02-02T19:05:33Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/113298-mielgato/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022113298\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/113298-mielgato/\u0022\u003E@mielgato\u003C/a\u003E, I license KER\u0027s simulation code to do all my engineering calcs, so any deficiency in their code will be duplicated here.  I also necessarily lag behind a bit on their latest fixes; I\u0027ll update my VesselSimulator code and get an update out soon. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/151261-gamerscircle/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022151261\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/151261-gamerscircle/\u0022\u003E@gamerscircle\u003C/a\u003E, it\u0027s true that synchronizing orbits requires only the SMA to match.  If the orbits are not perfectly circular then from the perspective of one satellite the others will appear to \u0022librate\u0022 in the sky, but their relative positions will generally be consistent.  As \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/77721-stone-blue/\u0026amp;do=hovercard\u0022 data-mentionid=\u002277721\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/77721-stone-blue/\u0022\u003E@Stone Blue\u003C/a\u003E said, VOID doesn\u0027t actually do anything for you there except show you the SMA as precisely as you need to see it... but that\u0027s very important for building constellations!\n\u003C/p\u003E\n"},{"CreatedByName":"Stone Blue","CreatedById":77721,"CreatedDateTime":"2016-03-15T21:53:18Z","Content":"\n\u003Cp\u003E\nHuh... Not sure how my last post got cut off, or what I was saying, now... lol\u003Cbr\u003E\u003Cbr\u003E\nAnyway, I have a new issue...\u003Cbr\u003E\u003Cbr\u003E\nFor some reason the Vessel Register does not seem to work (its always blank), and hence the bottom half of the Rendevous display doesnt display anything, even though I DO have a target selected, and many craft in flight... This has been going on for me for awhile, thru different modded installs, so I\u0027m inclined to believe it may be VOID specific... Also, I know it was working for me in 1.0.4... Not sure if this started happening with 1.0.5 itself, or a recent release of VOID...\u003Cbr\u003E\u003Cbr\u003E\nAnyone else seeing this?\u003Cbr\u003E\u003Cbr\u003E\nI cant get into my game right now, but I may post screenshots later...\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-03-15T21:54:12Z\u0022 title=\u002203/15/2016 09:54  PM\u0022 data-short=\u00228 yr\u0022\u003EMarch 15, 2016\u003C/time\u003E by Stone Blue\u003C/strong\u003E\n\u003C/span\u003E\n"}]}