{"TopicId":50911,"ForumId":34,"TopicTitle":"[1.3] Kerbal Joint Reinforcement v3.3.3 7/24/17","CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-10-28T08:04:32Z","PageNum":12,"Articles":[{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-11-09T20:23:28Z","Content":"\n\u003Cp\u003EAlright, \u003Cstrong\u003Eversion 1.4\u003C/strong\u003E is up, which should hopefully fix most of the wobble people were having between parts of very different sizes. If not, there\u0027s always the config.xml to play with to see if that helps.\u003C/p\u003E\n"},{"CreatedByName":"anarkhon","CreatedById":22469,"CreatedDateTime":"2013-11-09T23:00:15Z","Content":"\n\u003Cp\u003EBugreport:\u003C/p\u003E\u003Cp\u003EAfter docking:\u003C/p\u003E\u003Cp\u003ENullReferenceException: Object reference not set to an instance of an object\u003C/p\u003E\u003Cp\u003E at KerbalJointReinforcement.KerbalJointReinforcement.UpdatePartJoint (.Part p) [0x00000] in \u0026lt;filename unknown\u0026gt;:0 \u003C/p\u003E\u003Cp\u003E at KerbalJointReinforcement.KerbalJointReinforcement.FixedUpdate () [0x00000] in \u0026lt;filename unknown\u0026gt;:0 \u003C/p\u003E\u003Cp\u003E(Filename: Line: -1)\u003C/p\u003E\u003Cp\u003ENullReferenceException: Object reference not set to an instance of an object\u003C/p\u003E\u003Cp\u003E at KerbalJointReinforcement.KerbalJointReinforcement.UpdatePartJoint (.Part p) [0x00000] in \u0026lt;filename unknown\u0026gt;:0 \u003C/p\u003E\u003Cp\u003E at KerbalJointReinforcement.KerbalJointReinforcement.FixedUpdate () [0x00000] in \u0026lt;filename unknown\u0026gt;:0 \u003C/p\u003E\u003Cp\u003E(Filename: Line: -1)\u003C/p\u003E\u003Cp\u003E..\u003C/p\u003E\u003Cp\u003E..\u003C/p\u003E\u003Cp\u003E..\u003C/p\u003E\u003Cp\u003Espamming the console and slowing the game \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-11-09T23:38:47Z","Content":"\n\u003Cp\u003EA.g. pointed that issue out to me shortly after I released v1.4; the \u003Cstrong\u003Ev1.4.1 hotfix\u003C/strong\u003E is up to fix that error, as well as an error where the max force a joint could apply was not handled properly.\u003C/p\u003E\n"},{"CreatedByName":"Surefoot","CreatedById":89084,"CreatedDateTime":"2013-11-10T01:48:48Z","Content":"\n\u003Cp\u003EJust installed the 1.4.1, i was working on a new engine block for a super-heavy tanker, with 1.3 it was turning itself into a black hole and then kessler bomb due to its own gravity (or due to the kraken), now it stays together \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E Yay 488t engine block in orbit, with almost no strut... I\u0027ll test radial stuff and my Laythe jet again tomorrow, now time for some sleep.\u003C/p\u003E\u003Cp\u003EHere it is:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/KtL16Rm.jpg\u0022 alt=\u0022KtL16Rm.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI had a weird failure with 1.3 on the launch pad, i\u0027ll try again tomorrow if i can reproduce it with 1.4.1, since it seems the radial attachments are fixed now...\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-11-10T01:56:40Z","Content":"\n\u003Cp\u003EI\u0027ve still managed to summon the joint-Kraken with some of those radial attachments, so I don\u0027t consider it solved by any means. Go for a radial attachment with a lot of mass on the end of a long moment arm and you\u0027ll see it happen.\u003C/p\u003E\n"},{"CreatedByName":"TG_bigboss","CreatedById":24189,"CreatedDateTime":"2013-11-10T02:07:41Z","Content":"\n\u003Cp\u003EAwesome, thanks for the update! All we need now is the plugin to make the rocket one part to even further reduce the part count sorta like the weild plugin and ksp will be almost lag free till 0.23 =)!\u003C/p\u003E\n"},{"CreatedByName":"Galacticruler","CreatedById":58398,"CreatedDateTime":"2013-11-10T02:15:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TG_bigboss\u0022 data-cite=\u0022TG_bigboss\u0022\u003E\u003Cdiv\u003EAwesome, thanks for the update! All we need now is the plugin to make the rocket one part to even further reduce the part count sorta like the weild plugin and ksp will be almost lag free till 0.23 =)!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ethis would be a VERY bad idea.\u003C/p\u003E\u003Cp\u003EI\u0027ll not go into detail, it has been explained before.\u003C/p\u003E\n"},{"CreatedByName":"TG_bigboss","CreatedById":24189,"CreatedDateTime":"2013-11-10T04:03:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Galacticruler\u0022 data-cite=\u0022Galacticruler\u0022\u003E\u003Cdiv\u003Ethis would be a VERY bad idea.\u003Cp\u003EI\u0027ll not go into detail, it has been explained before.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EToo bad. I mean more for Space stations really. Because making huge ones creates so much lag. I might have to just remake my current one now that i have this plugin installed.\u003C/p\u003E\n"},{"CreatedByName":"SFJackBauer","CreatedById":82269,"CreatedDateTime":"2013-11-10T04:40:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TG_bigboss\u0022 data-cite=\u0022TG_bigboss\u0022\u003E\u003Cdiv\u003EToo bad. I mean more for Space stations really. Because making huge ones creates so much lag. I might have to just remake my current one now that i have this plugin installed.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhy remake? The plugin acts on existing vessels as well, no need to destroy and re-create the station.\u003C/p\u003E\n"},{"CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2013-11-10T05:43:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TG_bigboss\u0022 data-cite=\u0022TG_bigboss\u0022\u003E\u003Cdiv\u003EAwesome, thanks for the update! All we need now is the plugin to make the rocket one part to even further reduce the part count sorta like the weild plugin and ksp will be almost lag free till 0.23 =)!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESuch exists, but you can\u0027t make the entire rocket one part.\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/t_3BxnxSOz4?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"a.g.","CreatedById":59470,"CreatedDateTime":"2013-11-10T06:13:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003EI\u0027ve still managed to summon the joint-Kraken with some of those radial attachments, so I don\u0027t consider it solved by any means. Go for a radial attachment with a lot of mass on the end of a long moment arm and you\u0027ll see it happen.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve seen that reported as a problem with stock as well somewhere in the support forum, and could reproduce it myself, so it might be some problem with the physics engine itself. One thing I noticed when observing it in slow motion at that time was that the wobble appeared to start with some of the heavy tanks twisting around the truss used to attach them, so the root of the problem may be in the angular motion. The Dynamic Warp mod is useful for observing how things happen frame by frame. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-11-10T07:24:34Z","Content":"\n\u003Cp\u003ETwo issues to report: 1, and I keep forgetting to say this so you may have fixed something else to undo this, but: time acceleration of 10 million in a medium Kerbin orbit leads to an explosion on going off rails when KJR is enabled. (RSS, obviously; replicate by setting max warp in the cfg to 10m). I have it set to 6 now which should be safe, so it\u0027s not a big issue.\u003C/p\u003E\u003Cp\u003E2. Per the Saturn IB I just shows shots of the in RSS thread, I rescaled the Mk1 pod to 4m width, and made a copy of the 2.5m heatshield rescaled to 4m width. Every time I launch with KJR, there\u0027s a structural failure between the heat shield and the pod; when I revert to non-KJR the rocket holds together! Weird.\u003C/p\u003E\u003Cp\u003EI\u0027ll post the stuff you\u0027ll need to replicate on the RSS thread.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-11-10T07:40:31Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@a.g.: \u003C/strong\u003EIt\u0027s a known issue with working with discrete-time simulations. Basically, if the timestep isn\u0027t small enough the error in the simulation can add energy faster than the damper in the joint can remove it. The problem is that making the damper too strong can lead to things shaking themselves apart due to floating point errors.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@NathanKell: \u003C/strong\u003EIssue 1 sounds weird... how quickly does the game end up scaling down from 10 million, is it instantaneous or does it ramp? It might just be that physics is activating before the timewarp is \u0022completed\u0022 and so things are breaking like they did in stock KSP a few versions ago. Does first coming down to a slower speed, then dropping out of timewarp fix it?\u003C/p\u003E\u003Cp\u003EWith Issue 2, I\u0027m gonna guess two other things are going on here: one is that you\u0027ve got stretchy tanks installed for that Saturn IB; it seems like the huge masses and sizes of the stretchy tank parts causes lots of problems with whatever they\u0027re connected to. The second thing is that the launch clamps jump on load when this happens; it seems like RSS exacerbates a current issue with the clamps where they shift a little bit on load; it\u0027s somewhat intermittent though, so I don\u0027t know exactly what causes the shift to occur.\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-11-10T08:43:20Z","Content":"\n\u003Cp\u003E1. Nope, that was what we tried: go down in stages, using the built-in lerping between warps. The collisions were weird--it said collided with launchpad, despite being in orbit!\u003C/p\u003E\u003Cp\u003E2. See the latest post in the RSS thread for the craft file, apologies for delay. I tried it first without struts between pod and heatshield, then with. Finally, removing the struts again, I get about a 25% success rate on load to pad, and then another failure chance on first stage event. Note that with the struts it\u0027s quite solid without KJR, which is very strange; that\u0027s why I mention the issue. I know ST has issues, but they\u0027re usually worse on stock.\u003C/p\u003E\u003Cp\u003EI absolutely don\u0027t use launch clamps; I know better. :]\u003C/p\u003E\n"},{"CreatedByName":"egreSS","CreatedById":75821,"CreatedDateTime":"2013-11-10T13:12:51Z","Content":"\n\u003Cp\u003EAwesome work, this is fried gold for my 3.75 rockets.\u003C/p\u003E\u003Cp\u003EOne question on linear vs angular joint limits: \u003C/p\u003E\u003Cp\u003EWhen exactly does each come into play?\u003C/p\u003E\u003Cp\u003Ei.e. Is linear exclusive to node-to-node connections whereas angular is to radial connections?\u003C/p\u003E\u003Cp\u003EAlso on node-to-node connections:\u003C/p\u003E\u003Cp\u003EDoes 1 connection == 1 joint?\u003C/p\u003E\n"},{"CreatedByName":"a.g.","CreatedById":59470,"CreatedDateTime":"2013-11-10T13:19:04Z","Content":"\n\u003Cp\u003ELinear is movement, angular is rotation. And yes, except for decoupler and launch clamp reinforcement, it just replaces stock connection joints with custom configured ones.\u003C/p\u003E\n"},{"CreatedByName":"egreSS","CreatedById":75821,"CreatedDateTime":"2013-11-10T13:48:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022a.g.\u0022 data-cite=\u0022a.g.\u0022\u003E\u003Cdiv\u003ELinear is movement, angular is rotation. And yes, except for decoupler and launch clamp reinforcement, it just replaces stock connection joints with custom configured ones.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks, so now in theory I should be able to increase linBounce which will allow joints to survive the occasional failure caused by rapid oscillations during unpack/physics load.\u003C/p\u003E\u003Cp\u003ENow what about oscillations in flight? You would think to increase linDamp but the description says it equates to strength? Also paradoxically, the description for linSpring says it equates to stiffness. o_O\u003C/p\u003E\n"},{"CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2013-11-10T18:43:54Z","Content":"\n\u003Cp\u003EAnyone tried undocking with the latest version?? Just added a bit to my main station and cant undock my salvage ship. Further testing and I cant seem to undock any docking ports once connected. Only thing the log shows is a single NullRefEx each time \u0027undock\u0027 button in context menu is selected.\u003C/p\u003E\u003Cp\u003EI am using FusTek cbm if that matters.\u003C/p\u003E\n"},{"CreatedByName":"NicoH","CreatedById":66692,"CreatedDateTime":"2013-11-10T19:29:42Z","Content":"\n\u003Cp\u003EI loaded my station and I can undock all of my docking ports.\u003C/p\u003E\n"},{"CreatedByName":"Surefoot","CreatedById":89084,"CreatedDateTime":"2013-11-10T19:42:55Z","Content":"\n\u003Cp\u003E@a.g., Ferram: i posted a stock craft that exhibits the \u0022infinite-expanding-wobble-then-kraken\u0022 issue a little while ago, i\u0027ll try it with the new version to see how it has evolved.\u003C/p\u003E\u003Cp\u003EAlso:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/NsrfXOg.jpg\u0022 alt=\u0022NsrfXOg.jpg\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/P7fRfiH.jpg\u0022 alt=\u0022P7fRfiH.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis one krakenized itself on the launch pad, before i could do anything. Then the core (about 250t itself, not really light) went up floating in the breeze, like a balloon !! That was both weird and hilarious. I think i found another way to break the physics engine \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E@KhaosCorp: you are victim of the undocking bug. It\u0027s not related to this plugin, but to the stock game itself. I really hope the devs can fix it in v0.23.. in the mean time the only way is to undock whatever main section contains the faulty dock, separate it, then re-dock what you need redocked. Or edit your save file by hand with a rather complicated procedure (especially if you have many parts).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-10T19:46:23Z\u0022 title=\u002211/10/2013 07:46  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 10, 2013\u003C/time\u003E by Surefoot\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-11-10T19:55:28Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@NathanKell: \u003C/strong\u003EAlright, I\u0027ll look into both. No doubt I\u0027ve caused something stupid to happen.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@egreeSS: \u003C/strong\u003ElinSpring controls the stiffness of the spring that tries to bring the parts back together\u003C/p\u003E\u003Cp\u003ElinDamp controls the strength of the damper that tries to counteract any movement caused by the spring / outside forces\u003C/p\u003E\u003Cp\u003ElinLimit controls how much wiggle room there is before these particular values kick in\u003C/p\u003E\u003Cp\u003ElinBounce determines whether the joint will \u0022bounce\u0022 off the limit; so if it hits that limit and linBounce = 1, a force will be applied through the joint so that it will instantly go back in the other direction. Don\u0027t increase this, seriously.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@KhaosCorp: \u003C/strong\u003EWhat does the output_log.txt say is the source of the exception? I know that there is a similar issue in stock KSP where docking ports will not undock.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@Surefoot: \u003C/strong\u003ESTOP BREAKING MY MOD! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhat exactly happened? Did it just start to jiggle around and then popped upwards? What\u0027s the output_log.txt say, if anything?\u003C/p\u003E\n"},{"CreatedByName":"Deltac","CreatedById":12493,"CreatedDateTime":"2013-11-10T22:58:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NicoH\u0022 data-cite=\u0022NicoH\u0022\u003E\u003Cdiv\u003EI loaded my station and I can undock all of my docking ports.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGood to know.\u003C/p\u003E\n"},{"CreatedByName":"Surefoot","CreatedById":89084,"CreatedDateTime":"2013-11-10T23:07:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003E@Surefoot: \u003C/strong\u003ESTOP BREAKING MY MOD! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003Cp\u003EWhat exactly happened? Did it just start to jiggle around and then popped upwards? What\u0027s the output_log.txt say, if anything?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E haha sorry i was too busy laughing out that i didnt check the logs, to be honest i\u0027m not even sure it\u0027s related to your mod (for the floating part). And yeah it started to jiggle by itself, then all the parts warped inside out (like there was a sudden black hole in the middle) and it kinda threw the central part up, which then started to float like a balloon. No, i dont take drugs, i promise !\u003C/p\u003E\u003Cp\u003EIt\u0027s a bit late for me now, i\u0027ll see tomorrow if i have time to reduce the problem to a simple mod-less design.\u003C/p\u003E\u003Cp\u003E(edit) the \u0022proof of concept\u0022 radial mount orange tank is still wobbling itself to death on the launchpad (it\u0027s random, sometimes just warping a bit helps). Radially mounted stuff creates weird interactions... My current design is an attempt to avoid the kraken, by using a very heavy, huge core based on 5m parts, but it seems i just opened a new can of worms \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-10T23:28:00Z\u0022 title=\u002211/10/2013 11:28  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 10, 2013\u003C/time\u003E by Surefoot\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2013-11-10T23:45:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Surefoot\u0022 data-cite=\u0022Surefoot\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E@KhaosCorp: you are victim of the undocking bug. It\u0027s not related to this plugin, but to the stock game itself. I really hope the devs can fix it in v0.23.. in the mean time the only way is to undock whatever main section contains the faulty dock, separate it, then re-dock what you need redocked. Or edit your save file by hand with a rather complicated procedure (especially if you have many parts).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh that\u0027s so lame..this thing was supposed to be temp....now its kinda messin up my whole station!...gonna have to rip it off I think.\u003C/p\u003E\u003Cp\u003EWould be nice if Squad put stuff like this in the \u0027Known Issues\u0027 thread...\u003C/p\u003E\n"},{"CreatedByName":"Tassyr","CreatedById":42397,"CreatedDateTime":"2013-11-11T04:39:08Z","Content":"\n\u003Cp\u003EJust loggin in to say thank you. I\u0027ve wanted something like this for a LONG time. I never understood why two metal tanks, welded together to withstand rocket-engine stress levels... would wobble like a table that\u0027s missing a leg. THANK YOU. XD\u003C/p\u003E\n"}]}