{"TopicId":50911,"ForumId":34,"TopicTitle":"[1.3] Kerbal Joint Reinforcement v3.3.3 7/24/17","CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-10-28T08:04:32Z","PageNum":15,"Articles":[{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-12-02T22:44:32Z","Content":"\n\u003Cp\u003EIt actually doesn\u0027t do anything to procedural wings currently due to some order-of-operations issues. Procedural wings seems to rescale the part \u003Cem\u003Eafter\u003C/em\u003E everything loads, which means that this mod misses it completely.\u003C/p\u003E\n"},{"CreatedByName":"pantheis","CreatedById":57108,"CreatedDateTime":"2013-12-03T00:35:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022a.g.\u0022 data-cite=\u0022a.g.\u0022\u003E\u003Cdiv\u003EI only just got around to testing Kerbals in seats, and they are really wobbly. With debug output it\u0027s obvious why: for whatever reason it cannot compute the size, so all strength values end up as zero. A good workaround is to add KerbalEVA to exemptModuleType list.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAh HAH! This is why my kerbals wobble like crazy in the rover I built! Thanks for the work around!\u003C/p\u003E\n"},{"CreatedByName":"B787_300","CreatedById":31055,"CreatedDateTime":"2013-12-03T03:33:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003E, which means that this mod misses it completely.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo is that an issue with FJR or with pWings? Sorta which thread should I go bug about making it work correctly?\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-12-03T04:08:06Z","Content":"\n\u003Cp\u003ECurrently, that\u0027s my problem. I\u0027m not exactly sure how to go about making sure that things work properly, but it\u0027s on my to-do list.\u003C/p\u003E\n"},{"CreatedByName":"jrandom","CreatedById":74522,"CreatedDateTime":"2013-12-03T05:16:51Z","Content":"\n\u003Cp\u003EI\u0027m getting an odd problem where a piece waaay up at the top of my 106-meter-tall rocket (RSS/RO) is breaking, despite there not being much above it. It was very stable when it was just that payload and two stages below it for testing, but now that I have the full rocket built, it keeps breaking before I even have a chance to launch.\u003C/p\u003E\u003Cp\u003EI\u0027m mucking about with the config.xml file now, but are there any particular settings I should be paying attention to? The piece that is breaking is the large probe core (used by RT as the remote command core) and the stretchy tank below it. The setup is Mk1-2 -\u0026gt; heat shield -\u0026gt; decoupler -\u0026gt; core -\u0026gt; tank. The rocket is 106 meters tall (just pokes out the top of the VAB).\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-12-03T05:36:54Z","Content":"\n\u003Cp\u003EIt may be the result of the rocket jumping on load, with the initial shock heading up the rocket as it is held in place by the clamps. See if adding clamps partway up the rocket helps. You can try increasing the breakingForce of the part or the breakForce multipliers in the config.xml to see if that helps. I have noticed that a bunch of AIES parts suffer the same issue since they have relatively small breakingForces for their sizes.\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-12-03T05:47:21Z","Content":"\n\u003Cp\u003EAgain, I\u0027d beg of you to just set reasonable breakingforces yourself, instead of using multipliers. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003ERe: pWings: PM DYJ and ask if ze could change (or would mind if someone else changed) pWings to scale OnLoad?\u003C/p\u003E\n"},{"CreatedByName":"Commissioner Tadpole","CreatedById":91993,"CreatedDateTime":"2013-12-03T22:49:23Z","Content":"\n\u003Cp\u003EAs soon as the engineers of the Kerbin National Space Agency(my save file) came across your company(this mod), they immediatly bought all of your products(downloaded this mod) so they can stop gluing parts together with duct tape and chewing gum(jamming struts all over the rocket).\u003C/p\u003E\u003Cp\u003EThank you! But does this prevent the fuel tanks connected to a Tri/Quadstacker from \u0027dancing\u0027 once it lifts off, or struts are still necessary?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-03T22:53:31Z\u0022 title=\u002212/03/2013 10:53  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 3, 2013\u003C/time\u003E by Commissioner Tadpole\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2013-12-04T06:37:37Z","Content":"\n\u003Cp\u003EYou\u0027ll still need some struts but not as many and you shouldn\u0027t have to use struts just to hold certain engines in place against their sometimes rather violent thrust vectoring forces. KJR makes it much easier to use lots of Mainsails without having them rip your rocket apart. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt also makes it much easier to use radially attached fuel tanks. Just stick them on, no struts required! (Most of the time.) The big Kethane drills will just stick on and stay put, can even mount engines to their bottoms and they\u0027ll stay put.\u003C/p\u003E\u003Cp\u003EThere\u0027s still a bit of an issue with sticking things to the ends of Stretchy Tanks, but Ferram says he\u0027s working on it.\u003C/p\u003E\u003Cp\u003EI like using the Quantum Struts mod. A few well placed ones of those can replace a spiderweb of normal struts. Two things about them, they\u0027re super rigid so whatever forms the other sides of the \u0022triangle\u0022 between the strut generator and where its other end touches needs to be quite rigid. Too much flex and the quantum struts can jack your rocket apart on the pad. The other thing is to not mount them on nor allow their beams to contact the really tiny mass parts like the Octagonal Cubical Strut. Weird physics happens and the ship will not rotate at all. This can be used in a beneficial way by assigning a strut in such a configuration to an action group. Turn it off before launch then when you want your ship rock steady to be docked to, turn it on. Won\u0027t need to use RCS or reaction wheel force to stay still. (I haven\u0027t actually used it as a rotation lock for docking, but have tested the effect on a simple test probe in LKO.)\u003C/p\u003E\u003Cp\u003EThe Strut Guns are also highly useful. I mount four on top of landers, around the docking port. It makes the docked crafts a whole lot more stable, especially when docking a third craft to two already docked. They can also be angled for acceleration bracing when you\u0027re docking a bunch of things together for an interplanetary trip. Quantum struts can also be used for this task. Just four of those and a clampotron Jr between two orange tanks side by side can withstand the shear forces of a mainsail or a skipper and four LV-T30\u0027s - when used with KJR.\u003C/p\u003E\u003Cp\u003EKJR won\u0027t prevent every breakup. I pushed the parts count limit for my PC with my Duna mission. Got quite laggy in a turn and it couldn\u0027t keep up with all the calculations. Parts began to slide and.... oops, there goes a whole fifth of the ship flying off, despite the quantum struts that were holding it.\u003C/p\u003E\n"},{"CreatedByName":"Commissioner Tadpole","CreatedById":91993,"CreatedDateTime":"2013-12-04T14:53:28Z","Content":"\n\u003Cp\u003EWhy you lied to me... this mod does NOTHING at all. My rockets still fell apart because \u0022Structural failure between Advanced ASAS Module, Large and Rockomax Brand Decoupler\u0022. Now I can\u0027t go to Eve to finally conquer the entire solar system, when I had alterady explored Kerbin and Duna!\u003C/p\u003E\n"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2013-12-04T15:20:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Commissioner Tadpole\u0022 data-cite=\u0022Commissioner Tadpole\u0022\u003E\u003Cdiv\u003EWhy you lied to me... this mod does NOTHING at all. My rockets still fell apart because \u0022Structural failure between Advanced ASAS Module, Large and Rockomax Brand Decoupler\u0022. Now I can\u0027t go to Eve to finally conquer the entire solar system, when I had alterady explored Kerbin and Duna!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWow that sucks for you and if you\u0027re having trouble I\u0027m sure you can get help here but you need to be responsible and provide better information without the accusatory tone. \u003C/p\u003E\u003Cp\u003EThe mod does work.\u003C/p\u003E\n"},{"CreatedByName":"mvronsky","CreatedById":93409,"CreatedDateTime":"2013-12-04T15:24:11Z","Content":"\n\u003Cp\u003EJust downloaded, and I have to say that this is such a great mod!!!\u003C/p\u003E\u003Cp\u003EI just made my first Apollo tattle mission that would probably not work (computer lag because of struts) if it weren\u0027t for this mod!\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-12-04T16:11:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Starwaster\u0022 data-cite=\u0022Starwaster\u0022\u003E\u003Cdiv\u003EWow that sucks for you and if you\u0027re having trouble I\u0027m sure you can get help here but you need to be responsible and provide better information without the accusatory tone. \u003Cp\u003EThe mod does work.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERock solid, this mod works. The shroud you see over the second stage engine is nothing more than procedural interstage fairings, a decoupler, and a few struts. No wobbles, no breaking.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/EyFah2Q.png\u0022 alt=\u0022EyFah2Q.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Commissioner Tadpole","CreatedById":91993,"CreatedDateTime":"2013-12-04T16:38:31Z","Content":"\n\u003Cp\u003EWell...I\u0027m not exactly sure about what happened in details, but the parts don\u0027t glue how they\u0027re supposed to be glued. The large ASAS module still disconnects from the Rockomax decoupler when it isn\u0027t strutted.\u003C/p\u003E\n"},{"CreatedByName":"Deltac","CreatedById":12493,"CreatedDateTime":"2013-12-04T17:48:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Commissioner Tadpole\u0022 data-cite=\u0022Commissioner Tadpole\u0022\u003E\u003Cdiv\u003EWhy you lied to me... this mod does NOTHING at all. My rockets still fell apart because \u0022Structural failure between Advanced ASAS Module, Large and Rockomax Brand Decoupler\u0022. Now I can\u0027t go to Eve to finally conquer the entire solar system, when I had alterady explored Kerbin and Duna!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis game is an alpha...\u003C/p\u003E\u003Cp\u003EAnyway, give us a pic of your rocket, otherwise you\u0027re the lier.\u003C/p\u003E\u003Cp\u003Eand I didn\u0027t see the next page button...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-04T17:52:09Z\u0022 title=\u002212/04/2013 05:52  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 4, 2013\u003C/time\u003E by Deltac\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"jrandom","CreatedById":74522,"CreatedDateTime":"2013-12-04T17:57:32Z","Content":"\n\u003Cp\u003EHe\u0027s probably not a liar, although he\u0027s very adamantly vocal about things. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E I get weird structural failures between odd components as well (like the large remote guidance unit used with RemoteTech 2 and StretchyTanks). Overall, most connections are much stronger but some components just don\u0027t want to glue together correctly.\u003C/p\u003E\u003Cp\u003EThe issue with the StretchyTanks is known to the devs and I believe it is actively being worked on. I don\u0027t know enough of the specifics to say what the exact cause is, but it\u0027s possible this same issue is making these other failures happen as well.\u003C/p\u003E\n"},{"CreatedByName":"Commissioner Tadpole","CreatedById":91993,"CreatedDateTime":"2013-12-04T19:38:51Z","Content":"\n\u003Cp\u003EI can\u0027t show a picture of the rocket right now as I\u0027m using a different save, but here\u0027s the craft file: \u003Ca href=\u0022http://pastebin.com/arSFbkay\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://pastebin.com/arSFbkay\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"AbeS","CreatedById":80644,"CreatedDateTime":"2013-12-04T19:44:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Starwaster\u0022 data-cite=\u0022Starwaster\u0022\u003E\u003Cdiv\u003EThat\u0027s why I use this:\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003E@PART[*]:HAS[#module[Part],~breakingForce[]]\u003Cbr\u003E{\u003Cbr\u003E\tbreakingForce = 1000\u003Cbr\u003E}\u003Cbr\u003E@PART[*]:HAS[#module[Part],~breakingTorque[]]\u003Cbr\u003E{\u003Cbr\u003E\tbreakingTorque = 1000\u003Cbr\u003E}\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E*Requires either ModuleManager 1.3 \u0026amp; Sarbian\u0027 MM Extensions OR ModuleManager 1.5\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EYeah, the PART[*] and module[Part] are redundant; that\u0027s a holdover from when Sarbian\u0027s extensions were bugged and applying the patch to all nodes, not just PART nodes. Probably could take that out. Might speed startup a bit.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETry adding that cfg, and see if it works!\u003C/p\u003E\n"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2013-12-04T19:46:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AbeS\u0022 data-cite=\u0022AbeS\u0022\u003E\u003Cdiv\u003ETry adding that cfg, and see if it works!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ehey, I know that guy!\u003C/p\u003E\n"},{"CreatedByName":"AbeS","CreatedById":80644,"CreatedDateTime":"2013-12-04T20:16:49Z","Content":"\n\u003Cp\u003EI remember reading about large ASAS problem, and ferram showing a fix, but I couldn\u0027t find it. But I THINK it was related to the breaking force and torque\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-12-04T22:28:22Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@Commissioner Tadpole: \u003C/strong\u003EThat issue is due to the fact that the large SAS module is set to use the stock breaking force and breaking torque which were originally intended only for 1.25m diameter parts. I\u0027m working on something that will handle this, but that will have to wait for the next release once 0.23 is out, so I can ensure compatibility.\u003C/p\u003E\u003Cp\u003EHowever, based on your complaint, I think you misunderstood the intention of this mod. It does not strengthen the joints, it \u003Cem\u003Estiffens\u003C/em\u003E them so that they don\u0027t wobble. To get the behavior you\u0027re requesting, you would be probably better served by uninstalling KJR and activating unbreakable joints in the debug menu, since that seems to be what you\u0027re after.\u003C/p\u003E\n"},{"CreatedByName":"Commissioner Tadpole","CreatedById":91993,"CreatedDateTime":"2013-12-04T23:59:26Z","Content":"\n\u003Cp\u003EOh....in that case, sorry for falsely accusing you...as you could see, I get stressed way too easily.\u003C/p\u003E\n"},{"CreatedByName":"Zander","CreatedById":76100,"CreatedDateTime":"2013-12-06T03:27:17Z","Content":"\n\u003Cp\u003EIt seems this mod is not scaling connection strength with the stretchy fuel tanks mod. I have made a rocket about 3/4ths the size of the saturn 5 and 2/3rds the weight. it is being destroyed by excessive flexing and wobble.\u003C/p\u003E\n"},{"CreatedByName":"jrandom","CreatedById":74522,"CreatedDateTime":"2013-12-06T03:29:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Zander\u0022 data-cite=\u0022Zander\u0022\u003E\u003Cdiv\u003EIt seems this mod is not scaling connection strength with the stretchy fuel tanks mod. I have made a rocket about 3/4ths the size of the saturn 5 and 2/3rds the weight. it is being destroyed by excessive flexing and wobble.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m pretty sure this is a known issue that should be fixed in the next release (I hope!). In the meantime, you\u0027ll have to run struts from the stretchytank to whatever\u0027s above it. I\u0027ve been using 6-way B9 heavy struts for this purpose:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/3pdPDoH.jpg\u0022 alt=\u00223pdPDoH.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-12-06T10:03:44Z","Content":"\n\u003Cp\u003ECorrect. I need to set tanks to update node position OnLoad(). I will get to it as soon as I can.\u003C/p\u003E\n"}]}