{"TopicId":50911,"ForumId":34,"TopicTitle":"[1.3] Kerbal Joint Reinforcement v3.3.3 7/24/17","CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2013-10-28T08:04:32Z","PageNum":28,"Articles":[{"CreatedByName":"not-a-cylon","CreatedById":63398,"CreatedDateTime":"2014-02-06T06:35:49Z","Content":"\n\u003Cp\u003Epossible bug with your new release.\u003C/p\u003E\u003Cp\u003EI have a lander/orbiter docked together (sent up in one piece into orbit) and they are strutted together with b9\u0027s non invisible struts. I still haven\u0027t undocked them for the first time yet. When I EVA while in orbit and return to the same pod I came from, the ship gets torn apart by phantom forces.\u003C/p\u003E\u003Cp\u003EIn the meantime, I think I\u0027ll stick with 1.7 again- it worked well anyways. Thanks for the awesome mod!\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-02-06T06:41:41Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@not-a-cylon: \u003C/strong\u003EThat sounds less like KJR and more like a stock bug; there\u0027s really nothing to be done about it without seriously decreasing the physics timestep, which would make the game horribly laggy. It\u0027s an error that can be replicated stock, in KJR, whatever, as long as enough of an initial error is caused things will fly apart.\u003C/p\u003E\u003Cp\u003ELemme guess, it has very heavy masses, radially attached on spars, with a very high symmetry count.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@Duxwing: \u003C/strong\u003EGo ahead, looks good. I\u0027ve also cleaned out my inbox.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-06T07:11:12Z\u0022 title=\u002202/06/2014 07:11  AM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 6, 2014\u003C/time\u003E by ferram4\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"not-a-cylon","CreatedById":63398,"CreatedDateTime":"2014-02-06T07:11:14Z","Content":"\n\u003Cp\u003Eactually I figured out the problem. it existed between the keyboard and the computer chair \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EI had a probe core (for unmanned control for positioning the orbiter for rendezvous) clipped under the docking port. KJR did its thing with reinforcing joints so much that it created quite a spectacular implosion centered around on the probe core \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003Ereinstalling v2!!! again, thanks for the superior quality of your mods!\u003C/p\u003E\n"},{"CreatedByName":"Damaske","CreatedById":60029,"CreatedDateTime":"2014-02-06T08:36:37Z","Content":"\n\u003Cp\u003Edoes this still blow apart with clipped parts? as that is kind of killing me from using this mod. It works wonders just that little rapid unplanned part scattering.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2014-02-06T10:55:02Z","Content":"\n\u003Cp\u003EWell, the simplest solution is, don\u0027t clip parts. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Due to how it works, KJR might cause unexpected behavior with parts not placed how they\u0027re supposed to be. I don\u0027t use clipping at all and it works for me.\u003C/p\u003E\n"},{"CreatedByName":"OneRaven","CreatedById":78206,"CreatedDateTime":"2014-02-07T17:38:04Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EBug Report:\u003C/strong\u003E KJR v2 doesn\u0027t like KAS Strut Endpoints. After switching away from a vessel and switching back, all linked strut pairs are broken, with one endpoint of each pair having been sheared off. This bug was not present in the previously installed version (1.7?).\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ESteps to reproduce:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003EInstall KAS and KJR.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ELaunch any other ship at least minimum-load-distance away from KSC.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ELoad ship \u003Ca href=\u0022http://pastebin.com/iJwABccQ\u0022 rel=\u0022external nofollow\u0022\u003EKAS Strut Failure Test\u003C/a\u003E.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u0022Launch\u0022 KAS Strut Failure Test.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EEVA attach two strut endpoints.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EReturn to Pod.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ESwitch away from KAS Strut Failure Test, then switch back.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E(Optional) Observe Structural Failure notice in mission log.\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EExpected result:\u003C/strong\u003E The struts are still attached to the ship and linked.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EObserved result:\u003C/strong\u003E One endpoint has been broken off, destroying the link.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EAttempted resolution:\u003C/strong\u003E Added \u0022\u0026lt;string name=\u0022exemptModuleType3\u0022\u0026gt;KASModuleStrut\u0026lt;/string\u0026gt;\u0022 to config.xml\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EResult:\u003C/strong\u003E No change.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EOther comments:\u003C/strong\u003E Returning to Space Center and then selecting the strutted ship through the Tracking Station does not always produce this bug, but switching to another ship in orbit and switching back has a 100% failure rate.\u003C/p\u003E\n"},{"CreatedByName":"Damaske","CreatedById":60029,"CreatedDateTime":"2014-02-07T20:50:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dragon01\u0022 data-cite=\u0022Dragon01\u0022\u003E\u003Cdiv\u003EWell, the simplest solution is, don\u0027t clip parts. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Due to how it works, KJR might cause unexpected behavior with parts not placed how they\u0027re supposed to be. I don\u0027t use clipping at all and it works for me.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESorry not going to happen, I clip parts for looks and for making things as small as possible. Please there are planes that I need a forward stabilizer to help it lift off the runway yet it looks ugly as sin so I clip it onto the body. So to tell me to NOT clip is just like telling me to not breath, its not going to happen. \u003C/p\u003E\u003Cp\u003EI\u0027d rather not use this mod and strut the heck out of things rather then have my nice sleek looking craft getting ugly little wingy bits here and there.\u003C/p\u003E\n"},{"CreatedByName":"AbeS","CreatedById":80644,"CreatedDateTime":"2014-02-08T02:29:59Z","Content":"\n\u003Cp\u003EIt will get ugly with struts anyways \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-02-08T03:07:24Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@Damaske: \u003C/strong\u003EClipped parts don\u0027t cause problems unless you manage to make them break off. If you\u0027re managing to get things to randomly break off in the latest version, you\u0027re doing something very, very wrong.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@OneRaven: \u003C/strong\u003EConfirmed, and I think I fixed it. KAS creates its joints after KJR goes through its initial physics easing code, which includes multiplying all the joint\u0027s breakForces by some ridiculous factor. Then when the physics easing is done it multiplies all the joint breakForces by 1 / ridiculous factor. So that means that KAS joints end up getting their breakForces dropped through the floor because they weren\u0027t initially made stronger. I can\u0027t delay when KJR acts, so it\u0027s going to simply keep track of what joints it \u003Cem\u003Edid\u003C/em\u003E affect and then work from there.\u003C/p\u003E\u003Cp\u003EIt needs some testing, but v2.1 should be up soon with the fix.\u003C/p\u003E\n"},{"CreatedByName":"ANWRocketMan","CreatedById":65251,"CreatedDateTime":"2014-02-08T08:53:26Z","Content":"\n\u003Cp\u003EI\u0027m not sure why, but I\u0027ve been seeing fair bit more unstable rockets with this release, to the point that I can\u0027t time-warp while on the launchpad to wait for the proper launch window. Although, launch clamps are working better now.\u003C/p\u003E\n"},{"CreatedByName":"Damaske","CreatedById":60029,"CreatedDateTime":"2014-02-08T13:16:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003E@Damaske: \u003C/strong\u003EClipped parts don\u0027t cause problems unless you manage to make them break off. If you\u0027re managing to get things to randomly break off in the latest version, you\u0027re doing something very, very wrong.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThank you will start to test latest version! \u003C/p\u003E\u003Cp\u003EAlso if what I posted seams harsh it don\u0027t sugercoat what I want to say, If it offends you please don\u0027t take it personal!\u003C/p\u003E\n"},{"CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2014-02-13T09:33:44Z","Content":"\n\u003Cp\u003EWas running 1.7 with this \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/69162-All-assembled-in-orbit-ready-to-go-but-my-computer-isn-t\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/69162-All-assembled-in-orbit-ready-to-go-but-my-computer-isn-t\u003C/a\u003E and it held almost everything together.\u003C/p\u003E\u003Cp\u003EI\u0027ll try it again with 2.0. If it makes it through the apoapsis raising burn then I\u0027ll try going to Eve with it. If not, already have plans as detailed there.\u003C/p\u003E\u003Cp\u003EUnless for some reason KJR has a problem with these cfg modded stock docking ports? \u003Ca href=\u0022http://pastebin.com/7nTXzUB2\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://pastebin.com/7nTXzUB2\u003C/a\u003E (3 way) \u003Ca href=\u0022http://pastebin.com/3jExA8U6\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://pastebin.com/3jExA8U6\u003C/a\u003E (2 way). I picked up these on the forum a while back, they\u0027ve been very useful.\u003C/p\u003E\u003Cp\u003EIt was a 3 way which came off the top of the 2 man lander can. I\u0027ve also knocked those off the top of the can with a Kerbal\u0027s head, while trying to use a KAS winch mounted above the can\u0027s hatch.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-13T09:37:49Z\u0022 title=\u002202/13/2014 09:37  AM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 13, 2014\u003C/time\u003E by Galane\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ANWRocketMan","CreatedById":65251,"CreatedDateTime":"2014-02-15T08:41:49Z","Content":"\n\u003Cp\u003E@ferram4: I\u0027m having a lot of issues with v2.0. Previously in v1.7 most of my big rockets were very stable with launch clamps and very few KW Rocketry Heavy struts between inerstage fairing adapters. However, since I upgraded the rockets tend to rip themselves apart on the launch pad or wobble uncontrollably leading to very bad launches. This still using Real Solar System v5.5(I found v6.0 pre 1) made it even more unstable with the Earth remake.\u003C/p\u003E\u003Cp\u003EHere is a picture of a 61-ton SLS rocket in v1.7:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/TvYa1vd.png\u0022 alt=\u0022TvYa1vd.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd a Nova C-8(not perfectly accurate):\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/yvXaAJ3.png\u0022 alt=\u0022yvXaAJ3.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E*NOTE: It weighs 5,500 metric-tons. Just in addition: this specific one is new built in v2.0. But I built a heavier and bigger rocket in v1.7 that worked better in terms of launch pad stability.\u003C/p\u003E\u003Cp\u003ENow, the problem seems to using more than one or two launch clamps. If I use three or more, the rocket rips apart. If I use only 2, the rockets topple over. I I use only 1 it breaks and the whole thing explodes. This didn\u0027t happen on any of these rockets using v1.7. Not exactly sure what changed to make this re-appear though...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-15T15:53:47Z\u0022 title=\u002202/15/2014 03:53  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 15, 2014\u003C/time\u003E by ANWRocketMan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-02-15T19:53:58Z","Content":"\n\u003Cp\u003EThat problem is caused by Real Solar System exacerbating a stock KSP bug involving launch clamps that causes them to shift a bit when the rocket loads. There\u0027s nothing I can do about it, and it also occurred in v1.7. Actually, I saw it happen worse in v1.7 than in 2.0, so my experience is completely different.\u003C/p\u003E\n"},{"CreatedByName":"ANWRocketMan","CreatedById":65251,"CreatedDateTime":"2014-02-15T20:25:30Z","Content":"\n\u003Cp\u003EHmm, strange. I reinstalled v1.7 again and the problem was solved. Oh well...\u003C/p\u003E\n"},{"CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2014-02-16T11:06:10Z","Content":"\n\u003Cp\u003EI went back to 1.7 too. With 2.0 the TT-70 radial decouplers won\u0027t hold my boosters together, not even with added Quantum struts. The core of the failed one is a ReStock ThunderMax 64 (with one Mainsail on its bottom) with 8 of the extra long Rockomax sized ReStock grey tanks around it, mounted to TT-70\u0027s with plenty of standard struts holding the tanks together.\u003C/p\u003E\u003Cp\u003EWith KJR 2.0 the TT-70s all fail soon as KJR is done with its stabilizing load. With 1.7 they hold on just fine, I used that launcher to lift two different heavy rovers form my Eve ship. Tonight I updated to KJR 2.0 and spent a bunch of time failing to get the launcher to stay together before going back to 1.7.\u003C/p\u003E\u003Cp\u003EI should try KJR 2.0 with some of my large boosters that are mainly built of Rockomax 64 tanks, see if they will break on the pad.\u003C/p\u003E\n"},{"CreatedByName":"Virtualgenius","CreatedById":67644,"CreatedDateTime":"2014-02-16T11:46:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Galane\u0022 data-cite=\u0022Galane\u0022\u003E\u003Cdiv\u003EI went back to 1.7 too. With 2.0 the TT-70 radial decouplers won\u0027t hold my boosters together, not even with added Quantum struts. The core of the failed one is a ReStock ThunderMax 64 (with one Mainsail on its bottom) with 8 of the extra long Rockomax sized ReStock grey tanks around it, mounted to TT-70\u0027s with plenty of standard struts holding the tanks together.\u003Cp\u003EWith KJR 2.0 the TT-70s all fail soon as KJR is done with its stabilizing load. With 1.7 they hold on just fine, I used that launcher to lift two different heavy rovers form my Eve ship. Tonight I updated to KJR 2.0 and spent a bunch of time failing to get the launcher to stay together before going back to 1.7.\u003C/p\u003E\u003Cp\u003EI should try KJR 2.0 with some of my large boosters that are mainly built of Rockomax 64 tanks, see if they will break on the pad.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHaving the exact same issue using the Ares V from bobcats American Pack the TT-70 decoupler wont hang on but is fine in V1.7\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-02-16T16:45:03Z","Content":"\n\u003Cp\u003EIf you have a ton of struts between the rockets that might be the problem, since struts can cause lots of weird structural issues if used to excess. Besides that, this sounds like you\u0027re using the small extended radial decoupler (which has the problem of giving parts a very large moment arm to work with) with very large masses on the end; that\u0027s a recipe for things breaking. Frankly, I don\u0027t know why anyone would use the TT-70s, they\u0027re heavier and wobble more than any of the other radial decouplers.\u003C/p\u003E\u003Cp\u003EIf you really want to \u0022fix\u0022 it, go into the config.xml, find the \u0022breaktorqueperMOI\u0022 value and add a zero to it. There, you won\u0027t ever get any failures due to over-torquing again.\u003C/p\u003E\n"},{"CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2014-02-17T00:19:13Z","Content":"\n\u003Cp\u003ESome times you need to set the boosters out farther in order to have space between them.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-02-17T02:48:57Z","Content":"\n\u003Cp\u003EI just tried playing around with TT-70s and they\u0027re solid as a rock. You\u0027re going to have to post a problem craft (preferably without mods), since I can\u0027t seem to reproduce the issue on my own.\u003C/p\u003E\n"},{"CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2014-02-17T07:06:55Z","Content":"\n\u003Cp\u003EMust be the mod parts. Would be nice if someone (who knows their way around a cfg file) could update the KSPX and ReStock files to .23 standard.\u003C/p\u003E\u003Cp\u003EI can assemble a test article with no mod parts aside from the ReStock tanks - and make it so it\u0027ll hang together with 1.7 and come apart in 2.0. (Basically just strip down my big tanker/booster and pile enough weight on in stock parts.)\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-02-17T07:20:01Z","Content":"\n\u003Cp\u003EThen do that and I\u0027ll look into it. Maybe ReStock has something really weird going on with it.\u003C/p\u003E\n"},{"CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2014-02-17T09:21:19Z","Content":"\n\u003Cp\u003EAARP is \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Eappalled\u003C/span\u003E \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Eproud\u003C/span\u003E surprised(?) to introduce a FIY (Finish It Yourself) heavy lift launch vehicle, the TT-70 Test Article. As-is, you may go to space today, but you won\u0027t be coming back - alive.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://pastebin.com/v4tykNax\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://pastebin.com/v4tykNax\u003C/a\u003E Note that the Skipper and decoupler on the upper stage should be moved in the staging before sending Kerbals on a suicide mission, or modifying the ship for actual use. This is *not* a flying rocket, it is intended as a test of the TT-70 radial decouplers. Do not kill some Kerbals with it then complain to Alan Aerospace Recycling and Packaging.\u003C/p\u003E\u003Cp\u003EThe only non-stock parts are the big Thundermax 64 tank in the middle, the large adapter on top of it, and the 8 big tanks around the sides.\u003C/p\u003E\u003Cp\u003EWith KJR 1.7 it stays together. With KJR 2.0 I tested it a few times. The first time all but one TT-70 let go. All subsequent times they all came loose. Then I tried it without any KJR and it was better than with 1.7! Hardly any perceptible downward lurch or bounce at all.\u003C/p\u003E\u003Cp\u003ESo I launched it and nothing broke loose or fell apart, except what was intended to with staging. (I corrected the staging while in flight.)\u003C/p\u003E\u003Cp\u003EI\u0027m tempted to remove the anti-wobbling struts bracing the orange tank and giving it another go without KJR. Without those struts but with KJR 1.7 I had to lock the center engine\u0027s gimbal to keep it stable. I\u0027m a bit surprised that a craft I expected to be dependent on KJR doesn\u0027t actually need it, at least not with the payload in this craft. I\u0027ve used this launcher design to lift much heavier payloads to 71KM orbit.\u003C/p\u003E\u003Cp\u003EEdit: It\u0027s capable of even heavier lifting by sticking a Bigger, Badder, Quad Coupler on the bottom with four Mainsails (12 total) and bracing it to the big tank with quantum struts. Add two rings of 8 5-way RCS blocks to the big tank and it\u0027s also surprisingly nimble, able to pivot quickly to align for burns.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-18T08:31:33Z\u0022 title=\u002202/18/2014 08:31  AM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 18, 2014\u003C/time\u003E by Galane\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Durabys","CreatedById":85885,"CreatedDateTime":"2014-02-20T11:57:23Z","Content":"\n\u003Cp\u003ESo. It all works automatically? There is no toolbar for this mod? Just install it and done?\u003C/p\u003E\n"},{"CreatedByName":"GavinZac","CreatedById":68719,"CreatedDateTime":"2014-02-20T14:31:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Durabys\u0022 data-cite=\u0022Durabys\u0022\u003E\u003Cdiv\u003ESo. It all works automatically? There is no toolbar for this mod? Just install it and done?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes it \u0022Just Works\u0022, or \u0022Just Doesn\u0027t Work\u0022. Work, or do not work, there is no toolbar.\u003C/p\u003E\n"}]}