{"TopicId":51591,"ForumId":34,"TopicTitle":"[1.1.3] AntennaRange 1.11.4 - Enforce and Encourage Antenna Diversity","CreatedByName":"toadicus","CreatedById":67745,"CreatedDateTime":"2013-11-02T19:37:49Z","PageNum":5,"Articles":[{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2014-05-12T15:34:53Z","Content":"\n\u003Cp\u003ECan I just say, requiring LOS and everything makes it so much fun for me.. Right now, I\u0027m organising a lander to rdv with the mothership around the Mun - the lander has a Comm 16 and can\u0027t reach Kerbin, the mothership (well, it\u0027s basically a fuel tank and a lab) has an 88-88 dish. It\u0027s actually quite fun to have to wait until the lab can be seen to send all my Science home.. Really made me smile when I saw the \u0022transmitting vis Comm 88-88 on Mun Lab..\u0022\u003C/p\u003E\u003Cp\u003ECouple of things though - I\u0027ve noticed sometimes, the text says \u0027...directly back to Kerbin\u0027 and other times it doesn\u0027t. What affects this? Also, when the antennae is out of range and you try and transmit some data, it obviously won\u0027t work. However, it appears to delete the data entirely, not keep it. I was lucky as it was a gravity scan which can be repeated, but for the materials bay and goo, it might be frustrating.\u003C/p\u003E\n"},{"CreatedByName":"toadicus","CreatedById":67745,"CreatedDateTime":"2014-05-12T16:20:56Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@ObsessedWithKSP\u003C/strong\u003E: Those two issues are the primary reasons I sometimes think about completely rewriting the data transmitter.\u003C/p\u003E\u003Cp\u003ETo the first, Antennas get activated several different ways. For some of the ways, I have good control over the process and can inject messages. Other ways it\u0027s a lot tougher. If you can tell me when it didn\u0027t add the \u0022directly back to Kerbin\u0022 to the message, I\u0027ll see if I can\u0027t hunt that down.\u003C/p\u003E\u003Cp\u003ETo the second, Squad\u0027s interface for IModuleDataTransmitters requires a CanTransmit() method, and will correctly not transmit if CanTransmit() returns false (the default Squad ModuleDataTransmitter will never return false). But, since they don\u0027t have any cases where that happens it seems like the rest of the experiment system doesn\u0027t do a great job of handling things when CanTransmit() returns false. Sometimes experiments are lost forever. Sometimes they appear to get stuck in the transmitter\u0027s queue, and will actually transmit if you manually start a transmission later. All of the actual transmitting is done in private methods that I can\u0027t change or call and shouldn\u0027t look at, so finding meaningful workarounds is tough.\u003C/p\u003E\u003Cp\u003EFor now, these are known limitations and my best advice is to be careful. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Working around Squad\u0027s default behavior is tricky and rewriting the whole module would be very time consuming, and if I got something wrong I might really ruin your day. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2014-05-12T16:36:01Z","Content":"\n\u003Cp\u003EI see, very interesting... I\u0027ll keep my eyes open for when that message doesn\u0027t appear and let you know.\u003C/p\u003E\u003Cp\u003EAnd yeah, I\u0027ve noticed that sometimes, if all antennae\u0027s are used up and I want to transmit something, it won\u0027t transmit until I manually transmit something else. It used to be put into a queue and automatically transmits once an antennae becomes free and occasionally still does.. but it\u0027d be nice if Squad looked into the handling of false returns on CanTransmit(). Or at least not make the code private.. I would say they should definitely look into it, but I think they have more pressing issues to deal with right now.\u003C/p\u003E\u003Cp\u003EI shall indeed be more careful but I think I shall echo gmbigg\u0027s suggestion to help inform people of when they could potentially lose unrepeatable Science:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022gmbigg\u0022 data-cite=\u0022gmbigg\u0022\u003E\u003Cdiv\u003EI\u0027m not sure how to code this, but maybe using the toolbar icon to track connections would be a good \u0027pretty lines\u0027 solution?\u003Cp\u003EFor example, let\u0027s add two new icons; a \u003Cspan style=\u0022color:#ffd700;\u0022\u003Eyellow\u003C/span\u003E variant and a \u003Cspan style=\u0022color:#ff0000;\u0022\u003Ered\u003C/span\u003E variant of the current \u003Cspan style=\u0022color:#00ff00;\u0022\u003Egreen\u003C/span\u003E one.\u003C/p\u003E\u003Cp\u003EThe current \u003Cspan style=\u0022color:#00ff00;\u0022\u003Egreen\u003C/span\u003E icon symbolizes that your craft is \u003Cem\u003Eat or below\u003C/em\u003E the nominal range; transmissions are as efficient, or better than, Squad\u0027s defaults.\u003C/p\u003E\u003Cp\u003EThe \u003Cspan style=\u0022color:#ffd700;\u0022\u003Eyellow\u003C/span\u003E icon symbolizes that your craft is\u003Cem\u003Eabove\u003C/em\u003E the nominal range; transmissions cost more power than normal, but are still possible.\u003C/p\u003E\u003Cp\u003EThe \u003Cspan style=\u0022color:#ff0000;\u0022\u003Ered\u003C/span\u003E icon symbolizes that your craft is \u003Cem\u003Eout of range entirely\u003C/em\u003E; transmissions are not possible at the present time.\u003C/p\u003E\u003Cp\u003EIf the toolbar icon becomes visible in flight, all you\u0027d have to do is look at the icon to determine your current connection.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003Etl;dr\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EUse the Toolbar icons to track how efficient your connection is.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBy the way, thank you for the informative answers and helpful advice. It\u0027s appreciated \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2014-05-12T20:17:08Z","Content":"\n\u003Cp\u003EWell, we can role-play it as data irrepairably corrupted during transmission. Though i\u0027t doesn\u0027t make much sense, considering that copy of the data should be still onboard transmitting ship. Is it possible to code a small loophole, which will make a \u0022copy\u0022 of transmitted data, and keep it until transmission ends successfully? If transfer would fail we could get an option to repeat it.\u003C/p\u003E\n"},{"CreatedByName":"NJC2","CreatedById":83404,"CreatedDateTime":"2014-05-13T03:43:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022toadicus\u0022 data-cite=\u0022toadicus\u0022\u003E\u003Cdiv\u003EThe AntennaRange restrictions on line of sight and probe control are independently optional. I have the same feelings as you do regarding probe control, and don\u0027t use that limitation in my own career save. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E The Toolbar button in the space center will pop up a configuration window and let you set those options.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks, I figured that out on my own though. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E I left the probe LOS requirement on for my test just to see if it needed LOS back to the KSC or the planet itself.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022toadicus\u0022 data-cite=\u0022toadicus\u0022\u003E\u003Cdiv\u003EI have intentionally not required a relay back to KSC specifically because, in my view, it\u0027s a rather baseless restriction. Back in the days of the first manned spaceflights, NASA was not dependent upon space-based infrastructure to talk to their pilots, but also had more than a 10 minute window to do so while they whizzed over Texas every hour or two. They used \u003Ca href=\u0022https://en.wikipedia.org/wiki/Manned_Space_Flight_Network\u0022 rel=\u0022external nofollow\u0022\u003Esurface-based infrastructure\u003C/a\u003E to effect these early communications. The Apollo missions going all the way to the Moon also used surface-based infrastructure. IMO it\u0027s unreasonable to assume that the Kerbals do not have similar capacities even at the very start of a career save.\u003Cp\u003EWere I to add such a limitation, I probably would actually not allow any artificial point on Kerbin to act as a relay. Instead, I\u0027d require that an antenna be installed suitably close to KSC as \u0022the KSC relay\u0022, and thus require the player to develop every single point of communications infrastructure -- even the \u0022home base\u0022 antenna. But, IMO, that is not a fun or interesting requirement. Sending suborbital missions comprising an antenna on a parachute isn\u0027t challenging enough to be a fun task, and doesn\u0027t really contribute to the development of a meaningful skillset in terms of gameplay. If it\u0027s not well-founded in the \u0022reality\u0022 of the game world, isn\u0027t fun, and isn\u0027t educational, it\u0027s just busywork for its own sake.\u003C/p\u003E\u003Cp\u003EI welcome discussion on this topic. Maybe there is a right way to make building a short range communications network in the early game a good addition! I encourage you (and anyone else) to recommend and defend an implementation that meets at least two of the three criteria above: grounded in reality, fun, or educational. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree with most of what you\u0027ve said. It is unreasonable to assume that there would only be one radio transmitter on Kerbin, and I remember there being some discussion about that on the RT2 forum. Early in my career mode I considered building an aircraft with the early dishes and flying them around and landing them at various spots on Kerbin to act as ground transmitters, but it just ended up being easier to launch a few satellites in orbit as a relay network.\u003C/p\u003E\u003Cp\u003EWhat if you made Kerbin only have a limited communication range? Maybe just long enough to do missions to the Mun, so early in career mode users don\u0027t need to setup satellite relays until it\u0027s time to venture out past the Mun. At the least, perhaps put it in a config file we can edit to suit our taste?\u003C/p\u003E\n"},{"CreatedByName":"toadicus","CreatedById":67745,"CreatedDateTime":"2014-05-13T05:05:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NJC2\u0022 data-cite=\u0022NJC2\u0022\u003E\u003Cdiv\u003EI agree with most of what you\u0027ve said. It is unreasonable to assume that there would only be one radio transmitter on Kerbin, and I remember there being some discussion about that on the RT2 forum. Early in my career mode I considered building an aircraft with the early dishes and flying them around and landing them at various spots on Kerbin to act as ground transmitters, but it just ended up being easier to launch a few satellites in orbit as a relay network.\u003Cp\u003EWhat if you made Kerbin only have a limited communication range? Maybe just long enough to do missions to the Mun, so early in career mode users don\u0027t need to setup satellite relays until it\u0027s time to venture out past the Mun. At the least, perhaps put it in a config file we can edit to suit our taste?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, in general that\u0027s already the case. Early tech levels limit you to near-Kerbin missions; the whip antennas can barely make it to KSO. The medium dish gets you out to Minmus, again barely. You don\u0027t get the \u0022go anywhere, do anything\u0022 antenna until Electronics, which is pretty far down the chain.\u003C/p\u003E\u003Cp\u003EOK folks, status update. Since \u003Cstrong\u003Egmbigg\u003C/strong\u003E\u0027s recommendation has been so well-received, I\u0027ve gone ahead and implemented it. I have it working and will release it soon.\u003C/p\u003E\u003Cp\u003EI\u0027ve also been working on pretty lines. They... work? That is, it does draw pretty lines, and about 90% of the time they start and stop in the right places, they\u0027re always the right color and they only \u003Cem\u003Esometimes\u003C/em\u003E crash the whole process. Anyway, I might push out an experimental build in the not-to-distant future.\u003C/p\u003E\u003Cp\u003EThanks for all the input, folks! Keep it up!\u003C/p\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2014-05-14T12:00:01Z","Content":"\n\u003Cp\u003EExcellent work! Looking forward to it, sir! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EEDIT: have you looked into making more antennas? I\u0027ve been thinking about getting the RT2 parts and re-purposing them for this mod because it seems a bit odd to have one dish that can transmit through the whole Kerbol system, but the dish below it can barely reach beyond Minmus. Like, have one that can reach a few km, 100km, KSO, the Mun, the edge of Kerbins SoI, then one that can reach like half the Kerbol system, and a final big one that can do the entire thing. I mean, it might be feature creep or just plain old stealing from RT2 (well, its idea and in my personal case, its parts too) so it\u0027s entirely up to you if you want to go that route and I can understand if you don\u0027t or can\u0027t. I think I might do it for myself though, I like challenges and I think 3 antennas is bit limiting.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-14T12:09:12Z\u0022 title=\u002205/14/2014 12:09  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 14, 2014\u003C/time\u003E by ObsessedWithKSP\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2014-05-14T12:30:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022toadicus\u0022 data-cite=\u0022toadicus\u0022\u003E\u003Cdiv\u003EOK folks, status update. Since \u003Cstrong\u003Egmbigg\u003C/strong\u003E\u0027s recommendation has been so well-received, I\u0027ve gone ahead and implemented it. I have it working and will release it soon.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEvery time I try to look at that post my eyes bleed from the colours.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@Obscessed:\u003C/strong\u003E Perhaps they\u0027d be more interesting as sidegrades, similar to the decision between engines where one chooses either high thrust and low ISP or high ISP and low thrust. Though it\u0027s a little hard to think of something you could change that wouldn\u0027t end-up simply creating a \u0022this one is better, period\u0022 situation which is not desired (this mod\u0027s existence is to squish that).\u003C/p\u003E\u003Cp\u003EOh wait, no. You could balance that with mass and size. Yeeeeessss. So perhaps you could have an ultra-long range and very effective transmitter, but have the thing be big and heavy. That could work. Realistic? Not really. But more interesting.\u003C/p\u003E\u003Cp\u003EIf you do repurpose a few dishes I hope you\u0027ll share them.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-14T12:38:43Z\u0022 title=\u002205/14/2014 12:38  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 14, 2014\u003C/time\u003E by phoenix_ca\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NJC2","CreatedById":83404,"CreatedDateTime":"2014-05-14T21:52:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022toadicus\u0022 data-cite=\u0022toadicus\u0022\u003E\u003Cdiv\u003EWell, in general that\u0027s already the case. Early tech levels limit you to near-Kerbin missions; the whip antennas can barely make it to KSO. The medium dish gets you out to Minmus, again barely. You don\u0027t get the \u0022go anywhere, do anything\u0022 antenna until Electronics, which is pretty far down the chain.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMy idea of having a limited range for Kerbin is so that a ship out past this distance can\u0027t transmit back to Kerbin without longer range relay satellites in orbit to receive and relay it to the ground.\u003C/p\u003E\n"},{"CreatedByName":"Tortoise","CreatedById":68002,"CreatedDateTime":"2014-05-15T00:45:13Z","Content":"\n\u003Cp\u003EVery nice mod, and nice developer.\u003C/p\u003E\n"},{"CreatedByName":"toadicus","CreatedById":67745,"CreatedDateTime":"2014-05-15T15:29:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ObsessedWithKSP\u0022 data-cite=\u0022ObsessedWithKSP\u0022\u003E\u003Cdiv\u003EExcellent work! Looking forward to it, sir! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003Cp\u003EEDIT: have you looked into making more antennas? I\u0027ve been thinking about getting the RT2 parts and re-purposing them for this mod because it seems a bit odd to have one dish that can transmit through the whole Kerbol system, but the dish below it can barely reach beyond Minmus. Like, have one that can reach a few km, 100km, KSO, the Mun, the edge of Kerbins SoI, then one that can reach like half the Kerbol system, and a final big one that can do the entire thing. I mean, it might be feature creep or just plain old stealing from RT2 (well, its idea and in my personal case, its parts too) so it\u0027s entirely up to you if you want to go that route and I can understand if you don\u0027t or can\u0027t. I think I might do it for myself though, I like challenges and I think 3 antennas is bit limiting.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022phoenix_ca\u0022 data-cite=\u0022phoenix_ca\u0022\u003E\u003Cdiv\u003EEvery time I try to look at that post my eyes bleed from the colours.\u003Cp\u003E\u003Cstrong\u003E@Obscessed:\u003C/strong\u003E Perhaps they\u0027d be more interesting as sidegrades, similar to the decision between engines where one chooses either high thrust and low ISP or high ISP and low thrust. Though it\u0027s a little hard to think of something you could change that wouldn\u0027t end-up simply creating a \u0022this one is better, period\u0022 situation which is not desired (this mod\u0027s existence is to squish that).\u003C/p\u003E\u003Cp\u003EOh wait, no. You could balance that with mass and size. Yeeeeessss. So perhaps you could have an ultra-long range and very effective transmitter, but have the thing be big and heavy. That could work. Realistic? Not really. But more interesting.\u003C/p\u003E\u003Cp\u003EIf you do repurpose a few dishes I hope you\u0027ll share them.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have considered adding a few antennae. I\u0027m not a modeler or an animator and have no time to become one, but I\u0027ve considered asking carmics (the AIES developer) if he\u0027d let me distribute a few parts with MM patches to make them AR relays. But, I have a little trouble deciding what to do with it, and I\u0027d need to do some research into different space-based communicators. In real life we can still talk to the Voyager probes using nothing but their radio and a ground station... and those have tech from what would probably be the \u0022middle\u0022 of Earth\u0027s progression. Since then we\u0027ve primarily been increasing bandwidth (and with bandwidth, security and quality) as far as I know... which is not very far, because radio is not actually my thing. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAll that to say, such a notion is on my radar, but I don\u0027t have a good bearing on how to proceed with it, so for right now it\u0027s not at the top of the stack. I very much encourage you to share MM patches for any antennas that you do repurpose. I know MeCripp\u0027s already got some; you might all work together to find a compelling solution.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NJC2\u0022 data-cite=\u0022NJC2\u0022\u003E\u003Cdiv\u003EMy idea of having a limited range for Kerbin is so that a ship out past this distance can\u0027t transmit back to Kerbin without longer range relay satellites in orbit to receive and relay it to the ground.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETo make that work I\u0027d need to implement additive ranges. And even then that would only matter until you got the big dish, which would add up to a very large number with whatever I set Kerbin\u0027s default to. I do know what you\u0027re saying, I\u0027m just not sure if there\u0027s a \u0022right way\u0022 to implement it, and I don\u0027t think it feels very realistic. See above about Earth\u0027s comms to the Voyager probes.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tortoise\u0022 data-cite=\u0022Tortoise\u0022\u003E\u003Cdiv\u003EVery nice mod, and nice developer.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks! You guys are nice, too. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2014-05-15T16:04:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022toadicus\u0022 data-cite=\u0022toadicus\u0022\u003E\u003Cdiv\u003EIn real life we can still talk to the Voyager probes using nothing but their radio and a ground station... \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe ground stations have high output power (several kiloWatt) and very large dish antennas with a gain in the range 100,000 or so. The dish amplifies the output signal and also the incoming signal. In spite of all that, the data rate of the incoming signal from Voyager is a few 100 bits/s. See deep space network live: \u003Ca href=\u0022http://eyes.nasa.gov/dsn/dsn.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://eyes.nasa.gov/dsn/dsn.html\u003C/a\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EMy idea of having a limited range for Kerbin is so that a ship out past this distance can\u0027t transmit back to Kerbin without longer range relay satellites in orbit to receive and relay it to the ground.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETo make that work I\u0027d need to implement additive ranges.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs you noted, in reality there is no need for relay satellites for deep space communication, ground stations take care of that. \u003C/p\u003E\u003Cp\u003EIn practice the max range at which a probe can send data back home depends not on the ground stations but on transmitter power of the probe and the gain of its antenna. Whatever kind of radio power one could get in space on a relay satellite, you can get many times that power for much lower cost on the surface of the home planet.\u003C/p\u003E\u003Cp\u003EAntenna range is not additive but multiplicative (taking square root law into account): if in an existing connection one antenna is replaced by an antenna that has 4 times the gain, the maximum range for that connection is doubled. It works the same way with transmitter output power.\u003C/p\u003E\n"},{"CreatedByName":"toadicus","CreatedById":67745,"CreatedDateTime":"2014-05-15T16:33:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rkman\u0022 data-cite=\u0022rkman\u0022\u003E\u003Cdiv\u003EThe ground stations have high output power (several kiloWatt) and very large dish antennas with a gain in the range 100,000 or so. The dish amplifies the output signal and also the incoming signal. In spite of all that, the data rate of the incoming signal from Voyager is a few 100 bits/s. See deep space network live: \u003Ca href=\u0022http://eyes.nasa.gov/dsn/dsn.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://eyes.nasa.gov/dsn/dsn.html\u003C/a\u003E\u003Cp\u003EAs you noted, in reality there is no need for relay satellites for deep space communication, ground stations take care of that. \u003C/p\u003E\u003Cp\u003EIn practice the max range at which a probe can send data back home depends not on the ground stations but on transmitter power of the probe and the gain of its antenna. Whatever kind of radio power one could get in space on a relay satellite, you can get many times that power for much lower cost on the surface of the home planet.\u003C/p\u003E\u003Cp\u003EAntenna range is not additive but multiplicative (taking square root law into account): if in an existing connection one antenna is replaced by an antenna that has 4 times the gain, the maximum range for that connection is doubled. It works the same way with transmitter output power.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDo you know how the 100s baud bandwidth from the Voyager probes compares to their original throughput? I know 100 baud sounds really slow today, but in 1977 that might not have been so bad. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E That said, I am aware that their output is really, really low and that the DSN is leveraging much newer tech than 1977 to boost and process the signals from the Voyager probes on its way in.\u003C/p\u003E\u003Cp\u003EAntennaRange does respect the square root law as distance changes (using DÃ‚Â² ÃŽÂ± P/R as the nominal relationship), but does not model antenna gain directly. Currently the only available behavior increases bandwidth along the square-root law as antennas come \u0022inside\u0022 their nominal range, and increases the power use as they go \u0022outside\u0022 their nominal range. The next update will allow the power draw to be fixed, reducing bandwidth instead, as in Real Life.\u003C/p\u003E\u003Cp\u003EI looked in to modeling gain early in development and concluded that I didn\u0027t know enough about radio to do that. Now that the plugin actually works, maybe I could revisit it. That could help me make diversity in antennas more meaningful, too.\u003C/p\u003E\n"},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2014-05-16T12:15:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022toadicus\u0022 data-cite=\u0022toadicus\u0022\u003E\u003Cdiv\u003EDo you know how the 100s baud bandwidth from the Voyager probes compares to their original throughput? I know 100 baud sounds really slow today, but in 1977 that might not have been so bad. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENASA says 7.2 kbit/s, google says it was 115k/s when the probe was near Jupiter, by the time it was near Saturn it had dropped to 44.8k/s. Not sure how that figures, but those are respectable data rates anyway. \u003Ca href=\u0022http://voyager.jpl.nasa.gov/spacecraft/instruments_hga.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://voyager.jpl.nasa.gov/spacecraft/instruments_hga.html\u003C/a\u003E \u003Ca href=\u0022http://www.honeysucklecreek.net/dss44/voyager.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.honeysucklecreek.net/dss44/voyager.html\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIn first approximation data rate is directly related to radio channel bandwidth (assuming fixed compression, error correction etc), as long as background noise is a lot weaker than the signal. New encoding and error correction techniques probably have increased the effective data rate, not by a huge amount but still significant.\u003C/p\u003E\u003Cp\u003EMain reason for the slow data rate of Voyager is the weak signal caused by the insane distance: 15 billion km (your \u0022ping\u0022 time would be 1.2 days). Square root law is a *****. The signal is so weak it is almost lost in the background noise so a lot of error correction is needed, greatly reducing effective data rate.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EAntennaRange does respect the square root law as distance changes (using DÃ‚Â² ÃŽÂ± P/R as the nominal relationship), but does not model antenna gain directly. Currently the only available behavior increases bandwidth along the square-root law as antennas come \u0022inside\u0022 their nominal range, and increases the power use as they go \u0022outside\u0022 their nominal range. The next update will allow the power draw to be fixed, reducing bandwidth instead, as in Real Life.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhich goes a long way toward doing it right, but in reality data rate does not scale with the cube of the distance all the way from nearby to far away. Nearby the data rate would be constant (e.g. wifi throughput is constant while within range), at long range the data rate drops with distance roughly following square root law. \u003C/p\u003E\u003Cp\u003EThe only thing that directly scales with (the inverse of) the cube of the distance is the strength of the signal, meaning that background noise becomes an ever greater factor which reduces the data rate. The range at which data rate starts to drop would typically be quite a bit shorter than what you now have as \u0022nominal range\u0022.\u003C/p\u003E\u003Cp\u003ELooking at the Voyager numbers, the data rate when near Saturn was about half what it was when at about half the distance (near Jupiter) - it does not follow square root law, but it does drop off so it is outside of nominal range. I would not be surprised if at shorter distance than Jupiter the data rate was pretty much the same as it was at Jupiter.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI looked in to modeling gain early in development and concluded that I didn\u0027t know enough about radio to do that. Now that the plugin actually works, maybe I could revisit it. That could help me make diversity in antennas more meaningful, too.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn a given comms link the effective max range is derived from /dictated by the gain of both antennas (multiplied, taking sqrt into account) and the output power of the weakest transmitter. That is assuming identical receiver sensitivity, so that we can conveniently ignore that factor.\u003C/p\u003E\u003Cp\u003EThe gain of a dish antenna scales with the surface area: twice the diameter = 4 times the surface area = 4 times the gain = 2 times the effective max range for a given comms link. Just as crude examples: a small dish could be 20cm diameter and have a gain factor 100, at the high end could be a 2m dish with a gain of 10.000 (10 times the diameter, 10\u003Csup\u003E2\u003C/sup\u003E =100 times the surface area = 100 times the gain).\u003C/p\u003E\u003Cp\u003EIn its simplest form mass (volume) scales with the cube of the size increase (diameter), but in practice it is not worth it to save a large fraction of mass if the antenna is small (low mass) to begin with, while that is worth it if the antenna is large. So in practice antenna mass does not scale with the cube of the size increase, though the scale factor is larger than just diameter squared.\u003C/p\u003E\u003Cp\u003EThe range of transmitter output power is smaller, from a few Watts to several 10\u0027s of Watts. Mass and size of the transmitter only really matter if the dish is small. For transmitters the main consideration is electric power draw, dictated by transmitter output power.\u003C/p\u003E\u003Cp\u003EI think it would be nice if eventually (max) transmitter power would be a tweakable which would affect range and electric power draw, and have some small effect on mass (which would only really matter for small dishes), part size (and antenna gain) would not be affected.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-16T12:42:11Z\u0022 title=\u002205/16/2014 12:42  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 16, 2014\u003C/time\u003E by rkman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"toadicus","CreatedById":67745,"CreatedDateTime":"2014-05-31T00:01:04Z","Content":"\n\u003Cp\u003EAntennaRange has been updated to version 1.3! This version adds the much-requested colorful toolbar button, and an option to fix power consumption at long range, degrading data instead. I\u0027m also working with rkman to come to a better understanding of antennas, and am considering developing a slightly more realistic antenna degradation model for that option in future releases. Thanks for your patience, rkman!\u003C/p\u003E\u003Cp\u003ECHANGELOG:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003Ev.1.3 [2014-05-30]\u003Cbr\u003E* Added otherwise-nonfunctional Toolbar button in flight that will change colors to indicate current connection status (hint: red is bad)\u003Cbr\u003E* New option allows power costs to be fixed even at long range, reducing data rate instead.\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2014-05-31T00:10:27Z","Content":"\n\u003Cp\u003EYaaaaaay, updates! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E And just as I\u0027m setting out for Duna \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E Thankfully, I have the 88 on like, every craft so I should be safe. Thanks man! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Mecripp","CreatedById":181994,"CreatedDateTime":"2014-05-31T00:11:17Z","Content":"\n\u003Cp\u003ENice will give it a try.\u003C/p\u003E\n"},{"CreatedByName":"Parkaboy","CreatedById":64208,"CreatedDateTime":"2014-06-01T12:31:52Z","Content":"\n\u003Cp\u003EThis sounds like a great alternative for RemoteTech. I\u0027m hoping the devs will someday implement some of these ideas on the stock parts!\u003C/p\u003E\n"},{"CreatedByName":"NJC2","CreatedById":83404,"CreatedDateTime":"2014-06-06T12:05:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MeCripp\u0022 data-cite=\u0022MeCripp\u0022\u003E\u003Cdiv\u003E@NJC2 If you want to convert your career from RT2 to AntennaRange goto you RT2 folder and zipup or move out the CFG files and the plugin folder goto this post \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/56440-0-23-5-AntennaRange-1-2-Enforce-and-Encourage-Antenna-Diversity?p=1144076\u0026amp;viewfull=1#post1144076\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/56440-0-23-5-AntennaRange-1-2-Enforce-and-Encourage-Antenna-Diversity?p=1144076\u0026amp;viewfull=1#post1144076\u003C/a\u003E download the one that as % by it put it anywhere in KSP/GameData and have fun.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003EI haven\u0027t been able played KSP in a while, but I\u0027m now ready to get back to my career game. I only have a couple of probes out there with RT2 dishes on them, and once I recover or get done with them, I will completely remove RT2. I backed up my save directory and here\u0027s what I\u0027ve done:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003EI removed everything except the Parts directory from the RT2 directory. When I load my game, all my saved craft are greyed out saying \u0022Contains locked or invalid parts.\u0022 I\u0027m using your .cfg file, and the first thing \u003C/span\u003EI noticed is the RT2 antennas and dishes are no longer in the VAB. Looking at your config, it is missing the TechRequired field, so I added that in myself.\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003E The dishes now show up in the VAB, but my craft are still locked. The debug console doesn\u0027t show any reason.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003EI noticed that KSP auto-created a directory called saves_backup that automatically backed up my profile, and has a log file in it. According to the log it seems RT2 inserts modules into all of the antennas and probe cores and the launch clamps called \u0022ModuleRTAntenna\u0022 and \u0022ModuleSPUPassive.\u0022 I restored RT2, deleted the .cfg files that modify the parts, loaded the game, quit and it auto-removed those modules from my craft, but I still can\u0027t load any of my saved craft. The debug console shows no reason and the ksp.log file doesn\u0027t say why either.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003EI copied one of the craft files that I can\u0027t load to a sandbox save and loaded it. It\u0027s all stock parts, I see nothing on it that would cause it to not let me load it in my career save.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003EAm I doing things the hard way? Is there an easier way to remove RT2 and install this mod so I can load my saved craft?\u003C/span\u003E\u003C/p\u003E\u003Cp\u003ENever mind. I updated all of my other mods at the same time, and it turned out to be Procedural Fairings causing the problem with not being able to load saved craft. I reverted to the old version of PF while I sorted outt RT2 and this mod. Now I have to figure out what\u0027s up with PF.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-06T15:02:55Z\u0022 title=\u002206/06/2014 03:02  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 6, 2014\u003C/time\u003E by NJC2\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tortoise","CreatedById":68002,"CreatedDateTime":"2014-06-15T19:03:43Z","Content":"\n\u003Cp\u003EThis mod is a great, and has a great developer. I\u0027ve used this mod for quite some time. Sort of the \u0027slightly easier\u0027 alternative to remotetech.\u003C/p\u003E\n"},{"CreatedByName":"toadicus","CreatedById":67745,"CreatedDateTime":"2014-06-16T15:49:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Parkaboy\u0022 data-cite=\u0022Parkaboy\u0022\u003E\u003Cdiv\u003EThis sounds like a great alternative for RemoteTech. I\u0027m hoping the devs will someday implement some of these ideas on the stock parts!\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tortoise\u0022 data-cite=\u0022Tortoise\u0022\u003E\u003Cdiv\u003EThis mod is a great, and has a great developer. I\u0027ve used this mod for quite some time. Sort of the \u0027slightly easier\u0027 alternative to remotetech.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGlad you\u0027re enjoying it! If I can ever stop working, moving, and visiting family, I\u0027ve got some pretty cool things in the works for future development, I think. All still optional, too!\u003C/p\u003E\n"},{"CreatedByName":"Javster","CreatedById":74613,"CreatedDateTime":"2014-07-04T21:05:24Z","Content":"\n\u003Cp\u003ECould be interesting for career mode!\u003C/p\u003E\u003Cp\u003EIt looks like a very well thought-out mod, which means I will probably install it (Checking for any active flights first)\u003C/p\u003E\n"},{"CreatedByName":"Probus","CreatedById":102512,"CreatedDateTime":"2014-07-08T22:17:01Z","Content":"\n\u003Cp\u003EToad,\u003C/p\u003E\u003Cp\u003E Has anyone updated your config file to include antennas from different part packs?\u003C/p\u003E\u003Cp\u003EJust found it: \u003Ca href=\u0022https://www.dropbox.com/s/xv2153q8ybfl1s6/AntennaRange2.cfg\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/xv2153q8ybfl1s6/AntennaRange2.cfg\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-08T22:20:21Z\u0022 title=\u002207/08/2014 10:20  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 8, 2014\u003C/time\u003E by Probus\u003C/strong\u003E\n\u003Cbr\u003EFound it...\n\u003C/span\u003E\n"},{"CreatedByName":"NJC2","CreatedById":83404,"CreatedDateTime":"2014-07-15T06:39:42Z","Content":"\n\u003Cp\u003EI don\u0027t think LOS is working right. I have a science station in orbit around the Mun with a manned rover that goes down to the surface to collect science and return to the station. The rover only has a communitron 16 on it, and thought I would need to wait for the science station to pass overhead to relay transmissions back to Kerbin. I happened to land near my first unmanned probe I sent to the Mun. I waited for the station to pass overhead to transmit a crew report, and when I did, it relayed through the old probe instead of the station. They were both in the Northwest Crater. While there wasn\u0027t clear LOS between the two, it was close enough that I figured the mod couldn\u0027t quite tell. Now the rover has moved on and is over 100km away and there definitely is no LOS between the two, yet it continues to relay through this probe.\u003C/p\u003E\u003Cp\u003EThe view from above:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/hcRnSPs.png\u0022 alt=\u0022hcRnSPs.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe view rotated to line the two craft up to show there is no way they have LOS:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/27QeefC.png\u0022 alt=\u002227QeefC.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"toadicus","CreatedById":67745,"CreatedDateTime":"2014-07-15T15:32:36Z","Content":"\n\u003Cp\u003EThe LOS code has a 5% \u0022grace\u0022 figure in it to make satellite constellations easier with stock tools. That is, line of sight will be granted when the distance from the center of a body to the line ended by both relays is greater than 95% of the radius of the body. On Mun, that should mean that two vehicles at \u0022zero\u0022 level on the surface can contact each other from about 127 km apart, or more if the antennas are raised above the surface. Also, terrain is not considered whatsoever: if one antenna is up on the highlands a few kilometers above \u0022zero\u0022 level, you\u0027ll get even more distance out of the grace number. Considering terrain is complicated and expensive from a calculations standpoint, and pretty much completely useless for orbiting vessels, so at this point I\u0027m not planning to add such a function.\u003C/p\u003E\u003Cp\u003EI \u003Cem\u003Ewill\u003C/em\u003E make the grace figure configurable in config.xml in the next release, though, so you can make things tougher on yourself. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"}]}