{"TopicId":52608,"ForumId":34,"TopicTitle":"[0.25] RasterPropMonitor - putting the A in your IVA (v0.18.3) [8 Oct]","CreatedByName":"Mihara","CreatedById":59752,"CreatedDateTime":"2013-11-10T15:56:17Z","PageNum":5,"Articles":[{"CreatedByName":"MOARdV","CreatedById":60950,"CreatedDateTime":"2013-11-28T18:54:48Z","Content":"\n\u003Cp\u003ENazari1382 - thanks for the pointer. I\u0027m not clear how to do that (I have Unity installed, and part tools 18, but I can\u0027t seem to load the .mu file into a project). However, that\u0027s outside of the scope of this thread, so I\u0027ll go poke around elsewhere on the forum and see if I can get clues on where I go from here.\u003C/p\u003E\n"},{"CreatedByName":"Mihara","CreatedById":59752,"CreatedDateTime":"2013-11-28T20:31:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MOARdV\u0022 data-cite=\u0022MOARdV\u0022\u003E\u003Cdiv\u003ENazari1382 - thanks for the pointer. I\u0027m not clear how to do that (I have Unity installed, and part tools 18, but I can\u0027t seem to load the .mu file into a project). However, that\u0027s outside of the scope of this thread, so I\u0027ll go poke around elsewhere on the forum and see if I can get clues on where I go from here.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s fairly self-evident how to do that using PartTools 20. It just gives you a menu to load capsule internals, and a menu of props to spawn in them, you see them exactly as they appear in the game, so it\u0027s quite easy to do, and it saves straight to the IVA config files as well. With PartTools 18, it\u0027s a huge pain, I\u0027m told.\u003C/p\u003E\n"},{"CreatedByName":"MOARdV","CreatedById":60950,"CreatedDateTime":"2013-11-28T21:51:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mihara\u0022 data-cite=\u0022Mihara\u0022\u003E\u003Cdiv\u003EIt\u0027s fairly self-evident how to do that using PartTools 20. It just gives you a menu to load capsule internals, and a menu of props to spawn in them, you see them exactly as they appear in the game, so it\u0027s quite easy to do, and it saves straight to the IVA config files as well. With PartTools 18, it\u0027s a huge pain, I\u0027m told.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat must be it - I grabbed .18 tools some time ago, looked at Unity for 5 minutes, and never bothered updating, since I\u0027m not a modeler.\u003C/p\u003E\n"},{"CreatedByName":"OrianCEV","CreatedById":77351,"CreatedDateTime":"2013-11-28T22:27:49Z","Content":"\n\u003Cp\u003EVery nice mod,Makes IVA much more interesting.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-28T22:44:07Z\u0022 title=\u002211/28/2013 10:44  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 28, 2013\u003C/time\u003E by OrianCEV\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"xxbairdixx","CreatedById":83080,"CreatedDateTime":"2013-11-29T03:43:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mihara\u0022 data-cite=\u0022Mihara\u0022\u003E\u003Cdiv\u003EA call for support:\u003Cp\u003EI\u0027m debugging SCANsat integration. That is, the very first prototype even works, but I\u0027m not sure it\u0027s actually getting the data. Unfortunately I haven\u0027t had the time to play KSP at all in the past month with all this coding.\u003C/p\u003E\u003Cp\u003ECould anyone produce a save file with no vessels at all in it, but Kerbin having been scanned in as much detail as possible? That would save me quite some time. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EEDIT:\u003C/strong\u003E That should get you interested. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Fz3l46n.png\u0022 alt=\u0022Fz3l46n.png\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eso since you were able to get scansat working do you think it would be possible to implement the games map view for the current SOI for viewing predicted trajectories\u003C/p\u003E\n"},{"CreatedByName":"Mihara","CreatedById":59752,"CreatedDateTime":"2013-11-29T03:59:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022xxbairdixx\u0022 data-cite=\u0022xxbairdixx\u0022\u003E\u003Cdiv\u003Eso since you were able to get scansat working do you think it would be possible to implement the games map view for the current SOI for viewing predicted trajectories\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETLDR: Nope, I have tried already and there\u0027s apparently no way in hell.\u003C/p\u003E\u003Cp\u003ELonger explanation: In KSP, not only the world rotates around you (that is not so uncommon in games) but also, there are multiple layers of indirection -- you fly within Krakensbane, which is a special moving bubble where the world is \u0022real\u0022 which exists to reduce scales and speeds to levels which the physics engine can cope with, but that itself is on a Keplerian orbit within ScaledSpace, where planets exist as small scale models. (And you thought Kerbal planets were already small). Once you move close enough to a planet, the scale model is replaced with the actual planet generated on the fly. The map view does not exist separately, it is the ScaledSpace itself. When you zoom out while looking at that -- and ONLY while looking from the map view -- orbits and markers are painted in. I.e. there is no camera I could grab that sees them until the map view is turned on, because they don\u0027t exist, and when they exist, IVA can\u0027t be seen. \u003C/p\u003E\u003Cp\u003ESince there\u0027s no shortcut, the only way to show it on the monitor screen would be to replicate yet another very very small copy of the solar system somewhere in the bowels of the ship, draw all the orbits on THAT, and point a camera at it, which, beyond reimplementing a sizeable portion of KSP code, would involve far more math than I\u0027m capable of.\u003C/p\u003E\u003Cp\u003EI did everything I could to enable someone else to do it by making the monitor pluggable. If someone mathematically inclined knows how to draw it from the available data, they can make their own module that does it and stitch it into RasterPropMonitor easily without ever worrying about my code -- but that someone is not me. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"xxbairdixx","CreatedById":83080,"CreatedDateTime":"2013-11-29T09:37:07Z","Content":"\n\u003Cp\u003Eawww shucks oh well thanks for the explanation \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"xxbairdixx","CreatedById":83080,"CreatedDateTime":"2013-11-29T19:57:50Z","Content":"\n\u003Cp\u003Ei was thinking would it be possible for you to make a monitor part so for instance you could place it inside hollow structures to make bases and custom command modules\u003C/p\u003E\n"},{"CreatedByName":"Mihara","CreatedById":59752,"CreatedDateTime":"2013-11-29T20:44:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022xxbairdixx\u0022 data-cite=\u0022xxbairdixx\u0022\u003E\u003Cdiv\u003Ei was thinking would it be possible for you to make a monitor part so for instance you could place it inside hollow structures to make bases and custom command modules\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn theory, yes it would be possible.\u003C/p\u003E\u003Cp\u003EIn practice, the distinction between InternalModule and PartModule makes it nontrivial to do without duplicating most of the code, which makes it unlikely that I will get up to it any time soon.\u003C/p\u003E\n"},{"CreatedByName":"Mihara","CreatedById":59752,"CreatedDateTime":"2013-11-29T20:49:37Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022color:#00FF00;\u0022\u003EA\u003C/span\u003Ec\u003Cspan style=\u0022color:#00FF00;\u0022\u003Ec\u003C/span\u003Ei\u003Cspan style=\u0022color:#00FF00;\u0022\u003Ed\u003C/span\u003Ee\u003Cspan style=\u0022color:#00FF00;\u0022\u003En\u003C/span\u003Et\u003Cspan style=\u0022color:#00FF00;\u0022\u003Ea\u003C/span\u003El \u003Cspan style=\u0022color:#00FF00;\u0022\u003En\u003C/span\u003Ee\u003Cspan style=\u0022color:#00FF00;\u0022\u003Ew\u003C/span\u003E f\u003Cspan style=\u0022color:#00FF00;\u0022\u003Ee\u003C/span\u003Ea\u003Cspan style=\u0022color:#00FF00;\u0022\u003Et\u003C/span\u003Eu\u003Cspan style=\u0022color:#00FF00;\u0022\u003Er\u003C/span\u003Ee.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/N34OnbV.png\u0022 alt=\u0022N34OnbV.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ENo, seriously, I didn\u0027t expect I could do this until just two hours ago. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"sirkut","CreatedById":57229,"CreatedDateTime":"2013-11-29T20:58:59Z","Content":"\n\u003Cp\u003EHahah. Next thing you\u0027ll add piglatin and 1337 speak filters. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Mihara","CreatedById":59752,"CreatedDateTime":"2013-11-29T21:01:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sirkut\u0022 data-cite=\u0022sirkut\u0022\u003E\u003Cdiv\u003EHahah. Next thing you\u0027ll add piglatin and 1337 speak filters. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, I never could understand the rules of pig latin, and don\u0027t really understand how it\u0027s supposed to be a thing for children to do in their head. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Pingonaut","CreatedById":15723,"CreatedDateTime":"2013-11-30T01:43:48Z","Content":"\n\u003Cp\u003ECan someone post an image showing exactly what buttons do what? I can\u0027t figure out how to switch between docking ports or even cameras (the ones included with the ALCOR mod)\u003C/p\u003E\n"},{"CreatedByName":"Mihara","CreatedById":59752,"CreatedDateTime":"2013-11-30T02:18:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022pingonaut\u0022 data-cite=\u0022pingonaut\u0022\u003E\u003Cdiv\u003ECan someone post an image showing exactly what buttons do what? I can\u0027t figure out how to switch between docking ports or even cameras (the ones included with the ALCOR mod)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you\u0027re talking about this particular prop, a) it\u0027s not set up for the camera part that comes with ALCOR anyway, and \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E such a screenshot is going to be completely obsolete in a few hours when I\u0027m done tuning the new one. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"MOARdV","CreatedById":60950,"CreatedDateTime":"2013-11-30T02:25:38Z","Content":"\n\u003Cp\u003EI\u0027ve spent waaaaay too much time tinkering with building my own pages for an adaptation of the example display in the KOSMOS VA Command Pod (BTW, Mihara, thanks for pointing out that I should use PartTools 0.20 - I had 0.18, which is why I couldn\u0027t figure it out). I do have some feedback / questions:\u003C/p\u003E\u003Cp\u003E1) Would you consider changing all of the formatted time variables to include a space for the sign? Currently, TIMETOAP doesn\u0027t leave a space for the sign, but TIMETOPE does, so if I line the format strings up with the {0} directly above one another, the line with TIMETOPE looks like it is offset by one. Even if the TIMETOAP never has a negative value, adding the extra space ensures that the \u0022time\u0022 strings will line up. Same request with other times, even if they\u0027re never negative.\u003C/p\u003E\u003Cp\u003E2) Is there any way to get the existing buttons (for the ALCOR module, for instance) to behave as single-position buttons (one that doesn\u0027t switch between on and off, but instead act like the \u0027stage\u0027 button should)? I\u0027d like to add some buttons that I could use for the SCANsat extensions, once that\u0027s ready for release, and I don\u0027t think toggle buttons are appropriate. I\u0027m not a modeler, so I\u0027m not sure how to get started along that avenue.\u003C/p\u003E\n"},{"CreatedByName":"Mihara","CreatedById":59752,"CreatedDateTime":"2013-11-30T02:42:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MOARdV\u0022 data-cite=\u0022MOARdV\u0022\u003E\u003Cdiv\u003E1) Would you consider changing all of the formatted time variables to include a space for the sign? Currently, TIMETOAP doesn\u0027t leave a space for the sign, but TIMETOPE does, so if I line the format strings up with the {0} directly above one another, the line with TIMETOPE looks like it is offset by one. Even if the TIMETOAP never has a negative value, adding the extra space ensures that the \u0022time\u0022 strings will line up. Same request with other times, even if they\u0027re never negative.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhile I have OCD as much as the next KSP player, there\u0027s a reason for this particular one: since it can never be negative, it\u0027s better to leave no space, because the user might want to display it separately from TIMETOPE and \u003Cem\u003Eneed\u003C/em\u003E that space.\u003C/p\u003E\u003Cp\u003ESomeday, when I\u0027m feeling particularly bored (next week, maybe) I\u0027ll write a Kerbal time formatter extension that will take care of that problem for good by making time format definable in the page itself, so you can leave off the years if you feel like it, print a heart instead of a sign, etc.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MOARdV\u0022 data-cite=\u0022MOARdV\u0022\u003E\u003Cdiv\u003E2) Is there any way to get the existing buttons (for the ALCOR module, for instance) to behave as single-position buttons (one that doesn\u0027t switch between on and off, but instead act like the \u0027stage\u0027 button should)? I\u0027d like to add some buttons that I could use for the SCANsat extensions, once that\u0027s ready for release, and I don\u0027t think toggle buttons are appropriate. I\u0027m not a modeler, so I\u0027m not sure how to get started along that avenue.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m not clear what exactly do you mean by a \u0027single position button\u0027. One that does not stay toggled, but immediately snaps back after being triggered once?\u003C/p\u003E\u003Cp\u003EIf you mean the JSIActionGroupSwitch-driven buttons, that\u0027s trivial to do but I can\u0027t understand why would you want to do it, because none of the things it can toggle actually behave this way -- and it can\u0027t toggle handler plugins, so they would not be useful for driving SCANsat integration.\u003C/p\u003E\u003Cp\u003EIf you mean buttons on the monitor props, none of them actually switch between on and off -- they make the page \u0022active\u0022 and then become ignored until a button activates a different page.\u003C/p\u003E\u003Cp\u003EIf you mean buttons on monitor props that control handler plugins, those have been working for a while and the SCANsat extension is the first one to use them -- they are made exactly like normal monitor buttons and their action is defined by the plugin that handles the current page (if any).\u003C/p\u003E\u003Cp\u003E...And I\u0027m going to be done tuning the 0.9 release with SCANsat support in it any time now.\u003C/p\u003E\n"},{"CreatedByName":"Mihara","CreatedById":59752,"CreatedDateTime":"2013-11-30T03:49:23Z","Content":"\n\u003Cp\u003EBump for release! Muahahahaha.\u003C/p\u003E\u003Cp\u003ERasterPropMonitor \u003Cstrong\u003E0.9\u003C/strong\u003E released.\u003C/p\u003E\u003Cp\u003EBugs fixed:\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003EMonitor would choke on pages which contained no sources of text. Not anymore.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EWhen switching from a page with a working camera to a page where a camera is missing, the screen would keep showing the working one. Fixed.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAn obscure API issue has been caught before anyone but me used it, whee.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ESome inconsistencies which could have hindered using transparent colors for certain elements were corrected, if you previously tried to make a transparent display and it didn\u0027t work, try again the same way.\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ENew features:\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003EI promised SCANsat integration, and here it is, for suitably small values of \u0022here\u0022: Meet \u003Ca href=\u0022https://github.com/Mihara/RasterPropMonitor/wiki/Background-handlers#jsiscansatrpm\u0022 rel=\u0022external nofollow\u0022\u003EJSISCANsatRPM\u003C/a\u003E. I\u0027d wager those suitably small values will suffice for just about anyone, though. There probably still are some bugs in it. It will obviously remain inactive if SCANsat is not installed.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022color:#ff0000;\u0022\u003EC\u003C/span\u003Eo\u003Cspan style=\u0022color:#00ff00;\u0022\u003El\u003C/span\u003Eo\u003Cspan style=\u0022color:#0000ff;\u0022\u003Er\u003C/span\u003Etags! All text on the monitors can now be colorised letter by letter by using [#rrggbbaa] color sequences in the text -- see the documentation. Associated changes make it easier to create a transparent display, since default text transparency can also be set.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EJSISetInternalCameraFOV module can help you get around the fact that the FOV of IVA cameras is not configurable and fisheye deformation can be too high for some pod layouts.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EBy popular demand, slope of the surface in degrees is now available as a variable. Also, biome name. (Exactly the way MechJeb displays it). Also a shortened biome name for when you can\u0027t be bothered to use the full one.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EPages with background handlers that could not be loaded \u003Cem\u003E(for example, if JSISCANsatRPM did not load, because the user doesn\u0027t have SCANsat)\u003C/em\u003E will now fallback to camera or texture background if those are also present in the page configuration. The same thing will happen with page handlers -- if the handler did not load, the page will fallback to text defined by other means.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe example prop is replaced by the new MFD courtesy of \u003Cstrong\u003Ealexustas\u003C/strong\u003E, which lets me enable the navball plugin and the map plugin on it -- there\u0027s enough buttons now and some are left over. The old example prop will continue working if you installed it into any other pods, unless you do the silly thing and delete it.\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThere are no breaking changes, unless you customised the example prop by directly editing it\u0027s config files and not using ModuleManager. But just in case, \u003Ca href=\u0022http://www./download/pi0fz8g1f0m59x8/RasterPropMonitor%200.8.zip\u0022 rel=\u0022external nofollow\u0022\u003EI did not delete the binaries for version 0.8\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EAnd for everyone who\u0027s trying to incorporate it into their props: Please don\u0027t rely on example configs! They are tuned to particular props and rely on default values which might not be appropriate for your props. There\u0027s a boatload of documentation for you to read.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-30T04:06:23Z\u0022 title=\u002211/30/2013 04:06  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 30, 2013\u003C/time\u003E by Mihara\u003C/strong\u003E\n\u003Cbr\u003Etypo.\n\u003C/span\u003E\n"},{"CreatedByName":"jpinard","CreatedById":89401,"CreatedDateTime":"2013-11-30T04:28:34Z","Content":"\n\u003Cp\u003EHoly cow this is incredible!\u003C/p\u003E\n"},{"CreatedByName":"Termaul","CreatedById":92429,"CreatedDateTime":"2013-11-30T04:35:06Z","Content":"\n\u003Cp\u003EYou are the man , im about to try out the scAnsat mod with this new version. thx for the great work!\u003C/p\u003E\n"},{"CreatedByName":"sirkut","CreatedById":57229,"CreatedDateTime":"2013-11-30T04:53:36Z","Content":"\n\u003Cp\u003EI\u0027m so far behind on playing this. Soon I tell ya! I should stop with the exterior and work on an IVA now with all these goodies.\u003C/p\u003E\n"},{"CreatedByName":"Commander Zoom","CreatedById":8333,"CreatedDateTime":"2013-11-30T10:09:42Z","Content":"\n\u003Cp\u003EAbsolutely amazing work.\u003C/p\u003E\n"},{"CreatedByName":"Pingonaut","CreatedById":15723,"CreatedDateTime":"2013-11-30T12:04:09Z","Content":"\n\u003Cp\u003EThis happened when I updated. Maybe I didn\u0027t delete and replace the right files or something?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/EVrwlTY.png\u0022 alt=\u0022EVrwlTY.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/bln59K4.png\u0022 alt=\u0022bln59K4.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Deep silence","CreatedById":55089,"CreatedDateTime":"2013-11-30T12:10:35Z","Content":"\n\u003Cp\u003E\u0026lt;edited : i managed to make it work. It is sad the mod does not use relative path: I had removed the JSI folder and that was the cause of my problems\u0026gt;\u003C/p\u003E\u003Cp\u003EThis mod looks great, but It lags a lot (except for STBY, LOG, CREW pages).\u003C/p\u003E\u003Cp\u003EThere is nothing special in the debug logs, I am testing on a fresh install (windows KSP on linux), and my other install had only little lags with about 30 mods...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-30T12:43:03Z\u0022 title=\u002211/30/2013 12:43  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 30, 2013\u003C/time\u003E by Deep silence\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Albert VDS","CreatedById":74055,"CreatedDateTime":"2013-11-30T13:08:32Z","Content":"\n\u003Cp\u003EWhy aren\u0027t you using the Linux binary. I say it\u0027s no wonder it lags when you\u0027re using wine.\u003C/p\u003E\n"},{"CreatedByName":"Mihara","CreatedById":59752,"CreatedDateTime":"2013-11-30T14:04:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022pingonaut\u0022 data-cite=\u0022pingonaut\u0022\u003E\u003Cdiv\u003EThis happened when I updated. Maybe I didn\u0027t delete and replace the right files or something?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESeeing as how you have both the old prop and the new prop it\u0027s a very obvious case of an incorrect installation. I don\u0027t know how exactly you messed it up though.\u003C/p\u003E\u003Cp\u003ERemember: GameData directory in the package \u003Cstrong\u003EMUST\u003C/strong\u003E \u003Cem\u003Ematch\u003C/em\u003E your GameData directory. Everything that is inside the GameData directory in the package must be within your GameData directory. And yes, this mod now needs two separate directories in GameData. \u003Cem\u003E(If there\u0027s anyone in particular to blame for this, I think it\u0027s probably N3X15, who, if my memory serves me right, is the developer who made the plugin loading mechanism that rejects plugins that call other plugins if those other plugins have not been loaded YET -- but loads them in alpabetical order.)\u003C/em\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Deep silence\u0022 data-cite=\u0022Deep silence\u0022\u003E\u003Cdiv\u003E\u0026lt;edited : i managed to make it work. It is sad the mod does not use relative path: I had removed the JSI folder and that was the cause of my problems\u0026gt;\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt can\u0027t use relative path. It relies a lot on textures loaded through GameDatabase, which KSP mandates \u003Cstrong\u003Emust\u003C/strong\u003E be named relative to GameData. Using non-absolute path for everything else would be incredibly silly as it would break anyway.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Deep silence\u0022 data-cite=\u0022Deep silence\u0022\u003E\u003Cdiv\u003EThis mod looks great, but It lags a lot (except for STBY, LOG, CREW pages).\u003Cp\u003EThere is nothing special in the debug logs, I am testing on a fresh install (windows KSP on linux), and my other install had only little lags with about 30 mods...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis mod makes heavy use of RenderTextures. I suspect that just isn\u0027t getting emulated correctly, indeed, try the linux KSP.\u003C/p\u003E\n"}]}