{"TopicId":52931,"ForumId":34,"TopicTitle":"[1.12.3\u002B] RealChute Parachute Systems v1.4.9.4 | 02/06/24","CreatedByName":"stupid_chris","CreatedById":62017,"CreatedDateTime":"2013-11-13T05:15:43Z","PageNum":144,"Articles":[{"CreatedByName":"techstepman","CreatedById":68505,"CreatedDateTime":"2015-06-01T21:18:10Z","Content":"\n\u003Cp\u003Ethis version of realchute has broken the Sum Dum Heavy Industries - Service Module System docking port- the clampotron one.its the only piece im using from that mod. everytime I use it my craft goes out of control around 6-7 kms while the camera drifts from the center of the rocket and other times while the craft is not launched yet it shows a speed of 174 m/s while still on the launch pad and if launched the craft will fly to outer space uncontrolled.\u003C/p\u003E\u003Cp\u003Eremoved realchute and the docking port didn\u0027t cause any problems but without realchute its chutes are terrible and useless.took me all sunday night to Monday morning to figure this out and replicate the problem to pin it down to this.\u003C/p\u003E\u003Cp\u003Esumghai the creator of Sum Dum Heavy Industries - Service Module System referred me here to find a solution. Any ideas?\u003C/p\u003E\u003Cp\u003EEDIT: problem has been solved by latest dev release of sdhi sms.\u003C/p\u003E\u003Cp\u003Estupid_chris it cant rain forever. better things are ahead , just hold on until then.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-01T22:18:55Z\u0022 title=\u002206/01/2015 10:18  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 1, 2015\u003C/time\u003E by techstepman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"stupid_chris","CreatedById":62017,"CreatedDateTime":"2015-06-01T21:29:08Z","Content":"\n\u003Cp\u003EOkay, many of you may have noticed my inactivity here over the past few weeks. This is due to two major things.\u003C/p\u003E\u003Cp\u003EFirst, I\u0027ve been through a rough patch physically and emotionally over the past three weeks, and I\u0027ve been in no real shape or mood to take care of this.\u003C/p\u003E\u003Cp\u003ESpeaking of which, this brings us to the second point: help yourself, and help me help you. The number one reason I have not replied to any of the bug reports or help requests is because none of them, and I saiy \u003Cstrong\u003Enone\u003C/strong\u003E of them have had anywhere close to the amount of information I need. While telling me stuff is broken, and giving me screenshots to say \u0022look it\u0027s weird\u0022 is pretty nice, it does not help me at all. I\u0027ve said it before, and I\u0027ll say it now, and make it very official now:\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EI am not replying to any support request which will not comply with the \u003C/span\u003E\u003C/strong\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/92229\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003Estandard support/bug reporting format\u003C/span\u003E\u003C/strong\u003E\u003C/a\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E.\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThis also applies to the bug reports on the GitHub repository. If you submit a bug that does not comply to this, I\u0027ll either not reply at all to it, or close it if I\u0027m in a bad mood.\u003C/p\u003E\u003Cp\u003EThat\u0027s all.\u003C/p\u003E\n"},{"CreatedByName":"Kowgan","CreatedById":116874,"CreatedDateTime":"2015-06-01T22:05:55Z","Content":"\n\u003Cp\u003EI hope things get better for you soon, Chris. Best wishes.\u003C/p\u003E\n"},{"CreatedByName":"bobprime","CreatedById":115505,"CreatedDateTime":"2015-06-02T23:36:07Z","Content":"\n\u003Cp\u003EMy favorite rule of thumb is all good bug reports come with a patch.\u003C/p\u003E\n"},{"CreatedByName":"Bobe","CreatedById":95803,"CreatedDateTime":"2015-06-03T14:33:18Z","Content":"\n\u003Cp\u003EDoes RealChute actually generate career contracts, or does the game just pick a random parts manufacturer to be the agent for each contract?\u003C/p\u003E\n"},{"CreatedByName":"futrtrubl","CreatedById":77310,"CreatedDateTime":"2015-06-04T02:29:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bobe\u0022 data-cite=\u0022Bobe\u0022\u003E\u003Cdiv\u003EDoes RealChute actually generate career contracts, or does the game just pick a random parts manufacturer to be the agent for each contract?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERandom.\u003C/p\u003E\n"},{"CreatedByName":"Capt. Hunt","CreatedById":97860,"CreatedDateTime":"2015-06-04T02:36:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bobe\u0022 data-cite=\u0022Bobe\u0022\u003E\u003Cdiv\u003EDoes RealChute actually generate career contracts, or does the game just pick a random parts manufacturer to be the agent for each contract?\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022futrtrubl\u0022 data-cite=\u0022futrtrubl\u0022\u003E\u003Cdiv\u003ERandom.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAre you sure? I\u0027d swear I\u0027ve seen Wenkel corp contracts to test realchutes parts, maybe the parts test contracts use the part manufacturer while the others are random.\u003C/p\u003E\n"},{"CreatedByName":"Bobe","CreatedById":95803,"CreatedDateTime":"2015-06-04T02:47:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Capt. Hunt\u0022 data-cite=\u0022Capt. Hunt\u0022\u003E\u003Cdiv\u003EAre you sure? I\u0027d swear I\u0027ve seen Wenkel corp contracts to test realchutes parts, maybe the parts test contracts use the part manufacturer while the others are random.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPossibly. This was a contract to build a space station that obviously didn\u0027t have any chutes, but the agent was just RealChute not Wenkel Corp.\u003C/p\u003E\n"},{"CreatedByName":"Kowgan","CreatedById":116874,"CreatedDateTime":"2015-06-04T05:17:05Z","Content":"\n\u003Cp\u003EThe RealChute parts are added to the \u0022subject to test\u0022 club through a module, and the flags/companies are choosen randomly by KSP.\u003C/p\u003E\u003Cp\u003ERealchute itself doesn\u0027t generate any contracts; all is done by stock KSP. You got lucky on that contract. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Glyph","CreatedById":107405,"CreatedDateTime":"2015-06-04T16:24:13Z","Content":"\n\u003Cp\u003EI edited my config files to set the deployment and predeployment altitudes and now there is no \u0022Next Size\u0022 or \u0022Previous Size\u0022 buttons on realchute parachutes in the editor. Anyone know what I might have done wrong?\u003C/p\u003E\u003Cp\u003Eedit: NVM, I read more of this thread. It seems I needed to go to action groups tab. I think this is unfortunate and unexpected for users.\u003C/p\u003E\n"},{"CreatedByName":"cipherpunks","CreatedById":114858,"CreatedDateTime":"2015-06-04T16:29:41Z","Content":"\n\u003Cp\u003EPlease support \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/121217-1-0-2-Bacon-Labs-Stockalike-Ariane-More-Version-1-0-Official-Release!-13-May\u0022 rel=\u0022external nofollow\u0022\u003EBaconLabs parachute docking port\u003C/a\u003E also (on stock, descent speed is like 13.8 - bad, bad).\u003C/p\u003E\u003Cp\u003E TIA.\u003C/p\u003E\n"},{"CreatedByName":"Kowgan","CreatedById":116874,"CreatedDateTime":"2015-06-05T17:41:24Z","Content":"\n\u003Cp\u003EDamn, I forgot about that cargo bay bug which won\u0027t unshield parts that leave the area. Then, I somehow borked KSP.\u003C/p\u003E\u003Cp\u003EFunny thing is, I don\u0027t know what are the exact triggers to make it work or not. I\u0027ve tested it many times, but couldn\u0027t find a pattern. Sometimes the chutes work, sometimes they don\u0027t.\u003C/p\u003E\u003Cp\u003EToo bad (and weird) the StockBugFixModules decided to deprecate that fix, since the bug still happens.\u003C/p\u003E\u003Cp\u003EWhy am I writing this here?\u003C/p\u003E\u003Cp\u003E-Update-\u003C/p\u003E\u003Cp\u003EWell, seems like the problem isn\u0027t the cargo bay. I tried to reproduce the issue in order to get logs, but everything worked as they should.\u003C/p\u003E\u003Cp\u003ENow, when the problem first occurred, I quickloaded several times, trying to solve it. And I noticed the chutes inside the cargo bay would deploy and revert for a split of second, right after the quickload. Even though they haven\u0027t been staged before the quickload. I suspect this is something related to the \u0022deployed chutes disappear on quickload\u0022 problem, which was fixed on RC v1.2.5.\u003C/p\u003E\u003Cp\u003EThis needs further testing, and logs. Until then, I\u0027m just writing this as an observation, in case someone else experience the same issue. This is not a fix request.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-06T07:37:54Z\u0022 title=\u002206/06/2015 07:37  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 6, 2015\u003C/time\u003E by Kowgan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KoolBreeze420","CreatedById":103315,"CreatedDateTime":"2015-06-06T18:30:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022linuxgurugamer\u0022 data-cite=\u0022linuxgurugamer\u0022\u003E\u003Cdiv\u003EBe advised that as of now (9:35 PM, EDT) CKAN is not installing the latest version. Latest version on kerbalstuff is 1.3.2.1, CKAN installs 1.3.2\u003Cp\u003EReplacing 1.3.2 with 1.3.2.1 fixes a number of problems.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EBug report:\u003C/p\u003E\u003Cp\u003ERealChute 1.3.2.1\u003C/p\u003E\u003Cp\u003EWhen it is installed, the Engineer\u0027s Report always says that the is no paracute: This command pod has crew assigned but no parachute attached.\u003C/p\u003E\u003Cp\u003EIt doesn\u0027t seem to affect the ship itself, just the engineer\u0027s report\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDid you figure this out I know he said he has answered it but I Can\u0027t find it anywhere my engineer report doesn\u0027t recognize when chutes are on like you have said here in this post.\u003C/p\u003E\n"},{"CreatedByName":"Kowgan","CreatedById":116874,"CreatedDateTime":"2015-06-07T03:45:04Z","Content":"\n\u003Cp\u003EKoolBreeze420: See \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/57988-1-0-2-Wenkel-Corporation-RealChute-Parachute-Systems-v1-3-2-3-2-05-15?p=1934644\u0026amp;viewfull=1#post1934644\u0022 rel=\u0022external nofollow\u0022\u003Ethis post\u003C/a\u003E.\u003C/p\u003E\n"},{"CreatedByName":"JeeF","CreatedById":143053,"CreatedDateTime":"2015-06-08T00:34:38Z","Content":"\n\u003Cp\u003EAny plans for supporting 64bit version?\u003C/p\u003E\u003Cp\u003EHard to give up on 200\u002B mods for just 1.\u003C/p\u003E\n"},{"CreatedByName":"sumghai","CreatedById":66272,"CreatedDateTime":"2015-06-08T01:45:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JeeF\u0022 data-cite=\u0022JeeF\u0022\u003E\u003Cdiv\u003EAny plans for supporting 64bit version?\u003Cp\u003EHard to give up on 200\u002B mods for just 1.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs stupid_chris has said many, many times, there will be no 64-bit version of RealChute.\u003C/p\u003E\u003Cp\u003EContrary to whatever community fixes being offered suggest, KSP 64-bit is still unstable, to the point where it is nigh-on impossible for modders to determine whether a bug is caused by their work or the game itself. Since these problems can\u0027t be fixed, most plugin authors opt to disable their plugins on 64-bit installations. Unfortunately, there have been a number of people who have disrespected the decision plugin authors, by trying to circumvent the 64-bit locks, and then insisted that the original plugin authors provide support anyway.\u003C/p\u003E\u003Cp\u003EAs a result of this sort of mistreatment, some plugin authors have quit KSP altogether, depriving both 32 and 64-bit users of some excellent add-ons. stupid_chris himself was also almost driven away, and was only convinced to stay after everyone promised we\u0027d behave. \u003C/p\u003E\u003Cp\u003EPlease don\u0027t make his second departure a permanent one.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-08T01:47:59Z\u0022 title=\u002206/08/2015 01:47  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 8, 2015\u003C/time\u003E by sumghai\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ManuxKerb","CreatedById":139441,"CreatedDateTime":"2015-06-08T10:10:04Z","Content":"\n\u003Cp\u003EHi\u003C/p\u003E\u003Cp\u003EI can happy report that RealChute does work without issue on the 64 bit linux version. I guess mac version will also work. So if you have 64 bit it should work. Can you elabrate on the issue ?\u003C/p\u003E\u003Cp\u003EThanks\u003C/p\u003E\n"},{"CreatedByName":"sumghai","CreatedById":66272,"CreatedDateTime":"2015-06-08T20:46:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ManuxKerb\u0022 data-cite=\u0022ManuxKerb\u0022\u003E\u003Cdiv\u003EI can happy report that RealChute does work without issue on the 64 bit linux version. I guess mac version will also work. So if you have 64 bit it should work. Can you elabrate on the issue ?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELinux64 is officially considered stable by the developers, and stupid_chris has happily provided support for Linux users in the past.\u003C/p\u003E\u003Cp\u003EWin64, however, is unstable, no matter what the alleged \u0022community fixes\u0022 suggest.\u003C/p\u003E\n"},{"CreatedByName":"ManuxKerb","CreatedById":139441,"CreatedDateTime":"2015-06-08T20:50:13Z","Content":"\n\u003Cp\u003EHi\u003C/p\u003E\u003Cp\u003EI know that, but as JeeF stated indirectly he is using the 64 bit version. As there is no offial 64 bit version for windows, he must be using the linux or mac version. And they work fine. So if he has problems he should elaborate.\u003C/p\u003E\u003Cp\u003EHope this made my comment clearer.\u003C/p\u003E\n"},{"CreatedByName":"DuoDex","CreatedById":107061,"CreatedDateTime":"2015-06-08T20:56:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ManuxKerb\u0022 data-cite=\u0022ManuxKerb\u0022\u003E\u003Cdiv\u003EHi\u003Cp\u003EI know that, but as JeeF stated indirectly he is using the 64 bit version. As there is no offial 64 bit version for windows, he must be using the linux or mac version. And they work fine. So if he has problems he should elaborate.\u003C/p\u003E\u003Cp\u003EHope this made my comment clearer.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes it did - just so you know you can use Realchutes on Linux 64-bit without worrying, last I checked Realchutes was only disabled for Windows x64 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"sumghai","CreatedById":66272,"CreatedDateTime":"2015-06-08T21:02:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ManuxKerb\u0022 data-cite=\u0022ManuxKerb\u0022\u003E\u003Cdiv\u003EI know that, but as JeeF stated indirectly he is using the 64 bit version. As there is no offial 64 bit version for windows, he must be using the linux or mac version. And they work fine. So if he has problems he should elaborate.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you had looked at JeeF\u0027s post history, you\u0027ll see that he\u0027s actually a Win64 user, as per his responses in the [thread=117224]Windows 64 bit community workaround[/thread] thread:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JeeF\u0022 data-cite=\u0022JeeF\u0022\u003E\u003Cdiv\u003ELike a charm! Lots of mods loaded, textures and graphics maxxed out, over 8gb of ram used and stable as a rock! XD\u003Cp\u003EThis is after 8 hours straight playing while using many other programs in the background and not a single crash:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s14.postimg.org/j9a5exx9d/Capture.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://s14.postimg.org/j9a5exx9d/Capture.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBtw, I\u0027ve also gained quite a bit of fps. 100 part rocket on re-entry before with half of these mods and 1/8 texture was about 8fps.\u003C/p\u003E\u003Cp\u003ENow with all graphics maxed out and full res textures with the same rocket on re-entry I\u0027m around 50-60fps. XD\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JeeF\u0022 data-cite=\u0022JeeF\u0022\u003E\u003Cdiv\u003EMaybe cos of me restarting/shutting down my computer once every 6 months. I just put it in standby and leave everything running.\u003Cp\u003EGot my first crash using the 64 bits. KSP was at 13gb ram usage after 48 hours running straight, when I started getting some graphical glitches and it eventually crashed during a launch.\u003C/p\u003E\u003Cp\u003EMust have something to do with Project Cars running in the background and Vegas encoding a video.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JeeF\u0022 data-cite=\u0022JeeF\u0022\u003E\u003Cdiv\u003EYes the only mod I had to stop using was RealChute, a great tradeoff if you ask me.\u003Cp\u003EAnd for the buildings, just enter and exit the contract buildings and it fixes it! =)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Dazpoet","CreatedById":132380,"CreatedDateTime":"2015-06-08T21:26:49Z","Content":"\n\u003Cp\u003ESo I\u0027m probably just being dumb here... I added this mod, played around with the settings etc but I can\u0027t seem to get the program to account for all parachutes together, is this simply not supported?\u003C/p\u003E\u003Cp\u003EHere\u0027s a typical scenario:\u003C/p\u003E\u003Cp\u003EMk1 pod with a RealChute top chute (the first one in career) and 2 radial real chutes. Add enough weight below so that the single chute on top can\u0027t handle landing safely alone. Go into actiongroups and set up the topmounted chute, tell it desired landing speed etc and have it calculate, it\u0027ll throw a warning about not being able to handle it. Do the same thing for the 2 radial chutes (who are created with symmetry) and they\u0027ll also throw a warning. However when attempting to land all chutes deploy and landing speed is ludicrus, as in really low since all chutes maxed out.\u003C/p\u003E\u003Cp\u003EIt says in the first post that I can\u0027t have more chutes than one in the same part so I tried the above scenario with the radial chutes on another part (should I only ever put 1 radial per part aswell?) but still no dice.\u003C/p\u003E\u003Cp\u003ETL;DR: I\u0027m a dumbass and can\u0027t seem to figure out how to have the RealChute calculator thingie in the action groups window realize I have multiple parachutes. I\u0027m betting there\u0027s a button activating this which is gigantic and obvious and I\u0027ve scrolled past it 20 times.\u003C/p\u003E\n"},{"CreatedByName":"Gryphon","CreatedById":58513,"CreatedDateTime":"2015-06-08T22:23:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dazpoet\u0022 data-cite=\u0022Dazpoet\u0022\u003E\u003Cdiv\u003E...can\u0027t seem to figure out how to have the RealChute calculator thingie in the action groups window realize I have multiple parachutes. I\u0027m betting there\u0027s a button activating this which is gigantic and obvious and I\u0027ve scrolled past it 20 times.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhen you are calculating for multiple chutes, you want \u0022Parachutes used (parachutes):\u0022 and set that to how many parachute parts you are using to achieve the desired target speed.\u003C/p\u003E\n"},{"CreatedByName":"Olsson","CreatedById":20218,"CreatedDateTime":"2015-06-11T19:33:38Z","Content":"\n\u003Cp\u003EAlright I have a question. Trying to land on Duna can be hard as the atmosphere wont slow you down enough so once you need that chute to be deployed you might be going too fast. But the problem is I can\u0027t deploy a drogue/drag chute above 350m/s because I\u0027m using deadly re-entry continued. What\u0027s the point of the different materials besides their drag? And is there someway to allow drogue chutes to open at higher than 350m/s?\u003C/p\u003E\n"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2015-06-11T22:50:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Olsson\u0022 data-cite=\u0022Olsson\u0022\u003E\u003Cdiv\u003EAlright I have a question. Trying to land on Duna can be hard as the atmosphere wont slow you down enough so once you need that chute to be deployed you might be going too fast. But the problem is I can\u0027t deploy a drogue/drag chute above 350m/s because I\u0027m using deadly re-entry continued. What\u0027s the point of the different materials besides their drag? And is there someway to allow drogue chutes to open at higher than 350m/s?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh no no no.... don\u0027t you blame Deadly Reentry anymore! We don\u0027t destroy chutes anymore. Both stock and RC do our dirty work for us.\u003C/p\u003E\n"}]}