{"TopicId":53064,"ForumId":34,"TopicTitle":"[WIP][TechTree @ 0.23.5] - [MS19e] - Realistic Progression LITE","CreatedByName":"MedievalNerd","CreatedById":84735,"CreatedDateTime":"2013-11-14T04:44:51Z","PageNum":70,"Articles":[{"CreatedByName":"Semmel","CreatedById":90652,"CreatedDateTime":"2014-05-31T11:47:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MedievalNerd\u0022 data-cite=\u0022MedievalNerd\u0022\u003E\u003Cdiv\u003EIt\u0027s definitely true that handling all these mods for a new comer to KSP could be, and surely is, daunting to say the least. And yes, reading all the OP\u0027s and following up on any post installation instructions adds another layer of difficulty.\u003Cp\u003EIn terms of segregating mods from stock KSP, that would be hard considering I use some models of those mods for RPL probes. IE, Sputnik 2 is a resized KW Rocketry nosecone. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EBut you did point to something Nathan and I previously suggested. IE, if you use PP or StretchySRB for fuel tanks, then you can definitely delete the tanks for those mods manually. That would downsize the amount of parts considerably. Same thing with fairings, if you use procedural fairings, don\u0027t need all the NP/KW fairings. As long as you make sure not to delete stuff that is being used for RPL Probes/Experiments. If you go in the parts of the RPL Tweak Pack you can check which model I use, for the most part I stuck to stock.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, especially as a newcommer, its impossible to know what to delete and what not. Also, I was persuing the idea of writing a not-needed delete script to address that problem, but I do not want to be made responsible for damaging peoples PCs for rackless use of that script, so I stopped. It might be possible however, to deal with the parts issue on the tech tree level. I assume that you handpick all the parts that go into one node. Therefore, you can decide to leave all the not-needed parts away. To give such delete instructions for new players is only a source for mistakes and further installation issues. Giving users instructions to delete parts is just asking for trouble. Its much better to be handled on a install script which is likely not going to happen or within the tech tree it self.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MedievalNerd\u0022 data-cite=\u0022MedievalNerd\u0022\u003E\u003Cdiv\u003EAgain speaking parts, anything pertaining to engines so KW, NP, the oms \u0026amp; double oms engines from the Shuttle Engines, etc. Those are rather crucial if you don\u0027t want to end up with a lack of engines/thrust at a certain tech level.\u003Cp\u003ENothing stops someone to not include all the mods, but one should do so carefully and not arbitrarily. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs for making RPL \u0022stock compatible\u0022, that wouldn\u0027t work considering that RPL has been heavily modeled based on Nathan\u0027s Rfts. So engine diversity/choice would be heavily restrictive. With engine sizes going up to 10M, you need a good diversity of models/sizes. Plus there are already a crazy amount of nodes, if I start put sub nodes to each node for \u0027non stock\u0027 mods it would be probably pretty hard to keep it looking decent. It\u0027s already pretty bizarrely shaped. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI wasnt talking about the engines. The engines and their variety are absolutely necessary for RPL. I also didnt want to imply to make subnodes for each tech node that you have. I ment to leave away non-essential parts in the main node and collact non-essential parts into a small number of nodes, sorted by topic. For example:\u003C/p\u003E\u003Cp\u003EOne node that contains all the Mercury parts in GameData/FASA/Mercury/ except the engines (and other stuff included in the tech tree). So you get a mercury node that can be unlocked if you have all the tech required for it. An other node would be than for all the Soyuz stuff, which is not really necessary for the RPL tech tree (except maybe the engines) and only cludder everything with stuff that is not very useful if you do not want to build a soyuz rocket.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MedievalNerd\u0022 data-cite=\u0022MedievalNerd\u0022\u003E\u003Cdiv\u003EBut let\u0027s keep in mind RPL is still in it\u0027s alpha stages to polish and such is still miles away from the final \u0027vision\u0027. I\u0027ll be working on polish and clarifying installation instructions as development moves forward. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOf course, I dont know what you envision for RPL and its entirely up to your judgement what you want to do with it. I just give you my idea and what I like vs what I dont like within the current version. If that helps you make a better mod, I am happy \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E If you think about my suggestions and decide against them, thats fine as well, at least you thought about it and had a reason not to do it. BTW, restricting the number of parts has one more advantage that just occurred to me. In the next version of KSP, money will play a role. It will be very difficult to balance the RPL tree with that aspect. The less parts you have to balance, the easier it is for you ;-)\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MedievalNerd\u0022 data-cite=\u0022MedievalNerd\u0022\u003E\u003Cdiv\u003EAnd stuff like IR or LAZOR, I placed them in the tree as to make them optional. I\u0027m not sure if I\u0027ll use them to make experiments down the road. But those are like not even on my radar for now in terms of integrating experiments to them. See this a sort of disclaimer. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat is well appreciated and I think a good approach at the moment. I personally dont use LAZOR (since its in Extra, I think one can simply leave it away), but I love the way the interstellar mod, the IR mod, the AIES aerospace mod, Remote Tech and KW rocketry are integrated. Very good job on these.\u003C/p\u003E\n"},{"CreatedByName":"TheJoseph98","CreatedById":81838,"CreatedDateTime":"2014-05-31T14:14:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E#4 - Realism Overhaul Tweak/Resize Pack - By NathanKell \u0026amp; Myself (LINK): NOTE: follow the instructions immediately below the download to switch to the RftSEngines engine configs.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGood god, why is installation so complicated, I can\u0027t find the bloody tweak/resize pack\u003C/p\u003E\u003Cp\u003EAnd also, I can\u0027t find download link for Remotetech 2 anywhere\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-31T14:23:15Z\u0022 title=\u002205/31/2014 02:23  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 31, 2014\u003C/time\u003E by TheJoseph98\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ThorBeorn","CreatedById":96670,"CreatedDateTime":"2014-05-31T14:49:26Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/59207-0-23-5-Realism-Overhaul-ROv5-1-Modlist-for-RSS-5-7-14\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/59207-0-23-5-Realism-Overhaul-ROv5-1-Modlist-for-RSS-5-7-14\u003C/a\u003E - Realism Overhaul, download link is under the picture in the first post.\u003C/p\u003E\u003Cp\u003EAs for Remote Tech 2, it\u0027s download link on Spaceport is dead, since Spaceport is no more. Don\u0027t know what to do about that. Someone could P.M you a dropbox link with a copy of their RT2 if that\u0027s allowed. Otherwise wait until the RT2 guys fix a new download link. Also make sure you get the community hotfix for RT2.\u003C/p\u003E\n"},{"CreatedByName":"MedievalNerd","CreatedById":84735,"CreatedDateTime":"2014-05-31T19:27:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ThorBeorn\u0022 data-cite=\u0022ThorBeorn\u0022\u003E\u003Cdiv\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/59207-0-23-5-Realism-Overhaul-ROv5-1-Modlist-for-RSS-5-7-14\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/59207-0-23-5-Realism-Overhaul-ROv5-1-Modlist-for-RSS-5-7-14\u003C/a\u003E - Realism Overhaul, download link is under the picture in the first post.\u003Cp\u003EAs for Remote Tech 2, it\u0027s download link on Spaceport is dead, since Spaceport is no more. Don\u0027t know what to do about that. Someone could P.M you a dropbox link with a copy of their RT2 if that\u0027s allowed. Otherwise wait until the RT2 guys fix a new download link. Also make sure you get the community hotfix for RT2.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERT2 is still up on github, just use the second link on the RT2 OP. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E(He calls it bugs \u0026amp; reports I think, but the build is there)\u003C/p\u003E\n"},{"CreatedByName":"Semmel","CreatedById":90652,"CreatedDateTime":"2014-06-02T12:36:11Z","Content":"\n\u003Cp\u003EGeneral Question:\u003C/p\u003E\u003Cp\u003EHow do you design rockets in RPL? I tried to go after creating a family of launch vehicles that can carry some tons into orbit. However, as I progress in the tree, I find that I use one type of launch assembly very scarcely. I designed a 2.5T lifter for a communication satellite network and if I remember correctly, I also used it for the Luna and earth orbit bio mission. For the Mars and Venus flyby missions, I am now in the progress of designing a 5T lifter. But how much dV to give the lifting rocket? Am I going more for security and give it 10.000m/s dV? But what to do with the left-over dV, once in orbit?\u003C/p\u003E\u003Cp\u003EI already used a 5T, 10000 dV lifting rocket for the NK1 experiment (Bio sample return from moon orbit). Once in Orbit of Earth, I had almost 1000 m/s dV left over from the launch, so I decided to use it to boost the way to the moon. Making it so, that the second stage with the leftover dV will deorbit. Then I spend the fuel of the probe that went to the moon. Of course, in the end, I had a lot of dV left in it, which was simply lost. How to deal with that? Just ignore left-over dV as long as the mission is a success? Doesn\u0027t hurt to have extra, does it? So if designing standard rockets, this is going to happen almost all the time.\u003C/p\u003E\u003Cp\u003EOr is it better to design an edge-on rockets for each payload? Costs much more time to do, but .. it is more effective in terms of fuel consumption. On the other hand, in reality the same rocket is launched many times with different payload. So what do they do with left-over dV? I am not in the Falcon 9R aera yet where I can strap landing lags on my rockets.. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E So what to do here? Just design the best rocket possible for a given level of technology and use it for all launches, no matter how much dV is wasted? I hate to waste dV.\u003C/p\u003E\u003Cp\u003EMedievalNerd: Might I request one more part early on in the tech tree, please? It would be great if it were possible to mount a small computer core, radially onto second stages of rockets, so I can manually deorbit them with the leftover fuel from the accent. In reality, this is not necessary because the atmosphere takes care of that in a matter of weeks after a launch. But in KSP, space debris is on rails and will not deorbit, even if well into the atmosphere. It would be great to keep my orbit clean \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E The control module could be build into the always-on antennas, or in a small, radially mounted device.. It would also be neat if it were as heavy as a battery pack, that can be mounted on the opposite side of the control unit.\u003C/p\u003E\u003Cp\u003ECheers,\u003C/p\u003E\u003Cp\u003ESemmel\u003C/p\u003E\n"},{"CreatedByName":"Makeone","CreatedById":79935,"CreatedDateTime":"2014-06-02T18:32:50Z","Content":"\n\u003Cp\u003EI think that such small probe core comes with FASA or some other recommended parts packs, it just sits in control tab rather than command tab. They also made some similar mini probe cores in the modelling challenge or what ever it was called.\u003C/p\u003E\u003Cp\u003EMedivalNerd: could you fix the explorer explanation part that it does NOT contain an antenna and requires one to actually work. Also, the Swedish(Sic!) bio probe has both exams marked as SL (SpaceLow), makes obviously easier to do the mission, but as i always fail to de-orbit it properly (as there is no torque on anything...).\u003C/p\u003E\u003Cp\u003ESemmel: I think that you should design your rocket the way you think they work. Optimal dV for orbit is 9,500m/s, but to me, that is really super optimal launch, and as this is still KSP where we are the \u0027computer\u0027 that flies the rockets, it doesn\u0027t hurt to pack a little extral, like 10,500m/s. Like you said, rest goes to waist if you get perfect launch...like ever? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlso true, that now that i restarted my career on RSS, i have managed to get stuff up with pretty much \u0027standard\u0027 rocket where both main sections were KeroLOx and 3rd, orbital stage was hypergolic. Bigger problem sometimes is the need for proper engine, as there one with 1150KN and then next is whooping 9MN, but i found that 5 LR29\u0027s can give nice thrust, close to 2000KN.\u003C/p\u003E\n"},{"CreatedByName":"Semmel","CreatedById":90652,"CreatedDateTime":"2014-06-03T08:27:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Makeone\u0022 data-cite=\u0022Makeone\u0022\u003E\u003Cdiv\u003EI think that such small probe core comes with FASA or some other recommended parts packs, it just sits in control tab rather than command tab. They also made some similar mini probe cores in the modelling challenge or what ever it was called.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOk, Ill have a look into the FASA stuff.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Makeone\u0022 data-cite=\u0022Makeone\u0022\u003E\u003Cdiv\u003ESemmel: I think that you should design your rocket the way you think they work. Optimal dV for orbit is 9,500m/s, but to me, that is really super optimal launch, and as this is still KSP where we are the \u0027computer\u0027 that flies the rockets, it doesn\u0027t hurt to pack a little extral, like 10,500m/s. Like you said, rest goes to waist if you get perfect launch...like ever? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, a little extra is not bad. I just hate to waste stuff .. But I cant be bothered to produce useless mini-payloads that eat up superfluous mass. Like, I use the 5T launch system to launch a 4T probe and the remaining 1T just.. well, deorbits in terms of unused fuel. And I got pretty good in launching. I guess in only 10-15% of the launches, I make a fatal mistake, usually turning too early for very heavy rockets. So maybe going for a 100% success rate would be more a goal to achieve on the cost of some wasted dV instead of accepting failure in 10%.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Makeone\u0022 data-cite=\u0022Makeone\u0022\u003E\u003Cdiv\u003EAlso true, that now that i restarted my career on RSS, i have managed to get stuff up with pretty much \u0027standard\u0027 rocket where both main sections were KeroLOx and 3rd, orbital stage was hypergolic. Bigger problem sometimes is the need for proper engine, as there one with 1150KN and then next is whooping 9MN, but i found that 5 LR29\u0027s can give nice thrust, close to 2000KN.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI had a similar problem for my 5T launcher. But then I discovered the adapter plate that lets me mount multiple engines which gives a lot more flexibility. With the adapter plate, it would even be possible to just restrict one self to a small selection of rockets instead of using what ever the tech tree provides. Its good to have the choices, but using a colorful family of rocket engines is not realistic.\u003C/p\u003E\u003Cp\u003ENathanKell: Would it be possible to add engine failure rates into the rfts mod? Someone else probably suggested that before.. would be nice to have an \u0022engine out\u0022 capability rocket like the Falcon9.. don\u0027t know about the mechanic though..\u003C/p\u003E\u003Cp\u003EEdit: The community was again faster than me. Just found this: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/81794-Alpha-1-Dang-It!-A-random-failures-mod\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/81794-Alpha-1-Dang-It!-A-random-failures-mod\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ECheers,\u003C/p\u003E\u003Cp\u003ESemmel\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-03T14:09:55Z\u0022 title=\u002206/03/2014 02:09  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 3, 2014\u003C/time\u003E by Semmel\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TheJoseph98","CreatedById":81838,"CreatedDateTime":"2014-06-06T18:20:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheJoseph98\u0022 data-cite=\u0022TheJoseph98\u0022\u003E\u003Cdiv\u003EGood god, why is installation so complicated, I can\u0027t find the bloody tweak/resize pack\u003Cp\u003EAnd also, I can\u0027t find download link for Remotetech 2 anywhere\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m quoting myself from few days ago, I\u0027m on Realism Overhaul page, but I can\u0027t find this tweak/resize pack and installation is so complicated, I demand a installation video tutorial\u003C/p\u003E\u003Cp\u003Eand also, why can\u0027t you just put everything in one zip file, why do we have to download all those mods and fixes and god knows what not individually?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-06T18:24:37Z\u0022 title=\u002206/06/2014 06:24  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 6, 2014\u003C/time\u003E by TheJoseph98\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MedievalNerd","CreatedById":84735,"CreatedDateTime":"2014-06-06T18:36:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheJoseph98\u0022 data-cite=\u0022TheJoseph98\u0022\u003E\u003Cdiv\u003EI\u0027m quoting myself from few days ago, I\u0027m on Realism Overhaul page, but I can\u0027t find this tweak/resize pack and installation is so complicated, I demand a installation video tutorial\u003Cp\u003Eand also, why can\u0027t you just put everything in one zip file, why do we have to download all those mods and fixes and god knows what not individually?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh, so you are making demands now? That\u0027s interesting, I\u0027m definitely inclined to give in when asked so nicely.\u003C/p\u003E\u003Cp\u003EAs for why not all in one zip question, that\u0027s been asked numerous times and answered. Multi-tiered problem, from licensing, to updates \u0026amp; inconsistent releases. It would be hell to maintain. If someone wants to go out of their way and ask all the modders for their permission, combine the pack, and host it while making sure to keep it updated. Go right ahead. But it should be known that some modders already said no, and I sort of understand their reasons. The last thing you want is to have people popping on your page, posting issues that have been fixed in the latest release, but the \u0027pack\u0027 wasn\u0027t updated yet.\u003C/p\u003E\u003Cp\u003EAnd I hope your sig is outdated, because I won\u0027t be giving support to someone who openly says that they are pirating the game. Quite shameful.\u003C/p\u003E\n"},{"CreatedByName":"TheJoseph98","CreatedById":81838,"CreatedDateTime":"2014-06-06T18:43:43Z","Content":"\n\u003Cp\u003EYeah, my sig was outdated, sorry, I just don\u0027t use the forums very often if at all so I forget about those things, no worries I bought the game, but installation of this mod is way too complicated, I can\u0027t install this... meh, I\u0027m not even gonna bother, I\u0027ll download maybe 2-3 mods but that\u0027s about it, I\u0027m sorry if I caused any inconvenience, I just want to play this game in a different way, I\u0027m bored of vanilla KSP\u003C/p\u003E\n"},{"CreatedByName":"xandalis","CreatedById":66674,"CreatedDateTime":"2014-06-06T19:53:41Z","Content":"\n\u003Cp\u003ESo, I\u0027m working my way through the tech tree in an RO/RSS career game. I\u0027ve kind of hit a point where I\u0027m not sure what I should be shooting for next... Any suggestions anyone?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/LfoCSPL.png\u0022 alt=\u0022LfoCSPL.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"MedievalNerd","CreatedById":84735,"CreatedDateTime":"2014-06-06T20:03:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheJoseph98\u0022 data-cite=\u0022TheJoseph98\u0022\u003E\u003Cdiv\u003EYeah, my sig was outdated, sorry, I just don\u0027t use the forums very often if at all so I forget about those things, no worries I bought the game, but installation of this mod is way too complicated, I can\u0027t install this... meh, I\u0027m not even gonna bother, I\u0027ll download maybe 2-3 mods but that\u0027s about it, I\u0027m sorry if I caused any inconvenience, I just want to play this game in a different way, I\u0027m bored of vanilla KSP\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFair enough, glad to hear you finally got to encourage Squad for making this amazing game. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ll say one thing though, if you find the installation complicated, you\u0027d probably find the whole assemble of mods even more complicated specifically with RSS/RO and massive changes they bring.\u003C/p\u003E\u003Cp\u003EAnd no it\u0027s not an inconvenience at all, perhaps I misunderstood why you said that, but not having someone play RPL is definitely not a problem. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ve booked some 4 day weekends mixed with some National holidays in Canada which are coming up soon. I\u0027ll see if I can work on the installation instructions/video. But I am more inclined on adding more experiments, or start the push for MS20 and get video/photo and manned experiments into the fold. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s true that there are a lot of mods, but in the end apart form being a lot of them, there isn\u0027t that many complicated steps to do. Although RO, RPL \u0026amp; RSS do have little additions/changes you need to do other than installation the mod.\u003C/p\u003E\u003Cp\u003EHang in there peeps!\u003C/p\u003E\n"},{"CreatedByName":"DoctorJon","CreatedById":81593,"CreatedDateTime":"2014-06-07T10:40:18Z","Content":"\n\u003Cp\u003EUnable to use this since spaceport is now Curse and there\u0027s no copy of treeloader on Curse.\u003C/p\u003E\n"},{"CreatedByName":"pjf","CreatedById":112483,"CreatedDateTime":"2014-06-07T12:52:02Z","Content":"\n\u003Cp\u003EFirstly, MN, thank you \u003Cem\u003Eso\u003C/em\u003E much for RPL. It\u0027s been awesome, and has very much been giving me the experience I\u0027ve been after!\u003C/p\u003E\u003Cp\u003EI\u0027m hesitant to add to a 174 page thread when I think that my questions may have already been answered elsewhere, but alas my search-fu hasn\u0027t been successful in bringing anything up. My apologies if I\u0027m re-asking an already answered question here.\u003C/p\u003E\u003Cp\u003EI\u0027ve just unlocked \u0022Luna 1 \u0026amp; 2\u0022, but the node only contains Luna 1. I\u0027m worried that either I\u0027ve missed installing a pack, or deleted the part unintentionally. I nuked a lot of parts \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/58135-TechTree-0-23-5-MS19e-Realistic-Progression-LITE-(2014-05-11)?p=1154241\u0026amp;viewfull=1#post1154241\u0022 rel=\u0022external nofollow\u0022\u003Eas recommended by Nathan\u003C/a\u003E, and I\u0027m worried I might have caught a probe accidentally. I\u0027m happy to do digging to find where that might be, but I just want to check there is supposed to be a Luna 2 in the tree. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs an aside, is the RPL code up on Github or elsewhere? I\u0027m happy to fix spelling mistakes and report what looks like misplaced tech (eg: batteries and RCS tanks in the radiators node), but I figure a large thread isn\u0027t ideal for that (especially spelling fixes, where a pull request is likely to be easier all round).Many thanks again for a great mod!\u003C/p\u003E\u003Cp\u003E~ pjf\u003C/p\u003E\n"},{"CreatedByName":"pjf","CreatedById":112483,"CreatedDateTime":"2014-06-07T12:55:18Z","Content":"\n\u003Cp\u003EOh, Venera 2 is also a completely empty node (I just unlocked it), so I\u0027m guessing I\u0027ve accidentally nuked a probe part somewhere... D\u0027oh!\u003C/p\u003E\n"},{"CreatedByName":"MedievalNerd","CreatedById":84735,"CreatedDateTime":"2014-06-07T19:04:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022pjf\u0022 data-cite=\u0022pjf\u0022\u003E\u003Cdiv\u003EOh, Venera 2 is also a completely empty node (I just unlocked it), so I\u0027m guessing I\u0027ve accidentally nuked a probe part somewhere... D\u0027oh!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHere are the RPL probes that are currently implemented.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/58135-TechTree-0-23-5-MS19e-Realistic-Progression-LITE-%282014-05-11%29?p=778717\u0026amp;viewfull=1#post778717\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/58135-TechTree-0-23-5-MS19e-Realistic-Progression-LITE-%282014-05-11%29?p=778717\u0026amp;viewfull=1#post778717\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"DoctorJon","CreatedById":81593,"CreatedDateTime":"2014-06-07T20:40:17Z","Content":"\n\u003Cp\u003EAny way to get around a non-functioning Treeloader download link to play with this?\u003C/p\u003E\n"},{"CreatedByName":"gunnyfreak","CreatedById":67266,"CreatedDateTime":"2014-06-08T05:03:21Z","Content":"\n\u003Cp\u003EI took the treeloader from kspinstellar, working ok so far\u003C/p\u003E\u003Cp\u003Efor some reason my stretchy tanks can\u0027t go beyond 1.5 M diameter though, not sure if that\u0027s not intended or not (have advrocketry so far)\u003C/p\u003E\u003Cp\u003Eif intended, is there a way to mod that?\u003C/p\u003E\u003Cp\u003Ety\u003C/p\u003E\n"},{"CreatedByName":"pjf","CreatedById":112483,"CreatedDateTime":"2014-06-08T05:30:50Z","Content":"\n\u003Cp\u003E@RN: D\u0027oh! Apparently I searched everywhere, but looking in the first few nodes of the thread were beyond me!\u003C/p\u003E\u003Cp\u003E@gunnyfreak: Stretchy Tanks are determined by your tech level in engines, so if you put more science into engines, you\u0027ll get bigger tanks. Having said that, I know a few people have mentioned there\u0027s a 9K/6m engine in about the 3rd or 4th node, but stretchy tanks only go up to 4.5m at that point, but I\u0027m guessing that engine is misplaced.\u003C/p\u003E\u003Cp\u003EOh wait, there was a patch to not starting with stretchy-tanks being large enough. I don\u0027t have the post it was in, but I have it in my git history:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003Ediff --git a/StretchyTanks/Parts/tech.cfg b/StretchyTanks/Parts/tech.cfg\u003Cbr\u003Eindex ec2e092..510a9c3 100644\u003Cbr\u003E--- a/StretchyTanks/Parts/tech.cfg\u003Cbr\u003E\u002B\u002B\u002B b/StretchyTanks/Parts/tech.cfg\u003Cbr\u003E@@ -1,7 \u002B1,7 @@\u003Cbr\u003E STRETCHYTANKMAXRAD\u003Cbr\u003E {\u003Cbr\u003E   name = Default\u003Cbr\u003E-  start = 0.1\u003Cbr\u003E\u002B  start = 1000\u003Cbr\u003E   basicRocketry = 0.25\u003Cbr\u003E   advRocketry = 0.5\u003Cbr\u003E   heavyRocketry = 1\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"gunnyfreak","CreatedById":67266,"CreatedDateTime":"2014-06-08T06:54:28Z","Content":"\n\u003Cp\u003Eyeah, I\u0027m at the 3rd node, and I have a lot of 2m / 2.5m engines, but I can\u0027t get bigger than 1.5m tanks\u003C/p\u003E\u003Cp\u003EI tried editing that file, didn\u0027t work \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-06-08T07:12:33Z","Content":"\n\u003Cp\u003EHmm. Depends on *how* you edited. Let me translate from diff-ese \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EOpen StretchyTanks/Parts/tech.cfg\u003C/p\u003E\u003Cp\u003EFind line\u003C/p\u003E\u003Cp\u003Estart = 0.1\u003C/p\u003E\u003Cp\u003Echange it to:\u003C/p\u003E\u003Cp\u003Estart = 1000\u003C/p\u003E\u003Cp\u003ENo more size limits!\u003C/p\u003E\n"},{"CreatedByName":"issarlk","CreatedById":17336,"CreatedDateTime":"2014-06-08T16:31:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Semmel\u0022 data-cite=\u0022Semmel\u0022\u003E\u003Cdiv\u003EAlso, somehow (even though available in the tech tree), the nosecone part of the procedural fairings are missing from the VAB.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have the exact same problem. I hoped to use procedural fairings since they are so much more convenient. But they are not in the VAB, only in the tech windows.\u003C/p\u003E\n"},{"CreatedByName":"Hattivat","CreatedById":110255,"CreatedDateTime":"2014-06-08T19:38:09Z","Content":"\n\u003Cp\u003ESome feedback:\u003C/p\u003E\u003Cp\u003EOverall it\u0027s a very nice idea, I like the probes, etc.\u003C/p\u003E\u003Cp\u003EHowever, there are a few complaints. First of all, player gets the probe cores long before he gets the engines used to launch them historically. I mean, I have the sputniks, but I have no way of recreating the R-7 rocket; I have the explorer, but I don\u0027t have the A7 engine. Second, some missions seem utterly impossible to do properly. I mean, did someone seriously succeed in launching Sputnik 2 without any RCS or reaction wheels? If yes, I\u0027d like to know how, to me it feels like riding a drunk horse.\u003C/p\u003E\n"},{"CreatedByName":"ThorBeorn","CreatedById":96670,"CreatedDateTime":"2014-06-08T21:51:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Hattivat\u0022 data-cite=\u0022Hattivat\u0022\u003E\u003Cdiv\u003ESome feedback:\u003Cp\u003EOverall it\u0027s a very nice idea, I like the probes, etc.\u003C/p\u003E\u003Cp\u003EHowever, there are a few complaints. First of all, player gets the probe cores long before he gets the engines used to launch them historically. I mean, I have the sputniks, but I have no way of recreating the R-7 rocket; I have the explorer, but I don\u0027t have the A7 engine. Second, some missions seem utterly impossible to do properly. I mean, did someone seriously succeed in launching Sputnik 2 without any RCS or reaction wheels? If yes, I\u0027d like to know how, to me it feels like riding a drunk horse.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI must say I agree with what you say, but that is the whole point with the RftS engine pack - it\u0027s not supposed to act as a bunch of exact copies of real engines. The solution imo would be to just change the names of the probe cores to something more alternate history-ish. Problem solved. If you want to replicate real rockets then you should use the real engines cfg which is not meant to be used with RPL.\u003C/p\u003E\n"},{"CreatedByName":"Hattivat","CreatedById":110255,"CreatedDateTime":"2014-06-08T22:48:53Z","Content":"\n\u003Cp\u003EI should have been more precise: RPL\u0027s required mods already provide the necessary parts (FASA has the A7 engine, KW rocketry has russian-style side tanks, and Bobcat\u0027s russian engines include all the necessary ones iirc), the issue here is that RPL does not give access to these parts early enough. The result is that at the moment I have huge modern-looking kerolox engines (which descriptions claim are German) at my disposal but need to spend 100 more science to get a WWII-grade alcohol-fueled engine (A7 was directly derived from V-2 technology). That is plain absurd.\u003C/p\u003E\u003Cp\u003EAlso, a third issue: It might be a result of some sort of mistake on my part during the installation process, but some engines have absurd sizes. I mean, one American engine with 195 thrust is literally four times the volume of a Russian one with 380 (or sth like that) thrust.\u003C/p\u003E\n"}]}