{"TopicId":54284,"ForumId":34,"TopicTitle":"[1.12] Extraplanetary Launchpads v6.99.3","CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2013-11-25T03:43:45Z","PageNum":93,"Articles":[{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-02-11T13:29:45Z","Content":"\n\u003Cp\u003EI did a little testing now that I know what parts are what \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E and I found that if I put the \u0022workshop\u0022 that looks like the 4-man hab module on there, I now get the build window. I also put your space dock on the top just to be sure. However it still won\u0027t build anything. I see \u0022Pad-0\u0022 and \u0022Pad-1\u0022 in the drop down, 0 says \u0022landed\u0022 and 1 says \u0022prelaunch\u0022 so I assume 0 is the stake and 1 is the orbital construction dock. I click \u0022Select Craft\u0022 and can pick something, but \u0022Select Craft\u0022 stays as is and there is no indication that it\u0027s trying to build or even queued to build in the future.\u003C/p\u003E\u003Cp\u003EHere\u0027s a pic that shows everything:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://pulpaudio.com/ksp/elp_nogo2.jpg\u0022 alt=\u0022elp_nogo2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EEDIT: To be 100% sure I removed the MKS part. I made a \u0022ship\u0022 with a probe core, large rocket part tank (full), solar panels, and a workshop with the same 2 engineers that were in the above pic for a productivity of 0.43\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-11T13:37:35Z\u0022 title=\u002202/11/2015 01:37  PM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 11, 2015\u003C/time\u003E by 5thHorseman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2015-02-11T14:39:50Z","Content":"\n\u003Cp\u003EInteresting that you get landed \u003Cem\u003Eand\u003C/em\u003E prelaunch. They\u0027re on the same vessel so \u003Cem\u003Eshould\u003C/em\u003E show the same situation.\u003C/p\u003E\u003Cp\u003EOk, for showing the UI, there are two options: right click menu (which you\u0027ve found), or blizzy\u0027s toolbar. Using the right click menu switches the UI to that pad (good for when you don\u0027t know which is which).\u003C/p\u003E\u003Cp\u003EMan, am I glad I put the version info in the window \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E. Ok, unfortunately, there is less information available in 5.0.0, so it\u0027s hard to tell if the survey station can see the survey site (it\u0027s \u0026lt; 100m, so it should).\u003C/p\u003E\u003Cp\u003EThis is probably a silly question, but did you remember to click \u0022Load\u0022 after clicking on the craft to load? It looks like you have the mouse hovering over it, but... (just a reminder, but that is the exact same window used in the VAB).\u003C/p\u003E\u003Cp\u003EProductivity is still good.\u003C/p\u003E\u003Cp\u003EI can\u0027t think of anything else at this stage.\u003C/p\u003E\n"},{"CreatedByName":"goldenpsp","CreatedById":113874,"CreatedDateTime":"2015-02-11T15:03:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00225thHorseman\u0022 data-cite=\u00225thHorseman\u0022\u003E\u003Cdiv\u003EHaha I\u0027m so new at this I didn\u0027t even know that wasn\u0027t a stock ELP part.\u003Cp\u003EQuestion: Assuming it works, how do I open the window? Should it be a right-click menu option on the workstation or should that button on thetaskbar work, or something else?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf I am understanding/rememberling correctly, with the MKS parts you need to use the MKS C3 module, not the rocketbuilding module with stakes. The C3 is the one that functions as the survey station.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-02-11T15:11:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022taniwha\u0022 data-cite=\u0022taniwha\u0022\u003E\u003Cdiv\u003EInteresting that you get landed \u003Cem\u003Eand\u003C/em\u003E prelaunch. They\u0027re on the same vessel so \u003Cem\u003Eshould\u003C/em\u003E show the same situation.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI was under the impression that \u0022Pad-0\u0022 is the stake that is (kind of) landed out in the grass 40 meters away, while the orbital dock is \u0022Pre-launch\u0022 because it was just put on the launchpad.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022taniwha\u0022 data-cite=\u0022taniwha\u0022\u003E\u003Cdiv\u003EMan, am I glad I put the version info in the window \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E. Ok, unfortunately, there is less information available in 5.0.0, so it\u0027s hard to tell if the survey station can see the survey site (it\u0027s \u0026lt; 100m, so it should).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m updating now to 5.1 and will test again \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022taniwha\u0022 data-cite=\u0022taniwha\u0022\u003E\u003Cdiv\u003EThis is probably a silly question, but did you remember to click \u0022Load\u0022 after clicking on the craft to load? It looks like you have the mouse hovering over it, but... (just a reminder, but that is the exact same window used in the VAB).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI did click \u0022Load\u0022 and the screen goes away when I do. But all that does is make that gui window go away. The \u0022Select Craft\u0022 button remains. I\u0027ve not seen it work yet, but my gut is telling me that it (or somewhere on that window) should say that it\u0027s building something.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-11T15:38:53Z\u0022 title=\u002202/11/2015 03:38  PM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 11, 2015\u003C/time\u003E by 5thHorseman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-02-11T15:40:43Z","Content":"\n\u003Cp\u003ESame with 5.1.0 and all ELP parts. One thing I notice, when I click \u0022load\u0022 something appears on the launchpad very quickly and then vanishes. I thought maybe being on the launchpad myself was causing it to not load and then get put in the queue, so I turned my little base into a car and drove it off the launch pad. The thing still appears on the launchpad and disappears quickly, but still nothing else happens.\u003C/p\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2015-02-11T16:07:16Z","Content":"\n\u003Cp\u003EVery weird. It sounds like you are getting an exception in a strange place. Please get me your log file and I\u0027ll take a look tomorrow (I\u0027m about to go to bed). The only thing I can think of is something is going wrong with the final cost calculation (any earlier and the temporary ship would not disappear).\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-02-11T16:20:14Z","Content":"\n\u003Cp\u003E\nI just loaded it in an otherwise stock game. I loaded Karbonite, EPL, and the EPL/Karbonite conversion pack ONLY...\n\u003C/p\u003E\n\u003Cp\u003E\n...and it worked. I then deleted all of the relevant directories from my main instance of KSP, copied those folders in place, and...\n\u003C/p\u003E\n\u003Cp\u003E\n...it still didn\u0027t work. So, something else is causing the problem. You\u0027ll be happy to know it\u0027s not you \u003Cimg alt=\u0022:)\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIf you could look, I\u0027d appreciate it but it just may be that I need to load my mods in groups until I find what\u0027s causing the issue.\n\u003C/p\u003E\n\u003Cp\u003E\nHere\u0027s the log from the most recent attempt. I\u0027m going to bed as well (Odd I share sleeping hours with someone half a world away \u003Cimg alt=\u0022:)\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022\u003E) so no rush needed!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E[defunct site link removed by moderator]\u003C/em\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Tarheel1999","CreatedById":123965,"CreatedDateTime":"2015-02-11T17:19:27Z","Content":"\n\u003Cp\u003ETry deleting the MM cache.\u003C/p\u003E\n"},{"CreatedByName":"AcidEric","CreatedById":83271,"CreatedDateTime":"2015-02-11T19:16:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022taniwha\u0022 data-cite=\u0022taniwha\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003EAcidEric\u003C/strong\u003E: Hmm, do you have an origin stake? Do all your stakes have the same name? Easiest thing for that is to always place all stakes for a build using the same kerbal (stakes automatically become \u0022[kerbal name] Base\u0022), but an EVAed kerbal can rename stakes.\u003Cp\u003EI ask about the origin stake because I have not done any testing without one. All my testing using an origin stake and combinations of X and Z direction stakes and XYZ bounds stakes have, so far, gone well... on a 20\u002B degree slope:\u003C/p\u003E\u003Cp\u003E[click for a larger image]\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://taniwha.org/~bill/ksp/mun_base_ftc.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003C/a\u003E\u003Ca href=\u0022http://taniwha.org/~bill/ksp/mun_base_ftc.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://taniwha.org/~bill/ksp/mun_base_ftc.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThis is just after placing my first tower crane (the first time... I was placing the second crane, KSP physics wigged out (I pushed them too far, I guess), loaded from quicksave to just before placing the first crane. second time went well). That is an Origin stake visible directly below the docking port. There is a -Y bounds stake to the left and up the hill: the crane spawned about 1m above the docking port \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\u003Cp\u003EThe base itself was spawned using an Origin stake, a -Y bounds stake, and a \u002BX bounds stake. In retrospect, I should have used a \u002BZ stake too because the NE corner of the base was a little too low to the ground for the minimum height of the launch clamps. Things seems to have stabilized, though, so if the kraken attacks, I\u0027ll just accept it as poor surveying \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E. Even though I wrote the code, I too am learning how to actually use it.\u003C/p\u003E\u003Cp\u003EOk, back to your problem... if my guess is correct and you have only \u002BX and \u002BZ Direction stakes, then EL will get terribly confused: you have three points (one implicit: the average location of the two stakes) and they will be exactly co-linear (within the limits of double precision). This will cause grief with cross products (cross(\u002BX-O, \u002BZ-O)) and the resulting 0 vector will propagate and may even cause INF and NAN to appear. Having only \u002BX and \u002BZ Bounds stakes \u003Cem\u003Emight\u003C/em\u003E work, depending on relative locations with respect to the compass points.\u003C/p\u003E\u003Cp\u003EOh, dear.... \u003Cstrong\u003EAcidEric\u003C/strong\u003E: I see your problem (just noticed now looking over that log). I have not released the bounds stake implementation. You have been operating on false information. I am very sorry.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eno worries Taniwah.\u003C/p\u003E\u003Cp\u003EI have been using origin stakes, I tried to use just an origin stake first, then I tried with an origin stake and a \u002BX, then with an origin a \u002BX and a \u002BZ,and finally with origin \u002BX \u002BY thinking the vertical direction might be messed up on the base, none had any different results,\u003C/p\u003E\u003Cp\u003EI then moved over to sandbox mode to do some testing. I could build other vessels with just an origin stake and they would spawn on the origin stake no problem. Tested again with the base and got the same result as before, it spawned on the \u0027pad\u0027 (my FTT badger) not the stake and was still 90 degrees off with what should be \u0027south\u0027 actually being \u0027up\u0027. Then it was midnight and I had work today so now I\u0027m back in I\u0027ll get the new version and try again lol.\u003C/p\u003E\u003Cp\u003EI did notice that all the stakes need to be placed by the same kerbal preferably on the same EVA. \u003C/p\u003E\u003Cp\u003EAm I correct in thinking that :-\u003C/p\u003E\u003Cp\u003EOrigin stakes - set the datum point with \u002BX as east, -X as west, \u002BZ as north, -Z as south, \u002BY as UP and -Y as down (as spawned if launched from VAB/SPH)\u003C/p\u003E\u003Cp\u003E\u002BX stakes determine user defined East\u003C/p\u003E\u003Cp\u003E-X stakes determine user defined West\u003C/p\u003E\u003Cp\u003E\u002BZ stakes determine user defined North \u003C/p\u003E\u003Cp\u003E-Z stakes determine user defined South\u003C/p\u003E\u003Cp\u003E\u002BY stakes determine user defined Up\u003C/p\u003E\u003Cp\u003E-Y stakes determine user defined Down \u003C/p\u003E\u003Cp\u003ECheers \u003C/p\u003E\u003Cp\u003EAE\u003C/p\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2015-02-11T21:39:26Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E5thHorseman\u003C/strong\u003E: ScienceAlert 1.8.3 is throwing an NRE when EL loads the ship to check resources. This is rather surprising because it caused rather impressive explosions for me (thus why I thought the bug might be elsewhere).\u003C/p\u003E\u003Cp\u003EThe changelogs for SA 1.8.4 say it re-fixes the above NRE.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EAcidEric\u003C/strong\u003E: yes, that looks correct.\u003C/p\u003E\u003Cp\u003EHowever, the stakes do not \u003Cem\u003Enecessarily\u003C/em\u003E need to be placed by the same kerbal (but it is much easier that way), and certainly not on the same EVA. Rather, the stakes only have to have the same name, and KSP automatically names them to \u0022[kerbal name] Base\u0022. Stake names are easily changed via the same right-click menu used to change the stake mode.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-02-12T01:58:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tarheel1999\u0022 data-cite=\u0022Tarheel1999\u0022\u003E\u003Cdiv\u003ETry deleting the MM cache.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks for the suggestion. I didn\u0027t even know MM \u003Cstrong\u003EHAD\u003C/strong\u003E a cache. However, it did not work.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022taniwha\u0022 data-cite=\u0022taniwha\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003E5thHorseman\u003C/strong\u003E: ScienceAlert 1.8.3 is throwing an NRE when EL loads the ship to check resources. This is rather surprising because it caused rather impressive explosions for me (thus why I thought the bug might be elsewhere).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe dangers of not running CKAN, I suppose. I updated it and it works now! Yaaay!\u003C/p\u003E\u003Cp\u003EThanks tons, I super appreciate the help. Now to actually plan my EPL base.\u003C/p\u003E\n"},{"CreatedByName":"Booots","CreatedById":62446,"CreatedDateTime":"2015-02-12T21:19:37Z","Content":"\n\u003Cp\u003EBefore I complain about my bug, I\u0027m just going to say that I am using a slightly outdated version so that my pre-0.9 base full of pilots can still build things so I understand if support is refused for not being updated.\u003C/p\u003E\u003Cp\u003EAnyway, I\u0027m experiencing an interesting bug with regards to surveyed builds and launch clamps. I\u0027m trying to build something on Eve and accidentally landed on a steep slope. When I build something with launch clamps, it jumps up so that it is above the surface (which is great!) and sits nicely vertical (which is even greater). The problem is when I try to timewarp because apparently it is staying in a \u0027In Flight\u0027 status despite not being launched yet. Any ideas what I can do to fix this? Is it because of the jump making KSP think it\u0027s still flying or a normal behaviour for launch clamps?\u003C/p\u003E\u003Cp\u003EAnd yes, the bounding stakes would be perfect for this if I could still build afterwards or re-train my colonists to be engineers somehow. Thanks!\u003C/p\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2015-02-12T21:41:45Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EBooots\u003C/strong\u003E: It sounds like part of your base is spawning in the ground but getting pushed out gently (lucky!). Yeah, this is what bounds stakes are for. :/\u003C/p\u003E\u003Cp\u003EHowever, all is not lost: EL does not check for \u003Cem\u003Eengineers\u003C/em\u003E, but rather the construction skill. If you study both ExtraplanetaryLaunchpads/EL_MM.cfg (near the bottom, look for EXPERIENCE_TRAIT) and Squad/Experience/Traits.cfg (and know a little bit of ModuleManager hacking), you should be able to retrain your kerbals.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ENOTE\u003C/strong\u003E: this will affect all saves in your installation, so use with care. Also, I hope you have a \u0022proper\u0022 (productivity factor \u0026gt;= 1) workshop (eg, EL\u0027s blue thing).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-12T21:44:44Z\u0022 title=\u002202/12/2015 09:44  PM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 12, 2015\u003C/time\u003E by taniwha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"AcidEric","CreatedById":83271,"CreatedDateTime":"2015-02-13T00:44:42Z","Content":"\n\u003Cp\u003EAs promised ta-dah my base built on one go thanks to EL \u0026amp; Taniwah.\u003C/p\u003E\u003Cp\u003ENot sure if I have stakes fully figured out and I\u0027m pretty sure the problems I was having before were down to the base craft. Did loads of testing and it was only that craft that was spawning wrong.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i3.photobucket.com/albums/y92/AcidEric/Kerbal%20Space/The-Whole-Base--trucks.jpg\u0022 alt=\u0022The-Whole-Base--trucks.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Wisq","CreatedById":7866,"CreatedDateTime":"2015-02-13T06:00:41Z","Content":"\n\u003Cp\u003EFYI, got this bug in the latest EPL. I built a ship at a station, docked it to the station, undocked. Until I left the render radius of the station, everything was fine, but once I did, hitting F2 would no longer hide all the UI elements, and pressing it again wouldn\u0027t bring them back; I had to press F3 to get my UI back.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003E[EXC 00:57:21.684] NullReferenceException\u003Cbr\u003E        UnityEngine.Transform.FindChild (System.String name)\u003Cbr\u003E        Part.FindModelComponents[Renderer] ()\u003Cbr\u003E        Part.highlight (Color highlightColor)\u003Cbr\u003E        Part.SetHighlight (Boolean active, Boolean recursive)\u003Cbr\u003E        Part.SetHighlightDefault ()\u003Cbr\u003E        ExLP.ExLaunchPad.Highlight (Boolean on)\u003Cbr\u003E        ExLP.ExBuildWindow.UpdateGUIState ()\u003Cbr\u003E        ExLP.ExBuildWindow.onHideUI ()\u003Cbr\u003E        EventVoid.Fire ()\u003Cbr\u003E        ScreenShot.Update ()\u003Cbr\u003E[EXC 00:57:22.284] NullReferenceException\u003Cbr\u003E        UnityEngine.Transform.FindChild (System.String name)\u003Cbr\u003E        Part.FindModelComponents[Renderer] ()\u003Cbr\u003E        Part.highlight (Color highlightColor)\u003Cbr\u003E        Part.SetHighlight (Boolean active, Boolean recursive)\u003Cbr\u003E        Part.SetHighlightDefault ()\u003Cbr\u003E        ExLP.ExLaunchPad.Highlight (Boolean on)\u003Cbr\u003E        ExLP.ExBuildWindow.UpdateGUIState ()\u003Cbr\u003E        ExLP.ExBuildWindow.onShowUI ()\u003Cbr\u003E        EventVoid.Fire ()\u003Cbr\u003E        FlightDriver.SetPause (Boolean pauseState)\u003Cbr\u003E        FlightResultsDialog.Display (System.String outcomeMsg)\u003Cbr\u003E        FlightResultsDialog.OnGUI ()\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EExiting to the KSC and returning to the ship resolved it.\u003C/p\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2015-02-13T11:40:23Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EWisq\u003C/strong\u003E: Darn, I thought I fixed the root cause of such. I guess I have some more poking to do. Yay partless addons (the build window).\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EAcidEric\u003C/strong\u003E: I\u0027m glad you got it working \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2015-02-13T13:18:16Z","Content":"\n\u003Cp\u003EA word of warning to KAS users: while the recycling bins will not eat the vessel to which the bin is docked, they \u003Cem\u003Ewill\u003C/em\u003E happily munch on the winch connector (winch on same vessel), breaking KAS (NREs). I will see if I can get the bins to not eat \u0022active\u0022 KAS parts.\u003C/p\u003E\n"},{"CreatedByName":"Booots","CreatedById":62446,"CreatedDateTime":"2015-02-13T20:21:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022taniwha\u0022 data-cite=\u0022taniwha\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003Cstrong\u003ENOTE\u003C/strong\u003E: this will affect all saves in your installation, so use with care. Also, I hope you have a \u0022proper\u0022 (productivity factor \u0026gt;= 1) workshop (eg, EL\u0027s blue thing).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd, um, what if they\u0027re still in their survey station drop pod? Can I just boost its productivity above 1?\u003C/p\u003E\u003Cp\u003EEDIT: Yes. Yes I can. Thanks!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-13T21:19:25Z\u0022 title=\u002202/13/2015 09:19  PM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 13, 2015\u003C/time\u003E by Booots\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"daniel l.","CreatedById":57763,"CreatedDateTime":"2015-02-13T23:00:38Z","Content":"\n\u003Cp\u003Eis this compatible with 0.25 (0.90 wont work on my pc \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E )\u003C/p\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2015-02-13T23:38:51Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003Edaniel l.\u003C/strong\u003E: 4.4.0 is compatible with 0.25. Take the current URL and edit the version number to suit. Or, if you are feeling adventurous, grab the code and remove the stock experience and fancy highlighting code. There might be a couple of other tweaks necessary.\u003C/p\u003E\n"},{"CreatedByName":"djnecro","CreatedById":138011,"CreatedDateTime":"2015-02-15T06:23:08Z","Content":"\n\u003Cp\u003EWon\u0027t release! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003EI had a fairly well used career save going and decided to spice things up with some EPL goodness. After getting an orbital station up and running and testing, I had nothing but issues: mostly the gyro kraken, but any \u0022real\u0022 ship I tried to build would succeed wouldn\u0027t be able to be released. Very similar to the old \u0022stuck\u0022 docking port bug.\u003C/p\u003E\u003Cp\u003EI wiped the game and reloaded fresh with fewer mods, and got another station up and running. It passed my simple tests (simple tug, a few docking port adapters, a station fuel module, etc...), but whenever I try to build a legit ship (in this case a dead simple mun transfer stage\u002Blander) it simply refuses to be released.\u003C/p\u003E\u003Cp\u003EI can provide screenshots, but the test ship is very simple, no clipping to my knowledge. I\u0027d really love to move forward, but at the moment I\u0027m stuck faking an orbital construction yard via hyperedit, and it\u0027s taking the fun out of things! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAny ideas? My modlist (managed via CKAN, so all are updated) is below:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E000_Toolbar, AmbientLightAdjustment, Chatterer, CommunityResourcePack, CommunityTechTree, ContractConfigurator, ContractPacks, Contracts Window, CrewManifest, CrossFeedEnabler, CrowdSourcedScience, Diazo, DMagic Orbital Science, ExtraplanetaryLaunchpads, KAS, KerbalEngineer, KerbalJointReinforcement, KerbalStats, Kerbaltek, MagicSmokeIndustries, MechJeb2, ModuleManager.2.5.9.dll, NavHud, NearFutureConstruction, NearFutureElectrical, NearFuturePropulsion, NearFutureSolar, PreciseNode, ProceduralFairings, QuantumStrutsContinued, RCSBuildAid, Regolith, SCANsat, ScienceAlert, ShipManifest, StockBugFixModules, TacFuelBalancer, TechManager, ToadicusTools, Trajectories, TriggerTech, TweakableEverything, TweakScale, UniversalStorage\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"djnecro","CreatedById":138011,"CreatedDateTime":"2015-02-15T06:24:00Z","Content":"\n\u003Cp\u003EApologies for the double post.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-15T06:51:49Z\u0022 title=\u002202/15/2015 06:51  AM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 15, 2015\u003C/time\u003E by djnecro\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2015-02-15T09:58:14Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003Edjnecro\u003C/strong\u003E: try testing without KerbalJointReinforcement. It\u0027s very possible it is adding extra joints that don\u0027t get removed when EL releases the vessel. I\u0027ve never used KJR so no testing has been done with it. Also, does release, save, load fix it?\u003C/p\u003E\n"},{"CreatedByName":"djnecro","CreatedById":138011,"CreatedDateTime":"2015-02-15T11:09:39Z","Content":"\n\u003Cp\u003EI\u0027ll give it a shot w/o kjr and see what happens... a save/load does indeed fix the issue and upon load the ship is floating free.\u003C/p\u003E\u003Cp\u003ETyvm for a fantastic mod!\u003C/p\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2015-02-15T12:23:31Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003Edjnecro\u003C/strong\u003E: Ah, thanks. That\u0027s what I suspected: extra joints. \u003Cem\u003EProbably\u003C/em\u003E due to KJR, but confirmation would be nice.\u003C/p\u003E\n"}]}