{"TopicId":54284,"ForumId":34,"TopicTitle":"[1.12] Extraplanetary Launchpads v6.99.3","CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2013-11-25T03:43:45Z","PageNum":41,"Articles":[{"CreatedByName":"Sokar408","CreatedById":75557,"CreatedDateTime":"2014-04-19T22:09:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022taniwha\u0022 data-cite=\u0022taniwha\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003EPezzhippo\u003C/strong\u003E: do you mean airlocks in the part? they\u0027re pretty easy. Take a look at workshop.blend in EL\u0027s git repository. Note that the collider intersecting with the part is very deliberate: it\u0027s what makes the airlock usable. For best results, you\u0027ll need to install my \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/43513-Blender-mu-import-export-addon\u0022 rel=\u0022external nofollow\u0022\u003E.mu addon\u003C/a\u003E (so you can see the details of the colliders).\u003Cp\u003EAs for supporting unmanned operations: the code just doesn\u0027t support it right now, though it \u003Cem\u003Ecould\u003C/em\u003E. Problem is, I am rather opposed to unmanned space exploration in general, not just in KSP. And then there\u0027s the minor issue of figuring out how to balance things. That\u0027s not to say I won\u0027t use probes, but they are tools to get a specific job done (eg, small tugs), not for major operations.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ESokar408\u003C/strong\u003E: I forgot to mention that the fuel sliders will be displayed later after you have built your ship.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have noticed that the spherical tanks never actually appear in the game itself. I seem them in the mod folder, and I do have the tech for it, but they are just not there. What gives?\u003C/p\u003E\n"},{"CreatedByName":"taniwha","CreatedById":57176,"CreatedDateTime":"2014-04-20T00:13:06Z","Content":"\n\u003Cp\u003EThey are now obsolete. They were for an older version of Spherical tanks, and used model copy tricks, but now spherical tanks directly supports EL (as of a few KSP versions ago), I should remove them. If you want spherical tanks, go get the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/30673-0-23-Spherical-and-Toroidal-Tank-Pack-%28Updated-01-12-14%29\u0022 rel=\u0022external nofollow\u0022\u003Eoriginals\u003C/a\u003E.\u003C/p\u003E\n"},{"CreatedByName":"MrWizerd","CreatedById":106063,"CreatedDateTime":"2014-04-20T07:31:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Alskari\u0022 data-cite=\u0022Alskari\u0022\u003E\u003Cdiv\u003EStarted playing around and ended up with this. A centrifugal smelter for low gee environments. Ideally I\u0027d like for it to spin up while in operation creating the opportunity for some industrial accidents. Texturing, animation and such still needs to be done, mainly posting to gauge interest.\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/MMs7fCa.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/MMs7fCa.png\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat is a really cool part! I would love to see that, I invision it with these Yellow and black hazard stripes painted on the moving parts to warn the stupider Kerbin to stay back!\u003C/p\u003E\u003Cp\u003EAlso I LOVE animated parts they give so much character to the game, I have been trying to learn to model but I just cant get blender to work with me, I hate the inteface i am better with sketchup, maybe i will try there.\u003C/p\u003E\n"},{"CreatedByName":"Starstrider42","CreatedById":104043,"CreatedDateTime":"2014-04-20T14:25:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MrWizerd\u0022 data-cite=\u0022MrWizerd\u0022\u003E\u003Cdiv\u003EThat is a really cool part! I would love to see that, I invision it with these Yellow and black hazard stripes painted on the moving parts to warn the stupider Kerbin to stay back!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u0022Warning: does not contain snacks.\u0022\u003C/p\u003E\n"},{"CreatedByName":"MrWizerd","CreatedById":106063,"CreatedDateTime":"2014-04-20T19:02:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Starstrider42\u0022 data-cite=\u0022Starstrider42\u0022\u003E\u003Cdiv\u003E\u0022Warning: does not contain snacks.\u0022\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOH! Yeah put that on there!!!! But put it on the ridge above and below the bracket that holds the spinning parts!!! That way they have to get closer to read it thus WHACK-A-KERBIN!!!! LOL~!\u003C/p\u003E\u003Cp\u003EAlso, maybe a like orange glow, like a low grade engine in it to melt the metal down.... maybe instead of tons of electricity it can use liquid fuel and oxidizer to fire the heating chamber, and a little power for the motor to rotate... I think that would add to the realism possibly? I have ideas, but can\u0027t model I have to live vicariously!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-20T19:06:09Z\u0022 title=\u002204/20/2014 07:06  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 20, 2014\u003C/time\u003E by MrWizerd\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"benc85","CreatedById":78820,"CreatedDateTime":"2014-04-20T19:17:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Starstrider42\u0022 data-cite=\u0022Starstrider42\u0022\u003E\u003Cdiv\u003E\u0022Warning: does not contain snacks.\u0022\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEVERYTHING contains snacks, you just aren\u0027t looking hard enough!\u003C/p\u003E\n"},{"CreatedByName":"Salanmander","CreatedById":108636,"CreatedDateTime":"2014-04-21T00:51:24Z","Content":"\n\u003Cp\u003EAm I correct in thinking that there is no way to have vessel construction progress (or mine kethane and ore) unless the workshop (or drill) is in physics range?\u003C/p\u003E\u003Cp\u003EIf so, would it be possible to support checking the time-since-last-load upon loading the vessel, and update work accordingly?\u003C/p\u003E\n"},{"CreatedByName":"JTG","CreatedById":106203,"CreatedDateTime":"2014-04-21T07:14:27Z","Content":"\n\u003Cp\u003EIf only I had the skill to assemble a huge mun base. I guess orbital docks will do!\u003C/p\u003E\n"},{"CreatedByName":"Josh Hawley","CreatedById":98666,"CreatedDateTime":"2014-04-21T20:04:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Salanmander\u0022 data-cite=\u0022Salanmander\u0022\u003E\u003Cdiv\u003EAm I correct in thinking that there is no way to have vessel construction progress (or mine kethane and ore) unless the workshop (or drill) is in physics range?\u003Cp\u003EIf so, would it be possible to support checking the time-since-last-load upon loading the vessel, and update work accordingly?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u002B1 for this. something similar to how TAC Life Support calculates the timespan from the last time the vessel was loaded, and then updates its resources accordingly.\u003C/p\u003E\n"},{"CreatedByName":"MrWizerd","CreatedById":106063,"CreatedDateTime":"2014-04-21T20:58:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Salanmander\u0022 data-cite=\u0022Salanmander\u0022\u003E\u003Cdiv\u003EAm I correct in thinking that there is no way to have vessel construction progress (or mine kethane and ore) unless the workshop (or drill) is in physics range?\u003Cp\u003EIf so, would it be possible to support checking the time-since-last-load upon loading the vessel, and update work accordingly?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, I\u0027m with the peanut gallery, \u002B1\u003C/p\u003E\u003Cp\u003E*presuming theres a way to do so....\u003C/p\u003E\u003Cp\u003Ealso, sense were sorta asking for more work.... I would like a donate button so as to be able to send you monies for Ale... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E yum.... ale! or if your not into ale, Beer, or Pizza, or CCCP Water.... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E mmmm Vodka \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-21T21:00:45Z\u0022 title=\u002204/21/2014 09:00  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 21, 2014\u003C/time\u003E by MrWizerd\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"LEIFENG","CreatedById":107207,"CreatedDateTime":"2014-04-22T17:50:54Z","Content":"\n\u003Cp\u003ECan i recyl asteroids?\u003C/p\u003E\n"},{"CreatedByName":"VaporTrail","CreatedById":83184,"CreatedDateTime":"2014-04-22T17:52:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LEIFENG\u0022 data-cite=\u0022LEIFENG\u0022\u003E\u003Cdiv\u003ECan i recyl asteroids?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENope. Had that question a few pages back... with the answer a page or two before that.\u003C/p\u003E\n"},{"CreatedByName":"orcaman","CreatedById":109225,"CreatedDateTime":"2014-04-23T10:06:14Z","Content":"\n\u003Cp\u003EWhile I understand that EL is a work in progress, and I\u0027m very grateful for that work, I take some exception to your statement that you don\u0027t have time to write out instructions. You may not have time to write the next great American novel, but it\u0027s silly to expect people to plow through 100\u002B pages of wandering discussion to learn how to use your project. I can\u0027t find the exact post you made that I\u0027m referring to, but I do think it would be awfully civil of you to spare at least a few sentences worth of instructions on usage on the sticky post at the front of the thread. I, for example, missed the whole addition of Kerbal labor required for construction. All the online videos that came up relating to this mod showed instant construction without any requirement of crew aboard ship.\u003C/p\u003E\u003Cp\u003EI\u0027ll even start you off. Feel free to copy-paste if you really don\u0027t have the time to spend on this\u003C/p\u003E\u003Cp\u003EStrictly speaking, no additional mods are required, however this is only half an idea without Kethane.\u003C/p\u003E\u003Cp\u003EModule Manager is a directly functionally related mod.\u003C/p\u003E\u003Cp\u003EKerbal Attachment System makes tying all the components together a lot easier, and Toolbar and Infernal Robotics are also quite convenient. \u003C/p\u003E\u003Cp\u003ECrew Manifest is also helpful for extracting Kerbals from the current parts workshop, which is otherwise a one-way trip.\u003C/p\u003E\u003Cp\u003EIf you have Kethane installed as well, you will need\u003C/p\u003E\u003Cp\u003EAuger- to mine Ore\u003C/p\u003E\u003Cp\u003EOre Bin- store Ore\u003C/p\u003E\u003Cp\u003ESmelter- convert Ore to Metal\u003C/p\u003E\u003Cp\u003EMetal Bin- store metal\u003C/p\u003E\u003Cp\u003EWorkshop- convert Metal to RocketParts, and store Kerbal laborers\u003C/p\u003E\u003Cp\u003EKerbal laborers- somebody\u0027s got to do the legwork.\u003C/p\u003E\u003Cp\u003E(optional) Recycle bin which can convert other ships into RocketParts)\u003C/p\u003E\u003Cp\u003ERocketParts Can- store RocketParts\u003C/p\u003E\u003Cp\u003ELaunchpad or Runway- to construct ship, both work for either type of vessel\u003C/p\u003E\u003Cp\u003EOnce you\u0027ve got a supply of Rocketparts, right click the launchpad, select your previously designed vessel that doesn\u0027t include launch stability enhancers, and if you have sufficient RP, click build. A progress bar should appear, and the speed of construction is determined by the quantity and quality(stupidity) of Kerbals that you have working in the attached workshops.\u003C/p\u003E\u003Cp\u003E{This is where my knowledge of it falls apart, so please correct}\u003C/p\u003E\u003Cp\u003EWhen the progress bar fills, look in the EL window for a \u0022Finalize Build\u0022 button, which will spawn the craft of the launchpad. You then click . . . \u003Cem\u003Esomewhere\u003C/em\u003E . . . to add resources to the craft, Fuel, Electric Charge, Monoprop, etc . . . then click *somewhere* to release the craft. May God have mercy on your soul.\u003C/p\u003E\u003Cp\u003EIf you do not have Kethane installed:\u003C/p\u003E\u003Cp\u003E????\u003C/p\u003E\u003Cp\u003E????\u003C/p\u003E\u003Cp\u003E????\u003C/p\u003E\u003Cp\u003Emagic\u003C/p\u003E\u003Cp\u003E????\u003C/p\u003E\u003Cp\u003Ea ship appears\u003C/p\u003E\u003Cp\u003EWhile reasonably brief, I think the first set of instructions are adequate for users of KSP. Just so long as you give them a general idea of what direction they\u0027re headed in.\u003C/p\u003E\u003Cp\u003EAlso, bug report: Copying the current version over some older versions does not always result in a functioning copy. Users with functionality problems should be advised to delete their previous version before installing the new one.\u003C/p\u003E\n"},{"CreatedByName":"BigD145","CreatedById":417,"CreatedDateTime":"2014-04-23T21:34:15Z","Content":"\n\u003Cp\u003EWhere do I start with my list of dozens of questions about fine details, orcaman? There are many. MANY. You\u0027ve covered less than what\u0027s in the game already through item descriptions. What you have isn\u0027t even an outline yet.\u003C/p\u003E\u003Cp\u003E\u0022 You then click . . . somewhere \u0022\u003C/p\u003E\u003Cp\u003ESo, I click a button in Firefox? I click a button in the start menu? What? I don\u0027t get it. I touch the screen, right? That\u0027s \u0022clicking\u0022?\u003C/p\u003E\u003Cp\u003EIt\u0027s not that easy to make a guide. KSP lets you put any part on any other part. Sometimes that matters a great deal which part is connected to which other part AND the orientation of those parts. Explain to someone how one engine is placed on any part, where, and why you do it that way. That\u0027s at least two paragraphs if you want to do it right. You have to explain the nodes and which end is \u0022up\u0022 and which the \u0022business end\u0022. That doesn\u0027t even cover decouplers. And you know what? You need all that info to build rockets in EL. It\u0027ll take the same amount of words to explain EL\u0027s orbital launchpad.\u003C/p\u003E\n"},{"CreatedByName":"colmo","CreatedById":25950,"CreatedDateTime":"2014-04-23T21:49:10Z","Content":"\n\u003Cp\u003EIs there ongoing work on the models? I had a look at the mod, but the rough quality (aside from the 2nd and folding launchpads, the improved ore detector, and the 3D printer) and the many, many duplicate items of different sizes (hexcans everywhere!) led to a swift deletion. The Procedural parts (StretchySRB cont.) mod would be an ideal solution - would just need to add the various resources and a new texture to the existing parts, and being procedural, slashes the clutter.\u003C/p\u003E\u003Cp\u003EEdit: It\u0027s already been done! \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/75761-WIP-%280-23-5%29-Procedural-Parts-mod-compatibility-extra-tanks\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/75761-WIP-%280-23-5%29-Procedural-Parts-mod-compatibility-extra-tanks\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI agree some documentation and/or tutorials in video or screenshot form would be really helpful. I\u0027d actually start with a flow chart, showing what the inputs and outputs of different parts are.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-24T10:13:17Z\u0022 title=\u002204/24/2014 10:13  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 24, 2014\u003C/time\u003E by colmo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"BahamutoD","CreatedById":72433,"CreatedDateTime":"2014-04-23T21:57:05Z","Content":"\n\u003Cp\u003EThis game is totally open ended, BigD145, so there\u0027s really no point in going into all those details. As long as you have the necessary components, it is the essence of the game for it to be up to you how to assemble and use them. You can\u0027t expect orcaman to build a working rig for you through text. His brief explanation was already enough to get you started; the rest is where the challenge of this game comes in. \u003C/p\u003E\u003Cp\u003EAnd yes, you touch a button on your screen in firefox to add resources to the craft. Maybe you could start your own guide. Make sure to write a couple paragraphs to explain how to use a mouse to click on stuff, and how to tell which side of a rocket points up. We\u0027d be enlightened.\u003C/p\u003E\n"},{"CreatedByName":"alphaxerosyx","CreatedById":93814,"CreatedDateTime":"2014-04-23T23:03:45Z","Content":"\n\u003Cp\u003ENot sure what I\u0027m doing wrong here. I have an orbital construction dock. I\u0027ve sent up enough rocket parts to build something. But it isn\u0027t building. \u003Cimg src=\u0022http://i.imgur.com/x5W8YMX.jpg\u0022 alt=\u0022x5W8YMX.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Booots","CreatedById":62446,"CreatedDateTime":"2014-04-23T23:24:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022alphaxerosyx\u0022 data-cite=\u0022alphaxerosyx\u0022\u003E\u003Cdiv\u003ENot sure what I\u0027m doing wrong here. I have an orbital construction dock. I\u0027ve sent up enough rocket parts to build something. But it isn\u0027t building. (Picture of orbital shipyard with no kerbals)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou need a construction workshop with some kerbals in it to build something. If you\u0027ve installed Module Manager, any manned command pod will do, but really, construction workshops (the big blue pod under utilities) are the way to go.\u003C/p\u003E\u003Cp\u003EAlso, this is why we need orcaman\u0027s guide because I\u0027m pretty sure this has been said at least three times now.\u003C/p\u003E\n"},{"CreatedByName":"BigD145","CreatedById":417,"CreatedDateTime":"2014-04-23T23:58:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BahamutoD\u0022 data-cite=\u0022BahamutoD\u0022\u003E\u003Cdiv\u003EThis game is totally open ended, BigD145, so there\u0027s really no point in going into all those details. As long as you have the necessary components, it is the essence of the game for it to be up to you how to assemble and use them.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes and no. Parts flat out don\u0027t work in many situations. The single most common question amongst the various mods, ignoring \u0022I can\u0027t install this right, what have I done wrong,\u0022 would be \u0022I put this and this together and they don\u0027t work. WHY?! It should work...\u0022 Notice the 2nd post above this one? Yeah....\u003C/p\u003E\u003Cp\u003EPutting your drills with the drill bits point upwards, away from the ground? Not going to work as intended. Someone will need a FAQ or guide for that. Attaching EL\u0027s Orbital dock with the big end facing parts containers? Not going to work as intended. You say \u0022open ended\u0022 but that doesn\u0027t work so well when you block the business end of a part.\u003C/p\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2014-04-24T00:05:26Z","Content":"\n\u003Cp\u003EAre you seriously saying people can\u0027t know how drills work without written instructions?\u003C/p\u003E\u003Cp\u003EThat\u0027s it, call me Wonko The Sane from now on. I\u0027m building a house called The Outside of the Asylum and framing your post above the inside (outside) front door.\u003C/p\u003E\u003Cp\u003EEDIT: For posterity:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BigD145\u0022 data-cite=\u0022BigD145\u0022\u003E\u003Cdiv\u003EPutting your drills with the drill bits point upwards, away from the ground? Not going to work as intended. Someone will need a FAQ or guide for that.\u003C/div\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-24T00:10:26Z\u0022 title=\u002204/24/2014 12:10  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 24, 2014\u003C/time\u003E by ObsessedWithKSP\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"BigD145","CreatedById":417,"CreatedDateTime":"2014-04-24T01:43:47Z","Content":"\n\u003Cp\u003EYou haven\u0027t been on the internet very long, have you? Ah, right. I should probably set my location to \u0022America\u0022. Does that explain how jaded and cynical I am? We made Pop-Tarts with instructions on them that are longer than \u0022Heat. Eat. Warning: Don\u0027t burn yourself ya idjit.\u0022 Instead it starts with \u0022Remove pastry from pouch.\u0022 America is not unique in that regard.\u003C/p\u003E\u003Cp\u003EBahamut\u0027s smaller yellow drill is not that obvious in how it opens until you see it extended. I can see someone sending a craft out and it getting there and they scream because it\u0027s opening the wrong way. When you turn a craft over and over, especially landers, things like that could happen. It\u0027s not that uncommon to attach craft sideways or upside down by their nose. Putting stuff in front of the orbital pad? Yeah, I can see that. Tons of people are just computer illiterate and don\u0027t understand basic folder structure in a modern OS. You\u0027ll see evidence all throughout these forums alone.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-24T02:00:02Z\u0022 title=\u002204/24/2014 02:00  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 24, 2014\u003C/time\u003E by BigD145\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2014-04-24T01:59:23Z","Content":"\n\u003Cp\u003ECall me crazy, but if I send a craft to another planet (without either testing it on Kerbin or even deploying it in the VAB...) and I find the drill is on upside down, but I\u0027d put that down to my own stupidity, not the mods parts or lack of documentation about usage instructions.\u003C/p\u003E\u003Cp\u003EAs for orbital pad, yeah, I can see people might put it on back to front, but to be brutally honest, if you need instructions that consist of \u0027make sure you put it on the right way round\u0027, maybe orbital construction isn\u0027t for you. Personally, I see that as useful as something like \u0027in order to transmit MegaJoules, you need to have a transmitter\u0027 on KSP Interstellar\u0027s wiki. Yes, it\u0027s useful but it\u0027s also blindingly obvious.\u003C/p\u003E\u003Cp\u003EYes, it\u0027s true that in a previous post in this thread, I expressed a desire for a wiki of sorts, but that was more of a \u0027what parts need what resources? How do I use the recycling bin?\u0027 kind of question, not a \u0027how can I tell if my drill is upside down?\u0027 kind of thing. I asked about the bin because the most detail I could surmise from posts about it was \u0027get close to it\u0027. That, to me, is inadequate usage instructions. On the other hand, a drill should be fairly easy to operate and troubleshoot.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-24T02:02:22Z\u0022 title=\u002204/24/2014 02:02  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 24, 2014\u003C/time\u003E by ObsessedWithKSP\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Josh Hawley","CreatedById":98666,"CreatedDateTime":"2014-04-24T03:56:53Z","Content":"\n\u003Cp\u003EI have a launch pad on Ike, and every time I build something. it explodes. The part that I am building is a ground pylon that has a few pipe endpoints on it (from KAS). The log says \u0022Ground Pylon collided with Ike\u0022. \u003C/p\u003E\u003Cp\u003EAny ideas?\u003C/p\u003E\n"},{"CreatedByName":"Josh Hawley","CreatedById":98666,"CreatedDateTime":"2014-04-24T04:05:40Z","Content":"\n\u003Cp\u003EOdd... I flew the pad up in the air 2 meters or so, spawned it, and a different part on my ship exploded. That part(lander can) was exactly in the same physical space that the pad would have spawned the pylon in. I reloaded and tried again, this time flying 20 meters in the air, and it spawned fine. Its like there is a spot 10 or so meters off the ground that explodes when I spawn stuff in it...\u003C/p\u003E\n"},{"CreatedByName":"Josh Hawley","CreatedById":98666,"CreatedDateTime":"2014-04-24T05:04:54Z","Content":"\n\u003Cp\u003EIt just keeps getting weirder and weirder. I made a big launch pad and unfolded it on the surface of ike. I spawned some parts on it, and its root part exploded. That has to be key here. Every time something has exploded it was a root part.\u003C/p\u003E\n"}]}