{"TopicId":55083,"ForumId":34,"TopicTitle":"[TechTree] [0.23.5] Ackander\u0026#039;s Vertical Tech Tree - Release v1.16 - May 13, 2014","CreatedByName":"Ackander","CreatedById":90879,"CreatedDateTime":"2013-12-03T16:33:12Z","PageNum":7,"Articles":[{"CreatedByName":"Frostiken","CreatedById":1837,"CreatedDateTime":"2013-12-30T23:25:26Z","Content":"\n\u003Cp\u003EI do have to say, the \u0027miniaturization\u0027 node is unlocked pretty early on, and it is absolutely jam-packed with stuff. Almost too much stuff, if you ask me.\u003C/p\u003E\u003Cp\u003EWithout even all the mods, I get:\u003C/p\u003E\u003Cp\u003E1) Several structural adapters.\u003C/p\u003E\u003Cp\u003E2) 3 different radial mounts.\u003C/p\u003E\u003Cp\u003E3) Radial decoupler, mini stack decoupler, AND mini stack separator.\u003C/p\u003E\u003Cp\u003E4) Two radiators from Interstellar.\u003C/p\u003E\u003Cp\u003E5) Two robotic gantries.\u003C/p\u003E\u003Cp\u003E6) Procedural fairing mounts. But no fairings.\u003C/p\u003E\u003Cp\u003E7) Mini-SAS.\u003C/p\u003E\u003Cp\u003EThis is WAY too much stuff. First of all, why would I unlock all these decouplers for \u0027miniaturization\u0027 before I\u0027ve even got a basic decoupler to miniaturize? Also, the radial decoupler is definitely not \u0022miniaturized\u0022 so I don\u0027t know why it\u0027s in there. Secondly, the heat radiators from interstellar have no purpose this early in the tree. Not sure why they\u0027re down this low. Third, the robotic gantries again, not much use this early on, but it\u0027s doubly confusing since \u0027miniaturization\u0027 unlocks access to \u0027basic robotics\u0027 which is a totally empty node (nothing even defined in the tree.cfg). I\u0027m also not sure why the fairing mounts are here. The mini-SAS arguably may have a use on a command-chair-driven suicide ship, but probably not.\u003C/p\u003E\u003Cp\u003ERemove the radiators, the gantries and the decouplers. Decouplers were even harder to get in the stock tree, in this tree I\u0027m getting three for one. Decouplers should be put somewhere else, separated by type (radial, stack, and separator), type and then size (don\u0027t forget to put the Novapunch \u0027explosive bolt\u0027 in here - it\u0027s pretty much the only miniature radial decoupler we have, and it has far more use as that then it does as a fairing separator which was its original purpose).\u003C/p\u003E\u003Cp\u003ELooking in the tree.cfg, this is practically only half of what else this node unlocks. I don\u0027t even know what most of this is. \u0027repairStation\u0027, \u0027desacopladorsat1\u0027. There\u0027s almost thirty things unlocked by this one cheap, easy, early node.\u003C/p\u003E\u003Cp\u003EI like the idea of an all-inclusive tech tree but to be honest, this current layout just seems entirely random. I like the idea of starting off with nothing and getting only really ****ty low-powered tiny engines and having to make do with them, but once you go beyond that point, it\u0027s kind of like tech nodes just unlock random stuff almost totally unrelated to previous nodes. There should be a basic tree covering, say, liquid rocket nozzles, and I can branch off one of those to unlock \u0027miniature rocket nozzles\u0027 that has a codependent unlock with \u0027miniaturization\u0027 technology. Having a bunch of the tiny rocket nozzles in a tree completely different from rocketry technology just doesn\u0027t make any sense. I don\u0027t really feel like I\u0027m following a \u0027path\u0027 to unlock what I want - I\u0027m kind of just picking things at random and making do with whatever I get.\u003C/p\u003E\u003Cp\u003EAnother good example is under \u0027hypergolic thruster systems\u0027 - you unlock RCS ports... pretty much all of them. I couldn\u0027t tell you what mod it comes from, but I have RCS ports that are only bi-directional, and some that are 5-directional. Wouldn\u0027t it make more sense to have the first \u0027level\u0027 of this only unlock a very simple RCS fuel tank and the single-port RCS thruster, with more advanced RCS thrusters being unlocked progressively? And the feeling still exists that these are simply placed randomly in the tree - having these tied to \u0027miniaturization\u0027 is rather silly, because RCS is for big rockets where reaction wheels don\u0027t work, not for tiny space probes.\u003C/p\u003E\u003Cp\u003EBTW I went into TreeEdit. If I\u0027m understanding it correctly, here\u0027s a list of stuff I have that\u0027s currently unsupported: \u003Ca href=\u0022http://i.imgur.com/ZuRIfSo.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/ZuRIfSo.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EObviously Stretchy SRBs and StationScience are two big parts of that:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/57422-0-23-StretchySRB-A-StretchyTanks-Continuation-v8-12-29-13\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/57422-0-23-StretchySRB-A-StretchyTanks-Continuation-v8-12-29-13\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/54774-0-23-Station-Science-%28fourth-alpha-low-tech-docking-port-experiment-pod-models%29\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/54774-0-23-Station-Science-%28fourth-alpha-low-tech-docking-port-experiment-pod-models%29\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EHere\u0027s some other mods you don\u0027t have supported yet.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/63628-0-23-Beastly-Science-Scoop-O-Matic-%28Unmanned-Surface-Sampler%29-%28DEC2913%29\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/63628-0-23-Beastly-Science-Scoop-O-Matic-%28Unmanned-Surface-Sampler%29-%28DEC2913%29\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/53813-0-23-L-Tech-Scientific-Stuff-V1-9\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/53813-0-23-L-Tech-Scientific-Stuff-V1-9\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/61040-0-23-6S-Service-Compartment-Tubes-Design-smooth\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/61040-0-23-6S-Service-Compartment-Tubes-Design-smooth\u003C/a\u003E!\u003C/p\u003E\u003Cp\u003EThis accounts for 80% of that list. The other 20% are all orphans that got overlooked. For example, everything from \u0027SmallerMPD\u0027 to \u0027FNLCMS\u0027 are part of Interstellar. There\u0027s also a lot of orphans from LLL and a few odd parts from other mods. I can see the blanket solar panel from NearFuture... There\u0027s a few parts there I have no idea what they are, but the majority of the remainder parts are from mods that should be supported but aren\u0027t supported in their entirety.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-31T01:24:13Z\u0022 title=\u002212/31/2013 01:24  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 31, 2013\u003C/time\u003E by Frostiken\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ackander","CreatedById":90879,"CreatedDateTime":"2013-12-31T10:31:43Z","Content":"\n\u003Cp\u003EAnother satisfied customer. Most excellent. \u003C/p\u003E\u003Cp\u003ELet me begin by saying thank you for taking the time to both try the Vertical TechTree, and giving such a detailed expository of what I did wrong with miniaturization. You make several valid points, and I do want to make improvements to the tech tree every chance I get, so it is satisfying to get as much feedback as possible from my client base. Also, I must warn that some viruses are trying to eat my face from the inside out, therefore the possibility that this might devolve into incoherent babbling. I shall endeavour to remain focused, and brief.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Frostiken\u0022 data-cite=\u0022Frostiken\u0022\u003E\u003Cdiv\u003EI do have to say, the \u0027miniaturization\u0027 node is unlocked pretty early on, and it is absolutely jam-packed with stuff. Almost too much stuff, if you ask me.\u003Cp\u003EWithout even all the mods, I get:\u003C/p\u003E\u003Cp\u003E1) Several structural adapters.\u003C/p\u003E\u003Cp\u003E2) 3 different radial mounts.\u003C/p\u003E\u003Cp\u003E3) Radial decoupler, mini stack decoupler, AND mini stack separator.\u003C/p\u003E\u003Cp\u003E4) Two radiators from Interstellar.\u003C/p\u003E\u003Cp\u003E5) Two robotic gantries.\u003C/p\u003E\u003Cp\u003E6) Procedural fairing mounts. But no fairings.\u003C/p\u003E\u003Cp\u003E7) Mini-SAS.\u003C/p\u003E\u003Cp\u003EThis is WAY too much stuff. First of all, why would I unlock all these decouplers for \u0027miniaturization\u0027 before I\u0027ve even got a basic decoupler to miniaturize? Also, the radial decoupler is definitely not \u0022miniaturized\u0022 so I don\u0027t know why it\u0027s in there. Secondly, the heat radiators from interstellar have no purpose this early in the tree. Not sure why they\u0027re down this low. Third, the robotic gantries again, not much use this early on, but it\u0027s doubly confusing since \u0027miniaturization\u0027 unlocks access to \u0027basic robotics\u0027 which is a totally empty node (nothing even defined in the tree.cfg). I\u0027m also not sure why the fairing mounts are here. The mini-SAS arguably may have a use on a command-chair-driven suicide ship, but probably not.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPerhaps miniaturization is slightly misleading a title for this discipline. It was not intended to be the results of making existing technology smaller, but rather a seperate branch of technology independantly developing tiny rocket parts. I believe a better question is, why are there so many tiny sized decouplers? By my count, and unless I got confused about the size of a decoupler, there are 8 stack decoupler/seperators, and they all have 0.625m radii, so they went with their miniature brethren.\u003C/p\u003E\u003Cp\u003EThe miniaturization node is pretty much a catch all for tiny and 0.625m parts, it is true. It is not be the best solution to dealing with tiny parts, I know, but I did not feel it necessary to give much thought or time to developing an expansive subtree to cover all these parts. However, hearing from you has given me the opportunity to think about it now. I think you are right, this is too many parts to get for a single node, let alone how cheap the node is. However, there is not \u003Cem\u003Emuch \u003C/em\u003Erandomness to the node, I feel. All tiny sized control, spacefram, aerospacefram, compound rocketry, robotics, and science parts were sorted into miniaturization as well the repairStation from Mission Control mod. The radial decoupler you mentioned is infact a miniature version of the stock radial decoupler and is from Sceppies mini pack. Looking at the list of parts in it, they still all look tiny too me. \u003C/p\u003E\u003Cp\u003EThe radiators radiate heat into space... all photovoltaics generate heat from direct sunlight. Might as well put a mini radiator on a mini spacecraft with kerbolar panels. And the gantries might have some use.. At least they are with other small statured parts, eh? About the Basic Robotics node... I do not know what happened, for there should be parts in it. I must have taken them out somehow. Fix this error I shall. The fairing mounts are there because they are tiny sized variants of their larger cousins, thus in the tiny size parts category. All of these parts are tiny, so they are logically sorted together. Albeit, the whole lot is extremely cheap. It could do with a reorganization. Perhaps branching nodes for the various subdisciplines.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Frostiken\u0022 data-cite=\u0022Frostiken\u0022\u003E\u003Cdiv\u003ERemove the radiators, the gantries and the decouplers. Decouplers were even harder to get in the stock tree, in this tree I\u0027m getting three for one. Decouplers should be put somewhere else, separated by type (radial, stack, and separator), type and then size (don\u0027t forget to put the Novapunch \u0027explosive bolt\u0027 in here - it\u0027s pretty much the only miniature radial decoupler we have, and it has far more use as that then it does as a fairing separator which was its original purpose).\u003Cp\u003ELooking in the tree.cfg, this is practically only half of what else this node unlocks. I don\u0027t even know what most of this is. \u0027repairStation\u0027, \u0027desacopladorsat1\u0027. There\u0027s almost thirty things unlocked by this one cheap, easy, early node.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EActually, there are 33 parts in the miniature node.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Frostiken\u0022 data-cite=\u0022Frostiken\u0022\u003E\u003Cdiv\u003EI like the idea of an all-inclusive tech tree but to be honest, this current layout just seems entirely random. I like the idea of starting off with nothing and getting only really ****ty low-powered tiny engines and having to make do with them, but once you go beyond that point, it\u0027s kind of like tech nodes just unlock random stuff almost totally unrelated to previous nodes. There should be a basic tree covering, say, liquid rocket nozzles, and I can branch off one of those to unlock \u0027miniature rocket nozzles\u0027 that has a codependent unlock with \u0027miniaturization\u0027 technology. Having a bunch of the tiny rocket nozzles in a tree completely different from rocketry technology just doesn\u0027t make any sense. I don\u0027t really feel like I\u0027m following a \u0027path\u0027 to unlock what I want - I\u0027m kind of just picking things at random and making do with whatever I get.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETo be frank, I do not see the layout as being random at all. If you want to see random, I would look at the stock tech tree. My layout tries to follow a least to most complexity concept. If I may, here is the general premise for the logic the structure follows, some of which may be gleaned from reading the descriptions of the nodes within the tech tree?\u003C/p\u003E\u003Cp\u003EIn the beginning, the kerbals had no rockets, just the dream of discovery and wanderlust.\u003C/p\u003E\u003Cp\u003EIn their quest for knowledge, Logic was invented, along with the chair and base used to sit and think logically. (somewhat of a joke, I think, for what use is a chair, a block with a small battery in it, a capsule, and a truss to a space program?)\u003C/p\u003E\u003Cp\u003EFrom this basic notion of logic follows the investigative method for describing the universe the kerbals live in and the use of basic electrical devices to make space exploration more viable, which lead to all kinds of neat technologies the space program could use, like photovoltaics, landing aperatuses, wireless communications, electric propulsion, and electronic computer controlled devices.\u003C/p\u003E\u003Cp\u003EI envisaged rocketry being invented accidentally in an accident involving explosives and a steel drum container..\u003C/p\u003E\u003Cp\u003EFrom here, liquid rockets are developed, stability is discovered, and the principles of aerodynamics described, followed by structural design, aerocraft utilization and survivability initiatives.\u003C/p\u003E\u003Cp\u003EExploration and resource utilization come along after kerbals start visting other celestial bodies. Nuclear propulsion came about after the study of radioisotopic thermal generators and a progression of study that led from advanced rocketry to spaceframes and the study of exotic materials in exotic environments. Robotics were needed to make the miniature forms as seen in the miniaturization node, since kerbals have such cumbersome digital manipulation abilities.\u003C/p\u003E\u003Cp\u003ETheoretics is the culmination of years of disciplined discipline study, where the very laws of space and time are eventually mastered and bent to the will of the kerbals.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Frostiken\u0022 data-cite=\u0022Frostiken\u0022\u003E\u003Cdiv\u003EAnother good example is under \u0027hypergolic thruster systems\u0027 - you unlock RCS ports... pretty much all of them. I couldn\u0027t tell you what mod it comes from, but I have RCS ports that are only bi-directional, and some that are 5-directional. Wouldn\u0027t it make more sense to have the first \u0027level\u0027 of this only unlock a very simple RCS fuel tank and the single-port RCS thruster, with more advanced RCS thrusters being unlocked progressively? And the feeling still exists that these are simply placed randomly in the tree - having these tied to \u0027miniaturization\u0027 is rather silly, because RCS is for big rockets where reaction wheels don\u0027t work, not for tiny space probes.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAbout that. To be fair, there are 29 parts in level one hypergolic systems, and 22 in level two hypergolic systems. My method for sorthing RCS was mainly thrust. Low thrust goes in level one, and higher thrust goes in level two, and container sorting should be somewhat obvious. Complexity did not factor much into this category. At the time it made more sense to organize the little rcs thrusters like I did the larger liquid engines.. I do not see this as silly, though. The only thing that differentiates an RCS thruster from a liquid rocket engine is scale and fuel. To summerize, miniaturization is all about scale, not process or function.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Frostiken\u0022 data-cite=\u0022Frostiken\u0022\u003E\u003Cdiv\u003EBTW I went into TreeEdit. If I\u0027m understanding it correctly, here\u0027s a list of stuff I have that\u0027s currently unsupported: \u003Ca href=\u0022http://i.imgur.com/ZuRIfSo.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/ZuRIfSo.png\u003C/a\u003E\u003Cp\u003EObviously Stretchy SRBs and StationScience are two big parts of that:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/57422-0-23-StretchySRB-A-StretchyTanks-Continuation-v8-12-29-13\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/57422-0-23-StretchySRB-A-StretchyTanks-Continuation-v8-12-29-13\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/54774-0-23-Station-Science-%28fourth-alpha-low-tech-docking-port-experiment-pod-models%29\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/54774-0-23-Station-Science-%28fourth-alpha-low-tech-docking-port-experiment-pod-models%29\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EHere\u0027s some other mods you don\u0027t have supported yet.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/63628-0-23-Beastly-Science-Scoop-O-Matic-%28Unmanned-Surface-Sampler%29-%28DEC2913%29\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/63628-0-23-Beastly-Science-Scoop-O-Matic-%28Unmanned-Surface-Sampler%29-%28DEC2913%29\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/53813-0-23-L-Tech-Scientific-Stuff-V1-9\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/53813-0-23-L-Tech-Scientific-Stuff-V1-9\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/61040-0-23-6S-Service-Compartment-Tubes-Design-smooth\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/61040-0-23-6S-Service-Compartment-Tubes-Design-smooth\u003C/a\u003E!\u003C/p\u003E\u003Cp\u003EThis accounts for 80% of that list. The other 20% are all orphans that got overlooked. For example, everything from \u0027SmallerMPD\u0027 to \u0027FNLCMS\u0027 are part of Interstellar. There\u0027s also a lot of orphans from LLL and a few odd parts from other mods. I can see the blanket solar panel from NearFuture... There\u0027s a few parts there I have no idea what they are, but the majority of the remainder parts are from mods that should be supported but aren\u0027t supported in their entirety.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have, in general, avoided the Stretchy tanks mod, because they can circumvent the entirety of fuel storage and boosters in the Rocketry Discipline. Do not get me wrong, this mod is a great mod and I like the premise of it. I just did not want to have a line of engines, and then a line of stretchy stuff and then another line of non-stretchy tanks and boosters. I did, however, say I would honor all requests, and I shall. Look for them in the next update, I suppose. Actually, just proofing: I did add the stretchy tanks from the original mod thread, not NathanKell\u0027s continuation, I just downloaded and installed it.\u003C/p\u003E\u003Cp\u003EWith Station Science though, I saw this mod after it was first posted, but lost and forgot about it since. But you brought it back to my attention. For that I can thank you. As for the other mods, you may enjoy that they are being included in the next update. There are several parts whose mods are supposedly supported missing, I know. This is because I finished v1.12.18.b before those mods put out their updates for 0.23. I cannot think of a better way to include parts missed in that situation besides an update. Also, this last week I have been looking off and on for more parts mods, so you expect even more mod support, be it \u003C/p\u003E\u003Cp\u003ESo, thank you again for adding to the discussion. When it comes to the design of the Vertical TechTree, it is very helpful and important for me to get the insight of other players, that I may offer everyone an enjoyable experience with KSP\u0027s technology aquisition simulator module. \u003C/p\u003E\u003Cp\u003EHere is a list of mods I am currently in the process of implimenting into the tree for almost a week now (I have had to do other things too, by the way):\u003C/p\u003E\u003Cp\u003EL-Tech Scientific Stuff\u003C/p\u003E\u003Cp\u003EFTmN Atomic Rockets\u003C/p\u003E\u003Cp\u003EStockalike Double Nerva\u003C/p\u003E\u003Cp\u003EWR1 Rapier and WV8 Air Scoop\u003C/p\u003E\u003Cp\u003EMechPod\u003C/p\u003E\u003Cp\u003EPegasus Px2\u003C/p\u003E\u003Cp\u003ESpace Eagle 1999 \u003C/p\u003E\u003Cp\u003EHyperRing\u003C/p\u003E\u003Cp\u003EWT-51 Transport\u003C/p\u003E\u003Cp\u003EFreelander Pod\u003C/p\u003E\u003Cp\u003EPort-o-Hatch\u003C/p\u003E\u003Cp\u003EEmergancy Escape Pod \u0022The Egg\u0022\u003C/p\u003E\u003Cp\u003EExperimental Parts Pack\u003C/p\u003E\u003Cp\u003ERoverwheel Pack\u003C/p\u003E\u003Cp\u003EFL-1 Rover and Wheels\u003C/p\u003E\u003Cp\u003ESpace Station Core Pack\u003C/p\u003E\u003Cp\u003ETarsier Space Technology\u003C/p\u003E\u003Cp\u003E6S Service Compartment Tubes\u003C/p\u003E\u003Cp\u003EDamned Robotics MOdular MANipulator\u003C/p\u003E\u003Cp\u003ELife Support Converter\u003C/p\u003E\u003Cp\u003EElectrolyzer and Fuel Cell\u003C/p\u003E\u003Cp\u003ELazTek SpaceX Launch Pack 2.2\u003C/p\u003E\u003Cp\u003ETri-Hexagonal Structural Trusses\u003C/p\u003E\u003Cp\u003EHistoric Soviet Pack\u003C/p\u003E\u003Cp\u003EHistoric American Pack\u003C/p\u003E\u003Cp\u003EDeep Space Mission Pack\u003C/p\u003E\u003Cp\u003EThe Truss Pack\u003C/p\u003E\u003Cp\u003EBeastly Science - Scoop-O-Matic\u003C/p\u003E\u003Cp\u003EThis garrulously loquacious exposÃƒÂ© has been brought to you by \u003Ca href=\u0022http://bit.ly/1k35zdA\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Book Antiqua\u0027;\u0022\u003E\u003Cspan style=\u0022color:#DD0000;\u0022\u003E\u003Cstrong\u003EA\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cstrong\u003ECKANDERÃ¢â‚¬â„¢S\u003C/strong\u003E\u003C/span\u003E \u003Cstrong\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cspan style=\u0022color:#00DD00;\u0022\u003EV\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cspan style=\u0022color:#00DD00;\u0022\u003EERTICAL\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\u003Cstrong\u003E T\u003C/strong\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cstrong\u003EECH\u003C/strong\u003E\u003C/span\u003E\u003Cstrong\u003ET\u003C/strong\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cstrong\u003EREE\u003C/strong\u003E\u003C/span\u003E\u003C/a\u003E, may your technologies tree forever propagate vertically.\u003C/p\u003E\n"},{"CreatedByName":"Frostiken","CreatedById":1837,"CreatedDateTime":"2013-12-31T12:55:29Z","Content":"\n\u003Cp\u003EYeah, well, that\u0027s just, like, your opinion, man.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EJust kidding, more to come on this post after I do a thing.\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"Ackander","CreatedById":90879,"CreatedDateTime":"2013-12-31T13:03:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Frostiken\u0022 data-cite=\u0022Frostiken\u0022\u003E\u003Cdiv\u003EYeah, well, that\u0027s just, like, your opinion, man.\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EJust kidding, more to come on this post after I do a thing.\u003C/span\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAre you talkin\u0027 to me?\u003C/p\u003E\n"},{"CreatedByName":"Lendsil","CreatedById":92827,"CreatedDateTime":"2013-12-31T13:18:19Z","Content":"\n\u003Cp\u003EI just wanted to thank you for your work on this, Ackander. It\u0027s added fun and almost strategic-like element that I felt was missing to the career mode.\u003C/p\u003E\n"},{"CreatedByName":"Frostiken","CreatedById":1837,"CreatedDateTime":"2013-12-31T14:59:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ackander\u0022 data-cite=\u0022Ackander\u0022\u003E\u003Cdiv\u003EPerhaps miniaturization is slightly misleading a title for this discipline. It was not intended to be the results of making existing technology smaller, but rather a seperate branch of technology independantly developing tiny rocket parts. I believe a better question is, why are there so many tiny sized decouplers? By my count, and unless I got confused about the size of a decoupler, there are 8 stack decoupler/seperators, and they all have 0.625m radii, so they went with their miniature brethren.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMy mistake on that. I admit that I downloaded several packs I\u0027ve never used specifically because this tech tree brought them to my attention, and I wasn\u0027t aware that was a \u0027mini\u0027 radial decoupler. \u003C/p\u003E\u003Cp\u003EAnyway, let me preface this by saying \u0027I don\u0027t want to tell you how to make your mod\u0027. Well, actually, I do \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E But just looking at this it looks like a TON of work had to go into this to get it to where it is. So understand that I\u0027m aware of the brainpain and the insane amount of time it had to have taken to just load up all these mods and figure out what parts should go where. \u003C/p\u003E\u003Cp\u003EOne thing I really like about the tree are the tiny sub-branches, such as how \u0027General Rocketry\u0027 spawns four little dead-end nodes with some improved parts in them. And I think that that concept should be expanded on to help break up the \u0027cash cow\u0027 parts like the Miniaturization node. One \u0027problem\u0027 I see with the tree as a whole is that it\u0027s... well it\u0027s mod-friendly. It almost encourages you to jam-pack your installation to fill up as many nodes as you can. When that happens, you have several nodes which only have one or two specialized parts, and then you have some nodes which are just bursting with oodles of parts. Here\u0027s what the problem is - every single part in a node increases the value-per-science point. Let\u0027s take Heavy Rocketry as an example. It\u0027s 180 points, and in my installation, it has some fuel tanks, fairings, the capsule, some engines, and structural bits. Unlocking Heavy Rocketry gives you access to the Heavy Solid Booster tech, which is 200 points, except this thing only contains one part for me - a single big SRB. Tree.cfg says it has one other SRB with it. But still, the value of that node is considerably less. By packing many parts into single nodes, you make your science dollar go further.\u003C/p\u003E\u003Cp\u003EI just think the tree might be better served by shattering nodes into components to give players more choices to pick-and-choose. Let\u0027s take basic 1m rocket bits, for example. There\u0027s three components to a 1m liquid fuel rocket - fuel tanks, engines, and structural bits. So let\u0027s say the first step to 1m rockets is to unlock \u0027Basic Rocketry\u0027. This node is fairly expensive and may contain few or \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Eeven no parts at all\u003C/span\u003E. However, unlocking Basic Rocketry gives you access to three more tech nodes - Basic Engineering, Basic Fuel Tanks, and Basic Engines. The first level of these are fairly cheap - you \u0027paid ahead\u0027 by unlocking the \u0027introductory\u0027 Basic Rocketry node. Branching off of the engineering, fuel tanks, and engines are subtechs that give you more specialized parts. The basic engine, for example, could be just the LV-909. Upgrades would be the choice of the LV-T30 (with subsequent LV-T45 upgrade to that), basic radial engines, or for a substantial fee, say, the advanced 1m engines from the Space Shuttle pack. (1m engines was actually a bad example, because I don\u0027t have really any mods that add more 1m engines... KW Rocketry would add more to fill it with). Fuel tanks would be much the same, maybe starting with a medium tank and being able to get shorter and longer ones. Engineering parts would be basic 1m structural bits and decouplers. You could then take the fuel tanks and have them all be prerequisites for the 1m stretchy tank (which could have a \u0027dynamic engineering\u0027 prerequisite from elsewhere in the tree). \u003C/p\u003E\u003Cp\u003EOf those 1m nodes, you can then pick a few that would be considered \u0027mandatory\u0027, and those are marked as prerequisites to another empty node (or maybe a node containing some 1m reward parts), but that node is named \u0027Basic Rocket Mastry\u0027. The purpose of this node is to serve as the \u0027completion point\u0027 to 1m rockets, and from there you can repeat the process with 2m rocket parts. Two issues here - it would be one cluttered tree, and I don\u0027t know if there\u0027s limits on number of nodes or arrows... god knows this game is limited enough.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EIn the beginning, the kerbals had no rockets, just the dream of discovery and wanderlust.\u003Cp\u003EIn their quest for knowledge, Logic was invented, along with the chair and base used to sit and think logically. (somewhat of a joke, I think, for what use is a chair, a block with a small battery in it, a capsule, and a truss to a space program?)\u003C/p\u003E\u003Cp\u003EFrom this basic notion of logic follows the investigative method for describing the universe the kerbals live in and the use of basic electrical devices to make space exploration more viable, which lead to all kinds of neat technologies the space program could use, like photovoltaics, landing aperatuses, wireless communications, electric propulsion, and electronic computer controlled devices.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFair enough - I went ahead and cheated and unlocked all my science nodes and I can see some method to the madness in the big picture. There does however seem to be a lot of these \u0027cash cow\u0027 nodes higher up in the tree, particularly where you unlock almost an entire mod\u0027s worth of content at once. There were a couple nodes in the science tree that have like four or five instruments at once.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ENuclear propulsion came about after the study of radioisotopic thermal generators and a progression of study that led from advanced rocketry to spaceframes and the study of exotic materials in exotic environments.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah... about that... this is where I think your tech tree has some serious problems. The first solar panel you can unlock costs 33 science points to get. The first RTG costs 43, and both are children of the \u0027basic electrics\u0027 node. RTGs are way too low in the tree. RTGs are essentially free energy in KSP. Your power demands should be met by batteries -\u0026gt; ****ty solar panels -\u0026gt; good solar panels -\u0026gt; ****ty nuclear energy (eg: the Interstellar fission reactors) -\u0026gt; good nuclear energy (RTGs) -\u0026gt; advanced power generation (HOME power reactor, exotic power generators). All in all, everything nuclear should be insanely expensive and high on the tech tree. You absolutely do not need nuclear power to get to Kerbin\u0027s moons, and it could be argued that you really don\u0027t even need it to get to Duna. Your first trips out that far should be with conventional rockets, just like ours are. From what I can count, the fastest you can get nuclear rockets is with 340 science points. That\u0027s... not a lot.\u003C/p\u003E\u003Cp\u003EWhich brings me to another flaw with this mod (sorry!) - the nature of science points. Let\u0027s take the Station Science mod. In default KSP, it\u0027s unlocked very early on. You\u0027re given a super-crappy docking port to use. The idea is that you can park a station in orbit early in the game and use it to bolster your science progress (since the default tech tree science prices rapidly escalate). Here\u0027s what this has to do with your tech tree - your tech tree is trying to be modular, but unfortunately you can\u0027t guarantee that everyone has all, some, or even any of your supported mods. 340 science points I consider pretty cheap - and it\u0027s unfortunate that someone running mods that give them more ways to get science is going to find those prices even cheaper still, whereas someone who has no mods whatsoever and is using your tree is going to burn a lot of science points on nodes with almost nothing in them.\u003C/p\u003E\u003Cp\u003EThere\u0027s obviously no real way to solve this except maybe offering trees that have altered pricing to reflect how much easier using a buttload of mods are. I\u0027m not criticizing, just thinking aloud.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI have, in general, avoided the Stretchy tanks mod, because they can circumvent the entirety of fuel storage and boosters in the Rocketry Discipline. Do not get me wrong, this mod is a great mod and I like the premise of it. I just did not want to have a line of engines, and then a line of stretchy stuff and then another line of non-stretchy tanks and boosters. I did, however, say I would honor all requests, and I shall. Look for them in the next update, I suppose. Actually, just proofing: I did add the stretchy tanks from the original mod thread, not NathanKell\u0027s continuation, I just downloaded and installed it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, as I said above, stretchy tanks should be the culmination of mastry of a given rocket size\u0027s fuel tanks. Once you have all fuel tanks possible for a 1m rocket, is a stretchy 1m fuel tank really \u0027cheating\u0027? You can also make these things incredibly expensive to unlock, since they certainly wouldn\u0027t be necessary due to accessibility to non-stretchy fuel tanks - just a luxury item. And the \u0027pool\u0027 tanks should be at the absolute top of the tech tree since those definitely would be cheating anywhere else.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThis garrulously loquacious exposÃƒÂ© has been brought to you by \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/60469\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Book Antiqua\u0027;\u0022\u003E\u003Cspan style=\u0022color:#DD0000;\u0022\u003E\u003Cstrong\u003EA\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cstrong\u003ECKANDERÃ¢â‚¬â„¢S\u003C/strong\u003E\u003C/span\u003E\u003Cspan style=\u0022font-family:\u0027Book Antiqua\u0027;\u0022\u003E \u003C/span\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cspan style=\u0022color:#00DD00;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Book Antiqua\u0027;\u0022\u003EV\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cspan style=\u0022color:#00DD00;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Book Antiqua\u0027;\u0022\u003EERTICAL\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\u003Cstrong\u003E T\u003C/strong\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cstrong\u003EECH\u003C/strong\u003E\u003C/span\u003E\u003Cstrong\u003ET\u003C/strong\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cstrong\u003EREE\u003C/strong\u003E\u003C/span\u003E\u003C/a\u003E, may your technologies tree forever propagate vertically.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u0026lt;3\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-31T15:02:15Z\u0022 title=\u002212/31/2013 03:02  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 31, 2013\u003C/time\u003E by Frostiken\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ackander","CreatedById":90879,"CreatedDateTime":"2013-12-31T18:00:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Lendsil\u0022 data-cite=\u0022Lendsil\u0022\u003E\u003Cdiv\u003EI just wanted to thank you for your work on this, Ackander. It\u0027s added fun and almost strategic-like element that I felt was missing to the career mode.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E Seriously, I started playing KSP again when 0.22 released and thought to myself, \u0022These parts are randomly and illogically placed on the tech tree.. and why is it going from left to right?\u0022 I think we were all lucky R4amon was able to put out the TreeEdit/TreeLoader when he did.\u003C/p\u003E\n"},{"CreatedByName":"Ackander","CreatedById":90879,"CreatedDateTime":"2013-12-31T18:12:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Frostiken\u0022 data-cite=\u0022Frostiken\u0022\u003E\u003Cdiv\u003EMy mistake on that. I admit that I downloaded several packs I\u0027ve never used specifically because this tech tree brought them to my attention, and I wasn\u0027t aware that was a \u0027mini\u0027 radial decoupler. \u003Cp\u003E-snkt-\u003C/p\u003E\u003Cp\u003E\u0026lt;3\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELet me say.. I do have an excuse for everything so far. Let me eat lunch and then perhaps I will have some time for a rebuttle before new year party. Great ideas by the way, giving me something to think about.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-31T20:56:15Z\u0022 title=\u002212/31/2013 08:56  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 31, 2013\u003C/time\u003E by Ackander\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"gardocki","CreatedById":58921,"CreatedDateTime":"2013-12-31T20:08:09Z","Content":"\n\u003Cp\u003EAckander, I just wanted to say thank you for this great mod. I was seriously underwhelmed by the stock tech tree, but with your version and a ludicrous number of part mods, KSP is fun again!\u003C/p\u003E\n"},{"CreatedByName":"Ackander","CreatedById":90879,"CreatedDateTime":"2013-12-31T20:54:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022gardocki\u0022 data-cite=\u0022gardocki\u0022\u003E\u003Cdiv\u003EAckander, I just wanted to say thank you for this great mod. I was seriously underwhelmed by the stock tech tree, but with your version and a ludicrous number of part mods, KSP is fun again!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAwesome! I have a feeling I\u0027ll be working on the tree for a while. It maybe adequate now, but I feel like it could be better, which hopefully it will get. Ah.. I just had an idea. Thanks guys. \u003C/p\u003E\u003Cp\u003E~They see me rollin\u0027\u003C/p\u003E\u003Cp\u003Elines of capsules\u003C/p\u003E\u003Cp\u003Esayin they need a parachute to gather science\u003C/p\u003E\u003Cp\u003Eparachute to gather science\u003C/p\u003E\u003Cp\u003Eparachute to gather science\u003C/p\u003E\u003Cp\u003Eparachute to gather science\u003C/p\u003E\u003Cp\u003Eparachute to gather science\u003C/p\u003E\n"},{"CreatedByName":"Ackander","CreatedById":90879,"CreatedDateTime":"2013-12-31T23:03:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Frostiken\u0022 data-cite=\u0022Frostiken\u0022\u003E\u003Cdiv\u003EMy mistake on that. I admit that I downloaded several packs I\u0027ve never used specifically because this tech tree brought them to my attention, and I wasn\u0027t aware that was a \u0027mini\u0027 radial decoupler. \u003Cp\u003EAnyway, let me preface this by saying \u0027I don\u0027t want to tell you how to make your mod\u0027. Well, actually, I do \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E But just looking at this it looks like a TON of work had to go into this to get it to where it is. So understand that I\u0027m aware of the brainpain and the insane amount of time it had to have taken to just load up all these mods and figure out what parts should go where.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt has taken a lot of time to get this far. I think the biggest mistake I made in the process, however, was to design it soley around my personal notions of storying and technologic progression. I maybe should have started a development thread to start getting user feedback much sooner than I did. I think I would have got further sooner with a better tree.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Frostiken\u0022 data-cite=\u0022Frostiken\u0022\u003E\u003Cdiv\u003EOne thing I really like about the tree are the tiny sub-branches, such as how \u0027General Rocketry\u0027 spawns four little dead-end nodes with some improved parts in them. And I think that that concept should be expanded on to help break up the \u0027cash cow\u0027 parts like the Miniaturization node. One \u0027problem\u0027 I see with the tree as a whole is that it\u0027s... well it\u0027s mod-friendly. It almost encourages you to jam-pack your installation to fill up as many nodes as you can. When that happens, you have several nodes which only have one or two specialized parts, and then you have some nodes which are just bursting with oodles of parts. Here\u0027s what the problem is - every single part in a node increases the value-per-science point. Let\u0027s take Heavy Rocketry as an example. It\u0027s 180 points, and in my installation, it has some fuel tanks, fairings, the capsule, some engines, and structural bits. Unlocking Heavy Rocketry gives you access to the Heavy Solid Booster tech, which is 200 points, except this thing only contains one part for me - a single big SRB. Tree.cfg says it has one other SRB with it. But still, the value of that node is considerably less. By packing many parts into single nodes, you make your science dollar go further. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, the little sub-branches came about because I saw the need to \u0027re-value\u0027 the main nodes of the disciplines. They were getting bloated by all the parts getting stuffed into them. I worried however that I might make too many nodes, making a convoluted mess of connections and nodes. And while expanding the tree with more nodes will help the parts per science ratio, you run into the problem of whether or not a player even has the mod with the parts to fill the node, or even being able to fill that node with parts because enough parts of the same class do not exist. I can think of a few solutions to this, but they generally involve ModuleManager or a new plugin.. I do not think I am ready to get into that yet, but if I find a quicker way to do what I am thinking, I may get to it sooner rather than later.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Frostiken\u0022 data-cite=\u0022Frostiken\u0022\u003E\u003Cdiv\u003EI just think the tree might be better served by shattering nodes into components to give players more choices to pick-and-choose. Let\u0027s take basic 1m rocket bits, for example. There\u0027s three components to a 1m liquid fuel rocket - fuel tanks, engines, and structural bits. So let\u0027s say the first step to 1m rockets is to unlock \u0027Basic Rocketry\u0027. This node is fairly expensive and may contain few or \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Eeven no parts at all\u003C/span\u003E. However, unlocking Basic Rocketry gives you access to three more tech nodes - Basic Engineering, Basic Fuel Tanks, and Basic Engines. The first level of these are fairly cheap - you \u0027paid ahead\u0027 by unlocking the \u0027introductory\u0027 Basic Rocketry node. Branching off of the engineering, fuel tanks, and engines are subtechs that give you more specialized parts. The basic engine, for example, could be just the LV-909. Upgrades would be the choice of the LV-T30 (with subsequent LV-T45 upgrade to that), basic radial engines, or for a substantial fee, say, the advanced 1m engines from the Space Shuttle pack. (1m engines was actually a bad example, because I don\u0027t have really any mods that add more 1m engines... KW Rocketry would add more to fill it with). Fuel tanks would be much the same, maybe starting with a medium tank and being able to get shorter and longer ones. Engineering parts would be basic 1m structural bits and decouplers. You could then take the fuel tanks and have them all be prerequisites for the 1m stretchy tank (which could have a \u0027dynamic engineering\u0027 prerequisite from elsewhere in the tree). \u003Cp\u003EOf those 1m nodes, you can then pick a few that would be considered \u0027mandatory\u0027, and those are marked as prerequisites to another empty node (or maybe a node containing some 1m reward parts), but that node is named \u0027Basic Rocket Mastry\u0027. The purpose of this node is to serve as the \u0027completion point\u0027 to 1m rockets, and from there you can repeat the process with 2m rocket parts. Two issues here - it would be one cluttered tree, and I don\u0027t know if there\u0027s limits on number of nodes or arrows... god knows this game is limited enough. \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOne of the solutions I have been pondering would involve writing an extensive MM config file adding a bunch of conditional unlocks like MechJeb uses. I know I have seen something like this somewhere that gives progressive upgrades to engines when they unlock the nodes with upgrades. I would like this system, because the quality of a group of parts can be controlled by the player\u0027s choices in the techtree.\u003C/p\u003E\u003Cp\u003EAnother solution I imagined was to use the xls file I made in conjunction with the mods installed to dynamically price each node according to what parts are available in them. This would be the easiest for me, because the xls sheet is already made, all I would have to do is teach users how to use it to get a personallized tree.cfg file to install. How it would work is you load the master tree.cfg into a save game with TreeEdit. Saving the tech tree after loading will take away all parts from the tree not installed. You take the text from the saved tree.cfg, copy it to the xls sheet. From there, the sheet will detect the parts per node, and calculate how much each node should cost based on things like height in the tree, how many parts per that node, the discipline the node is in, the number of steps to reach that node, the cost of each part (somehow cross referenced.. maybe maybenot this one, it is time dependant), and wheather some science mods are loaded or not, like station tech, or L-Tek Science.. That one adds something like more than 2 million science points to the game, either that our it is infinite. One of the experiments does not list a scienceCap entry... just sounds crazy every time I look at it. \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003EWhat would everyone prefer for the short term?\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Frostiken\u0022 data-cite=\u0022Frostiken\u0022\u003E\u003Cdiv\u003EFair enough - I went ahead and cheated and unlocked all my science nodes and I can see some method to the madness in the big picture. There does however seem to be a lot of these \u0027cash cow\u0027 nodes higher up in the tree, particularly where you unlock almost an entire mod\u0027s worth of content at once. There were a couple nodes in the science tree that have like four or five instruments at once.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDefinitely a factor of early design decisions. I wanted to limit how many nodes and levels I created, levels being like basic, advanced, heavy, etc. Too many, and holes were inevitable for many users, and not enough, and the cash cow problem arises. Another decision I made early was that no mods would be required, so I have been fighting since then to figure out how to balance the presence or lack there of all the mod parts. I think without mods, the techtree works, and with all mods, the techtree works.. but combinations of inbetweens is the hardest problem to solve for. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Frostiken\u0022 data-cite=\u0022Frostiken\u0022\u003E\u003Cdiv\u003EYeah... about that... this is where I think your tech tree has some serious problems. The first solar panel you can unlock costs 33 science points to get. The first RTG costs 43, and both are children of the \u0027basic electrics\u0027 node. RTGs are way too low in the tree. RTGs are essentially free energy in KSP. Your power demands should be met by batteries -\u0026gt; ****ty solar panels -\u0026gt; good solar panels -\u0026gt; ****ty nuclear energy (eg: the Interstellar fission reactors) -\u0026gt; good nuclear energy (RTGs) -\u0026gt; advanced power generation (HOME power reactor, exotic power generators). All in all, everything nuclear should be insanely expensive and high on the tech tree. You absolutely do not need nuclear power to get to Kerbin\u0027s moons, and it could be argued that you really don\u0027t even need it to get to Duna. Your first trips out that far should be with conventional rockets, just like ours are. From what I can count, the fastest you can get nuclear rockets is with 340 science points. That\u0027s... not a lot.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou got me there. The RTG placement is ill-conceived. Especially in relation to photovoltaics. I think I did it wrong when I spread out all the various RTG/rtg-like parts from all mods, forcing the low end ones so far down the line. I think I will fix this this time if I think about it. The cost to experimental nuclear, that only has mod-nuke engine, however is 630, and to the first stock nuke engine 770. You are right, though that the nuclear discipline should require higher level electrics and more science.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Frostiken\u0022 data-cite=\u0022Frostiken\u0022\u003E\u003Cdiv\u003EWhich brings me to another flaw with this mod (sorry!) - the nature of science points. Let\u0027s take the Station Science mod. In default KSP, it\u0027s unlocked very early on. You\u0027re given a super-crappy docking port to use. The idea is that you can park a station in orbit early in the game and use it to bolster your science progress (since the default tech tree science prices rapidly escalate). Here\u0027s what this has to do with your tech tree - your tech tree is trying to be modular, but unfortunately you can\u0027t guarantee that everyone has all, some, or even any of your supported mods. 340 science points I consider pretty cheap - and it\u0027s unfortunate that someone running mods that give them more ways to get science is going to find those prices even cheaper still, whereas someone who has no mods whatsoever and is using your tree is going to burn a lot of science points on nodes with almost nothing in them.\u003Cp\u003EThere\u0027s obviously no real way to solve this except maybe offering trees that have altered pricing to reflect how much easier using a buttload of mods are. I\u0027m not criticizing, just thinking aloud.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI need more views on the subject, so thanks. I think you can definitely appreciate the problems faced by making such an all inclusive tech tree like this. I do not know how many times I told myself that was a stupid price, because there are only 2 parts in there.. Number of parts per node was not a factor, however, when I calculated the science costs There are solutions, but they will take time, and I will need further input from the crowd to get it to how everyone likes it.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Frostiken\u0022 data-cite=\u0022Frostiken\u0022\u003E\u003Cdiv\u003EYeah, as I said above, stretchy tanks should be the culmination of mastry of a given rocket size\u0027s fuel tanks. Once you have all fuel tanks possible for a 1m rocket, is a stretchy 1m fuel tank really \u0027cheating\u0027? You can also make these things incredibly expensive to unlock, since they certainly wouldn\u0027t be necessary due to accessibility to non-stretchy fuel tanks - just a luxury item. And the \u0027pool\u0027 tanks should be at the absolute top of the tech tree since those definitely would be cheating anywhere else. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is a viable solution to stretchy tanks. After this next update, I am going to have to address a lot of these problems and flaws... Perhaps with a little help I can get this tech tree to where everyone can like it. Should be possible.\u003C/p\u003E\u003Cp\u003EI just have a few more mods to sort.. still a bunch of parts since I have been spending time on Christmas and dealing with the computer crashing (no crashes today, thankfully).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-31T23:10:09Z\u0022 title=\u002212/31/2013 11:10  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 31, 2013\u003C/time\u003E by Ackander\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Talisar","CreatedById":62035,"CreatedDateTime":"2014-01-01T00:53:55Z","Content":"\n\u003Cp\u003EI like the way that you have the ancillary nodes coming off of the main tree (mostly on the rocketry branch). Possibly you could use a method such as that for some of the \u0022specialized mods\u0022? For some of the mods that have a wide variety of parts such as B9 (or spherical tanks \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E ) you would still have to fit them into the main tree or in multiple sub-nodes (or sub-trees) off of the major ones, but if you place the more focused mods into their own dead-end subnodes/trees, then if people don\u0027t have that particular mod installed they could just ignore that particular branch.\u003C/p\u003E\u003Cp\u003EWhat would be nice is if there were a way to give a tooltip for locked nodes that could state that that particular branch is not necessary to unlock unless you had that mod installed.\u003C/p\u003E\n"},{"CreatedByName":"Ackander","CreatedById":90879,"CreatedDateTime":"2014-01-01T09:39:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Talisar\u0022 data-cite=\u0022Talisar\u0022\u003E\u003Cdiv\u003EI like the way that you have the ancillary nodes coming off of the main tree (mostly on the rocketry branch). Possibly you could use a method such as that for some of the \u0022specialized mods\u0022? For some of the mods that have a wide variety of parts such as B9 (or spherical tanks \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E ) you would still have to fit them into the main tree or in multiple sub-nodes (or sub-trees) off of the major ones, but if you place the more focused mods into their own dead-end subnodes/trees, then if people don\u0027t have that particular mod installed they could just ignore that particular branch.\u003Cp\u003EWhat would be nice is if there were a way to give a tooltip for locked nodes that could state that that particular branch is not necessary to unlock unless you had that mod installed.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have looked at three different node structures in my head. I really want to keep the discipline seperation, so one of the structures is out. The second and third are basically Frostiken and your ideas. The fourth idea is so rediculous, I did not consider it viable.. it consists of a node for every part, or group of similar parts. With two and three, the tree is going to get huge.. maybe the entire research and development screen.\u003C/p\u003E\u003Cp\u003ESince the Spherical \u0026amp; Toroidal Tank Pack is yours, how would you suggest organizing them? Right now they are only sorted by diameter, and thus capacities. \u003C/p\u003E\u003Cp\u003EDoes anyone know of any limit on how many nodes I can create? \u003C/p\u003E\u003Cp\u003EI need to hurry with the update, so I can get started on the changes I have in mind.\u003C/p\u003E\n"},{"CreatedByName":"Talisar","CreatedById":62035,"CreatedDateTime":"2014-01-01T10:37:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ackander\u0022 data-cite=\u0022Ackander\u0022\u003E\u003Cdiv\u003ESince the Spherical \u0026amp; Toroidal Tank Pack is yours, how would you suggest organizing them? Right now they are only sorted by diameter, and thus capacities. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think you have them set up perfectly right now. They go well in the avant garde nodes, and the progression to get them makes sense to me. I also notice that you have split up my structural parts in a similar manner between 2 or three nodes, and I agree with that as well.\u003C/p\u003E\n"},{"CreatedByName":"TomatoSoup","CreatedById":59394,"CreatedDateTime":"2014-01-02T05:26:25Z","Content":"\n\u003Cp\u003EI have a peculiar problem that, in my brief scanning of this thread, I cannot tell if it is intentional or not. While the only parachutes I have are the stock ones (that is, to the best of my knowledge I don\u0027t have any mods that add parachutes), the first node I reached that claimed to contain parachutes was empty!\u003C/p\u003E\n"},{"CreatedByName":"Frostiken","CreatedById":1837,"CreatedDateTime":"2014-01-02T05:37:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TomatoSoup\u0022 data-cite=\u0022TomatoSoup\u0022\u003E\u003Cdiv\u003EI have a peculiar problem that, in my brief scanning of this thread, I cannot tell if it is intentional or not. While the only parachutes I have are the stock ones (that is, to the best of my knowledge I don\u0027t have any mods that add parachutes), the first node I reached that claimed to contain parachutes was empty!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat node only contains two parachutes - the ugly simple radial one from Novapunch, and the Kerbal EVA parachutes from... Vanguard Tech or something.\u003C/p\u003E\n"},{"CreatedByName":"barcharcraz","CreatedById":4796,"CreatedDateTime":"2014-01-02T05:44:34Z","Content":"\n\u003Cp\u003EThis tree is fantastic. I quite like having more nodes with less science/node, I feel like it motivates me more as I can unlock stuff more frequently and not just send the same rocket up time after time.\u003C/p\u003E\u003Cp\u003EOne nitpick: The spelling and grammar in the node descriptions is not all that great, I know English may not be your first language and that is fine but I find it detracts from the experience a bit. Please consider at least fixing the spelling. *goes and sits in the nitpicker\u0027s corner*\u003C/p\u003E\n"},{"CreatedByName":"Ackander","CreatedById":90879,"CreatedDateTime":"2014-01-02T06:34:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022barcharcraz\u0022 data-cite=\u0022barcharcraz\u0022\u003E\u003Cdiv\u003EThis tree is fantastic. I quite like having more nodes with less science/node, I feel like it motivates me more as I can unlock stuff more frequently and not just send the same rocket up time after time.\u003Cp\u003EOne nitpick: The spelling and grammar in the node descriptions is not all that great, I know English may not be your first language and that is fine but I find it detracts from the experience a bit. Please consider at least fixing the spelling. *goes and sits in the nitpicker\u0027s corner*\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI would like some examples please, so I know where to go to fix these spelling mistakes. I did write some of them poetically, so grammer was not a consideration. Likewise, I used artistic license to make up some words like aerospaceframes, aeroframes, aerocrafts, vacuusphere, etc.. If you will, excuse these. I shall, however, fix the real spelling errors. Thanks for the compliment. If you can think of anything else, please do not hesitate to come back and share. I will be watching...\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Nelien","CreatedById":65665,"CreatedDateTime":"2014-01-02T11:38:13Z","Content":"\n\u003Cp\u003EJust a quick question. Is it possible to change the settings of the thread poll so that you can change your vote? I voted before having played much with your tree and have now changed my mind after some more testing. I imagine I wouldn\u0027t be the only one so the poll might show skewed results.\u003C/p\u003E\u003Cp\u003EI voted for \u0026gt;23,000, but I feel now that the current science values are actually fairly well balanced. So I would probably move my vote down to 19,000-21,000.\u003C/p\u003E\n"},{"CreatedByName":"Ackander","CreatedById":90879,"CreatedDateTime":"2014-01-02T16:31:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nelien\u0022 data-cite=\u0022Nelien\u0022\u003E\u003Cdiv\u003EJust a quick question. Is it possible to change the settings of the thread poll so that you can change your vote? I voted before having played much with your tree and have now changed my mind after some more testing. I imagine I wouldn\u0027t be the only one so the poll might show skewed results.\u003Cp\u003EI voted for \u0026gt;23,000, but I feel now that the current science values are actually fairly well balanced. So I would probably move my vote down to 19,000-21,000.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECurrent poll results give a desired science cost range of 20,049 to 22,049. But the current cost of the tree is only 17,970. I think after the next cost overhaul, the prices for nodes should be more balanced. But it will involve work on the users part. I think I will distribute the excel sheet I made so users can adjust their science costs according to what mods they have installed. If anyone has a quick way of making a list of parts and their cost from their part.cfg files.. I could use it.\u003C/p\u003E\n"},{"CreatedByName":"Talisar","CreatedById":62035,"CreatedDateTime":"2014-01-02T17:41:49Z","Content":"\n\u003Cp\u003EThis makes me wonder something too... I\u0027m operating on the assumption that squad will be slowly but regularly adding biomes to more planetary bodies with each update. If so, how will that affect overall costs on science trees?\u003C/p\u003E\n"},{"CreatedByName":"barcharcraz","CreatedById":4796,"CreatedDateTime":"2014-01-02T18:23:45Z","Content":"\n\u003Cp\u003EGreat! thanks for taking my nitpick into mind. A list of problems I have noticed so far follows\u003C/p\u003E\u003Cp\u003E1. Strange wording in \u0022General Spaceframes and Structures\u0022. \u0022... to combine more parts into and ways to hold them together\u0022\u003C/p\u003E\u003Cp\u003E2. \u0022Compound Rocketry\u0022 develope does not have an e on the end\u003C/p\u003E\u003Cp\u003E3. \u0022Compound Rocketry\u0022 the last sentence is strange \u0022and maybe some help tools with the right installations\u0022\u003C/p\u003E\u003Cp\u003E4. \u0022General Solid Booster Motors\u0022 \u0022as solid boosters become a secondary technology to them\u0022. I would remove \u0022to them\u0022\u003C/p\u003E\u003Cp\u003E5. \u0022Hypergolic Thruster systems\u0022 \u0022spontaneous combustible\u0022 should probably be \u0022spontaneously combustible\u0022\u003C/p\u003E\u003Cp\u003E6. \u0022Basic aerodynamics\u0022 \u0022developement\u0022 should be \u0022development\u0022\u003C/p\u003E\u003Cp\u003EI am not that far up in the tree yet so there may be more issues. Again this is a nitpick from someone that loves all the little flavor text in stock ksp.\u003C/p\u003E\n"},{"CreatedByName":"Benjpalmer","CreatedById":94802,"CreatedDateTime":"2014-01-02T18:41:52Z","Content":"\n\u003Cp\u003EI keep getting a \u0022Windows cannot open this folder. The Compressed(Zipped) folder C:\\blah\\AckandersVerticalTechTreev1_12_18_b.zip is invalid\u0022 error when I try yo open the downloaded file.\u003C/p\u003E\n"},{"CreatedByName":"Ackander","CreatedById":90879,"CreatedDateTime":"2014-01-02T20:57:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Talisar\u0022 data-cite=\u0022Talisar\u0022\u003E\u003Cdiv\u003EThis makes me wonder something too... I\u0027m operating on the assumption that squad will be slowly but regularly adding biomes to more planetary bodies with each update. If so, how will that affect overall costs on science trees?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI would think as the opportunities increase, the cost should go up. But as far as I know, the stock tree is still the same as in 0.22. In my tree.cfg generator, I can adjust total science cost to be a certain percentage of total possible science gainable. So it will detect what mods add science to the total and adjust the tree accordingly. Hopefully, I can get the next update out by tomorrow, so everyone can start giving feedback on the new thing I am adding.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022barcharcraz\u0022 data-cite=\u0022barcharcraz\u0022\u003E\u003Cdiv\u003EGreat! thanks for taking my nitpick into mind. A list of problems I have noticed so far follows\u003Cp\u003E1. Strange wording in \u0022General Spaceframes and Structures\u0022. \u0022... to combine more parts into and ways to hold them together\u0022\u003C/p\u003E\u003Cp\u003E2. \u0022Compound Rocketry\u0022 develope does not have an e on the end\u003C/p\u003E\u003Cp\u003E3. \u0022Compound Rocketry\u0022 the last sentence is strange \u0022and maybe some help tools with the right installations\u0022\u003C/p\u003E\u003Cp\u003E4. \u0022General Solid Booster Motors\u0022 \u0022as solid boosters become a secondary technology to them\u0022. I would remove \u0022to them\u0022\u003C/p\u003E\u003Cp\u003E5. \u0022Hypergolic Thruster systems\u0022 \u0022spontaneous combustible\u0022 should probably be \u0022spontaneously combustible\u0022\u003C/p\u003E\u003Cp\u003E6. \u0022Basic aerodynamics\u0022 \u0022developement\u0022 should be \u0022development\u0022\u003C/p\u003E\u003Cp\u003EI am not that far up in the tree yet so there may be more issues. Again this is a nitpick from someone that loves all the little flavor text in stock ksp.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf I may, I would like to blame lack of sleep and other general distractions for these kinds of mistakes. I will work on this soon. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Benjpalmer\u0022 data-cite=\u0022Benjpalmer\u0022\u003E\u003Cdiv\u003EI keep getting a \u0022Windows cannot open this folder. The Compressed(Zipped) folder C:\\blah\\AckandersVerticalTechTreev1_12_18_b.zip is invalid\u0022 error when I try yo open the downloaded file.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI would redownload the file. I do not know what else would be wrong except an incomplete or corrupt download.\u003C/p\u003E\n"},{"CreatedByName":"Nelien","CreatedById":65665,"CreatedDateTime":"2014-01-03T00:20:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ackander\u0022 data-cite=\u0022Ackander\u0022\u003E\u003Cdiv\u003ECurrent poll results give a desired science cost range of 20,049 to 22,049. But the current cost of the tree is only 17,970. I think after the next cost overhaul, the prices for nodes should be more balanced. But it will involve work on the users part. I think I will distribute the excel sheet I made so users can adjust their science costs according to what mods they have installed. If anyone has a quick way of making a list of parts and their cost from their part.cfg files.. I could use it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERight, fair enough! I certainly don\u0027t mind a bit of tweaking when I download mods, I tend to do it anyway whether the mod creators intended it or not \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E. \u003C/p\u003E\u003Cp\u003EJust to give you a quick update on how I\u0027m fairing with your mod so far. I\u0027ve started using it with the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/43645-%28KSP-23%29-Mission-Controller-Extended-%28Updated-Jan-1-2014%29-%28BETA-41%29\u0022 rel=\u0022external nofollow\u0022\u003EMission Control Extended\u003C/a\u003E plugin and it\u0027s synergising extremely well. I had to create a couple of simple missions myself to help out at the start, since most missions require at least a simple rocket to be built. But once I had unlocked parachutes I could quickly get on with the regular MCE missions. In order to gather science quickly enough without running out of money however, I had to have more than one mission pack installed, since early missions often require science equipment and other parts that you simply don\u0027t have early enough with your tech tree. But since there are plenty of mission packs available, that wasn\u0027t a problem at all and I\u0027m seriously having a blast. It truly feels like KSP career mode as it should be.\u003C/p\u003E\u003Cp\u003EGood luck with the next update! Can\u0027t wait..\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-03T00:23:53Z\u0022 title=\u002201/03/2014 12:23  AM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 3, 2014\u003C/time\u003E by Nelien\u003C/strong\u003E\n\u003C/span\u003E\n"}]}