{"TopicId":57791,"ForumId":34,"TopicTitle":"[1.1.2] WernherChecker v0.4.1 - Customizable Editor Pre-Flight Checklist ; (May 18)","CreatedByName":"Magion","CreatedById":97022,"CreatedDateTime":"2013-12-26T17:10:25Z","PageNum":4,"Articles":[{"CreatedByName":"Arron Rift","CreatedById":113722,"CreatedDateTime":"2014-08-31T01:19:51Z","Content":"\n\u003Cp\u003EVery nice mod! I\u0027m sure this could help a lot of players when they are starting out!\u003C/p\u003E\u003Cp\u003EBtw, does the name looks too much like \u0022Wiener Checker\u0022 to anyone else? It keeps catching my eye even though I KNOW that\u0027s not what it says ;D\u003C/p\u003E\n"},{"CreatedByName":"Magion","CreatedById":97022,"CreatedDateTime":"2014-08-31T13:51:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TranceaddicT\u0022 data-cite=\u0022TranceaddicT\u0022\u003E\u003Cdiv\u003ENice mod, but I\u0027ve had to remove it because it does not play well with KCT.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA bug report of that type is kinda useless. I need to know under which circumstances the problem appeared and mainly what the problem is!! If there are any red lines in your debug log, then I\u0027ll need your output_log.txt\u003C/p\u003E\n"},{"CreatedByName":"TranceaddicT","CreatedById":73653,"CreatedDateTime":"2014-09-01T05:42:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Magion\u0022 data-cite=\u0022Magion\u0022\u003E\u003Cdiv\u003EA bug report of that type is kinda useless. I need to know under which circumstances the problem appeared and mainly what the problem is!! If there are any red lines in your debug log, then I\u0027ll need your output_log.txt\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EActually, Magion, this is my bad. This statement was not intended for your plugin. I apologize. (And, you are right; that kind of reporting is woefully insufficient. Fortunately, for the offending mod that was just the beginning sentence. Note-to-self: when reporting bugs DO NOT attempt to process multiple reports simultaneously. Focus, Padawan. Focus.)\u003C/p\u003E\u003Cp\u003EMy intention for you was to request you add an option allowing for WC to not be automatically displayed. Or,include a launchbutton hook that interrupts the scene change to generate a popup similar to what you already have.\u003C/p\u003E\u003Cp\u003ECurrently, WC is always on and it gets in the way of Squads action group settings as well as other mods. In this case, I\u0027d recommend a config.xml to provide placement persistence.\u003C/p\u003E\u003Cp\u003EAgain, my sincerest apologies for the misunderstanding. (Now, to find who it was that got your report.)\u003C/p\u003E\n"},{"CreatedByName":"Magion","CreatedById":97022,"CreatedDateTime":"2014-09-14T16:11:07Z","Content":"\n\u003Cp\u003EThanks for understanding. I really appreciate it!\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TranceaddicT\u0022 data-cite=\u0022TranceaddicT\u0022\u003E\u003Cdiv\u003EOr,include a launchbutton hook that interrupts the scene change to generate a popup similar to what you already have.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDo you mean showing the checklist just before the launch? The only problem with this is, that the \u0022\u003Cem\u003Echeck just the selected parts\u003C/em\u003E\u0022 feature would be unavailable then.\u003C/p\u003E\u003Cp\u003EAlso, excuse me for being not very active now. The transition from the holiday mode to the school mode was pretty rapid.\u003C/p\u003E\n"},{"CreatedByName":"PlaneOtron K","CreatedById":123859,"CreatedDateTime":"2014-09-29T18:25:50Z","Content":"\n\u003Cp\u003Efirst off: thanks. a very handy mod. \u003C/p\u003E\u003Cp\u003EI do have some small suggestions, even though I didnt read through the whole Thread. Shame on my if I repeat things.\u003C/p\u003E\u003Cp\u003ESince I use B9 Aerospace and NEAR some parts have different modules, making for some rather empty checklists. I have also merged the rocket and Plane Lists for Spaceplanes, since I havent been building anytihing BUT SSTO Planes in KSP \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EFor Controlsurfaces I added \u0022FARControllableSurface\u0022 and for landing Gears \u0022FSwheel\u0022. Im sure there are a million other Definitions to be had. Ill add them if / when I come across them.\u003C/p\u003E\u003Cp\u003ENow for Features i would suggest the already discussed (optional) List check before Launch. Also the Crew Assignment checker might stay Put the second time I press Launch IF I havent moved from the crew assignment page. (I probably havent forgotten if I already closed the Popup and havent navigated to another editor). \u003C/p\u003E\u003Cp\u003EIm havent looked into how saves and Mods play together or how other mods do persistence, but it would also be cool if the checklist type stuck with the vehicle when saving / loading.\u003C/p\u003E\u003Cp\u003EAlso a long time from now in a release far far away you might split Lists into \u0022Item definitions\u0022 and \u0022List compilations\u0022. This would probably only help when you have a larger number of checklists since it would deduplicate the config file.\u003C/p\u003E\u003Cp\u003EIf you would prefer an Issue on GitHub let me know. I felt like killing two birds with one (Forum Post shaped) Stone.\u003C/p\u003E\n"},{"CreatedByName":"hab136","CreatedById":75997,"CreatedDateTime":"2014-10-04T16:06:25Z","Content":"\n\u003Cp\u003EHere\u0027s definitions for RealChute and RemoteTech2 support, plus lights and RCS. Feel free to integrate into the default list.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003E\tCHECKLIST_ITEM\u003Cbr\u003E\t{\u003Cbr\u003E\t\tname = Parachutes\u003Cbr\u003E\t\tmodules = ModuleParachute,RealChuteModule\u003Cbr\u003E\t}\u003Cbr\u003E\u003Cbr\u003E\tCHECKLIST_ITEM\u003Cbr\u003E\t{\u003Cbr\u003E\t\tname = Communication\u003Cbr\u003E\t\tmodules = ModuleDataTransmitter,ModuleRTAntenna\u003Cbr\u003E\t}\u003Cbr\u003E\u003Cbr\u003E\tCHECKLIST_ITEM\u003Cbr\u003E\t{\u003Cbr\u003E\t\tname = Lights\u003Cbr\u003E\t\tmodules = ModuleLight\u003Cbr\u003E\t}\u003Cbr\u003E\u003Cbr\u003E\tCHECKLIST_ITEM\u003Cbr\u003E\t{\u003Cbr\u003E\t\tname = RCS thrusters\u003Cbr\u003E\t\tmodules = ModuleRCS\u003Cbr\u003E\t}\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"Magion","CreatedById":97022,"CreatedDateTime":"2014-10-08T16:09:37Z","Content":"\n\u003Cp\u003EIt seems that WernherChecker works fine with KSP .25, so you can download it without fear. If you are experiencing some issues, let me know, so I can fix it ASAP.\u003C/p\u003E\u003Cp\u003ERecompile for 0.25 with some minor improvements will hopefully come before end of the week.\u003C/p\u003E\u003Cp\u003EAlso, thanks \u003Cem\u003EPlaneOtron K\u003C/em\u003E for \u003Cstrong\u003Every usefull\u003C/strong\u003E feedback! I\u0027m adding some more PartModule definitions to the following update.\u003C/p\u003E\n"},{"CreatedByName":"Magion","CreatedById":97022,"CreatedDateTime":"2014-10-13T15:53:52Z","Content":"\n\u003Cp\u003EWernherChecker v0.3.1 is up!\u003C/p\u003E\u003Cp\u003ENothing really big has changed in this update. There are just some minor improvements as usual and I also added some non-stock PartModule definitions as many of you requested.\u003C/p\u003E\u003Cp\u003EFull changelog:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003E* KSP 0.25 support\u003Cbr\u003E* Added button to reload the config file\u003Cbr\u003E* Main window automaticly hides, when switched to the Action Groups or Crew Assignment panel\u003Cbr\u003E* Editor locks, when the CrewCheck window is displayed\u003Cbr\u003E* Minor visual changes\u003Cbr\u003E* Added some new PartModule definitions\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EEnjoy!\u003C/p\u003E\n"},{"CreatedByName":"Kerbas_ad_astra","CreatedById":126593,"CreatedDateTime":"2014-11-21T22:23:34Z","Content":"\n\u003Cp\u003EFor those looking to use this mod with \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/56440\u0022 rel=\u0022external nofollow\u0022\u003EAntennaRange\u003C/a\u003E, that mod replaces each antenna\u0027s ModuleDataTransmitter with a \u0022ModuleLimitedDataTransmitter\u0022, so you\u0027ll have to add that to the list of Communication modules.\u003C/p\u003E\u003Cp\u003EAlso, for the next version, it would be nice to have the checklist save its position so I don\u0027t have to keep dragging it out of the way of the parts menu. Thanks!\u003C/p\u003E\n"},{"CreatedByName":"visivante","CreatedById":116948,"CreatedDateTime":"2014-12-26T20:19:27Z","Content":"\n\u003Cp\u003EYou don\u0027t truly notice how helpful this little mod is until its missing again. \u003C/p\u003E\u003Cp\u003EI can\u0027t wait for this to be updated for 0.90! Thanks so much for such a helpful mod and happy holidays!\u003C/p\u003E\n"},{"CreatedByName":"Magion","CreatedById":97022,"CreatedDateTime":"2014-12-27T11:46:57Z","Content":"\n\u003Cp\u003EHi, \u003C/p\u003E\u003Cp\u003Ethanks for the nice words. I\u0027m glad that I finaly have a time to write here something. The Christmas madness was just CRAZY, so I HUGELY appologise for the lack of updates. The original targeted release date was on Friday. But on Friday the 19th! Stupid Christmas \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003Ev0.3.2 is completed a few days now, but I just didn\u0027t have a time for a release. With a little luck the update will be out today, but I don\u0027t promiss anything. If not, you\u0027ll have to wait at least until Wednesday \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003EDuring developement I spent a lot of time improving the launch button hook, which displays the CrewCheck dialog instead of launching the vessel.\u003C/p\u003E\u003Cp\u003ECurrently, there is just an area in the place of the launch button, which, if you mouseover over it, it disables the launch button and if you click while the mouse is in the area, it displays the CrewCheck window. It has one major problem. The tooltip of the button remains displayed, eventhought the mouse isn\u0027t over the button. In 0.90, the tooltips became a lot greater, so the more it\u0027s ugly. Additionaly, the disabled button doesn\u0027t look nicest either.\u003C/p\u003E\u003Cp\u003EOriginally, I was thinking just about manualy changing the visual state of the button, but that didn\u0027t work very well - the button set itself enabled, eventhought is was supposed to be disabled. Then, I tried to integrate it with the stock PreFlightChecks (that thing, which tells you, that the launchpad is destroyed and you have not enought money to launch the vessel), but it\u0027s probably instantiated inside the launchVessel() method, so I can\u0027t access it and add own pre-flight test. Creating my own instatnce worked, but it behaved really strangly. Then, I was browsing documentation for the EzGUI and I found two interesting methods - AddInputDelegate() and RemoveInputDelegate(). That was great, but I couldn\u0027t find the stock InputDelegate, so I could add custom InputDelegate, but I could\u0027t remove the stock one. After a few hours of searching, I didn\u0027t find the delegate, but I found another method, which I overlooked - SetInputDelegate(). That method overrides all delegates, so that was finaly the solution. How could I miss that?!?\u003C/p\u003E\u003Cp\u003ESo much for my developer adventures. I hope it wasn\u0027t boring \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlso, yesterday was the WernherChecker\u0027s birthday. Whole one year. Happy Birthday!\u003C/p\u003E\u003Cp\u003EHappy Holidays!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-27T11:52:34Z\u0022 title=\u002212/27/2014 11:52  AM\u0022 data-short=\u00229 yr\u0022\u003EDecember 27, 2014\u003C/time\u003E by Magion\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Magion","CreatedById":97022,"CreatedDateTime":"2014-12-27T19:36:31Z","Content":"\n\u003Cp\u003EI made it today! Download v0.3.2 from \u003Ca href=\u0022https://kerbalstuff.com/mod/91/WernherChecker\u0022 rel=\u0022external nofollow\u0022\u003EKerbal Stuff\u003C/a\u003E, \u003Ca href=\u0022http://kerbal.curseforge.com/ksp-mods/223050-wernherchecker-v0-2\u0022 rel=\u0022external nofollow\u0022\u003ECurseForge\u003C/a\u003E or \u003Ca href=\u0022https://github.com/Magion/WernherChecker/releases\u0022 rel=\u0022external nofollow\u0022\u003EGitHub\u003C/a\u003E right now! YEY!\u003C/p\u003E\u003Cp\u003EWhat\u0027s changed?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E* \u003C/span\u003E\u003C/strong\u003E\u003Cspan style=\u0022color:#33aa00;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EKSP 0.90 support\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E* \u003C/strong\u003E\u003Cspan style=\u0022color:#33aa00;\u0022\u003E\u003Cstrong\u003EAdded saving of the window\u0027s position\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E* Improved launch button hook for the crew-checking feature\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E* Default AntennaRange support\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EHappy Holidays!\u003C/p\u003E\n"},{"CreatedByName":"Yaivenov","CreatedById":81754,"CreatedDateTime":"2014-12-28T00:28:15Z","Content":"\n\u003Cp\u003EI think I would have named it the GuenterChecker. I wonder where \u003Ca href=\u0022https://en.wikipedia.org/wiki/Guenter_Wendt\u0022 rel=\u0022external nofollow\u0022\u003EGuenter Wendt?\u003C/a\u003E \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"lyndonguitar","CreatedById":61194,"CreatedDateTime":"2014-12-29T06:58:14Z","Content":"\n\u003Cp\u003EI seem to be having this bug, Every load of a craft, the werner icon on the toolbar(stock) uncontrollably duplicates until I can\u0027t click anything anymore(but the game doesn\u0027t crash)\u003C/p\u003E\u003Cp\u003EAlso, it seems to be conflicting with Kerbal Construction Time on the Launch button on the editor. I\u0027ve uninstalled the mod as of now. I can\u0027t properly troubleshoot what exactly causes the problem above (I have other mods) but it only does this when I have this mod.\u003C/p\u003E\u003Cp\u003EJust putting it out here in case others experience the same.\u003C/p\u003E\n"},{"CreatedByName":"Albert VDS","CreatedById":74055,"CreatedDateTime":"2014-12-29T09:09:03Z","Content":"\n\u003Cp\u003EThis isn\u0027t good, I tried the new update and everything messed up and lost all the crafts in the save file.\u003C/p\u003E\u003Cp\u003EI had the same duplicate appbar bug, I launched a craft and Kerbin disappeared. When I restarted KSP all the crafts were gone.\u003C/p\u003E\n"},{"CreatedByName":"visivante","CreatedById":116948,"CreatedDateTime":"2014-12-30T20:44:38Z","Content":"\n\u003Cp\u003EI\u0027m running into the same bugs as Albert VDS and lyndonguitar.\u003C/p\u003E\n"},{"CreatedByName":"Errol","CreatedById":118622,"CreatedDateTime":"2014-12-30T21:22:03Z","Content":"\n\u003Cp\u003EDoes this mod account for the electrical charge drained by kerbals with TAC-LS?\u003C/p\u003E\n"},{"CreatedByName":"Kerbas_ad_astra","CreatedById":126593,"CreatedDateTime":"2014-12-31T03:17:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Errol\u0022 data-cite=\u0022Errol\u0022\u003E\u003Cdiv\u003EDoes this mod account for the electrical charge drained by kerbals with TAC-LS?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis mod doesn\u0027t track whether or not you\u0027re getting enough electric charge, only that the spacecraft has some source of it. You might be thinking of \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/50077\u0022 rel=\u0022external nofollow\u0022\u003EFuseBox\u003C/a\u003E, which did account for TAC-LS, but not in the 0.90 version because TAC-LS doesn\u0027t yet support 0.90 (TaranisElsu has provided a simple recompile, which people say is working, but he hasn\u0027t had the time to make a thorough check to get all functionality up-to-date).\u003C/p\u003E\u003Cp\u003EAlso, I can confirm the amazing multiplying toolbar button bug (edit: which I see is a known issue). Only one of them actually brings up the checklist (which I\u0027m very happy to see does remember its position and does support AntennaRange, so hooray for that!).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-31T03:19:59Z\u0022 title=\u002212/31/2014 03:19  AM\u0022 data-short=\u00229 yr\u0022\u003EDecember 31, 2014\u003C/time\u003E by Kerbas_ad_astra\u003C/strong\u003E\n\u003Cbr\u003EMentioned a mod but forgot to link to it.\n\u003C/span\u003E\n"},{"CreatedByName":"Magion","CreatedById":97022,"CreatedDateTime":"2014-12-31T14:04:26Z","Content":"\n\u003Cp\u003EI\u0027m really sorry for the duplication bug. The part of the code, which destroys the toolbar button was subscribed to the wrong GameEvent, so only two lines of the code had to be changed. Now I\u0027m figuring a solution to the KCT compatibility issue. When I\u0027m thinking about it, in .90 crew assignment is finally persistent, so the crew-checking feature might be useless. What\u0027s your opinion? For those, who don\u0027t wanna wait for the fix, you can switch to blizzy78\u0027s toolbar and disable crew checking in the .cfg\u003C/p\u003E\n"},{"CreatedByName":"Kerbas_ad_astra","CreatedById":126593,"CreatedDateTime":"2014-12-31T15:18:56Z","Content":"\n\u003Cp\u003EOn the other hand, crew experience means that it can be important to check crews to make sure that all astronauts get their turn. I haven\u0027t gotten enough astronauts to where this is an issue, so I don\u0027t know whether I want that feature or not. Maybe just tweak the default config so it\u0027s turned off?\u003C/p\u003E\n"},{"CreatedByName":"visivante","CreatedById":116948,"CreatedDateTime":"2014-12-31T17:48:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Magion\u0022 data-cite=\u0022Magion\u0022\u003E\u003Cdiv\u003EI\u0027m really sorry for the duplication bug. The part of the code, which destroys the toolbar button was subscribed to the wrong GameEvent, so only two lines of the code had to be changed. Now I\u0027m figuring a solution to the KCT compatibility issue. When I\u0027m thinking about it, in .90 crew assignment is finally persistent, so the crew-checking feature might be useless. What\u0027s your opinion? For those, who don\u0027t wanna wait for the fix, you can switch to blizzy78\u0027s toolbar and disable crew checking in the .cfg\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEven with the new crew-saving feature I\u0027ve found myself really, really missing WernherChecker. So please have it still ask about crew lineup, or at least have that feature be toggle-able! Thanks so much for your continued efforts!\u003C/p\u003E\n"},{"CreatedByName":"Magion","CreatedById":97022,"CreatedDateTime":"2014-12-31T20:39:02Z","Content":"\n\u003Cp\u003EFix is now available for download at \u003Ca href=\u0022https://kerbalstuff.com/mod/91/WernherChecker\u0022 rel=\u0022external nofollow\u0022\u003EKerbal Stuff\u003C/a\u003E, \u003Ca href=\u0022http://kerbal.curseforge.com/ksp-mods/223050-wernherchecker-v0-2\u0022 rel=\u0022external nofollow\u0022\u003ECurseForge\u003C/a\u003E or \u003Ca href=\u0022https://github.com/Magion/WernherChecker/releases\u0022 rel=\u0022external nofollow\u0022\u003EGitHub\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003ERegarding KCT compatibility, I just disabled the crew checking when KCT is installed, because you assign the crew outside the editor, so it\u0027s useless.\u003C/p\u003E\u003Cp\u003EFull changelog:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E* Fixed the stock toolbar button duplication issue\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E* KCT compatibility\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EI hope there\u0027re not gonna be more issues today.\u003C/p\u003E\u003Cp\u003EEnjoy and Happy New Year.\u003C/p\u003E\n"},{"CreatedByName":"linuxgurugamer","CreatedById":129964,"CreatedDateTime":"2014-12-31T23:22:26Z","Content":"\n\u003Cp\u003ESorry to say, there is a major bug I came across:\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EI\u0027m having a strange issue. I have a modded install, with about 60 different mods (see below). I traced this problem to this mod:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003ETotal memory usage after initial startup is about 2.6 gig.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EI have my first space station, right now consisting of a zoology lab and a science lab docked together. This is in the save file.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EI tried setting up a new mission, and things went screwy, so I restored from a backup and so far have isolated the problem to the following:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003E1. I reduced the new ship to a Stayputnik and an SRB, nothing else.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003E2. I go to the launch pad\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EThe game will briefly show the ship on the launch pad, and then after 2-5 seconds, the screen goes blank. The normal toolbar is showing at the top right, and when I hit the escape key, the menu shows up in the center of the screen. However, it is unresponsive.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EThe really annoying thing is that the game saves a new save file, but my space station is deleted. I can restart the game, but the station is gone. The size of the save file is about 200k, while the size of the file with the space station is over 300k\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EIf I replace the Stayputnik with a manned pod, it seems to work.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EWhen I remove this mod, it works.\u003C/p\u003E\u003Cp\u003EFYI, I downloaded the latest version just now before posting (0.3.3)\u003C/p\u003E\u003Cp\u003EMod list (with WernherChecker removed):\u003C/p\u003E\u003Cp\u003EFollowing installed by CKAN:\u003C/p\u003E\u003Cp\u003EKSP Version: 0.90.0\u003C/p\u003E\u003Cp\u003EInstalled Modules:\u003C/p\u003E\u003Cp\u003E- ActiveTextureManagement-Aggressive A1.0_x86\u003C/p\u003E\u003Cp\u003E- AmbientLightAdjustment 1.3.1.1\u003C/p\u003E\u003Cp\u003E- AnchoredDecouplerFix autodetected dll\u003C/p\u003E\u003Cp\u003E- BackgroundProcessing 0.3.5\u003C/p\u003E\u003Cp\u003E- Chatterer 0.8.0\u003C/p\u003E\u003Cp\u003E- ChuteQuickloadFixer autodetected dll\u003C/p\u003E\u003Cp\u003E- CIT-Util 1.1.1-unofficial\u003C/p\u003E\u003Cp\u003E - CoherentContracts 1.02\u003C/p\u003E\u003Cp\u003E- CommunityResourcePack 0.3.2\u003C/p\u003E\u003Cp\u003E- CrewRosterFreezeFix autodetected dll\u003C/p\u003E\u003Cp\u003E- DeadlyReentry v6.4.0\u003C/p\u003E\u003Cp\u003E- DistantObject v1.5.1\u003C/p\u003E\u003Cp\u003E- DistantObject-default v1.5.1\u003C/p\u003E\u003Cp\u003E- EnhancedNavBall 1.3.4\u003C/p\u003E\u003Cp\u003E- EVAEjectionFix autodetected dll\u003C/p\u003E\u003Cp\u003E- FerramAerospaceResearch v0.14.6\u003C/p\u003E\u003Cp\u003E- FinalFrontier 0.6.1-604\u003C/p\u003E\u003Cp\u003E- FirespitterCore 7.0.5463.30802\u003C/p\u003E\u003Cp\u003E- FreedomTex 1.4\u003C/p\u003E\u003Cp\u003E- GovFunding autodetected dll\u003C/p\u003E\u003Cp\u003E- HyperEdit 1.3\u003C/p\u003E\u003Cp\u003E- InFlightWaypoints 1.2.5\u003C/p\u003E\u003Cp\u003E- KerbalAlarmClock v3.1.1.0\u003C/p\u003E\u003Cp\u003E- KerbalDebrisFix autodetected dll\u003C/p\u003E\u003Cp\u003E- KerbalEngineerRedux 1.0.14.1\u003C/p\u003E\u003Cp\u003E- KerbalJointReinforcement v3.0.1\u003C/p\u003E\u003Cp\u003E- KSP-AVC autodetected dll\u003C/p\u003E\u003Cp\u003E- LandingHeight 1.2\u003C/p\u003E\u003Cp\u003E- LoadOnDemand autodetected dll\u003C/p\u003E\u003Cp\u003E- MechJeb2 2.4.2\u003C/p\u003E\u003Cp\u003E- ModularRocketSystem 1.4.4\u003C/p\u003E\u003Cp\u003E- ModuleManager 2.5.6\u003C/p\u003E\u003Cp\u003E- NearFutureSolar 0.4.0\u003C/p\u003E\u003Cp\u003E- NovaPunch 2.08\u003C/p\u003E\u003Cp\u003E- OrbitalMaterialScience 0.3.90\u003C/p\u003E\u003Cp\u003E- PlanetShine 0.2.2.1\u003C/p\u003E\u003Cp\u003E- ProceduralParts v0.9.21\u003C/p\u003E\u003Cp\u003E- RCSBuildAid 0.5.4\u003C/p\u003E\u003Cp\u003E- RCSLandAid 2.1a\u003C/p\u003E\u003Cp\u003E- RealChute 1.2.6.3\u003C/p\u003E\u003Cp\u003E- RealRoster v2.1\u003C/p\u003E\u003Cp\u003E- Regolith 0.1.2\u003C/p\u003E\u003Cp\u003E- RLA-Stockalike 12.1\u003C/p\u003E\u003Cp\u003E- S autodetected dll\u003C/p\u003E\u003Cp\u003E- SafeChute 1.6\u003C/p\u003E\u003Cp\u003E- SCANsat 8.1\u003C/p\u003E\u003Cp\u003E- ScienceAlert 1.8rc2\u003C/p\u003E\u003Cp\u003E- Service-Compartments-6S 1.2\u003C/p\u003E\u003Cp\u003E- SmartStage v2.4.0\u003C/p\u003E\u003Cp\u003E- SpaceY-Lifters 0.7\u003C/p\u003E\u003Cp\u003E- StageRecovery 1.5.3\u003C/p\u003E\u003Cp\u003E- StationScience 1.4\u003C/p\u003E\u003Cp\u003E- StickyLaunchPadFix autodetected dll\u003C/p\u003E\u003Cp\u003E- TextureReplacer 2.1.2\u003C/p\u003E\u003Cp\u003E- ToadicusTools autodetected dll\u003C/p\u003E\u003Cp\u003E- Toolbar 1.7.8\u003C/p\u003E\u003Cp\u003E- Trajectories 1.1.2\u003C/p\u003E\u003Cp\u003E- TWR1 1.16a\u003C/p\u003E\u003Cp\u003E- UKS 0.22.3\u003C/p\u003E\u003Cp\u003E- USITools 0.3.1\u003C/p\u003E\u003Cp\u003E- VOID 0.16.4\u003C/p\u003E\u003Cp\u003E- WernherChecker autodetected dll\u003C/p\u003E\u003Cp\u003E- ZeroPointInlineFairings 0.9.1\u003C/p\u003E\u003Cp\u003ELegend: -: Up to date. X: Incompatible. ^: Upgradable. ?: Unknown\u003C/p\u003E\u003Cp\u003EFollowing installed by hand:\u003C/p\u003E\u003Cp\u003EGov Funding\u003C/p\u003E\u003Cp\u003EKSP-AVC\u003C/p\u003E\u003Cp\u003ESCART91 TexturePack \u003C/p\u003E\u003Cp\u003EScienceAlert \u003C/p\u003E\u003Cp\u003EStock Bug Fix\u003C/p\u003E\u003Cp\u003ES.A.V.E\u003C/p\u003E\u003Cp\u003EModified IVA\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-31T23:27:11Z\u0022 title=\u002212/31/2014 11:27  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 31, 2014\u003C/time\u003E by linuxgurugamer\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Magion","CreatedById":97022,"CreatedDateTime":"2015-01-05T19:04:24Z","Content":"\n\u003Cp\u003EDownload v0.3.4 from \u003Ca href=\u0022https://kerbalstuff.com/mod/91/WernherChecker\u0022 rel=\u0022external nofollow\u0022\u003EKerbal Stuff\u003C/a\u003E, \u003Ca href=\u0022http://kerbal.curseforge.com/ksp-mods/223050-wernherchecker-v0-2\u0022 rel=\u0022external nofollow\u0022\u003ECurseForge\u003C/a\u003E or \u003Ca href=\u0022https://github.com/Magion/WernherChecker/releases\u0022 rel=\u0022external nofollow\u0022\u003EGitHub\u003C/a\u003E right now!!\u003C/p\u003E\u003Cp\u003EIt fixes the issue described above. I also added basic in-game settings and rewritten the crew-assignment-checking feature to make it use the stock PreFlightCheck class.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cstrong\u003E* \u003C/strong\u003E\u003C/span\u003E\u003Cspan style=\u0022color:#33aa00;\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cstrong\u003EAdded in-game settings\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E* Fixed an issue causing the game to go crazy after launching an unmanned ship\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E* Crew-assignment-checking feature rewritten\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EEnjoy!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-05T19:08:13Z\u0022 title=\u002201/05/2015 07:08  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 5, 2015\u003C/time\u003E by Magion\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"visivante","CreatedById":116948,"CreatedDateTime":"2015-01-05T19:07:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022linuxgurugamer\u0022 data-cite=\u0022linuxgurugamer\u0022\u003E\u003Cdiv\u003ESorry to say, there is a major bug I came across:\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EI\u0027m having a strange issue. I have a modded install, with about 60 different mods (see below). I traced this problem to this mod:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003ETotal memory usage after initial startup is about 2.6 gig.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EI have my first space station, right now consisting of a zoology lab and a science lab docked together. This is in the save file.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EI tried setting up a new mission, and things went screwy, so I restored from a backup and so far have isolated the problem to the following:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003E1. I reduced the new ship to a Stayputnik and an SRB, nothing else.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003E2. I go to the launch pad\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EThe game will briefly show the ship on the launch pad, and then after 2-5 seconds, the screen goes blank. The normal toolbar is showing at the top right, and when I hit the escape key, the menu shows up in the center of the screen. However, it is unresponsive.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EThe really annoying thing is that the game saves a new save file, but my space station is deleted. I can restart the game, but the station is gone. The size of the save file is about 200k, while the size of the file with the space station is over 300k\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EIf I replace the Stayputnik with a manned pod, it seems to work.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EWhen I remove this mod, it works.\u003C/p\u003E\u003Cp\u003EFYI, I downloaded the latest version just now before posting (0.3.3)\u003C/p\u003E\u003Cp\u003EMod list (with WernherChecker removed):\u003C/p\u003E\u003Cp\u003EFollowing installed by CKAN:\u003C/p\u003E\u003Cp\u003EKSP Version: 0.90.0\u003C/p\u003E\u003Cp\u003EInstalled Modules:\u003C/p\u003E\u003Cp\u003E- ActiveTextureManagement-Aggressive A1.0_x86\u003C/p\u003E\u003Cp\u003E- AmbientLightAdjustment 1.3.1.1\u003C/p\u003E\u003Cp\u003E- AnchoredDecouplerFix autodetected dll\u003C/p\u003E\u003Cp\u003E- BackgroundProcessing 0.3.5\u003C/p\u003E\u003Cp\u003E- Chatterer 0.8.0\u003C/p\u003E\u003Cp\u003E- ChuteQuickloadFixer autodetected dll\u003C/p\u003E\u003Cp\u003E- CIT-Util 1.1.1-unofficial\u003C/p\u003E\u003Cp\u003E - CoherentContracts 1.02\u003C/p\u003E\u003Cp\u003E- CommunityResourcePack 0.3.2\u003C/p\u003E\u003Cp\u003E- CrewRosterFreezeFix autodetected dll\u003C/p\u003E\u003Cp\u003E- DeadlyReentry v6.4.0\u003C/p\u003E\u003Cp\u003E- DistantObject v1.5.1\u003C/p\u003E\u003Cp\u003E- DistantObject-default v1.5.1\u003C/p\u003E\u003Cp\u003E- EnhancedNavBall 1.3.4\u003C/p\u003E\u003Cp\u003E- EVAEjectionFix autodetected dll\u003C/p\u003E\u003Cp\u003E- FerramAerospaceResearch v0.14.6\u003C/p\u003E\u003Cp\u003E- FinalFrontier 0.6.1-604\u003C/p\u003E\u003Cp\u003E- FirespitterCore 7.0.5463.30802\u003C/p\u003E\u003Cp\u003E- FreedomTex 1.4\u003C/p\u003E\u003Cp\u003E- GovFunding autodetected dll\u003C/p\u003E\u003Cp\u003E- HyperEdit 1.3\u003C/p\u003E\u003Cp\u003E- InFlightWaypoints 1.2.5\u003C/p\u003E\u003Cp\u003E- KerbalAlarmClock v3.1.1.0\u003C/p\u003E\u003Cp\u003E- KerbalDebrisFix autodetected dll\u003C/p\u003E\u003Cp\u003E- KerbalEngineerRedux 1.0.14.1\u003C/p\u003E\u003Cp\u003E- KerbalJointReinforcement v3.0.1\u003C/p\u003E\u003Cp\u003E- KSP-AVC autodetected dll\u003C/p\u003E\u003Cp\u003E- LandingHeight 1.2\u003C/p\u003E\u003Cp\u003E- LoadOnDemand autodetected dll\u003C/p\u003E\u003Cp\u003E- MechJeb2 2.4.2\u003C/p\u003E\u003Cp\u003E- ModularRocketSystem 1.4.4\u003C/p\u003E\u003Cp\u003E- ModuleManager 2.5.6\u003C/p\u003E\u003Cp\u003E- NearFutureSolar 0.4.0\u003C/p\u003E\u003Cp\u003E- NovaPunch 2.08\u003C/p\u003E\u003Cp\u003E- OrbitalMaterialScience 0.3.90\u003C/p\u003E\u003Cp\u003E- PlanetShine 0.2.2.1\u003C/p\u003E\u003Cp\u003E- ProceduralParts v0.9.21\u003C/p\u003E\u003Cp\u003E- RCSBuildAid 0.5.4\u003C/p\u003E\u003Cp\u003E- RCSLandAid 2.1a\u003C/p\u003E\u003Cp\u003E- RealChute 1.2.6.3\u003C/p\u003E\u003Cp\u003E- RealRoster v2.1\u003C/p\u003E\u003Cp\u003E- Regolith 0.1.2\u003C/p\u003E\u003Cp\u003E- RLA-Stockalike 12.1\u003C/p\u003E\u003Cp\u003E- S autodetected dll\u003C/p\u003E\u003Cp\u003E- SafeChute 1.6\u003C/p\u003E\u003Cp\u003E- SCANsat 8.1\u003C/p\u003E\u003Cp\u003E- ScienceAlert 1.8rc2\u003C/p\u003E\u003Cp\u003E- Service-Compartments-6S 1.2\u003C/p\u003E\u003Cp\u003E- SmartStage v2.4.0\u003C/p\u003E\u003Cp\u003E- SpaceY-Lifters 0.7\u003C/p\u003E\u003Cp\u003E- StageRecovery 1.5.3\u003C/p\u003E\u003Cp\u003E- StationScience 1.4\u003C/p\u003E\u003Cp\u003E- StickyLaunchPadFix autodetected dll\u003C/p\u003E\u003Cp\u003E- TextureReplacer 2.1.2\u003C/p\u003E\u003Cp\u003E- ToadicusTools autodetected dll\u003C/p\u003E\u003Cp\u003E- Toolbar 1.7.8\u003C/p\u003E\u003Cp\u003E- Trajectories 1.1.2\u003C/p\u003E\u003Cp\u003E- TWR1 1.16a\u003C/p\u003E\u003Cp\u003E- UKS 0.22.3\u003C/p\u003E\u003Cp\u003E- USITools 0.3.1\u003C/p\u003E\u003Cp\u003E- VOID 0.16.4\u003C/p\u003E\u003Cp\u003E- WernherChecker autodetected dll\u003C/p\u003E\u003Cp\u003E- ZeroPointInlineFairings 0.9.1\u003C/p\u003E\u003Cp\u003ELegend: -: Up to date. X: Incompatible. ^: Upgradable. ?: Unknown\u003C/p\u003E\u003Cp\u003EFollowing installed by hand:\u003C/p\u003E\u003Cp\u003EGov Funding\u003C/p\u003E\u003Cp\u003EKSP-AVC\u003C/p\u003E\u003Cp\u003ESCART91 TexturePack \u003C/p\u003E\u003Cp\u003EScienceAlert \u003C/p\u003E\u003Cp\u003EStock Bug Fix\u003C/p\u003E\u003Cp\u003ES.A.V.E\u003C/p\u003E\u003Cp\u003EModified IVA\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m running into a similar problem with any launch vehicle using unmanned probes. Manned flights will work fine, but upon trying to Launch an unmanned vehicle from the VAB I run into a similar problem.\u003C/p\u003E\u003Cp\u003EFor the first few seconds everything seems and looks fine, then the ground and ship disappear leaving only the skybox visible. The game appears to freeze here for a moment. But, shortly afterwards the normal image is restored, unfortunately at the same time as the audio to freezes and all menu buttons become unresponsive.\u003C/p\u003E\u003Cp\u003EI\u0027m running quite a few mods as well, but I\u0027ve isolated the problem to WernherChecker. And it only happens with unmanned probe controlled vehicles. Manned vehicles work. Quite strange!\u003C/p\u003E\u003Cp\u003ELove this mod to death, hope there\u0027s a simple fix for this very wonky bug! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}