{"TopicId":61827,"ForumId":34,"TopicTitle":"[1.3] kOS Scriptable Autopilot System v1.1.3.0","CreatedByName":"erendrake","CreatedById":57164,"CreatedDateTime":"2014-02-01T16:40:58Z","PageNum":50,"Articles":[{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-07-30T22:16:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022erendrake\u0022 data-cite=\u0022erendrake\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ENo, where are you running into nulls?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETigermisu was talking about undefined variables, which is slightly different from a variable which is defined and who\u0027s value is null.\u003C/p\u003E\u003Cp\u003EFor example this code works:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003Eset x to 7.\u003Cbr\u003Eprint \u0022value is \u0022 \u002B x.\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EBut remove the \u0027set x\u0027 line and it errors out:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003E// set x to 7.\u003Cbr\u003Eprint \u0022value is \u0022 \u002B x.\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThe question was whether there was some way to do a thing like this:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003Eif isdefined(x) { print \u0022value is \u0022 \u002Bx. } else { print \u0022x doesn\u0027t exist yet\u0022. }.\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"erendrake","CreatedById":57164,"CreatedDateTime":"2014-07-30T23:47:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tigermisu\u0022 data-cite=\u0022Tigermisu\u0022\u003E\u003Cdiv\u003E1.- How are the parameters passed/called?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E RUN program(p1,p2). \u003C/p\u003E\u003Cp\u003Epasses arguments to the running script. \u003C/p\u003E\u003Cp\u003E DECLARE PARAMETER bar, foo.\u003C/p\u003E\u003Cp\u003Eat the top of the invoked script to assign p1 to bar and p2 to foo. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tigermisu\u0022 data-cite=\u0022Tigermisu\u0022\u003E\u003Cdiv\u003E2.- It was just that one of my scripts needed a variable from a previous one, but I wanted to to ignore the call if the variable wasn\u0027t defined (Previous script wasn\u0027t run) and assign a rudimentary value.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eyeah, that is annoying. We dont have any tools for accessing the state of variables that might be undefined or null. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tigermisu\u0022 data-cite=\u0022Tigermisu\u0022\u003E\u003Cdiv\u003E3.- Hmm, would that work for engines that are yet-to-be-activated-in-a-future-stage?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESoon I hope to have the stage available for each part. Until then i am not sure you could get the ISP for the engines in an arbitrary future stage.\u003C/p\u003E\n"},{"CreatedByName":"Drew Kerman","CreatedById":103177,"CreatedDateTime":"2014-07-31T02:40:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022erendrake\u0022 data-cite=\u0022erendrake\u0022\u003E\u003Cdiv\u003ERUN program(p1,p2). \u003Cp\u003Epasses arguments to the running script. \u003C/p\u003E\u003Cp\u003E DECLARE PARAMETER bar, foo.\u003C/p\u003E\u003Cp\u003Eat the top of the invoked script to assign p1 to bar and p2 to foo. \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWoah what? Really? How out of date are \u003Ca href=\u0022http://ksp-kos.github.io/KOS_DOC/\u0022 rel=\u0022external nofollow\u0022\u003Ethe docs\u003C/a\u003E? I realize documentation is a hard thing to keep up to date :/ This should at least be mentioned in the section on RUN though. Also, I still don\u0027t know how to use the added ability to get/set the warp mode. I\u0027m looking to warp to 2x physics and can\u0027t always rely on the craft moving fast enough to automatically jump into physics warp by just calling \u003Cspan style=\u0022font-family:\u0027courier new\u0027;\u0022\u003Eset warp to 2.\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-07-31T04:00:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Gaiiden\u0022 data-cite=\u0022Gaiiden\u0022\u003E\u003Cdiv\u003EWoah what? Really? How out of date are \u003Ca href=\u0022http://ksp-kos.github.io/KOS_DOC/\u0022 rel=\u0022external nofollow\u0022\u003Ethe docs\u003C/a\u003E?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI had no idea it was that badly documented before I got my hands on it. The parameters aren\u0027t mentioned at all. I\u0027ll add it to the TODO list. It\u0027s not due to being out of date. It\u0027s just not well documented.\u003C/p\u003E\n"},{"CreatedByName":"Drew Kerman","CreatedById":103177,"CreatedDateTime":"2014-07-31T04:46:22Z","Content":"\n\u003Cp\u003EYea docs are a pain to both write and maintain. Look forward to the updates there\u003C/p\u003E\u003Cp\u003EBut I would still like a quick answer on the warp syntax so I can get out my v1.0 of Rover Driver... I have a workaround for the targeting bug.\u003C/p\u003E\n"},{"CreatedByName":"Tigermisu","CreatedById":58477,"CreatedDateTime":"2014-07-31T15:40:00Z","Content":"\n\u003Cp\u003EThanks for the support guys!\u003C/p\u003E\u003Cp\u003ELast question, is there a math function for e^x? I only saw logarithmic in the documents.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-07-31T16:27:46Z","Content":"\n\u003Cp\u003EYou can get the constant e this way:\u003C/p\u003E\u003Cp\u003Eprint \u0022Value of e is \u0022 \u002B constant():e.\u003C/p\u003E\u003Cp\u003EAny value can be exponented with \u0022^\u0022, so you can do:\u003C/p\u003E\u003Cp\u003E(constant():e)^x.\u003C/p\u003E\u003Cp\u003EI just saw that constant() is missing from the docs as well. I added it as an issue.\u003C/p\u003E\n"},{"CreatedByName":"kalor","CreatedById":89282,"CreatedDateTime":"2014-07-31T18:42:38Z","Content":"\n\u003Cp\u003Eso... unless I completely missed something, this:\u003C/p\u003E\u003Cp\u003Eprint stage:liquidfuel.\u003C/p\u003E\u003Cp\u003EShould return how much liquid fuel I have, listed by stage?\u003C/p\u003E\u003Cp\u003EUsing print ship:liquidfuel. works just fine, and returns the proper number. the stage listing appears to do nothing, always returning 0. Am I missing something?\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-07-31T19:36:48Z","Content":"\n\u003Cp\u003Estage:liquidfuel is supposed to be how much fuel is in the current stage. If you have no active engines, it returns zero. If you do have active engines and they have fuel, and it still says zero, then that\u0027s a bug.\u003C/p\u003E\n"},{"CreatedByName":"kalor","CreatedById":89282,"CreatedDateTime":"2014-07-31T19:42:56Z","Content":"\n\u003Cp\u003EHmmmm. In order to learn the system I am writing a small \u0022testing\u0022 script. So when a new vessel is on the pad, I \u0022run test.\u0022 and it will cycle through tests of power levels, fuel, etc, etc. \u003C/p\u003E\u003Cp\u003ETwo things about it... \u003C/p\u003E\u003Cp\u003EFirst, you were right about the \u0022active\u0022 stage. Any way to have it look at a future stage? (IE, the stage that I haven\u0027t activted yet, stage 0 when on the pad)\u003C/p\u003E\u003Cp\u003ESecond, I thought I saw something about adding parameters when running a program (IE, I could run test (1,2) to have it use those variables.) Is there any documentation on how to use this? I would like to use 1 as a variable for fuel, 2 for battery (to give the values I have the test script check for). \u003C/p\u003E\u003Cp\u003Ewould it be something along the lines of \u0022run test(fuellevel, batterylevel).\u0022? If so, how do I then use those variables? - Nevermind, found the post \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EThank you for your assistance! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-31T20:07:12Z\u0022 title=\u002207/31/2014 08:07  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 31, 2014\u003C/time\u003E by kalor\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"kalor","CreatedById":89282,"CreatedDateTime":"2014-07-31T20:16:06Z","Content":"\n\u003Cp\u003EOne other thing. Is it possible to print out the available memory on the selected volume?\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-07-31T21:36:57Z","Content":"\n\u003Cp\u003EIt\u0027s very hard to predict future stages because of the ability to perform weird staging methods. If every stage was simply a fuel tank and an engine and a separator it would be easy - but there are stages that siphon fuel with yellow hoses, and have fuel feeds taking fuel from tanks on the other side of a decoupler - these make it very hard to predict the fuel level in future stages. It\u0027s messy enough just to get the values of the current stage. (The algorithm is to walk the list of parts starting from each engine that is currently active, summing up all the fuel that is \u0027suckable\u0027 by that engine, and culling out all the duplicate fuel that you get from having multiple engines sucking fuel from the same tank.)\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022kalor\u0022 data-cite=\u0022kalor\u0022\u003E\u003Cdiv\u003EOne other thing. Is it possible to print out the available memory on the selected volume?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI doubt you\u0027ll ever run into a memory cap. There hypothetically is one, but it would be quite hard to actually reach it. The game doesn\u0027t have a way to tell you how many bytes of ram you\u0027re using. The disk space will be a problem long before the memory would be.\u003C/p\u003E\n"},{"CreatedByName":"QuakeIV","CreatedById":117416,"CreatedDateTime":"2014-07-31T22:11:22Z","Content":"\n\u003Cp\u003ECan someone explain to me what the reference frame for rotation is? The game seems to have issues for me if I try to just enter some absolute direction to face in, at times anyways. Especially if I am trying to control roll, sometimes it just spazzes out entirely in that case.\u003C/p\u003E\n"},{"CreatedByName":"kalor","CreatedById":89282,"CreatedDateTime":"2014-07-31T23:59:23Z","Content":"\n\u003Cp\u003EOk, after playing with this some, I love it. I\u0027ve done nothing today but start working out an auto-launcher \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhen I meant printing out memory on the selected volume I meant on the volume in game \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E Part of the script I was writing was a sort of POST, much like a home desktop goes through. Mostly, just to see what I could do with the language and interface, and a \u0022memory test\u0022 was one of the components I was looking at. Mostly for in the future, as programs become more sizable, determining when I need, in script, to start unloading/moving files and such between banks.\u003C/p\u003E\u003Cp\u003ESo far, realisitically, all I have accomplished is the flashing of lights, lowering of gears, and a straight vertical lift to escape velocity. But... that beats the first try, which was smashing into the ground. Hopefully with a lot of (bugging of better scripters!) I mean help, I will get better \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EOne question I have, as I can\u0027t seem to start a turn. Do I have to UNLOCK steering, in order to LOCK it to something else? Can\u0027t get the autopilot to do a gravity turn to save my Kerbal. EDIT: Ok, now I am confused. In launch 1, I did NOT unlock the steering, and it just flew straight up. In launch 2, I unlocked the refinement turn... one at 40KM altiitude, but left the initial turn, at 7KM altitude locked. In this launch, BOTH turns were made with no issue. Nothing else was changed within the code. I\u0027m curious what I missed?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-01T00:04:08Z\u0022 title=\u002208/01/2014 12:04  AM\u0022 data-short=\u00229 yr\u0022\u003EAugust 1, 2014\u003C/time\u003E by kalor\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"QuakeIV","CreatedById":117416,"CreatedDateTime":"2014-08-01T01:27:18Z","Content":"\n\u003Cp\u003EBeats me, post your code perhaps? I\u0027m still confused about orienation myself. I can do gravity turns, but thats about it. There doesn\u0027t seem to be any absolute rotation reference frame somehow.\u003C/p\u003E\n"},{"CreatedByName":"kalor","CreatedById":89282,"CreatedDateTime":"2014-08-01T02:41:32Z","Content":"\n\u003Cp\u003EI have a very, very rough orbital autopilot done, but the circularization sucks a bunch. Last time it was 1.3Mm Ap, 77KM Pe. Now I\u0027m working on a circularization script to run after the orbit is made, to get it at least somewhat closer. \u003C/p\u003E\u003Cp\u003EWith the rotation frame, you mean as in turning the ship, IE, \u0022turn left\u0022? or \u0022turn 10 degrees *direction*\u0022?\u003C/p\u003E\u003Cp\u003EAlso, is there the ability to write things to a text file somewhere? I would like to try to make a flight recorder of sorts, but not seeing any kind of file IO ability anywhere.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-01T02:53:04Z\u0022 title=\u002208/01/2014 02:53  AM\u0022 data-short=\u00229 yr\u0022\u003EAugust 1, 2014\u003C/time\u003E by kalor\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"QuakeIV","CreatedById":117416,"CreatedDateTime":"2014-08-01T02:53:31Z","Content":"\n\u003Cp\u003EI mean like, why does lock steering break when you feed it an absolute direction, for instance. \u003C/p\u003E\u003Cp\u003EIf you just say:\u003C/p\u003E\u003Cp\u003Elock steering to R(0,0,-90).\u003C/p\u003E\u003Cp\u003EIt will break lock steering. No roll will occur. It doesn\u0027t know what to align to for some reason.\u003C/p\u003E\u003Cp\u003EThis is an issue because in my case I kinda want to dock (in a manner of speaking), and if I cant align my RCS thrusters to velocity components then it will be pretty much impossible to do anything useful with them if I\u0027m using linear thrust.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-08-01T04:15:11Z","Content":"\n\u003Cp\u003EBoth the page about Directions (like R(a,b,c) ) and Vectors (like V(a,b,c)) have links to a page describing the coordinate system of KSP:\u003C/p\u003E\u003Cp\u003E \u003Ca href=\u0022http://ksp-kos.github.io/KOS_DOC/ref_frame/index.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://ksp-kos.github.io/KOS_DOC/ref_frame/index.html\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThis is messy behavior inherited from the main base game. The actual coordinate system of KSP itself doesn\u0027t really stay put in a rational way, owing to all the weird tricks they did for optimizations.\u003C/p\u003E\u003Cp\u003ELock steering to R(0,0,-90) is a case of gimbol lock, I think, given the messy way things work in Unity (where the rotations occur in a very strange order, I think it was Around Z, then Around X then Around Y, if I remember correctly, thus making controlling the roll actually quite hard to do).\u003C/p\u003E\u003Cp\u003EAt any rate, the rotations expressed in R(a,b,c) are, sadly, based on KSP\u0027s native system, not the craft. You\u0027re not rolling around the CRAFT\u0027s Z axis when you put a value in the 3rd argument to R(). You\u0027re rolling around the Universe\u0027s Z axis, which sadly keeps moving so I can\u0027t give a straight answer what it means all the time.\u003C/p\u003E\u003Cp\u003EThe easiest way I\u0027ve found to deal with the mess if you want to think in axes rotated with the ship\u0027s current facing, is this:\u003C/p\u003E\u003Cp\u003Elock shipx to ship:facing * V(1,0,0).\u003C/p\u003E\u003Cp\u003Elock shipy to ship:facing * V(0,1,0).\u003C/p\u003E\u003Cp\u003Elock shipz to ship:facing * V(0,0,1).\u003C/p\u003E\u003Cp\u003EFrom now on the unit vectors shipx, shipy, and shipz are unit vectors expressed in KSP\u0027s messy native coordinate orientation, but they are describing the directions that the X, Y, and Z axes would be if they were oriented with the ship.\u003C/p\u003E\u003Cp\u003ETherefore you can use dot products with them to convert any vector expressed in KSP\u0027s messy native coordinate orientation into a vector expressed in a ship-relative orientation, like so:\u003C/p\u003E\u003Cp\u003E// Assume someVec is a vector in KSP messy native coords - like SHIP:VELOCITY:ORBIT for example.\u003C/p\u003E\u003Cp\u003Eset someVecShipFrame to V( vdot(shipx,someVec), vdot(shipy,someVec), vdot(shipz,someVec) ).\u003C/p\u003E\u003Cp\u003ENow someVecShipFrame is a vector expressed in an alternate frame of reference in which X,Y, and Z are shipx, shipy, and shipz respectively.\u003C/p\u003E\n"},{"CreatedByName":"QuakeIV","CreatedById":117416,"CreatedDateTime":"2014-08-01T04:30:48Z","Content":"\n\u003Cp\u003EI have read that article in the past, it didnt really help. That being said, if what you just described works then I shall worship you for all eternity. And probably post a cool video of my thing working.\u003C/p\u003E\u003Cp\u003E e: This would save me much time, do the inbuilt scalar projections produce signed output? e2: Nix that, I went back in and misread the documentation. Looks like ill be using dot product.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-01T04:56:24Z\u0022 title=\u002208/01/2014 04:56  AM\u0022 data-short=\u00229 yr\u0022\u003EAugust 1, 2014\u003C/time\u003E by QuakeIV\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"QuakeIV","CreatedById":117416,"CreatedDateTime":"2014-08-01T21:04:12Z","Content":"\n\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/k1NLVo9MauY?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cbr\u003E\u003Cbr\u003Ee: Pretty dry, but the quality would go down even more if I edited it.\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-01T21:07:46Z\u0022 title=\u002208/01/2014 09:07  PM\u0022 data-short=\u00229 yr\u0022\u003EAugust 1, 2014\u003C/time\u003E by QuakeIV\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Shukinen","CreatedById":74993,"CreatedDateTime":"2014-08-03T01:52:39Z","Content":"\n\u003Cp\u003Eany1 got a tutorial or something for basic programming, i really enjoy the mod, but i cant quite make anything i was, oh and i did the tutorial on the kos wiki i can make a rocket get into orbit but i cannot set a specific speed not to go too fast and would like to know if there is a way to make like a program with KOS that would start up and ask me the actual orbit i would like to get to and so it would make the necessary calculation\u003C/p\u003E\n"},{"CreatedByName":"AseaHeru","CreatedById":76041,"CreatedDateTime":"2014-08-03T06:04:13Z","Content":"\n\u003Cp\u003EYes, basic programming tutorials are everywhere, for basic Kos ones see the wiki or the videos.\u003C/p\u003E\u003Cp\u003EAnd nice dream, but wont work*. Best you can do is write up a set of them for different altitudes.\u003C/p\u003E\u003Cp\u003E*It might, but it might be hard, certainly harder than changing two lines of code and calling it a new file.\u003C/p\u003E\u003Cp\u003EOh, and quake? Kudos on actually codeing it.\u003C/p\u003E\n"},{"CreatedByName":"Panichio","CreatedById":2858,"CreatedDateTime":"2014-08-03T17:00:31Z","Content":"\n\u003Cp\u003EI definitely have v0.13.1 but the kOS console displays ~v12. Do I still have the newest version?\u003C/p\u003E\n"},{"CreatedByName":"plonk","CreatedById":116062,"CreatedDateTime":"2014-08-03T22:07:46Z","Content":"\n\u003Cp\u003EIt will totally slow your game, but it works (at least on my PC)! A \u0027kOS fullscreen animated map\u0027! Hehe.\u003C/p\u003E\u003Cp\u003EScript shows \u0022heightmap\u0022 of current body, zooming in to ship:geoposition. Great to have latlng:terrainheight!\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E Finally some sort of situational awareness. Now working on pathfinding for rovers in kOS. There goes my precious time...\u003C/p\u003E\u003Cp\u003ESymbol table for height display is for demonstration purpose. If your kscii art is better than mine, go ahead and optimize. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003Eset offset to ship:geoposition.\u003Cbr\u003Eset scale to 1.0.\u003Cbr\u003E\u003Cbr\u003Eset symbols to list().\u003Cbr\u003Eset symbols:add to \u0022 \u0022.\u003Cbr\u003Eset symbols:add to \u0022.\u0022.\u003Cbr\u003Eset symbols:add to \u0022-\u0022.\u003Cbr\u003Eset symbols:add to \u0022\u002B\u0022.\u003Cbr\u003Eset symbols:add to \u0022x\u0022.\u003Cbr\u003Eset symbols:add to \u0022A\u0022.\u003Cbr\u003Eset symbols:add to \u0022B\u0022.\u003Cbr\u003Eset symbols:add to \u0022C\u0022.\u003Cbr\u003Eset symbols:add to \u0022D\u0022.\u003Cbr\u003Eset symbols:add to \u0022E\u0022.\u003Cbr\u003Eset symbols:add to \u0022F\u0022.\u003Cbr\u003Eset symbols:add to \u0022G\u0022.\u003Cbr\u003Eset symbols:add to \u0022H\u0022.\u003Cbr\u003Eset symbols:add to \u0022I\u0022.\u003Cbr\u003Eset symbols:add to \u0022J\u0022.\u003Cbr\u003Eset symbols:add to \u0022K\u0022.\u003Cbr\u003Eset symbols:add to \u0022L\u0022.\u003Cbr\u003Eset symbols:add to \u0022M\u0022.\u003Cbr\u003E\u003Cbr\u003Eset vScale to 2000/symbols:length. // 2000 is upper limit, higher is cut off\u003Cbr\u003E\u003Cbr\u003Eset x to 0.\u003Cbr\u003Eset y to 0.\u003Cbr\u003Eset screenDimX to 49.\u003Cbr\u003Eset screenDimY to 35.\u003Cbr\u003Eset nSymbols to symbols:length - 1.\u003Cbr\u003E\u003Cbr\u003Eclearscreen.\u003Cbr\u003Eset config:ipu to 100000. // use carefully \u003Cbr\u003E\u003Cbr\u003Euntil scale \u0026lt; 0.001 {\u003Cbr\u003E  until y\u0026gt;screenDimY {\u003Cbr\u003E    set gpLat to 90-(y/screenDimY*180).\u003Cbr\u003E    set gpLat to scale*gpLat \u002B offset:lat.\u003Cbr\u003E    until x\u0026gt;=screenDimX {\u003Cbr\u003E      set gpLng to (x/screenDimX*360)-180.\u003Cbr\u003E      set gpLng to scale*gpLng \u002B offset:lng.\u003Cbr\u003E\u003Cbr\u003E      set h to latlng(gpLat,gpLng):terrainheight.\u003Cbr\u003E      set h to max(-1,h/vScale).\u003Cbr\u003E      set h to round(h\u002B.5,0).\u003Cbr\u003E      set h to min(nSymbols,h).\u003Cbr\u003E      set w to symbols[h].\u003Cbr\u003E\u003Cbr\u003E      print w at(x,y).\u003Cbr\u003E      set x to x\u002B1.\u003Cbr\u003E    }\u003Cbr\u003E  set y to y\u002B1.\u003Cbr\u003E  set x to 0.\u003Cbr\u003E  }\u003Cbr\u003E  set y to 0.\u003Cbr\u003E  set offset to geoposition.\u003Cbr\u003E  set scale to scale*0.98.\u003Cbr\u003E}\u003Cbr\u003Eset config:ipu to 100. // don\u0027t forget.\u003Cbr\u003Ewait 2.\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"Shukinen","CreatedById":74993,"CreatedDateTime":"2014-08-04T03:51:01Z","Content":"\n\u003Cp\u003Ehello there, i am trying to make a \u0022surface info\u0022 screen for my ascent little prog, the issue i get is that the number just keep flickering and i would like somtething that do like a real MFD like this one:\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/lJ9TwPL1CLQ?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003Ehere is what i use atm, way far from completion, maybe you could help me,\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003E//90 km orbit.\u003Cbr\u003E\u003Cbr\u003E//                        Launch print\u003Cbr\u003E// *******************************************************************\u003Cbr\u003E// *******************************************************************\u003Cbr\u003Eclearscreen.\u003Cbr\u003E\u003Cbr\u003Eprint \u0022Launch Mode\u0022 at (19,1).\u003Cbr\u003Eprint \u0022==================================================\u0022 at (0,2).\u003Cbr\u003Ewait 1.\u003Cbr\u003Eprint \u002290 Km orbit chosen\u0022 at (16,4).\u003Cbr\u003Ewait 1.\u003Cbr\u003Eprint \u0022Launch in...\u0022 at (19,6).\u003Cbr\u003E\u003Cbr\u003Eset countdown to 2.\u003Cbr\u003E\u003Cbr\u003Ewhen countdown = 2 then\u003Cbr\u003E{\u003Cbr\u003E\tlock throttle to 1.0.\u003Cbr\u003E\tlock steering to up \u002B R(0,0,180).\u003Cbr\u003E}.\u003Cbr\u003E\u003Cbr\u003Euntil countdown = 0\u003Cbr\u003E{\t\u003Cbr\u003E\tprint countdown at (24,8).\u003Cbr\u003E\twait 1.\u003Cbr\u003E\tset countdown to countdown -1.\u003Cbr\u003E\u003Cbr\u003E}.\u003Cbr\u003E\u003Cbr\u003Eclearscreen.\u003Cbr\u003E\u003Cbr\u003Eprint \u0022Launch!\u0022 at (22,15).\u003Cbr\u003E\u003Cbr\u003E// *******************************************************************\u003Cbr\u003E// *******************************************************************\u003Cbr\u003E\u003Cbr\u003Estage.\u003Cbr\u003Ewait 1.\u003Cbr\u003E\u003Cbr\u003Eclearscreen.\u003Cbr\u003E\u003Cbr\u003Euntil altitude \u0026gt; 10000 \u003Cbr\u003E{\u003Cbr\u003Erun surfaceinfo.\u003Cbr\u003E}.\u003Cbr\u003E\u003Cbr\u003Ewait until apoapsis \u0026gt; 15000.\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Ethe actual surface info:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003E//surface info\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E// writting data on 1st column start at 15\u003Cbr\u003E//wrtiting data on 2nd column start at 39\u003Cbr\u003E\u003Cbr\u003Eprint \u0022Surface info\u0022 at (19,2).\u003Cbr\u003Eprint \u0022*========================*=======================*\u0022 at (0,3).\u003Cbr\u003Eprint \u0022|                        |                       |\u0022 at (0,4).\u003Cbr\u003Eprint \u0022|    altitude:           |inclination:           |\u0022 at (0,5).\u003Cbr\u003Eprint \u0022|          Ap:           |  Eccencity:           |\u0022 at (0,6).\u003Cbr\u003Eprint \u0022|  Time to Ap:           |      Speed:           |\u0022 at (0,7).\u003Cbr\u003Eprint \u0022|          Pe:           |    TermVel:           |\u0022 at (0,8).\u003Cbr\u003Eprint \u0022|  Time to Pe:           |   SurfGrav:           |\u0022 at (0,9).\u003Cbr\u003Eprint \u0022|                        |                       |\u0022 at (0,10).\u003Cbr\u003Eprint \u0022*========================*=======================*\u0022 at (0,11).\u003Cbr\u003E\u003Cbr\u003Eprint round (altitude) at (15,5).\u003Cbr\u003Eprint round (apoapsis) at (15,6).\u003Cbr\u003Eprint round (ETA:apoapsis) at (15,7).\u003Cbr\u003Eprint round (periapsis) at (15,8).\u003Cbr\u003Eprint round (ETA:periapsis) at (15,9).\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EP,S, im just beginning with KOS and programming so dont be too harsh on judging me XD\u003C/p\u003E\u003Cp\u003Ethank you in advance!\u003C/p\u003E\n"}]}