{"TopicId":63547,"ForumId":34,"TopicTitle":"[1.0.5] Advanced Jet Engine v2.6.1 - Feb 1","CreatedByName":"camlost","CreatedById":57590,"CreatedDateTime":"2014-02-18T02:55:07Z","PageNum":39,"Articles":[{"CreatedByName":"camlost","CreatedById":57590,"CreatedDateTime":"2014-11-11T23:13:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jrandom\u0022 data-cite=\u0022jrandom\u0022\u003E\u003Cdiv\u003EI find it funny that building an SR-71-style plane in KSP w/ AJE and RealFuels is how I figured out how to fly the realistically-modeled one in X-Plane -- have to flatten out at 10km and build up speed before climbing up to cruising altitude.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh, I never passed M1.5 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003EBTW, do you know if XP\u0027s supersonic aerodynamics\u0027 realistic or not\u003C/p\u003E\n"},{"CreatedByName":"jrandom","CreatedById":74522,"CreatedDateTime":"2014-11-11T23:14:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022camlost\u0022 data-cite=\u0022camlost\u0022\u003E\u003Cdiv\u003EOh, I never passed M1.5 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003Cp\u003EBTW, do you know if XP\u0027s supersonic aerodynamics\u0027 realistic or not\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m no expert, but there\u0027s definitely mach tuck and other behaviors I\u0027ve also witnessed in FAR, and FAR \u003Cem\u003Eis\u003C/em\u003E designed by an expert.\u003C/p\u003E\n"},{"CreatedByName":"camlost","CreatedById":57590,"CreatedDateTime":"2014-11-12T02:13:45Z","Content":"\n\u003Cp\u003ESeems like in XP10 the SR71 max out at only M2? I looked at the engine setting interface in Planemaker.exe, their engine is probably less powerful than AJE\u0027s J58\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-11-12T06:02:49Z","Content":"\n\u003Cp\u003EIt may well not support a variable Compressor Pressure Ratio. Been a while since I tried X-Plane...\u003C/p\u003E\n"},{"CreatedByName":"DaMichel","CreatedById":93697,"CreatedDateTime":"2014-11-12T08:05:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022camlost\u0022 data-cite=\u0022camlost\u0022\u003E\u003Cdiv\u003E@Damichel, I never thought that would worked! Because the SABRE S has a smaller TWR than SaBRE M. Also I found that the SABRE M had 2920kN in rocket mode, which is weird because it should be 1350kN. I corrected that in the dev version on github. Another thing is that I think the RAPIER should use LqdMethane instead kerosene (which is ridiculous)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt was a close call. I didn\u0027t realize that the Sabre M have higher TWR, but i wanted to build small anyways. I had DRE running, too. At some point this almost proved fatal as the forward tank temperature reached a critical level. It was already in rocket mode, ca. Mach 8 in 40 km altitude. No way to climb higher without accelerating ... Indeed, previously i burned up a couple of times \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E Procedural Parts really need a heat shield.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jrandom\u0022 data-cite=\u0022jrandom\u0022\u003E\u003Cdiv\u003EI find it funny that building an SR-71-style plane in KSP w/ AJE and RealFuels is how I figured out how to fly the realistically-modeled one in X-Plane -- have to flatten out at 10km and build up speed before climbing up to cruising altitude.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt kind of makes sense though. The faster you fly the more air the engine gets to burn, so the higher the thrust, right? \u003C/p\u003E\u003Cp\u003EI found if you climb real high there can be a state where your thrust equals drag so you cannot accelerate any more. But if you dive a little, thrust increases and you can actually go faster. Well actually i learned about diving here on the forum and tried to apply it to my space plane flying and it really worked.\u003C/p\u003E\u003Cp\u003EFor my last ascent i did it to go supersonic. But after that i monitored engine thrust and adjusted my climb rate so that it would stay between 100 - 125 kN per engine. That way i climbed slowly and never stopped accelerating. Not sure if most efficient (is it?) but it worked evidently.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-12T08:09:56Z\u0022 title=\u002211/12/2014 08:09  AM\u0022 data-short=\u00229 yr\u0022\u003ENovember 12, 2014\u003C/time\u003E by DaMichel\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Iskierka","CreatedById":2116,"CreatedDateTime":"2014-11-12T10:22:52Z","Content":"\n\u003Cp\u003EThe diving technique works (and is often more efficient, it was a common technique for breaking Mach 1 in both Concorde and the SR-71) because of something known as specific excess power, which is how much power the aircraft can deliver versus power required to maintain steady level flight. Around Mach 1 due to increased drag, there\u0027s effectively a throat of reduced SEP that gives a narrow and difficult gap to pass through. However, the aircraft can still get much excess power just a bit slower just before this throat - so it\u0027s often better to climb high while subsonic with plenty of power, then enter a dive, which will convert altitude to speed while your engines keep thrusting, pass through the throat quickly, then climb again after you are no longer restricted by the increased M=1 drag.\u003C/p\u003E\n"},{"CreatedByName":"jrandom","CreatedById":74522,"CreatedDateTime":"2014-11-12T15:23:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DaMichel\u0022 data-cite=\u0022DaMichel\u0022\u003E\u003Cdiv\u003EThe faster you fly the more air the engine gets to burn, so the higher the thrust, right? \u003Cp\u003EI found if you climb real high there can be a state where your thrust equals drag so you cannot accelerate any more.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhen I first installed AJE, that\u0027s the wall I kept hitting, until finally it clicked that \u0022to go faster, first you must go faster\u0022. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"kcs123","CreatedById":127158,"CreatedDateTime":"2014-11-12T18:40:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Iskierka\u0022 data-cite=\u0022Iskierka\u0022\u003E\u003Cdiv\u003EThe diving technique works (and is often more efficient, it was a common technique for breaking Mach 1 in both Concorde and the SR-71) because of something known as specific excess power, which is how much power the aircraft can deliver versus power required to maintain steady level flight. Around Mach 1 due to increased drag, there\u0027s effectively a throat of reduced SEP that gives a narrow and difficult gap to pass through. However, the aircraft can still get much excess power just a bit slower just before this throat - so it\u0027s often better to climb high while subsonic with plenty of power, then enter a dive, which will convert altitude to speed while your engines keep thrusting, pass through the throat quickly, then climb again after you are no longer restricted by the increased M=1 drag.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExactly my thoughts about it. That is how I was thinking when I was started to design aircraft. I didn\u0027t folow other peoples rules to put low profile delta wings some engines and control surfaces, all with high TWR. Instead I have made something that could be called as streched delta wing. Similar shape, but with lot more L/D ratio that suits better to some glider planes, rather then fighterplanes. MJ shows max TWR with empty tanks like 0.8 in SPH editor, but once in flight it wary a lot, depending on speed and altitude, so actual TWR is somwhere between 0.2 and 0.5 in airbreathing(jet) mode.\u003C/p\u003E\u003Cp\u003EProblematic part is to accelerate enough on runway to be able to take off, flaps helps with that. Once I take off, 25-30% of throttle is enough for ~30kN of thrust. With that I can climb up to 8-12km, accelerating slightly on the way up, so when I got altitude, I don\u0027t need to wait much until I break sound barrier and L/D become stable again. Then comes confusing part, is it better to continue with full throttle to gain speed and altitude or it is more fuel efficient to go with lower supersonic speed and raise altitude and then again go with full throttle at high altitude to speed up.\u003C/p\u003E\u003Cp\u003EWell, with latest test flight I found almost no difference in fuel efficiency with either of two aproach. When I was going with low supersonic speed until gain high altitude, when I was accelerating to gain speed at high altitude, I was forced to dive, because plane was lost lift due to higher speed until more dense atmosphere is reached, and when I was speed up at lower altitude, I was able to climb again. Have to do that several times until I reached enough speed/altitude for finall push to orbit.\u003C/p\u003E\u003Cp\u003EWhen I used full throttle all the way up to highest speed/altitude after breaking 1 Mach, engine shows higher fuel consumption, but there was less diving until I reached point when I need to switch to rocket mode. And yes, I have established stable orbit with 30t payload and still 157 m/s of dV left for small orbital tasks and have fuel to deorbit and land on runway. Almost the same dV as I have left without AJE mod.\u003C/p\u003E\u003Cp\u003EI didn\u0027t used real fuel mod with this, but is it any big difference besides calling fuels real life names ? If I use hydrogen, it is lighter, but I need more volume to store it, If I use kerosine, it require less volume, but it is heavier. Overall stored chemical energy in either fuel should be the same to provide enough dV for orbit. Probably I will give a RF a try, also deadly reentry, but my craft usualy crashes sooner from FAR aerodinamic failures then from too high temperatures. \u003C/p\u003E\u003Cp\u003EI\u0027m still researching available mods, what I should install and what to avoid to maintain stable game. I\u0027m still in sandbox mode researching possibilities before I start new career.\u003C/p\u003E\n"},{"CreatedByName":"camlost","CreatedById":57590,"CreatedDateTime":"2014-11-12T22:55:39Z","Content":"\n\u003Cp\u003ERF is a big difference\u003C/p\u003E\u003Cp\u003E\u0022 Overall stored chemical energy in either fuel should be the same\u0022\u003C/p\u003E\u003Cp\u003ENo.\u003C/p\u003E\n"},{"CreatedByName":"Hyomoto","CreatedById":64780,"CreatedDateTime":"2014-11-13T16:17:53Z","Content":"\n\u003Cp\u003EThe update for AJE just says, \u0022Rapier change\u0022. Care to elaborate?\u003C/p\u003E\n"},{"CreatedByName":"camlost","CreatedById":57590,"CreatedDateTime":"2014-11-14T00:24:59Z","Content":"\n\u003Cp\u003E@Hyomoto, We use Liquid Methane now, which makes more sense. I don\u0027t know if you use RF, but you should if you\u0027re concerned about SSTOs\u003C/p\u003E\u003Cp\u003E@Nathan, I find XP\u0027s jet model a good reference for BJE. \u003C/p\u003E\u003Cp\u003EAbout the SR-71, their drag is also funky. In XP it was modeled as a delta-wing, with fuselage providing no lift \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"DaMichel","CreatedById":93697,"CreatedDateTime":"2014-11-16T21:08:25Z","Content":"\n\u003Cp\u003EI saw you added a ramjet config. Thanks. I had to make a little mission devoted to it.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/22czzrO.jpg\u0022 alt=\u002222czzrO.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cblockquote\u003E \u003C/blockquote\u003E\n"},{"CreatedByName":"Genius Evil","CreatedById":72989,"CreatedDateTime":"2014-11-19T05:27:41Z","Content":"\n\u003Cp\u003EI\u0027ve been looking at the propeller config, trying to figure out how it works. It looks like some of the tables are coefficients calculated with Java Prop with respect to two parameters, but I have no idea what they are. My best guess was Cs on the Y axis and velocity on the x axis, but the x axis would only go up to ~70m/s. I have absolutely no idea what the four-column charts are. Could anyone shed some light on this?\u003C/p\u003E\u003Cp\u003EAlso, is ixxFTLB the moment of inertia?\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-11-19T07:04:41Z","Content":"\n\u003Cp\u003EAre you looking at the new code I wrote (based on JSBSim) or the old YASim code?\u003C/p\u003E\n"},{"CreatedByName":"Genius Evil","CreatedById":72989,"CreatedDateTime":"2014-11-19T16:07:06Z","Content":"\n\u003Cp\u003EI have 1.6.4, so the new code. I haven\u0027t actually looked at the code (no programming experience), just the \u0022Propellers.cfg\u0022 file. I\u0027m trying to create propellers for some high-powered post war engines (e.g. Wasp Major, Bristol Centaurus).\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2014-11-19T22:02:06Z","Content":"\n\u003Cp\u003EI see you\u0027re adding the RF VTOL engines. I\u0027ve got a suggestion for the IR-based tiltjet pod: \u003Ca href=\u0022https://en.wikipedia.org/wiki/Rolls-Royce_RB145\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Rolls-Royce_RB145\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe smaller one could be done as the J85: \u003Ca href=\u0022https://en.wikipedia.org/wiki/General_Electric_J85\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/General_Electric_J85\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe J85 was used in a similar configuration here: \u003Ca href=\u0022https://en.wikipedia.org/wiki/Bell_D-188A\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Bell_D-188A\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-11-20T00:29:21Z","Content":"\n\u003Cp\u003EGenius Evil: Use the HS60something propeller. That\u0027s the 13ft Hamilton Standard that the F4U-4 used, and is basically the same as the 13-footers all the late/postwar radials used. For the Wasp Major, you\u0027ll want to probably just use the R-2800-18W and increase the HP accordingly; alas I don\u0027t simulate three blower speeds yet, so you\u0027ll miss out on either low or high blower (neutral blower will always be the in as \u0022low speed\u0022 because otherwise you won\u0027t get sufficient takeoff BHP). I think now I have the Double Wasps using neutral and high, skipping low, but at one point they were neutral and low, skipping high (which was kinda-simulated by increasing ram air recovery effectiveness).\u003C/p\u003E\n"},{"CreatedByName":"Genius Evil","CreatedById":72989,"CreatedDateTime":"2014-11-20T01:27:04Z","Content":"\n\u003Cp\u003EOk, thanks! I\u0027ll post the cfgs when I\u0027ve got them working well.\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-11-20T01:46:56Z","Content":"\n\u003Cp\u003EGenius Evil: use \u003Ca href=\u0022https://www.dropbox.com/s/lz2ntsqhwe192xv/Calcs.xls\u0022 rel=\u0022external nofollow\u0022\u003Ethis excel sheet\u003C/a\u003E to generate the engine config. You can input the actual BHPs at altitudes and adjust things until the curves match.\u003C/p\u003E\n"},{"CreatedByName":"camlost","CreatedById":57590,"CreatedDateTime":"2014-11-20T04:06:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dragon01\u0022 data-cite=\u0022Dragon01\u0022\u003E\u003Cdiv\u003EI see you\u0027re adding the RF VTOL engines. I\u0027ve got a suggestion for the IR-based tiltjet pod: \u003Ca href=\u0022https://en.wikipedia.org/wiki/Rolls-Royce_RB145\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Rolls-Royce_RB145\u003C/a\u003E\u003Cp\u003EThe smaller one could be done as the J85: \u003Ca href=\u0022https://en.wikipedia.org/wiki/General_Electric_J85\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/General_Electric_J85\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe J85 was used in a similar configuration here: \u003Ca href=\u0022https://en.wikipedia.org/wiki/Bell_D-188A\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Bell_D-188A\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut the RB145 is weaker that J85. Having something bigger and weaker doesn\u0027t make sense?\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2014-11-20T04:17:32Z","Content":"\n\u003Cp\u003EI was going by the (apparent) size of the pods. If I was wrong about this, you can, of course, swap them. The basic idea was that I found two sets of engines which were used in pods like that. Certainly beats yet another R\u0026amp;R Pegasus config, and there aren\u0027t many jet engines that were used for VTOL applications.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-20T12:13:31Z\u0022 title=\u002211/20/2014 12:13  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 20, 2014\u003C/time\u003E by Guest\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Genius Evil","CreatedById":72989,"CreatedDateTime":"2014-11-20T21:23:00Z","Content":"\n\u003Cp\u003ENathanKell: I got an early Wasp Major (built-in supercharger, no turbo; based on data from an old Flightglobal article) working. Power curve is pretty good, thrust is about what I expected (thanks for the Excel sheet; it was invaluable). However, for some reason it\u0027s causing an extreme amount of drag. I copied the mesh position, mesh scale, and FARBasicDragModel from the R-2800, but the Wasp Major has far greater drag. My Corsair with the R-2800 has a zero-lift drag coefficient of ~0.06-0.07; but with the R-4360 (same size, same drag model) it has a zero-lift Cd of ~0.1-0.11. With no engine, the zero-lift Cd was ~0.01-0.03. I also noticed that the maximum drag coefficient specified in the FARBasicDragModel for both engines was 0.04, indicating that the high drag isn\u0027t intended behavior.\u003C/p\u003E\u003Cp\u003EIs this just a problem with my install, or is it intended behavior?\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-11-20T21:58:30Z","Content":"\n\u003Cp\u003ECan you post the config?\u003C/p\u003E\n"},{"CreatedByName":"Genius Evil","CreatedById":72989,"CreatedDateTime":"2014-11-20T22:03:00Z","Content":"\n\u003Cp\u003EHere it is:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/yuc6qx882p0c3t2/WaspMajor.cfg?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/yuc6qx882p0c3t2/WaspMajor.cfg?dl=0\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-11-20T22:24:44Z","Content":"\n\u003Cp\u003E1. Remove FXModuleAnimateThrottle.\u003C/p\u003E\u003Cp\u003E2. Remove ModuleResourceIntake.\u003C/p\u003E\n"}]}