{"TopicId":68043,"ForumId":34,"TopicTitle":"Universal Storage 1.4.0.0 (For KSP 1.4.x) 13th March 2018","CreatedByName":"Paul Kingtiger","CreatedById":57455,"CreatedDateTime":"2014-04-04T15:12:57Z","PageNum":16,"Articles":[{"CreatedByName":"Daishi","CreatedById":85055,"CreatedDateTime":"2014-06-19T23:59:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022T3chnic\u0022 data-cite=\u0022T3chnic\u0022\u003E\u003Cdiv\u003EDoes anyone know if this will work with \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/81794\u0022 rel=\u0022external nofollow\u0022\u003EDangIt\u003C/a\u003E?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI hope so - if not, I\u0027m sure Ippo could make it work. Give it a try \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SpacedInvader","CreatedById":106018,"CreatedDateTime":"2014-06-20T00:39:22Z","Content":"\n\u003Cp\u003EWell, I was planning on doing it with a module manager file anyway, so I guess that answers that question. I\u0027ll spend some time in it tonight and should have it done tonight or tomorrow.\u003C/p\u003E\u003Cp\u003EAre you guys ok with me sharing the MM file on this thread, or would you rather I only share it through pm?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-20T05:26:16Z\u0022 title=\u002206/20/2014 05:26  AM\u0022 data-short=\u002210 yr\u0022\u003EJune 20, 2014\u003C/time\u003E by SpacedInvader\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Duxwing","CreatedById":42282,"CreatedDateTime":"2014-06-20T02:00:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Daishi\u0022 data-cite=\u0022Daishi\u0022\u003E\u003Cdiv\u003EHmm, odd. Does it happen on removing, or attaching wedges as well? Any wedge in particular? Got pics of your craft? No idea why it should be exploding :|\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMy craft disassembled themselves only on removing any wedge from any attachment point; e.g., removing a KAS wedge from the top of the stock 0.625m stack decoupler. The hapless Kerbal removing the wedge would instantly accelerate to a seemingly-random speed on any vector pointing from the ship. \u003C/p\u003E\u003Cp\u003E-Duxwing\u003C/p\u003E\n"},{"CreatedByName":"Daishi","CreatedById":85055,"CreatedDateTime":"2014-06-20T06:57:09Z","Content":"\n\u003Cp\u003EBizarre, and it doesn\u0027t do it with other large KAS enabled parts? I think the best bet is to PM a modlist and probably game logs to Paul. There is only so much I can do without my computer, sorry. I suspect its probably another mod related to joints and attachment (joint reinforcement?), or maybe KAS itself causing you strife. Never heard of this bug before :/\u003C/p\u003E\n"},{"CreatedByName":"Rayder","CreatedById":95226,"CreatedDateTime":"2014-06-20T08:54:10Z","Content":"\n\u003Cp\u003EHi guys,\u003C/p\u003E\u003Cp\u003EStarting to get into this mod and I\u0027m really enjoying using the parts. Some I like and others I\u0027ll likely remove. But I\u0027m having a problem, specifically with the Science Bay. I noticed the problem doesn\u0027t appear on the YouTube tutorial, so I\u0027ll show you the issue I\u0027m having.\u003C/p\u003E\u003Cp\u003EThis is the YouTube video. The radial attach surface works properly.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/h0QCgDP.jpg\u0022 alt=\u0022h0QCgDP.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EHere is a screenshot of my game.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ok48rlt.jpg\u0022 alt=\u0022ok48rlt.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe radial surface seems to be inverted. Any ideas what to change in the cfg to fix this?\u003C/p\u003E\u003Cp\u003EEDIT: The game also doesn\u0027t see them as flat surfaces, instead preferring to rotate them as if it\u0027s a curved surface.\u003C/p\u003E\u003Cp\u003EThanks\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-20T09:22:33Z\u0022 title=\u002206/20/2014 09:22  AM\u0022 data-short=\u002210 yr\u0022\u003EJune 20, 2014\u003C/time\u003E by Rayder\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SpacedInvader","CreatedById":106018,"CreatedDateTime":"2014-06-20T11:26:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rayder\u0022 data-cite=\u0022Rayder\u0022\u003E\u003Cdiv\u003EHi guys,\u003Cp\u003EStarting to get into this mod and I\u0027m really enjoying using the parts. Some I like and others I\u0027ll likely remove. But I\u0027m having a problem, specifically with the Science Bay. I noticed the problem doesn\u0027t appear on the YouTube tutorial, so I\u0027ll show you the issue I\u0027m having.\u003C/p\u003E\u003Cp\u003EThis is the YouTube video. The radial attach surface works properly.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/h0QCgDP.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/h0QCgDP.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EHere is a screenshot of my game.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/ok48rlt.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/ok48rlt.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe radial surface seems to be inverted. Any ideas what to change in the cfg to fix this?\u003C/p\u003E\u003Cp\u003EEDIT: The game also doesn\u0027t see them as flat surfaces, instead preferring to rotate them as if it\u0027s a curved surface.\u003C/p\u003E\u003Cp\u003EThanks\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETurn off angle snap and it should work perfectly. I had the same problem and that fixed it for me.\u003C/p\u003E\n"},{"CreatedByName":"Rayder","CreatedById":95226,"CreatedDateTime":"2014-06-20T11:43:14Z","Content":"\n\u003Cp\u003EAh yes, now it works. Many thanks.\u003C/p\u003E\n"},{"CreatedByName":"SpacedInvader","CreatedById":106018,"CreatedDateTime":"2014-06-20T11:45:04Z","Content":"\n\u003Cp\u003EOk, so I\u0027m about halfway done with my module manager config for TACLS integration and I\u0027m at a point where I\u0027ve got a couple of options on how to proceed and would like a little input. The first possibility is to have the TACLS config have all of its own parts (created through referencing the originals with some edits, not by copying models) with TACLS\u0027s unitless amounts, which for an oxygen block would be about 84.15 (average human breathing ~550L/day with 46284L in the tank). In this version I would also need to alter the resources so the US Core would use something like LO2 and LH2 to signify that they are in liquid form while also preventing those 46284L from throwing the TACLS balance completely out the window. The other option would be to convert the US Core amounts to match what TACLS would be, while then also scaling the usage rates for the fuel cell to keep them in line with what is already established for this mod.\u003C/p\u003E\u003Cp\u003EI think option 2 is the most succinct / least complicated way of doing the integration, but I have concerns that the game will accept an input resource rate of ~0.00006/sec. Option one means more extra parts the game has to load and for users to sort through, but it would preserve the original numbers much better, plus I would include a TACLS converter that would give an appropriate conversion from liquid oxygen to TACLS oxygen units so your LO2 supply could be cut into to give you more O2 in a pinch. I also have plans to include a water purifier, carbon extractor, and maybe even a waste compactor since I keep reading things that hint that the shuttle had such a device.\u003C/p\u003E\u003Cp\u003EAnyway, I\u0027d like your thoughts on all of this, keeping in mind that this is still just a stopgap measure until the proper TACLS pack is released.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-20T21:48:53Z\u0022 title=\u002206/20/2014 09:48  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 20, 2014\u003C/time\u003E by SpacedInvader\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Rayder","CreatedById":95226,"CreatedDateTime":"2014-06-20T12:08:58Z","Content":"\n\u003Cp\u003EMy personal opinion, is that while KSP is quite realistic in some ways, it is definitely not in others. So with that in mind, I\u0027d not bother with actual or accurate quantities.\u003C/p\u003E\u003Cp\u003ESo with that said I\u0027d stick with TAC\u0027s measurements, as in 1 resource = 1 day. It makes it easier to work with, and know how much you have. You can then ballpark a figure and say \u0022this container could last around 180 days\u0022, etc.\u003C/p\u003E\u003Cp\u003EIf you wanted to change things up a bit (ie not so simple), your recyclers could work on different timescales, so you might get Oxygen faster than you get Water.\u003C/p\u003E\u003Cp\u003EI converted the US EVA-X to use TAC scales, and added food into it as well. Just made it a day\u0027s supply. If I had to work with actual units, it would take ages. Putting a 1 in each resource is much simpler.\u003C/p\u003E\n"},{"CreatedByName":"J.Random","CreatedById":63332,"CreatedDateTime":"2014-06-20T12:10:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SpacedInvader\u0022 data-cite=\u0022SpacedInvader\u0022\u003E\u003Cdiv\u003E I have concerns that the game will accept an input resource rate of ~0.00006/sec.\u003C/div\u003E\u003C/blockquote\u003E Doesn\u0027t it accept such consumption rate for food and poop already? IIRC, food is stored/used as 1 unit per kerbal per 24 hours.\n"},{"CreatedByName":"vardicd","CreatedById":75832,"CreatedDateTime":"2014-06-20T15:19:22Z","Content":"\n\u003Cp\u003EI would love to know what program you use to make the textures for KSP? I\u0027ve gotten pretty good and writing and editing code for part files, but I\u0027d love to start making my own models and textures, and would love to hear what you use.\u003C/p\u003E\n"},{"CreatedByName":"Paul Kingtiger","CreatedById":57455,"CreatedDateTime":"2014-06-20T17:32:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022T3chnic\u0022 data-cite=\u0022T3chnic\u0022\u003E\u003Cdiv\u003EDoes anyone know if this will work with \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/81794\u0022 rel=\u0022external nofollow\u0022\u003EDangIt\u003C/a\u003E?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve been testing it with DangIt and so far so good. We both really love that mod and will work to make sure US is fully compatible.\u003C/p\u003E\n"},{"CreatedByName":"Duxwing","CreatedById":42282,"CreatedDateTime":"2014-06-20T18:03:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Daishi\u0022 data-cite=\u0022Daishi\u0022\u003E\u003Cdiv\u003EBizarre, and it doesn\u0027t do it with other large KAS enabled parts? I think the best bet is to PM a modlist and probably game logs to Paul. There is only so much I can do without my computer, sorry. I suspect its probably another mod related to joints and attachment (joint reinforcement?), or maybe KAS itself causing you strife. Never heard of this bug before :/\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERemoving the regular KAS box also causes the phenomenon.\u003C/p\u003E\u003Cp\u003E-Duxwing\u003C/p\u003E\n"},{"CreatedByName":"Daishi","CreatedById":85055,"CreatedDateTime":"2014-06-21T00:40:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022vardicd\u0022 data-cite=\u0022vardicd\u0022\u003E\u003Cdiv\u003EI would love to know what program you use to make the textures for KSP? I\u0027ve gotten pretty good and writing and editing code for part files, but I\u0027d love to start making my own models and textures, and would love to hear what you use.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECool! Its a big learning curve (I still screw up pretty badly) - but the only way to learn is through mistakes \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E I use Maya for modelling, then put the model in Zbrush for UV unwrapping. Doing it this way separates the normally linear workflow of UV unwrapping before texturing; so i can texture the whole thing in 3D and come back and tweak the UVs afterwards if i\u0027ve mucked something up before exporting the maps. These exported maps go back into Maya, and i just tinker in photoshop until they\u0027re right. Then Unity and KSP. \u003C/p\u003E\u003Cp\u003EMaya is extremely expensive (I need to learn Blender before my trial runs out) and Zbrush is unintuitive and intimidating (and full of bugs), so I don\u0027t think my workflow is for everyone. Blender is free and would provide exactly the same functionality Maya does, and Photoshop has GIMP, but Zbrush is the tricky one. It doesn\u0027t really have any cheap\\free alternatives, so you might have to throw in a dedicated UV unwrapping program into the mix, and do all the texturework in GIMP. \u003Ca href=\u0022https://www.uvlayout.com/\u0022 rel=\u0022external nofollow\u0022\u003EHeadus \u003C/a\u003Eis probably the best bet for that. \u003C/p\u003E\u003Cp\u003EFeel free to flick me a PM if you\u0027re having trouble, just keep in mind there is only so much I can do without my PC, and US will take top priority once I get it back. I was a tutor once at university, if that counts for anything \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Duxwing\u0022 data-cite=\u0022Duxwing\u0022\u003E\u003Cdiv\u003ERemoving the regular KAS box also causes the phenomenon.\u003Cp\u003E-Duxwing\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAh, might be KAS then. Try removing our mod completely and see if it persists. If it does, hit up Majiir or the other devs on the KAS thread about the bug.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-21T00:43:26Z\u0022 title=\u002206/21/2014 12:43  AM\u0022 data-short=\u002210 yr\u0022\u003EJune 21, 2014\u003C/time\u003E by Daishi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SergeantBlueforce","CreatedById":73432,"CreatedDateTime":"2014-06-21T07:50:28Z","Content":"\n\u003Cp\u003EI have a question regarding the resources added by this plugin.\u003C/p\u003E\u003Cp\u003EAre they for a life support plugin, or are they something entirely for this plugin?\u003C/p\u003E\n"},{"CreatedByName":"Paul Kingtiger","CreatedById":57455,"CreatedDateTime":"2014-06-21T10:56:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Daishi\u0022 data-cite=\u0022Daishi\u0022\u003E\u003Cdiv\u003E...so you might have to throw in a dedicated UV unwrapping program into the mix...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou can unwrap in blender, but I\u0027ve no idea how the functionality compares to other packages. It takes a bit of time and effort to do well, but I guess this is true of any system.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SergeantBlueforce\u0022 data-cite=\u0022SergeantBlueforce\u0022\u003E\u003Cdiv\u003EI have a question regarding the resources added by this plugin.\u003Cp\u003EAre they for a life support plugin, or are they something entirely for this plugin?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you\u0027re just using the core pack then the resources are just for Universal Storage. If you download one of the life support mods then the resources will also be used for that mod.\u003C/p\u003E\n"},{"CreatedByName":"Duxwing","CreatedById":42282,"CreatedDateTime":"2014-06-21T18:15:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Daishi\u0022 data-cite=\u0022Daishi\u0022\u003E\u003Cdiv\u003EAh, might be KAS then. Try removing our mod completely and see if it persists. If it does, hit up Majiir or the other devs on the KAS thread about the bug.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E-Duxwing\u003C/p\u003E\n"},{"CreatedByName":"Rayder","CreatedById":95226,"CreatedDateTime":"2014-06-22T06:18:34Z","Content":"\n\u003Cp\u003EI\u0027ve noticed a few times that tank capacity, consumption etc have all been referenced as Litres. Wouldn\u0027t it be more appropriate to use grams and kilograms? Liters is a measurement of volume, which would indicate the tank\u0027s physical size.\u003C/p\u003E\u003Cp\u003EReason I say this is because when dealing with water, you can\u0027t really compress the water in a tank. So the size of the tank pretty much determines how much water you can store in it. Food is in the same boat here, but for different reasons (obviously). The same is not true for Oxygen, however.\u003C/p\u003E\u003Cp\u003EYou can have the same volume tank, and increase the pressure to store a higher quantity of gas. This is also true for the other gases in Life Support (H2, CO2 and CH4). The other reason is that to properly calculate the conversion rates in the Electrolyser, Sabatier and Purifier you need to use the resource\u0027s mass.\u003C/p\u003E\u003Cp\u003ETake for example, a 1 Liter tank. At 14.69 psi and 0Ã‚Â°C you can store 1.3g of oxygen. Take the same tank, but pressurize it up to 300psi at 0Ã‚Â°C and you can now store 29.1g of Oxygen. The same tank filled with water will always hold 1 Liter.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-22T06:30:37Z\u0022 title=\u002206/22/2014 06:30  AM\u0022 data-short=\u002210 yr\u0022\u003EJune 22, 2014\u003C/time\u003E by Rayder\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"OOZ662","CreatedById":34196,"CreatedDateTime":"2014-06-22T07:07:20Z","Content":"\n\u003Cp\u003EIf you have a look at the dev\u0027s blog, you\u0027ll see that the system is balanced to put realistic masses into the volume of the tanks at realistic pressures.\u003C/p\u003E\n"},{"CreatedByName":"RedAV8R","CreatedById":94171,"CreatedDateTime":"2014-06-22T11:38:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rayder\u0022 data-cite=\u0022Rayder\u0022\u003E\u003Cdiv\u003EI\u0027ve noticed a few times that tank capacity, consumption etc have all been referenced as Litres. Wouldn\u0027t it be more appropriate to use grams and kilograms? Liters is a measurement of volume, which would indicate the tank\u0027s physical size.\u003Cp\u003EReason I say this is because when dealing with water, you can\u0027t really compress the water in a tank. So the size of the tank pretty much determines how much water you can store in it. Food is in the same boat here, but for different reasons (obviously). The same is not true for Oxygen, however.\u003C/p\u003E\u003Cp\u003EYou can have the same volume tank, and increase the pressure to store a higher quantity of gas. This is also true for the other gases in Life Support (H2, CO2 and CH4). The other reason is that to properly calculate the conversion rates in the Electrolyser, Sabatier and Purifier you need to use the resource\u0027s mass.\u003C/p\u003E\u003Cp\u003ETake for example, a 1 Liter tank. At 14.69 psi and 0Ã‚Â°C you can store 1.3g of oxygen. Take the same tank, but pressurize it up to 300psi at 0Ã‚Â°C and you can now store 29.1g of Oxygen. The same tank filled with water will always hold 1 Liter.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell see, no. Stock KSP gives resources a density which basically makes 1unit = 5L, kind of an odd ratio, RealFuels changes that to 1unit = 1L. RealFuels also has a built in feature that essentially models pressurization. Say having a 10L tank, but pressurized to 3600psi, would mount to having about 245L all squeezed into 1L. So there is a variable that one would set to 245, and bam, that 10L tank, can handle 2450L of a resource. If I\u0027m not mistake US without RealFuels actually also makes resources based on a 1unit = 1L density, just doesn\u0027t model pressurization...\u003C/p\u003E\n"},{"CreatedByName":"OOZ662","CreatedById":34196,"CreatedDateTime":"2014-06-22T11:43:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RedAV8R\u0022 data-cite=\u0022RedAV8R\u0022\u003E\u003Cdiv\u003EIf I\u0027m not mistake US without RealFuels actually also makes resources based on a 1unit = 1L density, just doesn\u0027t model pressurization...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.kingtiger.co.uk/kingtiger/wordpress/2014/03/01/mod-resource-capacities/\u0022 rel=\u0022external nofollow\u0022\u003EHere\u0027s\u003C/a\u003E the details...\u003C/p\u003E\n"},{"CreatedByName":"Paul Kingtiger","CreatedById":57455,"CreatedDateTime":"2014-06-22T12:07:58Z","Content":"\n\u003Cp\u003EThe figures in that dev blog are a little out of date as they use pressurized gas (based on real world medical storage and Welding supplies). US currently used liquefied gasses so the capacity is much higher. For example, O2 can be liquefied down to store 798 times as much as a gas at STP rather than 85 times as a compressed gas.\u003C/p\u003E\u003Cp\u003EBut the mechanics in the dev blog are sound, US does take into account storing gases compressed in a liquid state. That\u0027s why the O2 block stores 46 thousand liters and the identical water block holds 57.\u003C/p\u003E\u003Cp\u003EOne of my tasks in the next couple of weeks to to public all my research so that other people can use and review my numbers.\u003C/p\u003E\n"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2014-06-23T04:49:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rayder\u0022 data-cite=\u0022Rayder\u0022\u003E\u003Cdiv\u003EI\u0027ve noticed a few times that tank capacity, consumption etc have all been referenced as Litres. Wouldn\u0027t it be more appropriate to use grams and kilograms? Liters is a measurement of volume, which would indicate the tank\u0027s physical size.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027ve been given some. good information as answers but I\u0027d like to expand on RedAV8R\u0027s answer just a bit.\u003C/p\u003E\u003Cp\u003EYou cant know what a tank\u0027s capacity is by mass alone, you HAVE to know both volume and density for exactly the reasons you cited, especially with mods like Modular Fuels. How can a tank\u0027s maximum capacity be described using mass alone when that same tank can be configured for liquid water, liquid (H2, O2, CH4, etc), compressed/non-compressed gaseous (O2, CO2, etc)?\u003C/p\u003E\u003Cp\u003EAnd sometimes you have to start with volume because you\u0027re looking at some parts pack storage tank and you have to work out its storage by starting with its physical dimensions and you end up with volume. Then let the game code (both stock and modded) worry about mass when and where it needs to. (and in the case of Modular Fuels, both volume and mass are reported to you)\u003C/p\u003E\n"},{"CreatedByName":"TurielD","CreatedById":57290,"CreatedDateTime":"2014-06-24T16:10:07Z","Content":"\n\u003Cp\u003ESpacedInvader for what it\u0027s worth I really like the 1 unit = 1 day from TACLS, and have so far adapted the EVA-X and a few other parts to use this system just like Rayder. I know it does have some issues with low usage amounts, though it seems to be fine when the ship isn\u0027t the focus. I\u0027d suggest just giving it a try with that for now and if the usage rates don\u0027t seem to be working right then you\u0027ll know.\u003C/p\u003E\u003Cp\u003EI would very much appreciate TAC components \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAside from that, a person niggle: Why is the Octocore so very heavy? 10x as much as the quadcore, but with only 2x the functionality? I\u0027d say 0.2 would be reasonable, surely? Same goes for the safety decouplers.\u003C/p\u003E\n"},{"CreatedByName":"Paul Kingtiger","CreatedById":57455,"CreatedDateTime":"2014-06-24T16:38:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TurielD\u0022 data-cite=\u0022TurielD\u0022\u003E\u003Cdiv\u003EAside from that, a person niggle: Why is the Octocore so very heavy? 10x as much as the quadcore, but with only 2x the functionality? I\u0027d say 0.2 would be reasonable, surely? Same goes for the safety decouplers.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s much bigger than the quad decoupler and stronger to form part of the larger stack. If anything the Quadcore is a little light and I\u0027ll probably push it up a bit closer to 1.0 release.\u003C/p\u003E\n"}]}