{"TopicId":68170,"ForumId":34,"TopicTitle":"[0.24.x] Stock ReBalance v1.4 | 11/09/14","CreatedByName":"stupid_chris","CreatedById":62017,"CreatedDateTime":"2014-04-05T05:44:06Z","PageNum":2,"Articles":[{"CreatedByName":"Quiana","CreatedById":107476,"CreatedDateTime":"2014-04-06T01:20:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CaptRobau\u0022 data-cite=\u0022CaptRobau\u0022\u003E\u003Cdiv\u003EStupid_chris, I was working on a similar rebalance mod. You\u0027ve already got all the engines down, but maybe you can find some use for some of the other ideas that I had. Everything with an * already has ModuleManager .cfgs that I can send over (just PM me). Anyway here are some tweaks that would help balance the game and make give use to parts that previously didn\u0027t have any:\u003Cp\u003E*SNIP GREAT IDEAS* \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m in agreement here with these. He brings up very valid points, along with mentioning the comms dishes. Right now there\u0027s really no reason (stock wise) to use anything but the one. I was formerly using RT2, but since it\u0027s currently busted until .24, I\u0027m out on that front. I also noticed a mod resurfaced called \u0022AntennaRange\u0022 which has some similar ideas, by streamlining that dishes have an effective range where their efficiency is much higher. They\u0027re also balanced out in power use/speed, so the large dish makes great work of anything in the solar system, whereas the Omni comms would be effective around kerbin/mun/minimus. Something to consider perhaps.\u003C/p\u003E\u003Cp\u003EOn the RTG front though, we\u0027d have some fun balancing. As it is, the RTG itself is a fairly poor power source stock-wise to begin with. We really need a new stock part (who knows what Squad plans for that) that is not a panel in reality. Solar panel balancing would at least make RTGs get used more and fuel creative ways to reduce power consumption instead of just slapping on everything electrical and a few panels and calling it a day.\u003C/p\u003E\n"},{"CreatedByName":"technogeeky","CreatedById":107155,"CreatedDateTime":"2014-04-06T01:55:25Z","Content":"\n\u003Cp\u003EThere is something which is tweak-decision-agnostic which may help your cause... Add one or two more pictures showing the engine chart *after* you have made your tweaks (instead of just before). If you can make it clear what transform you did on the unbalanced points in the new chart, that would be even better.\u003C/p\u003E\u003Cp\u003EThis way, we can see at a glance that you are regularizing the engines (or not). We do not have to take your word for it with the existing unbalanced charts (we can see the data) but we have to take your word for the balanced configuration.\u003C/p\u003E\n"},{"CreatedByName":"stupid_chris","CreatedById":62017,"CreatedDateTime":"2014-04-06T01:58:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022technogeeky\u0022 data-cite=\u0022technogeeky\u0022\u003E\u003Cdiv\u003EThere is something which is tweak-decision-agnostic which may help your cause... Add one or two more pictures showing the engine chart *after* you have made your tweaks (instead of just before). If you can make it clear what transform you did on the unbalanced points in the new chart, that would be even better.\u003Cp\u003EThis way, we can see at a glance that you are regularizing the engines (or not). We do not have to take your word for it with the existing unbalanced charts (we can see the data) but we have to take your word for the balanced configuration.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPretty sure I already have this\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/WmNB4D9.jpg\u0022 alt=\u0022WmNB4D9.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"stupid_chris","CreatedById":62017,"CreatedDateTime":"2014-04-06T03:15:37Z","Content":"\n\u003Cp\u003EAlright, made a few small updates to the tweaks, which I think fit better as a general matter.\u003C/p\u003E\u003Cp\u003EChangelog:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003EApril 6th 2014\u003Cbr\u003Ev1.1\u003Cbr\u003E-Minor engine rebalance thorough\u003Cbr\u003E-Mainsail is now a \u0022super skipper\u0022, meaning it\u0027s thrust has been lowered a little, but ISP upped a bit\u003Cbr\u003E-Shielded dockingport now has 0.1 of drag\u003Cbr\u003E-Cupola has 0.2 of drag\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ESo now for the verbose changes:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EThe LFB has been tweaked from 6t, 1600kN, and 290-345 ISP to 6.5t, 1800kN, and 270-335 ISP.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe KR-2L has been tweaked from 9.5t, 1800kn, and 250 - 365 ISP to 9.75t, 200kN, and 250-360 ISP.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe SLS Quad has been tweaked from 10t, 3250kN, and 260-335 ISP to 13t, 4000kN, and 260-325 ISP.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe Mainsail has been tweaked from 6t, 1500kN, 280-330 ISP to 5.5t, 1250kNm and 285-340 ISP. It\u0027s basically now a \u0022super skipper\u0022.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe Mk. 55 has been brought back to 0.9t, it\u0027s thrust left at 150kN, and it\u0027s ISP went from 310-370 to 310-360.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe 24-77/48-7S\u0027s has been brought down from 290-350 to 290-340\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe LV-1/LV-1R\u0027s ISP has been changed from 250-380 to 280-350\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe shielded dockingport\u0027s drag has been lowered from 0.25 to 0.1\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe cupola\u0027s drag has been lowered from 0.4 to 0.2\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThis should be good for now, I\u0027ll speak to CaptRobau for more tweaks \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Woopert","CreatedById":84274,"CreatedDateTime":"2014-04-06T03:35:14Z","Content":"\n\u003Cp\u003EFantastic job on this! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Arrowmaster","CreatedById":57556,"CreatedDateTime":"2014-04-06T04:37:13Z","Content":"\n\u003Cp\u003EThis project and \u003Ca href=\u0022http://kerbalspaceprogram.com/httpkerbalspaceportcomfixed-nodes/\u0022 rel=\u0022external nofollow\u0022\u003EOCD Fixes Pack\u003C/a\u003E want to make different changes to rebalance the same parts. I like your changes better though and the other project doesn\u0027t seem to have a forum thread. Would you consider merging the non conflicting changes into this project?\u003C/p\u003E\n"},{"CreatedByName":"Armchair Rocket Scientist","CreatedById":76165,"CreatedDateTime":"2014-04-06T07:11:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022stupid_chris\u0022 data-cite=\u0022stupid_chris\u0022\u003E\u003Cdiv\u003E[*]The cupola has been weighed down to 3.5t (it\u0027s still a lot of glass panels), and it\u0027s drag has been lowered to 0.2\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EStill seems a bit big:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Cupola_%28ISS_module%29\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Cupola_%28ISS_module%29\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe real Cupola is only 1.88 tons. It appears to be a tiny bit bigger than KSP\u0027s cupola (2.95 m vs. 2.5 m), but it doesn\u0027t have reaction wheels, a hatch, or life support equipment like ours.\u003C/p\u003E\u003Cp\u003EPerhaps an intermediate value of 2.5 tons? Or take away its monoprop and reaction wheels and reduce the mass even further to 1.5-2 tons?\u003C/p\u003E\u003Cp\u003EI don\u0027t think it would really affect balance much; even with those mass reductions, the Cupola is heavy enough that its main uses would be on rovers (which often don\u0027t need reaction wheels or RCS), and stations (which most likely have other modules to provide attitude control)... which is the point of it anyway.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-04-06T07:24:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Armchair Rocket Scientist\u0022 data-cite=\u0022Armchair Rocket Scientist\u0022\u003E\u003Cdiv\u003EStill seems a bit big:\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Cupola_%28ISS_module%29\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Cupola_%28ISS_module%29\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe real Cupola is only 1.88 tons. It appears to be a tiny bit bigger than KSP\u0027s cupola (2.95 m vs. 2.5 m), but it doesn\u0027t have reaction wheels, a hatch, or life support equipment like ours.\u003C/p\u003E\u003Cp\u003EPerhaps an intermediate value of 2.5 tons? Or take away its monoprop and reaction wheels and reduce the mass even further to 1.5-2 tons?\u003C/p\u003E\u003Cp\u003EI don\u0027t think it would really affect balance much; even with those mass reductions, the Cupola is heavy enough that its main uses would be on rovers (which often don\u0027t need reaction wheels or RCS), and stations (which most likely have other modules to provide attitude control)... which is the point of it anyway.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt being lighter is actually more in line with reality; a polling of command pods on Wikipedia (Orion, Apollo, Soyuz return capsule) gives masses between 2.5 and 8 tons, with Apollo being a bit more than 5. With the 3 Kerbal pod being some 3.5 tons, it\u0027s pretty fair to say 2.5~3 tons is quite heavy enough. 2.5 would be more than reasonable IMO, even with all the additions (which I don\u0027t think should be removed).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-06T07:27:22Z\u0022 title=\u002204/06/2014 07:27  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 6, 2014\u003C/time\u003E by regex\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2014-04-07T12:27:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Arrowmaster\u0022 data-cite=\u0022Arrowmaster\u0022\u003E\u003Cdiv\u003EThis project and \u003Ca href=\u0022http://kerbalspaceprogram.com/httpkerbalspaceportcomfixed-nodes/\u0022 rel=\u0022external nofollow\u0022\u003EOCD Fixes Pack\u003C/a\u003E want to make different changes to rebalance the same parts. I like your changes better though and the other project doesn\u0027t seem to have a forum thread. Would you consider merging the non conflicting changes into this project?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo long as not both of the mods use the :Final tag in their config declarations, ModuleManager will merge non-conflicting changes automatically. That is, it will load first one, then the other; if one is declared :Final it will be guaranteed to be loaded last. If both are, then stuff will probably break. Of course, as a downloadable resource, the most sane approach would be for neither of them to use the :Final tag at all, because that\u0027s generally meant for manual player\u0027s tweaks.\u003C/p\u003E\u003Cp\u003EObviously this means that while non-conflicting things will be merged, conflicts will be overwritten. In other words, two changes of thrust on the same engine will only result in the one that loads last to persist. Additional conflict potential comes from the ModuleManager syntax, which lets you get away with doing the same thing in different ways. How two config files that use different styles merge is anyone\u0027s guess...\u003C/p\u003E\n"},{"CreatedByName":"maccollo","CreatedById":72759,"CreatedDateTime":"2014-04-07T15:36:32Z","Content":"\n\u003Cp\u003EI would have increased the total thrust of the quad to 5000. Then it can just barely lift with this much on top of it, which feels a bit better, especially when I begin to stack cores sideways. Also the upper stage to lower stage size ratio feels a bit more appropriate.\u003C/p\u003E\u003Cp\u003EBut maybe the proportions become to unlike the SLS.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/22015656/5000Kn.jpg\u0022 alt=\u00225000Kn.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-07T15:43:19Z\u0022 title=\u002204/07/2014 03:43  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 7, 2014\u003C/time\u003E by maccollo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ruedii","CreatedById":57704,"CreatedDateTime":"2014-04-07T19:19:18Z","Content":"\n\u003Cp\u003ECould you try doing a 3D plot of thrust, weight/mass and ISP? \u003C/p\u003E\u003Cp\u003EAlso make sure to place both ASL and Vacuum ISP.\u003C/p\u003E\u003Cp\u003EThis would give a clearer picture.\u003C/p\u003E\u003Cp\u003EAdditionally, ones that have clear advantages and/or disadvantage should have that noted. For instance, ones that cannot be place as a second stage, or the case of the RAPIER which can substitute air for oxygen.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-07T19:23:51Z\u0022 title=\u002204/07/2014 07:23  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 7, 2014\u003C/time\u003E by Ruedii\u003C/strong\u003E\n\u003Cbr\u003EMore details.\n\u003C/span\u003E\n"},{"CreatedByName":"m4v","CreatedById":67965,"CreatedDateTime":"2014-04-07T21:40:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022curiousepic\u0022 data-cite=\u0022curiousepic\u0022\u003E\u003Cdiv\u003EGreat stuff - I think all reaction wheels should be reduced in power to be more in line with real life.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI second this, but not because of IRL, because as they are now they outclass RCS for attitude control.\u003C/p\u003E\u003Cp\u003EWith reaction wheels, you splat one anywhere into whatever ship you have and presto, 20kNm of torque in all 3 axes, with unlimited fuel to boot. Getting the same with RCS is impossible, in a 2.5m lander with 4 RCS you will get 5kNm of torque, 10kNm if you add 8 RCS, so you have twice the mass of a reaction wheel but half its torque, without counting the monoprop mass. Reaction wheels not only outclass RCS, their magnitudes are overkill, specially of the 1.25m variety, with 20kNm if you rotate longitudinally you hit the angular cap almost instantly.\u003C/p\u003E\u003Cp\u003EEver since the reaction wheels got buffed, I haven\u0027t used RCS in anything that doesn\u0027t have to dock. RCS requires thoughtful placement and fuel that you have to carry, my opinion is that they should have more utility than just during the occasions you have to dock.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-07T21:45:01Z\u0022 title=\u002204/07/2014 09:45  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 7, 2014\u003C/time\u003E by m4v\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"stupid_chris","CreatedById":62017,"CreatedDateTime":"2014-04-07T22:13:16Z","Content":"\n\u003Cp\u003EAlright, pretty massive update incoming, changelog below:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003EApril 7th 2014\u003Cbr\u003Ev1.2\u003Cbr\u003E-Node fixes to all spaceplane parts\u003Cbr\u003E-Solar panels curve now obay an inverse square law\u003Cbr\u003E-Mass rebalance on some parts\u003Cbr\u003E-Adapters, all nose cones, as well as some structural parts now contain fuel\u003Cbr\u003E-Unification of alternator charging rate on all engines\u003Cbr\u003E-Unification of reaction wheel electric charge consumption on all pods/probes\u003Cbr\u003E-Probes rebalanced to differentiate on stats\u003Cbr\u003E-Antennas rebalanced on transmission speed/cost\u003Cbr\u003E-All parts that have no physical significance now have a mass of zero to appear as such in the VAB\u003Cbr\u003E-The hydraulic structural pylon now uses ModuleDecouple\u003Cbr\u003E-Node size fixes on parts that needed it\u003Cbr\u003E-Clampotron Jr. rescaled to fit better on pod and 0.625m parts\u003Cbr\u003E-1.25m nose cone rescaled to fit better on 1.25m parts\u003Cbr\u003E-Normal sized rover wheels rebalanced in size/electricity consumption\u003Cbr\u003E-Typos fixed\u003Cbr\u003E-Fuel gauge now appears on LV-1 and Ion engine\u003Cbr\u003E-Other various fixes\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EAnd now the complete list of changes. Even some that were already there might have been updated, so read through it all to see what\u0027s new, but a lot of the stuff is brand new.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EThe NASA LFB now has a mass of 6.5t (10.5t with the tank) a thrust of 1800kN and an ISP of 270-335, as well as an alternator\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe KR-2L now has a mas of 9.75t, a thrust of 2000kN, and an ISP of 250-360\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe SLS quad engine now has a mass of 13t, a thrust of 4000kN and an ISP 0f 260-325\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe LES now has a decoupler\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAll nose cones, most adapters, and some other structural parts now contain fuel.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe SAS units have been rebalanced so that the old SAS part is the lightest and \u0022weakest\u0022 reaction wheel, and that the 2.5m unit is the heaviest and most performant. The old 1.25m ASAS sits between both.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe cupola has been weighed down to 3t (it\u0027s still a lot of glass panels), and it\u0027s drag has been lowered to 0.2\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe Poodle has been rebalanced: mass of 1.75t, thrust of 160kN, ISP of 270-410. Higher ISP, lower TWR, but much lower engine mass fraction.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe 48-7S now has a mass of 0.15t and an ISP of 290-340\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe 24-77 now has a mass of 0.1t and an ISP of 290-340\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe LV-1 and LV-1R now have an ISP of 280-350\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe Mk. 55 radial engine now has a thrust of 150kN, and an ISP of 310-370. Basically it\u0027s an all-around engine that can both help lifting stuff from the ground, or tow things around in orbit, and now has an alternator.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe LV-1 and Ion engine now show the \u0022fuel gauge\u0022.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ER.A.P.I.E.R. was given an alternator.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe shielded docking port\u0027s drag has been reduced to 0.1\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAll alternator output has been unified to 0.008EC/kN (12EC/s at 1500kN)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAll probe/pod reaction wheel EC consumption has been normalized to 0.1EC/torque\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAll SAS units reaction wheel EC consumption has been normalized to 0.01EC/torque\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EElectric charge and mass thorought the probe cores has been unified to have some sort of progression\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe rover body is now a probe core, it\u0027s EC capacity has been bumped to 500, and it has a very weak reaction wheel\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EMonpropellant amount bumped in the two lander cans\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EMass of the Mk2 lander can reduced to 1.25t\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EEC within lander cans reduced, and augmented into normal pods\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EMass of the Mk1 cockpit reduced to 1t to match the Mk2 cockpit\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E1.25m nose cone rescaled to fit onto 1.25m tanks (and not the pod)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EClampotron Jr. rescaled to fit better on the Mk1 pod (still looks good on 0.625m tanks)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EImportant parts with no physical significance now have it back and have a sensible mass (looking at you Z-100 battery)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EMass rebalance on some various structural parts\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAll parts with no physical significance now hav a mass of zero to show correct CoM in the editor (ladders, landing gear, lights, struts, etc)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ESolar panels charge curve rebalance to give an inverse sqaure law (-\u0026gt; CaptRobau)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EOX solar panels (no case) cannot be retracted anymore (-\u0026gt; CaptRobau)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ERuggedized wheel and inflated wheel have rebalanced mass/EC consumption to have different niches (-\u0026gt; CaptRobau)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAntennas transmission speed/cost/mass rebalanced to have some form of progression (-\u0026gt; CaptRobau)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EParachutes all have a deployment sound (only the Mk16 had one)(at least for those who aren\u0027t using RealChute \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EMicronode/station hub have symmetry enabled (-\u0026gt; CaptRobau)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe weird hydraulic structural pylon now uses the decoupler module and has a staging icon that isn\u0027t blank\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ENode fixes and CoM rebalancement on all plane parts (-\u0026gt; CaptRobau)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe materials bay\u0027s radial attach node is now at the back of it, not on the side\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ETypos on aerodynamics parts fixed (-\u0026gt; CaptRobau)\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ETo those talking about the reaction wheels: PM me with some proposed changes and I\u0027ll see about it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"mdapol","CreatedById":98306,"CreatedDateTime":"2014-04-07T23:09:16Z","Content":"\n\u003Cp\u003EJust curious if you\u0027re taking part cost and Tech Required in your rebalancing. Since money will soon become important in 0.24, cost will start to be a factor in choosing one part over another. Also, I can see that two similar parts, say Reaction Wheels, might have the same torque yet one is lighter than the other. The reason: the lighter one is available at a higher tech node so it\u0027s more advanced. Tech Required should play some part of the balancing, at least for career mode. Anyway, just curious.\u003C/p\u003E\u003Cp\u003EEdit: BTW, great work. I plan to use this when I restart career mode in 0.24\u003C/p\u003E\n"},{"CreatedByName":"Arrowmaster","CreatedById":57556,"CreatedDateTime":"2014-04-07T23:31:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022stupid_chris\u0022 data-cite=\u0022stupid_chris\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E[*]OX solar panels (no case) cannot be retracted anymore (-\u0026gt; CaptRobau)\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDon\u0027t like this change. I\u0027m removing it locally. I think I\u0027ll remove the antenna changes too.\u003C/p\u003E\n"},{"CreatedByName":"stupid_chris","CreatedById":62017,"CreatedDateTime":"2014-04-07T23:32:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mdapol\u0022 data-cite=\u0022mdapol\u0022\u003E\u003Cdiv\u003EJust curious if you\u0027re taking part cost and Tech Required in your rebalancing. Since money will soon become important in 0.24, cost will start to be a factor in choosing one part over another. Also, I can see that two similar parts, say Reaction Wheels, might have the same torque yet one is lighter than the other. The reason: the lighter one is available at a higher tech node so it\u0027s more advanced. Tech Required should play some part of the balancing, at least for career mode. Anyway, just curious.\u003Cp\u003EEdit: BTW, great work. I plan to use this when I restart career mode in 0.24\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat is not my logic at all. I\u0027m not balancing so that some part become better than others. It\u0027s all about tradeoffs. The parts are balanced to all have their own utility. So at the end of the day, you don\u0027t pick up \u0022the best\u0022 part, you pick up the part that fits your needs the most. Each one has it\u0027s niche, it all depends on your preference. Do you want a stronger reaction wheel but that will eat more of your electricity, but you\u0027ll get to turn fast, or do you want to save electricity and have a small efficient reaction wheel, but take much longer to turn? Do you want a heavy, but efficient probe core, or a lighter one that will eat through your electricity much faster? It\u0027s what I\u0027d want the user to ask himself as he plays, not \u0022which part is the best\u0022. This way every part has it\u0027s use, and none gets left behind as the game proceeds.\u003C/p\u003E\u003Cp\u003ESo no, cost is not taken into account.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Arrowmaster\u0022 data-cite=\u0022Arrowmaster\u0022\u003E\u003Cdiv\u003EDon\u0027t like this change. I\u0027m removing it locally.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis was made to have some reason to use the covered solar panels, because as is, they\u0027re just heavier. So if you end up needing to go through an atmosphere at high speed, you\u0027ll use the retractable one that are heavier. It\u0027s a tradeoff. But it\u0027s to you to chose indeed \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Arrowmaster","CreatedById":57556,"CreatedDateTime":"2014-04-07T23:43:44Z","Content":"\n\u003Cp\u003EI already use the covered one for going through atmo and the noncovered for stuff thats protected in fairings. Not being able to retract them is too big of a change for me so its gone from my local copy. It would be better if there was a way to make them break in atmo if not sheilded no matter if they were deployed or not.\u003C/p\u003E\n"},{"CreatedByName":"stupid_chris","CreatedById":62017,"CreatedDateTime":"2014-04-07T23:51:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Arrowmaster\u0022 data-cite=\u0022Arrowmaster\u0022\u003E\u003Cdiv\u003EI already use the covered one for going through atmo and the noncovered for stuff thats protected in fairings. Not being able to retract them is too big of a change for me so its gone from my local copy. It would be better if there was a way to make them break in atmo if not sheilded no matter if they were deployed or not.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot without a new PartModule.\u003C/p\u003E\u003Cp\u003EI\u0027m not sure what it changes for you if you already use the covered ones for what goes back into the atmo then \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Comrade Jenkens","CreatedById":59544,"CreatedDateTime":"2014-04-08T01:09:58Z","Content":"\n\u003Cp\u003EAre you going to balance the SRBs at any point? Their stats are all over the place and they are so underpowered that there is never any reason to use them.\u003C/p\u003E\n"},{"CreatedByName":"Darkona","CreatedById":99172,"CreatedDateTime":"2014-04-08T01:48:12Z","Content":"\n\u003Cp\u003EChris I\u0027m here just to say thank you, those are really nice fixes/balances, and STOP BREAKING BOTTLES YOU EVIL-SOULLED FLIGHTLESS BIRD\u003C/p\u003E\n"},{"CreatedByName":"8749236","CreatedById":27470,"CreatedDateTime":"2014-04-08T01:52:43Z","Content":"\n\u003Cp\u003EI personally believe the complexity of the engine, tech limitation and etc are the best balance measure to the parts instead of tweaking them around =S..\u003C/p\u003E\n"},{"CreatedByName":"stupid_chris","CreatedById":62017,"CreatedDateTime":"2014-04-08T02:01:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Comrade Jenkens\u0022 data-cite=\u0022Comrade Jenkens\u0022\u003E\u003Cdiv\u003EAre you going to balance the SRBs at any point? Their stats are all over the place and they are so underpowered that there is never any reason to use them.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027d like to. I don\u0027t know enough about SRBs in a general matter right now to do it.\u003C/p\u003E\u003Cp\u003EBut there is a reason to do it, don\u0027t go away believing they\u0027re useless right now. SRBs are just big TWR boosters. Nearly got the dV you need to get to orbit but not enough TWR? Slap some SRBs on that big boy. They won\u0027t give you much extra dV, but they\u0027ll boost your TWR while your main core lightens up, and when they\u0027re ready to go, the core can do the rest alone \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs far as I know this is, and should be, their only use.\u003C/p\u003E\u003Cp\u003EBut I\u0027m open to balancing them, I don\u0027t know how good/bad they are right now at doing that.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Darkona\u0022 data-cite=\u0022Darkona\u0022\u003E\u003Cdiv\u003EChris I\u0027m here just to say thank you, those are really nice fixes/balances, and STOP BREAKING BOTTLES YOU EVIL-SOULLED FLIGHTLESS BIRD\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell no problem.\u003C/p\u003E\u003Cp\u003EAnd nah. Eheheh.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00228749236\u0022 data-cite=\u00228749236\u0022\u003E\u003Cdiv\u003EI personally believe the complexity of the engine, tech limitation and etc are the best balance measure to the parts instead of tweaking them around =S..\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell we have differing opinions then \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E I think parts should be balanced to each have their own role, not to deprecate each other as you go along. This way you encourage creativity and diversity, and you don\u0027t end up with always the same obvious choices when it comes to creating a launcher. You actually have to think what would fit the best, and by creating different combinations, you can have different types of craft, but that are not awfully better or worse than each other.\u003C/p\u003E\n"},{"CreatedByName":"Hyomoto","CreatedById":64780,"CreatedDateTime":"2014-04-08T02:55:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Comrade Jenkens\u0022 data-cite=\u0022Comrade Jenkens\u0022\u003E\u003Cdiv\u003EAre you going to balance the SRBs at any point? Their stats are all over the place and they are so underpowered that there is never any reason to use them.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWoah, what? What? What? I\u0027m sure they could have some tweaks done, but I use SRB\u0027s all the time. In fact, I\u0027ve started trying to make ships that are mostly SRB\u0027s because they are the cheapest, lightest parts you can use for lift-off! This is my latest Minmus transport vessel. You can land on Minmus and return to Kerbin with half a tank on a \u003Cem\u003Ebad\u003C/em\u003E trip. A talented pilot could probably land on the Mun as well. Go on, build me an equivalent liquid rocket. Let\u0027s see how it compares in weight, cost and part counts.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i109.photobucket.com/albums/n48/Hyomoto/2014-04-07_00010_zps3beec5d2.jpg~original\u0022 alt=\u00222014-04-07_00010_zps3beec5d2.jpg~original\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-08T02:58:41Z\u0022 title=\u002204/08/2014 02:58  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 8, 2014\u003C/time\u003E by Hyomoto\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Black-Talon","CreatedById":57463,"CreatedDateTime":"2014-04-08T02:58:22Z","Content":"\n\u003Cp\u003EWell done Chris. Many times I\u0027ve tried to come up with my own rebalancing tweaks. From what I\u0027ve seen so far you\u0027ve done a good job of what I always strived for... not making it easier (I always errored on making it harder) to achieve, fixing little mistakes, diversifying the part options, and standardizing the available parts to at least make sense when compared to all the options to do the same task. I\u0027ve learned the hard way how hard it is to do, nice work.\u003C/p\u003E\u003Cp\u003EMy only suggestion (and I\u0027m saying this without having tried it yet), would be that you consider breaking up the updates into categories or type such that it\u0027s easier for someone to remove the type of changes they don\u0027t appreciate. Something like a separate config file which groups up all the changes of a particular type:\u003C/p\u003E\u003Cp\u003E1. Cosmetic - improves look\u003C/p\u003E\u003Cp\u003E2. Tweaks - changes functionality but arguably doesn\u0027t change game play\u003C/p\u003E\u003Cp\u003E3. Balance I - changes balance of parts (without exceeding limits of stock parts)\u003C/p\u003E\u003Cp\u003E - would mostly contain nerfs to out of balance parts\u003C/p\u003E\u003Cp\u003E4. Balance II - changes balance of parts to make sense but may exceed stock limits\u003C/p\u003E\u003Cp\u003E - increased mass but also increased ISP to values above any similar stock engine might go here\u003C/p\u003E\n"},{"CreatedByName":"stupid_chris","CreatedById":62017,"CreatedDateTime":"2014-04-08T03:19:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Black-Talon\u0022 data-cite=\u0022Black-Talon\u0022\u003E\u003Cdiv\u003EWell done Chris. Many times I\u0027ve tried to come up with my own rebalancing tweaks. From what I\u0027ve seen so far you\u0027ve done a good job of what I always strived for... not making it easier (I always errored on making it harder) to achieve, fixing little mistakes, diversifying the part options, and standardizing the available parts to at least make sense when compared to all the options to do the same task. I\u0027ve learned the hard way how hard it is to do, nice work.\u003Cp\u003EMy only suggestion (and I\u0027m saying this without having tried it yet), would be that you consider breaking up the updates into categories or type such that it\u0027s easier for someone to remove the type of changes they don\u0027t appreciate. Something like a separate config file which groups up all the changes of a particular type:\u003C/p\u003E\u003Cp\u003E1. Cosmetic - improves look\u003C/p\u003E\u003Cp\u003E2. Tweaks - changes functionality but arguably doesn\u0027t change game play\u003C/p\u003E\u003Cp\u003E3. Balance I - changes balance of parts (without exceeding limits of stock parts)\u003C/p\u003E\u003Cp\u003E - would mostly contain nerfs to out of balance parts\u003C/p\u003E\u003Cp\u003E4. Balance II - changes balance of parts to make sense but may exceed stock limits\u003C/p\u003E\u003Cp\u003E - increased mass but also increased ISP to values above any similar stock engine might go here\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell I have already layed down some division in the configs. As of right now, I think there is one config for the engine tweaks, one for the node tweaks, one for the typos, one for zeroing the mass of non physically significant parts, one for pods/probes, one for the elctrical parts (panels, wheels, etc), one for the adapters/nose cones, and one for, well, what\u0027s left \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E I\u0027m feeling this is good enough for now and will simplify the job of anyone wishing to do some personal tweaking, but I could try to rework the separation if it doesn\u0027t feel user friendly enough.\u003C/p\u003E\n"}]}