{"TopicId":69538,"ForumId":34,"TopicTitle":"[1.0.4] ScienceAlert 1.8.9: Experiment availability feedback (July 13)","CreatedByName":"xEvilReeperx","CreatedById":75857,"CreatedDateTime":"2014-04-16T14:27:43Z","PageNum":9,"Articles":[{"CreatedByName":"7H3LaughingMan","CreatedById":62550,"CreatedDateTime":"2014-08-11T06:01:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022xEvilReeperx\u0022 data-cite=\u0022xEvilReeperx\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAre they both the exact same icon (same quality, same style)? Do they both change states? It\u0027s possible that it\u0027s some issue with a new version of the toolbar. I\u0027ll check it out\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey are the exact same icon, both look exactly the same 100% and change to notify me of new science I can get and such. When I switch to use blizzy\u0027s toolbar it will make the icon I used disappear while the second one remains until I click on it at which point it disappears. I only see 1 icon when using blizzy\u0027s toolbar but I prefer using the stock toolbar since it looks a little bit better in my opinion.\u003C/p\u003E\n"},{"CreatedByName":"SorensonPA","CreatedById":59038,"CreatedDateTime":"2014-08-16T00:46:53Z","Content":"\n\u003Cp\u003EOh man, I discovered a bug in the most neat-ass way. Was sending a blimp-based whor-er, science lab to Duna and had the return stage mounted under it, and decided to snag an EVA report on the way down - except I had both passengers in the lab module and nobody in the lander can on the return vehicle and forgot about it. Lo and behold, after mashing the EVA button a few times someone finally came out - of the lander, while two other folks were in the lab. The first occupant of the science lab got cloned and punted out the lander can\u0027s hatch, and now it\u0027s Bob, Andrew and Anti-Andrew figuring out what to do.\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/AphxyjrH4SE?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"Climberfx","CreatedById":57126,"CreatedDateTime":"2014-08-16T22:32:12Z","Content":"\n\u003Cp\u003EAmazing Mod, installing right a way.\u003C/p\u003E\u003Cp\u003EThank you for your expertise and work!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"sjb217","CreatedById":81884,"CreatedDateTime":"2014-08-19T16:16:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022scerion\u0022 data-cite=\u0022scerion\u0022\u003E\u003Cdiv\u003EInteresting bug just happened... I copied my KSP save and mods directories from my home PC and brought them to my work PC. After loading up my save file and transferring to my ship via the Space Center, the ScienceAlert button does not show. \u003Cp\u003EI attempted to delete and re-install the mod. I even re-installed the game fresh, using a fresh download of the mod, but nothing gets it to show up. I haven\u0027t done anything different to the save other than to transfer it. I quite a few mods installed, but they did not conflict before. I edited Engineer to not use the stock toolbar (only mod I have that uses it) to see if that would get it to show, and still nothing.\u003C/p\u003E\u003Cp\u003EI launched a new ship on the current save, and the ScienceAlert button DID show. So this bug of it not showing only occurred when switching to my in-flight ship.\u003C/p\u003E\u003Cp\u003EI exited my save (without restarting the whole game), and started a new one, and the ScienceAlert button is where it should be.\u003C/p\u003E\u003Cp\u003EIf you need more info, please let me know what I can do.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m having similar problems too!\u003C/p\u003E\u003Cp\u003EIn fact, now I can\u0027t even see the ScienceAlert icon in the Toolbar\u0027s \u0022Configure Visible Buttons\u0022 list.\u003C/p\u003E\n"},{"CreatedByName":"Dadaurum","CreatedById":119481,"CreatedDateTime":"2014-08-22T15:26:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sjb217\u0022 data-cite=\u0022sjb217\u0022\u003E\u003Cdiv\u003EI\u0027m having similar problems too!\u003Cp\u003EIn fact, now I can\u0027t even see the ScienceAlert icon in the Toolbar\u0027s \u0022Configure Visible Buttons\u0022 list.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe mod seems be fantastic but I\u0027m having the same problem !\u003C/p\u003E\u003Cp\u003EI think it isn\u0027t even installed : I can\u0027t hear the bubbles when new science is available.\u003C/p\u003E\u003Cp\u003E[ Ksp 23.5 ; ScienceAlert 1.6 ]\u003C/p\u003E\n"},{"CreatedByName":"xEvilReeperx","CreatedById":75857,"CreatedDateTime":"2014-08-23T11:38:56Z","Content":"\n\u003Cp\u003EDo your other science experiments work normally? Usually when the button doesn\u0027t appear it\u0027s because something broke in initialization and it\u0027s almost always due to duplicate experimentids. I\u0027m writing in some checks against this in the next version that should let you know whenever this is the case\u003C/p\u003E\n"},{"CreatedByName":"HarrySeaword","CreatedById":119588,"CreatedDateTime":"2014-08-23T17:47:55Z","Content":"\n\u003Cp\u003ELooks like this has already been reported but it appears the evaReports are not working...The other ones still appear to work for me (mobileMaterialsLab, mysteryGoo, temperatureScan are the ones that worked this last time). That being said it looks like the sound notification stopped working...\u003C/p\u003E\u003Cp\u003EThis is for the x64 version with ScienceAlert 1.7.1, havn\u0027t tested it with the x86 one\u003C/p\u003E\u003Cp\u003Eif you need more info i\u0027ll be happy to help\u003C/p\u003E\u003Cp\u003EGreat mod when it works, thanks!!!\u003C/p\u003E\n"},{"CreatedByName":"FiiZzioN","CreatedById":108954,"CreatedDateTime":"2014-08-30T13:13:15Z","Content":"\n\u003Cp\u003EI seem to be having quite an odd issue. The toolbar icon shows / animates fine, but when I click it to show what type of science I can do, the very bottom of the bar \u002B science button flickers extremely fast. You can still click it, it\u0027s just visually jarring. Doesn\u0027t seem to matter if you have one option to click, or ten, it flickers, but just at the bottom of the menu along with the last option on the list.\u003C/p\u003E\u003Cp\u003EOne thing I noticed is when I move the camera around and the menu hits an area where clouds are present it starts flickering again. When I look away the flickering stops and then when my mouse is still the flickering proceeds to return. I\u0027ll try to get some pictures for you, it\u0027s just quite difficult to get a decent set of them. The last thing I should mention is this never happened when we had the 0.23.5 version. \u003C/p\u003E\u003Cp\u003ERegardless of flickering or not, this is still one of top five utility mods, flickering or not \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EKeep up the awesome work!\u003C/p\u003E\n"},{"CreatedByName":"xEvilReeperx","CreatedById":75857,"CreatedDateTime":"2014-08-30T21:00:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FiiZzioN\u0022 data-cite=\u0022FiiZzioN\u0022\u003E\u003Cdiv\u003EI seem to be having quite an odd issue. The toolbar icon shows / animates fine, but when I click it to show what type of science I can do, the very bottom of the bar \u002B science button flickers extremely fast. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is with Blizzy\u0027s toolbar right? I\u0027ve got that one on my list of bugs to exterminate. It\u0027ll be fixed in the next version \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"FiiZzioN","CreatedById":108954,"CreatedDateTime":"2014-08-31T03:19:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022xEvilReeperx\u0022 data-cite=\u0022xEvilReeperx\u0022\u003E\u003Cdiv\u003EThis is with Blizzy\u0027s toolbar right? I\u0027ve got that one on my list of bugs to exterminate. It\u0027ll be fixed in the next version \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYup, good to know that it\u0027s being fixed. Thanks, man!\u003C/p\u003E\n"},{"CreatedByName":"wildcardjoker","CreatedById":120123,"CreatedDateTime":"2014-09-01T11:49:34Z","Content":"\n\u003Cp\u003EThis is a great mod, and I love the fact that there is an option to kill the warp when new science is detected.\u003C/p\u003E\u003Cp\u003EI did notice a bug last night, though. Gravity scans which are already stored on the ship are triggering an alert. For instance, when travelling over Kerbin\u0027s shores, I will take a gravity scan, EVA and store it in the command pod. A few minutes later, I will be alerted that a gravity scan can be performed for the same biome. When I perform the scan, EVA and store, I am informed that the report is already stored in the pod. The only way I\u0027ve been able to stop this trigger is by keeping the scan in the gravioli detector.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-02T14:05:43Z\u0022 title=\u002209/02/2014 02:05  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 2, 2014\u003C/time\u003E by wildcardjoker\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"xEvilReeperx","CreatedById":75857,"CreatedDateTime":"2014-09-01T15:04:08Z","Content":"\n\u003Cp\u003EI\u0027ll check it out. What filter did you set for gravity scan? Do you have a lab on your vessel that you\u0027re using to reset the gravity scan, or modified cfg? \u003C/p\u003E\u003Cp\u003EI suspect you have the gravity scan filter set to something other than unresearched and that getting a second report (even though you can\u0027t store it in your command pod) is triggering an alert. ScienceAlert doesn\u0027t know that you\u0027re storing all the reports in a pod with a no duplicate restriction; all it knows is that you have x% of science for a particular subject (counting any science already gathered plus what you\u0027ll get for returning any science onboard), that percent is less than the filter %, you have an unused experiment of the right type available and that taking another report is worth at least whatever min threshold is set to\u003C/p\u003E\u003Cp\u003EYou can enable report values in the options to see what the next report is worth, or open the log (Alt\u002BF2) after the alert is triggered to see some details about why it was triggered. \u003C/p\u003E\u003Cp\u003EIf this is not the case, I\u0027d be very interested in seeing your logs. You\u0027ve got me thinking about adding some visual cue as a warning that you\u0027ll have to leave the data in the experiment to retrieve it if there\u0027s nowhere else on the vessel you could store it. The more I think about it, the more sense it makes\u003C/p\u003E\n"},{"CreatedByName":"wildcardjoker","CreatedById":120123,"CreatedDateTime":"2014-09-02T14:11:47Z","Content":"\n\u003Cp\u003EOK, I tried another mission tonight. While orbiting the Mun, I received an alert that a Gravity scan was available for the East Crater. I performed the scan, EVA\u0027d Jeb, and took the data from the detector. I re-boarded the ship and performed a warp, and the warp dropped back to 1x after a few seconds. An alert was generated for the East Crater again - I performed the scan, EVA\u0027d Jeb, and took the data again. When I re-boarded the command pod, KSP told me that the experiment could not be stored.\u003C/p\u003E\u003Cp\u003EAll filters were set to alert if an experiment was not maxed out, and warp kill was on for all experiments.\u003C/p\u003E\u003Cp\u003EI\u0027m afraid that it was only just now that I saw the suggestion to open the log and see the trigger details - I will try that again tomorrow.\u003C/p\u003E\n"},{"CreatedByName":"wildcardjoker","CreatedById":120123,"CreatedDateTime":"2014-09-03T12:21:12Z","Content":"\n\u003Cp\u003EI tried again tonight, and repeatedly receive gravity scan alerts. Here\u0027s the log entries:\u003C/p\u003E\u003Cp\u003EScienceAlert, Experiment gravityScan@MunInSpaceHighEastFarsideCrater just became available! Total potential science onboard currently: 0 (Cap is 66, threshold is NotMaxed, current sci is 0, expected next report value: 60)\u003C/p\u003E\u003Cp\u003E... wait a few seconds ...\u003C/p\u003E\u003Cp\u003EScienceAlert, Experiment gravityScan@MunInSpaceHighEastFarsideCrater just became available! Total potential science onboard currently: 60 (Cap is 66, threshold is NotMaxed, current sci is 0, expected next report value: 5.454544) - this scan cannot be stored on the command pod, as the previous scan is already stored.\u003C/p\u003E\n"},{"CreatedByName":"xEvilReeperx","CreatedById":75857,"CreatedDateTime":"2014-09-03T13:25:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022wildcardjoker\u0022 data-cite=\u0022wildcardjoker\u0022\u003E\u003Cdiv\u003EAll filters were set to alert if an experiment was not maxed out, and warp kill was on for all experiments.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s working as intended (for now), then. ScienceAlert doesn\u0027t know what you\u0027re doing with the reports. It only knows that you have configured it to alert you whenever a report would generate science points and that you have an open experiment to use.\u003C/p\u003E\u003Cp\u003EYou can see that taking a duplicate report would result in about 5.45 science. That you can\u0027t fit it into the command pod isn\u0027t taken into consideration at all\u003C/p\u003E\n"},{"CreatedByName":"wildcardjoker","CreatedById":120123,"CreatedDateTime":"2014-09-03T14:06:05Z","Content":"\n\u003Cp\u003EThat makes sense. It would be great if the experiments stored in the pod were taken into account.\u003C/p\u003E\u003Cp\u003EFor now, I will perform the experiment and leave it in there until another one is required. Thanks for looking into it!\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-09-03T18:58:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022wildcardjoker\u0022 data-cite=\u0022wildcardjoker\u0022\u003E\u003Cdiv\u003EThat makes sense. It would be great if the experiments stored in the pod were taken into account.\u003Cp\u003EFor now, I will perform the experiment and leave it in there until another one is required. Thanks for looking into it!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey are taken into account. If the mod didn\u0027t take them into account, it would have thought you\u0027d get 60 points for the report. It instead thought you\u0027d get 5.5 (about) for it. I bet if you actually took that report and went home to recover, you\u0027d get 65.5ish science from those two scans.\u003C/p\u003E\n"},{"CreatedByName":"wildcardjoker","CreatedById":120123,"CreatedDateTime":"2014-09-03T23:47:35Z","Content":"\n\u003Cp\u003EGotcha. thanks again!\u003C/p\u003E\n"},{"CreatedByName":"hab136","CreatedById":75997,"CreatedDateTime":"2014-09-13T09:57:33Z","Content":"\n\u003Cp\u003EGreat mod!\u003C/p\u003E\u003Cp\u003EI have a feature request. If I have a probe that can transmit but isn\u0027t going to return, then I only want to be alerted if there\u0027s something I can transmit. \u0022Not maxed\u0022 will still alert even when there\u0027s zero transmit value. I guess I want a \u0022Not maxed transmittable\u0022 option. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Hattivat","CreatedById":110255,"CreatedDateTime":"2014-09-16T19:20:16Z","Content":"\n\u003Cp\u003EJust wanted to say thank you for all the time I\u0027ve saved thanks to this supremely useful mod.\u003C/p\u003E\n"},{"CreatedByName":"xEvilReeperx","CreatedById":75857,"CreatedDateTime":"2014-09-17T07:23:51Z","Content":"\n\u003Cp\u003EYou\u0027re welcome! \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022hab136\u0022 data-cite=\u0022hab136\u0022\u003E\u003Cdiv\u003EI have a feature request. If I have a probe that can transmit but isn\u0027t going to return, then I only want to be alerted if there\u0027s something I can transmit. \u0022Not maxed\u0022 will still alert even when there\u0027s zero transmit value.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis\u0027ll be the in next version (barring any unforeseen difficulties). I needed to implement per-vessel settings to make this work the way I wanted, otherwise every time you flipped between ships you\u0027d have to change them and it could be annoying pretty fast\u003C/p\u003E\n"},{"CreatedByName":"TMS","CreatedById":57134,"CreatedDateTime":"2014-09-20T12:02:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00227H3LaughingMan\u0022 data-cite=\u00227H3LaughingMan\u0022\u003E\u003Cdiv\u003EThey are the exact same icon, both look exactly the same 100% and change to notify me of new science I can get and such. When I switch to use blizzy\u0027s toolbar it will make the icon I used disappear while the second one remains until I click on it at which point it disappears. I only see 1 icon when using blizzy\u0027s toolbar but I prefer using the stock toolbar since it looks a little bit better in my opinion.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAlso experiencing this. Using 32-bit version. System specs and mods in sig.\u003C/p\u003E\n"},{"CreatedByName":"xEvilReeperx","CreatedById":75857,"CreatedDateTime":"2014-09-20T22:29:21Z","Content":"\n\u003Cp\u003EIs it reproducable or only happens sometimes? Any exceptions in the log?\u003C/p\u003E\n"},{"CreatedByName":"smunisto","CreatedById":57789,"CreatedDateTime":"2014-10-03T13:03:36Z","Content":"\n\u003Cp\u003EScience alert seems to throw out some orange errors in the output_log.\u003C/p\u003E\u003Cp\u003EI am using the latest version of the mod \u002B a ton of other mods in KSP x64.\u003C/p\u003E\u003Cp\u003EHere\u0027s the output log:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/g78bn2vshyixs6t/output_log.txt?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/g78bn2vshyixs6t/output_log.txt?dl=0\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"xEvilReeperx","CreatedById":75857,"CreatedDateTime":"2014-10-03T14:25:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022smunisto\u0022 data-cite=\u0022smunisto\u0022\u003E\u003Cdiv\u003EScience alert seems to throw out some orange errors in the output_log\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIs this the right log? The only error related to ScienceAlert directly (that I see with a glance) is an exception involving a duplicate dictionary key which is fortunately harmless and fixed in the next version. Which portion in particular are you referring to?\u003C/p\u003E\n"}]}