{"TopicId":71656,"ForumId":34,"TopicTitle":"DarkMultiPlayer 0.3.8.0 [KSP 1.12.0]","CreatedByName":"godarklight","CreatedById":92588,"CreatedDateTime":"2014-05-07T13:17:56Z","PageNum":48,"Articles":[{"CreatedByName":"popos1","CreatedById":37258,"CreatedDateTime":"2015-01-25T13:30:27Z","Content":"\n\u003Cp\u003Eif there is such a function that is assigned to each rocket every player even when docked? (eg. when he is not on the server, I can not switch on his rocket)\u003C/p\u003E\n"},{"CreatedByName":"Xavienth","CreatedById":79116,"CreatedDateTime":"2015-01-26T01:28:03Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003EI\u0027ve skimmed through the bugs post and I may have found the thing I\u0027m looking for, but I\u0027m not sure.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003EBasically, my friend and I can\u0027t see each others\u0027 crafts.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003EJust want to know if there is an ETA on this fix, and when it is.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EEDIT: Nevermind, I figured out that it was because we were trying to see each other when we were inside the safety bubble.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-26T02:43:00Z\u0022 title=\u002201/26/2015 02:43  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 26, 2015\u003C/time\u003E by Xavienth\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Minorex","CreatedById":136679,"CreatedDateTime":"2015-01-26T09:35:34Z","Content":"\n\u003Cp\u003EHello!\u003C/p\u003E\u003Cp\u003EFor a few days I\u0027ve been trying to set up a server on my home computer so that I can play with a friend KSP latest version with DMP v.0202 via Hamachi or via Tunngle or just like that.\u003C/p\u003E\u003Cp\u003ESo far it hasnt worked out and I would like to ask for your help! \u003C/p\u003E\u003Cp\u003E(Win 8.1 Pro 64 Bit)\u003C/p\u003E\u003Cp\u003EWe set hamachi or tunngle to the first priority rank in our network connection (always just had 1 installed without the other), we portforwarded UDP 6702, Tunngle Port: UDP and TCP 11155\u003C/p\u003E\u003Cp\u003EI opened a server with my Hamachi IP while being connected with the friend on a private network with the port 6702.\u003C/p\u003E\u003Cp\u003EThe friend can never access the server, although i am able to play on it.\u003C/p\u003E\u003Cp\u003ECan anyone please help us to find a solution because so far I looked through a lot of sites including the original dmp site and couldnt find out how to do it.\u003C/p\u003E\u003Cp\u003EThanks in advance, Mino\u003C/p\u003E\u003Cp\u003EWe also allowed KSP, Hamachi, Tunngle in our Windows Firewall privately and publicly.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-26T11:41:02Z\u0022 title=\u002201/26/2015 11:41  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 26, 2015\u003C/time\u003E by Minorex\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"longbyte1","CreatedById":17521,"CreatedDateTime":"2015-01-27T00:07:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Minorex\u0022 data-cite=\u0022Minorex\u0022\u003E\u003Cdiv\u003EHello!\u003Cp\u003EFor a few days I\u0027ve been trying to set up a server on my home computer so that I can play with a friend KSP latest version with DMP v.0202 via Hamachi or via Tunngle or just like that.\u003C/p\u003E\u003Cp\u003ESo far it hasnt worked out and I would like to ask for your help! \u003C/p\u003E\u003Cp\u003E(Win 8.1 Pro 64 Bit)\u003C/p\u003E\u003Cp\u003EWe set hamachi or tunngle to the first priority rank in our network connection (always just had 1 installed without the other), we portforwarded UDP 6702, Tunngle Port: UDP and TCP 11155\u003C/p\u003E\u003Cp\u003EI opened a server with my Hamachi IP while being connected with the friend on a private network with the port 6702.\u003C/p\u003E\u003Cp\u003EThe friend can never access the server, although i am able to play on it.\u003C/p\u003E\u003Cp\u003ECan anyone please help us to find a solution because so far I looked through a lot of sites including the original dmp site and couldnt find out how to do it.\u003C/p\u003E\u003Cp\u003EThanks in advance, Mino\u003C/p\u003E\u003Cp\u003EWe also allowed KSP, Hamachi, Tunngle in our Windows Firewall privately and publicly.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn the server config file there\u0027s something called \u0022broadcast address\u0022. What is it set to? Make sure to set it to 0.0.0.0 so that it will broadcast on all network interfaces. I\u0027ve never used Tunngle but since you specified a port different from that of DMP, your friend needs to connect to port 11155 instead of 6702 if using Tunngle.\u003C/p\u003E\n"},{"CreatedByName":"godarklight","CreatedById":92588,"CreatedDateTime":"2015-01-27T07:43:33Z","Content":"\n\u003Cp\u003E@Effect: Most of the forced closed connections are firewall problems. It always is...\u003C/p\u003E\u003Cp\u003E@uxuser: On the upside, this makes a good case for detecting : in a paste and splitting it off into the port box \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E. UI userproofing is a good thing \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E@Minorex: If you can set up port forwarding, you need to forward \u003Cem\u003ETCP\u003C/em\u003E port 6702. DMP doesn\u0027t touch UDP.\u003C/p\u003E\u003Cp\u003EIf you do end up figuring it out (you\u0027ll have to connect to the clients UDP 6702 address), please let me know - to date nobody has told me if the bind address in the DMPServerSettings.txt file needs to be changed, although I seriously doubt that it does.\u003C/p\u003E\n"},{"CreatedByName":"Minorex","CreatedById":136679,"CreatedDateTime":"2015-01-27T09:04:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022longbyte1\u0022 data-cite=\u0022longbyte1\u0022\u003E\u003Cdiv\u003EIn the server config file there\u0027s something called \u0022broadcast address\u0022. What is it set to? Make sure to set it to 0.0.0.0 so that it will broadcast on all network interfaces. I\u0027ve never used Tunngle but since you specified a port different from that of DMP, your friend needs to connect to port 11155 instead of 6702 if using Tunngle.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ein the DMP Server Settings file.txt I can only find \u003C/p\u003E\u003Cp\u003E\u0022... to listen on IPv4 and IPv6.\u003C/p\u003E\u003Cp\u003Eaddress,::\u0022\u003C/p\u003E\u003Cp\u003Ewhere should i put the 0.0.0.0 ? -\u0026gt; address,:0.0.0.0: ?\u003C/p\u003E\n"},{"CreatedByName":"Minorex","CreatedById":136679,"CreatedDateTime":"2015-01-27T09:22:04Z","Content":"\n\u003Cp\u003EOK so we both portforwarded now the TCP 6702 and tried to connect via Hamachi beeing in the same Hamachi network but DMP says: \u0022Connection error: Ein Verbindungsversuch ist fehlgeschlagen, da die Gegenstelle nach einer bestimmten Zeitspanne nicht ordnungsgemÃƒÂ¤ÃƒÅ¸ reagiert hat, oder die hergestellte Verbindung war fehlerhaft, da der verbundene Host nicht reagiert hat.\u0022\u003C/p\u003E\u003Cp\u003EI try to translate that to english: \u0022Connection error: Connection failed, because the opposite site did not react after a certain timeframe, or the established connection contained errors, due to the non reaction of the connected host.\u0022\u003C/p\u003E\u003Cp\u003ECan i send you any further data to help you find the problem?\u003C/p\u003E\u003Cp\u003ETried to enter the adress 0.0.0.0 after the :: but it didnt help us to get connected!\u003C/p\u003E\n"},{"CreatedByName":"Minorex","CreatedById":136679,"CreatedDateTime":"2015-01-27T09:31:25Z","Content":"\n\u003Cp\u003ETurn of events: If the friend openes a server i can join! I can ping him, but he cannot ping me!!!\u003C/p\u003E\u003Cp\u003ESo we both got the same setup, portforwarded 6702 and the hamachi port 2620 (TCP and UDP)\u003C/p\u003E\u003Cp\u003EThat brings me to the idea that the fault must be within my firewall/router settings, but where?\u003C/p\u003E\u003Cp\u003EMy router: Pirelli PRGAV4202N\u003C/p\u003E\n"},{"CreatedByName":"VITAS","CreatedById":124625,"CreatedDateTime":"2015-01-27T12:57:28Z","Content":"\n\u003Cp\u003EMinorex:\u003C/p\u003E\u003Cp\u003EIn german: Unter windows ist es nÃƒÂ¶tig den VPn Adapter als primÃƒÂ¤ren adapter einzurichten. Geh in Netzwerkumgebung-\u0026gt;Adapter Halte ALT gedrÃƒÂ¼ckt und gehe im MenÃƒÂ¼ auf Erweitert -\u0026gt;Erweitert. Im neuen Fenster den Hamachi Adapter ganz nach oben schieben. \u003C/p\u003E\u003Cp\u003EAusserdem in den Firewalleinstellungen auf erweiterte Firewall. Firewall Einstellungen und dort den Adapter von der Firewall ausnehmen (Deaktivieren der Firewall reicht bei windows nicht).\u003C/p\u003E\u003Cp\u003E Ping Via Hamachi funktioniert nicht immer, da Ping ICMP Benuzt und Hamachi damit so seine probleme hat (Es gab mal in Hamachi einstellungen fÃƒÂ¼r broadcasts, ICMp usw.)\u003C/p\u003E\u003Cp\u003EProbier mal tungle, kein vpn oder setz dein eigenes vpn auf (hamachi ist in meinen augen mist)\u003C/p\u003E\u003Cp\u003EIn English:\u003C/p\u003E\u003Cp\u003EIn Windows VPN Adapters must be the primary NIC. Goto Networking-\u0026gt; Adapters hold ALt and select Extended -\u0026gt; Extended in the menu.\u003C/p\u003E\u003Cp\u003EIn the new window move your hamachi adapter to the top.\u003C/p\u003E\u003Cp\u003EIn addition to that click on Extended Firewall settings in your Firewall settings and exclude your hamaci nic from your firewall. (under Windows it isnt suficiant to disable the firewall) \u003C/p\u003E\u003Cp\u003EPing via Hamachi doesnt always work , because ping uses ICMp and hamachi has its problems with it (there where some options in hamachi for icmp, ping and multicast).\u003C/p\u003E\u003Cp\u003ETry using tungle, the internet or set up your own vpn (Hamachi is crap in my opinion)\u003C/p\u003E\u003Cp\u003EI hope that helps \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003Ep.s. im to lazy to translate this to german but:\u003C/p\u003E\u003Cp\u003EWindows from 7 onwards by default blocks ping so do most routers. (incoming that is)\u003C/p\u003E\u003Cp\u003EIf you dont use any vpn the ping request goes to your outbound router (not your pc), so ping doesnt help you finding out if the server is realy acc from the inet.\u003C/p\u003E\u003Cp\u003Eone method would be to let your friend connect via putty or some other telnet/raw protocol capable terminal client to your external ip \u0026amp; port and if he sees some characters theres a service listening on that port.\u003C/p\u003E\u003Cp\u003Ealso pirelli does routers?! arent they a tire manufacturer? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-27T13:03:57Z\u0022 title=\u002201/27/2015 01:03  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 27, 2015\u003C/time\u003E by VITAS\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"drakeredcrest","CreatedById":136493,"CreatedDateTime":"2015-01-27T18:50:36Z","Content":"\n\u003Cp\u003EIt does not work on macs, please make it work on macs. the game tells you its in the wrong place but when i looked at it it was a windows application. please fix this, if you have the time.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-27T18:58:26Z\u0022 title=\u002201/27/2015 06:58  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 27, 2015\u003C/time\u003E by tetryds\u003C/strong\u003E\n\u003Cbr\u003ENo need for caps :)\n\u003C/span\u003E\n"},{"CreatedByName":"VITAS","CreatedById":124625,"CreatedDateTime":"2015-01-27T20:41:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022drakeredcrest\u0022 data-cite=\u0022drakeredcrest\u0022\u003E\u003Cdiv\u003EIt does not work on macs, please make it work on macs. the game tells you its in the wrong place but when i looked at it it was a windows application. please fix this, if you have the time.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt does work on (Big) Macs. You have to use mono (see FAQ, Wiki, Readme , Chat, etc.)\u003C/p\u003E\n"},{"CreatedByName":"godarklight","CreatedById":92588,"CreatedDateTime":"2015-01-28T03:34:49Z","Content":"\n\u003Cp\u003E@Minorex: \u0022::\u0022 actually means \u0022Listen on all IPv4 and IPv6 addresses\u0022. DMPServer supports IPv6, the client supports v6 on linux and mac (The stuff is missing on windows for some unknown reason, when unity gets their act together it will start working).\u003C/p\u003E\u003Cp\u003EThe fault is port forwarding or an incoming firewall, DMP only needs TCP 6702. If you\u0027re on mobile internet they generally have a ISP-level NAT (where your ISP never gives you a public IP), which means you\u0027ll never be able to host a server.\u003C/p\u003E\u003Cp\u003EI wouldn\u0027t recommend disabling the firewall, but there\u0027s some issue going on there :-/.\u003C/p\u003E\u003Cp\u003E@drakeredcrest: It\u0027s not a windows application, it\u0027s a .NET one. .NET apps run under \u003Ca href=\u0022http://www.mono-project.com/download/#download-mac\u0022 rel=\u0022external nofollow\u0022\u003Emono\u003C/a\u003E (MRE) on linux and mac just fine - I exclusively develop on linux.\u003C/p\u003E\n"},{"CreatedByName":"silvanus","CreatedById":5307,"CreatedDateTime":"2015-01-28T09:36:06Z","Content":"\n\u003Cp\u003EAnybody know how reverting to vab or launch affects a mp game? What does unsafe revert mean exactly?\u003C/p\u003E\u003Cp\u003EHad an issue the other day where I couldn\u0027t see friends vessel but that might been due to it having banned parts. Is there an option for auto downloading necessary mods when joining a server?\u003C/p\u003E\u003Cp\u003EThanks\u003C/p\u003E\n"},{"CreatedByName":"Varsi","CreatedById":120571,"CreatedDateTime":"2015-01-28T10:02:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022silvanus\u0022 data-cite=\u0022silvanus\u0022\u003E\u003Cdiv\u003EIs there an option for auto downloading necessary mods when joining a server?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI made sure my friends have same mods by using bittorent sync on the gamedata folder. Now I\u0027m free to add/remove/update mods as I see fit and my friends don\u0027t need to worry about those.\u003C/p\u003E\n"},{"CreatedByName":"silvanus","CreatedById":5307,"CreatedDateTime":"2015-01-28T12:05:52Z","Content":"\n\u003Cp\u003E@varsi\u003C/p\u003E\u003Cp\u003ESounds like an excellent solution - would you recommend a specific program for this? And do you synch everything in game data (including visual mods)? Had an issue when my friend just copied the astronomers visual pack folders\u003C/p\u003E\n"},{"CreatedByName":"tetryds","CreatedById":50204,"CreatedDateTime":"2015-01-28T13:24:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022silvanus\u0022 data-cite=\u0022silvanus\u0022\u003E\u003Cdiv\u003EAnybody know how reverting to vab or launch affects a mp game? What does unsafe revert mean exactly?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt means that it\u0027s a memory leak and will painfully bleed your server to it\u0027s death.\u003C/p\u003E\u003Cp\u003EThere are better ways to phrase it but I guess this one is accurate, haha.\u003C/p\u003E\u003Cp\u003EWhat I mean is that you should avoid reverting at all unless you are the only one in the server, and make sure you timewarp past the time you rolled back whenever possible, then relog.\u003C/p\u003E\u003Cp\u003EIt can cause issues as general server instability, friends not loading, sync issues and it can possibly be the cause of asteroid duplication, and duplicated asteroids don\u0027t get deleted.\u003C/p\u003E\n"},{"CreatedByName":"technicalfool","CreatedById":70430,"CreatedDateTime":"2015-01-28T13:29:46Z","Content":"\n\u003Cp\u003EBear in mind that using BT sync is still redistributing the mods. You do need to be careful of licensing, the same as if you were redistributing them via a website. GPL mods require you to make the source available, all-rights-reserved mods are definitely not good to copy.\u003C/p\u003E\u003Cp\u003EAnd regardless of the licensing, the mod author may be very much less inclined to provide support if you have obtained the mod from an unofficial source.\u003C/p\u003E\n"},{"CreatedByName":"godarklight","CreatedById":92588,"CreatedDateTime":"2015-01-28T13:30:47Z","Content":"\n\u003Cp\u003EUnsafe revert just means you\u0027ve disabled reverting (and the memory leak that comes with it), but the time somehow went backwards. I put this in here to catch corner cases where time goes backwards, but looks like it\u0027s much more common than I thought it would be.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://github.com/godarklight/DarkMultiPlayer/blob/0598ae89bff8d878ea6831c06521a84e3f36ccfb/Client/VesselWorker.cs#L568-L578\u0022 rel=\u0022external nofollow\u0022\u003EThe code that fires this off is very simple and is just about english\u003C/a\u003E \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Varsi","CreatedById":120571,"CreatedDateTime":"2015-01-28T14:12:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022silvanus\u0022 data-cite=\u0022silvanus\u0022\u003E\u003Cdiv\u003E@varsi\u003Cp\u003ESounds like an excellent solution - would you recommend a specific program for this? And do you synch everything in game data (including visual mods)? Had an issue when my friend just copied the astronomers visual pack folders\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBitTorrent Sync is the program. Yes, It\u0027s the whole gamedata we have synced. Squad and NASA folders should be identical anyway and if you don\u0027t go too crazy with mods they all should work on all machines. I do avoid any mods that drain a lot of memory like EVE and such.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022technicalfool\u0022 data-cite=\u0022technicalfool\u0022\u003E\u003Cdiv\u003EBear in mind that using BT sync is still redistributing the mods. You do need to be careful of licensing, the same as if you were redistributing them via a website. GPL mods require you to make the source available, all-rights-reserved mods are definitely not good to copy.\u003Cp\u003EAnd regardless of the licensing, the mod author may be very much less inclined to provide support if you have obtained the mod from an unofficial source.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat is true. Fortunately I haven\u0027t noticed a mod yet that has any restrictions on redistribution (there might be some out there tho).\u003C/p\u003E\u003Cp\u003EAlso it should be obvious not to do this sort of syncing with people you don\u0027t really know and trust. Would be quite easy to spread around stuff you don\u0027t want on your computer.\u003C/p\u003E\n"},{"CreatedByName":"thunderdan87","CreatedById":136909,"CreatedDateTime":"2015-01-28T15:40:43Z","Content":"\n\u003Cp\u003EI\u0027m having a bit of a problem which I\u0027m not entirely sure how to describe. So here goes, a friend of mine and I have been recording a let\u0027s play in KSP using DMP. Everything worked fine when we recorded last week, but for some reason when we got together to record this week, whenever we where both on the server at the same time the game would essentially lock up for my friend. He would click on say the VAB and nothing would happen, then try to disconnect sometimes this would work, other it wouldn\u0027t do anything. You could still open the escape menu in KSP but couldn\u0027t actually quit. He would eventually have to force quit. We\u0027ve had this happen before, but usually only once and then restarting the game would fix the problem. Now it\u0027s just not working at all.\u003C/p\u003E\u003Cp\u003EThings to note, we haven\u0027t changed any settings or anything like that between when it was working and when it wasn\u0027t. When the problem kept happening we tried switch to the latest dev build of the server and client to see if that fixed it and it didn\u0027t. Any thoughts anyone has as to what\u0027s causing this and how I can fix it would be much appreciated. Thanks!\u003C/p\u003E\n"},{"CreatedByName":"godarklight","CreatedById":92588,"CreatedDateTime":"2015-01-29T03:03:04Z","Content":"\n\u003Cp\u003E@thunderdan87: I\u0027ll need KSP.log to have a guess at this one, but I\u0027ve heard it reported enough for me to be concerned about it. If possible, also try to catch me on IRC \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"thunderdan87","CreatedById":136909,"CreatedDateTime":"2015-01-29T04:56:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022godarklight\u0022 data-cite=\u0022godarklight\u0022\u003E\u003Cdiv\u003E@thunderdan87: I\u0027ll need KSP.log to have a guess at this one, but I\u0027ve heard it reported enough for me to be concerned about it. If possible, also try to catch me on IRC \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHere\u0027s the my .log file \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/47vf9j5jqhr57tr/KSP.log?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/47vf9j5jqhr57tr/KSP.log?dl=0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ll see about getting my friends file tomorrow, his is probably more relevant than mine, as it happened to him every single time and only about 30% of the time to me. I\u0027ll also see if I can find you on IRC tomorrow night.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-29T05:37:47Z\u0022 title=\u002201/29/2015 05:37  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 29, 2015\u003C/time\u003E by thunderdan87\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"silvanus","CreatedById":5307,"CreatedDateTime":"2015-01-29T15:42:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022thunderdan87\u0022 data-cite=\u0022thunderdan87\u0022\u003E\u003Cdiv\u003EI\u0027m having a bit of a problem which I\u0027m not entirely sure how to describe. So here goes, a friend of mine and I have been recording a let\u0027s play in KSP using DMP. Everything worked fine when we recorded last week, but for some reason when we got together to record this week, whenever we where both on the server at the same time the game would essentially lock up for my friend. He would click on say the VAB and nothing would happen, then try to disconnect sometimes this would work, other it wouldn\u0027t do anything. You could still open the escape menu in KSP but couldn\u0027t actually quit. He would eventually have to force quit. We\u0027ve had this happen before, but usually only once and then restarting the game would fix the problem. Now it\u0027s just not working at all.\u003Cp\u003EThings to note, we haven\u0027t changed any settings or anything like that between when it was working and when it wasn\u0027t. When the problem kept happening we tried switch to the latest dev build of the server and client to see if that fixed it and it didn\u0027t. Any thoughts anyone has as to what\u0027s causing this and how I can fix it would be much appreciated. Thanks!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMy friend experienced the exact same behavior, but this was after installing several visuals mods. He removed them from the gamedata folder, and then it worked again. I believe however that it worked for him the session before.\u003C/p\u003E\u003Cp\u003ECan anyone tell me where to follow the change log for the development build and the unstable build? Thanks\u003C/p\u003E\n"},{"CreatedByName":"godarklight","CreatedById":92588,"CreatedDateTime":"2015-01-29T18:05:49Z","Content":"\n\u003Cp\u003E@thunderdan87: I\u0027m not entirely sure what\u0027s going on there in the log file - It does hint at some weirdness, but I\u0027ve never seen this caused before. I have a feeling it\u0027s not DMP... Can you try to load the DarkMultiPlayer save file in single player and load that vessel again?\u003C/p\u003E\u003Cp\u003EEDIT, Pastebin because I can\u0027t remember how to spoiler with KSP\u0027s forum editing: \u003Ca href=\u0022http://pastebin.com/utVN4DFA\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://pastebin.com/utVN4DFA\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIf I had to guess, you had some type of mod installed and have since removed it, but KSP is freaking out about the save file.\u003C/p\u003E\u003Cp\u003E@silvanus: I don\u0027t write changelogs until I\u0027ve just about released, the best place is to check the commit logs:\u003C/p\u003E\u003Cp\u003ERelease - The latest tagged version recommended for use.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://github.com/godarklight/DarkMultiPlayer/commits/master\u0022 rel=\u0022external nofollow\u0022\u003EDevelopment\u003C/a\u003E - The latest tagged version with fixes. This should theoretically be the most stable branch to use, and will remain compatible with release.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://github.com/godarklight/DarkMultiPlayer/commits/unstable\u0022 rel=\u0022external nofollow\u0022\u003EUnstable\u003C/a\u003E - Where breaking changes go, this is basically the development branch.\u003C/p\u003E\u003Cp\u003EA few times in DMP\u0027s history I\u0027ve had to push a release a little early (or just put up with annoying bugs) because there was a breaking change already introduced into my master branch, and I have a rule that versions with the first 3 numbers (DMP 0.2.0.x) should all be compatible with each other. This just frees me up so I can push a bugfix or proper release at any times.\u003C/p\u003E\u003Cp\u003EI haven\u0027t been putting a lot of time into it lately, the last major thing that went into unstable is the warp rework which fixes \u0022Kicked for creating subspace\u0022, and also actually implements the MCW_LOWEST and SUBSPACE_SIMPLE modes.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-29T18:08:14Z\u0022 title=\u002201/29/2015 06:08  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 29, 2015\u003C/time\u003E by godarklight\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"thunderdan87","CreatedById":136909,"CreatedDateTime":"2015-01-29T23:42:20Z","Content":"\n\u003Cp\u003EHmm that\u0027s odd haven\u0027t removed any mods or anything like that. Do you think deleting the local save file, then letting it resync from the dmp server fix it? The only other mods we have installed are non part mods. A ambient light mod for youtube recording purposes, and kerbal engineer redux with the parts disabled.\u003C/p\u003E\n"}]}