{"TopicId":71656,"ForumId":34,"TopicTitle":"DarkMultiPlayer 0.3.8.0 [KSP 1.12.0]","CreatedByName":"godarklight","CreatedById":92588,"CreatedDateTime":"2014-05-07T13:17:56Z","PageNum":45,"Articles":[{"CreatedByName":"RockyTV","CreatedById":57161,"CreatedDateTime":"2015-01-03T22:25:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tetryds\u0022 data-cite=\u0022tetryds\u0022\u003E\u003Cdiv\u003EHey godar, what happened to private vessels?\u003Cp\u003EI am running a server and I am needing them a lot right now, but I don\u0027t seem to make any vessel private.\u003C/p\u003E\u003Cp\u003EIt would be good to have that feature back, as it\u0027s causing a few issues (like when someone going EVA while being spectated).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPrivate vessels are in the work. If you want to take a look, feel free to!\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://github.com/godarklight/DarkMultiPlayer/tree/group-system-4\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/godarklight/DarkMultiPlayer/tree/group-system-4\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI believe that we have some other things to merge to the branch before poking it.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tetryds\u0022 data-cite=\u0022tetryds\u0022\u003E\u003Cdiv\u003EOh, by the way, asteroids are not disapearing, so after some time there are a lot of them.\u003Cp\u003ESome people are getting severe lag from this.\u003C/p\u003E\u003Cp\u003EIs there an easy way to get rid of them?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAre you sure? IIRC, DMP does only remove untracked asteroids after a few minutes.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-03T22:28:16Z\u0022 title=\u002201/03/2015 10:28  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 3, 2015\u003C/time\u003E by RockyTV\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"seethingword","CreatedById":134296,"CreatedDateTime":"2015-01-03T23:16:01Z","Content":"\n\u003Cp\u003EHaving a problem . me and my friend are trying to join my server but we BOTH cant. the ports are forwarded right but neither of us can connect. I also had him make a server and we try to connect to that. but it wont work. Both servers were working yesterday. any idea why?\u003C/p\u003E\u003Cp\u003EUpdate: Fixed the Problem. Turns out my IPv4 address changed without me knowing lol fixed the port and all worked\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-04T01:10:07Z\u0022 title=\u002201/04/2015 01:10  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 4, 2015\u003C/time\u003E by seethingword\u003C/strong\u003E\n\u003Cbr\u003EUpdate\n\u003C/span\u003E\n"},{"CreatedByName":"tetryds","CreatedById":50204,"CreatedDateTime":"2015-01-03T23:45:35Z","Content":"\n\u003Cp\u003EGreat, I can wait patiently, thanks.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RockyTV\u0022 data-cite=\u0022RockyTV\u0022\u003E\u003Cdiv\u003EAre you sure? IIRC, DMP does only remove untracked asteroids after a few minutes.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDon\u0027t ask me, ask them \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/abYvC3C.png\u0022 alt=\u0022abYvC3C.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThere are 155 asteroids total.\u003C/p\u003E\u003Cp\u003EServer: latest release version, 0.90, science mode, running on linux.\u003C/p\u003E\u003Cp\u003ESome players are using RemoteTech, but I don\u0027t think it will change much.\u003C/p\u003E\u003Cp\u003EVery bright points are 3 or more asteroids very close together like if more than one spawned in a row.\u003C/p\u003E\u003Cp\u003EAsteroid ammount set to 30.\u003C/p\u003E\n"},{"CreatedByName":"RockyTV","CreatedById":57161,"CreatedDateTime":"2015-01-04T01:48:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tetryds\u0022 data-cite=\u0022tetryds\u0022\u003E\u003Cdiv\u003EGreat, I can wait patiently, thanks.\u003Cp\u003EDon\u0027t ask me, ask them \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/abYvC3C.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/abYvC3C.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThere are 155 asteroids total.\u003C/p\u003E\u003Cp\u003EServer: latest release version, 0.90, science mode, running on linux.\u003C/p\u003E\u003Cp\u003ESome players are using RemoteTech, but I don\u0027t think it will change much.\u003C/p\u003E\u003Cp\u003EVery bright points are 3 or more asteroids very close together like if more than one spawned in a row.\u003C/p\u003E\u003Cp\u003EAsteroid ammount set to 30.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s weird... @godarklight please, let me take a look at it, so I can learn more about KSP\u0027s weirdness (or DMP\u0027s).\u003C/p\u003E\n"},{"CreatedByName":"Parias","CreatedById":1169,"CreatedDateTime":"2015-01-04T10:59:45Z","Content":"\n\u003Cp\u003EI just spent the day playing DMP at a LAN party with a couple of friends. We made VERY heavy use of a number of different mods, including B9 Aerospace, TAC-LS, Kerbonite, OKS/MKS Kolonization, KAS, Inferno Robotics, ExtraPlanetary Launchpads, and a few others. Thought I\u0027d report back my results for those curious. Forgive me if I\u0027m rehashing anything that\u0027s well-known here.\u003C/p\u003E\u003Cp\u003EEverything actually worked... surprisingly well:\u003C/p\u003E\u003Cp\u003E* All parts more or less synced up between clients without issue. Mod control was not a concern in our case as we were running with synchronized folders, and everyone was able to see each other\u0027s unique parts without issue.\u003C/p\u003E\u003Cp\u003E* Mods like TAC Life Support actually also worked about as expected. The only anomalies we encountered only occurred when syncing ahead to someone else\u0027s subspace, in which our Kerbals \u0027may\u0027 have died if we didn\u0027t have enough supplies aboard to accommodate the time advancement. This wasn\u0027t an issue for us because it was about how we expected it to behave, and just meant we had to actually co-operate and strategize our launch windows for various missions.\u003C/p\u003E\u003Cp\u003EWe sadly never got to really test out the Kolonization mods and such though too extensively - our own incompetence left us pretty much struggling to achieve orbit for most of the day, so we didn\u0027t get to actually embark on our planned colonization project \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E* Ship movements actually worked really well - any time vessels were moving in relation to one another, we were pretty impressed at how smoothly things looked. There was still some jumpy-ness, but the experience as a whole was WAY improved from the old KMP build we had tried from a year ago. Well done!\u003C/p\u003E\u003Cp\u003EHere are the issues we had:\u003C/p\u003E\u003Cp\u003E* Any time we had a couple of player-controlled ships visible in motion near each other, there was this complete framerate halt every 5-10 seconds, which took another 5 seconds to clear itself. It looked like DMP was re-synchronizing the entire vessel state and the game was going nuts having to re-load the entire vessel each time. This problem was most apparent when we were doing formation work (i.e. lifting off from Kerbin in close proximity to each other), but disappeared almost completely during slower, more precise operations like docking.\u003C/p\u003E\u003Cp\u003E* The game was pretty unstable. At first I thought this was just the number of mods we had loaded, but the game\u0027s memory usage remained at about 3GB (and we were making heavy use of ATM to keep the usage as low as possible - we even tried OpenGL mode). We\u0027d generally get crashes every 30-40 minutes or so. This wasn\u0027t a big deal because the problem player could just re-join after a few minutes... and I\u0027d be hesitant to blame just DMP alone because we WERE being pretty mod-heavy at the time, but I\u0027m not sure exactly what the cause was between all three of us.\u003C/p\u003E\u003Cp\u003E* My friends would randomly get kicked for no obvious client-side reason, but the server logs would show \u0022Disconnecting client \u0026lt;PLAYERNAME\u0026gt;, sent CONNECTION_END (Kicked for trying to create an existing subspace) to endpoint\u0022 messages at the same time. MechJeb *WAS* generally involved around some of these cases which I know can cause DMP to act a bit funny, but I\u0027m not sure if that was the cause.\u003C/p\u003E\u003Cp\u003E* Finally, the one time we actually managed to try docking a couple of ships together, we had an issue. I was actually using KAS to try and affix one of my pipes to my friend\u0027s station for a refueling run, but a few seconds after I connected, both ships suddenly disappeared, re-loaded, and my ship was gone with only his station remaining! On my friend\u0027s screen, both ships were completely gone and he had to quit and re-join to get it back (after which only his station appeared though). Here\u0027s a video of what occurred:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/hjzyr51e-WM?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003ESince this was a KAS connector port \u0027docking\u0027 (and not normal docking) I\u0027m willing to write this off as an errant mod issue; I totally understand that DMP isn\u0027t built specifically around mods yet. I thought I\u0027d mention it though since I saw posts earlier in the thread about trying to address some of these issues and hoped some extra reports might help.\u003C/p\u003E\u003Cp\u003EDespite the problems though, we actually had an extremely entertaining day - thanks for working so hard on this project to make this possible! I look forward to trying it some more in the future.\u003C/p\u003E\n"},{"CreatedByName":"RockyTV","CreatedById":57161,"CreatedDateTime":"2015-01-04T13:56:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tetryds\u0022 data-cite=\u0022tetryds\u0022\u003E\u003Cdiv\u003EGreat, I can wait patiently, thanks.\u003Cp\u003EDon\u0027t ask me, ask them \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/abYvC3C.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/abYvC3C.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThere are 155 asteroids total.\u003C/p\u003E\u003Cp\u003EServer: latest release version, 0.90, science mode, running on linux.\u003C/p\u003E\u003Cp\u003ESome players are using RemoteTech, but I don\u0027t think it will change much.\u003C/p\u003E\u003Cp\u003EVery bright points are 3 or more asteroids very close together like if more than one spawned in a row.\u003C/p\u003E\u003Cp\u003EAsteroid ammount set to 30.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t really know if this is what\u0027s causing the issue, but, I think that the setting on the server config file is the maximum number of untracked asteroids. That way you can track dozens of asteroids, and you will still have 30 to track.\u003C/p\u003E\u003Cp\u003EHowever, I don\u0027t think that it should be this way. I\u0027m submitting a PR right now to add a new setting.\u003C/p\u003E\u003Cp\u003EThanks for reporting the issue!\u003C/p\u003E\n"},{"CreatedByName":"tetryds","CreatedById":50204,"CreatedDateTime":"2015-01-04T14:09:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RockyTV\u0022 data-cite=\u0022RockyTV\u0022\u003E\u003Cdiv\u003EI don\u0027t really know if this is what\u0027s causing the issue, but, I think that the setting on the server config file is the maximum number of untracked asteroids. That way you can track dozens of asteroids, and you will still have 30 to track.\u003Cp\u003EHowever, I don\u0027t think that it should be this way. I\u0027m submitting a PR right now to add a new setting.\u003C/p\u003E\u003Cp\u003EThanks for reporting the issue!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, that would help a lot too.\u003C/p\u003E\u003Cp\u003EThese ones are untracked but I agree that the limit should apply for the total of asteroids, tracked\u002Buntracked.\u003C/p\u003E\u003Cp\u003EThe limit is set to 30 on the server, by the way.\u003C/p\u003E\u003Cp\u003ELots of them are showing zero on the time counter but don\u0027t despawn.\u003C/p\u003E\n"},{"CreatedByName":"silvanus","CreatedById":5307,"CreatedDateTime":"2015-01-06T10:51:23Z","Content":"\n\u003Cp\u003EHello\u003C/p\u003E\u003Cp\u003EHow easy would it be to synch the active missions between players on the server? I currently have a career server with a friend and while all the first missions are the same it would also be fun to have the same waypoint during the kerbel visual survey missions for example?\u003C/p\u003E\u003Cp\u003EThanks for a great mod!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-06T10:54:09Z\u0022 title=\u002201/06/2015 10:54  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 6, 2015\u003C/time\u003E by silvanus\u003C/strong\u003E\n\u003Cbr\u003EMistake\n\u003C/span\u003E\n"},{"CreatedByName":"tetryds","CreatedById":50204,"CreatedDateTime":"2015-01-06T13:28:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022silvanus\u0022 data-cite=\u0022silvanus\u0022\u003E\u003Cdiv\u003EHello\u003Cp\u003EHow easy would it be to synch the active missions between players on the server? I currently have a career server with a friend and while all the first missions are the same it would also be fun to have the same waypoint during the kerbel visual survey missions for example?\u003C/p\u003E\u003Cp\u003EThanks for a great mod!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI had the exact oposite request, as it seemed to be already happening, some players on my server are not getting missions that other players do, so some of them have missions to go to MÃƒÂ¼n and didn\u0027t even get to orbit.\u003C/p\u003E\u003Cp\u003EWhile others already did all that and only get missions in Kerbin.\u003C/p\u003E\u003Cp\u003EThat\u0027s why it\u0027s on science mode.\u003C/p\u003E\n"},{"CreatedByName":"Dynd","CreatedById":3228,"CreatedDateTime":"2015-01-06T23:26:07Z","Content":"\n\u003Cp\u003ECan you see other people\u0027s custom flag designs in multiplayer?\u003C/p\u003E\n"},{"CreatedByName":"urlocalguru","CreatedById":134661,"CreatedDateTime":"2015-01-06T23:40:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tetryds\u0022 data-cite=\u0022tetryds\u0022\u003E\u003Cdiv\u003EI had the exact oposite request, as it seemed to be already happening, some players on my server are not getting missions that other players do, so some of them have missions to go to MÃƒÂ¼n and didn\u0027t even get to orbit.\u003Cp\u003EWhile others already did all that and only get missions in Kerbin.\u003C/p\u003E\u003Cp\u003EThat\u0027s why it\u0027s on science mode.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI believe the issue your getting tetryds is due to the Kerbals being synced among all players from the server. *\\DMPServer\\Universe\\Kerbals\\(Kerbal Name).txt\u003C/p\u003E\u003Cp\u003EThat file contains a basic flight log including flights to, suborbits arond, orbits around, excape from orbit around, landing on, boarding from and exiting to for each kerbal for each planet.\u003C/p\u003E\u003Cp\u003EIm not sure when the sync happens but once your copy of that kerbal has those flight logs those missions can be accomplished. It doesnt track flag planting or specific locations (visual survey\u0027s) etc.\u003C/p\u003E\u003Cp\u003EAs for a hack to allow shared content between players you could use a symbolic link for the files that are player specific and have them point to the same file. I havent personally tried it, and I\u0027m not sure how often the server writes and reads these files for the client but it \u003Cstrong\u003Ecould \u003C/strong\u003Ework.\u003C/p\u003E\n"},{"CreatedByName":"tetryds","CreatedById":50204,"CreatedDateTime":"2015-01-07T00:49:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dynd\u0022 data-cite=\u0022Dynd\u0022\u003E\u003Cdiv\u003ECan you see other people\u0027s custom flag designs in multiplayer?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIIRC yes you can.\u003C/p\u003E\u003Cp\u003E@urlocalguru: I cannot code, so I don\u0027t know how it would work.\u003C/p\u003E\u003Cp\u003EBut yeah, the fact that there are orbiting ships prevents you from getting \u0022reach orbit\u0022 contracts, etc.\u003C/p\u003E\u003Cp\u003ESo, I guess the best option is to use science or sandbox modes for now.\u003C/p\u003E\n"},{"CreatedByName":"godarklight","CreatedById":92588,"CreatedDateTime":"2015-01-07T11:19:34Z","Content":"\n\u003Cp\u003E@Everyone, The time syncer in career mode was broken due to an old workaround we were using to detect when KSP was ready, DMP v0.2.0.2 fixes this issue \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E@moriamo: Should be fixed now \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E@LilDevil: DMP reassigns kerbals if they get used in more than one vessel and always tries to make them available, there\u0027s a bit of weirdness that needs to be sorted out here..\u003C/p\u003E\u003Cp\u003EKicked for creating subspace is an old lazyness issue for me, I have to give some love to the warping system as it hasn\u0027t really been touched since v0.1.0.0.\u003C/p\u003E\u003Cp\u003EThe freezes are related to how DMP replaces the parts in a vessel. It kills it and replaces it, this seems to be the only reliable way of making sure the vessel is in its correct state.\u003C/p\u003E\u003Cp\u003E@wasmic: Assuming you\u0027re playing career mode, this should now be fixed.\u003C/p\u003E\u003Cp\u003E@Buggzy1011: On the server console, prefix the commands with /\u003C/p\u003E\u003Cp\u003E@RepairArtist: Hrmm, I\u0027ll have to look into this one. I thought kerbals were auto-saved... I\u0027ll have to put this on my ever-growing todo list hehe.\u003C/p\u003E\u003Cp\u003E@tetryds: Groups / private vessels / shared science is coming, I just keep getting caught up in other things. I\u0027ll also have to check on the asteroid thing, I suspect some revert paradox is coming into play here.\u003C/p\u003E\u003Cp\u003EAs for the missions, I\u0027m actually not sure how to go about this one - It\u0027s likely a stock KSP problem :-/.\u003C/p\u003E\u003Cp\u003E@Talavar: Good luck with the server, make sure you install the reporter plugin to appear on the d-mp.org server list too.\u003C/p\u003E\u003Cp\u003E@Parias: If I ever figure out a way to load ships without hanging the game, I\u0027m so there. Unity isn\u0027t multi-core though, so the current Kill/Replace solution looks like it will have to stick around, although this shouldn\u0027t be any more expensive than coming into range of the ship in single player. If the load times are different, this suggests a DMP bug.\u003C/p\u003E\u003Cp\u003E* The game was pretty unstable - Likely the side effects of revert support (which I claimed was a memory leak). I suspect turning it off in options will likely stop the crashing - we\u0027ll need to throw out old updates, or apply some type of limit to them.\u003C/p\u003E\u003Cp\u003E@urlocalguru: At the moment it reads once upon connecting, and then saves every 30 seconds if they have changed, so shared science doesn\u0027t really work that way unless you\u0027re only playing 1 at a time, which kind of defeats the whole point \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003E* existing subspace - See above, this is my lazyness from pre-v0.1.0.0. The actual code that does this is \u003Ca href=\u0022https://github.com/godarklight/DarkMultiPlayer/blob/master/Server/Messages/WarpControl.cs#L52-L57\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E. It\u0027s caused by two players coming out of warp at the exact same time, both trying to create a new subspace with the same ID. In theory this should be locked up in the server and the warp system shouldn\u0027t be as peer-to-peer as it is.\u003C/p\u003E\u003Cp\u003E* docking - Could possibly be PartKiller (the duplicate debris deleter) messing up. Another thing to poke I guess :-/\u003C/p\u003E\u003Cp\u003E@silvanus - I intend to do shared science for the next version.\u003C/p\u003E\u003Cp\u003E@Dynd - Custom flags work if you put them in the DarkMultiPlayer/Flags folder, although hardly anyone uses this feature as it\u0027s not well advertised. I also feel it\u0027s just a touch exploitable, but I\u0027ll leave it as is until it becomes a problem.\u003C/p\u003E\n"},{"CreatedByName":"Spekular","CreatedById":134752,"CreatedDateTime":"2015-01-07T17:05:36Z","Content":"\n\u003Cp\u003EI\u0027m a bit confused as to how to set up a server. I feel as if there\u0027s something really obvious I\u0027m missing (especially with everyone mentioning how easy it is). I\u0027ve installed and launched a server, but I have no clue how to join it from another computer. The port is the default 6702, but I\u0027m not sure what IP to use. To complicate things further the server is running on a Raspberry Pi (\u003Ca href=\u0022https://github.com/godarklight/DarkMultiPlayer/wiki/RasPi-Install\u0022 rel=\u0022external nofollow\u0022\u003Einstructions from your github wiki\u003C/a\u003E), using a laptop for screen/keyboard (\u003Ca href=\u0022https://pihw.wordpress.com/guides/direct-network-connection/\u0022 rel=\u0022external nofollow\u0022\u003Efollowing this tutorial\u003C/a\u003E) and internet (\u003Ca href=\u0022https://anwaarullah.wordpress.com/2013/08/12/sharing-wifi-internet-connection-with-raspberry-pi-through-lanethernet-headless-mode/\u0022 rel=\u0022external nofollow\u0022\u003Ethese instructions\u003C/a\u003E). I\u0027ve tried the IP of the Pi (I\u0027ve set a static one), the IP from the \u0022host\u0022 laptop, and a couple other ones. The server/pi (well, the laptop it\u0027s connected to) and client/computer are both on the same wifi, so I haven\u0027t done any port forwarding. Is that what I should do? If so what do I forward, to where?\u003C/p\u003E\n"},{"CreatedByName":"godarklight","CreatedById":92588,"CreatedDateTime":"2015-01-07T18:33:29Z","Content":"\n\u003Cp\u003E@Spekular: If you\u0027re running it from within your local network (which is the case here), you\u0027ll want to connect to the raspberry pi\u0027s network address, which is usually in the 192.168.0.x range (It could also be in the 10.x.x.x range).\u003C/p\u003E\u003Cp\u003EFor players on the internet connecting to your server, you need to port forward (by default TCP 6702) to your raspberry pi. Connections from the internet will connect to your public IP address. The best way to get your public address and test port forwarding would be \u003Ca href=\u0022www.canyouseeme.org\u0022 rel=\u0022external nofollow\u0022\u003Ewww.canyouseeme.org\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EAlso... I didn\u0027t know I even *had* a github wiki, but yeah those instructions look correct. /sbin/ifconfig will tell you your network settings - the \u0022inet addr:\u0022 is the address you connect to (although I assume you talk to this thing over SSH, so you probably already know that address \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E)\u003C/p\u003E\n"},{"CreatedByName":"Spekular","CreatedById":134752,"CreatedDateTime":"2015-01-07T18:57:53Z","Content":"\n\u003Cp\u003E@godarklight Thanks for the response! I get two \u0022inet addr:\u0022\u0027s when running ifconfig, one for \u0022eth0\u0022 (ethernet cable) which is the static IP I set for the Pi, the other for \u0022lo\u0022 (Something called \u0022Local Loopback\u0022). The \u0022lo\u0022 one is 127.0.0.1 though, which is some local address iirc. I\u0027ve checked canyouseeme on both the \u0022host\u0022 (laptop providing internet to pi) and the client and the ip is the same so they\u0027re definitely on the same LAN. None of these three addresses works though, they all say the connection was actively refused. Port 80 is visible on canyouseeme, but all the other common addresses and 6702 give a timeout. I guess I shouldn\u0027t worry about that though as I\u0027m currently only interested in connecting with computers on the same LAN. I haven\u0027t noticed any 192.168.0.x addresses (or 10.x.x.x) in all my digging. Am I supposed to get one of those from ifconfig?\u003C/p\u003E\n"},{"CreatedByName":"VITAS","CreatedById":124625,"CreatedDateTime":"2015-01-07T19:48:08Z","Content":"\n\u003Cp\u003Ethe lo interface (and localhost / 127.0.0.1) is only if you want to connect to a service running on the same machine (loacaly)\u003C/p\u003E\u003Cp\u003Enormaly you should have 1 external ip address on your router.\u003C/p\u003E\u003Cp\u003E10.... and 192.... ips are for local networks and dont work from the internet.\u003C/p\u003E\u003Cp\u003E(you only use them to connect to your devices that are connected to the same router at home that you are using)\u003C/p\u003E\u003Cp\u003Eit might be helpfull if you can copy the output of \u0022ifconfig eth0\u0022 from your rasbberypi.\u003C/p\u003E\u003Cp\u003Ealso do \u0022route\u0022\u003C/p\u003E\u003Cp\u003Eif i understand correctly your laptop is beeing the router for your rasberrypi? i hope you know that your rasberrypi wil only be accasible as long as you have your laptop running. that makes the rasberrypi kind of unneeded.\u003C/p\u003E\u003Cp\u003Ealso runn ipconfig (for windows) or ifconfig (for linux) on your laptop and see what ips the different interfaces have.\u003C/p\u003E\n"},{"CreatedByName":"Spekular","CreatedById":134752,"CreatedDateTime":"2015-01-08T12:14:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022VITAS\u0022 data-cite=\u0022VITAS\u0022\u003E\u003Cdiv\u003E10.... and 192.... ips are for local networks and dont work from the internet.\u003C/div\u003E\u003C/blockquote\u003E I\u0027m aware of this but \u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Spekular\u0022 data-cite=\u0022Spekular\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EI\u0027m currently only interested in connecting with computers on the same LAN\u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs for:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022VITAS\u0022 data-cite=\u0022VITAS\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003Ei hope you know that your rasberrypi wil only be accasible as long as you have your laptop running. that makes the rasberrypi kind of unneeded.\u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EI got the pi without any other hardware because I wasn\u0027t sure what I would do with it, so the laptop was just to get set up. Now that I\u0027m going to use it as a server I\u0027ll probably get a wifi adapter for it.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022VITAS\u0022 data-cite=\u0022VITAS\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003Ealso runn ipconfig (for windows) or ifconfig (for linux) on your laptop and see what ips the different interfaces have.\u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EHave done.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022VITAS\u0022 data-cite=\u0022VITAS\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003Eit might be helpfull if you can copy the output of \u0022ifconfig eth0\u0022 from your rasbberypi.\u003C/span\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003Ealso do \u0022route\u0022\u003C/span\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EWill do when I can. \u003C/span\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"VITAS","CreatedById":124625,"CreatedDateTime":"2015-01-09T13:02:39Z","Content":"\n\u003Cp\u003EHi,\u003C/p\u003E\u003Cp\u003Edoesnt your Router have some spare Ethernet Ports you connect your RasberryPi to?\u003C/p\u003E\u003Cp\u003EUsing Cables is always better than using WiFi.\u003C/p\u003E\u003Cp\u003EBTW: Sorry for not reading your post more carefully \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"MightyN0ob","CreatedById":130563,"CreatedDateTime":"2015-01-09T15:25:36Z","Content":"\n\u003Cp\u003EHey! Just wanted to say, Awesome mod!\u003C/p\u003E\u003Cp\u003EHowever I have two issues - One, when I attempt to sync to my friend, It\u0027ll Sync, But his plane, Or rocket will still appear to be standing completely still, Yet his engines are at full blast - I\u0027m using the DarkMP Updater for client and server, rather then the manual install.\u003C/p\u003E\u003Cp\u003EAnother thing is modding the server, I tryed to read the Modcontrol text, but just felt a little overwhelmed at the amount of text. Any possible chance for a more simplistic version, Or even a video tutorial? Thanks!\u003C/p\u003E\n"},{"CreatedByName":"MK3424","CreatedById":19932,"CreatedDateTime":"2015-01-09T17:13:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MightyN0ob\u0022 data-cite=\u0022MightyN0ob\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAnother thing is modding the server, I tryed to read the Modcontrol text, but just felt a little overwhelmed at the amount of text. Any possible chance for a more simplistic version, Or even a video tutorial? Thanks!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJust set the modcontrol = 0 : it allows you to use any mod on the server.\u003C/p\u003E\u003Cp\u003Ebut please note: if somebody uses a mod that you don\u0027t have, his craft won\u0027t be loaded for you but it will to others who has the parts/plugin needed.\u003C/p\u003E\n"},{"CreatedByName":"MightyN0ob","CreatedById":130563,"CreatedDateTime":"2015-01-09T19:03:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MK3424\u0022 data-cite=\u0022MK3424\u0022\u003E\u003Cdiv\u003EJust set the modcontrol = 0 : it allows you to use any mod on the server.\u003Cp\u003Ebut please note: if somebody uses a mod that you don\u0027t have, his craft won\u0027t be loaded for you but it will to others who has the parts/plugin needed.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo - when I set it to 0, and load it up with a friend, Lets say we just have B9Aerospace - We\u0027ll be able to see eachothers crafts then?\u003C/p\u003E\n"},{"CreatedByName":"Parias","CreatedById":1169,"CreatedDateTime":"2015-01-10T05:02:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MightyN0ob\u0022 data-cite=\u0022MightyN0ob\u0022\u003E\u003Cdiv\u003ESo - when I set it to 0, and load it up with a friend, Lets say we just have B9Aerospace - We\u0027ll be able to see eachothers crafts then?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAbsolutely correct - we tested this at a LAN party last weekend (along with a slew of other part mods) and this worked more or less flawlessly.\u003C/p\u003E\n"},{"CreatedByName":"i like turtles","CreatedById":169426,"CreatedDateTime":"2015-01-10T07:38:53Z","Content":"\n\u003Cp\u003Eomg so many computer nurds\u003C/p\u003E\n"},{"CreatedByName":"godarklight","CreatedById":92588,"CreatedDateTime":"2015-01-10T09:02:52Z","Content":"\n\u003Cp\u003E@Spekular: If the laptop is giving internet to the raspberry pi, then there\u0027s a good chance that the PI is in a completely seperate network, which may be why you can\u0027t connect to it. One day I\u0027ll do a video on how IP networking kinda works, but until then I guess I\u0027ll have to explain it.\u003C/p\u003E\u003Cp\u003EFor a simple example, I\u0027ll write the address/netmask together. /24 is 255.255.255.0, which means it can contact things when the IP\u0027s first 3 numbers are the same. I *think* this is your problem:\u003C/p\u003E\u003Cp\u003EClient computer addresses are: 192.168.0.1/24\u003C/p\u003E\u003Cp\u003ELaptop computer addresses are: 192.168.0.2/24 192.168.1.2/24\u003C/p\u003E\u003Cp\u003EPi\u0027s addresses are: 192.168.1.3/24\u003C/p\u003E\u003Cp\u003EThere is no way the Client and PI can talk to each other in that above setup, although the laptop knows how to talk to both of them. First make sure that they are in the same networks first.\u003C/p\u003E\u003Cp\u003E@MightyN0ob: Thanks, but this is likely a side effect due to how I try and spawn vessels in the atmosphere when they are close. KSP kills vessels that are flying more than 2.5km away, so what I do is I temporarily set them to \u0022landed\u0022, and then hope KSP figures out that they actually should be flying - at which point they start working again. I\u0027ve got an idea of how to \u0022fix\u0022 this (keep them landed and move them every frame referencing the last DMP update), but I haven\u0027t coded that yet. It\u0027s called \u003Ca href=\u0022https://github.com/godarklight/DarkMultiPlayer/blob/master/Client/VesselWorker.cs#L1540-L1551\u0022 rel=\u0022external nofollow\u0022\u003EHackyInAtmoLoad\u003C/a\u003E for a reason hehe.\u003C/p\u003E\u003Cp\u003EAs for mod control, I recommend leaving it to the default and just getting DMP to set one up from your gamedata directory - Just hit options -\u0026gt; generate blacklist DMPModControl.txt, and then move the file to the server folder.\u003C/p\u003E\u003Cp\u003EIf you have complete control over the GameData directories though, then using modcontrol 0 is fine.\u003C/p\u003E\u003Cp\u003E@RonaldoFTW: Hey, us nerds make mods for fun, which results in players having fun, which is a positive feedback loop of fun-ness \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"}]}