{"TopicId":74412,"ForumId":34,"TopicTitle":"[1.0\u002B] B.Dynamics - Retracting/vectoring engines etc. v1.2.0 (May 6)","CreatedByName":"BahamutoD","CreatedById":72433,"CreatedDateTime":"2014-06-07T16:46:18Z","PageNum":16,"Articles":[{"CreatedByName":"V8jester","CreatedById":136093,"CreatedDateTime":"2015-07-16T05:01:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mightydread\u0022 data-cite=\u0022mightydread\u0022\u003E\u003Cdiv\u003EFirst of all massive props for the mod! I love those engines! I still have to try out the crawler but I can\u0027t wait...\u003Cp\u003ENow to my problem..\u003C/p\u003E\u003Cp\u003EI have a weird bug with your radial engines. The thrust vector seems off. In the editor Everything looks ok but when I thrust the craft starts to spin. Is this a bug with your engines or ksp? Maybe you have a suggestion?\u003C/p\u003E\u003Cp\u003EThanks\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/NEpPl6z.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/NEpPl6z.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/S70LbDl.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/S70LbDl.png\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis might be a dumb answer but.... I don\u0027t see SAS or rcs turned on in the picture. Does it spin when those are turned on? Also did you attach them with the angle snap tool on?\u003C/p\u003E\n"},{"CreatedByName":"Ottomic","CreatedById":90436,"CreatedDateTime":"2015-07-20T18:43:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022V8jester\u0022 data-cite=\u0022V8jester\u0022\u003E\u003Cdiv\u003EThis might be a dumb answer but.... I don\u0027t see SAS or rcs turned on in the picture. Does it spin when those are turned on? Also did you attach them with the angle snap tool on?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve had the exact same problem when bahasp engines are present, but I\u0027m not quite sure the mod itself is causing the problem, some other mod, or a misinteraction.\u003C/p\u003E\u003Cp\u003EI\u0027ve had retractable cluster engines thrust to the left for no reason, in symmetrically placed engines in the SPH. For no reason. A ship can be working perfectly, and suddenly it will fire to the side instead of downwards, and no amount of taking those engines off and back on will help it, the only way you can make it work again is making a different ship, placing them, and hoping they don\u0027t go nuts. The difference is that in some cases I will see the center of thrust shift to the side on the VAB/SPH, unlike in mightydread\u0027s post. Sometimes.\u003C/p\u003E\u003Cp\u003EBut here is the problem: I\u0027ve experienced that on STOCK engines as well, on designs where BahaSP engines were present, but not firing:\u003C/p\u003E\u003Cp\u003EFirst there was \u003Ca href=\u0022http://steamcommunity.com/sharedfiles/filedetails/?id=474392982\u0022 rel=\u0022external nofollow\u0022\u003Ethis\u003C/a\u003E design, which contained a bahaSP vector inline within the fairing, but wasn\u0027t firing at launch. It worked perfectly for a number of launches, then all of a sudden it would thrust to the side and slam into the ground a few meters in. I double checked everything was symmetrical, all thrust was fine, no controller problems. No matter what I did, the design seemed corrupted. But you could argue that it\u0027s a very stupid rocket design and that the weird shape or whatever were messing it up.\u003C/p\u003E\u003Cp\u003EBut then I had problems with \u003Ca href=\u0022http://steamcommunity.com/sharedfiles/filedetails/?id=473783525\u0022 rel=\u0022external nofollow\u0022\u003Ethis\u003C/a\u003E upper stage as well, which had no bahaSP engines, but retractable RCS blocks. The stage went well up until the after the transmunar injection, after which it would suddenly thrust off to the side. That\u0027s where I figured out that if you turned the gimbal in the engine off, and just let the SAS work that problem would disappear.\u003C/p\u003E\u003Cp\u003ESo maybe the BahaSP parts are doing something to the center of thrust? Maybe the gimballing? Maybe it\u0027s a problem with another mod? I have no idea. I have used the inline vector for a lot of flights now and it doesn\u0027t seem to have much of a problem, same for the retractable clusters.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-20T18:48:00Z\u0022 title=\u002207/20/2015 06:48  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 20, 2015\u003C/time\u003E by Ottomic\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"albany_","CreatedById":112259,"CreatedDateTime":"2015-07-23T17:55:11Z","Content":"\n\u003Cp\u003EFWIW, I\u0027ve experienced what Otto is talking about as well. \u003C/p\u003E\u003Cp\u003ELuckily the part I\u0027m most interested in, the Critter Crawler, seems to work fine.\u003C/p\u003E\n"},{"CreatedByName":"sashan","CreatedById":98897,"CreatedDateTime":"2015-07-29T21:56:04Z","Content":"\n\u003Cp\u003EIs there any way to prevent this? \u003C/p\u003E\u003Cp\u003EAlso, the engine thrust transform gimbals much faster than \u0022wall of gimbals\u0022 - visual part.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/K4K7Qmd.png\u0022 alt=\u0022K4K7Qmd.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Ottomic","CreatedById":90436,"CreatedDateTime":"2015-08-02T05:20:53Z","Content":"\n\u003Cp\u003EReloading has helped. Sometimes.\u003C/p\u003E\n"},{"CreatedByName":"PyroSA","CreatedById":149718,"CreatedDateTime":"2015-08-13T23:33:07Z","Content":"\n\u003Cp\u003EHas anybody else run into issues with the ILX-40?\u003C/p\u003E\u003Cp\u003EThe engine gives the thrust I desire, but seems to have orientation issues.\u003C/p\u003E\u003Cp\u003EIf you fit it in the SPH/VAB, it points forwards.\u003C/p\u003E\u003Cp\u003EIf you rotate it to point in the right direction, it vectors in the wrong direction.\u003C/p\u003E\u003Cp\u003ETurning left turns right instead.\u003C/p\u003E\u003Cp\u003EOther engines seem to function fine, and aerodynamic surfaces rotate as expected.\u003C/p\u003E\u003Cp\u003EThe placement around the CoM does affect the direction of thrust, but it\u0027s always in the mirrored direction.\u003C/p\u003E\n"},{"CreatedByName":"Deathsoul097","CreatedById":77396,"CreatedDateTime":"2015-08-14T05:23:36Z","Content":"\n\u003Cp\u003EHi there. So, im running a rather heavily modded install right now for some military vehicle design, and im hving a conflict in mods. Specifically, with this mod, and the adjustable landing gear. Simply, if i use the adjustable landing gear\u0027s Dll provided, then this mod ceases to function, and vice versa for this mods BahaAnimationModuules.dll\u003C/p\u003E\u003Cp\u003EIs there any known fix for this?\u003C/p\u003E\n"},{"CreatedByName":"V8jester","CreatedById":136093,"CreatedDateTime":"2015-08-14T13:59:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Deathsoul097\u0022 data-cite=\u0022Deathsoul097\u0022\u003E\u003Cdiv\u003EHi there. So, im running a rather heavily modded install right now for some military vehicle design, and im hving a conflict in mods. Specifically, with this mod, and the adjustable landing gear. Simply, if i use the adjustable landing gear\u0027s Dll provided, then this mod ceases to function, and vice versa for this mods BahaAnimationModuules.dll\u003Cp\u003EIs there any known fix for this?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHmm I use both and just used the needs .dll and it ran fine for me. What specifically isn\u0027t working?\u003C/p\u003E\n"},{"CreatedByName":"Deathsoul097","CreatedById":77396,"CreatedDateTime":"2015-08-16T11:39:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022V8jester\u0022 data-cite=\u0022V8jester\u0022\u003E\u003Cdiv\u003EHmm I use both and just used the needs .dll and it ran fine for me. What specifically isn\u0027t working?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETBH, pretty much everything. If i use one Dll, the entire other mod\u0027s parts stop working, and vice versa.\u003C/p\u003E\n"},{"CreatedByName":"Tassyr","CreatedById":42397,"CreatedDateTime":"2015-08-21T00:43:07Z","Content":"\n\u003Cp\u003EHey- I LOVE this mod, it\u0027s one of the first I always download- but I was wondering. Any chance I could get a 2.5m version of Critter Crawler? I mean I can scale it up myself, of course, but I was wondering if there was some way we could get a \u0022Heavy duty\u0022 version for larger crawlers? It\u0027s amazingly useful...\u003C/p\u003E\n"},{"CreatedByName":"FreeThinker","CreatedById":117389,"CreatedDateTime":"2015-08-21T11:43:57Z","Content":"\n\u003Cp\u003EI especialy like this mod License, it allows me to integrate it into Installar. You might ask what for, they are already very cool, just imagin want happens when you power these parst with Megajoules instead of crude chemical propellants \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-21T17:17:52Z\u0022 title=\u002208/21/2015 05:17  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 21, 2015\u003C/time\u003E by FreeThinker\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sashan","CreatedById":98897,"CreatedDateTime":"2015-08-26T17:47:15Z","Content":"\n\u003Cp\u003EThe spotlight turret is so powerful that it can light up Kerbin from Mun. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E Is it intentional?\u003C/p\u003E\n"},{"CreatedByName":"EdusacconBR","CreatedById":135047,"CreatedDateTime":"2015-08-27T20:31:41Z","Content":"\n\u003Cp\u003Ecan you make the vector lighter? its too heavy for stock parts\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sashan\u0022 data-cite=\u0022sashan\u0022\u003E\u003Cdiv\u003EThe spotlight turret is so powerful that it can light up Kerbin from Mun.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWow, it can also light the mun from kerbin o_O\u003C/p\u003E\n"},{"CreatedByName":"lude","CreatedById":150904,"CreatedDateTime":"2015-09-09T16:23:18Z","Content":"\n\u003Cp\u003EHello! I have a weird problem (might be too many mods...^)\u003C/p\u003E\u003Cp\u003EI\u0027m positive a few days ago the engines were still working (but I might have used the Landertron ones and only saw the ILX 40 looking one in action)\u003C/p\u003E\u003Cp\u003ENow when trying to use the retractable liquid/oxid engines the two big ones\u003C/p\u003E\u003Cp\u003EVTx-202 Retractable Engine and ILX-40 Retractable Engine don\u0027t receive fuel when put on to fuel tanks (i have to use the fuel line thingy)\u003C/p\u003E\u003Cp\u003Ethe ttr1 works fine for some reason, I have compared the part.cfgs with the notepad\u002B\u002B plugin compare and I wasn\u0027t able to change it (tho I tell myself earlier for a short time the VTx worked, but whatever I did i undid and the only thing I can remember was carrycross thingy, which wasn\u0027t what made it work.\u003C/p\u003E\u003Cp\u003Echanging the engine module to the ModuleEnginesFX didn\u0027t fix it either, I will probably give them their own fuel reserve and make use of the fuel line thingy.\u003C/p\u003E\u003Cp\u003EI dunno, could have InterstellarFuelSwitch, FuelTanksPlus or a mod like that have broken it? I really don\u0027t want to use external fuel ducts.\u003C/p\u003E\u003Cp\u003Eand my tries in fixing it were in vain, since I can\u0027t spot an obvious difference between ilx/vtx and ttr that would make the ttr function as fuel receiving but the ilx/vtx not\u003C/p\u003E\u003Cp\u003EI\u0027ve tried a few things from the module and CFG file documentation but to no avail\u003C/p\u003E\u003Cp\u003Ecould CModuleFuelLine help me?[h=3][/h]\u003C/p\u003E\n"},{"CreatedByName":"Ghostshark27","CreatedById":78982,"CreatedDateTime":"2015-09-16T22:58:29Z","Content":"\n\u003Cp\u003EI\u0027ve noticed a node issue on the bottom of the critter crawler. Seems like every decoupler I try to put under it will only connect to the bottom node of the decoupler, not the top. Not sure how to fix this, but in the meantime I\u0027ll try flipping my probe over and attaching from the top. Only downside to that is getting it flipped around to land could be a bit touchy...\u003C/p\u003E\n"},{"CreatedByName":"Seikatsukan","CreatedById":151283,"CreatedDateTime":"2015-09-18T05:10:54Z","Content":"\n\u003Cp\u003EI can confirm the issue that user Ghostshark27 posted above. Apparently, the bottom node on the Critter Crawler is \u0022facing the wrong way\u0022, resulting in a problem when trying to attach something to said node: it uses the bottom node on the part being attached as well, instead of the top one, making it impossible to create a proper staging sequence using said node (and causing all sorts of nasty clipping if you\u0027re trying to attach something taller than a regular decoupler).\u003C/p\u003E\u003Cp\u003EOther than that, the CC works perfectly, and I must say it\u0027s one of my favourite things: cute, cool, and useful.\u003C/p\u003E\n"},{"CreatedByName":"Spheniscine","CreatedById":125755,"CreatedDateTime":"2015-09-19T23:44:24Z","Content":"\n\u003Cp\u003EI discovered another issue with the CC: Apparently FAR\u0027s shape detection always treats the claws as deployed. The phantom claws create a bump in the cross section where they \u0022stick out\u0022 of the fairing, and show up when debug voxels is turned on.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-19T23:47:26Z\u0022 title=\u002209/19/2015 11:47  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 19, 2015\u003C/time\u003E by Spheniscine\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Spheniscine","CreatedById":125755,"CreatedDateTime":"2015-09-27T13:40:17Z","Content":"\n\u003Cp\u003EWorkaround found for the Critter Crawler node issue: edit GameData/BahaSP/Parts/CritterCrawler such that on the line:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003Enode_stack_bottom = 0.0, -0.5483629, 0.0, 0.0, 1.0, 0.0, 1\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EAdd a minus sign to \u00221.0\u0022 so that it\u0027s now:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003Enode_stack_bottom = 0.0, -0.5483629, 0.0, 0.0, -1.0, 0.0, 1\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EAs for the FAR thing, the only workaround I know of right now is to make fairings wider (2.125m for PF). This is of course less than satisfactory as wider fairings mean more drag.\u003C/p\u003E\n"},{"CreatedByName":"Auriga_Nexus","CreatedById":149320,"CreatedDateTime":"2015-11-13T03:40:42Z","Content":"\n\u003Cp\u003EIs this mod still being actively developed/managed? If so I would like an update on the transition to 1.0.5 if possible.\u003C/p\u003E\u003Cp\u003EBTW this mod seriously rocks. I never even use the stock RCS modules anymore, why bother when these can retract and be aerodynamic when not using them? Also the ILX engines are very useful for re-entry and landing, really they\u0027re useful as retrorockets in general. All the more reason why I\u0027d like to see it updated. Hopefully it\u0027s as easy as slapping a 1.0.5 version number onto the meta-tag and moving along.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-13T03:42:59Z\u0022 title=\u002211/13/2015 03:42  AM\u0022 data-short=\u00228 yr\u0022\u003ENovember 13, 2015\u003C/time\u003E by Auriga_Nexus\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Drew Kerman","CreatedById":103177,"CreatedDateTime":"2015-11-13T12:03:43Z","Content":"\n\u003Cp\u003Ethis is one of the more unique part mods with excellent utility, texture and animations. Would def hope it continues to see support from BD at some point - but I realize he has a lot of mods on his plate these days so might be a while until he comes back around to this one\u003C/p\u003E\n"},{"CreatedByName":"Kerbas_ad_astra","CreatedById":126593,"CreatedDateTime":"2015-11-14T05:26:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Gaiiden\u0022 data-cite=\u0022Gaiiden\u0022\u003E\u003Cdiv\u003Ethis is one of the more unique part mods with excellent utility, texture and animations. Would def hope it continues to see support from BD at some point - but I realize he has a lot of mods on his plate these days so might be a while until he comes back around to this one\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBD lists Adjustable Landing Gear as compatible with 1.0.5, which uses the same custom animation DLL as these parts. The engine configs could use a pass to make sure they\u0027re in line with stock thermo updates and other performance factors, but (with personal testing) they work just fine.\u003C/p\u003E\n"},{"CreatedByName":"EdusacconBR","CreatedById":135047,"CreatedDateTime":"2015-11-26T16:28:37Z","Content":"\ncan you make the thrust vectoring engine CoM offset like the other engines? its a bit hard to do aircraft with them\n"},{"CreatedByName":"DDE","CreatedById":146349,"CreatedDateTime":"2015-12-20T11:56:45Z","Content":"\n\u003Cp\u003E\nHey, Bahamuto, as the Modder-in-Chief on Animations, would you be interested in creating a launch clamp pack?\n\u003C/p\u003E\n"},{"CreatedByName":"Virtualgenius","CreatedById":67644,"CreatedDateTime":"2016-01-12T11:17:40Z","Content":"\n\u003Cp\u003E\nwhat would be the easiest way to change the color on the flip out engines to white rather than grey \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"StahnAileron","CreatedById":139783,"CreatedDateTime":"2016-01-12T17:36:47Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222358443\u0022 data-ipsquote-contentid=\u002274412\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221452597460\u0022 data-ipsquote-userid=\u002267644\u0022 data-ipsquote-username=\u0022Virtualgenius\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, Virtualgenius said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nwhat would be the easiest way to change the color on the flip out engines to white rather than grey \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIf you have the software to do so, it\u0027s probably just opening the texture for that part (if in doubt, check the part\u0027s CFG file for the texture\u0027s path) and editing it to what you want. Should be simple-ish if it\u0027s just a color change. You could probably sample the colors from the stock parts to color-match. This pack is still using TGA files for the textures (rather than DDS), so as long as you can open, edit and save to that format, it should be doable.\n\u003C/p\u003E\n"}]}