{"TopicId":75245,"ForumId":34,"TopicTitle":"[1.1] RemoteTech v1.6.10 [2016-04-12]","CreatedByName":"Peppie23","CreatedById":111955,"CreatedDateTime":"2014-05-30T23:41:40Z","PageNum":146,"Articles":[{"CreatedByName":"Prezombie","CreatedById":152392,"CreatedDateTime":"2015-10-25T03:37:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Stone Blue\u0022 data-cite=\u0022Stone Blue\u0022\u003E\u003Cdiv\u003E^^\u003Cp\u003EHmmm...Isnt that what THIS probe core is for...????...:\u003C/p\u003E\u003Cp\u003E\u0022the RC-L01 Remote Guidance Unit can serve as a command station, provided a crew of 6 or more kerbals is available to split the jobs of running the ship and monitoring nearby probes. The crew can be anywhere on the ship; it does not have to be in a particular part. The RC-L01 still acts as a probe core and a signal processor, whether or not a crew is on board.\u0022\u003C/p\u003E\u003Cp\u003EI believe having a ship with 6 kerbals (min), RC-L01, and appropriate comms, and you have yourself a mobile, on-orbit KSC that can be sent and placed in any planet\u0027s/moon\u0027s SOI...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, that\u0027s what I was referring to when I said Remote command station. In a career mode game, this is a part that\u0027s right at the end of the tech tree. I suppose it\u0027s a reasonable requirement for making a permanent or semi-permanent remote command station, but it\u0027s got some really heavy requirements in terms of of manpower, and tech unlocked. Especially if you need to set up a colony to fill the life support reqs of any of the life support mods. It\u0027s also a bit much if all you want to do is adjust probe core trajectories within a few km of the main ship. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"FancyMouse","CreatedById":142946,"CreatedDateTime":"2015-10-25T05:48:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Prezombie\u0022 data-cite=\u0022Prezombie\u0022\u003E\u003Cdiv\u003EEspecially if you need to set up a colony to fill the life support reqs of any of the life support mods.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI thought it\u0027s the fun part...\u003C/p\u003E\n"},{"CreatedByName":"Prezombie","CreatedById":152392,"CreatedDateTime":"2015-10-25T07:57:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FancyMouse\u0022 data-cite=\u0022FancyMouse\u0022\u003E\u003Cdiv\u003EI thought it\u0027s the fun part...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFun, but overkill for a planet\u0027s first manned visit. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Peppie23","CreatedById":111955,"CreatedDateTime":"2015-10-25T08:45:37Z","Content":"\n\u003Cp\u003EHey guys, \u003C/p\u003E\u003Cp\u003Esorry that i\u0027m so rar here on this forum but i\u0027m working hard for the next update \u003Ca href=\u0022https://github.com/RemoteTechnologiesGroup/RemoteTech/milestones/1.7.0\u0022 rel=\u0022external nofollow\u0022\u003Ev1.7.0\u003C/a\u003E and unfortunately i\u0027ve to say that i can\u0027t hold the specified date 31 Oct 2015 for release :/ The last task \u0022Flightcomputer overhaul\u0022 takes more time than i thought. On the bottom of this post i\u0027ll add some pictures of the current flightcomputer, Feedback is appreciated!! I hope the new flightcomputer design is more clear and easy to use.\u003C/p\u003E\u003Cp\u003ETo keep you on track, here is the current change log (dirty version) for v1.7.0. If you want you can use the \u003Ca href=\u0022https://github.com/RemoteTechnologiesGroup/RemoteTech/releases/tag/build-1.7.0-462\u0022 rel=\u0022external nofollow\u0022\u003Elatest DEV build of v1.7\u003C/a\u003E to try things out (backup your save).\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E# General\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EThe RemoteTech_Settings.cfg will now be saved under the save game folder\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAdded an OptionWindow\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAdded an AppLauncher Button on the SpaceCenter to open the OptionWindow\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAdded disable/enable option for remotetech\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ERemoteTech is now disabled for training missions\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ERemote station dots can now be colored via the settings file (also with the OptionWindow)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EWe replaced the label \u0022Energy req.\u0022 with \u0022ElectricCharge\u0022 for the part info on the editor, to be more stock like\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAdded more colors to the editor part infos (more stock like)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAdd ManeuverCommands from Node. You can now add more than one maneuver to the flightcomputer directly from the node. Right click the node an click the FC\u002B/FC- Button\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EMerged RemoteTechXF you will find the option to toggle on the Cheat-Tab in the option window\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EPresets added to the Option window\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe mission control dot on the map view will now be invisible on a defined distance to the camera. See \u0060DistanceToHideGroundStations\u0060 on the settings file. This feature can be toggled by the value \u0060HideGroundStationsOnDistance\u0060 in the option window.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EI\u0027ve added a mouse over info box for each mission control dot on the map view. This feature can be toggled by the value \u0060ShowMouseOverInfoGroundStations\u0060 in the option window.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe default mission control ground station has now three tech level on a career game for the omni antenna. The ranges are: 4Mm, 30Mm and 75Mm, you can disable this feature via the option window\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EManeuverCommands and BurnCommands will now insert an alarm into KerbalAlarmClock.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EManeuverCommands will now automatically insert a HoldManeuver Command\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAdded a new option to activate/deactivate the auto insert to KerbalAlarmClock\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E# Modders\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EAdded a new API Method to check whether RemoteTech is enabled or not \u0060bool IsRemoteTechEnabled()\u0060\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAdded a new API Method to check an individual antenna for connection \u0060bool AntennaHasConnection(Part part)\u0060 (thx to tomekpiotrowski)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAdded a new API Method to get the target from an antenna \u0060Guid GetAntennaTarget(Part part)\u0060 (thx to tomekpiotrowski)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAdded a new API Method to switch the antennas target \u0060void SetAntennaTarget(Part part, Guid id)\u0060 (thx to tomekpiotrowski)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAdded a new API Method to receive all ground stations \u0060IEnumerable\u0026lt;string\u0026gt; GetGroundStations()\u0060 (thx to tomekpiotrowski)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAdded a new API Method to receive a guid from a ground stations name \u0060Guid GetGroundStationGuid(String name)\u0060 (thx to tomekpiotrowski)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAdded a new API Method to get the guid from a celestial body \u0060Guid GetCelestialBodyGuid(CelestialBody celestialBody)\u0060 (thx to tomekpiotrowski)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAdded a new API Method to get the NoTarget guid \u0060Guid GetNoTargetGuid()\u0060 (thx to tomekpiotrowski)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAdded a new API Method to get the ActiveVessel guid \u0060Guid GetActiveVesselGuid()\u0060 (thx to tomekpiotrowski)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EYou can now add the value \u0060IsNonRetractable = boolean\u0060 to the ModuleRTAntenna section on the part.cfg\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EYou can now configure a dish antenna to mission control. All mission control dishes are only pointed to the Active Vessel (thx to jdmj)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EGround station antennas can now use the tech level of the tracking station. I\u0027ve added three new values to the antenna node for a station. Use \u0060UpgradeableOmni\u0060, \u0060UpgradeableDish\u0060 and \u0060UpgradeableCosAngle\u0060 with a semicolon seperated list of ranges. Example: 4E\u002B06;3.0E\u002B07;7.5E\u002B07\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAdded a new API Method to create ground stations (thanks to legacynl)\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E# Bugfixes\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ERSS/RO/RP-0 Player will no longer see a required ElectricCharge of 0.00/s for the longAntenna on the editor part info. It\u0027s now defined as minutes (~0.09/min)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EFixed an issue where the TechPerk is already available only if you\u0027ve researched the node but without purchasing the TechPerk-Part it self and the editor part info will no longer show the TechPerk right from the beginning\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003E# Preview\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EOptionwindow \u003Ca href=\u0022http://i.imgur.com/m5nQTfG.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/m5nQTfG.png\u003C/a\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EOptionwindow presets \u003Ca href=\u0022http://i.imgur.com/vRpdAYx.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/vRpdAYx.png\u003C/a\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EToolbarbutton \u003Ca href=\u0022http://i.imgur.com/gd8H7nO.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/gd8H7nO.png\u003C/a\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EMouse over ground stations \u003Ca href=\u0022http://i.imgur.com/u9orY3V.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/u9orY3V.png\u003C/a\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Eflightcomputer draft \u003Ca href=\u0022http://i.imgur.com/zvPMbQm.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/zvPMbQm.png\u003C/a\u003E\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"linuxgurugamer","CreatedById":129964,"CreatedDateTime":"2015-10-25T12:54:08Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EHi,\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EWho would I need to contact to get permission to redistribute the antennas only?\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EI\u0027d like them to be used with AntennaRange.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EThanks\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"Phineas Freak","CreatedById":146521,"CreatedDateTime":"2015-10-25T13:59:16Z","Content":"\n\u003Cp\u003EWell, the next RemoteTech version is going to be more awesome than ever! Thank you Peppie!\u003C/p\u003E\n"},{"CreatedByName":"linuxgurugamer","CreatedById":129964,"CreatedDateTime":"2015-10-25T14:31:09Z","Content":"\n\u003Cp\u003Edoes anyone know who made the original antenna part models? and if so, how i can contct them.\u003C/p\u003E\u003Cp\u003EThanks\u003C/p\u003E\n"},{"CreatedByName":"Mecripp","CreatedById":181994,"CreatedDateTime":"2015-10-25T14:55:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022linuxgurugamer\u0022 data-cite=\u0022linuxgurugamer\u0022\u003E\u003Cdiv\u003Edoes anyone know who made the original antenna part models? and if so, how i can contct them.\u003Cp\u003EThanks\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn the very first one think some where from JDP and then they added so from a older AIES mod made by carmics and drop the older RT parts that was made by JDP or someone.\u003C/p\u003E\n"},{"CreatedByName":"Prezombie","CreatedById":152392,"CreatedDateTime":"2015-10-25T23:26:26Z","Content":"\n\u003Cp\u003EAwesome, but please be sure to add support to put the config button on blizzy\u0027s toolbar. The stock toolbar in the space center screen is already pretty crowded. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Stone Blue","CreatedById":77721,"CreatedDateTime":"2015-10-25T23:42:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022linuxgurugamer\u0022 data-cite=\u0022linuxgurugamer\u0022\u003E\u003Cdiv\u003Edoes anyone know who made the original antenna part models? and if so, how i can contct them.\u003Cp\u003EThanks\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHah...I just installed and started messing with these yesterday... JDP did most of them, however, several people besides JDP contributed models/animations...I know JDP gave permission to reuse, repurpose, and freely distribute HIS work on them... One of the modellers was SpaceGhost, who it seems hasnt been on in mnay months... NovaSilisko did one of the antennas, someone else did another, etc...\u003C/p\u003E\u003Cp\u003EThey all SEEM like they will work with RT2 in 1.0.4, except for the tracking animation of the MacroDish sr, and the deployment animation of one of the omnis...\u003C/p\u003E\u003Cp\u003EWhich ones were you interested in?\u003C/p\u003E\n"},{"CreatedByName":"shibdib","CreatedById":67597,"CreatedDateTime":"2015-10-26T00:53:34Z","Content":"\n\u003Cp\u003Ehaving a bunch of issues, setup 3 keo sats with one over the space center. But only 2 of them seem to want to connect to each other regardless of target settings.\u003C/p\u003E\u003Cp\u003EAlso target active ship doesn\u0027t seem to work at all. Have a bunch of low kerb orbit satellites that can\u0027t connect to or be connected to despite having clear line of site with the 2 working (linked) keo sats. \u003C/p\u003E\u003Cp\u003ERandomly depending on what sat I\u0027m controlling at the time different connections will occur, but once I switch to a newly connected sat it goes back to being no connection.\u003C/p\u003E\u003Cp\u003EInstalled with CKAN\u003C/p\u003E\n"},{"CreatedByName":"Stone Blue","CreatedById":77721,"CreatedDateTime":"2015-10-26T01:19:54Z","Content":"\n\u003Cp\u003EKinda sounds like you are lacking antennas, or the ones you have dont have proper range, or the spacing on your KEO sats is too far off....More details...What antennas do you have on the 3 KEO sats, as well as the LKO sats?...What is the Period for each KEO sat?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-26T01:22:00Z\u0022 title=\u002210/26/2015 01:22  AM\u0022 data-short=\u00228 yr\u0022\u003EOctober 26, 2015\u003C/time\u003E by Stone Blue\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"shibdib","CreatedById":67597,"CreatedDateTime":"2015-10-26T01:59:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Stone Blue\u0022 data-cite=\u0022Stone Blue\u0022\u003E\u003Cdiv\u003EKinda sounds like you are lacking antennas, or the ones you have dont have proper range, or the spacing on your KEO sats is too far off....More details...What antennas do you have on the 3 KEO sats, as well as the LKO sats?...What is the Period for each KEO sat?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe keo sats have a bunch of antennas, 2 of the really long extendy omni\u0027s (that should be in range of the sats orbitting right above the planet but aren\u0027t) and an assortment of the dish variety (that when I go to set targets say range is more than fine but still fail to connect).\u003C/p\u003E\u003Cp\u003ENot my first go around with remotetech, just took a break from the game and recently came back. Gonna start with uninstalling from ckan and doing a manual install, if that doesn\u0027t work than I\u0027ll be trying a vanilla game disabling all non part pack mods and seeing if something is conflicting.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/o1dZc5O.png\u0022 alt=\u0022o1dZc5O.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EYou can see there that KEOSAT-1 is in range\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/AGm7uN9.png\u0022 alt=\u0022AGm7uN9.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd it shows connected (presently controlling 1c, 1 is the bottom most in the image)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/YqEJmn4.png\u0022 alt=\u0022YqEJmn4.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHere I swapped to 1 and now I\u0027m no longer connected.\u003C/p\u003E\u003Cp\u003EThese were taken after trying a fresh install\u003C/p\u003E\u003Cp\u003EAlso this should show that sats in orbit of kerbin should have no difficulty with range but even they cannot be connected to when they are being controlled.\u003C/p\u003E\u003Cp\u003ESo I\u0027m guessing there\u0027s a conflict somewhere? \u003C/p\u003E\u003Cp\u003ECurrent mods\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E {\u003Cp\u003E \u0022name\u0022: \u0022Achievements\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u00221.8.1\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022Toolbar\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u00221.7.9\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022B9AerospaceProceduralParts\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u00220.40\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022CrossFeedEnabler\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u0022v3.3\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022ModuleManager\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u00222.6.8\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022CrewQueue\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u00221:ksp1.0_r2\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022FingerboxesCore\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u00222:1.0.4_r1\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022CrowdSourcedFlags\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u00221.42.3\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022EVAHandrailsPackContinued\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u00220.2.0\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022FASALaunchClamps\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u00225.34\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022FederalProductions-Flags\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u00220.1\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022FieldExperience\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u00221.0.2\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022ForScienceContinued\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u00221.1.0\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022KerboKatzUtilities\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u00221.2.11\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022InfernalRobotics\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u0022v0.21.3\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022Karbonite\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u00220.6.4\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022USITools\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u00220.5.2.0\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022CommunityResourcePack\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u00220.4.5.0\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022FirespitterCore\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u0022v7.1.4\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022KAS\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u00220.5.4\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022KerbalAlarmClock\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u0022v3.4.0.0\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022KerbalGPS\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u00221.0.23.5.01\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022KerbalizedFlagsandSpaceAgencies\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u00221.5\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022KerbalJointReinforcement\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u0022v3.1.4\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022KerbalStats\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u00222.0.0\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022KerboKatzSmallUtilities-AutoBalancingLandingLeg\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u00221.1.1\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022KerboKatzSmallUtilities-FillSpotsWithTourists\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u00221.0.0\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022KIS\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u00221.2.2\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022KronalVesselViewer\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u00220.0.4-1.0.4\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022WildBlueTools\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u00221.0.19\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022LSPFlags\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u0022v1.9\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022MechJeb2\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u00222.5.3\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022MechJebForAll\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u00221.2.0.0\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022NMSG\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u00221.3\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022UKS\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u00220.31.11.2\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022PortableScienceContainer\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u00221.3.0\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022ProceduralFairings\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u0022v3.15\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022RemoteTech\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u0022v1.6.8\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022RemoteTech-ProbeControlEnabler\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u0022v1.0\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022SCANsat\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u0022v14.2\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022FinalFrontier\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u00220.8.6-1370\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022ShipManifest\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u00224.4.1.1\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022StateFunding\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u00220.3.3\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022StationScience\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u00221.5\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022StockBugFixModules\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u0022v1.0.4c.2\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022USI-EXP\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u00220.4.2.0\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022ModuleRCSFX\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u0022v4.2\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022USI-FTT\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u00220.4.1\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022USI-LS\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u00220.1.5\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022IR-Model-Rework-Core\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u0022v01b\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022IR-Model-Rework-Expansion\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u0022v01b\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022TweakScale\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u0022v2.2.1\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022FilterExtensions\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u00222.4.1\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022ContractConfigurator\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u00221.7.7\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022InterstellarFuelSwitch\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u00221.17\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022InterstellarFuelSwitch-Core\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u00221.17\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022CactEyeTelescopesContinued\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u0022v0.6.8\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022DistantObject\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u0022v1.6.3\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022DistantObject-default\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u0022v1.6.3\u0022\u003C/p\u003E\u003Cp\u003E },\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E \u0022name\u0022: \u0022KaribouExpeditionRover\u0022,\u003C/p\u003E\u003Cp\u003E \u0022version\u0022: \u00220.1.0.1\u0022\u003C/p\u003E\u003Cp\u003E }\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-26T02:01:49Z\u0022 title=\u002210/26/2015 02:01  AM\u0022 data-short=\u00228 yr\u0022\u003EOctober 26, 2015\u003C/time\u003E by shibdib\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"FancyMouse","CreatedById":142946,"CreatedDateTime":"2015-10-26T02:24:50Z","Content":"\n\u003Cp\u003EWas the second picture connecting KEOSAT-1 because of the ActiveVessel target on KEOSAT-1? In fact, double check target settings on KEOSAT-1. ActiveVessel is likely to cause this kind of issues when it\u0027s not used properly.\u003C/p\u003E\n"},{"CreatedByName":"shibdib","CreatedById":67597,"CreatedDateTime":"2015-10-26T04:43:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FancyMouse\u0022 data-cite=\u0022FancyMouse\u0022\u003E\u003Cdiv\u003EWas the second picture connecting KEOSAT-1 because of the ActiveVessel target on KEOSAT-1? In fact, double check target settings on KEOSAT-1. ActiveVessel is likely to cause this kind of issues when it\u0027s not used properly.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAll of my relay sats have an activevessel antenna but in this case all the KEO satellites have dishes with specific targets amongst themselves. So KEO 1 has a dish targeting 1b and 1c along with active vessel. This was in theory to ensure that they\u0027re always connected.\u003C/p\u003E\n"},{"CreatedByName":"FancyMouse","CreatedById":142946,"CreatedDateTime":"2015-10-26T08:24:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022shibdib\u0022 data-cite=\u0022shibdib\u0022\u003E\u003Cdiv\u003EAll of my relay sats have an activevessel antenna but in this case all the KEO satellites have dishes with specific targets amongst themselves. So KEO 1 has a dish targeting 1b and 1c along with active vessel. This was in theory to ensure that they\u0027re always connected.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYour symptom is, in most cases, caused by the situation where KEOSAT-1 only has an ActiveVessel antenna that is working. If you have another one connecting directly to the other, it might not be functioning correctly. With only ActiveVessel antenna working, it can cause the second picture connecting but third picture not. You need to double check that. Specifically, because 1b is now blocked by Kerbin, your only option is to have an antenna on 1 specifically targeting 1c, otherwise it is expected it doesn\u0027t work.\u003C/p\u003E\n"},{"CreatedByName":"EasyAce","CreatedById":62958,"CreatedDateTime":"2015-10-26T21:20:49Z","Content":"\n\u003Cp\u003EI have a strange problem...\u003C/p\u003E\u003Cp\u003EMy probe is designed for a Duna mission. The plan is to aerobreak through the Duna atmosphere, but as you all know this brings some trials.\u003C/p\u003E\u003Cp\u003E1: The atmosphere will rip apart all antennas that are not withdrawn behind the heatshield.\u003C/p\u003E\u003Cp\u003E2: When antennas are withdrawn I cannot communicate With the probe.\u003C/p\u003E\u003Cp\u003E3: When the probe goes above the atmosphere on the other side of Duna, I want the antennas to depoly again (from their safety behind the heat Shield)\u003C/p\u003E\u003Cp\u003EAll this is duable With the Controls in RemoteTech. I\u0027ve used it before like this:\u003C/p\u003E\u003Cp\u003E* in 2 min, retract antennas and orient retrograde to point heatshield in front direction.\u003C/p\u003E\u003Cp\u003E* in 5 min, the probe enters the atmosphere\u003C/p\u003E\u003Cp\u003E* in 10 min the probe gets above from the atmosphere\u003C/p\u003E\u003Cp\u003E* in 13 min, depoly antennas\u003C/p\u003E\u003Cp\u003EI\u0027ve done this by setting the timer delay to the appropriate minutes and then push the actiongroup-key.\u003C/p\u003E\u003Cp\u003EBut now the Remote Control/machine does not seem to recognize me pushing the actiongroup keys.\u003C/p\u003E\u003Cp\u003EAnyone knows why, or have experienced this before?\u003C/p\u003E\n"},{"CreatedByName":"Prezombie","CreatedById":152392,"CreatedDateTime":"2015-10-28T04:37:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022EasyAce\u0022 data-cite=\u0022EasyAce\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAnyone knows why, or have experienced this before?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDid you double check your action group setup? Have you added any other mods lately? Does the action group run if you uninstall RT?\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-10-28T05:22:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Peppie23\u0022 data-cite=\u0022Peppie23\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EAdded disable/enable option for remotetech\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis alone is what I really really want (I want it all though, now that you said it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E ), No more keeping separate installs for my sandbox game I use to test lifters.\u003C/p\u003E\n"},{"CreatedByName":"MAFman","CreatedById":101780,"CreatedDateTime":"2015-10-28T06:16:20Z","Content":"\n\u003Cp\u003EHow would I go about writing a config that allows you to control vessels that are beyond range or the horizon, but doesn\u0027t allow you to transmit Science until you have a connection?\u003C/p\u003E\n"},{"CreatedByName":"Prezombie","CreatedById":152392,"CreatedDateTime":"2015-10-28T07:26:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MAFman\u0022 data-cite=\u0022MAFman\u0022\u003E\u003Cdiv\u003EHow would I go about writing a config that allows you to control vessels that are beyond range or the horizon, but doesn\u0027t allow you to transmit Science until you have a connection?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBeen made already, RemoteTech - Probe control enabler. in CKAN or \u003Ca href=\u0022https://github.com/Felger/FelgerFixes/releases\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/Felger/FelgerFixes/releases\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"icedown","CreatedById":129659,"CreatedDateTime":"2015-10-28T17:22:07Z","Content":"\n\u003Cp\u003ETo keep the problem of forgetting to extend antennas, I use smart parts. They can be set to either stage or trigger action groups based on fuel state, altitude, timers, and such. Since they are on board the craft, they work even without a connection. When I have a mission that requires aerobraking, especially multiple laps, I have one set based on altitude, that only activates antennas, not toggle. I have it set so that it does it at a specific altitude, on ascent only, and resets. With that, every time I climb above a certain altitude, no matter if the antennas are already out or not, it attempts to start them. They have saved me many unmanned ships.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://kerbalstuff.com/mod/760/Smart%20Parts\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://kerbalstuff.com/mod/760/Smart%20Parts\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"MAFman","CreatedById":101780,"CreatedDateTime":"2015-10-31T06:16:15Z","Content":"\n\u003Cp\u003EI would like to make a \u0022lite\u0022 version of this where if you go out of range, say you cross the horizon with respect to ground control, you can still control your vessel, but you cannot transmit Science or, say, activate SAS because (I guess) Mission Control would have to send the \u0022point here\u0022 command. May I do that, and how would I go about that? I am familiar with C#.\u003C/p\u003E\n"},{"CreatedByName":"Jovus","CreatedById":117163,"CreatedDateTime":"2015-10-31T08:17:37Z","Content":"\n\u003Cp\u003EThat mod already exists, actually. It\u0027s the Remote Tech Probe Control Enabler, and you can either get it through CKAN or here: \u003Ca href=\u0022https://github.com/Felger/FelgerFixes\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/Felger/FelgerFixes\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Tralfagar","CreatedById":150801,"CreatedDateTime":"2015-11-01T19:25:08Z","Content":"\n\u003Cp\u003EI\u0027m trying to mod some station components to act like the \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/RC-L01_Remote_Guidance_Unit\u0022 rel=\u0022external nofollow\u0022\u003ERemote Guidance Unit\u003C/a\u003E in your mod (i.e. have over X kerbals on board, reset signal lag times, and act as a command center). However, I can\u0027t find where the RGU information is in the mod. According to the wiki, it should be called ProbeStackLarge in the game data files. But in the /GameData/RemoteTech/RemoteTech_Squad_Probes.cfg file, the RGU doesn\u0027t have anything that looks like it similar to other probes. Is the information stored somewhere I overlooked, or is it not possible to add this functionality without writing a new .dll file?\u003C/p\u003E\n"}]}