{"TopicId":78013,"ForumId":34,"TopicTitle":"[0.90]NEAR: A Simpler Aerodynamics Model v1.3.1 12/16/14","CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-07-17T22:18:07Z","PageNum":22,"Articles":[{"CreatedByName":"yohuan","CreatedById":120524,"CreatedDateTime":"2014-10-22T08:00:47Z","Content":"\n\u003Cp\u003ENot sure which mod to reply too but im using the MK2 lighting cockpit and the intakes have way too much drag so plane can barely get past 150 m/s, so i have to close those intakes and use another air intake which make the craft easily hit 300 m/s.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-10-22T08:01:49Z","Content":"\n\u003Cp\u003EUpdate the cockpit mod, it should have a fix.\u003C/p\u003E\n"},{"CreatedByName":"Sobanaut","CreatedById":126816,"CreatedDateTime":"2014-10-22T08:06:53Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EHey guys,\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EI want to report issue with NEAR. Initially I had problem with parachutes (excessive heat damage) and then they just get ripped off. I have NEAR, Deadly Reentry and bunch of other mods installed, everything up to date. \u003C/span\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EI skimmed through the thread and it looks like you need to be below 400m/s to deploy chutes (I am using RealChutes), fine.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EHowever there is a problem, I cant slow down to that velocity...\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EUsing Mk.1 pod going straight down from 100km I hit the ground at about 500-600 m/s. \u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EI suspected it might be something to do with drag so I installed FAR and it worked perfectly, it slowed me down significantly, enough to deploy chutes safely at subsonic speed (at around 7km). So I believe it is safe to assume that there is an issue with drag in NEAR.\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"yohuan","CreatedById":120524,"CreatedDateTime":"2014-10-22T08:47:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003EUpdate the cockpit mod, it should have a fix.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGreat thanks \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Pondafarr","CreatedById":99169,"CreatedDateTime":"2014-10-22T10:19:48Z","Content":"\n\u003Cp\u003ESimilar effect, I have a basic spaceplane, and I used AtmosphericTrajectories to deorbit at an appropriate spot to land at the KSC. Didn\u0027t have quite enough dV, so i could only get my periapsis down to ~30. Used SVEL\u002B (with a few degrees up), intending to use aerobraking to slow. I found my orbital velocity would not drop below 2k, even with pitch of 45deg. The plane refused to slow down, so i circumnavigated the planet , power off, at about about 41k altitude. It was actually kinda cool. Then when it finally did slow down (RCS slowed me eventually), my craft spin out of control and crashed. THAT was clearly my fault, I had burned her dry, and was at COM=COL, therefore I didn\u0027t have enough control.\u003C/p\u003E\u003Cp\u003ENo way to show a log, and didn\u0027t video it, but it was very interesting. \u003C/p\u003E\u003Cp\u003ESolution: Pack more dV to drop the periapsis lower, and download a drouge chute from somewhere \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"biohazard15","CreatedById":91655,"CreatedDateTime":"2014-10-24T20:13:30Z","Content":"\n\u003Cp\u003EI have a question regarding the fairings.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/CzUKcqh.jpg\u0022 alt=\u0022CzUKcqh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/MzqF56o.jpg\u0022 alt=\u0022MzqF56o.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe question is, why is my ship isn\u0027t shielded (by all logical means, it should be - there is no openings between fairing and LES) and how do I make it shielded? \u0022Delete LES and use usual fairings\u0022 is not an option \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ve tried to add a second ring between LES and ship to make fairings clip there, but that didn\u0027t work either - the payload is still labeled as unshielded.\u003C/p\u003E\u003Cp\u003EOr I should go somewhere else with tht question (like PF thread)?\u003C/p\u003E\n"},{"CreatedByName":"Xenro66","CreatedById":123894,"CreatedDateTime":"2014-10-24T20:22:19Z","Content":"\n\u003Cp\u003EReporting a problem. NEAR is disabling the SP\u002B control surfaces completely. They\u0027re just inert and won\u0027t move. I\u0027m fairly certain that it is infact NEAR that\u0027s causing this.\u003C/p\u003E\u003Cp\u003EI reinstalled KSP, tried it without any mods, control surfaces worked. added a batch of mods (not including NEAR), they still worked. Removed that batch and put another batch in (of 5) WITH NEAR, they stopped working. I removed NEAR and they began working again.\u003C/p\u003E\u003Cp\u003ESo I think that\u0027s enough evidence. I am not sure what is going on, I\u0027m currently re-downloading this mod and trying it again. Will report back if the situation changes.\u003C/p\u003E\u003Cp\u003E- Xenro66\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-10-24T20:23:56Z","Content":"\n\u003Cp\u003EXenro66: are you using NEAR on an unsupported KSP? (i.e. not-25, or 25 Win x64?)\u003C/p\u003E\n"},{"CreatedByName":"FirstSecondThird","CreatedById":110726,"CreatedDateTime":"2014-10-24T23:28:27Z","Content":"\n\u003Cp\u003Eferram4, YOU ARE AWESOME!\u003C/p\u003E\n"},{"CreatedByName":"Pondafarr","CreatedById":99169,"CreatedDateTime":"2014-10-25T02:18:51Z","Content":"\n\u003Cp\u003ECome to think of it, I have the same problem, my control surfaces don\u0027t move at all, I assumed I was having a graphics problem, but it would explain why my planes are difficult to control, they must be relying on torque completely...which is bad. I just confirmed Xenro\u0027s assessment that removal of NEAR re-enables the new SP\u002B control surfaces. \u003C/p\u003E\u003Cp\u003EI verified I\u0027m using the x86 version of .25 KSP.exe.\u003C/p\u003E\u003Cp\u003ESpaceplane operations are suspended by order of Jeb until this is independently confirmed.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Xenro66\u0022 data-cite=\u0022Xenro66\u0022\u003E\u003Cdiv\u003EReporting a problem. NEAR is disabling the SP\u002B control surfaces completely. They\u0027re just inert and won\u0027t move. I\u0027m fairly certain that it is infact NEAR that\u0027s causing this.\u003Cp\u003EI reinstalled KSP, tried it without any mods, control surfaces worked. added a batch of mods (not including NEAR), they still worked. Removed that batch and put another batch in (of 5) WITH NEAR, they stopped working. I removed NEAR and they began working again.\u003C/p\u003E\u003Cp\u003ESo I think that\u0027s enough evidence. I am not sure what is going on, I\u0027m currently re-downloading this mod and trying it again. Will report back if the situation changes.\u003C/p\u003E\u003Cp\u003E- Xenro66\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-10-25T02:32:59Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@biohazard: \u003C/strong\u003EI cannot reproduce the issue. I\u0027m not sure what\u0027s wrong.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@Pondafarr \u0026amp; Xenro66: \u003C/strong\u003EI\u0027ve attempted to reproduce from a stock NEAR install, and cannot reproduce it. All SP\u002B control surfaces function properly; I suspect that you haven\u0027t installed NEAR correctly, do not have a copy of ModuleManager installed, or are using something that interferes with NEAR.\u003C/p\u003E\n"},{"CreatedByName":"AetherGoddess","CreatedById":115971,"CreatedDateTime":"2014-10-25T05:13:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003E@Pondafarr \u0026amp; Xenro66: \u003C/strong\u003EI\u0027ve attempted to reproduce from a stock NEAR install, and cannot reproduce it. All SP\u002B control surfaces function properly; I suspect that you haven\u0027t installed NEAR correctly, do not have a copy of ModuleManager installed, or are using something that interferes with NEAR.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAre you using the SP\u002B surfaces that come with .25, or do you have left-over, possibly colliding parts from .24.2\u0027s version of SP\u002B?\u003C/p\u003E\n"},{"CreatedByName":"FirstSecondThird","CreatedById":110726,"CreatedDateTime":"2014-10-25T11:58:59Z","Content":"\n\u003Cp\u003EThis is what helped me learn to fly aircraft and spaceplanes using FAR. It is really quite the FAR for noobs.\u003C/p\u003E\n"},{"CreatedByName":"Pondafarr","CreatedById":99169,"CreatedDateTime":"2014-10-25T12:27:46Z","Content":"\n\u003Cp\u003EAHHA! I did not notice you had a 1.3(A) version, installed that, and everything works properly now...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003E@biohazard: \u003C/strong\u003EI cannot reproduce the issue. I\u0027m not sure what\u0027s wrong.\u003Cp\u003E\u003Cstrong\u003E@Pondafarr \u0026amp; Xenro66: \u003C/strong\u003EI\u0027ve attempted to reproduce from a stock NEAR install, and cannot reproduce it. All SP\u002B control surfaces function properly; I suspect that you haven\u0027t installed NEAR correctly, do not have a copy of ModuleManager installed, or are using something that interferes with NEAR.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2014-10-25T12:51:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022biohazard15\u0022 data-cite=\u0022biohazard15\u0022\u003E\u003Cdiv\u003EI have a question regarding the fairings.\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/CzUKcqh.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/CzUKcqh.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/MzqF56o.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/MzqF56o.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe question is, why is my ship isn\u0027t shielded (by all logical means, it should be - there is no openings between fairing and LES) and how do I make it shielded? \u0022Delete LES and use usual fairings\u0022 is not an option \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ve tried to add a second ring between LES and ship to make fairings clip there, but that didn\u0027t work either - the payload is still labeled as unshielded.\u003C/p\u003E\u003Cp\u003EOr I should go somewhere else with tht question (like PF thread)?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis fairing type is bad at actually shielding anything. Try attaching another fairing base upside down under the LES, and using normal fairings.\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2014-10-26T11:21:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sobanaut\u0022 data-cite=\u0022Sobanaut\u0022\u003E\u003Cdiv\u003EHey guys,\u003Cp\u003EI want to report issue with NEAR. Initially I had problem with parachutes (excessive heat damage) and then they just get ripped off. I have NEAR, Deadly Reentry and bunch of other mods installed, everything up to date. I skimmed through the thread and it looks like you need to be below 400m/s to deploy chutes (I am using RealChutes), fine.\u003C/p\u003E\u003Cp\u003EHowever there is a problem, I cant slow down to that velocity...\u003C/p\u003E\u003Cp\u003EUsing Mk.1 pod going straight down from 100km I hit the ground at about 500-600 m/s. \u003C/p\u003E\u003Cp\u003EI suspected it might be something to do with drag so I installed FAR and it worked perfectly, it slowed me down significantly, enough to deploy chutes safely at subsonic speed (at around 7km). So I believe it is safe to assume that there is an issue with drag in NEAR.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m coming here to report this exact issue.\u003C/p\u003E\u003Cp\u003ENEAR v1.3.0\u003C/p\u003E\u003Cp\u003EDeadly Reentry v6.2.1\u003C/p\u003E\u003Cp\u003ETrajectories v0.4.1.0\u003C/p\u003E\u003Cp\u003EThat\u0027s all the mods I have that involve the aerodynamics model in any form, I think. This is on KSP .25 32bit.\u003C/p\u003E\u003Cp\u003ESample bug description:\u003C/p\u003E\u003Cp\u003EBog-standard single person pod with three items weighing 0.15 each attached to it: two radial chutes, one DMagic Orbital Sciences magnetometer. Also two physicsless 2HOT thermometers. Finally, there\u0027s a Kerbal Engineer Redux chip (zero weight and drag) clipped into the model under the heatshield. I\u0027m going to test again if this is messing with the aerodynamics, but the first two times I landed this pod everything worked fine, so it doesn\u0027t seem to be a guaranteed cause.\u003C/p\u003E\u003Cp\u003EThe next two times I attempted to land this capsule, it suddenly decided to not want to slow down properly anymore.\u003C/p\u003E\u003Cp\u003EThe first instance was on an aborted launch. My experimental strut-less SRB assembly wobbled itself to pieces and I had to decouple the capsule 20km up. From that height, it fell, and I expected it would eventually hit terminal velocity between 100 and 200m/s when nearing the ocean, which would allow me to open the chutes safely (as I had done in the past). But instead, it accelerated. And accelerated. And accelerated. By the time it hit the water, it was supersonic and of course the chutes had torn off because it was moving so fast. The next launch after that succeeded, I reached orbit and did some sciencing. I then deorbited from a 73x71 km orbit in a nice and gentle, shallow slope. The pod came down in a fiery show of reentry effects, the heatshield held, and then it was Mach effects all the way down until it impacted the grasslands at less than 50 meters elevation going nearly 450 m/s still. Needless to say that the chutes did not survive me trying to open them this time either.\u003C/p\u003E\u003Cp\u003EIt could be that this is an issue that randomly starts happening after scene changes. Something that causes the drag calculation to trip over itself? I\u0027m really not sure how to pin it down myself, or if it is even NEAR\u0027s fault and not some other mod, but I\u0027ll try testing more. If there\u0027s anything you want me to provide - more details, logs, etc. - feel free to ask.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-10-26T11:56:31Z","Content":"\n\u003Cp\u003EAnd an output_log.txt? Something is clearly breaking, but I have no idea what without a log.\u003C/p\u003E\n"},{"CreatedByName":"Sobanaut","CreatedById":126816,"CreatedDateTime":"2014-10-26T12:26:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003EAnd an output_log.txt? Something is clearly breaking, but I have no idea what without a log.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWould love to help, but log of what do you want to see? I can crash a mk.1 pod straight into the ground from 100km, and upload a log, is it going to help?\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2014-10-26T12:48:42Z","Content":"\n\u003Cp\u003EOkay, two more test flights conducted today. Output log: \u003Ca href=\u0022https://dl.dropboxusercontent.com/u/44754370/output_log.zip\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://dl.dropboxusercontent.com/u/44754370/output_log.zip\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ERight after loading KSP, I grabbed my saved rocket design, flew it into orbit, and performed a reentry. Once again, aerodynamics failed to provide enough drag to get the pod out of the supersonic regime before faceplanting into the ground.\u003C/p\u003E\u003Cp\u003EI then reverted to vehicle assembly, pulled the clipped KER chip out of the pod, and put it inside a decoupler elsewhere in the vessel. That means there is no longer a KER part present anywhere on the pod when it reenters. I launched the craft like that, orbited, and performed a reentry. Suddenly, drag! This time everything worked, and I was slowed down just as expected.\u003C/p\u003E\u003Cp\u003EPotentially, NEAR reacts allergic to this zero mass, zero drag KER part. I \u003Cem\u003Ethink\u003C/em\u003E it flew okay at least once or twice, so it may not be guaranteed to fail, but it\u0027s pointing more and more strongly in that direction. I\u0027ve had other inexplicable landing failures in the past while playing this savegame too, during which I might have had the KER chip attached to the side of the pod (not clipped under the heatshield). So maybe the mere presence is enough, regardless of it\u0027s position? I\u0027m not sure.\u003C/p\u003E\u003Cp\u003EI\u0027m wondering if things would change if I give the KER part proper mass and drag and just declare it physicsless (I\u0027m not sure why it isn\u0027t configured like that to begin with, as the intention is obvious). How does NEAR usually react to a physicsless part? Is it completely ignored, or will the shape influence aerodynamic properties while only mass is ignored?\u003C/p\u003E\u003Cp\u003EEDIT: I tested this by reloading a quicksave from a previously failed attempt to land after making the part genuinely physicsless. The landing still failed.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-26T13:23:58Z\u0022 title=\u002210/26/2014 01:23  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 26, 2014\u003C/time\u003E by Streetwind\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-10-26T13:51:08Z","Content":"\n\u003Cp\u003EI see nothing breaking in the log. I also know from experience that KER parts do not cause the behavior described. In particular, 0 mass, 0 stock drag parts aren\u0027t treated any differently by NEAR, so there shouldn\u0027t be any problems. The only issue is that the KER part clipped into the bottom of the pod might confuse it into thinking that the heat shield is covered, and so that there is no drag there. In practice, this should lead to the KER part being destroyed during reentry.\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2014-10-26T14:16:24Z","Content":"\n\u003Cp\u003EIt heats up a whole lot (1500\u002B degrees) but due to having maxtemp = 3600 set in the config, it does not get destroyed. This might be different for a more steep or higher speed reentry than the shallow, low-orbit reentries I tried so far... but I have a feeling that every other part in the reentering vessel will have long since melted down before this thing dies \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003ENow I wonder of Pondafarr\u0027s spaceplane and Sobanaut\u0027s pod had similar issues with the game thinking the heatshield was covered so much that it didn\u0027t produce drag. It\u0027s odd though that Sobanaut stated that he was able to fix things by switching to FAR. I\u0027m also wondering how a spaceplane could \u003Cem\u003Eavoid\u003C/em\u003E having objects interposed between the air and the heatshield, since it kind of requires carrying landing gear under the belly.\u003C/p\u003E\u003Cp\u003EIn any case, I\u0027ll be keeping a very close eye on this kind of behavior from now on. If I notice any odd landing failures now that I stopped carrying the KER chip on the pod, I\u0027ll report it.\u003C/p\u003E\n"},{"CreatedByName":"AHDB","CreatedById":94602,"CreatedDateTime":"2014-10-28T18:46:28Z","Content":"\n\u003Cp\u003EI experienced the same bug as Pondafarr and Xenro66 after playing successfully with NEAR for some time. Aerodynamics dropped out of the game completely, and no control surfaces would function. Turned out, the near.dll had gone missing from its plugin folder, and replacing it with a fresh copy solved all problems. \u003C/p\u003E\u003Cp\u003ENo idea why it vanished in the first place, but I\u0027m happy to have it back.\u003C/p\u003E\n"},{"CreatedByName":"stardestroyer","CreatedById":106618,"CreatedDateTime":"2014-10-28T23:28:02Z","Content":"\n\u003Cp\u003EI\u0027m getting a trouble: with Kerbin Shuttle Orbiter System (EWBCL) I do a quite normal reentry (exeption for battery depletation) until I descent under 8000m at less than 400m\\s; in proximity of the runaway I reactivate SAS and i get an incredible acceleration over 1000m\\s and I can\u0027t land... Everytime I try I get this effect. Is it NEAR related?\u003C/p\u003E\u003Cp\u003EI also use: Deadly Reentry v6.2.1, Trajectories v0.4.1.0, Firesplitter latest hotfix and B9.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-10-28T23:37:09Z","Content":"\n\u003Cp\u003EThat is because KSO is not set up to be NEAR / FAR-compatible. This is a problem on their end, nothing I can do about it.\u003C/p\u003E\n"},{"CreatedByName":"Mekan1k","CreatedById":48750,"CreatedDateTime":"2014-11-02T04:45:56Z","Content":"\n\u003Cp\u003EAnyone know why the Radial engine body (from stock \u002B Stock Part Revamp) and the smaller version (from Tavarius\u0027s Pizza and Aerospace) is listed as having fuel when this mod and the Modular FuelTanks mod is active?\u003C/p\u003E\u003Cp\u003ECan anyone duplicate this result, or is it just me?\u003C/p\u003E\n"}]}