{"TopicId":82643,"ForumId":34,"TopicTitle":"[1.0.4] BoxSat vA.02f - Updated 09/16/2015","CreatedByName":"DasPenguin85","CreatedById":16322,"CreatedDateTime":"2014-08-23T21:09:32Z","PageNum":21,"Articles":[{"CreatedByName":"Armarnis","CreatedById":134739,"CreatedDateTime":"2015-02-16T20:10:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MeCripp\u0022 data-cite=\u0022MeCripp\u0022\u003E\u003Cdiv\u003EYou can try this \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/91616-0-90-BoxSat-vA-02d-Updated-01-13-2015?p=1675941\u0026amp;viewfull=1#post1675941\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/91616-0-90-BoxSat-vA-02d-Updated-01-13-2015?p=1675941\u0026amp;viewfull=1#post1675941\u003C/a\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ewill give that a look, thanks a lot!\u003C/p\u003E\n"},{"CreatedByName":"C1maCat","CreatedById":121247,"CreatedDateTime":"2015-02-18T04:04:41Z","Content":"\n\u003Cp\u003EIs it possible that you will ever add an RTG module? Recently I\u0027ve been sending boxsats all over the planets added by OPM, and with the solar power curve it makes it so I have to use RTGs, but they ruin the box appearence!\u003C/p\u003E\n"},{"CreatedByName":"Mecripp","CreatedById":181994,"CreatedDateTime":"2015-02-18T04:31:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022C1maCat\u0022 data-cite=\u0022C1maCat\u0022\u003E\u003Cdiv\u003EIs it possible that you will ever add an RTG module? Recently I\u0027ve been sending boxsats all over the planets added by OPM, and with the solar power curve it makes it so I have to use RTGs, but they ruin the box appearence!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou could just edit or make a MM to add a RTG to a part or stick a RTG or 2 in the empty tray.\u003C/p\u003E\u003Cp\u003EEDIT- Or pick a part and will write you a MM to make it a RTG or if, I\u0027m not to lazy will write one with 1 or 2 inside the empty tray if you want ?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-18T04:36:48Z\u0022 title=\u002202/18/2015 04:36  AM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 18, 2015\u003C/time\u003E by Mecripp2\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Vorg","CreatedById":74652,"CreatedDateTime":"2015-02-21T05:47:49Z","Content":"\n\u003Cp\u003EThe 3 antennas with this mod seem broke. In hanger in career mode, the option to extend them does nothing and in flight the just says \u0022locked\u0022. They also are not even reconized as antenna when trying to transmit.\u003C/p\u003E\n"},{"CreatedByName":"Mecripp","CreatedById":181994,"CreatedDateTime":"2015-02-21T13:35:12Z","Content":"\n\u003Cp\u003EWork fine for me and you using RT ?\u003C/p\u003E\n"},{"CreatedByName":"Viruzzz","CreatedById":78314,"CreatedDateTime":"2015-02-21T18:22:16Z","Content":"\n\u003Cp\u003EI can confirm all antennas working good with RT config downloading from first post.\u003C/p\u003E\u003Cp\u003EExtract the files from arhive then copy RemoteTech_BoxSat.cfg from Optional ModuleManager files directory and put in your GameData\u003C/p\u003E\n"},{"CreatedByName":"Vorg","CreatedById":74652,"CreatedDateTime":"2015-02-21T21:47:33Z","Content":"\n\u003Cp\u003ENo, Remote tech is one I\u0027m not using.\u003C/p\u003E\u003Cp\u003EBoxSat vA.02d\u003C/p\u003E\u003Cp\u003EChatterer_v0.8.1\u003C/p\u003E\u003Cp\u003ECTNsnacks\u003C/p\u003E\u003Cp\u003EDockingPortAlignment_4.0\u003C/p\u003E\u003Cp\u003EKAS_0.4.10\u003C/p\u003E\u003Cp\u003EKerbalAlarmClock_3.2.3.0\u003C/p\u003E\u003Cp\u003EKerbalEngineer-1.0.15.2\u003C/p\u003E\u003Cp\u003EKSP-AVC-1.1.5.0\u003C/p\u003E\u003Cp\u003EMapResourceOverlay.0.2.9\u003C/p\u003E\u003Cp\u003EMechJeb2-2.4.2.0\u003C/p\u003E\u003Cp\u003EModuleManager-2.5.6\u003C/p\u003E\u003Cp\u003ENavBallDockingAlignmentIndicator\u003C/p\u003E\u003Cp\u003EPreciseNode-1.1.2\u003C/p\u003E\u003Cp\u003ERCSBuildAid_v0.6.1\u003C/p\u003E\u003Cp\u003ESCANsat_v9rc4.1\u003C/p\u003E\u003Cp\u003ESnacks.v0.3.3alpha\u003C/p\u003E\u003Cp\u003ESnacksPartsByWhyren\u003C/p\u003E\u003Cp\u003EStageRecovery_1.5.3\u003C/p\u003E\u003Cp\u003EToolbar-1.7.8\u003C/p\u003E\u003Cp\u003ETrajectories-1.1.3\u003C/p\u003E\u003Cp\u003ETransferWindowPlanner_1.2.3.0\u003C/p\u003E\u003Cp\u003EOn another note, last night I made a sat with a frame between 2 FL-R25 tanks and a pair of O-10 mono engines so that it would have enough thrust/Dv to put it in the high mission orbit only to have the thing spin every time the engines fired. Just spent a bunch of time trying to figure out was was making it off balance. Expermented with/out the side panel and tried the blowoff version. According to RCS build aid, the problem was any time I put any of the modules in the box where they belonged. Even the BoxSat engine was proper when mounted outside, but when used with the cargo box to give a bottom attachment ball, it was out of wack again.\u003C/p\u003E\u003Cp\u003EThen I found this back aways in the thread:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EIf you look at the stack nodes in most of the boxsat module config files you\u0027ll see that they have a z offset of 0.005 (our parts are scale = 1 so that\u0027s 5mm if my brain is working correctly). The probe core reaction wheels put out 0.01 kNm of torque. This is enough to cancel out the torque generated by a typical fully loaded one frame boxsat putting out approximately 3kN of thrust (reaction wheel will be maxed out). If you want to use the LV-1 engine at full power you will need to incude a reaction wheel module to cancel out the additional torque. This is working as designed. Do you find this imbalance to be a significant problem while using BoxSat? \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI always viewed reaction wheels as an option to or to work in tandom with RCS thrusters for when you want to rotate the craft, not to keep it from rotating because of poor balancing. If I put something big on one side and small on the other, I expect it to have problems and would look for way to balance it. If you build a larger craft, you ether need larger wheels or more RCS thrusters or both. But when everything is built center line and the craft is so tiny....\u003C/p\u003E\u003Cp\u003ESo it seems the access panels make it even worse. I would have expected that they would have helped to make the base box balanced. But it instead, they seem to add to the off center mass caused by the modules inside. So the basic box is blanaced, but the panel and the modules both through the mass off center in the same direction.\u003C/p\u003E\u003Cp\u003ECould we get a second attach ball on the blow hatch for attaching on top of rockets? would make it a ton more useful.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-23T00:33:05Z\u0022 title=\u002202/23/2015 12:33  AM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 23, 2015\u003C/time\u003E by Vorg\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"tschieggm","CreatedById":133979,"CreatedDateTime":"2015-02-23T03:43:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022orcmaul\u0022 data-cite=\u0022orcmaul\u0022\u003E\u003Cdiv\u003EThe engines are designed to be installed inside the payload frame. A bottom node for the engines has been requested and we are evaluating whether it can be done without causing problems.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u002B1 for adding a bottom node on the engines. Ran into this today trying (and failing) at attach a decoupler.\u003C/p\u003E\n"},{"CreatedByName":"Vorg","CreatedById":74652,"CreatedDateTime":"2015-03-05T21:10:22Z","Content":"\n\u003Cp\u003EI tried to put 3 sats up at once. Each was a Box sat frame with a control module and 3 LFO modules. 2 box sat folding solar pannels, a radar from Scansat, Comtron 16, and 4 of the plasma RCS units and a pannel. Below that, the Boxsat payload box with 4 more plasma units, the LFO engine, a multi-spectral sensor, a KA-100 from Karbonite and 2 Z-400 batteries. Below that a TR-2V, then Clamp-o tron, FL-T200, 48-7S, TR-V2, TR-V1180C to bring them together.\u003C/p\u003E\u003Cp\u003EThe craft is in equatorial and the first probe is to go in to Polar orbit. \u003C/p\u003E\u003Cp\u003EFirst thing I had to do was send up a second mission to swap out an LFO for a reaction module because of the balance problem throwing off the lower stage making it spin. \u003C/p\u003E\u003Cp\u003ENext problem I see is the batteries on the side don\u0027t seem to be used, but I seemed to have enough as it is in the sun though not full sun.\u003C/p\u003E\u003Cp\u003ENether Engineer or MechJeb seem to see the fuel in the upper stage.\u003C/p\u003E\u003Cp\u003EHad a bit of a time getting zoomed inside the craft to click the control module hiding behind the panel for control from here because the game wanted to control from the clamp, but that didn\u0027t change the Dv report.\u003C/p\u003E\u003Cp\u003EMechjeb did not auto stage and when I manually staged, it cleared the marker.\u003C/p\u003E\u003Cp\u003EAfter stating, Dv was still not being reported and the game only showed the engine stage, not any fuel even though the engine was on.\u003C/p\u003E\u003Cp\u003EThe probe ended up too low after the partial angle change with not enough time to correct it. Mech Jeb also complained about trying to set the AP higher then the current altitude when all I really wanted was for it to quickly set up a node raise that side of the orbit back out of the attmo. Didn\u0027t matter if it was AP or PA after the burn.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-05T21:12:27Z\u0022 title=\u002203/05/2015 09:12  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 5, 2015\u003C/time\u003E by Vorg\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Deltervees","CreatedById":133567,"CreatedDateTime":"2015-03-13T18:16:40Z","Content":"\n\u003Cp\u003EDoes anyone have/can someone please make a TweakScale Config?\u003C/p\u003E\n"},{"CreatedByName":"Mecripp","CreatedById":181994,"CreatedDateTime":"2015-03-13T18:38:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Deltervees\u0022 data-cite=\u0022Deltervees\u0022\u003E\u003Cdiv\u003EDoes anyone have/can someone please make a TweakScale Config?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E Did you look in the download folder ? \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EAlpha.02 09/01/2014\u003Cp\u003E-Added 4 science parts and 3 antennas\u003C/p\u003E\u003Cp\u003E-Fixed RCS tri name\u003C/p\u003E\u003Cp\u003E-Moved mod compatibility to module manager configs\u003C/p\u003E\u003Cp\u003E-\u003Cspan style=\u0022color:#FF0000;\u0022\u003EAdded module manager configs for tweak scale, kerbal engineer, and kOS\u003C/span\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEDIT- It\u0027s in the Optional ModuleManager files in the download.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-13T18:42:11Z\u0022 title=\u002203/13/2015 06:42  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 13, 2015\u003C/time\u003E by Mecripp2\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Yemo","CreatedById":114412,"CreatedDateTime":"2015-03-29T21:00:35Z","Content":"\n\u003Cp\u003EHey,\u003C/p\u003E\u003Cp\u003Ethat is a great mod you have there, very nice system for small sats.\u003C/p\u003E\u003Cp\u003EAlthough I have some \u003Cstrong\u003Ecompatibility issues.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThe main problem is, that your folder is called \u0022BoxSat alpha\u0022, instead of \u0022BoxSat\u0022 or \u0022BoxSatAlpha\u0022.\u003C/p\u003E\u003Cp\u003EThat space is a problem for ModuleManager, could you please change that folder name?\u003C/p\u003E\u003Cp\u003EAnd a \u003Cstrong\u003Esuggestion for your optional module manager files:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EIf you replace eg that code\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E@PART[62cm_BoxSat_BlowoffHatch] \u003Cbr\u003E{\u003Cbr\u003E    MODULE\u003Cbr\u003E    {\u003Cbr\u003E        name = TweakScale\u003Cbr\u003E            type = stack\u003Cbr\u003E            defaultScale = 0.625\u003Cbr\u003E    }\u003Cbr\u003E}\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Ewith this code\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E@PART[62cm_BoxSat_BlowoffHatch]:NEEDS[TweakScale]\u003Cbr\u003E{\u003Cbr\u003E    MODULE\u003Cbr\u003E    {\u003Cbr\u003E        name = TweakScale\u003Cbr\u003E            type = stack\u003Cbr\u003E            defaultScale = 0.625\u003Cbr\u003E    }\u003Cbr\u003E}\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Ethe patch only gets applied when TweakScale is installed.\u003C/p\u003E\u003Cp\u003ESo there is no need to distribute the configs in a separate folder and make players install them manually.\u003C/p\u003E\u003Cp\u003EThey are just applied when then needed mods are installed.\u003C/p\u003E\u003Cp\u003EWhich is actually the reason for the compatibility issue above.\u003C/p\u003E\u003Cp\u003EIn order for that :NEEDS[whatever] statement to work, the mods folder under GameData is not allowed to contain spaces like your \u0022BoxSat alpha\u0022 currently has.\u003C/p\u003E\u003Cp\u003EThank you very much!\u003C/p\u003E\n"},{"CreatedByName":"Mecripp","CreatedById":181994,"CreatedDateTime":"2015-03-29T21:29:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Yemo\u0022 data-cite=\u0022Yemo\u0022\u003E\u003Cdiv\u003EHey,\u003Cp\u003ESNIP \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhen writing a MM patch for a part that has a space in the name use $ for the space like BoxSat$alpha and really what does it matter if people can\u0027t read the main thread on how to install there are some mods that :NEED and :FOR have been added for a MM patch for a mod and that makes problems and really people just need to READ HOW TO INSTALL instead of theres the download button download and then post, I got a problem ( REALLY ).\u003C/p\u003E\n"},{"CreatedByName":"Yemo","CreatedById":114412,"CreatedDateTime":"2015-03-29T21:41:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MeCripp\u0022 data-cite=\u0022MeCripp\u0022\u003E\u003Cdiv\u003EWhen writing a MM patch for a part that has a space in the name use $ for the space like BoxSat$alpha and really what does it matter if people can\u0027t read the main thread on how to install there are some mods that :NEED and :FOR have been added for a MM patch for a mod and that makes problems and really people just need to READ HOW TO INSTALL instead of theres the download button download and then post, I got a problem ( REALLY ).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThank you for the $ help, though naturally I m hesitant to write a config for a mod which does not follow naming conventions.\u003C/p\u003E\u003Cp\u003EBecause I would have to revisit it and change my MM configs, when the \u0022alpha\u0022 from \u0022BoxSat alpha\u0022 is dropped, or it actually does follow the no-spaces-in-folder-names convention.\u003C/p\u003E\u003Cp\u003EWhich is ok for one mod, but totally undoable for 20 or so.\u003C/p\u003E\u003Cp\u003EYes, I know that feeling, there are quite a few compatibility files and requirements, but draggin and dropping single config files for mod support may work for one mod or the odd exceptions, but hardly for 20\u002B.\u003C/p\u003E\u003Cp\u003EImho users could read more descriptions, but having to drag and drop MM compatibility configs without reason does not encourage that, it just leads to unnecessary problems.\u003C/p\u003E\n"},{"CreatedByName":"shoe7ess","CreatedById":114974,"CreatedDateTime":"2015-04-12T02:54:41Z","Content":"\n\u003Cp\u003EAnyone know how to get the parts showing up with Realism Overhaul \u002B RP-0? I tried setting all the Tech required bits to Start and they still won\u0027t show up. Nothing in RO or RP-0 makes changes to this mod so I figured that would help make them appear, but no such luck.\u003C/p\u003E\n"},{"CreatedByName":"Mecripp","CreatedById":181994,"CreatedDateTime":"2015-04-12T03:05:15Z","Content":"\n\u003Cp\u003EDid you cap the S it should be lower case start and other then that does that mod use DDS ? might be something with that but really don\u0027t know have you tried to ask on RO thread ?\u003C/p\u003E\n"},{"CreatedByName":"shoe7ess","CreatedById":114974,"CreatedDateTime":"2015-04-12T05:55:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MeCripp\u0022 data-cite=\u0022MeCripp\u0022\u003E\u003Cdiv\u003EDid you cap the S it should be lower case start and other then that does that mod use DDS ? might be something with that but really don\u0027t know have you tried to ask on RO thread ?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI haven\u0027t, but I capped the S\u0027s... dammit, back to the 50 config files lol. Yes, I do use DDS loader, but the images do get cached via ATM and even without the images, the models should at least appear, thanks man, I\u0027ll report back if that fixed it.\u003C/p\u003E\u003Cp\u003EEdit: Yes, that fixed it, now to figure out which tech nodes I should put the parts in for RP-0 to recognize (having them all at the start seems a little OP to me)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-04-12T07:02:50Z\u0022 title=\u002204/12/2015 07:02  AM\u0022 data-short=\u00229 yr\u0022\u003EApril 12, 2015\u003C/time\u003E by shoe7ess\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Mecripp","CreatedById":181994,"CreatedDateTime":"2015-04-12T15:46:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022shoe7ess\u0022 data-cite=\u0022shoe7ess\u0022\u003E\u003Cdiv\u003EI haven\u0027t, but I capped the S\u0027s... dammit, back to the 50 config files lol. Yes, I do use DDS loader, but the images do get cached via ATM and even without the images, the models should at least appear, thanks man, I\u0027ll report back if that fixed it.\u003Cp\u003EEdit: Yes, that fixed it, now to figure out which tech nodes I should put the parts in for RP-0 to recognize (having them all at the start seems a little OP to me)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENow that you done all that work to test mods and you need tech to start try a MM \u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E@PART[*]:HAS[~TechRequired[]]:Final\u003Cbr\u003E{\u003Cbr\u003E\tTechRequired = start\u003Cbr\u003E        entryCost = 1200\u003Cbr\u003E        cost = 250\u003Cbr\u003E}\u003Cbr\u003E\u003Cbr\u003E@PART[*]:HAS[#TechRequired]:Final\u003Cbr\u003E{\u003Cbr\u003E\t@TechRequired = start\u003Cbr\u003E}\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"shoe7ess","CreatedById":114974,"CreatedDateTime":"2015-04-14T00:36:49Z","Content":"\n\u003Cp\u003ENot a bad idea, I\u0027m actually about to start the project now. Thanks for the idea, originally I was just going to go through each config and change the tech required, but MM is a lot more sensible for my non RP-0 games.\u003C/p\u003E\n"},{"CreatedByName":"trooperMNG","CreatedById":139886,"CreatedDateTime":"2015-04-16T13:06:29Z","Content":"\n\u003Cp\u003EHi everyone, I have a little problem with this mod. I built, lauched and put in orbit a satellite made with 2 boxes. When I switched to another vessel and came back to the satellite, one of the boxes was missing. Only the internal components (battery, MP and probe core) were still there, while the other box was ok. What happened?\u003C/p\u003E\u003Cp\u003EThanks in advance for support\u003C/p\u003E\n"},{"CreatedByName":"Mecripp","CreatedById":181994,"CreatedDateTime":"2015-04-16T13:31:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022trooperMNG\u0022 data-cite=\u0022trooperMNG\u0022\u003E\u003Cdiv\u003EHi everyone, I have a little problem with this mod. I built, lauched and put in orbit a satellite made with 2 boxes. When I switched to another vessel and came back to the satellite, one of the boxes was missing. Only the internal components (battery, MP and probe core) were still there, while the other box was ok. What happened?\u003Cp\u003EThanks in advance for support\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESounds like you have some mod doing funny things you might post a log file.\u003C/p\u003E\n"},{"CreatedByName":"orcmaul","CreatedById":19612,"CreatedDateTime":"2015-04-16T15:35:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022trooperMNG\u0022 data-cite=\u0022trooperMNG\u0022\u003E\u003Cdiv\u003EHi everyone, I have a little problem with this mod. I built, lauched and put in orbit a satellite made with 2 boxes. When I switched to another vessel and came back to the satellite, one of the boxes was missing. Only the internal components (battery, MP and probe core) were still there, while the other box was ok. What happened?\u003Cp\u003EThanks in advance for support\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn addition to the log file that MeCripp mentioned it would also be handy to see your persistent file.\u003C/p\u003E\n"},{"CreatedByName":"hawk_za","CreatedById":59433,"CreatedDateTime":"2015-04-22T13:09:28Z","Content":"\n\u003Cp\u003Ehi there I was just wondering if there are any plans afoot to revamp this mod and make it compatible for 1.0 as it is an awesome mod \u003C/p\u003E\u003Cp\u003Ealso love the rcs enjoins but if I may suggest putting a attachment node on them on the underside so I could add them to the top of my rocket but use them for propulsion under the satellite\u003C/p\u003E\u003Cp\u003Eyours in hope \u003C/p\u003E\u003Cp\u003E the hawk\u003C/p\u003E\n"},{"CreatedByName":"Mecripp","CreatedById":181994,"CreatedDateTime":"2015-04-22T13:27:08Z","Content":"\n\u003Cp\u003EThats why there is a box to house the engine \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E and why would v1.0 break the mod there is no plugin it just a part mod.\u003C/p\u003E\n"},{"CreatedByName":"hawk_za","CreatedById":59433,"CreatedDateTime":"2015-04-22T14:04:15Z","Content":"\n\u003Cp\u003Eoooo I see \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 alt=\u0022:blush:\u0022\u003E duh ... I suddenly fill a bit silly thanks for the info\u003C/p\u003E\n"}]}