{"TopicId":83342,"ForumId":34,"TopicTitle":"[1.4.1] Kerbal Construction Time 1.4.0.69 (2018-03-24) - Unrapid Planned Assembly","CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2014-08-30T01:40:22Z","PageNum":71,"Articles":[{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2015-10-26T14:56:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Zeggpold\u0022 data-cite=\u0022Zeggpold\u0022\u003E\u003Cdiv\u003EThanks for the quick reply! Unfortunately, visiting the VAB doesn\u0027t help, I still get the explosion, and the lines above still appear in the KSP.log file.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWas this craft built with an older version of KCT and not launched until now? Can you upload the save file too? I\u0027m wondering if something got messed up in the craft info.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022linuxgurugamer\u0022 data-cite=\u0022linuxgurugamer\u0022\u003E\u003Cdiv\u003EIs it possible to keep the time from stopping if I change focus to another window?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t understand what you mean. Do you mean when you alt-tab out of KSP? There might be a KSP setting to \u0022simulate in background\u0022 or something like that, or using a borderless window might work, but otherwise I don\u0027t know of anything. I found \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/135329-Real-Time-Kerbal-(Getting-To-Run-in-Background)\u0022 rel=\u0022external nofollow\u0022\u003Ethis short thread\u003C/a\u003E which mentions that in the space center scene time will stop if you alt-tab, but not in flight or the tracking station.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Prezombie\u0022 data-cite=\u0022Prezombie\u0022\u003E\u003Cdiv\u003EEver since updating, Max warp is now stuck at 10k x. Why can\u0027t I get 100k x anymore? even if I manually edit the .cfg to maxtimewarp = 8 It won\u0027t let me get that high.\u003Cp\u003EAdditionally, Kerbal alarm clock seems to have no trouble dropping from 100k x to 1x in a moment, I\u0027m pretty sure that KCT\u0027s warp ramping down is a legacy workaround that\u0027s no longer needed, or at least should be optional.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESorry, I must have missed this post earlier. When you open the KCT settings in-game and have the option to change the max warp, what does it say? If the thing you\u0027re trying to warp to is completing fairly soon then it won\u0027t go to the max warp.\u003C/p\u003E\u003Cp\u003EI\u0027ve made a note on GitHub to take a look at the warp down code. I wonder if KAC switched to using the Stock \u0022Warp To\u0022 system, or if they just rewrote that code. Either way, I\u0027ll try to get warping to take minimal time for the next update.\u003C/p\u003E\n"},{"CreatedByName":"linuxgurugamer","CreatedById":129964,"CreatedDateTime":"2015-10-26T15:55:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022magico13\u0022 data-cite=\u0022magico13\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI don\u0027t understand what you mean. Do you mean when you alt-tab out of KSP? There might be a KSP setting to \u0022simulate in background\u0022 or something like that, or using a borderless window might work, but otherwise I don\u0027t know of anything. I found \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/135329-Real-Time-Kerbal-(Getting-To-Run-in-Background)\u0022 rel=\u0022external nofollow\u0022\u003Ethis short thread\u003C/a\u003E which mentions that in the space center scene time will stop if you alt-tab, but not in flight or the tracking station.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, that was it.\u003C/p\u003E\u003Cp\u003EIt\u0027s annoying, I guess, but not this mod\u0027s fault. I only noticed it because I\u0027m still learning this, and was more observant than normal for things like the clock.\u003C/p\u003E\u003Cp\u003EThanks for replying\u003C/p\u003E\u003Cp\u003ELGG\u003C/p\u003E\n"},{"CreatedByName":"paul23","CreatedById":120544,"CreatedDateTime":"2015-10-26T19:16:45Z","Content":"\n\u003Cp\u003EWhy is it licensed (at least the download) under the GNU free \u003Cstrong\u003EDocumentation\u003C/strong\u003E license? That one isn\u0027t meant for software? Is there a special case you wish to use this license instead of the standard GPL?\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2015-10-26T19:37:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022paul23\u0022 data-cite=\u0022paul23\u0022\u003E\u003Cdiv\u003EWhy is it licensed (at least the download) under the GNU free \u003Cstrong\u003EDocumentation\u003C/strong\u003E license? That one isn\u0027t meant for software? Is there a special case you wish to use this license instead of the standard GPL?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI am not sure how I managed to do that, but it should be GPL v3 instead. Thank you for catching that! It appears I did the same thing with StageRecovery. There\u0027s a non-zero chance I did that with the modlets too...\u003C/p\u003E\n"},{"CreatedByName":"paul23","CreatedById":120544,"CreatedDateTime":"2015-10-26T20:42:31Z","Content":"\n\u003Cp\u003EHey how do I make it so actual cheap rockets are actually fast to produce? - In reality we also stopped using reusable rockets: way to expensive in manhours to produce and maintain. Instead the future are dispossable cheaply producable rockets and satellites which can work together to fit an armada of tasks. (lego-like, but instead of being able to start over you just buy more bricks as that is cheaper than resorting).\u003C/p\u003E\u003Cp\u003EI\u0027m quite annoyed that my specialized rocket list (100\u002B designs) in this mod all take 3\u002B days. Or will repeated \u003Cstrong\u003Ecreation\u003C/strong\u003E of the same rockets (parts thereoff, payload is sometimes a science lab, sometimes a thermometer).\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2015-10-26T21:05:17Z","Content":"\n\u003Cp\u003EI\u0027m on my phone currently, so my reply won\u0027t be as detailed as if I were at a computer, but I\u0027ll attempt to detail what you can do to adjust things for your playstyle.\u003C/p\u003E\u003Cp\u003EFirstly, 3 days is extremely fast for the time between ordering a rocket and flying it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EIf you use the same parts between builds (aka, only use one fuel tank type, one rocket engine, etc) then the builds will get faster each time.\u003C/p\u003E\u003Cp\u003EIf you want to adjust all build time to be faster, you can reduce the Overall Modifier to less than 1 in the settings to reduce the times. Alternatively, increase the Build Effect to make future builds using the same parts faster. You might be interested in setting the Inventory Effect to zero so the part inventory has no effect.\u003C/p\u003E\u003Cp\u003EIf you want to tweak things even further, I\u0027d suggest modifying the formulas. Here is the link to the wiki pages that discuss that: \u003Ca href=\u0022https://github.com/magico13/KCT/wiki/Presets:-An-Overview\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/magico13/KCT/wiki/Presets:-An-Overview\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"paul23","CreatedById":120544,"CreatedDateTime":"2015-10-26T22:01:28Z","Content":"\n\u003Cp\u003EWell there is than a balancing problem: a way way more complicated build I made (8k delta-V, almost a solid 36 meter stack of 4 lines of small fuel tanks instead of 4k and a simple 1 stack) only takes 5 days.....\u003C/p\u003E\u003Cp\u003EBut worse: I seem with only 3 points get already 4 science/day. I\u0027ve put science gains at 20% (and money at 30%) as I actually like being forced to do science to unlock further. This 4 science per day is \u0026amp; slow building (4 days build would give me a mission to earn around 10 science). Means that science from contracts are just useless. So can I then make the \u0022science gain\u0022 are multiplied by 0.2 (or even 0.1). So that \u0022waiting it out\u0022 isn\u0027t the best way to progress in the tech tree, and doing 2-10 science contracts is best.\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2015-10-26T22:25:21Z","Content":"\n\u003Cp\u003EThe balance is a semi-random middleground between the people who want everything to take months, and the people who want everything to be built in less than a day. KCT is \u003Cem\u003Eextremely\u003C/em\u003E customizable, so if you don\u0027t like the balance you are \u003Cem\u003Eactively encouraged\u003C/em\u003E to change it, or even to disable features you don\u0027t care for. Four formulas control how long things take to build (3 if you aren\u0027t using Procedural Parts): the EffectivePartFormula, ProceduralPartFormula, BPFormula, and BuildRateFormula. All of those are detailed on the Wiki on GitHub that I linked earlier. I don\u0027t know enough of what you\u0027re looking for in balance to suggest any changes to the formulas.\u003C/p\u003E\u003Cp\u003EIf the \u0022science per day\u0022 you\u0027re referencing is the \u0022Development\u0022 rate, that isn\u0027t science you earn, that\u0027s how quickly tech nodes unlock. The \u0022Research\u0022 rate gives you science for building vessels, but you have to actively be building things to get that, and it\u0027s 0 by default, and it\u0027s totally optional to use. At no point can you just timewarp and get science without having to actually do something for it, or at the very least opting-in to receiving science for \u0022nothing\u0022, so I don\u0027t understand what the problem is.\u003C/p\u003E\u003Cp\u003EIf you\u0027d like some help with tweaking the balance, give me some clear ideas of what you\u0027re looking for and I\u0027ll suggest some changes. Ultimately you\u0027ll have to tweak things until you get it just right for you (then save that as a Preset and consider sharing it). I know people who turn the Overall Modifier up to 20 so that everything takes months, and I know people who turn off 75% of the features, and then there are people like NathanKell who make it so it takes about 10 years to get the tech to send a person to orbit.\u003C/p\u003E\n"},{"CreatedByName":"DiamondExcavater","CreatedById":72325,"CreatedDateTime":"2015-10-27T02:34:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022magico13\u0022 data-cite=\u0022magico13\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EIf you\u0027d like some help with tweaking the balance, give me some clear ideas of what you\u0027re looking for and I\u0027ll suggest some changes.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E \u003Cp\u003EWhat options do I need to choose to allow research (free science essentially) to give me 0.04 science a day? its very specific, but it\u0027s on the basis that my Scientist do random research and kerbals that are in space for long times gain more science, than a 2 min flight.\u003C/p\u003E\u003Cp\u003EKnow any good mods for extra skill points based on flight time and amount of parts fixed and amount of research done for reputation, instead of points based on different orbits? I have done about 20 flights with a pilot but he never gets XP which gets him no skill and that\u0027s bs\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022magico13\u0022 data-cite=\u0022magico13\u0022\u003E\u003Cdiv\u003E NathanKell who make it so it takes about 10 years to get the tech to send a person to orbit.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E10 YEARS!! omg\u003C/p\u003E\n"},{"CreatedByName":"Prezombie","CreatedById":152392,"CreatedDateTime":"2015-10-27T05:46:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022magico13\u0022 data-cite=\u0022magico13\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ESorry, I must have missed this post earlier. When you open the KCT settings in-game and have the option to change the max warp, what does it say? If the thing you\u0027re trying to warp to is completing fairly soon then it won\u0027t go to the max warp.\u003C/p\u003E\u003Cp\u003EI\u0027ve made a note on GitHub to take a look at the warp down code. I wonder if KAC switched to using the Stock \u0022Warp To\u0022 system, or if they just rewrote that code. Either way, I\u0027ll try to get warping to take minimal time for the next update.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ethe KCT settings shows max time warp of 10k x. I can change it as normal, but 10k is the max. And it\u0027s not a nearby deadline issue, it caps out at 10k even when the next build is a month away.\u003C/p\u003E\u003Cp\u003EWhile you\u0027re at it, a button in the build-simulate-cancel menu to automatically warp through the building and rollout time, jumping right to the pad, would be a wonderful anti-grind measure for when the player doesn\u0027t have any need to do any parallel missions.\u003C/p\u003E\u003Cp\u003EIt\u0027s also kind of odd how VAB to launchpad has a rollout time, but SPH to runway doesn\u0027t have a taxiing out time.\u003C/p\u003E\n"},{"CreatedByName":"Zeggpold","CreatedById":74133,"CreatedDateTime":"2015-10-27T06:11:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022magico13\u0022 data-cite=\u0022magico13\u0022\u003E\u003Cdiv\u003EWas this craft built with an older version of KCT and not launched until now? Can you upload the save file too? I\u0027m wondering if something got messed up in the craft info.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENothing like that, it was a new game, but you may be right the the save got messed up. I did some further testing with a fresh save and found that there was no problem launching from the standard KSC, but when I launched from the \u0022old\u0022 KSC (using Kerbalside/Kerbal Konstructs, I think), I got the explosions. But in this new save, visiting the VAB first seemed to prevent the explosions. (I also opened the KK launchsite selector, maybe that helped.) I can upload the old save if you like, but there are a lot of mods so not sure how useful it would be.\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2015-10-27T15:00:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DiamondExcavater\u0022 data-cite=\u0022DiamondExcavater\u0022\u003E\u003Cdiv\u003EWhat options do I need to choose to allow research (free science essentially) to give me 0.04 science a day? \u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENothing in KCT lets you get science for nothing, but you can get science for building vessels. If you put one point into Research it should give you 0.5 science per 86400 BP (aka, a ship that takes 24 hours to build at 1 BP/s, which is one Earth day and 4 Kerbin days [so 0.125 science per Kerbin day]). If you want something very specific (like 0.04 science), you could replace the ResearchFormula with \u00220.04/21600\u0022 which would give 0.04 science per 21600 BP (or one Kerbin day at 1 BP/s). You only get the science when you complete the construction of a ship, so you have to make sure you\u0027re always building things.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DiamondExcavater\u0022 data-cite=\u0022DiamondExcavater\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EKnow any good mods for extra skill points based on flight time and amount of parts fixed and amount of research done for reputation, instead of points based on different orbits? I have done about 20 flights with a pilot but he never gets XP which gets him no skill and that\u0027s bs\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUnfortunately I do not. I\u0027m not a huge fan of how the experience system works either, but I do enough orbital things that I don\u0027t worry too much about it. My biggest gripe is that Kerbals have to be recovered to earn XP, which is why I wrote Field Experience to get around that.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Prezombie\u0022 data-cite=\u0022Prezombie\u0022\u003E\u003Cdiv\u003Ethe KCT settings shows max time warp of 10k x. I can change it as normal, but 10k is the max. And it\u0027s not a nearby deadline issue, it caps out at 10k even when the next build is a month away.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAre you using any mods that alter timewarp at all? I can\u0027t figure out why that would happen at all :/\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Prezombie\u0022 data-cite=\u0022Prezombie\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EWhile you\u0027re at it, a button in the build-simulate-cancel menu to automatically warp through the building and rollout time, jumping right to the pad, would be a wonderful anti-grind measure for when the player doesn\u0027t have any need to do any parallel missions.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve never been a fan of this idea, but it\u0027s been requested enough that I might add it. The biggest hurdle is that time doesn\u0027t pass in the editor, but there was some discussion about adding in timewarp to the editor, which would be a requirement for this to work.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Prezombie\u0022 data-cite=\u0022Prezombie\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EIt\u0027s also kind of odd how VAB to launchpad has a rollout time, but SPH to runway doesn\u0027t have a taxiing out time.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI mean, if you want a 30 minute timewarp every time you go to launch a plane, I can make that happen \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E (no joke, I am planning on altering the formulas a bit so that SPH vehicles can have rollout, but it won\u0027t be there by default).\u003C/p\u003E\u003Cp\u003EThe main reason for not having a rollout time for planes is that it would be so short that it\u0027s more of a nuisance than anything else. I already find the normal rollout a nuisance \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E Consider this: when an airplane goes to take off it takes maybe an hour, and that\u0027s at a busy airport (the KSC airport isn\u0027t busy, you\u0027re the only airplane). When the space shuttle was rolled out to the pad, it was done about a week before launch, took 7 hours or more, and the countdown (and thus checklist of things to check) started 72 hours before launch. That amount of time is way more significant than it is for airplanes, but when I make those changes you\u0027re free to add some rollout for planes as well.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Zeggpold\u0022 data-cite=\u0022Zeggpold\u0022\u003E\u003Cdiv\u003ENothing like that, it was a new game, but you may be right the the save got messed up. I did some further testing with a fresh save and found that there was no problem launching from the standard KSC, but when I launched from the \u0022old\u0022 KSC (using Kerbalside/Kerbal Konstructs, I think), I got the explosions. But in this new save, visiting the VAB first seemed to prevent the explosions. (\u003Cstrong\u003EI also opened the KK launchsite selector, maybe that helped.\u003C/strong\u003E) I can upload the old save if you like, but there are a lot of mods so not sure how useful it would be.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat helped. I didn\u0027t realize you were using Kerbal Konstructs, as that affects how KCT handles launches in a non-trivial manner. I\u0027m guessing no launch site was set when you built the ship, so when you tried to launch it it had no idea how to launch properly. If you upload the save I can probably fix that ship, but you might be able to fix it yourself by opening that save in-game, pressing the * button next to the ship (with it in storage, not rolled out) and selecting the \u0022Select Launchsite\u0022 button. Then use that to set the launch site and it \u003Cem\u003Emight\u003C/em\u003E launch correctly.\u003C/p\u003E\u003Cp\u003EWhen you open the KK launchsite selector it sets the launchsite right away, which KCT notices and then properly sets the launch site. I\u0027m not really sure why it didn\u0027t properly set the normal KSC site as the launch site by default, though.\u003C/p\u003E\n"},{"CreatedByName":"DiamondExcavater","CreatedById":72325,"CreatedDateTime":"2015-10-27T23:04:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022magico13\u0022 data-cite=\u0022magico13\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EUnfortunately I do not. I\u0027m not a huge fan of how the experience system works either, but I do enough orbital things that I don\u0027t worry too much about it. My biggest gripe is that Kerbals have to be recovered to earn XP, which is why I wrote Field Experience to get around that.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI got my self your field experience, which is nicer than Stock, but i guess your next mod mission is to make a mod with calculations based on flight time, a basic multiplier, and then also an engineer fixing stuff adding up to multiply with a constant and that gives xp and every time a scientist tests he builds up his points, it can be just as small as your other modlets!\u003C/p\u003E\u003Cp\u003Ep.s. make it compatible with field science, i would love that\u003C/p\u003E\u003Cp\u003EEdit: i suggest naming it \u003Cstrong\u003E\u0022Kerbal Experience System\u0022\u003C/strong\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-27T23:08:34Z\u0022 title=\u002210/27/2015 11:08  PM\u0022 data-short=\u00228 yr\u0022\u003EOctober 27, 2015\u003C/time\u003E by DiamondExcavater\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Zeggpold","CreatedById":74133,"CreatedDateTime":"2015-10-28T05:03:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022magico13\u0022 data-cite=\u0022magico13\u0022\u003E\u003Cdiv\u003EThat helped. I didn\u0027t realize you were using Kerbal Konstructs, as that affects how KCT handles launches in a non-trivial manner. I\u0027m guessing no launch site was set when you built the ship, so when you tried to launch it it had no idea how to launch properly. If you upload the save I can probably fix that ship, but you might be able to fix it yourself by opening that save in-game, pressing the * button next to the ship (with it in storage, not rolled out) and selecting the \u0022Select Launchsite\u0022 button. Then use that to set the launch site and it \u003Cem\u003Emight\u003C/em\u003E launch correctly.\u003Cp\u003EWhen you open the KK launchsite selector it sets the launchsite right away, which KCT notices and then properly sets the launch site. I\u0027m not really sure why it didn\u0027t properly set the normal KSC site as the launch site by default, though.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks, that seems to have done the trick! Sorry I didn\u0027t mention KK before, I didn\u0027t know which mods might be of interest and I didn\u0027t know how to list them all. (I know do know, using \u0022ckan.exe list\u0022).\u003C/p\u003E\n"},{"CreatedByName":"Prezombie","CreatedById":152392,"CreatedDateTime":"2015-10-28T13:03:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022magico13\u0022 data-cite=\u0022magico13\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAre you using any mods that alter timewarp at all? I can\u0027t figure out why that would happen at all :/\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe only other mod affecting timewarp is BetterTimeWarp. I haven\u0027t actually changed any of the settings in that mod, just installed it for the lossless physics warp.\u003C/p\u003E\u003Cp\u003EEdit: huh. The default setting for BTW uses the orbital warp increments rather than the KSC increments when looking at the KSC. I guess that\u0027s resolved. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-28T13:25:49Z\u0022 title=\u002210/28/2015 01:25  PM\u0022 data-short=\u00228 yr\u0022\u003EOctober 28, 2015\u003C/time\u003E by Prezombie\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2015-10-28T14:35:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DiamondExcavater\u0022 data-cite=\u0022DiamondExcavater\u0022\u003E\u003Cdiv\u003Ei guess your next mod mission is to make a mod with calculations based on flight time, a basic multiplier, and then also an engineer fixing stuff adding up to multiply with a constant and that gives xp and every time a scientist tests he builds up his points, it can be just as small as your other modlets!\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWe\u0027ll see, I\u0027ve got other projects on the table, not a load of time, and KSP hasn\u0027t held my interest for the past month and a half or so \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E Once 1.0.5 comes out I\u0027ll probably be substantially more motivated to work on new projects.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Zeggpold\u0022 data-cite=\u0022Zeggpold\u0022\u003E\u003Cdiv\u003EThanks, that seems to have done the trick! Sorry I didn\u0027t mention KK before, I didn\u0027t know which mods might be of interest and I didn\u0027t know how to list them all. (I know do know, using \u0022ckan.exe list\u0022).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you have ModuleManager it lists all your mods in the log, which I should have looked at. I didn\u0027t even think of Kerbal Konstructs at the time for some reason, so I didn\u0027t check to see if it was installed. And now that I think back to it, the times where I was seeing that error was when I added Kerbal Konstructs support. Sorry for not being able to resolve that sooner!\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Prezombie\u0022 data-cite=\u0022Prezombie\u0022\u003E\u003Cdiv\u003EThe only other mod affecting timewarp is BetterTimeWarp. I haven\u0027t actually changed any of the settings in that mod, just installed it for the lossless physics warp.\u003Cp\u003EEdit: huh. The default setting for BTW uses the orbital warp increments rather than the KSC increments when looking at the KSC. I guess that\u0027s resolved. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo are things working correctly now? KCT doesn\u0027t set a hard limit for max timewarp, it\u0027s supposed to just be the maximum possible, but it does depend on the timewarp array being modified correctly. I imagine most mods that affect timewarp just modify that array, so KCT should work with them.\u003C/p\u003E\n"},{"CreatedByName":"Cetera","CreatedById":109237,"CreatedDateTime":"2015-10-28T14:36:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cetera\u0022 data-cite=\u0022Cetera\u0022\u003E\u003Cdiv\u003EI check this thread every-so-often, just to see what is being done, and I\u0027ve experienced this bug without warping in the KSC scene. When I have it occur, I\u0027m usually playing with a vessel somewhere not on Kerbin, and get my KCT notification that a rollout is complete and a ship is ready to launch. Using the toolbar, I can go into KCT and launch directly from the flight scene I\u0027m in, taking me to the launchpad with the vessel. Every time, my ships will bounce once loaded, but usually they will bounce over 100m up into the air. I\u0027ve successfully launched from there before (hey, free delta-v, right) but usually they don\u0027t survive the initial bounce up. \u003Cp\u003EI\u0027ve noticed that the only way to prevent that is to not launch from another scene using KCT, and to go to the space center first, then launch using KCT.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022magico13\u0022 data-cite=\u0022magico13\u0022\u003E\u003Cdiv\u003EAre you playing with New Horizons, Alternis Kerbol, or any other Kopernicus mods? If so, please let me know which one(s). If not, then that\u0027s a bigger problem. The tracking station used to do this without any other mods installed, so if Flight is doing it too then I might have to disable launching from flight as well.\u003Cp\u003EMy previous attempt at a fix was to quickly change to the space center and then quickly change to the launch. That might still be doable, but the way I was doing it before was too fast and thus broke a lot of other things (Persistence didn\u0027t load before the scene changed again. Mods were not happy with that).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESorry, I just noticed this request for additional info. \u003C/p\u003E\u003Cp\u003EI\u0027m using Outer Planets, which does use Kopernicus. I also have Kopernicus Extended installed. Does that help?\u003C/p\u003E\n"},{"CreatedByName":"paul23","CreatedById":120544,"CreatedDateTime":"2015-10-28T15:35:50Z","Content":"\n\u003Cp\u003EWow I just realized the price of building points doubles with each point spent. At 30% income 500k is massive, it\u0027s like 10-20 contracts (at least)...\u003C/p\u003E\u003Cp\u003EIs there a method to \u0022lower\u0022 the multiplier? Or otherwise get building points? (Would be awesome if some contracts started to give building points instead of money). Is it in the configs the node formula? So could I change that config line to say:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003ENodeFormula = 1.5^([N]\u002B1) / 86400\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-28T15:53:31Z\u0022 title=\u002210/28/2015 03:53  PM\u0022 data-short=\u00228 yr\u0022\u003EOctober 28, 2015\u003C/time\u003E by paul23\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2015-10-28T15:50:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022paul23\u0022 data-cite=\u0022paul23\u0022\u003E\u003Cdiv\u003EWow I just realized the price of building points doubles with each point spent. At 30% income 500k is massive, it\u0027s like 10-20 contracts (at least)...\u003Cp\u003EIs there a method to \u0022lower\u0022 the multiplier? Or otherwise get building points? (Would be awesome if some contracts started to give building points instead of money).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027re talking about upgrades correct? The primary way to get them is just by filling out the tech tree (one point per node), I almost never purchase them except in an emergency. You can purchase them with science as well, but that\u0027s probably even more expensive as that science could be used for unlocking new tech (and thus also gaining another upgrade).\u003C/p\u003E\u003Cp\u003EI do want to have contracts that give upgrades, but I need to write the API first (a major undertaking). Nightingale has expressed some interest in adding support in Contract Configurator for KCT\u0027s upgrades once I get that up and running.\u003C/p\u003E\u003Cp\u003EIf you want to adjust the costs for purchasing upgrades, just alter the UpgradeFundsFormula for points from funds or UpgradeScienceFormula for points from science.\u003C/p\u003E\u003Cp\u003EAll upgrades do is make things faster, you never \u003Cem\u003Eneed\u003C/em\u003E to spend them, so I\u0027d personally recommend just using the points you get naturally through unlocking the tech tree and having slightly longer build times (but more funds).\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cetera\u0022 data-cite=\u0022Cetera\u0022\u003E\u003Cdiv\u003ESorry, I just noticed this request for additional info. \u003Cp\u003EI\u0027m using Outer Planets, which does use Kopernicus. I also have Kopernicus Extended installed. Does that help?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHmm, Outer Planets doesn\u0027t reparent Kerbin, so that\u0027s not likely at fault. Sounds like going from flight to a new launch is bugged as well as going from the Tracking Station to a new launch :/ You might just have to switch scenes before launch, unfortunately. It\u0027s likely a bug rooted in the Stock game, so hopefully it eventually goes away after a KSP update. I can\u0027t think of any good workarounds off the top of my head.\u003C/p\u003E\n"},{"CreatedByName":"paul23","CreatedById":120544,"CreatedDateTime":"2015-10-28T15:56:28Z","Content":"\n\u003Cp\u003EWell I\u0027m also running at 20% tech gains. (So I will *need* to go to eeloo etc). I\u0027m afraid that soon I have to build spacecraft before accepting a mission - and then just praying a mission shows up for the target I planned to go while I\u0027m there.\u003C/p\u003E\n"},{"CreatedByName":"paul23","CreatedById":120544,"CreatedDateTime":"2015-10-30T10:46:38Z","Content":"\n\u003Cp\u003EWell I bumb this: since there seems to be a \u0022breaking\u0022 bug inside this extension (or when working with others).\u003C/p\u003E\u003Cp\u003EAfter some time playing my \u0022simulations\u0022 (only simulations, not actual flights) tend to lose control. - When I\u0027m in a simulation the game just doesn\u0027t recognize any input, apart from input in the simulation \u0022pop up\u0022 (clicking it away does not give me control back, and forces me to wait out the simulation). When this bug happens once during a game session it keeps happening for each future simulation run.\u003C/p\u003E\u003Cp\u003EActually I can \u0022click\u0022 on each part, however changing the settings doesn\u0027t work - it\u0027s as if I\u0027m in non physical time warp. Clicking the warp buttons doesn\u0027t even do anything though (not speeding up simulation).\u003C/p\u003E\u003Cp\u003EI\u0027ve installed \u0022only\u0022 the following six mods:\u003C/p\u003E\u003Cp\u003EKerbal alarm clock\u003C/p\u003E\u003Cp\u003EMechjeb\u003C/p\u003E\u003Cp\u003EKerbal engineering redux\u003C/p\u003E\u003Cp\u003EStagerecovery\u003C/p\u003E\u003Cp\u003EKCATS (or whatever that update mod is)\u003C/p\u003E\u003Cp\u003EKerbal construction time.\u003C/p\u003E\u003Cp\u003EEDIT: managed to get my first launch to create this bug, \u003Ca href=\u0022http://pastebin.com/r2G8w5mU\u0022 rel=\u0022external nofollow\u0022\u003Epastebin of ksp.log containing only this run\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EAt line 2500 and onwards you can see the flight log:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003E[LOG 11:55:21.331] ------------------- initializing flight mode... ------------------\u003Cbr\u003E[LOG 11:55:21.518] Loading ship from file: C:/KSP_win/KSP_Data/../saves/Pulli23/Ships/temp.craft\u003Cbr\u003E[LOG 11:55:21.960] Mun lander (medium) loaded!\u003Cbr\u003E[LOG 11:55:25.306] putting ship to ground: 0\u003Cbr\u003E[LOG 11:55:25.313] [Mun lander (medium)]: Ready to Launch - waiting to start physics...\u003Cbr\u003E[LOG 11:55:25.328] Crewmember Bill Kerman assigned to Mk1 Command Pod, seat # 0 (crew seat index: 0)\u003Cbr\u003E[LOG 11:55:25.329] [FLIGHT GLOBALS]: Switching To Vessel Mun lander (medium) ---------------------- \u003Cbr\u003E[LOG 11:55:25.330] setting new dominant body: Kerbin\u003Cbr\u003EFlightGlobals.mainBody: Kerbin\u003Cbr\u003E[LOG 11:55:25.332] Reference Frame: Rotating\u003Cbr\u003E[LOG 11:55:25.346] stage manager resuming...\u003Cbr\u003E[LOG 11:55:25.347] Vessel assembly complete!\u003Cbr\u003E[LOG 11:55:25.348] stage manager starting...\u003Cbr\u003E[LOG 11:55:25.349] all systems started\u003Cbr\u003E[LOG 11:55:25.370] 10/30/2015 11:55:25 AM,KerbalConstructionTime-KACWrapper,Attempting to Grab KAC Types...\u003Cbr\u003E[LOG 11:55:25.372] 10/30/2015 11:55:25 AM,KerbalConstructionTime-KACWrapper,KAC Version:3.4.0.0\u003Cbr\u003E[LOG 11:55:25.374] 10/30/2015 11:55:25 AM,KerbalConstructionTime-KACWrapper,Got Assembly Types, grabbing Instance\u003Cbr\u003E[LOG 11:55:25.375] 10/30/2015 11:55:25 AM,KerbalConstructionTime-KACWrapper,Got Instance, Creating Wrapper Objects\u003Cbr\u003E[LOG 11:55:25.376] 10/30/2015 11:55:25 AM,KerbalConstructionTime-KACWrapper,Getting APIReady Object\u003Cbr\u003E[LOG 11:55:25.376] 10/30/2015 11:55:25 AM,KerbalConstructionTime-KACWrapper,Success: True\u003Cbr\u003E[LOG 11:55:25.377] 10/30/2015 11:55:25 AM,KerbalConstructionTime-KACWrapper,Getting Alarms Object\u003Cbr\u003E[LOG 11:55:25.378] 10/30/2015 11:55:25 AM,KerbalConstructionTime-KACWrapper,Success: True\u003Cbr\u003E[LOG 11:55:25.378] 10/30/2015 11:55:25 AM,KerbalConstructionTime-KACWrapper,Getting Alarm State Change Event\u003Cbr\u003E[LOG 11:55:25.379] 10/30/2015 11:55:25 AM,KerbalConstructionTime-KACWrapper,Getting Create Method\u003Cbr\u003E[LOG 11:55:25.379] 10/30/2015 11:55:25 AM,KerbalConstructionTime-KACWrapper,Getting Delete Method\u003Cbr\u003E[LOG 11:55:25.380] 10/30/2015 11:55:25 AM,KerbalConstructionTime-KACWrapper,Getting DrawAlarmAction\u003Cbr\u003E[LOG 11:55:25.440] 10/30/2015 11:55:25 AM,KerbalAlarmClock,Searching for KER\u003Cbr\u003E[LOG 11:55:25.441] 10/30/2015 11:55:25 AM,KerbalAlarmClock-KERWrapper,Attempting to Grab KER Types...\u003Cbr\u003E[LOG 11:55:25.443] 10/30/2015 11:55:25 AM,KerbalAlarmClock-KERWrapper,KER Version:1.0.18.0\u003Cbr\u003E[LOG 11:55:25.444] 10/30/2015 11:55:25 AM,KerbalAlarmClock-KERWrapper,Creating Wrapper Objects\u003Cbr\u003E[LOG 11:55:25.444] 10/30/2015 11:55:25 AM,KerbalAlarmClock-KERWrapper,Success: True\u003Cbr\u003E[LOG 11:55:25.445] 10/30/2015 11:55:25 AM,KerbalAlarmClock-KERWrapper,Success: True\u003Cbr\u003E[LOG 11:55:25.445] 10/30/2015 11:55:25 AM,KerbalAlarmClock-KERWrapper,Success: True\u003Cbr\u003E[LOG 11:55:25.446] 10/30/2015 11:55:25 AM,KerbalAlarmClock,Successfully Hooked KER\u003Cbr\u003E[LOG 11:55:25.447] 10/30/2015 11:55:25 AM,KerbalAlarmClock,Searching for VOID\u003Cbr\u003E[LOG 11:55:25.447] 10/30/2015 11:55:25 AM,KerbalAlarmClock-VOIDWrapper,Attempting to Grab VOID Types...\u003Cbr\u003E[LOG 11:55:25.464] 10/30/2015 11:55:25 AM,KerbalAlarmClock,Active Vessel unreadable - resetting inqueue flag\u003Cbr\u003E[LOG 11:55:25.593] 10/30/2015 11:55:25 AM,KerbalAlarmClock,Vessel Change from \u0027No Vessel\u0027 to \u0027Mun lander (medium)\u0027\u003Cbr\u003E[LOG 11:55:25.600] KerbalEngineer -\u0026gt; ActionMenu was created.\u003Cbr\u003E[LOG 11:55:25.601] KerbalEngineer -\u0026gt; ActionMenu-\u0026gt;Awake\u003Cbr\u003E[LOG 11:55:25.601] KerbalEngineer -\u0026gt; FlightEngineerCore-\u0026gt;Awake\u003Cbr\u003E[LOG 11:55:25.601] KerbalEngineer -\u0026gt; ActionMenuGui was created.\u003Cbr\u003E[LOG 11:55:25.602] KerbalEngineer -\u0026gt; ActionMenu-\u0026gt;Start\u003Cbr\u003E[LOG 11:55:25.602] KerbalEngineer -\u0026gt; FlightEngineerCore-\u0026gt;Start\u003Cbr\u003E[LOG 11:55:25.612] Look rotation viewing vector is zero\u003Cbr\u003E[LOG 11:55:25.684] 10/30/2015 11:55:25 AM,KerbalAlarmClock,Loading Textures\u003Cbr\u003E[LOG 11:55:25.729] 10/30/2015 11:55:25 AM,KerbalAlarmClock,Loaded Textures\u003Cbr\u003E[LOG 11:55:25.744] [ScenarioDestructibles]: Loading... 0 objects registered\u003Cbr\u003E[LOG 11:55:25.745] [ScenarioUpgradeableFacilities]: Loading... 0 objects registered\u003Cbr\u003E[LOG 11:55:25.746] Loading Depletion Nodes\u003Cbr\u003E[LOG 11:55:25.747] DepNodeCount:  0\u003Cbr\u003E[LOG 11:55:25.747] Loading Biome Nodes\u003Cbr\u003E[LOG 11:55:25.747] BiomeNodeCount:  0\u003Cbr\u003E[LOG 11:55:25.748] Loading Planet Nodes\u003Cbr\u003E[LOG 11:55:25.748] PlanetNodeCount:  0\u003Cbr\u003E[LOG 11:55:25.749] 10/30/2015 11:55:25 AM,KerbalAlarmClock,BaseLoadDone. Alarms Count (Should be 0):0\u003Cbr\u003E[LOG 11:55:25.750] 10/30/2015 11:55:25 AM,KerbalAlarmClock,Found 0 Maneuver Nodes to deserialize\u003Cbr\u003E[LOG 11:55:25.751] 10/30/2015 11:55:25 AM,KerbalAlarmClock,Found 0 Maneuver Nodes to deserialize\u003Cbr\u003E[LOG 11:55:25.751] 10/30/2015 11:55:25 AM,KerbalAlarmClock,ScenarioLoadDone. Alarms Count:2\u003Cbr\u003E[ERR 11:55:26.886] Scene::raycastClosestShape: The maximum distance must be greater than zero!\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E[LOG 11:55:26.887] Look rotation viewing vector is zero\u003Cbr\u003E[LOG 11:55:26.893] 10/30/2015 11:55:26 AM,KerbalAlarmClock,Adding DrawGUI to PostRender Queue\u003Cbr\u003E[LOG 11:55:26.895] 10/30/2015 11:55:26 AM,KerbalAlarmClock,Skipping version check\u003Cbr\u003E[LOG 11:55:26.961] 10/30/2015 11:55:26 AM,KerbalAlarmClock,Contracts System Ready\u003Cbr\u003E[LOG 11:55:27.049] [PlanetariumCamera]: Focus: Mun lander (medium)\u003Cbr\u003E[LOG 11:55:27.293] Flight State Captured\u003Cbr\u003E[LOG 11:55:27.305] Saving Achievements Tree...\u003Cbr\u003E[LOG 11:55:27.305] Saving Achievements Tree...\u003Cbr\u003E[LOG 11:55:27.306] Saving Achievements Tree...\u003Cbr\u003E[LOG 11:55:27.306] Saving Achievements Tree...\u003Cbr\u003E[LOG 11:55:27.307] Saving Achievements Tree...\u003Cbr\u003E[LOG 11:55:27.423] Game State Saved as persistent\u003Cbr\u003E[LOG 11:55:28.097] [Mun lander (medium)]: ground contact! - error: -0.189m\u003Cbr\u003E[LOG 11:55:28.099] Unpacking Mun lander (medium)\u003Cbr\u003E[LOG 11:56:10.413] [Orbit Targeter]: Target is null\u003Cbr\u003E[LOG 11:56:29.388] Game Paused!\u003Cbr\u003E[LOG 11:56:33.054] 10/30/2015 11:56:33 AM,KerbalAlarmClock,AppLauncher: Destroying Button-Button Count:9\u003Cbr\u003E[WRN 11:56:33.068] [HighLogic]: =========================== Scene Change : From FLIGHT to SPACECENTER (Async) =====================\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-30T11:01:27Z\u0022 title=\u002210/30/2015 11:01  AM\u0022 data-short=\u00228 yr\u0022\u003EOctober 30, 2015\u003C/time\u003E by paul23\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2015-10-30T15:16:02Z","Content":"\n\u003Cp\u003EIt sounds like a stuck input lock. The log unfortunately wasn\u0027t listing which ones were active like it normally does (might be a ModuleManager function). Mechjeb had this issue in the past and it was caused by having a mechjeb window behind the \u0022simulate\u0022 button. When you click the button the other mod thinks the mouse is still over it\u0027s window and doesn\u0027t realize there\u0027s a scene change, thus never freeing the lock.\u003C/p\u003E\u003Cp\u003EThere\u0027s a really easy way to tell if that\u0027s the case: next time it happen press Alt-F12 and click the \u0022Show Input Locks\u0022 button. Either take a screenshot of that or write them down and (assuming they name their locks like they should) I should be able to figure out which mod is causing it. The only locks you should see are two from KCT (KCTSimQS and KCTSimQL, or something similar. They prevent quicksaving/quickloading).\u003C/p\u003E\n"},{"CreatedByName":"paul23","CreatedById":120544,"CreatedDateTime":"2015-10-30T15:40:13Z","Content":"\n\u003Cp\u003EThe crafts don\u0027t have any mechjeb items to it.\u003C/p\u003E\u003Cp\u003EI will try alt-f12, in the hopes it works. (Though any other key doesn\u0027t respond, apart from alt-f4).\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2015-10-30T15:59:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022paul23\u0022 data-cite=\u0022paul23\u0022\u003E\u003Cdiv\u003EThe crafts don\u0027t have any mechjeb items to it.\u003Cp\u003EI will try alt-f12, in the hopes it works. (Though any other key doesn\u0027t respond, apart from alt-f4).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s not about the crafts themselves (if it\u0027s the issue I expect), it\u0027s about the GUIs of the plugins. Showing the input locks doesn\u0027t fix it, it just confirms the problem and likely finds the cause so that we can put a bug report in the right place so it gets fixed. You can clear the input locks and confirm that will let you regain control, but that also adds issues because some of the locks are supposed to be there.\u003C/p\u003E\u003Cp\u003EMechjeb was just an example of a mod that has caused similar problems in the past. They fixed their bug though, so I don\u0027t expect it\u0027s MechJeb this time around. Could be Engineer. Could even be KCT somehow, but there were no errors in the log at all.\u003C/p\u003E\n"},{"CreatedByName":"JeffreyCor","CreatedById":93167,"CreatedDateTime":"2015-10-30T20:57:52Z","Content":"\n\u003Cp\u003EI noticed sometimes in simulations a crews doesn\u0027t get assigned, which results in an uncontrollable ship. There doesn\u0027t seem to be any pattern to it, but if a crew is manually selected before entering a simulation it bypasses this problem by ensuring a crew is present when the simulation starts.\u003C/p\u003E\n"}]}