{"TopicId":83342,"ForumId":34,"TopicTitle":"[1.4.1] Kerbal Construction Time 1.4.0.69 (2018-03-24) - Unrapid Planned Assembly","CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2014-08-30T01:40:22Z","PageNum":54,"Articles":[{"CreatedByName":"StevenV","CreatedById":10307,"CreatedDateTime":"2015-06-23T14:32:33Z","Content":"\n\u003Cp\u003ENever mind, it doesn\u0027t happen on a clean install.\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2015-06-23T14:39:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022futrtrubl\u0022 data-cite=\u0022futrtrubl\u0022\u003E\u003Cdiv\u003EJust so you know the IVA delay is done in ShipManifest.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECool, looks like I won\u0027t have to do that myself then \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022StevenV\u0022 data-cite=\u0022StevenV\u0022\u003E\u003Cdiv\u003EStarting a new career game seems to set all buildings to fully upgraded, and gives an error loading KCT data. This is with a lot of other incompatible mods though.\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nori\u0022 data-cite=\u0022Nori\u0022\u003E\u003Cdiv\u003EAre you trying this with the 64bit community work around? I played around with that for a while and it throws KCT errors on load.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe error that KCT pops up with isn\u0027t necessarily an error within KCT, it just means that KCT didn\u0027t get a chance to load it\u0027s data (which is frequently caused by errors in other mods). If you\u0027re trying the 64 bit Windows Community Hack, for some reason KCT hasn\u0027t been working properly in it and it\u0027s not a priority for me to fix (since it appears to work fine in every other version of KSP, including Linux 64 bit), as Nori has kindly pointed out. You\u0027re always welcome to send logs, but there\u0027s a chance they won\u0027t contain any helpful info.\u003C/p\u003E\u003Cp\u003EJust saw your update (prior to actually submitting this response). Glad it seems to be working now. If you\u0027ve got any other issues in the future, don\u0027t hesitate to ask (but do provide logs \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E )\u003C/p\u003E\n"},{"CreatedByName":"Rodhern","CreatedById":144074,"CreatedDateTime":"2015-06-25T12:44:30Z","Content":"\n\u003Cp\u003EThere have been several suggestions how to get rid of items in the Part Inventory and get some benefit from it. If this particular variant was already suggested I am sorry that I missed it.\u003C/p\u003E\u003Cp\u003EFirst, the reason we have parts in the Part Inventory, is because we spend Kerbucks and build time, and then later got the Kerbucks refunded. What I am saying is, the reason we have parts in the Part Inventory is because we spend time (build points) building those parts in the first place. If in the future we use those parts we save some build time. If we never use the parts we won\u0027t ever (again) realize that time saving. Excess parts in the Part Inventory is a product of time passed.\u003C/p\u003E\u003Cp\u003EI suggest that the player may trigger a VAB and SPH Part Inventory garage clearing sale. The reward for discarding all items is additional upgrades (you know, those that you start your career with 15 of). You can already buy upgrades for Kerbucks and science points, so why not for excess inventory parts as well?\u003C/p\u003E\u003Cp\u003EI imagine it working for instance like this:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003EThe player trigger the garage clearing sale event. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe value of the sum of all items in the Part Inventory is calculated (as if they were all part of one giant vessel being constructed from those parts). The grand total is measured in build points. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EA calculation is done that will tell the player:\u003Cbr\u003E\u003Cul\u003E\u003Cli\u003EA) the number of upgrades that can be achieved (possibly zero) by clearing the Part Inventory. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E the fraction of an upgrade that is lost because the number in \u0022A)\u0022 is rounded down to the nearest integer. \u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E[*]The player accepts or rejects. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EI think probably it is necessary that the decision is an all or nothing decision, to avoid fiddling about with the Part Inventory in micro-management fashion.\u003C/p\u003E\u003Cp\u003EIt would be even better if a check is done automatically when a vessel is recovered to check if the threshold from zero possible upgrades to one possible upgrade is crossed, so that the player can be told that a clearing sale is now possible.\u003C/p\u003E\u003Cp\u003EWhat thoughts do you all have on this topic?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E Remember Wernher von Kerman told us the place had just been cleaned up, so we should try not to mess it up too much?\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2015-06-25T17:00:03Z","Content":"\n\u003Cp\u003EI kind of like that idea for clearing out the inventory. It gives a tangible benefit for clearing it out, while not being cheaty. Players who use reusable craft with the same parts extensively won\u0027t have an inventory that\u0027s worth much, but they benefit from reduced build times already. Players who don\u0027t pay much attention to the inventory will likely have a lot of parts in there, so clearing it out will let them speed up their main rates and continue having speed increases as their career goes on. If other people like the idea, I can probably get it in the next update pretty easily and provide a formula for it so people can tweak it (or disable it entirely). I\u0027m thinking the rewards should probably taper off as you \u0022sell\u0022 more parts, as it shouldn\u0027t be a main way of getting upgrades. Which means the total value \u0022sold\u0022 previously will have to be a variable in the formula (if it were linear, then that wouldn\u0027t be an issue), which shouldn\u0027t be hard to do.\u003C/p\u003E\n"},{"CreatedByName":"JeffreyCor","CreatedById":93167,"CreatedDateTime":"2015-06-25T18:03:23Z","Content":"\n\u003Cp\u003EBeen trying it a lot with 1.0.4 and not having any problems even with an existing save \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"MarcAFK","CreatedById":142340,"CreatedDateTime":"2015-06-26T05:12:56Z","Content":"\n\u003Cp\u003ERealistically there should be a downside to keeping large inventories, but it would suffice to simply provide an incentive for people to clear it out once in a while. How about allowing individual parts to simply be sold off for some percentage of their build cost?\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2015-06-28T07:12:09Z","Content":"\n\u003Cp\u003EPresets are coming along nicely. Hopefully they\u0027ll be ready for testing tomorrow (Sunday)! Just need to add in the general settings somewhere and make it so you can save new presets based on your current settings.\u003C/p\u003E\u003Cp\u003EI\u0027m curious what your thoughts are. I\u0027m trying to not make it too hideous or difficult to work with, but GUIs are not my forte.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/tlWqmez.png\u0022 alt=\u0022tlWqmez.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe keen eyed of you will notice there are quite a number of new formulas and settings. The whole settings infrastructure was rewritten pretty much from scratch.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-28T07:16:31Z\u0022 title=\u002206/28/2015 07:16  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 28, 2015\u003C/time\u003E by magico13\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Rodhern","CreatedById":144074,"CreatedDateTime":"2015-06-28T18:45:59Z","Content":"\n\u003Cp\u003EThe idea with the presets sounds good. I for one probably won\u0027t take much notice of the GUI though; sure the GUI might be nice while balancing settings, but once a good preset is reached you basically just want to load that preset file, maybe even download it from somewhere or someone. In some sense, the most important in-game GUI setting will be the \u0022preset name\u0022. Presets aside, kudos for all that nice formula flexibility.\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2015-06-28T22:01:05Z","Content":"\n\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/69310-Kerbal-Construction-Time-StageRecovery-Dev-Thread?p=2048344#post2048344\u0022 rel=\u0022external nofollow\u0022\u003EPresets are now released for Beta testing\u003C/a\u003E. It\u0027s slightly save breaking and there\u0027s quite a few changes I haven\u0027t gotten around to testing, so I really do not advise trying the betas yet if you\u0027re not ok with some save breaking, but I\u0027d like to get a couple Presets to include in the next release, so people should try it out \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\n"},{"CreatedByName":"Jackson Mackenzie","CreatedById":77204,"CreatedDateTime":"2015-06-30T12:25:17Z","Content":"\n\u003Cp\u003EIt seems the Dreaded Tourist IDX Problem has reared its ugly head again. Identical problem, identical steps to reproduce, identical persistent.sfs edit to work around.\u003C/p\u003E\u003Cp\u003ERunning Win32 1.0.4.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003EUSI Tools 0.4.1\u003C/p\u003E\u003Cp\u003ECapCom 1.0.1.1\u003C/p\u003E\u003Cp\u003EChatterer 0.9.5.86\u003C/p\u003E\u003Cp\u003ECRP 0.4.2\u003C/p\u003E\u003Cp\u003EContract Configurator 1.5\u003C/p\u003E\u003Cp\u003EContract Pack: Anomaly Surveyor 1.2.2\u003C/p\u003E\u003Cp\u003EContract Pack: Field Research 1.0.5\u003C/p\u003E\u003Cp\u003EContract Pack: RemoteTech 1.1.4\u003C/p\u003E\u003Cp\u003EContract Pack: SCANSat Lite 1.1\u003C/p\u003E\u003Cp\u003EContract Pack: Tourism Plus 1.1.4\u003C/p\u003E\u003Cp\u003ECTT 2.1\u003C/p\u003E\u003Cp\u003EDMagic Orbital Science 1.0.4\u003C/p\u003E\u003Cp\u003EFAR 0.15.3.1\u003C/p\u003E\u003Cp\u003EFirespitter 7.1.4\u003C/p\u003E\u003Cp\u003EInterstellar Fuel Switch 1.14\u003C/p\u003E\u003Cp\u003EKAS 0.5.2\u003C/p\u003E\u003Cp\u003EKerbal Construction Time 1.1.8\u003C/p\u003E\u003Cp\u003EKerbal Joint Reinforcement 3.1.4\u003C/p\u003E\u003Cp\u003EKerbal Inventory System - 1.1.5\u003C/p\u003E\u003Cp\u003EKSP-AVC 1.1.5\u003C/p\u003E\u003Cp\u003EInfernal Robots 0.21.3\u003C/p\u003E\u003Cp\u003EMKS 0.31.4\u003C/p\u003E\u003Cp\u003EModularFlightIntegrator 1.0\u003C/p\u003E\u003Cp\u003EDocking Port Alignment Indicator 6.2\u003C/p\u003E\u003Cp\u003ENear Future Construction 0.5.3\u003C/p\u003E\u003Cp\u003ENear Future Electrical 0.5.1\u003C/p\u003E\u003Cp\u003ENear Future Propulsion 0.5.1\u003C/p\u003E\u003Cp\u003ENear Future Solar 0.5.2\u003C/p\u003E\u003Cp\u003ENear Future Spacecraft 0.4.2\u003C/p\u003E\u003Cp\u003EPlanetShine 0.2.3.1\u003C/p\u003E\u003Cp\u003EPreciseNode 1.1.3\u003C/p\u003E\u003Cp\u003EProcedural Fairings 3.15\u003C/p\u003E\u003Cp\u003ERealChute 1.3.2.3\u003C/p\u003E\u003Cp\u003ERemoteTech 1.6.7\u003C/p\u003E\u003Cp\u003ESCANsat 1.1.2.1\u003C/p\u003E\u003Cp\u003EScienceAlert 1.8.7\u003C/p\u003E\u003Cp\u003ESmartParts 1.6.5\u003C/p\u003E\u003Cp\u003ESpaceY Lifters 0.17.2\u003C/p\u003E\u003Cp\u003EStageRecovery 1.5.6\u003C/p\u003E\u003Cp\u003EStock Bug Fixes 1.0.2e3\u003C/p\u003E\u003Cp\u003ETextureReplacer 2.4.6\u003C/p\u003E\u003Cp\u003ETAC Life Support 0.11.1.20\u003C/p\u003E\u003Cp\u003ETrajectories 1.3\u003C/p\u003E\u003Cp\u003ETweakScale 2.2.1\u003C/p\u003E\u003Cp\u003EUniversal Storage 1.1.0.5\u003C/p\u003E\u003Cp\u003EWaypoint Manager 2.3.4\u003C/p\u003E\u003Cp\u003EWider Contracts App 1.1.2\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/cd5ub7i5ctxvjkl/output_log.txt?dl=0\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003ELog.\u003C/strong\u003E\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2015-06-30T15:38:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jackson Mackenzie\u0022 data-cite=\u0022Jackson Mackenzie\u0022\u003E\u003Cdiv\u003EIt seems the Dreaded Tourist IDX Problem has reared its ugly head again. Identical problem, identical steps to reproduce, identical persistent.sfs edit to work around.\u003Cp\u003ERunning Win32 1.0.4.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI can\u0027t be certain, but it looks like it\u0027s somehow Contract Configurator related. The error below is being listed repeatedly. I\u0027m not sure if it\u0027s KCT related still (like an issue with how KCT loads passengers), but you might post it over in that thread too and see if it\u0027s something nightingale has seen before or something he can help track down the source of. I can\u0027t say I\u0027d be too surprised if it\u0027s an incompatibility with KCT\u0027s loading mechanism.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003ENullReferenceException: Object reference not set to an instance of an object\u003Cbr\u003E  at ContractConfigurator.Behaviour.SpawnPassengers\u002BPassengerLoader.PassengerDialog (Int32 windowID) [0x00000] in \u0026lt;filename unknown\u0026gt;:0 \u003Cbr\u003E  at UnityEngine.GUILayout\u002BLayoutedWindow.DoWindow (Int32 windowID) [0x00000] in \u0026lt;filename unknown\u0026gt;:0 \u003Cbr\u003E  at UnityEngine.GUI.CallWindowDelegate (UnityEngine.WindowFunction func, Int32 id, UnityEngine.GUISkin _skin, Int32 forceRect, Single width, Single height, UnityEngine.GUIStyle style) [0x00000] in \u0026lt;filename unknown\u0026gt;:0 \u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"Jackson Mackenzie","CreatedById":77204,"CreatedDateTime":"2015-06-30T21:41:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022magico13\u0022 data-cite=\u0022magico13\u0022\u003E\u003Cdiv\u003EI can\u0027t be certain, but it looks like it\u0027s somehow Contract Configurator related. The error below is being listed repeatedly. I\u0027m not sure if it\u0027s KCT related still (like an issue with how KCT loads passengers), but you might post it over in that thread too and see if it\u0027s something nightingale has seen before or something he can help track down the source of. I can\u0027t say I\u0027d be too surprised if it\u0027s an incompatibility with KCT\u0027s loading mechanism.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDollars to doughnuts says it\u0027s something to do with Tourism Plus. I\u0027ll run some tests, and also post over in the CC thread, and get back to you.\u003C/p\u003E\n"},{"CreatedByName":"ebigunso","CreatedById":113229,"CreatedDateTime":"2015-07-03T22:54:30Z","Content":"\n\u003Cp\u003EStart in orbit function of KCT simulation breaks antennas that are set to start deployed, if they are the kind that snaps under high dynamic pressure. I want to test out probes with RT, and this is forcing me to add non snapping antenna for testing which has a significant impact on mass when the probe is very small.\u003C/p\u003E\u003Cp\u003EI hope it gets fixed.\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2015-07-03T23:26:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ebigunso\u0022 data-cite=\u0022ebigunso\u0022\u003E\u003Cdiv\u003EStart in orbit function of KCT simulation breaks antennas that are set to start deployed, if they are the kind that snaps under high dynamic pressure.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECan you test for me to see if the same thing happens if you turn on the Delay Move To Orbit setting (under Advanced in the simulation configuration window). If so, I might need to try out a new way of starting simulations.\u003C/p\u003E\n"},{"CreatedByName":"ebigunso","CreatedById":113229,"CreatedDateTime":"2015-07-05T06:36:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022magico13\u0022 data-cite=\u0022magico13\u0022\u003E\u003Cdiv\u003ECan you test for me to see if the same thing happens if you turn on the Delay Move To Orbit setting (under Advanced in the simulation configuration window). If so, I might need to try out a new way of starting simulations.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt does. Also it would be nice if there was an option to wait on the pad longer (maybe until I press a button or something) until I finish setting targets on the RT dishes, for when I test things out on distant planets.\u003C/p\u003E\u003Cp\u003EEDIT: It does at first when you come out of the VAB, but it doesn\u0027t when you hit restart simulation from the KCT button. Don\u0027t know whats the difference here but that seems to be how it works.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-05T08:01:34Z\u0022 title=\u002207/05/2015 08:01  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 5, 2015\u003C/time\u003E by ebigunso\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Mal","CreatedById":147098,"CreatedDateTime":"2015-07-06T16:16:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022magico13\u0022 data-cite=\u0022magico13\u0022\u003E\u003Cdiv\u003EVessels take time to build, dependent on vessel complexity (cost), how many times the parts have been used before, if any of the parts are in your inventory, and your Build Rates.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIs there any documentation of what the rates - ie, rate 1, rate 2, rate 3 etc actually do and why you would want to use them?\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2015-07-06T16:44:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mal\u0022 data-cite=\u0022Mal\u0022\u003E\u003Cdiv\u003EIs there any documentation of what the rates - ie, rate 1, rate 2, rate 3 etc actually do and why you would want to use them?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere\u0027s the \u003Ca href=\u0022https://dl.dropboxusercontent.com/u/25340912/KCT%20Guide.pdf\u0022 rel=\u0022external nofollow\u0022\u003EGetting Started Guide\u003C/a\u003E which covers all the basics. The rates control how fast a particular vessel is built. The higher the rate, the faster it gets built. Having two rates means you can build two vessels at once. Having a rate of 2.0 means vessels take half as much time as if you were building something at a rate of 1.0.\u003C/p\u003E\u003Cp\u003EIf you want to get technical, rates are listed in Build Points per second. Vessels have a certain Build Point value (based on cost, number of times a part has been used, and whether the part is pulled from the inventory). So if you have a vessel worth 86400 Build Points and a rate of 1.0 BP/s, then it will take 86400 seconds to build, which is 24 hours. If you have a rate of 2.0 BP/s then it will take 43200 seconds (12 hours) to build.\u003C/p\u003E\u003Cp\u003EMultiple rates don\u0027t stack together to build a single vessel, but allow you to instead build multiple vessels at once. I can provide some concrete examples of how that can be better than putting all your points into a single rate, if you want.\u003C/p\u003E\n"},{"CreatedByName":"Mal","CreatedById":147098,"CreatedDateTime":"2015-07-06T18:46:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022magico13\u0022 data-cite=\u0022magico13\u0022\u003E\u003Cdiv\u003EHaving two rates means you can build two vessels at once.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks. That clears it up. Being on the menu as a selection item, and as it isn\u0027t that intuitive it might be better to add this tiny bit of info to the first post as well.\u003C/p\u003E\n"},{"CreatedByName":"Svm420","CreatedById":136047,"CreatedDateTime":"2015-07-07T06:06:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Drake1500\u0022 data-cite=\u0022Drake1500\u0022\u003E\u003Cdiv\u003EWell, this is what I get for posting a \u0022solution\u0022 without testing it myself. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 alt=\u0022:blush:\u0022\u003E Sorry.\u003Cp\u003EHowever, I\u0027ve looked and it seems that the first formula I gave you caused KCT to go through a loop, creating build lines forever, until you eventually shut the game down forcefully (might want to mention that in your documentation, magico13. Would help people like me who want to modify the formulas \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E)\u003C/p\u003E\u003Cp\u003EThis will solve that:\u003C/p\u003E\u003Cp\u003EBuildRateFormula = (0.05*[N] \u002B max(0.1-\u003Cem\u003E, 0))*sign(20*([L]\u002B1)-\u003C/em\u003E\u003Cem\u003E\u003Cem\u003E)\u003C/em\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cem\u003EThis won\u0027t give you an unlimited number of build lines (as I hoped to give you before), but it will give you 20 build lines per upgrade level of the VAB/SPH. I have tested this on my own game, and it works, although you\u0027ll need to start a new game (loading an old save will not load the build rates properly).\u003C/em\u003E\u003C/em\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cem\u003E\u003Cem\u003EQuoting this for later. Cat wait to try this\u003C/em\u003E\u003C/em\u003E\u003C/p\u003E\n"},{"CreatedByName":"Probus","CreatedById":102512,"CreatedDateTime":"2015-07-10T14:13:18Z","Content":"\n\u003Cp\u003EMagico, even though I have build rate 4 up to 1.4, KCT won\u0027t allow me to put points towards build rate 5. I looked through the documentation to see if I missed something, but couldn\u0027t find anything related to this problem. What am I missing?\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2015-07-10T14:48:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Probus\u0022 data-cite=\u0022Probus\u0022\u003E\u003Cdiv\u003EMagico, even though I have build rate 4 up to 1.4, KCT won\u0027t allow me to put points towards build rate 5. I looked through the documentation to see if I missed something, but couldn\u0027t find anything related to this problem. What am I missing?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIs your VAB only level 2? Because that would be why. You can have two rates per level with the default values (kinda snuck that in, partly as a proof of concept). If you want to get around that, you\u0027ll need to make a small change to the rate formula. In BuildRateFormula, change the \u0022sign(2*[L]-\u003Cem\u003E\u002B1)\u0022 portion to \u0022sign(X*[L]-\u003C/em\u003E\u003Cem\u003E\u003Cem\u003E\u002B1)\u0022 where X is the number of rates you want at each level (set it to 10 or something like that to basically ignore the limit). Just don\u0027t remove that section, otherwise it won\u0027t stop trying to make rates and you\u0027ll get stuck in an infinite loop (I may have fixed that in the released version, but it might only be fixed in the dev version. I apparently didn\u0027t mention it in the commit log)\u003C/em\u003E\u003C/em\u003E\u003C/p\u003E\n"},{"CreatedByName":"Probus","CreatedById":102512,"CreatedDateTime":"2015-07-10T14:52:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022magico13\u0022 data-cite=\u0022magico13\u0022\u003E\u003Cdiv\u003EIs your VAB only level 2? Because that would be why. You can have two rates per level with the default values (kinda snuck that in, partly as a proof of concept). If you want to get around that, you\u0027ll need to make a small change to the rate formula. In BuildRateFormula, change the \u0022sign(2*[L]-\u003Cem\u003E\u002B1)\u0022 portion to \u0022sign(X*[L]-\u003C/em\u003E\u003Cem\u003E\u003Cem\u003E\u002B1)\u0022 where X is the number of rates you want at each level (set it to 10 or something like that to basically ignore the limit). Just don\u0027t remove that section, otherwise it won\u0027t stop trying to make rates and you\u0027ll get stuck in an infinite loop (I may have fixed that in the released version, but it might only be fixed in the dev version. I apparently didn\u0027t mention it in the commit log)\u003C/em\u003E\u003C/em\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cem\u003E\u003Cem\u003ENice touch. I had a feeling something like that was happening. Just drop a note in the docs or OP and you should be good.\u003C/em\u003E\u003C/em\u003E\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2015-07-10T14:57:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Probus\u0022 data-cite=\u0022Probus\u0022\u003E\u003Cdiv\u003ENice touch. I had a feeling something like that was happening. Just drop a note in the docs or OP and you should be good.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI need to go through an update the documentation for the next release anyway, so I\u0027ll make sure to point that out. The Presets system needs a thorough explanation and some solid examples to make it easier to make new, unique, Presets. And the basic user needs to know what they need to do with that window, since it can be quite a bit of info all at once but is where you set all of the settings. (End users will just have to select an existing Preset, or turn a feature on or off with a button press)\u003C/p\u003E\n"},{"CreatedByName":"Cosmic_Farmer","CreatedById":110210,"CreatedDateTime":"2015-07-10T17:05:00Z","Content":"\n\u003Cp\u003EI\u0027ve used this mod for quite a while now, and wouldn\u0027t be without it. I\u0027ve found it to be an excellent tool for mod development, due to the ability to easily and instantly get vessels into various situations. Keep up the good work!\u003C/p\u003E\n"},{"CreatedByName":"autumnalequinox","CreatedById":114782,"CreatedDateTime":"2015-07-12T01:53:01Z","Content":"\n\u003Cp\u003EI just realized something upon starting my first 1.0.4 career. You know, if it wasn\u0027t for KCT, there would be little meaning to the contract completion time limits. I mean..wow, I have had to juggle some builds and my few upgrade points to just barely get a few contracts before they expire. I mean seriously, that\u0027s something in stock that is literally made for this mod. Awesome. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}