{"TopicId":83342,"ForumId":34,"TopicTitle":"[1.4.1] Kerbal Construction Time 1.4.0.69 (2018-03-24) - Unrapid Planned Assembly","CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2014-08-30T01:40:22Z","PageNum":74,"Articles":[{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2015-11-23T19:13:27Z","Content":"\n[quote name=\u0027Barklight\u0027]Yeah, I have been using StageRecovery for a while actually. That\u0026#39;s an equally amazing piece of work - just started using KCT :) If I can find a good tool for recording (Unity and NVidia ShadowPlay don\u0026#39;t like each other very much) I\u0026#39;d probably start recording this super hard mode game and give you some more \u0022here\u0026#39;s KCT in action\u0022 material.\u003Cbr\u003E\n\u003Cbr\u003E\n[U]Off-Topic[/U]: Does your StageRecovery mod no longer give you message log notifications on recovery or failure to recover? I launched a rocket lastnight and discarded my 2nd ascent stage for recovery, it had 2x radial RealChutes on it. I noticed that I didn\u0026#39;t get a notification for either a destruction or a recovery, and hadn\u0026#39;t been the entire campaign. Is all that just automated now or is there probably something wonky with the game?[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nI used to use Shadowplay without issues with my GTX 770 for KSP, but have switched over to OBS.\u003Cbr\u003E\n\u003Cbr\u003E\nThere are options to disable recovery messages, but you should still be getting them if you haven\u0026#39;t switched them off. If you haven\u0026#39;t updated to the newest version then that\u0026#39;s probably why. 1.0.5 broke things a little bit, but I haven\u0026#39;t gotten any reports of any issues with the 1.5.8 update of StageRecovery (doesn\u0026#39;t mean there aren\u0026#39;t issues, just that nobody\u0026#39;s mentioned them).\n"},{"CreatedByName":"chrisl","CreatedById":114320,"CreatedDateTime":"2015-12-02T18:18:51Z","Content":"\n\u003Cp\u003E\nI\u0027m playing with RO/RSS/RP-0 with various other mods including KCT and RN US Probes.  Lately I\u0027ve trying to test a few probes I want to send to Venus and Mars but I\u0027ve been running into problem using KCT\u0027s \u0022simulate\u0022 option.  When I try to run a simulation of a probe in orbit (whether it\u0027s Earth orbit or any other planet), most times the probes I\u0027m trying to simulate are being wrecked apparently do to traveling through the atmosphere at too high a speed.  Of course, since I told the system to simulate in orbit, I never should have actually passed through an atmosphere.  Not sure if there is anything that can be done to fix things so that the simulate option can put a satellite at the right altitude, and then adjust it\u0027s velocity so that atmospheric conditions don\u0027t come into play.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAlso, if you use KCT with RemoteTech, it\u0027s very hard to simulate around another planet because there is no way to set the antennae up from within the VAB and the 5 second delay you can set now isn\u0027t enough time to actually set the antenna while you\u0027re still on the pad.  Is there any possibility of increasing the delay so there\u0027s enough time to get antenna turned on and aimed properly?\n\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2015-12-02T18:45:33Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/114320-chrisl/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022114320\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/114320-chrisl/\u0022\u003E@chrisl\u003C/a\u003E those are both things I\u0027m planning on getting around. Unfortunately until I rewrite the simulation code to spawn the vessel in orbit rather than moving it to orbit you\u0027re going to run into the \u0022atmosphere\u0022 problem :/ That\u0027s one of the reasons I want to rewrite that code. It shouldn\u0027t happen at all (and doesn\u0027t in Stock) because the vessel is packed.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAs for RemoteTech, I\u0027ve done a bit of work on disabling it for a vessel. If you open up the KCT menu during a simulation you should see a button for disabling RemoteTech. It\u0027s not fully functional and it has a few quirks: 1. It works best if your vessel has no antenna on it at all, and 2. you can\u0027t re-enable RemoteTech on that vessel. I know I can fix 2, but was having lots of trouble getting it to work when there are antenna on the vessel. I may make the delay adjustable in the mean time (but am planning on removing it when I rewrite everything).\n\u003C/p\u003E\n"},{"CreatedByName":"komodo","CreatedById":102065,"CreatedDateTime":"2015-12-02T21:03:11Z","Content":"\n\u003Cp\u003E\nI really enjoy the mod, but I had a potentially simple question: At some past point, the Kerbal Alarm Clock integration was able to be set delete on close the alarms set by KCT. At the current moment, i\u0027m not able to see any setting that seems to apply in either option menu... That is to say, I have to click the delete on close radio button on each alert. This is a very minor thing, but I wondered if I am missing something obvious. (Probably! Or, i\u0027m crazy and imagined the past behavior. One or the other...)\n\u003C/p\u003E\n\u003Cp\u003E\nThe other more general question I had, is is there a particular set of settings (awkward sentence...) that people use for 6.4x sized KSP? I know that RO ships their own (I think?), but that seems like it might be too ... RO for a 6.4x world. That said, i\u0027m not sure what i\u0027d adjust either, so that was why I wondered if anyone had any feedback.\n\u003C/p\u003E\n\u003Cp\u003E\nThanks!\n\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2015-12-02T21:13:10Z","Content":"\n\u003Cp\u003E\n\u003Cspan\u003E\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/102065-komodo/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022102065\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/102065-komodo/\u0022\u003E@komodo\u003C/a\u003EThe KAC integration hasn\u0027t changed at all and hasn\u0027t ever had any configurability other than on/off. I intend on updating it so you can choose what triggers the creation of an alarm and how the alarm should behave, but it isn\u0027t a high priority. So you\u0027re not missing anything, it just doesn\u0027t exist yet!\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003ERP-0 (the career mode version of RO) has a Preset that they use because the way they balance things is very specific. 6.4x probably doesn\u0027t need any special tweaks since I don\u0027t think things (other than planet size) are altered. If you wanted, you can modify the Overall Modifier, Build Effect, or Inventory Effect to adjust the build times (I can help you with that if you let me know what you\u0027re looking for). Or if you\u0027re feeling really crazy you can modify all the formulas that are used for calculating time/build rates/costs/etc. If you want to do that, read through the three related topics in the wiki on GitHub, \u003Ca href=\u0022https://github.com/magico13/KCT/wiki/Presets:-An-Overview\u0022 rel=\u0022external nofollow\u0022\u003Elinked here\u003C/a\u003E, then come back and I\u0027ll help you out \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"vardicd","CreatedById":75832,"CreatedDateTime":"2015-12-03T15:44:26Z","Content":"\n\u003Cp\u003E\nHere\u0027s a question/feature request. How difficult would it be to make this compatible with Extraplanetary launchpads? Specifically, if I set up a EPL pad at the North pole of kerbin, yes I can build a rocket there from ore, and rocketparts, but could KCT use it\u0027s in game select Launchpad to detect that EPL pad at the North pole and build and \u0027ship\u0027 a rocket to it to launch? does that make sense/ are you getting what I\u0027m asking here?\n\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2015-12-03T18:06:55Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/75832-vardicd/\u0026amp;do=hovercard\u0022 data-mentionid=\u002275832\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/75832-vardicd/\u0022\u003E@vardicd\u003C/a\u003E I haven\u0027t ever looked into it, but I don\u0027t think it\u0027d be that easy. That\u0027s something better suited for Kerbal Konstructs, which does have support because it\u0027s just a matter of changing the launchsite string. EPL uses a totally custom code to launch vessels. Maybe, and it\u0027s a big maybe, I could put a vessel into the EPL build queue and set the build status to built. You\u0027d still have to fuel it I think (but that\u0027s not too bad if you\u0027ve got ISRU set up already).\n\u003C/p\u003E\n\u003Cp\u003E\nNot a high enough priority for me to look into it at the moment, but if someone else does look into it and points me to the things I\u0027d need to interface with then I\u0027ll see what I can do. My reflection skills are improving, so if someone finds the right methods I can probably trigger them even without an API.\n\u003C/p\u003E\n"},{"CreatedByName":"vardicd","CreatedById":75832,"CreatedDateTime":"2015-12-03T18:35:25Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222306491\u0022 data-ipsquote-contentid=\u002283342\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221449166015\u0022 data-ipsquote-userid=\u002273338\u0022 data-ipsquote-username=\u0022magico13\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n27 minutes ago, magico13 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/75832-vardicd/\u0026amp;do=hovercard\u0022 data-mentionid=\u002275832\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/75832-vardicd/\u0022\u003E@vardicd\u003C/a\u003E I haven\u0027t ever looked into it, but I don\u0027t think it\u0027d be that easy. That\u0027s something better suited for Kerbal Konstructs, which does have support because it\u0027s just a matter of changing the launchsite string. EPL uses a totally custom code to launch vessels. Maybe, and it\u0027s a big maybe, I could put a vessel into the EPL build queue and set the build status to built. You\u0027d still have to fuel it I think (but that\u0027s not too bad if you\u0027ve got ISRU set up already).\n\u003C/p\u003E\n\u003Cp\u003E\nNot a high enough priority for me to look into it at the moment, but if someone else does look into it and points me to the things I\u0027d need to interface with then I\u0027ll see what I can do. My reflection skills are improving, so if someone finds the right methods I can probably trigger them even without an API.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat\u0027s okay, it was just a thought, prompted by the announcement in the kerbal constructs post that 1.05 broke kerbal constructs and the mod is on hold.\n\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2015-12-03T18:55:11Z","Content":"\n\u003Cp\u003E\nSkimming the source, there\u0027s a few methods I\u0027ve found that would make it feasible to do. I\u0027d just have to figure out exactly how to do it. It\u0027d need a new GUI. You\u0027d have to load up the EPL pad, then open the GUI and choose a built KCT vessel to ship to there, then it could possibly be built spawned. The method for spawning the craft is an \u0022internal\u0022 method so I\u0027m not positive if I can trigger it. Reflection lets you do things you shouldn\u0027t be able to do (like access and overwrite private variables), so I probably can.\n\u003C/p\u003E\n"},{"CreatedByName":"vardicd","CreatedById":75832,"CreatedDateTime":"2015-12-03T21:30:58Z","Content":"\n\u003Cp\u003E\nah, its not that big of a deal, I was just wondering. if its going to need some big project, don\u0027t worry about it.\n\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2015-12-03T22:20:44Z","Content":"\n\u003Cp\u003E\nIt\u0027s certainly not trivial, but it doesn\u0027t appear to be too difficult. I haven\u0027t used EPL or tinkered with the code enough to be sure though. I added it on \u003Ca href=\u0022https://github.com/magico13/KCT/issues/110\u0022 rel=\u0022external nofollow\u0022\u003EGitHub\u003C/a\u003E to remind me to look into it should I find myself wanting to work on a random side project.\n\u003C/p\u003E\n"},{"CreatedByName":"evileye.x","CreatedById":153755,"CreatedDateTime":"2015-12-07T11:48:51Z","Content":"\n\u003Cp\u003E\nHello \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/73338-magico13/\u0026amp;do=hovercard\u0022 data-mentionid=\u002273338\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/73338-magico13/\u0022\u003E@magico13\u003C/a\u003E, I want to thank you for your great mods, they are so cool.\u003Cbr\u003E\nI mean both KCT and Stage Recovery adding so much to gameplay. Really, brilliant mod. I play without reverts (unless it\u0027s simulation) or reloads, so I always try to back up my mission with duplicate rockets and supply dropships ready to go.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve come up with an idea and I beleive it\u0027s you who can make it real \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m bothered with kerbal crews quality of life and it would be great to have something cool like TAC LS or KCT to fix 2 moments:\n\u003C/p\u003E\n\u003Cp\u003E\n1)Poor Jeb has no vacation or rest (unless his rocket is being build by KCT \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E , but still...)\n\u003C/p\u003E\n\u003Cp\u003E\n2)Poor Jeb can be cramped in small Gemini capsule for days and weeks (sometimes years)\n\u003C/p\u003E\n\u003Cp\u003E\nSo... The idea is - kerbals should have vacations based on mission time and \u0022cramped multiplier\u0022 (being x days in tiny capsule make them tired) - to make soyz-style crafts (for example HGR sojuice) or hitchhikers useful. I mean if you have 2 occupied seat and 2 free (even better 4 in Hitchhiker) seat, then your Kerman recovers faster from mission. Moonwalk also has a good effect on that (or even landed status). If cramped for too long, thay retire (also all the stuff may take kerbals attributes in account). Or ( \u003Cimg alt=\u0022:confused:\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 title=\u0022:confused:\u0022\u003E ) make space walk without helmet? \n\u003C/p\u003E\n\u003Cp\u003E\nAlso, other penalty could be Remote Tech style delays in your Kerbals actions if they are cramped for too long. \n\u003C/p\u003E\n\u003Cp\u003E\nI think it was already proposed, but... What do you think? Will be perfect addintion to KCT. Kerbals Safety \u0026amp; Wellness ? or Kerbals HR ? Kerbal Labour Union ? Kerbal Mood?\n\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2015-12-07T16:09:10Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/153755-evileyex/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022153755\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/153755-evileyex/\u0022\u003E@evileye.x\u003C/a\u003E Those are both great ideas, but too far out of scope of KCT itself. I\u0027d love to play KCT with those as other mods however! For your first suggestion, there\u0027s a mod called CrewQueue that was being developed that added required vacation time after each mission. Development seems to have stagnated and there are mixed reports about whether it works with KCT correctly. I\u0027d love to see that mod working though as it would go great with KCT.\n\u003C/p\u003E\n\u003Cp\u003E\nAs for your second suggestion, I know a few people have worked on several mods in the past to address that issue. I\u0027m not sure if any of them got to a playable state though. I don\u0027t think I\u0027d have the time to get one up to speed either unfortunately, which would just add another half-working mod to that list.\n\u003C/p\u003E\n\u003Cp\u003E\nI love the ideas though and am really hoping some mods come up to implement them! KCT was my first mod and I\u0027d like to think it\u0027s fairly \u0022complete\u0022 (it\u0027s far from being actually complete, but it seems like it\u0027s at the point where it can go a while between updates and be ok), so maybe some new modders will come out of nowhere and create some awesome things!\n\u003C/p\u003E\n"},{"CreatedByName":"komodo","CreatedById":102065,"CreatedDateTime":"2015-12-07T21:37:53Z","Content":"\n\u003Cp\u003E\nFor the kerbal fatigue thing, there is KeepFit, which works pretty well. My only beef with it is the need to configure each crewed capsule individually due to different levels of volume/comfort for each. If it weren\u0027t for that, it\u0027d be an instant include in my mod loadout.  But, it might be worth looking at regardless!\n\u003C/p\u003E\n"},{"CreatedByName":"Galileo","CreatedById":150430,"CreatedDateTime":"2015-12-09T08:52:47Z","Content":"\n\u003Cp\u003E\n I\u0027m using the 64bit workaround and I keep getting the same error about how \u0022the game will be unplayable in this state\u0022  is this an easy fix?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.dropbox.com/s/l2gb0cp2cwhc6e5/output_log.txt?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/l2gb0cp2cwhc6e5/output_log.txt?dl=0\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nUpdate: all I did was delete kct and re-installed it and now it works perfectly\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-12-09T09:42:10Z\u0022 title=\u002212/09/2015 09:42  AM\u0022 data-short=\u00228 yr\u0022\u003EDecember 9, 2015\u003C/time\u003E by Berlin\u003C/strong\u003E\n\u003Cbr\u003EUpdate\n\u003C/span\u003E\n"},{"CreatedByName":"evileye.x","CreatedById":153755,"CreatedDateTime":"2015-12-09T09:14:44Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222314656\u0022 data-ipsquote-contentid=\u002283342\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221449651167\u0022 data-ipsquote-userid=\u0022150430\u0022 data-ipsquote-username=\u0022Berlin\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n20 minutes ago, Berlin said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n I\u0027m using the 64bit workaround and I keep getting the same error about how \u0022the game will be unplayable in this state\u0022  is this an easy fix?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI play with 64bit workaround and getting error when starting new career, but other than that all works fine\n\u003C/p\u003E\n"},{"CreatedByName":"Galileo","CreatedById":150430,"CreatedDateTime":"2015-12-09T09:16:57Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222314680\u0022 data-ipsquote-contentid=\u002283342\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221449652484\u0022 data-ipsquote-userid=\u0022153755\u0022 data-ipsquote-username=\u0022evileye.x\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n24 minutes ago, evileye.x said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI play with 64bit workaround and getting error when starting new career, but other than that all works fine\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI get it during a new career and during new sandbox games. I don\u0027t have the button in my tool bar and its pretty annoying.\n\u003C/p\u003E\n\u003Cp\u003E\nUpdate: all I did was delete kct and re-installed it and now it works perfectly\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-12-09T09:41:10Z\u0022 title=\u002212/09/2015 09:41  AM\u0022 data-short=\u00228 yr\u0022\u003EDecember 9, 2015\u003C/time\u003E by Berlin\u003C/strong\u003E\n\u003Cbr\u003EUpdate\n\u003C/span\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2015-12-09T15:36:27Z","Content":"\n\u003Cp\u003E\nThe 64 bit workaround isn\u0027t officially supported by me, partly because that error message randomly pops up for seemingly no reason and it\u0027s not worth it to me to figure out why, given that 1.1 will have proper 64 bit support and that most people still report that KCT works despite the error message. When 1.1 comes out I will be supporting 64 bit as well, but I also expect it will have way less random bugs.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWith that said, I\u0027ll still look to see if I can fix any bugs that are reported with the 64 bit workaround, but it\u0027s not something I\u0027ll lose sleep over.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-12-09T15:37:26Z\u0022 title=\u002212/09/2015 03:37  PM\u0022 data-short=\u00228 yr\u0022\u003EDecember 9, 2015\u003C/time\u003E by magico13\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Galileo","CreatedById":150430,"CreatedDateTime":"2015-12-09T19:22:35Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222315012\u0022 data-ipsquote-contentid=\u002283342\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221449675387\u0022 data-ipsquote-userid=\u002273338\u0022 data-ipsquote-username=\u0022magico13\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, magico13 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe 64 bit workaround isn\u0027t officially supported by me, partly because that error message randomly pops up for seemingly no reason and it\u0027s not worth it to me to figure out why, given that 1.1 will have proper 64 bit support and that most people still report that KCT works despite the error message. When 1.1 comes out I will be supporting 64 bit as well, but I also expect it will have way less random bugs.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWith that said, I\u0027ll still look to see if I can fix any bugs that are reported with the 64 bit workaround, but it\u0027s not something I\u0027ll lose sleep over.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOK sounds good to me. I\u0027m not too worried about it as I see that after entering the VAB and exiting it seems to work fine so its all good\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"NotAgain","CreatedById":150764,"CreatedDateTime":"2015-12-12T09:45:56Z","Content":"\n\u003Cp\u003E\nHey guys, does anyone know why I sometimes get a \u0027KCT loading error\u0027 when I try to launch from a Kerbinside facility?\n\u003C/p\u003E\n"},{"CreatedByName":"vardicd","CreatedById":75832,"CreatedDateTime":"2015-12-12T14:32:14Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222319311\u0022 data-ipsquote-contentid=\u002283342\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221449913556\u0022 data-ipsquote-userid=\u0022150764\u0022 data-ipsquote-username=\u0022NotAgain\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, NotAgain said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHey guys, does anyone know why I sometimes get a \u0027KCT loading error\u0027 when I try to launch from a Kerbinside facility?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027ve heard kerbinside is [possibly] broken in 1.05, and may not be stable, maybe this is why? {fully accept I maybe wrong about the status of kerbinside} \u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"ZaPPPa","CreatedById":94708,"CreatedDateTime":"2015-12-19T01:28:04Z","Content":"\n\u003Cp\u003E\nI am wondering how KCT chooses what skin to use? I sometimes get the unity style skin and sometimes the ksp style skin. I prefer the unity skin, but am (for some reason) in my current campaign stuck with the ksp style skin and no way to change it\n\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2015-12-19T01:52:03Z","Content":"\n\u003Cp\u003E\nIt\u0027s only supposed be using one skin: KSP style background with Unity style buttons/text/etc. If it does something else then another mod might be leaking their skin changes through. I should add a skin switcher in. I\u0027ve got one for BROKE that I could probably adapt pretty easily.\n\u003C/p\u003E\n"},{"CreatedByName":"ZaPPPa","CreatedById":94708,"CreatedDateTime":"2015-12-19T02:01:14Z","Content":"\n\u003Cp\u003E\nIt looks like KSP Calendar is the culprit.. it was the last mod I installed and after I uninstalled it, KCT went back to normal\n\u003C/p\u003E\n"},{"CreatedByName":"MaxwellsDemon","CreatedById":147660,"CreatedDateTime":"2015-12-21T15:35:09Z","Content":"\n\u003Cp\u003E\nI\u0027ve started a career reboot using KCT, and overall I am really enjoying it; it puts the brakes on early career mode, which goes by way too fast in stock.   Excellent add-on.\n\u003C/p\u003E\n"}]}