{"TopicId":8423,"ForumId":34,"TopicTitle":"Component Space Shuttle V 5.0.1 (July 14, 2013)","CreatedByName":"Cepheus","CreatedById":10683,"CreatedDateTime":"2012-03-21T01:29:26Z","PageNum":25,"Articles":[{"CreatedByName":"DoubleOSeven1","CreatedById":57582,"CreatedDateTime":"2014-01-22T00:37:35Z","Content":"\n\u003Cp\u003EIf I could model, i\u0027d apply but alas I can\u0027t... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Thesonicgalaxy","CreatedById":71406,"CreatedDateTime":"2014-01-22T00:50:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dragon01\u0022 data-cite=\u0022Dragon01\u0022\u003E\u003Cdiv\u003EWell, the thing is, my previous estimate would\u0027ve been good (it\u0027s pretty much all done, except for those gear), if it wasn\u0027t for a rather stupid way Rocket modeled those gears. Had the wheels been a separate object, the thing would\u0027ve been working by now. It\u0027s about 80% done, I never expected those last 20% to prove so difficult. \u003Cp\u003EWell, that, and our modeler/Unity guy just went to the Army. That\u0027s bad news for the Shuttle. So the post is now open, in case anyone wants to tackle those gear. I suddenly doubt this will be finished at all, with luck like that. Really, CSS is the KSP equivalent of DNF. Just when it seems it can finally get done, everything comes crashing down. \u003Cem\u003EAgain. \u003C/em\u003EThat said, there\u0027s progress, it\u0027s not enough of it.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECSS\u0027s has really bad luck doesn\u0027t it. Anyway, as a side question, is there anyway i can get the new SAS in the CSS? It can be a pain sometimes to launch it when i need to make maneuver.\u003C/p\u003E\n"},{"CreatedByName":"DoctorFoo","CreatedById":80711,"CreatedDateTime":"2014-01-22T16:58:05Z","Content":"\n\u003Cp\u003EAny chance you\u0027d be willing to post the progress as an alpha in the meantime? I\u0027d love to have an improved shuttle to fly around even if if can\u0027t land properly. \u003C/p\u003E\u003Cp\u003EIs there also a possibility of disabling the gears altogether and we can just add our own gears (B9 et al) in the interim?\u003C/p\u003E\n"},{"CreatedByName":"Virtualgenius","CreatedById":67644,"CreatedDateTime":"2014-01-23T23:10:09Z","Content":"\n\u003Cp\u003EWhat about asking for Volunteers to help you out make it a community project its more likely to get finished, there are some really great modders on here and I have never seen a forum community so happy to help other members out when they are stuck. You could list the parts you need done supply any current source files and stitch the finished product all together. I think this would be the quickest and fastest way to complete it also an alpha release will give you a heads up of what needs to be addressed you will have a plethora of volunteers.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-23T23:12:24Z\u0022 title=\u002201/23/2014 11:12  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 23, 2014\u003C/time\u003E by Virtualgenius\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2014-01-24T00:07:32Z","Content":"\n\u003Cp\u003EWell, I am asking for volunteers. PM me and I\u0027ll send you the source files to play with. Just keep in mind, the Shuttle\u0027s a mess. It\u0027s up to Cepheus to update OP with that info, but I\u0027m definitely looking for someone experienced in modeling.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DoctorFoo\u0022 data-cite=\u0022DoctorFoo\u0022\u003E\u003Cdiv\u003EAny chance you\u0027d be willing to post the progress as an alpha in the meantime? I\u0027d love to have an improved shuttle to fly around even if if can\u0027t land properly. \u003Cp\u003EIs there also a possibility of disabling the gears altogether and we can just add our own gears (B9 et al) in the interim?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere\u0027s no Alpha to post. Nothing has really improved since 5.0.1. We focused exclusively on the modelling side of things, and our modeler just quit. We were unable to work the problems out, as I said, the model is old and has some very fundamental flaws.\u003C/p\u003E\n"},{"CreatedByName":"Thesonicgalaxy","CreatedById":71406,"CreatedDateTime":"2014-01-24T01:43:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dragon01\u0022 data-cite=\u0022Dragon01\u0022\u003E\u003Cdiv\u003EWell, I am asking for volunteers. PM me and I\u0027ll send you the source files to play with. Just keep in mind, the Shuttle\u0027s a mess. It\u0027s up to Cepheus to update OP with that info, but I\u0027m definitely looking for someone experienced in modeling.\u003Cp\u003EThere\u0027s no Alpha to post. Nothing has really improved since 5.0.1. We focused exclusively on the modelling side of things, and our modeler just quit. We were unable to work the problems out, as I said, the model is old and has some very fundamental flaws.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t understand why you guys just didn\u0027t make a whole new model. I mean, i know it takes alot of work, but you probably would have it done by now.\u003C/p\u003E\n"},{"CreatedByName":"SS_Endeavour","CreatedById":102187,"CreatedDateTime":"2014-01-29T20:31:22Z","Content":"\n\u003Cp\u003EThis mod has so much potential, only a few things need to be sorted out and itll be perfect. Are you still working on it or abandoned it?\u003C/p\u003E\n"},{"CreatedByName":"Virtualgenius","CreatedById":67644,"CreatedDateTime":"2014-01-31T23:01:43Z","Content":"\n\u003Cp\u003EAny further progress on this or gone to the to hard basket\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2014-02-01T00:11:31Z","Content":"\n\u003Cp\u003EStill looking for a modeler/Unity rigger. Unfortunately, without one, this isn\u0027t going to get any better than the last release.\u003C/p\u003E\n"},{"CreatedByName":"Ledenko","CreatedById":57833,"CreatedDateTime":"2014-02-05T21:06:43Z","Content":"\n\u003Cp\u003ETo give a little hint, let\u0027s just say things are rolling \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2014-02-05T21:28:51Z","Content":"\n\u003Cp\u003EI\u0027m usually not superstitious, but every time I announced progress, we ran into a seemingly impassible hurdle. So I\u0027m cautious now. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E There is progress, but I\u0027m not announcing anything yet. Also, I\u0027m not going to have much time until 10th (I might still work on the Shuttle before it, but know that I\u0027m not really supposed to do it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E ). Now, I\u0027m not saying anything more until I test everything.\u003C/p\u003E\n"},{"CreatedByName":"Thesonicgalaxy","CreatedById":71406,"CreatedDateTime":"2014-02-08T01:49:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ledenko\u0022 data-cite=\u0022Ledenko\u0022\u003E\u003Cdiv\u003ETo give a little hint, let\u0027s just say things are rolling \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGlad to hear the wheels are working.\u003C/p\u003E\n"},{"CreatedByName":"dramabeats","CreatedById":72217,"CreatedDateTime":"2014-02-08T22:22:39Z","Content":"\n\u003Cp\u003E\u0022Engage ASAS. Engage SSMEs and wait for the Shuttle to return to vertical position after the \u0022twang\u0022. Engage SRBs and liftoff.\u0022\u003C/p\u003E\u003Cp\u003Eone too many acronyms, being a noob I do not understand.\u003C/p\u003E\u003Cp\u003EI downloaded the toggle asas, but I can\u0027t find where to turn it on. I also have no idea what a SSME is\u003C/p\u003E\n"},{"CreatedByName":"SFJackBauer","CreatedById":82269,"CreatedDateTime":"2014-02-08T22:37:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022dramabeats\u0022 data-cite=\u0022dramabeats\u0022\u003E\u003Cdiv\u003E\u0022Engage ASAS. Engage SSMEs and wait for the Shuttle to return to vertical position after the \u0022twang\u0022. Engage SRBs and liftoff.\u0022\u003Cp\u003Eone too many acronyms, being a noob I do not understand.\u003C/p\u003E\u003Cp\u003EI downloaded the toggle asas, but I can\u0027t find where to turn it on. I also have no idea what a SSME is\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESSME = Space Shuttle Main Engine (otherwise known as Rocketdyne RS-25). Its the three engines at the back of the shuttle that burns hydrogen and oxygen from the orange tank.\u003C/p\u003E\u003Cp\u003Etwang = Movement made by the shuttle stack after firing the SSMEs and before being released from the launch pad.\u003C/p\u003E\u003Cp\u003ESRB = Solid Rocket Booster, the white solid rockets attached to the side of the big orange tank. They are ignited after the SSMEs reach 100% thrust and if everything looks normal, since they cannot be shutdown.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2014-02-08T22:42:22Z","Content":"\n\u003Cp\u003EThe toggle ASAS is enabled just like the normal ASAS. SSME is Space Shuttle Main Engine (activate by staging) and SRB is Solid Rocket Booster (stage again to activate). That said, you\u0027ll probably run into problems using this mod now. The next version will be much better.\u003C/p\u003E\n"},{"CreatedByName":"dramabeats","CreatedById":72217,"CreatedDateTime":"2014-02-09T01:49:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dragon01\u0022 data-cite=\u0022Dragon01\u0022\u003E\u003Cdiv\u003EThe toggle ASAS is enabled just like the normal ASAS. SSME is Space Shuttle Main Engine (activate by staging) and SRB is Solid Rocket Booster (stage again to activate). That said, you\u0027ll probably run into problems using this mod now. The next version will be much better.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMy shuttle flops over backwards as soon as the game starts, then it doesn\u0027t detach from the struts when you press space\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2014-02-09T02:02:59Z","Content":"\n\u003Cp\u003EEh, so wait for the next version. I don\u0027t know why would that happen, but it doesn\u0027t occur in the dev version already. It flies really good on ascent, too.\u003C/p\u003E\n"},{"CreatedByName":"Virtualgenius","CreatedById":67644,"CreatedDateTime":"2014-02-13T21:38:55Z","Content":"\n\u003Cp\u003EAny news on the progress\u003C/p\u003E\n"},{"CreatedByName":"The Russian 1021","CreatedById":101141,"CreatedDateTime":"2014-02-14T19:54:40Z","Content":"\n\u003Cp\u003EMy srbs overheat everytime i use this mod, whats up with that? also, does this work with ferram?\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2014-02-14T20:32:32Z","Content":"\n\u003Cp\u003EIt doesn\u0027t work with FAR yet. I\u0027ve toned overheating down in the dev version already.\u003C/p\u003E\u003Cp\u003EAs for progress, there are still things to do. Not to mention I didn\u0027t get a response from Cepheus yet. There are slight issues with aerodynamics, and robotic arm is untested with the latest version. Models are still being refined.\u003C/p\u003E\u003Cp\u003EIf Cepheus doesn\u0027t respond before we\u0027re done with the models, there will be a public beta. If he does respond, then I\u0027ll talk to him about it. The current dev version would already be an improvement over the released one. We might soon have dev pics to show, but working out aerodynamics isn\u0027t the most spectacular thing to do. Oh, and check Dtobi\u0027s thread. He\u0027s contributing a little something as well. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlso, I\u0027ll have exams in the next week, ending at 22nd. I\u0027m afraid this means work is gonna slow to a crawl (well, it already did. I was doing integrals all day. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E ). After that, there might be a progress update. It also depends Ledenko\u0027s schedule, so don\u0027t hold your breath.\u003C/p\u003E\n"},{"CreatedByName":"Virtualgenius","CreatedById":67644,"CreatedDateTime":"2014-02-16T01:08:13Z","Content":"\n\u003Cp\u003EThanks Dragon any comment on the development is appreciated it just lets us know its not an abandoned mod\u003C/p\u003E\n"},{"CreatedByName":"Charles Power","CreatedById":63349,"CreatedDateTime":"2014-02-17T16:43:13Z","Content":"\n\u003Cp\u003EHey guys I know that at the moment progress on developing the CSS is a little slow so I\u0027ve decided to aid dragon1 temporally in making the shuttle a bit more flyable, I\u0027ve made the shuttles gyroscopes more powerful so hopefully when in space the shuttle is more manoeuvrable, I\u0027ve also increased the Power on the RCS systems so again its more manoeuvrable. Lastly I\u0027ve fixed the problem with the landing gear issue, What I\u0027ve done is use the heavy load B9 wheels so that it can land successfully Heres the link:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://drive.google.com/folderview?id=0BxOkHToP8aQ9U3p5cWh0V2dxcUU\u0026amp;usp=sharing\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://drive.google.com/folderview?id=0BxOkHToP8aQ9U3p5cWh0V2dxcUU\u0026amp;usp=sharing\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Elast but not least the craft file contains b9 RCS thrusters on the nosecone because I heard that apparently the RCS on the front wasn\u0027t working if it does work just take the thrusters off in the VAB.\u003C/p\u003E\u003Cp\u003EI hope things work out for you guys\u003C/p\u003E\u003Cp\u003Eif you guys have trouble with the craft file heres a album on how to make it flight worthy.\u003C/p\u003E\u003Cp\u003E-Charles\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2014-02-17T20:19:42Z","Content":"\n\u003Cp\u003EWell, I suppose it\u0027s good before 6.0 is ready, but those changes are nothing useful for us, all those issues are either already fixed or in progress of being fixed. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Neutrinovore","CreatedById":72520,"CreatedDateTime":"2014-02-18T07:07:45Z","Content":"\n\u003Cp\u003EYeah, I\u0027ll wait for v6.0. I tried the current version, it actually works pretty well, except for the landing gear of course. What ultimately caused me to uninstall it was, well, I already have a LOT of parts, so I was trying to reduce my memory footprint a little bit, but also was because there was something screwy with the wings. This ship glides TOO well. I was gliding down to a landing and the shuttle just would not stall! I mean, I\u0027m floating along at something like 10 m/s, and as long as I kept the nose up, it would just stay in the air, it was getting quite ridiculous actually. I don\u0027t mean that it would gain altitude, but the glide ratio had to have been something like .001 or something.\u003C/p\u003E\u003Cp\u003ESo, anyway, I hope that\u0027s something that\u0027s getting looked at, the wings having a more realistic lift value. I kind of like the idea of having to come in really steep and then pulling up and flaring out at the last minute, adds some excitement. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\u003Cp\u003ELater, everyone! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2014-02-18T11:48:18Z","Content":"\n\u003Cp\u003EYeah, it was needed for it to be able to land intact with those gear. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E An ugly stopgap, though. I\u0027m working on a new aerodynamic model, which does work pretty well... except that you can\u0027t flare right now, the controls are saturated just be keeping it upright. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E The next release will have a working body flap to help with that, though.\u003C/p\u003E\n"}]}