{"TopicId":87284,"ForumId":34,"TopicTitle":"KScale64 v1.2.2 16th April 2017","CreatedByName":"Paul Kingtiger","CreatedById":57455,"CreatedDateTime":"2014-10-14T12:47:00Z","PageNum":26,"Articles":[{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2015-09-01T13:09:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022EatVacuum\u0022 data-cite=\u0022EatVacuum\u0022\u003E\u003Cdiv\u003E It looked nice from the air but practically impossible to land on anywhere without having to pop chutes. So I played with the pqs settings and got something that is a bit more reasonable - a mix of low rolling hills with flattish areas. That allows for landing in the grasslands biome to complete survey contracts but you can\u0027t just land anywhere easily, you have to look around for decent spots. That seems to me to be the sweet spot. Highlands and Mountains are still not for the fainthearted though.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELanding an aircraft?\u003C/p\u003E\u003Cp\u003EThe number of unpaved places where one could expect to land a spaceplane should be.... very small indeed. Strike that, it should be very small if you planned on taking off again \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Just walking away from wilderness landing in a jet should be good enough. \u003C/p\u003E\u003Cp\u003EAnyway, the images you posted look awesome, those of us who don\u0027t land jets on dirt probably don\u0027t mind the rough ground.\u003C/p\u003E\n"},{"CreatedByName":"EatVacuum","CreatedById":72754,"CreatedDateTime":"2015-09-03T23:06:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tater\u0022 data-cite=\u0022tater\u0022\u003E\u003Cdiv\u003ELanding an aircraft?\u003Cp\u003EThe number of unpaved places where one could expect to land a spaceplane should be.... very small indeed. Strike that, it should be very small if you planned on taking off again \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Just walking away from wilderness landing in a jet should be good enough. \u003C/p\u003E\u003Cp\u003EAnyway, the images you posted look awesome, those of us who don\u0027t land jets on dirt probably don\u0027t mind the rough ground.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERealistically, I agree with you, but on the other hand, you do need to land to do those survey missions. I tried to make it rough enough it was doable, but risky. So that said, if everything worked, here is my Kittopia mods folder;\u003C/p\u003E\u003Cp\u003E*** WARNING *** WARNING *** WARNING ***\u003C/p\u003E\u003Cp\u003EIf you install the files in the folder below, it will change the height of terrain on Kerbin, Mun, Minmus. Any ships or bases currently on the surface of those planets will likely either end up inside the planet and explode, or end up several hundred metres above the ground, in which case they will pummet to the ground and... explode. Also see the notes below regarding terrain height and low orbits.\u003C/p\u003E\u003Cp\u003EI highly recommend you back up your campaign or at the least make a named quicksave file so you can recover your campaign if this happens and you want to revert to your original planet configs. \u003C/p\u003E\u003Cp\u003ESo, you have been warned, proceed at your own risk. You need to have \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/68619-0-90-Plugin-WIP-Discontinued-indefinitely-KittopiaTech-Ingame-Terraforming-Tools-V0-192\u0022 rel=\u0022external nofollow\u0022\u003EKittopia Tech\u003C/a\u003E installed and then merge my download folders into it.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/v70fg3thww8lmr0/KittopiaSpace.zip?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/v70fg3thww8lmr0/KittopiaSpace.zip?dl=0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EHow to use - unzip or extract my zip, and then take my Kittopia space folder and drop it into the KSP\\Gamedata folder. It will ask you if you want to merge KittopiaSPace and various of its subfolders, say yes to each and you should end up with;\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E1) A .cfg file each for Kerbin, Minmus and Mun in the KittopiaSpace\\SaveLoad folder . \u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E2) A .bin file each for Kerbin, Minmus and Mun in the KittopiaSpace\\ScaledSpace folder . \u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E3) A folder each for Kerbin, Minmus and Mun under KittopiaSpace\\Textures\\ScaledSpace. Each folder should contain 3 pngs - bumpMap, colourMap and heightMap\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EWhat has been changed -\u003C/p\u003E\u003Cp\u003EKerbin - The max height of a mountain could theoretically be almost 12km, which is 50% higher than Everest. That likely hasn\u0027t happened though, to get that much height the PQSmod that builds mountains would have to drop the tallest possible random elevation increase right on top of the highest point on the height map. I didn\u0027t see anything nearly that high, but I\u0027ve only overflown the mountains west of KSC a bit.\u003C/p\u003E\u003Cp\u003EMinmus - I increased the maximum terrain height to 15km. Stock Minmus had terrain over 5600m high, to make it as lumpy as stock Minmus it would have to be raised to almost 36km but that seemed crazy high. 15km max height still makes for decent slopes and plateaus while allowing for a 20-30km orbit.\u003C/p\u003E\u003Cp\u003EMun - Maximum terrain height could be almost 33 km high, so orbits below this are risky - especially polar ones. I needed to go this high to give the large craters a decent slope, and they are still mild compared to stock. Similarly the two canyons are a lot less steep sided than stock, but at least now they feel like canyons again rather than slight depressions.\u003C/p\u003E\u003Cp\u003ELet me know what you think. \u003C/p\u003E\u003Cp\u003EBTW, If you want to remove this either delete the files I listed above, or just remove Kittopia completely and you will have the old boring planets and moons back. Then just go start your campaign from that backup and it will all be like it never happened.\u003C/p\u003E\n"},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2015-09-11T03:12:35Z","Content":"\n\u003Cp\u003ESo, I\u0027m liking the new height maps... however, it\u0027s pushing me right over the memory limit \u0026amp; crashing the game. How can I disable it on Kerbin, or more ideally, disable it only around a specific area?\u003C/p\u003E\n"},{"CreatedByName":"EatVacuum","CreatedById":72754,"CreatedDateTime":"2015-09-12T14:05:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CatastrophicFailure\u0022 data-cite=\u0022CatastrophicFailure\u0022\u003E\u003Cdiv\u003ESo, I\u0027m liking the new height maps... however, it\u0027s pushing me right over the memory limit \u0026amp; crashing the game. How can I disable it on Kerbin, or more ideally, disable it only around a specific area?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI hadn\u0027t noticed a big memory increase, but then I wasn\u0027t pushing the 4GB limit before I installed this so I didn\u0027t really pay attention. I don\u0027t think there is any way to disable the terrain in a particular area, at least not that would reduce memory use, since height maps etc. are generated for the whole planet at once. But here\u0027s a couple of ideas;\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003EIf you wanted to disable the heights maps for Kerbin only, just delete the Kerbin .png, .bin and folders described in items 1,2 and 3 in my previous post. Ditto for removing the Mun or Minmus. Or better, try making a backup folder asomewhere and moving them out of your KSP folder rather than deleting them so you can put them back later if you so desire. If you were running missions to the Mun, install only the Mun files and folders, since you\u0027re not that concerned about the terrain on Minmus if you\u0027re not going there. And then only put Minmus in on a session where you only want to go there. It\u0027s a bit fiddly, but it\u0027s one way to manage the memory use. Looking through the files, Kerbin\u0027s bump map is about 10MB, the colour and height maps add another 10MB between them, so removing Kerbin will save you over 20MB, the Mun\u0027s maps combined are about 10MB, Minmus is just over 3MB.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E I haven\u0027t played with any of the texture compression software since 1.0 came out, but maybe active texture management would help? All of the bump, colour and height maps are .pngs and they take up by far the largest space, just like part textures, so maybe you could compress them? Alternately, it might be possible to shrink them down to 50% of their current resolution using a decent graphics product - GIMP or whatever. They might look a bit blurrier from space due to the loss of resolution, but shrinking each by 50% would reduce memory use to a quarter of what it is now, I would think.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EI haven\u0027t tried this, but I think if you remove the .bin files and scaled space folders that you would still have the bumpy terrain when you are close, but from space, you would see the original Kerbin, Mun and Minmus scaled space views. I\u0027m basing this idea on the fact that when you fiddle with the terrain in Kittopia, you are only creating the .cfg files, but you see the terrain changes immediately. It is only when you click on the scaled space updater that the maps and .bin files in the scaled space folders get created. If this is correct, then you should have reduced memory usage by 33MB, down to almost nothing. The terrain changes I made shouldn\u0027t have altered coast lines more than a smidgin so I doubt that would be a problem for Kerbin - the mountainous areas might change in appearance a bit more since there are a lot more mountains, although they only cover the same area as original. I think as you get closer to Minmus or the Mun you might notice a slight change in the apparent height of the terrain (more so for Minmus), or the depth of the craters, but it shouldn\u0027t be a big deal.\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EAnyway, those are my thoughts, and I am certainly not an expert with Kopernicus or Kittopia, only a dabbler, so don\u0027t take my opinions as authoritative. Good luck!\u003C/p\u003E\u003Cp\u003E** Edit - I believe that there is an option in Kittopia to render the various maps mentioned above at lower resolutions. I stumbled across some mention of this a few days ago, and if I can find it again, I\u0027ll try doing a rebuild at a lower res when I can find the time. If this can be done, I\u0027ll post up a lower res version which should save memory as per the second option above, but with the maps pre-reduced.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-16T11:46:07Z\u0022 title=\u002209/16/2015 11:46  AM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 16, 2015\u003C/time\u003E by EatVacuum\u003C/strong\u003E\n\u003Cbr\u003ENew thoughts\n\u003C/span\u003E\n"},{"CreatedByName":"Paul Kingtiger","CreatedById":57455,"CreatedDateTime":"2015-09-17T02:12:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022EatVacuum\u0022 data-cite=\u0022EatVacuum\u0022\u003E\u003Cdiv\u003EI hadn\u0027t noticed a big memory increase....\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe only large file is the scaled space texture for Kerbin and that\u0027s not huge. I\u0027ll take a look and see what I can see.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EIn other news\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThere\u0027s a new commit for Kopernicus that might have fixed the career mode problem which means we could remove the fix (which causes it\u0027s own problems). I\u0027ll do some testing and see what happens. Although it\u0027s not an official Kopernicus release so we might have to wait for that to happen. But it sounds like we\u0027re looking good.\u003C/p\u003E\n"},{"CreatedByName":"EatVacuum","CreatedById":72754,"CreatedDateTime":"2015-09-18T17:01:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Paul Kingtiger\u0022 data-cite=\u0022Paul Kingtiger\u0022\u003E\u003Cdiv\u003EThe only large file is the scaled space texture for Kerbin and that\u0027s not huge. I\u0027ll take a look and see what I can see. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPaul,\u003C/p\u003E\u003Cp\u003EIt\u0027s not your build\u0027s texture files that are too large, it\u0027s the ones I posted to restore some of the terrain variety (i.e. lumps and bumps) that get stretched horizontally (and so proportionately flatter) when the planets and moons get rescaled. I used Kittopia to fiddle with various PQSMods and the textures it produced for scaled space are fairly large.\u003C/p\u003E\u003Cp\u003EHow does the career fix work? I used the increased ranges work around but the survey sites spawn so far away they make flying to them in atmospheric flight too time consuming so I\u0027ve given up on doing them.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-18T17:33:06Z\u0022 title=\u002209/18/2015 05:33  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 18, 2015\u003C/time\u003E by EatVacuum\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Overjay","CreatedById":104131,"CreatedDateTime":"2015-09-20T11:24:01Z","Content":"\n\u003Cp\u003ESo red symbols under OP title state, that career mode works. That is actually great!\u003C/p\u003E\u003Cp\u003EBut there is KSP 1.1 coming, with Unity5, and stuff. My question is how long approximately will it take you to make this awesome mod work with new version?\u003C/p\u003E\n"},{"CreatedByName":"Sandworm","CreatedById":66244,"CreatedDateTime":"2015-09-20T18:53:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Overjay\u0022 data-cite=\u0022Overjay\u0022\u003E\u003Cdiv\u003ESo red symbols under OP title state, that career mode works. That is actually great!\u003Cp\u003EBut there is KSP 1.1 coming, with Unity5, and stuff. My question is how long approximately will it take you to make this awesome mod work with new version?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe two variables are the (1) changes needed and (2) the amount of time mod developers care to put into updates. We don\u0027t know anything about (1) as Squad never releases API-type information. It will all have to be reverse-engineered. So think weeks to months. And nobody can estimate (2) because we have no idea when 1.1 will be released. One unknown multiplied by another unknown equals nobody has any idea about anything.\u003C/p\u003E\u003Cp\u003EAt a minimum, looking at the patterns after other mod-shattering releases, I would guess a month or two before any but the parts mods can be called stable. Anyone caring about save files, I think it safe to assume that not much from 1.0.4 will be viable in 1.1. It\u0027s never been a good idea to get too attached.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-20T18:59:26Z\u0022 title=\u002209/20/2015 06:59  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 20, 2015\u003C/time\u003E by Sandworm\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"CobaltWolf","CreatedById":105588,"CreatedDateTime":"2015-09-24T16:06:03Z","Content":"\n\u003Cp\u003ESo, I\u0027m crashing on the first time I leave the atmosphere in career. Reading the thread, I understand there was a fix in 64k, then Kopernicus updated, which makes the 64K fix crash the game. My question is, can I undo the 64K fix on my end somehow? If so, how? I\u0027m being exiled by the Pope this weekend and KSP is the only game that I play that runs decently on my laptop.\u003C/p\u003E\n"},{"CreatedByName":"Paul Kingtiger","CreatedById":57455,"CreatedDateTime":"2015-09-26T01:28:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CobaltWolf\u0022 data-cite=\u0022CobaltWolf\u0022\u003E\u003Cdiv\u003ESo, I\u0027m crashing on the first time I leave the atmosphere in career. Reading the thread, I understand there was a fix in 64k, then Kopernicus updated, which makes the 64K fix crash the game. My question is, can I undo the 64K fix on my end somehow? If so, how? I\u0027m being exiled by the Pope this weekend and KSP is the only game that I play that runs decently on my laptop.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you reinstall the version of Kopernicus that comes with 64K that will fix things. I\u0027ll look at updating everything for the new Kopernicus version this weekend.\u003C/p\u003E\n"},{"CreatedByName":"Dermeister","CreatedById":41487,"CreatedDateTime":"2015-09-29T16:26:05Z","Content":"\n\u003Cp\u003EHas any 1 made a cloud mod for 64k? I know that the standard cloud mods work in this but the cloud altitudes ect are messed up.\u003C/p\u003E\n"},{"CreatedByName":"Gaultesian","CreatedById":145145,"CreatedDateTime":"2015-10-03T14:34:22Z","Content":"\n\u003Cp\u003EHmmm....I got this sinking feeling....\u003C/p\u003E\u003Cp\u003EWhen I landed on Duna (so much more fun and challenging now!), my kerbals seem to sink into the ground (waist - high), and at times, the landing legs will also slightly sink.\u003C/p\u003E\u003Cp\u003EDid I do something wrong, or maybe this is a glitch of some sort? 99.9% chance it\u0027s an error on my side, but I did install the mods (clean install) as per directed.\u003C/p\u003E\u003Cp\u003ECheers.\u003C/p\u003E\n"},{"CreatedByName":"EatVacuum","CreatedById":72754,"CreatedDateTime":"2015-10-03T14:44:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dermeister\u0022 data-cite=\u0022Dermeister\u0022\u003E\u003Cdiv\u003EHas any 1 made a cloud mod for 64k? I know that the standard cloud mods work in this but the cloud altitudes ect are messed up.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve been using AAVGs Cloud Pack (\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/126611-1-0-4-Avg-s-Cloud-Pack-v6-tinted-auroras-Stratus-Cirrus-level-clouds-Lightning-Dust-storms\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E) without any bad effects. I chose this one in part because it has less clouds than standard EVE - enough clouds to make Kerbin look nice, but not so much that you can\u0027t see most of the land masses. And enough that you fly into clouds from time to time but not so many that you always have to keep dipping down to 4,000m or lower to figure out what the terrain is like and where you are.\u003C/p\u003E\u003Cp\u003EKerbin with Avg Joe\u0027s clouds;\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/3eJ3QzG.png\u0022 alt=\u00223eJ3QzG.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EBesides the clouds it has Aurora\u0027s and lightning you can see from space and (it claims, I haven\u0027t gotten there to see them yet) duststorms on Duna, bioluminescence on Laythe, moving cloud bands on Jool and so on.\u003C/p\u003E\n"},{"CreatedByName":"Gaultesian","CreatedById":145145,"CreatedDateTime":"2015-10-03T15:30:34Z","Content":"\n\u003Cp\u003EAye, I used AVG\u0027s cloud pack too, and you can easily configure it to add in more cloud layers (if you wish), and raise/lower cloud ceilings. Oh, and the duststorms on Duna are 100% real \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\n"},{"CreatedByName":"Dermeister","CreatedById":41487,"CreatedDateTime":"2015-10-03T18:33:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022EatVacuum\u0022 data-cite=\u0022EatVacuum\u0022\u003E\u003Cdiv\u003EI\u0027ve been using AAVGs Cloud Pack (\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/126611-1-0-4-Avg-s-Cloud-Pack-v6-tinted-auroras-Stratus-Cirrus-level-clouds-Lightning-Dust-storms\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E) without any bad effects. I chose this one in part because it has less clouds than standard EVE - enough clouds to make Kerbin look nice, but not so much that you can\u0027t see most of the land masses. And enough that you fly into clouds from time to time but not so many that you always have to keep dipping down to 4,000m or lower to figure out what the terrain is like and where you are.\u003Cp\u003EKerbin with Avg Joe\u0027s clouds;\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/3eJ3QzG.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/3eJ3QzG.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBesides the clouds it has Aurora\u0027s and lightning you can see from space and (it claims, I haven\u0027t gotten there to see them yet) duststorms on Duna, bioluminescence on Laythe, moving cloud bands on Jool and so on.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E NICEEE thanks \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E btw what do you use for engines and are you having COM issues with Campaign mode in 64x using Procedural fuel tanks?\u003C/p\u003E\n"},{"CreatedByName":"ialdabaoth","CreatedById":57270,"CreatedDateTime":"2015-10-04T02:44:04Z","Content":"\n\u003Cp\u003EI\u0027m really liking this. Once 1.1 comes out, I\u0027ll see about building an RSS-lite for it.\u003C/p\u003E\n"},{"CreatedByName":"Bowman","CreatedById":71112,"CreatedDateTime":"2015-10-05T20:19:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Paul Kingtiger\u0022 data-cite=\u0022Paul Kingtiger\u0022\u003E\u003Cdiv\u003EIf you reinstall the version of Kopernicus that comes with 64K that will fix things. I\u0027ll look at updating everything for the new Kopernicus version this weekend.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve got the same problem: In the moment of leaving the atmosphere the game keeps crashing. I reinstalled Kopernicus, but that didn\u0027t work out.\u003C/p\u003E\n"},{"CreatedByName":"abowl","CreatedById":110827,"CreatedDateTime":"2015-10-06T15:32:24Z","Content":"\n\u003Cp\u003Eaye, i got that problem as well. Paul said to use another version of Kopernicus, while you wait for an official fix.\u003C/p\u003E\n"},{"CreatedByName":"EatVacuum","CreatedById":72754,"CreatedDateTime":"2015-10-06T18:56:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Gaultesian\u0022 data-cite=\u0022Gaultesian\u0022\u003E\u003Cdiv\u003EHmmm....I got this sinking feeling....\u003Cp\u003EWhen I landed on Duna (so much more fun and challenging now!), my kerbals seem to sink into the ground (waist - high), and at times, the landing legs will also slightly sink.\u003C/p\u003E\u003Cp\u003EDid I do something wrong, or maybe this is a glitch of some sort? 99.9% chance it\u0027s an error on my side, but I did install the mods (clean install) as per directed.\u003C/p\u003E\u003Cp\u003ECheers.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI believe that is common to all the mods that resize the planets. It happens in stock, just to a lesser degree. If you sink a couple of inches in stock you may not even notice. But in a 6.4 x rescale each inch becomes six inches and in RSS an inch becomes almost a foot. In RSS I often had Kerbals standing waist or even chest deep in the ground. Aircraft whose wheels dissappeared into the runway and such like. Role play it, imagine iit as tall grass or a muddy surface... perhaps in Elbonia.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ZWJw10R.jpg\u0022 alt=\u0022ZWJw10R.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-08T00:52:21Z\u0022 title=\u002210/08/2015 12:52  AM\u0022 data-short=\u00228 yr\u0022\u003EOctober 8, 2015\u003C/time\u003E by EatVacuum\u003C/strong\u003E\n\u003Cbr\u003Eadd some humour\n\u003C/span\u003E\n"},{"CreatedByName":"dlrk","CreatedById":60033,"CreatedDateTime":"2015-10-10T21:08:35Z","Content":"\n\u003Cp\u003EAny chance of a fix for sinking in the future? Is that possible?\u003C/p\u003E\n"},{"CreatedByName":"Citizen247","CreatedById":136793,"CreatedDateTime":"2015-10-11T10:45:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bowman\u0022 data-cite=\u0022Bowman\u0022\u003E\u003Cdiv\u003EI\u0027ve got the same problem: In the moment of leaving the atmosphere the game keeps crashing. I reinstalled Kopernicus, but that didn\u0027t work out.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn the file Contract_Bug_Workaround.cfg in the 64k folder there\u0027s this code:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E@Contracts{\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E    @Survey\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\t{\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\t\t@TrivialHomeNearbyRange *= 4\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\t\t@SignificantHomeNearbyRange *= 4\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\t\t@ExceptionalHomeNearbyRange *= 4\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E    }\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E}\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EReplace that with:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E@Contracts\u003Cbr\u003E{\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E    @Survey\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\t{\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\t\t@TrivialHomeNearbyRange *= 10\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\t\t@SignificantHomeNearbyRange *= 10\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\t\t@ExceptionalHomeNearbyRange *= 10\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E    }\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E}\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThe workaround being 4 times isn\u0027t enough, I\u0027ve had no locks using a multiple of 10.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022dlrk\u0022 data-cite=\u0022dlrk\u0022\u003E\u003Cdiv\u003EAny chance of a fix for sinking in the future? Is that possible?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI believe it\u0027s to do with imprecision in floating point calculations, so no.\u003C/p\u003E\u003Cp\u003EErm, sorry for my long absence, I\u0027ve had mountains of work and things to do since getting back from Japan (ironically mostly about going back to Japan). I\u0027ve been playing around with the heat tweak settings again, trying to make a more forgiving but still challenging re-entry.\u003C/p\u003E\n"},{"CreatedByName":"Tellion","CreatedById":116794,"CreatedDateTime":"2015-10-12T19:36:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022dlrk\u0022 data-cite=\u0022dlrk\u0022\u003E\u003Cdiv\u003EAny chance of a fix for sinking in the future? Is that possible?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you are feeling adventurous, play around with the maxLevel setting in the PQS Node, set it to something between 6 and 8. If you search for the term in the Kopernicus thread, some examples should turn up. \u003Cem\u003EMaybe\u003C/em\u003E that helps with the sinking issue.\u003C/p\u003E\n"},{"CreatedByName":"TheAurora","CreatedById":138888,"CreatedDateTime":"2015-10-17T00:56:51Z","Content":"\n\u003Cp\u003EI love this mod, but is there a way to use the regular Kerbin texture? I am not really a fan of the current texture. If this has been discussed before, sincere apologies. I must not have seen it in the thread. Thank you!\u003C/p\u003E\n"},{"CreatedByName":"Jodo42","CreatedById":68895,"CreatedDateTime":"2015-10-17T18:18:58Z","Content":"\n\u003Cp\u003EI\u0027ve tried direct reentry with a ~45k periapsis from Minmus in 64k and I can\u0027t seem to avoid overheating. In fact I\u0027m struggling to reenter from anywhere but LKO, and even it is rather close. I tried Citizen247\u0027s config from way back on page 51 but it didn\u0027t help; neither did installing DRE. Any help/suggestions? I\u0027m using a MK1-2 command pod and a 2.5m stock heatshield.\u003C/p\u003E\n"},{"CreatedByName":"Citizen247","CreatedById":136793,"CreatedDateTime":"2015-10-17T20:15:30Z","Content":"\n\u003Cp\u003EThe latest versions include that tweak. If you enter the 64k/compatibility folder you should see a heat tweak file, try changing both machtemperature* settings to 1.0, which are the settings I\u0027m currently testing.\u003C/p\u003E\u003Cp\u003EI also find that a periapsis of 30km is usually more survivable.\u003C/p\u003E\n"}]}