{"TopicId":87284,"ForumId":34,"TopicTitle":"KScale64 v1.2.2 16th April 2017","CreatedByName":"Paul Kingtiger","CreatedById":57455,"CreatedDateTime":"2014-10-14T12:47:00Z","PageNum":11,"Articles":[{"CreatedByName":"linuxgurugamer","CreatedById":129964,"CreatedDateTime":"2015-01-12T17:12:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tellion\u0022 data-cite=\u0022Tellion\u0022\u003E\u003Cdiv\u003ENice to see you made it here \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003Cp\u003EWell depends on what you want it to do. It is very possible that it gets confused about things like ascent and landing guidance (though landing guidance can work rather well, I have not tested ascent guidance); things like maneuver planning or the various utility stuff goes unaffected by this mod.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks.\u003C/p\u003E\u003Cp\u003EI\u0027m still working on my first few space stations, actually just marooned a couple of Kerbels on the Mun, need to go rescue them. But I\u0027ll keep this in mind for the future.\u003C/p\u003E\n"},{"CreatedByName":"NonWonderDog","CreatedById":10479,"CreatedDateTime":"2015-01-12T23:58:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tellion\u0022 data-cite=\u0022Tellion\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ENice! Copying the RealSolarSystem.cfg from the linked github repo in the RSS folder in gamedata will suffice to install this, right?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou also need the KerbinHeight.png terrain map in the RSS plugindata folder. That, and I made some minor adjustments to the positions of the other launch sites in LaunchSites.cfg. Nothing major, but there were a couple launch sites that were no longer on the shore, or sat on a 100 meter tall mesa after my terrain edits.\u003C/p\u003E\u003Cp\u003EYou might have to delete Kerbin.obj to force RSS to regenerate the terrain, as well. I\u0027m not sure how that works.\u003C/p\u003E\u003Cp\u003EThere\u0027s currently a good chance that the pyramids, monoliths, and suchlike are floating hundreds of meters in the air. I\u0027ve only repositioned the Island Runway onto the new terrain, so far.\u003C/p\u003E\u003Cp\u003E[EDIT]I\u0027ve updated my repo to have 6-hour and 24-hour day configs, and to raise the Kerbin average terrain height. There should be more gentle hills in the grasslands now. Now if only I can make some fjords...[/EDIT]\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-13T03:06:28Z\u0022 title=\u002201/13/2015 03:06  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 13, 2015\u003C/time\u003E by NonWonderDog\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tellion","CreatedById":116794,"CreatedDateTime":"2015-01-14T23:16:31Z","Content":"\n\u003Cp\u003E@NonWonderDog\u003C/p\u003E\u003Cp\u003EGreat work! I did not do any long flights on kerbin so far, but for the first time in quite a while I actually said \u0022wow, thats pretty\u0022 on kerbin \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2015-01-15T15:39:08Z","Content":"\n\u003Cp\u003EI wonder if i\u0027m doing something wrong re 64K. It is supposed to work well with stock parts is it not? \u003C/p\u003E\u003Cp\u003EI find that a rocket for a manned Mun return mission requires a first stage with 15 mainsails. That still falls short in terms of dV, and is prone to spontaneous explosions on the launch pad. This is in spite of having NEAR installed which reduces dV to LKO to a little under 7000m/s. I think i can not reasonably build even bigger. \u003C/p\u003E\u003Cp\u003EAny suggestions welcome.\u003C/p\u003E\n"},{"CreatedByName":"Tellion","CreatedById":116794,"CreatedDateTime":"2015-01-15T15:51:30Z","Content":"\n\u003Cp\u003EStock parts are much weaker than their real life counterparts in terms of performance which is fine for the stock sized system but not for 64k. Check out \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/81239-Stockalike-RF-Engine-Configs-v2-0-6-11-26-14\u0022 rel=\u0022external nofollow\u0022\u003EStockalike RF Engine Configs\u003C/a\u003E with RealFuels, that should help \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2015-01-15T17:42:03Z","Content":"\n\u003Cp\u003EBut 64K is not intended to be like real life, is it? Isn\u0027t that what RSS is for? Would 64K with parts intended for 10x not make 64K to easy?\u003C/p\u003E\u003Cp\u003EHas anyone considered scaling the universe so that it would just be \u0027stock made harder\u0027 (but with stock parts)? Scaled up by a factor 2 or 3? I tried halving the scale of 64K, but that didn\u0027t work out.\u003C/p\u003E\n"},{"CreatedByName":"Shania_L","CreatedById":58975,"CreatedDateTime":"2015-01-15T18:34:57Z","Content":"\n\u003Cp\u003E64k is scaled to match the parts, the difficulty should be equal to that of the full RSS. It is considered easier because you do not need to upscale the parts to match the universe, so you can use any mod parts you like without additional configs.\u003C/p\u003E\u003Cp\u003EMore engines do not mean more DeltaV, quite often it means the opposite.\u003C/p\u003E\u003Cp\u003EYou can put a mk1 can into orbit around Kerbin for under 30tonnes, once in orbit you have no need of the massive thrust of the mainsails, use the tinyest and lightest and above all most efficient engine you can to power your in-orbit craft.\u003C/p\u003E\n"},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2015-01-15T19:39:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Shania_L\u0022 data-cite=\u0022Shania_L\u0022\u003E\u003Cdiv\u003E64k is scaled to match the parts, the difficulty should be equal to that of the full RSS. It is considered easier because you do not need to upscale the parts to match the universe, so you can use any mod parts you like without additional configs.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat sounds like 64K is supposed to be usable with stock parts.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EMore engines do not mean more DeltaV, quite often it means the opposite.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI did not put all those engines there thinking that it would increase dV. I need those engines to lift enough dV to LKO for a manned Mun return mission. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EYou can put a mk1 can into orbit around Kerbin for under 30tonnes. once in orbit you have no need of the massive thrust of the mainsail\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGetting to LKO is not my problem. \u003C/p\u003E\u003Cp\u003EI use mainsails on the lifter, not once in orbit. But to get from LKO to the Mun\u0027s surface and back you need a couple of thousand dV. \u003C/p\u003E\u003Cp\u003EThis is the craft i made (using procedural parts and home made engine mounts):\u003C/p\u003E\u003Cp\u003E- Mun ascent and Kerbin return stage: 3000m/s twr 2.8 (@Mun) \u003C/p\u003E\u003Cp\u003E- Mun lander stage: 3100m/s twr 1.87 (@Mun)\u003C/p\u003E\u003Cp\u003E- circularisation, Mun transfer and Mun capture stage: 3400m/s twr 1.86 @Kerbin\u003C/p\u003E\u003Cp\u003E- 2nd lifter stage: 2300m/s twr 1.7\u003C/p\u003E\u003Cp\u003E- 1st lifter stage: ~3000m/s twr 1.66\u003C/p\u003E\u003Cp\u003EMun lander/return vehicle mass: 33t (6000m/s dV)\u003C/p\u003E\u003Cp\u003Etotal mass: 1460t\u003C/p\u003E\u003Cp\u003Etotal vac dV: 15000m/s (which apparently is not enough) \u003C/p\u003E\u003Cp\u003E1st stage thrust: 23787 (15 mainsails \u002B 4 SRB KD25k at about 50% thrust)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/2fWx5nZ.png\u0022 alt=\u00222fWx5nZ.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E(it\u0027s missing a couple of engines, exploded due to physics quirks on the pad) \u003C/p\u003E\u003Cp\u003EAnyone reading this who has a stock craft for a manned Mun return mission in 64K, i\u0027m interested in seeing it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-15T19:48:47Z\u0022 title=\u002201/15/2015 07:48  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 15, 2015\u003C/time\u003E by rkman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tellion","CreatedById":116794,"CreatedDateTime":"2015-01-15T19:53:03Z","Content":"\n\u003Cp\u003E@rkman If you really want, there is \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/100453-Jumbo-32-v1-2-For-KSP-0-90-RSS-Config\u0022 rel=\u0022external nofollow\u0022\u003Ethis\u003C/a\u003E, but I recommend instead to keep trying with this mod, you will not regret it. With RF and stockalike configs you will still have plenty of challenge, but it will get a little easier and much more varied. It is not RSS or 10x stock size (I think it neither wants nor needs to be that), but its highly enjoyable.\u003C/p\u003E\u003Cp\u003EApart from installing mods that make rockets more efficient or installing FAR/NEAR (you got that one already), you can take a look at the RSS spacecraft thread if you want inspiration for your craft designs. As Shania_L pointed already out, bigger is not always better, and the ridiculous designs seen in stock ksp will not necessarily help you as much here \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"rosenkranz","CreatedById":57152,"CreatedDateTime":"2015-01-15T20:13:13Z","Content":"\n\u003Cp\u003EHaven\u0027t gotten that far myself but that doesn\u0027t look far off. A saturn V rocket masses in at 2900\u002B tones. 64% of that would be 1856 or so. If you can get there on 1460, I\u0027d say you were doing pretty good.\u003C/p\u003E\u003Cp\u003ELooking more carefully at the pic, I almost wonder if you\u0027re going a little too big. The physics quirks might be PP tanks being to big. Can you use the 3.75 and 5m tanks from SpaceY mod?\u003C/p\u003E\u003Cp\u003EUsing FAR, I\u0027ve found that a TWR of \u0026gt;1.5 can get mixed results. I try to keep mine between a minimum of 1.15 and 1.5 max.\u003C/p\u003E\u003Cp\u003EI\u0027m also not seeing any fins, reaction wheels or RCS. How are you controlling it in flight. It must turn like a pig.\u003C/p\u003E\n"},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2015-01-15T20:22:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tellion\u0022 data-cite=\u0022Tellion\u0022\u003E\u003Cdiv\u003E@rkman If you really want, there is \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/100453-Jumbo-32-v1-2-For-KSP-0-90-RSS-Config\u0022 rel=\u0022external nofollow\u0022\u003Ethis\u003C/a\u003E, \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks very much, i\u0027ll be trying that.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003Ebut I recommend instead to keep trying with this mod, you will not regret it. With RF and stockalike configs you will still have plenty of challenge, but it will get a little easier and much more varied. It is not RSS or 10x stock size (I think it neither wants nor needs to be that), but its highly enjoyable. \u003Cp\u003EApart from installing mods that make rockets more efficient or installing FAR/NEAR (you got that one already), you can take a look at the RSS spacecraft thread if you want inspiration for your craft designs. \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf a manned Mun return mission is supposed to be possible in 64K with stock part configs, then i am supposed to be able to do that and if i can\u0027t i want to know what i\u0027m doing wrong. Fixing that by making it easier, without knowing what the problem is, is unsatisfying to me. \u003C/p\u003E\u003Cp\u003EIt can\u0027t be that no-one has yet done such a mission in 64K, can it? \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EAs Shania_L pointed already out, bigger is not always better, and the ridiculous designs seen in stock ksp will not necessarily help you as much here \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027d appreciate a more specific critique. See the craft a few posts previous. \u003C/p\u003E\u003Cp\u003EWhere is it to big? Is it a ridiculous design? \u003C/p\u003E\u003Cp\u003EWhat is the mass and 1st stage thrust of your manned Mun mission lifter?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rosenkranz\u0022 data-cite=\u0022rosenkranz\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ELooking more carefully at the pic, I almost wonder if you\u0027re going a little too big. The physics quirks might be PP tanks being to big. \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think the launch clamps produce a force differential between the plate and the tank, so that the thrust plate pushes on the engines that are on the engine mounts, those mounts attach to the tank not to the thrust plate. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ECan you use the 3.75 and 5m tanks from SpaceY mod?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI might give that a shot. But that would solve the explosion thing, not the fact that i\u0027m short on dV and can\u0027t reasonably build to carry more dV. If not for the exploding engines, i don\u0027t see how i can fit even more thrust under the tank without the tank becoming un-rocket-like (to wide/short).\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EUsing FAR, I\u0027ve found that a TWR of \u0026gt;1.5 can get mixed results. I try to keep mine between a minimum of 1.15 and 1.5 max.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat might be useful information.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI\u0027m also not seeing any fins, reaction wheels or RCS. How are you controlling it in flight. It must turn like a pig.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe are 4 small fixed fins (hard to see in the image), rcs on the ascent-and-return stage, a reaction wheel in the lander can. \u003C/p\u003E\u003Cp\u003EI does turn like a pig but i want AoA to stay below about 12 degrees anyway (mechjeb tells me it does get up to that limit). Otoh, yes the ascent profile does have issues, but i get to LKO for less than 7000m/s, so it can\u0027t be all that bad. But maybe a reduction of the lifter\u0027s twr will help out there to.\u003C/p\u003E\u003Cp\u003ETurning is done by engine vectoring, all but 4 or 5 of the 1st stage mainsails have their gimbal locked otherwise the lifter would wobble itself to destruction.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-15T21:08:46Z\u0022 title=\u002201/15/2015 09:08  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 15, 2015\u003C/time\u003E by rkman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"rosenkranz","CreatedById":57152,"CreatedDateTime":"2015-01-15T22:01:47Z","Content":"\n\u003Cp\u003EAhh, I see. Yeah, if you can get to orbit for less than 7000 you\u0027re doing good. I usually spend about 7100 getting to a 110km orbit.\u003C/p\u003E\u003Cp\u003EBut 15km dV should get you there and back. Where exactly are you falling short?\u003C/p\u003E\n"},{"CreatedByName":"Shania_L","CreatedById":58975,"CreatedDateTime":"2015-01-16T01:31:23Z","Content":"\n\u003Cp\u003EThis is a 340tonne manned Mun mission in 6.4scale Kerbin, using no weirdy overpowered mods or suchlike, the engines are stock (with 1 from AIES), I use FAR and Realfuels with the Stockalike configs.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/dvApP\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EI burned around 15,500DV on this mission but then I fly manually so you will get inifficiencies in burn times and angles etc, which is why the quoted DV values should always be taken as a minimum. 1400 tonnes however is simply overkill, my entire transfer stage is lighter than your lander.\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2015-01-16T04:33:29Z","Content":"\n\u003Cp\u003EWhen I did my non-RealFuels 1-kerbal Mun missions, IIRC it took about 1200 tons of LV. That meant, as I recall, something like 4x mainsails on the first stage and a bunch of k125 SRBs as stage 0.\u003C/p\u003E\n"},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2015-01-16T13:57:23Z","Content":"\n\u003Cp\u003EThanks for the advice everyone, i found and solved several problems with my craft. It was indeed somewhat over-designed and had a twr to high for FAR. Savings on the lander cascaded downwards, ending up with a launch mass of a little over 1200t, 1st stage thrust 18000kN, total dV about 14500m/s. No more exploding engines either.\u003C/p\u003E\u003Cp\u003EI don\u0027t understand though how Shania_L can build a rocket that carries more dV for 1/4 the total mass, unless Realfuels is the cause of that (in which case although maybe not an overpowered mod, it sure makes a big difference).\u003C/p\u003E\u003Cp\u003EI\u0027v come to the conclusion that stock works pretty well with 64K, but KSP lacks suitably high trust engines that fit under a normally proportioned 1st stage tank. Imo the KS25 is to big for that and a bit underpowered, and it does not stack. \u003C/p\u003E\u003Cp\u003ESo i took a KWR engine, scaled it up a bit and gave it 4500kN, stock ISP, not sure what mass it should have. I followed the trend of \u0027bigger = better engine twr\u0027, but it feels a bit cheaty. Two of those power the 2nd stage, 1 for the 3rd stage.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/lw7W4le.png\u0022 alt=\u0022lw7W4le.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-16T14:22:33Z\u0022 title=\u002201/16/2015 02:22  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 16, 2015\u003C/time\u003E by rkman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"rosenkranz","CreatedById":57152,"CreatedDateTime":"2015-01-16T14:49:17Z","Content":"\n\u003Cp\u003EYeah, RF can make a big difference. It\u0027s intended to be used with RSS or 10x because at that scale stock fuels, tankage and engines would really gimp your space program. However, combining FAR and RF is a little over powered for 6.4x scale and kinda defeats the purpose (at least to my mind).\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-01-16T16:04:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rosenkranz\u0022 data-cite=\u0022rosenkranz\u0022\u003E\u003Cdiv\u003EHowever, combining FAR and RF is a little over powered for 6.4x scale and kinda defeats the purpose (at least to my mind).\u003C/div\u003E\u003C/blockquote\u003EThe original (well, the \u0022I figured it out after playing\u0022) intent was for 6.4x to be used with RF. 6.4x was never intended to add tedium or \u0022difficulty\u0022, it was to make Kerbin bigger to match the parts, providing an RSS-like atmosphere to stock. With RF, fuels and engines are more in line with stock when used with 6.4x as opposed to RSS because the payload fraction to orbit, while much lower than stock, is much higher than RSS.\u003Cp\u003EObviously play it however you want, but the \u0022purpose\u0022 of 6.4x was to merely be a bigger Kerbin system.\u003C/p\u003E\n"},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2015-01-16T20:23:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Shania_L\u0022 data-cite=\u0022Shania_L\u0022\u003E\u003Cdiv\u003Emy entire transfer stage is lighter than your lander.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMine is a two man lander, with a core payload (mk2 lander can \u002Bbig chute) that\u0027s at minimum a little more than 3 times as heavy than an mk1\u002Bsmall chute: 0.94t v 2.96t. \u003C/p\u003E\u003Cp\u003EThat affects the mass of the rest of the payload (mainly fuel), which cascades down to the rest of the rocket. \u003C/p\u003E\u003Cp\u003EOtoh i agree that the 30t lander and consequently te rest of that rocket was overkill, and the 21t lander still carries more than it needs to. The transfer stage has enough dV to do a considerable amount of the landing burn. I leave the landing stage on the Mun with some 500dV still in it. \u003C/p\u003E\u003Cp\u003ESo yes, there is room for improvement, but it can\u0027t get down to anywhere near 340t.\u003C/p\u003E\n"},{"CreatedByName":"NonWonderDog","CreatedById":10479,"CreatedDateTime":"2015-01-17T00:04:13Z","Content":"\n\u003Cp\u003ESeconding regex in that I don\u0027t really want this to be significantly harder than stock. What I want is a tiny planet inhabited by little green men, but launching rockets that make sense from a physics and engineering standpoint. The point of this mod in my mind is to allow generous payload fractions and easy interplanetary missions using realistic (but not specifically \u003Cem\u003Ehistorical\u003C/em\u003E) Kerbal-sized rocket parts. At 6.4x I also find the planet densities believable, if not exactly astronomically possible.\u003C/p\u003E\u003Cp\u003EI\u0027m not sure you can quite get there with the mods available, though. RealFuels is a bit too grognard, the stockalike engine pack is a bit too halfway and fiddly, and nobody\u0027s maintaining a mod to make the pods and structural parts follow realistic densities. I actually started changing all the pod masses to their real-for-Kerbals equivalents, but it got to be too much. I never worked out a good way to do it programmatically, and I\u0027d rather play with mods than spend all my time editing them. The stockalike engines seem to have too much thrust for their size, as well?\u003C/p\u003E\u003Cp\u003EFor those interested, the Mk 1 pod should weigh 350 kg including 50 kg of heat shielding, the Mk 1-2 pod should be 1.75 tons after adding a 250 kg heat shield, and Hitchhiker should weigh 1.25 tons. Those are my guesses based on Mercury, Apollo, and Harmony, erring on the heavy side. (Hitchhiker is way too small.) Maybe I can figure out some kind of formula based on those using ModuleManager\u0027s variable support.\u003C/p\u003E\u003Cp\u003EI think we need a RealFuels version that isn\u0027t based on recreating Human space programs. It should have about six or seven fuels, and two of them should be interchangeable with LiquidFuel and Oxidizer so it doesn\u0027t require curated fuel tanks. Engines shouldn\u0027t have tech levels. The choices should be no more complicated than kerolox, hydrolox, methalox, or hypergolic. There should only be one fuel/oxidizer ratio per pair, independent of engine. And, crucially, it needs to have a way to integrate with MKS, TAC life support, Karbonite, Near Future etc. without huge amounts of curation work.\u003C/p\u003E\u003Cp\u003EI\u0027ve actually gone back to 1x Kerbin using KIDS (at 0.85\u002BIsp fix) instead of Real Fuels just to play with MKS and such.\u003C/p\u003E\n"},{"CreatedByName":"Tellion","CreatedById":116794,"CreatedDateTime":"2015-01-17T00:49:09Z","Content":"\n\u003Cp\u003EPosting this as your 64th post, nice \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EPersonally I am a big fan of the stockalike configs with RF and the variety those two mods add. I like it to be somewhat harder than stock without getting into RSS territory, I mean just try to build a SSTO with some decent payload fraction in 64k* \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E That is what makes this playstyle fun for me, that you do have to push yourself more than in stock, without outright smashing you in the face, confronting you with the difficulty and limits of a real solar system and its space programs. Maybe one day that will be the next step though, who knows \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E*with AJE \u003C/span\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-01-17T02:40:52Z","Content":"\n\u003Cp\u003EI was talking to someone on the IRC today who used a blanket ModuleManager config to reduce engine and fuel tank dry mass to roughly 1/3 of stock for use with 6.4x. This might be something to consider if RF is too much for you but you want to correct the insane masses of stock parts.\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2015-01-17T03:39:09Z","Content":"\n\u003Cp\u003Erkman: KSP fuel tanks are a bit more than 4x as heavy (in terms of dry mass for given tonnage of fuel) as real life tanks. Engines are anywhere from the correct mass (NTR, SRBs) to 3-6x as heavy as real life equivalents (most liquid engines), to OMGLOLWUTOP like the ions (like, say, 100x the TWR, 10000x the efficiency regarding electricity).\u003C/p\u003E\n"},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2015-01-17T11:26:07Z","Content":"\n\u003Cp\u003EIt may be unintended but i do like 64K because it makes the game harder. I really do think that in stock ksp it is to easy to get into orbit. \u003C/p\u003E\u003Cp\u003EAnd in spite of some initial problems i now find 64K quite doable with stock parts (and NEAR), aside from the lack of suitable high power engines.\u003C/p\u003E\u003Cp\u003EI find it strangely comforting that a Saturn V -like rocket is near the upper limit of what can realistically be built. \u003C/p\u003E\u003Cp\u003EI have the rocket down to 1000tons, 15000kN thrust. Still leaving fuel on the Mun. Reduced the thrust of the custom engine from 4500 to 3000. \u003C/p\u003E\u003Cp\u003EKSP\u0027s most powerful engine would be suitable for 64K, if it weren\u0027t for the fact that fitting five of them under a tank that\u0027s taller than it is wide is not possible.\u003C/p\u003E\n"},{"CreatedByName":"Tellion","CreatedById":116794,"CreatedDateTime":"2015-01-17T12:54:37Z","Content":"\n\u003Cp\u003EI made a \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/104280-0-90-Outer-Planets-Mod-%281-3%29-Now-with-100-more-moons%21-11-Jan-15?p=1673141\u0026amp;viewfull=1#post1673141\u0022 rel=\u0022external nofollow\u0022\u003Econfig\u003C/a\u003E for the outer planets mod with its new moons along with some other proposed changes and tweaks to \u0022vanilla\u0022 64k from this thread that I am not quite content with yet...\u003C/p\u003E\u003Cp\u003EWhile adjusting the orbital parameters and densities/masses wasn\u0027t too difficult, I struggle with the terrain. Is there any way to resize a planet while keeping its terrain in a similar shape? This should work nicely, with asteroid-like bodies at least. I spent a lot of time trying to figure out how the 10x rescale did it until finally realizing that the bodies only looked proper in scaledspace. I have tried \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/90547-0-90-10x-Kerbol-system-development-for-RSS-Version-2-1-0-Update-January-2015?p=1508603\u0026amp;viewfull=1#post1508603\u0022 rel=\u0022external nofollow\u0022\u003Ethis\u003C/a\u003E suggestion here, dividing frequencies of PQSModVertexSimplexHeightAbsolute and PQSModVertexHeightNoise by 6.4 and multiplying the deformities by the same amount, both with the resized and the unresized version of Hale (gilly based) to no avail. Am I misunderstanding or missing anything? \u003C/p\u003E\u003Cp\u003EOne more thing that seems to be occurring with rescaled versions of the kerbol system is that kerbol itself is visible through *some* planetary bodies from further distances or everywhere, has anyone else noticed this or knows what the causes behind it are? It really is weird when you are orbiting a gas giant and see kerbol merrily shining through it at its night side...\u003C/p\u003E\u003Cp\u003EAny ideas, as always, greatly appreciated.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-17T14:09:01Z\u0022 title=\u002201/17/2015 02:09  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 17, 2015\u003C/time\u003E by Tellion\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Shania_L","CreatedById":58975,"CreatedDateTime":"2015-01-17T18:07:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EOne more thing that seems to be occurring with rescaled versions of the Kerbol system is that Kerbol itself is visible through *some* planetary bodies from further distances or everywhere, has anyone else noticed this or knows what the causes behind it are? It really is weird when you are orbiting a gas giant and see Kerbol merrily shining through it at its night side...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI recently noticed Kerbol shining through Kerbin on my Mun mission (mainly because I dont often get further than LKO), is it possible that even though the planets have been scaled up that the disc size for occlusion remains at the stock size? \u003C/p\u003E\u003Cp\u003EA stock sized Kerbin occlusion disc from Mun orbit (73Mm) is pretty tiny, whereas the actual planet is still quite largish. My solar panels were getting blocked but there was no shadow being cast on the surface, it was as though it was in full daylight.\u003C/p\u003E\u003Cp\u003ESee here on this picture, the craft is illuminated (there are no lights on the craft) but the panels are pointed down at the Mun rather than up at the occluded Kerbol.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/RxKdvsH.png\u0022 alt=\u0022RxKdvsH.png\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NonWonderDog\u0022 data-cite=\u0022NonWonderDog\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI\u0027m not sure you can quite get there with the mods available, though. RealFuels is a bit too grognard, the stockalike engine pack is a bit too halfway and fiddly, and nobody\u0027s maintaining a mod to make the pods and structural parts follow realistic densities. I actually started changing all the pod masses to their real-for-Kerbals equivalents, but it got to be too much. I never worked out a good way to do it programmatically, and I\u0027d rather play with mods than spend all my time editing them. The stockalike engines seem to have too much thrust for their size, as well?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think there was a \u0022NEARFuels\u0022 type mod in development at some point, I dont know how far it got but it was doing essentially what you are saying. Multiple fuel options requiring specialised tankage, but without the RSS level of detailing and Kerbalised performance levels.\u003C/p\u003E\u003Cp\u003EHere ya go \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/92642-0-24-2-More-Fuel-Types-%28aka-NEARFuels%29-VER-1-3\u0022 rel=\u0022external nofollow\u0022\u003ENEARFuels\u003C/a\u003E Doesnt look like the thread has been active in a few months though.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-17T18:24:33Z\u0022 title=\u002201/17/2015 06:24  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 17, 2015\u003C/time\u003E by Shania_L\u003C/strong\u003E\n\u003C/span\u003E\n"}]}