{"TopicId":90151,"ForumId":34,"TopicTitle":"[1.1.2] Realism Overhaul v11.0.0 May 8","CreatedByName":"Felger","CreatedById":76828,"CreatedDateTime":"2014-11-13T00:02:09Z","PageNum":92,"Articles":[{"CreatedByName":"gruneisen","CreatedById":119794,"CreatedDateTime":"2015-08-08T16:04:58Z","Content":"\n\u003Cp\u003EI can say that I do not use any of the stock bug fixes. Additionally, the OP doesn\u0027t require, recommend, or suggest them, so I would guess that they are not needed or are not incompatible with RO. \u003C/p\u003E\u003Cp\u003EThat being said, it appears as though Nathan gas been AFK for the last few days, and I\u0027d wait for him to come back to answer your question. \u003C/p\u003E\u003Cp\u003EOf course, you can always install and try them and report back here any bugs or incompatibilities you may find! \u003C/p\u003E\u003Cp\u003EAs a final note, the CKAN metadata for RO does not list any of the stock bug fixes as incompatible, so you should be good to go to try them!\u003C/p\u003E\n"},{"CreatedByName":"jrodriguez","CreatedById":130617,"CreatedDateTime":"2015-08-08T22:10:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rabada\u0022 data-cite=\u0022Rabada\u0022\u003E\u003Cdiv\u003EWhat version of MechJeb are you using? Try deactivating your engines and see if MechJeb is better at turning with RCS with the engine deactivated. Another possible solution would be to try updating MechJeb to the latest stable dev build.\u003Cp\u003EThere was a bug with how MechJeb reads the torque available to a craft where it thinks it still has torque available from engine gimballing when the engine is not burning. I submitted a report in the official MechJeb thread a week or two ago. A subsequent dev build was released of MechJeb that had a fix for this issue, but I have not had the free time to test it.\u003C/p\u003E\u003Cp\u003EAlso if I recall correctly deactivating the engine (and maybe disabling the engines gimbal) also avoided this bug.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks I will try that!\u003C/p\u003E\n"},{"CreatedByName":"63Hayden","CreatedById":114284,"CreatedDateTime":"2015-08-09T00:18:06Z","Content":"\n\u003Cp\u003EI think it would be awesome if you could add support for this flashy capsule created by Ledenko: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/82045-K-P0110-Apollo-like-crew-module-now-with-source-files-included\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/82045-K-P0110-Apollo-like-crew-module-now-with-source-files-included\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt has all the foundation, but just needs a patch for the internal RCS to function. I\u0027ve been using this command pod for a very long time and can vouch for its awesomeness.\u003C/p\u003E\n"},{"CreatedByName":"Yaivenov","CreatedById":81754,"CreatedDateTime":"2015-08-09T17:54:55Z","Content":"\n\u003Cp\u003EHaving some performance issues and trying to lower the work load of the computer. RealPlume is listed as being an optional mod however CKAN is treating it as mandatory and I am unable to split them in a CKAN install. So first, how do I properly remove RealPlume without breaking everything else and/or leaving all my engines with no sound or visual effects? Second, if I wanted to keep the very nice engine exhaust, but just turn down the system strain, how would I see about removing the giant exhaust plume that is present below 20km?\u003C/p\u003E\n"},{"CreatedByName":"gruneisen","CreatedById":119794,"CreatedDateTime":"2015-08-09T17:58:10Z","Content":"\n\u003Cp\u003EThe easiest way to control CPU load with RealPlume is to adjust the number of particles that are used by SmokeScreen. You can do this during the flight and manually change the number of particles as function of altitude if you like.\u003C/p\u003E\n"},{"CreatedByName":"Yaivenov","CreatedById":81754,"CreatedDateTime":"2015-08-09T18:16:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022gruneisen\u0022 data-cite=\u0022gruneisen\u0022\u003E\u003Cdiv\u003EThe easiest way to control CPU load with RealPlume is to adjust the number of particles that are used by SmokeScreen. You can do this during the flight and manually change the number of particles as function of altitude if you like.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWow, thanks for the fast answer.\u003C/p\u003E\u003Cp\u003EWill that typically reduce just the voluminous smoke plume, or both the plume and the immediate engine exhaust envelope/flame feather?\u003C/p\u003E\n"},{"CreatedByName":"Squiggsy","CreatedById":139947,"CreatedDateTime":"2015-08-09T18:22:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022gruneisen\u0022 data-cite=\u0022gruneisen\u0022\u003E\u003Cdiv\u003EThe easiest way to control CPU load with RealPlume is to adjust the number of particles that are used by SmokeScreen. You can do this during the flight and manually change the number of particles as function of altitude if you like.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOhh do you have any details on how to do this? I looked around for something like this but was unsuccessful, RealPlumes ruins the performance when running more than 4-5 engines at once and on some engines gets bad even with just 1 or two\u003C/p\u003E\n"},{"CreatedByName":"gruneisen","CreatedById":119794,"CreatedDateTime":"2015-08-09T18:28:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Yaivenov\u0022 data-cite=\u0022Yaivenov\u0022\u003E\u003Cdiv\u003EWow, thanks for the fast answer.\u003Cp\u003EWill that typically reduce just the voluminous smoke plume, or both the plume and the immediate engine exhaust envelope/flame feather?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Squiggsy\u0022 data-cite=\u0022Squiggsy\u0022\u003E\u003Cdiv\u003EOhh do you have any details on how to do this? I looked around for something like this but was unsuccessful, RealPlumes ruins the performance when running more than 4-5 engines at once and on some engines gets bad even with just 1 or two\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou can add the SmokeScreen button via blizzy78\u0027s toolbar. From there, you can open up the SmokeScreen dialog and adjust the number of particles. \u003C/p\u003E\u003Cp\u003EI\u0027m no expert on how these two mods work, but it will reduce smoke and flame together - I believe changing the total number of particles does just that and that the same bucket of particles is used for both flame and smoke...but don\u0027t quote me on that. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd glad to help!\u003C/p\u003E\n"},{"CreatedByName":"Yaivenov","CreatedById":81754,"CreatedDateTime":"2015-08-09T21:38:37Z","Content":"\n\u003Cp\u003ESo another question, I\u0027ve been jotting down noted bugs and ideas as they occur to me while playing and I\u0027d like to bounce them off the other RO fellas. Where would be a good spot on the forum to post it all?\u003C/p\u003E\n"},{"CreatedByName":"leocpadua","CreatedById":148268,"CreatedDateTime":"2015-08-09T22:54:34Z","Content":"\n\u003Cp\u003EHey guys,I\u0027m using RSS and I wanted to add one brazilian launch site.\u003C/p\u003E\u003Cp\u003EWorked well on configs,no problem at all,but the RemoteTech ground base don\u0027t appear/work on the game,here is the print of my config:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/IrA3Moa.png\u0022 alt=\u0022IrA3Moa.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIf someone can help me,I appreciate.\u003C/p\u003E\n"},{"CreatedByName":"Lilienthal","CreatedById":119423,"CreatedDateTime":"2015-08-10T00:01:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Yaivenov\u0022 data-cite=\u0022Yaivenov\u0022\u003E\u003Cdiv\u003ESo another question, I\u0027ve been jotting down noted bugs and ideas as they occur to me while playing and I\u0027d like to bounce them off the other RO fellas. Where would be a good spot on the forum to post it all?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eeither here or on \u003Ca href=\u0022https://github.com/KSP-RO/RealismOverhaul\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/KSP-RO/RealismOverhaul\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Yaivenov","CreatedById":81754,"CreatedDateTime":"2015-08-10T01:17:46Z","Content":"\n\u003Cp\u003ESo whenever I\u0027m playing KSP, or modding KSP, or reading about KSP, or eating, sleeping, driving, etc. well lets just say ideas are always bouncing around and sometimes I actually remember to write them down! So here\u0027s just some of those thoughts while I was whittle away the hours in the game. There\u0027s no real pattern here, I just jotted down things as they occurred to me. Hopefully a few of them are actually worthwhile ideas and will spur some mod development (awesomeness sold separately).\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EBugs -\u003C/strong\u003E Just a few of the more annoying glitches that keep getting in the way of a good space mission.\u003C/p\u003E\u003Cp\u003ELife support electricity showing \u00220:infinity\u0022 in RO, shows proper time in stock.\u003C/p\u003E\u003Cp\u003EBuilt in crew pod RCS is still buggy. The \u0022mercury\u0022 pod\u0027s rotational RCS thruster fires when the yaw command is given. This continues even if the roll RCS selection is switched off in the VAB.\u003C/p\u003E\u003Cp\u003ESAS/SASS still needs anticipation/damping to fix the constant \u0022hunting\u0022 and overshooting problem. Perhaps the system can be made to examine the position and power of the available manuevering thrusters versus the mass of the craft to determine available angular acceleration and use that to set limits onto the automatic RCS systems so they do not keep accelerating the crafts rotation continuously through out the manuever.\u003C/p\u003E\u003Cp\u003ECapsule-integrated RCS thrusters still bugging out when being controlled by mechjeb or the stock SAS. Sometimes have to manually disable the mechjeb module in the crew capsule/probe core to restore function. Recommend just removing them for the time being and adding a simple linear thruster part that is available in the starting node. Let the players figure out how best to arrange control thrusters.\u003C/p\u003E\u003Cp\u003EThe launch clamps are chasing the spacecraft (snapping to it\u0027s location and sometimes colliding) at some of the same altitudes used for the automatic \u0022altitude record\u0022 contracts, namely 6.5km, 13km and 22km (approximate).\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ENeeds -\u003C/strong\u003E Critical bits that are missing.\u003C/p\u003E\u003Cp\u003ESome sort of starting interstage is needed, procedural interstage and payload fairings unlock far after the player is using multi-stage rockets. As an idea, what about crude forms of interstage design, like the bird cage or lattice arrangements. As better interstage systems are unlocked they will become lighter (for a given size) and also improve in aerodynamics (lattice versus hard shell).\u003C/p\u003E\u003Cp\u003EAbility to turn down realplume in a more readily accessible manner, selections to exclude entire aspects, such as the smoke plume but not the flame envelope (or even just easily found documentation to instruct players in how to alter settings in smoke screen and elsewhere as they may need to.) Can we get engine lighting integrated into realplume?\u003C/p\u003E\u003Cp\u003EClear documentation in game of which tech nodes improve already unlocked parts (such as the procedural fairing sizes and the mechjeb capability modules).\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EWants -\u003C/strong\u003E What most of my ideas fall into, \u0022hey it would be great if....\u0022 \u003C/p\u003E\u003Cp\u003EA part trimming tool in game that can be used to \u0022permanently deselect\u0022 parts out of the list in the VAB/SPH and upon next reboot they will remain unloaded.\u003C/p\u003E\u003Cp\u003EMultistage engine starting: spin up turbomachinery first via compressed gas or gas generator, when the pumps are \u0022at speed\u0022 or the propellant lines read a certain pressure available then open the fuel valves to the injector and activate the ignitor system if seperate (the H-1 engine automatically bled off gasses from the solid rocket motor gas generator that spun up the pumps and used it to also ignite the combustion chamber). On/off status should be independant of throttle setting and require a direct action by the player (shutting the propellant valves). Some issues with start-limited engines in the KSP game are there are instances where the game may either bug out momentarily setting throttle to 0 and then back to the previous setting and there are instances with mechjeb (such as switching off the launch guidance while still in powered flight) that will also change the throttle setting and interfere with proper operation and often cause a failed launch.\u003C/p\u003E\u003Cp\u003ESpacesuit change to crew inventory item that they can choose to wear (option to wear available both inside and outside the craft).\u003C/p\u003E\u003Cp\u003ECabin CO2 needs to changed so it\u0027s displayed as a percentage of the cabin atmosphere, and not an alterable resource. CO2 needs to be constantly and immediately scrubbed so the CO2 absorbers need to be planned to last the entire mission. CO2 gauge should be from 0.00% to 1.50% (or whatever is considered lethal). Kerbal suits should have their own built in systems and crew should be able to get into their suits if the spaceship life support isn\u0027t working.\u003C/p\u003E\u003Cp\u003E\u0022Life support\u0022 electricity should be broken down into detail so that select technology upgrades will cause the astronauts to use less. More efficient lighting/heating/cooling/etc.\u003C/p\u003E\u003Cp\u003ECrew capsules should also be temperature controlled, which would require greater ammounts of electricity if the craft isn\u0027t setup to handle its own waste heat properly (radiators, etc., more energy used if you have to use a lot of heat pumps to move the waste heat somewhere else to be radiated, so on)\u003C/p\u003E\u003Cp\u003EUnable to exit the crew capsule unless it is depressurized first, can only depressurize if everyone in the capsule is suited up. Airlock code module for crew capsules large enough to support them, airlocks allow ingress/egress without depressurizing the whole capsule, but will vent an airlock\u0027s worth of oxygen to space if a scavenger pump isn\u0027t available/used. Airlock possible extra item to add to capsules or stations that don\u0027t yet have one.\u003C/p\u003E\u003Cp\u003EPreferential electrical grid that allows prioritizing of electrical sources, and lock outs that prevent their consumption before other systems (TAC fuel balancer could probably do this but would need persistent resource storage settings. Also accurate estimations for energy consumption rates and estimated depletion times, TACLS for instance doesn\u0027t change the remaining time for life support based on current craft drain, instead that clock just speeds up (electrical estimation clock observed in stock KSP, presently non-functional in RO).\u003C/p\u003E\u003Cp\u003EControl Moment Gyroscopes to compliment and upgrade from the Reaction Wheels and Reaction Control Systems. Make some that are single gimbal versus full gimballed.\u003C/p\u003E\u003Cp\u003ELocking out certain in-game information from mechjeb and other sources until suitable parts are unlocked, ie. no exact temperature readings until the thermometer is unlocked and installed on the craft, no exact surface coordinates without a GNSS receiver and constellation or a star tracker.\u003C/p\u003E\u003Cp\u003ELimited fuel flow rates through lines, fuel flow rate from balloon tanks limited by the available pressurization. Player will need to account for necessary propellant flow rates to meet the demands of the various engines.\u003C/p\u003E\u003Cp\u003EProcedural \u0022utility tunnels\u0022 (fuel lines) that hug the surface of the craft allowing the simplified and low profile of linking parts in a stack. Selectable for which resources it will pass, and also which/both direction (say a one-way RCS propellant line so your CM drains the SM\u0027s tanks before its own and a two way electrical umbilical both in the same utility tunnel object).\u003C/p\u003E\u003Cp\u003EElectrical power being treated like other fuels and requiring a suitable connection across stage seperators.\u003C/p\u003E\u003Cp\u003EToolsuite to evaluate the best launch profiles for a given rocket.\u003C/p\u003E\u003Cp\u003EOverhaul current staging systems. Placing a stage-possible part on a ship and that staging icon should go into an unassigned pool. From there the player chooses which parts to assign to the staging list, if any. Parts left in the unassigned pool are excluded from the staging list (for instance an engine that you want to only ever be activated via control group). Each \u0022stage\u0022 can be broken down and different parts can be assigned different action times to be executed as a stage. Example:\u003C/p\u003E\u003Cp\u003EStage 1 (launching)\u003C/p\u003E\u003Cp\u003ET\u002B0 seconds = fire gas generators starting turbomachinery for engines.\u003C/p\u003E\u003Cp\u003ET\u002B6 seconds = open fuel valves.\u003C/p\u003E\u003Cp\u003ET\u002B6.25 seconds = activate ignitor.\u003C/p\u003E\u003Cp\u003ET\u002B10 seconds = after achieving full thrust, release launch clamps.\u003C/p\u003E\u003Cp\u003ET\u002Bn seconds = close fuel valves to turbomachinery and allow to spin down on own, thrust drops off gradually.\u003C/p\u003E\u003Cp\u003ET\u002Bn\u002B5 seconds = initiate staging\u003C/p\u003E\u003Cp\u003EContracts and administraction strategies should remain open and available during \u0022science only\u0022 career playthroughs as both provided a source of science points to unlock technology (a science only career has less science points available to it than a full career, especially early on when the player is scraping together a few points here and there to unlock the initial techs). Additionally a career mode that allows the player to act as a government agency for funding purposes could be interesting, a regular albeit fixed budget that is provided each year/month with the player able to petition for an increase in funding by putting together project presentations, tech demonstrators, etc. or suffer a decrease if they fail to show merit for continued funding.\u003C/p\u003E\u003Cp\u003ECollision mesh (?) for parachutes so they push each other aside instead of clipping through each other.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ETo Do\u0027s -\u003C/strong\u003E Things that I think should be within my skills to create/fix.\u003C/p\u003E\u003Cp\u003EMake a list of engines and suitable models that match (or closely match) them for a \u0022RealEngine\u0022 mod. Standalone engine pack to reduce the excess clutter and memory usage from installing entire mod packs just for the engines. Also to correct for tech node misplacement, duplicated engines (RL-10 and J-2 I\u0027m looking at youse) and poor models (stock engines being repeatedly recycled and distorted as place holders and filler). Need to contact mod authors to get permission to repack their engine models together. Search the available mods for the best engine models to match their real world counterparts.\u003C/p\u003E\u003Cp\u003EFind a way to integrate Kerbal GPS into RemoteTech and MechJeb (no ground coordinates available without a GPS constellation or an independent navigation system such as a Startracker. (Should GPS satellites be required to carry an isotope clock and startracker to be functional?)\u003C/p\u003E\u003Cp\u003EBeing able to build an appropriate IU (Instrumentation Unit) for the different stages. Almost possible currently with smart parts. Being able to add additional tanks of high pressure helium and/or TEA/TEB to change the number of times an engine could be restarted. The Saturn V S-2 engines (five J-2\u0027s) only needed to light once, versus the S-IVB\u0027s engine (also a J-2) would need to be able to start at least twice. This will let players further tailor their rockets to their own designs.\u003C/p\u003E\u003Cp\u003EA tech tree based on dates of development with the different branches based on different technology types/engine development programs.\u003C/p\u003E\u003Cp\u003EMake the doors on the stock science bays deployable radiators like the space shuttle\u0027s cargo doors.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ETo Done\u0027s -\u003C/strong\u003E Stuff I\u0027ve already done. \u003C/p\u003E\u003Cp\u003ERequire bulk fueling to be done at the pad after rollout. In order to get around part loading lag that was destroying massive rockets in my game I would prepare them in the VAB and then drain all the main LOX/LH2/RP-1 tanks and have a few of the ground support parts (launch clamps, umbilical towers) set as resource generators. The rocket would load in with only a fraction of it\u0027s flight mass avoiding lag bug destruction, and then would spend a short while gassing up prior to flight. obviously shouldn\u0027t apply to small pre-prepared tanks like the Apollo SM\u0027s SPS hypergol tanks, RCS fuel, etc. Only modification needed was to add the resource modules to the launch clamps.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ERandom Thoughts -\u003C/strong\u003E Like I needed to restate that...\u003C/p\u003E\u003Cp\u003EFor the tech reliability mod: What about test stands that let you evaluate and develop engine reliability without risking them in flight? Test stand can be as simple as your rocket stage being mounted to extra-strong, non-releasing launch clamps that also act as the probe core for control. As an addon for KCT, you could develop engines on a test stand to reduce their dynamic failure rate (rather than flying them to do so), and then also incorporate a minimum \u0022material defect\u0022 failure rate. To counter this you would test unique engines on the stands, verify they are good, and then install them on the rockets for use. A few special areas don\u0027t allow this though, such as the Lunar Descent Engine on the LEM. Due to the corrosive hypergol propellant and the ablative cooling it could only be fired once and allowed for no pre-testing, so while you might reduce the tech development failure rate with R\u0026amp;D and live fire tests you will be unable to avoid the material defect failure rate in certain cases.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EQuestions - \u003C/strong\u003ESomething I\u0027m apparently too stupid to find on the internet. Please help.\u003C/p\u003E\u003Cp\u003EDoes it damage liquid engines to let them run to propellant exhaustion?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-10T01:34:44Z\u0022 title=\u002208/10/2015 01:34  AM\u0022 data-short=\u00228 yr\u0022\u003EAugust 10, 2015\u003C/time\u003E by Yaivenov\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Boris33fr","CreatedById":143231,"CreatedDateTime":"2015-08-10T14:06:26Z","Content":"\n\u003Cp\u003EHello ! I have so frequent crashes in game, only during loading, when i\u0027m changing scenes. (Rocket to KSC, KSC to VAB, ...). It\u0027s so annoying and i cant play anymore like this. Anyone know a way to resolve this issue ? Thanks \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EOutput Log :\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/gjtwkgrd6qalx6r/output_log.txt?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/gjtwkgrd6qalx6r/output_log.txt?dl=0\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"ColKlonk","CreatedById":137078,"CreatedDateTime":"2015-08-10T18:43:09Z","Content":"\n\u003Cp\u003EThere seems to be a conflict with RO (V10.2) and Procedural Parts (v1.1.7.0)...\u003C/p\u003E\u003Cp\u003ELoading stops at the Procedural parts SRB tanks..\u003C/p\u003E\u003Cp\u003EModuleManager used is V2.6.6.. (as V2.6.7 just doesn\u0027t get off the ground)\u003C/p\u003E\u003Cp\u003EWith either one of these two mods removed, loading is OK\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003ESolution and/or WorkAround :-\u003C/span\u003E\u003C/em\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThe problem looks to lie between the files:-\u003C/p\u003E\u003Cp\u003E ..\\GameData\\ProceduralParts\\Parts\\ZOtherMods\\\u003Cstrong\u003ERFSRB.CFG\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003Eand\u003C/p\u003E\u003Cp\u003E...\\GameData\\RealismOverhaul\\RO_RecommendedMods\\Procedurals\\\u003Cstrong\u003ERO_ProceduralParts.cfg\u003C/strong\u003E \u003C/p\u003E\u003Cp\u003EWhat I\u0027ve done is just delete the RFSRB file and all works fine so far... as I can do without Procedural SRBs for the time being.\u003C/p\u003E\u003Cp\u003E Maybe Nathan can speak to the Procedural Parts modder.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-10T20:42:39Z\u0022 title=\u002208/10/2015 08:42  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 10, 2015\u003C/time\u003E by ColKlonk\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Boris33fr","CreatedById":143231,"CreatedDateTime":"2015-08-10T18:46:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ColKlonk\u0022 data-cite=\u0022ColKlonk\u0022\u003E\u003Cdiv\u003EThere seems to be a conflict with RO (V10.2) and Procedural Parts (v1.1.7.0)...\u003Cp\u003ELoading stops at the Procedural parts SRB tanks..\u003C/p\u003E\u003Cp\u003EStill looking at it..\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks for taking care of me. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E But, where do you see this in my crashlog ^^ I would like to be able to read it as you do to don\u0027t bother people anymore. ^^\u003C/p\u003E\n"},{"CreatedByName":"ZoltanJackson","CreatedById":144168,"CreatedDateTime":"2015-08-10T19:03:14Z","Content":"\n\u003Cp\u003EI am having trouble G-forces, if somebody could help with any advice?\u003C/p\u003E\u003Cp\u003EPlaying career mode RP-0, using all of the recommended mods and some of the suggested mods, plus a couple of UI-related things such as Kerbal Alarm Clock and Science Alert.\u003C/p\u003E\u003Cp\u003EUnlocked the first capsule - built a simple single stage sub-orbital rocket, launched it - don\u0027t remember the altitude I reached, some hundreds of km, and velocity maxed out around 3,500 m/s. Upon reentry, some heating starts, then G-forces rise and rise, until around 30 km my pilot gets splatted across the cabin.\u003C/p\u003E\u003Cp\u003EI figured maybe the velocity was too high, so I built a replica of Mercury-Redstone using FASA (I believe). After gravity turn and full burn, apogee is around 280 km, and velocity something like 2,500 m/s. Reentry - same thing happens around 30 km, and my pilot is splatted again.\u003C/p\u003E\u003Cp\u003EWhat am I doing wrong? I see no way in the Mercury capsule to slow my descent so the G-forces aren\u0027t so lethal; they just rise up to maximum and kill my pilot. Obviously I\u0027m doing something wrong, but what? If I can\u0027t survive a simple suborbital flight, how will I survive any orbital returns?\u003C/p\u003E\n"},{"CreatedByName":"Boris33fr","CreatedById":143231,"CreatedDateTime":"2015-08-10T19:31:12Z","Content":"\n\u003Cp\u003Elol, i\u0027m having the sames problems since a few minutes. ^^ Welcome\u003C/p\u003E\n"},{"CreatedByName":"HoloYolo","CreatedById":138353,"CreatedDateTime":"2015-08-10T20:44:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ZoltanJackson\u0022 data-cite=\u0022ZoltanJackson\u0022\u003E\u003Cdiv\u003EI am having trouble G-forces, if somebody could help with any advice?\u003Cp\u003EPlaying career mode RP-0, using all of the recommended mods and some of the suggested mods, plus a couple of UI-related things such as Kerbal Alarm Clock and Science Alert.\u003C/p\u003E\u003Cp\u003EUnlocked the first capsule - built a simple single stage sub-orbital rocket, launched it - don\u0027t remember the altitude I reached, some hundreds of km, and velocity maxed out around 3,500 m/s. Upon reentry, some heating starts, then G-forces rise and rise, until around 30 km my pilot gets splatted across the cabin.\u003C/p\u003E\u003Cp\u003EI figured maybe the velocity was too high, so I built a replica of Mercury-Redstone using FASA (I believe). After gravity turn and full burn, apogee is around 280 km, and velocity something like 2,500 m/s. Reentry - same thing happens around 30 km, and my pilot is splatted again.\u003C/p\u003E\u003Cp\u003EWhat am I doing wrong? I see no way in the Mercury capsule to slow my descent so the G-forces aren\u0027t so lethal; they just rise up to maximum and kill my pilot. Obviously I\u0027m doing something wrong, but what? If I can\u0027t survive a simple suborbital flight, how will I survive any orbital returns?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003EDon\u0027t enter too steeply. The reentry effects ramp up at around 30,000 km right before they die down, so coming in too steep could turn your capsle into a blender, I recommend flatting out somewhere along your flight for shallow reentrys.\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2015-08-10T20:55:16Z","Content":"\n\u003Cp\u003EAlso afaik even the suborbital Mercury flights fired retro rockets at apoapsis. I remember back when I was simulating Mercury flights I was having the same issue. But the retro fire helped and... I was just going too high. 280km is way too high which is probably the culprit for the excess g forces. Mercury Redstone 3 went up to 186km. So your almost one hundred km higher.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-10T20:59:39Z\u0022 title=\u002208/10/2015 08:59  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 10, 2015\u003C/time\u003E by Motokid600\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Boris33fr","CreatedById":143231,"CreatedDateTime":"2015-08-10T21:14:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ColKlonk\u0022 data-cite=\u0022ColKlonk\u0022\u003E\u003Cdiv\u003EThere seems to be a conflict with RO (V10.2) and Procedural Parts (v1.1.7.0)...\u003Cp\u003ELoading stops at the Procedural parts SRB tanks..\u003C/p\u003E\u003Cp\u003EModuleManager used is V2.6.6.. (as V2.6.7 just doesn\u0027t get off the ground)\u003C/p\u003E\u003Cp\u003EWith either one of these two mods removed, loading is OK\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003ESolution and/or WorkAround :-\u003C/span\u003E\u003C/em\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThe problem looks to lie between the files:-\u003C/p\u003E\u003Cp\u003E ..\\GameData\\ProceduralParts\\Parts\\ZOtherMods\\\u003Cstrong\u003ERFSRB.CFG\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003Eand\u003C/p\u003E\u003Cp\u003E...\\GameData\\RealismOverhaul\\RO_RecommendedMods\\Procedurals\\\u003Cstrong\u003ERO_ProceduralParts.cfg\u003C/strong\u003E \u003C/p\u003E\u003Cp\u003EWhat I\u0027ve done is just delete the RFSRB file and all works fine so far... as I can do without Procedural SRBs for the time being.\u003C/p\u003E\u003Cp\u003E Maybe Nathan can speak to the Procedural Parts modder.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks you ! Really nice from you !\u003C/p\u003E\n"},{"CreatedByName":"gruneisen","CreatedById":119794,"CreatedDateTime":"2015-08-10T22:10:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ZoltanJackson\u0022 data-cite=\u0022ZoltanJackson\u0022\u003E\u003Cdiv\u003EI am having trouble G-forces, if somebody could help with any advice?\u003Cp\u003EPlaying career mode RP-0, using all of the recommended mods and some of the suggested mods, plus a couple of UI-related things such as Kerbal Alarm Clock and Science Alert.\u003C/p\u003E\u003Cp\u003EUnlocked the first capsule - built a simple single stage sub-orbital rocket, launched it - don\u0027t remember the altitude I reached, some hundreds of km, and velocity maxed out around 3,500 m/s. Upon reentry, some heating starts, then G-forces rise and rise, until around 30 km my pilot gets splatted across the cabin.\u003C/p\u003E\u003Cp\u003EI figured maybe the velocity was too high, so I built a replica of Mercury-Redstone using FASA (I believe). After gravity turn and full burn, apogee is around 280 km, and velocity something like 2,500 m/s. Reentry - same thing happens around 30 km, and my pilot is splatted again.\u003C/p\u003E\u003Cp\u003EWhat am I doing wrong? I see no way in the Mercury capsule to slow my descent so the G-forces aren\u0027t so lethal; they just rise up to maximum and kill my pilot. Obviously I\u0027m doing something wrong, but what? If I can\u0027t survive a simple suborbital flight, how will I survive any orbital returns?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAdditionally, RO used to included a \u0027descent mode\u0027 which could be activated on capsules. It operated by changing the location of the CG so that the capsule could generate some lift as it re-entered the atmosphere. I\u0027m not sure if it\u0027s still there - I haven\u0027t re-entered a capsule for some time, but if it is, it can significantly reduce the re-entry G forces as well!\u003C/p\u003E\n"},{"CreatedByName":"Devinci","CreatedById":71469,"CreatedDateTime":"2015-08-11T02:27:42Z","Content":"\n\u003Cp\u003EDoes anyone know what \u0022Insufficient resources to ignite means\u0022? My engine is not starting at all from the pad.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Devinci\u0022 data-cite=\u0022Devinci\u0022\u003E\u003Cdiv\u003EDoes anyone know what \u0022Insufficient resources to ignite means\u0022? My engine is not starting at all from the pad.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEdit: Using the FASA umbillical towers fixed the problem somehow.\u003C/p\u003E\n"},{"CreatedByName":"ZoltanJackson","CreatedById":144168,"CreatedDateTime":"2015-08-11T02:48:07Z","Content":"\n\u003Cp\u003EThanks for the great replies. The Mk1 capsule does have a descent mode, but it didn\u0027t make any difference to my pilot getting squashed - but that\u0027s probably because I was way too steep. The Mercury pod doesn\u0027t have a descent mode but, again, it sounds like I am going way too steep. I did my gravity turn roughly according to the Wiki, but I guess I was not flattening out enough. My turn generally seems to slow down around 45 degrees / 1 km/s velocity, so I will look at refining this. I did try burning the retro rockets at apogee, but they\u0027re only like 100 m/s so it didn\u0027t change the end result... But clearly, if I am going up 100 km too high then I am way off where I\u0027m supposed to be!\u003C/p\u003E\u003Cp\u003ENext time I\u0027m at my computer I\u0027ll give it a go, concentrating on shallowing my gravity turn quite a bit. Thanks!\u003C/p\u003E\n"},{"CreatedByName":"gruneisen","CreatedById":119794,"CreatedDateTime":"2015-08-11T03:10:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Devinci\u0022 data-cite=\u0022Devinci\u0022\u003E\u003Cdiv\u003EDoes anyone know what \u0022Insufficient resources to ignite means\u0022? My engine is not starting at all from the pad.\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EEdit: Using the FASA umbillical towers fixed the problem somehow.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EChances are you do not have the engine attached to a fuel tank with the correct fuel. Most to all fuel tanks in RO are defaulted to empty so, once you attach an engine to one - be it a FASA tank or a Procedural Tank, you have to right click on the tank and hit the button to fill it with the right resource. \u003C/p\u003E\u003Cp\u003EOne note is that most engines will work fine with the default Procedural Tank, but if you\u0027re using a pressure fed engine, then you need to use a Procedural Tank and set the type to \u0027Device Module\u0027 or use a tank that says it is \u0027Pressurized\u0027.\u003C/p\u003E\u003Cp\u003ECheers!\u003C/p\u003E\n"},{"CreatedByName":"Boris33fr","CreatedById":143231,"CreatedDateTime":"2015-08-11T04:15:26Z","Content":"\n\u003Cp\u003EI have installed ATM also, but my game keep crashing, even after deleting the file you told me to. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E :( \u003C/p\u003E\u003Cp\u003EStill crash when i\u0027m loading a scene.\u003C/p\u003E\u003Cp\u003EMy output log\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/gjtwkgrd6qalx6r/output_log.txt?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/gjtwkgrd6qalx6r/output_log.txt?dl=0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThanks :\u0027( ^^\u003C/p\u003E\n"}]}