{"TopicId":97537,"ForumId":34,"TopicTitle":"[1.2] OSE Workshop - KIS Addon: (v1.1.0 - 2016.11.03)","CreatedByName":"ObiVanDamme","CreatedById":136329,"CreatedDateTime":"2015-01-23T14:31:29Z","PageNum":3,"Articles":[{"CreatedByName":"Enceos","CreatedById":110725,"CreatedDateTime":"2015-05-14T17:36:52Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022color:#008000;\u0022\u003EOSE Workshop was updated for KSP 1.0.2\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EChangelog\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E0.6.0 - 2015-05-14\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ECompatibility with KSP 1.0.2\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAdded MKS as new Dependency\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ERemoved KAS as Dependency\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EReplaced Hitchhiker placeholder model with the Generic MKS Module and a custom Decal\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAdded custom editor category to find Workshop Parts easier\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ERemoved toolboxes, because MKS already provides tanks for RocketParts\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ERequired resources for each item are now configurable with MM on a per part base and it is possible to require more than one resource with different ratios (This is the part that took me so long to finish this release ;-)).\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EYou can highlight all inventories on your current vessel from the Workbench. This is an unfinished feature for future releases, but I did not want to remove it for this one. Just ignore it\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"ObiVanDamme","CreatedById":136329,"CreatedDateTime":"2015-05-14T17:49:59Z","Content":"\n\u003Cp\u003EPlease note,that the CKAN download is currently broken, because it still has the old dependencies. I already opened a request to NetKAN and will inform you when it will work again. Until than, please use the manual update method.\u003C/p\u003E\n"},{"CreatedByName":"RedParadize","CreatedById":129285,"CreatedDateTime":"2015-05-15T01:58:46Z","Content":"\n\u003Cp\u003EI realy like the idea of your mod, and with the help of KIS, I can now built rocket in a more restrictive manner than Extraplanetary Launchpads. I like Extraplanetary Launchpads, but I feel a bit cheaty to be eable to produce \u003Cem\u003Eanything anywhere, and ready to lunch\u003C/em\u003E. With OSE\u002BKIS, if I want to build something big, I will need to bring many kerbals to built, lift and place parts. And, I have to say thats the possibility of requiring different resourse is a awesome idea. \u003C/p\u003E\u003Cp\u003EI have a questions, and suggestions: \u003Cspan style=\u0022font-size:8px;\u0022\u003E( thats when I become anoying... my apology...)\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E1: Do you plan on upgrading the interface? Right now, the amount and kind of resource required is not specified. Also, without way to short parts, its difficult to find what I am looking for. More part I add, worst it is. The worst is that I often don\u0027t know them by their name. Thinking about it the game itself rely on icons. I don\u0027t know how difficult it would be, but KIS already have a interface that use Icons, something like that would be amazing!\u003C/p\u003E\u003Cp\u003E2: Do you plan to add more parts? I know I can add them myself, but I can\u0027t resist to think it could be done procedurally. With the possiblity of requiring different kind of resource, that could quickly become realy interesting, specific modules could require different resource. Also, the tech level could also influence the requirement for advanced materials...\u003C/p\u003E\u003Cp\u003EI am dreaming big here...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-15T02:10:09Z\u0022 title=\u002205/15/2015 02:10  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 15, 2015\u003C/time\u003E by RedParadize\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"rasta013","CreatedById":140002,"CreatedDateTime":"2015-05-15T02:33:05Z","Content":"\n\u003Cp\u003EJust pulled down the latest version (looks like CKAN updated I think) and took a peak through your .cfg files. You might want to double check the part names from KAS because he removed several of the parts and renamed some others and it looks like you still have the old names in your KAS config. Just a mention for you. Your mod looks great and I hope you keep working on it - this has amazing potential to integrate with some of the existing widely used mods like EPL, MKS and of course expanding on KAS/KIS ideas. Great job!\u003C/p\u003E\n"},{"CreatedByName":"ObiVanDamme","CreatedById":136329,"CreatedDateTime":"2015-05-15T06:47:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RedParadize\u0022 data-cite=\u0022RedParadize\u0022\u003E\u003Cdiv\u003EI realy like the idea of your mod, and with the help of KIS, I can now built rocket in a more restrictive manner than Extraplanetary Launchpads. I like Extraplanetary Launchpads, but I feel a bit cheaty to be eable to produce \u003Cem\u003Eanything anywhere, and ready to lunch\u003C/em\u003E. With OSE\u002BKIS, if I want to build something big, I will need to bring many kerbals to built, lift and place parts. And, I have to say thats the possibility of requiring different resourse is a awesome idea. \u003Cp\u003EI have a questions, and suggestions: \u003Cspan style=\u0022font-size:8px;\u0022\u003E( thats when I become anoying... my apology...)\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E1: Do you plan on upgrading the interface? Right now, the amount and kind of resource required is not specified. Also, without way to short parts, its difficult to find what I am looking for. More part I add, worst it is. The worst is that I often don\u0027t know them by their name. Thinking about it the game itself rely on icons. I don\u0027t know how difficult it would be, but KIS already have a interface that use Icons, something like that would be amazing!\u003C/p\u003E\u003Cp\u003E2: Do you plan to add more parts? I know I can add them myself, but I can\u0027t resist to think it could be done procedurally. With the possiblity of requiring different kind of resource, that could quickly become realy interesting, specific modules could require different resource. Also, the tech level could also influence the requirement for advanced materials...\u003C/p\u003E\u003Cp\u003EI am dreaming big here...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhile writing this, the sketch of the new interface is just next to me on a piece if paper. It will have Icons like in KIS, filters for category, filters for modules, progress bar in the window, selectable target inventory for storing items and cancelation of current production. If nothing unforseen happens, this will be main priority for the next release.\u003C/p\u003E\u003Cp\u003EI will take some time to look at KIS, KAS, MKS and Sqauds items again. I did not update the lists from my 0.9 release, because I focused on compatibility and the multi resource feature for 0.6.0. This will be addressed soon. I am already thinking about a procedural way to parts available for construction, but I really want to keep it limited, as you already said. My first thought was to limit the construction to parts, that can be attached radially and to have an upper limit of the parts mass / volume. Maybe the Recipe, that I currently use, can be something like an efficiency recipe. This would mean, that you can build all parts, which met my procedural criteria using RocketParts and additionally every Item, that has a recipe specified, which might only need structual parts (e.g.: Ground Base).\u003C/p\u003E\u003Cp\u003ELong story short: I have thought about both Ideas you postet already and more will be coming soon, stay tuned and thank you for your feedback \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rasta013\u0022 data-cite=\u0022rasta013\u0022\u003E\u003Cdiv\u003EJust pulled down the latest version (looks like CKAN updated I think) and took a peak through your .cfg files. You might want to double check the part names from KAS because he removed several of the parts and renamed some others and it looks like you still have the old names in your KAS config. Just a mention for you. Your mod looks great and I hope you keep working on it - this has amazing potential to integrate with some of the existing widely used mods like EPL, MKS and of course expanding on KAS/KIS ideas. Great job!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI just received the mail, that my NetKAN requerst was merged, so it should work again.\u003C/p\u003E\n"},{"CreatedByName":"basila","CreatedById":49536,"CreatedDateTime":"2015-05-16T18:30:12Z","Content":"\n\u003Cp\u003ECould you add possibility to make MKS FlexOTube?\u003C/p\u003E\n"},{"CreatedByName":"ObiVanDamme","CreatedById":136329,"CreatedDateTime":"2015-05-16T20:11:11Z","Content":"\n\u003Cp\u003Ei am just going through all the parts for 1.0 rlease of ksp and mks. 0.6.1 will have those enabled\u003C/p\u003E\n"},{"CreatedByName":"johnsonwax","CreatedById":79077,"CreatedDateTime":"2015-05-16T20:57:10Z","Content":"\n\u003Cp\u003ETwo requests:\u003C/p\u003E\u003Cp\u003E1) An OKS version.\u003C/p\u003E\u003Cp\u003E2) Stockalike textures now that UKS has included those.\u003C/p\u003E\u003Cp\u003EMy suggestion on the parts it can produce is to look at the KIS formula and only make parts that are small enough for a kerbal to carry. So, under 1t and under a certain volume. That way the rules are easy for people to understand. Something like that.\u003C/p\u003E\n"},{"CreatedByName":"ObiVanDamme","CreatedById":136329,"CreatedDateTime":"2015-05-16T21:07:36Z","Content":"\n\u003Cp\u003EWhat do you mean by stock alike textures? I do not have any parts in the mod yet. the suggestion regarding the KIS limit is good. I will definitely take a look at that.\u003C/p\u003E\n"},{"CreatedByName":"DigitalProeliator","CreatedById":75677,"CreatedDateTime":"2015-05-17T06:23:51Z","Content":"\n\u003Cp\u003ELove the mod, something that really bridges the gap between KIS/KAS and ELP. Im not to crazy about installing MKS as Im already a bit high on the mod count but I re-purposed BahamutoD\u0027s 3d Printer as I thought it was fitting. About the limit I think you should still be able to make large parts, just you need to have a way to transport them. Ive already taken Docking Port Seniors, and empty tanks to orbit in containers to help expand the station. You really can BUILD with the new KIS system. I think it works just fine how it is now, only build a part if you have inventory space for it. That way you really can make stations and bases one part at a time on site.\u003C/p\u003E\n"},{"CreatedByName":"ObiVanDamme","CreatedById":136329,"CreatedDateTime":"2015-05-17T06:52:59Z","Content":"\n\u003Cp\u003Ei think i will limit the items by size and volume, but make it increasable by tech upgrades. the final node will remove the weight limit, and limit the workshop to the size of the largest inventory on the vessel\u003C/p\u003E\n"},{"CreatedByName":"DigitalProeliator","CreatedById":75677,"CreatedDateTime":"2015-05-17T16:47:59Z","Content":"\n\u003Cp\u003ESounds like a nice compromise. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Let the users learn as they go up the tech tree and do more advanced things. Question on your module, you have productivity as 0.1 and upkeep as 25 EL. How does this relate to the time it takes to use rocket parts? I saw that 1 ton of rocket parts is needed for 1 ton of parts but nothing else describing how things are used.\u003C/p\u003E\n"},{"CreatedByName":"ObiVanDamme","CreatedById":136329,"CreatedDateTime":"2015-05-17T18:29:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DigitalProeliator\u0022 data-cite=\u0022DigitalProeliator\u0022\u003E\u003Cdiv\u003ESounds like a nice compromise. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Let the users learn as they go up the tech tree and do more advanced things. Question on your module, you have productivity as 0.1 and upkeep as 25 EL. How does this relate to the time it takes to use rocket parts? I saw that 1 ton of rocket parts is needed for 1 ton of parts but nothing else describing how things are used.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWith all those insight questions I think I need to start a development thread in the other forum to answer all those questions and to post about ongoing work. So here is what\u0027s going on. The Productivity is the amount of resources, that the workshop can process per second, which means that after 10 seconds a single unit of RocketParts is processed. When the mass of the processed RocketParts equals the mass of the selected part, it will be finished and placed in the inventory. Thehigher the productivity, the faster the processing is. \u003C/p\u003E\u003Cp\u003EThe Upkeep is the amount of resources per second, that the workshop needs to function. The difference to Recipe Input is, that the mass of the processed upkeep recources does not count towards the mass goal of the selected part. This change was primarily done to integrate with MKS\u0027 Machinery and former SpareParts resources. What Iwant to achieve, is that I can specify those resources and consume them, but ignore the mass of those parts fortheproduction progress. \u003C/p\u003E\u003Cp\u003EI hope that explanation doeshelp. If anything is still unclear, please let me know.\u003C/p\u003E\n"},{"CreatedByName":"DigitalProeliator","CreatedById":75677,"CreatedDateTime":"2015-05-17T22:46:05Z","Content":"\n\u003Cp\u003EThanks that clears it up. I suspected it was close to that but didnt want figured asking would be better than spending time figuring it out by trial and error. Unless your thinking of adding a whole lot of stuff under the hood a dedicated thread might be much. Just some notes in the cfgs would help. Heck Ill post the notes I just made for anyone else.\u003C/p\u003E\u003Cp\u003EWorkshop module\u003C/p\u003E\u003Cp\u003E MODULE \u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E name = OseModuleWorkshop // Workshop module\u003C/p\u003E\u003Cp\u003E ProductivityFactor = 0.1 // Tons of Rocket parts used per second ,when part weight reached, part is created\u003C/p\u003E\u003Cp\u003E Upkeep = ElectricCharge,25 // Resources needed for workshop to function per second, does not go toward item creation\u003C/p\u003E\u003Cp\u003E MinimumCrew = 2 // Amount of crew need for workshop to function\u003C/p\u003E\u003Cp\u003E }\u003C/p\u003E\u003Cp\u003EMM template to make parts build-able.\u003C/p\u003E\u003Cp\u003E@PART[YOURPARTHERE]:HAS[!MODULE[OseModuleRecipe]]:FOR[Workshop]\u003C/p\u003E\u003Cp\u003E{\u003C/p\u003E\u003Cp\u003E MODULE\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E name = OseModuleRecipe\u003C/p\u003E\u003Cp\u003E }\u003C/p\u003E\u003Cp\u003E}\u003C/p\u003E\n"},{"CreatedByName":"ObiVanDamme","CreatedById":136329,"CreatedDateTime":"2015-05-18T07:01:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DigitalProeliator\u0022 data-cite=\u0022DigitalProeliator\u0022\u003E\u003Cdiv\u003EThanks that clears it up. I suspected it was close to that but didnt want figured asking would be better than spending time figuring it out by trial and error. Unless your thinking of adding a whole lot of stuff under the hood a dedicated thread might be much. Just some notes in the cfgs would help. Heck Ill post the notes I just made for anyone else.\u003Cp\u003EWorkshop module\u003C/p\u003E\u003Cp\u003E MODULE \u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E name = OseModuleWorkshop // Workshop module\u003C/p\u003E\u003Cp\u003E ProductivityFactor = 0.1 // Tons of Rocket parts used per second ,when part weight reached, part is created\u003C/p\u003E\u003Cp\u003E Upkeep = ElectricCharge,25 // Resources needed for workshop to function per second, does not go toward item creation\u003C/p\u003E\u003Cp\u003E MinimumCrew = 2 // Amount of crew need for workshop to function\u003C/p\u003E\u003Cp\u003E }\u003C/p\u003E\u003Cp\u003EMM template to make parts build-able.\u003C/p\u003E\u003Cp\u003E@PART[YOURPARTHERE]:HAS[!MODULE[OseModuleRecipe]]:FOR[Workshop]\u003C/p\u003E\u003Cp\u003E{\u003C/p\u003E\u003Cp\u003E MODULE\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E name = OseModuleRecipe\u003C/p\u003E\u003Cp\u003E }\u003C/p\u003E\u003Cp\u003E}\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJust one addition regarding the Recipe. It has a configurable Input field, that allows you to specify which resources you need to create said part. The default is \u0022RocketParts,1\u0022. Thats why it is not in any of the configs right now.\u003C/p\u003E\u003Cp\u003E@PART[YOURPARTHERE]:HAS[!MODULE[OseModuleRecipe]]:FOR[Workshop]\u003C/p\u003E\u003Cp\u003E{\u003C/p\u003E\u003Cp\u003EMODULE\u003C/p\u003E\u003Cp\u003E{\u003C/p\u003E\u003Cp\u003Ename = OseModuleRecipe\u003C/p\u003E\u003Cp\u003EInput = MechanicalParts,1,StructuralParts,3 // With this config the workshop will use 1/4 MechanicalParts and 3/4 StructuralParts each tick. \u003C/p\u003E\u003Cp\u003E}\u003C/p\u003E\u003Cp\u003E}\u003C/p\u003E\n"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2015-05-18T08:30:07Z","Content":"\n\u003Cp\u003EHeya! \u003C/p\u003E\u003Cp\u003EHopping back in - not sure if you noticed that after 1.0 a production layer was removed (so structual parts/etc. are out). Not sure if you wanted to plug those back in or not (the path to rocketparts is shorter based on user feedback).\u003C/p\u003E\u003Cp\u003EKeep up the good work \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"ObiVanDamme","CreatedById":136329,"CreatedDateTime":"2015-05-18T08:57:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RoverDude\u0022 data-cite=\u0022RoverDude\u0022\u003E\u003Cdiv\u003EHeya! \u003Cp\u003EHopping back in - not sure if you noticed that after 1.0 a production layer was removed (so structual parts/etc. are out). Not sure if you wanted to plug those back in or not (the path to rocketparts is shorter based on user feedback).\u003C/p\u003E\u003Cp\u003EKeep up the good work \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThank you for the Info, I did not notice that. In that case my example above is not the best, but it demonstrates the Idea.\u003C/p\u003E\n"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2015-05-18T09:11:56Z","Content":"\n\u003Cp\u003EOk making sure \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003ECompletely unrelated side note - I have some thoughts regarding rocketparts, construction, etc. - when I get stuff more firm (and dig out of the current backlog of work I have) we should talk. This mod is pretty awesome.\u003C/p\u003E\n"},{"CreatedByName":"ObiVanDamme","CreatedById":136329,"CreatedDateTime":"2015-05-18T11:32:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RoverDude\u0022 data-cite=\u0022RoverDude\u0022\u003E\u003Cdiv\u003EOk making sure \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003Cp\u003ECompletely unrelated side note - I have some thoughts regarding rocketparts, construction, etc. - when I get stuff more firm (and dig out of the current backlog of work I have) we should talk. This mod is pretty awesome.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThank you Sir. I am very pleased to here that. Just send me a message when you are done. I can\u0027t wait to here what you have in mind.\u003C/p\u003E\n"},{"CreatedByName":"Skrypter","CreatedById":105469,"CreatedDateTime":"2015-05-19T02:09:41Z","Content":"\n\u003Cp\u003ESince we switched over to the default MKS module. How about a orbital version too? (cylinder vs rectangular model)\u003C/p\u003E\n"},{"CreatedByName":"ObiVanDamme","CreatedById":136329,"CreatedDateTime":"2015-05-19T05:14:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Skrypter\u0022 data-cite=\u0022Skrypter\u0022\u003E\u003Cdiv\u003ESince we switched over to the default MKS module. How about a orbital version too? (cylinder vs rectangular model)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat was already requested and I will take a look at that.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-19T11:03:32Z\u0022 title=\u002205/19/2015 11:03  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 19, 2015\u003C/time\u003E by ObiVanDamme\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ObiVanDamme","CreatedById":136329,"CreatedDateTime":"2015-05-20T07:53:50Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-family:\u0027arial black\u0027;\u0022\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cspan style=\u0022color:#006400;\u0022\u003EVersion 0.7.0 is available with a complete GUI rework. I hope you like it\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ECompatibility with KIS 1.1.4\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EUpdated CRP to 0.4.2\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EComplete rework of the Workshop Build Menu\u003Cbr\u003E\u003Cul\u003E\u003Cli\u003EThumbnails of Items\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EDisplay number of RocketParts needed\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EProgressbar\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EFilter for Category \u0026amp; Modules (currently ModuleKISItem only)\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E[*]Added OseModuleRecipe to \u003Cem\u003EALL\u003C/em\u003E parts\u003C/p\u003E\u003Cp\u003E[*]The part list in the build menu only contains parts with a volume smaller than the largest inventory on the vessel\u003C/p\u003E\u003Cp\u003E[*]Added OKS version of the Workshop\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-20T12:57:09Z\u0022 title=\u002205/20/2015 12:57  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 20, 2015\u003C/time\u003E by ObiVanDamme\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ObiVanDamme","CreatedById":136329,"CreatedDateTime":"2015-05-22T09:58:00Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-family:\u0027arial black\u0027;\u0022\u003E\u003Cspan style=\u0022color:#006400;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EVersion 0.7.2 introduces tech tree progression\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EFixed display of item recipe in build menu\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAdded tech tree upgrades for maximum volume of craftable parts\u003Cbr\u003E\u003Cul\u003E\u003Cli\u003EAdvanced Construction unlocks 300 liters (Kerbal Inventory)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ESpecialized Constructions unlocks 1000 liters (SC-62 container)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAdvanced metalworks unlocks 20.000 liters (IMC-250 container)\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"Smurfalot","CreatedById":72587,"CreatedDateTime":"2015-05-31T18:58:49Z","Content":"\n\u003Cp\u003EWow, this is a really interesting mod concept. I would like to give it a try, but can you explain how to make the rocket parts on my station? I have never been clear on that part of the process.\u003C/p\u003E\n"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2015-05-31T21:56:21Z","Content":"\n\u003Cp\u003EI\u0027d expect RocketParts would follow the usual MKS production chain (Metals \u002B Polymers \u002B Chemicals =\u0026gt; Fabrication Module = RocketParts)\u003C/p\u003E\n"}]}