{"TopicId":100764,"ForumId":24,"TopicTitle":"Hello - should I recover my orbital station?","CreatedByName":"Ceq Lysander","CreatedById":138703,"CreatedDateTime":"2015-02-26T07:33:31Z","PageNum":1,"Articles":[{"CreatedByName":"Ceq Lysander","CreatedById":138703,"CreatedDateTime":"2015-02-26T07:33:31Z","Content":"Hello fellow Kerbals!\n\nI\u0027m doing the career mode and have just managed to unlock the R\u0026D upgrade. \n\nDuring an earlier mission, I had to launch a Minmus orbital station. I achieved this, but now have 5 rookie Kerbals just hanging out. There\u0027s quite a bit of fuel left and I\u0027m pretty sure I could return to Kerbal (or at least get it to a parking orbit). However, it\u0027s reasonably large (2x mobile labs), and has no chutes attached. It does however have a docking port.\n\nCan scientists inside mobile labs EVA?\n\nIdea 1: Return the station to kerbal orbit, fly a ship with a docking port which has several parachutes attached and dock. use the station to decay the orbit, switch to the ship mid-way down and active chutes.\n\nIdea 2: Fly up to Minmus, EVA all kerbals into docked transport ship and return leaving the station around Minmus with it\u0027s fuel and labs for later missions to Minmus.\n\nThoughts/other ideas welcomed."},{"CreatedByName":"Yukon0009","CreatedById":109376,"CreatedDateTime":"2015-02-26T07:42:26Z","Content":"Yes kerbals can eva from the labs, and welcome to the forums!"},{"CreatedByName":"Deddly","CreatedById":62955,"CreatedDateTime":"2015-02-26T09:24:49Z","Content":"Hi Ceq! \n\nI like your idea number 2. It seems such a waste to have sent it all the way out there only to destroy it. But since you can dock transport to your orbital station, did you know you can transfer kerbals through the docking port, without them having to to EVA? In the wiki, there are some instructions how to do it -[look down to the bottom of this page.](http://wiki.kerbalspaceprogram.com/wiki/Crew#Crew_transfer)"},{"CreatedByName":"Lhathron the Elf","CreatedById":118706,"CreatedDateTime":"2015-02-26T11:07:07Z","Content":"Welcome! Idea 2 seems like the most beneficial way of doing things. You might have later missions to Minmus and realize you do really need that station, or maybe you *won\u0027t* have it there and you\u0027ll wish you had! I would just leave it at Minmus. \n\nAlthough, Idea 1 would be the coolest-looking. ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)"},{"CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2015-02-26T15:07:34Z","Content":"Welcome aboard! \n\nThere are advantages to both situations, but indeed leaving the station there to be salvaged by future missions seems the most beneficial solution long-term. Unless you really need the funds, in which case recovery could put a not-insignificant chunk of change back in your pocket.\n\nOh, and for future reference, one lab is enough for cleansing and boosting science ![:wink:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)"},{"CreatedByName":"Ceq Lysander","CreatedById":138703,"CreatedDateTime":"2015-02-26T23:05:38Z","Content":"Thanks all for the tips and suggestions.\n\n\u003E \n\u003E Deddly]\n\u003E did you know you can transfer kerbals through the docking port, without them having to to EVA?\n\nI do now. I\u0027ve never done a docking before - off to the in game tutorial I think before attempting on my career.\n\n\u003E \n\u003E Oh, and for future reference, one lab is enough for cleansing and boosting science ![:wink:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)\n\nYes I just needed room for 5 for the mission objective. In hindsight It\u0027s probably better to have used a second 2 seat command pod for weight, but I think the two lab\u0027s looked cooler at the time.\n\nOne final thing of note, the station\u0027s orbit around Minmus is at almost 45 degrees - it is mostly circular though. For future usability if I went with keeping it there (and for docking?) I think i\u0027ll move it to an equatorial orbit."}]}