{"TopicId":102416,"ForumId":24,"TopicTitle":"Basic mod information","CreatedByName":"amigo240480","CreatedById":139835,"CreatedDateTime":"2015-03-21T19:57:39Z","PageNum":1,"Articles":[{"CreatedByName":"amigo240480","CreatedById":139835,"CreatedDateTime":"2015-03-21T19:57:39Z","Content":"Hello very recently got this game on steam , love it ...my question \n\nCan I have a step by step guide for mod installation I need to know what version of KSP I have and some good simple suggestions for good mods.\n\nfor example I would like the B9 aero space pack. \n\nI am not a total beginner to modding I have already mad a back up of my game data folder, and keeping that safely, how ever I don,t know if I can just start adding these mods with out patches and plug ins. \n\nSome advice to get the B-9 aero space mod and perhaps the world war k mods would be fantastic\n\nregards"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2015-03-22T02:52:54Z","Content":"Welcome to the forums!\n\nI suggest you use CKAN. It\u0027s a great tool for just this sort of thing, and should make installing addons quite easy. [Here\u0027s the link to the thread](https://forum.kerbalspaceprogram.com/threads/100067-The-Comprehensive-Kerbal-Archive-Network-%28CKAN%29-Package-Manager-v1-6-5-6-Mar-2015). Download the CKAN client and run it, point it at your KSP folder, and then find B9 Aerospace in the list of mods and click to install it. Should be pretty simple. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nWhat\u0027s nice about CKAN is it won\u0027t overwrite any game files, so you don\u0027t have to worry about making a backup. Even so, KSP addons don\u0027t generally require making backups anyway, since even mods that replace stock elements do so via new files."},{"CreatedByName":"amigo240480","CreatedById":139835,"CreatedDateTime":"2015-03-22T02:58:42Z","Content":"Ok i will give this a try shortly and respond in due course thanks"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2015-03-22T03:11:02Z","Content":"See Chapter 2 of \u0027Induction To Construction\u0027 :-)"}]}