{"TopicId":105163,"ForumId":24,"TopicTitle":"In time for 1.0. Took me long enough.","CreatedByName":"Cpt.Daniels","CreatedById":141812,"CreatedDateTime":"2015-04-27T15:12:59Z","PageNum":1,"Articles":[{"CreatedByName":"Cpt.Daniels","CreatedById":141812,"CreatedDateTime":"2015-04-27T15:12:59Z","Content":"\n\u003Cp\u003EHello all,\u003C/p\u003E\u003Cp\u003EI\u0027ve been here for a while, lurking on the threads since .20. \u003C/p\u003E\u003Cp\u003EI love all things space of course and since I found KSP well my time has been well used making rockets and crashing space planes into the tower...or well anywhere really. \u003C/p\u003E\u003Cp\u003EI\u0027ve seen great mods, great moderators, epic videos and learned a lot. So I\u0027ll thank you all for that, teaching me how to land on the mun, jeeze that was nerve wracking. By far this is the best community I\u0027ve ever seen and and as such I\u0027m super happy to be here finally. Its been a long time since I\u0027ve posted in any forum but this one, well I don\u0027t even need to say why, its obvious. \u003C/p\u003E\u003Cp\u003ESo onwards to HYPE and 1.0!!\u003C/p\u003E\u003Cp\u003EL.G\u003C/p\u003E\n"},{"CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2015-04-27T15:21:08Z","Content":"\n\u003Cp\u003EWelcome aboard! Munar landings sure can take the mickey out of you to begin with, but in no time they become fun to do.\u003C/p\u003E\n"},{"CreatedByName":"EtherDragon","CreatedById":82405,"CreatedDateTime":"2015-04-27T15:27:41Z","Content":"\n\u003Cp\u003EOrbital Rendezvous and Mun Landings are two of the most difficult things you can do in KSP, IMO. Once you get those down, the solar system is your oyster!\u003C/p\u003E\n"},{"CreatedByName":"Cpt.Daniels","CreatedById":141812,"CreatedDateTime":"2015-04-27T15:40:36Z","Content":"\n\u003Cp\u003EI mine that stuff down-Karbonite!! honestly docking is the hardest thing but its also the most fun. Making space stations bit by bit is rewarding, especially if it is a MIR recreation.\u003C/p\u003E\n"}]}