{"TopicId":114159,"ForumId":24,"TopicTitle":"Another Hello","CreatedByName":"JetJaguar","CreatedById":146965,"CreatedDateTime":"2015-06-25T19:11:11Z","PageNum":1,"Articles":[{"CreatedByName":"JetJaguar","CreatedById":146965,"CreatedDateTime":"2015-06-25T19:11:11Z","Content":"I\u0027ve been lurking for awhile and thought it was about time I sign up and say hi. I discovered KSP three days before the release of 1.0. I\u0027m an aerospace engineer IRL, though my professional experience is mainly in aviation rather than spaceflight.\n\nRight now I\u0027m mainly playing stock KSP, the only mods I have at the moment are Texture Replacer and Kerbal Alarm Clock. In my career game so far I\u0027ve managed successful manned missions to Mun and Minmus. I may look into things like Kerbal Engineer to take a more calculating approach, now that I\u0027m aiming for Duna and other destinations beyond the Kerbin system."},{"CreatedByName":"Starhawk","CreatedById":131400,"CreatedDateTime":"2015-06-25T19:46:09Z","Content":"Welcome HotJupiter, and another hello to you!\n\nI recommend Kerbal Engineer. With the delta-v readouts and the delta-v maps around, you can know ahead of time if you have enough for the mission you are planning.\n\nHappy landings!"},{"CreatedByName":"JetJaguar","CreatedById":146965,"CreatedDateTime":"2015-06-25T19:55:19Z","Content":"That\u0027s basically all I\u0027m looking for, something to calculate the total delta-v of the launch vehicle in the VAB to make sure it can complete the mission."},{"CreatedByName":"Crocket","CreatedById":146960,"CreatedDateTime":"2015-06-25T23:14:26Z","Content":"A mod like that sounds nice. I haven\u0027t downloaded any mods yet, as I just downloaded it on this computer."},{"CreatedByName":"Starhawk","CreatedById":131400,"CreatedDateTime":"2015-06-26T01:09:56Z","Content":"Here\u0027s a [link to the Kerbal Engineer Redux thread](https://forum.kerbalspaceprogram.com/threads/18230). The download link is in the first post.\n\nHappy landings!"},{"CreatedByName":"Crocket","CreatedById":146960,"CreatedDateTime":"2015-06-26T03:28:38Z","Content":"Thanks, Star!"},{"CreatedByName":"zekes","CreatedById":23840,"CreatedDateTime":"2015-06-26T03:56:19Z","Content":"Hello, godspeed kerbal, and don\u0027t blow up!"},{"CreatedByName":"RAINCRAFTER","CreatedById":127524,"CreatedDateTime":"2015-06-26T09:17:15Z","Content":"Hello, HotJupiter! I am only going interplanetary just now too!"},{"CreatedByName":"JetJaguar","CreatedById":146965,"CreatedDateTime":"2015-06-26T11:52:32Z","Content":"Thanks for the link. Besides Kerbal Engineer Redux, I also installed Protractor and Transfer Window Planner. Between the three, I should be able to plan a mission and build a launch vehicle to spec. I also downloaded AntennaRange to add some realism, although it means losing contact with the sat with the whip antenna I diverted into solar orbit to fill a \u0022Fly by the Sun\u0022 contract (oops!)."}]}