{"TopicId":116520,"ForumId":24,"TopicTitle":"New member to the forum!","CreatedByName":"kengreen51","CreatedById":145804,"CreatedDateTime":"2015-07-21T21:24:12Z","PageNum":1,"Articles":[{"CreatedByName":"kengreen51","CreatedById":145804,"CreatedDateTime":"2015-07-21T21:24:12Z","Content":"Hi, my name is Ken and I\u0027m a Kerbaholic.\n\nSeriously though. My name is Ken Green I\u0027m 30 years old and I live in Sacramento California with my wife and two fur children. I have been absolutely fascinated with all things space for years now. I used to spend hours laying in the driveway of my parents house when I was younger, just looking at the stars. At the time there were no such things as private aerospace companies and Americas space program was all but non existent (publicly anyway). The privatization of space in the last few years have awoken my passion for all things space once again. so much so that I have begun working part time so that I can pursue a mechanical/aerospace engineering degree. While I may have just begun the long process of achieving my goals, I truly believe that for me there is nothing else worth doing. \n\nI found Kerbal Space Program a couple years ago when it was still in beta I played it a few times but didn\u0027t take it seriously. I have only just begun to play the game on a more serious level. \n\nAnyhow, I\u0027ts a pleasure to be part of the group. I look forward to great debate and conversation around our common interest."},{"CreatedByName":"Starhawk","CreatedById":131400,"CreatedDateTime":"2015-07-21T22:07:44Z","Content":"Hi kengreen51, and welcome to the forums!\n\nI have also had a passion for space since I was a young man, and there are many here who share that sentiment.\n\nI\u0027m sure you will enjoy our diverse and very helpful community.\n\nHappy landings!"},{"CreatedByName":"zekes","CreatedById":23840,"CreatedDateTime":"2015-07-21T22:10:01Z","Content":"are you Ken \u0022#bada55\u0022 Green? XD \n\nWelcome, it\u0027s more than just a game to us, it\u0027s a lifestyle."}]}