{"TopicId":118238,"ForumId":24,"TopicTitle":"Kerbal goes poof.. and I\u0027m hooked!","CreatedByName":"jimmyhat","CreatedById":149619,"CreatedDateTime":"2015-08-11T22:13:12Z","PageNum":1,"Articles":[{"CreatedByName":"jimmyhat","CreatedById":149619,"CreatedDateTime":"2015-08-11T22:13:12Z","Content":"\n\u003Cp\u003EGreeting from a newbie! Here\u0027s my \u0022hooked\u0022 story...\u003C/p\u003E\u003Cp\u003ESo I have the demo, and I\u0027ve made it to Mun... but I didnt realize I actually needed to attach landing gear to use it, and my engine broke off on landing.\u003C/p\u003E\u003Cp\u003ENo worries... launch rescue mission... Finally made it back (with landing gear) and realized that command pods only hold one =( \u003C/p\u003E\u003Cp\u003EThought hey, let Barny just hang on to the ladder, and let\u0027s go back home! Well, that actually worked to about 3000m up when I realized he was gone. Sure enough, he was plummeting back to Mun. As I watched him go \u0022poof\u0022 into a cloud of dust I actually felt a tiny bit sad, and knew I need to buy this!\u003C/p\u003E\u003Cp\u003EGreat game!\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2015-08-12T03:38:57Z","Content":"\n\u003Cp\u003EThis a pretty typical new player experience. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Though actually, you don\u0027t absolutely need landing legs, if you are careful.\u003C/p\u003E\n"},{"CreatedByName":"Goddess Bhavani","CreatedById":14001,"CreatedDateTime":"2015-08-12T15:15:02Z","Content":"\n\u003Cp\u003EHahaha hang on to the ladder sort of rescues are best! \u003C/p\u003E\u003Cp\u003EYou can actually succeed in that if you have those little command chairs bolted to the outside of the craft. Or if you\u0027re devious, try to shut the kerbal inside a service bay (they do fit) and hope he doesn\u0027t glitch out. Or you can make a lander with a base that\u0027s fatter than the top, hopefully that gives the kerbal a place to stand while you rocket away.\u003C/p\u003E\n"}]}