{"TopicId":119758,"ForumId":24,"TopicTitle":"Long time user willing to admit he has a problem","CreatedByName":"SovietBear","CreatedById":150483,"CreatedDateTime":"2015-08-30T18:29:02Z","PageNum":1,"Articles":[{"CreatedByName":"SovietBear","CreatedById":150483,"CreatedDateTime":"2015-08-30T18:29:02Z","Content":"\n\u003Cp\u003EHello everyone, SovietBear here. I\u0027ve been playing KSP off and on for the last two years, but I think it\u0027s high time I join a support group to help me through this. I\u0027ve mostly played in sandbox mode, but once had the ambition to play career, making it to mun \u0026amp; minimas before reverting to my natural tendencies of thinking of new ways to harm poor Jebediah. \u003C/p\u003E\u003Cp\u003EI\u0027m probably like most KSP players, I have a high interest in both physics and video games. Physics is my true passion, I even recently got a B.S. in Physics, and software/video games is my day job as I\u0027ve been a software engineer (mostly Java) for the last 4 years. \u003C/p\u003E\u003Cp\u003EWith the advent of KSP coming out of beta and with my quota of free time recently increasing dramatically since I finished school, I\u0027ve decided to continue my complicated and sometimes violent relationship with Jebediah. I look forward to sharing those experiences with all of you and learning from you all. Thanks.\u003C/p\u003E\u003Cp\u003ETo the mun!\u003C/p\u003E\u003Cp\u003ESovietBear\u003C/p\u003E\n"},{"CreatedByName":"Starhawk","CreatedById":131400,"CreatedDateTime":"2015-08-30T19:30:41Z","Content":"\n\u003Cp\u003EHello SovietBear, and welcome to the forums!\u003C/p\u003E\u003Cp\u003EA fine support group you\u0027ll find here that is both informative and helpful in so many ways.\u003C/p\u003E\u003Cp\u003EGlad to have you aboard.\u003C/p\u003E\u003Cp\u003EHappy landings!\u003C/p\u003E\n"},{"CreatedByName":"SovietBear","CreatedById":150483,"CreatedDateTime":"2015-08-31T02:49:14Z","Content":"\n\u003Cp\u003EThanks Starhawk. I look forward to it.\u003C/p\u003E\n"},{"CreatedByName":"ComradeWolfe","CreatedById":142254,"CreatedDateTime":"2015-08-31T16:43:58Z","Content":"\n\u003Cp\u003EBased on your username, I think we\u0027ll be getting along just fine... :-P\u003C/p\u003E\u003Cp\u003EWelcome to the forums!\u003C/p\u003E\n"},{"CreatedByName":"SovietBear","CreatedById":150483,"CreatedDateTime":"2015-09-01T00:37:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ComradeWolfe\u0022 data-cite=\u0022ComradeWolfe\u0022\u003E\u003Cdiv\u003EBased on your username, I think we\u0027ll be getting along just fine... :-P\u003Cp\u003EWelcome to the forums!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHaha nice, just wait until they let me put my Avatar in.\u003C/p\u003E\n"},{"CreatedByName":"ComradeWolfe","CreatedById":142254,"CreatedDateTime":"2015-09-01T02:22:37Z","Content":"\n\u003Cp\u003EPffft... Where\u0027s the funny costume or the guns? (Kidding of course.)\u003C/p\u003E\n"}]}