{"TopicId":125452,"ForumId":24,"TopicTitle":"Demo mode - stages, help with","CreatedByName":"Msquare","CreatedById":153583,"CreatedDateTime":"2015-11-14T20:41:11Z","PageNum":1,"Articles":[{"CreatedByName":"Msquare","CreatedById":153583,"CreatedDateTime":"2015-11-14T20:41:11Z","Content":"\n\u003Cp\u003EHI,\u003C/p\u003E\u003Cp\u003ESo I am playing the Demo (try-before-buy), getting a feel for the game mechanics, and just cant work out handling stages properly. I\u0027m doing the Career mode, and have managed to get a small solid booster rocket up, figuring the science research and gotten a few more modules. Phew.\u003C/p\u003E\u003Cp\u003ENow I am trying stages. I just cant seem to control them. I have grid with 3 solid boosters, seperator, grid with goo science, seperator module with arial and parachute.\u003C/p\u003E\u003Cp\u003ESo what button pushing sequence would make it easy to launch, seperate, do the science, seperate, deploy parachute. So far I have manged by mouseclicking on the rocket parts (tricky if its wobbling) and using the popupmenu. That seems all wrong. Hammering the space bar seems to do stages \u0022sometimes\u0022, at least I have not figured excatly when it does something.\u003C/p\u003E\u003Cp\u003EMsquare, \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Starhawk","CreatedById":131400,"CreatedDateTime":"2015-11-14T20:55:43Z","Content":"\n\u003Cp\u003EHello Msquare, and welcome to the forums!\u003C/p\u003E\u003Cp\u003EThe space bar is the staging button. Depending on how the stages are configured during vehicle assembly, each press of the space bar may only do a single action.\u003C/p\u003E\u003Cp\u003EFor example, you might press space to activate a decoupler, and then press space again to activate the engine.\u003C/p\u003E\u003Cp\u003EIn the complete game you can configure action groups allowing you to activate science experiments or other parts by pressing a number key. Not sure if that\u0027s in the demo.\u003C/p\u003E\u003Cp\u003EHappy landings!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-14T22:35:28Z\u0022 title=\u002211/14/2015 10:35  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 14, 2015\u003C/time\u003E by Starhawk\u003C/strong\u003E\n\u003Cbr\u003Esp\n\u003C/span\u003E\n"},{"CreatedByName":"neistridlar","CreatedById":20296,"CreatedDateTime":"2015-11-14T22:30:48Z","Content":"\n\u003Cp\u003EWhat Starhwak said is good advice. It might be a little easier to understand what the staging is doing if you look at the staging icons. They are on the Right when you build your craft, and on the left when you fly. The bottom most is the currently active parts, and the next up from the bottom will be triggered next. By hovering over a part or icon the corresponding icon/part will light up so you can easily see which one it is. Also you can add, delete and change the staging at any time by clicking on the plus and minus or dragging parts around.\u003C/p\u003E\n"}]}