{"TopicId":126476,"ForumId":24,"TopicTitle":"A Question on Orbital Rendezvous","CreatedByName":"LordKael","CreatedById":154046,"CreatedDateTime":"2015-11-25T23:12:06Z","PageNum":1,"Articles":[{"CreatedByName":"LordKael","CreatedById":154046,"CreatedDateTime":"2015-11-25T23:12:06Z","Content":"\nFirst Post to these forums, but have been playing for a few months now.\u003Cbr\u003E\n\u003Cbr\u003E\nI have viewed/read a number of tutorials on the process of an orbital rendezvous, and still cannot manage without MechJeb. Originally, I had planned to simply wait until it was updated to be compatible with !.0.5, but I really would like to continue work on my Kerbin Orbital Station. If anybody has a tip for performing an orbital rendezvous in stock KSP, I would really appreciate it. \u003Cbr\u003E\n\u003Cbr\u003E\nI understand all of the principles behind how it works, and can do an interplanetary transfer no problem, but with such sensitive orbits in LKO, I am struggling.\u003Cbr\u003E\n\u003Cbr\u003E\nThanks!\n"},{"CreatedByName":"Starhawk","CreatedById":131400,"CreatedDateTime":"2015-11-26T00:47:18Z","Content":"\nHello LordKael, and welcome to the forum!\u003Cbr\u003E\n\u003Cbr\u003E\nWe also have several tutorials on orbital rendezvous here in the [URL=\u0022http://forum.kerbalspaceprogram.com/forums/54-Tutorials\u0022]Tutorials Section[/URL] of the forum. There are also multiple tutorials on the [URL=\u0022http://wiki.kerbalspaceprogram.com/wiki/Main_Page\u0022]KSP Wiki[/URL].\u003Cbr\u003E\n\u003Cbr\u003E\nIf you can\u0026#39;t seem to find the info you need, try starting a thread to ask a question in the [URL=\u0022http://forum.kerbalspaceprogram.com/forums/15-Gameplay-Questions-and-Tutorials\u0022]Gameplay Questions[/URL] section.\u003Cbr\u003E\n\u003Cbr\u003E\nHappy landings!\n"},{"CreatedByName":"Shark4558","CreatedById":147537,"CreatedDateTime":"2015-11-26T00:50:34Z","Content":"\nhello lordKael,welcome to the forums!.\u003Cbr\u003E\n\u003Cbr\u003E\na tip i have is ver case sensitive,firstly.lets say that you space station part is In front of the space station.you should make a maneuver node that goes a little beyond of the space station orbit.at highter orbits less speed (every ms x2 total distance = slower than lower orbits).try to see if there the distance between both parts is something about 2 km....(im assuming you know that you need to set as \u0022target\u0022 the vessel you want to rendezvous)\u003Cbr\u003E\nif the situation is the inverse (space station part behind and space station forward).you could try to send the part to a lower orbit momentarily.....\u003Cbr\u003E\n\u003Cbr\u003E\ni hope i help :D\n"},{"CreatedByName":"Tourist","CreatedById":143403,"CreatedDateTime":"2015-11-26T01:38:42Z","Content":"\nWelcome to the forums LordKael, you will never find a more wretched hive of scum and villainy... uh, I mean, you will never find a more helpful community. \u003Cbr\u003E\n\u003Cbr\u003E\n\u003Cbr\u003E\nOrbital rendezvous is difficult, so don\u0026#39;t feel bad, NASA had trouble with it at first too. I\u0026#39;m not clear from your post, what part you are finding difficult. Here is a brief run down of how I see it works in as non technical terms as possible. I\u0026#39;m not sure how long you\u0026#39;ve been playing, so If I\u0026#39;m stating the insultingly obvious, then I apologize. \u003Cbr\u003E\n\u003Cbr\u003E\n\u003Cbr\u003E\nYou probably want to start by targeting the vessel with which you wish to rendezvous.\u003Cbr\u003E\n\u003Cbr\u003E\n\u003Cbr\u003E\nFirst step, timing the launch. Very important if you don\u0026#39;t want to be warping for ages, which if your in a low orbit is a terrible pain. Ideally you want to launch so you will end up in a reasonably close orbit to begin with. As a rule of thumb I launch when the target is over the ocean to the West of the KSC, or sometimes right where the desert continent to the west meets that ocean.\u003Cbr\u003E\n\u003Cbr\u003E\n\u003Cbr\u003E\nStep two. Plane alignment. Fancy words for making orbits line up when looking at them side on. To do this you burn at the point where the two orbits cross. In slightly more technical terms burn at either the Ascending Node, or the Descending node, towards the normal or anti-normal marks on your navball (pink triangle, upside-down pink triangle with spikes). These nodes will indicate how many degrees you are out... so you do not need to eyeball them. Burn until they are at zero. If you burn near them and it gets larger, your burning at the wrong marker. \u003Cbr\u003E\n\u003Cbr\u003E\nStep three. Catch up with the target. If you haven\u0026#39;t already done so make its so your orbit crosses the orbit of the target. This should bring marks showing your position when the orbits cross, and the targets position at the time you cross the orbit, if you cursor over the mark corresponding to your position it should give you a separation distance. As you orbit around, these marks should get closer together. If so, great. Ultimately you want to to get to a separation of less than a Km ideally, but a couple of KMs is not fatal (just annoying). If the marks are not getting closer together, or not getting closer fast enough you need to make you orbit smaller, so that you go around Kerbin faster. You burn retrograde to do that. If you want the target .... to catch up with you, you do the opposite, burn prograde, and make your orbit larger (take the outside track, if you will.)\u003Cbr\u003E\n\u003Cbr\u003E\n\u003Cbr\u003E\nStep Four. Excellent, you come within 1 km of your target. What next? We want to kill your speed relative to the target. Your Navball should have changed from showing your orbital speed to your speed relative to the target. However if it doesn\u0026#39;t say \u0022target\u0022 above your speed, click on it till it does so. Next point at the retrograde marker on your navball (the yellow circle with a cross though it and spikes) until your speed is zero. Next burn towards your target prograde marker (purple broken circle with a dot in the centre.) as you do this the yellow prograde marker should move towards the target prograde marker. You should now be moving towards the target, but be careful of your speed. You may need to burn retrograde again to kill your speed. Rinse and repeat until rendezvous achieved.\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-26T02:00:37Z\u0022 title=\u002211/26/2015 02:00  AM\u0022 data-short=\u00228 yr\u0022\u003ENovember 26, 2015\u003C/time\u003E by Tourist\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ten Key","CreatedById":123319,"CreatedDateTime":"2015-11-26T17:21:44Z","Content":"\nTwo immensely useful things about maneuver nodes that the game doesn\u0026#39;t tell you. . .\u003Cbr\u003E\n\u003Cbr\u003E\nFirst, you can move nodes without having to recreate them. If you left click and hold on the center of the node while it\u0026#39;s \u0022open\u0022, you can drag it around on your orbit. \u003Cbr\u003E\n\u003Cbr\u003E\nSecond, if you right click on the center of the node while it\u0026#39;s open, you will get an additional two options you can select. These are the plus/minus orbit buttons, and you can use them to add (or subtract) additional wait time on the burn. If you\u0026#39;re in a position where you need to wait several orbits before performing the rendezvous burn, these buttons will let you set the maneuver up in advance.\u003Cbr\u003E\n\u003Cbr\u003E\nThese two things, particularly the first one, made rendezvous much easier for me.\n"},{"CreatedByName":"LordKael","CreatedById":154046,"CreatedDateTime":"2015-11-26T21:53:59Z","Content":"\nThank you everybody!\u003Cbr\u003E\n\u003Cbr\u003E\nIn response to Tourist: I really appreciated the in depth nature of your response. Yes, I knew a good amount of what you said, but having everything in one place made things flow much more seamlessly in my head. \u003Cbr\u003E\n\u003Cbr\u003E\nIn response to Ten Key, I never knew how to get the orbit offset feature, so thank you!\n"},{"CreatedByName":"Plusck","CreatedById":153264,"CreatedDateTime":"2015-11-27T03:14:40Z","Content":"\nFor me, orbital rendezvous became easier when I finally twigged how to push the prograde/retrograde markers around.\u003Cbr\u003E\nBasically, if you burn when pointed near a retrograde marker, the marker on the navball will move away from the direction of thrust. If you burn near the prograde marker, it will move towards the direction of thrust. Of course this works for landing and orbits too, but it\u0026#39;s with targets that you have the time to really fine-tune it.\u003Cbr\u003E\n\u003Cbr\u003E\nWith that, you just need to get within a few tens of km of your target and then push the markers around until target prograde is centred directly on your purple target. The further away you are and the faster you try to close, the more fuel you will use correcting your course but you\u0026#39;ll get there eventually.\u003Cbr\u003E\n\u003Cbr\u003E\n\u003Cbr\u003E\nAnd once you\u0026#39;re there - cheat to dock! Align each vessel to the other as a target, but each time you switch vessels warp forward for a millisecond to stop things spinning.\n"}]}