{"TopicId":13317,"ForumId":24,"TopicTitle":"Greetings","CreatedByName":"OsirisReborn","CreatedById":30349,"CreatedDateTime":"2012-06-27T11:02:20Z","PageNum":1,"Articles":[{"CreatedByName":"OsirisReborn","CreatedById":30349,"CreatedDateTime":"2012-06-27T11:02:20Z","Content":"\n\u003Cp\u003EHi Everyone\u003C/p\u003E\u003Cp\u003EWell I\\\u0027ve finally managed to get account (for some reason signing up with my hotmail address would just send a \\\u0027Account requires activation by an admin\\\u0027 message and then gets deleted the next day, finally got around it with a different address which then didn\\\u0027t require activation?!?)\u003C/p\u003E\u003Cp\u003EJust a quick question: I\\\u0027ve been designing a kind of \\\u0027Ultimate KSP\\\u0027 (on paper) based on my own thoughts with inspiration from the various mods I\\\u0027ve seen here, mostly as kind of my fantasy of what this game could be. I\\\u0027ve got all the details thought out and wanted to post it up just to discuss with like-minded people (none of my friends are really into KSP...yet). It\\\u0027s not really suggestions, or a feature request as a lot is covered by mods, planned features etc, just me wanting to ramble with people who will \\\u0027get it\\\u0027 - can anyone suggest which forum would be best to start such a rant?\u003C/p\u003E\u003Cp\u003EAnyway, i\\\u0027m really looking forward to where this game is going, particularly the effort of the modders!\u003C/p\u003E\u003Cp\u003EOsiris\u003C/p\u003E\n"},{"CreatedByName":"Capt\u0026#039;n Skunky","CreatedById":1261,"CreatedDateTime":"2012-06-27T15:46:32Z","Content":"\n\u003Cp\u003EWelcome to the KSP Forums!\u003C/p\u003E\u003Cp\u003ESorry you had trouble signing up for a forum account. The entries don\\\u0027t get cleared for 7 days, so I\\\u0027m not sure what could of happened.\u003C/p\u003E\u003Cp\u003EHappy Launching!\u003C/p\u003E\u003Cp\u003EArrr!\u003C/p\u003E\u003Cp\u003ECapt\\\u0027n Skunky\u003C/p\u003E\u003Cp\u003EKSP Community Manager\u003C/p\u003E\n"},{"CreatedByName":"speakiusmaximus","CreatedById":30086,"CreatedDateTime":"2012-06-27T17:12:09Z","Content":"\n\u003Cp\u003EI may of course be wrong, but I personally think it\\\u0027d go in the \\\u0027General Discussion\\\u0027 sub-forum, considering this is about KSP. I have got the link for you here: \u003Ca href=\u0022http://kerbalspaceprogram.com/forum/index.php?board=31.0\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/forum/index.php?board=31.0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAlso, welcome to KSP!\u003C/p\u003E\n"},{"CreatedByName":"OsirisReborn","CreatedById":30349,"CreatedDateTime":"2012-06-28T08:59:32Z","Content":"\n\u003Cp\u003EThanks guys.\u003C/p\u003E\u003Cp\u003EThe registration seemed to be related purely to my email address, I\\\u0027ve seen some forums in the past treat \u0027free\u0027 (i.e. hotmail, gmail) addresses differently to keep the bots out.\u003C/p\u003E\u003Cp\u003EI\\\u0027ve got some free time at the weekend so I will try and do some debugging then and see if I can isolate what\\\u0027s causing it and then pass on to the admins\u003C/p\u003E\u003Cp\u003EThanks for the warm welcome\u003C/p\u003E\u003Cp\u003ECheers\u003C/p\u003E\n"}]}