{"TopicId":13519,"ForumId":24,"TopicTitle":"New to this game, just want to say hello!","CreatedByName":"DJAKEXML","CreatedById":30928,"CreatedDateTime":"2012-07-02T00:37:55Z","PageNum":1,"Articles":[{"CreatedByName":"DJAKEXML","CreatedById":30928,"CreatedDateTime":"2012-07-02T00:37:55Z","Content":"\n\u003Cp\u003E Hello everybody, my name is DJAKEXML! (But you could just call me Matt) I started explodi-- ahem, launching rockets in the amazing game known as Kerbal Space Program about a month and a half ago. I played the demo .13.3 for quite some time, until about a week ago, I finally decided to purchase the recent edition from the site. And may I say, WOW! I have launched all kinds of space stations, shuttles, Munar rovers, etc... \u003C/p\u003E\u003Cp\u003E I am typically a fan of many early-on indie games that have potential to become massive succeses. I started out with Minecraft, but lost interest as Notch (the creator) got selfish and really didn\\\u0027t create the game for the players, rather the profit. After trying out others like the wonderful Overgrowth and the disappointing Class 3 Outbreak, I stumbled upon KSP after watching one of my favorite youtube directors \u0027Let\\\u0027s Play\u0027 videos of this game. I decided to give it a try, and ultimately, I became hooked.\u003C/p\u003E\u003Cp\u003E Sorry for such a long introduction, but I look forward to playing this game in the future years of development! \u003C/p\u003E\u003Cp\u003E Peace,\u003C/p\u003E\u003Cp\u003E DJAKEXML (or Matt)\u003C/p\u003E\n"},{"CreatedByName":"shhhilent1","CreatedById":28278,"CreatedDateTime":"2012-07-02T00:42:15Z","Content":"\n\u003Cp\u003EHello! PM me if u need help! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Plaatinum Aerospace","CreatedById":30569,"CreatedDateTime":"2012-07-02T01:23:13Z","Content":"\n\u003Cp\u003EWelcome to the community!\u003C/p\u003E\n"},{"CreatedByName":"Capt\u0026#039;n Skunky","CreatedById":1261,"CreatedDateTime":"2012-07-02T18:07:34Z","Content":"\n\u003Cp\u003EWelcome to the KSP Forums!\u003C/p\u003E\u003Cp\u003EHappy Launching!\u003C/p\u003E\u003Cp\u003EArrr!\u003C/p\u003E\u003Cp\u003ECapt\\\u0027n Skunky\u003C/p\u003E\u003Cp\u003EKSP Community Manager\u003C/p\u003E\n"}]}