{"TopicId":136145,"ForumId":24,"TopicTitle":"Help","CreatedByName":"TheProphet","CreatedById":161498,"CreatedDateTime":"2016-04-05T21:30:47Z","PageNum":1,"Articles":[{"CreatedByName":"TheProphet","CreatedById":161498,"CreatedDateTime":"2016-04-05T21:30:47Z","Content":"\n\u003Cp\u003E\nHi I\u0027m a new player and I need help, I\u0027m currently constructing a large space station, I have the core part in orbit and I\u0027m trying to lift a solar array up to orbit. I\u0027ve got a lifter which uses 1 orange tank with mainsail booster, 6 of the same surrounding it in an asparagus formation, with the biggest SRBs attached on the outside. It accelerates nicely up to 10,000 ish when I drop the SRBs and then it slowly starts to roll over in random directions and flips out of control. I don\u0027t understand why. Please help or can anyone help me with a more reliable lifter \n\u003C/p\u003E\n"},{"CreatedByName":"Starhawk","CreatedById":131400,"CreatedDateTime":"2016-04-05T22:28:06Z","Content":"\n\u003Cp\u003E\nHello TheProphet and welcome to the forum!\n\u003C/p\u003E\n\u003Cp\u003E\nI recommend that you take a look around the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/forum/16-gameplay-questions-and-tutorials/\u0022\u003EGameplay Questions\u003C/a\u003E section of the forum.  If you don\u0027t see anything that helps you, then feel free to start a thread there to ask your question.\u003Cbr\u003E\nThat\u0027s where all the most helpful folk will spot it and respond.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, if you do start a thread there, please include a picture of your craft.  This is necessary for people to help diagnose the exact nature of the problem.\n\u003C/p\u003E\n\u003Cp\u003E\nHappy landings!\n\u003C/p\u003E\n"},{"CreatedByName":"Ten Key","CreatedById":123319,"CreatedDateTime":"2016-04-05T23:29:32Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222496840\u0022 data-ipsquote-contentid=\u0022136145\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221459891847\u0022 data-ipsquote-userid=\u0022161498\u0022 data-ipsquote-username=\u0022TheProphet\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, TheProphet said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt accelerates nicely up to 10,000 ish when I drop the SRBs and then it slowly starts to roll over in random directions and flips out of control. I don\u0027t understand why. Please help or can anyone help me with a more reliable lifter \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI had a rocket that did that. Without seeing yours I can only guess, but it sounds like a drag force problem.\n\u003C/p\u003E\n\u003Cp\u003E\nThere is drag at the top of your rocket, and drag at the bottom. The drag at the top of your rocket makes it want to flip over-- the drag at the bottom makes it want to fly straight. You can visualize it by thinking of your rocket as a broom, with the bristles representing the payload at the top. Drag force can be approximated by adding weights to the broom at the top and the bottom with lengths of string. If you pivot the broom around its center of mass, all of the weights will remain pointed straight at the ground. The weights at the top are going to try to force your broom to tip over. . .the more it rotates, the more rotational force is added. The weights at the bottom have the opposite effect. They will try to keep the broom from tipping. \n\u003C/p\u003E\n\u003Cp\u003E\nWhat was happening to me (and I assume to you as well) was that the attached boosters were adding a significant amount of drag to the bottom of the rocket. I lost that drag when I dropped them, and suddenly the drag at the top of the rocket wasn\u0027t balanced, and it gradually overwhelmed the rocket\u0027s steering ability (or \u0022control authority\u0022). \n\u003C/p\u003E\n\u003Cp\u003E\nThe solutions are to add more drag to the bottom of the rocket, reduce the drag at the top, add more control authority (reaction wheels, RCS, winglets, whatever) or just slow down a little bit. Drag is especially nasty right as you approach terminal velocity (the mach effects on the rocket are a clue) so if you\u0027re shedding your boosters right as you\u0027re breaking the sound barrier, that\u0027s probably a big part of the problem. \n\u003C/p\u003E\n\u003Cp\u003E\nLet us know any if that helps or not, and if it doesn\u0027t a picture of your rocket would help enormously. Welcome to the forums. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022wGDsQcc.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/wGDsQcc.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-04-05T23:32:29Z\u0022 title=\u002204/05/2016 11:32  PM\u0022 data-short=\u00228 yr\u0022\u003EApril 5, 2016\u003C/time\u003E by Ten Key\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Deddly","CreatedById":62955,"CreatedDateTime":"2016-04-07T08:05:21Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/161498-theprophet/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022161498\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/161498-theprophet/\u0022\u003E@TheProphet\u003C/a\u003E, hi and welcome!\u003Cbr\u003E\u003Cbr\u003E\nI think your rocket sounds much too short and stubby. Think about how long real rockets are. Try at least two orange tanks high and not so many surrounding it. I\u0027d also love to see a screenshot of your rocket.\n\u003C/p\u003E\n"},{"CreatedByName":"max_creative","CreatedById":159640,"CreatedDateTime":"2016-04-22T03:31:42Z","Content":"\n\u003Cp\u003E\nMore fins, vernors, SAS, and go faster are my ideas. More fins, vernors, and SAS will always work, faster might not. \n\u003C/p\u003E\n"}]}