{"TopicId":144591,"ForumId":24,"TopicTitle":"Greetings, fellow space programs!","CreatedByName":"Josh IN SPACE","CreatedById":167041,"CreatedDateTime":"2016-07-26T08:47:21Z","PageNum":1,"Articles":[{"CreatedByName":"Josh IN SPACE","CreatedById":167041,"CreatedDateTime":"2016-07-26T08:47:21Z","Content":"\n\u003Cp\u003E\nThought I would introduce myself on here finally. I got the game about a month ago and have been loving it from the get-go. I\u0027ve been on here frequently to browse for educational resources, and I\u0027m excited to continue learning as I venture out beyond Kerbin. So hello, everyone!\n\u003C/p\u003E\n\u003Cp\u003E\nThis game is something else. It\u0027s at times the most frustrating, followed by the most rewarding feeling when you have that eureka moment and understand how something works and what you need to do. It\u0027s taken a lot of willpower not to forget my actual life outside this game. I can\u0027t wait to come home from work and still stay up all night launching ships and failing over and over to get them in orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nLast night I finally figured out how to rendezvous with poor Jebediah, who was stuck out in space in his little capsule on my first successful orbit. In-game it was only like 2 weeks but I wasn\u0027t going to let him die of starvation! The process of getting the orbit, velocity and intersects just right was quite the experience. I had enough fuel left for maybe 3 full throttle thrusts to match orbit and velocity with Jeb\u0027s capsule, and even then, even when the intersects were practically touching at 540,000 m, those ships were still 10 km apart! So Jeb jumped from his capsule and using the navball I was able to back into the rescue ship at a cool 2 m/s. Valentina and Bill were waiting for him, and since they did most of the work getting to him, I had him push us back into de-orbit for a safe splashdown.\n\u003C/p\u003E\n\u003Cp\u003E\nWew, what a feeling it is to have all of this work out after so much trial and error. I want to get better at all the equations so I don\u0027t feel like I\u0027m guessing or eye-balling it so much.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m not too certain on the image-posting process on here yet, but here\u0027s the album I made of the rescue mission if anyone wants to look at the pictures lol.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://imgur.com/a/vrC8s\u0022 rel=\u0022external nofollow\u0022\u003EOperation :BRING JEB HOME\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n-----\n\u003C/p\u003E\n\u003Cp\u003E\nIf you\u0027re still reading this,\u003Cstrong\u003E I do have a question\u003C/strong\u003E going forward. At what point is it time to move past the 30 part limit? I like having this constraint because it\u0027s a fun challenge, and the jump from 30 parts to unlimited just feels too easy to me. But surely there comes a time when 30 parts won\u0027t cut it right?\n\u003C/p\u003E\n\u003Cp\u003E\nThanks, and I hope to post more intelligent and sophisticated entries in here with time and studying.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-07-26T08:50:48Z\u0022 title=\u002207/26/2016 08:50  AM\u0022 data-short=\u00227 yr\u0022\u003EJuly 26, 2016\u003C/time\u003E by Josh IN SPACE\u003C/strong\u003E\n\u003Cbr\u003ETypo\n\u003C/span\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2016-07-26T20:51:22Z","Content":"\n\u003Cp\u003E\nHello Josh IN SPACE. Welcome to the forum. \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nRight now, a recent Imgur update seems to have broken albums. We are hoping to get that fixed soon. In the meantime, individual image hosting from Imgur is still working, so I\u0027d suggest you try that. I hope to see your pictures soon. \n\u003C/p\u003E\n"},{"CreatedByName":"SorryDave","CreatedById":119474,"CreatedDateTime":"2016-07-26T22:21:04Z","Content":"\n\u003Cp\u003E\nWelcome and congrats on the rescue. In a short time you have already pulled off one of the tougher  skills. \n\u003C/p\u003E\n\u003Cp\u003E\nAs far as forgetting your real life goes; balance is important. But despite the better graphics, I ragequit life until the creator fixes all the bugs.\n\u003C/p\u003E\n\u003Cp\u003E\nI think the best advice for upgrading beyond 30 parts will be when you find you need more parts. Even if it is just to make your ship look cooler.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-07-26T22:21:44Z\u0022 title=\u002207/26/2016 10:21  PM\u0022 data-short=\u00227 yr\u0022\u003EJuly 26, 2016\u003C/time\u003E by SorryDave\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nerfclasher","CreatedById":158707,"CreatedDateTime":"2016-07-27T02:03:24Z","Content":"\n\u003Cp\u003E\n Welcome as a newcomer myself\n\u003C/p\u003E\n"},{"CreatedByName":"Josh IN SPACE","CreatedById":167041,"CreatedDateTime":"2016-08-29T05:29:23Z","Content":"\n\u003Cp\u003E\nIt\u0027s been a bit, been a little busy. Here\u0027s my first rendezvous!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022PpuvUg8.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/PpuvUg8.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022RJ6UJM9.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/RJ6UJM9.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022aL99gPG.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/aL99gPG.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI recently built my first computer as well, and I regrettably only backed up media files. So without thinking, I did not back up my KSP save files... so my 147 hours of successes and hardships have gotten lost in space. Though this is a harsh loss, it\u0027s lesson learned, and I know now I\u0027m going to breeze right through the earlier stuff. I am disappointed though, as I had just passed Mun on my way to I don\u0027t know where, but I was excited to see where the little craft would go. Oh well. going to do better this time!\n\u003C/p\u003E\n"}]}