{"TopicId":15168,"ForumId":24,"TopicTitle":"Need help on how to fly to the mun (My first post sorry if its bad)","CreatedByName":"rocketman97","CreatedById":10650,"CreatedDateTime":"2012-07-25T09:38:19Z","PageNum":1,"Articles":[{"CreatedByName":"rocketman97","CreatedById":10650,"CreatedDateTime":"2012-07-25T09:38:19Z","Content":"\n\u003Cp\u003EHi this is my first post like in the title sorry if it bad but im asking for help on how to fly to the mun i always just point the rocket towards the mun but overshoot and my kerbals are sent into deep space and i want some hints and tips on how to fly there and land and get back safely thanks to all the replys.\u003C/p\u003E\n"},{"CreatedByName":"togfox","CreatedById":17083,"CreatedDateTime":"2012-07-25T09:49:43Z","Content":"\n\u003Cp\u003ETry to get into a kerbin orbit first. A direct flight is a lt harder in my opinion.\u003C/p\u003E\n"},{"CreatedByName":"rocketman97","CreatedById":10650,"CreatedDateTime":"2012-07-25T10:01:23Z","Content":"\n\u003Cp\u003EIs there an altitude you should start to orbit sorry about the questions i have been playing for a while now and all i have been able to do is orbit the sun i have just started to try to land on the mun\u003C/p\u003E\n"},{"CreatedByName":"togfox","CreatedById":17083,"CreatedDateTime":"2012-07-25T10:09:19Z","Content":"\n\u003Cp\u003ETry turning (slowly) at 10km and \\\u0027coast\\\u0027 when your AP is above 70km. When you reach your AP, burn prograde so that your PE raises above 70km.\u003C/p\u003E\u003Cp\u003EYou an then dump empty tanks and prep for the mun.\u003C/p\u003E\n"},{"CreatedByName":"Spyre9","CreatedById":17502,"CreatedDateTime":"2012-07-25T13:26:23Z","Content":"\n\u003Cp\u003EGetting to the Mun can be broken into easy to manage parts/stages.\u003C/p\u003E\u003Cp\u003EOrbit.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003EThe aim of this is to get your orbit to match that of the Mun\\\u0027s. This is done pretty easily, on take off you want to slowly move your vector along the 90 degree angle. (If everything is standard its just a case of hitting \\\u0027D\\\u0027 and making small adjustments, eventually you want to be at 90 degrees with 0 inclination ... your pointing at the horizon on your NavBall. You want to aim for 100km Orbit\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ETransfer Orbit.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003EIn your orbit of 100km watch for the Mun to rise over the horizon of Kerbin, once the Mun is visable you have the option to burn and push your Apoapsis to about 11.4 million meters, easier done in map view, at this point you should see your Orbit line in the map turn into an intercept line, now all you have to do is wait.\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EBreak the problem down into stages like... \u003C/p\u003E\u003Cp\u003E-Reach Orbit, get your orbit on the same inclination as the Mun, at the right altitude and as stable as possible.\u003C/p\u003E\u003Cp\u003E-Transfer Orbit, at the right time burn to intercept the Mun.\u003C/p\u003E\u003Cp\u003E-Munar Orbit, once intercepted you\\\u0027ll want to establish an orbit around the Mun rather then performing a sling-shot round the Mun and out to space.\u003C/p\u003E\u003Cp\u003E-Adjust Orbit, when you know where you want to land, it\\\u0027s all about manipulating your orbit and flightpath to allow that to happen.\u003C/p\u003E\u003Cp\u003E-Land... or like most people on their first attempt, crash... BUT if you do that then you get to build a rescue craft! \u003C/p\u003E\u003Cp\u003EThink thats all correct. Hope it helps.\u003C/p\u003E\n"},{"CreatedByName":"Khrissetti","CreatedById":29557,"CreatedDateTime":"2012-07-25T13:40:08Z","Content":"\n\u003Cp\u003EHi, welcome to the fora\u003C/p\u003E\u003Cp\u003EFirst thing\\\u0027s first, I reccomend practicing orbital maneuvers first. There\\\u0027s a reason that the ship which landed on the moon in 1969 was Apollo Eleven!\u003C/p\u003E\u003Cp\u003EFirst just practice getting into stable equatorial orbits at about 100km high, keep trying to circularise your orbit by following AlexL\\\u0027s little guide above. Remember that the atmosphere stops at 70km up, if your pe (or ap) is below 70km, you\\\u0027re on a collision course with Kerbin.\u003C/p\u003E\u003Cp\u003EOnce you\\\u0027ve gotten a feel for how to adjust your orbit and you\\\u0027re comfortable with changing your AP and PE, I have a 30-step guide below for getting into Munar orbit, Landing on the Mun, and getting home.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003EPOW ZOOM! Straight to the Mun!\u003C/p\u003E\u003Cp\u003E1) launch your rocket straight up until you reach about 20k, then gently angle the rocket eastwards (90 degrees) at a steep angle. You don\\\u0027t need to be doing huge speeds, just enough to keep raising your apoapsis.\u003C/p\u003E\u003Cp\u003E2) When your Ap reaches 100k, stop burning and turn your ship to turn at 90 degrees, with zero inclination (on the nav-ball you should have equal amounts blue and brown and be sitting pretty on the 90 degree marker)\u003C/p\u003E\u003Cp\u003E3) Just before you reach Ap, fire those engines as hot as they\\\u0027ll go until your Pe ia about 100k and shut off the engines again. Don\\\u0027t worry if you\\\u0027re out by quite a margin or if the eccentricity is high, just get that Pe up above the atmosphere.\u003C/p\u003E\u003Cp\u003E4)Keep your eye to the horizon in the direction of travel, you want to watch for Munrise. As soon as you see the Mun poke up above the horizon, turn to prograde (The yellow ciircle on the nav-ball) and start to burn.\u003C/p\u003E\u003Cp\u003E5) On the map view, you should see your Ap rise, you want to get is close to the Mun\\\u0027s orbit at about 11,500k, reduce your burn as your AP gets close so you don\\\u0027t overshoot, and keep watching for when your map tells you you\\\u0027ll intercept. \u003C/p\u003E\u003Cp\u003E(This assumes that you\\\u0027re running a paid version of the game (Versions 0.14 onwards) if you\\\u0027re using the demo, then the game won\\\u0027t show you when you\\\u0027ll be captured by the Mun, just get to 11 million metres, and cross your fingers. If you miss then just time warp until you DO get captured by the Mun, it will happen eventually.)\u003C/p\u003E\u003Cp\u003E6) time warp 10,000 until you get captured by the Mun.\u003C/p\u003E\u003Cp\u003E7)You\\\u0027ll notice now that your path isn\\\u0027t a circle but an arc with a Pe in the middle, this shows that you\\\u0027re on an escape trajectory and we don\\\u0027t want that. \u003C/p\u003E\u003Cp\u003E wait until you reach Pe and turn to face retrograde (they yellow/green symbol with the \\\u0027x\\\u0027 through it) and start to burn your engines, watch as the two ends of the arc start to close up.\u003C/p\u003E\u003Cp\u003E9) You can now keep burning to lower your Ap to a circular orbit.\u003C/p\u003E\u003Cp\u003E10) Voila, you\\\u0027re in Munar orbit!\u003C/p\u003E\u003Cp\u003ELANDING ON THE MUN!\u003C/p\u003E\u003Cp\u003Enow you\\\u0027re in Munar orbit, I bet you\\\u0027d like to settle yourself down on the surface right? Well, all right then. First let\\\u0027s find a landing site.\u003C/p\u003E\u003Cp\u003E1) The safest places to land are the large craters on the lit side of the Mun (You\\\u0027ll see why soon) so wait until you\\\u0027re in sunlight over a crater.\u003C/p\u003E\u003Cp\u003E2) now we kill the majority of your lateral velocity (There are Kerbal pilots who are capable of killing it all at this step, but if you\\\u0027re like me you\\\u0027ll still have a little left.) by turning to face retrograde again and burning. Your pe will lower until it sinks into the ground and your retrograde symbol will travel up the nav-ball until it\\\u0027s sat on top of the blue segment. This is what we\\\u0027re aiming for.\u003C/p\u003E\u003Cp\u003E3) Now we need to gently control our descent without losing too much fuel. I do this in stages, Keep an eye on your nav-ball and as long as you\\\u0027re above 5,000m watch your map and wait until you\\\u0027re about half the distance between your Ap and the ground, then burn to bring the Ap down to you.\u003C/p\u003E\u003Cp\u003E4) Keep doing this until you\\\u0027re about 5,000m up. Keep an eye on your retrograde symbol and keep it as close to the top middle point as you can.\u003C/p\u003E\u003Cp\u003E5) at 5000m it starts to get into nail-biting territory. The first thing to remember is to ignore your altimeter, it shows your position relative to a \\\u0027sea level\\\u0027 not from the ground. Even in the craters you\\\u0027ll land somewhere close to 300m high up.\u003C/p\u003E\u003Cp\u003E6) get your velocity down to about 20m/s and just keep the engines on a nice, slow descent burn, you don\\\u0027t want to be violently speeding up or slowing down.\u003C/p\u003E\u003Cp\u003E7)When you get to about 2000m, turn your RCS on and use the J,K,L and I buttons to fire bursts to kill any lateral movement you\\\u0027ve still got, your retrograde symbol should sit snuggly over the dot at the top of the ball, if not, you still have lateral movement which will tear your lander to shreds.\u003C/p\u003E\u003Cp\u003E keep slowly bringing your velocity down, at 1,000m (if you\\\u0027re landing in a crater) you want to be at about 10m/s this is still fast, but depending on how well-made your lander is, it can probably survive those sorts of speeds.\u003C/p\u003E\u003Cp\u003E9) Now, keep your eye below you and look for your ship\\\u0027s shadow, that\\\u0027s your altimeter now. When you see it get your velocity down as low as you can without flying back up again, about 5m/s or less, keep using RCS to keep that retrograde symbol over the zero point.\u003C/p\u003E\u003Cp\u003E10) when you finally touchdown you want to be as slow as possible \u0026lt;1m/s is perfect, but when your ship is about half a ship-height from the ground and your lateral movement is dead (Keep using those RCS if you need to) kill your engines completely, you should land with a bit of a bump on the Mun\\\u0027s surface. Congratulations!\u003C/p\u003E\u003Cp\u003ERETURNING TO Kerbin.\u003C/p\u003E\u003Cp\u003ESo, you\\\u0027ve landed on the Mun, used F1 to take some commermorative screenshots and you\\\u0027re ready to go home?\u003C/p\u003E\u003Cp\u003E1) Fire up those engines, but keep them low, you don\\\u0027t need much thrust to escape the Mun, just fly up until you\\\u0027re at about 1000m then, as on Kerbin, slowly and gently tilt to 90 degrees at a fairly steep inclination.\u003C/p\u003E\u003Cp\u003E2)When your Ap is at about 3,000m you should be high enough to miss all the mountains, so turn to face 90 degrees at zero inclination and burn to raise your Pe to about the same height. You can safely orbit at 3000m but if you feel too nervous at that low height then burn to about 5000m\u003C/p\u003E\u003Cp\u003E3) Watch the horizon again for kerbin-rise then start to burn prograde, it shouldn\\\u0027t take much fuel to raise your Ap to a point where it gets captured by Kerbin but if you run out of fuel at any time, remember you can turn your RCS on and press H to use a makeshift engine.\u003C/p\u003E\u003Cp\u003E4) When your map shows your proposed new orbit in yellow, time-warp until you get captured by kerbin\u003C/p\u003E\u003Cp\u003E5) You probably won\\\u0027t have much fuel left now, so let\\\u0027s make every drop count, your Ap and Pe will probably be all over the place, so just time-warp until you reach Ap\u003C/p\u003E\u003Cp\u003E6) At Ap, turn retrograde and burn to reduce your Pe to lower than 65k. That is your target, if you don\\\u0027t have the fuel to lower it any more, don\\\u0027t worry, you\\\u0027re on a course for Kerbin!\u003C/p\u003E\u003Cp\u003E7) if your Pe is lower than 65k (prefereably somewhere closer to 50k) your orbit will take you through the atmosphere, when that happens you\\\u0027ll perform what\\\u0027s known as an \\\u0027aerobrake\\\u0027 maneuver, whereby the air will lower your Ap. If you don\\\u0027t have any fuel left don\\\u0027t worry that you shoot out of the atmosphere again, it will just take multiple aerobrakes to get your speed down and your Ap inside the atmosphere.\u003C/p\u003E\u003Cp\u003E When you\\\u0027re in the atmosphere, wait until you\\\u0027re over the ocean and fire what\\\u0027s left of your fuel retrograde, to make sure your path will make you fall in the drink.\u003C/p\u003E\u003Cp\u003E9) Jettison everything except for the command pod and parachute. make sure your parachute and module is above the rest of your rocket when you jettison or they will smash into your module and kill your kerbals, don\\\u0027t screw it up now!\u003C/p\u003E\u003Cp\u003E10) Fire your parachute as soon as the debris is away and ride it down safely into the ocean. Splashdown!\u003C/p\u003E\u003Cp\u003ECongratulations, now just time to wait for a rescue ship!\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"Capt\u0026#039;n Skunky","CreatedById":1261,"CreatedDateTime":"2012-07-25T18:12:33Z","Content":"\n\u003Cp\u003EWelcome to the KSP Forums!\u003C/p\u003E\u003Cp\u003EHappy Launching!\u003C/p\u003E\u003Cp\u003EArrr!\u003C/p\u003E\u003Cp\u003ECapt\\\u0027n Skunky\u003C/p\u003E\u003Cp\u003EKSP Community Manager\u003C/p\u003E\n"}]}