{"TopicId":17204,"ForumId":24,"TopicTitle":"Hello and WTF?","CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2012-08-18T13:12:21Z","PageNum":1,"Articles":[{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2012-08-18T13:12:21Z","Content":"\n\u003Cp\u003EJust picked up the game a couple of days ago and having fun breaking things and blowing up kerbals. I\u0027ve pretty much sussed out orbiting Kerbin. Although the two little fellas currently on \u0022extended\u0022 missions orbiting the planet in ships with no fuel might dispute that (the second of which was the rescue mission for the first one, so currently rescue missions are on a bit of a hold...)\u003C/p\u003E\u003Cp\u003EGetting ahead of myself: I have a question regarding trans-munar injection. It strikes me that timing the burn is key, so that the ship intersects the munar orbit at just the right time to get pulled in and set up some kind of orbit. How the heck do you manage that? Rough guess? Is close enough good enough, and surely this would affect how much fuel it would take to land safely on the Mun? Am I missing something obvious here?\u003C/p\u003E\n"},{"CreatedByName":"tjoreilly","CreatedById":23760,"CreatedDateTime":"2012-08-18T13:17:52Z","Content":"\n\u003Cp\u003EHowdy! and glad to have you with us.\u003C/p\u003E\u003Cp\u003EYeah, timing is key, but it really isn\u0027t too daunting. A tried and true method is to get yourself into a stable orbirt around Kerbin, then burn when the MÃƒÂ¼n is about 10Ã‹Å¡ above the horizon.\u003C/p\u003E\u003Cp\u003EYou should have it down after a couple of tries and be crashing into the MÃƒÂ¼n in no time! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-08-18T13:21:08Z\u0022 title=\u002208/18/2012 01:21  PM\u0022 data-short=\u002211 yr\u0022\u003EAugust 18, 2012\u003C/time\u003E by tjoreilly\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2012-08-18T15:00:11Z","Content":"\n\u003Cp\u003ECheers, glad to be here.\u003C/p\u003E\u003Cp\u003EIs that for an eastwards orbit? I shall go make new craters this evening. We\u0027ll call them, er, seismic tests!\u003C/p\u003E\n"},{"CreatedByName":"Capt\u0026#039;n Skunky","CreatedById":1261,"CreatedDateTime":"2012-08-18T15:11:26Z","Content":"\n\u003Cp\u003EHappy Launching!\u003C/p\u003E\u003Cp\u003EArrr!\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECapt\u0027n Skunky\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022color:#800080;\u0022\u003EKSP Community Manager\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\n"}]}