{"TopicId":17213,"ForumId":24,"TopicTitle":"Greetings from the Mun","CreatedByName":"John F. Kerman","CreatedById":40209,"CreatedDateTime":"2012-08-18T14:59:46Z","PageNum":1,"Articles":[{"CreatedByName":"John F. Kerman","CreatedById":40209,"CreatedDateTime":"2012-08-18T14:59:46Z","Content":"\n\u003Cp\u003EGreetings, citizens of Kerbin!\u003C/p\u003E\u003Cp\u003ESo recently I let you, the denizens of Kerbin, know that we\u0027d chosen to go to the Mun in this alpha version \u0026amp; do the other things, not because they are quicksaved, but because they are not quicksaved. You might have missed it on TV, I\u0027m not sure the camera was turned on. But I totally said that.\u003C/p\u003E\u003Cp\u003EWell, after deciding the previous attempt didn\u0027t count when the GBTK (Guy Behind The Keyboard) interface in astronaut Bill Kermin\u0027s Munar Landing Module suffered a serious ground-to-proximity failure resulting in loss of all thrust capability (that\u0027s the last time we use shoddy Khinese components), last night I was finally able to tell you that the dream has become reality, and beam back the first pictures from the surface of the Mun.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://postimage.org/image/dzre40ojf/\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://s9.postimage.org/dzre40ojf/screenshot8.jpg\u0022 alt=\u0022screenshot8.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E.. unfortunately Jeb is still there too as he didn\u0027t have enough fuel to get out of orbit.\u003C/p\u003E\u003Cp\u003EHello \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ve been playing KSP for about a week \u0026amp; been loving it so far. My only gripe is for some reason any kerbonauts I\u0027ve left orbiting or landed on the Mun get saved as debris so I can\u0027t resume the flight (but they do when they\u0027re in orbit around Kerbin - maybe it\u0027s because I detached the command module?) - it\u0027d have been awesome to attempt a rescue mission after I\u0027d gotten some practice in.\u003C/p\u003E\u003Cp\u003EBut whatever, this game has fast become my favourite, keep up the good work Squad!\u003C/p\u003E\n"},{"CreatedByName":"Capt\u0026#039;n Skunky","CreatedById":1261,"CreatedDateTime":"2012-08-18T15:03:59Z","Content":"\n\u003Cp\u003EHappy Launching!\u003C/p\u003E\u003Cp\u003EArrr!\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECapt\u0027n Skunky\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022color:#800080;\u0022\u003EKSP Community Manager\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\n"}]}