{"TopicId":17916,"ForumId":24,"TopicTitle":"Mr. Nikola Tesla, at your service.","CreatedByName":"Nikola Tesla","CreatedById":43930,"CreatedDateTime":"2012-08-27T03:30:55Z","PageNum":1,"Articles":[{"CreatedByName":"Nikola Tesla","CreatedById":43930,"CreatedDateTime":"2012-08-27T03:30:55Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EJust stopping in to say hello and tell you all a little story.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EKerbol had just began to peek over the horizon, radiating with warmth and energy, filling Kerbin with her light.\u003C/p\u003E\u003Cp\u003EBirds chirped. Dew dripped from leaves. Waves pounded against the sandy beaches.\u003C/p\u003E\u003Cp\u003EAt Cape Kerbal, a tower of metal and duct tape stood on the launch platform. The hastily-built pile of steel and fuel\u003C/p\u003E\u003Cp\u003Ewas named the Dynamo Mk. III. And today was the day, the day when Kerbals everywhere would watch as its crew\u003C/p\u003E\u003Cp\u003Etook the first steps on the Mun.\u003C/p\u003E\u003Cp\u003E\u0022T-Minus 20 minutes. All personnel evacuate the launch pad.\u0022 came the call over the intercom. Engineers and various trucks\u003C/p\u003E\u003Cp\u003Eof all sizes rushed away in every direction. Fuel lines detached and fell from the rocket. Her new paint glistened in the sunlight,\u003C/p\u003E\u003Cp\u003Emasking the makeshift spaceship underneath.\u003C/p\u003E\u003Cp\u003E\u0022T-Minus 10 minutes. Disconnecting Dynamo Mk. III from ground power.\u0022 electrical cables detached and fell.\u003C/p\u003E\u003Cp\u003E\u0022T-Minus 60 seconds. SAS systems online, begin engine sequence.\u0022\u003C/p\u003E\u003Cp\u003E\u0022T-Minus 10..\u0022\u003C/p\u003E\u003Cp\u003E\u00229..\u0022\u003C/p\u003E\u003Cp\u003E\u00228..\u0022\u003C/p\u003E\u003Cp\u003E\u00227..\u0022\u003C/p\u003E\u003Cp\u003E\u00226..\u0022\u003C/p\u003E\u003Cp\u003E\u00225..\u0022\u003C/p\u003E\u003Cp\u003EJebediah Kerman, the flight commander, smiled as he put on his signature Aviator sunglasses.\u003C/p\u003E\u003Cp\u003EBill Kerman\u0027s eyes darted across the cramped cabin.\u003C/p\u003E\u003Cp\u003EBob Kerman shook with anxiety.\u003C/p\u003E\u003Cp\u003E\u00224..\u0022\u003C/p\u003E\u003Cp\u003E\u00223..\u0022\u003C/p\u003E\u003Cp\u003E\u00222..\u0022\u003C/p\u003E\u003Cp\u003E\u00221..\u0022\u003C/p\u003E\u003Cp\u003EA shock wave rode through the spaceship as it lurched towards the sky, a column of flame and smoke beneath it. The Dynamo Mk. III slowly cleared the launch tower, and then exploded.\u003C/p\u003E\u003Cp\u003EInside Mission Control, the joy at seeing their ship actually \u003Cem\u003Ebegin\u003C/em\u003E to fly was soon crushed by the explosion.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u0022Back to the drawing board, boys.\u0022\u003C/strong\u003E\u003C/p\u003E\n"},{"CreatedByName":"LaydeeDem","CreatedById":5984,"CreatedDateTime":"2012-08-27T09:44:01Z","Content":"\n\u003Cp\u003EHello Mister Tesla. Did you hear that funny joke about Edison?\u003C/p\u003E\n"},{"CreatedByName":"Capt\u0026#039;n Skunky","CreatedById":1261,"CreatedDateTime":"2012-08-27T11:40:39Z","Content":"\n\u003Cp\u003EHappy Launching!\u003C/p\u003E\u003Cp\u003EArrr!\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECapt\u0027n Skunky\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022color:#800080;\u0022\u003EKSP Community Manager\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\n"}]}