{"TopicId":181212,"ForumId":24,"TopicTitle":"New to forum","CreatedByName":"NathanOTWeb","CreatedById":187170,"CreatedDateTime":"2019-01-07T17:05:52Z","PageNum":1,"Articles":[{"CreatedByName":"NathanOTWeb","CreatedById":187170,"CreatedDateTime":"2019-01-07T17:05:52Z","Content":"\n\u003Cp\u003E\nHello all!\n\u003C/p\u003E\n\u003Cp\u003E\nBeen playing KSP for the past six months or so and have a question:\n\u003C/p\u003E\n\u003Cp\u003E\nAre the contracts in career mode tied to the science tree?  Certain contracts appear after I unlock a parts group, even if my progression is only so far.  Example: one might need parts to land on the Mun for the first time and after they are unlocked a new contract appears to place base on Minmus.\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2019-01-07T18:21:34Z","Content":"\n\u003Cp\u003E\nHello, and welcome to the forums!  \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223518023\u0022 data-ipsquote-contentid=\u0022181212\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221546880752\u0022 data-ipsquote-userid=\u0022187170\u0022 data-ipsquote-username=\u0022NathanOTWeb\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, NathanOTWeb said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAre the contracts in career mode tied to the science tree?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI believe that the answer is \u0022yes\u0022, if for no other reason than that certain contracts are impossible without certain tech.\n\u003C/p\u003E\n\u003Cp\u003E\nFor example, there\u0027s a family of contracts along the lines of \u0022build a space station around X\u0022, or \u0022land an outpost on X\u0022.  These contracts vary in their specific requirements, but one thing that they \u003Cem\u003E\u003Cu\u003Euniversally\u003C/u\u003E\u003C/em\u003E require is that the thing you build has to have a docking port, an antenna, and the ability to generate power.  So, if you haven\u0027t unlocked any docking ports yet, or if you haven\u0027t unlocked any solar panels, then it would be physically impossible to fulfill such a contract-- and therefore, I believe the game is designed so that it won\u0027t offer you any of that sort of contract until you\u0027ve unlocked a certain set of bare-minimum nodes.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, I don\u0027t think the \u0022need parts to land on the Mun\u0022 idea is actually a thing.  That\u0027s because there\u0027s no \u003Cem\u003E\u003Cu\u003Eone specific part\u003C/u\u003E\u003C/em\u003E that you need to be able to land on the Mun with.  Therefore, I believe the \u0022World First\u0022 contracts (like \u0022land on the Mun\u0022) are tied to game progress (i.e. where have you gone, what have you landed on, etc.) rather than the state of the tech tree.\n\u003C/p\u003E\n"},{"CreatedByName":"NathanOTWeb","CreatedById":187170,"CreatedDateTime":"2019-01-07T18:43:57Z","Content":"\n\u003Cp\u003E\nAh! But the “Worlds First” contracts include docking two space craft around a particular body (I.e. Kerbin, Mun, Minnie, etc.) which I never see unless I unlock the docking port. \n\u003C/p\u003E\n\u003Cp\u003E\nSo to my next question: can you limit what contracts you get by not advancing in the tech tree? Or would you be unable to fulfill certain offered contracts without advancing in the tech tree?\n\u003C/p\u003E\n\u003Cp\u003E\nHere\u0027s an example: I see a contract to place orbital probe around Kerbin.  It has the requirement of needing to generate power, but I don\u0027t have batteries or solar power unlocked.  So I guess that answers my question.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-01-07T18:53:21Z\u0022 title=\u002201/07/2019 06:53  PM\u0022 data-short=\u00225 yr\u0022\u003EJanuary 7, 2019\u003C/time\u003E by NathanOTWeb\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2019-01-08T04:12:43Z","Content":"\n\u003Cp\u003E\nYou could simply decline the missions you don\u0027t feel like doing. There\u0027s a tiny reputation penalty, which is a setting you can turn off completely. (Before starting a game, but not during one.) \n\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2019-01-08T04:39:18Z","Content":"\n\u003Cp\u003E\nSnark\u0027s basically got it, except for not being sure. I will confirm his suspicions.\n\u003C/p\u003E\n\u003Cp\u003E\nYou will  never, ever get a contract to dock 2 ships in orbit of anywhere if you never buy a docking port tech tree node.\n\u003C/p\u003E\n\u003Cp\u003E\nYou will never, ever get a contract to build a space station or ground base if you never buy at least one each of a tech tree node with docking ports, electricity generators, and antennas.\n\u003C/p\u003E\n\u003Cp\u003E\nyou will never, ever get a contract to put a satellite into orbit if you never buy at least one each of a tech tree node with probe cores, electricity generators, and antennas.\n\u003C/p\u003E\n\u003Cp\u003E\nYou will not progress much through the game in any case if you don\u0027t unlock these nodes, though. If not for themselves, then for the nodes that will be unattainable by excepting yourself from them. \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI can say this with assurance because of experience with the mode, and also a bug I recall from years ago when the launch clamps accidentally started allowing satellite contracts, because they actually generate power. They had to IIRC write a special exception for them.\n\u003C/p\u003E\n\u003Cp\u003E\nIn the stock game of course, mods can do whatever they want.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-01-08T04:39:57Z\u0022 title=\u002201/08/2019 04:39  AM\u0022 data-short=\u00225 yr\u0022\u003EJanuary 8, 2019\u003C/time\u003E by 5thHorseman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Lapis","CreatedById":193784,"CreatedDateTime":"2019-01-08T16:12:32Z","Content":"\n\u003Cp\u003E\nwelcome to the forums!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}