{"TopicId":184448,"ForumId":24,"TopicTitle":"New Member Guide (9/2021)","CreatedByName":"Gargamel","CreatedById":64714,"CreatedDateTime":"2019-05-13T00:03:40Z","PageNum":1,"Articles":[{"CreatedByName":"Gargamel","CreatedById":64714,"CreatedDateTime":"2019-05-13T00:03:40Z","Content":"\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:20px;\u0022\u003E\u003Cem\u003E\u003Cstrong\u003EHello and Welcome!\u003C/strong\u003E\u003C/em\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nWelcome to the Official KSP Forums! We\u0027re glad you decided to join our community, and you probably have some questions as to what\u0027s going on and what can you do here.  This little guide may help answer some of those questions.\n\u003C/p\u003E\n\u003Cp\u003E\nFirst off, you\u0027ve just joined and might have missed a couple things in your haste to post about your love of little green men flying through space, or more likely, as most of us have experienced when we were new, posting about our little green men dying in fiery explosions. We\u0027d like you to start off by taking a look at our \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/guidelines/\u0022 rel=\u0022\u0022\u003ECommunity Guidelines\u003C/a\u003E. These are the rules that we try to follow here on the forums, and we ask that you do too. Give them a read; there\u0027s nothing overly restrictive about them. We try to maintain a positive, non-confrontational, family-oriented forum here. If you keep that in mind, you\u0027ll do just fine! \n\u003C/p\u003E\n\u003Cp\u003E\nThis guide is broken up into small sections, indexed below, so you can easily find the info you are looking for. If you\u0027re brand new, I recommend reading all of it first, and then just referencing the various sections as you have questions.\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\n\u003Cstrong\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/184448-new-member-guide-52019/\u0026amp;do=findComment\u0026amp;comment=3598048\u0022 rel=\u0022\u0022\u003EWHAT CAN I DO?\u003C/a\u003E\u003C/strong\u003E  The functions available to you, and the minor restrictions placed on your new account.\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/184448-new-member-guide-52019/\u0026amp;do=findComment\u0026amp;comment=3598051\u0022 rel=\u0022\u0022\u003ETHE FORUM\u003C/a\u003E\u003C/strong\u003E  Getting to know the basic layout of the forum, and what goes where.\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/184448-new-member-guide-52019/\u0026amp;do=findComment\u0026amp;comment=3598052\u0022 rel=\u0022\u0022\u003EPOSTING\u003C/a\u003E\u003C/strong\u003E General guidelines and etiquette for posting on the forum. (Including Pictures)\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/184448-new-member-guide-52019/\u0026amp;do=findComment\u0026amp;comment=3598053\u0022 rel=\u0022\u0022\u003ECONTACTING A MODERATOR\u003C/a\u003E\u003C/strong\u003E How to get help. \n\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-09-12T05:38:52Z\u0022 title=\u002209/12/2021 05:38  AM\u0022 data-short=\u00222 yr\u0022\u003ESeptember 12, 2021\u003C/time\u003E by Gargamel\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Gargamel","CreatedById":64714,"CreatedDateTime":"2019-05-13T00:04:25Z","Content":"\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cstrong\u003EWHAT CAN (OR CAN\u0027T) I DO\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAs a brand new member, there have been some limits placed on your account. These restriction are in place for security reasons to help protect the forums as a whole. These will be removed from your account in after the moderators have approved five\u003Csup\u003E*\u003C/sup\u003E of your posts, but here is a short list of what to expect till then:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\n\u003Cstrong\u003EYour first few posts need moderator approval\u003C/strong\u003E -\u003Cstrong\u003E \u003C/strong\u003EIf you have tried to post your first message, you might have seen this message: \u0022\u003Cem\u003EYour content will need to be approved by a moderator. New members, after 5 approved posts you will no longer see this warning and will be able to post freely.\u003C/em\u003E\u0022  This means a moderator will have to review your post, and make sure it\u0027s suitable for our forums (\u003Cem\u003Esee \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/184448-new-member-guide-52019/\u0026amp;do=findComment\u0026amp;comment=3598052\u0022 rel=\u0022\u0022\u003EPosting\u003C/a\u003E below\u003C/em\u003E).  This may take some time for a moderator to actually approve the post, but it doesn\u0027t mean anything is wrong.  The moderators are volunteers and aren\u0027t always available to approve things. Be patient, and it will get approved. So if you don\u0027t see the post go through immediately, it\u0027s not a bug, and you don\u0027t have to try again. If for some odd reason we can\u0027t approve it, we\u0027ll definitely contact you privately to explain why and help you edit it so it is acceptable. Edits to an already approved post also require approval during this period, so make sure you get the punctuation right the first time, or else you\u0027ll have to wait for approval again. \u003Cbr\u003E\n \n\u003C/li\u003E\n\u003C/ul\u003E\u003Cul\u003E\u003Cli\u003E\n\u003Cstrong\u003E You can\u0027t send Private Messages \u003C/strong\u003E-\u003Cstrong\u003E \u003C/strong\u003EUntil you have reached the 5 post mark, you will be unable to create a new PM in our message system. You can receive, and freely reply to, messages from other members, but you cannot start a new conversation. If, for some reason, you need to contact a moderator, you can report a post (\u003Cem\u003Esee \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/184448-new-member-guide-52019/\u0026amp;do=findComment\u0026amp;comment=3598053\u0022 rel=\u0022\u0022\u003EContacting A Moderator\u003C/a\u003E below\u003C/em\u003E), and we will message you as soon as we can.\u003Cbr\u003E\n \n\u003C/li\u003E\n\u003C/ul\u003E\u003Cul\u003E\u003Cli\u003E\n\u003Cstrong\u003E You can\u0027t customize your profile \u003C/strong\u003E-\u003Cstrong\u003E \u003C/strong\u003EOne of the cool things about a forum is having your own identity that others can associate with you. The picture next to your post is your avatar, you can select whatever you want to represent you, as long as it follows our \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/guidelines/\u0022 rel=\u0022\u0022\u003ECommunity Guidelines\u003C/a\u003E. Inside your profile, you can change various settings to display information you want shared with the community. We ask though, you do not reveal information that could possibly identify yourself in the real world, especially if you are a minor (under 18 years of age).\u003Cstrong\u003E  \u003C/strong\u003EFor your protection, the email address you used to register is \u003Cem\u003Enever\u003C/em\u003E revealed to the general public. But, like posts and PMs above, you cannot edit your profile until you have reached the 5 post count. Then you can add an avatar, profile pics, and info as you desire. \n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Csup\u003E*\u003C/sup\u003E - A note about your post count:  Posts in the Lounge and Games forums do not count towards your post count.  So posts in these locations will not bring you closer to your 5 post mark.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Gargamel","CreatedById":64714,"CreatedDateTime":"2019-05-13T00:05:54Z","Content":"\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cstrong\u003ETHE FORUMS: What Goes Where?\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nNow, let\u0027s take a look around the forums a bit. This guide will help you get started in the forums, but if you need some help on more specific things about how to use the forums, we have \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/126609-how-to-use-the-forums/\u0022 rel=\u0022\u0022\u003Ethis great thread on just that topic\u003C/a\u003E. It will cover most of the stuff you need to know. If not, you can ask there or in the \u0022\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/111158-ask-the-mods-questions-about-the-forums/\u0022 rel=\u0022\u0022\u003EAsk the Mods\u003C/a\u003E\u0022 thread (\u003Cem\u003Esee \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/184448-new-member-guide-52019/\u0026amp;do=findComment\u0026amp;comment=3598053\u0022 rel=\u0022\u0022\u003EContacting A Moderator\u003C/a\u003E below\u003C/em\u003E). In fact, I highly recommend reading the \u0022\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/126609-how-to-use-the-forums/\u0022 rel=\u0022\u0022\u003EHow to use the Forums\u003C/a\u003E\u0022 thread once you get settled and get a feel for the basics. \n\u003C/p\u003E\n\u003Cp\u003E\nLet\u0027s take a look at some of the sections of the forum you might be most interested in as a new member. Take a look at the description of each sub-forum on the main page: they each have their own content to offer, and you might find a home in one of them. But I\u0027ll just be looking at the most common ones for which you might have signed up with us:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\n\u003Cstrong\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/forum/53-general/\u0022 rel=\u0022\u0022\u003EGeneral\u003C/a\u003E \u003C/strong\u003E- This is where SQUAD posts updates and such on upcoming KSP releases. \n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/forum/32-ksp-discussion/\u0022 rel=\u0022\u0022\u003EKSP Discussion\u003C/a\u003E\u003C/strong\u003E - This is just general talk about the game itself.  Questions and Tech support go other places.\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/forum/16-gameplay-questions-and-tutorials/\u0022 rel=\u0022\u0022\u003EGameplay Questions\u003C/a\u003E \u003C/strong\u003E- This is where you ask \u0022How do I do X?\u0022, and the forum will answer you.  You might want to check out the \u003Cstrong\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/171097-faq/\u0022 rel=\u0022\u0022\u003EFAQ\u003C/a\u003E\u003C/strong\u003E to start with.\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003ETech Support: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/forum/69-technical-support-pc-unmodded-installs/\u0022 rel=\u0022\u0022\u003EStock\u003C/a\u003E, \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/forum/70-technical-support-pc-modded-installs/\u0022 rel=\u0022\u0022\u003EModded\u003C/a\u003E, and \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/forum/81-technical-support-playstation-4-xbox-one/\u0022 rel=\u0022\u0022\u003EConsole\u003C/a\u003E\u003Cspan\u003E \u003C/span\u003E\u003C/strong\u003E-  If the game doesn\u0027t seem to be working properly, ask here. \n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/forum/4-add-ons/\u0022 rel=\u0022\u0022\u003EAdd-ons\u003C/a\u003E\u003C/strong\u003E -  If you want to talk about or find mods for the game, this is the place.\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/forum/6-community/\u0022 rel=\u0022\u0022\u003ECommunity\u003C/a\u003E\u003C/strong\u003E - Stuff not directly related to the game itself, but mainly about the forums.  Fun place to hang out. \n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/forum/96-making-history-expansion/\u0022 rel=\u0022\u0022\u003EMaking History\u003C/a\u003E\u003C/strong\u003E / \u003Cstrong\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/forum/105-breaking-ground-expansion/\u0022 rel=\u0022\u0022\u003EBreaking Ground\u003C/a\u003E\u003C/strong\u003E - For topics that directly relate to the KSP DLCs. \n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nThere are many more forums and sub-forums. We encourage you to check them all out.\n\u003C/p\u003E\n"},{"CreatedByName":"Gargamel","CreatedById":64714,"CreatedDateTime":"2019-05-13T00:06:40Z","Content":"\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cstrong\u003EPOSTING\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nWhile you might choose to lurk for a while before posting anything, most people find it more fun and rewarding to be active participants in the community. You do this by posting messages to threads within the forums. You can even start a new one if you can\u0027t \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/search/\u0022 rel=\u0022\u0022\u003Efind one\u003C/a\u003E on that topic already existing. Feel free to contribute right away!\n\u003C/p\u003E\n\u003Cp\u003E\nBut before you do, I\u0027d like to you to read at least the first post in these two threads:  \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/13107-the-good-conduct-guide/\u0022 rel=\u0022\u0022\u003EThe Good Conduct Guide\u003C/a\u003E and \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/100734-the-positive-forum-movement-updated-4-december-2015/\u0026amp;page=1\u0022 rel=\u0022\u0022\u003EThe Positive Forum Movement\u003C/a\u003E. These two posts encapsulate what we strive to have here on the KSP Forums; a friendly place to discuss one of our favorite games, and to also discuss other stuff about science and the world around us. We maintain these forums as a family friendly place and expect you to try to do the same. \n\u003C/p\u003E\n\u003Cp\u003E\nWhile we are pretty open about we we talk about here, there is some basic forum etiquette you should try to follow:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\n\u003Cstrong\u003EDoes the post adhere to our\u003Cspan\u003E \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/guidelines/\u0022 rel=\u0022\u0022\u003ECommunity Guidelines\u003C/a\u003E\u003C/span\u003E?\u003C/strong\u003E  These are the rules that you are required to follow when posting to the forums.  If you are unsure if a post meets these guidelines, feel free to ask one of the moderators in a PM for advice (see below).  While your first few posts do require approval, submitting a post for approval that doesn\u0027t meet these guidelines is frowned upon.  Embedded content or links to outside content must also follow these guidelines.  If you have any question, just ask first. \u003Cbr\u003E\n \n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EDoes the post have content relevant to the thread?\u003C/strong\u003E  While we do encourage everyone to get involved, it becomes cumbersome to other members of the forum if they have to scroll through pages of contentless posts before reaching something of value. So consider if what you are posting adds to the discussion at hand. But don\u0027t let this dissuade you from posting, if what is a simple thing to veteran players might be a complicated question for you, then ask away.\u003Cbr\u003E\n \n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003ENecroing\u003C/strong\u003E is the act of posting to a thread that is very old.  Usually these threads have died off for a reason, and they might be better off that way. If what you are posting is relevant to the conversation in the thread, and the subject matter of the thread is not outdated for whatever reason, then it\u0027s ok to necro a thread.  But if the thread only kind-of fits the comment or question you want to post, then you might be better off finding a newer thread, or even starting one yourself. \u003Cbr\u003E\n \n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EIs there a current similar thread?\u003C/strong\u003E  Before starting a new thread, take a look at the first couple pages of a forum. What you are planning to ask might already be actively being discussed by the community. If so, ask in that thread. The moderators will often merge similar threads together that have the same topic, and sometimes that can make the resulting discussion very confusing to follow. To avoid this confusion, it\u0027s better to post in a current thread than to start a new one. Even if you can\u0027t find a current thread, your new thread might still get merged. We have a bunch of \u0022mega\u0027 threads on the forums, and we often merge new threads on the same topic together into these preexisting threads. If that happens, don\u0027t worry, you did nothing wrong, sometimes those bigger threads are hard to find. \u003Cbr\u003E\n \n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EIs this new thread in the right forum? \u003C/strong\u003E As mentioned above, we have sub forums for various topics of discussion. Try to do your best to place your thread in the right subforum for the topic. If you don\u0027t, it\u0027s not a big deal and we can easily move it later, but it\u0027s easier for everybody if it\u0027s in the right place to start with. It might take you a little time to get a feel for where each type of thread really belongs, so don\u0027t worry if we do move your thread without warning. Each time we move a thread, we\u0027ll leave a link to it\u0027s new location. But these links only remain for 24 hours, so if you don\u0027t visit the forums in that time, you may be wondering where your thread went. If so, click on your avatar and look at your activity stream,  because this will show everything you have posted and you can find the thread there.\u003Cbr\u003E\n \n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EBe courteous to Mod Makers\u003C/strong\u003E - Mod makers work on their mods in their free time. They know when KSP gets updated, so asking them for updates can be very taxing for the mod maker. We call this \u0022\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/135596-psa-dont-poke-the-bears-translation-dont-pester-the-modmakers-for-updates/\u0022 rel=\u0022\u0022\u003EPoking the Bears\u003C/a\u003E,\u0022 if it\u0027s done rudely or too often, and it\u0027s considered rude and bad form. You can usually tell by how active a mod thread is if the mod will be updated soon or not.  If you have a question about a mod though, feel free to ask away. \n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nThat\u0027s all we ask of you as a new member.  When you are posting, as mentioned in the two threads I urged you to read above, consider what you are saying. Talk to others the same way you would want to be talked to. \n\u003C/p\u003E\n\u003Cp\u003E\nOur editor is WYSIWYG (What You See Is What You Get), so most formatting issues that you might experience will be visible to you before posting. If you are writing up a complicated post with some formatting in it, we have a \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/183021-pretty-good-test-thread/\u0022 rel=\u0022\u0022\u003ETest Thread \u003C/a\u003Ethat is ideal for testing out formatting and the like. Use it instead of creating a new thread where you work out the bugs of a post.   \n\u003C/p\u003E\n\u003Cp\u003E\nIf you\u0027d like to post a picture in your post, it\u0027s pretty simple here.   There are more detailed instructions in the \u0022How to use the forums\u0022 thread mentioned above, but you simply have to paste the direct link from the picture into your post.   Don\u0027t use the embed or html codes some sites offer.  Usually it\u0027s easiest to just right click the picture, copy it\u0027s location, and then right-click paste in your KSP forum post. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-09-12T05:37:25Z\u0022 title=\u002209/12/2021 05:37  AM\u0022 data-short=\u00222 yr\u0022\u003ESeptember 12, 2021\u003C/time\u003E by Gargamel\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Gargamel","CreatedById":64714,"CreatedDateTime":"2019-05-13T00:07:25Z","Content":"\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cstrong\u003ECONTACTING A MODERATOR\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nSometimes, you just need to ask for help. Or even point out something amiss on the forums, be it a thread in a wrong place, spam you\u0027ve noticed, or questionable content that needs to be removed.  That\u0027s where the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/183277-the-forum-moderating-team/\u0022 rel=\u0022\u0022\u003Emoderators\u003C/a\u003E come in. We are here to help. As a new member, you can\u0027t send a new PM as mentioned above, so there a couple ways you can get in touch with us.\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\n\u003Cstrong\u003EReporting a Post \u003C/strong\u003E- This is by far the most efficient method of letting the moderators know about something. In the top right corner of every post, there is a button that says \u0022Report Post.\u0022  Clicking on that will bring up an editor box, where you should enter some info about the problem.  Leaving it blank can make it difficult for us to figure out what the issue might be, so help us out and fill in some info. This will create an alert that all moderators on the forums will see. We can respond much faster to it that way than trying to contact us individually or in a thread. Even if you just want to have a PM conversation with a moderator about something relevant to the forums, report a post, any post, and we\u0027ll contact you as soon as we can. \u003Cbr\u003E\n \n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003E\u0022\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/111158-ask-the-mods-questions-about-the-forums/\u0022 rel=\u0022\u0022\u003EAsk The Moderators\u003C/a\u003E\u0022 Thread\u003C/strong\u003E - If something you need addressed is not urgent, you can pose your question in this thread. We will respond fairly promptly, and will openly discuss any matter that we are allowed to. If using the report button has not gotten a PM from one of us, you can ask in this thread to be PMed by a mod, but this will be a rare occurrence, as we usually check the reports first.  \n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nUse the report button as you see the need. If you notice something wrong with a post, maybe it\u0027s in the wrong forum, or there\u0027s something in it that violates our \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/guidelines/\u0022 rel=\u0022\u0022\u003ECommunity Guidelines\u003C/a\u003E, then click the report button, let us know what is happening. As long as you don\u0027t abuse it, the worst that can happen is that we decide it\u0027s not worth doing anything about, and everybody goes on their way. \n\u003C/p\u003E\n\u003Cp\u003E\nWell, that\u0027s the welcome wagon.  I hope you enjoy your time here, we all do.  We hope to see more of you in the future, and become a solid member of our community. \n\u003C/p\u003E\n"}]}