{"TopicId":18969,"ForumId":24,"TopicTitle":"A Writer\u0027s Introduction","CreatedByName":"GeotheArch","CreatedById":48284,"CreatedDateTime":"2012-09-10T05:33:50Z","PageNum":1,"Articles":[{"CreatedByName":"GeotheArch","CreatedById":48284,"CreatedDateTime":"2012-09-10T05:33:50Z","Content":"\n\u003Cp\u003EHello all,\u003C/p\u003E\u003Cp\u003EName\u0027s Geo, or Geoff- I respond to either. I\u0027ve been a KSP mass murd- planetary explorer for a little over half a year now and it\u0027s finally time I dip my toe into the forum. Very briefly, I run my program on the Jeb Kermin style of rocketry, (Who needs equations to have a little fun?) and my KSP claim to fame is that I have successfully touched down and performed an EVA on Minmus, but not yet the Mun. Jedfel Kermin is still, ah- performing long term vital experiments on the surface of Minmus as I type. \u003C/p\u003E\u003Cp\u003EThat said, I\u0027m starting to shift more towards a realistic style of play, with the eventual goal of retrieving Jedfel. So we\u0027ll see how that goes. Around these parts, you can expect to find me in the fan-works section. I\u0027m something of a writer, and the other day as I was explod-testing new lander stages I started thinking about the mission control fellows for the first time, and how they must change as a player goes from, \u0027Whee explosions!\u0027 to \u0027Crunching numbers and doing rocket science\u0027. So keep an eye out in the next week or so for the start of a story-esque piece as my KSC management is \u0027let to to explore other opportunities\u0027 and the new guy is brought in to change things around. \u003C/p\u003E\u003Cp\u003ELook forward to meeting you all.\u003C/p\u003E\n"},{"CreatedByName":"Capt\u0026#039;n Skunky","CreatedById":1261,"CreatedDateTime":"2012-09-10T06:30:03Z","Content":"\n\u003Cp\u003EHappy Launching!\u003C/p\u003E\u003Cp\u003EArrr!\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECapt\u0027n Skunky\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022color:#800080;\u0022\u003EKSP Community Manager\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2012-09-10T16:54:58Z","Content":"\n\u003Cp\u003EHi GeotheArch, welcome to the community \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m looking forwards to reading your stuff, plus good luck on rescuing Jedfel, you can send a 3 Kerbal pod with 1 empty seat, or you could try the \u003Ca href=\u0022http://kerbalspaceprogram.com/forum/showthread.php/9243-v0-16-Damned-Aerospace-Version-1-5-3-Crewtank\u0022 rel=\u0022external nofollow\u0022\u003Ecrewtank\u003C/a\u003E.\u003C/p\u003E\n"}]}