{"TopicId":20715,"ForumId":24,"TopicTitle":"Hey Guys!","CreatedByName":"CptAsian","CreatedById":49792,"CreatedDateTime":"2012-09-28T20:25:23Z","PageNum":1,"Articles":[{"CreatedByName":"CptAsian","CreatedById":49792,"CreatedDateTime":"2012-09-28T20:25:23Z","Content":"\n\u003Cp\u003EHey, CptAsian here. \u003C/p\u003E\u003Cp\u003ESo, I guess I\u0027ll start out by sharing how I found out about Kerbal Space Program. I found out about KSP by watching some video that my friend sent me about some guy, many of you may have heard of him, by the YouTube channel name of \u0022kurtjmac\u0022. I watched part of one of his KSP videos, and I enjoyed it, and so I watched his whole series. I play on a Mac, and was very happy to discover that KSP is available for Mac, unlike what feels like every single other game on the planet. Anyhow, I played and really enjoyed the demo, so I bought the game and have been playing it a bit for a month or so. I never bothered to make an account on the forums, but here I am. \u003C/p\u003E\u003Cp\u003EOne quick question I might add here: Has anyone else gotten KSP 0.17 on a Mac? The download seems to be very different from the 0.16, and I can\u0027t seem to find the game itself. I\u0027ll look again, just to be sure that I\u0027m not just being silly.\u003C/p\u003E\u003Cp\u003EAnyhow, I have to say that in-game, I\u0027m much more entertained by the spaceplanes than the rockets. It\u0027s just me. I\u0027d like to say that I\u0027m about average at this game. Maybe a little below average, but I really enjoy it, so it\u0027s cool.\u003C/p\u003E\u003Cp\u003EWell, I guess that\u0027s all, so see you all on the forums, and happy launching!\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2012-09-28T20:34:31Z","Content":"\n\u003Cp\u003EHi CptAsian, welcome to the community \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EUnfortunately the patcher is buggy on OSX, and it is advised that Mac users download the full release from their store profile download page,\u003Ca href=\u0022http://kerbalspaceprogram.com/forum/showthread.php/7149-Downloading-KSP-from-the-Store\u0022 rel=\u0022external nofollow\u0022\u003E instructions here\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EKurt has introduced a lot of players to KSP, his videos are very popular \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI have to agree about the planes, being able to make our own is a lot of fun and a lot less difficult than reaching the new planets in 0.17\u003C/p\u003E\u003Cp\u003EI hope you have fun here on the forums CptAsian \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"CptAsian","CreatedById":49792,"CreatedDateTime":"2012-09-28T22:28:37Z","Content":"\n\u003Cp\u003EThanks for the help. The new update is \u003Cstrong\u003Eincredible\u003C/strong\u003E. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"roadrayj","CreatedById":31790,"CreatedDateTime":"2012-09-29T06:02:05Z","Content":"\n\u003Cp\u003EHello CptAsian!\u003C/p\u003E\u003Cp\u003EI found KSP from my favorite Youtube LP\u0027er Kikoskia, I loved his appreciation of the game but he rarely takes his games seriously so I had to look for a \u0022serious\u0022 LP\u0027er for KSP and found kurtjmac as well. The man knows what he\u0027s doing! Can\u0027t say the same for myself, but my 6 year old makes up for my lack of creative thinking! I just know how a keyboard works and have hands big enough to use it! \u003C/p\u003E\u003Cp\u003EBTW, watch kurt\u0027s video on building his Lego space shuttle. It\u0027s good for quite a few laughs!\u003C/p\u003E\n"},{"CreatedByName":"CptAsian","CreatedById":49792,"CreatedDateTime":"2012-10-05T00:55:24Z","Content":"\n\u003Cp\u003EI just watched that. Hilarious.\u003C/p\u003E\n"}]}