{"TopicId":26799,"ForumId":24,"TopicTitle":"Newbie requires some advice.","CreatedByName":"T3E","CreatedById":66021,"CreatedDateTime":"2013-05-14T09:03:03Z","PageNum":1,"Articles":[{"CreatedByName":"T3E","CreatedById":66021,"CreatedDateTime":"2013-05-14T09:03:03Z","Content":"\n\u003Cp\u003EHello Guys.\u003C/p\u003E\u003Cp\u003ESince few days I am also happy owner of this unique game, and I enjoy it since then 24/7.\u003C/p\u003E\u003Cp\u003EEven tho I lurked through the forum and the internet, i still have issues with certain things, maybe someone can help me out (if you can answer one question, its good for me!)\u003C/p\u003E\u003Cp\u003ESo far I managed to reach every desired Orbit around Kerbal, also Orbits around were achieved.\u003C/p\u003E\u003Cp\u003E1) I fail to land on the Moon. I reach the Orbit, I manage to get a good angle on the surface on the moon and then the problem starts: \u003C/p\u003E\u003Cp\u003EI run out of fuel OR the engine is to weak (or i started to late to slow down) to make a smooth landing. I mean, i struggle at landing the moon with my fuel, not even talking about the way home to send my dear astronauts home. \u003C/p\u003E\u003Cp\u003EIf I add more tanks (all kind, at all kind of stages) it doesnt change a thing usually (due to increased weight I guess). \u003C/p\u003E\u003Cp\u003EI tried it with small rockets (1man capsule) and bigger ones, small ones were much better. (i have no clue how you guys send the heavy 3 man capsule to the moon). \u003C/p\u003E\u003Cp\u003E2) For the future I plan to get to other planets as well ofc. I once overshot over the moon orbit and ended up in an orbit around the sun with no real way or possible solution to LEAVE the sun orbit somehow. How do you guys \u0022plan\u0022 a voyage to planets more far away?\u003C/p\u003E\u003Cp\u003E3) Is there a possibility to build a \u0022hull\u0022 around satellites? Like some aerodynamic hull I can remove when I am in space? (english isnt my native language, I hope you get why I mean \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E )\u003C/p\u003E\u003Cp\u003EThats it so far, but sure I will post more questions in the near future ;\u0026gt;\u003C/p\u003E\u003Cp\u003ECheers\u003C/p\u003E\n"},{"CreatedByName":"AlexL","CreatedById":32200,"CreatedDateTime":"2013-05-14T09:30:38Z","Content":"\n\u003Cp\u003EHello t3e, welcome to the forums!\u003C/p\u003E\u003Cp\u003Econgratulations on making orbit so quickly, my first week was spent much closer to the surface. Don\u0027t be disheartened if it takes a while to reach the mun, it\u0027s a real challenge to get a first landing, but when you do, it\u0027ll be awesome. I\u0027d recommend you look for some tutorials, try Scott Manley on youtube.\u003C/p\u003E\u003Cp\u003EThis should help you with the mun\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/eVPMTQfOvYQ?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EHe should also be able to help you reach other worlds.\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/jiB2ywSM6i0?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EIn the game as it is, you can build a \u0027hull\u0027 or \u0027shroud\u0027 around your satellites, but they will not reduce drag or help you launch due to the current drag system. If you do, it\u0027s just for show.\u003C/p\u003E\u003Cp\u003EGood luck!\u003C/p\u003E\u003Cp\u003EAlexL\u003C/p\u003E\n"},{"CreatedByName":"T3E","CreatedById":66021,"CreatedDateTime":"2013-05-14T09:59:50Z","Content":"\n\u003Cp\u003EThanks for the Link! \u003C/p\u003E\u003Cp\u003EI was first shocked with what a simple rocket this dude is flying, I usually go for more stages \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlso I didnt know about the maneuvers, i always estimated it by myself how to get to and where to burn \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AlexL\u0022 data-cite=\u0022AlexL\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EIn the game as it is, you can build a \u0027hull\u0027 or \u0027shroud\u0027 around your satellites, but they will not reduce drag or help you launch due to the current drag system. If you do, it\u0027s just for show.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo assuming I like the show, with which parts do you mainly do it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E ? Most of the things are quite flat and wouldnt really look like I imagine ;\u0026gt;\u003C/p\u003E\u003Cp\u003EKudos and thanks\u003C/p\u003E\n"},{"CreatedByName":"smunisto","CreatedById":57789,"CreatedDateTime":"2013-05-14T13:54:37Z","Content":"\n\u003Cp\u003EThe \u0022hull\u0022 is called \u0022Fairing\u0022. For the stock game, as it is, the easiest way to have a fairing (or hull) is by building one of structural plates, beams and hardpoints(which can be ejected, i am almost sure there was a hardpoint with ejection force on it in the stock game).\u003C/p\u003E\u003Cp\u003EIf you want something much simpler(in terms of part count) and better looking you might want to take a look at the KW Rocketry revised mod pack, which adds 6 types of fairings in 3 different sized, 3m diameter parts such as fuel tanks, engines and more. \u003C/p\u003E\u003Cp\u003EYou may want to hold up a little with mods though, since at this stage in your \u0022career\u0022 in KSP they are more like to confuse you with the bigger part variety and complexity\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-14T13:57:12Z\u0022 title=\u002205/14/2013 01:57  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 14, 2013\u003C/time\u003E by smunisto\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"joppiesaus","CreatedById":57698,"CreatedDateTime":"2013-05-14T14:03:10Z","Content":"\n\u003Cp\u003Ewelcome to the forums! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E1) I have a craft you can train on here!\u003C/p\u003E\u003Cp\u003E2) same like the mun, but than bigggger!\u003C/p\u003E\u003Cp\u003E3) that hull you can call fairings!\u003C/p\u003E\u003Cp\u003Eto build one, just use some radial decouplers and the structural panels, there aren\u0027t fairings implented yet.\u003C/p\u003E\n"},{"CreatedByName":"T3E","CreatedById":66021,"CreatedDateTime":"2013-05-14T14:37:34Z","Content":"\n\u003Cp\u003EI just landed on the moon \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003ESince I understand \u0022Add maneuver\u0022 game got much easier!\u003C/p\u003E\u003Cp\u003ESadly the height indicator fooled me and when there was still 1km to go, i hit the ground (thank god with low speed) so I lost my engine.\u003C/p\u003E\u003Cp\u003EBut Bill Kerman survived and made the first Steps on the moon (in my universe at least ;\u0026gt;).\u003C/p\u003E\u003Cp\u003EThanks to additional tanks I also had enough fuel to go back, so at least I figured out a good rocket model. \u003C/p\u003E\u003Cp\u003EOne quick question:\u003C/p\u003E\u003Cp\u003EThe two tanks, do they get used first due to the fuel ducts? Or due to the lack of additional engines I use all tanks at the same time? If so, is it possible to use the 2 first before the main one? \u003C/p\u003E\u003Cp\u003EDo more fuel ducts have any impact? \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/5Lc5YUR.png\u0022 alt=\u00225Lc5YUR.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlso Bill sends greetings (sadly he disappeard after i restarted the game,thank god i made a snapshot with my mobile before).\u003C/p\u003E\u003Cp\u003ESorry for the quality, but I blame lousy communication systems I installed! \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/FHRuc9n.png\u0022 alt=\u0022FHRuc9n.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ECheers\u003C/p\u003E\u003Cp\u003EEdit:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022smunisto\u0022 data-cite=\u0022smunisto\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EIf you want something much simpler(in terms of part count) and better looking you might want to take a look at the KW Rocketry revised mod pack, which adds 6 types of fairings in 3 different sized, 3m diameter parts such as fuel tanks, engines and more. \u003C/p\u003E\u003Cp\u003EYou may want to hold up a little with mods though, since at this stage in your \u0022career\u0022 in KSP they are more like to confuse you with the bigger part variety and complexity\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks for the hint. But I decided like you advised, to play around without mods first. Will do that when the stock parts arent enough anymore \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-14T14:39:47Z\u0022 title=\u002205/14/2013 02:39  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 14, 2013\u003C/time\u003E by T3E\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Crown","CreatedById":18262,"CreatedDateTime":"2013-05-14T16:29:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022T3E\u0022 data-cite=\u0022T3E\u0022\u003E\u003Cdiv\u003E1) I fail to land on the Moon.[...]\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt actually is possible to land the lander from the \u003Cem\u003Escenarios\u003C/em\u003E-section. What helped me a lot is to know that Apollo did leave the engine on all the time. Just a little bit. And I do the landing with about three major burns. First I come in quite shallow, looking as if I would overshoot the target. While approaching the ground I do burns to make my descent path more steep. The rest is trial and error and learning by doing.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022T3E\u0022 data-cite=\u0022T3E\u0022\u003E\u003Cdiv\u003E[...]How do you guys \u0022plan\u0022 a voyage to planets more far away?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI usually test my rockets if the vessel\u0027s inter-planetary apoapsis can reach the target planet\u0027s orbit. Usually I overpower the rockets but don\u0027t think about a return. I honestly calculate the angles for rendez-vous and interplanetray travel. Direct travel, no sling-shots or anything. This is far over my ability to calculate.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022T3E\u0022 data-cite=\u0022T3E\u0022\u003E\u003Cdiv\u003E3) Is there a possibility to build a \u0022hull\u0022 around satellites?[...]\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere is a website (which\u0027s URL I forgot) where you can design some fairings. But you don\u0027t need them other than for fancy looking rockets, because the game doesn\u0027t care about a satellite open to air or under a shell.\u003C/p\u003E\n"},{"CreatedByName":"AlexL","CreatedById":32200,"CreatedDateTime":"2013-05-14T16:36:18Z","Content":"\n\u003Cp\u003ECongratulations on surviving your collision with the mun!\u003C/p\u003E\u003Cp\u003EAs you noticed, the altimiter does not show distance to the ground (some command pods have one inside that does, but only works when less than 3000m above the surface)\u003C/p\u003E\u003Cp\u003EThe fuel will get taken from the outer tanks first. The engine will use the fuel thats furthest away from it, so both the outer tanks will drain first, then the inner.\u003C/p\u003E\u003Cp\u003EIf you want to take a screenshot, the F1 button is your friend, these shots can be found in the games Screenshots folder.\u003C/p\u003E\u003Cp\u003EAs for your missing pilot, I may know the cause. If when you were shutting down, you press the \u0022end flight\u0022 button, the thing you\u0027re controlling will be removed from the game. Next time if you want to return to your person/ship/whatever, make sure to hit the space center button and exit from there.\u003C/p\u003E\u003Cp\u003EHappy rocketeering!\u003C/p\u003E\u003Cp\u003EEdit: If you want to practice landings, you can get fairly good by practicing at the space center\u003C/p\u003E\n"},{"CreatedByName":"T3E","CreatedById":66021,"CreatedDateTime":"2013-05-14T17:44:07Z","Content":"\n\u003Cp\u003EOkay, update: I landed on the moon. And I was mistaken that I had enough fuel. Sadly Jebediah Kerman will be forever in the Kerbin Orbit in 9000km altitude. Poor guy.\u003C/p\u003E\u003Cp\u003ESo the question is now: Additional fuel tank on the lander? would it be really that easy? Or is it more about more efficiency regarding the landing? I wasted nearly 50% on the landing. \u003C/p\u003E\u003Cp\u003EAnd dear god, I just found out theres a quick save/load option. Sorry Kermans, that I wasted a whole village for my space program.\u003C/p\u003E\u003Cp\u003ECheers\u003C/p\u003E\u003Cp\u003Ep.s.\u003C/p\u003E\u003Cp\u003Ethanks for the \u0022End Flight\u0022 button advice, its better to learn it now then when I did something really big \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2013-05-14T17:50:46Z","Content":"\n\u003Cp\u003EWelcome to the forums! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ve been working on a little project to collect as many links to useful info as I can. Be sure to check out \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/28352-The-Drawing-Board-A-library-of-tutorials-and-other-useful-information\u0022 rel=\u0022external nofollow\u0022\u003EThe Drawing Board\u003C/a\u003E; it\u0027s got many helpful tutorials, graphs, and other such information that you might find useful.\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2013-05-14T22:09:16Z","Content":"\n\u003Cp\u003EWelcome to the community T3E \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs you can already see, we are all very helpful and glad to see new players, it does not matter what your skill level is, it\u0027s still possible to have fun in KSP, and in fact learning can be the most fun of all \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Malaugrym","CreatedById":57689,"CreatedDateTime":"2013-05-15T06:37:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022T3E\u0022 data-cite=\u0022T3E\u0022\u003E\u003Cdiv\u003EOkay, update: I landed on the moon. And I was mistaken that I had enough fuel. Sadly Jebediah Kerman will be forever in the Kerbin Orbit in 9000km altitude. Poor guy.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt is my painful duty to inform you that, should Jebediah be left in his current location, all your future endeavors are doomed to messy, painful failure. Jebediah\u0027s presence is required at all points where \u0022MOAR POWER\u0022 is required. All other Kerbals are relatively expendable. Therefore, a rescue mission is an absolute necessity. I wish you luck. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Capt\u0026#039;n Skunky","CreatedById":1261,"CreatedDateTime":"2013-05-15T09:03:09Z","Content":"\n\u003Cp\u003EHappy Launching!\u003C/p\u003E\u003Cp\u003EArrr!\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECapt\u0027n Skunky\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#800080;\u0022\u003E\u003Cstrong\u003EKSP Community Manager\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"Boffinbox","CreatedById":64687,"CreatedDateTime":"2013-05-15T09:33:55Z","Content":"\n\u003Cp\u003Ean additional fuel tank would add only slightly more use to the lander - because the increased fuel would be (nearly) counteracted by the extra weight of the lander, meaning you would have to thrust harder to have a similar deceleration to the surface. i wouldn\u0027t worry about your efficiency in landing on a \u0022good\u0022 trajectory at this time, because not only would you have to focus on your speed, but also the direction your ship is pointing in. easier to get yourself still above the surface and then descend straight down.\u003C/p\u003E\u003Cp\u003Eas for the fuel ducts, they work by drawing fuel from the outermost tanks, and in the direction of the arrows on the fuel lines\u003C/p\u003E\u003Cp\u003Esoldier on, it\u0027s really rewarding when you can get a kerbal there and back unharmed \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"T3E","CreatedById":66021,"CreatedDateTime":"2013-05-15T17:21:08Z","Content":"\n\u003Cp\u003EHello again,\u003C/p\u003E\u003Cp\u003EYeah i followed your advice and removed the fuel tanks, i went with 1 FLT-400 on my landing module, worked out very well.\u003C/p\u003E\u003Cp\u003EAfter all, I tried today the first time with the newly discovered quick safe ability.\u003C/p\u003E\u003Cp\u003EOne fail landing (again in the last 10s things went wrong) but in the 2nd try i managed very well a smooth landing.\u003C/p\u003E\u003Cp\u003ENothing new so far, but since I (somehow) picked excellent timing and position with the maneuvers, i had plenty fuel left for THE WAY BACK HOME \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo Jebediah Kerman, first Kerbal on Mun returned safely and (maybe little hot due to the entrance angle back to Kerbin) happy home!\u003C/p\u003E\u003Cp\u003EThank you all for the advice.\u003C/p\u003E\u003Cp\u003EI also noticed that I kinda abused the forum section since I didnt really introduced myself and went straight to the questions:\u003C/p\u003E\u003Cp\u003EIm a 23y young, and study Maritime Engineering in Germany (Bremen to be exact).\u003C/p\u003E\u003Cp\u003EI think you probably wont see me for the last time, my to-do list is quite long and will be probably enough for over a year \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ET3E\u003C/p\u003E\n"}]}