{"TopicId":28811,"ForumId":24,"TopicTitle":"Hello my name is Sma and I\u0027m a Kerbaholic.","CreatedByName":"Sma","CreatedById":67377,"CreatedDateTime":"2013-05-24T15:43:24Z","PageNum":1,"Articles":[{"CreatedByName":"Sma","CreatedById":67377,"CreatedDateTime":"2013-05-24T15:43:24Z","Content":"\n\u003Cp\u003E(Hopefully this doesn\u0027t double post I ran out of time typing it up and had to login again and I wasn\u0027t sure if it submitted.)\u003C/p\u003E\u003Cp\u003EWell, my game name is Sma. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E I don\u0027t really remember when I first got KSP, but earlier this year someone I know from playing the Facebook game Battle Pirates said her husband was playing KSP. I looked it up downloaded the demo (0.18.3) and started playing. It seemed a little familiar then I found out I had already downloaded it (0.8.5). Quite a lot of difference between the two haha.\u003C/p\u003E\u003Cp\u003EI decided to buy the full version (0.19.? I forget the last bit) on my birthday just last month. It\u0027s been great fun so far. I can get to orbit pretty much all the time now. Still have problems docking but that\u0027s getting easier. I haven\u0027t installed mechjeb yet, don\u0027t really plan to as I want to keep it as vanilla as possible. Though I have installed the subassembly loader (which I think seems to works better now that .20 is out) plugin and I downloaded KSPX for the panoptican module, but now that CL is a part of Squad and added the Cupola I can swap out the panoptican module for the cupola, as soon as I can battle the lag my station creates so I can replace it (I guess I could edit the save file but where\u0027s the challenge in that).\u003C/p\u003E\u003Cp\u003EI have put a lander with an attached minish rover on the Mun as well as two different groups of Scott Manley-isque stand alone base lights. The first version seems to run out of fuel too soon though it can land, with out fuel, if I\u0027m careful and lucky. I\u0027ve also put a satellite in orbit around the Mun and one in geosync with Kerbin. Currently I\u0027m in the process of testing sections I\u0027m going to be using for an orbital refueling station around Kerbin, which of course could also be placed around other places in the Kerbin system. Granted it won\u0027t be much help further from Kerbin until the resource system comes out (or I break down and install the kethane mod), how ever I think it\u0027ll work ok for Kerbin orbit for when a launch reaches orbit and has spare fuel in a stage, or when a flight returns from somewhere else and has spare fuel.\u003C/p\u003E\u003Cp\u003EI tried to register for the forum the same day I bought the game but it kept saying something about spam or something when I tried to sign up(using the same e-mail address that I used to sign up yesterday). Currently my best computer is a laptop (Asus K50i), and while the specs aren\u0027t that bad (I\u0027ve had it for about two years, and it\u0027s a refurbished one so maybe its about 3yo), it does have lag every now and then. Mostly with my space station which I\u0027m building in modules one section at a time.\u003C/p\u003E\u003Cp\u003EAside from all that I\u0027m a huge space fan (I think it\u0027s safe to say we all are \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E ) I grew up watching shuttle launches (I was born about a week too late to see the first launch) from my parents backyard on the Space Coast, and my dad worked on the shuttles for 30 years up until the last two launches. He was with the program from the start, and even did some tile work on Columbia in his early years out there. I try to catch every major rocket launch there is, either by stepping outside, or watching it online. Really excited about the future of the commercial companies such as SpaceX, Orbital Sciences, Virgin Galactic(SpaceShip One and Two) and all the others. I\u0027m also actually thinking about building one of those Nano cube sats with an Audrino when I can spare the change. They can be built rather cheaply I\u0027ve heard, somewhere around $100-$300, of course I have no idea what I\u0027d make it do though. That and getting it to orbit wouldn\u0027t be easy or cheap, but at least I could say I own a satellite, even if it never makes it into space. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnyway I guess that\u0027s enough for now. I\u0027ve got hardware to get to orbit later. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2013-05-24T19:09:38Z","Content":"\n\u003Cp\u003EHey Small and welcome to the forums! Building a real life satellite would be awesome. You could always get it to play the KSP theme tune on continuous loop. Think of it as a modern version of Sputnik\u0027s \u0027beep....beep...beep\u0027 :-)\u003C/p\u003E\n"},{"CreatedByName":"Sma","CreatedById":67377,"CreatedDateTime":"2013-05-24T22:19:55Z","Content":"\n\u003Cp\u003EHaha, I like that idea \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E both over a speaker and some sorta radio transmitter....guess I would need a FCC licence. Unless there is a way around that some how. Oh well, not like I\u0027ll be building it any time soon haha.\u003C/p\u003E\n"},{"CreatedByName":"Capt\u0026#039;n Skunky","CreatedById":1261,"CreatedDateTime":"2013-05-25T08:08:27Z","Content":"\n\u003Cp\u003EHappy Launching!\u003C/p\u003E\u003Cp\u003EArrr!\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECapt\u0027n Skunky\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#800080;\u0022\u003E\u003Cstrong\u003EKSP Community Manager\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\n"}]}