{"TopicId":29973,"ForumId":24,"TopicTitle":"Hi","CreatedByName":"johnnokks","CreatedById":68156,"CreatedDateTime":"2013-05-29T10:32:55Z","PageNum":1,"Articles":[{"CreatedByName":"johnnokks","CreatedById":68156,"CreatedDateTime":"2013-05-29T10:32:55Z","Content":"\n\u003Cp\u003EHello everyone, New to Kerbal, wanted to say hi. \u003C/p\u003E\u003Cp\u003Estill browsing the forums, loads to read and take-in. \u003C/p\u003E\u003Cp\u003Ehave a good day!\u003C/p\u003E\u003Cp\u003EJohnnokks\u003C/p\u003E\n"},{"CreatedByName":"mustwinfull","CreatedById":41681,"CreatedDateTime":"2013-05-29T10:45:22Z","Content":"\n\u003Cp\u003EWelcome to the forums, johnnokks.\u003C/p\u003E\u003Cp\u003EThere is sure lots to read around here, make sure you check out a few Tutorials if you need them or maybe ask a question or two if you need too.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EHave fun playing KSP and good luck!\u003C/strong\u003E\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2013-05-29T19:43:08Z","Content":"\n\u003Cp\u003EWelcome to the forums!\u003C/p\u003E\u003Cp\u003EMustwinfull has already given you some quite sound advice. As far as tutorials go, I\u0027d like to direct your attention to the Drawing Board (link in my sig), where you can find some of the better ones that I\u0027ve found and gathered into one place for the benefit of other players. Feel free to jump right in to any discussion that interests you anywhere on the forums.\u003C/p\u003E\u003Cp\u003EHappy landings!\u003C/p\u003E\n"},{"CreatedByName":"johnnokks","CreatedById":68156,"CreatedDateTime":"2013-05-30T10:03:59Z","Content":"\n\u003Cp\u003EExcellent, and thanks so much! Ive done some reading on Modding as well, as an educational thing more than a \u0022cheat\u0022 - for lack of a better word right now. \u003C/p\u003E\u003Cp\u003Ebut i will be looking into \u0022the drawing board\u0022 along with all other helpful areas.\u003C/p\u003E\n"},{"CreatedByName":"johnnokks","CreatedById":68156,"CreatedDateTime":"2013-05-30T10:38:56Z","Content":"\n\u003Cp\u003EOne thing i have seen, is people showing off the Pilot inside a docked space station walking around, or have written that the crew is inside the station etc.. i may jst be taking it to literally, but can you walk around/leave your command pod on a docked station in orbit? - not an EVA.. inside any kind of orbital station. ?\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2013-05-30T19:26:56Z","Content":"\n\u003Cp\u003EAs of yet, there\u0027s no way you can actually get crew to walk around inside the pod on IVA. However, you can transfer crew between command pods by EVAing them out of the one they\u0027re in and into a new one.\u003C/p\u003E\u003Cp\u003EPeople will typically put a station with an empty command pod in orbit, then send other ships to dock with it to have a crew manning it.\u003C/p\u003E\n"},{"CreatedByName":"Capt\u0026#039;n Skunky","CreatedById":1261,"CreatedDateTime":"2013-05-31T05:33:32Z","Content":"\n\u003Cp\u003EHappy Launching!\u003C/p\u003E\u003Cp\u003EArrr!\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECapt\u0027n Skunky\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#800080;\u0022\u003E\u003Cstrong\u003EKSP Community Manager\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\n"}]}