{"TopicId":30209,"ForumId":24,"TopicTitle":"Hello guys :D","CreatedByName":"Akeno","CreatedById":67874,"CreatedDateTime":"2013-05-30T09:28:17Z","PageNum":1,"Articles":[{"CreatedByName":"Akeno","CreatedById":67874,"CreatedDateTime":"2013-05-30T09:28:17Z","Content":"\n\u003Cp\u003EHi,\u003C/p\u003E\u003Cp\u003Ei\u0027m Akeno (in reallife: Dennis) and I discovered this game a couple of days ago. And I love it! It has sooo many features and it\u0027s just in alpha.\u003C/p\u003E\u003Cp\u003EA few hours ago, i finally accomplished a docking maneuver \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E. It took about 10 tries^^\u003C/p\u003E\u003Cp\u003ENow I\u0027ve got a small space station in orbit. And I even landed on Minmus.\u003C/p\u003E\u003Cp\u003EThere are so many things I wanna try and i\u0027m looking forward to the next updates with even more features.\u003C/p\u003E\u003Cp\u003EFor example: It would be nice to have the ability to control your Kerbin \u003Cstrong\u003Ein\u003C/strong\u003E your ship. So that you can do things inside your ship.\u003C/p\u003E\u003Cp\u003EBut anyway, great game! And great Community \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\u003Cp\u003Egreetings,\u003C/p\u003E\u003Cp\u003EAkeno (Dennis)\u003C/p\u003E\n"},{"CreatedByName":"Christian365","CreatedById":57859,"CreatedDateTime":"2013-05-30T11:16:26Z","Content":"\n\u003Cp\u003EWelcome to the forums Dennis! And I agree, the game has potential written all over it. Good luck with your latest endeavors in-game.\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2013-05-30T19:47:59Z","Content":"\n\u003Cp\u003EWelcome to the forums!\u003C/p\u003E\u003Cp\u003EIt truly is an amazing game, and I hope we see even more awesome features in the future. The ability to actually move around and interact in IVA would indeed be a great feature.\u003C/p\u003E\u003Cp\u003EAlso, congratulations on learning to dock! It really is one of the hardest concepts to master in the game. Not even NASA got it right the first time, here in the real world -- that\u0027s how hard it is.\u003C/p\u003E\u003Cp\u003EIf you ever get stuck on anything, feel free to ask in the How To section of the forums, or to take a look at some of the tutorials in the Drawing Board (link in my sig). We\u0027ve also got the Mission Reports section, if you want to share any of your biggest accomplishments, as well as many other interesting discussions and challenges in various parts of the forums.\u003C/p\u003E\u003Cp\u003EHappy landings!\u003C/p\u003E\n"},{"CreatedByName":"Capt\u0026#039;n Skunky","CreatedById":1261,"CreatedDateTime":"2013-05-31T05:25:47Z","Content":"\n\u003Cp\u003EHappy Launching!\u003C/p\u003E\u003Cp\u003EArrr!\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECapt\u0027n Skunky\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#800080;\u0022\u003E\u003Cstrong\u003EKSP Community Manager\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\n"}]}