{"TopicId":30911,"ForumId":24,"TopicTitle":"Hooked...","CreatedByName":"fortunateson","CreatedById":69004,"CreatedDateTime":"2013-06-02T15:05:55Z","PageNum":1,"Articles":[{"CreatedByName":"fortunateson","CreatedById":69004,"CreatedDateTime":"2013-06-02T15:05:55Z","Content":"\n\u003Cp\u003EI have experimented with this game off and on for a week or so, but never sat down and gave it a full go til this weekend... All I can say is I\u0027m hooked. I mean I literally I sat here for hours, experimenting with ships, trying to get to orbit... It was a blast! I did finally make it to orbit, working on manually docking, but looked at a few of the mods and checked them out too. I\u0027m pretty sure I\u0027ll be spending more time with this gem. See you all...out there!\u003C/p\u003E\n"},{"CreatedByName":"viktorserecros","CreatedById":58331,"CreatedDateTime":"2013-06-02T16:26:07Z","Content":"\n\u003Cp\u003EWelcome to KSP.\u003C/p\u003E\u003Cp\u003EWe all begin as addicts. I was hooked the first time an engine swatted my poor kerbals out of the sky. I haven\u0027t tried docking yet, I\u0027ve got too many rescue missions in planning at the moment to add another set of missions.\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2013-06-02T18:23:40Z","Content":"\n\u003Cp\u003EWelcome to the forums! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EGlad to hear that you\u0027re enjoying the game, and I know exactly where you\u0027re coming from. I\u0027ve spent many a late night trying to get that One Last Mission done myself... and then sending another mission to support it... and then launching a third after telling myself \u0022Wouldn\u0027t it be cool to try \u003Cem\u003Ethis\u003C/em\u003E?\u0022... and then the sun rises in the real world, and I realize I\u0027m going to be a wreck for the rest of the day \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027d definitely encourage you to learn as much as you can on your own, but if you ever get well and truly stuck on something, you can take a look at the Drawing Board (link in my sig), which has a number of useful tutorials and other player aids. The people in the How To section of the forums will also be more than willing to answer any questions you may have. Also, feel free to share your latest exploits in Mission Reports, or to share screenshots of your latest rovers, landers, and other craft over in the Spacecraft Exchange.\u003C/p\u003E\u003Cp\u003EHappy landings!\u003C/p\u003E\n"},{"CreatedByName":"Capt\u0026#039;n Skunky","CreatedById":1261,"CreatedDateTime":"2013-06-03T20:39:48Z","Content":"\n\u003Cp\u003EHappy Launching!\u003C/p\u003E\u003Cp\u003EArrr!\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECapt\u0027n Skunky\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#800080;\u0022\u003E\u003Cstrong\u003EKSP Community Manager\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\n"}]}