{"TopicId":33467,"ForumId":24,"TopicTitle":"Greets, and why is this game so evil ?","CreatedByName":"ASnogarD","CreatedById":70903,"CreatedDateTime":"2013-06-17T17:54:42Z","PageNum":1,"Articles":[{"CreatedByName":"ASnogarD","CreatedById":70903,"CreatedDateTime":"2013-06-17T17:54:42Z","Content":"\n\u003Cp\u003EFirst up... Greetings.\u003C/p\u003E\u003Cp\u003EPicked up this game after watching some youtube vids, and the entire re-usable space program by Scott Manly. Looked like fun... oh I was a naive little child, fun is such a deceptive word.\u003C/p\u003E\u003Cp\u003EOh dont worry, I like the game and I do realise its still in development and not a released title as yet, so its forgiven but... dayum! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\u003Cp\u003EI got a problem in that I love to design things, so when I get to the VAB with the intent to make a *koff* simple station core THIS time, I end up with a 50 story monstrosity that would give King Kong vertigo climbing this mess... but yes it really needs a special habitat for toilets, and how can they live without the jacuzzi you monsters!\u003C/p\u003E\u003Cp\u003E*a-hem* \u003C/p\u003E\u003Cp\u003EIn short I tend to over design everything, and then cant get the mess into orbit... I get stuck in a vicious cycle of adding moar engines which need moar tanks which make the craft moar heavy with needs moar engines... \u003C/p\u003E\u003Cp\u003EYeah I used (and not used) Asparagus staging, single stage to orbit vehicles, multi stage , multi asparagus , ramjets ... closest I came to actually getting a station to orbit ended up with me realising that with my ships tossing and spinning and jumping all over the place, not only did I not hit the correct altitude... I was in a counter orbit...a east to west direction(ironically on a perfect equatorial orbit somehow).\u003C/p\u003E\u003Cp\u003EI tried using MechJeb2 to fly that mess to a stable 200km...it made it to just over 10k km and tore the ship to pieces doing a gravity turn, I tried again and a random fuel tank broke at 03 sec after launch, wasnt even inside a stack , was on top of my 1st stage lift engines... this left 1 (one) engine with a third less fuel than the other 3 and when it ran out of juice... spinny spin spin.\u003C/p\u003E\u003Cp\u003ENext attempt got to about 40k km with about 800 km/s and seeming on the way when it was time to separate my first stage... which it did, but decided to take the ENTIRE engine cluster of the second stage with it on its trip back to Kerbin, left me with all the fuel and no engine on that stack \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 alt=\u0022:0.0:\u0022\u003E.\u003C/p\u003E\u003Cp\u003E... pure evil, gives you a tonne of design tools to enjoy but makes every connection act like its a spring, every fuel tank practically needs a \u0027Mainsail\u0027 attached which slurps up all the fuel itself, every radial connector is actually a piece of chewing gun, every docking port doubles as a trampoline and the notion of you are in control is really foreign to Squad and Unity.\u003C/p\u003E\u003Cp\u003EThe VAB is a annex of hell on its own, a seemingly simple task...put tank on top of other tank has you spinning the view around trying to coax the tank to go on top, not on the side, not on its side, not upside, or on the left side, or right side...but on top... yeas I am sure I want the top , not a 45% angle to the main engine and how the hell did my command probe end up 3/4 into that orange tank... *sob* I just wanted to strut that one little piece... \u003C/p\u003E\u003Cp\u003ELets you design really fancy stations and stuff, with lights and panels that extend...and and and... then laughs at you when you try get the mess into space, perhaps one more \u0027Mainsail\u0027 will work, ooh close, how about some SBR\u0027s ? Oh dear they ran out and you are slowly fallign back to Kerbin even with the 6 Mainsails firing at 100% and going to blow up overheating... and you will be back with a new monstrosity to launch, good luck getting that up to space no matter how many struts to slap on it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EPure evil I tell you, but like a really insidious example of evil its challenges you, taunts you and you keep thinking... if I just...\u003C/p\u003E\u003Cp\u003EGreat game Squad, thanks for the hours of fun and hair pulling... I am both having a good time, and losing my hair rapidly... and hello KSP community, please forgive my occasional rantings and ramblings, I like to whine a lot when a game kicks my arse \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-17T17:57:14Z\u0022 title=\u002206/17/2013 05:57  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 17, 2013\u003C/time\u003E by ASnogarD\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Spaceisbeautifulul","CreatedById":68592,"CreatedDateTime":"2013-06-17T17:57:48Z","Content":"\n\u003Cp\u003EI could give you a hint on how to fix your crafts from exploding if you\u0027d like.\u003C/p\u003E\u003Cp\u003EBut I know some of y\u0027all like to work through it.\u003C/p\u003E\u003Cp\u003EWelcome to the forums, bro. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"tobjv","CreatedById":50269,"CreatedDateTime":"2013-06-17T18:08:59Z","Content":"\n\u003Cp\u003EWhat Kerbal Space Program has taught me.\u003C/p\u003E\u003Cp\u003ESymmetry matters A LOT for rockets not exploding. Also some of us send our space stations up in tiny payloads.\u003C/p\u003E\n"},{"CreatedByName":"Capt\u0026#039;n Skunky","CreatedById":1261,"CreatedDateTime":"2013-06-18T17:12:19Z","Content":"\n\u003Cp\u003EHappy Launching!\u003C/p\u003E\u003Cp\u003EArrr!\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECapt\u0027n Skunky\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#800080;\u0022\u003E\u003Cstrong\u003EKSP Community Manager\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2013-06-18T17:27:24Z","Content":"\n\u003Cp\u003EWelcome \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003ETry to split your station into smaller parts with docking clamps, and send the parts up 1 by 1.\u003C/p\u003E\u003Cp\u003ELess weight to carry means not as HUGE a rocket \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd use Mechjeb\u0027s deltaV stats to help during design. The info is very usefull (Thrust/Weight ratio, deltaV itself)\u003C/p\u003E\n"},{"CreatedByName":"3_bit","CreatedById":52836,"CreatedDateTime":"2013-06-18T17:37:27Z","Content":"\n\u003Cp\u003EYou know the saying \u0022Life\u0027s not fair\u0022? It applies here too, but you can get around it.\u003C/p\u003E\n"}]}