{"TopicId":37413,"ForumId":24,"TopicTitle":"Goin\u0027 big or goin\u0027 home! Any advice?","CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2013-07-17T05:24:20Z","PageNum":1,"Articles":[{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2013-07-17T05:24:20Z","Content":"\n\u003Cp\u003EMy first project was a space station over kerbin at 125km. I accidentally hit end flight and deleted a fuel module, the core, and two tugs. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_sleep.png\u0022 alt=\u0022-_-\u0022\u003E I ragequit that. Now my next big (and first interplanetary) is a giant spaceship that can reassemble itself into a space station and vice versa, hopping the kerbol system planet to planet. I am using KSP X and Kethane so refueling is a no brainer (assuming I got satellites there and survey maps XD).\u003C/p\u003E\u003Cp\u003EAny pointers? The current plan calls for a total of 16 modules on 3 cores all using clamp-o-tron sr. ports and a single interplanetary megatug to tow the whole thing around before reconfiguring it. The maiden voyage (aka space trials) will be to the Mun, then maybe minmus.\u003C/p\u003E\u003Cp\u003EStep one in my plan: Build a space dock to assemble it; send kethane scout probe to the Mun.\u003C/p\u003E\u003Cp\u003EStep two: send up the megatug, then start module construction (may ask for community help. Dunno if I can think up 16 different types of modules XP)\u003C/p\u003E\u003Cp\u003EAny friendly advice for this massive undertaking?\u003C/p\u003E\u003Cp\u003E-Sierra\u003C/p\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2013-07-17T09:15:53Z","Content":"\n\u003Cp\u003EIt\u0027s very ambitious. Some places, like Eve and Tylo, require very specialised landers You may not be able to land and mine there very easy. Pack a heap of delta V, but you can always use gravity slingshots if you\u0027re clever, and very patient. \u003C/p\u003E\u003Cp\u003EMy other tip is cut any components that aren\u0027t benefiting you much. Don\u0027t overburden your computer, and turn your trip into a big laggy slide show.\u003C/p\u003E\u003Cp\u003EGood luck, and welcome to the forums!\u003C/p\u003E\n"},{"CreatedByName":"CCKinnison","CreatedById":71439,"CreatedDateTime":"2013-07-17T16:10:01Z","Content":"\n\u003Cp\u003EYes, keep your part count DOWN, plan on having to send out some specialized modules you wont need everywhere (and don\u0027t want to lug everywhere... delta-V)... it\u0027s optimistic, but doable.\u003C/p\u003E\n"},{"CreatedByName":"Naten","CreatedById":70923,"CreatedDateTime":"2013-07-17T16:39:51Z","Content":"\n\u003Cp\u003EI\u0027d work on designing and not assembling the craft, and no Kethane miners or KSPX parts just yet, as the next update impends. So, just design bare stock versions in the VAB/SPH if you want and assemble and launch them in 0.21. 0.21 is breaking saves, and IDK about crafts, so I\u0027d just design the concept. No mission is safe without a concept.\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2013-07-17T18:20:59Z","Content":"\n\u003Cp\u003EThanks for the pointers. My comp is pretty decent but I did get some lagginess on my space station so will do. I just put up the space dock I\u0027ll be using to assemble it today and the actual dock is totally stock. (good to know about .21, oh dear) Granted the launcher is using quantum struts and some adapters from KSPX (best mod ever).\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tw1\u0022 data-cite=\u0022Tw1\u0022\u003E\u003Cdiv\u003EIt\u0027s very ambitious. Some places, like Eve and Tylo, require very specialised landers You may not be able to land and mine there very easy. Pack a heap of delta V, but you can always use gravity slingshots if you\u0027re clever, and very patient. \u003Cp\u003EMy other tip is cut any components that aren\u0027t benefiting you much. Don\u0027t overburden your computer, and turn your trip into a big laggy slide show.\u003C/p\u003E\u003Cp\u003EGood luck, and welcome to the forums!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis ship is actually intended to be for Duna as the first target (after the trial run on the Mun and maybe minmus). Any advice for what I\u0027ll need over on Eve and Tylo?\u003C/p\u003E\u003Cp\u003EThe megatug will have a heap of delta V and I plan on refueling it after every planet (courtesy of Kethane).\u003C/p\u003E\u003Cp\u003EAs always, thanks for the pointers. Time to get building the modules. I may post screenshots of some of them and some more later when I actually start docking stuff at the space docks for assembly.\u003C/p\u003E\n"},{"CreatedByName":"Capt\u0026#039;n Skunky","CreatedById":1261,"CreatedDateTime":"2013-07-23T16:42:19Z","Content":"\n\u003Cp\u003EHappy Launching!\u003C/p\u003E\u003Cp\u003EArrr!\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECapt\u0027n Skunky\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#800080;\u0022\u003E\u003Cstrong\u003EKSP Community Manager\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\n"}]}