{"TopicId":37531,"ForumId":24,"TopicTitle":"Howdy","CreatedByName":"Steve-S","CreatedById":74649,"CreatedDateTime":"2013-07-18T03:09:44Z","PageNum":1,"Articles":[{"CreatedByName":"Steve-S","CreatedById":74649,"CreatedDateTime":"2013-07-18T03:09:44Z","Content":"\n\u003Cp\u003EI\u0027m Steve and am new to KSP. I saw it and had to have it. I did a few successful sub orbital hops and kept making the rockets bigger until I could get to orbit (did not know about struts so they were kinda wobbly and a few were, urm, exciting for the news crews (spectators have stopped coming to the Cape and now prefer to watch at home. Most are safe there {fill it with water and it\u0027s a really deep swimming pool}). Anyway. First flight with a ship that was strong enough to get to orbit and I Kerbal\u0027ed the launch. Turned 270 for some reason (I use a wireless keyboard so maybe there was some interference from the cell phone, yea, that\u0027s it). Decided to burn the rest of the fuel w/o watching the map screen (was sure I would not have enough to make a stable orbit) and turns out I had more than I thought. Rather elliptical that orbit. Appears to Periapsis at about 64.6k and Apoapsis at about 300k or so iirc (might be 150(ish)k or so). Have made a few efforts to save our brave pilot but had not met with any success. Quite the opposite actually. I now have 2 more Kerbals stuck in a 3 person capsule in a much more circular orbit and 4 have been \u0027re-assigned\u0027 as \u0027advisers\u0027 at a top secret research facility. Finally decided to try the Kerbal X rocket and have now, almost, matched the orbit of the more stable craft. I did not re-config the ship with landing feet as catch net or Retro packs as, iirc, Mr Manley did in his YouTube vid. I\u0027m thinking I can either nudge it a few times (yea, right) or position above and fire the rocket to push it down to re-enter. How far away should I be to not destroy it with my exhaust? Should I chalk that flight up to experience and mod the ship for a better shot? You make the call. LOL\u003C/p\u003E\u003Cp\u003EGlad to be here.\u003C/p\u003E\u003Cp\u003ESteve-S\u003C/p\u003E\u003Cp\u003EPS. Any multiplayer plans for near or far future?\u003C/p\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2013-07-18T10:35:17Z","Content":"\n\u003Cp\u003EWelcome to the forums! \u003C/p\u003E\u003Cp\u003EMultilayer is probably never going to happen, and it\u0027s on a do not suggest list, but that doesn\u0027t stop mod makers from trying. \u003C/p\u003E\u003Cp\u003EWith your rescue attempt, I recommend adding external seats for the crew of the first rocket rather than trying to push the second down to Kerbin with it.\u003C/p\u003E\u003Cp\u003E Rocket flames currently don\u0027t do any damage to nearby vessels, and if they did, you shouldn\u0027t be thrusting that hard when near another vessel anyway. Thrusting will just throw you away from the other vessel.\u003C/p\u003E\u003Cp\u003EHave you discovered setting a ship as your target yet? This is done from the map view, and it gives extra info you can use to meet up with another vessel in orbit, which is a big challenge the first few times. \u003C/p\u003E\u003Cp\u003EScot Manley is a great source of info. Good luck with getting these other kerbals home, it\u0027s one of the big jobs most kerbal space programs do soon after starting.\u003C/p\u003E\n"},{"CreatedByName":"Epic DaVinci","CreatedById":58581,"CreatedDateTime":"2013-07-18T10:51:05Z","Content":"\n\u003Cp\u003EWelcome to the forums Steve, Happy Landings.\u003C/p\u003E\n"},{"CreatedByName":"Capt\u0026#039;n Skunky","CreatedById":1261,"CreatedDateTime":"2013-07-23T16:36:02Z","Content":"\n\u003Cp\u003EHappy Launching!\u003C/p\u003E\u003Cp\u003EArrr!\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECapt\u0027n Skunky\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#800080;\u0022\u003E\u003Cstrong\u003EKSP Community Manager\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"Steve-S","CreatedById":74649,"CreatedDateTime":"2013-07-26T02:49:41Z","Content":"\n\u003Cp\u003EWooHoo. Got one of my Kerbals home and brought his rescuer home as well. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E Man orbital rendezvous is a (hard thing to do). :-) Now I only have 2 in nearly circular orbits to rescue. Figured I should get these guys down before going to 21.1 just in case the save file does not convert well. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\n"}]}