{"TopicId":40682,"ForumId":24,"TopicTitle":"Can anyone show we how to \u0026or where to learn dll plugin scripting","CreatedByName":"tomwillp","CreatedById":77227,"CreatedDateTime":"2013-08-02T18:46:04Z","PageNum":1,"Articles":[{"CreatedByName":"tomwillp","CreatedById":77227,"CreatedDateTime":"2013-08-02T18:46:04Z","Content":"\n\u003Cp\u003EI have been modding KSP for a few months now. mostly recycled textures, Stat Alterations, a few god parts when i got frustrated, but nothing published..... Yet\u003C/p\u003E\u003Cp\u003EI had moved on to more ambitious mods but hit a wall DLL\u0027s i need to make a plugin for my part modules to work properly.\u003C/p\u003E\u003Cp\u003Ei have looked everywhere i can think of and now have 2 IDE\u0027s including Visual Studio Express 2012. and have looked at lots of modding tutorials, including \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Creating_your_first_module\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.kerbalspaceprogram.com/wiki/Creating_your_first_module\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EWhile i thank the author and appreciate his work, i need more...\u003C/p\u003E\u003Cp\u003Eany help would be great\u003C/p\u003E\u003Cp\u003EAnd if anyone can show me how to copy an existing part module, and add extra lines to allow what i need it to do that would be PERFECT\u003C/p\u003E\u003Cp\u003EBe hopeful \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"tomwillp","CreatedById":77227,"CreatedDateTime":"2013-08-04T14:46:12Z","Content":"\n\u003Cp\u003EUpdate:\u003C/p\u003E\u003Cp\u003EI have made progress now and may be able to made my mod.\u003C/p\u003E\u003Cp\u003Eto anyone in my predicament, review other mods source code to get an idea of what a functional part module should look like.\u003C/p\u003E\u003Cp\u003EBUT DON\u0027T USE ANYTHING WITHOUT THE ORIGINAL AUTHOR\u0027S PERMISSION. they were kind enough to allow access to their source code, so please don\u0027t make them regret it.\u003C/p\u003E\u003Cp\u003Eas for my mod, i may use some of the coding from the Kethane mod \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/23979\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/23979\u003C/a\u003E pending permission to do so.\u003C/p\u003E\u003Cp\u003Ebut i still need scripts to create a value from 0.0 to 1.0 to indicate weather the part (\u0026amp; face) is exposed to the sun. 0 for covered and 1 for maximum unobstructed exposure. after that i can handle the maths for the rest... I think.\u003C/p\u003E\u003Cp\u003Edoes anyone know how to do this?\u003C/p\u003E\n"}]}