{"TopicId":48055,"ForumId":24,"TopicTitle":"Hello!","CreatedByName":"adge","CreatedById":85309,"CreatedDateTime":"2013-10-11T20:47:01Z","PageNum":1,"Articles":[{"CreatedByName":"adge","CreatedById":85309,"CreatedDateTime":"2013-10-11T20:47:01Z","Content":"\n\u003Cp\u003EGreetings, everyone!\u003C/p\u003E\u003Cp\u003EI picked up KSP about a week ago and have been loving it ever since first launch! I\u0027ve been devouring all manner of Let\u0027s Play, Tutorial, Challenge (etc) videos on YouTube, as well as browsing and reading the forums for neat ideas and inspiration. I decided to finally sign up and get involved with the community, and look forward to participating and getting involved.\u003C/p\u003E\u003Cp\u003EA little about me: I live in the UK and work in engineering (specifically marine engineering with Maersk Line), and I\u0027ve had a fascination with astronomy and the stars for as long as I care to remember! I guess that explains why I love this game so much already!\u003C/p\u003E\u003Cp\u003EI\u0027m looking forward to seeing where Squad take the game in the future. I\u0027ve already started plugging the game to friends and family, too!\u003C/p\u003E\u003Cp\u003ESo, with all the said, it\u0027s great to meet you all!\u003C/p\u003E\n"},{"CreatedByName":"Xeadas","CreatedById":85320,"CreatedDateTime":"2013-10-11T22:07:57Z","Content":"\n\u003Cp\u003EWelcome to the community! \u003C/p\u003E\u003Cp\u003EI\u0027ve been playing KSP for about a month, and haven\u0027t lost interest! I also am fascinated by astronomy, strange how that is, hmm? Haha XD \u003C/p\u003E\u003Cp\u003ENow, I\u0027m still in high school, and I think I\u0027d like to go into the aviation business, hopefully as a pilot, but there isn\u0027t much demand, and I know some people struggling to find jobs that are qualified, but I\u0027ll stay hopeful!\u003C/p\u003E\u003Cp\u003EAgain, welcome!\u003C/p\u003E\u003Cp\u003EUntil another time,\u003C/p\u003E\u003Cp\u003EXeadas\u003C/p\u003E\n"},{"CreatedByName":"Daman453","CreatedById":52109,"CreatedDateTime":"2013-10-12T00:35:22Z","Content":"\n\u003Cp\u003EWelcome, Maybe you rocketes burn-err explode nicely.\u003C/p\u003E\n"},{"CreatedByName":"3_bit","CreatedById":52836,"CreatedDateTime":"2013-10-12T00:35:48Z","Content":"\n\u003Cp\u003EHey there! Welcome to the KSP forums! I guess you should both be welcomed seeing as how it is both of yours\u0027 first posts. I\u0027m far away in the US, but if you ever have any questions feel free to PM me!\u003C/p\u003E\n"}]}