{"TopicId":51993,"ForumId":24,"TopicTitle":"I\u0027m so sold on this","CreatedByName":"Bluntie","CreatedById":91416,"CreatedDateTime":"2013-11-05T18:57:13Z","PageNum":1,"Articles":[{"CreatedByName":"Bluntie","CreatedById":91416,"CreatedDateTime":"2013-11-05T18:57:13Z","Content":"\n\u003Cp\u003EHey everyone!\u003C/p\u003E\u003Cp\u003ELong-time lurker and been poking fruitlessly at KSP for a while, but career-mode is what has finally sold me on it for real. Made it safely to Minmus and back with a trunkload of sweet, sweet Science last night, and figured this was a good time to make my stay here official. Can\u0027t wait to see where the game takes us next, and love seeing all the incredible things you guys put together - truly inspiring and terrifying. Keep up the fantastic work. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ERunning mod-less so far, but have my eye on that whole Kethane-business...seeing as how Career-mode gave me tangible goals to strive for, I think the Kethane-thing is something I ought to try out in time. Any other suggestions are welcome.\u003C/p\u003E\n"},{"CreatedByName":"KasperVld","CreatedById":40700,"CreatedDateTime":"2013-11-05T19:26:43Z","Content":"\n\u003Cp\u003EHi there Bluntie and welcome to the forums! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ESeems like you\u0027re making your way through space just fine. Do you have any plans for interplanetary travel?\u003C/p\u003E\n"},{"CreatedByName":"Bluntie","CreatedById":91416,"CreatedDateTime":"2013-11-06T20:11:23Z","Content":"\n\u003Cp\u003EThanks! Loads of plans, no idea at all how to pull them off. Still struggling with learning how to properly plan trips. I can just about make it to the Mun without problem, but even Minmus is a bit of a shot in the dark for me on how to get there efficiently. And more distant planets, yeesh. I\u0027ll get there, but at present it seems completely incomprehensible. Which is lovely. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2013-11-06T20:48:00Z","Content":"\n\u003Cp\u003EI can totally relate. The game really intrigued me before but once I did a single interplanetary trip (to Moho. Because hey how hard can it be? It\u0027s like Mun, but orbiting the Sun instead of Kerbin!) and lost interest, because there didn\u0027t seem any good reason to go anywhere else.\u003C/p\u003E\u003Cp\u003ENow, I\u0027ve got probes spraying from Kerbin like water from a hose and have plans to put bases on each moon in the system. MUST HAVE ALL THE SCIENCE.\u003C/p\u003E\u003Cp\u003EOh, and welcome to the forums!\u003C/p\u003E\n"},{"CreatedByName":"Bluntie","CreatedById":91416,"CreatedDateTime":"2013-11-06T23:56:05Z","Content":"\n\u003Cp\u003EI know, right? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E For serious, the career mode is a stroke of genius. For the first time, I feel like I understand what each part does, since they\u0027re handed out a few at a time instead of giving me ALL THE CHOICE to begin with. And omg, omg, I just mounted my first rescue mission ever! Jeb was stuck in a crappy space station, and I successfully docked a rescue craft and EVA\u0027d him to it and man, what a thrill! Docking is hard! But satisfying. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2013-11-07T00:09:17Z","Content":"\n\u003Cp\u003EGratz on your first docking. One of the hardest things I can think of in KSP \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Xacktar","CreatedById":88876,"CreatedDateTime":"2013-11-07T01:19:05Z","Content":"\n\u003Cp\u003EWelcome and gratz on docking, took me forever to get the hang of that.\u003C/p\u003E\n"},{"CreatedByName":"Bluntie","CreatedById":91416,"CreatedDateTime":"2013-11-07T09:48:13Z","Content":"\n\u003Cp\u003EThanks! I owe mr. Manley my thanks for making me get the gist of it. ^^\u003C/p\u003E\n"}]}