{"TopicId":54943,"ForumId":24,"TopicTitle":"Hai there... YAHP (Yet Another Hello Post)","CreatedByName":"MGCJerry","CreatedById":95202,"CreatedDateTime":"2013-12-02T02:47:18Z","PageNum":1,"Articles":[{"CreatedByName":"MGCJerry","CreatedById":95202,"CreatedDateTime":"2013-12-02T02:47:18Z","Content":"\n\u003Cp\u003EAfter reading about KSP elsewhere on the \u0027net, I decided to check it out and downloaded the demo. Lots of fun even if I\u0027m not a rocket scientist... Launched a lot of stuff, but no orbits yet. A whole lot of building, piloting and crashing by the seat of my pants.\u003C/p\u003E\u003Cp\u003EAmazing how tough these guys are. I let him EVA out of this rocket, and watched him bounce to the ground. Tis only a scratch!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://mgcjerry.net/forum_images/ksp.jpg\u0022 alt=\u0022ksp.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EEdited\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EWith all the fun I\u0027ve been having today with the demo, I went ahead and bought the game. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-02T04:42:50Z\u0022 title=\u002212/02/2013 04:42  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 2, 2013\u003C/time\u003E by MGCJerry\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-12-02T03:09:43Z","Content":"\n\u003Cp\u003EAh, the old tower. [Nostalgic sniff.] \u003C/p\u003E\u003Cp\u003EThat certainly looks big enough to reach orbit. Were you having trouble with it?\u003C/p\u003E\n"},{"CreatedByName":"MGCJerry","CreatedById":95202,"CreatedDateTime":"2013-12-02T04:35:48Z","Content":"\n\u003Cp\u003ETook lots of explosions and fails and experimenting to get that rocket, even if it wobbles a bit... but, it can definitely reach orbit, and leave poor kerbals drifting into distant space. Taking one for the team, I love these guys! Maybe one day I\u0027ll try to get them back with a rescue mission but that will have to wait because I still cant get a stable orbit. I\u0027m too much of an idiot... One day, I will get an orbit... then one day I will land on Mun... Then maybe one day, rescue all the poor kerbals that are drifting through space (some are EVA.. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_lipssealed.gif\u0022 alt=\u0022:sealed:\u0022\u003E happens).\u003C/p\u003E\n"},{"CreatedByName":"larsmaehlum","CreatedById":51566,"CreatedDateTime":"2013-12-02T10:04:33Z","Content":"\n\u003Cp\u003EWelcome to the deep hole that your KSP addication will evolve into. There is no way back out no, the mental gravity well is too deep.\u003C/p\u003E\u003Cp\u003EHave fun \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"MGCJerry","CreatedById":95202,"CreatedDateTime":"2013-12-03T03:17:30Z","Content":"\n\u003Cp\u003EBetween last night, and a little bit today I managed to get a total of 2 orbits. The first one was terrible, and luckily it was only a probe so no big deal. The 2nd one I Jeb went up, and he has what I would call an good circular orbit around Kerbin (800k). Going to try to launch a few more orbits with kerbals and more probes. Jeb has a 1/16 of liquid fuel left, and a whole solid booster to return to Kerbin, so I should be able to get him back fairly easy (famous last words). Jeb was launched up using the rocket in the screenshot above.\u003C/p\u003E\u003Cp\u003EAddiction? I can stop any time I want *twitch* *twitch* \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 alt=\u0022:blush:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2013-12-03T11:37:33Z","Content":"\n\u003Cp\u003EIs there a solid booster on top of the rocket? why? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EThose things are heavy and inefficient. It\u0027s better to bring a small fuel tank and liquid fuel engine, less weight\u003C/p\u003E\n"},{"CreatedByName":"Tidus Klein","CreatedById":72277,"CreatedDateTime":"2013-12-03T13:03:13Z","Content":"\n\u003Cp\u003EWelcome new guy let me be the first to say......\u003C/p\u003E\u003Cp\u003EYOU WILL NEVER ESCAPE MUUUHAHA....HA(cough)\u003C/p\u003E\u003Cp\u003EPlayed this game sense .18 and many sleepless nights building space contraptions.\u003C/p\u003E\u003Cp\u003EI\u0027m addicted even after almost a year of hard play..... Wow a year. (Sniff)\u003C/p\u003E\n"},{"CreatedByName":"Monkeh","CreatedById":72122,"CreatedDateTime":"2013-12-03T13:23:46Z","Content":"\n\u003Cp\u003EAlways good to see new faces, it reminds us of how we used to be before the terrible, terrible effects of KSP addiction took hold. The black circles under eyes, the low moaning, the snippets of rocket-ese language creeping into nominal conversion of chemical to kinetic energy.\u003C/p\u003E\u003Cp\u003EThis game is amazing, well over 400 hours of in game time down and still coming up with things to build, things to try and stuff to do.\u003C/p\u003E\u003Cp\u003EYou shall not be dissappointed with your purchase, this I guarantee.\u003C/p\u003E\u003Cp\u003EIf you want to ask anything then everyone round here is real nice and stuff, so ask away, don\u0027t be shy.\u003C/p\u003E\n"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2013-12-03T16:43:30Z","Content":"\n\u003Cp\u003EDon\u0027t take us the wrong way and stop playing. It\u0027s just... addicting. You will never stop. As I said in another HP: \u0022No one is welcome to the game. The game hates you. You welcome the game taking over your life.\u0022\u003C/p\u003E\u003Cp\u003EHello there!\u003C/p\u003E\n"},{"CreatedByName":"Rowsdower","CreatedById":91811,"CreatedDateTime":"2013-12-03T17:06:42Z","Content":"\n\u003Cp\u003EWelcome to the fold, MGCJerry. Wonderful pic.\u003C/p\u003E\n"}]}