{"TopicId":55132,"ForumId":24,"TopicTitle":"Hi I\u0026#039;m Wam and I\u0026#039;m a Kerbaholic.","CreatedByName":"Wamphyri","CreatedById":84044,"CreatedDateTime":"2013-12-04T01:09:16Z","PageNum":1,"Articles":[{"CreatedByName":"Wamphyri","CreatedById":84044,"CreatedDateTime":"2013-12-04T01:09:16Z","Content":"\n\u003Cp\u003E... it all started with a 40% off sale on steam.\u003C/p\u003E\u003Cp\u003Esince then i go out less. my friends send me texts asking why i\u0027m not shooting people in the face with them on bf3 or 4. i talk less at work; its because i\u0027m designing a new something in my head and can\u0027t be bothered with human contact. my girlfriend just shakes her head at me when she catches me giggling like a schoolgirl because of some successful maneuver.\u003C/p\u003E\u003Cp\u003Eit was a purchase of less than $20 that made me rethink my free time entirely - made just as .21 was released, and since then nearly 500 hours have been logged. it took several, several hours of youtube videos by scott manley and harv to get my skills and designs to where they are now. and i\u0027m still finding so much more to learn and do.\u003C/p\u003E\u003Cp\u003Eall that being said, i\u0027m very pleased to say hello to what seems like a very polite and enthusiastic community - which is something sorely lacking in most other forums. i\u0027ve lurked this forum for quite awhile, and have seen some very inspiring projects. its only now that i\u0027ve decided to say hi and show off a couple of my more photogenic (and successful) moments.\u003C/p\u003E\u003Cp\u003Ei do use mechjeb. however, i promised myself that i would never allow mechjeb to do anything that i have not learned how to do manually. other mods are being used as well; most recently the remote tech mod, which has caused me to completely rethink my satellite deployment strategy. if a kerbal dies on my watch, then its time to restart my program. and no space junk. these are the rules i\u0027ve imposed upon my program.\u003C/p\u003E\u003Cp\u003Eanyways, hi all of you. you guys got a great looking community here. i look forward to more lurking, and maybe now even posting a time or two.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/AemO5#0\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2013-12-04T04:35:29Z","Content":"\n\u003Cp\u003EWelcome to the forums! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m familiar with that sequence of events you\u0027ve posted up there in your first paragraph. For the first few months I had this game, I hardly touched anything else. It really is the sort of game that sinks its hooks in deep and doesn\u0027t like to let go of you once it\u0027s got a hold of you and your free time. I\u0027ll give you fair warning, though: Do set a little bit of time aside every so often to focus on anything but KSP for at least the whole day, or else when your KSP-induced \u0022high\u0022 starts to crash, the results will \u003Cem\u003Enot\u003C/em\u003E be pretty. (Speaking from personal experience, here: There was a point where I just got so sick of the game that I couldn\u0027t stand to pick it up again for a little while, just because I had overloaded on it before. I got better, though.)\u003C/p\u003E\u003Cp\u003EAt any rate, it sounds like you\u0027ve got some accomplishments under your belt already, so feel free to spin a few yarns about some of your favorite missions. You might also want to help a few players newer than yourself out by answering any questions that they might have -- though don\u0027t be embarrassed to share any you might have yourself as well. Above all, enjoy your stay.\u003C/p\u003E\n"},{"CreatedByName":"larsmaehlum","CreatedById":51566,"CreatedDateTime":"2013-12-04T07:56:28Z","Content":"\n\u003Cp\u003EHi Wam.\u003C/p\u003E\u003Cp\u003EWelcome to this forum, where you can feel safe together with your fellow Kerbaholics. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kialar","CreatedById":60893,"CreatedDateTime":"2013-12-04T08:02:45Z","Content":"\n\u003Cp\u003EWe should found a self-regulation group... not. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"turbo917k","CreatedById":95273,"CreatedDateTime":"2013-12-04T19:32:37Z","Content":"\n\u003Cp\u003EWelcome.\u003C/p\u003E\u003Cp\u003EThanks for sharing the nice shots! All the best with your program.\u003C/p\u003E\u003Cp\u003ET\u003C/p\u003E\n"},{"CreatedByName":"Commissioner Tadpole","CreatedById":91993,"CreatedDateTime":"2013-12-04T22:52:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Wamphyri\u0022 data-cite=\u0022Wamphyri\u0022\u003E\u003Cdiv\u003Eall that being said, i\u0027m very pleased to say hello to \u003Cstrong\u003Ewhat seems like a very polite and enthusiastic community\u003C/strong\u003E - which is something sorely lacking in most other forums.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot.\u003C/p\u003E\u003Cp\u003EThis community, like every other in the world, is not all sunshine and happiness. It can be pretty much a death trap, especially if you don\u0027t get things right or don\u0027t have a sense of humor(like me), hence why I\u0027ve been getting more and more arrogant.\u003C/p\u003E\u003Cp\u003EBut other than that, welcome. Good luck with your missions.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-04T23:05:11Z\u0022 title=\u002212/04/2013 11:05  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 4, 2013\u003C/time\u003E by Commissioner Tadpole\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Liowen","CreatedById":94498,"CreatedDateTime":"2013-12-05T02:45:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Commissioner Tadpole\u0022 data-cite=\u0022Commissioner Tadpole\u0022\u003E\u003Cdiv\u003ENot.\u003Cp\u003EThis community, like every other in the world, is not all sunshine and happiness. It can be pretty much a death trap, especially if you don\u0027t get things right or don\u0027t have a sense of humor(like me), hence why I\u0027ve been getting more and more arrogant.\u003C/p\u003E\u003Cp\u003EBut other than that, welcome. Good luck with your missions.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI guess either I have been very fortunate, or just not noticing, or care to be honest, when someone is being rude. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E Honestly I feel this place has a much better community feel than some forums I have been to, but there is always one or two even in the good ones.\u003C/p\u003E\u003Cp\u003EAlso OP welcome aboard, I picked the game up just before the sale but it was money well spent....though my instructors at the college might not think so LOL.\u003C/p\u003E\n"},{"CreatedByName":"Wamphyri","CreatedById":84044,"CreatedDateTime":"2013-12-05T03:32:06Z","Content":"\n\u003Cp\u003EThanks all for such a kind welcome.\u003C/p\u003E\u003Cp\u003E- Specialist290 - i have to agree there have been times i\u0027ve completely burned myself out on some games in the past; some of which i never returned to. the fact is that i have to spend a lot of time at my desk every day - i\u0027m a student (double major, programming and networking) and i keep ksp running a lot on one machine while i\u0027m doing actual work on the other.... and a movie or music on the other. sometimes i\u0027ll just send a craft to some random planet just cause and watch it from time to time for a few hours while doing homework or research.\u003C/p\u003E\u003Cp\u003E- lars - its ironic that you thanked me in my first post - i was watching some of your youtube videos just the other night. i made a promise to myself to go back to some others in your series later.\u003C/p\u003E\u003Cp\u003E- tadpole - i have seen a few random spats on the this forum her and there in my past few months of lurking, but i still stand by my original estimation that at least compared to the *vast* majority of other forums i\u0027ve seen, this one is still much more positive and easy-going. i think it has to do with the learning curve of the game keeping some of the more squeaky wheels on the internet from joining.\u003C/p\u003E\u003Cp\u003Eto all others i didn\u0027t mention, thanks again for your welcome.\u003C/p\u003E\n"},{"CreatedByName":"larsmaehlum","CreatedById":51566,"CreatedDateTime":"2013-12-05T08:45:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Wamphyri\u0022 data-cite=\u0022Wamphyri\u0022\u003E\u003Cdiv\u003EThanks all for such a kind welcome.\u003Cp\u003E- lars - its ironic that you thanked me in my first post - i was watching some of your youtube videos just the other night. i made a promise to myself to go back to some others in your series later.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESweet. Which series? The Hard Mode one, or the stock stuff? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Commissioner Tadpole","CreatedById":91993,"CreatedDateTime":"2013-12-05T09:56:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Liowen\u0022 data-cite=\u0022Liowen\u0022\u003E\u003Cdiv\u003EI guess either I have been very fortunate, or just not noticing, or care to be honest, when someone is being rude. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E Honestly I feel this place has a much better community feel than some forums I have been to, but there is always one or two even in the good ones..\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Wamphyri\u0022 data-cite=\u0022Wamphyri\u0022\u003E\u003Cdiv\u003E- tadpole - i have seen a few random spats on the this forum her and there in my past few months of lurking, but i still stand by my original estimation that at least compared to the *vast* majority of other forums i\u0027ve seen, this one is still much more positive and easy-going. i think it has to do with the learning curve of the game keeping some of the more squeaky wheels on the internet from joining.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve seen multiple, right yesterday and tuesday. Both of them making fun of my habit of easily snapping. They were actually two, but then others began joining in them simply to overwhelm me.\u003C/p\u003E\u003Cp\u003EJust like bullies.\u003C/p\u003E\u003Cp\u003EIn other words, don\u0027t completely trust everyone just because \u0027most\u0027 of them seem friendly. I thought the same and I paid the price.\u003C/p\u003E\n"},{"CreatedByName":"Wamphyri","CreatedById":84044,"CreatedDateTime":"2013-12-06T01:21:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022larsmaehlum\u0022 data-cite=\u0022larsmaehlum\u0022\u003E\u003Cdiv\u003ESweet. Which series? The Hard Mode one, or the stock stuff? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ethe hard mode series. i was doing a search on examples for good satellite placement. the addition of remote tech has caused me to rethink how i\u0027m doing my program, and i looked at your example, as well as a few others.\u003C/p\u003E\n"},{"CreatedByName":"TheSuperintendnt","CreatedById":47102,"CreatedDateTime":"2013-12-06T19:12:13Z","Content":"\n\u003Cp\u003EThose are some nice screenies you have there, and I wouldn\u0027t worry about peoples behavior as your right, for the most part people behave. Oh and I almost forgot WELCOME TO THE FORUMS!\u003C/p\u003E\n"},{"CreatedByName":"larsmaehlum","CreatedById":51566,"CreatedDateTime":"2013-12-06T21:02:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Wamphyri\u0022 data-cite=\u0022Wamphyri\u0022\u003E\u003Cdiv\u003Ethe hard mode series. i was doing a search on examples for good satellite placement. the addition of remote tech has caused me to rethink how i\u0027m doing my program, and i looked at your example, as well as a few others.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECool. I have two dedicated videos on RT as well, but not much that\u0027s not covered in the series \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Wamphyri","CreatedById":84044,"CreatedDateTime":"2013-12-07T05:12:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheSuperintendnt\u0022 data-cite=\u0022TheSuperintendnt\u0022\u003E\u003Cdiv\u003EThose are some nice screenies you have there, and I wouldn\u0027t worry about peoples behavior as your right, for the most part people behave. Oh and I almost forgot WELCOME TO THE FORUMS!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ethanks for the compliments. i don\u0027t now how much detail you can see from any of those pics, but any advice, criticism, or comments are more than welcome.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022larsmaehlum\u0022 data-cite=\u0022larsmaehlum\u0022\u003E\u003Cdiv\u003ECool. I have two dedicated videos on RT as well, but not much that\u0027s not covered in the series \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eyeah i looked at those too, but was more interested in the hard mode series. your video and scott manly has inspired me to create a multi-satellite launch platform that can be shipped off to another planet.\u003C/p\u003E\n"},{"CreatedByName":"keoki","CreatedById":91957,"CreatedDateTime":"2013-12-07T08:05:33Z","Content":"\n\u003Cp\u003EI launched a multi-satellite launch platform that separated into a total of 21 different mapping probes. \u003C/p\u003E\u003Cp\u003EThe concept is that I launch to Jool, use aerobreaking in multiple passes to get into a reasonable Jool orbit, deploy probes to each moon, and map the system in one go.\u003C/p\u003E\u003Cp\u003EMy first pass worked pretty well, but only two of the 21 probes has engines, the rest are passive drop-off satellites. The two powered ships have 3 and 16 passive probes each, as well as being probes themselves for a total of 21.\u003C/p\u003E\u003Cp\u003EThat was the first design. There are places where the design has efficiency, and places where it was inefficient, or at least came up short. I\u0027ve already unlocked everything in my current career mode, so I have all the parts at my disposal. I\u0027m thinking the passive probes were good, but 16 is too many for any one ship. One ship has plenty of fuel for a single planet/moon mission, in general, so for each planet/moon you need one powered ship, then as many probes as you would like to use to make scanning faster. This is particularly important for planets/moons that are hard to scan without a lot of orbital changes to cover the whole surface. For example, I found moho difficult to fully map without a lot of orbit changes, my orbits tended to follow the same ground path regardless of how high I was, so I got coverage by shifting my inclination. \u003C/p\u003E\u003Cp\u003ESo a basic plan would be to drop off a probe with a polar orbit of 750km for the HI SAR Then another at a 300-350km orbit with the rest of the S.C.A.N line of orbital antennas. Then, depending on the object you are scanning, I would deploy additional 300-350km satellites at varying altitudes or varying inclinations... Whatever it takes to get scan coverage of 100% of the surface.\u003C/p\u003E\u003Cp\u003EOf course the powered craft also has enough science tools to take advantage of the science opportunities, if you still need the science points. The SC9001, the goo, and the gravioli detectors are great for orbital science collection, log their results at every altitude multiple times. You should be able to pull in ~2000 science points for each object you orbit.\u003C/p\u003E\u003Cp\u003EMy 21 probe ship weighed in at about 100 tons by the time I left Kerbin orbit. I\u0027m thinking the next design will weigh twice that since it will have multiple powered craft, and be carrying a lot more fuel and engines. The passive probes weigh almost nothing.\u003C/p\u003E\n"},{"CreatedByName":"Wamphyri","CreatedById":84044,"CreatedDateTime":"2013-12-07T11:53:16Z","Content":"\n\u003Cp\u003Ei would be interested in seeing what your active and passive satellites looked like.\u003C/p\u003E\u003Cp\u003Ei\u0027ve only 2 satellite designs i\u0027ve created so far that are worth mentioning; my long/short range comms satellite, and my short range/kethane/science satellite. my goals were to create a one size fits all system for basically any body in the system. \u003C/p\u003E\u003Cp\u003Ei\u0027m realizing now, though... that i might need to simplify my designs a bit. i don\u0027t see how i could still achieve these goals and still create a suitable deployment system that is still relatively lag free.\u003C/p\u003E\n"}]}