{"TopicId":58492,"ForumId":24,"TopicTitle":"Happy New Year!","CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2014-01-01T17:05:31Z","PageNum":1,"Articles":[{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2014-01-01T17:05:31Z","Content":"\n\u003Cp\u003EWell, it has been too long. 5 months almost to be exact. Where was I? Well, following the PD issue (some of you may remember that) I did some digging to try and find the whole truth. Lesson learned: DO NOT EVER go digging in bad events that have the slightest hint of being shady. You will not like what you find. To this day I\u0027m not sure if I found the whole truth. I don\u0027t believe I did, but what I did find didn\u0027t paint a pretty picture for Squad. After seeing what I saw, I refused to support a development team that appeared to do what I had though they\u0027d done. Though I have not forgotten, and still have my belief that Squad is better than that shaken, people can\u0027t hold onto grudges like that forever. This new year I decided it was time to leave the past behind and give them a second chance. So here I have returned. My lession is learned. When stuff like that happens, keep your distance, do not go searching for answers, it only shows you darkness.\u003C/p\u003E\u003Cp\u003EI had barely played with .22 for a week when it came out. Can I get updated on what update we are on now, what new parts we got, what new mechanics, and what is being talked about for the next update? Meanwhile I\u0027ll be trolling the mods section looking to see what has been updated as far as my mod list.\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2014-01-02T06:46:48Z","Content":"\n\u003Cp\u003EWelcome (back) to the forums!\u003C/p\u003E\u003Cp\u003EI had to take a break from a forum myself once due to getting too personally involved in some drama I shouldn\u0027t have, so I\u0027ve learned that lesson (or something close to it) the hard way myself. Everyone makes mistakes, and the number of pure, honest too-good-for-this-sinful-Earth types out there is exceedingly small. I\u0027m sure we all have a few skeletons in our closet we wouldn\u0027t want others to see in the light of day.\u003C/p\u003E\u003Cp\u003EAs far as the current status: We\u0027re on 0.23 now, which has made a few changes to the science system: You can\u0027t spam an unlimited number of transmissions with certain experiments to deplete the science in one go. Instead, certain modules are one-use only, so you have to decide whether to transmit now or recover later. However, there\u0027s also a Mobile Processing Lab part that allows you to reset modules after they\u0027ve been \u0022used up\u0022 so you can still make reusable probes to a certain degree. Also, there\u0027s a new SABRE-type engine called the RAPIER, and various other minor features and tweaks.\u003C/p\u003E\n"},{"CreatedByName":"David Hock","CreatedById":99336,"CreatedDateTime":"2014-01-02T14:20:24Z","Content":"\n\u003Cp\u003ESame to you.\u003C/p\u003E\u003Cp\u003EMay this year bring a lot of happiness in your life.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-22T13:28:46Z\u0022 title=\u002210/22/2014 01:28  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 22, 2014\u003C/time\u003E by David Hock\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2014-01-02T15:11:04Z","Content":"\n\u003Cp\u003EWell, seeing as from .20.2 to .23, each update has progressively increased kerbin\u0027s terrain lag, particularly the oceans, my days of obscenely large projects might be on hold. Either way, I\u0027ll be doing my besst to make the most of 2014.\u003C/p\u003E\n"}]}