{"TopicId":60215,"ForumId":24,"TopicTitle":"Howdy KSPers!","CreatedByName":"Skeletoir","CreatedById":101163,"CreatedDateTime":"2014-01-17T06:22:19Z","PageNum":1,"Articles":[{"CreatedByName":"Skeletoir","CreatedById":101163,"CreatedDateTime":"2014-01-17T06:22:19Z","Content":"\n\u003Cp\u003EI\u0027ve been trawling the near space of Kerbin for a while now, but haven\u0027t had the technological power to run KSP at a respectable clip, until now. I started playing right after seeing a video on youtube of North Korea\u0027s last rocket launch. Seeing comments on the video stating that their technology was a direct rip-off of low end Kerbal technology I was intrigued. ThorLP got me hooked though, the guy is a KSP savant! Hope I can contribute to the community, and I look forward to many, many more disasters along the way.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1265.photobucket.com/albums/jj510/j_vandal/Kay%20Espy/screenshot0_zps3a67c202.png\u0022 alt=\u0022screenshot0_zps3a67c202.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2014-01-17T23:21:03Z","Content":"\n\u003Cp\u003EWelcome to the forums! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ENice to hear you\u0027re a fan of the Insane Rockets Division videos. I also follow Thor from time to time, although not as regularly as some of the others on my list of favorite LPers.\u003C/p\u003E\u003Cp\u003EAs for contributing to the community, we\u0027re always open to new and interesting submissions. Feel free to share a favorite craft, a report from a memorable mission (successful or otherwise), or even just \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/24533-Show-off-your-awesome-KSP-pictures%21\u0022 rel=\u0022external nofollow\u0022\u003Eawesome screenshots\u003C/a\u003E. If you\u0027re ever stuck and don\u0027t know what to do next, feel free to ask questions or check out a tutorial or two, especially those I\u0027ve listed in the Drawing Board (conveniently linked through my signature).\u003C/p\u003E\u003Cp\u003EHope this helps!\u003C/p\u003E\n"}]}