{"TopicId":63594,"ForumId":24,"TopicTitle":"Greetings!","CreatedByName":"Drelam","CreatedById":103798,"CreatedDateTime":"2014-02-18T14:38:10Z","PageNum":1,"Articles":[{"CreatedByName":"Drelam","CreatedById":103798,"CreatedDateTime":"2014-02-18T14:38:10Z","Content":"\n\u003Cp\u003EGreetings everyone!\u003C/p\u003E\u003Cp\u003EFirst, some words about myself, i am not a native english speaker so please apologize in advance.\u003C/p\u003E\u003Cp\u003EI have stumbled over KSP some weeks ago and i L O V E building and tinkering new kinds of rockets and spaceplanes (althrough not very sucessful, lol). \u003C/p\u003E\u003Cp\u003EI am more or less a bit old-fashioned, i have no facebook, twitter or similar account and i am not planning to get one. \u003C/p\u003E\u003Cp\u003EMost of the time, i prefer to read some lines instead of watching a 34 minutes youtube video, just to get the answer i need. \u003C/p\u003E\u003Cp\u003EI am looking forward to join this great community and i hope i can contribute something useful/intelligent from time to time (although not very likely, lol).\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2014-02-19T00:02:36Z","Content":"\n\u003Cp\u003EWelcome to the forums, and glad to hear you\u0027re enjoying the game! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe KSP forums here are a very cosmopolitan community, with users from all around the globe. While English is required on most of the site\u0027s subforums, we do have specific International boards for non-English-speaking users who want to chat in their own native languages. (Also, I can guarantee that you are much more fluent in English than I am in your native tongue \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E )\u003C/p\u003E\u003Cp\u003EIn general, feel free to contribute. Ask questions, answer other people\u0027s, share tales and screenshots of your experiences, and so on. If you\u0027re ever stuck on something in the game, you may also want to check out the Drawing Board (linked in my signature), which lists a number of different tutorials and other player resources for the benefit of players of all skill levels, whether you\u0027re a beginner wondering what to do next or a seasoned pro who just wants to try something different.\u003C/p\u003E\u003Cp\u003EHope this helps!\u003C/p\u003E\n"},{"CreatedByName":"Dispatcher","CreatedById":78707,"CreatedDateTime":"2014-02-22T04:48:08Z","Content":"\n\u003Cp\u003EWelcome, Drelam!\u003C/p\u003E\u003Cp\u003EI too am old fashioned in many ways. However, KSP is very fun. I think you will like it here in the forums.\u003C/p\u003E\n"}]}