{"TopicId":63699,"ForumId":24,"TopicTitle":"Great to be here!","CreatedByName":"Impatience","CreatedById":103914,"CreatedDateTime":"2014-02-19T16:43:33Z","PageNum":1,"Articles":[{"CreatedByName":"Impatience","CreatedById":103914,"CreatedDateTime":"2014-02-19T16:43:33Z","Content":"\n\u003Cp\u003EHi, just wanted to introduce myself, I\u0027m Impatience and I\u0027ve only been aware of Kerbal Space Program for a few days...let me say...AMAZING! I remember playing a Space Shuttle game cartridge on my Commodore 64 about 25\u002B years ago and I was addicted to it. Since then, I haven\u0027t really seen much that interested me in the space simulator genre. Kerbal Space Program is a welcome sight.\u003C/p\u003E\u003Cp\u003EI just happened to be looking through steam for a demo of something I could play to waste some time and saw this cartoony space thing and thought, what the hell, should amuse me for about 10 minutes. I played, I crashed, I didn\u0027t get it. Then I found the forums and the wiki\u0027s and realized what you guys are really doing here and I\u0027m hooked. So after reading some wiki\u0027s, watching a few Scott Manley videos, and dreaming of space flight...the purchase was made (took less than 12 hours from demo download to purchase).\u003C/p\u003E\u003Cp\u003EI\u0027ve started career mode, following along on the wiki, and I\u0027ve made it to space yay!!! Haven\u0027t been in orbit yet or been to the Mun, but soon my friends, soon I will be exploring all that space has to offer. \u003C/p\u003E\u003Cp\u003EI\u0027m so jazzed hehehe \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Thanks for your time and energy into building such a magnificent space program simulator...worth every penny!\u003C/p\u003E\u003Cp\u003E--Impatience\u003C/p\u003E\n"},{"CreatedByName":"MarkedOne","CreatedById":103395,"CreatedDateTime":"2014-02-19T19:18:25Z","Content":"\n\u003Cp\u003EHey, welcome here =)\u003C/p\u003E\u003Cp\u003EThat story is EXACTLY how i got into KSP\u003C/p\u003E\n"},{"CreatedByName":"Tidus Klein","CreatedById":72277,"CreatedDateTime":"2014-02-19T19:38:49Z","Content":"\n\u003Cp\u003EIF you ever.....MMMM say branch over to the SPH (Space plane hanger) and need some help...... PM ME.\u003C/p\u003E\u003Cp\u003EAND WELLCOME ABOARD, may many sleep less nights be your guide to space.\u003C/p\u003E\n"}]}