{"TopicId":63903,"ForumId":24,"TopicTitle":"\u002B Hello World \u002B","CreatedByName":"UKNightWatch","CreatedById":104078,"CreatedDateTime":"2014-02-21T17:37:59Z","PageNum":1,"Articles":[{"CreatedByName":"UKNightWatch","CreatedById":104078,"CreatedDateTime":"2014-02-21T17:37:59Z","Content":"\n\u003Cp\u003EHello all,\u003C/p\u003E\u003Cp\u003EI cant too the Kerbal Space Program by accident when it was being compared to another \u0027indie game\u0027. I downloaded the KSP demo and started in on the tutorials, ship design and launch. After a couple of somewhat spectacular crashes I had my first Kerbal in space. The poor guy is still out there somewhere - I had not planned his return trip!\u003C/p\u003E\u003Cp\u003EAfter about thirty minutes in my minds eye, I turned off the demo and found I had actually been using it for some hours. Hooked? Let\u0027s just say I have just bought the full version and the Kerbalizer and that is that! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m an \u0027older\u0027 gamer and I have a couple of health conditions that have ganged up on me and this has lead to disability. So far, KSP seems to me to be quite straight forward as far as controls go and this is a great boon - because of problems with my hands, I find it quite difficult to use games or other programs that have complex controls.\u003C/p\u003E\u003Cp\u003EI come from North East England (Durham County). I went to college and managed to get to Higher National Diploma (HND) level in computing. I have \u0027tinkered\u0027 with computers / tech since around the age of ten - it\u0027s nice to have a hobby. As a gamer, there are hundreds of games I have played and a few very basic ones I have coded -for myself (nothing fancy).\u003C/p\u003E\u003Cp\u003EIt looks to me as if KSP is going to be \u0027right up my alley\u0027 so to say.\u003C/p\u003E\u003Cp\u003EHappy launches all. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2014-02-21T21:21:11Z","Content":"\n\u003Cp\u003EHello UKNightWatch. Your experience is pretty typical; very few people play the demo for long. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-21T21:29:55Z\u0022 title=\u002202/21/2014 09:29  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 21, 2014\u003C/time\u003E by Vanamonde\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2014-02-22T01:15:55Z","Content":"\n\u003Cp\u003EI\u0027ll have you know, \u003Cem\u003EI\u003C/em\u003E played the demo for months before getting the real game... but mostly because I couldn\u0027t buy it myself \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\u003Cp\u003EHeyo dere, new poster!\u003C/p\u003E\n"},{"CreatedByName":"UKNightWatch","CreatedById":104078,"CreatedDateTime":"2014-02-22T01:48:31Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Thanks for the replies.\u003C/p\u003E\u003Cp\u003EI just messed about with KSP today and try to get to know the basic layout and how build a vehicle. After frustrating myself a little trying out \u0027plane\u0027 building, I switched to tin cans with explosives tacked on!\u003C/p\u003E\u003Cp\u003EIt\u0027s amazing how time flies when you are having fun and how you suddenly realize its 0130 and, maybe you should log out.\u003C/p\u003E\u003Cp\u003EBest thing is that I completed a vehicle that reaches orbit shortly after jettison of \u0027side tanks\u0027, is maneuverable in space and (with the help of a \u0027secondary tank and engine / motor) easily returned to the surface. I even have the main \u0027craft\u0027 land safely by parachute and landing struts.\u003C/p\u003E\u003Cp\u003EMy next goal is to make a reusable vehicle - out to orbit and return with all parts intact (probably a plane type). I\u0027ll then move on to an orbit \u0027station\u0027.\u003C/p\u003E\u003Cp\u003EHooked? Me? Time will tell but it is looking good!\u003C/p\u003E\u003Cp\u003ESafe landings.\u003C/p\u003E\n"},{"CreatedByName":"Doozler","CreatedById":103369,"CreatedDateTime":"2014-02-22T08:19:57Z","Content":"\n\u003Cp\u003EHey! Welcome to the crew. Sounds like you\u0027re well on your way. \u003C/p\u003E\u003Cp\u003EYour next projects found pretty tough - I didn\u0027t get a station until after sample returns from both mun and minmus. I\u0027m too scared to even try a spaceplane \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EMaybe a mum flyby next? I remember a really nice post with a list of suggested tasks- I\u0027ll see if I can find it.\u003C/p\u003E\u003Cp\u003EAre you career or sandbox?\u003C/p\u003E\n"},{"CreatedByName":"UKNightWatch","CreatedById":104078,"CreatedDateTime":"2014-02-22T23:31:59Z","Content":"\n\u003Cp\u003EThanks for reply,\u003C/p\u003E\u003Cp\u003EMaybe the sample returns is the way to go - I\u0027ll have a think on that.\u003C/p\u003E\u003Cp\u003EI do not have KSP on just now as other matters need attention but I think I set up in sandbox. I\u0027m really just trying to get the hang of things and will probably start anew several times before settling down.\u003C/p\u003E\u003Cp\u003EI did have fun earlier adding a crew member to my roster via the persistent file - easy for me but not for the feint of heart so to say! It seemed fitting to call the new member Major Thom Kerman for some reason.\u003C/p\u003E\u003Cp\u003EI think I am enjoying KSP because I have always been something of a tinker. Also, there seems to be lots to do in KSP - and that is even before I get started on mods!\u003C/p\u003E\u003Cp\u003ESuccessful launches. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-22T23:36:25Z\u0022 title=\u002202/22/2014 11:36  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 22, 2014\u003C/time\u003E by UKNightWatch\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"cardgame","CreatedById":12317,"CreatedDateTime":"2014-02-23T07:22:18Z","Content":"\n\u003Cp\u003ESpeaking of mods, since you mentioned you may have problems with controls, MechJeb can automate a variety of tasks for easier piloting, as well as displaying an abundance of helpful information. Also, since you mentioned your tinkering and coding skills, kOS scripting system allows you to create autopilots or RC-style controls, kind of like tinkering with a robot\u0027s guidance programming; I\u0027m not terribly familiar with it. Look them up if the descriptions intrigue you \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2014-02-23T07:45:20Z","Content":"\n\u003Cp\u003EHello and welcome! I second the use of MechJeb, as it can simplify the game most of the time \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"UKNightWatch","CreatedById":104078,"CreatedDateTime":"2014-02-24T14:51:47Z","Content":"\n\u003Cp\u003EThanks for the new replies.\u003C/p\u003E\u003Cp\u003EI am intrigued!\u003C/p\u003E\u003Cp\u003EI\u0027ll look into the mentioned items when I get a bit more used to KSP and when I get time. Time seems to be an odd thing for me just now - the hours last days the days are fleeting and there is never enough time at hand! At least I get an hour or so gaming in most days. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnywho! Thanks again.\u003C/p\u003E\n"}]}