{"TopicId":74095,"ForumId":24,"TopicTitle":"Hello from Barcelona! I need a bit of orientation","CreatedByName":"redundantbits","CreatedById":112229,"CreatedDateTime":"2014-06-04T10:02:23Z","PageNum":1,"Articles":[{"CreatedByName":"redundantbits","CreatedById":112229,"CreatedDateTime":"2014-06-04T10:02:23Z","Content":"\n\u003Cp\u003EHello everyone!\u003C/p\u003E\u003Cp\u003EI have some short questions. Let me introduce my game briefly first:\u003C/p\u003E\u003Cp\u003EI\u0027ve made it to the Mun and Minmus (and back) several times and I\u0027ve got the techtree fully unlocked. I also made it to Gilly and Eve (but obviously not back). However, I\u0027m overwhelmed by the number of new available parts and don\u0027t know where to use them in order to improve my quite basic rockets and landers.\u003C/p\u003E\u003Cp\u003EFirst question: I want to go further than Kerbin\u0027s moons. What are the next logical (and fun) challanges?\u003C/p\u003E\u003Cp\u003ESecond: Is now the game \u0022just\u0022 challanging yourself? I mean, since science is no longer useful and you don\u0027t need anything like for example harvesting or new technologies to subsist.\u003C/p\u003E\u003Cp\u003EThank you very much! See you around the forum \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Uzric","CreatedById":102098,"CreatedDateTime":"2014-06-04T12:41:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022redundantbits\u0022 data-cite=\u0022redundantbits\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EFirst question: I want to go further than Kerbin\u0027s moons. What are the next logical (and fun) challanges?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E- Eve: Near planet, medium gravity (easy to be captured)\u003C/p\u003E\u003Cp\u003E- Duna: Near planet, low gravity (less easy to be captured)\u003C/p\u003E\u003Cp\u003E- Jool: Far planet, but very high gravity (very easy to be captured)\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022redundantbits\u0022 data-cite=\u0022redundantbits\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ESecond: Is now the game \u0022just\u0022 challanging yourself? I mean, since science is no longer useful and you don\u0027t need anything like for example harvesting or new technologies to subsist.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt is. There are mods that can make it a little more interesting though:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/80369-0-23-5-SCANsat-v6-0-Real-Scanning-Real-Science-at-Warp-Speed!-May-17\u0022 rel=\u0022external nofollow\u0022\u003EScanSat\u003C/a\u003E: gives purpose to satellites by implementing orbital mapping.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/56399\u0022 rel=\u0022external nofollow\u0022\u003ERemoteTech 2\u003C/a\u003E: even more purpose to satellites.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/23979\u0022 rel=\u0022external nofollow\u0022\u003EKethane\u003C/a\u003E: gives purpose to bases by implementing fuel mining.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/79588-0-23-5-Modular-Kolonization-System-%280-16-7%29-2014-05-26\u0022 rel=\u0022external nofollow\u0022\u003EMKS\u003C/a\u003E: even more purpose to bases.\u003C/p\u003E\u003Cp\u003ECheck \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/55401-Community-Mods-and-Plugins-Library\u0022 rel=\u0022external nofollow\u0022\u003Ethis post\u003C/a\u003E too if you\u0027re going full nuts into mods.\u003C/p\u003E\u003Cp\u003EAnd welcome to the forums.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-13T21:58:58Z\u0022 title=\u002212/13/2014 09:58  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 13, 2014\u003C/time\u003E by Uzric\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2014-06-04T15:21:24Z","Content":"\n\u003Cp\u003EWelcome aboard!\u003C/p\u003E\u003Cp\u003EFrom a realistic-ish standpoint, I\u0027d recommend trying for Duna, as it is the game\u0027s Mars analog. You could also try putting together some stations, and perhaps one or two around Kerbin\u0027s moons!\u003C/p\u003E\u003Cp\u003EAlso, those parts you\u0027ve unlocked have all sorts of extra purposes. The LV-N engine has absolutely wonderful ISP, meaning that you can more efficiently use the fuel in your tanks. It is recommended that you have LV-Ns when you decide to travel interplanetary, but it\u0027s not required. \u003C/p\u003E\u003Cp\u003EIf you have any more questions, feel free to PM me and I can explain in greater detail. Have fun!\u003C/p\u003E\n"},{"CreatedByName":"RenevB","CreatedById":110395,"CreatedDateTime":"2014-06-04T15:44:07Z","Content":"\n\u003Cp\u003EAbout the partlist: the intention of at least part of career mode is giving new players the parts in smaller portions, but to actually help you, I\u0027d say you\u0027d have to ask a few more specific questions.\u003C/p\u003E\u003Cp\u003EAs to where to go next: Duna and Eve would be the likeliest candidates. You seem to have reached Eve already, if your guys are still in orbit, you could perhaps send a rescue mission. (Landing and returning from Eve is arguably the hardest thing to do in this game, because of the dense atmosphere and the high gravity.) Duna is a smaller planet with a less dense atmosphere, so landing there will be a little harder, but it\u0027s the easiest planet to return from.\u003C/p\u003E\u003Cp\u003EIn a finished career mode, there is nothing left to do but whatever you challenge yourself to do. But nothing says you can\u0027t just start a new career save, or start a sandbox save with the idea to colonize Duna or Laythe, or... well, that\u0027s the same as a finished career mode really, with the same \u0027limitations\u0027.\u003C/p\u003E\n"}]}