{"TopicId":80662,"ForumId":24,"TopicTitle":"Mods for Mac OSX","CreatedByName":"derrickkchan","CreatedById":117943,"CreatedDateTime":"2014-08-04T05:37:46Z","PageNum":1,"Articles":[{"CreatedByName":"derrickkchan","CreatedById":117943,"CreatedDateTime":"2014-08-04T05:37:46Z","Content":"\n\u003Cp\u003EHi I just got KSP and realized there are a lot of mods that can be added. However I can\u0027t seem to figure out how to find mods for Mac OSX. Do they exist or are the mods only available for the Windows version? Thanks\u003C/p\u003E\n"},{"CreatedByName":"Canopus","CreatedById":57774,"CreatedDateTime":"2014-08-04T07:33:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022derrickkchan\u0022 data-cite=\u0022derrickkchan\u0022\u003E\u003Cdiv\u003EHi I just got KSP and realized there are a lot of mods that can be added. However I can\u0027t seem to figure out how to find mods for Mac OSX. Do they exist or are the mods only available for the Windows version? Thanks\u003C/div\u003E\u003C/blockquote\u003EAs far as i know, all mods should work for all versions of KSP.\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2014-08-04T08:11:12Z","Content":"\n\u003Cp\u003EThere are a few rare mods that are only windows but they are external tools for finding flybys and stuff. You can tell which they are because they have a .EXE file instead of a .DLL.\u003C/p\u003E\u003Cp\u003EPretty much every other mod is platform agnostic.\u003C/p\u003E\n"},{"CreatedByName":"Master Tao","CreatedById":110410,"CreatedDateTime":"2014-08-04T13:52:36Z","Content":"\n\u003Cp\u003EWelcome to the forums!\u003C/p\u003E\u003Cp\u003EMost mods do work on OS X, and when there have been Mac-specific issues, the modders have always been responsive. The few mods that don\u0027t work in-game are usually already outdated or highly experimental.\u003C/p\u003E\u003Cp\u003EOne key is that the installation instructions assume you use Windows. You can merge folders on OS X by dragging and dropping while holding Option. Then click \u0022Keep Newer\u0022 or \u0022Merge.\u0022\u003C/p\u003E\n"},{"CreatedByName":"Volcanix","CreatedById":117245,"CreatedDateTime":"2014-08-04T15:51:50Z","Content":"\n\u003Cp\u003EWelcome to the Kerbal Space Program Forum!\u003C/p\u003E\u003Cp\u003EI\u0027m also using OS X and as far as I\u0027ve modded my game (Kethane, Kerbal Attachment System, SCANSat, Kerbal Engineer Redux, Connected Living Space, Chatterer, Active Texture Manager, RasterPropMonitor, KerbQuake, Module Manager, ProceduralFairings, blizzy\u0027s Toolbar) everything works fine. So I\u0027m pretty sure until there is a good visible warning every mod will work for you - if not, try to contact the mod author, if you want to. Have fun on the Forum!\u003C/p\u003E\n"},{"CreatedByName":"derrickkchan","CreatedById":117943,"CreatedDateTime":"2014-08-05T02:24:19Z","Content":"\n\u003Cp\u003ECool thanks I\u0027ll try that\u003C/p\u003E\n"},{"CreatedByName":"SolNG","CreatedById":118249,"CreatedDateTime":"2014-08-07T13:34:49Z","Content":"\n\u003Cp\u003EI have a Mac laptop I use when I travel, so I loaded KSP and a few mods from my PC version. The only trouble I had was that memory usage maxed out faster on my laptop than my massive home rig. So I couldn\u0027t quite tell if the mod was incompatible or I just don\u0027t have enough RAM. It\u0027s not a big deal though.\u003C/p\u003E\n"}]}