{"TopicId":89559,"ForumId":24,"TopicTitle":"Hey Everyone!","CreatedByName":"Shadtiger","CreatedById":128387,"CreatedDateTime":"2014-11-06T08:52:51Z","PageNum":1,"Articles":[{"CreatedByName":"Shadtiger","CreatedById":128387,"CreatedDateTime":"2014-11-06T08:52:51Z","Content":"\n\u003Cp\u003ESo, a buddy of mine (also my main contractor/boss in the illustration field) turned me onto this a few months ago and I got a copy of steam...being a NASA nurd, I naturally fell in love at first flight. After that it was off to Youtube to have a look about for tutorials, how to\u0027s, don\u0027t do its, and so on...there is so much there, but I found one that really inspired me. Thanks for this goes out to Scott Manley, you rock dude. I have watched your Interstellar Quest going on the third time through now, I love it. In an endeavor to make something of a You Tube name for myself, not only for this but for my illustration as well (though that will be on a separate account) I decided to start my gaming vids with KSP. I will also probably be running a Minecraft set as well eventually, but that takes back seat to this new love of mine...\u003C/p\u003E\u003Cp\u003ENehoo, I am planning on a Deep Space or Bust series, and as I get more stuff ready for it, I will keep y\u0027all updated. For now, it has a ton of modpacks, cause it makes the game more fun for me, and well, it should make it a whole lot more interesting as I do stupid things, like coming in to steep and burning one up, or not getting my math right on the aerospace frame and watching the things come apart at the seams as I scream and cuss in frustration... etc. Let me know if it sounds like fun crowd!\u003C/p\u003E\u003Cp\u003EShad\u003C/p\u003E\n"},{"CreatedByName":"Shadtiger","CreatedById":128387,"CreatedDateTime":"2014-11-06T23:55:03Z","Content":"\n\u003Cp\u003EAnd my first question on the forums and their operation...Avatars...How Do?\u003C/p\u003E\u003Cp\u003EFound the edit avatar bit in my profile, but nowhere to upload one...1\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2014-11-07T00:41:26Z","Content":"\n\u003Cp\u003EWelcome to the forums! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Glad to hear that you\u0027ve been enjoying the game. Hope your video series does well!\u003C/p\u003E\u003Cp\u003EAs to your questions about your forum account: All new users go into a user group with some restrictions, so we can more easily deal with them in case they turn out to actually be some sort of vile spambot. Among other things, posts have to be manually approved by the moderation staff, and certain privileges such as avatars and signatures are turned off as well. Don\u0027t worry, though; once you\u0027ve made a few posts (not very many; ~3-5, IIRC) and we\u0027re sure that you\u0027re human, your account will be bumped up to full functionality. You may want to take a look at our \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/48073-Forum-FAQ-%E2%80%93-Answers-for-New-Users\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003ENew User FAQ\u003C/strong\u003E\u003C/a\u003E for details on this, as well as for other little bits of info that might be helpful to new users.\u003C/p\u003E\u003Cp\u003EHope this helps! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Shadtiger","CreatedById":128387,"CreatedDateTime":"2014-11-07T04:30:28Z","Content":"\n\u003Cp\u003EThanks, kind of figured that might be the case as it seems to be with a lot of the various forums I have seen. Thanks for the info, and the directions I should be able to find my way about from there...\u003C/p\u003E\u003Cp\u003EOh, does anyone know which beautification mod has the volumetric clouds? I really want to add that particular level of difficulty to my game too.\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-11-07T09:57:00Z","Content":"\n\u003Cp\u003EEnvironmental Visual Enhancements (EVE).\u003C/p\u003E\u003Cp\u003EYou may also want to look at Better Atmospheres and others.\u003C/p\u003E\u003Cp\u003EAll the (released) mods are in \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/forums/35-Add-on-Releases\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/forums/35-Add-on-Releases\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Shadtiger","CreatedById":128387,"CreatedDateTime":"2014-11-07T10:50:06Z","Content":"\n\u003Cp\u003EThanks, that helps a lot! Now to go dig it up and fiddle about till I find the right beautification mod! :3\u003C/p\u003E\n"},{"CreatedByName":"Shadtiger","CreatedById":128387,"CreatedDateTime":"2014-11-14T16:30:06Z","Content":"\n\u003Cp\u003ENot a bad birthday, might be sick, and achy...but got the keys to the new apartment this morning, had pineapple spice cake for breakfast, and in general, the day is going good...even managed to make a fair bit of science this morning without killing any kerbals, so hey, things are looking up.\u003C/p\u003E\n"}]}