{"TopicId":92044,"ForumId":24,"TopicTitle":"Forum Tools Question","CreatedByName":"Saint-Stanislas","CreatedById":72776,"CreatedDateTime":"2014-12-05T23:48:13Z","PageNum":1,"Articles":[{"CreatedByName":"Saint-Stanislas","CreatedById":72776,"CreatedDateTime":"2014-12-05T23:48:13Z","Content":"\n\u003Cp\u003EHi everybody, \u003C/p\u003E\u003Cp\u003EI\u0027m new to the forum but I\u0027m on ksp since 0.16 or so... I just subscribed to the forum because I was able to find everything by just reading through them until now ! I\u0027m a french canadian, so excuse my not so fluent english ( past tence and stuff )!\u003C/p\u003E\u003Cp\u003ESo I am using the \u0022search this thread tool\u0022 a lot before posting, to find out if somebody would have asked about something similar earlier. \u003C/p\u003E\u003Cp\u003EMaybe I am just blind, but I can\u0027t see any way to order the results by date. For recent thread it\u0027s not really a problem, but in the case of, as an example, a plugin thread that is out there since 0.18 or so, there is thousands of pages to look through. So when you search for a specific bug or something, the page that are coming up are often reporting the bug on a previous version of the game/mod and it\u0027s pretty confusing. If the result were ordered by date, you would see the latest report similar to yours. In the advanced search section, you can ask wich kind of order you want, but you can\u0027t search on a specific thread ( just a specific section of the forum ) \u003C/p\u003E\u003Cp\u003EI am sure it is really easy and there is just something i\u0027m not seeing. \u003C/p\u003E\u003Cp\u003ESo thanks in advance for your answers !!\u003C/p\u003E\u003Cp\u003E(EDIT) : No that I have posted this I realise that this is easy to come around by using the \u0022site:\u0022 function on google but it is unconvenient and there is obviously an easy way to do this onsite.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-05T23:52:52Z\u0022 title=\u002212/05/2014 11:52  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 5, 2014\u003C/time\u003E by Saint-Stanislas\u003C/strong\u003E\n\u003Cbr\u003EExtern solution ?\n\u003C/span\u003E\n"},{"CreatedByName":"robopilot99","CreatedById":102126,"CreatedDateTime":"2014-12-06T02:25:35Z","Content":"\n\u003Cp\u003EWelvome to the forums. As you have already noticed the forum search feature is not very helpful. As you have already discovered using Google works far better then the built in search function.\u003C/p\u003E\n"},{"CreatedByName":"Saint-Stanislas","CreatedById":72776,"CreatedDateTime":"2014-12-08T16:58:56Z","Content":"\n\u003Cp\u003EIt\u0027s strange, google argument seem to not work on \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/55219-0-25-Module-Manager-2-5-3-(Dec-07)-v-1c-Edition\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/55219-0-25-Module-Manager-2-5-3-(Dec-07)-v-1c-Edition\u003C/a\u003E \u003C/p\u003E\u003Cp\u003EBut it does on any other page from the same forum ... Any clue ?\u003C/p\u003E\u003Cp\u003Eedit: It seem to randomly not work on certain pages. Could it be related to google cache ?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-10T01:17:25Z\u0022 title=\u002212/10/2014 01:17  AM\u0022 data-short=\u00229 yr\u0022\u003EDecember 10, 2014\u003C/time\u003E by Saint-Stanislas\u003C/strong\u003E\n\u003C/span\u003E\n"}]}