{"TopicId":92404,"ForumId":24,"TopicTitle":"Somewhat new to the forums","CreatedByName":"Vector-5","CreatedById":120207,"CreatedDateTime":"2014-12-09T21:39:53Z","PageNum":1,"Articles":[{"CreatedByName":"Vector-5","CreatedById":120207,"CreatedDateTime":"2014-12-09T21:39:53Z","Content":"\n\u003Cp\u003EHello, all, I\u0027m a bit new to the forums, and have a couple questions about the way it works. But first, some info about myself. I\u0027m a \u0022veteran\u0022 KSP-er who\u0027s been happily crashing since .21, as you can see by my bio. I consider myself an OK SSTO designer, although I\u0027d enjoy learning some tips from the pros about how NOT to make an underpowered SSTO... Anyways, I have one question. Do you need to post a certain amount of posts to have a sig? I\u0027m just asking for confirmation, because I heard a while back that you need 5 posts to have a sig.\u003C/p\u003E\u003Cp\u003EThanks,\u003C/p\u003E\u003Cp\u003EVec\u003C/p\u003E\n"},{"CreatedByName":"Vector-5","CreatedById":120207,"CreatedDateTime":"2014-12-09T23:24:21Z","Content":"\n\u003Cp\u003EI probably should have done my research before!! My question is in the FAQ for new players. *facepalm*\u003C/p\u003E\u003Cp\u003E-Vec\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-12-09T23:44:03Z","Content":"\n\u003Cp\u003EWell at least that\u0027s sorted out.\u003C/p\u003E\u003Cp\u003EAs for your other question - the best way to ensure you don\u0027t underpower your SSTOs is to make sure you don\u0027t weigh them down with wings and other silly things like that. Building a SSTO rocket is just like building any other that is designed to go \u003Cstrong\u003ETO ORBIT\u003C/strong\u003E, with the \u003Cem\u003ESingle Stage\u003C/em\u003E making it somewhat simpler - big engines! Once in orbit, and with any payload detached, 200-300m/s deltaV and a couple of drogue parachutes should be all you need remaining for a targetted landing. Since orbit requires approx 4,500m/s in stock KSP that means aim for a launch deltaV of 4,800 - 4,900. Being single stage, the TWR will be very large by the time you get to orbit (and have burnt most of the fuel) so a launch TWR of 1.2 is plenty.\u003C/p\u003E\n"},{"CreatedByName":"Vector-5","CreatedById":120207,"CreatedDateTime":"2014-12-09T23:59:27Z","Content":"\n\u003Cp\u003EGot it. Thanks!\u003C/p\u003E\u003Cp\u003E-Vec\u003C/p\u003E\n"},{"CreatedByName":"zekes","CreatedById":23840,"CreatedDateTime":"2014-12-10T00:05:23Z","Content":"\n\u003Cp\u003Ewelcome! To get a sig you need a certain number of posts.... yes. It\u0027s just to keep spam accounts from forming.\u003C/p\u003E\n"},{"CreatedByName":"michaelsteele3","CreatedById":127113,"CreatedDateTime":"2014-12-10T13:42:27Z","Content":"\n\u003Cp\u003EHyo! Welcome to the KSP community!\u003C/p\u003E\n"}]}