{"TopicId":9357,"ForumId":24,"TopicTitle":"Hello KSP!","CreatedByName":"Subject36","CreatedById":21576,"CreatedDateTime":"2012-04-09T10:27:29Z","PageNum":1,"Articles":[{"CreatedByName":"Subject36","CreatedById":21576,"CreatedDateTime":"2012-04-09T10:27:29Z","Content":"\n\u003Cp\u003EHey there KSP forums!\u003C/p\u003E\u003Cp\u003EAlthough I\\\u0027ve already posted in the support forum, thought I should probably do one of these. Been playing for about two days now, and I\\\u0027m really enjoying myself. KSP is just so different to anything else I\\\u0027ve ever played, except maybe orbiter, but I\\\u0027ll admit that was too hardcored for me and didn\\\u0027t have the fun of building your own rockets.\u003C/p\u003E\u003Cp\u003EI\\\u0027m still working my way towards a circular orbit. I\\\u0027m gradually making my orbits less and less eliptical. Remembering the first law of motion helped \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E. I did have one kind of awesome comet-like one which went out further than than the Mun\\\u0027s orbit and then re-entered the atmosphere before slingshotting out ;P. Sadly didn\\\u0027t get any screenshots.\u003C/p\u003E\u003Cp\u003EOne final thing, how do you insert screenshots into posts? I can\\\u0027t figure out how to do anything other than attach them.\u003C/p\u003E\u003Cp\u003ELooking forward to being past of the KSP community, which has already been really good in the support forum.\u003C/p\u003E\n"},{"CreatedByName":"Bill_Murray","CreatedById":17664,"CreatedDateTime":"2012-04-09T13:00:12Z","Content":"\n\u003Cp\u003EHi, welcome to the forum!\u003C/p\u003E\u003Cp\u003EQuick tip to help you adjust those orbits to make them circular. Firstly, any burn your make affects the point on the opposite side of the planet. If you burn at your PE the AP will change, and so on. You have two choices: you can prograde (burn whilst aiming at the circle on the navball, or retrograde (burn towards the circle with a cross in it). Prograde will mean a higher orbit on the \u003Cstrong\u003Eopposite \u003C/strong\u003Eside of the planet, retrograde a lower one. \u003C/p\u003E\u003Cp\u003ENow imagine your PE is 80,000m and your AP is 100,000, and you would like a circular orbit at that 100,000ms. Wait until you reach your AP and your prograde burn (facing the circle). Watch in map view until your altitude at PE approaches 100,000m and stop burning. Try to be as accurate as possible. The AP and PE symbols will shift and might even flick all over the place if the PE and AP are very close, (don\\\u0027t worry if the symbols flicker, it\\\u0027s a good thing). You can prograde/retrograde burn anywhere in your orbit, not just the AP and PE, and it will affect the point on the opposite side of the planet, and the AP and PE points will shift. Map view is useful for this stuff. You may need to do several orbits and adjust at the AP and PE several times to get a really neat orbit. Also, all orbits should be above 70,000ms.\u003C/p\u003E\u003Cp\u003ETo get those guys home all you would do is retrograde burn until your orbit comes back down to the planet.\u003C/p\u003E\u003Cp\u003EHope that helps, that\\\u0027s a rough guide so still lots for you to learn.\u003C/p\u003E\u003Cp\u003EYour mission: go back to one of your spacecraft and make a circular obit at 100,000ms.\u003C/p\u003E\n"},{"CreatedByName":"Capt\u0026#039;n Skunky","CreatedById":1261,"CreatedDateTime":"2012-04-09T17:02:07Z","Content":"\n\u003Cp\u003EWelcome to the KSP Forums!\u003C/p\u003E\u003Cp\u003ETo put images in your post, just paste the URL into the text area, select the whole thing, then click on the image button (furthers left on second set of buttons, under the B button) and it will wrap the URL with image tags. \u003C/p\u003E\u003Cp\u003EIf the image is large, like a screenshot, we ask that you please wrap them in spoiler tags to help cut down on the vertical size of your post. This is done the same way as the image tag. Select the image tags and URL and hit the nuclear button.\u003C/p\u003E\u003Cp\u003EHappy Launching!\u003C/p\u003E\u003Cp\u003EArrr!\u003C/p\u003E\u003Cp\u003ECapt\\\u0027n Skunky\u003C/p\u003E\u003Cp\u003EKSP Community Manager\u003C/p\u003E\n"},{"CreatedByName":"Subject36","CreatedById":21576,"CreatedDateTime":"2012-04-09T17:21:18Z","Content":"\n\u003Cp\u003EHow about for my screenshots (ie pictures from my pc that don\\\u0027t have a URL)? Is it generally recommended that I upload them somewhere first and then use that URL? Because I\\\u0027m sure I\\\u0027ve seen other people on the forum putting their screenshots directly into posts rather than attaching them.\u003C/p\u003E\u003Cp\u003EThanks again.\u003C/p\u003E\n"},{"CreatedByName":"Tiberion","CreatedById":8356,"CreatedDateTime":"2012-04-09T17:33:54Z","Content":"\n\u003Cp\u003EYou can add it as an attachment by opening the \u0027Attachments and Other options\u0027 menu just below the text box when you\\\u0027re typing a reply.\u003C/p\u003E\u003Cp\u003EIt\\\u0027s better for the forums if you use an imagehosting site, though; I recommend \u003Ca href=\u0022http://imgur.com/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/\u003C/a\u003E - once uploaded you can grab the \\\u0027Direct URL\\\u0027 or even the link formatted with the forum code (IMG tags) already.\u003C/p\u003E\n"},{"CreatedByName":"cteam","CreatedById":11775,"CreatedDateTime":"2012-04-09T17:38:10Z","Content":"\n\u003Cp\u003Ewelcome!\u003C/p\u003E\n"}]}