{"TopicId":95876,"ForumId":24,"TopicTitle":"Hello, not new to kerbal but new to the forums!","CreatedByName":"IntrepidBanana","CreatedById":134651,"CreatedDateTime":"2015-01-06T22:20:53Z","PageNum":1,"Articles":[{"CreatedByName":"IntrepidBanana","CreatedById":134651,"CreatedDateTime":"2015-01-06T22:20:53Z","Content":"\n\u003Cp\u003EHey everyone!\u003C/p\u003E\u003Cp\u003E I have been playing kerbal for a while now. When i say a while, i mean 1000\u002B hours of kerbal.Now here i am, i Finally got around to going to make an account on the forums after reading tons of posts here (Mostly mods, and design crafts). I usually play with realism increasing mods like FAR (or NEAR), DRE for a more immersive playstyle that stock mode doesn\u0027t give. I make lots of design crafts and a lot of replicas of crafts IRL and mainly focus on making it look good and usually not very effecient. But hey, everyone has there own personal playstyle.\u003C/p\u003E\u003Cp\u003ESo yea, this is a good community and i hope i fit in! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2015-01-06T23:52:43Z","Content":"\n\u003Cp\u003EWelcome to the forums! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EGlad to hear that you\u0027ve been enjoying the game. Since you like making replicas, you might find an audience over at the Spacecraft Exchange, if you\u0027re inclined to share them. Lots of creativity going around in that section of the forum.\u003C/p\u003E\n"},{"CreatedByName":"DMSP","CreatedById":124853,"CreatedDateTime":"2015-01-07T09:11:09Z","Content":"\n\u003Cp\u003EWell, welcome.\u003C/p\u003E\u003Cp\u003EWe do have a great community here.\u003C/p\u003E\u003Cp\u003EI was just like you, I had played KSP for like 700 hours before I joined.\u003C/p\u003E\u003Cp\u003EThere are lots of cool ideas here and post yours too!\u003C/p\u003E\u003Cp\u003ESee you around!\u003C/p\u003E\n"},{"CreatedByName":"michaelsteele3","CreatedById":127113,"CreatedDateTime":"2015-01-07T13:27:16Z","Content":"\n\u003Cp\u003EWelcome to the KSP community! Enjoy your stay!\u003C/p\u003E\n"}]}