{"TopicId":95983,"ForumId":24,"TopicTitle":"Recently started KSP and need some spaceplane tips","CreatedByName":"SignalCorps","CreatedById":134795,"CreatedDateTime":"2015-01-08T02:23:37Z","PageNum":1,"Articles":[{"CreatedByName":"SignalCorps","CreatedById":134795,"CreatedDateTime":"2015-01-08T02:23:37Z","Content":"\n\u003Cp\u003EI\u0027ve been having a little problem getting my spaceplanes off the runway. I have been following a basic design of a Mk2 cockpit, followed by a Mk2 bicoupler, a couple of fuel tanks, a radial intake body and a couple of basic or advanced turbine engines. I slap on some wings so that the center of lift is near the center of the plane, and add some elevators to the rear of the wings. I\u0027ll then maybe add a fuel/ox tank to the middle of the each wing and add a stage two rocket for space flight. Trouble is that my plane doesn\u0027t want to be a plane. It wants to be a backhoe. Before I take off, I\u0027ll check the elevators/alerions to make sure they, in fact, do move up and down. I go to full thrust and get rolling down the runway (yes on landing gear). I get up to a decent speed of 150m/s\u002B a second, and hold down S, but the place doesn\u0027t seem to want to pitch up. Usually if I make it to the end of the runway without tumbling and catch air that way, the plane will actually respond to up/down pitch fairly well, but just not while it\u0027s on the ground. What am I doing wrong here?\u003C/p\u003E\u003Cp\u003EAlso the default plane, the Stearwing D45 seems to have flight issues. When returning from upper atmospheric flight (and switching to jet engines, it doesn\u0027t want to fly anymore. It just begins a gradual decent downward, pitched downward at about 10-15 degrees. Same if I switch to rocket engines in the lower air. Even with decent airspeed of 200m/s it won\u0027t fly level or raise up. \u003C/p\u003E\u003Cp\u003EAny suggestions?\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2015-01-08T07:41:50Z","Content":"\n\u003Cp\u003ECan you post some pictures of your craft? Those are a great help in diagnosing problems. \u003C/p\u003E\u003Cp\u003EAs for the stock designs that come with the game, they are not meant to be good ships, because the devs want you to build better ones of your own. The stock craft are mostly meant as examples of how aspects of the game work. \u003C/p\u003E\u003Cp\u003EAnyway, welcome to the forum. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Commander Jebidiah","CreatedById":78685,"CreatedDateTime":"2015-01-08T08:01:00Z","Content":"\n\u003Cp\u003EWelcome to the forums.\u003C/p\u003E\u003Cp\u003EMake sure your landing gears are just behind your CoM and you\u0027re CoL is just behind your CoM\u003C/p\u003E\u003Cp\u003EIn case you don\u0027t know.\u003C/p\u003E\u003Cp\u003ECoM - Centre of Mass\u003C/p\u003E\u003Cp\u003ECol - Centre of Lift\u003C/p\u003E\n"},{"CreatedByName":"Frank_G","CreatedById":100000,"CreatedDateTime":"2015-01-08T08:58:20Z","Content":"\n\u003Cp\u003EWelcome to the forums SignalCorps!\u003C/p\u003E\u003Cp\u003ESpaceplanes are tricky, at best start with rockets to gain some experience. A plane needs some weight up front, so try to transfer some fuel to front tank, before re-entry.\u003C/p\u003E\u003Cp\u003ETo get your plane in the air, try giving it a slight angle upwards by either adjusting the landing gear height or by rotating the wings. When using a delta wing design, it helps to have some control surfaces up front.\u003C/p\u003E\u003Cp\u003EI hope this helps! Enjoy your stay \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"CPT Mikhailov","CreatedById":134791,"CreatedDateTime":"2015-01-11T03:30:36Z","Content":"\n\u003Cp\u003EDitto what Commander Jebidiah said. Make sure the wheels are just behind the CoM and the CoL is just behind the CoM. Other suggestions: maybe you don\u0027t have enough lift? Pictures would help. Also, there is a lovely aircraft guide located \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/52080-Basic-Aircraft-Design-Explained-Simply-With-Pictures\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E on these forums. Good luck getting your craft to fly!\u003C/p\u003E\n"}]}