{"TopicId":97255,"ForumId":24,"TopicTitle":"...my first question: concerns add-ons and folders","CreatedByName":"lendo","CreatedById":135942,"CreatedDateTime":"2015-01-20T12:06:53Z","PageNum":1,"Articles":[{"CreatedByName":"lendo","CreatedById":135942,"CreatedDateTime":"2015-01-20T12:06:53Z","Content":"\n\u003Cp\u003EGreetings..... I\u0027m a newbienaut. Just getting started. I was investigating add-ons, downloaded \u0022Chatterer\u0022 and followed instructions to put folder in KSP \u0022GameData\u0022 folder. Strangely, I can\u0027t FIND a KSP \u0022GameData\u0022 folder on my HD. Matter of fact, all I find when searching \u0022KSP\u0022 or \u0022Kerbal\u0022 is a 1K program link located in Steam folder under Programs. What am I missing here? Are there folders online somewhere through the Steam account? I just don\u0027t get it.... HELP!!! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Cirocco","CreatedById":100285,"CreatedDateTime":"2015-01-20T12:19:15Z","Content":"\n\u003Cp\u003EGreetings and welcome to the forums! You\u0027ll find we\u0027re generally a helpful bunch, and to prove this, allow me to direct you to the folder you are looking for.\u003C/p\u003E\u003Cp\u003ESince you\u0027re running steam, you need to go to the game folder in the steam folder, found in your \u0022program files\u0022 folder. The program files folder is found in the C drive. Depending on what windows (I\u0027m assuming you\u0027re running windows) you are using, it might be called program files x86 as well.\u003C/p\u003E\u003Cp\u003ESo, the path you want to take is: C \u0026gt; program files (x86) \u0026gt; steam \u0026gt; steamapps \u0026gt; common \u0026gt; kerbal space program \u0026gt; gamedata\u003C/p\u003E\u003Cp\u003EThere you just drop the chatterer folder and presto: mod installed.\u003C/p\u003E\u003Cp\u003Ethe pathway I gave you is from memory (I\u0027m at work now, not on my gaming pc) so there may be one or two steps I forgot, but it should be pretty close. In an case, steam\u0026gt;steamapps\u0026gt;common is where you want to be looking. Hope I was clear enough, if not, just ask.\u003C/p\u003E\u003Cp\u003Emay your exhaust always be hot, your TWR above 1 and your Isp high!\u003C/p\u003E\u003Cp\u003ECirocco\u003C/p\u003E\n"},{"CreatedByName":"Norpo","CreatedById":113342,"CreatedDateTime":"2015-01-20T14:13:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cirocco\u0022 data-cite=\u0022Cirocco\u0022\u003E\u003Cdiv\u003ESo, the path you want to take is: C \u0026gt; program files (x86) \u0026gt; steam \u0026gt; steamapps \u0026gt; common \u0026gt; kerbal space program \u0026gt; gamedata\u003Cp\u003Ethe pathway I gave you is from memory (I\u0027m at work now, not on my gaming pc) so there may be one or two steps I forgot, but it should be pretty close. In an case, steam\u0026gt;steamapps\u0026gt;common is where you want to be looking. Hope I was clear enough, if not, just ask.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E...Dang, that\u0027s good memory, I can confirm that this is the right directory.\u003C/p\u003E\u003Cp\u003EThe reason search didn\u0027t work is, I believe, because program files isn\u0027t \u0022Indexed\u0022, because normal use of PC\u0027s (e.g not installing game mods) generally never needs to use that folder.\u003C/p\u003E\u003Cp\u003Etl;dr search didn\u0027t work because microsoft devs didn\u0027t count on people gaming on them\u003C/p\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2015-01-20T14:15:15Z","Content":"\n\u003Cp\u003EThe pathway is correct for a Steam install. With few exceptions, all mods are designed to be installed by dropping their folder into the GameData folder.\u003C/p\u003E\u003Cp\u003EJust to be on the safe side, it is recommended that you copy the Kerbal Space Program folder from the Steam install to another location and do your mod experiments from there. Steam is not required to run KSP.\u003C/p\u003E\n"},{"CreatedByName":"Cirocco","CreatedById":100285,"CreatedDateTime":"2015-01-20T14:22:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Norpo\u0022 data-cite=\u0022Norpo\u0022\u003E\u003Cdiv\u003E...Dang, that\u0027s good memory, I can confirm that this is the right directory.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ehehe, thank you. I have quite a few steam games and I mod several of them, so that pathway sees a loooooot of use.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SRV Ron\u0022 data-cite=\u0022SRV Ron\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EJust to be on the safe side, it is recommended that you copy the Kerbal Space Program folder from the Steam install to another location and do your mod experiments from there. Steam is not required to run KSP.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETHIS. very much this! When modding games, always copy/paste a clean version of the map you are changing to some other location on your computer. Thank you Ron for mentioning it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}