{"TopicId":146200,"ForumId":81,"TopicTitle":"Console Patches Update Discussion","CreatedByName":"James M","CreatedById":167171,"CreatedDateTime":"2016-08-05T03:13:35Z","PageNum":10,"Articles":[{"CreatedByName":"burnttoaster","CreatedById":169149,"CreatedDateTime":"2016-09-20T22:47:03Z","Content":"\n\u003Cp\u003E\nI bought this game a little while ago for the ps4, I would really enjoy it if the game would let me.  The constant freezing, crashing and corrupted save files I could deal with...If those were the only problems, but the entire control mechanism, just doesnt work.  Using the thumbsticks is so completely awkward.  PS4 has keyboard and mouse support, why doesnt kerbal space program for the PS4 have this?  How difficult could it be to let users have an adequate user interface? \n\u003C/p\u003E\n\u003Cp\u003E\nI have not played this game on the PC, but the method to attach parts seems broken.  Parts do not easily attach together, sometimes it takes great effort to get two pieces that intuitively should just snap right together to come even close to alignment.  i shouldnt have to sit there and rotate a part in every manner of orientation, flipping it at random, moving it back and forth for the program to decide seemingly arbitrarily that its reached proper alignment.\n\u003C/p\u003E\n\u003Cp\u003E\nI almost considered buying the game for the PC, but I decided against it.  The lack of news about an update, The lack of communication with the people who bought the game for the consoles...Its not acceptable.\n\u003C/p\u003E\n\u003Cp\u003E\nYou need to talk to us.\n\u003C/p\u003E\n"},{"CreatedByName":"chimpbone","CreatedById":167310,"CreatedDateTime":"2016-09-20T23:00:25Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222766631\u0022 data-ipsquote-contentid=\u0022146200\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221474407413\u0022 data-ipsquote-userid=\u0022166802\u0022 data-ipsquote-username=\u0022RW1984\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n41 minutes ago, RW1984 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://m.reddit.com/r/KerbalSpaceProgram/comments/3slem9/concerns_about_ksps_console_portingflying_tiger/\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://m.reddit.com/r/KerbalSpaceProgram/comments/3slem9/concerns_about_ksps_console_portingflying_tiger/\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nFYI.  This guy saw it coming.  FTE have a horrible reputation. Proof that squad couldn\u0027t give a damn about the console versions.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWow. I think I have seen that before, but it still sucks to read. He is right. KSP would be a difficult game to port successfully for a competent company, let alone Flying Tiger. I don\u0027t know what Squad saw in Flying Tiger\u0027s history or reputation that would make them think that they would do a good job with their game. I don\u0027t know what they thought they were getting away with actually. It is clear at this point that Squad was trying to maximize profits while putting the real costs onto their customers. For as much criticism as big AAA companies like EA get, at least they have the sense to fire a company like Flying Tiger, and at least they have better customer support.  \n\u003C/p\u003E\n"},{"CreatedByName":"chimpbone","CreatedById":167310,"CreatedDateTime":"2016-09-21T01:03:30Z","Content":"\n\u003Cp\u003E\nWell, it looks like they are submitting an xbox one patch for certification this week. Still working on the playstation patch though. I am interested to see what exactly they are patching besides the save corruption. \n\u003C/p\u003E\n"},{"CreatedByName":"DD_bwest","CreatedById":164906,"CreatedDateTime":"2016-09-21T01:08:13Z","Content":"\n\u003Cp\u003E\nwell there is some good news finally, i hope we get more on the ps4 version soon.\n\u003C/p\u003E\n\u003Cp\u003E\ni hope the broken achievements didnt get forgotten, with everything else being much more of a priority.  lol\n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2016-09-21T01:42:04Z","Content":"\n\u003Cp\u003E\n\u003Csub\u003ESpace programs like to launch stuff early.\u003C/sub\u003E\u003C/p\u003E\n"},{"CreatedByName":"Majorjim!","CreatedById":61954,"CreatedDateTime":"2016-09-21T09:02:33Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222766631\u0022 data-ipsquote-contentid=\u0022146200\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221474407413\u0022 data-ipsquote-userid=\u0022166802\u0022 data-ipsquote-username=\u0022RW1984\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 hours ago, RW1984 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://m.reddit.com/r/KerbalSpaceProgram/comments/3slem9/concerns_about_ksps_console_portingflying_tiger/\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://m.reddit.com/r/KerbalSpaceProgram/comments/3slem9/concerns_about_ksps_console_portingflying_tiger/\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nFYI.  This guy saw it coming.  FTE have a horrible reputation. Proof that squad couldn\u0027t give a damn about the console versions.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nA great many folks on this forum saw it coming too. They all knew using FT was a huge mistake. Oh the humanity.. RIP full price paying console players.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222766912\u0022 data-ipsquote-contentid=\u0022146200\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221474420093\u0022 data-ipsquote-userid=\u0022164906\u0022 data-ipsquote-username=\u0022DD_bwest\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, DD_bwest said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\ni hope we get more on the ps4 version soon.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nlol.. folks where saying that A MONTH ago.\n\u003C/p\u003E\n"},{"CreatedByName":"Yakuzi","CreatedById":85181,"CreatedDateTime":"2016-09-21T11:13:28Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222766879\u0022 data-ipsquote-contentid=\u0022148265\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221474417660\u0022 data-ipsquote-userid=\u002266485\u0022 data-ipsquote-username=\u0022SQUAD\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 hours ago, SQUAD said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nLast but not least, Nestor has some great news about the Xbox One patch! We now have the version that will enter certification this week. This version will fix the save issue Xbox One users have been reporting. We will keep you updated on the status of the certification. On the other hand we are still working on testing the PS4 patch and hopefully we’ll be able to give you an update soon.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nApparently the Xbox One patch should enter certification soon... No progress with the PS4 patch it seems. Also no news when/if 1.2 will be released on consoles. \u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI truly feel for the console players (not one myself), it is completely unacceptable for any company to keep their customers in the dark for so long with a broken product, without apology or compensation. Despite the knowledge of their defective product, \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/66485-squad/\u0026amp;do=hovercard\u0022 data-mentionid=\u002266485\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/66485-squad/\u0022 rel=\u0022\u0022\u003E@SQUAD\u003C/a\u003E shamelessly continues to \u003Ca href=\u0022https://kerbalspaceprogram.com/en/\u0022 rel=\u0022external nofollow\u0022\u003Eadvertise the PS4 and Xbox KSP versions\u003C/a\u003E on the front page of their website. It\u0027s quite appalling.\n\u003C/p\u003E\n\u003Cp\u003E\nPlease keep in mind though that KS\u003Csup\u003Equad\u003C/sup\u003EP, the KSP development team, is not the same as $QUAD, the marketing and advertisement company (check out \u003Ca href=\u0022http://www.squad.com.mx/\u0022 rel=\u0022external nofollow\u0022\u003Etheir amazing website\u003C/a\u003E, under \u0022Agencia\u0022). You can read more on the company structure and the origin of KSP in an interview with Felipe Falange and SQUAD owners/directors Adrian Goya and Ezequiel Ayarza \u003Ca href=\u0022http://www.polygon.com/features/2014/1/27/5338438/kerbal-space-program\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-09-21T11:17:31Z\u0022 title=\u002209/21/2016 11:17  AM\u0022 data-short=\u00227 yr\u0022\u003ESeptember 21, 2016\u003C/time\u003E by Yakuzi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RW1984","CreatedById":166802,"CreatedDateTime":"2016-09-21T12:42:19Z","Content":"\n\u003Cp\u003E\nWhile I\u0027m happy that the XBOX is finally getting a patch soon as a ps4 user im bitterly disappointed. Another disappointment is the level of information we get. The section on the patch in the dev notes was merely an afterthought.  They said they\u0027d fixed the corruption issue. What about the plethora of other bugs? And is there any attempt to improve optimisation? And do we get any future support as in update to version 1.2? @SQUAD please respond.\n\u003C/p\u003E\n"},{"CreatedByName":"Space Station 4 Crash","CreatedById":168282,"CreatedDateTime":"2016-09-21T13:44:12Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222761452\u0022 data-ipsquote-contentid=\u0022146200\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221474121105\u0022 data-ipsquote-userid=\u0022166732\u0022 data-ipsquote-username=\u0022danowat\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 2016-09-17 at 10:05 AM, danowat said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI get that, but answer this.\n\u003C/p\u003E\n\u003Cp\u003E\nWhy were these bugs not found in testing?, were they and they just shipped it anyway?, or was the product just not tested?, there are UI issues that present themselves within a few hours of play, so it\u0027s not like it would have taken extensive testing.\n\u003C/p\u003E\n\u003Cp\u003E\nConsoles now have the option of having games in early access, if FTE wanted some extended testing, and get some money, then they should have gone down that route, rather than just throwing this mess into the wild.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHey man!\n\u003C/p\u003E\n\u003Cp\u003E\nIt seems like we are now on to a different point. I was just stating that they care. They need this to work and that this debacle is not a personal thing or hate against you.\n\u003C/p\u003E\n\u003Cp\u003E\nPS4 doesn\u0027t have an early access program. It was announced and launched first on PS4. The problems the two consoles are having are not the same, they are both experiencing different issues. Both game crippling.\n\u003C/p\u003E\n\u003Cp\u003E\nHindsight sucks for SQUAD and FTE, looking now we can point and criticize. As you say, \u0022Why were these bugs not found in testing?\u0022. You should voice your opinion and criticize, I think it improves quality assurance if the customer lets a company know that they need to take more care. But again the reality is it did get through, the \u0022how\u0022 doesn\u0027t matter anymore, they didn\u0027t find the bugs and now we are over 2 months with no patch because they can\u0027t fix it promptly. They need this to work. As they said in a post, \u0022we simply have to fix it, there is no other option\u0022. I\u0027m now more interested in the \u0022when\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\n.... And to directly answer your question, I have no idea why these bugs were not found?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-09-21T15:17:40Z\u0022 title=\u002209/21/2016 03:17  PM\u0022 data-short=\u00227 yr\u0022\u003ESeptember 21, 2016\u003C/time\u003E by Space Station 4 Crash\u003C/strong\u003E\n\u003Cbr\u003EOne more thing.\n\u003C/span\u003E\n"},{"CreatedByName":"HebaruSan","CreatedById":156657,"CreatedDateTime":"2016-09-21T15:08:37Z","Content":"\n\u003Cp\u003E\nAnother PC user here to express sympathy with console players. I can\u0027t imagine how frustrating it must be to lose saves and have that prospect looming over you at all times while running the game. Console players deserve a fully working product for their full price payment. As others have said, PC releases have also shipped with severe bugs, though not as severe as what apparently afflicts consoles at the moment, so we both know and don\u0027t quite know what it\u0027s like. But the core game is so unique and amazing when it does work that we\u0027re all in this weird love/hate relationship, wanting the game to get out of its own way so we can enjoy it properly. It\u0027s like if you could buy the Hope Diamond for $40, but it occasionally and unpredictably emits the worst odor you\u0027ve ever smelled and paralyzes you so you can\u0027t run away.\n\u003C/p\u003E\n\u003Cp\u003E\nAs for how it got to this point, I speculate (based on no evidence, to be clear) that SQUAD simply trusted Flying Tiger too much. FT was hired to do a job, and SQUAD\u0027s technical staff was focused on features and fixes for the core game (which is sometimes treated as \u0022the PC release\u0022 but in reality will eventually reach all platforms), so when it came down to it they probably erred on the side of taking FT\u0027s word for it that the port was working. No one wants to think that their business partner is deceptive or incompetent. I\u0027m not saying SQUAD did \u003Cem\u003Eno\u003C/em\u003E console QA the last time around, but there\u0027s always a balance between spending more time testing versus getting the product to market, and when those trade-offs come up, it\u0027s easy to shrug and say, \u0022It probably works, it\u0027s mostly the same code as on PC.\u0022 It may well be that their test plan did not include \u0022play for two hours with at least one high part count craft and then save and load the game.\u0022 Then they paid for that at release by finding themselves in the untenable situation of being responsible for a defective product with no simple fixes in sight. My guess is SQUAD will need to fire FTE and take ownership of the console ports in-house for this to get this resolved as it should be.\n\u003C/p\u003E\n\u003Cp\u003E\nIt does seem that as a team, SQUAD lack in their ability to recognize and cope with truly severe problems in general. Sometimes you have to raise a red flag and say, \u0022This is simply too bad to be acceptable; we need to make a big announcement / we can\u0027t release it like this / we have to issue refunds / this shouldn\u0027t be on the store in this state / etc.\u0022 That\u0027s one commonality I see between the 1.1 release and this console debacle. SQUAD seems to prefer the \u0022keep quiet and muddle through somehow\u0022 approach.\n\u003C/p\u003E\n\u003Cp\u003E\nTo sum up, this is about how it breaks down in my book:\n\u003C/p\u003E\n\u003Ctable align=\u0022left\u0022 border=\u00221\u0022 cellpadding=\u00221\u0022 cellspacing=\u00221\u0022\u003E\u003Cthead\u003E\u003Ctr\u003E\u003Cth scope=\u0022col\u0022 style=\u0022text-align:left;\u0022\u003E\nProblem\n\u003C/th\u003E\n\u003Cth scope=\u0022col\u0022 style=\u0022text-align:left;\u0022\u003E\nResponsible party\n\u003C/th\u003E\n\u003C/tr\u003E\u003C/thead\u003E\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd\u003E\nTechnical errors in ports\n\u003C/td\u003E\n\u003Ctd\u003E\nFTE\n\u003C/td\u003E\n\u003C/tr\u003E\u003Ctr\u003E\u003Ctd\u003E\nChoice of company to handle ports\n\u003C/td\u003E\n\u003Ctd\u003E\nSQUAD\n\u003C/td\u003E\n\u003C/tr\u003E\u003Ctr\u003E\u003Ctd\u003E\nFailure to fully QA console ports before release\n\u003C/td\u003E\n\u003Ctd\u003E\nSQUAD\n\u003C/td\u003E\n\u003C/tr\u003E\u003Ctr\u003E\u003Ctd\u003E\n20\u002B failures to fix the problems after release\n\u003C/td\u003E\n\u003Ctd\u003E\nFTE\n\u003C/td\u003E\n\u003C/tr\u003E\u003Ctr\u003E\u003Ctd\u003E\nFailure to issue blanket refunds or otherwise do adequate customer relations  \n\u003C/td\u003E\n\u003Ctd\u003E\nSQUAD\n\u003C/td\u003E\n\u003C/tr\u003E\u003Ctr\u003E\u003Ctd\u003E\nUltimate responsibility\n\u003C/td\u003E\n\u003Ctd\u003E\nSQUAD\n\u003C/td\u003E\n\u003C/tr\u003E\u003C/tbody\u003E\u003C/table\u003E\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI would further note that none of SQUAD\u0027s identifiable faults can be laid at the feet of the actual development team, the ones writing the code from day to day, who seem to be pretty excellent at the moment based on the state of the 1.2 pre-release. So if they can somehow get the problems with the ports ironed out, we can hope that everyone will have the same really great release someday. But that\u0027s a big \u0027if\u0027.\n\u003C/p\u003E\n"},{"CreatedByName":"DD_bwest","CreatedById":164906,"CreatedDateTime":"2016-09-21T16:19:49Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222767281\u0022 data-ipsquote-contentid=\u0022146200\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221474448553\u0022 data-ipsquote-userid=\u002261954\u0022 data-ipsquote-username=\u0022Majorjim!\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, Majorjim! said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nA great many folks on this forum saw it coming too. They all knew using FT was a huge mistake. Oh the humanity.. RIP full price paying console players.\n\u003C/p\u003E\n\u003Cp\u003E\nlol.. folks where saying that A MONTH ago.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nlol i know.. but if the xbox version is going for cert, the ps4 cant be to far behind.. one would hope lol\n\u003C/p\u003E\n\u003Cp\u003E\nthey shoulda waited and ported 1.2 lol  much more stable\n\u003C/p\u003E\n"},{"CreatedByName":"RW1984","CreatedById":166802,"CreatedDateTime":"2016-09-21T16:22:02Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222767742\u0022 data-ipsquote-contentid=\u0022146200\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221474474789\u0022 data-ipsquote-userid=\u0022164906\u0022 data-ipsquote-username=\u0022DD_bwest\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nJust now, DD_bwest said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nlol i know.. but if the xbox version is going for cert, the ps4 cant be to far behind.. one would hope lol\n\u003C/p\u003E\n\u003Cp\u003E\nthey shoulda waited and ported 1.2 lol  much more stable\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nFrom the small amount of info that they\u0027ve given their customers whom theyve ripped off the ps4 is giving them much more problems\n\u003C/p\u003E\n"},{"CreatedByName":"DD_bwest","CreatedById":164906,"CreatedDateTime":"2016-09-21T16:31:13Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222767747\u0022 data-ipsquote-contentid=\u0022146200\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221474474922\u0022 data-ipsquote-userid=\u0022166802\u0022 data-ipsquote-username=\u0022RW1984\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 minute ago, RW1984 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nFrom the small amount of info that they\u0027ve given their customers whom theyve ripped off the ps4 is giving them much more problems\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nyes, but also if the xbox patch is \u0022done\u0022 and sent off for cert,  everyone who was working on it can switch to the ps4 build.  the best we can do is hope\n\u003C/p\u003E\n\u003Cp\u003E\nand they better fix that dam trophy ... lol\n\u003C/p\u003E\n"},{"CreatedByName":"chimpbone","CreatedById":167310,"CreatedDateTime":"2016-09-21T17:14:11Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222767439\u0022 data-ipsquote-contentid=\u0022146200\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221474461739\u0022 data-ipsquote-userid=\u0022166802\u0022 data-ipsquote-username=\u0022RW1984\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, RW1984 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhile I\u0027m happy that the XBOX is finally getting a patch soon as a ps4 user im bitterly disappointed. Another disappointment is the level of information we get. The section on the patch in the dev notes was merely an afterthought.  They said they\u0027d fixed the corruption issue. What about the plethora of other bugs? And is there any attempt to improve optimisation? And do we get any future support as in update to version 1.2? @SQUAD please respond.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI am guessing that they only fixed the save corruption issue. Pretty lame, but at this point, expected. I think I am kind of over this game at this point. I am very unimpressed and underwhelmed. Too little too late. I can see that there is potential in the game, but I am not willing to go through the pains of an early access game when I paid full price. 1.2 is probably going to come out on console sometime next year. I seriously loathe this game. I wish Squad would have just given me my money back. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-09-21T17:15:46Z\u0022 title=\u002209/21/2016 05:15  PM\u0022 data-short=\u00227 yr\u0022\u003ESeptember 21, 2016\u003C/time\u003E by chimpbone\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RW1984","CreatedById":166802,"CreatedDateTime":"2016-09-21T17:27:45Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222767843\u0022 data-ipsquote-contentid=\u0022146200\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221474478051\u0022 data-ipsquote-userid=\u0022167310\u0022 data-ipsquote-username=\u0022chimpbone\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 minutes ago, chimpbone said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI am guessing that they only fixed the save corruption issue. Pretty lame, but at this point, expected. I think I am kind of over this game at this point. I am very unimpressed and underwhelmed. I can see that there is potential in the game, but I am not willing to go through the pains of an early access game when I paid full price. 1.2 is probably going to come out on console sometime next year. I seriously loathe this game. I wish Squad would have just given me my money back. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAgreed, I haven\u0027t played in ages because what\u0027s the point. I\u0027ve asked in this thread and in this week\u0027s dev note thread for more info and an apology, the only response from squad was a snide remark about how even pacman wasn\u0027t bug free. This from a company who should be asking our forgiveness for this disaster. I\u0027m shocked at their indifference and arrogance towards the console community\n\u003C/p\u003E\n"},{"CreatedByName":"Majorjim!","CreatedById":61954,"CreatedDateTime":"2016-09-21T17:41:32Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222767742\u0022 data-ipsquote-contentid=\u0022146200\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221474474789\u0022 data-ipsquote-userid=\u0022164906\u0022 data-ipsquote-username=\u0022DD_bwest\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n16 hours ago, DD_bwest said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nlol i know.. but if the xbox version is going for cert, the ps4 cant be to far behind.. one would hope lol\n\u003C/p\u003E\n\u003Cp\u003E\nthey shoulda waited and ported 1.2 lol  much more stable\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAgreed. Making folks pay full price for a totally broken version and then having them wait two months to play the game they payed for is unacceptable. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-09-22T09:29:01Z\u0022 title=\u002209/22/2016 09:29  AM\u0022 data-short=\u00227 yr\u0022\u003ESeptember 22, 2016\u003C/time\u003E by Majorjim!\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"chimpbone","CreatedById":167310,"CreatedDateTime":"2016-09-21T18:11:44Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222767855\u0022 data-ipsquote-contentid=\u0022146200\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221474478865\u0022 data-ipsquote-userid=\u0022166802\u0022 data-ipsquote-username=\u0022RW1984\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n29 minutes ago, RW1984 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAgreed, I haven\u0027t played in ages because what\u0027s the point. I\u0027ve asked in this thread and in this week\u0027s dev note thread for more info and an apology, the only response from squad was a snide remark about how even pacman wasn\u0027t bug free. This from a company who should be asking our forgiveness for this disaster. I\u0027m shocked at their indifference and arrogance towards the console community\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nJust read that pacman nonsense in the dev notes thread. That sucks man. They are the ones who said that they weren\u0027t going to release it until it was \u0022perfect.\u0022 Now they are saying that a perfect game is impossible. What a mess. Also, I don\u0027t think they are even sorry, so why would they apologize? Apologizing would be admitting that they did something wrong, and they aren\u0027t going to do that. They are just going to point the finger at FT, and tell us to be patient and wait. If anything, they are going to blame us for buying the game. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2016-09-21T20:20:58Z","Content":"\n\u003Cp\u003E\nI bet they fix it by dropping the max part count to 100...   They are hiring staff to work on the PC build with their console profits.  As a Sony gamer I am now fully mortified.  Does anyone know how to delete KSP forum profile?\n\u003C/p\u003E\n"},{"CreatedByName":"AndyChilly","CreatedById":167367,"CreatedDateTime":"2016-09-22T13:40:46Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222768113\u0022 data-ipsquote-contentid=\u0022146200\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221474489258\u0022 data-ipsquote-userid=\u0022168314\u0022 data-ipsquote-username=\u0022DOCTOR DEMENTAL\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n17 hours ago, DOCTOR DEMENTAL said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI bet they fix it by dropping the max part count to 100...   \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nUgh, I really, really, REALLY hope you are wrong about that. I have been patient and I haven\u0027t ripped into them too much because well, excrements happens and we all move on with or lives in the end. but if they have \u0022fixed\u0022 the problem but just dropping the max part count and essentially creating a KSP Jr game. I will move on and forget about this game. the thing that has made me patient is that I figured I would eventually be able to make the big stuff and for now just play with the small stuff.\n\u003C/p\u003E\n"},{"CreatedByName":"Homedawgian","CreatedById":166608,"CreatedDateTime":"2016-09-22T14:19:55Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222769011\u0022 data-ipsquote-contentid=\u0022146200\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221474551646\u0022 data-ipsquote-userid=\u0022167367\u0022 data-ipsquote-username=\u0022AndyChilly\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n35 minutes ago, AndyChilly said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nUgh, I really, really, REALLY hope you are wrong about that. I have been patient and I haven\u0027t ripped into them too much because well, excrements happens and we all move on with or lives in the end. but if they have \u0022fixed\u0022 the problem but just dropping the max part count and essentially creating a KSP Jr game. I will move on and forget about this game. the thing that has made me patient is that I figured I would eventually be able to make the big stuff and for now just play with the small stuff.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah that would suck but, I\u0027d say there\u0027s little to no chance that that would happen. Plus, that wouldn\u0027t fix anything, it would just delay the save files from crashing by 66%.\n\u003C/p\u003E\n"},{"CreatedByName":"Invaderdave","CreatedById":167495,"CreatedDateTime":"2016-09-23T02:23:10Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222709879\u0022 data-ipsquote-contentid=\u0022146200\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221470687617\u0022 data-ipsquote-userid=\u0022167541\u0022 data-ipsquote-username=\u0022Saidg23\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 8/8/2016 at 3:20 PM, Saidg23 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nJust back your save up into the cloud or a USB stick. There isn\u0027t much you can do about it others than backing up your save every so often. It\u0027s what I\u0027ve been doing and only lost my save once because I accidentally overrode the backup with the corrupted data.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI have had very limited success with this method. I have an instance of my game saved in the cloud and on USB. (The USB save is a later version of the cloud version) The USB save file, without fail, gives the corruption error message at the load screen and I can play for hours sometimes with the cloud save, but the first time I try to back up the file (which require that you close the game, copy, and then restart) it corrupts.\n\u003C/p\u003E\n\u003Cp\u003E\nIt just feels like way too much time to have to spend saving my awesomely powerful yet elegant rocket designs from consistent, imminent doom. It\u0027s too heart-breaking! I love this game but honestly, attempting to work around this bug is making me hate it. So before that happens I\u0027m just going to have to put it down until the update. \n\u003C/p\u003E\n"},{"CreatedByName":"Invaderdave","CreatedById":167495,"CreatedDateTime":"2016-09-23T02:48:43Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222716110\u0022 data-ipsquote-contentid=\u0022146200\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221471131382\u0022 data-ipsquote-userid=\u0022167064\u0022 data-ipsquote-username=\u0022GriffKiller\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 8/13/2016 at 6:36 PM, GriffKiller said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWith the control thang i wasnt talking about you just some of the people on the forum my b i should have made that clear. Im just happy to have ksb weather it\u0027s a little broken or not.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd as long as the save file problem is whats stoping you you can still play you just can\u0027t leave any trace of our progress(ship wise) witch does really suck\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nA game that you can play but can\u0027t save and have to start over from the very beginning 100% of the time is not a full-priced game, it\u0027s a demo. \n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2016-09-23T14:55:50Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/167495-invaderdave/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022167495\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/167495-invaderdave/\u0022 rel=\u0022\u0022\u003E@Invaderdave\u003C/a\u003E yes indeed.  If that demo ever currupts your game data it\u0027s a beta demo.\n\u003C/p\u003E\n"},{"CreatedByName":"TheMightyDerp","CreatedById":168703,"CreatedDateTime":"2016-09-24T19:28:38Z","Content":"\n\u003Cp\u003E\nI emailed the devs about at least letting the console owners know the status of these updates. That was about 2 weeks ago and they haven\u0027t even bothered. It doesn\u0027t seem like this game is getting fixed anytime soon.\n\u003C/p\u003E\n"},{"CreatedByName":"Deadmanrunning","CreatedById":169231,"CreatedDateTime":"2016-09-24T23:12:49Z","Content":"\n\u003Cp\u003E\nOne of the Dev notes this week said xbone patch is going to get certified... sure hope the Quality is Assured on that patch.\n\u003C/p\u003E\n"}]}