{"TopicId":171744,"ForumId":81,"TopicTitle":"Kerbal dissapeared after recovering vessel while in EVA","CreatedByName":"Arch3rAc3","CreatedById":128094,"CreatedDateTime":"2018-03-06T18:00:45Z","PageNum":1,"Articles":[{"CreatedByName":"Arch3rAc3","CreatedById":128094,"CreatedDateTime":"2018-03-06T18:00:46Z","Content":"\n\u003Cp\u003E\nHello.\n\u003C/p\u003E\n\u003Cp\u003E\nI just encountered a serious bug.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve made a small craft for the observation missions and, so that I won\u0027t waste too much money, decided to place some parachutes on it\u0027s first stage.\u003Cbr\u003E\nAfter landing, I took Jeb out for EVA so I could get some science on Kerbin surface and while he was on the crew cabin ladder, I switched craft so I could check if the first stage was landing ok. After it did, I tried switching back but it said there were no crafts close enough, so I recovered the main stage and selected the crew cabin through the tracking station. After getting back on the craft, for my surprise, I noticed Jeb was nowhere to be found! So I recovered the craft itself and there was also no crew in the after-recovery screen, only parts and science.\u003Cbr\u003E\nJeb is also not in the Astronaut Building and my reputation went negative, leading me to believe he\u0027s now dead. I\u0027m playing the career with some of the hardest settings on, forcing no quicksave/load and no crew respawn, but everything was going well so far. Losing a Kerbal in this stage of the career with these settings is game breaking.\n\u003C/p\u003E\n\u003Cp\u003E\nI also tried using the debug console (which should be used to fix something like this without forcing me to restart my whole career) but then it says the achievements will be disabled Why should I even have a debug tool then?\n\u003C/p\u003E\n\u003Cp\u003E\nI can see this problem may impact even more the game later on if I happen to have any Kerbals performing EVA while switching back to Kerbin or another craft. If I\u0027m not mistaken, this bug (or a similar bug) has already been fixed on the PC, no?\n\u003C/p\u003E\n\u003Cp\u003E\nUpdate: I just checked the astronaut building again, and it says Jeb was K.I.A. Wish it would tell me what killed him though, that would provide more info on the bug (maybe he\u0027s been teleported and smashed, stretched or something else). \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-03-06T18:04:26Z\u0022 title=\u002203/06/2018 06:04  PM\u0022 data-short=\u00226 yr\u0022\u003EMarch 6, 2018\u003C/time\u003E by Arch3rAc3\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"PrvDancer85","CreatedById":180954,"CreatedDateTime":"2018-03-08T09:06:26Z","Content":"\n\u003Cp\u003E\nSometimes the game thinks that the kerbal on a ladder of an Ship Save on the ground is in Atmospheric Flight. If that was the Case, he could be despawned After u switched vessels and gone to Tracking Station.\n\u003C/p\u003E\n\u003Cp\u003E\nThat is just an Assumption\n\u003C/p\u003E\n"}]}