{"TopicId":173629,"ForumId":81,"TopicTitle":"Losing control xbox enhanced","CreatedByName":"Nemisis Wolf","CreatedById":187031,"CreatedDateTime":"2018-04-08T08:15:04Z","PageNum":1,"Articles":[{"CreatedByName":"Nemisis Wolf","CreatedById":187031,"CreatedDateTime":"2018-04-08T08:15:05Z","Content":"\n\u003Cp\u003E\nHi guys and can I say a big thanks for the enhanced version and the update which finally makes the game playable on xbox. BUT and it is a big BUT. Since restarting after the patch I have managed to unlock a large portion of the tech tree in career mode just From Kerbin and one trip to the Mun and one to Minmus and have done this despite every single ship I build loses control in one direction or another usually within 5 minutes of launch or 5 minutes of taking control of a craft after starting play for the day.\n\u003C/p\u003E\n\u003Cp\u003E\nTo be more specific. One direction of control will not respond. Its not always the same direction either. So it Will not pull up but will move in all other directions and will always be able to rotate luckily or I\u0027d get no where. Or it won\u0027t turn right or down or left. But it only does this in one direction and it does it every yes every time i play. \n\u003C/p\u003E\n\u003Cp\u003E\nSo my skill at landing a space ship which can only be controlled in 3 directions is exemplary in my opinion. And requires some very well planned rotating moves. But if I\u0027m ever going to get more complex mission and craft I\u0027m going to need control in 4 directions and rotation. Not 3 any and all help appreciated. By the way this control problem also happens whilst in docking mode and under \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E control but not while controlling a Kerbal with a jet pack. Only on space ships. \n\u003C/p\u003E\n\u003Cp\u003E\nThanks for any help in advance happy Launching.\n\u003C/p\u003E\n"},{"CreatedByName":"GrouchyDevotee","CreatedById":175115,"CreatedDateTime":"2018-04-10T01:57:46Z","Content":"\n\u003Cp\u003E\nYou probably have the trim set. It is very easy to turn the trim on in the console versions.\n\u003C/p\u003E\n\u003Cp\u003E\nLook and see if there are pink markers in the manoeuvre inputs. That is the trim.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m playing on a PS4, it\u0027s left bumper and click left stick to turn it off, I don\u0027t know about X-Box.\n\u003C/p\u003E\n\u003Cp\u003E\nCheers.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-04-10T01:59:37Z\u0022 title=\u002204/10/2018 01:59  AM\u0022 data-short=\u00226 yr\u0022\u003EApril 10, 2018\u003C/time\u003E by GrouchyDevotee\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nemisis Wolf","CreatedById":187031,"CreatedDateTime":"2018-04-12T15:04:15Z","Content":"\n\u003Cp\u003E\n@ GrouchyDevotee.\n\u003C/p\u003E\n\u003Cp\u003E\nThank you Thank you Thank you. You got it in one thats exactly whats been happening. And even now I know whats happening now I still frequently switch it on but at least I can sort it out with a quick press of leftbumper and left stick to clear it.  Simplist things are often the one that s#$×w you up the most I find. Now onto bigger and better ships. I have got most of the tech tree unlocked now only 7 more to go. And I think its time I left Kerbins sphere of influence and have a look at Duna.\n\u003C/p\u003E\n\u003Cp\u003E\nOnce again thanks GrouchyDevotee you made this so much more enjoyable now.\n\u003C/p\u003E\n"},{"CreatedByName":"GrouchyDevotee","CreatedById":175115,"CreatedDateTime":"2018-05-02T07:29:23Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223352539\u0022 data-ipsquote-contentid=\u0022173629\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221523545455\u0022 data-ipsquote-userid=\u0022187031\u0022 data-ipsquote-username=\u0022Nemisis Wolf\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 4/12/2018 at 9:04 AM, Nemisis Wolf said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n thanks\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou\u0027re welcome.\n\u003C/p\u003E\n\u003Cp\u003E\nCheers!\n\u003C/p\u003E\n"}]}