{"TopicId":194518,"ForumId":81,"TopicTitle":"Haul RT-5 Flea not completing","CreatedByName":"Undertaker905","CreatedById":205208,"CreatedDateTime":"2020-06-07T00:38:56Z","PageNum":1,"Articles":[{"CreatedByName":"Undertaker905","CreatedById":205208,"CreatedDateTime":"2020-06-07T00:38:56Z","Content":"\n\u003Cp\u003E\nI\u0027m playing career mode on the XB1. I\u0027m on the mission to haul the RT-5:Flea to an altitude of 34k - 41k above Kerbin with a speed between 360-530m/s. I\u0027ve gotten all requirements to be checked off with the exception of \u0022Have RT-5 Solid Fuel Booster.....uhm....yes, I do... it\u0027s attached to my command pod. I reach the correct height and speed without even activating the Flea. My setup is as follows: Command pod with parachute on the nose / Flea / TD-12 Coupler / FL-T200 Fuel Tank / LV-T30 \u0022Reliant\u0022 Liquid Fuel Engine ... I launch, use up and detach the Reliant, just leaving the Flea. I coast up to the required altitude and get within the speed requirements without firing up the Flea. All check marks lit, yet it STILL says I don\u0027t have the Flea. I\u0027ve tried this mission a few good times, both with firing up the Flea within the requirements, and just leaving it idle. Still refuses to acknowledge the fact that I DO have the Flea. How can I get the game to accept the fact that I have it?\n\u003C/p\u003E\n"},{"CreatedByName":"Cavscout74","CreatedById":181783,"CreatedDateTime":"2020-06-07T18:03:51Z","Content":"\n\u003Cp\u003E\nThere have also been issues in the past - and I\u0027m not certain exactly where the console version lines up with the PC version - where deprecated parts are still getting picked for contracts on the PC version.  The PC version happens to have a new Flea \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E, but to prevent breaking old saves, the original Flea is still in a folder of other deprecated parts and gets loaded in the game, just not displayed.  If the game selected the deprecated Flea for the contract instead of the new one, that is why it won\u0027t check the box - you actually don\u0027t have the Flea its looking for.  You can (at least on PC) use the search box in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E/\u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E to pull up recently deprecated parts.  \n\u003C/p\u003E\n\u003Cp\u003E\nAlso, the contracts can be flaky sometimes and just don\u0027t want to complete correctly.  Only fix for that is to delete the contract and try something else or (for the PC version, not sure how the console version works) use the cheat window to complete the contract.\n\u003C/p\u003E\n"},{"CreatedByName":"Undertaker905","CreatedById":205208,"CreatedDateTime":"2020-06-09T00:32:34Z","Content":"\n\u003Cp\u003E\nThank you for your reply. I\u0027m trying not to use the cheats yet until things get too complicated for my simple mind. I may cancel the contract. For now I\u0027ll just enjoy the views of orbiting Kerbin.\n\u003C/p\u003E\n"},{"CreatedByName":"Demordrah","CreatedById":198685,"CreatedDateTime":"2020-06-11T00:38:56Z","Content":"\n\u003Cp\u003E\nIf you\u0027re in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E, pressing X on xbox,  or square on PS4 while your cursor is not enabled (alternatively clicking the icon in the very top left of the interface) will toggle the advanced mode for the parts tree.  All of the legacy parts can still be found here, and used on your crafts.  As stated above, the contracts will sometimes reference the older version of the part in question.  The old Flea has the gold and black bands on it.\n\u003C/p\u003E\n"},{"CreatedByName":"Mechster","CreatedById":205708,"CreatedDateTime":"2020-06-24T22:08:56Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223800790\u0022 data-ipsquote-contentid=\u0022194518\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221591835936\u0022 data-ipsquote-userid=\u0022198685\u0022 data-ipsquote-username=\u0022Demordrah\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 6/10/2020 at 9:38 PM, Demordrah said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIf you\u0027re in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E, pressing X on xbox,  or square on PS4 while your cursor is not enabled (alternatively clicking the icon in the very top left of the interface) will toggle the advanced mode for the parts tree.  All of the legacy parts can still be found here, and used on your crafts.  As stated above, the contracts will sometimes reference the older version of the part in question.  The old Flea has the gold and black bands on it.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis fixes it... To add a bit of clarification: Hit X in vehicle assembly bay\u0026gt;Sort by tech level\u0026gt;Level 1\u0026gt;Select old flea with tiny icon\u0026gt;attach in place of current flea\n\u003C/p\u003E\n"}]}