{"TopicId":205143,"ForumId":81,"TopicTitle":"Ps4 Portuguese Translation","CreatedByName":"Pablo Marques","CreatedById":216589,"CreatedDateTime":"2021-10-05T10:53:01Z","PageNum":1,"Articles":[{"CreatedByName":"Pablo Marques","CreatedById":216589,"CreatedDateTime":"2021-10-05T10:53:01Z","Content":"\n\u003Cp\u003E\nOlá pessoal, gostaria de saber de quem tem o KSP para PS4 se tem suporte para idioma português, tô querendo comprar porque esta em promoção na ps store mas se não tiver Pt-Br vou repensar se vou comprar ou não, obrigado a todos \n\u003C/p\u003E\n\u003Cp\u003E\n[Moderator added translation]\u003Cbr\u003E\nHello everyone, I would like to know who has KSP for PS4 if it has support for Portuguese language, I\u0027m looking to buy it because it\u0027s on sale at ps store but if you don\u0027t have Pt-Br I\u0027ll rethink if I\u0027m going to buy or not, thank you all \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-10-05T11:06:21Z\u0022 title=\u002210/05/2021 11:06  AM\u0022 data-short=\u00222 yr\u0022\u003EOctober 5, 2021\u003C/time\u003E by James Kerman\u003C/strong\u003E\n\u003Cbr\u003EAdded Translation\n\u003C/span\u003E\n"},{"CreatedByName":"James Kerman","CreatedById":160462,"CreatedDateTime":"2021-10-05T11:11:39Z","Content":"\n\u003Cp\u003E\nWelcome to the forum \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/216589-pablo-marques/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022216589\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/216589-pablo-marques/\u0022 rel=\u0022\u0022\u003E@Pablo Marques\u003C/a\u003E, an English translation has been added to your post and title because we have a rule that all posts, outside of the international section require an English translation. This is because not all browsers and devices support automatic translation. We encourage you to use a service like google translate if you are posting in the general forum.\n\u003C/p\u003E\n\u003Cp\u003E\n[Google Translation]\u003Cbr\u003E\nBem-vindo ao fórum @Pablo Marques, uma tradução para o inglês foi adicionada à sua postagem e título porque temos uma regra que todas as postagens, fora da seção internacional, exigem uma tradução para o inglês. Isso ocorre porque nem todos os navegadores e dispositivos oferecem suporte à tradução automática. Nós encorajamos você a usar um serviço como o google tradutor se você estiver postando no fórum geral.\n\u003C/p\u003E\n"}]}