{"TopicId":100020,"ForumId":18,"TopicTitle":"Another philosophical thought experiment.","CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-02-18T17:56:39Z","PageNum":1,"Articles":[{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-02-18T17:56:39Z","Content":"After seeing [these](https://forum.kerbalspaceprogram.com/threads/110916-Massive-psychological-experiment-in-the-KSP-forums) [two](https://forum.kerbalspaceprogram.com/threads/110937-Another-psychology-experiment) thoughts experiments, I feel compelled to introduce another of my own that I conceived of during my days studying philosophical debate, and I had used it in one of my debate to prove a point. I hope people here are not too annoyed with the onslaught of dilemmas.![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nSo here is the situation, some suspension of disbelief is required:\n\nYou are kidnapped and forced by a crazy wizard to choose between saving the life of one person or five other people. You don\u0027t know any one of them. He will personally kill the ones you don\u0027t choose. If you do not choose he will simply kill you and get someone else.\n\nWhat is your choice? Remember it.\n\n\u003E \n\u003E Then the wizard use his magic powers to show you two future scenarios. The futures he shows are magically true and immutable in any way, except for the choice you are about to make. \n\u003E \n\u003E The first scenario shows what happen if you save the one person: That one person turns out to be a doctor of great genius, who will in the course of their remaining life contributes to many medical advancement, curing various form of disease and enhancing the life of humanity.\n\u003E \n\u003E The second scenario shows what happens if you save the five people: The band of five people turns out to be a group of extremists who will form an evil organization terrorizing the world, slaughtering countless victims, causing mayhem and wreaking havoc on humanity.\n\u003E \n\u003E Do you want to change your choice?\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E \u003E \n\u003E \u003E The wizard once again shows you two scenarios in the future, but much further in time this round.\n\u003E \u003E \n\u003E \u003E The first future shows what happens if the doctor lives: The doctor contribution to medical science was great. Far too great. In fact, it managed to result in an explosion of human population due to increased lifespan. The environment, which is already unstable, crumble under the increased population, and Earth slowly die. Governments of the worlds began to conflict over what little resources is left, oppressive autocratic policies began to replace democratic voices, and those who oppose the regimes are crushed with impunity. Finally, humanity committed suicide with an all out war where nothing is left behind but a desolate, empty planet.\n\u003E \u003E \n\u003E \u003E The second future shows what happens if the band of terrorists live: While their era of terror was horrific, it was short lived. The governments of the world unite as one to fight against such evil, and together, they managed to get rid of them after a few years of war. Many people die, but that helps reduce the human population to a more sustainable level. The result of the horrific war also scars the hearts of many people, and they vow to keep such a tragedy from happening ever again. A great number of influential people began to create reform all around the world, bringing true free education to all humanity for the first time, eliminating poverty through social effort, shifting focus away from petty conflict and toward science and the advancement of the human\u0027s mind. Humanity began a new age of hope.\n\u003E \u003E \n\u003E \u003E What is your choice, *now?*\n\u003E \u003E \n\u003E \u003E \n\u003E \n\nPlease only answer the poll after you read all of the post, including the parts inside the spoiler. I hope you enjoy being a butterfly.\n\n**Edited \u003Ctime datetime=\u00222015-02-19T05:16:39Z\u0022 title=\u002202/19/2015 05:16  AM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 19, 2015\u003C/time\u003E by RainDreamer**"},{"CreatedByName":"EdFred","CreatedById":108599,"CreatedDateTime":"2015-02-18T18:03:23Z","Content":"I made my choice, the first option, and stuck with it."},{"CreatedByName":"ZedNova","CreatedById":57175,"CreatedDateTime":"2015-02-18T18:03:44Z","Content":"Empowered, because these are hypothetical choices and don\u0027t make me feel, the people in danger are numbers."},{"CreatedByName":"briansun1","CreatedById":67451,"CreatedDateTime":"2015-02-18T18:06:08Z","Content":"Went with depends on who the people were, 1, then 2. The good of the many out way the need of a few. Also went with powerless since I have no power over my morals or ethics."},{"CreatedByName":"Sean Mirrsen","CreatedById":3873,"CreatedDateTime":"2015-02-18T18:20:39Z","Content":"I\u0027ll vote once there is an \u0022indifferent\u0022 option. ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-02-18T18:31:45Z","Content":"\u003E \n\u003E I\u0027ll vote once there is an \u0022indifferent\u0022 option. ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)\n\nI would do that if I can figure out how to edit current poll. XD (also to change some wording. it is kind of spoiler-ish)\n\nLet just go with, between the two options, which of those feelings do you find most similar with your mental state after the final choice , if you have to choose?\n\n**Edited \u003Ctime datetime=\u00222015-02-18T18:51:15Z\u0022 title=\u002202/18/2015 06:51  PM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 18, 2015\u003C/time\u003E by RainDreamer**"},{"CreatedByName":"gmpd2000","CreatedById":37101,"CreatedDateTime":"2015-02-18T18:48:23Z","Content":"Since when my thread became so popular?\n\nAlso, voted \u0022powerless\u0022."},{"CreatedByName":"Sean Mirrsen","CreatedById":3873,"CreatedDateTime":"2015-02-18T19:02:58Z","Content":"\u003E \n\u003E I would do that if I can figure out how to edit current poll. XD\n\u003E Let just go with, between the two options, which of those feelings do you find most similar with your mental state after the final choice , if you have to choose?\n\nThe problem is, it\u0027s neither and both. I would have maybe chosen \u0022powerless\u0022 if it weren\u0027t the default mental state with my worldview - so the choice did not change my mental state, and since there\u0027s no change from my normal mental state for me, I remain indifferent, neutral. On the other hand, I may also choose \u0022empowered\u0022, but for entirely wrong reasons that have nothing to do with the choices and everything to do with the setting of the question - a supposedly all-powerful wizard suddenly takes an interest in my opinion! Regardless of who it is, anyone with great power (magical, military, political - any power) is important and influential almost by default. If anyone with great power asked for your input on a matter - any matter, as long as it means that they follow through with whatever you choose - you would feel as if you have the same power as they do, if only for a brief while - thus, \u0022empowered\u0022, but in an entirely different manner, which I think is not in the spirit of the question being asked.\n\nI could perhaps advise on how to amend the question to avoid the latter bit, but you probably can\u0027t do anything about the former. ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)"},{"CreatedByName":"temporalExile","CreatedById":127675,"CreatedDateTime":"2015-02-18T19:28:28Z","Content":"\u003E \n\u003E saving the life of one person or five people...\n\u003E ...what happens if the doctor lives...\n\u003E \n\u003E ...the band of terrorists live...\n\nThat wizard is a tricky son of a corncob. He never specifies that the people you don\u0027t choose die. Similarly, he never states that the different scenarios are taken from the same period.\n\nI think that the two scenarios are infact from the same timline, just taken from different points in time.\n\nFirst: The terrorist organization pisses everyone off, and everyone decides that they should just spend more time doing science\n\nSecond: The doctor dude does a bunch of cool stuff with science, and causes overpopulation\n\nThird: Everyone dies\n\nFourth: Profit?\n\nSo, the situation makes me feel pretty darn powerless, seeing as I\u0027m not even making a choice, and that the outcome is the same regardless\n\n**Edited \u003Ctime datetime=\u00222015-02-18T20:20:59Z\u0022 title=\u002202/18/2015 08:20  PM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 18, 2015\u003C/time\u003E by temporalExile**"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-02-18T20:20:50Z","Content":"\u003E \n\u003E -post-\n\nIt is alright, I am not exactly asking for an accurate answer of mental states from respondent, I am not doing psychological tests. And if you don\u0027t fit in either, that is ok too. Thanks for the write up of your thought process though.\n\nPerhaps I should have phrased the poll as this: Do you feel a sense of loss or do you feel like you have gain something after making the choice?\n\n\u003E \n\u003E The dilemma I conceived here was to prove a that the idea of \u0022objective/cosmic/universal good\u0022 is faulty, as a decision might be consider \u0022good\u0022 at one point in time may actually become an evil act once the one making the decision is burdened with more information. Say, if the wizard never show you the final stage of the future, would choosing to save the doctor still be considered \u0022good\u0022 even though it ultimately leads to the demise of humanity? Is ignorance an acceptable excuse to doom one\u0027s own species? Such a goal post move constantly. I believe that morality is not a universal, constant thing, and instead it is a very human thing, or at least a thing bound to decision-making intelligences. Morality is to make the best decision possible from all available information.\n\u003E \n\u003E After exploring this thought experiment though, some people told me they feel like they doesn\u0027t matter anymore, because no matter what they choose, something worse may happen. \u0022What is the point of being the decision maker?\u0022 They asked. There is none, I answered. You can always choose to relieve yourself from making choices and accept your death in the hand of the wizard (which is a choice no one chose yet. Curious.) However, by making a decision, you unlocked a new future, by your own hand. Think of life as the crazy wizard without the magic future reading power. Everyday it provides you with choices, and you gotta make them to live. Life then take every single of those choices and make it into a much greater whole future, something that can be either good or bad. But you don\u0027t know that. You just gotta make the best you can right at the moment you decide. And yet those choices may result in the end of the world as we know it, or the beginning of a new golden age. The future is in your hand, you don\u0027t need to know if it is good or bad, you just make it happen.\n\u003E \n\u003E I personally think it is very empowering. Just like Sean Mirrsen said, it is quite empowering to have an all-powerful being listen to you and do what you choose. Life is like that being. It follows through after your every choices, and it makes a future happens out of infinite other possibilities because of what you choose. Isn\u0027t that awesome?\n\u003E \n\u003E \n\n- - - Updated - - -\n\n\u003E \n\u003E He never specifies that the people you don\u0027t choose die.\n\nI am very sure that \u0022saving the life\u0022 implies that without being chosen, they would die. I guess I should update the first post. People will die regardless of your choice. You just gotta choose who not to die."},{"CreatedByName":"temporalExile","CreatedById":127675,"CreatedDateTime":"2015-02-19T00:01:17Z","Content":"\u003E \n\u003E I cannot understand task at all.\n\u003E What do the wizard want? How many people are at the task? 6 or 5? Supposedly, I do not know them at all, so I cannot make an informed decision.\n\u003E \n\u003E So I will decide to save more people, so we can regroup, return, kill the wizard and **loot the tower**.![:sticktongue:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif)\n\nYou roll a one, and your entire party dies"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-02-19T00:09:31Z","Content":"Either way people die...\n\nI distract the wizard and kill him with a clever plot."},{"CreatedByName":"razark","CreatedById":32993,"CreatedDateTime":"2015-02-19T00:16:18Z","Content":"My choice didn\u0027t change on further information.\n\nI do everything within my power to kill the wizard. I kill on my terms, not under coercion."},{"CreatedByName":"Colserra3","CreatedById":117740,"CreatedDateTime":"2015-02-22T14:02:24Z","Content":"I\u0027d just let the wizard kill me. I\u0027m not going to decide the fate of humanity, also how do I know the wizard is telling the truth when he \u0022shows me the future\u0022? It seems as if he\u0027s just trying to get me to doubt my decision. Each choice I make that seems for the better (E.x: 5 people live, 1 dies), he says \u0027Oh no! Looks like it wasn\u0027t for the better after all! Mwuahahahaha!\u0027 So in defiance of his rules, I\u0027d prefer to die just so he doesn\u0027t get the satisfaction of seeing me question myself repeatedly.\n\n(That was a long rant about an evil wizards plans!)"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2015-02-22T14:24:18Z","Content":"If I know nothing about these six people, and I have two choices (you really didn\u0027t elaborate it well):\n\na) tell him to spare five\n\n![B)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png) tell him to spare one\n\nthen I\u0027d choose a), but i wouldn\u0027t feel empowered.\n\nThe whole \u0022wizard showing future\u0022 is pointless because it produces a paradox. If you know the future, you can change it and you don\u0027t know it. Therefore you can never know it.\n\nI\u0027d stick with my initial choice.\n\n**Edited \u003Ctime datetime=\u00222015-02-22T14:27:12Z\u0022 title=\u002202/22/2015 02:27  PM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 22, 2015\u003C/time\u003E by lajoswinkler**"}]}