{"TopicId":100088,"ForumId":16,"TopicTitle":"Strategies taking more resources than allowed.","CreatedByName":"benjam","CreatedById":138310,"CreatedDateTime":"2015-02-19T08:23:24Z","PageNum":1,"Articles":[{"CreatedByName":"benjam","CreatedById":138310,"CreatedDateTime":"2015-02-19T08:23:24Z","Content":"\n\u003Cp\u003EI have been using the Fundraising Campaign strategy in career mode, and noticed that, even though I set it up to exchange 50% of reputation into 1 Science for each 1.515 reputation, it\u0027s been converting 100% of my rep into science.\u003C/p\u003E\u003Cp\u003EI just added another strategy to convert 10% reputation into 7.2:1 funds, and now when I look at a contract, it gives the total rep as follows: 36 (-54) , so that means it\u0027s taking 150% of my rep and turning into other things.\u003C/p\u003E\u003Cp\u003EScience: 0 (\u002B29)\u003C/p\u003E\u003Cp\u003EFunds: 1070 (\u002B64)\u003C/p\u003E\u003Cp\u003ESo I\u0027m not sure if this is correct. I was under the assumption that 50% of the reputation would be converted to science, and 10% converted to funds, leaving 40% to go towards my rep. Is this right, or did I misread something somewhere?\u003C/p\u003E\u003Cp\u003EI\u0027m on 0.90.0.705 Beta\u003C/p\u003E\n"},{"CreatedByName":"WuphonsReach","CreatedById":130759,"CreatedDateTime":"2015-02-19T15:32:36Z","Content":"\n\u003Cp\u003EWhen it says 36 (-54) that means the original amount was 36\u002B54=90 (and 54 is 60% of 90).\u003C/p\u003E\u003Cp\u003EAlso, try the ImprovedStrategies mod - gives better balance to the various strategies.\u003C/p\u003E\n"},{"CreatedByName":"GoatRider","CreatedById":103681,"CreatedDateTime":"2015-02-19T18:48:24Z","Content":"\n\u003Cp\u003EI haven\u0027t used strategies yet because I don\u0027t understand them. Has anybody written a tutorial for how they work, and why one would use them?\u003C/p\u003E\n"},{"CreatedByName":"EtherDragon","CreatedById":82405,"CreatedDateTime":"2015-02-19T18:57:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GoatRider\u0022 data-cite=\u0022GoatRider\u0022\u003E\u003Cdiv\u003EI haven\u0027t used strategies yet because I don\u0027t understand them. Has anybody written a tutorial for how they work, and why one would use them?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s a really good question that I don\u0027t know the answer to. But Strategies is one area that I really hope SQUAD makes a balancing pass for 1.0. Most \u0022pro\u0022 players turn rep into money and science with a couple strategies.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-02-19T19:08:07Z","Content":"\n\u003Cp\u003EContracts give you a certain amount of money, reputation, and science for completing them. Six of the strategies let you shift the balance of these away from the defaults. For example if you have plenty of science, you might adopt \u0022Patents Licensing\u0022, which will reduce your science gains from contracts (I don\u0027t know if it affects experiments as well) and instead give you extra money.\u003C/p\u003E\u003Cp\u003ECurrently the game balance is rather wonky. Basically anything converting \u003Cem\u003Efrom\u003C/em\u003E funds is overpowered, with \u0022Outsourced R\u0026amp;D\u0022 being an infamous game-ruiner. Conversely anything converting \u003Cem\u003Eto\u003C/em\u003E funds is rather pathetic.\u003C/p\u003E\n"}]}