{"TopicId":100078,"ForumId":39,"TopicTitle":"I have a theory about the mystery goo and kerbals","CreatedByName":"stratvox","CreatedById":134498,"CreatedDateTime":"2015-02-19T05:50:09Z","PageNum":1,"Articles":[{"CreatedByName":"stratvox","CreatedById":134498,"CreatedDateTime":"2015-02-19T05:50:09Z","Content":"Here\u0027s the deal. You know how kerbals are basically interchangeable? It\u0027s because they\u0027re not really individuals. Really, kerbalkind is a hive mind, and the kerbal brain is found deep in the earth beneath the space centre.\n\nSo, you\u0027re playing as the hive mind in KSP, which is why you have to direct the kerbals so much.\n\nSo, what\u0027s the deal with the mystery goo? Well, it\u0027s pieces of the kerbal hive brain, and by taking it up in space with you, you give the brain a chance to experience and understand space more directly which results in SCIENCE! which is why you get more better parts when you take the mystery goo into SPACE! because the mystery goo, once having either its thoughts transmitted (imperfectly, hence the science loss over radio) or by returning the mystery goo to the space centre where it can then be re-merged into the kerbal hive brain by the fine folks in the research centre.\n\nI started out thinking kerbals were gerbils, but now I think they\u0027re ants... not that they realise this, because they experience the dream of being a person. It\u0027s why they sometimes get so terrified flying spacecraft; they don\u0027t really know what they\u0027re doing while they\u0027re doing it (\u0027cause they\u0027re acting under the direction of you, the hive mind) and so it freaks them out; after all, sometimes at the end of a dream, there are monsters kraken. \n\nExcept, of course, for the badasses. They\u0027re different and strange, and have perhaps a bit of an inkling on what\u0027s going on... and since they don\u0027t suffer the illusion of control, they get to simply have fun the whole time."},{"CreatedByName":"OrtwinS","CreatedById":19144,"CreatedDateTime":"2015-02-19T07:48:22Z","Content":"Kerbal \u002B Blender...\n\nThink about it."},{"CreatedByName":"Lohan2008","CreatedById":80945,"CreatedDateTime":"2015-02-19T07:59:49Z","Content":"Will adding Female Kerbals to KSP change your head-canon, Stratvox ?\n\n[http://knowyourmeme.com/memes/headcanon](http://knowyourmeme.com/memes/headcanon)"},{"CreatedByName":"Coldfinger008","CreatedById":51164,"CreatedDateTime":"2015-02-19T13:37:26Z","Content":"Why should it, thatÃ‚Â´s just some funny thing we humans do to them.\n\nThey can look whatever, and still be my beloved asexual fungusblobs."},{"CreatedByName":"stratvox","CreatedById":134498,"CreatedDateTime":"2015-02-19T16:36:19Z","Content":"No, not really. Like ants, not actually ants. I mean, if they were actually ants their heads would be brown, kinda triangular cone shaped, and they\u0027d have antennae.\n\nIt\u0027ll just show that individual kerbals reproduce with each other, rather than being budded off the hive mind in some obscure, fungusoidal way. So... collective organism like an ant hill, but kinda like mammals on the individual level.\n\nBesides, all this is just a load. Idle musing on a late night minmus run."}]}