{"TopicId":100249,"ForumId":18,"TopicTitle":"Kerbo Log Rocket Club AKA October\u0026#039;s Planets","CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-02-20T23:17:45Z","PageNum":1,"Articles":[{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-02-20T23:17:45Z","Content":"\n\u003Cp\u003EI had a silly idea for a Kerbal Space Program spinoff game (By SQUAD, or as a fan-made free game). Set on a 1/100 scale Earth in the 1950s, it follows the development of a young group of rocketmen in a hobby project to the stars!\u003C/p\u003E\u003Cp\u003EYou start in your garage, a teeny-tiny UFO had just landed in your yard, full of a tiny little shiny-sliver race called Kerbos. And they want to go into the \u0022Outer Space\u0022 surrounding Earth and the rest of the universe. You and your group of friends start a Rocketry Club at your school to help these Kerbos back into space. Using a building interface similar to KSP, you start with Firework Rockets, then build up to cheap Estes, then bigger and better Estes rockets, then you start home-rolling your own boosters! It would potentially be even harder than KSP due to the fact that you can ONLY use solid rockets, though nitrogen-pressure gasses might be available at the end of the tech tree. You deal with Money and Reputation, and eventually start getting support if reputation gets higher. But if you keep crashing into houses or starting forest fires, then you may get fined. Money is used to both advance in the tech tree and buy rocket parts. And remember, you\u0027re dealing with the allowances of you and your friends for the project!\u003C/p\u003E\u003Cp\u003EBased on the Kerbo Log, something Felipe Falanghe drew to chronicle rocket launches of tin-foil Kerbos when he was a kid (to be fair, that would be the nineties, not the fifties, but we have to remember the secondary basis: October Sky. Great movie, you should all see it.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ETL;DR\u003C/strong\u003E October Sky the Game or Mini Kerbal Space Program.\u003C/p\u003E\u003Cp\u003ENow why would you want this when there\u0027s Kerbal Space Program? Well, I for one would love to see true home-made rocketry construction simulation with ACTUAL duct tape, and small-scale physics. No huge rockets, only tiny ones.\u003C/p\u003E\n"},{"CreatedByName":"Thomas988","CreatedById":92699,"CreatedDateTime":"2015-02-20T23:52:50Z","Content":"\n\u003Cp\u003EI\u0027ve seen October Sky, \u003Cem\u003Eand\u003C/em\u003E I love the idea of this! An even sillier space game? Count me in!\u003C/p\u003E\u003Cp\u003EIf Squad does ever make a full-blown sequel to KSP I would die to have it be on an interstellar level. Of course the devs have the experience of the four years it took to make KSP under their belts, so I\u0027m sure they could be capable of such a massive game. KSP/Space Engine collab, anyone?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-20T23:53:33Z\u0022 title=\u002202/20/2015 11:53  PM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 20, 2015\u003C/time\u003E by Thomas988\u003C/strong\u003E\n\u003Cbr\u003EI don\u0026#039;t even know popular phrases\n\u003C/span\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-02-21T02:11:13Z","Content":"\n\u003Cp\u003EThis would be cool.\u003C/p\u003E\u003Cp\u003EBut if a sequel to KSP is made, it should have a story.\u003C/p\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-06-17T23:06:59Z","Content":"\n\u003Cp\u003EAt first money is made through bets with your friends, but as the group grows you start entering competitions and being sponsored by companies, even so much as launching the first satellite into the space.\u003C/p\u003E\n"}]}