{"TopicId":100284,"ForumId":55,"TopicTitle":"Simple little additions","CreatedByName":"KASA Space","CreatedById":108702,"CreatedDateTime":"2015-02-21T05:52:16Z","PageNum":1,"Articles":[{"CreatedByName":"KASA Space","CreatedById":108702,"CreatedDateTime":"2015-02-21T05:52:16Z","Content":"Hi! i\u0027m sure I\u0027m not the first to bring these about, but man they would be helpful;\n\n- Ability to go straight to the tracking center from a probe/rocket\n- Ability to rename vessels from the tracking station (if probe has power/is able to be renamed)\n\nIm not sure if these are possible, but they would make everyone\u0027s lives so much easier.\n\nThanks!"},{"CreatedByName":"tntristan12","CreatedById":7005,"CreatedDateTime":"2015-02-21T06:18:16Z","Content":"I\u0027ve never understood why renaming a craft was tied to the power it had in the first place. If I point at a thing and say \u0022that is a television\u0022, I don\u0027t expect somebody to come smack me and shout \u0022you can\u0027t call it that! It\u0027s not plugged in!\u0022 I agree on both counts\n\nEDIT: Then again, what is the map view but a less omnipresent version of the tracking station?"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-02-21T08:31:38Z","Content":"You can already rename a craft from tracking station. It is just a not very obvious function so not a lot of people figured it out.\n\nWhen you click on a craft on the list and focused on it, on the right side of the screen you can see the icon of the craft, click on that and you see the craft info, including its name on an orange bar. Click the orange bar and you can rename it along with putting it into a different category if you wish. I think it even works without power."},{"CreatedByName":"Renegrade","CreatedById":96629,"CreatedDateTime":"2015-02-21T14:03:37Z","Content":"\u003E \n\u003E I think it even works without power.\n\nIt does. You don\u0027t even have to use the tracking center map. A clever fellow in General Discussions discovered that the *Map View* info panel works too (which makes sense, it would logically be the same code in a well-designed program)."}]}