{"TopicId":100321,"ForumId":25,"TopicTitle":"Low Tech SSTO Spaceplane Challenge","CreatedByName":"Batz_10K","CreatedById":4992,"CreatedDateTime":"2015-02-21T15:11:39Z","PageNum":1,"Articles":[{"CreatedByName":"Batz_10K","CreatedById":4992,"CreatedDateTime":"2015-02-21T15:11:39Z","Content":"**The Challenge**\n\nBuild an SSTO spaceplane that can be used without upgrading any of the buildings at the KSC. The SSTO must be capable of horizontal take-off and landing (you don\u0027t have to use the rough runway, the grass is fine). and must be capable of reaching at least a 70km stable orbit (Pe\u003E69km), and have enough fuel to return to the KSC and land. The idea here is to have a reusable spaceplane that is good for \u0027Science data from space around Kerbin\u0027, Rescue missions, and light part testing in an early stage career game.\n\n**That means:**\n\n- Maximum part count: 30 parts\n\n- Maximum mass: 18 tons\n\n- Maximum height: 20m\n\n- Maximum width: 15m\n\n- Maximum Length 15m \n\n- Maximum part tech level - Tier 5 (essentially, any part you can research at the un-upgraded R\u0026D center)\n\n**What is allowed:**\n\n- Informational mods (e.g. MechJeb/Kerbal engineer) or cosmetic mods (e.g. cloud mods, etc)\n\n- Clipping, except for fuel tanks and engines\n\n- Any and all abuse of the offset tool is not only allowed, but encouraged!\n\n**What not allowed:**\n\n- Upgrading \\_any\\_ buildings at the KSC\n\n- Any mod parts except for information only parts (e.g. MechJeb)\n\n- Dropping engines or any structure during the flight. This is an SSTO spaceplane challenge.\n\n**Winning conditions**\n\n- Anybody who can do this challenge is a winner. The grand champion has the highest delta-v on reaching orbit.\n\n- Please post a picture of your craft on the ground, flying and in orbit, and the F3 information screen once you have landed \n\n**Some things to consider when designing your spaceplane:**\n\n- No resource transfers are allowed at tier 1. Think about your fuel flow and balance, and whether you plan to restart engines for the approach into KSC. (if you\u0027re a hotshot glider pilot, that\u0027s ok too)\n\n- The runway is rough, the grass is a little smoother so plan your landing gear design with this in mind.\n\nPlease include a link to your .craft file so that others (including me!) can try out your designs\n\nFAR/NEAR. I have no idea if this is possible in FAR or NEAR, but feel free to have a go. FAR/NEAR entries will be listed separately.\n\n**Winners**\n\nGoSlash27 917ms\n\nBatz10K 536ms\n\nMicromars Completed\n\nStarhawk Completed\n\n**Edited \u003Ctime datetime=\u00222015-02-24T18:03:02Z\u0022 title=\u002202/24/2015 06:03  PM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 24, 2015\u003C/time\u003E by Batz\\_10K**\n  \nUpdate leaderboard"},{"CreatedByName":"MircoMars","CreatedById":61811,"CreatedDateTime":"2015-02-21T21:28:33Z","Content":"I never build spaceplanes in my early career, but I had to give it a try.\n\nI came up with a crazy 2 turbo, 1 srb, 2 48-7s pointed forward design. It made orbit once, but my pilot skills are not that consistent. and since that was technically a test run, I didn\u0027t make enough screenshots... (not one in orbit \\*facepalm)\n\nif you guys wanna try, the flightprofile is like:\n\n1- taxi to flat gras and orient east\n\n2- full throttle, at 110m/s pitch up and use landing gear to get her fat arse in the air airborne\n\n3- pitch to ~65Ã‚Â° until 15km\n\n4- pitch down a bit, but not under 40Ã‚Â° or SRB will push her down\n\n5- ignite SRB at 20km (before flame-out), throttle down turbos (don\u0027t try to shut them down!). at SRB cutout AP should be 85km (\u002B-10km depending on pitch)\n\n6- while coasting: shutdown turbojets, activate forward tanks, activate 48s, turn nose retrograde when out of atmo\n\nthe rest is trivial. she glides pretty well (as the 2nd pic shows) and the turbos will have fuel left, so landing is no problem\n\n[.craft](http://s000.tinyupload.com/index.php?file_id=51908989153076853762)\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/iifuw)\n\na second version is almost ready and I\u0027ll post when I have good pics. but not tonight..."},{"CreatedByName":"Starhawk","CreatedById":131400,"CreatedDateTime":"2015-02-21T21:55:18Z","Content":"\u003E \n\u003E - Any and all abuse of the offset tool is not only allowed, but encouraged!\n\nThat\u0027s what I\u0027ve been waiting to hear!\n\nI figured the real challenge of this for me is that I\u0027ve never built a jet-based spaceplane. Only turbojets. It took a couple of iterations to find the right balance.\n\nHere is the maiden voyage of the Exploded LT spaceplane.\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/he8vH)\n\nHappy landings!\n\nHey Batz, I love some of the little planes you\u0027ve created. I\u0027m hoping to see your entry in the challenge soon.\n\n[EDIT] Here\u0027s a link to the [craft file](https://drive.google.com/file/d/0Bw0xNAqqBjKdTnZaQUVYc3hYVWs/view?usp=sharing).\n\n**Edited \u003Ctime datetime=\u00222015-02-22T17:13:25Z\u0022 title=\u002202/22/2015 05:13  PM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 22, 2015\u003C/time\u003E by Starhawk**\n  \nmoar stuff"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-02-21T23:13:56Z","Content":"![Lotek4_zps7dqhhpms.jpg](http://i52.photobucket.com/albums/g13/GoSlash27/KSP/LoTek/Lotek4_zps7dqhhpms.jpg)\n\n[http://s52.photobucket.com/user/GoSlash27/slideshow/KSP/LoTek](http://s52.photobucket.com/user/GoSlash27/slideshow/KSP/LoTek)\n\nI\u0027ll have to crunch the numbers to see how much DV I had in orbit.\n\n Not sure how much this design will be worth; It\u0027s got 30 parts, so no room to add anything else. I knocked it together in sandbox, so i used the grass just to show that it\u0027s rough field capable.\n\n[http://wikisend.com/download/976582/lotek.craft](http://wikisend.com/download/976582/lotek.craft)\n\nBest,\n\n-Slashy\n\n- - - Updated - - -\n\nStarhawk,\n\n Scary how similar our designs look!\n\n-Slashy"},{"CreatedByName":"Starhawk","CreatedById":131400,"CreatedDateTime":"2015-02-21T23:30:36Z","Content":"\u003E \n\u003E Starhawk,\n\u003E \n\u003E  Scary how similar our designs look!\n\u003E \n\u003E -Slashy\n\nThat\u0027s exactly what I was thinking, lol. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nMine was running on fumes when I landed, though. You had tons in the tank when you made orbit.\n\nBTW, what\u0027s the max speed you can get out of the regular jets? I just sort of flew an inefficient profile and muddled my way to orbit. Never tried without turbos before."},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-02-21T23:39:05Z","Content":"Somebody please double-check my math on this.\n\nAccording to my screen shot, I had a mass of 5.19 tonnes and 106 units of o2 in orbit.\n\n O2 burns faster than fuel, so I\u0027m only going to count what I could have burned in orbit (ignoring the leftover fuel) and ignore the monopropellant.\n\nI had 106 units of o2. An FL-T100 tank weighs .56t full and .06t empty, so it\u0027s F\u002BO weighs .5t.\n\nThat\u0027s 55 units of o2 and 45 units of fuel weighs .5t.\n\n (106/55)\\*.5t means I was carrying .96 tonnes of usable fuel and o2.\n\nOrbital mass = 5.19\n\nMass less fuel and o2 = 4.23\n\nIsp of my 48-7S engines is 350 sec\n\nTherefore my orbital DV was **703 m/sec.**\n\nBest,\n\n-Slashy\n\n- - - Updated - - -\n\n\u003E BTW, what\u0027s the max speed you can get out of the regular jets? I just sort of flew an inefficient profile and muddled my way to orbit. Never tried without turbos before.\n\nIn theory it\u0027s 1km/ sec. I didn\u0027t get anywhere near that, though. I just climbed at 60\\* pitch and kicked in the rockets when my AoA hit 23\\*.\n\nBest,\n\n-Slashy"},{"CreatedByName":"Batz_10K","CreatedById":4992,"CreatedDateTime":"2015-02-22T11:12:57Z","Content":"**MircoMars**\n\n- I started this challenge to see the different ways that this could be done, and I have to say, I am not disappointed! I\u0027ll wait for your full album (or I get time to try your craft out myself) before adding you to the leaderboard\n\n**Starhawk**\n\n- Haha, well as long as that collection of parts makes orbit and makes it home in roughly the same formation, that\u0027s all that really matters right?\n\n- The vessel information panel is closed on KER in your screenshot so I can\u0027t see how much delta-v you had on-orbit\n\n- **Congratulations! you have completed the Low-Tech SSTO challenge**\n\n**GoSlash27**\n\n- With a nearly identical design to Starhawk (but un-exploded), and the luxury of an RCS system!\n\n- Interesting to see the old-style jet cockpit flying in 0.90. \n\n- - **Congratulations! you have completed the Low-Tech SSTO challenge with 702ms delta-v**\n\nI\u0027ve actually got a couple of designs that can do this challenge, one of them is in the K-prize thread here and this is the other:\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/I0bKN)\n\nI\u0027ll post a link to the .craft files later on"},{"CreatedByName":"Starhawk","CreatedById":131400,"CreatedDateTime":"2015-02-22T17:41:43Z","Content":"\u003E \n\u003E Somebody please double-check my math on this.\n\u003E ...\n\u003E \n\u003E Therefore my orbital DV was **703 m/sec.**\n\nMath checks out Slash. I didn\u0027t look at the album for the source numbers, but I assume those are correct.\n\nI don\u0027t think I\u0027ll even bother to calculate mine. Like I mentioned, after the deorbit burn I was running on fumes.\n\nHappy landings!"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-02-22T19:55:08Z","Content":"[http://s52.photobucket.com/user/GoSlash27/slideshow/KSP/Lotek%20II](http://s52.photobucket.com/user/GoSlash27/slideshow/KSP/Lotek%20II)\n\n![Lotek2-1_zpsaa2rdsm4.jpg](http://i52.photobucket.com/albums/g13/GoSlash27/KSP/Lotek%20II/Lotek2-1_zpsaa2rdsm4.jpg)\n\nI cleaned up the Lotek a bit. Less parts, a little more DV, and now remote guidance for rescue jobs. Orbital DV for this run works out to 917 m/sec.\n\n[http://wikisend.com/download/318490/Lotek2.craft](http://wikisend.com/download/318490/Lotek2.craft)\n\n Best,\n\n-Slashy"}]}