{"TopicId":100477,"ForumId":32,"TopicTitle":"1.0 date?","CreatedByName":"DMSP","CreatedById":124853,"CreatedDateTime":"2015-02-23T01:01:07Z","PageNum":1,"Articles":[{"CreatedByName":"DMSP","CreatedById":124853,"CreatedDateTime":"2015-02-23T01:01:07Z","Content":"Anyone know when 1.0 is coming out? I am really excited and I will post a cool fan-work once it comes out. Any dates? Also, off topic, but who wants a epic low part count one launch one way Eeloo mission pack?! It comes with a Base, a station, 2 Rovers, 6 Sats, 2 Mini Probes, 2 crew transfer landers and one massive sat for a Geo-Sync orbit. Also it will have a transfer stage. I think the lifter will be Zeke\u0027s Cira V. Also, I\u0027ll have a stock version and a KAS version. \n\n-DMSP"},{"CreatedByName":"dryer_lint","CreatedById":162541,"CreatedDateTime":"2015-02-23T01:04:31Z","Content":"Soonthuary Soonteenth, Two-Thousand-Soon.\n\nSeriously though, SQUAD never announces release dates. It\u0027ll probably take a while though."},{"CreatedByName":"Commander Jebidiah","CreatedById":78685,"CreatedDateTime":"2015-02-23T01:05:55Z","Content":"You know this is forbidden right and they wont give a release date because they usually en up having to push it back to fix bugs. KSP isnt ready for 1.0 anyway not till stable 64bit and mutiplayer. Next update parts will make it next to impossible to just have B9 installed let alone all its dependencies and there is no gameplay without mods. KSP will get ripped when it is released."},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2015-02-23T01:08:51Z","Content":"Quick! Post something in the thread before it gets locked!\n\nsrsly though, what everyone else said. It\u0027s in the rules actually: don\u0027t ask. Ever."},{"CreatedByName":"Renegrade","CreatedById":96629,"CreatedDateTime":"2015-02-23T01:12:19Z","Content":"Inb4 lock!\n\nThe release date is Tuesday. No, not this week or next week. But it will definitely be a Tuesday. Unless it\u0027s late.\n\nActually I think it was stated somewhere that it wasn\u0027t going to be in February - I do wish we had more information like that. It\u0027s extremely easy to come up with estimates for that - it\u0027s the deadline estimates that are tricky ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)\n\n(my serious estimate would actually be sometime between June and October given the amount of complex things they\u0027re tackling)"},{"CreatedByName":"MGCJerry","CreatedById":95202,"CreatedDateTime":"2015-02-23T01:13:58Z","Content":"Between now and the end of the world... ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)"},{"CreatedByName":"Spuds","CreatedById":99784,"CreatedDateTime":"2015-02-23T01:14:26Z","Content":"It will release when it is finished.\n\nSquad has never liked giving out release dates, because they don\u0027t want to have to inform a disappointed userbase that a bug slipped through QA that needs to be patched. Even so, you can get a rough idea of how much they have done and have to do before 1.0 releases. Just looking at the last Devnote Tuesdays, the new Aero model has been pushed to QA, while the new procedual fairings have begun development."},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2015-02-23T01:14:29Z","Content":"That\u0027s enough, guys. No need to make silly jokes on it. We all know the topic of release dates is forbidden."}]}