{"TopicId":100488,"ForumId":32,"TopicTitle":"How to save a broken save? (or filtering out mods that might be breaking the game)","CreatedByName":"PTNLemay","CreatedById":30142,"CreatedDateTime":"2015-02-23T02:34:49Z","PageNum":1,"Articles":[{"CreatedByName":"PTNLemay","CreatedById":30142,"CreatedDateTime":"2015-02-23T02:34:49Z","Content":"I\u0027ve been running a game for a few months now, a good 16 in-game years I think, and... something\u0027s gone wrong. I was performing a Mun base mission, place a base on wheels that can support 17 kerbals and also have a science lab. I sent it up in two parts, one with a huge aircraft fuselage crew compartment, and the other with the science lab. I painstakingly got them together on the munar surface, and then at the moment of connection the game crashed. I restarted the game, quickloaded, tried again... again it crashed. I thought maybe one of my mods was missbehaving (all I have is parts of the B9 mod which I haven\u0027t used yet, Kerbal Engineer Redux, and JSI to go with B9) but removing them only seemed to make it worse. I could get into the game but it would freeze and crash at the space center menu. So I put the mods back in, tried to load up the game and thought... maybe my space has gotten too loaded with junk. So I went and deleted most of the debris sitting near Kerbin and the Mun. This time the game gave me an error report when it crashed. So I figure now I can at least share this. Where do I post this report by the way?\n\nAlso, is there a way to reinstall my game to a fresh install but somehow preserve my game? I don\u0027t want to lose all of the progress I\u0027ve made. The one problem might be that I have ships out in space that are using the Kerbal Engineer sensor tape thingy. If I reinstall the game and I don\u0027t have Engineer installed the game might bug out when it tries to load those parts... Is it hard to go into .craft files and remove those mod parts?"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2015-02-23T02:36:43Z","Content":"Try making a new \u0022game\u0022 in-game. Transfer your persistent.sfs file over. See if that fixes anything.\n\nI\u0027ve never tried this before, I wouldn\u0027t know for sure. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"alexman142","CreatedById":134322,"CreatedDateTime":"2015-02-23T02:56:10Z","Content":"I recently had the same problem. If I am correct, the issue is that your game is running too much memory, thus crashing the game. Downgrade the graphics and the texture resolution. The game should start working correctly. \n\nAs you add more mods, you will need to lower the texture quality to save memory. On pure stock, I can easily max the graphics, but since I have so many mods running, I need to lower everything down. Once I increased the graphics, and my game crashed during the loading screen. I went back to stock, lowered the graphics, then put my mods back in, and everything worked."},{"CreatedByName":"Xannari Ferrows","CreatedById":125369,"CreatedDateTime":"2015-02-23T03:05:07Z","Content":"So your ship spontaneously destroys itself? Here\u0027s what you can do:\n\nGo into the quicksave file, hit Ctrl\u002BF, and search for \u0022Vessel\u0022. Once you come across the one you\u0027re looking for, you can do one of two things:\n\n1. Search further down into the save for more vessels. It\u0027s very well possible your save data duplicated itself and they overlapped, cause massive strain on the physics.\n\n2. Find the vessel you docked to your base, and completely edit it out. You can paste the data under its\u0027 own vessel section.\n\nIf this doesn\u0027t work, you may have to resort to extreme measures. If you\u0027re certain that there\u0027s nothing you can do, just delete the craft. \n\nOpen your main base up in the VAB/SPH, and launch it. When on the launchpad, quicksave, then open up the quicksave folder. The last vessel will be the one you just launched, so find it, and look for a section that looks like this:\n\n      }        VESSEL        {            pid = 3860ab2628e041a686514ce0f1c347d7            name = Vessel name            type = Base            sit = PRELAUNCH            landed = KCS_LaunchPad_Platform            landedAt =             splashed = False            met = 0            lct = 746737854.522392            root = 0            lat = -0.097240363899859            lon = 285.442320652498            alt = 75.6801681588404            hgt = 3.177382            nrm = 0.002713722,0.9999963,0.0001436905            rot = -0.09840213,-0.7004071,0.7007861,-0.09298319            CoM = 0.003319208,-1.228578,0.006591669            stg = 3            prst = False            ref = 1915941509            ctrl = True            cPch = 0.2            cHdg = 0.3            cMod = 0            ORBIT            {                SMA = 300815.927401234                ECC = 0.994822736788201                INC = 0.0972410049037575                LPE = 89.9992535451791                LAN = 227.049020462807                MNA = 3.14159396014566                EPH = 746737854.562392                REF = 1\n\nThis tells you your current status and your current orbit. Now, to get into a Munnar orbit, replace the entire section with this:\n\n      }\t\tVESSEL\t\t{\t\t\tpid = 3860ab2628e041a686514ce0f1c347d7\t\t\tname = Vessel name\t\t\ttype = Base\t\t\tsit =\t\t\tlanded = False\t\t\tlandedAt = \t\t\tsplashed = False\t\t\tmet = 0\t\t\tlct = 746737854.522392\t\t\troot = 0\t\t\tlat = -0.097240363899859\t\t\tlon = 285.442320652498\t\t\talt = 75.6801681588404\t\t\thgt = 3.177382\t\t\tnrm = 0.002713722,0.9999963,0.0001436905\t\t\trot = -0.09840213,-0.7004071,0.7007861,-0.09298319\t\t\tCoM = 0.003319208,-1.228578,0.006591669\t\t\tstg = 3\t\t\tprst = False\t\t\tref = 1915941509\t\t\tctrl = True\t\t\tcPch = 0.2\t\t\tcHdg = 0.3\t\t\tcMod = 0\t\t\tORBIT\t\t\t{\t\t\t\tSMA = 300000\t\t\t\tECC = 0.0005\t\t\t\tINC = 0\t\t\t\tLPE = 41\t\t\t\tLAN = 227\t\t\t\tMNA = 3.1415926535898\t\t\t\tEPH = 746737854.562392\t\t\t\tREF = 2\n\nThese should be the parameters for a stable Munnar orbit. You can then edit your other ship up into orbit, where you can bring them down\n\nand try again. Be sure to quicksave before you put them together, just to have something to go back to.\n\n**Edited \u003Ctime datetime=\u00222015-02-23T03:14:30Z\u0022 title=\u002202/23/2015 03:14  AM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 23, 2015\u003C/time\u003E by Xannari Ferrows**"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-02-23T03:07:07Z","Content":"I had something similar happen tonight, built a crane to move stuff around on Minmus, came in for a landing and hit the stage button to release the skycrane, and the game crashed. After a few reloads and tries, I rebuilt the entire crane and launched again, landing flawlessly. In short, I suggest you try rebuilding your craft."},{"CreatedByName":"PTNLemay","CreatedById":30142,"CreatedDateTime":"2015-02-23T03:09:14Z","Content":"@ Starwhip\n\nIt was a good idea, but upon trying the connection the game crashed again. It really does appear to be the docking that\u0027s causing the problem.\n\n@Xannari\n\nI don\u0027t know if the parts are destroying themselves, the game litterally just freezes then crashes. \n\nI think at this point I will just delete the ships, dock a fresh pair of them back on Kerbin, then cheat them over to the mun. I completed the mission! The game is just being testy."}]}