{"TopicId":100524,"ForumId":16,"TopicTitle":"Thinking about making the switch to FAR.","CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2015-02-23T15:13:11Z","PageNum":9,"Articles":[{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2015-04-08T14:15:55Z","Content":"\u003E \n\u003E Had a couple of you ask about the monoprop tank - this design started out as a tweak of SalehRam\u0027s design from the day before yesterday, and it had an inline monoprop tank. I didn\u0027t see any harm in leaving it in since some of the advice with that particular design was \u0022make the fuselage longer and draw the CoM forward\u0022. In my experience, monoprop makes for reasonably good ballast if nothing else. I did move it well forward from where it was originally; in retrospect I wonder if it would\u0027ve been better to put it in between the cockpit and the cargo bay.\n\nTo move the CoM forward I\u0027d first and foremost get the crew cabin and docking port forward, since these are components that do not change weight no matter what you do. Cockpit -\u003E crew cabin -\u003E docking port, results in a very meaty front end that counterweights the engines pretty easily ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif) With those at the front, you could investigate a double length cargo bay behind them, and would probably find that the cargo now sits on the CoM and thus won\u0027t interfere with the flight characteristics whatever the weight of it is. If half that cargo ends up being a can of fuel for extra range - that doesn\u0027t hurt any, but a long bay gives you a quick-switch option either way ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nWanderfound\u0027s point above about tweaking the nacelles up or down a notch to counter the torque is very sound advice. Set your increment to zero degrees (weirdly this affects the offset tool too) and go for the smallest tweak you can make ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif) Alternatively, an offset load at the bottom of the cargo bay might be enough; some heavy battery packs maybe, or a couple of spherical MP containers (offset so they don\u0027t stick out)."},{"CreatedByName":"Hodo","CreatedById":78218,"CreatedDateTime":"2015-04-08T21:30:45Z","Content":"\u003E \n\u003E Use RealChutes if you\u0027re going to use anything - you can add proper drag chutes, which can help considerably given spaceplanes can have some fairly high landing speeds.\n\nWhile I have designs that have drag chutes for landing I rarely use them, unless I am landing on a short runway, Island strip. \n\n![LX0SvmM.jpg](http://i.imgur.com/LX0SvmM.jpg)\n\nWhile this craft could easily land on the KSC runway I was testing a heavy landing."},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2015-04-09T03:03:54Z","Content":"capi3101 I love following your progress! ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nThe reason for canards being unstable is that when deflected, increasing pitch increases their angle of attack rather than decreasing it (and vice versa for pitching down). A tailplane applies pitch-up moment by tilting up, giving a negative angle of attack; as the plane pitches up, the angle of the tailplane surface approaches 0 compared to the airflow. By contrast, when you pitch up using a canard, the canard starts with a positive angle of attack, and that angle increases as the plane rotates."},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2015-04-09T04:14:53Z","Content":"Alright - followed your guys\u0027s suggestions for a redesign this evening and came up with this:\n\n![CcvHnz4.png](http://i.imgur.com/CcvHnz4.png)\n\nMissed the suggestion about structural intakes at the base of the fins but pretty much did everything else y\u0027all suggested. That is a large cargo bay BTW, and the CoM is right in the center of it. Added the canards to improve the pitch authority and bring the CoL closer to the CoM (first few flights of the redesign went into the drink with the elevators set to full deflection) and then later added the third engine when I realized just how fast the takeoff speed was on this thing - neighborhood of 140 m/s (which seems high to me but also is an indication that I shouldn\u0027t be affected by drag from the wings so much at altitude, right?). Nose lifted just fine once the canards were added, but the plane didn\u0027t want to take off until it got going better. Probably should\u0027ve paid more attention to the wing geometry - the fuselage is longer than what I started with but I pretty much left the wings/fins there from the first design.\n\nI am going to have to calculate how much payload this thing should be capable of carrying to orbit - I think I\u0027ve got a reasonable general purpose transporter pretty far along at this point, though.\n\nStill need to try to land it."},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2015-04-09T07:11:10Z","Content":"One other note on canards and tails, may have been mentioned upthread, may not have been.\n\nWhat you want is for the front of the aircraft to stall before the rear. That means that when you\u0027re at high alpha and start stalling, you\u0027ll tend back to in-line with your velocity vector rather than \u0027flip out\u0027. You can do this by making sure, from front to back, all wing surfaces have decreasing aspect ratio and/or increasing sweep. This is why canards are often less swept, and higher aspect ratio, than the main wing (see modern canard-delta fighters), and why tailplanes are often lower-aspect-ratio and more swept than the main wings on traditional-planform aircraft.\n\nThe example you showed above, with a highly-swept cropped delta as the main wing and low-sweep, high-aspect canards, embodies this principle: not only do the canards add control authority and move the CoP further forward (which does decrease stability, but also makes the plane nimbler) they will also paradoxically *increase* stability at high alpha (err, angle of attack) because of the above."},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2015-04-09T07:54:21Z","Content":"You\u0027d actually be better off with a turbojet instead of a RAPIER as the third engine; you\u0027ve got enough TWR that the turbojet should still be producing high-efficiency thrust when it comes time to shut down and coast to apoapsis. The RAPIER is lower power, less fuel efficient in jet mode, and you don\u0027t need a third rocket."},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2015-04-09T10:18:33Z","Content":"\u003E \n\u003E One other note on canards and tails, may have been mentioned upthread, may not have been.\n\u003E What you want is for the front of the aircraft to stall before the rear. That means that when you\u0027re at high alpha and start stalling, you\u0027ll tend back to in-line with your velocity vector rather than \u0027flip out\u0027.\n\nVery good point ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif) Always worth turning on FAR\u0027s visualisations and highlighting stalls. Bright red canards while the wings look fine is a surprisingly good omen. Red wings and normal canards would be bad xD"},{"CreatedByName":"ratchet freak","CreatedById":119895,"CreatedDateTime":"2015-04-09T10:20:29Z","Content":"\u003E \n\u003E One other note on canards and tails, may have been mentioned upthread, may not have been.\n\u003E What you want is for the front of the aircraft to stall before the rear. That means that when you\u0027re at high alpha and start stalling, you\u0027ll tend back to in-line with your velocity vector rather than \u0027flip out\u0027. You can do this by making sure, from front to back, all wing surfaces have decreasing aspect ratio and/or increasing sweep. This is why canards are often less swept, and higher aspect ratio, than the main wing (see modern canard-delta fighters), and why tailplanes are often lower-aspect-ratio and more swept than the main wings on traditional-planform aircraft.\n\u003E \n\u003E The example you showed above, with a highly-swept cropped delta as the main wing and low-sweep, high-aspect canards, embodies this principle: not only do the canards add control authority and move the CoP further forward (which does decrease stability, but also makes the plane nimbler) they will also paradoxically *increase* stability at high alpha (err, angle of attack) because of the above.\n\nYou can also vary the angle of attack (the incidence angle) per wing so when looking at the side then outer edges point up."},{"CreatedByName":"Van Disaster","CreatedById":58876,"CreatedDateTime":"2015-04-09T11:14:15Z","Content":"Canard design - there\u0027s actually two types, one is a pure control surface for a craft balanced on it\u0027s main wing which you\u0027ll generally find on fighters - there are other reasons to use close-coupled canards on aerobatic aircraft which FAR doesn\u0027t deal with - and the other type is expected to contribute a significant amount of overall lift which is not something that\u0027s used much anywhere at the moment. The first type you can happily use an all-moving surface for, but I would balance the craft\u0027s CoL *before* you add it. The second type I\u0027d most definitely have quite a lot of it be a fixed surface ( not least because with something that big, an all-moving surface will produce a hell of a lot of torque ). It\u0027s quite easy to stall all-moving canards and you really don\u0027t want to stall something that\u0027s holding the nose of your craft up...\n\n\u003E \n\u003E You\u0027d actually be better off with a turbojet instead of a RAPIER as the third engine; you\u0027ve got enough TWR that the turbojet should still be producing high-efficiency thrust when it comes time to shut down and coast to apoapsis. The RAPIER is lower power, less fuel efficient in jet mode, and you don\u0027t need a third rocket.\n\nAlways been quite curious about that because I rarely use Rapiers, having been using B9 engines since they appeared ( and not least because the Rapier is far too compact a part for what it does ), so I thought I\u0027d check it empirically. And then I remembered B9 gets at the jets so I looked at a MM dump of the cfgs, and found the open cycle rapier \u0026 the turbojet had the exact same curves - the Rapier\u0027s max thrust is less and it uses ModuleEnginesFX ( and either B9 use the FAR data or the FAR cfg is the winner, because they\u0027re both using FAR\u0027s config ). Anyway I strapped a couple under a large spaceplane capable of high speed high altitude flight so hopefully I could find their limits, and here\u0027s what came out - an odd wrinkle showed up I wasn\u0027t expecting. \n\nJust post takeoff. Not sure how much I trust those SI figures, but I guess they take airflow into account rather than just fuel burn.\n\n[![16900967449_1eefe610fa_z.jpg](https://farm8.staticflickr.com/7680/16900967449_1eefe610fa_z.jpg)](https://flic.kr/p/rKtSNv)\n\n10km, flying a reasonably steep profile because there\u0027s no payload in the aircraft other than the jet pods. I\u0027d probably not be doing quite that speed normally but it doesn\u0027t actually matter much.\n\n[![16899629800_3ddd99b974_z.jpg](https://farm8.staticflickr.com/7612/16899629800_3ddd99b974_z.jpg)](https://flic.kr/p/rKn2aA)\n\nMax thrust ( well, just past ) for the turbojet.\n\n[![16464729754_e4a6cfb2da_z.jpg](https://farm9.staticflickr.com/8789/16464729754_e4a6cfb2da_z.jpg)](https://flic.kr/p/r5W3wW)\n\nNow here\u0027s where it got interesting. Thrust on both engines was decreasing, but actually for a while the Rapier was producing more thrust than the turbojet. What\u0027s interesting is the realm it\u0027s doing it in, because this would be a pretty critical speed area for a stock-engine spaceplane. I forget how far ahead it got so I\u0027m going to fly it again at some point.\n\n[![17085688042_86f4907609_z.jpg](https://farm8.staticflickr.com/7584/17085688042_86f4907609_z.jpg)](https://flic.kr/p/s2NBNj)\n\nAnd here\u0027s where the turbojet caught up again:\n\n[![16900971159_58829919de_z.jpg](https://farm9.staticflickr.com/8742/16900971159_58829919de_z.jpg)](https://flic.kr/p/rKtTUt)\n\nAt this point the Rapier is producing more drag than thrust:\n\n[![17086482561_266f684367_z.jpg](https://farm8.staticflickr.com/7725/17086482561_266f684367_z.jpg)](https://flic.kr/p/s2SFYV)\n\nNo Rapier thrust. The jet isn\u0027t doing great either...\n\n[![16899411038_85179fbfc1_z.jpg](https://farm8.staticflickr.com/7629/16899411038_85179fbfc1_z.jpg)](https://flic.kr/p/rKkU8Q)\n\nAnd no thrust for the jet.\n\n[![16900974139_30541abb4c_z.jpg](https://farm9.staticflickr.com/8800/16900974139_30541abb4c_z.jpg)](https://flic.kr/p/rKtUMR)\n\n**Edited \u003Ctime datetime=\u00222015-04-09T11:28:20Z\u0022 title=\u002204/09/2015 11:28  AM\u0022 data-short=\u00229 yr\u0022\u003EApril 9, 2015\u003C/time\u003E by Van Disaster**"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2015-04-09T11:45:10Z","Content":"Nice work; thanks.\n\nDespite the slight crossover in the high supersonic, it still looks like a clear win to the turbojet to me, especially once you consider the drag advantage. And they sound much nicer. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\n(note for the peanut gallery: those shots are displaying the effect of speed, not altitude. With sufficient intakes, you can keep jets running well over 30,000m)"},{"CreatedByName":"Van Disaster","CreatedById":58876,"CreatedDateTime":"2015-04-09T12:15:03Z","Content":"Seems the Rapier goes ahead by 5.5kN or so in the 1.1-1.3km/s area, so possibly worth thinking about if you\u0027re really borderline but it\u0027s not that big a deal. \n\nAltitude was a bit awkward to arrange with that particular craft given by 30km it\u0027s usually way too fast for those engines, but I got something relevant.\n\n[![16900117220_fab532d388_z.jpg](https://farm8.staticflickr.com/7675/16900117220_fab532d388_z.jpg)](https://flic.kr/p/rKpw4o)\n\nEdit: actually managed a bit of an altitude profile:\n\n35km @1263m/s, Rapier ahead as expected\n\n[![16880494357_8032e7678f_z.jpg](https://farm8.staticflickr.com/7600/16880494357_8032e7678f_z.jpg)](https://flic.kr/p/rHEWSa)\n\n37km @1379m/s - keeping speed down was pretty hard, look at the absurd AoA...\n\n[![16880520757_f8fff0b7ec_z.jpg](https://farm8.staticflickr.com/7702/16880520757_f8fff0b7ec_z.jpg)](https://flic.kr/p/rHF5Hk)\n\n40km @ 1460m/s - Rapier is catching up somewhat\n\n[![17062002446_5a9ac39341_z.jpg](https://farm9.staticflickr.com/8770/17062002446_5a9ac39341_z.jpg)](https://flic.kr/p/rZHdTY)\n\n42km @ 1563m/s - neither of them are much use at this point, but speed was a problem because it\u0027s well past peak for either ( and lack of intakes by this point )\n\n[![17087970055_53ea3db7bd_z.jpg](https://farm9.staticflickr.com/8797/17087970055_53ea3db7bd_z.jpg)](https://flic.kr/p/s31jan)\n\nJet still burning at 47km, well into airhogging territory by this point given it\u0027s using everything else\u0027s intakes by itself...\n\n[![16880568047_c0c6813ee1_z.jpg](https://farm9.staticflickr.com/8699/16880568047_c0c6813ee1_z.jpg)](https://flic.kr/p/rHFjLF)\n\n**Edited \u003Ctime datetime=\u00222015-04-09T12:59:28Z\u0022 title=\u002204/09/2015 12:59  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 9, 2015\u003C/time\u003E by Van Disaster**"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2015-04-09T13:12:24Z","Content":"This morning I\u0027m starting to give some thought over where I need to head next. Obviously de-orbiting and landing are things I need to practice; I kept last night\u0027s plane in orbit so I can start doing that this evening. I\u0027m also beginning to think about how I\u0027d lift a Jumbo 64 or S3-14400 to orbit via plane (I\u0027ve done a J64 in stock before - never a 14400), and eventually I\u0027ll need to get back over to my career game, which has been on hold since I started playing around with FAR. One thing I know there - I haven\u0027t unlocked RAPIERs yet.\n\nI guess that last bit begs a question - one of my very first FAR plane was the Flaming Death Trap 7:\n\n![d3AonbS.png](http://i.imgur.com/d3AonbS.png)\n\nY\u0027all warned me off of the engine arrangement I had going there (the Turbojet/24-77 combo), due to the drag the 24-77s produced. I used to use that arrangement in stock because it reduced the overall engine footprint I needed for my planes. But let\u0027s say in the future I had a design that only needed a single Turbojet (and let\u0027s say this is in my career game so I don\u0027t yet have RAPIERs). What would be a good rocket engine arrangement for such a plane? Maybe a pair of flanking 48-7Ss?\n\nEDIT: I really should revisit this design. So many things to be fixed with it..."},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2015-04-09T13:24:14Z","Content":"Big ships are considerably harder than small ones; it\u0027s a good idea to get comfortable with Mk2 designs before going bigger.\n\nIf I\u0027m having to do a pre-RAPIER design, I\u0027ll usually use a pair of turbojets flanking a single LV-T45."},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2015-04-09T15:10:52Z","Content":"\u003E \n\u003E If I\u0027m having to do a pre-RAPIER design, I\u0027ll usually use a pair of turbojets flanking a single LV-T45.\n\nReally? I\u0027d have thought you wouldn\u0027t need that much thrust at that point in the ascent...is that choice more for the rocket\u0027s Isp? Or is it more a matter of getting a decent amount of thrust out of it while the throttle is set low (i.e. giving you a good amount of \u0022crossover\u0022 thrust between the jets and the rocket)?"},{"CreatedByName":"tetryds","CreatedById":50204,"CreatedDateTime":"2015-04-09T18:09:40Z","Content":"\u003E \n\u003E Big ships are considerably harder than small ones; it\u0027s a good idea to get comfortable with Mk2 designs before going bigger.\n\u003E If I\u0027m having to do a pre-RAPIER design, I\u0027ll usually use a pair of turbojets flanking a single LV-T45.\n\nFor SSTOs, yes, for low/mid altitude planes, not at all.\n\nLow altitude smaller planes get a lot more complicated, you don\u0027t have too much freedom nor a lot of room for balancing, your design is either good or bad.\n\nI am talking about sanely sized aircraft, by the way.\n\nNow answering to the topic\u0027s OP,[go for it.](https://forum.kerbalspaceprogram.com/threads/113324)"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2015-04-09T18:49:43Z","Content":"Er...went for it. A while ago."},{"CreatedByName":"Hodo","CreatedById":78218,"CreatedDateTime":"2015-04-09T18:57:30Z","Content":"These are the speeds at which each engine is effectively useless.\n\nTurbojets Mach 4 they quit producing thrust at all.\n\nSame for RAPIERs.\n\nSABREs produce thrust up to Mach 5.5.\n\nBase jet engine dies out about mach 1.5. \n\nAs you can see the SABRE is a far better choice for most SSTOs but I have used the RAPIER before because of its compact size and lower mass. I follow the Skylons projected flight path, climb to a set altitude then maintain a gentle climb till I reach mach 5 for SABRE or Mach 4 for RAPIERs and then switch over to closed cycle or the rocket, at this point I should be at 25km ASL. (Above Sea Level)\n\nOnce in closed cycle/Rocket mode I then increase my rate of climb from a gentle 10-14deg to a steep 30-40deg climb to achieve space as soon as possible. Once my target AP is where I want it I cut the engines a continue to drift to my orbital insertion burn. With a SABRE this shouldn\u0027t be much more than a 30second burn.\n\nThis album oddly enough shows part of my ascent profile. \n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/OauTs)\n\n**Edited \u003Ctime datetime=\u00222015-04-09T18:59:52Z\u0022 title=\u002204/09/2015 06:59  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 9, 2015\u003C/time\u003E by Hodo**"},{"CreatedByName":"UnusualAttitude","CreatedById":129962,"CreatedDateTime":"2015-04-09T20:08:47Z","Content":"Congratulations on your progress, Capi!\n\nWhat will you be using your pre-RAPIER career SSTO for? If it\u0027s for light cargo/satellite launch/crew transfer, then I\u0027ll second Wanderfound on the choice of twin turbos and either the LV-T45 or LV-T30. If you look at a typical spaceplane ascent, more than half of your fuel (LF and Ox) is used to boost out of the atmosphere into space. It is critical to have a high TWR during this phase (you won\u0027t reach terminal velocity in FAR) in order to get from 30 to 50k as quickly as possible and waste as little dV as possible to counter gravity and drag. Your aircraft becomes a rocket at this point. \n\nThat\u0027s why RAPIERS are such a good deal in many cases: you get more closed cycle thrust from two RAPIERS for much less weight than a couple of jets combined with a traditional rocket engine. A few points of ISP won\u0027t make a big difference, and the RAPIER has a decent ISP anyway. \n\nIf you want your spaceplane to go places/do things/carry stuff once it\u0027s in orbit, it boils down to having a high fuel fraction (so a low TWR on takeoff), and as much TWR as is reasonably possible once you go to rocketry, with the possible exception of spaceplanes with nukes, but ask Wander about those...![:wink:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)\n\nIf you\u0027re also interested in bigger spaceplanes, check my signature link for inspiration in designing something that will lift an orange tank or more to orbit. They are more complicated to build and I\u0027ve been experiencing quite a few issues with FAR not liking some of the larger parts for some reason (excessive drag). Let me know if I can help.\n\nSalut, UA."},{"CreatedByName":"Van Disaster","CreatedById":58876,"CreatedDateTime":"2015-04-09T20:25:50Z","Content":"\u003E \n\u003E If you\u0027re also interested in bigger spaceplanes, check my signature link for inspiration in designing something that will lift an orange tank or more to orbit. They are more complicated to build and I\u0027ve been experiencing quite a few issues with FAR not liking some of the larger parts for some reason (excessive drag). Let me know if I can help.\n\u003E Salut, UA.\n\nAdd a radial decoupler to your first stage so it blows off when you enable the engines at launch - there\u0027s some odd cases to do with part clipping that it\u0027s a cure for. If it\u0027s not that then it\u0027s not something common.\n\nMk3 - sized planes should manage multiple orange tanks if you can find decent engines ( ie, B9 big sabres ). Stock really needs bigger engines."},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2015-04-10T01:08:01Z","Content":"\u003E \n\u003E Add a radial decoupler to your first stage so it blows off when you enable the engines at launch - there\u0027s some odd cases to do with part clipping that it\u0027s a cure for. If it\u0027s not that then it\u0027s not something common.\n\u003E Mk3 - sized planes should manage multiple orange tanks if you can find decent engines ( ie, B9 big sabres ). Stock really needs bigger engines.\n\nBigger jets would certainly be nice, but I\u0027m finding this sort of setup to be fairly effective:\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/aVwJ6)\n\nIt\u0027s scalable by adding or removing the wing pods.\n\n- - - Updated - - -\n\n\u003E \n\u003E Really? I\u0027d have thought you wouldn\u0027t need that much thrust at that point in the ascent...is that choice more for the rocket\u0027s Isp? Or is it more a matter of getting a decent amount of thrust out of it while the throttle is set low (i.e. giving you a good amount of \u0022crossover\u0022 thrust between the jets and the rocket)?\n\nIt\u0027s about punching through the high-drag low-oxygen zone between 30,000 and 60,000m as quickly as possible. You won\u0027t get much useful thrust out of jets above 30,000m, but you keep losing speed to drag until you\u0027re on the edge of space. A lower thrust flatter ascent costs you fuel in friction.\n\nWings allow you to get away with a very low take off TWR, but by the time you fire the rockets the wings aren\u0027t doing much. The more TWR at that point the better (within reason)."},{"CreatedByName":"Van Disaster","CreatedById":58876,"CreatedDateTime":"2015-04-10T03:06:57Z","Content":"\u003E \n\u003E Bigger jets would certainly be nice, but I\u0027m finding this sort of setup to be fairly effective:\n\u003E It\u0027s scalable by adding or removing the wing pods.\n\nI forget what an orange tank weighs, I guessed at 40t though. This is towards the heavier end of my lifters but I\u0027ve got some significantly larger, albeit not really more powerful. Given it has 35% fuel load left in orbit ignoring the payload tank, it can lift considerably more than this.\n\n[![16474441243_36131f0820_c.jpg](https://farm9.staticflickr.com/8815/16474441243_36131f0820_c.jpg)](https://flic.kr/p/r6MPqp)\n\n[![17093094672_29afa718c6_c.jpg](https://farm8.staticflickr.com/7644/17093094672_29afa718c6_c.jpg)](https://flic.kr/p/s3szwQ)\n\nDoing that with stock engines would need 16 Rapiers, along with all the bits to attach 16 Rapiers, and that\u0027s starting to run into severe part count issues. The fuselage is already in stock as the Mk3, so it\u0027s not like this is something that is \u0022too big for stock\u0022."},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2015-04-10T16:06:33Z","Content":"\u003E \n\u003E It\u0027s about punching through the high-drag low-oxygen zone between 30,000 and 60,000m as quickly as possible. You won\u0027t get much useful thrust out of jets above 30,000m, but you keep losing speed to drag until you\u0027re on the edge of space. A lower thrust flatter ascent costs you fuel in friction.\n\u003E Wings allow you to get away with a very low take off TWR, but by the time you fire the rockets the wings aren\u0027t doing much. The more TWR at that point the better (within reason).\n\nI see. Wish I\u0027d seen this last night prior to the test flight of the re-designed Death Trap:\n\n![JleBuwd.png](http://i.imgur.com/JleBuwd.png)\n\n(Yeah, I\u0027d forgotten about the RCS Cylinders I was using for ballast before I took off - I should take those out and rebalance the fuel some more. Two more structural intakes on the underside that y\u0027all can\u0027t see in that shot).\n\nDecided not to change the engine set-up despite the dragginess. Engine flamed out at 32k and I was only doing about Mach 3.5 at the time, and I started losing speed when I throttled down to let the engine catch. So I kicked the rockets on. You might suspect what the result was...\n\n\u003E ![QLNR6Ty.png](http://i.imgur.com/QLNR6Ty.png)\n\u003E I wish I\u0027d paid closer attention to this prior to take-off; FAR was giving me X\u003Csub\u003Ew\u003C/sub\u003E warnings from 15k/Mach 2 and up though the simulations were showing stabilizing tendencies, so I did nothing about it.\n\nOn the plus side, I did get to practice an emergency landing, which I\u0027m happy to say was a full success in its own right. Q maxed out around 13 kPa during the descent; started S-turns at that point and those really helped. Touched down about 80 m/s SAS-off and hit the brakes; got her stopped without anything breaking off. I guess putting the gear out on the underside of the wings was a really good idea..."},{"CreatedByName":"Van Disaster","CreatedById":58876,"CreatedDateTime":"2015-04-10T16:26:05Z","Content":"I would suggest converting some of that tail height into length - every time you use the rudder it\u0027s going to attempt to roll the thing given the tail span is bigger than the wing semispan! also perhaps slightly bigger control surfaces. But yeah in general either high rocket TWR or high ISP rockets ( ie, nuclear ones ) is the way, if you can. If you\u0027re really small you can zoom-climb with jets \u0026 not kick in the rockets until 50km\u002B, but that doesn\u0027t really work for big craft. My really big craft just chug their way up pointing 15ish deg upwards \u0026 make use of enormous wing area and large amounts of fuel, nothing else I can do with those."},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2015-04-10T17:07:40Z","Content":"Yeah, I\u0027m not really sure what happened with that fin - I was shooting for 20% of the wing area at a 2:1 ratio and I think I must\u0027ve miscalculated something. On the plus side, the plane\u0027s yaw control was *awesome*."},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2015-04-11T03:44:28Z","Content":"Okay...still having issues with the Death Trap. This one was one that RCS Build Aid was telling me, though:\n\n![VWRMEIs.png](http://i.imgur.com/VWRMEIs.png)\n\nAnd you can even see it there - the CoT is not inline with either of the CoMs. I can get rid of most of the torque by putting the wing lower on the fuselage, but doing that will put the CoL below the CoMs, and tilting the wing dihedral to put the CoL back where I want it puts the torque right back where it was.\n\nFAR gives me reds with the current design on at 10/1 on X\u003Csub\u003Eu\u003C/sub\u003E at 15/2 on Z\u003Csub\u003Ew\u003C/sub\u003E, but in both cases the sims stabilize. FAR green-lights the design at the other benchmarks, including 30/4. What happens is that I get up to about 35k/Mach 3.8 or so, the jet flames out and so I put on the rockets. The torque kicks in and I pitch up and out of control. First time that happened I got to do the emergency landing I talked about last night. Tonight when it happened and I attempted another emergency landing I wasn\u0027t paying attention to my airspeed like I should\u0027ve been - it dropped down to 45 m/s (when the plane\u0027s takeoff speed is 120), it nosed down and I didn\u0027t have enough time to get the speed/nose back up at that point...\n\nOn the plus side, the spoiler/flap combination as an airbraking system works *great*.\n\nThe problems are with the main wings - I need a way to lower their location on the main fuselage while raising the CoL so the plane will stay stable. I\u0027d thought perhaps about making a \u0022gull-wing delta\u0022, bending the wing dihedral at about the midpoint of the span (or thereabouts) while lowering the position of the wing in relation to the fuselage. Would that work, or does anybody have a better suggestion?"}]}