{"TopicId":100549,"ForumId":55,"TopicTitle":"Some kind of distinction in the part selector for (active) contract related parts","CreatedByName":"Ricardo79","CreatedById":128863,"CreatedDateTime":"2015-02-23T19:31:06Z","PageNum":1,"Articles":[{"CreatedByName":"Ricardo79","CreatedById":128863,"CreatedDateTime":"2015-02-23T19:31:06Z","Content":"\n\u003Cp\u003EHi there.\u003C/p\u003E\u003Cp\u003EDear Squad,\u003C/p\u003E\u003Cp\u003EAs I get info in a support request thread from Sal_Vager on a \u0022bug\u0022 which turned out to be a feature... I\u0027d like to ask for a small change in it\u0027s work.\u003C/p\u003E\u003Cp\u003ERight now in 0.90 if you accept a part testing contract with a non researched part that is highlighted on the part selector inside VAB/SPH\u003C/p\u003E\u003Cp\u003ETHIS option is pretty usefull.\u003C/p\u003E\u003Cp\u003EAll I\u0027d like to ask to make a different distinction for the already researched parts to. Because IT IS make the actual part finding reasonable easy.\u003C/p\u003E\u003Cp\u003ESo maybe a different color, green or purple or whatever... Or just a mid noticeable frame/border around that part should be neat.\u003C/p\u003E\u003Cp\u003EThank you.\u003C/p\u003E\u003Cp\u003EHistory on this: I reported it as a bug about this effect not happening with all the parts, so sometime it is higlighted sometimes not... I thought it\u0027s is some kind of strange bug, related to something else (like mods).\u003C/p\u003E\u003Cp\u003Ethan Sal given me an answer about it highlights the \u0022experimental\u0022 parts. \u003C/p\u003E\u003Cp\u003ESo I just like to avoid public confusion on this matter \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E :D\u003C/p\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2015-02-23T20:50:00Z","Content":"\n\u003Cp\u003EIf I\u0027m reading this right, then the blue highlighting in the parts list appears for non-researched experimental parts that you need to test for a contract, but not for already-researched parts that you need to test for a contract, right?\u003C/p\u003E\u003Cp\u003EIf so, I agree - it\u0027d be nice to have the highlighting appear regardless of if the part is already researched or not.\u003C/p\u003E\n"},{"CreatedByName":"Ricardo79","CreatedById":128863,"CreatedDateTime":"2015-02-23T21:02:08Z","Content":"\n\u003Cp\u003EAbsolutely.\u003C/p\u003E\u003Cp\u003EThank you for make it clear, and understandable English.\u003C/p\u003E\u003Cp\u003EAnd I am glad to have someone on this side \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E .\u003C/p\u003E\n"}]}