{"TopicId":10063,"ForumId":16,"TopicTitle":"High elliptical orbits?","CreatedByName":"SpaceSmith","CreatedById":23693,"CreatedDateTime":"2012-05-01T04:03:31Z","PageNum":1,"Articles":[{"CreatedByName":"SpaceSmith","CreatedById":23693,"CreatedDateTime":"2012-05-01T04:03:31Z","Content":"So at first when I was working with basic vanilla parts, I was able to get rockets up into space and orbiting Kerbin in a fairly circular low orbit. I re installed the SundayPunch pack and am using it now to make more powerful complex things, mainly trying to get to the moon first, and am having trouble with when I launch, I am getting HIGHLY elliptical orbits around Kerbin, one that goes past the moon and then back again, to make it go circular Ive been waiting until Im at the AP and retro burning a bit and eventually I fix it but I want to know how to keep it from happening if I ever want a nice circular orbit, mainly for my satellites, also, what part pack could add a rover to build or use as well as a space shuttle ?? Thank you!"},{"CreatedByName":"Kosmo-not","CreatedById":14082,"CreatedDateTime":"2012-05-01T04:07:43Z","Content":"I would say keep an eye on the map view. Don\\\u0027t let it go into high orbits if you don\\\u0027t want it to."},{"CreatedByName":"SpaceSmith","CreatedById":23693,"CreatedDateTime":"2012-05-01T04:13:36Z","Content":"But the thing is I don\\\u0027t know how too. I mean my PE is super close to the planet but my AP is way away (well over 1mil KM sometimes) and idk how to correct this at launch, what I am doing is going straight up till about 50k meters then turning about 45 degrees to the planet surface and burning to add horizontal velocity, once I reach about 70k I turn a full 90 and burn the rest..I must be doing something wrong."},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2012-05-01T04:38:39Z","Content":"50km pitchover is way to high for what you want. Try starting to pitch over very little (~5 degrees) at ~10km, then try and smoothly bring the orientation horizontal by ~50-70km.\n\nDefinitely use the map view once you start getting above ~20km. Make sure to click the little icon at the bottom of the screen to bring up the navball and give you control in the map view (just remember that you can\\\u0027t stage in the map view). And always remember, you can cut the engines and just coast up to apoapsis to circularize the orbit. ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)"},{"CreatedByName":"togfox","CreatedById":17083,"CreatedDateTime":"2012-05-01T04:50:48Z","Content":"As you pitch over, watch your AP on map view and then stop when it gets to 100km (or whatever). You can then engine off and coast to that point and then circularise by raising your PE to match your AP. This is a standard maneuvor regardless of rocket design."},{"CreatedByName":"Misterspork","CreatedById":9507,"CreatedDateTime":"2012-05-01T04:51:34Z","Content":"\u003E \n\u003E But the thing is I don\\\u0027t know how too. I mean my PE is super close to the planet but my AP is way away (well over 1mil KM sometimes) and idk how to correct this at launch, what I am doing is going straight up till about 50k meters then turning about 45 degrees to the planet surface and burning to add horizontal velocity, once I reach about 70k I turn a full 90 and burn the rest..I must be doing something wrong.\n\nDon\\\u0027t try to do burn-to-orbit launches. As SOON as your AP is at the spot you want it at cut the engines. Then wait till you\\\u0027re at AP, then burn prograde to raise the PE."},{"CreatedByName":"SpaceSmith","CreatedById":23693,"CreatedDateTime":"2012-05-01T05:17:09Z","Content":"Ahhh okay. Thank you very much ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif) ANyone know where theres a tutorial for the sunday punch pack?? Im trying to figure out how to correctly use all these decoupling shrouds so I can protect the satellite I want to send into space!"},{"CreatedByName":"Zephram Kerman","CreatedById":15270,"CreatedDateTime":"2012-05-01T06:14:33Z","Content":"Not sure, but try looking in the download thread. Or just ask there.\n\nAlso, I think Sunday Punch pack is now obsolete and has been superseded by the Nova Punch pack. So if you\\\u0027re using an old pack, some of your issues might be version incompatibility. Someone please correct me if that\\\u0027s wrong."},{"CreatedByName":"SpaceSmith","CreatedById":23693,"CreatedDateTime":"2012-05-01T15:08:36Z","Content":"Really sorry, I meant Nova Punch, thats the one I have now ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)"}]}