{"TopicId":10069,"ForumId":39,"TopicTitle":"Kerbin Geographic And Science Society","CreatedByName":"togfox","CreatedById":17083,"CreatedDateTime":"2012-05-01T09:08:07Z","PageNum":18,"Articles":[{"CreatedByName":"ramipro","CreatedById":24316,"CreatedDateTime":"2012-10-06T11:53:36Z","Content":"\n\u003Cp\u003EAs of now, we are doing Kerbin, but we will later do the Mun and Minmus, so it shouldn\u0027t be bad to leave a satellite going so you don\u0027t have to launch another one later. And no, you don\u0027t need to leave KSP running forever; just make sure that you don\u0027t end the flight when you leave, just go to the space center.\u003C/p\u003E\n"},{"CreatedByName":"maro","CreatedById":31847,"CreatedDateTime":"2012-10-06T14:07:37Z","Content":"\n\u003Cp\u003EName a geographic feature\u003C/p\u003E\u003Cp\u003EName: Rimae Yuri Alekseyevich Gagarin \u003C/p\u003E\u003Cp\u003ELatitude: 56Ã‚Â°2\u0027 50\u0027\u0027 N\u003C/p\u003E\u003Cp\u003ELongitude: 39Ã‚Â° 1\u0027 31\u0027\u0027 E\u003C/p\u003E\u003Cp\u003EAltitude: ~1.000m\u003C/p\u003E\u003Cp\u003ECelestial body: Mun\u003C/p\u003E\u003Cp\u003EYuri Alekseyevich Gagarin was the first human leaving earths gravity as he completed an orbited of Earth with his Vostok 1 capsule on Apri 12th 1961.\u003C/p\u003E\u003Cp\u003EHe died on March 27th 1968 during a training flight with a MiG-15UTI at lat 56Ã‚Â° 2\u0027 48\u0027\u0027N lon 39Ã‚Â°1\u0027 35\u0027\u0027E. The cause of the crash is not entirely certain but complex meteorological conditions, outdated weather informations and supersonic air trafic nearby seems to be playing a part that Gagarin and his Flight Instructor Vladimir Seryogin where not able to recover from the super-critical flight regime they entered.\u003C/p\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2012-10-06T14:44:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AmpsterMan\u0022 data-cite=\u0022AmpsterMan\u0022\u003E\u003Cdiv\u003EOkay guys, would sending some data about Mun help? It , and Minmus, are currently the only places I can reliably get to. If you like, I can put a satellite up in orbit around it and start-a-mappin\u0027. Also, do I need to have KSP running continuously? or can I turn it off and continue at a later point?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGathering it certainly will help. Sending it, not so much, as I\u0027m concentrating on Kerbin right now. It\u0027s a little arbitrary of me, granted, but I\u0027m still not sure what sort of problems/limitations I\u0027m going to run into. Most of the big ones are out of the way (sorting and merging multiple data sources, and deleting duplicate data), but I could very well run into fundamentally limiting factors like how much time it takes to render these maps on an i7 processor. (I don\u0027t have access to computing time on anything more than my iMac, as much as it would be lovely to be able to run the raster map generator and projection modules on a supercomputer. I don\u0027t anticipate this being a serious limitation, though it may require that I leave my computer on and processing for many hours, or days.)\u003C/p\u003E\n"},{"CreatedByName":"ramipro","CreatedById":24316,"CreatedDateTime":"2012-10-08T16:17:04Z","Content":"\n\u003Cp\u003EUploading now a 1GB file to the folder. It will be done in a couple minutes\u003C/p\u003E\n"},{"CreatedByName":"Xen Zer0","CreatedById":38939,"CreatedDateTime":"2012-10-09T23:51:34Z","Content":"\n\u003Cp\u003EName a geographic feature\u003C/p\u003E\u003Cp\u003EName: Zachlandia\u003C/p\u003E\u003Cp\u003ELong: 16* 4\u0027 2\u0022 S\u003C/p\u003E\u003Cp\u003ELat: 38* 7\u0027 36\u0022 W\u003C/p\u003E\u003Cp\u003ECelestial Body: Kerbin\u003C/p\u003E\u003Cp\u003EA moderately sized Island on Kerbin. A resort populated by trees, rocket parts and occasional radioactive fallout from space.\u003C/p\u003E\u003Cp\u003EScreencaps to follow once i have the permissionz\u003C/p\u003E\n"},{"CreatedByName":"Tommygun","CreatedById":41293,"CreatedDateTime":"2012-10-10T06:43:32Z","Content":"\n\u003Cp\u003EThis is something I have been working on. I combined the data from the Kethane scanner with the ISA Mapper to produce this image.\u003C/p\u003E\u003Cp\u003EIt is now easier to see approximately where the kethane is (Dark Green) on a moon or planet. \u003C/p\u003E\u003Cp\u003EIf you want to try this out here is how I went about it:\u003C/p\u003E\u003Cp\u003EI used a photo editing program called Gimp to do this. \u003C/p\u003E\u003Cp\u003EI took the kethane data map and flip it top to bottom so the poles would match and resized it to match the ISA map.\u003C/p\u003E\u003Cp\u003EYou need to add a 1 pixel wide reference dot (Same color as the kethane dots) at each of the four corners of the kethane map, this is an important step, as you will need them to align the two maps later.\u003C/p\u003E\u003Cp\u003EThen I selected only the green on the kethane map and do a copy and paste to the ISA map.\u003C/p\u003E\u003Cp\u003EFinally I darkened the green, align the dots at the corners to the ISA map\u0027s corners and anchored it to the map.\u003C/p\u003E\u003Cp\u003EI don\u0027t have any vehicles on Laythe\u0027s surface right now to test it out, but I hope to soon.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1190.photobucket.com/albums/z446/Tomweave4/Misc%202/LaytheKethaneMap1600_zpsad2aced8.png\u0022 alt=\u0022LaytheKethaneMap1600_zpsad2aced8.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Grand Lander","CreatedById":31521,"CreatedDateTime":"2012-10-10T10:02:56Z","Content":"\n\u003Cp\u003E0.17 updates yet?\u003C/p\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2012-10-19T14:51:06Z","Content":"\n\u003Cp\u003ESo, I smushed together an image made from tommygun\u0027s, ramipro\u0027s, and my own data. The master file is now 2.85GB in size (that\u0027s enough to have caused OSX\u0027s Finder to throw a fit, meaning I\u0027ve disabled automatic file preview. O.o ).\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://docs.google.com/open?id=0B2PJawb6uwEMbElZWnRCQ3QxN2c\u0022 rel=\u0022external nofollow\u0022\u003EHere\u0027s the result, a 3600x1800 image.\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ENote that this is 1/10th the resolution of what a complete image of Kerbin would look like. We can do better, \u003Cstrong\u003Ea lot\u003C/strong\u003E better. I was happy with this though, namely because you can start to see null cells on the right side. (Crunching this thing through interpolation would take a lot of time for little reward, so I opt to prefer gathering more data over doing that with my CPU time. O.o ) Changing the colour map is a piece of cake and can be done very, very easily. As can adding contour lines (though I\u0027m having a tad bit of an issue getting GRASS GIS to export multiple raster layers to one file...I\u0027ll figure that one out eventually), which would be helpful since this map doesn\u0027t actually clearly depict sea level.\u003C/p\u003E\n"},{"CreatedByName":"Mastodon","CreatedById":57231,"CreatedDateTime":"2013-04-20T23:56:27Z","Content":"\n\u003Cp\u003EI am preparing to do a big write up on an ambitious expedition of mine and I would like to use the names already given on this forum to various features on the Mun. unfortunately, the links on the first page no longer work for me. does anyone have a map with place names labeled they could give to me?\u003C/p\u003E\n"},{"CreatedByName":"togfox","CreatedById":17083,"CreatedDateTime":"2013-04-24T01:53:42Z","Content":"\n\u003Cp\u003EThe names unfortunately exist in another thread that has been removed. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003EDespite all this no longer being maintained, I\u0027ll see if I can dig up an old backup. It will be a text file that perhaps someone can work with.\u003C/p\u003E\n"},{"CreatedByName":"togfox","CreatedById":17083,"CreatedDateTime":"2013-04-25T06:53:51Z","Content":"\n\u003Cp\u003E69.1 -112.38 160 the North Pit*®\u003C/p\u003E\u003Cp\u003E0.965 -129.638 160 Jeb\u0027s landing*®\u003C/p\u003E\u003Cp\u003E-2.833 -1.04333 160 Tantalus Crater®\u003C/p\u003E\u003Cp\u003E0.195 -75.336 2321 Mt. Craw\u003C/p\u003E\u003Cp\u003E70.1 52.3 3336 Mercator Highlands\u003C/p\u003E\u003Cp\u003E0.207 136.91 0 Targuete\u003C/p\u003E\u003Cp\u003E35.327 -47.734 0 Skywalkers Run\u003C/p\u003E\u003Cp\u003E49.95 18.599 340 Hawkinge Crater\u003C/p\u003E\u003Cp\u003E-74.49 -15.211 2386 Miners Rest\u003C/p\u003E\u003Cp\u003E0.688 23.433 450 Eagles Landing?\u003C/p\u003E\u003Cp\u003E-37 5 370 Armstrongs Crater?\u003C/p\u003E\u003Cp\u003E-4.336 86.984 300 Jeb Kerman Crater?\u003C/p\u003E\u003Cp\u003E-9.832 25.919 807 Kubrik Crater\u003C/p\u003E\u003Cp\u003E18.964 133.856 500 Owaku Crater?\u003C/p\u003E\u003Cp\u003E-18.4 65.8 500 K1\u003C/p\u003E\u003Cp\u003E-16.7 65 500 K2\u003C/p\u003E\u003Cp\u003ESorry about the formatting. First column is latitude (or is it longitude) and the second column is what the first column is not. The third column is the altitude of the feature followed by the name of the feature.\u003C/p\u003E\n"},{"CreatedByName":"Innuce","CreatedById":42593,"CreatedDateTime":"2013-05-13T22:01:55Z","Content":"\n\u003Cp\u003EI did a fun little experiment with my data. I sent a kerbal to set foot on the highest peak of Kerbin... Mount Kraken?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/hy-cEBfTFNY?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"Super 6-1","CreatedById":62499,"CreatedDateTime":"2013-05-14T17:08:30Z","Content":"\n\u003Cp\u003ESo is this just geology or can we submit some stuff about the stars?\u003C/p\u003E\n"},{"CreatedByName":"yithpistol","CreatedById":61110,"CreatedDateTime":"2013-06-05T21:23:01Z","Content":"\n\u003Cp\u003EIt\u0027s not just about geography. The word \u0022Science\u0022 is in the title of the organization so that tells me, at least, that any \u0027scientific\u0027 endeavor is welcome. While geography is a big part of the organizations activities it is by no means the only part.\u003C/p\u003E\u003Cp\u003EIt is too bad I discovered this now that it is no longer being maintained. It\u0027s a good idea, and sounds like fun. Maybe we can resurrect it?\u003C/p\u003E\u003Cp\u003ESo, we could begin with a member list, those interested in continuing the \u0027work\u0027 as it were. Then we\u0027ll know who is interested in being active and can go from there with suggestions for ideas for new activities. One possibility is an atmospheric pressure map of Kerbin (or any other planet with atmosphere). Even a gravioli map! Wherever there is data to be found. Wherever there is an instrument to measure it. Without a plugin to map this data, the initial maps will be low resolution. A division of labor could be discussed for individuals to map out areas with a resolution of one data point per 1km^2, or whatever. Then a csv could be compiled from that and rendered using the ISA map gen. \u003C/p\u003E\u003Cp\u003EOr however someone with a better idea would prefer it to be done.\u003C/p\u003E\u003Cp\u003EAnyway, if the founder of the KGSS is reading this, let\u0027s get some stuff going again. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"JacobT11","CreatedById":11673,"CreatedDateTime":"2013-06-05T22:26:11Z","Content":"\n\u003Cp\u003EI think it\u0027d be great to resurrect the Kerbin Geographic and Science Society. The last time I was really involved in KSP, before life got in the way, this thread was still alive and well. I always thought it was a great idea, but never had enough time to contribute. Now though, things have quietened down, and I\u0027d be more than happy to try and revive this.\u003C/p\u003E\n"},{"CreatedByName":"Bioman222","CreatedById":30364,"CreatedDateTime":"2013-06-05T23:36:17Z","Content":"\n\u003Cp\u003EYes, I would help too. I remember this thread. Good times, good times \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"togfox","CreatedById":17083,"CreatedDateTime":"2013-06-07T03:15:12Z","Content":"\n\u003Cp\u003EHello all KGSS founder here.\u003C/p\u003E\u003Cp\u003EThe KGSS has always been an \u0027open\u0027 society with it\u0027s roots in geography but doesn\u0027t exclude science in general.\u003C/p\u003E\u003Cp\u003EThis thread isn\u0027t being maintained by myself any more as the number of bodies and number of features introduced to the game became an administrative burden but if anyone is clever enough to turn this into a web page where users can submit screenshots, a name and co-ordinates and let people \u0027like\u0027 the submission then it becomes administrative free (mostly).\u003C/p\u003E\u003Cp\u003EJust to make all and sundry aware of some of the projects done in the name of the KGSS are:\u003C/p\u003E\u003Cp\u003ENanobots awry scenario, Minmus composition challenge, Neutrino part.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://kerbalspaceprogram.com/kgss-scenario-library/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/kgss-scenario-library/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EKGSS Journals\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/12752-Writing-KGSS-Journal-Volume-I-Edition-1\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/12752-Writing-KGSS-Journal-Volume-I-Edition-1\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/13950-Writing-KGSS-Journal-Volume-I-Edition-2\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/13950-Writing-KGSS-Journal-Volume-I-Edition-2\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/18463-KGSS-Journal-Volume-I-Edition-3\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/18463-KGSS-Journal-Volume-I-Edition-3\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThere have been user invented KGSS challenges\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/16000-KGSS-Examining-Kerbin-s-atmosphere\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/16000-KGSS-Examining-Kerbin-s-atmosphere\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/16502-KGSS-Satellite-Challenge\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/16502-KGSS-Satellite-Challenge\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnd a very lengthy (other) thread on naming Kerbin continents\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/12675-Invention-KGSS-Continent-Naming-Committee\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/12675-Invention-KGSS-Continent-Naming-Committee\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EMy point is that the KGSS is what you make of it and it need not stop if one person (me) takes a step back now and then. The KGSS is an idea - not a single project - and if you have an idea that fits within the KGSS goals (see first post):\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAnyone can participate in the fun the KGSS offers. The goals of the KGSS are:\u003C/p\u003E\u003Cp\u003E- to promote learning in game and in real life;\u003C/p\u003E\u003Cp\u003E- to encourage exploration and discovery;\u003C/p\u003E\u003Cp\u003E- to enrich KSP gaming by highlighting diverse mission objectives;\u003C/p\u003E\u003Cp\u003E- to engage the community for a richer experience for members and the KGSS;\u003C/p\u003E\u003Cp\u003E- to foster all the science disciplines without prejudice;\u003C/p\u003E\u003Cp\u003E- to challenge members to expand their mission repertoire.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E... then feel free to send me a message and I\u0027ll let you use the KGSS tag on your invention. Don\u0027t be constrained by past and previous endevours. If you have a fun and \u0027sciencey\u0027 idea and would like to tag it with KGSS - let me know and you\u0027ll almost certainly be allowed to do so. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E I only ask for a PM so I know its in line with the KGSS ideology and protects the KGSS brand everyone in this thread loves. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-07T03:17:21Z\u0022 title=\u002206/07/2013 03:17  AM\u0022 data-short=\u002211 yr\u0022\u003EJune 7, 2013\u003C/time\u003E by togfox\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Bioman222","CreatedById":30364,"CreatedDateTime":"2013-06-08T18:50:13Z","Content":"\n\u003Cp\u003EI think someone should make an inter-company sceince association, like KGSS, and all of KSP\u0027s fictional space agencies could get together and aquire information on all the planets. Ie. One week, we would work on Eve. In that week, one agency could map Eve, two could work on finding the average tempatures, two the atmosphereic density, etc. And with this we could form a giant database of information to give to the KSP wiki. Also, there would be no founders. It would be like the UN in a sense. However, one person would run the thread. So, anyone like this idea?\u003C/p\u003E\n"},{"CreatedByName":"Rareden","CreatedById":57466,"CreatedDateTime":"2013-06-15T03:38:20Z","Content":"\n\u003Cp\u003Eanyone got a elevation/topo map of moho?\u003C/p\u003E\n"},{"CreatedByName":"Tommygun","CreatedById":41293,"CreatedDateTime":"2013-06-15T04:35:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rareden\u0022 data-cite=\u0022Rareden\u0022\u003E\u003Cdiv\u003Eanyone got a elevation/topo map of moho?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYour best bet is to PM Saik0:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/25148-Web-maps-of-all-bodies-%280-4-ALL-bodies-mapped!%29?highlight=bodies\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/25148-Web-maps-of-all-bodies-%280-4-ALL-bodies-mapped!%29?highlight=bodies\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Innuce","CreatedById":42593,"CreatedDateTime":"2013-06-20T15:05:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tommygun\u0022 data-cite=\u0022Tommygun\u0022\u003E\u003Cdiv\u003EYour best bet is to PM Saik0:\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/25148-Web-maps-of-all-bodies-%280-4-ALL-bodies-mapped!%29?highlight=bodies\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/25148-Web-maps-of-all-bodies-%280-4-ALL-bodies-mapped!%29?highlight=bodies\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUnfortunately, they\u0027re only images, no data like a csv file.\u003C/p\u003E\n"},{"CreatedByName":"Spartwo","CreatedById":58131,"CreatedDateTime":"2013-06-21T11:48:30Z","Content":"\n\u003Cp\u003EI would like to name the left half of the ice lake furthest to the right\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://wiki.kerbalspaceprogram.com/w/images/thumb/e/e7/Min_color.png/800px-Min_color.png\u0022 alt=\u0022800px-Min_color.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI have set up two bases a rover facility and was the place of my first manned landing\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/R5eme2Y.png?1\u0022 alt=\u0022R5eme2Y.png?1\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt is at co-ords 0N 358W\u003C/p\u003E\u003Cp\u003EI wish to name it rover reef after the old landing gear rovers.\u003C/p\u003E\u003Cp\u003EEDIT:am I doing this right?\u003C/p\u003E\n"},{"CreatedByName":"RockyTV","CreatedById":57161,"CreatedDateTime":"2013-06-24T16:58:06Z","Content":"\n\u003Cp\u003EI\u0027d like to be a volunteer.\u003C/p\u003E\n"},{"CreatedByName":"Kerbal01","CreatedById":57322,"CreatedDateTime":"2013-06-24T17:08:18Z","Content":"\n\u003Cp\u003EIs there going to Be another journal?\u003C/p\u003E\n"},{"CreatedByName":"RockyTV","CreatedById":57161,"CreatedDateTime":"2013-06-27T17:26:19Z","Content":"\n\u003Cp\u003Eerr... bump?\u003C/p\u003E\n"}]}