{"TopicId":100615,"ForumId":16,"TopicTitle":"Rockets Are Stuck in Constant Yaw Left","CreatedByName":"Jibbs","CreatedById":138614,"CreatedDateTime":"2015-02-24T16:45:34Z","PageNum":1,"Articles":[{"CreatedByName":"Jibbs","CreatedById":138614,"CreatedDateTime":"2015-02-24T16:45:34Z","Content":"First of all, I am using FAR and mods that add additional parts such as Nova Punch. I have read up many hours on rocket design in FAR and things such as keeping the center of mass and lift in the right place are common knowledge to me. However, when I am launching a simple rocket (Long rocket 11m high with 2 stages and 4 vertical stabilizers at the bottom) it will begin slowly banking left to the 270, staying in the prograde vector while I touch nothing. No amount of turning or trim will correct this. This problem exists regardless of SAS and regardless of whether I use a pilot or not. Am I doing something wrong or is this a bug? They say to build rockets that look like they will fly in real life in FAR and this looks fine to me....\n\nThis is an example, however many rockets of similar design (using stock parts) have this issue.\n\n[http://steamcommunity.com/sharedfiles/filedetails/?id=398291623](http://steamcommunity.com/sharedfiles/filedetails/?id=398291623)"},{"CreatedByName":"Wercho","CreatedById":57663,"CreatedDateTime":"2015-02-25T01:33:54Z","Content":"Hmm. I can\u0027t tell exactly, but I suspect the problem is that due to a quirk of the physics engine, symmetrically placed parts sometimes behave a tiny bit differently, so you get a tiny pull to the left. This is compounded by the fact that with that ring thing and the goo containers hanging off the side, the top of your rocket will have a lot of drag making it want to flip.\n\nNow, why can\u0027t you fix it? I think it is because your tailfins are HUGE for that rocket, and it doesn\u0027t look like they are control surfaces. Do you have access to the AV-R8 fins, or other full control surfaces? If so, swap your fins out for those and see if it helps. If not, I\u0027d actually just remove the fins and rely on the pods torque, but keep it very straight or you\u0027ll flip out. You might consider moving the goo containers lower to move the drag backwards on the rocket if you do that."},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2015-02-25T05:29:55Z","Content":"Start with the obvious stuff: is your joystick calibrated and centered?"},{"CreatedByName":"LordFjord","CreatedById":97341,"CreatedDateTime":"2015-02-25T09:12:45Z","Content":"Maybe you accidentally set up trimming? In your screenshot, were you controlling the rocket at that moment or not? Because in the lower left corner, the controls show that something was steering or the trimming was set up.\n\nTry to hit ALT-X to reset the trim."},{"CreatedByName":"bakanando","CreatedById":126310,"CreatedDateTime":"2015-02-25T18:35:38Z","Content":"I have had the same thing happen with stock rockets, it seems it\u0027s a bug with the new SAS handling or a unmentioned change they did to stock atmo. Rockets will stay prograde no matter what and eventually crash. It happened with piloted ships, and a couple probes too."},{"CreatedByName":"WhiteKnuckle","CreatedById":101722,"CreatedDateTime":"2015-02-25T20:52:52Z","Content":"\u003E \n\u003E I have had the same thing happen with stock rockets, it seems it\u0027s a bug with the new SAS handling or a unmentioned change they did to stock atmo. Rockets will stay prograde no matter what and eventually crash. It happened with piloted ships, and a couple probes too.\n\nDo you have the SAS set to prograde rather than heading?"},{"CreatedByName":"Randazzo","CreatedById":136468,"CreatedDateTime":"2015-02-25T21:48:26Z","Content":"You do not appear to have any control authority over the craft if you\u0027re doing a full eastward input and it\u0027s still yawing west. \n\nThis does not necessarily mean it is unbalanced, but the pod has too little reaction wheel oomph to fight against the fins, which really only make it harder to change your heading. The natural drift of a rocket from KSC is to the west anyway. ([Look at Renegrades post here for a great illustration](https://forum.kerbalspaceprogram.com/threads/111625-When-do-you-begin-your-gravity-turn?p=1755466\u0026viewfull=1#post1755466))\n\nYou either need to make those fins into control surfaces, or add some reaction wheels.\n\n**Edited \u003Ctime datetime=\u00222015-02-25T21:52:04Z\u0022 title=\u002202/25/2015 09:52  PM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 25, 2015\u003C/time\u003E by Randazzo**"}]}