{"TopicId":100795,"ForumId":69,"TopicTitle":"Cannot download on weak connection - 403 Forbidden","CreatedByName":"rectifier","CreatedById":138727,"CreatedDateTime":"2015-02-26T18:07:26Z","PageNum":1,"Articles":[{"CreatedByName":"rectifier","CreatedById":138727,"CreatedDateTime":"2015-02-26T18:07:26Z","Content":"Hi guys,\n\nI live in a rural area and have absolute GARBAGE internet via satellite. It is slow, lossy, and when it does work, is throttled by an unknown method that often breaks TCP connections.\n\nHowever, I downloaded the demo with no problems via the torrent in about 4 hours.\n\nUnfortunately, after paying my money, I cannot get the full version to download from the site.\n\nI\u0027m using DownThemAll on Firefox for the resume support and ease of use. But it cannot resume. When the connection drops a few minutes in, I get a 403 when it tries to pick back up. I\u0027ve also experienced some weird \u0022size mismatch\u0022 errors that I\u0027ve never seen.\n\nI tried using the old standby of wget but it will give me a 403 right off the start. Seems some kind of security is getting in the way.\n\nI\u0027m in the unfortunate situation where I am tempted to download an \u0022unauthorised\u0022 copy via torrent despite having paid for the software! However, I feel like doing things the right way. Can you guys help me out?\n\nThanks for making a game that actually works under Linux by the way. Unfortunately I am downloading the full version for Windows because I have an ATI card, and the framerate is poor. Keep up the good work, as my next card will be NVidia for sure!"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-02-26T18:13:43Z","Content":"Hi rectifier, please don\u0027t go down *that* route, I don\u0027t know how to fix your internet but maybe someone will have a idea, and *that* kind of \u0022distribution\u0022 isn\u0027t allowed to be discussed here.\n\nYou could try downloading it at another location, there is no DRM tying KSP to a machine so you can pop it on a USB stick and take it with you."},{"CreatedByName":"rectifier","CreatedById":138727,"CreatedDateTime":"2015-02-26T19:28:32Z","Content":"Unfortunately we all use the same bogus ISP out here. It\u0027s all we have. Only other download site is to attempt at the library in town, which is not open until Monday and a half-hour\u0027s drive away.\n\nProbably makes more sense to try to get the resume support working properly.\n\nDoing some more experimentation with wget I need more information as to how the authentication works. I tried wget --load-cookies using cookies copied from firefox and still got a 403. Tried using basic auth to no avail. Looks like it will be a pain to download with wget unless more information is supplied, so I will have to use a plugin-based download manager.\n\nIt must be that the authentication does not carry over to DownThemAll for some reason. Perhaps I need to try another plugin-based download manager."},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-02-26T19:32:15Z","Content":"I have heard that DownThemAll can fail with KSP so it may be worth trying another download manager.\n\nThere is a [**patcher**](http://wiki.kerbalspaceprogram.com/wiki/Patcher) for KSP that can resume after a failed or interrupted download, it\u0027s worth a try ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"lokinghon","CreatedById":138731,"CreatedDateTime":"2015-02-26T20:53:37Z","Content":"maybe download the game thru steam? They support all kind of fancy reconnects"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-02-26T20:56:18Z","Content":"I don\u0027t think it\u0027s posible to convert a store purchase to Steam anymore, that was a pre-Steam release thing."},{"CreatedByName":"rectifier","CreatedById":138727,"CreatedDateTime":"2015-02-26T21:41:51Z","Content":"I think the patcher can only repair a damaged install, so that would mean my zip would have to be good enough to unzip something. Previously I could only get about 2MB before failure.\n\nRegarding Steam, I\u0027m really impressed that Squad would make KSP available for regular download with no DRM. So I decided to give the money right to them and not to a middleman, we\u0027ve got to encourage this kind of release!\n\nThe other problem with Steam (and XBL Arcade for that matter) is wanting to download big updates before you can do anything, and doing them as full replacements instead of patches. And doing so in a non-resumable manner! Yes, out here 200MB is a big update ![:(](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif) My Xbox lives disconnected from the internet unless I want to download a new game from XBL Arcade. Then I set it up and leave it overnight (or worse) to pull all of the updates before I can download the game!\n\nSo, I used FlashGot to pass the download link with cookies/auth to wget and it is running. I find wget is much more forgiving of long spans of packet loss than most downloaders and so far I have received 30MB. If it does drop out, I at least have a partial file that I can try to pass with wget -c.\n\nOnly 8 hours before I can play, barring any dropouts. Yay!\n\nSo, don\u0027t use DownThemAll to get KSP."},{"CreatedByName":"Deddly","CreatedById":62955,"CreatedDateTime":"2015-02-26T21:46:39Z","Content":"\u003E \n\u003E I don\u0027t think it\u0027s posible to convert a store purchase to Steam anymore, that was a pre-Steam release thing.\n\nI just checked on my account on the KSP store and I can confirm that the option to transfer to Steam is still available. I haven\u0027t clicked on it (don\u0027t use Steam) but it\u0027s definitely there."},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-02-26T21:52:28Z","Content":"It\u0027ll be there for purchasers prior to the May 2013 cutoff, after that I don\u0027t know."},{"CreatedByName":"rectifier","CreatedById":138727,"CreatedDateTime":"2015-02-27T02:12:19Z","Content":"Still coming along. So it dropped connection 233MB in, threw a 403 and died. Unfortunately, the incomplete file had the token name in the filename, so I couldn\u0027t just try to restart it (though flashgot automatically passes -c, the filename has changed.)\n\nAre you kidding, Flashgot has no documented option to set the output filename!\n\nSo I had to:\n\n- rename partial file to ~/Downloads/ksp.zip\n\n- login to kerbalspaceprogram.com with Firefox\n\n- right-click -\u003E Flashgot link\n\n- Ctl-C to immediately kill the script it starts running\n\n- find the script (flashgot-\\*.fgt) in the directory set as temp\n\n- chop off everything but the wget command, add \u0022-O ~/Downloads/ksp.zip\u0022\n\n- run the script before something changes!\n\nIt picked back up and we are trucking along with 5hrs remaining. Hopefully I don\u0027t have to do this too many more times. Good thing it\u0027s winter and I have time to .... around with stuff like this!\n\nThe problem is that kerbalspaceprogram.com is just not set up for resuming of these downloads, especially when the download speed is slow. When it tries to resume, the cookies have already gone stale, and the server throws 403 Forbidden. Perhaps it should be fixed, but there are just not that many of us out there on poor connections these days."},{"CreatedByName":"RocketPilot573","CreatedById":62803,"CreatedDateTime":"2015-02-27T04:15:09Z","Content":"\u003E \n\u003E **I think the patcher can only repair a damaged install**, so that would mean my zip would have to be good enough to unzip something. Previously I could only get about 2MB before failure.\n\u003E Regarding Steam, I\u0027m really impressed that Squad would make KSP available for regular download with no DRM. So I decided to give the money right to them and not to a middleman, we\u0027ve got to encourage this kind of release!\n\u003E \n\u003E The other problem with Steam (and XBL Arcade for that matter) is wanting to download big updates before you can do anything, and doing them as full replacements instead of patches. And doing so in a non-resumable manner! Yes, out here 200MB is a big update ![:(](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif) My Xbox lives disconnected from the internet unless I want to download a new game from XBL Arcade. Then I set it up and leave it overnight (or worse) to pull all of the updates before I can download the game!\n\u003E \n\u003E So, I used FlashGot to pass the download link with cookies/auth to wget and it is running. I find wget is much more forgiving of long spans of packet loss than most downloaders and so far I have received 30MB. If it does drop out, I at least have a partial file that I can try to pass with wget -c.\n\u003E \n\u003E Only 8 hours before I can play, barring any dropouts. Yay!\n\u003E \n\u003E So, don\u0027t use DownThemAll to get KSP.\n\nCan the patcher not install the entire KSP? Last I checked it searches for missing files and downloads them. So it should be able to do a complete install."},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-02-27T13:45:00Z","Content":"The patcher can download the whole game, just run it in an empty folder, it\u0027ll see that *all* the files need to be \u0022replaced\u0022 ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"rectifier","CreatedById":138727,"CreatedDateTime":"2015-02-27T17:22:15Z","Content":"Hmm, should have done that. I didn\u0027t look into the patcher much in detail as I assumed it would authenticate against an existing copy of the game. When I read in detail I realized you have to provide credentials for it to log in.\n\nIn any case I now have my copy of KSP, it only took 5 re-login and resume attempts. From here on out I will use the patcher to keep it up to date! Thanks"},{"CreatedByName":"Deddly","CreatedById":62955,"CreatedDateTime":"2015-02-27T17:34:08Z","Content":"Well done Rectifier! Looking forward to seeing your results in the future =)"},{"CreatedByName":"rectifier","CreatedById":138727,"CreatedDateTime":"2016-02-05T01:03:44Z","Content":"A year later I\u0027m reviving this thread for the same issue. As a farmer I mostly play KSP in the winter, which means I now want to update to 1.0.5 instead of my old copy of 0.90.\n\nUnfortunately, the patcher is now dead (killed?). Are there any plans to revive the patcher in the near future, or should I go through this tedious procedure again? Or, is there a set of patches I can download and apply to 0.90?"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2016-02-05T03:29:45Z","Content":"\u003E \n\u003E \n\u003E 2 hours ago, rectifier said:\n\u003E \n\u003E \n\u003E A year later I\u0027m reviving this thread for the same issue. As a farmer I mostly play KSP in the winter, which means I now want to update to 1.0.5 instead of my old copy of 0.90.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Unfortunately, the patcher is now dead (killed?). Are there any plans to revive the patcher in the near future, or should I go through this tedious procedure again? Or, is there a set of patches I can download and apply to 0.90?\n\u003E \n\nYou probably should have just made a new thread, but there has to be a way to fix it.  It might just the the internet being the internet."},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2016-02-05T09:47:29Z","Content":"There are plans to revive the patcher, I\u0027m hoping it\u0027ll work for 1.1 as unfortunately Squad is averse to separate patches."}]}