{"TopicId":100773,"ForumId":55,"TopicTitle":"KSP needs at least 1.000.000x time warp","CreatedByName":"dfg26","CreatedById":119828,"CreatedDateTime":"2015-02-26T12:14:07Z","PageNum":1,"Articles":[{"CreatedByName":"dfg26","CreatedById":119828,"CreatedDateTime":"2015-02-26T12:14:07Z","Content":"Simple as that. It can be quite tiresome to wait during 3\u002B year interplanetary transfers, for example, even at 100k time warp."},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-02-26T12:34:44Z","Content":"I believe things can go kind of...wonky at that kind of speed. I don\u0027t think the dev limits the time warp because they want you to wait, but because there are certain limits to keep before things go out of whack."},{"CreatedByName":"dfg26","CreatedById":119828,"CreatedDateTime":"2015-02-26T12:42:06Z","Content":"I thought some mods included higher time warps which worked ok but I could be wrong."},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2015-02-26T12:49:50Z","Content":"Even with the way things are now, things can get wonky. At the 100k warp, ships can pass right through planetary bodies. After the \u0022warp to\u0022 feature is made stock in 1.0, it would be nice to get higher warp levels without having to mod the game. It would also be nice to have some safety checks hardcoded into the game too. What I mean by this is say for instance you are shooting for a aerobraking maneuver at Duna. Before the warp is even initiated, the game should check for what date and time is currently predicted for an encounter with Duna\u0027s atmosphere. Then, create a node, either hidden or visible based on user preference, so that the game knows it has to reduce warp to make sure it doesn\u0027t warp right through the atmosphere, or collide with Ike, or get slung out into no man\u0027s land. This is a doable thing I would think."},{"CreatedByName":"michaelsteele3","CreatedById":127113,"CreatedDateTime":"2015-02-26T13:16:14Z","Content":"KSP Already has X1 time warp.\n\n![:cool:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif) del wit it"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-02-26T13:21:08Z","Content":"I am not 100% sure but I believe if everything you have in the game is in stable orbits that have 0% chance of intersecting another SOI **EVER**, then any level of time warp works. Ships on rails are in fact on rails.\n\nHowever at high time warp (and the Dr. Evil level of one meeelion time warp is quite high), no ship would survive any SOI change. At best (and most likely) it\u0027d simply miss it. At worst (which means this is what will actually happen) you\u0027ll exit time warp to find your ship is ejecting from the system at several times the speed of light."},{"CreatedByName":"cicatrix","CreatedById":120831,"CreatedDateTime":"2015-02-26T13:37:58Z","Content":"This can be changed - if you know how much time you need to skip, the program should simply calculate the new epochs of the orbits for the objects \u0027on rails\u0027 and simply \u0027teleport\u0027 them to their new locations."},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2015-02-27T03:18:22Z","Content":"There are some subjects which have already been suggested so many times over the years that they\u0027ve been added to our [list of things not to suggest](https://forum.kerbalspaceprogram.com/threads/36863-What-not-to-suggest)again. This doesn\u0027t mean that those things can\u0027t happen; just that they\u0027ve already been discussed to death. Please look this list over before submitting suggestions."}]}