{"TopicId":100849,"ForumId":39,"TopicTitle":"\u0026amp; [Writing] Kerbonauts","CreatedByName":"jamqdlaty","CreatedById":88293,"CreatedDateTime":"2015-02-27T10:27:19Z","PageNum":1,"Articles":[{"CreatedByName":"jamqdlaty","CreatedById":88293,"CreatedDateTime":"2015-02-27T10:27:19Z","Content":"\n\u003Cp\u003EHi.\u003C/p\u003E\u003Cp\u003EPersonally I\u0027m annoyed by today\u0027s world \u0022problems\u0022 and some people\u0027s stupidity, both slowing our tech development down. I\u0027d like to think that I and you, as KSP community, have some above average understanding of the world\u0027s events, quite undisturbed by media.\u003C/p\u003E\u003Cp\u003ELately I came up with an idea of a comics based on KSP. I\u0027d like to create something funny, yet dramatic and interesting. Large part of the comics would be a satire of our own world mixed with KSP styled humour. Bill and Bob may not look like they do in game, but... You need to be able to tell them from each other. And yes, Bob is white. But that doesn\u0027t mean he\u0027s any worse, does it? You racist...\u003C/p\u003E\u003Cp\u003ESo... If enough people like the first page, I\u0027ll continue delivering you the story. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Creating that page took me about 10 hours, so don\u0027t expect more than a page for 1 or 2 weeks.\u003C/p\u003E\u003Cp\u003EPS: It would be nice if some native speaker with good knowledge of english language wanted to help me with writing. There are probably some mistakes on the first page.\u003C/p\u003E\u003Cp\u003ESo, here it is. Kerbonauts, page 1:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://fc07.deviantart.net/fs70/f/2015/058/3/4/kerbonauts_page_1_by_jamqdlaty-d8joldr.png\u0022 alt=\u0022kerbonauts_page_1_by_jamqdlaty-d8joldr.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Yukon0009","CreatedById":109376,"CreatedDateTime":"2015-02-27T10:45:27Z","Content":"\n\u003Cp\u003EAlthough swear words, I like this!\u003C/p\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-02-27T18:24:58Z","Content":"\n\u003Cp\u003EWot is this? It feels like it might be a contunation of Kerbal COmics, when Jeb got fired.\u003C/p\u003E\n"},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2015-02-27T19:02:44Z","Content":"\n\u003Cp\u003EDon\u0027t think the mods will be happy about swearing... but Im listening. Oh well, IBTL at least.\u003C/p\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-03-03T02:26:04Z","Content":"\n\u003Cp\u003EI just realized that without the A, Jeb\u0027s Junkyard becomes Jeb\u0027s Junky R\u0026amp;D.\u003C/p\u003E\n"},{"CreatedByName":"longbyte1","CreatedById":17521,"CreatedDateTime":"2015-03-03T02:40:54Z","Content":"\n\u003Cp\u003EWell, this sounds like a nice alternate story for Jeb, the \u0022outcast\u0022 from Kerbal society.\u003C/p\u003E\n"}]}