{"TopicId":100996,"ForumId":70,"TopicTitle":"Joystick support","CreatedByName":"Joshua A.C. Newman","CreatedById":137169,"CreatedDateTime":"2015-03-01T05:24:58Z","PageNum":1,"Articles":[{"CreatedByName":"Joshua A.C. Newman","CreatedById":137169,"CreatedDateTime":"2015-03-01T05:24:58Z","Content":"\n\u003Cp\u003EI\u0027m on a Mac Powerbook of a few years\u0027 vintage. I have a Saitek Cyborg 3D USB of even more venerable age.\u003C/p\u003E\u003Cp\u003EKSP is interpreting all of my axes as off by something like 30Ã‚Â°. Is there something I can do to calibrate?\u003C/p\u003E\u003Cp\u003EIt seems like it might not be actual calibration, as the endpoints are right. It\u0027s just the center that\u0027s off. So tilting the joystick (say) right rolls it more than if I tilt left.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Master Tao","CreatedById":110410,"CreatedDateTime":"2015-03-01T16:51:05Z","Content":"\n\u003Cp\u003EI believe Mac OS X chooses the neutral point for axes when you plug the joystick in. Have you tried unplugging, centering, and replugging the joystick?\u003C/p\u003E\u003Cp\u003EHow does it work in other games?\u003C/p\u003E\u003Cp\u003EWhat other information can you provide about your laptop?\u003C/p\u003E\u003Cp\u003EDoes the joystick work correctly in a fresh, stock install of KSP?\u003C/p\u003E\u003Cp\u003EPlease also provide a copy of your Player.log. Read the [thread=92229]How to Get Support[/thread] sticky to find it.\u003C/p\u003E\n"},{"CreatedByName":"Joshua A.C. Newman","CreatedById":137169,"CreatedDateTime":"2015-03-02T16:05:28Z","Content":"\n\u003Cp\u003ESolved! I mucked around until I found \u003Ca href=\u0022http://www.orderedbytes.com/controllermate/\u0022 rel=\u0022external nofollow\u0022\u003EControllerMate\u003C/a\u003E, which let me calibrate to quite a fine degree by make a virtual controller operated by the real joystick. The centers were WAY off, and they seem to have 128 points, not 256, which means that the band is only half as wide as the game is expecting. The calibration blocks let you set range, center, and deadband, and then you set sensitivity in KSP (I found that things were absurdly jittery if sensitivity was much higher than 60%.)\u003C/p\u003E\u003Cp\u003EThanks, Master Tao!\u003C/p\u003E\n"}]}