{"TopicId":100904,"ForumId":32,"TopicTitle":"Squadcast Summary (2015-02-28) - Insert-Witty-Edition-Title-Here Edition","CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2015-02-28T01:45:37Z","PageNum":3,"Articles":[{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-02-28T15:09:01Z","Content":"\u003E \n\u003E Nerfing? It needs buffing because it\u0027s actually underpowered.\n\nI think it will be more competitive when thrust scaling is introduced, it will have almost all of its thrust available at sea level.\n\nHistorical note: The aerospike has already been nerfed, it used to be 48-7S-level overpowered."},{"CreatedByName":"Harry Rhodan","CreatedById":119953,"CreatedDateTime":"2015-02-28T15:09:08Z","Content":"\u003E \n\u003E I wonder what happens if you put a kerbal under thr drill....\n\nSoylent green."},{"CreatedByName":"Arsonide","CreatedById":32604,"CreatedDateTime":"2015-02-28T16:09:54Z","Content":"\u003E \n\u003E My concern is this though. I see with the contract system that the rescue missions could take place on other planets. Will those contracts take into account whether or not I have landed on said body? For example, I get a contract to rescue Bilbo Kerman from Duna....but my space program at the time had not been to Duna. Well that doesn\u0027t make much sense.\n\u003E I\u0027m sure I\u0027m overthinking it, but I don\u0027t think Kerbals can teleport, and it would take away the sense of accomplishment for reaching that planet or moon for the first time.\n\nOverthinking is not a word in the Kerbal vocabulary!"},{"CreatedByName":"klgraham1013","CreatedById":105132,"CreatedDateTime":"2015-02-28T16:38:10Z","Content":"So, that other invisible space program is now stranding Kerbals on Duna."},{"CreatedByName":"LABHOUSE","CreatedById":107761,"CreatedDateTime":"2015-02-28T16:48:25Z","Content":"Wow, I remember suggesting tourism contracts...\n\nI wish resources could be turned into xeon."},{"CreatedByName":"Daze","CreatedById":57997,"CreatedDateTime":"2015-02-28T16:52:41Z","Content":"\u003E \n\u003E Nerfing? It needs buffing because it\u0027s actually underpowered.\n\nExactly.\n\n\u003E \n\u003E So, that other invisible space program is now stranding Kerbals on Duna.\n\nAhaha i would love too to see others space agency to compete with"},{"CreatedByName":"pokeman","CreatedById":19553,"CreatedDateTime":"2015-02-28T17:12:21Z","Content":"Interplanetary surface rescues will potentially give another reason to use rovers in certain circumstances so that\u0027ll be nice."},{"CreatedByName":"pincushionman","CreatedById":98495,"CreatedDateTime":"2015-02-28T17:12:57Z","Content":"\u003E \n\u003E ...Ahaha i would love too to see others space agency to compete with\n\nIt could give some incentive to put up with the insane \u0022test parts in X condition\u0022 contracts I see a lot of hate for here...\u0022You don\u0027t want to do our BS parts tests? Okay, how about you other guys! You will? Great! You\u0027ll get first dibs on our lucrative \u0027explore [body] for [insert science/resource/stranded guy] contract!\u0027 This will be a wonderful partnership!\u0022\n\n...but that\u0027s a discussion for a whole \u0027nother thread."},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2015-02-28T17:47:01Z","Content":"\u003E \n\u003E I think [the aerospike] will be more competitive when thrust scaling is introduced, it will have almost all of its thrust available at sea level.\n\nNot sure of that. I think thrust scaling will make boosters even more popular / necessary to provide some initial TWR until the main thrusters can continue on their own. But as we know, that happens quite early: ISP-wise, the KR-2L / Poodle class overtakes the Mainsail/LV-T30 class engines somewhere around 5000m. The lower atmosphere doesn\u0027t last long even with the current soupmosphere; with the new atmo, I expect that the new best rockets will start out somewhere in the 1.2 range and will reach 5km just as quickly as a TWR2 model does now."},{"CreatedByName":"deadshot462","CreatedById":13659,"CreatedDateTime":"2015-02-28T17:52:37Z","Content":"Not a fan of the lines on the map view. I don\u0027t see any advantages to this setup.\n\nDon\u0027t know why Squad isn\u0027t going with the original resource mapping from 2013:\n\n![Qu8sUHm.png](http://i.imgur.com/Qu8sUHm.png)"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-02-28T18:07:37Z","Content":"\u003E \n\u003E It could give some incentive to put up with the insane \u0022test parts in X condition\u0022 contracts I see a lot of hate for here...\n\nTruly, forcing terrible gameplay on the player is the way forward for KSP."},{"CreatedByName":"Robotengineer","CreatedById":104525,"CreatedDateTime":"2015-02-28T18:09:18Z","Content":"The old map looks worse than the raster lines IMO. I would prefer a Kethane style overlay, I always preferred the way you can only mine Kethane in certain places compared to where you can mine pretty much anywhere with Karbonite."},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2015-02-28T18:54:59Z","Content":"\u003E \n\u003E The old map looks worse than the raster lines IMO. I would prefer a Kethane style overlay, I always preferred the way you can only mine Kethane in certain places compared to where you can mine pretty much anywhere with Karbonite.\n\nInfo is a bit out of date RE Karbonite - it\u0027s biome based, which generally leads to tears of sadness when someone gets bad luck with the RNG on minmus and ends up with Karbonite only on the slopes ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2015-02-28T19:47:05Z","Content":"\u003E \n\u003E Not sure of that. I think thrust scaling will make boosters even more popular / necessary to provide some initial TWR until the main thrusters can continue on their own. But as we know, that happens quite early: ISP-wise, the KR-2L / Poodle class overtakes the Mainsail/LV-T30 class engines somewhere around 5000m. The lower atmosphere doesn\u0027t last long even with the current soupmosphere; with the new atmo, I expect that the new best rockets will start out somewhere in the 1.2 range and will reach 5km just as quickly as a TWR2 model does now.\n\nLarge solid boosters are very cheap, if you cluster them two or more on a decopler they are even cheaper as the decopler and seperators cost funds too.\n\nIn 1.0 it might be smarter to mount the SRB flush with the core using the decoplers. this will put them in the drag shadow of the fairing, just tested it with seperatrons on the core and it worked well. \n\nThis was the standard 4 long SBR, 1.5 orange tanks with skipper and 18 ton payload, has enough dV to return to KCS. 6 around an 2.5 meter tank or 8 around 3.75 should also work well. \n\nMain issue with SRB is the burn profile with increasing TWR in the soup atmosphere, With higher terminal speed higher TWR at launch will be more important."},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-02-28T20:06:27Z","Content":"\u003E \n\u003E [http://i.imgur.com/Y35K21h.png](http://i.imgur.com/Y35K21h.png)\n\n\u003E \n\u003E Not a fan of the lines on the map view. I don\u0027t see any advantages to this setup.\n\u003E Don\u0027t know why Squad isn\u0027t going with the original resource mapping from 2013:\n\u003E \n\u003E [http://i.imgur.com/Qu8sUHm.png](http://i.imgur.com/Qu8sUHm.png)\n\nFirst off, I like both. I also like how MapResourceOverlay does it. I\u0027m pretty easy going though so long as the info is readily available. I see no reason to not expect modders to have half a dozen different map types available within a few days of 1.0 dropping.\n\nSecondly, I\u0027m intrigued by how these two globes, separated by years, developers, and design paradigms, are of almost exactly the same spot in space over Kerbin."},{"CreatedByName":"SpaceXray","CreatedById":113396,"CreatedDateTime":"2015-02-28T21:42:11Z","Content":"Funny how no one is excited that now you can order a 3D print of a ship of your choice by uploading a .craft file..."},{"CreatedByName":"Robotengineer","CreatedById":104525,"CreatedDateTime":"2015-02-28T21:48:01Z","Content":"\u003E \n\u003E Funny how no one is excited that now you can order a 3D print of a ship of your choice by uploading a .craft file...\n\nThat\u0027s because it\u0027s so freaking expensive..."},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2015-02-28T22:06:45Z","Content":"\u003E \n\u003E That\u0027s because it\u0027s so freaking expensive...\n\nAnd the fact that stock parts are, in general, not that good looking. Until it has support for a load of mods, I\u0027m not interested."},{"CreatedByName":"basic.syntax","CreatedById":109920,"CreatedDateTime":"2015-02-28T22:14:12Z","Content":"I think the idea is cool, costs are high. Costs make sense because the machines are very expensive. But this is wrong thread for 3d printing, there\u0027s 24 comment pages [over here](https://forum.kerbalspaceprogram.com/threads/111593-The-Rocket-Printing-Hype-Train-Thread) ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)"},{"CreatedByName":"klgraham1013","CreatedById":105132,"CreatedDateTime":"2015-02-28T22:25:23Z","Content":"\u003E \n\u003E And the fact that stock parts are, in general, not that good looking. Until it has support for a load of mods, I\u0027m not interested.\n\nBasically this. At least for most of the tanks."},{"CreatedByName":"keeper","CreatedById":124530,"CreatedDateTime":"2015-02-28T22:51:40Z","Content":"\u003E \n\u003E That\u0027s because it\u0027s so freaking expensive...\n\nI didn\u0027t even check the prices, but i knew it was going to be silly expensive. (still not checking prices) \n\ntotally not on that train."},{"CreatedByName":"Wallygator","CreatedById":97357,"CreatedDateTime":"2015-02-28T23:33:29Z","Content":"I still think a set of plastic part (unassembled) produced by a model kit maker would be so much better. Really engaging for kids and adults of all ages. Buy the parts, build a rocket and paint it. Then build it in KSP and see if it works - oh sorry, better reverse that process ;-)\n\nreally - the 3D printing thing is cool, but way too over the top. Mass produced plastic parts would be magnitudes less expensive and there already exist a plethora of distributors and retail shops on-line and brick-mortor.\n\nOk granted there would be a bit of lead time if new parts were released, etc. but that just means Squad would need to be a bit more organised in coordinating update releases - AND modders would also need access to the mould fabrication and manufacturing chain.\n\nAnd frankly, if you wanted to clip the parts during assembly then you would ACTUALLY clip them in real life."},{"CreatedByName":"basic.syntax","CreatedById":109920,"CreatedDateTime":"2015-03-01T00:24:26Z","Content":"I don\u0027t think this is the end of KSP merchandising, it is just something that has a high-tech \u0022cool\u0022 factor. \n\nI hope to eventually see something more interactive and less expensive, like Wallygator is suggesting."},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-03-01T00:52:17Z","Content":"\u003E \n\u003E I still think a set of plastic part (unassembled) produced by a model kit maker would be so much better.\n\nWhile that\u0027s cheaper in the long run, it\u0027s far more expensive to start and convincing a toy company to create all those molds for something they have no way of determining the demand for could be pretty hard."},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2015-03-01T01:15:34Z","Content":"Update on the retooled rescue contracts, posted by Arsonide on the subreddit:\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/LbYtg)"}]}