{"TopicId":100963,"ForumId":51,"TopicTitle":"My Final v.90 Mission: Kerbfleet Voyage to Duna--ACCOMPLISHED!","CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-02-28T21:33:21Z","PageNum":1,"Articles":[{"CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-02-28T21:33:21Z","Content":"\n\u003Cp\u003EWith V1 coming out soon (soon?) and the probability that I will have to change all my spaceplane designs, I am just going to finish up my long-planned Duna system exploration mission and then hang out in the lounge car of the hype train until its time to download.\u003C/p\u003E\u003Cp\u003EMission Goals:\u003C/p\u003E\u003Cp\u003E--Establish a permanent mobile base and laboratory on Duna\u003C/p\u003E\u003Cp\u003E--Make landings in multiple biomes\u003C/p\u003E\u003Cp\u003E--Recover atmospheric data from high and low altitude\u003C/p\u003E\u003Cp\u003E--Land and explore Ike\u003C/p\u003E\u003Cp\u003EVessels:\u003C/p\u003E\u003Cp\u003E--KSS Kerbin Maru: 44t long-duration tanker/research ship, with mk3 bay for the Ike lander\u003C/p\u003E\u003Cp\u003E--Gliido Mk90: 20t SSTO/SSTA (Single Stage to Anywhere) interplanetary-capable, V/STOL spaceplane with seating for four Kerbals\u003C/p\u003E\u003Cp\u003E--Dunablab: mobile base and surface laboratory\u003C/p\u003E\u003Cp\u003EAnd here\u0027s the fleet in pictures, up to rendezvous in Duna orbit:\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/AxqWq\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003ENext post, Dunablab\u0027s landing (and subsequent repairs...)\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 alt=\u0022:rolleyes:\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-04T17:24:37Z\u0022 title=\u002203/04/2015 05:24  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 4, 2015\u003C/time\u003E by Kuzzter\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nik333","CreatedById":138436,"CreatedDateTime":"2015-03-01T09:58:29Z","Content":"\n\u003Cp\u003EYour vessels look really great! Looking forward to next part. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2015-03-01T13:44:20Z","Content":"\n\u003Cp\u003EYes, very unique look, I like it.\u003C/p\u003E\n"},{"CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-03-01T14:21:37Z","Content":"\n\u003Cp\u003EThanks all! Next up, the three vessels separate and Dunablab executes its de-orbit burn, targeting a lowland zone on the equator. Crew consists of pilot Thomwig, science officer Mac, and engineer Bill. We expect to need all three Kerbals\u0027 special talents before this is over.\u003C/p\u003E\u003Cp\u003EThe descent, landing and subsequent repairs, in pictures:\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/PKfvJ\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m finding I really like driving a 10t rover around Duna! The gravity is heavy enough to hold the ship down, but light enough that you can blast straight up most hills. I would definitely consider using a rover like this to road-trip from biome to biome.\u003C/p\u003E\u003Cp\u003EIn the next installment, Dunablab finds a nice, flat landing spot for Gliido--which the spaceplane overshoots by a couple dozen kilometers, Mission Control still not quite believing how thin Duna\u0027s atmosphere really is.\u003C/p\u003E\n"},{"CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-03-02T00:15:44Z","Content":"\n\u003Cp\u003ENext installment: a surface meetup. We\u0027ll leave one Kerbonaut aboard Dunablab, and pick up the rest of the crew for transport back to orbit. \u003C/p\u003E\u003Cp\u003EAnyone who\u0027s tried to put a spaceplane on Duna knows there are some challenges. The thin air limits both lift and drag, making it difficult to touch down at a speed that won\u0027t break off landing gear and explode engines. But on the other hand, the light gravity makes VTOL a viable solution. \u003C/p\u003E\u003Cp\u003EGliido employs a set of Vernor thrusters arranged around, and close to, the line along which its center of mass will vary as fuel tanks empty. It has enough of them to lift off in Kerbin gravity, so we\u0027re sure to have plenty of thrust on Duna. Regular hypergolic RCS is needed to stabilize the ship in VTOL mode: I find it works best to have the attitude control blocks as far from centerline as possible, so a small bit of thrust gives you the necessary torque to counter the inevitable imbalances. Finally, don\u0027t forget to put the Vernors on an action group so you an disable them--otherwise docking is going to be a nightmare, as you have 4-5kN of thrust in five of six directions, and over 200kN firing whenever you press \u0027K\u0027!\u003C/p\u003E\u003Cp\u003ESo anyway here we go--in pictures:\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/nYW7U\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EFor the next phase we\u0027ll refuel, swap crews, and try a Gliido landing in the northern polar region.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-02T18:15:04Z\u0022 title=\u002203/02/2015 06:15  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 2, 2015\u003C/time\u003E by Mister Dilsby\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-03-03T13:45:52Z","Content":"\n\u003Cp\u003EGliido has tanked up, we\u0027ve swapped crews in order to share out the XPs, and we\u0027re ready to try a second landing in a polar region.\u003C/p\u003E\u003Cp\u003EDeparting the KSS Kerbin Maru from low altitude, Gliido has to spend quite a bit of dV to change its inclination enough to hit the poles. (800, if I recall correctly). Knowing I would need extra dV to get back to an equatorial orbit, I didn\u0027t incline all the way to 90 degrees, instead aiming for a spot near the south edge of the icecap. And, I missed \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E. No worries, I did get a landing in a second biome, and this leaves something for my Duna mission to accomplish in V1.0. \u003C/p\u003E\u003Cp\u003EHere\u0027s a brief slideshow:\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/jCFsT\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003ESo, what caused the ship to roll down the hill? When it happened I was running Kerbals around on EVA, with time accelerated 4x. I know that sometimes a control input meant for one vessel will steer BOTH of them when those ships have recently been docked. Does the same thing happen between Kerbals and ships? Or was the physics warp simply high enough that the frictional force of wheels on the ground got lost in a rounding error, and gravity won the tug of war?\u003C/p\u003E\n"},{"CreatedByName":"Yukon0009","CreatedById":109376,"CreatedDateTime":"2015-03-03T14:05:26Z","Content":"\n\u003Cp\u003EWhen you physwarp near a ship with wheels, usually the vehicle will roll backwards even if the parking brakes are set.\u003C/p\u003E\n"},{"CreatedByName":"Wabbit","CreatedById":110502,"CreatedDateTime":"2015-03-03T15:10:07Z","Content":"\n\u003Cp\u003EI\u0027ve had my Laythe rover fall into the ocean with no means of recovery because of that little glitch.\u003C/p\u003E\n"},{"CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-03-03T15:17:20Z","Content":"\n\u003Cp\u003EAha, thanks to both of you for confirming that! I suppose I should either avoid physics warp on the ground, or retract the gear before doing so.\u003C/p\u003E\u003Cp\u003EIn any case, no more wheels on this mission; all that\u0027s left is for Kerbin Maru to get into Ike orbit and send down the non-atmospheric lander.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-03T15:21:58Z\u0022 title=\u002203/03/2015 03:21  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 3, 2015\u003C/time\u003E by Mister Dilsby\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-03-04T17:24:06Z","Content":"\n\u003Cp\u003EThis sequence completes the mission, with a lander launched from KSS Kerbin Maru going to Ike\u0027s surface and back.\u003C/p\u003E\u003Cp\u003ECompared to the Duna landings above, and my many trips to Mun, this seemed really easy. I suppose the Duna system is even more \u0022fun-sized\u0022 than Kerbin\u0027s, it\u0027s great to play around in low gravity and light atmosphere. \u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/SYMsy\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EHad a bit of an adventure lifting off from the surface; while I was distracted taking pictures I achieved Ike escape velocity! But did manage to correct before I got too high, and set up an intercept with Kerbin Maru within one orbit.\u003C/p\u003E\u003Cp\u003EFollowing these missions Kerbin Maru is left in Ike orbit with about 1800dV, and the Gliido spaceplane is in LDO with about 1500. Both ships are slated to return to Kerbin on the next transfer window, but by that time I will likely be starting all over again in V1.0.\u003C/p\u003E\u003Cp\u003EThanks everyone for your views, and your comments!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-04T17:34:05Z\u0022 title=\u002203/04/2015 05:34  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 4, 2015\u003C/time\u003E by Mister Dilsby\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SmallFatFetus","CreatedById":137860,"CreatedDateTime":"2015-03-04T21:43:38Z","Content":"\n\u003Cp\u003EIs that Astronomers Visual pack? If so which one?\u003C/p\u003E\u003Cp\u003ECool mission, too!\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2015-03-04T22:25:57Z","Content":"\n\u003Cp\u003ECongrats! Nice mission here. Duna is such a fun little system.... I think you can get to Ike orbit and back with just the fuel in an EVA suit.\u003C/p\u003E\n"},{"CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-03-05T00:17:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SmallFatFetus\u0022 data-cite=\u0022SmallFatFetus\u0022\u003E\u003Cdiv\u003EIs that Astronomers Visual pack? If so which one?\u003Cp\u003ECool mission, too!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks! I\u0027m actually not quite sure WHAT I\u0027m running, the folders are Environmental Visual Enhancements (of course) and BoulderCo. A little embarrassed here, I get a lot of joy out of that mod and I can\u0027t remember the source. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 alt=\u0022:blush:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-03-05T02:10:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cydonian Monk\u0022 data-cite=\u0022Cydonian Monk\u0022\u003E\u003Cdiv\u003ECongrats! Nice mission here. Duna is such a fun little system.... I think you can get to Ike orbit and back with just the fuel in an EVA suit.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHmmm, interesting! I\u0027d heard you could do that with Minmus but not Ike. Numbers show it must be possible-- dV map gives 535m/s required to get to orbit from surface, and IIRC the packs hold 600. From one of the high peaks, it should be even easier.\u003C/p\u003E\n"},{"CreatedByName":"Death Engineering","CreatedById":68528,"CreatedDateTime":"2015-03-06T16:35:27Z","Content":"\n\u003Cp\u003ENeat mission with some unique and beautiful crafts! I especially like your horizontal stabilizer/elevator solution. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-03-06T16:49:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Death Engineering\u0022 data-cite=\u0022Death Engineering\u0022\u003E\u003Cdiv\u003ENeat mission with some unique and beautiful crafts! I especially like your horizontal stabilizer/elevator solution. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThank you! I tend to put those stabilizers on most of my craft intended for low speed/deadstick landings. I think the torque induced by the high (above centerline) lift helps counter the typical moment due to COM imbalance when there is not a lot of air moving over the control surfaces.\u003C/p\u003E\n"},{"CreatedByName":"Landge","CreatedById":57671,"CreatedDateTime":"2015-03-15T22:05:12Z","Content":"\n\u003Cp\u003EAwesome mission and awesome spacecraft! Here\u0027s some rep.\u003C/p\u003E\n"},{"CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-03-16T02:35:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Landge\u0022 data-cite=\u0022Landge\u0022\u003E\u003Cdiv\u003EAwesome mission and awesome spacecraft! Here\u0027s some rep.\u003C/div\u003E\u003C/blockquote\u003E Thank you! I\u0027ve always dreamed of joining the ground crew \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\n"}]}