{"TopicId":101284,"ForumId":18,"TopicTitle":"Has the Dawn spacecraft taken color images of Ceres?","CreatedByName":"sedativechunk","CreatedById":112761,"CreatedDateTime":"2015-03-05T10:56:09Z","PageNum":1,"Articles":[{"CreatedByName":"sedativechunk","CreatedById":112761,"CreatedDateTime":"2015-03-05T10:56:09Z","Content":"\n\u003Cp\u003EHello KSP community,\u003C/p\u003E\u003Cp\u003EWhat better place to ask this question! If you guys keep up with space news, NASA\u0027s space craft \u0022DAWN\u0022 has been entering orbit around the dwarf planet Ceres this past month.\u003C/p\u003E\u003Cp\u003EI am slightly confused by the images it is releasing. This is Ceres per some Hubble color images taken years ago below. As you can see, the moon as a white/orange hue with a blue rim. Yet, all the images from DAWN so far has been grayscale. I wanted to ask (if anyone even knows), does DAWN even have true-color cameras equipped? Better yet - is Ceres really \u0022gray\u0022 or is it more like this spooky colored Hubble image? I want to see accurate color images, and if it hasn\u0027t taken any I can only speculate that either it isn\u0027t going to take color images (which is stupid IMO to spend millions on such a mission and not attach a color-capable camera) or Ceresa is really just a boring, gray rock and the Hubble image is in accurate for whatever reason. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://space-facts.com/wp-content/uploads/ceres.png\u0022 alt=\u0022ceres.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"UmbralRaptor","CreatedById":2767,"CreatedDateTime":"2015-03-05T12:44:50Z","Content":"\n\u003Cp\u003EScientific cameras typically have CCDs that work over a large range of wavelengths with a filter wheel to get the various narrow pass-bands of interest. This is generally understood to get more \u0027colors\u0027 and resolution for less mass than any other method.\u003C/p\u003E\u003Cp\u003EDawn\u0027s framing camera is a 1024x1024 CCD with a filter wheel with \u003Ca href=\u0022http://www.planetary.org/multimedia/space-images/charts/Dawn_FC_filter_bandpasses.html\u0022 rel=\u0022external nofollow\u0022\u003E7 narrow band and 1 broad band filter(s).\u003C/a\u003E I am unsure of exactly why those colors were chosen, but then my geology/mineralogy background is pretty limited.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.nasa.gov/mission_pages/dawn/spacecraft/instruments.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.nasa.gov/mission_pages/dawn/spacecraft/instruments.html\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://dawn.jpl.nasa.gov/technology/science_payload.asp\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://dawn.jpl.nasa.gov/technology/science_payload.asp\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s not clear to me what bands the current Dawn images are in (presumably the clear filter?). \u003Ca href=\u0022http://donaldedavis.com/2002_addons/SSYCOLRS.html\u0022 rel=\u0022external nofollow\u0022\u003E\u0022True colors\u0022\u003C/a\u003E \u003Ca href=\u0022http://donaldedavis.com/2003NEW/CLRWORK/CLRTEST.html\u0022 rel=\u0022external nofollow\u0022\u003Etend to be harder to determine than one would expect\u003C/a\u003E. \u003Ca href=\u0022http://donaldedavis.com/PARTS/MARSCLRS.html\u0022 rel=\u0022external nofollow\u0022\u003EMars is somewhat\u003C/a\u003E \u003Ca href=\u0022http://donaldedavis.com/2008%20new/CLRMARS.html\u0022 rel=\u0022external nofollow\u0022\u003Einfamous for this.\u003C/a\u003E I expect that any color images will be like those of Mercury or the highly stretched ones of the Moon -- more for mineral detection than what a person would see. Getting what a person would see out a spacecraft window is a pain in the donkey when your camera sees different bands than the \u003Ca href=\u0022https://en.wikipedia.org/wiki/File:Cone-fundamentals-with-srgb-spectrum.svg\u0022 rel=\u0022external nofollow\u0022\u003Ehuman eye\u003C/a\u003E, and \u003Ca href=\u0022https://en.wikipedia.org/wiki/Color_balance\u0022 rel=\u0022external nofollow\u0022\u003Ewhite balance\u003C/a\u003E can be endlessly annoying to get right.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-05T12:47:52Z\u0022 title=\u002203/05/2015 12:47  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 5, 2015\u003C/time\u003E by UmbralRaptor\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2015-03-05T13:01:52Z","Content":"\n\u003Cp\u003EDawn should be able to take true color images because it has a lot more filters than usual space probes do (usually it\u0027s UV, green, NIR; or similar). If anything, photos of Ceres should be a lot more realistic than photos made by Voyager 1 and 2.\u003C/p\u003E\u003Cp\u003EWhy we get grayscale images is beyond my understanding and if NASA fails to release true color photos, it will be a great failure of their PR department. For god\u0027s sake, \u003Ca href=\u0022https://www.flickr.com/people/ugordan\u0022 rel=\u0022external nofollow\u0022\u003Eeven amateurs\u003C/a\u003E take the raw data and produce more realistic stuff than NASA probably ever released.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2015-03-05T18:03:05Z","Content":"\n\u003Cp\u003EThe limiting factor on these probes is bandwidth. They pretty much all have to go through NASA\u0027s Deep Space Network, which is a series of radiotelescopes around the World that are tuned to communicate with deep space probes. Of course, due to the rotation of the Earth and other alignment factors, any single antenna can only point at a specific location in the sky for a short window every day. The DSN antennas are also used for radioastronomy so they have to be shared with other science institutions. Therefore, DSN usage is determined by the allocation of time slots for each project, including Dawn, New Horizons, but also all the stuff on Mars and even Voyager and Pionneer. Each mission gets allocated time slots depending on their priority, requirements, and budget, and they have to struggle to get their data through the DSN at the moment the DSN antennas are pointed at their probe. \u003C/p\u003E\u003Cp\u003EScience missions are not for PR. Missions like these are pushing the limits of technology, and the teams always assume that they might lose the probe at any time. Therefore the science data has the highest priority, and \u0022pretty pictures\u0022 are reserved for when there is extra bandwidth and the primary objectives have been met. And of course, data rates are low due to the distance. We will definitely get some nice color pictures, but they will come later, after the important data has been received and processed.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-05T18:07:33Z\u0022 title=\u002203/05/2015 06:07  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 5, 2015\u003C/time\u003E by Nibb31\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2015-03-05T18:09:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EScience missions are not for PR. Missions like these are pushing the limits of technology, and the teams always assume that they might lose the probe at any time. Therefore the science data has the highest priority, and \u0022pretty pictures\u0022 are reserved for when there is extra bandwidth and the primary objectives have been met. We will definitely get some nice color pictures, but they will come later, after the important data has been received and processed.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree with the \u0022why\u0022 on this, but to simply say, \u0022Science missions are not for PR\u0022 is a brilliant way to see your funding run out.\u003C/p\u003E\u003Cp\u003EThe people who are already interested in science will take notice of the less-spectacular, more technical data that comes out of space missions. But if you want to get the rest of the population to so much as bat an eye, you need those epic moments that everybody can understand.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-05T21:32:07Z\u0022 title=\u002203/05/2015 09:32  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 5, 2015\u003C/time\u003E by vger\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Newt","CreatedById":131025,"CreatedDateTime":"2015-03-05T21:28:52Z","Content":"\n\u003Cp\u003EWell, I think we also have to realize a couple of things. Sure, NASA needs its PR, there is no question about that, but is there that much that quickly releasing many colour images are going to do for them? It may be the case that more people are excited by colour images, but black and white ones are better than just releasing scientific papers and technical reports. Colour images will come, certainly, but I think that already there is plenty as far as visually appealing PR work done by NASA to further interest in this and other missions.\u003C/p\u003E\n"},{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2015-03-05T21:40:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Newt\u0022 data-cite=\u0022Newt\u0022\u003E\u003Cdiv\u003EWell, I think we also have to realize a couple of things. Sure, NASA needs its PR, there is no question about that, but is there that much that quickly releasing many colour images are going to do for them? It may be the case that more people are excited by colour images, but black and white ones are better than just releasing scientific papers and technical reports. Colour images will come, certainly, but I think that already there is plenty as far as visually appealing PR work done by NASA to further interest in this and other missions.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt doesn\u0027t need to be an insane overload of material, but every mission deserves its \u0022money shot.\u0022\u003C/p\u003E\u003Cp\u003EAs one example, maybe Rosetta has had that already, but I\u0027m still holding out for a little hope that something more spectacular will come when the comet reaches periapsis. More light available, and perhaps a brighter coma. Good enough for a solid color photo? Time will tell.\u003C/p\u003E\n"},{"CreatedByName":"daniel l.","CreatedById":57763,"CreatedDateTime":"2015-03-05T22:28:51Z","Content":"\n\u003Cp\u003EDont be too expectant of seeing what the dwarf planet looks like until we actually go their on a manned mission, The government tends to take the best stuff and hide it away it it\u0027s secret locker known as Area 51, I have heard of inventors who made something extremely advanced but were robbed at gunpoint by the government.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2015-03-05T23:17:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022daniel l.\u0022 data-cite=\u0022daniel l.\u0022\u003E\u003Cdiv\u003EI have heard of inventors who made something extremely advanced but were robbed at gunpoint by the government.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have heard of magical rainbow creatures that vomit gold, but I am not too sure that has any consequences for the real world.\u003C/p\u003E\n"},{"CreatedByName":"Newt","CreatedById":131025,"CreatedDateTime":"2015-03-06T00:57:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022vger\u0022 data-cite=\u0022vger\u0022\u003E\u003Cdiv\u003EIt doesn\u0027t need to be an insane overload of material, but every mission deserves its \u0022money shot.\u0022.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf that is all that this is about, there definitely is plenty of time for Dawn to take and prepare some color images. Currently, the vehicle is not even in orbit, so just give them all some time.\u003C/p\u003E\n"},{"CreatedByName":"UmbralRaptor","CreatedById":2767,"CreatedDateTime":"2015-03-06T01:25:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Newt\u0022 data-cite=\u0022Newt\u0022\u003E\u003Cdiv\u003EIf that is all that this is about, there definitely is plenty of time for Dawn to take and prepare some color images. Currently, the vehicle is not even in orbit, so just give them all some time.\u003C/div\u003E\u003C/blockquote\u003EAnd then there\u0027s how hard it is/was to get images of 67/P Churyumov-Gerasimenko from the good cameras. (Chances are you\u0027ve seen navcam ones, but nothing from OSIRIS!)\n"},{"CreatedByName":"basic.syntax","CreatedById":109920,"CreatedDateTime":"2015-03-06T01:38:17Z","Content":"\n\u003Cp\u003EWhat \u003Ca href=\u0022http://dawn.jpl.nasa.gov/multimedia/vesta_dawn_gallery.asp\u0022 rel=\u0022external nofollow\u0022\u003EDawn did at Vesta \u003Cspan style=\u0022font-size:8px;\u0022\u003E(link)\u003C/span\u003E\u003C/a\u003E provides the best \u0022picture\u0022 of what to expect at Ceres: they are mainly interested in using color filters to make different surface materials stand out.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2015-03-06T08:07:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022vger\u0022 data-cite=\u0022vger\u0022\u003E\u003Cdiv\u003E\u0022Science missions are not for PR\u0022 is a brilliant way to see your funding run out.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJPL, the lab that coordinates the Dawn mission, isn\u0027t in the entertainment business. Their funding depends on NASA, which depends on the Administration, which depends on Congress. The general public\u0027s influence is negligible. The criteria for attributing funding is generally how much money trickles down into the national aerospace industry and how much science will be extracted from the mission. The science community doesn\u0027t care much for pretty pictures (they typically loath PR and teams that go overboard with PR lose credibility). What they do care about is publication of science papers.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2015-03-06T13:52:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EJPL, the lab that coordinates the Dawn mission, isn\u0027t in the entertainment business. Their funding depends on NASA, which depends on the Administration, which depends on Congress. The general public\u0027s influence is negligible. The criteria for attributing funding is generally how much money trickles down into the national aerospace industry and how much science will be extracted from the mission. The science community doesn\u0027t care much for pretty pictures (they typically loath PR and teams that go overboard with PR lose credibility). What they do care about is publication of science papers.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENHF, but this is truly ignorant of you. \u003Cstrong\u003EPublic perception is not negligible.\u003C/strong\u003E In fact, it\u0027s the main factor, but it works indirectly. Also, you\u0027re describing planetary scientists as robots who don\u0027t share interest in seeing what does their target look like. You\u0027re really failed with this.\u003C/p\u003E\u003Cp\u003EYou\u0027re talking about bandwidths and this has nothing to do with it. It\u0027s not the probe that makes the image. The probe takes photos in different wavelengths and sends them to Earth \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Eas part of its normal operation\u003C/span\u003E. All that NASA needs to do is to use that data to assemble a true color image and if they don\u0027t want to do that, \u003Ca href=\u0022http://www.planetary.org/explore/space-topics/space-imaging/profiles/gordan-ugarkovic.html\u0022 rel=\u0022external nofollow\u0022\u003Ethere are people who will do it for free\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EIt is a disinformation that this is a waste of resources.\u003C/p\u003E\u003Cp\u003EThis constant trashing of PR basics is one of the things that ruins NASA and has the potential to create destruction of longterm scientific plans. Humanity doesn\u0027t need more of that, and USA certainly doesn\u0027t, being all shaky already.\u003C/p\u003E\n"},{"CreatedByName":"Blue giant","CreatedById":139604,"CreatedDateTime":"2015-03-17T18:46:49Z","Content":"\n\u003Cp\u003EThe public interest is directly related to the amount of funding congress can justify for these missions. The scientists totally fail to realise this as funding continues to decrease due to lack of interest. They managed to put video cameras on the apollo missions and had the whole world in awe. Now they land probes on Mars, titan, and a comet and don\u0027t even think that a video camera is any use. It is the closest thing to actually being there and seeing something truely amazing with your own eyes. Putting actual HD broadcast quality videos of the surface of alien planets on pay per view would make them millions. Funding problems for future missions solved.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2015-03-17T18:59:31Z","Content":"\n\u003Cp\u003EApollo had vid cameras because there was motion to record. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E In an environment where nothing moves, still cameras are just as useful, but simpler and more reliable.\u003C/p\u003E\n"},{"CreatedByName":"Blue giant","CreatedById":139604,"CreatedDateTime":"2015-03-19T00:56:18Z","Content":"\n\u003Cp\u003EJust think about the incredible images from the full colour HD video cameras on the iss as it orbits the earth, then imagine the same on a spacecraft orbiting Ceres, Mars, a comet, Jupitor, Saturn etc. Not only would it look spectacular, but a lot can be learned from close up observation of the movement of the atmospheres of these celestial bodies. Who knows what unexpected things we might see. For instance, there could be geological or atmospheric dynamic activity which would not be apparent in a simple black and white still image.\u003C/p\u003E\n"},{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2015-03-19T01:52:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Blue giant\u0022 data-cite=\u0022Blue giant\u0022\u003E\u003Cdiv\u003EJust think about the incredible images from the full colour HD video cameras on the iss as it orbits the earth\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDeep down, I\u0027m hoping that NASA is playing with this because they want to see if HD cameras are viable for a future lunar trip.\u003C/p\u003E\u003Cp\u003EOther planets? Ehh, \u0022live\u0022 video would be much more difficult. But I have to assume we could at least manage a stable streaming digital HD transmission from the moon.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2015-03-19T07:58:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Blue giant\u0022 data-cite=\u0022Blue giant\u0022\u003E\u003Cdiv\u003EThe public interest is directly related to the amount of funding congress can justify for these missions.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf that were the case, the science community would be getting even less money than it gets now. In the list of stuff that interests the public, I can assure you that space exploration ranks at the very bottom.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EPutting actual HD broadcast quality videos of the surface of alien planets on pay per view would make them millions. Funding problems for future missions solved.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWith the attention span of the average TV viewer, a handful of people might watch it for 30 seconds before tuning into The Voice or some other crap. It wouldn\u0027t even cover the cost of the cameras, let alone the mission.\u003C/p\u003E\n"},{"CreatedByName":"Blue giant","CreatedById":139604,"CreatedDateTime":"2015-03-19T14:23:12Z","Content":"\n\u003Cp\u003EThe video doesn\u0027t need to be transmitted live. Just recorded at 30fps and sent back in chunks of 15 minutes each or even smaller to be reassembled back on earth. Right now we have spacecraft in orbit around a comet, on and orbiting Mars, Saturn\u0027s moon titan, Ceres and approaching Pluto. I think that video cameras on these missions would have generated much more public interest with all the fantastic images from this feat of human exploration. It may also inspire a next generation of space engineers and ambitious missions, just like the apollo missions did. For example, I would love to see earthrise from the surface of Ceres, or \u0027Jupitor rise\u0027 from the surface of Europe and am sure that billions of other humans have that in built sense of awe and wonder that has got us where we are today.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2015-03-19T15:45:51Z","Content":"\n\u003Cp\u003EThere is no need for having HD video being streamed live. It\u0027s not even possible because the bandwidth is way too low (I saw something like 100 kB/s for Dawn and 2 kB/s for New Horizons). Distances are enormous, remember that. You can only have data trickling. Decent part of it is reserved for telemetry.\u003C/p\u003E\u003Cp\u003EIt\u0027s not even necessary to have a video stream. There is nothing moving there so that you could justify such expense.\u003C/p\u003E\u003Cp\u003EBut true color images, that\u0027s a totally different issue.\u003C/p\u003E\u003Cp\u003EIt\u0027s not Dawn\u0027s problem. Dawn already sends photos made through various filters \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Eall the time\u003C/span\u003E. It\u0027s the people in NASA that are too lazy/stupid to realize that few more man-hours spent on taking that data and making a true color image is what, in the end, drives their budget. All they need to do is sit in front of a computer and spend few hours working with an image editing software. One man can do it.\u003C/p\u003E\u003Cp\u003EThis passivity doesn\u0027t surprise me. NASA has a history of very poor public relations management, unlike SpaceX which streams the crap out of their every launch, even video from LOX tanks, for god\u0027s sake.\u003C/p\u003E\u003Cp\u003ENASA can\u0027t even properly stream their launches without having gaps in the transmission or the stream collapsing at the moment of launch.\u003C/p\u003E\n"},{"CreatedByName":"Blue giant","CreatedById":139604,"CreatedDateTime":"2015-03-19T18:10:01Z","Content":"\n\u003Cp\u003EI think space x will definitely install video cameras when they start sending probes to the planets. Hopefully this will be within the next 10 years. They could implement 3d cameras and use oculus rift virtual reality headsets to play back recorded footage. (Live streaming is not even necessary). Elon Musk knows how to make money and what the public wants. Nasa will lose a lot of funding if they don\u0027t bring their PR into the 21st century.\u003C/p\u003E\u003Cp\u003ENothing moves on the planets? They rotate at 1000s mph. Some have dynamic atmospheric activities, including electrical storms. Active volcanoes are on venus, Io, and other exotic moons. Titon has liquid methane oceans and rivers, waterfalls, rain etc. Mars has dust devils, 2 moons in orbit and a massive canyon system. Can you imagine watching the sunset over that and then watch in awe as Jupitor and it\u0027s moons rise in the night sky. Mars being millions of miles closer to Jupitor than Earth.\u003C/p\u003E\u003Cp\u003EThese is also the fact that we can discovery many known unknowns and even more unknown unknowns using video cameras to replicate our eyes and brain in places where our fragile human bodies cannot survive.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2016-11-25T13:06:32Z","Content":"\n\u003Cp\u003E\n has made a color image of Ceres. I honestly don\u0027t know if it\u0027s realistic, because this is not the first time Cereses color image has been released and each time it was different.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022PIA21079.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022750\u0022 src=\u0022http://photojournal.jpl.nasa.gov/jpeg/PIA21079.jpg\u0022 width=\u0022750\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m also thinking about the illumination. Can\u0027t be correct, knowing how low its albedo is and how distant from the Sun it is.\n\u003C/p\u003E\n"}]}