{"TopicId":101280,"ForumId":18,"TopicTitle":"Web-Based Grand Strategy Project (Concept Stage)","CreatedByName":"deskjetser","CreatedById":34943,"CreatedDateTime":"2015-03-05T09:18:47Z","PageNum":1,"Articles":[{"CreatedByName":"deskjetser","CreatedById":34943,"CreatedDateTime":"2015-03-05T09:18:47Z","Content":"Okay, so at this point I have nothing to show you guys, only the concept and the means to make it.\n\nWith that in mind, wall of text incoming. ***And remember, this is just at the concept stage!***\n\nThe end game idea, is to create a super in-depth multiplayer grand global strategy game, that anyone with a browser and an interest in role-play/strategy can sign up for and play.\n\nPotentially it would be based on the Kerbal world, however at this point it could be based on anything at all. So please let me know if you have any ideas here.\n\n**Planned features.**\n\n- Graphical user interface\n- In depth complex regional combat system\n- User driven diplomatic interaction\n- Detailed user customization; make your country, yours\n- Advanced player driven economic features\n- Technology progression system\n- More features in future...\n\n**The regional stage.**\n\nThe user interface would primarily consist of the world map, which within would be clickable regions on the map. These regions would represent the borders of their region visually. At the moment a map the size of Kerbin would have an unknown amount of regions, but I expect there to be anywhere from 200-500 regions.\n\n**Each region would have these stats like this:**\n\n- Size of region: in square KM (For the time it would take for a unit to drive from one region to another, take the square root of this number and half it, do the same for the region you are coming from and add those numbers together and boom. Rough travel distance.)\n- ---\n- Terrain: Plains, Hills, Mountains, Desert, Tundra, Arctic, Coast, Ocean. (Each region will have a combination of some these with a % number next to it, this is how much of that region is covered with that terrain type. For example: 25% Plains / 75% Hills.)  \nTerrain will have an effect on the speed at which units move through that region and their combat efficiency (Attrition, attacking, defending ect.).\n- ---\n- Features: Jungle, Marsh, Forest, Snow/Ice, Rivers, Cities/Towns. (The same as terrain, except these add more detail to the terrain. Rather than blank boring plains, you can have plains populated by a marsh which will make a difference on unit performance too.)  \nFeatures will also have an effect on the speed at which units move through that region and their combat efficiency (Attrition, attacking, defending ect.).\n- ---\n- Natural Resources: Iron ores, Aluminium ores, Copper ores, Coal, Oil, Uranium ores, Gold ores, Rare earth ores. (If a region has any of these resources in it, they will be displayed with a number next to them which is the size of the deposit in metric tons or for Oil, Billion liters. For example: 103,000t Iron ores)  \nAll of these must be refined before use, except for coal. This will be covered later. Rare earth ores are a collection of resources that are widely used in construction/manufacturing but are less common/less important than Fe, Cu, Al and U.\n- ---\n- Region Fertility: 0-100 rating (The ratings will also be named in segments of 10. Example: 0-10;Sterile / 11-20;Wasteland / 21-30;Barren / 31-40;Fallow / 41-50;Arable / 51-60;Productive / 61-70;Lush / 71-80;Rich / 81-90;Affluent / 91-100;Shangri-la)  \nThe more fertile a region, the better the yield from farms and fishing will be. Can be lowered by nuclear attacks and things like brutally large industrial projects.\n- ---\n- Population \u0026 Age: Age brackets with the number of people in that bracket listed. (Under ideal circumstances the age rage for enlisting in military service is 18-30 males. You can change this to include women, and expand the age of service to include pensioners or children in desperate times. Obviously there will be dire consequences if you go to extremes. However if you just expand to use men and women, you will have doubled your available for service population with little drawback.)  \nYou need people to man things. Like factories, so if you decide to require all 18-30 men and women to serve, you will have a huge pool of manpower, but problems finding workers for factories; and may find yourself working factories with children or pensioners!\n- ---\n- Region Improvements: Things like improved road networks, factories, farms and airbases. (I will cover these in more depth once I have expanded the concept.)\n\nAs you can see, there is a crazy amount of depth here. This doesn\u0027t even get into the combat simulation.\n\n**Here are some pictures of what the concept looks like currently on paper.**\n\nHere is the concept draft of what a region would/could contain.\n\n![Kx1Cb4El.jpg](http://i.imgur.com/Kx1Cb4El.jpg)\n\nAnd here is the resources refining flow concept. The square [] brackets mean the resource is usable or useful for constructing things.\n\n![ueom6ySl.jpg](http://i.imgur.com/ueom6ySl.jpg)\n\n**More coming soon! Please let me know if you think you would play something like this, and leave any feedback as to what you like or what features you\u0027d like to see!**"},{"CreatedByName":"deskjetser","CreatedById":34943,"CreatedDateTime":"2015-03-06T03:38:18Z","Content":"Come on people, I need feedback."},{"CreatedByName":"Newt","CreatedById":131025,"CreatedDateTime":"2015-03-06T03:45:58Z","Content":"So a little like Civilization, but multiplayer web based?"},{"CreatedByName":"deskjetser","CreatedById":34943,"CreatedDateTime":"2015-03-06T03:56:11Z","Content":"\u003E \n\u003E \\*snip\\*\n\nVery much so, yes."}]}