{"TopicId":101273,"ForumId":70,"TopicTitle":"Reputation score dropped for seemingly no reason","CreatedByName":"twentysix","CreatedById":107483,"CreatedDateTime":"2015-03-05T05:56:55Z","PageNum":1,"Articles":[{"CreatedByName":"twentysix","CreatedById":107483,"CreatedDateTime":"2015-03-05T05:56:55Z","Content":"\n\u003Cp\u003ENot sure what happened. Only thing I did different that I can think of is crashing an unmanned cockpit. Only reason I am doubting my unmanned cockpit theory is that I noticed it on my second launch attempt trying to test the same cockpit and it did not change rep after crashing that one.\u003C/p\u003E\u003Cp\u003EAfter I noticed I did go back to check; I don\u0027t have any lost Kerbals, I haven\u0027t failed any contracts, and I haven\u0027t damaged any buildings. I also was not missing any money, at least not that I could tell. I do have both penalties set to x10 (I\u0027m guessing this is how I noticed).\u003C/p\u003E\u003Cp\u003EI also know that this could be near impossible to track due to the excessive number of mods I have, so this is more of a question of if anyone knows any certain parts or unexpected situations that could possibly have caused this...\u003C/p\u003E\n"},{"CreatedByName":"caipi","CreatedById":119538,"CreatedDateTime":"2015-05-05T19:44:11Z","Content":"\n\u003Cp\u003EI am having the same issue. I am playing my career on a private DMP-Server though with a friend at normal mode. We both lose reputation constantly, even though we don\u0027t lose any kerbals or crash any buildings etc.\u003C/p\u003E\u003Cp\u003EIt would be nice to know what might cause sudden drops in reputation. I was down to -354 very fast (I only researched a few nodes). E.g. does debris that falls near the KSC (not onto any building, just near the center in general) cause a drop?\u003C/p\u003E\n"},{"CreatedByName":"stlfatboy","CreatedById":153940,"CreatedDateTime":"2015-12-01T18:28:52Z","Content":"\n\u003Cp\u003E\nI also play dmp, my reputation get -800 after several launch. Pretty annoying, No kerbal get loss, no building crash\n\u003C/p\u003E\n"},{"CreatedByName":"Torih","CreatedById":144304,"CreatedDateTime":"2015-12-01T18:41:20Z","Content":"\n\u003Cp\u003E\nNot sure if this is your issue, but you loose rep for declining missions now. You need to change it in custom options.\n\u003C/p\u003E\n"}]}