{"TopicId":101254,"ForumId":18,"TopicTitle":"\u0026quot;Venus Project\u0026quot; Has anyone ever heard of this?","CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2015-03-04T21:43:10Z","PageNum":1,"Articles":[{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2015-03-04T21:43:10Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022https://www.thevenusproject.com/\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.thevenusproject.com/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ETo try and even label exactly what this is seems borderline impossible because it covers so many different topics ranging from political (or perhaps more accurately, anti-political), science \u0026amp; technology, social issues, environment, etc.\u003C/p\u003E\u003Cp\u003EJust curious if anyone has given this a deeper look, because so far, I can\u0027t even be sure where it is or where it hopes to be going. Are they even serious? Could it just be a hoax? Online \u0022World\u0027s Fair?\u0022 Crazy idea launched with an overabundance of confidence and naivety? Or is the objective right now to simply create awareness?\u003C/p\u003E\u003Cp\u003ERegardless, assuming this isn\u0027t just some kind of con-game, I wish them luck. It sounds interesting anyhow.\u003C/p\u003E\n"},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2015-03-04T22:03:38Z","Content":"\n\u003Cp\u003Eyeah, is a silly idea.. I know everything about it.\u003C/p\u003E\n"},{"CreatedByName":"sumghai","CreatedById":66272,"CreatedDateTime":"2015-03-04T22:43:44Z","Content":"\n\u003Cp\u003EA cursory glance on Google and Wikipedia reveals that the author, Jacque Fresco, is a self-described futurist. Most of his early career as a former aerospace/industrial engineer consisted of ragequitting various companies/organizations after his overly-radical ideas were rejected for practical reasons. I suspect he started the Venus Project to earn a living from selling books based on his ideas.\u003C/p\u003E\u003Cp\u003EEssentially, he talks the talk, but can\u0027t walk the walk.\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-03-04T22:49:03Z","Content":"\n\u003Cp\u003EI\u0027m not even sure what \u0022the talk\u0022 is in this case. I don\u0027t see anything concrete in this proposal.\u003C/p\u003E\u003Cp\u003E Best,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"},{"CreatedByName":"SelectHalfling0","CreatedById":105051,"CreatedDateTime":"2015-03-04T22:53:53Z","Content":"\n\u003Cp\u003EInitial look at his project makes it look promising: \u0022Hey look! No more suffering! No more mundane jobs! No more material possession! Oh... Wait...\u0022\u003C/p\u003E\u003Cp\u003EHe forgot about human nature.\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-03-04T23:35:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SelectHalfling0\u0022 data-cite=\u0022SelectHalfling0\u0022\u003E\u003Cdiv\u003EInitial look at his project makes it look promising: \u0022Hey look! No more suffering! No more mundane jobs! No more material possession! Oh... Wait...\u0022\u003Cp\u003EHe forgot about human nature.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E Well...\u003C/p\u003E\u003Cp\u003E To be fair, he didn\u0027t forget about it. He asserted that it can be changed. He just didn\u0027t provide any information regarding how he would do that.\u003C/p\u003E\u003Cp\u003E Best,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2015-03-04T23:40:34Z","Content":"\n\u003Cp\u003EJack Fresco denies human nature (he does not believe that genes sculpt our base behavior), he just choice to ignore this factor because if dont, all its theory falls.\u003C/p\u003E\u003Cp\u003EAlso its idea is not really an idea... An idea is something that explain how to go from point A to point B, he only describes point B. The same that I said: \u003Cem\u003Eit will be a good idea to reduce poverty.. ok.. but how??\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EHis idea is based that we will need an artificial intelligence computer to analize and predict all the humans needs on food or products, what product should be develope and what amount produced?. He needs that super imaginary computer because is the only way to remove money.\u003C/p\u003E\u003Cp\u003EBut how much \u0022something\u0022 cost, is the best way to know if it worth to develope that and how many you will need to produce; also tells us how efficient a product is.\u003C/p\u003E\u003Cp\u003EThose to name a few...\u003C/p\u003E\u003Cp\u003EVenus project inspire The Zeitgeist Movement (which is a copy) and both have a religious structure. (Everyone may join to the idea, but nobody can change it or think different)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-04T23:51:54Z\u0022 title=\u002203/04/2015 11:51  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 4, 2015\u003C/time\u003E by AngelLestat\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Dkmdlb","CreatedById":70275,"CreatedDateTime":"2015-03-04T23:58:25Z","Content":"\n\u003Cp\u003EIt\u0027s complete nonsense. From an economics perspective, it fails to solve the calculation problem.\u003C/p\u003E\n"},{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2015-03-05T00:35:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AngelLestat\u0022 data-cite=\u0022AngelLestat\u0022\u003E\u003Cdiv\u003EHis idea is based that we will need an artificial intelligence computer to analize and predict all the humans needs on food or products, what product should be develop and what amount produced?. He needs that super imaginary computer because is the only way to remove money.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI wouldn\u0027t necessarily say that the Master Computer of \u0022Paranoia\u0022 is a necessary element to eliminating money, but one could probably make a good argument that technology is swiftly coming to an event that will deal unimaginable chaos to the economy. Specifically I\u0027m referring to automation. As the tech improves and continues to eliminate the need for humans, I really don\u0027t know where that will leave us for money. Money can simply be described as a physical representation of the value of a person\u0027s labor. We\u0027ve already seen factory workers go the way of the dodo. And we\u0027re on the verge of seeing the same thing happen with food service (there are completely automated fast-food restaurants in Asia already). And after that will come the smart vehicles, eliminating the need for truck drivers. After that, the only industry that will remain for the largest demographic is retail, and that won\u0027t be able to sustain itself for long after such a large percentage of the population is put out of work.\u003C/p\u003E\u003Cp\u003EMeanwhile, automation will continue to evolve and become more complex, until only the most menial tasks remain for humans to do. We would reach a point where the value of labor (and consequently, money) will become nil. We\u0027re already seeing that process take place, in the form of stagnant wages while the price of goods continues to rise. Even slavery would be meaningless in any scenario where machines can do it better and cheaper than humans.\u003C/p\u003E\u003Cp\u003EIn such a situation, what would humanity\u0027s spirit of greed be able to do with itself?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-05T00:37:45Z\u0022 title=\u002203/05/2015 12:37  AM\u0022 data-short=\u00229 yr\u0022\u003EMarch 5, 2015\u003C/time\u003E by vger\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Greenfire32","CreatedById":36705,"CreatedDateTime":"2015-03-05T00:36:19Z","Content":"\n\u003Cp\u003EI think it\u0027s a great idea!\u003C/p\u003E\u003Cp\u003EOn paper!\u003C/p\u003E\n"},{"CreatedByName":"Tommygun","CreatedById":41293,"CreatedDateTime":"2015-03-05T01:15:16Z","Content":"\n\u003Cp\u003EWith just a superficial look at it, it looks like a modernized/high tech \u0022Socialist Paradise\u0022 concept.\u003C/p\u003E\u003Cp\u003EPure socialism doesn\u0027t work any better than pure capitalism and I think this would end up with a system of unmotivated and inefficient workers and institutions.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2015-03-05T01:40:11Z","Content":"\n\u003Cp\u003EI remember when it first started being popular online few years ago. That\u0027s sort of a communist utopia. Great thing in theory, impossible to create (might only be \u003Cem\u003Enaturally reached\u003C/em\u003E in distant future).\u003C/p\u003E\u003Cp\u003EThese things happen when people don\u0027t educate themselves and try to sound smart. As Santayana said: \u003Cstrong\u003EThose who cannot remember the past are condemned to repeat it.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EQuite frankly, we don\u0027t need to repeat artificial creation of communism or socialism. Its practical application had by far the worst death toll we know of.\u003C/p\u003E\n"},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2015-03-05T02:39:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022vger\u0022 data-cite=\u0022vger\u0022\u003E\u003Cdiv\u003EI wouldn\u0027t necessarily say that the Master Computer of \u0022Paranoia\u0022 is a necessary element to eliminating money, but one could probably make a good argument that technology is swiftly coming to an event that will deal unimaginable chaos to the economy. Specifically I\u0027m referring to automation. As the tech improves and continues to eliminate the need for humans, I really don\u0027t know where that will leave us for money. Money can simply be described as a physical representation of the value of a person\u0027s labor. We\u0027ve already seen factory workers go the way of the dodo. And we\u0027re on the verge of seeing the same thing happen with food service (there are completely automated fast-food restaurants in Asia already). And after that will come the smart vehicles, eliminating the need for truck drivers. After that, the only industry that will remain for the largest demographic is retail, and that won\u0027t be able to sustain itself for long after such a large percentage of the population is put out of work.\u003Cp\u003EMeanwhile, automation will continue to evolve and become more complex, until only the most menial tasks remain for humans to do. We would reach a point where the value of labor (and consequently, money) will become nil. We\u0027re already seeing that process take place, in the form of stagnant wages while the price of goods continues to rise. Even slavery would be meaningless in any scenario where machines can do it better and cheaper than humans.\u003C/p\u003E\u003Cp\u003EIn such a situation, what would humanity\u0027s spirit of greed be able to do with itself?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Greenfire32\u0022 data-cite=\u0022Greenfire32\u0022\u003E\u003Cdiv\u003EI think it\u0027s a great idea!\u003Cp\u003EOn paper!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHe is just describing the point B (a possible future), he is not saying how to pass from where we are to that. Also he has many hypothesis wrong.\u003C/p\u003E\u003Cp\u003EThat is not an idea.. is just an utopia dream as lajoswinkler said.\u003C/p\u003E\u003Cp\u003EMachines would not remplace the human labor or asset from one day to the next, maybe they never will.\u003C/p\u003E\u003Cp\u003EToday in the world 1 in 4 people, still lives as everybody did 5000 years ago. And still almost everyone do something for living.\u003C/p\u003E\u003Cp\u003EIf you remplace a human by a machine, and that human does not earn money anymore, then you have 1 less human who can not buy the products that this factory made, so the factory earnings are reduce.. So less money to invest in machines, unless you give that human another labor or asset to get its own money.\u003C/p\u003E\u003Cp\u003EHumans always will have an asset, is not possible to think in a future without it. Is like to think: can humans live without an universe?\u003C/p\u003E\u003Cp\u003EIf that day comes where there is not purpose for a human to exist, then it will be our end as a species.\u003C/p\u003E\u003Cp\u003EAlso talk about if this idea may or not work in 1000 years or 3000 years into the future is pointless, it does not explain even how to reach that point.\u003C/p\u003E\u003Cp\u003EHumans wake up some day and said \u0022lets forget about the money\u0022??\u003C/p\u003E\n"},{"CreatedByName":"Kibble","CreatedById":131042,"CreatedDateTime":"2015-03-05T02:45:36Z","Content":"\n\u003Cp\u003EHuman nature can be changed, or controlled by society. Thirty thousand years ago we were violent, selfish, and ignorant. Now with civilization we might be the same, but violence is controlled by laws and ignorance is controlled by education. Greed can and will be controlled too - probably by some form of socialism/communism.\u003C/p\u003E\n"},{"CreatedByName":"Pipcard","CreatedById":2541,"CreatedDateTime":"2015-03-05T02:49:26Z","Content":"\n\u003Cp\u003EI saw this several years ago, I just liked the pretty futuristic city images and didn\u0027t care about how the ideology behind it was too idealistic.\u003C/p\u003E\n"},{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2015-03-05T03:02:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AngelLestat\u0022 data-cite=\u0022AngelLestat\u0022\u003E\u003Cdiv\u003EIf you remplace a human by a machine, and that human does not earn money anymore, then you have 1 less human who can not buy the products that this factory made, so the factory earnings are reduce.. So less money to invest in machines, unless you give that human another labor or asset to get its own money.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe question is, do the businesses even care? So far, all we\u0027ve seen is a, \u0022Not my problem\u0022 reaction to this sort of thing. It\u0027s a commonly-held belief, and not just among the upper class, that the only thing keeping EVERY SINGLE PERSON from success is laziness. They somehow are able to ignore any link between poverty rates and the elimination of jobs (entire industries in some cases). How long can this envelope continue to be pushed before something breaks? Who knows.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pipcard\u0022 data-cite=\u0022Pipcard\u0022\u003E\u003Cdiv\u003EI saw this several years ago, I just liked the pretty futuristic city images and didn\u0027t care about how the ideology behind it was too idealistic.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think it\u0027s still an important idea, though I don\u0027t think the goal should be to actually be the catalyst for change. \u003C/p\u003E\u003Cp\u003EDevelop technologies, show it off. Let people see how awesome the future could be if we put our minds to it. \u003C/p\u003E\u003Cp\u003EThat\u0027s something that there has been far too little of recently. Every child should at least be shown a vision or two of a utopia brought about through mutual cooperation, science, and technology. It doesn\u0027t matter if that vision arrives. What matters is that everyone gets to see hope for it, if even for a moment. People who have that seed put in them by such ideas, will be far more likely to try and actually change something later on in life. Even if it\u0027s just a tiny thing that makes the world better. It\u0027s just as important as promoting space travel, in my opinion.\u003C/p\u003E\u003Cp\u003EMy feelings about this reflect how I feel when watching the Penny4NASA \u0022we stopped dreaming\u0022 video.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/CbIZU8cQWXc?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-05T03:36:52Z\u0022 title=\u002203/05/2015 03:36  AM\u0022 data-short=\u00229 yr\u0022\u003EMarch 5, 2015\u003C/time\u003E by vger\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Greenfire32","CreatedById":36705,"CreatedDateTime":"2015-03-05T04:23:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AngelLestat\u0022 data-cite=\u0022AngelLestat\u0022\u003E\u003Cdiv\u003EThat is not an idea.. is just an utopia dream\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI guess we\u0027ll just skip the part where the joke flew over your head...\u003C/p\u003E\n"},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2015-03-05T04:46:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kibble\u0022 data-cite=\u0022Kibble\u0022\u003E\u003Cdiv\u003EHuman nature can be changed, or controlled by society. Thirty thousand years ago we were violent, selfish, and ignorant. Now with civilization we might be the same, but violence is controlled by laws and ignorance is controlled by education. Greed can and will be controlled too - probably by some form of socialism/communism.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHuman nature can be changed? Only if we become a robot and we get rid of our body.\u003C/p\u003E\u003Cp\u003EWhat you know how we were thirty thousand years ago?\u003C/p\u003E\u003Cp\u003EIn fact all specialist in that area agree that we had small and very social communities.\u003C/p\u003E\u003Cp\u003EThe life was so hard in those moments, and we had so much terrain, that the most important for survive was babies, work together and exchange people between different groups to avoid genetic erosion.\u003C/p\u003E\u003Cp\u003EIf we become aggresive in some age, it was due the rise of the empires (this start 10000 years ago, not 30000), where too much power rested in one individual and the poppulation increase a lot.\u003C/p\u003E\u003Cp\u003EAlso a misconception where we look the history, is that we think it was too aggresive or drastic all the time, but that happens because we study those war events were the changes happens. But we dont saw in a movie the current normal live of any average citizen of those times.. Because it will be very boring. There was 300 years of peace after the roman empire fundation.\u003C/p\u003E\u003Cp\u003EYou see other animals killing between them without reasons? Or just to eat?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022vger\u0022 data-cite=\u0022vger\u0022\u003E\u003Cdiv\u003EThe question is, do the businesses even care? So far, all we\u0027ve seen is a, \u0022Not my problem\u0022 reaction to this sort of thing. It\u0027s a commonly-held belief, and not just among the upper class, that the only thing keeping EVERY SINGLE PERSON from success is laziness. They somehow are able to ignore any link between poverty rates and the elimination of jobs (entire industries in some cases). How long can this envelope continue to be pushed before something breaks? Who knows.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt does not matter if the businesses care or not, it can not happen because they lose profits. So always the human being will have an asset. In case we dont, there would be no reason to exist, no matter if you use money or not.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI think it\u0027s still an important idea, though I don\u0027t think the goal should be to actually be the catalyst for change. \u003Cp\u003EDevelop technologies, show it off. Let people see how awesome the future could be if we put our minds to it. \u003C/p\u003E\u003Cp\u003EMy feelings about this reflect how I feel when watching the Penny4NASA \u0022we stopped dreaming\u0022 video.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Greenfire32\u0022 data-cite=\u0022Greenfire32\u0022\u003E\u003Cdiv\u003EI guess we\u0027ll just skip the part where the joke flew over your head...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut they need to show how to reach that, or it lose sense.\u003C/p\u003E\u003Cp\u003EIs not the same to the futuristic videos that we saw.. because it was based in the same system.\u003C/p\u003E\u003Cp\u003EHere it shows a futuristic video with another system, and it does not mention how to reach that.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-05T04:57:18Z\u0022 title=\u002203/05/2015 04:57  AM\u0022 data-short=\u00229 yr\u0022\u003EMarch 5, 2015\u003C/time\u003E by AngelLestat\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-03-05T05:16:44Z","Content":"\n\u003Cp\u003ESounds almost like my highschool idea when I was studying a class in sociology. Back then I thought that the most efficient way to manage a society is to have a benevolent dictator. But the concept of \u0022benevolent dictator\u0022 is impossible to apply to human, due to human nature. So a society governed by an advanced AI with a robotic manual work force will allow humanity to live pretty efficiently and equally. Though of course, that was just an idea of a teenager.\u003C/p\u003E\u003Cp\u003EIn the context of reality, that require all human actually agree to be govern by a machine in the first place. And no matter how perfectly benevolent the AI may be, there will be people who will be against it and will attempt to sabotage it.Thus is human.\u003C/p\u003E\u003Cp\u003EAnd then there is a problem of resources - resources are limited, and cannot support an ever increasing population. Which means more radical ideas like population control. Human may needed to be culled by the AI to ensure that the rest can live comfortably. \u003C/p\u003E\u003Cp\u003EThere are a few more things I thought about, but I will just leave it here, because the idea is just impractical.\u003C/p\u003E\u003Cp\u003EWe can\u0027t really reach that kind of utopian society until we embrace transhumanism and evolve beyond humanity.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2015-03-05T05:31:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AngelLestat\u0022 data-cite=\u0022AngelLestat\u0022\u003E\u003Cdiv\u003EHuman nature can be changed? Only if we become a robot and we get rid of our body.\u003Cp\u003EWhat you know how we were thirty thousand years ago?\u003C/p\u003E\u003Cp\u003EIn fact all specialist in that area agree that we had small and very social communities.\u003C/p\u003E\u003Cp\u003EThe life was so hard in those moments, and we had so much terrain, that the most important for survive was babies, work together and exchange people between different groups to avoid genetic erosion.\u003C/p\u003E\u003Cp\u003EIf we become aggresive in some age, it was due the rise of the empires (this start 10000 years ago, not 30000), where too much power rested in one individual and the poppulation increase a lot.\u003C/p\u003E\u003Cp\u003EAlso a misconception where we look the history, is that we think it was too aggresive or drastic all the time, but that happens because we study those war events were the changes happens. But we dont saw in a movie the current normal live of any average citizen of those times.. Because it will be very boring. There was 300 years of peace after the roman empire fundation.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E30.000 years ago it was not many people so it was probably not much violence, trying to be violent inside an group of say 30-50 people will not end well for you, and few reasons to go to war as people was too spread out, it would also be insanely dangerous as if you lost too many people fighting your tribe might go under. \u003C/p\u003E\u003Cp\u003EMost fun however is that its probably the setting where Utopian communism works well. You need an thigh knit group of people where everyone knows everyone well. \u003C/p\u003E\u003Cp\u003ESocial pressure would make it very hard to either slack off to much or hoard stuff, not that it was so many different items to hoard. \u003C/p\u003E\u003Cp\u003EIn an larger group say 1000 this would be an issue and the problem would increase as you could not manage with an flat structure, you would need leaders. Social pressure would be weaker as you would not care so much about that strangers you don\u0027t really know think about you, you status inside an sub group like the leadership group would be far more important.\u003C/p\u003E\n"},{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2015-03-05T05:33:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RainDreamer\u0022 data-cite=\u0022RainDreamer\u0022\u003E\u003Cdiv\u003EIn the context of reality, that require all human actually agree to be govern by a machine in the first place. And no matter how perfectly benevolent the AI may be, there will be people who will be against it and will attempt to sabotage it.Thus is human.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe idea has been put forth by a number of different sci-fi stories. THX-1138, Logan\u0027s Run, numerous episodes of Star Trek, The Day the Earth Stood Still. I can\u0027t say whether or not such a civilization is a good idea or a bad idea. But as far as resistance to change is concerned, major changes have ALWAYS started with just one person\u0027s idea, and then it spreads. The idea of using a computer to control us though is almost metaphorical. Everything seems to boil down to the fact that we are driven by instincts that are no longer beneficial to the race as a whole. When we were hunting mammoths, only 1 out of 5 kids survived, everything was trying to eat us, etc. All the fighting, mating, hoarding; it all made sense. It doesn\u0027t make sense now, but it still wants to control everything. Barring a really brilliant way of altering our biochemistry/hormones (and that\u0027s really no less violating of freedoms than a mechanized dictator), an external equivalent of a Fruedian super-ego, doesn\u0027t really seem so ridiculous an idea. The only other alternative is to hope we survive a few million years as we are; long enough that our more primal urges get weeded out of the gene pool on their own.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EAnd then there is a problem of resources - resources are limited, and cannot support an ever increasing population. Which means more radical ideas like population control. Human may needed to be culled by the AI to ensure that the rest can live comfortably.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat is going to happen no matter what. Regardless of what kind of government/society we have, population control is going to become an issue. And really when you think about it, reproduction comes from the same mindless instincts that produce greed. Our evolutionary behavioral programming, sadly, has absolutely no idea of how to adapt to the environment that we currently live in.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-05T05:39:48Z\u0022 title=\u002203/05/2015 05:39  AM\u0022 data-short=\u00229 yr\u0022\u003EMarch 5, 2015\u003C/time\u003E by vger\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-03-05T05:45:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022magnemoe\u0022 data-cite=\u0022magnemoe\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EMost fun however is that its probably the setting where Utopian communism works well. You need an thigh knit group of people where everyone knows everyone well. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think it goes back to the idea of the Monkeysphere (or more academically, Dunbar\u0027s number). It is easier to steal and hoard and commit acts of a sociopath when the people around you are just random blots of identity and numbers in your mind. It is just easier to justify in your mind when you are not considering people as people.\u003C/p\u003E\u003Cp\u003E It is harder, however, to steal from that friend Jeff who grew up with you and has been hanging with you forever, sharing both good and bad times, and it is harder to not help him if he is in need, when you know he will also do the same to you if you are in need.\u003C/p\u003E\u003Cp\u003EWhen we are still in small tribal community, close knitted group need each others, and because everyone know everyone else, sociopath will be left behind for the lions. However in the current society where you are surrounded with so many people they stop looking like people, being a sociopath is much easier, and much more profitable. Being nice now is \u003Cem\u003Eactually\u003C/em\u003E hard, and less rewarding toward your own survival.\u003C/p\u003E\u003Cp\u003EOur empathy have not evolved enough to encompass the whole humanity.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-05T05:47:03Z\u0022 title=\u002203/05/2015 05:47  AM\u0022 data-short=\u00229 yr\u0022\u003EMarch 5, 2015\u003C/time\u003E by RainDreamer\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Aanker","CreatedById":70274,"CreatedDateTime":"2015-03-05T05:59:35Z","Content":"\n\u003Cp\u003EThe question is if a benevolent AI ruler, if possible, is even desirable from moral and social viewpoints. If you take away the ability of the little guy to influence his life and choices, then he will grow weary. If you remove the large-scale societal feedback provided by polls and elections, you will grow detached from who you are ruling, and your decisions (although well-intended, see AI) will not please the populace. If you do both, you have a revolution on your hands. If you do either but not both, you lack the needed complete control. If you do none, you might as well ask yourself why you didn\u0027t stick with the old system.\u003C/p\u003E\u003Cp\u003EFurthermore the scenario begs the question, what is the goal of all this? Happiness? Wealth? Saving the Earth? With all the associated problems of what the purpose of our existance is... and who gave you the right to formulate this goal to the AI that will rule us.\u003C/p\u003E\u003Cp\u003EAnd would the goal be worth the cost of subjugating/eliminating those against?\u003C/p\u003E\u003Cp\u003EIn the end the concept of a beneficial dictator is unproven, perhaps because dictatorships are inherently damaging or limiting in their nature. And ultimately, in an age where no land is an island, given the free choice I\u0027m willing to bet many of us would rather live in a democracy.\u003C/p\u003E\n"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-03-05T06:08:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Aanker\u0022 data-cite=\u0022Aanker\u0022\u003E\u003Cdiv\u003Egiven the free choice I\u0027m willing to bet many of us would rather live in a democracy.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGiven the low voter turn out in the U.S, sometimes I doubt that. I still have hope for democracy though.\u003C/p\u003E\n"},{"CreatedByName":"Newt","CreatedById":131025,"CreatedDateTime":"2015-03-05T06:19:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Aanker\u0022 data-cite=\u0022Aanker\u0022\u003E\u003Cdiv\u003EIn the end the concept of a beneficial dictator is unproven, perhaps because dictatorships are inherently damaging or limiting in their nature. And ultimately, in an age where no land is an island, given the free choice I\u0027m willing to bet many of us would rather live in a democracy.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAccording to Cicero, at least, a dictatorship can be the most efficient and effective government possible, iff the dictator is benevolent and intelligent. If not, it can be the worst. And their successor is. And their successor is. And their successor is, ad infinitum. Republics such as are popular today seek to balance the ideas of vesting power in a few individuals as the \u0027dictators\u0027, and the wider population, as well as the elite, through democratic election of representative bodies and high officials. This ideally balances to make a government that is perhaps slower than an ideal dictatorship, but quicker than an anarchic pure democracy (in which all choices are made by all people. In the best of circumstances this is very slow), and balances the possibility of poorly selected officials with the needs to get past the representatives.\u003C/p\u003E\u003Cp\u003EAs for the website:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The Venus Project\u0022 data-cite=\u0022The Venus Project\u0022\u003E\u003Cdiv\u003EIt calls for a straightforward redesign of our culture\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis line jumped out at me, as well, since when has redesigning culture been straightforward? Generally such developments take ages to develop, and attempts to hasten change are generally termed genocide from what I can see. There are some aspects of the ideas here which are, from what I can tell viable, but in general, it seems like a fun exercise of \u0027what if?\u0027.\u003C/p\u003E\n"}]}