{"TopicId":101416,"ForumId":69,"TopicTitle":"Missing Kerbals after safe landing.","CreatedByName":"Rasheeke","CreatedById":20217,"CreatedDateTime":"2015-03-07T00:53:25Z","PageNum":1,"Articles":[{"CreatedByName":"Rasheeke","CreatedById":20217,"CreatedDateTime":"2015-03-07T00:53:25Z","Content":"When I land safely and recover vessel I still end up missing the Kerbal(s). \n\nI\u0027ve looked through pages of the support forums and haven\u0027t seen this posted yet. \n\nHelp would be appreciated."},{"CreatedByName":"TheMoonRover","CreatedById":136199,"CreatedDateTime":"2015-03-07T02:26:30Z","Content":"This sounds like a bug with carrying over an old save from a previous version. If you have have carried over an old save, follow these steos: First backup your the persistent.sfs file from KSP/saves/[your save name] then open it. Look for sections close to the top called ScenarioDestructibles and ScenarioVesselRecovery (or something like that). One or both of them will likely be missing. If they are missing, start a new save and open the persistent.sfs file for the new save. Copy the relevant SCENARIO{} modules to your main save. If that doesn\u0027t work, post the persistent.sfs and output log\\* on here.\n\n\\*You must have experienced the bug in the most recent game session for this to be useful."},{"CreatedByName":"Rasheeke","CreatedById":20217,"CreatedDateTime":"2015-03-07T04:10:51Z","Content":"It seems I have an old save from a long time ago. I have a lot of science progress, but it seems to be the old days when careers were only science. It\u0027s clearly a Science save but it shows the Career icon. For now I\u0027m restarting a whole new Career save. I am not allowed to post attachements. If you know how to pull the science progress over into the new Career that\u0027d be great. Or at least to fix this file just in case I want to go back to it."},{"CreatedByName":"TheMoonRover","CreatedById":136199,"CreatedDateTime":"2015-03-07T13:08:14Z","Content":"If your only issue is with recovering Kerbals, you need to paste this into the persistent.sfs between two other similar sections.\n\n        SCENARIO    {        name = VesselRecovery        scene = 5, 7, 8, 6    }\n\nIf that\u0027s the only issue with the save, the other missing sections must have automatically generated. But make sure contracts, strategies, buildings and kerbal experience are working properly. Kerbals will probably start with 0 XP as the game had no way of saving what each kerbal did until 0.90 (except when they were the first to accomplish something)\n\n**Edited \u003Ctime datetime=\u00222015-03-07T13:12:08Z\u0022 title=\u002203/07/2015 01:12  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 7, 2015\u003C/time\u003E by TheMoonRover**"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2015-03-07T23:14:38Z","Content":"If your save is from that long ago, then it\u0027s likely that you\u0027ll run into a lot of problems trying to bring it forward to 0.90 at this point. Saves sometimes survive one update to the next (because \u0022save upgrade safe\u0022 code is often included in the update). But I think enough things have changed that I would suspect your save will run into quite a few problems.\n\nIf all you want is the science progress (and you don\u0027t care about vessels), then start a new save. Then open both the old and new persistence.sfs, and copy over the ResearchAndDevelopment block and the Science block. You *might* be able to do that since I think most of the internal part names are unchanged. You\u0027ll have to go back into the R\u0026D center to unlock new parts that are in nodes you have already purchased. I would say it\u0027s still likely to have problems though, since they have shuffled around a lot of parts plus they introduced biomes on all planets/moons.\n\nAs a side note, nobody is allowed to attach or upload files directly into the forums. If you would like to share saves or pictures, you\u0027ll have to host them on another place (like pastebin, dropbox, imgur, etc...) and post a link on here.\n\nCheers,\n\n~Claw"}]}