{"TopicId":101408,"ForumId":15,"TopicTitle":"Specular Edges Appearing on Rounded Meshes","CreatedByName":"Ven","CreatedById":109931,"CreatedDateTime":"2015-03-06T23:04:44Z","PageNum":1,"Articles":[{"CreatedByName":"Ven","CreatedById":109931,"CreatedDateTime":"2015-03-06T23:04:44Z","Content":"I\u0027ve been getting this weird lighting error for a while now, ever since I started manually breaking apart my models to make UV unwrapping simpler. In this case I broke up the following SRB into 8 sections and then rotated and mirrored tha new sections to complete the cylinder. When imported into Unity, however, the seams are visible when specular is enabled.\n\nThe textures are mirrored, so this problem shouldn\u0027t be caused by the texture, but rather the model.\n\nI\u0027ve removed the normal map, so that isn\u0027t causing the problem either. \n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/rLE79)\n\nThanks for reading~"},{"CreatedByName":"landeTLS","CreatedById":97925,"CreatedDateTime":"2015-03-07T03:02:25Z","Content":"Man ven. You are a way better texture artist than me so im not sure how much i can contribute here.\n\nFirst im going to assume you are using a baked speculear map. it doesnt look like you didnt merge doubles after mirroring but then again you didnt mention it. Perhaps you used the mirror modifier in blender that does that for you?\n\nbut if the issue lies in the spec map i guess id suggest baking your spec map after adding a circulear array(if youre using blender) so your object looks like it will when complete while baking. Since baking is dependent on geometry flow, any edges(like on a 90degree cone segement) will catch highlights etc. Near those edges that would not be there on the completed(360 degree part) i use circulear arrays but ive seen some people use rotated duplicates while baking too.\n\nAnyway. For repeating/tiling textures on cylinders/cones it might be a good idea to use arrays instead of mirrors as the resulting uvs and geometry will be arranged going in one direction But im not an expert on the subject\n\n**Edited \u003Ctime datetime=\u00222015-03-07T03:08:59Z\u0022 title=\u002203/07/2015 03:08  AM\u0022 data-short=\u00229 yr\u0022\u003EMarch 7, 2015\u003C/time\u003E by landeTLS**"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2015-03-07T10:20:29Z","Content":"Are you sure the mesh is manifold?\n\nIs there a normal map?"},{"CreatedByName":"Van Disaster","CreatedById":58876,"CreatedDateTime":"2015-03-07T13:00:49Z","Content":"Hard edges? you sure everything is welded properly after your mirror operation?"}]}