{"TopicId":101727,"ForumId":55,"TopicTitle":"IAS, Autolevel, Yaw Stability Assist, Mach One Indicator","CreatedByName":"FourGreenFields","CreatedById":139309,"CreatedDateTime":"2015-03-11T14:23:19Z","PageNum":1,"Articles":[{"CreatedByName":"FourGreenFields","CreatedById":139309,"CreatedDateTime":"2015-03-11T14:23:19Z","Content":"Sorry, accidentally pressed enter as changing the title. Wanted to remove Autolevel and Yaw Stability assist.\n\n2 suggestions I thought of when flying planes. Both minor, and easily explained, which is why I put them in one thread.\n\nThe first one is Indicated Air Speed (IAS). Its basicly the air pressure coming from 12 o\u0027clock. Currently, speed is only shown as TAS (True Air Speed). \n\nTAS is ofcourse helpfull, but when flying planes, IAS is what shows you how your plane will handle, as a lower air density will also reduce IAS. IAS shows you how effective your control surfaces will be, how much lift your wings produce, etc.\n\nThe 2. thing is a Mach One Indicator. Mach one (speed of sound) is importand because as you reach mach one drag increases massively (I realy hope that\u0027s modelled, havent checked yet). However, mach one changes depending on air density, so you cant just memorize one number and try to stay slower than that.\n\nIt would be nice if we\u0027d have an indicator showing mach one at our current position.\n\n**Edited \u003Ctime datetime=\u00222015-03-11T14:38:34Z\u0022 title=\u002203/11/2015 02:38  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 11, 2015\u003C/time\u003E by FourGreenFields**"},{"CreatedByName":"McPoisoned","CreatedById":138265,"CreatedDateTime":"2015-03-11T14:41:28Z","Content":"I like the Idea of adding those features to the stock gaming. For now you can use [Ferram Aerospace](https://forum.kerbalspaceprogram.com/threads/20451-0-90-Ferram-Aerospace-Research-v0-14-6-12-27-14), it gives a lot of flight Information and realistic Aerodynamics."},{"CreatedByName":"Crzyrndm","CreatedById":92871,"CreatedDateTime":"2015-03-12T03:38:58Z","Content":"IAS would be useful (is available with FAR)\n\nStock 0.90 has the same old terrible aero system it\u0027s always had. Lift is based on the sum of wing modules, drag is based on mass, shape/orientation doesn\u0027t matter, etc. etc., so no there is no drag increase around Mach 1\n\nFAR on the other hand... (also has basic wing leveller level and yaw stabiliser aids)"},{"CreatedByName":"FourGreenFields","CreatedById":139309,"CreatedDateTime":"2015-03-12T09:40:20Z","Content":"I think it said somewhere there that it causes problems with 64 bit versions...\n\nWhich (ofcourse...) I have. Any chance you could tell me how to switch to 32 bits?"},{"CreatedByName":"Crzyrndm","CreatedById":92871,"CreatedDateTime":"2015-03-12T19:26:59Z","Content":"64-bit KSP, not 64-bit Windows. Unless you choose otherwise you will be running 32-bit KSP (on the first screen in the main menu, if you\u0027re running 64-bit the build number will have an x64 after it).\n\nSteam runs 32-bit unless told otherwise, I assume the store version is the same deal."},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-03-12T19:37:12Z","Content":"\u003E \n\u003E Steam runs 32-bit unless told otherwise, I assume the store version is the same deal.\n\nYou explicitly choose which version to download from the store. Despite the clear \u0022UNSTABLE\u0022 label on Win64, people still download it because 64\u003E32."},{"CreatedByName":"FourGreenFields","CreatedById":139309,"CreatedDateTime":"2015-03-12T19:48:06Z","Content":"\u003E \n\u003E 64-bit KSP, not 64-bit Windows. Unless you choose otherwise you will be running 32-bit KSP (on the first screen in the main menu, if you\u0027re running 64-bit the build number will have an x64 after it).\n\u003E Steam runs 32-bit unless told otherwise, I assume the store version is the same deal.\n\nbuildID64.txt\n\nLike this? ![:(](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif) I suppose I need to reinstall and choose 32 bits this time?"}]}