{"TopicId":10178,"ForumId":34,"TopicTitle":"[PLUGIN][PART][0.15] Lag\u0027s Lazy Parts v.02","CreatedByName":"Doctor Lag","CreatedById":23856,"CreatedDateTime":"2012-05-05T03:16:09Z","PageNum":1,"Articles":[{"CreatedByName":"Doctor Lag","CreatedById":23856,"CreatedDateTime":"2012-05-05T03:16:09Z","Content":"Summary: These parts are essentially stock parts that help you greatly with a few of the less-engaging parts of the game without affecting most of the gameplay.\n\nUpdate : The smart decouplers seem to be having some trouble with 15.1. I have no idea why since this was just a bug fix release (plus some really shiny engine flames) but I\\\u0027m hoping to have time to look into it this weekend. For now please don\\\u0027t rely on the \\\u0027smart\\\u0027 Lazy parts working with 15.1.\n\nThese all work great with 0.15, no need to update.\n\nThese parts are ones that I built based heavily on the example code from [http://kspwiki.nexisonline.net/wiki/Module_code_examples#Automatically_activating_the_next_stage.](http://kspwiki.nexisonline.net/wiki/Module_code_examples#Automatically_activating_the_next_stage.) All parts use stock stats, skins and textures.\n\nThe \\\u0027auto\\\u0027 decouplers (both stack and radial) detect when the engines attached to them have run out of fuel and automatically advance to the next stage. This takes the randomness out of exactly when stage separation occurs so it might be handy for the ultra-efficiency experts around here, or for the folks like myself who like to build and then just watch the launch with a beer in hand. 8)\n\nThe \\\u0027smart\\\u0027 radial decouplers go the extra step of not caring what stage they\\\u0027re in. They\\\u0027ll individually decouple no matter where they are in your staging. So, you can use the auto decouplers between stages and smart radials in a big smashup of a stage toward the top of your rocket; this is as close as these get to being cheat parts. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nThe \\\u0027auto\\\u0027 ASAS module will reset your time zoom to 1x when you enter a different sphere of influence. So when you\\\u0027re flying to mun or Kurbol (or back from), you can leave your time at 1000x without worry that you\\\u0027ll miss the orbit window.\n\nBinaries and source attached. If you prefer a non-forum link use the SkyDrive download below. Enjoy!\n\n[https://skydrive.live.com/embed?cid=2BF8C1176BA43039\u0026resid=2BF8C1176BA43039%21133\u0026authkey=AJ_vJ0HpVLDTIQQ](https://skydrive.live.com/embed?cid=2BF8C1176BA43039\u0026resid=2BF8C1176BA43039%21133\u0026authkey=AJ_vJ0HpVLDTIQQ)\n\nAfter installing the parts, try the attached \\\u0027Nailbiter\\\u0027 ship (forum attach only so I assume you have to be logged in) to see the auto-staging parts in action. Enable the SAS, throttle up to max and hit spacebar one time. The decoupler will kick in eventually and then it comes within ~300 meters or so of crashing. After that it\\\u0027ll get to a decent altitude (~26k) and then poor staging will destroy the craft. Note that use of \\\u0027smart\\\u0027 decouplers would make this flyable. It\\\u0027s left as an exercise for the reader. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"Tosh","CreatedById":11055,"CreatedDateTime":"2012-05-05T04:16:28Z","Content":"A good job ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nBut you need to (a) start a topic name with [PLUGIN, PART, 0.14] indicating that your parts are not compatible with free KSP demo version, and (![B)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png) ask some moderator to move your topic to [Plugin-Powered Addon Releases](http://kerbalspaceprogram.com/forum/index.php?board=40.0) section. \n\nSee [Demo Version Compatibility Notice](http://kerbalspaceprogram.com/forum/index.php?topic=9487.0) post for more info."},{"CreatedByName":"Doctor Lag","CreatedById":23856,"CreatedDateTime":"2012-05-05T05:17:14Z","Content":"Thanks Tosh, although I started this in the wrong forum now it\\\u0027s found its home. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"Doctor Lag","CreatedById":23856,"CreatedDateTime":"2012-05-10T02:16:32Z","Content":"Update for v .02; all parts\\\u0027 binaries and source are now in a single zip and I added a non-forum link for the guest users.\n\nThanks to EndOfTheEarth for the idea to automatically reset zoom on SOI change."},{"CreatedByName":"Doctor Lag","CreatedById":23856,"CreatedDateTime":"2012-05-18T04:05:59Z","Content":"Minor update: testing complete on 0.15 and all systems are go. Also this update looks \\_fantastic\\_ so going to play with it now. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"}]}