{"TopicId":101842,"ForumId":18,"TopicTitle":"How would a mobile KSP work?","CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-03-12T23:53:00Z","PageNum":1,"Articles":[{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-03-12T23:53:00Z","Content":"\n\u003Cp\u003EWe have SimpleRockets, which is a great mobile KSP-alike. It is in 2D.\u003C/p\u003E\u003Cp\u003ELet\u0027s imagine though, that we (And let\u0027s pretend we are Squad) want to design a 3D Mobile Kerbal Space Program spinoff. We have to design using the touch screen, not fighting it. This pretty much means no joysticks, at least not for normal things. Joysticks might make sense on a space game I guess.\u003C/p\u003E\u003Cp\u003ERefer to this video for designing with a touch screen.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/NBHircZu5EI?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EAnd also ignore the bit about not translating an old game into a touch form, for the sake of argument.\u003C/p\u003E\u003Cp\u003ESo I would have a throttle and a mechanic where you can just drag around the navball to turn.\u003C/p\u003E\u003Cp\u003EFor features, I would limit them considerably.\u003C/p\u003E\u003Cp\u003ELess parts, no probe parts (Except perhaps 1 robotically controlled core)\u003C/p\u003E\u003Cp\u003ENo electricCharge parts. \u003C/p\u003E\u003Cp\u003EOnly have a few planets. Kerbin, Mun, Duna, Ike, Eve, Jool, Laythe, Vall, Tylo. Maybe even remove Moho.\u003C/p\u003E\u003Cp\u003ENo asteroids, you\u0027ll notice. And I mean that literally. Not just no NKOs, but also no small planetoids.\u003C/p\u003E\u003Cp\u003ENot just lower the texture quality, but remodel the parts so that they\u0027re less \u0022expensive\u0022 on the tablet.\u003C/p\u003E\u003Cp\u003ETo account for this, make the art style further stylized.\u003C/p\u003E\u003Cp\u003EFor extra features to help with the touch interface or mobile style:\u003C/p\u003E\u003Cp\u003EAbility to translate parts in placement mode.\u003C/p\u003E\u003Cp\u003EThottle Control onscreen\u003C/p\u003E\u003Cp\u003EPitchyawroll controlled by dragging the navball in the direction you want to go.\u003C/p\u003E\u003Cp\u003ETranslation is controlled separately by translation buttons in a separate control mode.\u003C/p\u003E\u003Cp\u003ESimplify Career Mode.\u003C/p\u003E\u003Cp\u003E-Merge Science and Funding.\u003C/p\u003E\u003Cp\u003E-Remove Rep.\u003C/p\u003E\u003Cp\u003E-smallify tech tree.\u003C/p\u003E\u003Cp\u003EBut could a mobile KSP work? Well, there\u0027s a mobile Space Simulator for iOS, and it\u0027s more like Orbiter. Really complex. So I think it would work.\u003C/p\u003E\u003Cp\u003EThoughts?\u003C/p\u003E\u003Cp\u003E(I hope this may have inspired someone to go out and make a mobile space simulator that involves 3D building of rockets.)\u003C/p\u003E\n"},{"CreatedByName":"RAINCRAFTER","CreatedById":127524,"CreatedDateTime":"2015-03-12T23:55:23Z","Content":"\n\u003Cp\u003EEC, yay! I LOVE Extra Credits.\u003C/p\u003E\u003Cp\u003EAlso, you ideas are very nice in my opinion.\u003C/p\u003E\n"},{"CreatedByName":"Brethern","CreatedById":15602,"CreatedDateTime":"2015-03-13T00:12:14Z","Content":"\n\u003Cp\u003EHonestly making it into a science puzzle game would be a better way to go. Instead of making it into a try and control a rocket on a touch screen it should be more like how small of a rocket can I make to get to the mun. Or can I build a rocket that can reach orbit and put three different satellites in different orbits.\u003C/p\u003E\u003Cp\u003EThe problem with KSP is that all the cool things you can do with it takes time to learn. Even using a tried and true control system.\u003C/p\u003E\n"},{"CreatedByName":"kenbobo","CreatedById":70629,"CreatedDateTime":"2015-03-13T00:17:17Z","Content":"\n\u003Cp\u003EA KSP alike game is \u003Ca href=\u0022https://itunes.apple.com/us/app/space-agency/id542397575?mt=8\u0022 rel=\u0022external nofollow\u0022\u003ESpace Agency\u003C/a\u003E and Scott Manley did a video a while back, but it has been updated with a whole bunch of new features.\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/Dt_0IpTdKvU?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E is Scott Manley\u0027s video.\n"},{"CreatedByName":"Special Agent Sigvan","CreatedById":92033,"CreatedDateTime":"2015-03-13T02:28:20Z","Content":"\n\u003Cp\u003EStep 1: Think of putting KSP on mobile.\u003C/p\u003E\u003Cp\u003EStep 2: Slap yourself for thinking such a silly idea.\u003C/p\u003E\u003Cp\u003E -2.5: Gasp in horror at the lag once you do put it on mobile.\u003C/p\u003E\u003Cp\u003EStep 3: Back to playing Dying Light.\u003C/p\u003E\u003Cp\u003EStep 4: Chuckle and profit.\u003C/p\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-03-13T16:45:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022kenbob5588\u0022 data-cite=\u0022kenbob5588\u0022\u003E\u003Cdiv\u003EA KSP alike game is \u003Ca href=\u0022https://itunes.apple.com/us/app/space-agency/id542397575?mt=8\u0022 rel=\u0022external nofollow\u0022\u003ESpace Agency\u003C/a\u003E and Scott Manley did a video a while back, but it has been updated with a whole bunch of new features.\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/Dt_0IpTdKvU?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E is Scott Manley\u0027s video.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESpace Agency is horrible. It\u0027s a cheap minigame collection tied together with an uber-linear career mode with horrible orbital physics.\u003C/p\u003E\n"},{"CreatedByName":"Ethanadams","CreatedById":136913,"CreatedDateTime":"2015-03-13T16:49:57Z","Content":"\n\u003Cp\u003EKsp honestly would be a lot more better on Xbox because of the way the Xbox works with entity\u0027s and how much ram it has and it would be more interactive the controls easier to under stand and achievements \u003C/p\u003E\u003Cp\u003E(please don\u0027t kill me for saying this)\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2015-03-13T17:00:09Z","Content":"\n\u003Cp\u003Earm processors lack the flops neccisary for high end physics calculations. i still think they are two orders of magnitude behind in the floating point performance department.\u003C/p\u003E\u003Cp\u003Eyou could do it, but at a severe cost to object complexity, number of objects, etc. get rid of the structural aspects, use primitive collision hulls and limit the number of parts, and you might pull it off.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-13T17:02:21Z\u0022 title=\u002203/13/2015 05:02  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 13, 2015\u003C/time\u003E by Nuke\u003C/strong\u003E\n\u003C/span\u003E\n"}]}