{"TopicId":101879,"ForumId":44,"TopicTitle":"Space Launch System\u0026#039;s Stretchy Tanks","CreatedByName":"Kibble","CreatedById":131042,"CreatedDateTime":"2015-03-13T17:20:33Z","PageNum":1,"Articles":[{"CreatedByName":"Kibble","CreatedById":131042,"CreatedDateTime":"2015-03-13T17:20:33Z","Content":"\n\u003Cp\u003EEver since I learned of SLS\u0027s configuration with the five segment boosters and stretched core, I\u0027ve wondered why they did that, since it just adds developement time. But yesterday I was working to Photoshop (somebody else\u0027s) art of Space Shuttle into System, and it seemed to naturally evolve that way. Making the core inline means taking the ogive and making it a cylinder. Since the tank walls are the structure, the tank increased in size - room for a lot more oxygen. That means you have to stretch the hydrogen tank with another ring. But since the interstage between the tanks is the main structure supporting the vehicle from the thrust of the SRBs, it makes it too high for the SRB attachment point, so you have to add another segment.\u003C/p\u003E\u003Cp\u003EThis may just be a coincidence though. Is this (but less stupid, and done by professionals) the design process that led to the current configuration of Space Launch System, or something else entirely?\u003C/p\u003E\u003Cp\u003EHere\u0027s my Photoshop I think it turned out alright. From Skrabek\u0027s \u003Cem\u003ERockets of the World\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.ezimba.com/work/150314C/ezimba11596816110700.png\u0022 alt=\u0022ezimba11596816110700.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Budgie","CreatedById":13840,"CreatedDateTime":"2015-03-13T20:18:19Z","Content":"\n\u003Cp\u003EDoesn\u0027t sound off to me! But what do I know. Anyway, aren\u0027t the bottoms of the SRBs supposed to be on or close to the same plane as the RS-25s?\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.nasaspaceflight.com/2014/11/sls-manifest-europa-mars-sample-return-missions/\u0022 rel=\u0022external nofollow\u0022\u003EPics in this article\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kibble","CreatedById":131042,"CreatedDateTime":"2015-03-13T20:46:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Budgie\u0022 data-cite=\u0022Budgie\u0022\u003E\u003Cdiv\u003Earen\u0027t the bottoms of the SRBs supposed to be on or close to the same plane as the RS-25s?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t know - External Tank on Space Shuttle ends just below the top of the last segment of SRB. I just went off that and added the rocket engines and mounts. Maybe I\u0027ll change it when I\u0027m feeling less lazy!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-13T20:48:11Z\u0022 title=\u002203/13/2015 08:48  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 13, 2015\u003C/time\u003E by Kibble\u003C/strong\u003E\n\u003C/span\u003E\n"}]}