{"TopicId":10189,"ForumId":21,"TopicTitle":"[Stock] [0.14] First Mun Rocket","CreatedByName":"Parabellum","CreatedById":24222,"CreatedDateTime":"2012-05-05T10:46:48Z","PageNum":1,"Articles":[{"CreatedByName":"Parabellum","CreatedById":24222,"CreatedDateTime":"2012-05-05T10:46:48Z","Content":"This is my first forum post, so hi everyone!\n\nThis is my first attempt at making a rocket that will take me to the Mun.\n\n![ExperimentalMunRocket-1.png](http://i453.photobucket.com/albums/qq254/Wolfguy95/ExperimentalMunRocket-1.png)\n\nI didn\\\u0027t weigh the craft, but the 6 RT-10 solid-fuel booster engines plus the 9 LV-T30 liquid-fuel engines in the first stage give me a thrust of 2,550, which positively, pardon the pun, rockets the craft into the air. The 9 liquid-fuel engines are fed by 21 FL-T500 fuel tanks, with a total burn time of 2:35. By the time the fuel runs out I\\\u0027m at 34,450m. While the rocket is in it\\\u0027s first stage, it is kept steady with 12 AV-R8 Winglets, 6 S.A.S. Modules and 4 Advanced S.A.S. Modules.\n\nThe second stage is 3 LV-T30 engines fed by 12 FL-T500 fuel tanks, and was actually the basis for my first orbital craft. All I did is remove the RT-10s and winglets.\n\nThe third stage is an LV-909 engine fed by a single FL-T500 tank, an Advanced SAS Module, an FL-R25 RCS Fuel Tank and 4 RCS Thrusters. At the very top is perched my capsule.\n\nThe objective is to achieve Muner orbit, then return to Kerbin, and the idea is that the first stage will take me to the upper atmosphere, the second stage will take me into orbit, take me to the Mun and back, then the third stage will allow me to re-enter Kerbin\\\u0027s atmosphere.\n\nWill it work? I have no idea. All I\\\u0027ve done with it is launch it straight up to test stability, staging and thrust-to-weight ratios. If this rocket doesn\\\u0027t work, I have another waiting in the wings that I copied from the forum that should work.\n\nAnyway, tell me what you think!"},{"CreatedByName":"Android089","CreatedById":22630,"CreatedDateTime":"2012-05-07T18:26:20Z","Content":"A few suggestions for you: you only need 1 Advanced SAS. Having more then 1 does not add anything. (Other than weight) Stacking regular SAS does have bonus effects though. And you might want to add some RCS\\\u0027s to the second stage. It has the non-gimbaling engines so I can imagine it doesn\\\u0027t turn very well.\n\nIt looks like a good design though. Good luck on your mun mission."},{"CreatedByName":"that1guy","CreatedById":14276,"CreatedDateTime":"2012-05-07T19:05:39Z","Content":"looks like you may have something there, good luck to you"},{"CreatedByName":"Falaris","CreatedById":24660,"CreatedDateTime":"2012-05-08T11:40:32Z","Content":"Funny thing is, I made a surprisingly similar design, and it worked rather well - it had plenty power to get to the moon and back. I don\\\u0027t have the aim for it, though, but fortunately, the cloning farm keeps getting me new Kerbal pilots. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nThe differences were mainly 3 more boosters, no SAS/RCS modules on top of the first stage, more fuel and RCS fuel on the last stage, and 6 more tanks on the second stage. \n\nI might want to nab your extra SAS / RCS modules, one in three launches the rocket gets homesick a bit early and goes into a dive, which is Bad. \n\nJust bought the beta proper instead of just the demo, hopefully it will stop randomly exploding on the launch pad after a crash. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nAttached is the last version I made of it, I don\\\u0027t recall if it was very workable at the moment though, but it clearly demonstrates how similar the designs were, which were uncanny. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"Rickenbacker","CreatedById":2349,"CreatedDateTime":"2012-05-08T17:40:14Z","Content":"It\\\u0027ll work. It\\\u0027s got probably 3-4 times the fuel and engines you NEED to get to the Mun and back, but I don\\\u0027t see any reason why it won\\\u0027t work ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)."}]}