{"TopicId":101871,"ForumId":55,"TopicTitle":"Conract grouping, comments at rename vessel dialogue, Custom flight types","CreatedByName":"Robje","CreatedById":59484,"CreatedDateTime":"2015-03-13T10:53:07Z","PageNum":1,"Articles":[{"CreatedByName":"Robje","CreatedById":59484,"CreatedDateTime":"2015-03-13T10:53:07Z","Content":"\n\u003Cp\u003EDear community, Squad,\u003C/p\u003E\u003Cp\u003EI realise it\u0027s kind of late in the game (pun intended) but i would like to suggest a feature or two, three:\u003C/p\u003E\u003Cp\u003E1: \u003Cstrong\u003EConract grouping:\u003C/strong\u003E I would like to see some way to group active contracts. This would allow you to cluster contracts according to relevance, priority or specific missions.\u003C/p\u003E\u003Cp\u003E2: \u003Cstrong\u003EComments/description at the \u0027\u0027Rename vessel\u0027\u0027 dialogue:\u003C/strong\u003E I would like to see space to add comments there. Similar to the way you can add a description at the VAB, underneath the design name. This would allow us to add information that you can revisit at the tracking station. This would seem very usefull when you are directing (very) long term, complex, missions. Especially when you have multiple active missions.\u003C/p\u003E\u003Cp\u003E3: \u003Cstrong\u003EAbillity to archive flights/missions:\u003C/strong\u003E Sometimes i have very long term missions or even historic, inactive, operational missions. These add up. I would like a way to \u0027\u0027ghost\u0027\u0027 them out af the tracking station. For clarity.\u003C/p\u003E\u003Cp\u003EThis could likely be combined with my next suggestion:\u003C/p\u003E\u003Cp\u003E4: \u003Cstrong\u003ECustom flights types at tracking station:\u003C/strong\u003E For one reason: see suggestion 3. Others might like to group active missions, landed aircraft, satelites, manned missions, interplanetary missions, science missions, test flights, \u003Cstrong\u003Eflags!!\u003C/strong\u003E, failures, whatever....\u003C/p\u003E\u003Cp\u003EAny thoughts?\u003C/p\u003E\u003Cp\u003EKinds regards,\u003C/p\u003E\u003Cp\u003ERobje\u003C/p\u003E\n"}]}