{"TopicId":101978,"ForumId":16,"TopicTitle":"Deadly Re-Entry: RCS Thrusters Question","CreatedByName":"worir4","CreatedById":75980,"CreatedDateTime":"2015-03-15T00:57:13Z","PageNum":1,"Articles":[{"CreatedByName":"worir4","CreatedById":75980,"CreatedDateTime":"2015-03-15T00:57:13Z","Content":"I have, for the first time installed DRE. I think it is awesome and I do fine with it except two things.\n\nFirstly, I have a shuttle that has RCS thrusters on the underside. These always explode on return to Kerbin. Is there any way I can stop this? The body of the shuttle does fine and I can land it. This also happens to the landing gear. How can I shield them?\n\nSecondly, I have parts inside the large mkIII cargo bay. The parts inside such as the static solar panels, also explode on re-entry although the cargo bay doors are closed and are on the top side.\n\nAny advice?\n\nThanks."},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2015-03-15T01:12:22Z","Content":"Hmm, sounds like the parts are not being shielded correctly. DRE lowers the max temp of most parts, your RCS thrusters should be on the sides of your aircraft, not the bottom (Unless there is a specific reason for it) something else to consider is your reentry angle, spend more time in the upper atmosphere, make S-curves high up, Bleed off as much energy as you can before coming in, you are probably going to have to travel most of the way around KErbin before you drop low enough for heating. Airbrakes also help, but are not required."},{"CreatedByName":"Deutherius","CreatedById":125381,"CreatedDateTime":"2015-03-15T01:13:06Z","Content":"Regarding the underbelly RCS thrusters, not even the real Space Shuttle had them - they would be too much of an integrity weakness. Instead the downward pointing RCS nozzles were on the nose \n\n\u003E ![fwdrcs_subsys.gif](https://2.bp.blogspot.com/_annTPGBcsB4/TOO9GVdF3-I/AAAAAAAAEHQ/h6Vfh8swlDs/s1600/fwdrcs_subsys.gif)\n\nand on the protrusions from the OMS pods\n\n\u003E ![space-shuttle-oms-enginea.jpg](http://s.hswstatic.com/gif/space-shuttle-oms-enginea.jpg)\n\nPerhaps that might work for you as well. For the landing gear, have you tried clipping it inside the wings?\n\nNo idea about the cargo bay though. You are playing with FAR/NEAR, right?\n\n**Edited \u003Ctime datetime=\u00222015-03-15T01:48:37Z\u0022 title=\u002203/15/2015 01:48  AM\u0022 data-short=\u00229 yr\u0022\u003EMarch 15, 2015\u003C/time\u003E by Deutherius**"},{"CreatedByName":"Musil","CreatedById":132791,"CreatedDateTime":"2015-03-15T01:32:52Z","Content":"\u003E \n\u003E something else to consider is your reentry angle, spend more time in the upper atmosphere, make S-curves high up, Bleed off as much energy as you can before coming in, you are probably going to have to travel most of the way around KErbin before you drop low enough for heating. Airbrakes also help, but are not required.\n\nYup, pretty much it. I do\u0027t have DRE in my current install, but I dont miss it so much because in the end I did such smooth re entries that I could get a capsule down without even the need for shields (you would need FAR aerodynamics for that, however)."},{"CreatedByName":"worir4","CreatedById":75980,"CreatedDateTime":"2015-03-15T01:50:01Z","Content":"I am using NEAR. I an using the 1 direction RCS thrusters on the underside. I will try replace them to move them out of the way of the air flow. As for the landing gear I am using BahamutoD\u0027s adjustable landing gear. I have tried clipping them but it just glitches out when I retract/deploy them. I will try an upside down re-entry tomorrow. It seems I have more stuff on the bottom that needs protection than the top."},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2015-03-15T02:10:08Z","Content":"Solar panels shattering on reentry is a **totally stock thing** -- shielding doesn\u0027t matter, and neither NEAR/FAR nor DRE do anything to or with it. I presume this will be fixed in KSP 1.0.\n\nFor RCS, yeah, you need to not place them where they\u0027ll get burnt, or use RCS thrusters that have heat shielding (some of B9\u0027s, IIRC). You can actually get full control placing RCS only where the fuselage and/or wings shield it, so get creative with placement. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"PSOliver","CreatedById":138084,"CreatedDateTime":"2015-03-15T03:43:05Z","Content":"\u003E \n\u003E Solar panels shattering on reentry is a **totally stock thing** -- shielding doesn\u0027t matter, and neither NEAR/FAR nor DRE do anything to or with it. I presume this will be fixed in KSP 1.0.\n\u003E For RCS, yeah, you need to not place them where they\u0027ll get burnt, or use RCS thrusters that have heat shielding (some of B9\u0027s, IIRC). You can actually get full control placing RCS only where the fuselage and/or wings shield it, so get creative with placement. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\n It seems like there is a hole in your cargo bay:)"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-03-15T06:05:10Z","Content":"Parts without heatshield modules will not be able to withstand intense heat and will blow up. I remember B9 has RCS ports with heatshield \\*texture\\* but I am not sure if it actually absorb any heat at all. Haven\u0027t used it since DRE."},{"CreatedByName":"worir4","CreatedById":75980,"CreatedDateTime":"2015-03-15T09:22:23Z","Content":"Thanks for all the help guys. Just to be clear the solar planels are the static ones and they explode due to over heating (f3 log) although they are inside the cargo bay. I will move my RCS above the wings and extend a shield on the back to cover the engine.\n\nThanks."},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-03-15T09:52:29Z","Content":"Usually engines have quite high heat tolerant on their own (in fact, in easy mode you can use them in place of heat shield), so you can save your engine without having to add extra shield mass by trying entering from a shallower angle, at slower speed, or even do skipping reentry."},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2015-03-15T11:51:26Z","Content":"\u003E \n\u003E Thanks for all the help guys. Just to be clear the solar planels are the static ones and they explode due to over heating (f3 log) although they are inside the cargo bay. I will move my RCS above the wings and extend a shield on the back to cover the engine.\n\u003E Thanks.\n\nHmm, the exploding shouldn\u0027t happen, especially with NEAR, though I don\u0027t know if DRE has taken the new Mk3 parts into account yet, though it shouldn\u0027t matter. Moving the RCS should help with that part though."}]}