{"TopicId":101928,"ForumId":34,"TopicTitle":"[1.1.2] Kerbal Inventory System (KIS) 1.2.12","CreatedByName":"KospY","CreatedById":33868,"CreatedDateTime":"2015-03-14T11:46:37Z","PageNum":72,"Articles":[{"CreatedByName":"IgorZ","CreatedById":155445,"CreatedDateTime":"2015-12-23T08:12:30Z","Content":"\u003E \n\u003E \n\u003E 1 hour ago, sardia said:\n\u003E \n\u003E \n\u003E Putting a part into your inventory when it is part of a rescue contract causes you to fail the contract because it was destroyed and recreated. Is there a way to fix that? I failed a contract or two because I was trying to shuffle parts around.\n\u003E \n\nConsider creating a bug report on [GitHub](https://github.com/KospY/KIS/issues). This way it\u0027s easier to track and, eventually, fix the problem. Can you give an example of a failed contract? What was the objective, and what was the quest item? Was it a \u0022stock\u0022 contract (carrier mode) or from an addon (name)?  \n\nFrom the implementation point of view when an item is placed into inventory it\u0027s actually get destroyed, and then re-created when pulled out. I\u0027d say it\u0027s not surpising the contarct has failed."},{"CreatedByName":"IgorZ","CreatedById":155445,"CreatedDateTime":"2015-12-23T11:35:09Z","Content":"\u003E \n\u003E \n\u003E On 12/17/2015 at 4:14 AM, katateochi said:\n\u003E \n\u003E \n\u003E I think I\u0027ve found a possible issue with KIS;\n\u003E \n\nSo, I think I found a solution for the problem. You may try uploading a fixed DLL from [https://github.com/ihsoft/KIS/releases/tag/v1.2.3-alpha2-experimental](https://github.com/ihsoft/KIS/releases/tag/v1.2.3-alpha2-experimental). Though, keep in mind that this is a development binary which is not officailly merged into the main branch. It\u0027s basically my development branch which is very far from the original trunk on GitHub. If it does fix the problem I\u0027ll make a pull request to KospY.\n\nBtw, you also may spend some time testing moving/attaching groups (hierarchies) of parts - that\u0027s another feature that is pending in this binary. I\u0027ll be very appreciated to hear the feedback.\n\n**Edited \u003Ctime datetime=\u00222015-12-23T11:35:51Z\u0022 title=\u002212/23/2015 11:35  AM\u0022 data-short=\u00228 yr\u0022\u003EDecember 23, 2015\u003C/time\u003E by IgorZ**"},{"CreatedByName":"sardia","CreatedById":149922,"CreatedDateTime":"2015-12-23T16:18:23Z","Content":"\u003E \n\u003E \n\u003E 8 hours ago, IgorZ said:\n\u003E \n\u003E \n\u003E Consider creating a bug report on [GitHub](https://github.com/KospY/KIS/issues). This way it\u0027s easier to track and, eventually, fix the problem. Can you give an example of a failed contract? What was the objective, and what was the quest item? Was it a \u0022stock\u0022 contract (carrier mode) or from an addon (name)?  \n\u003E   \n\u003E \n\u003E From the implementation point of view when an item is placed into inventory it\u0027s actually get destroyed, and then re-created when pulled out. I\u0027d say it\u0027s not surpising the contarct has failed.\n\u003E \n\nIe. Rescue Herman and his cockpit. If you grab his cockpit and put it into your inventory, you fail the contract. I\u0027ll try to get on github later. It also happens to kerbals too. Like if you put the kerbals who\u0027s in the cockpit into the inventory. It registered as failing the contract."},{"CreatedByName":"goldenpsp","CreatedById":113874,"CreatedDateTime":"2015-12-23T16:39:05Z","Content":"\u003E \n\u003E \n\u003E 19 minutes ago, sardia said:\n\u003E \n\u003E \n\u003E Ie. Rescue Herman and his cockpit. If you grab his cockpit and put it into your inventory, you fail the contract. I\u0027ll try to get on github later. It also happens to kerbals too. Like if you put the kerbals who\u0027s in the cockpit into the inventory. It registered as failing the contract.\n\u003E \n\nMaybe I\u0027m not understanding, but I don\u0027t see the issue.  If the contract is to rescue the kerbal and cockpit, then being able to put it in inventory, or KIS connect it a different way seems an easy way to exploit the contract challenge."},{"CreatedByName":"sardia","CreatedById":149922,"CreatedDateTime":"2015-12-23T17:36:19Z","Content":"Fair point, I was just surprised that it registered as failing the contract. Some times when you are handling a part with kis and KAS, it\u0027ll fly away at high speed due to collisions. The quickest way to resolve it is to shove it into your inventory. \n\nIt\u0027s a fun way to do rescue contacts that include bringing back the wreck. You just fly up to it, remove the nose cone, and attach the rescued part. Way less buggy than the klaw. \n\nPS there no way to get a kerbals out of a mk1crew pod without KIS.  It has no doors!\n\n**Edited \u003Ctime datetime=\u00222015-12-23T17:37:31Z\u0022 title=\u002212/23/2015 05:37  PM\u0022 data-short=\u00228 yr\u0022\u003EDecember 23, 2015\u003C/time\u003E by sardia**"},{"CreatedByName":"goldenpsp","CreatedById":113874,"CreatedDateTime":"2015-12-23T19:17:01Z","Content":"\u003E \n\u003E \n\u003E 1 hour ago, sardia said:\n\u003E \n\u003E \n\u003E Fair point, I was just surprised that it registered as failing the contract. Some times when you are handling a part with kis and KAS, it\u0027ll fly away at high speed due to collisions. The quickest way to resolve it is to shove it into your inventory. \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E It\u0027s a fun way to do rescue contacts that include bringing back the wreck. You just fly up to it, remove the nose cone, and attach the rescued part. Way less buggy than the klaw. \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E PS there no way to get a kerbals out of a mk1crew pod without KIS.  It has no doors!\n\u003E \n\nCapture with Claw and use transfer crew?  I know it works normally.  I would think it would work for a rescue contract as well.  I\u0027ve certainly used it for rescue missions.\n\n**Edited \u003Ctime datetime=\u00222015-12-23T19:19:45Z\u0022 title=\u002212/23/2015 07:19  PM\u0022 data-short=\u00228 yr\u0022\u003EDecember 23, 2015\u003C/time\u003E by goldenpsp**"},{"CreatedByName":"pellinor","CreatedById":85299,"CreatedDateTime":"2015-12-23T20:05:43Z","Content":"\u003E \n\u003E \n\u003E 2 hours ago, goldenpsp said:\n\u003E \n\u003E \n\u003E being able to put it in inventory, or KIS connect it a different way seems an easy way to exploit the contract challenge.\n\u003E \n\nThe whole idea of KIS is breaking a central challenge of the game (not being able to rebuild vessels in flight). Making rescue contracts a bit easier is just one small consequence of those mechanics."},{"CreatedByName":"goldenpsp","CreatedById":113874,"CreatedDateTime":"2015-12-23T21:25:06Z","Content":"\u003E \n\u003E \n\u003E 1 hour ago, pellinor said:\n\u003E \n\u003E \n\u003E The whole idea of KIS is breaking a central challenge of the game (not being able to rebuild vessels in flight). Making rescue contracts a bit easier is just one small consequence of those mechanics.\n\u003E \n\nSorry I disagree.  It is one thing to have a rescue mission where the challenges and limitations, if any are self imposed.  It is entirely different to accept a rescue CONTRACT, where you now have to follow the rules of that contract."},{"CreatedByName":"IgorZ","CreatedById":155445,"CreatedDateTime":"2015-12-24T01:54:14Z","Content":"\u003E \n\u003E \n\u003E 9 hours ago, sardia said:\n\u003E \n\u003E \n\u003E Ie. Rescue Herman **and his cockpit**. If you grab his cockpit and put it into your inventory, you fail the contract.\n\u003E \n\nI don\u0027t remember this kind of contracts in the stock game. Rescuing a kerbal is a common contract but saving the cockpit is something new. Are you 100% sure this contract is not from an addon? How the cockpit is supposed to be \u0022rescued\u0022 (I\u0027m leaving aside question \u0022why\u0022)? What is the criteria of accomplishing the task?\n\n\u003E \n\u003E \n\u003E 9 hours ago, sardia said:\n\u003E \n\u003E \n\u003E If you grab his cockpit and put it into your inventory, you fail the contract.\n\u003E \n\nThis is perfectly understandable since when a part is moved into the inventory it\u0027s get destroyed. For the contract script destruction of the quest part appears as a failing condition. To be honest, I don\u0027t see a way to fix this behavior since the object must be removed from the scene somehow, and destroying it is an easy and reliable way. Hiding the object by other means (disabling renderer, removing meshes, moving to a distant location, etc.) is too hacky and will likely have a lot of side effects. A possible workaround could be completing contract right away once the part is moved into the inventory but feasibility of the solution depends on the contract script.\n\n\u003E \n\u003E \n\u003E 9 hours ago, sardia said:\n\u003E \n\u003E \n\u003E It also happens to kerbals too. Like if you put the kerbals who\u0027s in the cockpit into the inventory. It registered as failing the contract.\n\u003E \n\nThe contract fails for the same reason as for the cockpit. Though, the whole behavior of putting kerbal into inventory is totally wrong. A kerbal being is not an object, and moving them into inventory must be restricted. In my development branch it is restricted - you cannot move/attach/detach/etc kerbals. If your mission is to save a kerbal then you need to bring a vessel with facilities to support a kerbonaut: a cockpit or an external command seat."},{"CreatedByName":"IgorZ","CreatedById":155445,"CreatedDateTime":"2015-12-24T02:16:39Z","Content":"\u003E \n\u003E \n\u003E 8 hours ago, sardia said:\n\u003E \n\u003E \n\u003E PS there no way to get a kerbals out of a mk1crew pod without KIS.  It has no doors!\n\u003E \n\nThis is not true. When your rescuing vessel approaches the wreckage the crew onboard become \u0022yours\u0022, i.e. you now can control them. Just switch to the wreckage using \u0022[\u0022 / \u0022]\u0022 keys, and use \u0022EVA\u0022 button on the kerbal\u0027s icon: as long as exits are not blocked by the other parts it\u0027s possible to EVA (mk1crew cabin has two exits). After that you may use jetpack to approach the rescuing vessel. That\u0027s actually a normal way of doing these contracts but if you don\u0027t like easy ways you may, of course, try docking/attaching/etc ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022)"},{"CreatedByName":"DarthJeb","CreatedById":153640,"CreatedDateTime":"2015-12-24T23:21:42Z","Content":"\u003E \n\u003E \n\u003E On 12/22/2015 at 9:17 PM, ExplorerKlatt said:\n\u003E \n\u003E \n\u003E What do you mean by linear attachment?\n\u003E \n\nEssential attaching non-radially such as most engines in the game"},{"CreatedByName":"sardia","CreatedById":149922,"CreatedDateTime":"2015-12-25T01:10:28Z","Content":"This is what I mean by rescue the cockpit, it occurs in standalone missions or combined with rescue a kerbal. You just need to return it to Kerbin and recover the spacecraft. As for why I would put something into inventory for nonstorage purposes, it arrests any movement the part has. Sometimes when you \u0022drop\u0022 an item near the rocket, it collides very violently and flies off into space. So I try to frog hop the part via attachment points or storage containers. Much safer and less likely for my engine or something precious to fly off into the darkness. I can show you a picture of this happening if needed.\n\n![HNIZ3Jn.png](http://i.imgur.com/HNIZ3Jn.png)"},{"CreatedByName":"IgorZ","CreatedById":155445,"CreatedDateTime":"2015-12-25T06:14:46Z","Content":"\u003E \n\u003E \n\u003E 4 hours ago, sardia said:\n\u003E \n\u003E \n\u003E This is what I mean by rescue the cockpit, it occurs in standalone missions or combined with rescue a kerbal. You just need to return it to Kerbin and recover the spacecraft.\n\u003E \n\nThis is helpful, thanks. I\u0027ll try to lookup which script is producing it, and figure out if its behavior can be intercepted. Out of curiosity, why do you prefer using KIS to finish the mission instead of a regular way - using Advanced Grabbing Unit? The part\u0027s size of 3.8x2.5x1.5 gives 14.25 cubic meters of volume or 14250 liters. I.e. to fit the part you need inventory container ILC-18k which is not cheap or lightweight.\n\n\u003E \n\u003E \n\u003E 4 hours ago, sardia said:\n\u003E \n\u003E \n\u003E As for why I would put something into inventory for nonstorage purposes, it arrests any movement the part has. Sometimes when you \u0022drop\u0022 an item near the rocket, it collides very violently and flies off into space. So I try to frog hop the part via attachment points or storage containers. Much safer and less likely for my engine or something precious to fly off into the darkness. I can show you a picture of this happening if needed.\n\u003E \n\nYeah, I had this problem with the original KIS as well. Though, when I fixed false triggering of click events in the add-on the problem has gone for me. Could you please try the [alpha3 version](https://github.com/ihsoft/KIS/releases/tag/v1.2.3-alpha3) (only replace the .DLL in the KIS/Plugins folder) and let me know if bouncing problem still happens? If it does I\u0027ll be appreciated for a repro steps. And if you can make a short video to demonstrate the bouncing - it would be the best!"},{"CreatedByName":"sardia","CreatedById":149922,"CreatedDateTime":"2015-12-25T20:30:00Z","Content":"The AGU Klaw can only grab 1 unit. A single Kerbal \u002B screwdriver can rescue as many parts/cockpits as needed so long as I have enough parachutes/engines. nEED TO eat, so I\u0027ll check back later."},{"CreatedByName":"IgorZ","CreatedById":155445,"CreatedDateTime":"2015-12-26T11:56:25Z","Content":"\u003E \n\u003E \n\u003E 15 hours ago, sardia said:\n\u003E \n\u003E \n\u003E The AGU Klaw can only grab 1 unit. A single Kerbal \u002B screwdriver can rescue as many parts/cockpits as needed so long as I have enough parachutes/engines. nEED TO eat, so I\u0027ll check back later.\n\u003E \n\nThe largest container, ILC-18k, is 18,000 liters of volume which can only hold one quest module in your case (14.3l). How is it better than one AGU per mission?"},{"CreatedByName":"sardia","CreatedById":149922,"CreatedDateTime":"2015-12-26T21:49:47Z","Content":"You arrest movement with a container. If you remove the parachute from the nose cone. Example.\n\n![20150502_ksp0139_lewe1.jpg](http://0div0.org/images/ksp/kanawha/20150502_ksp0139_lewe1.jpg)\n\nThis leaves an open node. Attached rescued part(usually the command module of the kerbal you rescue). Replace nose cone. Fly to next rescue mission. Attached rescued part by repeating previous steps as needed. If you\u0027re good with RCS, you don\u0027t need the container, but you may need to juggle the attachment points around to make sure your ship is still stable enough for reentry."},{"CreatedByName":"IgorZ","CreatedById":155445,"CreatedDateTime":"2015-12-27T23:41:13Z","Content":"\u003E \n\u003E \n\u003E On 12/25/2015 at 5:10 PM, sardia said:\n\u003E \n\u003E \n\u003E This is what I mean by rescue the cockpit, it occurs in standalone missions or combined with rescue a kerbal. You just need to return it to Kerbin and recover the spacecraft.\n\u003E \n\nHey! Could you please attach any savefile with this mission active? I\u0027ve found the code that handles such contracts but according to what I see there mission completion is triggered on Docking with the part. It\u0027s not exactly what is stated in your contract, and I\u0027d like to examine the save file to figure out how they do configure condition \u0022recover it to Kerbin\u0022."},{"CreatedByName":"sardia","CreatedById":149922,"CreatedDateTime":"2015-12-28T02:21:02Z","Content":"KAS/KIS attaching via screwdriver is considered docking under the system logs F3. I don\u0027t think docking is a requirement. You could also just nudge it into a cargo bay and safely return it to Kerbin. Then you can hit Recover vessel button in the tracking station, to recover the pieces individually. I\u0027ll try to get you a save file if you really need it. Are you developing your own version of KIS/KAS or are you one of the guys maintaining the mod?"},{"CreatedByName":"IgorZ","CreatedById":155445,"CreatedDateTime":"2015-12-28T07:27:56Z","Content":"\u003E \n\u003E \n\u003E 4 hours ago, sardia said:\n\u003E \n\u003E \n\u003E KAS/KIS attaching via screwdriver is considered docking under the system logs F3. I don\u0027t think docking is a requirement.\n\u003E \n\nWhen KIS is attaching something it\u0027s considered docking (\u0022coupling\u0022, to be more specific) from the game\u0027s perspective. In the game code I\u0027ve found a script which controls \u0022recover asset\u0022 missions, it may or may not require docking depending on the mission. Anyways, this script is explicitly checking for the part destruction, and if it\u0027s get destructed the mission fails. Since there is no way to change built-in scripts the only option is somehow workaround a situation when part is destroyed by the KIS script.\n\n\u003E \n\u003E \n\u003E You could also just nudge it into a cargo bay and safely return it to Kerbin. Then you can hit Recover vessel button in the tracking station, to recover the pieces individually. I\u0027ll try to get you a save file if you really need it.\n\u003E \n\nCargo bay works differently from KIS. In cargo (and service) bay parts are physically present, i.e. they don\u0027t get destroyed/recreated when you move move them in and out. In KIS what you see in the inventory is just a list of names, no physical parts are present unless you move one out. It\u0027s a principle solution in the add-on so, it cannot be changed without redoing the whole concept. The save file will be helpful to find a way of detecting quest parts.\n\n\u003E \n\u003E \n\u003E Are you developing your own version of KIS/KAS or are you one of the guys maintaining the mod?\n\u003E \n\nFor now it\u0027s my own version (a GitHub fork, to be more exact). I tried to reach the original author to get my changes incorporated into the main branch but in the last 3 weeks there was no response (may be due to the holidays)."},{"CreatedByName":"sedman","CreatedById":156040,"CreatedDateTime":"2015-12-28T13:05:20Z","Content":"Could I get some advice please?\n\nHow do I put a spanner, hammer or drill back into my inventory or pick up anything thats floating?  \n\nI can grab things, but I cant work out how to put them back into my inventory.\n\nBefore I try and pick up that spanner and drill I left in orbit, I\u0027d like to know the best way to pick them up?\n\nTIA."},{"CreatedByName":"V8jester","CreatedById":136093,"CreatedDateTime":"2015-12-28T14:44:40Z","Content":"\u003E \n\u003E \n\u003E 1 hour ago, sedman said:\n\u003E \n\u003E \n\u003E Could I get some advice please?\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E How do I put a spanner, hammer or drill back into my inventory or pick up anything thats floating?  \n\u003E \n\u003E I can grab things, but I cant work out how to put them back into my inventory.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Before I try and pick up that spanner and drill I left in orbit, I\u0027d like to know the best way to pick them up?\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E  \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E TIA.\n\u003E \n\nGrab the item and hold the left mouse button, drag the item into the open inventory window (Tab key) and let go of the mouse button. The item will now be in your inventory."},{"CreatedByName":"Fair_Player[PL]","CreatedById":155561,"CreatedDateTime":"2015-12-28T16:49:10Z","Content":"Thank you for this addon/update. It would be nice to have posibility to use EAS-4 Strut Connector in KIS. I would like to tie up two space craft on orbit with EAS-4 Strut Connector."},{"CreatedByName":"goldenpsp","CreatedById":113874,"CreatedDateTime":"2015-12-28T17:58:55Z","Content":"\u003E \n\u003E \n\u003E 1 hour ago, Fair\\_Player[PL] said:\n\u003E \n\u003E \n\u003E Thank you for this addon/update. It would be nice to have posibility to use EAS-4 Strut Connector in KIS. I would like to tie up two space craft on orbit with EAS-4 Strut Connector.\n\u003E \n\nThey don\u0027t work.  Use the Strut connectors from the associated KAS mod."},{"CreatedByName":"Snarfster","CreatedById":80347,"CreatedDateTime":"2015-12-28T23:43:20Z","Content":"\u003E \n\u003E \n\u003E On 12/26/2015 at 10:49 PM, sardia said:\n\u003E \n\u003E \n\u003E You arrest movement with a container. If you remove the parachute from the nose cone. Example.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E [![20150502_ksp0139_lewe1.jpg](http://0div0.org/images/ksp/kanawha/20150502_ksp0139_lewe1.jpg)](http://0div0.org/images/ksp/kanawha/20150502_ksp0139_lewe1.jpg \u0022Enlarge image\u0022)\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E This leaves an open node. Attached rescued part(usually the command module of the kerbal you rescue). Replace nose cone. Fly to next rescue mission. Attached rescued part by repeating previous steps as needed. If you\u0027re good with RCS, you don\u0027t need the container, but you may need to juggle the attachment points around to make sure your ship is still stable enough for reentry.\n\u003E \n\nWhy not use KIS to attach a dockingport junior to the part you need to return? Then dock with it and fly it back. With the node attach option it\u0027ll be perfectly balanced too."},{"CreatedByName":"sardia","CreatedById":149922,"CreatedDateTime":"2015-12-29T01:45:36Z","Content":"Can you explain how that is better than just attaching the parts directly? You\u0027d be carrying 2 docking ports per rescue, and have to go through docking. It\u0027s easier to just attach the rescued part to your rocket and be done"}]}