{"TopicId":101929,"ForumId":16,"TopicTitle":"Clockwise Solar Satelite Contract Help","CreatedByName":"Doodle","CreatedById":139448,"CreatedDateTime":"2015-03-14T12:28:56Z","PageNum":1,"Articles":[{"CreatedByName":"Doodle","CreatedById":139448,"CreatedDateTime":"2015-03-14T12:28:56Z","Content":"\n\u003Cp\u003EI made the mistake (well honestly it was mainly stupidity to not read the fine print correctly) to accept a Satelite Contract for an Clockwise Orbit around the sun.\u003C/p\u003E\u003Cp\u003ESince so far in my ksp carreer I only visited mun and minmus I havent I havent realised I had to focus my view on the sun to see the orbit for the contract on map view. And as of yet I still dont understand the inclination / Node /Argument descriptions of the satelite contracts.\u003C/p\u003E\u003Cp\u003EAnyways I just sound I had to get out of Kerbals SoI and raise my Apoapsis and Periapsis to the rigth numbers and would be done for since there wasnt any visible orbit on the map for it (while not being focused on the sun sigh... ) \u003C/p\u003E\u003Cp\u003EAfter I escape with my little satelite out of Kerbins SoI and was in an orbit of the Sun I suddently got the \u0022todo\u0022 orbit visible the first time and was completly shocked that it was clockwise \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003ENow I have honestly not the slightest Idea how the hell should I be able to make a clockwise orbit around the sun.\u003C/p\u003E\u003Cp\u003EContract Specifics:\u003C/p\u003E\u003Cp\u003EApoapsis 66.9 Mil. Km\u003C/p\u003E\u003Cp\u003EOeriapsis: 4.9 Mil. Km \u003C/p\u003E\u003Cp\u003EInclination 170.8 Degrees (is this the thing that should have warned me thats clockwise instead of counterclockwise?)\u003C/p\u003E\u003Cp\u003ELongitute of Ascending: 3.8 Degrees\u003C/p\u003E\u003Cp\u003EArgument of Periapsis 217.7 degrees (or is it this... honestly no idea what this even means right now)\u003C/p\u003E\u003Cp\u003EContract Deadlne: 14y 200 days.\u003C/p\u003E\u003Cp\u003ECurrent Date of my KSP Program: Year 1 Day 32\u003C/p\u003E\u003Cp\u003EI am not even shure if this contract is worth it. It gave an advance of 70k Credits and will give a completion reward of 417k credits together with 180 science and 270 reputation.\u003C/p\u003E\u003Cp\u003EI am thinking about abandoning the contract atm but I cant afford the 82k Credit penalty (my space program is short on funds) and the 126 Rep Penalty and well... admiting defeat sucks...\u003C/p\u003E\u003Cp\u003ESo any Help would be great.\u003C/p\u003E\u003Cp\u003E(Oh and if it is any important I only use Alarm Clock and K.E.R. as mods)\u003C/p\u003E\u003Cp\u003EMy normal Satelites so far have a DeltaV of 6-7k after being in Kerbal Orbits. I sticked a Satelite Monster together atm but I cant even afford to launch it with has 25k DeltaV and a TWR of 0.15 (27 large Xenon Tanks and 3 Xenon Engines). (1 engine only makes it 30k DeltaV but only 0.06 TWR)\u003C/p\u003E\n"},{"CreatedByName":"Tweety","CreatedById":115567,"CreatedDateTime":"2015-03-14T13:05:57Z","Content":"\n\u003Cp\u003EHow far have you progressed on the tech tree? I personally haven\u0027t played career in ages, however with a small probe core and some static panels you should be able to lift it and even put it in the required orbit with minimal costs. An SSTO should cut it with a small satellite on top. just get into LKO by going retrograde and you are mostly there.\u003C/p\u003E\u003Cp\u003EMaybe lift the satellite with the long black and white tank with an lv909 engine on bottom and some reaction wheels and ou should be able to get a Kerbin escape trajectory with delta V to spare to fine tune the orbit for the contract. When im at home tonight i will see if i can throw something low tech together to achieve what you need (at work right now).\u003C/p\u003E\u003Cp\u003ETweety\u003C/p\u003E\n"},{"CreatedByName":"Doodle","CreatedById":139448,"CreatedDateTime":"2015-03-14T13:13:30Z","Content":"\n\u003Cp\u003EI am fairly done with the Tech tree. Have all the Techs below the 500 science cost limit. So that shouldnt be the problem.\u003C/p\u003E\u003Cp\u003EAS I said I already have managed to get an satelite into the solar orbit.... sadly i just managed counter clockwise but need a clockwise one and there I have no idea how to manage that.\u003C/p\u003E\u003Cp\u003EOr what amounts of DeltaV are needed minimalistic for it. I just now having 5.8k DeltaV after leaving Kerbins Sphere of Influence is not enough by ALOT cause that was what my satelite had when he was in a solar orbit.\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-03-14T13:15:22Z","Content":"\n\u003Cp\u003EYeah, it probably isn\u0027t going to be worth it.\u003C/p\u003E\u003Cp\u003E To reverse your orbit, you\u0027re going to have to increase the apoapsis as far as you can, then burn retrograde at the apoapsis.\u003C/p\u003E\u003Cp\u003E That\u0027s going to take some serious DV; I\u0027m sure more than you bargained for.\u003C/p\u003E\u003Cp\u003E My advice is to just leave the contract active but don\u0027t attempt to complete it. By the time it expires, the penalty will be chump change.\u003C/p\u003E\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-14T13:19:22Z\u0022 title=\u002203/14/2015 01:19  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 14, 2015\u003C/time\u003E by GoSlash27\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2015-03-14T13:23:17Z","Content":"\n\u003Cp\u003EI think it\u0027s very unlikely you\u0027re going to profit from this contract... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003EA retrograde solar orbit is extraordinarily costly in delta-v, since you have to undo the orbital speed of Kerbin, then put it back again in the other direction. Manoeuvres are always cheaper the further away you get from a body, so the best way you can probably do this is to kick your apoapsis out somewhere beyond Eeloo, then flip it over. The 170 degree inclination, is brutal, and will cost upwards of 6k delta-v in itself, if performed at Kerbin\u0027s orbit. If you can get your solar AP in alignment so that you can do the plane change out there, that\u0027s again your cheapest option. It\u0027ll take years of time in-game though, and I\u0027m not sure you\u0027ll get there before the deadline is up.\u003C/p\u003E\u003Cp\u003EFrankly, my advice would be cancel the contract. They\u0027ll take back the money they paid you up-front, and you make take a small hit in reputation, but unless you\u0027re in a high difficulty mode, that\u0027s all that\u0027ll happen.\u003C/p\u003E\u003Cp\u003EAlso, with every satellite contract, just \u003Cem\u003Eignore\u003C/em\u003E the numbers for longitudes and arguments - just look in the map view and match it visually. There\u0027s nothing in the game that lets you put those numbers in, so they\u0027re massive red herrings \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Inclination is relevant, since it has a big impact on the delta-v requirements; the nearer zero it is, the easier a job you\u0027re going to have. And yeah, a 180 degree inclination is retrograde. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tweety\u0022 data-cite=\u0022Tweety\u0022\u003E\u003Cdiv\u003E...An SSTO should cut it with a small satellite on top...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t believe there\u0027s an SSTO been invented that could get into a clockwise solar orbit... solar-polar orbits are hard enough, but the orbit listed is going to be something like 4-5x the delta-v cost of a Moho run.\u003C/p\u003E\n"},{"CreatedByName":"Tweety","CreatedById":115567,"CreatedDateTime":"2015-03-14T13:28:08Z","Content":"\n\u003Cp\u003EIs it not worth the retrograde launch then Slashy? If my basic understandings are correct then wouldn\u0027t that only take a little extra Delta V? That way you don\u0027t actually have to reverse your orbit as such? You are far more knowledgeable than I am. I could also be thinking about it in completely the wrong way too \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ETweety\u003C/p\u003E\u003Cp\u003EEdit: Ahhhh eddie got in there while I was typing....NOW I understand why my idea is terrible \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Although I now have a great personal goal of having a clockwise orbit around as many planets as I can endure \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-14T13:30:44Z\u0022 title=\u002203/14/2015 01:30  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 14, 2015\u003C/time\u003E by Tweety\u003C/strong\u003E\n\u003Cbr\u003EStupidness on my part.\n\u003C/span\u003E\n"},{"CreatedByName":"worir4","CreatedById":75980,"CreatedDateTime":"2015-03-14T13:28:12Z","Content":"\n\u003Cp\u003EIf you want you can press alt-f12 to open the cheats menu. Then you can cancle or complete the contract. Your choice.\u003C/p\u003E\n"},{"CreatedByName":"Deutherius","CreatedById":125381,"CreatedDateTime":"2015-03-14T13:58:59Z","Content":"\n\u003Cp\u003EThat sounds like a challenge \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\u003Cp\u003EBut honestly, I would just follow Slashy\u0027s advice - even if you do attempt to complete the contract, just wait until you have the funds and tech. The deadline is well over 14 years - you can easily max the tech tree in just a weeks of in-game time and the travel time shouldn\u0027t be more than 2 years. The target orbit is also very eccentric, so you can send your probe to target Ap, reverse the orbit and from there it\u0027s just a few m/s of deltaV to complete the contract.\u003C/p\u003E\u003Cp\u003EGood luck! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2015-03-14T14:18:59Z","Content":"\n\u003Cp\u003EThe real problem is that you can only have a limited number of contracts open. The obvious course to follow would be to get a contract to get something in orbit of Eeloo. Once you\u0027re out there in far, far away country, changing inclination shouldn\u0027t be that costly.\u003C/p\u003E\n"},{"CreatedByName":"Kryxal","CreatedById":102688,"CreatedDateTime":"2015-03-14T15:11:31Z","Content":"\n\u003Cp\u003EIt might be possible to do a gravity assist off Jool ... failing that, I\u0027d push your apoapsis even higher, then make your plane change out there.\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-03-14T15:28:34Z","Content":"\n\u003Cp\u003EMy back of the envelope calculation (from outside Kerbin\u0027s SoI):\u003C/p\u003E\u003Cp\u003ETransfer burn to Eeloo\u0027s aphelion 113M km: 3,080 m/sec\u003C/p\u003E\u003Cp\u003EBurn at aphelion to arrest eastward orbit: 3,200m/sec\u003C/p\u003E\u003Cp\u003EBurn at aphelion to set perihelion to 4.9 million km: 2,260M/sec\u003C/p\u003E\u003Cp\u003EBurn at perihelion to set aphelion to 66.9 million km: 309M/sec\u003C/p\u003E\u003Cp\u003ETotal approx. \u003Cstrong\u003E8,800 m/sec.\u003C/strong\u003E And remember you have to add in the launch DV as well, so this is pretty much as big a project as launching from Eve\u0027s surface into orbit.\u003C/p\u003E\u003Cp\u003E This isn\u0027t counting the inclination change, which is pretty negligible. You could shave some from this by using the Oberth effect at launch and slingshotting around the system, but don\u0027t expect to save much. \u003C/p\u003E\u003Cp\u003E I also didn\u0027t compare different aphelion altitudes to see which gives you the best result, so this estimate is probably a bit high.\u003C/p\u003E\u003Cp\u003E I still definitely don\u0027t recommend attempting this contract. I don\u0027t think you can afford the mission cost anyway.\u003C/p\u003E\u003Cp\u003E Best,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-14T15:34:22Z\u0022 title=\u002203/14/2015 03:34  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 14, 2015\u003C/time\u003E by GoSlash27\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Doodle","CreatedById":139448,"CreatedDateTime":"2015-03-14T15:38:33Z","Content":"\n\u003Cp\u003EOk i guess its kicking that contract or letting it dust and wasting one of my 7 slots... Doing any fly by manouvers on different planets is something that is at this time still out of my league. Since so far as I said I havent seen anything else except Mun und Minmus (and my first Minmus visit with sending Jeb there and back is still on the way) \u003C/p\u003E\u003Cp\u003EEven have the \u0022Explore Minmus\u0022 Contract still open cause my engineers sadly forgot to attach an antenna to Jebs capsule. So I have to wait another 6days until he gets home from his trip.\u003C/p\u003E\u003Cp\u003EJust love Kerbal Alarm Clock.... being able to do multiple missions at once without having to \u0022waste\u0022 time skipping multiple days for a single mission \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2015-03-14T15:38:54Z","Content":"\n\u003Cp\u003EBy my reckoning, this mission/contract isn\u0027t that bad. I did some quick and dirty math I\u0027ll walk you through below.\u003C/p\u003E\u003Cp\u003EA solar/kerbolar Ap of ~66 Gm (Million km) is very close to Jool\u0027s orbit. A transfer from LKO to Jool takes about 2000 m/s of dV\u003C/p\u003E\u003Cp\u003EThis transfer will give you an apoapsis velocity of about 2430 m/s, that needs to be canceled.\u003C/p\u003E\u003Cp\u003EYou need to further accelerate about 1550 m/s to achieve a retrograde orbit with a 4.9 Gm.\u003C/p\u003E\u003Cp\u003ESo, from LKO, getting the orbit\u0027s \u003Cem\u003Eshape\u003C/em\u003E takes about 6 km/s of dV.\u003C/p\u003E\u003Cp\u003EThe inclination is a bit trickier, since the parameters seem to indicate that the axis of inclination is \u003Cem\u003Enot\u003C/em\u003E aligned with the semimajor axis, so add an extra 1 km/s of dV and that should be more than sufficient.\u003C/p\u003E\u003Cp\u003EAgain, this is quick and dirty math, but 7 km/s from LKO an engineering challenge that is far from insurmountable, especially if you have ion drives.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-14T15:42:45Z\u0022 title=\u002203/14/2015 03:42  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 14, 2015\u003C/time\u003E by LethalDose\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"StrandedonEarth","CreatedById":89439,"CreatedDateTime":"2015-03-14T17:02:57Z","Content":"\n\u003Cp\u003EYeah, wait until you can put ion drives on a tiny probe, or Alt-F12 cheat and turn on infinite fuel for the probe you already launched. Or force completion (I don\u0027t think you get paid for that) to clear it off your contract list.\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2015-03-14T20:53:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tweety\u0022 data-cite=\u0022Tweety\u0022\u003E\u003Cdiv\u003E...Edit: Ahhhh eddie got in there while I was typing....NOW I understand why my idea is terrible \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Although I now have a great personal goal of having a clockwise orbit around as many planets as I can endure \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027re still underestimating the effort required. A retrograde orbit around any other planet is fairly easy just by tweaking your intercept with it. ALL those planets, and you, are still going the same way around the sun though so it\u0027s all \u0027just a bit\u0027 faster or slower. It is reversing the orbit around the \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Esun\u003C/span\u003E that makes this contract so hard.\u003C/p\u003E\n"}]}