{"TopicId":102050,"ForumId":39,"TopicTitle":"A peculiar Venusian idea of Earth, a semi-kerbal story.","CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-03-16T01:56:33Z","PageNum":1,"Articles":[{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-03-16T01:56:33Z","Content":"*So the characters are Kerbals, but they exist on an alternate-universe Earthalike Venus.*\n\n\u0022Hey Dad, look at this!\u0022 Bob gasped at his father, who was still trying to repair the window on the front porch.\n\n\u0022Alright, what is it.\u0022 His father dryly responded, walking over to the telescope.\n\n\u0022I think Earth is a world!\u0022 said Bob.\n\n\u0022Don\u0027t be silly. Earth is a planet.\u0022 said Dad. \u0022It\u0027s just a wandering star.\u0022\n\n\u0022But no, look!\u0022 Bob cried.\n\nHis father looked into the telescope, seeing the blue dot focus into detail.\n\n\u0022See, it\u0027s a sphere! It has brown spots and green spots and blue spots!\u0022 Bob smiled at his father.\n\n\u0022Fascinating.\u0022 His father said. \u0022But that\u0027s not a sphere, it\u0027s just a disk.\u0022\n\nBob frowned. \u0022No, I saw it yesterday night before I went to bed and after I woke up, and it rotated!\u0022\n\nHis father then frowned. \u0022Even if it is a sphere, what makes you think it\u0027s a world?\u0022\n\n\u0022Our world, Venus, has blue seas, green plains, and brown deserts. And white clouds! There\u0027s all of those colors on Earth too!\u0022 Bob was getting frustrated.\n\n\u0022And look at that other speck.\u0022 Bob suggested.\n\n\u0022It\u0027s a...\u0022 His father started.\n\n\u0022Another planet!\u0022 Bob said.\n\n\u0022I\u0027ve been observing them for the past week, and the grey planet circles around Earth!\u0022\n\n\u0022So you\u0027ve discovered another planet then? Surely it\u0027s been cataloged by now.\u0022 His father was starting to realize the discovery.\n\n\u0022I checked all the books in thew library, there\u0027s no chart of it yet. And it even explains the phenomenon where Earth gets slightly brighter and darker every few days.\u0022 Bob was grinning enough to rip his face off.\n\n\u0022What are you going to name it?\u0022 His father asked, a tear of proudness rolling down his face.\n\n\u0022I\u0027m going to call it Moon, after the satellite islands Mun and Minmus that exist near the eastern continent of Erith.\u0022 Bob explained.\n\n\u0022Erith... that\u0027s a translation of New World.\u0022 His father realized.\n\n\u0022Exactly. Earth is the new world, and Moon is it\u0027s satellite island.\u0022 Bob skipped inside to bed, his father going back to attempt to fix the window. Jeb was going to pay for that window.\n\n*What do you think? I thought about this story when thinking about what would you choose as the landing site for a Kerbal Mission to Earth.*"},{"CreatedByName":"ZodiaK","CreatedById":80590,"CreatedDateTime":"2015-03-16T07:30:46Z","Content":"rally great! very asimov/PKD-esque"},{"CreatedByName":"Yukon0009","CreatedById":109376,"CreatedDateTime":"2015-03-16T12:05:55Z","Content":"Niice. I would probably pick Antartica as a landing site, provided it\u0027s mostly flat (and spacesuits will fight the cold)."},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-03-16T12:14:48Z","Content":"\u003E \n\u003E Niice. I would probably pick Antartica as a landing site, provided it\u0027s mostly flat (and spacesuits will fight the cold).\n\nBut is it interesting enough?\n\nYou also have to imagine it this way, what would be the best vacation site on Earth."},{"CreatedByName":"Yukon0009","CreatedById":109376,"CreatedDateTime":"2015-03-16T12:53:52Z","Content":"I assume aliens don\u0027t know about shopping, good food and that sort of things on Earth, so I guess, well, maybe the Himalayas. I dunno."},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-03-16T21:17:35Z","Content":"Let\u0027s assume this is back when humans were just learning to use tools, so we have many modern species and humans aren\u0027t a big thing yet."},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-03-21T01:52:24Z","Content":"The Venusians hadn\u0027t had a Moon to encourage space exploration, but they had something the Earthlings hadn\u0027t. The Space Department of Krakojass had their eyes on Earth. Something that held the possibility of being just like Venus.\n\nBut they never invented the radio. Every single space probe they ever launched was Kerballed. They started with a Moon landing, and the mapping effort found interesting debris. Upon returning to Venus, a full expedition was planned..."}]}