{"TopicId":102008,"ForumId":16,"TopicTitle":"Stock Rotor Techniques","CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-03-15T12:59:02Z","PageNum":1,"Articles":[{"CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-03-15T12:59:02Z","Content":"\n\u003Cp\u003ECan anyone share some techniques for building rotating machines out of stock parts? I have some concepts for the chunkin challenge and beyond that could use them. I understand that rotating bearings are typically made from aircraft wheels in a ring, but am unsure about things like how far to place them from the shaft, what to use as a thrust bearing, etc. Looking more for design guidelines than finished .craft, but could certainly learn something by taking apart the latter. Thank you!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-16T11:59:33Z\u0022 title=\u002203/16/2015 11:59  AM\u0022 data-short=\u00229 yr\u0022\u003EMarch 16, 2015\u003C/time\u003E by Kuzzter\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Spartwo","CreatedById":58131,"CreatedDateTime":"2015-03-15T13:30:50Z","Content":"\n\u003Cp\u003ELanding gear are not always needed, having a bearing made from a material wrapped around a shaft is more compact although requires more effort to turn. I tend to use SAS as a turning force so I needn\u0027t worry about limited use.\u003C/p\u003E\n"},{"CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-03-15T13:35:00Z","Content":"\n\u003Cp\u003EThanks! What stock materials can you wrap around a shaft? Do you mean to link up a bunch of structrual parts like girders and beams and angle offset them to make a ring, or something else?\u003C/p\u003E\n"},{"CreatedByName":"Azimech","CreatedById":50750,"CreatedDateTime":"2015-03-15T13:40:46Z","Content":"\n\u003Cp\u003ERule number one: Never let the wheels of the landing gear clip with the shaft. KSP/Unity don\u0027t respect the colliders well when loading, resulting in an immediate jam.\u003C/p\u003E\u003Cp\u003ERule number two: both too wide and too narrow clearance results in power loss. Too narrow means the collider mesh of the shaft pushes the wheels too much up their suspension struts, resulting in power loss. Too wide and the shaft starts too tumble, again pushing the wheels too much up their struts but now with a larger force due to an imbalace.\u003C/p\u003E\u003Cp\u003ERule number three: After first attaching and rotating/offset the landing gears to have the proper clearance with the shaft, launch craft, return to editor and adjust the wheels again. Due to a bug, the first time the location is not respected by KSP.\u003C/p\u003E\u003Cp\u003ERule number four: Four wheels per bearing is not enough for reliable operation! A shaft of 1.25m requires a minimum of six and a max of 8 wheels.\u003C/p\u003E\u003Cp\u003ELook at some of my newest designs, for example the Whistling Gnome, over here: \u003Ca href=\u0022http://kerbalx.com/users/391/crafts\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalx.com/users/391/crafts\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-03-15T15:12:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Azimech\u0022 data-cite=\u0022Azimech\u0022\u003E\u003Cdiv\u003ERule number one...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGood stuff, thank you! I will take some of your designs apart and see what I can learn.\u003C/p\u003E\n"},{"CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-03-15T16:27:43Z","Content":"\n\u003Cp\u003EHere\u0027s a few more things I learned so far taking apart Azimech\u0027s ingenious Gnome engine:\u003C/p\u003E\u003Cp\u003E1. \u003Cspan style=\u0022text-decoration:underline;\u0022\u003ESymmetry on symmetry. \u003C/span\u003EAzimech put two (symmetrical) gear bays on each of four posts with mirror symmetry, then put the four posts around the shaft with radial symmetry. This way one can adjust clearance by moving the four (or six, or eight) posts, and keep clearance constant all the way around.\u003C/p\u003E\u003Cp\u003E2. \u003Cspan style=\u0022text-decoration:underline;\u0022\u003EGear bays for thrust bearings, too.\u003C/span\u003E There are two wheels at each end of the shaft to keep it from moving axially. I might try this with the wheels impinging on a cone rather than the flat end of the shaft.\u003C/p\u003E\u003Cp\u003E3. \u003Cspan style=\u0022text-decoration:underline;\u0022\u003EUse a separator to detach the rotor shaft from the rest of the craft.\u003C/span\u003E The craft must start out as one piece, then in operation the rotor and stator have to be two separate pieces. I tried using clampos first, but I suspect the magnetics were interfering with rotation.\u003C/p\u003E\u003Cp\u003E4. \u003Cspan style=\u0022text-decoration:underline;\u0022\u003ESPH clearances can be (visually) deceiving.\u003C/span\u003E When i looked at the shaft in SPH it appeared there was lots of daylight between the gear wheels and the shaft. In operation, every wheel seemed to be in contact with the shaft all the way around. Good thing this design and SPH \u0027gizmos\u0027 make it easy to tweak clearance (see #1)\u003C/p\u003E\u003Cp\u003EI\u0027m sure I\u0027ll learn yet more as i try to build my own, scaling up to allow some \u0027flinging\u0027 of parts. \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003EI\u0027ll leave this thread \u0027unanswered\u0027 for now because \u003C/span\u003EI\u0027m sure there is more than one way to skin this kat. Maybe in the end I\u0027ll have enough techniques to help someone else out someday \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-16T11:59:21Z\u0022 title=\u002203/16/2015 11:59  AM\u0022 data-short=\u00229 yr\u0022\u003EMarch 16, 2015\u003C/time\u003E by Mister Dilsby\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Azimech","CreatedById":50750,"CreatedDateTime":"2015-03-16T12:07:56Z","Content":"\n\u003Cp\u003EI\u0027ve copied your findings into my main topic, hope you don\u0027t mind :-)\u003C/p\u003E\n"},{"CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-03-16T12:34:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Azimech\u0022 data-cite=\u0022Azimech\u0022\u003E\u003Cdiv\u003EI\u0027ve copied your findings into my main topic, hope you don\u0027t mind :-)\u003C/div\u003E\u003C/blockquote\u003E Honored! And it worked, too: I made an electrically driven centrifugal \u0027chunker\u0027: \u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/469gO6d.png\u0022 alt=\u0022469gO6d.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E...I went with 12 wheels per radial bearing, which is maybe too much friction. The lower thrust bearing does rest on a cone with four wheels, which seems to work pretty well. I will probably add an upper bearing for a bit more stability.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-16T12:38:47Z\u0022 title=\u002203/16/2015 12:38  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 16, 2015\u003C/time\u003E by Mister Dilsby\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Foxster","CreatedById":113764,"CreatedDateTime":"2015-03-16T16:11:56Z","Content":"\n\u003Cp\u003EAll the designs I have seen or dismantled are based on this idea. A rotating drum or a couple of round items like batteries that are supported in a 3D way. The landing gears used are massless so very handy. \u003C/p\u003E\u003Cp\u003EThe downside is that the axle/engine is big. You have to cram in all those landing gears and you need a decent distance between sets for stability. I\u0027m really, really hoping the new landing gear in 1.0 will help with this. Or we might get a stock axle - but I\u0027m not holding my breath for that. \u003C/p\u003E\u003Cp\u003EI keep trying different ideas though, hoping I\u0027ll find some better parts to make an axle. No luck so far but hope springs eternal.\u003C/p\u003E\n"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2015-03-16T16:17:32Z","Content":"\n\u003Cp\u003EHere\u0027s a tip: KSP doesn\u0027t care if stuff goes through struts. You can have a wall of struts around your arms or rotor and a separate ship going right through them, and it won\u0027t even notice.\u003C/p\u003E\n"},{"CreatedByName":"Azimech","CreatedById":50750,"CreatedDateTime":"2015-03-17T12:18:49Z","Content":"\n\u003Cp\u003EConfirmed. Used that trick for my stock cyclic/collective experiments.\u003C/p\u003E\n"},{"CreatedByName":"Azimech","CreatedById":50750,"CreatedDateTime":"2015-03-17T12:50:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kuzzter\u0022 data-cite=\u0022Kuzzter\u0022\u003E\u003Cdiv\u003EHonored! And it worked, too: I made an electrically driven centrifugal \u0027chunker\u0027: \u003Cp\u003E...I went with 12 wheels per radial bearing, which is maybe too much friction. The lower thrust bearing does rest on a cone with four wheels, which seems to work pretty well. I will probably add an upper bearing for a bit more stability.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBy chance I just tested an electric engine with my standard propeller. It achieved a max thrust of 30kN. During testing of my smallest engine, the one you looked at, I tuned it\u0027s power output from 25 to 50kN. Imagine what a 4, 8 or 12 blower could do for your \u0027chunker\u0027.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/zB3uFtk.png\u0022 alt=\u0022zB3uFtk.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-17T12:54:30Z\u0022 title=\u002203/17/2015 12:54  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 17, 2015\u003C/time\u003E by Azimech\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-03-17T13:06:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Azimech\u0022 data-cite=\u0022Azimech\u0022\u003E\u003Cdiv\u003EBy chance I just tested an electric engine with my standard propeller. It achieved a max thrust of 30kN. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHm. Well, my real motivation in this pursuit is to develop an all-electric helicopter that will bring a (comparatively) small rocket stage to high-ish alitute on Eve. Using two large counter-rotating rotors, I might be able to get a thrust of 200kN or so... which means I can lift less than 12t off the ground... which probably means forget it. \u003C/p\u003E\u003Cp\u003EUnless I can make a giant reciprocating engine out of docking clamps! Ha ha! Haaa haaa haaaa! *THUD*\u003C/p\u003E\u003Cp\u003EBTW I looked at that thrust test rig earlier, and it\u0027s absolute genius. One of the best things I\u0027ve ever seen built in this game.\u003C/p\u003E\n"},{"CreatedByName":"Azimech","CreatedById":50750,"CreatedDateTime":"2015-03-17T13:43:08Z","Content":"\n\u003Cp\u003ECounter rotating rotors you say ... hmmm ... I have the tech :-) I\u0027m was the first (and until now only) person to build a coaxial rotor system out of stock parts. \u003C/p\u003E\u003Cp\u003EBut I don\u0027t think it would be of much use, the big problem is how to get it to Eve. Descent is a problem to, it would probably tear the rotor blades or overspeed the system.\u003C/p\u003E\u003Cp\u003EAnd thank you for that compliment!\u003C/p\u003E\n"},{"CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-03-17T13:51:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Azimech\u0022 data-cite=\u0022Azimech\u0022\u003E\u003Cdiv\u003ECounter rotating rotors you say ... hmmm ... I have the tech :-) I\u0027m was the first (and until now only) person to build a coaxial rotor system out of stock parts. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh no, not coaxial, I was going to go Chinook. I may be STUPID but I\u0027m not CRAZY!\u003C/p\u003E\n"},{"CreatedByName":"Azimech","CreatedById":50750,"CreatedDateTime":"2015-03-17T13:57:27Z","Content":"\n\u003Cp\u003ELOL \u003C/p\u003E\u003Cp\u003ENice one!\u003C/p\u003E\n"}]}