{"TopicId":102079,"ForumId":34,"TopicTitle":"[1.8.x] Contract Reward Modifier [v2.7] [11/1/2019]","CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2015-03-16T16:11:40Z","PageNum":1,"Articles":[{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2015-03-16T16:11:40Z","Content":"**Contract Reward Modifier V2.7**\n\nDownload from [Space Dock](http://spacedock.info/mod/132)\n\nDownload from [Curse Forge](http://kerbal.curseforge.com/projects/contract-reward-modifier)\n\nAlternate Download: [GitHub](https://github.com/DMagic1/Contract-Modifier/releases/latest)\n\nSource is available at [GitHub](https://github.com/DMagic1/Contract-Modifier)\n\nFormerly a part of [Contracts Window \u002B](https://forum.kerbalspaceprogram.com/index.php?/topic/82106-1), Contract Reward Modifier provides an in-game UI for modifying all contract reward and penalties, as well as allowing for limits to be placed on the number of contracts offered for each type. All values can also be set using a global config file in your GameData folder.\n\n![FdXv5C1.jpg](http://i.imgur.com/FdXv5C1.jpg)\n\nThe Contract Reward Modifier window presents a set of sliders that allow for changes to all contract and parameter reward amounts, as well as several other options.\n\nContract and Parameter Type Selection\n\n- At the top of the window are two drop down buttons that allow for the selection of different contract and parameter types.\n    - A special **Global Settings** selection is available for both Contract and Parameter Types.\n    - Values can be set with the sliders under the global settings; these will be applied to all Contract/Parameter Types after pushing the **Apply To All** button.\n- All addon contract and parameter types should be available here.\n- Contract Configurator types are pushed to the bottom of the list to avoid any potential spoilers revealed by contract names.\n\nSliders\n\n- The sliders below control the amount given for each different reward and penalty type.\n- Strategy values are not directly affected by these sliders, i.e. setting science to 0.1% won\u0027t affect the science rewards given while using the science strategy.\n- The sliders are half-way log-scale; the left half of the slider allows for 0.1 - 100% of the original value, while the right half allows for 100-1000% of the original.\n- Contract duration can be adjusted from 10-1000%, but will only affect newly offered contracts.\n- The maximum number of offered and active contracts of a type can be specified; any contracts beyond this amount will be rejected when the system tries to offer new contracts.\n    - All Contract Configurator contracts are can only be set to allow 1 or more contracts to be offered.\n\nAddon Settings\n\n- By default the values only go down to 0.1%; there is an option to allow for nearly 0% (0.00000001%) using the **Allow 0% Values**toggle.\n    - Using this may cause odd rounding errors and prevent further adjustments from being made to any active contracts/parameters of that type.\n- A toggle option is available to **Alter Active Contracts**as well as newly offered contracts.\n    - Turning this on and off while adjusting values may cause problems with reward values.\n    - Be default it is off; but you should stick with either turning it on, or leaving it off; don\u0027t go back and forth.\n- If [Blizzy78\u0027s Toolbar](https://forum.kerbalspaceprogram.com/index.php?/topic/55420-1) is installed you can switch between it and the stock app launcher using the **Use Stock Toolbar** toggle.\n- There is also toggle to completely **Disable All Toolbars**.\n\n    - This can be used if you have set the values you want and don\u0027t need the toolbar icon taking up space.\n    - Toolbars can be re-enabled by changing the **disableToolbar** field to **True** at the top of the config file.\n- Contract/Parameter amounts can be reverted to the default values set in your config file using the **Reset Values** button.\n- The current values can be saved to the global config file in your GameData folder using the **Save To Config** button.\n\n    - Values saved to the config file will serve as the default for current save games.\n    - New save files (or save files that haven\u0027t been loaded while Contract Reward Modifier has been installed) will set all contract and parameter values using the config file settings.\n    - The config file-only **disableSaveSpecificValues** field allows you to bypass any values set in your save files; all values stored in the save files will be deleted.\n    -\n\n\u003E \n\u003E \n\u003E \n\u003E An annotated example of the config file layout is shown here.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E ContractValuesNode\n\u003E     {\n\u003E     disableToolbar = False //Prevents the toolbar button from loading if set to True\n\u003E     disableSaveSpecificValues = False //Prevents any save-specific settings from being loaded if set to True\n\u003E     allowZero = False //Allows values to be set to near-zero; this can be overridden in a save file\n\u003E     alterActive = False //Allows currently active contracts to be altered; this can be overridden in a save file\n\u003E     stockToolbar = True //If Blizzy78\u0027s Toolbar is installed this can be used to use it instead of the stock app launcher; this can be overridden in a save file\n\u003E     warnedZero = False //Prevents the warning popup when activating \u0022Allow Zero\u0022 in-game; this can be overridden in a save file\n\u003E     warnedToolbar = False //Prevents the warning popup when disable the toolbar in-game; this can be overridden in a save file\n\u003E     warnedAlterActive = False //Prevents the warning popup when activating \u0022Alter Active Contracts\u0022 in-game; this can be overridden in a save file\n\u003E     ContractTypeConfigs\n\u003E     {\n\u003E     Item //An example of a contract type\n\u003E     {\n\u003E     typeName = CollectScience //The contract types name; this is found in the game code and must match the real name exactly\n\u003E     fundReward = 0.5 //The reward and penalty values can be set from 0 to 10; this corresponds to 0 - 1000%, or a 0 - 10X multiplier.\n\u003E     fundPenalty = 1.8 //Values set to 0 in the config file will be replaced by 0.0000000001\n\u003E     fundAdvance = 1.2\n\u003E     repReward = 0.7\n\u003E     repPenalty = 1.3\n\u003E     scienceReward = 0\n\u003E     durationTime = 0.6 //Duration time values below 0.1 (10%) are not allowed; anything below that will be increased to 0.1\n\u003E     maxOffer = 4 //Values can be set to 0 to prevent any offers of this type\n\u003E     maxActive = 6 //A value of 100 means no limit on offered or active contracts\n\u003E     contractConfiguratorType = False //Contract Configurator contracts require special handling; this value should not be altered by hand\n\u003E     }\n\u003E     }\n\u003E     ParameterTypeConfigs //Each parameter type has its own set of values\n\u003E     {\n\u003E     Item\n\u003E     {\n\u003E     typeName = CollectScience //Parameter type name\n\u003E     fundReward = 0.2 //Reward and penalty values are set the same as described above\n\u003E     fundPenalty = 3.5\n\u003E     repReward = 0.3\n\u003E     repPenalty = 4.0\n\u003E     scienceReward = 0.2\n\u003E     contractConfiguratorType = False //The same as described above\n\u003E     }\n\u003E     }\n\u003E     }\n\u003E \n\n--------------------\n\n[![btn_donate_SM.gif](https://www.paypalobjects.com/en_US/i/btn/btn_donate_SM.gif)](https://www.paypal.com/cgi-bin/webscr?cmd=_s-xclick\u0026hosted_button_id=CNT8SLSZ6JC36) Consider donating if you like what you see here. \\* Money will not go directly to development or upkeep of this addon\n\n--------------------\n\nChange Log:\n\n    v2.17\n    - Update for KSP 1.8\n    \n    v2.6\n    - Updated for KSP 1.4\n    \n    v2.5\n    - Updated for KSP 1.3\n    \n    v2.4\n    - Updated for KSP 1.2\n    - Update Toolbar wrapper\n    - Fix support for Contract Configurator\n           - CC contracts only modified when the contract is accepted, not when offered\n    - Ignore contract weighting when blocking contracts\n    - Fix some Unity initialization errors\n    \n    v2.3\n    - Updated for KSP 1.1.1\n    - Fixed an issue that prevented the window from being used immediately after first starting KSP\n    \n    v2.2\n    - Updated for KSP 1.1\n    \n    v2.1\n    - Updated for KSP 1.0.5\n    - Don\u0027t apply the contract decline penalty when blocking contracts over the limit\n    - Update the default config file with new contract and parameter types; remove deprecated types\n    - Some UI tweaks\n    - Fix some potential loading errors\n    - Fix a potential problem with the close button icon\n    - Remove some log spam when using mods that add new contracts\n    \n    v2.0\n    - Updated for KSP 1.0\n    \n    v1.3\n    - Bug fix for blocking contract offers beyond the limits you\u0027ve set\n        - Contracts added from the Alt\u002BF12 debug menu will no longer be block\n        - Only contracts added through the automatic Contract System will be blocked now\n    \n    v1.2\n    - Update for compatibility with Contract Configurator 0.7.0\n    \n    v1.1\n    - Initial release\n\nThis addon uses [TriggerAu\u0027s KSP Plugin Framework code](https://forum.kerbalspaceprogram.com/entries/1228)\n\nReleased under the [MIT License](http://opensource.org/licenses/MIT)\n\n**Edited \u003Ctime datetime=\u00222019-11-02T03:30:31Z\u0022 title=\u002211/02/2019 03:30  AM\u0022 data-short=\u00224 yr\u0022\u003ENovember 2, 2019\u003C/time\u003E by DMagic**\n  \nKSP 1.8"},{"CreatedByName":"nightingale","CreatedById":119307,"CreatedDateTime":"2015-03-16T16:17:13Z","Content":"Good stuff, congrats on the release!"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2015-03-16T16:21:21Z","Content":"\u003E \n\u003E Good stuff, congrats on the release!\n\nThanks.\n\nAs a side note, Contract Configurator contracts are theoretically supported as of version 7.0, but this may need updating when that is released. For now any CC contract types will simple be ignored; CC parameter types should be fine."},{"CreatedByName":"nightingale","CreatedById":119307,"CreatedDateTime":"2015-03-16T16:24:44Z","Content":"\u003E \n\u003E As a side note, Contract Configurator contracts are theoretically supported as of version 7.0, but this may need updating when that is released. For now any CC contract types will simple be ignored; CC parameter types should be fine.\n\nAnd I\u0027m expecting to get 0.7.0 out tonight or tomorrow, so there won\u0027t be too long to wait on this."},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2015-03-18T00:58:37Z","Content":"Version 1.2 is out.\n\nIt is just a minor compatibility update for Contract Configurator. Contract Rewards Modifier was trying to get to CC\u0027s contract type list before CC could generate it, so this update just makes it wait a bit before trying to access the list. \n\nAll CC contract types should show up at the bottom of the Contract Type list and be limited to at least 1 offered and active contracts. They also won\u0027t update in real time if you have Contracts Window \u002B, all other contract types should, but the update values will be shown after the next scene change."},{"CreatedByName":"Ser","CreatedById":104207,"CreatedDateTime":"2015-03-18T09:08:39Z","Content":"Nice one. Convenient GUI is definitely an advantage ![:wink:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2015-03-29T22:36:40Z","Content":"Version 1.3 is out on [Kerbal Stuff](https://kerbalstuff.com/mod/646).\n\nIt fixes a problem where contracts added through the standard, automatic system were not being blocked properly when you\u0027ve set limits on the amount of active or offered contracts of a certain type.\n\nAs a side effect of fixing this, you can now add contracts beyond the your limits using the Alt\u002BF12 debug menu."},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2015-04-12T23:37:48Z","Content":"So, um, is there something I should know about? ![:kiss:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_kiss.gif)\n\nThere seems to be a lot of downloads for Version 1.2 and not so many for 1.3. I\u0027m wondering if there is some bug in 1.3 that I\u0027m not aware of.\n\n![VS5z1EJ.jpg](http://i.imgur.com/VS5z1EJ.jpg)"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2015-04-27T20:02:26Z","Content":"Version 2.0 is out and updated for KSP 1.0, everything seems to be working ok."},{"CreatedByName":"mudkest","CreatedById":115812,"CreatedDateTime":"2015-04-28T13:14:02Z","Content":"I have a problem with version 2.0, namely the science sliders are a bit wonkey. the first time I put the sliders down it doesnt change any contract, but after that theye are affected.\n\nFor example, I have a contract that offers 6 science. I put the slider to 0.1 and the contract still offers 6 science. I put the slider back to 100 and now the contract offers 6000 science. Putting slider back to 0.1 and it\u0027s back to 6 science."},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2015-04-28T15:51:08Z","Content":"\u003E \n\u003E I have a problem with version 2.0, namely the science sliders are a bit wonkey. the first time I put the sliders down it doesnt change any contract, but after that theye are affected.\n\u003E For example, I have a contract that offers 6 science. I put the slider to 0.1 and the contract still offers 6 science. I put the slider back to 100 and now the contract offers 6000 science. Putting slider back to 0.1 and it\u0027s back to 6 science.\n\nDid you have the \u0022Alter Active Contracts\u0022 option turned on when you started adjusting the sliders. If you have it turned off, then move the sliders around, then turn it on and start moving the sliders weird things will happen (really it just doesn\u0027t have any way of \u0022remembering\u0022 what the previous settings were).\n\nYou should either turn that option on or leave it off, don\u0027t fiddle with it, as is stated in the instructions in the first post.\n\nTo fix it, you can turn off the active contracts option, reset the science slider to 100%, then turn it back on, then you should be able to adjust the values and get results that make sense. You can essentially exploit the system doing this, getting nearly infinitely large rewards, but you might as well just use the cheat options if you\u0027re going to do that."},{"CreatedByName":"mudkest","CreatedById":115812,"CreatedDateTime":"2015-04-28T18:20:22Z","Content":"I had it on before I started adjusting, but nice to know how to fix it ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nedit: I installed again and tested with a new game, it works fine now. Guess something didnt install correct the first time as another problem I had is gone now as well, after \u0022completing\u0022 a record contract(speed/ altitude) it would not actually complete, but would get copied in the contract dropdown, then copy again when the parameter for the next one would trigger so at 750 m/s and 50km altitude for example I\u0027d have 4 or 5 \u0022go 250 m/s\u0022 and a bunch of the altitude as well. Thought it was caused by either this plugin or contract window, but that \u0022bug\u0022 is gone now as well. \n\nguess something did not install correct first time. Off to enjoy a game with not so much science spam from contracts now ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\n**Edited \u003Ctime datetime=\u00222015-04-28T18:34:20Z\u0022 title=\u002204/28/2015 06:34  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 28, 2015\u003C/time\u003E by mudkest**"},{"CreatedByName":"JedTech","CreatedById":104003,"CreatedDateTime":"2015-05-01T19:03:34Z","Content":"It seems to me that this mod is going to let me get rid of all those part testing contracts that I despise. That\u0027s exciting!"},{"CreatedByName":"Sof","CreatedById":65663,"CreatedDateTime":"2015-06-01T21:03:00Z","Content":"I tried to use this mod to stop KSP from giving me rescue Kerbal contracts, but when I changed the slider for that type, nothing happened and the game still offered me those contracts at the same rate.\n\nA while later, all contracts stopped completely even though the max offered for every other contract type is 10 according to this."},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2015-06-02T00:55:58Z","Content":"\u003E \n\u003E I tried to use this mod to stop KSP from giving me rescue Kerbal contracts, but when I changed the slider for that type, nothing happened and the game still offered me those contracts at the same rate.\n\u003E A while later, all contracts stopped completely even though the max offered for every other contract type is 10 according to this.\n\nDo you have the log files?"},{"CreatedByName":"Sof","CreatedById":65663,"CreatedDateTime":"2015-06-02T10:48:10Z","Content":"Do you mean the KSP.log file or the Contract ModifierConfig.cfg?"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2015-06-02T15:18:05Z","Content":"\u003E \n\u003E Do you mean the KSP.log file or the Contract ModifierConfig.cfg?\n\nKSP\\_Data/output\\_log.txt is the log file."},{"CreatedByName":"Sof","CreatedById":65663,"CreatedDateTime":"2015-06-02T16:58:58Z","Content":"[http://www./view/04xl5v85j7puxf3/output_log.txt](http://www./view/04xl5v85j7puxf3/output_log.txt)"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2015-06-02T18:06:42Z","Content":"Hmm, how about the save file?\n\nAlso, you should probably remove DDSLoader, I don\u0027t think there is any reason to keep that around anymore. Though I\u0027m pretty sure that isn\u0027t causing this problem.\n\nWhen Contract Reward Modifier blocks a contract it generates a log file: Contract of type[\\*] over the limit; blocking contract, or something to that effect. \n\nThat message doesn\u0027t show up anywhere in the log file, so CRM isn\u0027t actually blocking anything, at least not during the period covered by this log file. There is a contract completion message, new contracts are generally created whenever you complete a contract, so I would have expected to see that log message pop up there.\n\nHave you tried adding contract manually, through the Alt \u002B F12 debug menu. CRM won\u0027t block contracts added that way, so you can check if there is some other problem by trying that."},{"CreatedByName":"Sof","CreatedById":65663,"CreatedDateTime":"2015-06-02T18:47:14Z","Content":"In all fairness, it is probably a user error somewhere along the line. \n\nI have managed to get it to keep sending more contracts, but the Rescue Kerbal contracts keep appearing.\n\nI selected the Rescue Kerbal contract in the contract reward modifier menu and set the max offered slider to 0 and then saved to config."},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2015-06-02T18:52:34Z","Content":"There is something weird in the log file about CRM not finding a handful of contract types, I think the rescue missions were one of them. Maybe try deleting the config file and copying the default file from the download package. It *should* be able to automatically add contract types that aren\u0027t in the config file, but maybe something is going wrong there."},{"CreatedByName":"korogg","CreatedById":143513,"CreatedDateTime":"2015-06-12T18:09:19Z","Content":"Hi! I love this mod! I am having a problem. When I load my game, my version checker is telling me that \u0022Contract Reward Modifier\u0022 is a mod made for an earlier version of KSP. I am afraid to use this mod until this is corrected. I\u0027ll keep checking for an updated version. Thank you! \n\n\u003E \n\u003E **Contract Reward Modifier V2.0**\n\u003E \n\u003E Download from [Kerbal Stuff](https://kerbalstuff.com/mod/646)\n\u003E \n\u003E Alternate Download: [MediaFire](http://www./download/r7h0gph6ba5sfan/Contract_Reward_Modifier-2.0.zip)\n\u003E \n\u003E \n\u003E \n\u003E Source is available at [GitHub](https://github.com/DMagic1/Contract-Modifier)\n\u003E \n\u003E Formerly a part of [THREAD=91034]Contracts Window \u002B[/THREAD], Contract Reward Modifier provides an in-game UI for modifying all contract reward and penalties, as well as allowing for limits to be placed on the number of contracts offered for each type. All values can also be set using a global config file in your GameData folder.\n\u003E \n\u003E [http://i.imgur.com/FdXv5C1.jpg](http://i.imgur.com/FdXv5C1.jpg)\n\u003E \n\u003E The Contract Reward Modifier window presents a set of sliders that allow for changes to all contract and parameter reward amounts, as well as several other options.\n\u003E \n\u003E Contract and Parameter Type Selection\n\u003E \n\u003E \n\u003E \n\u003E - At the top of the window are two drop down buttons that allow for the selection of different contract and parameter types.  \n\u003E \n\u003E     - A special **Global Settings** selection is available for both Contract and Parameter Types.\n\u003E     - Values can be set with the sliders under the global settings; these will be applied to all Contract/Parameter Types after pushing the **Apply To All** button.\n\u003E \n\u003E \n\u003E     \n\u003E \n\u003E     [\\*]All addon contract and parameter types should be available here. \n\u003E \n\u003E     [\\*]Contract Configurator types are pushed to the bottom of the list to avoid any potential spoilers revealed by contract names.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Sliders\n\u003E \n\u003E \n\u003E \n\u003E - The sliders below control the amount given for each different reward and penalty type.\n\u003E - Strategy values are not directly affected by these sliders, i.e. setting science to 0.1% won\u0027t affect the science rewards given while using the science strategy.\n\u003E - The sliders are half-way log-scale; the left half of the slider allows for 0.1 - 100% of the original value, while the right half allows for 100-1000% of the original.\n\u003E - Contract duration can be adjusted from 10-1000%, but will only affect newly offered contracts.\n\u003E - The maximum number of offered and active contracts of a type can be specified; any contracts beyond this amount will be rejected when the system tries to offer new contracts.  \n\u003E \n\u003E     - All Contract Configurator contracts are can only be set to allow 1 or more contracts to be offered.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Addon Settings\n\u003E \n\u003E \n\u003E \n\u003E - By default the values only go down to 0.1%; there is an option to allow for nearly 0% (0.00000001%) using the **Allow 0% Values** toggle.  \n\u003E \n\u003E     - Using this may cause odd rounding errors and prevent further adjustments from being made to any active contracts/parameters of that type.\n\u003E \n\u003E \n\u003E     \n\u003E \n\u003E     [\\*]A toggle option is available to **Alter Active Contracts** as well as newly offered contracts.\n\u003E \n\u003E     \n\u003E \n\u003E     - Turning this on and off while adjusting values may cause problems with reward values.\n\u003E     - Be default it is off; but you should stick with either turning it on, or leaving it off; don\u0027t go back and forth.\n\u003E \n\u003E \n\u003E     \n\u003E \n\u003E     [\\*]If [THREAD=60863]Blizzy78\u0027s Toolbar[/THREAD] is installed you can switch between it and the stock app launcher using the **Use Stock Toolbar** toggle. \n\u003E \n\u003E     [\\*]There is also toggle to completely **Disable All Toolbars**.\n\u003E \n\u003E     \n\u003E \n\u003E     - This can be used if you have set the values you want and don\u0027t need the toolbar icon taking up space.\n\u003E     - Toolbars can be re-enabled by changing the **disableToolbar** field to **True** at the top of the config file.\n\u003E \n\u003E \n\u003E     \n\u003E \n\u003E     [\\*]Contract/Parameter amounts can be reverted to the default values set in your config file using the **Reset Values** button. \n\u003E \n\u003E     [\\*]The current values can be saved to the global config file in your GameData folder using the **Save To Config** button.\n\u003E \n\u003E     \n\u003E \n\u003E     - Values saved to the config file will serve as the default for current save games.\n\u003E     - New save files (or save files that haven\u0027t been loaded while Contract Reward Modifier has been installed) will set all contract and parameter values using the config file settings.\n\u003E     - The config file-only **disableSaveSpecificValues** field allows you to bypass any values set in your save files; all values stored in the save files will be deleted.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E \u003E \n\u003E \u003E An annotated example of the config file layout is shown here.\n\u003E \u003E \n\u003E \u003E \n\u003E \u003E \n\u003E \u003E ContractValuesNode  \n\u003E \u003E {  \n\u003E \u003E disableToolbar = False //Prevents the toolbar button from loading if set to True  \n\u003E \u003E disableSaveSpecificValues = False //Prevents any save-specific settings from being loaded if set to True  \n\u003E \u003E  allowZero = False //Allows values to be set to near-zero; this can be overridden in a save file  \n\u003E \u003E  alterActive = False //Allows currently active contracts to be altered; this can be overridden in a save file  \n\u003E \u003E  stockToolbar = True //If Blizzy78\u0027s Toolbar is installed this can be used to use it instead of the stock app launcher; this can be overridden in a save file  \n\u003E \u003E  warnedZero = False //Prevents the warning popup when activating \u0022Allow Zero\u0022 in-game; this can be overridden in a save file  \n\u003E \u003E  warnedToolbar = False //Prevents the warning popup when disable the toolbar in-game; this can be overridden in a save file  \n\u003E \u003E  warnedAlterActive = False //Prevents the warning popup when activating \u0022Alter Active Contracts\u0022 in-game; this can be overridden in a save file  \n\u003E \u003E  ContractTypeConfigs  \n\u003E \u003E  {  \n\u003E \u003E  Item //An example of a contract type  \n\u003E \u003E  {  \n\u003E \u003E  typeName = CollectScience //The contract types name; this is found in the game code and must match the real name exactly  \n\u003E \u003E  fundReward = 0.5 //The reward and penalty values can be set from 0 to 10; this corresponds to 0 - 1000%, or a 0 - 10X multiplier.  \n\u003E \u003E  fundPenalty = 1.8 //Values set to 0 in the config file will be replaced by 0.0000000001  \n\u003E \u003E  fundAdvance = 1.2  \n\u003E \u003E  repReward = 0.7  \n\u003E \u003E  repPenalty = 1.3  \n\u003E \u003E  scienceReward = 0  \n\u003E \u003E  durationTime = 0.6 //Duration time values below 0.1 (10%) are not allowed; anything below that will be increased to 0.1   \n\u003E \u003E  maxOffer = 4 //Values can be set to 0 to prevent any offers of this type  \n\u003E \u003E  maxActive = 6 //A value of 100 means no limit on offered or active contracts  \n\u003E \u003E  contractConfiguratorType = False //Contract Configurator contracts require special handling; this value should not be altered by hand   \n\u003E \u003E }  \n\u003E \u003E  }  \n\u003E \u003E ParameterTypeConfigs //Each parameter type has its own set of values  \n\u003E \u003E  {  \n\u003E \u003E  Item  \n\u003E \u003E  {  \n\u003E \u003E  typeName = CollectScience //Parameter type name  \n\u003E \u003E  fundReward = 0.2 //Reward and penalty values are set the same as described above  \n\u003E \u003E  fundPenalty = 3.5  \n\u003E \u003E  repReward = 0.3  \n\u003E \u003E  repPenalty = 4.0  \n\u003E \u003E  scienceReward = 0.2  \n\u003E \u003E  contractConfiguratorType = False //The same as described above  \n\u003E \u003E  }  \n\u003E \u003E }  \n\u003E \u003E }\n\u003E \u003E \n\u003E \u003E \n\u003E \u003E     \n\u003E \u003E \n\u003E \u003E \n\u003E \u003E \n\u003E \u003E \n\u003E \u003E \n\u003E \n\u003E \n\u003E --------------------\n\u003E \n\u003E [https://www.paypalobjects.com/en_US/i/btn/btn_donate_SM.gif](https://www.paypalobjects.com/en_US/i/btn/btn_donate_SM.gif) Consider donating if you like what you see here. \\* Money will not go directly to development or upkeep of this addon\n\u003E \n\u003E --------------------\n\u003E \n\u003E Change Log: \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E     v2.0- Updated for KSP 1.0v1.3- Bug fix for blocking contract offers beyond the limits you\u0027ve set    - Contracts added from the Alt\u002BF12 debug menu will no longer be block    - Only contracts added through the automatic Contract System will be blocked nowv1.2- Update for compatibility with Contract Configurator 0.7.0v1.1- Initial release\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E This addon uses [TriggerAu\u0027s KSP Plugin Framework code](https://forum.kerbalspaceprogram.com/entries/1228)\n\u003E \n\u003E Released under the [MIT License](http://opensource.org/licenses/MIT)"},{"CreatedByName":"Rokanov","CreatedById":149722,"CreatedDateTime":"2015-08-15T11:32:15Z","Content":"Have a question about the scope of the mod. Is it meant to only affect contracts, or all multipliers (like the sliders when creating a new game)? For an example is it meant to affect building upgrade cost (a result of FundsLossMultiplier I think?). When I was trying it out briefly, it didn\u0027t appear to affect the science gain after recovering a vessel, hence my question ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2015-08-17T00:18:20Z","Content":"\u003E \n\u003E Have a question about the scope of the mod. Is it meant to only affect contracts, or all multipliers (like the sliders when creating a new game)? For an example is it meant to affect building upgrade cost (a result of FundsLossMultiplier I think?). When I was trying it out briefly, it didn\u0027t appear to affect the science gain after recovering a vessel, hence my question ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nNo, it\u0027s all separate from those difficulty sliders. You could use it for separating building upgrade costs (I think Kerbal hiring costs are also affected) from contract penalties. Just leave the stock slider at 100% (or whatever value), then change the global contract funds and/or rep penalty sliders to something higher. \n\nThe science gains from vessels returns and experiments also aren\u0027t affected by this mods sliders. You could do something similar to what is described above though, use the stock science slider to set values for experiments and adjust the contract sliders from this mod accordingly. \n\nAnd all of the stock difficulty settings can be changed in your save file after starting. They are all found near the very top of the file, I think the values aren\u0027t given as percentages, so if you have science returns at 60% it will show as 0.6 in the save file."},{"CreatedByName":"gerishnakov","CreatedById":147128,"CreatedDateTime":"2015-11-20T00:30:38Z","Content":"Is this working in 1.0.5? I just tried to alter some contracts I\u0027d already accepted and nothing happened when I clicked Apply to All."}]}