{"TopicId":102173,"ForumId":16,"TopicTitle":"Rocket doesn\u0026#039;t lift up (accelerate)","CreatedByName":"shuno","CreatedById":139612,"CreatedDateTime":"2015-03-17T23:28:01Z","PageNum":1,"Articles":[{"CreatedByName":"shuno","CreatedById":139612,"CreatedDateTime":"2015-03-17T23:28:01Z","Content":"\n\u003Cp\u003EHello guys!\u003C/p\u003E\u003Cp\u003EFirst post here. \u003C/p\u003E\u003Cp\u003EJust started with the game a few days ago and it\u0027s amazing! I\u0027m really having a blast thus far. But now I stumbled upon the first problem I can\u0027t solve. After the Mun I traveled to Minmus and set up a base there. Managed to land with pretty much the last drop of fuel in the landing module. Did some science and everything went pretty well. \u003C/p\u003E\u003Cp\u003E... until I wanted to return home. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E Here is an image:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/IgDpdqk.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/IgDpdqk.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe problem is: The upper stage won\u0027t lift off. At first I thought it has to much mass so I transfered most of the fuel back into the landing module. But still... it doesn\u0027t accelerate. So I thought maybe even with half empty tanks it has to much mass. So I decoupled two of the three capsules on top and tried it again. Same problem. \u003C/p\u003E\u003Cp\u003EBut... now with the landing module having fuel again I accidentially thrusted the whole landing module with the upper stage on top(!) and it lift up without a hassle. Since both engines are the same I can\u0027t really explain why the upper stage alone can\u0027t get up. I checked everything, like having the upper engines throttle lowered and so on. But nothing. One thing I noticed is that the blind (marked in the picture) don\u0027t blast off when I decouple the upper stage. Is this the problem? I tried to slide over the ground to get rid of it but that didn\u0027t work. I remember that one time this kind of blind didn\u0027t blast off when I was using the atomic engine but I\u0027m pretty sure it wasn\u0027t a problem back then. \u003C/p\u003E\u003Cp\u003ESo has anyone any idea how to fix this and get Jeb and company back to Kerbin? \u003C/p\u003E\u003Cp\u003EThanks! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-17T23:55:04Z\u0022 title=\u002203/17/2015 11:55  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 17, 2015\u003C/time\u003E by shuno\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-03-17T23:35:33Z","Content":"\n\u003Cp\u003EHmm I can\u0027t see your staging, is the decoupler not decoupling?\u003C/p\u003E\n"},{"CreatedByName":"AlexinTokyo","CreatedById":104401,"CreatedDateTime":"2015-03-17T23:38:08Z","Content":"\n\u003Cp\u003EAt a guess (and I stress that it\u0027s just a guess), you may have attached the return stage\u0027s engine to the wrong attachment node of the decoupler. In that case, even if the decoupler fires, the engine will still be blocked and generate no thrust.\u003C/p\u003E\n"},{"CreatedByName":"shuno","CreatedById":139612,"CreatedDateTime":"2015-03-17T23:41:00Z","Content":"\n\u003Cp\u003EHi.\u003C/p\u003E\u003Cp\u003EYes I can decouple it. But it just falls of the whole landing module and lays on the ground. So I tried to slide on the ground to get rid of the marked blind but it didn\u0027t work. I can see the jet coming out on the bottom of the engine too. I tried to decouple it without staging already and it\u0027s the same. It decouples but even with full throttle the whole thing won\u0027t move.\u003C/p\u003E\u003Cp\u003E@\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/members/107315-AlexinTokyo\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003EAlexinTokyo\u003C/strong\u003E\u003C/a\u003E:\u003C/p\u003E\u003Cp\u003EHi and thank you too!\u003C/p\u003E\u003Cp\u003EHmm. maybe that\u0027s the case. Any way to fix this or to check if it is the case?\u003C/p\u003E\u003Cp\u003Eedit: Hmm.. yeah, I think that\u0027s the problem. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-17T23:50:00Z\u0022 title=\u002203/17/2015 11:50  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 17, 2015\u003C/time\u003E by shuno\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-03-17T23:46:31Z","Content":"\n\u003Cp\u003EThe fairing on the 909 looks awfully short, I think AlexinTokyo is correct, and our thrust is being blocked by the fairing.\u003C/p\u003E\u003Cp\u003EIt might be possible to edit the part out of the save file but I\u0027d send a rescue craft instead, rescuing is a major past time of kerbals.\u003C/p\u003E\u003Cp\u003EEdit:\u003C/p\u003E\u003Cp\u003EIf you upload your save file we could try fixing it for you, make a quicksave (F5) and put it on dropbox.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-17T23:48:56Z\u0022 title=\u002203/17/2015 11:48  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 17, 2015\u003C/time\u003E by sal_vager\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"shuno","CreatedById":139612,"CreatedDateTime":"2015-03-17T23:52:45Z","Content":"\n\u003Cp\u003E@sal_vager: \u003C/p\u003E\u003Cp\u003EHehe. \u003C/p\u003E\u003Cp\u003EI\u0027m already planning the rescue mission. If everything goes wrong I will upload the save game, but I think it shouldn\u0027t be a problem to get Jeb and Co. out of there. But thanks anyway! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Jean Deaux","CreatedById":59842,"CreatedDateTime":"2015-03-20T04:02:46Z","Content":"\n\u003Cp\u003EI zoomed in pretty tight on the command capsules, to me it looks like the command modules on your Return Stage are decoupled and are just laying on top of the Return Stage (usually they sit a bit high on a decoupler). If this is the case, your engines aren\u0027t firing because there is no command module attached.\u003C/p\u003E\n"}]}