{"TopicId":102161,"ForumId":16,"TopicTitle":"What\u0026#039;s the best Way to Discover an Easter Egg ?","CreatedByName":"Sovnheim","CreatedById":104593,"CreatedDateTime":"2015-03-17T20:09:42Z","PageNum":1,"Articles":[{"CreatedByName":"Sovnheim","CreatedById":104593,"CreatedDateTime":"2015-03-17T20:09:42Z","Content":"\n\u003Cp\u003EHi everybody,\u003C/p\u003E\u003Cp\u003EI know there is a ton of easter eggs in the game and I want to discover at least a few of them.\u003C/p\u003E\u003Cp\u003EBasically I play Career Mode, with most of the tech I need for rovers / spaceplanes / probes right now. I don\u0027t really like ISA MapSat which I find buggy and somewhat boring despite its usefulness.\u003C/p\u003E\u003Cp\u003EI have also always kept myself away from all the spoilers \u0026amp; lists with GPS locations I I would like to have a chance to discover those a bit more organically, i.e. throughout the normal course of the game.\u003C/p\u003E\u003Cp\u003EIs there a way to discover these without using ISA MapSat and without simply looking them up on Kerbalpdia ?\u003C/p\u003E\u003Cp\u003EThank you all for your help \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-17T22:44:40Z\u0022 title=\u002203/17/2015 10:44  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 17, 2015\u003C/time\u003E by Sovnheim\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"smjjames","CreatedById":134004,"CreatedDateTime":"2015-03-17T20:16:28Z","Content":"\n\u003Cp\u003ESometimes the science reports might give clues, especially if you have Community Sourced Science.\u003C/p\u003E\u003Cp\u003EWithout mods though, no clue.\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2015-03-17T20:22:39Z","Content":"\n\u003Cp\u003EIn stock KSP if you head off the runway at about a 45 degree angle you will run into one. It might be mostly buried depending on your terrain detail\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2015-03-17T20:30:24Z","Content":"\n\u003Cp\u003EISA Mapsat is \u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EOLD\u003C/strong\u003E\u003C/span\u003E and completely outdated. ScanSat is better and up-to-date with 0.90.\u003C/p\u003E\u003Cp\u003EWithout mods you can either rely on luck or on good eyes. My very first successful Mun landing ever was within visible distance from an arch purely by chance. I found the memorial because I saw some strange flicker of light on the surface and decided to investigate after I realized it could be another egg.\u003C/p\u003E\u003Cp\u003EDMagic\u0027s \u003Ca href=\u0022forum.kerbalspaceprogram.com/threads/64972\u0022 rel=\u0022external nofollow\u0022\u003EOrbital Science\u003C/a\u003E mod adds a lot of science parts but it also gives contracts to investigate \u0027anomalies\u0027.\u003C/p\u003E\n"},{"CreatedByName":"smjjames","CreatedById":134004,"CreatedDateTime":"2015-03-17T20:33:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Taki117\u0022 data-cite=\u0022Taki117\u0022\u003E\u003Cdiv\u003EIn stock KSP if you head off the runway at about a 45 degree angle you will run into one. It might be mostly buried depending on your terrain detail\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOr if you take off from the launchpad and go in a northeasterly direction, you\u0027ll pretty much fly right over it.\u003C/p\u003E\u003Cp\u003EAlso, in once case, the biome is a dead giveaway. Though I\u0027m not sure if that one neccesarily counts as an easter egg since it\u0027s not exactly hidden, or hard to find.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-17T20:37:48Z\u0022 title=\u002203/17/2015 08:37  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 17, 2015\u003C/time\u003E by smjjames\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sbski","CreatedById":135580,"CreatedDateTime":"2015-03-17T20:40:12Z","Content":"\n\u003Cp\u003ESovnheim, to answer your question: Yes and No. It can be affected by your resolution of your screen and a few preferences. There are some really good ways of trying to find them but they are rare to just come across. The first way to find them in a non spoiler way is to go to \u003Ca href=\u0022http://www.kerbalmaps.com/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.kerbalmaps.com/\u003C/a\u003E and show the anomolies(show location but not what is there. I suggest this one because you get a surprise after you look for the monument and find it). The second is to spend your time in very low (possibly) polar orbit looking for the 1 to 2 abnormal pixels of a easter egg (some are visible from orbit but really they are really hard to see). I don\u0027t suggest this, but you could just go out and look for an easter egg on one of the planets that contain them. I hope this helps\u003C/p\u003E\u003Cp\u003E- sbski\u003C/p\u003E\n"},{"CreatedByName":"Sovnheim","CreatedById":104593,"CreatedDateTime":"2015-03-17T22:40:00Z","Content":"\n\u003Cp\u003EIt does \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m going to go for the Kerbal Maps and try to go looking for them without additionnal guidance. That should make for some interesting challenges.\u003C/p\u003E\u003Cp\u003EAnd I may download ScanSat as well if you tell me it\u0027s a better alternative - thanks all for the advice.\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-03-18T00:10:57Z","Content":"\n\u003Cp\u003EHonestly, I think most of the easter eggs were found by people digging through the files rather than looking at scenery. \u003C/p\u003E\u003Cp\u003E Odds are you probably won\u0027t just stumble across one at random (other than the stuff very close to KSC).\u003C/p\u003E\u003Cp\u003E IIRC, the original intent of the easter eggs was to tell a story. Each egg would give you a clue to help you find more. But the clues don\u0027t actually exist anymore \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-03-18T01:32:25Z","Content":"\n\u003Cp\u003ELook from orbit. Easter Eggs are generally visible as flashing points of light, if not outright plain to see from a low enough orbit.\u003C/p\u003E\u003Cp\u003EKerbin\u0027s are probably some of the harder to spot actually, because you can\u0027t get into a really low orbit because the atmosphere is in the way.\u003C/p\u003E\n"},{"CreatedByName":"Steelsunoa","CreatedById":135938,"CreatedDateTime":"2015-03-18T02:37:44Z","Content":"\n\u003Cp\u003EWithout disclosing information that would basically be a spoiler...I\u0027d say fly/orbit at a low altitude and look around. With a higher resolution you will see \u0022something\u0022 on the surface when passing near it. Some are probably more obvious than others, I have not found many myself.\u003C/p\u003E\u003Cp\u003EThe first one I semi-discovered was from building a craft with a bunch of \u0022probes\u0022 that decoupled. I then toggled through them and the debris, then scrolled the view back to look at the terrain. I say semi-discovered because I read something in a thread that gave away the general location.\u003C/p\u003E\u003Cp\u003EHappy Hunting!\u003C/p\u003E\n"},{"CreatedByName":"AmpsterMan","CreatedById":32671,"CreatedDateTime":"2015-03-18T14:37:26Z","Content":"\n\u003Cp\u003EMake sure resolution is the highest you can handle and your detail settings are set on high; otherwise many of the monolith may be underground. As for the non monoliths, many are simply a case of vigilant eyes and orbiting close to the planet/moon or flying around in the case of Kerbin.\u003C/p\u003E\u003Cp\u003EAs someone that tried too find all the Easter eggs by myself ages ago, there is no pattern to where they may be found so really it\u0027s just random chance.\u003C/p\u003E\n"},{"CreatedByName":"sbski","CreatedById":135580,"CreatedDateTime":"2015-03-18T15:05:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sovnheim\u0022 data-cite=\u0022Sovnheim\u0022\u003E\u003Cdiv\u003EIt does \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003Cp\u003EI\u0027m going to go for the Kerbal Maps and try to go looking for them without additionnal guidance. That should make for some interesting challenges.\u003C/p\u003E\u003Cp\u003EAnd I may download ScanSat as well if you tell me it\u0027s a better alternative - thanks all for the advice.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPersonally, ScanSat takes away some of the adventure. I think it\u0027s fun to try to look at the map and have to guess rather than knowing where you are on the map. Also, I haven\u0027t used ScanSat for a bit but last time that I used it, it took forever to get the entire planet scanned. But have fun exploring!\u003C/p\u003E\n"}]}