{"TopicId":102261,"ForumId":32,"TopicTitle":"How many times do you start over?","CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2015-03-19T14:15:11Z","PageNum":1,"Articles":[{"CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2015-03-19T14:15:11Z","Content":"\n\u003Cp\u003ESo I find that, whether in KSP or in some other strategy game, perhaps, or even in other sandboxes, that it gets to the point all too often where I just feel the need to start over, that mentality of \u003Cem\u003ENow I know what to do, the next time is gonna be so much better!\u003C/em\u003E\u003C/p\u003E\u003Cp\u003ESo I was curious: How many times do you start all over again with a new save in KSP?\u003C/p\u003E\n"},{"CreatedByName":"Varsi","CreatedById":120571,"CreatedDateTime":"2015-03-19T14:20:50Z","Content":"\n\u003Cp\u003EDefinitely after every update to see how everything has changed. Sometimes to try out different mod combinations.\u003C/p\u003E\n"},{"CreatedByName":"LordFjord","CreatedById":97341,"CreatedDateTime":"2015-03-19T14:24:34Z","Content":"\n\u003Cp\u003EEach update at least one new career save and one new sandbox save.\u003C/p\u003E\n"},{"CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2015-03-19T14:25:04Z","Content":"\n\u003Cp\u003EAw man, I didn\u0027t think of that option. That makes too much sense \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 alt=\u0022:rolleyes:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Starhawk","CreatedById":131400,"CreatedDateTime":"2015-03-19T14:25:53Z","Content":"\n\u003Cp\u003EEach new version mandates a new save for me. Whenever I try out new mods, I start a brand new save. When I feel a sense of completion with a career, and want to try different difficulty settings, I start a new save.\u003C/p\u003E\u003Cp\u003EI feel that in many ways I\u0027m still exploring aspects of the game itself, and still have much to learn. Therefore, I don\u0027t tend to build up a lot of infrastructure yet. I usually concentrate on planning, engineering, and piloting one mission at a time. So I\u0027m not giving up a lot with a new career save, except having to do the early-game grind again.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-19T14:26:47Z\u0022 title=\u002203/19/2015 02:26  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 19, 2015\u003C/time\u003E by Starhawk\u003C/strong\u003E\n\u003Cbr\u003Eclarity\n\u003C/span\u003E\n"},{"CreatedByName":"r4pt0r","CreatedById":90471,"CreatedDateTime":"2015-03-19T14:27:52Z","Content":"\n\u003Cp\u003ENew update, New game. otherwise never.\u003C/p\u003E\n"},{"CreatedByName":"Merinsan","CreatedById":57629,"CreatedDateTime":"2015-03-19T14:28:29Z","Content":"\n\u003Cp\u003EEach new update, I start a new save. Most of the new content is wasted otherwise.\u003C/p\u003E\n"},{"CreatedByName":"jwilhite","CreatedById":90637,"CreatedDateTime":"2015-03-19T14:32:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Starhawk\u0022 data-cite=\u0022Starhawk\u0022\u003E\u003Cdiv\u003ESo I\u0027m not giving up a lot with a new career save, except having to do the early-game grind again.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s funny. I end up starting new games a lot because I think the early game is so much fun now, especially in hard mode. You actually have to do a little strategic planning about which buildings to upgrade when. And it\u0027s kind of fun to have to get around without maneuver nodes or to build your rockets with weight and part count constraints. I like the puzzle aspect of it.\u003C/p\u003E\u003Cp\u003EIt\u0027s during the grind to 6,000,000 to unlock the level 3 science center that I get bored and want to start over.\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2015-03-19T14:33:00Z","Content":"\n\u003Cp\u003ENew version, new career from scratch, then new career with the modded version once mods update.\u003C/p\u003E\n"},{"CreatedByName":"Randazzo","CreatedById":136468,"CreatedDateTime":"2015-03-19T14:36:47Z","Content":"\n\u003Cp\u003EUsually sometime mid-way through landing on the Moons of Jool. I get bored with \u0022late-game\u0022 pretty quickly, then start a new game and remember how much I dislike the first grind launches. The best part of KSP, in my opinion, is the early phase when you\u0027re just aiming for the Mun and Minmus, trying to patch something together with the tech you have.\u003C/p\u003E\n"},{"CreatedByName":"bdito","CreatedById":112760,"CreatedDateTime":"2015-03-19T14:43:56Z","Content":"\n\u003Cp\u003EOnly when a major update takes place. Did a new save with 0.24 and 0.90. I\u0027ll probably do another for 1.0 and I think that\u0027ll be the last one.\u003C/p\u003E\n"},{"CreatedByName":"Thomas988","CreatedById":92699,"CreatedDateTime":"2015-03-19T14:45:13Z","Content":"\n\u003Cp\u003EI still have the save I started KSP with back from 0.20 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E I really never got okay with building massive space stations, colonies, and spacecraft and then just deleting them for a new update.\u003C/p\u003E\n"},{"CreatedByName":"DunaRocketeer","CreatedById":103193,"CreatedDateTime":"2015-03-19T14:53:27Z","Content":"\n\u003Cp\u003EI\u0027ll go through two or three saves per version, typically. I love the early stages of the game. I don\u0027t know about others, but I often find that late in my career I have too many spacecraft all over the place and the gameplay experience feels.. \u003Cem\u003Ediluted\u003C/em\u003E.\u003C/p\u003E\u003Cp\u003EI\u0027ve solved that with my current career by keeping my in space infrastructure to the vicinity of Kerbin/Mun, and have a single interplanetary explorer to handle the rest of the Kerbol System.\u003C/p\u003E\n"},{"CreatedByName":"Starhawk","CreatedById":131400,"CreatedDateTime":"2015-03-19T14:56:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jwilhite\u0022 data-cite=\u0022jwilhite\u0022\u003E\u003Cdiv\u003EI end up starting new games a lot because I think the early game is so much fun now, especially in hard mode. You actually have to do a little strategic planning about which buildings to upgrade when.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI found some play value in the strategic planning in hard mode, but it tended to highlight the balance problems that the newer game elements still have.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EAnd it\u0027s kind of fun to have to get around without maneuver nodes or to build your rockets with weight and part count constraints. I like the puzzle aspect of it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI enjoyed that at first, but after a few times I found that it got stale for me. One of things I enjoy most in the game is building and flying planes and spaceplanes. So the early part where I have to grind and grind before I can unlock the aircraft landing gear seem more like an impediment or a barrier than a challenge to me, especially after I\u0027ve done it a few times.\u003C/p\u003E\u003Cp\u003EHappy landings!\u003C/p\u003E\n"},{"CreatedByName":"Wallygator","CreatedById":97357,"CreatedDateTime":"2015-03-19T14:59:47Z","Content":"\n\u003Cp\u003EAbout every 15 minutes. OSX. Nuff said. Devs? Are you listening?\u003C/p\u003E\n"},{"CreatedByName":"Barefoot Friar","CreatedById":77638,"CreatedDateTime":"2015-03-19T15:00:54Z","Content":"\n\u003Cp\u003EI make a new save with each version. Usually I stick with it until the new version comes out. Right now, though, I\u0027ve got a career save that\u0027s going pretty well but that I\u0027m getting bored with (trying to make money while doing whatever I want is getting really old), so I\u0027m thinking about either leaving it and starting over in sandbox, or else figuring out how to migrate the save. Haven\u0027t decided which.\u003C/p\u003E\n"},{"CreatedByName":"MarvinKitFox","CreatedById":99545,"CreatedDateTime":"2015-03-19T15:01:05Z","Content":"\n\u003Cp\u003ENot that often.\u003C/p\u003E\u003Cp\u003ESure I start over, now and then. Its not like I *have* to, I can stop at any time. Really I can!\u003C/p\u003E\u003Cp\u003EI have less than 14 games, in my KSP\\90\\Stock_3 folder This one has Clock and Engineer mods in it.\u003C/p\u003E\u003Cp\u003Ethe Stock_1 is pure stock, and Stock_2 is for my BTSM series.\u003C/p\u003E\u003Cp\u003EThen there is my Kethane universe.\u003C/p\u003E\u003Cp\u003EWith its Interstellar subfolder.\u003C/p\u003E\u003Cp\u003E.\u003C/p\u003E\u003Cp\u003E.\u003C/p\u003E\u003Cp\u003Eand the folder for challenges and wierd stuff.....\u003C/p\u003E\u003Cp\u003ESo, less than, ...... 157 games.\u003C/p\u003E\u003Cp\u003E(under .90, of course, we won\u0027t count the several previous versions, with their own hierarchies)\u003C/p\u003E\n"},{"CreatedByName":"-RanZ-","CreatedById":51892,"CreatedDateTime":"2015-03-19T15:27:41Z","Content":"\n\u003Cp\u003Ea lot! After 1.0 comes out I am going to start a new one and stick with it, by then everything I want to do should be in the game, pending they don\u0027t remove resources from this update. Once resources are in place I will be colonizing and putting in infrastructure on numerous planets.\u003C/p\u003E\n"},{"CreatedByName":"Kar","CreatedById":122714,"CreatedDateTime":"2015-03-19T15:39:37Z","Content":"\n\u003Cp\u003E\u003Cem\u003EProbably too often!\u003C/em\u003E \u003C/p\u003E\u003Cp\u003EI usually start over after a update, which is good but also frustrating because I did not do half of what I was planing. I always play career with science and money, so my gaming tends to take a lot of time to be able to go to another planet.\u003C/p\u003E\u003Cp\u003EI am very sad that I never left Kerbin to other planet, because with the mods I use that make the game more realistic, like life support, remote tech and others, my progression is very slow. I also use the stage recover mod, were I have to plan my rockets very careful to be able to recover them and save the most funds I can get. This involves of 95% of the rocket to have parachutes everywhere and precise ejection stages.\u003C/p\u003E\u003Cp\u003EBelieve it or not, KSP updates more faster then I can progress, but it is also true that I do not play KSP everyday. I do have other couple games that take too much of my time because they are online and I belong to organized clans.\u003C/p\u003E\u003Cp\u003EIn any case, with each failure, each update, each mission, my experience is getting better and better to plan ahead when I start over.\u003C/p\u003E\n"},{"CreatedByName":"worir4","CreatedById":75980,"CreatedDateTime":"2015-03-19T15:46:26Z","Content":"\n\u003Cp\u003EI start one after every update. Keeps things fresh!\u003C/p\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2015-03-19T16:19:13Z","Content":"\n\u003Cp\u003EI start new saves each time, (a sandbox or two for mucking about, and a career I\u0027ll play until the grind gets boring) though I\u0027ve had one save that I\u0027ve been running since about 0.20, (Which contains some kerbals from 0.18)\u003C/p\u003E\n"},{"CreatedByName":"Majorjim!","CreatedById":61954,"CreatedDateTime":"2015-03-19T17:21:40Z","Content":"\n\u003Cp\u003EI am constantly starting over. In the sense that I don\u0027t have a space program as I only build for single missions then fly that mission.\u003C/p\u003E\u003Cp\u003E I delete all debris and flags and stranded Kerbals.\u003C/p\u003E\n"},{"CreatedByName":"Jouni","CreatedById":97346,"CreatedDateTime":"2015-03-19T17:33:22Z","Content":"\n\u003Cp\u003EI start over all the time. Most major missions get a fresh save, and I restart my sandboxes when they become too cluttered. In the rare cases when I play career mode, I quit soon after finishing the tech tree or if I grow bored with flying the same basic missions.\u003C/p\u003E\n"},{"CreatedByName":"Slam_Jones","CreatedById":125101,"CreatedDateTime":"2015-03-19T17:39:39Z","Content":"\n\u003Cp\u003EI usually start a new save when:\u003C/p\u003E\u003Cp\u003E- I\u0027ve got too much clutter in orbit\u003C/p\u003E\u003Cp\u003E- I\u0027ve got an idea for a new style of space agency (my lastest has been an all-SSTO program)\u003C/p\u003E\n"},{"CreatedByName":"Random Tank","CreatedById":104325,"CreatedDateTime":"2015-03-19T17:53:53Z","Content":"\n\u003Cp\u003EI rarely restart, as I love going interplanetary and I actually wanna get stuff done... My current save (in 0.25, as I wouldn\u0027t be able to update it) I have 8 (earth) years of play time, and have visited every planet/moon at least once... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"}]}