{"TopicId":102390,"ForumId":34,"TopicTitle":"[1.2.2] Contract Pack: Bases and Stations 3.6.1 (30/04/2017) (formerly Kerbin Space Station)","CreatedByName":"severedsolo","CreatedById":80345,"CreatedDateTime":"2015-03-21T13:40:33Z","PageNum":22,"Articles":[{"CreatedByName":"CompB","CreatedById":99260,"CreatedDateTime":"2015-12-11T15:26:18Z","Content":"\u003E \n\u003E \n\u003E 9 hours ago, blu3wolf said:\n\u003E \n\u003E \n\u003E I have this mod installed, and Im still getting stock contracts to launch space stations - at least, I assume they are stock. I have one contract to Launch the The Mun Space Station, as well as several other contracts to launch a new space station around Duna/Minmus/Ike. Should those other contracts be disabled?\n\u003E \n\nThat confused me a bit too - until I realized that the mod is more than just for space stations that only orbit Kerbin. Perhaps a name change would be in order?"},{"CreatedByName":"blu3wolf","CreatedById":107912,"CreatedDateTime":"2015-12-11T15:58:03Z","Content":"space station! They are mine. If they say \u0022launch a new space station in orbit of \u0022 or similar, they are stock."},{"CreatedByName":"severedsolo","CreatedById":80345,"CreatedDateTime":"2015-12-12T07:40:58Z","Content":"\u003E \n\u003E \n\u003E 15 hours ago, blu3wolf said:\n\u003E \n\u003E \n\u003E Im not sure what happened, but Ive not gotten any more of them after they expired. If it happens again Ill save a copy of the persistence file and report it, but at the moment I dont really have any information to track it down with other than \u0022contracts were generated that should be disabled\u0022.\n\u003E \n\n[@nightingale](https://forum.kerbalspaceprogram.com/index.php?/profile/119307-nightingale/) - disabledContractType may still not be working. I\u0027ve noticed this myself, but didn\u0027t report it as I thought I\u0027d messed it up by manually fiddling with the settings.\n\nIn other news: for CKAN users on 1.0.4 the problem with version 3.0.2 will shortly be fixed. The CKAN guys are sorting it out, and once [this issue](https://github.com/KSP-CKAN/CKAN-meta/pull/879) is closed, 3.0.2 will no longer be offered for 1.0.4 users. Those of you already affected may need to uninstall KSS and re-install to get the right version."},{"CreatedByName":"blu3wolf","CreatedById":107912,"CreatedDateTime":"2015-12-12T08:38:35Z","Content":"Just gotten a few more of those contracts so I guess its definitely not working as intended for me."},{"CreatedByName":"nightingale","CreatedById":119307,"CreatedDateTime":"2015-12-12T16:38:09Z","Content":"\u003E \n\u003E \n\u003E 7 hours ago, blu3wolf said:\n\u003E \n\u003E \n\u003E Just gotten a few more of those contracts so I guess its definitely not working as intended for me.\n\u003E \n\nI\u0027ve gotten a few reports of this, please see [this](https://forum.kerbalspaceprogram.com/index.php?/topic/91625-105-contract-configurator-v190-2015-12-06/\u0026do=findComment\u0026comment=2319685) post on the Contract Configurator thread if you\u0027re able to provide more details."},{"CreatedByName":"garwel","CreatedById":141813,"CreatedDateTime":"2015-12-12T19:02:34Z","Content":"I have CKAN offering to upgrade KSS from 3.0.3 to 1:3.0.3 (yes, the version looks like this). But I didn\u0027t find any recent changes with such a version number. Is it a CKAN issue or was there any silent update?"},{"CreatedByName":"severedsolo","CreatedById":80345,"CreatedDateTime":"2015-12-12T19:11:21Z","Content":"The ckan boys said they were going to force an update to fix the 1.0.4 issues discussed above, I would guess that\u0027s it coming through"},{"CreatedByName":"garwel","CreatedById":141813,"CreatedDateTime":"2015-12-12T19:16:58Z","Content":"Oh, thanks!"},{"CreatedByName":"severedsolo","CreatedById":80345,"CreatedDateTime":"2015-12-13T10:20:55Z","Content":"Right you lovely lot: Base Construction integration is in the final phase of testing and has been merged into the main branch.\n\nThis means that you won\u0027t be seeing any bug fixes until I\u0027ve finished testing, but please keep reporting as you find them, and I\u0027ll do a big release once I\u0027m done."},{"CreatedByName":"severedsolo","CreatedById":80345,"CreatedDateTime":"2015-12-16T12:32:46Z","Content":"We\u0027re nearly there!\n\nA Pre-release of Bases and Stations (the new name for Kerbin Space Station) 3.1 is now available if anyone would like to test it (I know [@linuxgurugamer](https://forum.kerbalspaceprogram.com/index.php?/profile/129964-linuxgurugamer/) expressed an interest):\n\n**Bases and Stations 3.1b1**\n\nIntegrated CosmoBro\u0027s Base Construction pack into Kerbin Space Station.\n\nAlot of changes have been made, but the core \u0022Base Construction\u0022 gameplay remains.\n\n**Main Changes:**\n\n- All contracts simplified so you don\u0027t have to follow a specific path to get there. All that matters is the end result.\n- Removed Outpost Missions - not necessary because all contracts will generate for all bases, regardless of whether created as part of this pack.\n- M700 no longer unlocks early, bases are available once you get the M700 no sooner. (I am open to unlocking the M700 early if you stick a station in orbit - subject to feedback)\n- You no longer need a rover specifically to prospect a new base site. A lander will do, as long as you set Vessel Type to Rover.\n- Probably other stuff I\u0027ve forgotten.\n- Requires CC 1.9.1 or higher.\n\n**Still do do**\n\n- Rewards are horribly unbalanced, Need to fix this before release.\n- Use the Comms Lost mission on KSS - because it\u0027s cool.\n- Check all missions have targetBody set to make sure everything it scales.\n\n**Known issues**\n\n- Rewards (as mentioned above)\n- Science Expansion will generate indefinitely - fairly certain this is a CC bug, and should be fixed soon I hope.\n\nDownload it [HERE](https://github.com/severedsolo/KerbinSpaceStation/releases/tag/3.1b1)\n\n**Edited \u003Ctime datetime=\u00222015-12-16T12:33:42Z\u0022 title=\u002212/16/2015 12:33  PM\u0022 data-short=\u00228 yr\u0022\u003EDecember 16, 2015\u003C/time\u003E by severedsolo**"},{"CreatedByName":"Mister Spock","CreatedById":116542,"CreatedDateTime":"2015-12-16T17:14:25Z","Content":"Sounds great, [@severedsolo](https://forum.kerbalspaceprogram.com/index.php?/profile/80345-severedsolo/)!  I love your pack, and I\u0027m about to start a new career game with some new mods.  Will these be compatible with your mod?  My partial list includes Probus\u0027s Engineering Tech Tree, DMagic\u0027s Orbital Science, Nertea\u0027s Stockalike Station Parts and Universal Storage mods, and maybe the Kerbal Planetary Base System.  \n\nThanks for all your hard work on your excellent mod!"},{"CreatedByName":"severedsolo","CreatedById":80345,"CreatedDateTime":"2015-12-16T17:42:35Z","Content":"\u003E \n\u003E \n\u003E 27 minutes ago, Mister Spock said:\n\u003E \n\u003E \n\u003E Sounds great, [@severedsolo](https://forum.kerbalspaceprogram.com/index.php?/profile/80345-severedsolo/)!  I love your pack, and I\u0027m about to start a new career game with some new mods.  Will these be compatible with your mod?  My partial list includes Probus\u0027s Engineering Tech Tree, DMagic\u0027s Orbital Science, Nertea\u0027s Stockalike Station Parts and Universal Storage mods, and maybe the Kerbal Planetary Base System.  \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Thanks for all your hard work on your excellent mod!\n\u003E \n\nGenerally speaking Contract Packs don\u0027t conflict with other mods. The only time you may get issues is if a contract asks for specific parts/part modules. If the mods use their own modules (and I haven\u0027t specifically told the contract to look for them) you may get issues.\n\nIn that case, just ask though."},{"CreatedByName":"Mister Spock","CreatedById":116542,"CreatedDateTime":"2015-12-16T17:57:14Z","Content":"\u003E \n\u003E \n\u003E 14 minutes ago, severedsolo said:\n\u003E \n\u003E \n\u003E Generally speaking Contract Packs don\u0027t conflict with other mods. The only time you may get issues is if a contract asks for specific parts/part modules. If the mods use their own modules (and I haven\u0027t specifically told the contract to look for them) you may get issues.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E In that case, just ask though.\n\u003E \n\nWill do.  Thanks!"},{"CreatedByName":"linuxgurugamer","CreatedById":129964,"CreatedDateTime":"2015-12-16T18:22:45Z","Content":"thanks, will try it out later\n\nLGG"},{"CreatedByName":"severedsolo","CreatedById":80345,"CreatedDateTime":"2015-12-19T18:17:47Z","Content":"**Contract Pack: Bases and Stations 3.1 Released!**\n\nThis is a massive update. So massive that I feel that the minor version number change isn\u0027t doing it justice. However, I\u0027m going to use proper versioning, unlike SOME companies I won\u0027t mention, and this is compatible with previous versions so it\u0027s a minor increment.\n\n**Name Change / Headline Feature**\n\n- Merged CosmoBro\u0027s Base Construction with Kerbin Space Station. This means the pack has a new name: Contract Pack: Bases and Stations (installation path is unchanged so CKAN doesn\u0027t get confused).\n\n**Base Construction Changes from the original**\n\n- Missions will generate for all Bases, regardless of whether they were built using this pack.\n- Outpost Missions removed as they have been rendered irrelevant by the above.\n- Simplified contracts. How you get there no longer matters, just the end result.\n- The M700 will no longer unlock early. Instead you\u0027ll have to wait til you have it to start building bases. (note this doesn\u0027t stop you building your own bases, and getting maintenance contracts. You just won\u0027t get contracts to build bases until you unlock the M700)\n- Fixed a million (might be exaggerating a little) validation errors.\n- Tons of other stuff I\u0027ve probably forgotten about. I\u0027ve tried to keep it as close to the original as possible, while making it easy to maintain. Hopefully you won\u0027t notice many gameplay changes.\n\n**Licensing**  \n\nLicense updated to CC-BY-NC-SA 4.0. This isn\u0027t a massive change, it just means you can\u0027t use the pack for commercial purposes, and clarifies what \u0022appropriate attribution\u0022 means.\n\nBase Construction used under the MIT License and is available here: [https://github.com/CosmoBro/BaseConstruction](https://github.com/CosmoBro/BaseConstruction)\n\nI have exercised my right to sublicense - and have sublicensed Base Construction under CC-BY-NC-SA 4.0 as per the rest of the pack. In practice, this basically means you can\u0027t use Base Construction (as presented here) for commercial purposes, and have to give both myself and CosmoBro appropriate credit. You are of course free to use the original under MIT as I did.\n\n**Edited \u003Ctime datetime=\u00222015-12-19T18:27:20Z\u0022 title=\u002212/19/2015 06:27  PM\u0022 data-short=\u00228 yr\u0022\u003EDecember 19, 2015\u003C/time\u003E by severedsolo**"},{"CreatedByName":"garwel","CreatedById":141813,"CreatedDateTime":"2015-12-20T08:34:16Z","Content":"Wow, great news! Is it safe to update when I have an active KSS contract?"},{"CreatedByName":"severedsolo","CreatedById":80345,"CreatedDateTime":"2015-12-20T09:21:59Z","Content":"\u003E \n\u003E \n\u003E 48 minutes ago, garwel said:\n\u003E \n\u003E \n\u003E Wow, great news! Is it safe to update when I have an active KSS contract?\n\u003E \n\nShould be. I haven\u0027t touched any KSS contracts, just added the new Base Construction ones.\n\nAs a general rule: minor version changes (x.0.x - x.1) are fine to update. If there is a major version change (1.x - 2.x) then that\u0027s the point you should make sure you have finished all your contracts up.\n\nActually; yes definitely, I just updated myself and have active KSS contracts, they were unaffected.\n\n**Edited \u003Ctime datetime=\u00222015-12-20T09:22:33Z\u0022 title=\u002212/20/2015 09:22  AM\u0022 data-short=\u00228 yr\u0022\u003EDecember 20, 2015\u003C/time\u003E by severedsolo**"},{"CreatedByName":"Fyrem","CreatedById":57131,"CreatedDateTime":"2015-12-20T22:18:49Z","Content":"thanks, going to give it a run though now!"},{"CreatedByName":"LemonSkin","CreatedById":142318,"CreatedDateTime":"2015-12-22T23:31:47Z","Content":"Hey, awesome work on your mod, I really love it. However, ever since v1.05, I\u0027ve never been able to get any contracts other than \u0027scan body for base location\u0027, and those only started showing up after your most recent update. I\u0027ve also tried with a fresh save, absolutely no luck. I\u0027ve tried disabling all my other contract packs (including vanilla) and that just leaves my mission control window empty."},{"CreatedByName":"severedsolo","CreatedById":80345,"CreatedDateTime":"2015-12-23T05:50:23Z","Content":"\u003E \n\u003E \n\u003E 6 hours ago, LemonSkin said:\n\u003E \n\u003E \n\u003E Hey, awesome work on your mod, I really love it. However, ever since v1.05, I\u0027ve never been able to get any contracts other than \u0027scan body for base location\u0027, and those only started showing up after your most recent update. I\u0027ve also tried with a fresh save, absolutely no luck. I\u0027ve tried disabling all my other contract packs (including vanilla) and that just leaves my mission control window empty.\n\u003E \n\nThere is nothing in this mod that can cause that. I have heard stories of this happening if you upgrade from a 1.0.4 save, or are running outdated versions of Asteroid Day so check those.\n\nPinging [@nightingale](https://forum.kerbalspaceprogram.com/index.php?/profile/119307-nightingale/) and [@Arsonide](https://forum.kerbalspaceprogram.com/index.php?/profile/32604-arsonide/) who may be able to help further - but I suspect they will ask for logs.\n\nEdit; It\u0027s entirely possible I misread your post. Are you not getting any contracts at all? Or just Bases and Stations ones?\n\n**Edited \u003Ctime datetime=\u00222015-12-23T05:51:39Z\u0022 title=\u002212/23/2015 05:51  AM\u0022 data-short=\u00228 yr\u0022\u003EDecember 23, 2015\u003C/time\u003E by severedsolo**"},{"CreatedByName":"nightingale","CreatedById":119307,"CreatedDateTime":"2015-12-23T07:04:58Z","Content":"And when you say disable all contract packs including *vanilla*, does that mean stock contracts?  I haven\u0027t heard of any issues like this recently, I\u0027d have to see a log if you think there\u0027s a problem."},{"CreatedByName":"LemonSkin","CreatedById":142318,"CreatedDateTime":"2015-12-23T21:36:44Z","Content":"\u003E \n\u003E \n\u003E 15 hours ago, severedsolo said:\n\u003E \n\u003E \n\u003E There is nothing in this mod that can cause that. I have heard stories of this happening if you upgrade from a 1.0.4 save, or are running outdated versions of Asteroid Day so check those.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Pinging [@nightingale](https://forum.kerbalspaceprogram.com/index.php?/profile/119307-nightingale/) and [@Arsonide](https://forum.kerbalspaceprogram.com/index.php?/profile/32604-arsonide/) who may be able to help further - but I suspect they will ask for logs.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Edit; It\u0027s entirely possible I misread your post. Are you not getting any contracts at all? Or just Bases and Stations ones?\n\u003E \n\nI\u0027m only not receiving Bases and Stations contracts.\n\nI\u0027ve tested it on a brand new save, running no other mods other than Module Manager, mini-AVC and a couple of contract packs (excluding Useful Space Stations). I\u0027ve never used Asteroid Day either. Are there conditions for the mod to begin offering contracts? In my most recent test, I used the cheat menu to complete the initial \u0027milestone\u0027 contracts on a fresh save and gave myself science points, funds and reputation. That said, using the cheat menu to force complete the milestone contracts was buggy to say the least (the game just kept on spitting the same back the same 3 or 4 starting contracts).\n\n[@nightingale](https://forum.kerbalspaceprogram.com/index.php?/profile/119307-nightingale/) Yes, that means disabling stock contracts in via Contract Configurator. I am unsure where logs for game sessions that haven\u0027t crashed are stored. Or would I just be copy-pasting the contents of the debug tab in the cheat menu?\n\nThanks for getting back to me all!"},{"CreatedByName":"nightingale","CreatedById":119307,"CreatedDateTime":"2015-12-23T22:41:06Z","Content":"\u003E \n\u003E \n\u003E 1 hour ago, LemonSkin said:\n\u003E \n\u003E \n\u003E [@nightingale](https://forum.kerbalspaceprogram.com/index.php?/profile/119307-nightingale/) Yes, that means disabling stock contracts in via Contract Configurator. I am unsure where logs for game sessions that haven\u0027t crashed are stored. Or would I just be copy-pasting the contents of the debug tab in the cheat menu?\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Thanks for getting back to me all!\n\u003E \n\nEasiest would be KSP.log in the Kerbal Space Program directory (C:\\Program Files (x86)\\Kerbal Space Program or something slightly different for steam or non-windows)"},{"CreatedByName":"severedsolo","CreatedById":80345,"CreatedDateTime":"2015-12-24T11:13:41Z","Content":"[@LemonSkin](https://forum.kerbalspaceprogram.com/index.php?/profile/142318-lemonskin/) - Bases and Stations will not offer you contracts until you are capable of performing them.\n\nSo to get the Core Station mission you must have the following unlocked:\n\n- Solar Panels\n- Science Lab (either stock or Station Science)\n- Docking ports\n\nMaintenance missions will generate once you have a station (and it\u0027s marked as \u0022station\u0022 on the map).\n\nFor Base MIssions, you won\u0027t see any of those until you\u0027ve done an orbital survey (except for the \u0022scan for a new base\u0022) mission you mentioned.\n\n**Edited \u003Ctime datetime=\u00222015-12-24T11:14:14Z\u0022 title=\u002212/24/2015 11:14  AM\u0022 data-short=\u00228 yr\u0022\u003EDecember 24, 2015\u003C/time\u003E by severedsolo**"},{"CreatedByName":"onlinegamesz","CreatedById":70808,"CreatedDateTime":"2015-12-24T16:49:35Z","Content":"If I rename my kerbin station will there be any issues or i\u0027m just fine with all the contracts etc?"}]}