{"TopicId":102324,"ForumId":44,"TopicTitle":"Electric or hydrogen cars?","CreatedByName":"FishInferno","CreatedById":106219,"CreatedDateTime":"2015-03-20T15:46:07Z","PageNum":4,"Articles":[{"CreatedByName":"SargeRho","CreatedById":25468,"CreatedDateTime":"2015-03-22T07:25:25Z","Content":"It\u0027s not clean for the environment at all, as I think something like 98% of the Hydrogen production is so called Black Hydrogen, produced from natural gas. It\u0027s also an ozone depletant."},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-03-22T07:35:53Z","Content":"\u003E \n\u003E Precisely because it can catch fire it works as a fuel. It is also a type of rocket fuel.\n\u003E It is just much cleaner for the environment, as its exhaust is just water.\n\nWhereas hydrocarbon based fuels would have water and CO2 as exhaust... But then you have to take into account the process of getting the hydrogen..."},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-03-22T08:03:32Z","Content":"Welp...the hydrogen production process is still not carbon neutral...yet. So, while the fuel itself might be clean, the process of getting it is kind of bad.\n\nThere are theoretical ways of carbon-neutral hydrogen production however, by using electricity through from a nuclear reactor to extract CO2 from seawater (to make synthetic fuel), and H2 is a byproduct of that process: [\\[link\\]](http://www.dtic.mil/cgi-bin/GetTRDoc?Location=U2\u0026doc=GetTRDoc.pdf\u0026AD=ADA544002) [\\[link\\]](http://www.dtic.mil/cgi-bin/GetTRDoc?Location=U2\u0026doc=GetTRDoc.pdf\u0026AD=ADA544072) (both links are 2 pdf files of a study by Naval Research Laboratory in feasibility and lab tests)\n\nSounds pretty nice. Although it haven\u0027t been tested in scales larger than laboratory, so it might not be practical in industrial scale."},{"CreatedByName":"Frida Space","CreatedById":60943,"CreatedDateTime":"2015-03-22T08:50:33Z","Content":"Electric FTW"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2015-03-22T09:34:42Z","Content":"I should have asked this earlier, but are we talking about hydrogen in fuel cells, or for internal combustion? Because the former is an electric car too. Hydrogen generally is just another battery type.\n\n**Edited \u003Ctime datetime=\u00222015-03-22T09:37:03Z\u0022 title=\u002203/22/2015 09:37  AM\u0022 data-short=\u00229 yr\u0022\u003EMarch 22, 2015\u003C/time\u003E by Camacha**"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2015-03-22T13:46:14Z","Content":"\u003E \n\u003E Precisely because it can catch fire it works as a fuel. It is also a type of rocket fuel.\n\u003E It is just much cleaner for the environment, as its exhaust is just water.\n\nNo, it\u0027s not cleaner. It\u0027s a horrific ozone depletant that readily leaks out of every container we\u0027ve been able to make. Also, most of hydrogen is so called black hydrogen, meaning it\u0027s made from fossil fuels which are obviously rich in hydrogen.\n\nOne more thing - all hydrogen except black hydrogen is only an energy storage. Not a source.\n\nEnergetics is a very complex, interdisciplinary study. If you\u0027re gonna boil it down to \u0022it gives water when it burns\u0022 then you\u0027re not doing it correctly..."},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-03-22T14:45:26Z","Content":"\u003E \n\u003E No, it\u0027s not cleaner. It\u0027s a horrific ozone depletant that readily leaks out of every container we\u0027ve been able to make. Also, most of hydrogen is so called black hydrogen, meaning it\u0027s made from fossil fuels which are obviously rich in hydrogen.\n\u003E One more thing - all hydrogen except black hydrogen is only an energy storage. Not a source.\n\u003E \n\u003E Energetics is a very complex, interdisciplinary study. If you\u0027re gonna boil it down to \u0022it gives water when it burns\u0022 then you\u0027re not doing it correctly...\n\n[These guys](http://www.afdc.energy.gov/vehicles/emissions_hydrogen.html) lies to me then about hydrogen fuel exhaust being only water, warm air and some hydrogen. ![:(](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif) Or they are not giving the full story.\n\nAnd I know that currently the process of extracting hydrogen is from fossil fuel, but I was looking at the end exhaust of the fuel itself at the moment and the effect that has, since there are more ways of making it without using fossil fuel, like electrolysis of seawater using wind/solar/nuclear power.\n\nI admit it is just theoretical at this point and should be considered seriously yet, but it is something to think about.\n\nQuoting my previous post: \n\n\u003E \n\u003E There are theoretical ways of carbon-neutral hydrogen production however, by using electricity through from a nuclear reactor to extract CO2 from seawater (to make synthetic fuel), and H2 is a byproduct of that process: [\\[link\\]](http://www.dtic.mil/cgi-bin/GetTRDoc?Location=U2\u0026doc=GetTRDoc.pdf\u0026AD=ADA544002) [\\[link\\]](http://www.dtic.mil/cgi-bin/GetTRDoc?Location=U2\u0026doc=GetTRDoc.pdf\u0026AD=ADA544072) (both links are 2 pdf files of a study by Naval Research Laboratory in feasibility and lab tests)\n\u003E \n\u003E Sounds pretty nice. Although it haven\u0027t been tested in scales larger than laboratory, so it might not be practical in industrial scale."},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2015-03-22T15:18:29Z","Content":"\u003E \n\u003E No, it\u0027s not cleaner. It\u0027s a horrific ozone depletant that readily leaks out of every container we\u0027ve been able to make. Also, most of hydrogen is so called black hydrogen, meaning it\u0027s made from fossil fuels which are obviously rich in hydrogen.\n\u003E One more thing - all hydrogen except black hydrogen is only an energy storage. Not a source.\n\u003E \n\u003E Energetics is a very complex, interdisciplinary study. If you\u0027re gonna boil it down to \u0022it gives water when it burns\u0022 then you\u0027re not doing it correctly...\n\nWhy you dont read the full story before present a good guy as a bad guy...\n\n[http://www.nature.com/news/1998/030609/full/news030609-14.html](http://www.nature.com/news/1998/030609/full/news030609-14.html)\n\nThis is taken into account that we change fossil fuel economy by a complete hydrogen economy right now with the current ozone problems (gases from the 60th which still are in the atmosphere but its effect is ending) and without solving the leak problem, (which the technology already did)\n\nSo there is too many \u0022IF\u0022 there...\n\nIt said that if this happen slowly (50 years) even with leaks and a full hydrogen economy, it will not present any problem."},{"CreatedByName":"Pixel of Life","CreatedById":45646,"CreatedDateTime":"2015-03-22T15:32:35Z","Content":"Electric. It\u0027s simpler (just a battery and electric motors, instead of hydrogen tank, fuel cell, motors and lots of electronic witchcraft to manage it all), and we\u0027ve seen what Tesla did with the Model S. 265 mile (425km) range on one charge? That\u0027s brilliant! Our Audi TT has a range of around 500-600km on a full tank.\n\nI think it\u0027s realistic to expect cars to reach ranges of well over 500 miles on electric power alone within the next 10 or 20 years. That\u0027s more than enough for the average driver who only drives to work and back every day, does shopping and sometimes visits relatives who live a couple hundred miles away. Need more range? Combine it with a small and fuel-efficient internal combustion engine that drives a generator.\n\nI probably have no idea what I\u0027m talking about."},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2015-03-22T15:45:44Z","Content":"\u003E \n\u003E [These guys](http://www.afdc.energy.gov/vehicles/emissions_hydrogen.html) lies to me then about hydrogen fuel exhaust being only water, warm air and some hydrogen. ![:(](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif) Or they are not giving the full story.\n\u003E And I know that currently the process of extracting hydrogen is from fossil fuel, but I was looking at the end exhaust of the fuel itself at the moment and the effect that has, since there are more ways of making it without using fossil fuel, like electrolysis of seawater using wind/solar/nuclear power.\n\u003E \n\u003E I admit it is just theoretical at this point and should be considered seriously yet, but it is something to think about.\n\u003E \n\u003E Quoting my previous post:\n\nNot giving the full story. That is the problem. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nWater electrolysis is such an energy-intensive process that any connection with wind and especially solar is absolutely hilarious. Even massive coal thermal power plants struggle with it. The media has brainwashed people into thinking that the problem with energy is not scientific or technological, but purely economic, which is a conspiracy theory and that phenomenon has longterm detrimental consequences.\n\nIf we ignore the unavoidable horrific ozone depletion, hydrogen as an energy storage would have a very weak environmental impact if it was made by water electrolysis in countries like France where more than 80% of total power generation is by fission of uranium. With widespread ignorance and stupidity like in Germany, where fission power plants have been shut down and coal burning has skyrocketed, hydrogen economy would be a global disaster."},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2015-03-22T16:50:42Z","Content":"\u003E \n\u003E hydrogen as an energy storage would have a very weak environmental impact if it was made by water electrolysis in countries like France where more than 80% of total power generation is by fission of uranium.\n\nThe question then is why wouldn\u0027t we just put that electricity directly into batteries rather than use it to electrolyze water to liberate hydrogen? It is far easier to distribute electrical power over thousands of kilometers of existing infrastructure than to develop new and even more complex infrastructure for distributing hydrogen. Heck, the mall down the hill from my house has chargers for electric cars in some of the parking spots. You just swipe your credit card then plug in your car to charge while you shop. Even if you have to build additional electrical grid capacity to support all the cars being charged, it will be easier than develping hydrogen distribution system from scratch."},{"CreatedByName":"m4v","CreatedById":67965,"CreatedDateTime":"2015-03-22T16:53:24Z","Content":"\u003E \n\u003E Water electrolysis is such an energy-intensive process that any connection with wind and especially solar is absolutely hilarious. Even massive coal thermal power plants struggle with it. The media has brainwashed people into thinking that the problem with energy is not scientific or technological, but purely economic, which is a conspiracy theory and that phenomenon has longterm detrimental consequences.\n\n?\n\nI can see that for wind, but for solar is fairly easy to ask NASA about how much sunlight some place has and how many continuous days without sunlight due to cloud cover could be. With that information you can figure out how many panels and energy accumulators are needed to install for a given power output, but chances are that installing a thermal power plant is cheaper and simpler. Really is an economic problem.\n\nedit: I take it back for wind, wind is always strongest at coasts and in the sea, so if you want to electrolyse sea water, using wind power is probably not that crazy.\n\n**Edited \u003Ctime datetime=\u00222015-03-22T17:18:53Z\u0022 title=\u002203/22/2015 05:18  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 22, 2015\u003C/time\u003E by m4v**"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-03-22T17:15:33Z","Content":"All of this sounds like you better just go with electric. Hydrogen seems like it is just good for rocket fuel now."},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2015-03-22T18:07:13Z","Content":"\u003E Water electrolysis is such an energy-intensive process that any connection with wind and especially solar is absolutely hilarious.\n\nSo energy intensive?? it has 95% of efficiency, and fossil fuels into hydrogen 80% efficiency, but then you recover part of the energy lost using fuel cells, that are more efficient that any thermal machine.\n\nSo you lost only 10% from your electric source with compression and 20% from fossil fuels.\n\nBut you get 100% clean energy and a good way to storage it to all those machines or vehicles that will need hydrogen, as bus, truck, ships, airplanes, etc.\n\nWhat is that energy intensive that you are talking about??\n\n\u003E \n\u003E If we ignore the unavoidable horrific ozone depletion\n\nwithout cure... even after post as source the nature magazine which show how wrong is that statement, you keep trying to spread it? Is a shame.\n\n\u003E \n\u003E hydrogen as an energy storage would have a very weak environmental impact if it was made by water electrolysis in countries like France where more than 80% of total power generation is by fission of uranium.\n\nIt said in the same publication that even with all \u0022IF\u0022 and the worst possible case (that is impossible) for hydrogen, all benefics that you get overcome any possible drawback. What is the worst worst drawback? \n\n\u003E \n\u003E with widespread ignorance and stupidity like in Germany, where fission power plants have been shut down and coal burning has skyrocketed, hydrogen economy would be a global disaster.\n\nhaha, someone is trying to widespread ignorance.. but is not germany.\n\nThey save like 2 times european union from collapse already.. And they are still a super economic power, someone there must know what are they doing...\n\n\u003E \n\u003E The question then is why wouldn\u0027t we just put that electricity directly into batteries rather than use it to electrolyze water to liberate hydrogen? It is far easier to distribute electrical power over thousands of kilometers of existing infrastructure than to develop new and even more complex infrastructure for distributing hydrogen.\n\ndepending in what you want to use that energy.. As I already explain 3 times.\n\nFor some machines or vehicles is a lot more efficient to use hydrogen.\n\n\u003E \n\u003E Even if you have to build additional electrical grid capacity to support all the cars being charged, it will be easier than develping hydrogen distribution system from scratch.\n\nThe infrastructure needed is a problem, that is why is impossible to change fossil fuels to hydrogen from one day to the next. It takes time..\n\nBut the time it will be given by the amount of hydrogen machines or vehicles that start to come out in the market, the amount of new renewable energy sources that use hydrogen as a way to storage and distribution.\n\nHouses will start to produce hydrogen also as a way to storage energy. From little steps, you start to change the oil age into an hydrogen age. But of course it will not be 100% hydrogen, we will use direct power to all those applications which had more sense.\n\n\u003E \n\u003E All of this sounds like you better just go with electric. Hydrogen seems like it is just good for rocket fuel now.\n\nhydrogen is very good for a lot of things, for small cars.. yeah, full electric is better.\n\n**Edited \u003Ctime datetime=\u00222015-03-22T18:14:17Z\u0022 title=\u002203/22/2015 06:14  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 22, 2015\u003C/time\u003E by AngelLestat**"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2015-03-22T19:33:17Z","Content":"\u003E \n\u003E The question then is why wouldn\u0027t we just put that electricity directly into batteries rather than use it to electrolyze water to liberate hydrogen? It is far easier to distribute electrical power over thousands of kilometers of existing infrastructure than to develop new and even more complex infrastructure for distributing hydrogen. Heck, the mall down the hill from my house has chargers for electric cars in some of the parking spots. You just swipe your credit card then plug in your car to charge while you shop. Even if you have to build additional electrical grid capacity to support all the cars being charged, it will be easier than develping hydrogen distribution system from scratch.\n\nIndeed, it\u0027s better to just tap the electrical energy into the chemical energy of the battery. Extending the transformation cycle just lower the total efficiency.\n\nYou\u0027re right about the network. We already have a great electrical network. Why reinventing the wheel?\n\n\u003E \n\u003E ?\n\u003E I can see that for wind, but for solar is fairly easy to ask NASA about how much sunlight some place has and how many continuous days without sunlight due to cloud cover could be. With that information you can figure out how many panels and energy accumulators are needed to install for a given power output, but chances are that installing a thermal power plant is cheaper and simpler. Really is an economic problem.\n\u003E \n\u003E edit: I take it back for wind, wind is always strongest at coasts and in the sea, so if you want to electrolyse sea water, using wind power is probably not that crazy.\n\nWhere do solar panels come from? When you discuss these things you have to take into account the whole cycle. From production to disposal. For solar panels that\u0027s very bad news. They\u0027ve just started to be able to pay themselves off in optimal cases. In common cases like when you live somewhere in the temperate zone and you buy some mid-priced panels, you can be pretty sure that even if they pay themselves off, it will be like a decade in the future.\n\nYou know where all that money comes from, which makes them not abnormally expensive, but just very expensive? Government subsidies and awfully low production conditions in China where they\u0027re made. They\u0027re extremely bad for the environment, but the pollution was outsourced to poor Chinese towns where now the watertables are contaminated with cadmium and acid rains corrode everything. All that to make us feel \u0022green\u0022 and \u0022eco\u0022 and \u0022natural\u0022.\n\nIf they were made here, respecting the environment and without government stepping in, you\u0027d never have the money to buy them. They\u0027re that bad.\n\nAnyone mentioning them side by side with a basic power source like coal is just proving they don\u0027t know nothing about energy management. It\u0027s totally wrong in so many ways.\n\nThey are good for buoys, lighthouses, emergency charging of small stuff, space probes/stations and funny novelty calculators.\n\nSolar thermal energy, on the other hand, can be a good relief to the network in places where insolation is plentiful.\n\nWind is also applicable in special regions you mentioned. But all that can\u0027t replace stable, dense sources.\n\nSunlight might seem plentiful, but the energy it carries is neither energy dense nor we have the means of effective capture. Combine that with ludicrous energy demands to split a mole of water. 286 kJ\\*mol^-1^, **minimal theoretical investment!**\n\nWe\u0027re talking about enormous quantities of energy here. If you\u0027ve ever tried to perform water electrolysis at home you know how much effort is needed to fill a test tube with hydrogen. And when you light it, poof, it\u0027s gone. All the effort to make few millilitres of gas at 1 bar. Extrapolate that to industrial levels."},{"CreatedByName":"Albert VDS","CreatedById":74055,"CreatedDateTime":"2015-03-22T19:35:32Z","Content":"@AngelLestat (or any other pro hydrogen person): Leaking hydrogon? Small spark? Kaboom? What are you going to do about that?\n\nEven worse; a chain collision of hydrogen cars."},{"CreatedByName":"Technical Ben","CreatedById":10512,"CreatedDateTime":"2015-03-22T20:13:03Z","Content":"\u003E \n\u003E It\u0027s more comfortable to drive to a gas station than to sit for a working day next to your vehicle.\n\u003E The problem with that is that most of the cost of fuel comes from taxes, though how much depends on the country. In some it is as much as 85-90%. As soon as electric driving takes off, the cost to the respective governments will become too big, and electric driving will be taxed one way or another.\n\u003E \n\u003E Right now, the cost difference is hardly relevant, due to the earlier mentioned charging problems. If you drive a lot, charging is not viable, so it is hard to recoup your investment. We come to the same conclusion again, being that electric cars need to become better. When price goes down and range goes up, yes, it will be interesting ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nAs said, all the figures I know include taxes being added to electric, it still ends up a lot cheaper (per mile/use)."},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2015-03-22T20:28:08Z","Content":"All electric vehicles do is move the tailpipe from your vehicle, to a smokestack someplace. In a world of magical pixie dust, they get all their power from wind (LOL) or solar. In a realistic world where all cars are electric, they get it from nuclear (since this actually makes lots of power, and can be scaled without destroying vast tracks of land with unsightly windmills that make nearly no power, or solar. The latter at least can be done as distributed infill (roofs, parking lot covers, etc).\n\nStill, if cars switched in some short timeframe, it would be fossil fuels, nukes, or someone better find a magic wand since without massive increases in power generation, you need to charge off-peak (night) in summer (more slop in winter). That means predictable and on-demand power generation. Right now storage for wind/solar means dams (pumping water up and storing it as PE) which have their own environmental issues (and more efficiency loss)."},{"CreatedByName":"SargeRho","CreatedById":25468,"CreatedDateTime":"2015-03-22T20:55:14Z","Content":"You\u0027re forgetting one important detail. Powerplants are much more efficient than car engines. So even if we still used the same powersources in equal ratios, but switched completely to EVs, we\u0027d still emit less greenhouse gasses and aerosols."},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2015-03-22T21:34:49Z","Content":"\u003E \n\u003E You\u0027re forgetting one important detail. Powerplants are much more efficient than car engines. So even if we still used the same powersources in equal ratios, but switched completely to EVs, we\u0027d still emit less greenhouse gasses and aerosols.\n\nThey also suffer transmissive losses. Doesn\u0027t matter, though, because the primary customer base for electric cars fails to understand your observation, and is generally speaking against ANY kind of power plant, particularly if it is anywhere endear where they happen to live. They want unsightly power generation in someone else\u0027s neighborhood. People in LA love electric cars, but don\u0027t care at all if the electricity comes from a coal plant in NM, for example. I\u0027d like to see people more rational about power production in general so we could optimize it (making things like electric cars more practical as a widespread thing (assuming they can fix the range issue)."},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2015-03-22T22:12:39Z","Content":"\u003E \n\u003E Doesn\u0027t matter, though, because the primary customer base for electric cars fails to understand your observation, and is generally speaking against ANY kind of power plant, particularly if it is anywhere endear where they happen to live.\n\nDo you have any statistics to support that sweeping generalization? Maybe people buy Teslas because, by all accounts, they are a good car rather than because they are clueless hippies who want to drive along singing kumbaya, thinking that they are saving the world? According to Wikipedia, the Tesla Model S won awards such as the 2013 Motor Trend Car of the Year, Automobile Magazine\u0027s 2013 Car of the Year, Time Magazine Best 25 Inventions of the Year 2012 award and Consumer Reports\u0027 top-scoring car ever. \n\nElectric cars tend to be significantly more expensive than fossil fuel powered cars. That means, in order to own one, you need to have more money than the average motorist. At the risk of being accused of making my own sweeping generalizations, successful people tend to be better educated than average. It is difficult for me to believe that the typical electric car buyer is that oblivious to the obvious issue of where the electricity comes from that powers their cars."},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2015-03-22T22:36:57Z","Content":"\u003E \n\u003E At the risk of being accused of making my own sweeping generalizations, successful people tend to be better educated than average.\n\nThe amount of money a person has is in no way an indicator of that person\u0027s intelligence. In fact, I have found that money often makes people more stupid."},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2015-03-22T22:42:07Z","Content":"\u003E \n\u003E The amount of money a person has is in no way an indicator of that person\u0027s intelligence. In fact, I have found that money often makes people more stupid.\n\nPlease re-read my post. I did not use the word \u0022intelligence\u0022. I wrote that successful people tend to be better **educated**, on average."},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2015-03-22T23:14:35Z","Content":"This discussion is wandering from the point, which is the merits of electric vs hydrogen power for vehicles."},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2015-03-23T01:54:51Z","Content":"\u003E \n\u003E All electric vehicles do is move the tailpipe from your vehicle, to a smokestack someplace. In a world of magical pixie dust, they get all their power from wind (LOL) or solar. In a realistic world where all cars are electric, they get it from nuclear (since this actually makes lots of power, and can be scaled without destroying vast tracks of land with unsightly windmills that make nearly no power, or solar. The latter at least can be done as distributed infill (roofs, parking lot covers, etc).\n\u003E Still, if cars switched in some short timeframe, it would be fossil fuels, nukes, or someone better find a magic wand since without massive increases in power generation, you need to charge off-peak (night) in summer (more slop in winter). That means predictable and on-demand power generation. Right now storage for wind/solar means dams (pumping water up and storing it as PE) which have their own environmental issues (and more efficiency loss).\n\nThis is true, electrical cars however has some benefits, one is very low local pollution, this is an major issue in most large cities. \n\nElectrical cars has one other benefit its that it can use any electricity source. Hydro and nuclear works and don\u0027t have emissions in normal sense and is hard to use in cars, even an clean source like natural gas might be better to burn in an plant for electricity even you could use the heavier gases like propane directly. \n\nNow plug in hybrids has both benefits, they can burn fuel who gives range, they run on electricity on shorter trips, with the electrical cars benefits and they can run the engine optimally, the engine does not have to build like an car engine, as it only charges the batteries, it will also be far weaker than the electrical engines, you rarely use all the power of the car engine.\n\nGranted an hybrid is an more complex design and would be more expensive in the start, however cars are already far to complex for that they do and not too expensive so prices will go down.\n\nReason why cars are over complex is that most people like fancy cars, the ones who is after cheap cars buy used cars so its little marked for very simple and cheap cars in the west,"}]}