{"TopicId":102324,"ForumId":44,"TopicTitle":"Electric or hydrogen cars?","CreatedByName":"FishInferno","CreatedById":106219,"CreatedDateTime":"2015-03-20T15:46:07Z","PageNum":6,"Articles":[{"CreatedByName":"Albert VDS","CreatedById":74055,"CreatedDateTime":"2015-03-25T20:13:25Z","Content":"\n\u003Cp\u003E@AngelLestat: That\u0027s a nice graph you posted, but it doesn\u0027t mention what I mentioned a post earlier; that it takes and costs more energy to make hydrogen than it gives useful energy.\u003C/p\u003E\n"},{"CreatedByName":"GreenWolf","CreatedById":65798,"CreatedDateTime":"2015-03-25T20:14:06Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/List_of_airship_accidents\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/List_of_airship_accidents\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ECount the number of times \u0022fire\u0022 or \u0022explosion\u0022 are mentioned on that page. That\u0027s not even including the dozens that were shot down during WW1, or intentionally burned by their crews after the war ended. Although I will concede that upon closer inspection of that list, it appears that bad weather may be the leading cause of airships losses.\u003C/p\u003E\u003Cp\u003EHowever, this topic isn\u0027t about airships. It\u0027s about electric cars vs hydrogen cars. And when you get down to it, high capacity rechargeable batteries are probably just as dangerous as a tank full of pressurized hydrogen. The failure methods are just different.\u003C/p\u003E\u003Cp\u003EHowever, batteries have the advantage of being a relatively mature technology (more than hydrogen), and the dangers and failure methods are well understood and prepared for. Additionally, electricity has the advantage of being able to use existing infrastructure.\u003C/p\u003E\u003Cp\u003EAnd unlike petroleum, hydrogen is not a fuel. It is an energy storage mechanism, just like a battery. Hydrogen has to be split from water, or produced via some other reaction. Most of these reactions take staggering amounts of power, or use reactants that are expensive, dangerous, or bad for the environment. This is in addition to hydrogen being an ozone-depleting substance. It would be easier and better to just use the electricity directly. Also, electric cars can take advantage of regenerative braking, which can provide some incredible returns.\u003C/p\u003E\u003Cp\u003EThere\u0027s also the fact that there are all electric cars on the road right now, but not a single hydrogen car.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2015-03-25T22:48:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GreenWolf\u0022 data-cite=\u0022GreenWolf\u0022\u003E\u003Cdiv\u003EHowever, this topic isn\u0027t about airships. It\u0027s about electric cars vs hydrogen cars. And when you get down to it, high capacity rechargeable batteries are probably just as dangerous as a tank full of pressurized hydrogen. The failure methods are just different.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExactly. That kind of energy density means that energy might be released.\u003C/p\u003E\n"},{"CreatedByName":"Drunken Hobo","CreatedById":52000,"CreatedDateTime":"2015-03-25T23:27:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AngelLestat\u0022 data-cite=\u0022AngelLestat\u0022\u003E\u003Cdiv\u003EA real comparison is battery vs \u0022hydrogen\u002Btank\u002Bfuel cell\u0022.\u003Cp\u003ELets compare energy density:\u003C/p\u003E\u003Cp\u003EHydrogen: 142mj/kg and 5.6 mj/liter\u003C/p\u003E\u003Cp\u003EBest Ion lithio in the market: 0.67mj/kg and 1.8mj/liter\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.rebresearch.com/blog/wp-content/uploads/2013/03/energy_density_hydrogen_vs_batteries.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.rebresearch.com/blog/wp-content/uploads/2013/03/energy_density_hydrogen_vs_batteries.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ELook how little you rise the volume, and how much autonomy you get.. This is a clear case that any kind of vehicle beyond 1500kg and over 500km on autonomy hydrogen is a clear winner. Also hydrogen tanks are much cheaper than buy batteries.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThose numbers are incorrect and do not take into account the mass of the hydrogen tank \u0026amp; fuel cell. The link you provided doesn\u0027t work for me, so I can\u0027t check that source, but at least according to Wikipedia, those are the energy densities for an alkaline battery (not the \u0022best ion lithium on the market\u0022) and compressed hydrogen at ~700 bar, without any tank or fuel cell.\u003C/p\u003E\n"},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2015-03-26T03:32:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SargeRho\u0022 data-cite=\u0022SargeRho\u0022\u003E\u003Cdiv\u003EAmmonia is flammable, toxic and corrosive, and an environmental hazard. It\u0027s not something you want to carry around in large quantities as power source.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eflour is also explosive under certain mixtures.. so?? we need to stop use it?\u003C/p\u003E\u003Cp\u003EEverybody use ammonia to wash things, how many die from flames or toxic aspiration?? the vapor mixture to be flamable is from 24% to 32% much lower than any other fuel.\u003C/p\u003E\u003Cp\u003EIs used all days as fertilizer, is enviromental hazard?\u003C/p\u003E\u003Cp\u003ECorrosive? what level of corrosion seriusly.. is not acid, in fact you can use chepear tanks than the used in gasoline \u003C/p\u003E\u003Cp\u003EAny chemical has their own cares that we need to follow, but this is not enoght to be so negative about their applications.\u003C/p\u003E\u003Cp\u003EUse the same phylosofy against everything else and you will not use nothing.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tweety\u0022 data-cite=\u0022Tweety\u0022\u003E\u003Cdiv\u003E I voted hydrogen for various reasons though. I enjoy driving my car, I especially enjoy the engine noise. I like being able to hear how fast I\u0027m going and hear when to change gear which simply won\u0027t work with an electric car.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut with hydrogen\u002Bfuel cell instead combustion, you get the same noice than any other electric car \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Albert VDS\u0022 data-cite=\u0022Albert VDS\u0022\u003E\u003Cdiv\u003E@AngelLestat: That\u0027s a nice graph you posted, but it doesn\u0027t mention what I mentioned a post earlier; that it takes and costs more energy to make hydrogen than it gives useful energy.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI dint answer this like 3 times already?\u003C/p\u003E\u003Cp\u003E-A battery has 80% in the charge discharge round trip, so you lost a 20% of efficiency.\u003C/p\u003E\u003Cp\u003E-USA has an average of 6.6% on transmission and distribution losses.\u003C/p\u003E\u003Cp\u003E-Renewable energy sources (which are the ones that can solve the ecologic problems) will have a 17% of loses in storage (with the best methods)\u003C/p\u003E\u003Cp\u003E-If you use oils and natural gas to produce electricity, you are polluting the enviroment, but if you extract the hydrogen from Hydrocarbons instead, you capture the co2 with ease, then the hydrogen is used to produce electricity with a fuel cell (which has higher efficiencies than any thermal power plant, so if you lost any energy in the hydrogen conversion, you gain back that lost efficiency with the fuel cell.\u003C/p\u003E\u003Cp\u003E-Nuclear reactors when they dont need generate base load, they can be used to generate hydrogen.. So you dont lose energy.\u003C/p\u003E\u003Cp\u003ENow the hydrogen case.\u003C/p\u003E\u003Cp\u003E-Electrolysis you lost 5%\u003C/p\u003E\u003Cp\u003E-compression you lost 5%\u003C/p\u003E\u003Cp\u003E-distribution you lost 5%.\u003C/p\u003E\u003Cp\u003EIf a renewable source directly transform the energy to hydrogen saving the energy lost in back process, you are saving a 13% and a lot of money in storage devices and transmission.\u003C/p\u003E\u003Cp\u003ESo hydrogen will reach the fuel station at lower price (for the same energy) than the cost of charge your car from your house.\u003C/p\u003E\u003Cp\u003EYou lost like 15 % of efficiency in the fuel cell VS battery, but the final cost will be similar.\u003C/p\u003E\u003Cp\u003ESo any vehicle that needs higher autonomy, or beyond 1500kg, or which needs fast charges. It will use hydrogen.\u003C/p\u003E\u003Cp\u003EThe only that hydrogen needs is wait not more than 5 to 7 years to some technologies reach the market.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GreenWolf\u0022 data-cite=\u0022GreenWolf\u0022\u003E\u003Cdiv\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/List_of_airship_accidents\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/List_of_airship_accidents\u003C/a\u003E\u003Cp\u003ECount the number of times \u0022fire\u0022 or \u0022explosion\u0022 are mentioned on that page. That\u0027s not even including the dozens that were shot down during WW\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat is including war times! I encourage to search because I already did an extensive reasearch before, I am quite airship enthusiastic, so I read a lot about them. \u003C/p\u003E\u003Cp\u003EFire... when it crash due bad weather and we can not be sure if oil was the cause.\u003C/p\u003E\u003Cp\u003EAlso not deads due fire aside the hinderberg which I remember.\u003C/p\u003E\u003Cp\u003ENow check this list:\u003C/p\u003E\u003Cp\u003EAccidents involving commercial aircrafts (not in war times as the list you post it)\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/List_of_accidents_and_incidents_involving_commercial_aircraft\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/List_of_accidents_and_incidents_involving_commercial_aircraft\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIs almost 200 times larger, this counting all the technologic advances that we have.\u003C/p\u003E\u003Cp\u003EOf course there are a lot more airplanes, but is a number to have in mind.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EHowever, batteries have the advantage of being a relatively mature technology (more than hydrogen), and the dangers and failure methods are well understood and prepared for. Additionally, electricity has the advantage of being able to use existing infrastructure.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, true. So if you ask me for today.. I will said batteries for vehicles of 2500 kg or lower.. \u003C/p\u003E\u003Cp\u003EIf you ask me in 7 years, I will said hydrogen for vehicles of \u002B1500kg, this also counting all new technologies that are comming for batteries.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EAnd unlike petroleum, hydrogen is not a fuel. It is an energy storage mechanism, just like a battery\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe same as petroleum, which it comes from all the energy than animals or plants storage millons of years before. Hydrogen is a fuel that in this case we use it as energy carrier.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EHydrogen has to be split from water, or produced via some other reaction. Most of these reactions take staggering amounts of power, or use reactants that are expensive, dangerous, or bad for the environment.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EStaggering??? 5% on loses? The platinum catalyst is expensive (for now, new remplacement are comming) but not dangerous.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThis is in addition to hydrogen being an ozone-depleting substance.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIs not..\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/113563-Electric-or-hydrogen-cars?p=1799538\u0026amp;viewfull=1#post1799538\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/113563-Electric-or-hydrogen-cars?p=1799538\u0026amp;viewfull=1#post1799538\u003C/a\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EAlso, electric cars can take advantage of regenerative braking, which can provide some incredible returns.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd hydrogen cards dont?? I wonder.. the last time I check they use an electric engine and a small battery too.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThere\u0027s also the fact that there are all electric cars on the road right now, but not a single hydrogen car.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Etoyota, audi, honda, Hyundai and many more brands are working on them.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Drunken Hobo\u0022 data-cite=\u0022Drunken Hobo\u0022\u003E\u003Cdiv\u003EThose numbers are incorrect and do not take into account the mass of the hydrogen tank \u0026amp; fuel cell. The link you provided doesn\u0027t work for me, so I can\u0027t check that source, but at least according to Wikipedia, those are the energy densities for an alkaline battery (not the \u0022best ion lithium on the market\u0022) and compressed hydrogen at ~700 bar, without any tank or fuel cell.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.parc.com/content/attachments/fuelcells_arpa-e_parc.pdf\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.parc.com/content/attachments/fuelcells_arpa-e_parc.pdf\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://hypertextbook.com/facts/2005/MichelleFung.shtml\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://hypertextbook.com/facts/2005/MichelleFung.shtml\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EPrevious image source which include the weight of all the equipment:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.rebresearch.com/blog/hydrogen-versus-battery-power/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.rebresearch.com/blog/hydrogen-versus-battery-power/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ECo2 emmisions by source:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.nuvera.com/blog/wp-content/uploads/2008/07/emissions-graph.jpg\u0022 alt=\u0022emissions-graph.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.nuvera.com/blog/index.php/tag/the-economist/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.nuvera.com/blog/index.php/tag/the-economist/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Emass/range comparison:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s1.hubimg.com/u/3457786_f520.jpg\u0022 alt=\u00223457786_f520.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlso on the weight and compression issue, you can use ammonia instead, which it has 1.6 times more energy density than liquid hydrogen. Not need for pressure tank.. just a plastic tank with a 2 liter size device to split the ammonia into hydrogen.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-26T05:17:03Z\u0022 title=\u002203/26/2015 05:17  AM\u0022 data-short=\u00229 yr\u0022\u003EMarch 26, 2015\u003C/time\u003E by AngelLestat\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2015-03-26T03:46:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Camacha\u0022 data-cite=\u0022Camacha\u0022\u003E\u003Cdiv\u003EExactly. That kind of energy density means that energy might be released.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOn the good side Hollywood will love it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"RuBisCO","CreatedById":59540,"CreatedDateTime":"2015-03-26T23:00:07Z","Content":"\n\u003Cp\u003EAngelLestat,\u003C/p\u003E\u003Cp\u003EHave you considered hydrogen\u0027s extremely low volumetric energy density, the need for extremely high pressure tanks, with or without exotic absorbers, or worse liquid hydrogen. Energy required to compress hydrogen?\u003C/p\u003E\u003Cp\u003EAlso the energy efficiency of electrolysis is at best ~70% and usually in ~50%, fuel cell efficiency is roughly the same. Lithium Ion on the other hand has charge discharge efficiency in the 90%.\u003C/p\u003E\u003Cp\u003EBatteries are simply more advanced and require less infrastructure then hydrogen, which would require a whole new economy of production of hydrogen, distribution and fuel cell cars, while electrics require only new cars and charging stations and can operate on the existing grid. If charged off-peak electric would not require much enhancement to the electric grid and in fact electric cars spend most of their time parked and the user could sell back electricity and use the car as a grid storage device. \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EHydrogen is a pipe dream, a distraction. \u003C/strong\u003E\u003C/p\u003E\n"},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2015-03-27T02:42:40Z","Content":"\n\u003Cp\u003ERubisco.. I bet that you dint read any of my post or check any of the info that I show.\u003C/p\u003E\u003Cp\u003EThe efficiencies that you are talking about is for small industries or home made.\u003C/p\u003E\u003Cp\u003EOf course if you use cheap catalyst you find those efficiencies, who cares if you waste 1 kw more in produce hydrogen for your own, or 100kw..\u003C/p\u003E\u003Cp\u003EAt those scales the most important is that you can produce without depend on others.\u003C/p\u003E\u003Cp\u003EBut if you want to buy platinum catalyst or combinations with steam systems, then the investment increase a lot, but if your productions is big enoght, then you achieve low the final cost due higher efficiencies.\u003C/p\u003E\u003Cp\u003EThe values are close of what I mention, you need to take with the info that you read, sometimes the compression and transport is included, other times it takes into account the whole process efficiency from solar radiation by m2 or wind speed to hydrogen.\u003C/p\u003E\u003Cp\u003ESome theory:\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EElectrolysis can reach in theory using waste heat of other process an efficiency of 120%\u003C/strong\u003E, this means that if you enter 1 kw, you get 1,2 kw of hydrogen without compression.\u003C/p\u003E\u003Cp\u003EEven the ambient temperature is an external source of energy which helps to increase your efficiency on electrolysis.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYou get 39 kw per kg of hydrogen (or 39Mw by per tonne) \u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Electrolysis_of_water#Efficiency\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Electrolysis_of_water#Efficiency\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EThe best PEM systems or steam reach 95% of efficiency, then you need to add 5% on compression 250 bar and 5% in transportation.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ETake a look in this study about offshore wind farm with direct hydrogen production on sea water.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://download.springer.com/static/pdf/25/art%253A10.1007%252Fs40095-014-0104-6.pdf?auth66=1427420658_263eeeb4adcc54ae0fd6a23f65eb5a48\u0026amp;ext=.pdf\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://download.springer.com/static/pdf/25/art%253A10.1007%252Fs40095-014-0104-6.pdf?auth66=1427420658_263eeeb4adcc54ae0fd6a23f65eb5a48\u0026amp;ext=.pdf\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EFor 404gw you get 8020 tons including transport and Inverter AC to DC (which add a lost on 5%)\u003C/p\u003E\u003Cp\u003ESo there you have my 15% estimated with the extra 5% on the inverter.\u003C/p\u003E\u003Cp\u003EA different source on compression:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://ec.europa.eu/research/participants/portal/desktop/en/opportunities/h2020/topics/8067-fch-02.6-2014.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://ec.europa.eu/research/participants/portal/desktop/en/opportunities/h2020/topics/8067-fch-02.6-2014.html\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u0022The energy consumption of the system should be below 4 kWh / kg H2 when compressed from 20 to 500 bar.\u0022\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EAlso you dont need as I mention many times deal with hydrogen tanks.. You can use ammonia which it has 1.6 times more energy density than liquid hydrogen and can be cracked on demand with little efficiency lost, and you can use the same infrastructure of oil with minor changes.\u003C/p\u003E\u003Cp\u003ENew discoveries which already talk about on hydrogen managment and catalyst are very close to release which will reduce by a lot the investment cost. \u003C/p\u003E\u003Cp\u003EFinal question:\u003C/p\u003E\u003Cp\u003EIf you said that hydrogen is not needed, how you save Co2 from vehicles bigger than 1500kg?\u003C/p\u003E\u003Cp\u003ECan a 747 fly with batteries?? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EEven using hydrogen the volume is not important, because you have a huge amount of energy, and volume increase with the cube and it is much light.\u003C/p\u003E\n"},{"CreatedByName":"GreenWolf","CreatedById":65798,"CreatedDateTime":"2015-03-27T03:17:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AngelLestat\u0022 data-cite=\u0022AngelLestat\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003Cstrong\u003EElectrolysis can reach in theory using waste heat of other process an efficiency of 120%\u003C/strong\u003E,\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBull****. This is literally impossible. It is completely, totally, absolutely impossible to have an efficiency greater than 100% in any system. The laws of thermodynamics (and entropy in particular) don\u0027t allow it.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2015-03-27T03:37:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AngelLestat\u0022 data-cite=\u0022AngelLestat\u0022\u003E\u003Cdiv\u003ESome theory:\u003Cp\u003E\u003Cstrong\u003EElectrolysis can reach in theory using waste heat of other process an efficiency of 120%\u003C/strong\u003E, this means that if you enter 1 kw, you get 1,2 kw of hydrogen without compression.\u003C/p\u003E\u003Cp\u003EEven the ambient temperature is an external source of energy which helps to increase your efficiency on electrolysis.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou have this nasty habit of endorsing and promoting crappy stuff on KSP forum.\u003C/p\u003E\u003Cp\u003EWhat you wrote there is ridiculous beyond comprehension to anyone with the slightest working knowledge of basic laws of nature.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EEnergy conversion efficiency is always less than 1.\u003C/strong\u003E\u003C/p\u003E\n"},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2015-03-27T03:40:24Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022http://www.cres.gr/kape/publications/papers/dimosieyseis/ydrogen/A%20REVIEW%20ON%20WATER%20ELECTROLYSIS.pdf\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.cres.gr/kape/publications/papers/dimosieyseis/ydrogen/A%20REVIEW%20ON%20WATER%20ELECTROLYSIS.pdf\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u0022For water electrolysis, under ideal reversible conditions, the maximum theoretical efficiency with respect to the electrical energy source would be ÃŽÂµmax = 120%\u0022\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EBecause you are not providing the heat! Is measure only from your electrical input.\u003C/p\u003E\u003Cp\u003EI will waiting a \u0022sorry to doubt of you\u0022\u003C/p\u003E\n"},{"CreatedByName":"GreenWolf","CreatedById":65798,"CreatedDateTime":"2015-03-27T04:01:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AngelLestat\u0022 data-cite=\u0022AngelLestat\u0022\u003E\u003Cdiv\u003EI will waiting a \u0022sorry to doubt of you\u0022\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, that\u0027s not gonna happen. Know why? Because you\u0027re still wrong. It is impossible for a system to have an efficiency greater than 100%. This is basic thermodynamics. Anyone claiming otherwise is a liar or an idiot. Or both.\u003C/p\u003E\n"},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2015-03-27T04:43:25Z","Content":"\n\u003Cp\u003Eif you can not admit that you are wrong.. then is your issue. \u003C/p\u003E\u003Cp\u003EPride is an impediment to learning.\u003C/p\u003E\u003Cp\u003EI dint said nothing wrong.. Read word by word of everything I said.. \u003C/p\u003E\u003Cp\u003EWhat now? All scientist needs to change how they measure electrolysis efficiency?\u003C/p\u003E\u003Cp\u003EIf you are not providing the heat energy because is comming from the enviroment, you dont need to include that in your efficiency calculation, because you are only providing a X amount of electrical power which is the only that matters.\u003C/p\u003E\u003Cp\u003EChemical reactions takes energy from the enviroment in case you dont know that.\u003C/p\u003E\u003Cp\u003EIs not the same try electrolysis close to 0k than at 300K.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-27T04:51:27Z\u0022 title=\u002203/27/2015 04:51  AM\u0022 data-short=\u00229 yr\u0022\u003EMarch 27, 2015\u003C/time\u003E by AngelLestat\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"GreenWolf","CreatedById":65798,"CreatedDateTime":"2015-03-27T05:05:03Z","Content":"\n\u003Cp\u003EI\u0027m not the one trying to claim that the F****** laws of thermodynamics don\u0027t apply to electrolysis.\u003C/p\u003E\u003Cp\u003EThat\u0027s it, I\u0027m done. I quit. Someone else can deal with your rambling, incoherent nonsense.\u003C/p\u003E\n"},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2015-03-27T05:10:43Z","Content":"\n\u003Cp\u003EWho is claiming that??? LEARN TO READ.\u003C/p\u003E\u003Cp\u003ESeriusly, quote me where I said that? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"andrewas","CreatedById":24662,"CreatedDateTime":"2015-03-27T12:29:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GreenWolf\u0022 data-cite=\u0022GreenWolf\u0022\u003E\u003Cdiv\u003EYeah, that\u0027s not gonna happen. Know why? Because you\u0027re still wrong. It is impossible for a system to have an efficiency greater than 100%.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA resistive heater has an efficiency of 100%. A peltier element in place of a resistive heater produces more heat at the hot side, therefore it has an efficiency of over 100% if you don\u0027t happen to care about the temperature near the cold side of the element and are only looking at electrical power input.\u003C/p\u003E\u003Cp\u003EThe linked paper seems to suggest that you can do something similar with electrolysis, you can reduce the electrical power needed by supplying heat. If you have a supply of waste heat, then the heat is free and you only need to account for the electric power when calculating efficiency.\u003C/p\u003E\n"},{"CreatedByName":"Iskierka","CreatedById":2116,"CreatedDateTime":"2015-03-27T13:19:05Z","Content":"\n\u003Cp\u003EElectrolysis is able to exceed 100% efficiency in a similar way that air-conditioning can be used as a heater with greater than 100% efficiency. Both, rather than trying to do the whole job themselves, are taking additional energy from surrounding systems, and are using their input energy to manipulate that, rather than to provide energy directly. Thermodynamics only say that energy cannot be created - but that\u0027s never what we measure with efficiency of some useful device, we measure the energy we are required to provide directly compared with the energy resulting. If we have some nice trick where some ambient energy gets added alongside input energy, then that\u0027s a helpful thing we\u0027ll take and is entirely capable of putting measured efficiency above 100%.\u003C/p\u003E\u003Cp\u003EThinking of another thing - how efficient is wind propulsion? It requires some energy to manipulate and hold sails, but one human is enough to control and move a several-tonne boat at potentially speeds of over 10 m/s. That boat is receiving at least dozens of kW of propulsive energy, possibly hundreds in some cases, yet the only \u0022input\u0022 to the system, from the human perspective of what we need to put in, is less than 100 W or so. That\u0027s somewhere between a hundred thousand percent to possibly tens millions of percent efficient. Because we can steal ambient energy from the wind, but that\u0027s not our energy, so we don\u0027t need to consider it as part of the propulsive efficiency. And then if you simply tie the sails off, and stop actively sailing, you can genuinely make it infinitely efficient.\u003C/p\u003E\u003Cp\u003ESo if we\u0027ve had the capability to make infinitely efficient systems for thousands of years, perhaps we should stop asserting that a system of 120% is impossible? It\u0027s perfectly acceptable to question how, and I did initially think \u0022is that possible?\u0022 on reading it, but I continued reading, and saw what was meant, where excess heat from other systems can be used to allow reduced direct input. Any claim of efficiency \u0026gt;100% should be questioned, but don\u0027t automatically assert it\u0027s impossible when infinity is possible.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-27T13:25:44Z\u0022 title=\u002203/27/2015 01:25  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 27, 2015\u003C/time\u003E by Iskierka\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Jon144","CreatedById":80626,"CreatedDateTime":"2015-03-27T13:33:54Z","Content":"\n\u003Cp\u003EMy\u003C/p\u003E\u003Cp\u003EMajor problem with electric cars are their terribly inefficent batteries. Most charge we put into batteries is lost via thermal and other forms of energy. Still beats gas cars though. More energy is lost in those mechanical processes than ever could imagine for the batteries in an electric.\u003C/p\u003E\n"},{"CreatedByName":"Kohai_Khaos","CreatedById":139284,"CreatedDateTime":"2015-03-27T17:50:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AngelLestat\u0022 data-cite=\u0022AngelLestat\u0022\u003E\u003Cdiv\u003EI dint answer this like 3 times already?\u003Cp\u003E-A battery has 80% in the charge discharge round trip, so you lost a 20% of efficiency.\u003C/p\u003E\u003Cp\u003E-USA has an average of 6.6% on transmission and distribution losses.\u003C/p\u003E\u003Cp\u003E-Renewable energy sources (which are the ones that can solve the ecologic problems) will have a 17% of loses in storage (with the best methods)\u003C/p\u003E\u003Cp\u003E-If you use oils and natural gas to produce electricity, you are polluting the enviroment, but if you extract the hydrogen from Hydrocarbons instead, you capture the co2 with ease, then the hydrogen is used to produce electricity with a fuel cell (which has higher efficiencies than any thermal power plant, so if you lost any energy in the hydrogen conversion, you gain back that lost efficiency with the fuel cell.\u003C/p\u003E\u003Cp\u003E-Nuclear reactors when they dont need generate base load, they can be used to generate hydrogen.. So you dont lose energy.\u003C/p\u003E\u003Cp\u003ENow the hydrogen case.\u003C/p\u003E\u003Cp\u003E-Electrolysis you lost 5%\u003C/p\u003E\u003Cp\u003E-compression you lost 5%\u003C/p\u003E\u003Cp\u003E-distribution you lost 5%.\u003C/p\u003E\u003Cp\u003EIf a renewable source directly transform the energy to hydrogen saving the energy lost in back process, you are saving a 13% and a lot of money in storage devices and transmission.\u003C/p\u003E\u003Cp\u003ESo hydrogen will reach the fuel station at lower price (for the same energy) than the cost of charge your car from your house.\u003C/p\u003E\u003Cp\u003EYou lost like 15 % of efficiency in the fuel cell VS battery, but the final cost will be similar.\u003C/p\u003E\u003Cp\u003ESo any vehicle that needs higher autonomy, or beyond 1500kg, or which needs fast charges. It will use hydrogen.\u003C/p\u003E\u003Cp\u003EThe only that hydrogen needs is wait not more than 5 to 7 years to some technologies reach the market.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou forgot to account for the fact that at a dedicated electrolysis facility, which is what you\u0027d want for this perfectly \u0022ideal\u0022 hydrogen supply for your fuel, you\u0027d also be dealing with the same 6.6% transmission loss and, the same loss from the renewable plants, and the same pollution from fossil fuel plants, as you would from a battery-charging source.\u003C/p\u003E\u003Cp\u003EIf the renewable plants are storing their energy in hydrogen fuel cells and this is more efficient than gigantic batteries, then your stated efficiencies for their storage losses for electrical energy are clearly flawed. Their storage losses are going to be \u003Cem\u003Eidentical\u003C/em\u003E, because they are the same facility whether they send out the power as a hydrogen-oxygen mix or as electrical energy.\u003C/p\u003E\u003Cp\u003EThen we can realize something else: the price of getting the fuel mixture to the fuel station is \u003Cem\u003Enot\u003C/em\u003E simply the cost of electrolyzing the water. This is why accounting for the cost of electrolysis and temporary storage for the hydrogen car, while caring for the transmission losses for the electric one, is truly nonsensical.\u003C/p\u003E\u003Cp\u003EWhen you deliver the hydrogen to the station, it is either by direct pipeline or by a truck with a large, pressurized tank. This tank has a limited size, and as others have pointed out, hydrogen, while being very energy-dense when it comes to mass, has a rather low volumetric energy density (you need a much larger volume to contain an equal amount of energy, basically, and the main limitation on these tank sizes is volume at this point). Both of these introduce further losses to the system, because you are either constantly building these expensive, insulated pipelines that aren\u0027t even economical on this scale with high-density fuel that doesn\u0027t have issues with boiloff, or you\u0027re delivering it by a truck that, by the way, needs to be fueled, which means it needs an extra-large fuel tank, further cutting into the volume of hydrogen that you can transport.\u003C/p\u003E\u003Cp\u003EYour transport, and distribution losses for hydrogen, just in the form of it boiling off into the air, account for an estimated 10% losses \u003Cem\u003Eeventually\u003C/em\u003E, when we master the art of it.\u003C/p\u003E\u003Cp\u003EElectrical transport and distribution losses, as you\u0027ve said, are 6.6%, right now.\u003C/p\u003E\u003Cp\u003ETell me again, how is 10% better than 6.6% loss?\u003C/p\u003E\u003Cp\u003EThen again, you do ridiculous things like here:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/113563-Electric-or-hydrogen-cars?p=1799538\u0026amp;viewfull=1#post1799538\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/...=1#post1799538\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe article, \u003Ca href=\u0022http://www.nature.com/news/1998/030609/full/news030609-14.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.nature.com/news/1998/030609/full/news030609-14.html\u003C/a\u003E that you link here literally confirms that it\u0027s an ozone-depleting chemical that will worsen ozone depletion if we move to it. I don\u0027t know if you just don\u0027t know how to read, but can you try reading the things you post before posting them?\u003C/p\u003E\u003Cp\u003EIt even says that your transportation and storage leaks alone are estimated to reach 10%...right now, they\u0027re a lot higher in this regard. There are other losses involved here too, of course. Which means, no, it\u0027s not a good choice \u003Cem\u003Eright now\u003C/em\u003E. And the entire issue is about \u003Cem\u003Eright now\u003C/em\u003E.\u003C/p\u003E\u003Cp\u003EThen, let\u0027s do something else to all of this, something fun and annoying:\u003C/p\u003E\u003Cp\u003ELet\u0027s add in that the maximum theoretical efficiency of a fuel cell is 83%. That is essentially equivalent to the \u0022charge-discharge\u0022 efficiency of a battery.\u003C/p\u003E\u003Cp\u003EThis is the best your fuel cell will ever get, without even caring at all for all other losses, this is where you can get at max, without any losses to transportation, storage, or production. Most modern fuel cells, however, only have an efficiency of 40 to 60%. You yourself have already stated that modern, in-use batteries have 80% efficiency from charge to discharge, others here have given higher numbers, higher than the maximum efficiency of a fuel cell.\u003C/p\u003E\u003Cp\u003EBefore any other losses have even been calculated, the battery has already won.\u003C/p\u003E\u003Cp\u003EFor the battery, we already have the infrastructure, we already have the ability to make the batteries, and we already know the technology very well. \u003Cem\u003ERight now\u003C/em\u003E, the batteries are better than the fuel cells. Twenty, fifty years from now, who knows what will be the ideal choice.\u003C/p\u003E\u003Cp\u003EThis also comes back to bite you about the comparative losses, by the way.\u003C/p\u003E\u003Cp\u003EI\u0027ll be nice and use your loss numbers here, just to show you what the issue is.\u003C/p\u003E\u003Cp\u003ELet\u0027s start with some electricity, since both systems need electricity at the beginning. The hydrogen needs it to electrolyze the water, after all. Since I haven\u0027t seen any numbers for loss of hydrogen over time in storage or for electrical losses in storage, I won\u0027t use them.\u003C/p\u003E\u003Cp\u003ELoss just from making hydrogen from electricity: 5% 95\u003C/p\u003E\u003Cp\u003EEstimated loss from transporting and distributing hydrogen once we\u0027ve gotten very good at it: 10%\u003C/p\u003E\u003Cp\u003ELoss from using a fuel cell to produce electricity, ignoring hydrogen leakage from storage over time: \u0026gt;17%, current tech generally has 60-40% losses.\u003C/p\u003E\u003Cp\u003EBest case total loss when we master this: 29.035%\u003C/p\u003E\u003Cp\u003ELoss from making electricity from electricity: 0%\u003C/p\u003E\u003Cp\u003ELoss from transporting and distributing electricity: 6.6%\u003C/p\u003E\u003Cp\u003ELoss from using a battery to store and then produce electricity, ignoring discharge over time: 20%\u003C/p\u003E\u003Cp\u003EBest case total loss right now: 25.28%\u003C/p\u003E\u003Cp\u003EEven when we have absolutely mastered hydrogen fuel cells and gotten them to somehow reach maximum efficiency (something that we\u0027ve never succeeded at doing at with any system, I might add), the electricity we have right now is already better. Batteries are already a better way of doing this than fuel cells are predicted to \u003Cem\u003Eever\u003C/em\u003E be.\u003C/p\u003E\n"},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2015-03-27T20:19:52Z","Content":"\n\u003Cp\u003EI join this discussion because I know that there is so many misunderstandings and miths about energy sources.\u003C/p\u003E\u003Cp\u003EIs not all white or black, batteries are good in some cases in other cases hydrogen base technologies are better.\u003C/p\u003E\u003Cp\u003EI keep hearing drawbacks from one or the other which some were true 20 years back, others was driven without much merit by competing technologies, and the rest are true but they are already solve it in laboratory which it will take 5 to 10 years to come out.\u003C/p\u003E\u003Cp\u003ESo in batteries vs hydrogen fuel cell, it all depends on vehicle weight and autonomy.\u003C/p\u003E\u003Cp\u003EBatteries became too heavy and costly after certain scale.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kohai_Khaos\u0022 data-cite=\u0022Kohai_Khaos\u0022\u003E\u003Cdiv\u003EYou forgot to account for the fact that at a dedicated electrolysis facility, which is what you\u0027d want for this perfectly \u0022ideal\u0022 hydrogen supply for your fuel, you\u0027d also be dealing with the same 6.6% transmission loss and, the same loss from the renewable plants, and the same pollution from fossil fuel plants, as you would from a battery-charging source.\u003Cp\u003EIf the renewable plants are storing their energy in hydrogen fuel cells and this is more efficient than gigantic batteries, then your stated efficiencies for their storage losses for electrical energy are clearly flawed. Their storage losses are going to be \u003Cem\u003Eidentical\u003C/em\u003E, because they are the same facility whether they send out the power as a hydrogen-oxygen mix or as electrical energy.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot, because you produce hydrogen in place, right now the few sites that are practicing this are nuclear plants, solar farms, wind farms and maybe geothermal sites (I dint hear or read, but it may work fine)\u003C/p\u003E\u003Cp\u003ENuclear plants for example are always generating energy, even if they are using it for base load or not. So in the times that you dont need base load (or at least a %) you can produce hydrogen by electrolysis using the same waste heat from the reactor.\u003C/p\u003E\u003Cp\u003EIn all these examples, you dont have 6.6 % lose in transmision or extra pollution.\u003C/p\u003E\u003Cp\u003EBut in your case you want to use the energy from fossil fuels to generate hydrogen with the electricity created in the thermal plants.\u003C/p\u003E\u003Cp\u003EThis is a very bad way to do it.. Instead that, you extract the hydrogen from all kind of hydrocarbons first (with a 80% of efficiency, this is how the 95% of the world hydrogen is produced) and then if you want to generate electricity, you do it with a fuel cell plant, which are much efficient than any thermal plant.\u003C/p\u003E\u003Cp\u003EThe problem is still the prices of the catalyst used which it will drastic change in the next 10 years.\u003C/p\u003E\u003Cp\u003ESo with this way, you capture all CO and CO2 from the begining, and you recover a big part of the effiecient lost with the fuel cell plant, or... you just sell and transport the hydrogen.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EWhen you deliver the hydrogen to the station, it is either by direct pipeline or by a truck with a large, pressurized tank. This tank has a limited size, and as others have pointed out, hydrogen, while being very energy-dense when it comes to mass, has a rather low volumetric energy density (you need a much larger volume to contain an equal amount of energy, basically, and the main limitation on these tank sizes is volume at this point). Both of these introduce further losses to the system, because you are either constantly building these expensive, insulated pipelines that aren\u0027t even economical on this scale with high-density fuel that doesn\u0027t have issues with boiloff, or you\u0027re delivering it by a truck that, by the way, needs to be fueled, which means it needs an extra-large fuel tank, further cutting into the volume of hydrogen that you can transport.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHydrogen transport is already mentioned in one of the sources I post, goes from 5% to 10% of energy lost, this taking into account that we dint solve yet (in market) the leak problem, but is comming.\u003C/p\u003E\u003Cp\u003EHydrogen has not much energy density with volume, but in the case of pipeline it has lower viscosity, so much higher velocities can be achieve it.\u003C/p\u003E\u003Cp\u003EAs I mention earlier if you want to avoid all these transportation and management problems on hydrogen, you intruduce nitrogen to produce ammonia (in fact almost all the hydrogen produced today is to make ammonia for fertilizers).\u003C/p\u003E\u003Cp\u003EIf you have ammonia then all is much easier, the little extra energy you waste you save it in hydrogen compression and transportation issues, not pressurized plastic tanks is anything you need, it has 1.6 times the energy of liquid hydrogen for the same volume.\u003C/p\u003E\u003Cp\u003EAnd you can use almost the same fuel infrastructure with small changes to distribute ammonia.\u003C/p\u003E\u003Cp\u003EAny vehicle will charge ammonia and then with a small device will be splitted to hydrogen on demand.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://phys.org/news/2014-06-hydrogen-breakthrough-game-changer-future-car.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://phys.org/news/2014-06-hydrogen-breakthrough-game-changer-future-car.html\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt needs some extra years of development, but we are close.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EYour transport, and distribution losses for hydrogen, just in the form of it boiling off into the air, account for an estimated 10% losses \u003Cem\u003Eeventually\u003C/em\u003E, when we master the art of it.\u003Cp\u003EElectrical transport and distribution losses, as you\u0027ve said, are 6.6%, right now.\u003C/p\u003E\u003Cp\u003ETell me again, how is 10% better than 6.6% loss?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEven with that efficiency lost which I already explain in detail, not all vehicles can use batteries..\u003C/p\u003E\u003Cp\u003EOr what? Airplanes will keep using oil and producing Co2 the same as transport ship, bus or any kind of heavy vehicle? Because at those scales batteries are very very inneficient.\u003C/p\u003E\u003Cp\u003EI will said that the limit for batteries is 1500 kg and 500km autonomy, beyond that it will be hydrogen ground.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThen again, you do ridiculous things like here:\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/113563-Electric-or-hydrogen-cars?p=1799538\u0026amp;viewfull=1#post1799538\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/...=1#post1799538\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe article, \u003Ca href=\u0022http://www.nature.com/news/1998/030609/full/news030609-14.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.nature.com/news/1998/030609/full/news030609-14.html\u003C/a\u003E that you link here literally confirms that it\u0027s an ozone-depleting chemical that will worsen ozone depletion if we move to it. I don\u0027t know if you just don\u0027t know how to read, but can you try reading the things you post before posting them?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, it does not confirm that.. read again.. there is a lot of IF.. Read my explanatory comment about it.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EIt even says that your transportation and storage leaks alone are estimated to reach 10%...right now, they\u0027re a lot higher in this regard. There are other losses involved here too, of course. Which means, no, it\u0027s not a good choice \u003Cem\u003Eright now\u003C/em\u003E. And the entire issue is about \u003Cem\u003Eright now\u003C/em\u003E.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eyeah now.. but I already post a lot of links showing that Reduced Graphene Oxide stop any hydrogen leak in a 100%, and rGO is very easy to produce and is cheap. You use it like a paint. It just need few 3 or 5 years to reach the market.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThen, let\u0027s do something else to all of this, something fun and annoying:\u003Cp\u003ELet\u0027s add in that the maximum theoretical efficiency of a fuel cell is 83%. That is essentially equivalent to the \u0022charge-discharge\u0022 efficiency of a battery.\u003C/p\u003E\u003Cp\u003EThis is the best your fuel cell will ever get, without even caring at all for all other losses, this is where you can get at max, without any losses to transportation, storage, or production. Most modern fuel cells, however, only have an efficiency of 40 to 60%.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E \u003Cp\u003EIt depends, some of those use cheap catalyst or they use air instead oxygen (as cars).\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EYou yourself have already stated that modern, in-use batteries have 80% efficiency from charge to discharge, others here have given higher numbers, higher than the maximum efficiency of a fuel cell.\u003Cp\u003EBefore any other losses have even been calculated, the battery has already won.\u003C/p\u003E\u003Cp\u003EFor the battery, we already have the infrastructure, we already have the ability to make the batteries, and we already know the technology very well. \u003Cem\u003ERight now\u003C/em\u003E, the batteries are better than the fuel cells. Twenty, fifty years from now, who knows what will be the ideal choice.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAgain.. for small city cars or medium cars yes.. batteries are better, but this is not true beyond that.. Just picture a farm truck with batteries.. Which it needs high autonomy and the full vehicle weight with payload is close to 3500kg\u003C/p\u003E\u003Cp\u003EWith batteries the cost will be prohibitive and the autonomy awfull. Instead 3500 it will weight 4500kg. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EEven when we have absolutely mastered hydrogen fuel cells and gotten them to somehow reach maximum efficiency (something that we\u0027ve never succeeded at doing at with any system, I might add), the electricity we have right now is already better. Batteries are already a better way of doing this than fuel cells are predicted to \u003Cem\u003Eever\u003C/em\u003E be.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, dont make the same wrong assumptions on generalized choice, because the world does not work with a single product and not all is white or black.\u003C/p\u003E\u003Cp\u003EBatteries take the lead in progress for the moment, but the next years will be tie for huge jump improvement on hydrogen.\u003C/p\u003E\u003Cp\u003EBoth are necesary if we want to eliminate co2 and stop global warming, and the most important, both will have more economic and efficient sense than fossil fuels.\u003C/p\u003E\n"},{"CreatedByName":"Albert VDS","CreatedById":74055,"CreatedDateTime":"2015-03-27T20:32:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AngelLestat\u0022 data-cite=\u0022AngelLestat\u0022\u003E\u003Cdiv\u003Eand the rest are true but they are already solve it in laboratory which it will take 5 to 10 years to come out.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJust like how the problem of a space elevator is already solved in a laboratory?\u003C/p\u003E\n"},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2015-03-27T21:01:32Z","Content":"\n\u003Cp\u003Efirst, not all space elevator problems are solve it, second we are talking of a very different scale, third is in space.\u003C/p\u003E\u003Cp\u003EWe are already have and companies sell not defect graphene layers smaller than a hand, put many of those at certain distance with some defect added and you have already a better fuel cell than using platinum.\u003C/p\u003E\u003Cp\u003EHow large and how many layer without defect you need to make a space elevator?\u003C/p\u003E\u003Cp\u003EThese kind of comparison does not help in nothing and does not make any point.\u003C/p\u003E\n"},{"CreatedByName":"RuBisCO","CreatedById":59540,"CreatedDateTime":"2015-04-08T23:45:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AngelLestat\u0022 data-cite=\u0022AngelLestat\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003Cstrong\u003EElectrolysis can reach in theory using waste heat of other process an efficiency of 120%\u003C/strong\u003E, this means that if you enter 1 kw, you get 1,2 kw of hydrogen without compression.\u003C/p\u003E\u003Cp\u003EEven the ambient temperature is an external source of energy which helps to increase your efficiency on electrolysis.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYour going to need to cite this for me to even come close to believe it. \u003C/p\u003E\u003Cp\u003EB]You get 39 kw per kg of hydrogen (or 39Mw by per tonne) \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Electrolysis_of_water#Efficiency\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Electrolysis_of_water#Efficiency\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EThe best PEM systems or steam reach 95% of efficiency, then you need to add 5% on compression 250 bar and 5% in transportation.\u003C/strong\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESeveral problems here\u003C/p\u003E\u003Cp\u003E1. Your citing Wikipedia, it is a tertiary source at best, please cite what it cites, a secondary or primary research article. \u003C/p\u003E\u003Cp\u003E2. I can\u0027t find anywhere on the wiki page where it claims a PEM reaches 95% energy conversion efficiency . \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ETake a look in this study about offshore wind farm with direct hydrogen production on sea water.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://download.springer.com/static/pdf/25/art%253A10.1007%252Fs40095-014-0104-6.pdf?auth66=1427420658_263eeeb4adcc54ae0fd6a23f65eb5a48\u0026amp;ext=.pdf\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://download.springer.com/static/pdf/25/art%253A10.1007%252Fs40095-014-0104-6.pdf?auth66=1427420658_263eeeb4adcc54ae0fd6a23f65eb5a48\u0026amp;ext=.pdf\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis study specifically claims even best case energy conversion efficiencies below 80% \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EA different source on compression:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://ec.europa.eu/research/participants/portal/desktop/en/opportunities/h2020/topics/8067-fch-02.6-2014.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://ec.europa.eu/research/participants/portal/desktop/en/opportunities/h2020/topics/8067-fch-02.6-2014.html\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u0022The energy consumption of the system should be below 4 kWh / kg H2 when compressed from 20 to 500 bar.\u0022\u003C/em\u003E \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EQuestion: how do you get to 20 bars to begin with?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAlso you dont need as I mention many times deal with hydrogen tanks.. You can use ammonia which it has 1.6 times more energy density than liquid hydrogen and can be cracked on demand with little efficiency lost, and you can use the same infrastructure of oil with minor changes.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENow you need to add in the energy lose of producing ammonia from nitrogen and hydrogen, cracking it is going to be a loss, ammonia is highly toxic and the ammonia transport infrastructure would need to be greatly enlarged to handle supplying energy to the transportation sector. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ENew discoveries which already talk about on hydrogen managment and catalyst are very close to release which will reduce by a lot the investment cost.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah sure, decades down the line, \u003Cstrong\u003Emeanwhile batteries are here and now.\u003C/strong\u003E \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EFinal question:\u003C/p\u003E\u003Cp\u003EIf you said that hydrogen is not needed, how you save Co2 from vehicles bigger than 1500kg?\u003C/p\u003E\u003Cp\u003ECan a 747 fly with batteries?? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt can\u0027t fly on hydrogen, not without adding huge fuel tanks! Have it fly on bio-petroleum made from algae, such a product can already be made into a mix-in or drop-in replacement for JP-4 and JP-8. \u003C/p\u003E\u003Cp\u003EYou can\u0027t make a single fuel for everything, least of all hydrogen would not be that universal fuel. Batteries can take up much of the light vehicle market, which is 50-60% of oil usage. For trucks, trains, planes, etc, there are other, better, alternatives.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EEven using hydrogen the volume is not important, because you have a huge amount of energy, and volume increase with the cube and it is much light.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou don\u0027t want me pulling out the spread sheets do you, remember what happened last time I pulled the spread sheets on you? \u003C/p\u003E\u003Cp\u003EThe volume of liquid hydrogen and the tanks required for it would simply not fit in a passenger plane without radical re-design, right now fuel can be pumped into the wings and neutral pressure areas, it reduces weight and volume taken up, because more volume equals more aerodynamic resistance.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jon144\u0022 data-cite=\u0022Jon144\u0022\u003E\u003Cdiv\u003EMy\u003Cp\u003EMajor problem with electric cars are their terribly inefficent batteries. Most charge we put into batteries is lost via thermal and other forms of energy. Still beats gas cars though. More energy is lost in those mechanical processes than ever could imagine for the batteries in an electric.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELithium Ion batteries regularly have charge-discharge efficiency above 90%. Tesla has claimed plug-to-wheel efficiencies of up to 86%. \u003C/p\u003E\u003Cp\u003Eweb.archive.org/web/20071011010258/http://www.teslamotors.com/efficiency/well_to_wheel.php\u003C/p\u003E\n"},{"CreatedByName":"RatchetinSpace","CreatedById":65526,"CreatedDateTime":"2015-04-11T11:13:02Z","Content":"\n\u003Cp\u003EAre you talking about the cars which use hydrogen to run a generator that powers motors? If thats the case Hydrogen is way better than electics in my opinion.\u003C/p\u003E\u003Cp\u003EElectric cars are heavy which makes them inefficient. They are also bad for the environment because their batteries use hazardous materials and the walls they plug into are supplied by coal power plants mostly. Electric cars also take a long time to charge up, meaning you can\u0027t go on long drives. The batteries in electric cars also deteriorate quickly.\u003C/p\u003E\u003Cp\u003EHydrogen is abundent on Earth thanks to our large supply of water. Hydrogen goes into the car just like petrol and can run the car for a similar distance. If it runs out you can just refuel. Hydrogen cars don\u0027t need lots of batteries like electric cars so they can last longer without servicing. Finally Hydrogen is completely clean energy that doesn\u0027t require sourcing the power grid which currently runs off of coal and other fossil fuels.\u003C/p\u003E\u003Cp\u003EI think in the future our power plants will use hydrogen fuel cells (If we don\u0027t work out fusion) and our cars will also run on the stuff. The apparent dangers of hydrogen are exactly the same as those with gasoline, so theres nothing new to combat. And best of all, we already have fuel stations set up all over the world. We can just slowly convert them to hydrogen pumps as more and more people use it over the ever rising price of gasoline.\u003C/p\u003E\u003Cp\u003EOf course I\u0027m not saying electric cars don\u0027t have their place. The relationship between hydrogen and electric cars will mirror that of diesel and petrol cars. Electric cars will be good for shot commutes while hydrogen will power our trucks that need to go long distance and our trains that can\u0027t stop to recharge.\u003C/p\u003E\u003Cp\u003ENow I think about it.....as fuel prices rise, planes need a new fuel source.....what will that be? Probably not electricity or hydrogen, because they both use electric motors.\u003C/p\u003E\u003Cp\u003EAnyway, thats my thoughts on it.\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2015-04-11T11:26:51Z","Content":"\n\u003Cp\u003E@ RatchetinSpace\u003C/p\u003E\u003Cp\u003EFor the most part I tend to agree with you but there is one MAJOR flaw in your idea.\u003C/p\u003E\u003Cp\u003EElectric cars are indeed slow to recharge and the energy required is currently for the most coming from non-sustainable sources. Hydrogen cars are quick to refuel just like petrol cars and hydrogen is very common earth. It\u0027s even the most common element in the universe.\u003C/p\u003E\u003Cp\u003ENow here\u0027s your flaw: Hydrogen on earth is locked up. For the majority there is one oxygen for each hydrogen, H\u003Csub\u003E2\u003C/sub\u003EO. For the less educated; that\u0027s plain old water. To get the hydrogen out you need energy, lots of energy. Where does that energy come from? Currently that would be electricity from coal and oil.\u003C/p\u003E\u003Cp\u003EHydrogen is not a miracle source of energy. It\u0027s just an energy storage medium just like a battery. Only when the energy source is clean the end use is too.\u003C/p\u003E\n"}]}