{"TopicId":102424,"ForumId":18,"TopicTitle":"Is a Hotas setup worth it for any flight games like Kerbal Space simulator?","CreatedByName":"Cloakedwand72","CreatedById":38144,"CreatedDateTime":"2015-03-21T21:14:10Z","PageNum":1,"Articles":[{"CreatedByName":"Cloakedwand72","CreatedById":38144,"CreatedDateTime":"2015-03-21T21:14:10Z","Content":"Is it worth having a Hotas setup for a casual KSP player and a non hardcore realistic FSX and X-plane user?\n\nI have a Thrustmaster T-16000M Flight Stick and was wondering if these two things would be good for KSP and other flight games.\n\nCH Pro Rudder Pedals\n\n[http://store.x-plane.org/CH-Pro-Rudder-Pedals_p_24.html](http://store.x-plane.org/CH-Pro-Rudder-Pedals_p_24.html)\n\nPro Throttle\n\n[http://store.x-plane.org/Pro-Throttle_p_23.html](http://store.x-plane.org/Pro-Throttle_p_23.html)\n\nAre these two items worth it for a casual flight game player?And are these two items ergonomic?And could I easily travel with these two items?\n\n**Edited \u003Ctime datetime=\u00222015-03-21T21:17:07Z\u0022 title=\u002203/21/2015 09:17  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 21, 2015\u003C/time\u003E by Cloakedwand72**"},{"CreatedByName":"xcorps","CreatedById":96531,"CreatedDateTime":"2015-03-21T21:24:46Z","Content":"I personally do not enjoy the joystick controls. The mouse and keyboard is my preference. I spent about 3 days trying to get into a HOTAS, couldn\u0027t."},{"CreatedByName":"Flymetothemun","CreatedById":17689,"CreatedDateTime":"2015-03-21T21:58:51Z","Content":"\u003E \n\u003E I personally do not enjoy the joystick controls. The mouse and keyboard is my preference. I spent about 3 days trying to get into a HOTAS, couldn\u0027t.\n\nDid you try flying planes? I use a stick but exclusively for planes, I hated the experience of flying a rocket with a stick.\n\n**Edited \u003Ctime datetime=\u00222015-03-21T22:04:03Z\u0022 title=\u002203/21/2015 10:04  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 21, 2015\u003C/time\u003E by Flymetothemun**"},{"CreatedByName":"Ten Key","CreatedById":123319,"CreatedDateTime":"2015-03-21T23:50:19Z","Content":"I own both the throttle and the pedals, paired with a CH Fighterstick. Both items are very well built, and from a wear and tear standpoint would probably handle travel very well. \n\nThe HOTAS set up works wonderfully for aircraft in KSP, to the point where I would never try to fly one with a keyboard anymore. That said, I do not use it for launching rockets or controlling spacecraft outside of an atmosphere. I\u0027ve found the discrete inputs from the keyboard to be much better for RCS control than the joystick.\n\nI like the CH Pro Throttle. I especially like the fully analog thumb stick, which works wonderfully for camera control. I will warn you, the throttle is *much* bigger than it looks online-- the base is roughly six inches by eight inches and the throttle itself is quite large. If you have smallish hands, you will have to stretch your fingers around to reach some of the buttons. \n\nBecause of the way the software interface works, \u0022full throttle\u0022 is only about 99% of max throttle in game-- if you want that little bit of extra power, you need to reach over and tap the shift key.\n\nUsing the throttle for spacecraft is problematic. If you\u0027re trying to time a burn, the \u0022cut throttle\u0022 key on the keyboard will override the physical throttle and kill the engine. But as soon as you move the throttle, the game throttle will snap to what ever position the physical throttle is currently in. \n\nThe rudder pedals. . .honestly I don\u0027t like them. They are well built, and comfortable from an ergonomic standpoint, but they have a \u0022hard stop\u0022 in the centered position. For example, if you try to shift suddenly from left to right rudder, there is a fair amount of physical resistance as you pass through the centered position. If you\u0027re just trying to center the pedals, it\u0027s great for preventing unintentional \u0022over steer\u0022. If you\u0027re actively trying to reverse your turn, the pedals are going to fight you. \n\nKSP doesn\u0027t have analog wheel brakes, so the \u0022toe brakes\u0022 on those pedals don\u0027t really work. \n\nFor KSP alone. . .these are probably not worth the price unless you\u0027re big into aircraft. But if you\u0027re flying planes in other games as well, the pedals and throttle will enhance your experience enough to where you probably want them.\n\n\u003E \n\u003E ![s7EO6yU.jpg](http://i.imgur.com/s7EO6yU.jpg)\n\u003E \n\u003E ![K9gknDP.jpg](http://i.imgur.com/K9gknDP.jpg)\n\u003E \n\u003E \n\n**Edited \u003Ctime datetime=\u00222015-03-22T01:10:44Z\u0022 title=\u002203/22/2015 01:10  AM\u0022 data-short=\u00229 yr\u0022\u003EMarch 22, 2015\u003C/time\u003E by Ten Key**\n  \nAdded pictures"},{"CreatedByName":"cpast","CreatedById":112846,"CreatedDateTime":"2015-03-22T02:45:27Z","Content":"I have that model throttle, pedals, and a CH Fighterstick. I don\u0027t fly lots of KSP planes, but what I did find it excellent for was controlling an orbital tug\u0027s RCS: I used the stick for roll and pitch, the mini-stick on the throttle (the throttle there has a small analog stick that you can control with your thumb) for left/right and up/down translation, the pedals sliding for yaw, and the toe brakes for forward/backward translation. It made things \\*much\\* easier to control, using it as essentially a six-axis control unit.\n\nOne of the nice things about CH is that they have a pretty decent control manager, letting you set up your logical controls however you want regardless of the physical controls (e.g. I had all of those axes on one joystick as far as KSP was concerned, which included combining the two toe brakes into one axis via a script). If you have all CH sticks, then you can have this mapping include all of your sticks and the like, and can use different modes that you can switch between on the fly that change how real axes and buttons map to logical ones (the green light in Ten Key\u0027s picture is the mode indicator, which works if you have one device and use three modes, but can be inaccurate and useless if you have a more complex layout, in which case you need to remember the mode). That means that even though KSP doesn\u0027t let you easily remap controls in the middle of a flight, you can have several preprogrammed control layouts that you switch between.\n\n**Edited \u003Ctime datetime=\u00222015-03-22T02:55:31Z\u0022 title=\u002203/22/2015 02:55  AM\u0022 data-short=\u00229 yr\u0022\u003EMarch 22, 2015\u003C/time\u003E by cpast**"},{"CreatedByName":"Pixel of Life","CreatedById":45646,"CreatedDateTime":"2015-03-22T14:16:29Z","Content":"Not really, but if you play other flight simulators/games (FSX, X-Plane, Elite Dangerous etc.) then it\u0027s a must have. I\u0027m using a Thrustmaster HOTAS Warthog with Saitek\u0027s Pro Flight rudder pedals. I\u0027ve had some problems with the pedals - the rudder axis kept drifting to the left, but that turned out to be a contact problem in the potentiometer and was easily fixed with some contact cleaner spray. The left toe brake spring mount also broke and I had to jury-rig a replacement mount using a piece of steel plate (a few mm\u0027s thick), epoxy glue and some nuts and bolts. So far they\u0027ve worked perfectly, although the pedals themselves feel somewhat flimsy due to some slight sideways movement. The rudder axis is a bit sticky too but that can be (mostly) fixed by turning the tension to maximum. I\u0027ve been thinking of upgrading to the Cessna or Combat rudder pedals as those are newer than the Pro Flight ones and might be of better quality.\n\nAs for the HOTAS - The joystick and throttle have worked flawlessly for over 3 years now and feel very high quality. No signs of wear at all. Both the stick and the throttle weigh several kilograms and stay in place nicely. There\u0027s also plenty of buttons for all your functions. The only thing I don\u0027t like about them is the stiffness of the stick. Using it for long periods of time at once is rather exhausting, but that might be just because I\u0027ve got it on my desk - ideally, you\u0027d want to mount it down low so that your elbow forms a 90 degree angle and your wrist is straight when you\u0027re holding it. Well worth the $400-$500 price tag."}]}