{"TopicId":102474,"ForumId":25,"TopicTitle":"[FAR,kOS] Land on Mun! 3 Difficulty Levels... Steam Games for prizes!!!","CreatedByName":"TheGreatFez","CreatedById":82922,"CreatedDateTime":"2015-03-22T19:21:27Z","PageNum":1,"Articles":[{"CreatedByName":"TheGreatFez","CreatedById":82922,"CreatedDateTime":"2015-03-22T19:21:27Z","Content":"\n\u003Cp\u003EHello all,\u003C/p\u003E\u003Cp\u003EEDITS: Procedural Fairings mod added, Team Entries are allowed, Entry Due Date extended\u003C/p\u003E\u003Cp\u003EI am a moderator on the /r/kOS subreddit. I have been spending the last couple weeks working out the kinks in this challenge to post on the subreddit. To get more exposure I wanted to post it on here so that others might find interest in it!\u003C/p\u003E\u003Cp\u003EIf you don\u0027t know what kOS is, its a mod for KSP that allows you to write automated scripts that control your rocket using a language called Kerbo Script. Here is a \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/68089-0-23-kOS-Scriptable-Autopilot-System-v0-11-2-13\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003Elink\u003C/span\u003E\u003C/a\u003E to the forum on the mod.\u003C/p\u003E\u003Cp\u003EThe challenge will require you to code an autopilot script and design a ship to fly to Mun and Land with 3 different difficulty of objectives.\u003C/p\u003E\u003Cp\u003EHere is the \u003Ca href=\u0022https://docs.google.com/document/d/1nPEwS7ScbFXYVubHxYe-BscM3OgfxdewnTW58tPVINM/edit\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003Elink\u003C/span\u003E\u003C/a\u003E to the Google Doc with the description on it. Its quite lengthy but I believe it covers much of any issues that might arise with this competition.\u003C/p\u003E\u003Cp\u003EIf you have any issues/questions/comments please let me know!\u003C/p\u003E\u003Cp\u003EDeadline for submissions is April 25th at 11:59pm (UTC-6).\u003C/p\u003E\u003Cp\u003EGood luck! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-31T00:42:55Z\u0022 title=\u002203/31/2015 12:42  AM\u0022 data-short=\u00229 yr\u0022\u003EMarch 31, 2015\u003C/time\u003E by TheGreatFez\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"rudi1291","CreatedById":138990,"CreatedDateTime":"2015-03-22T20:11:46Z","Content":"\n\u003Cp\u003EA scripting language for KSP? ThatÃ‚Â´s nice. Maybe, if i manage to install this, i will try this\u003C/p\u003E\n"},{"CreatedByName":"TheGreatFez","CreatedById":82922,"CreatedDateTime":"2015-03-23T04:07:07Z","Content":"\n\u003Cp\u003EYeah its not too bad to install and get started. If you are looking for any help, the documentation sight is a great place to start. Also, you can learn a lot from /r/kOS on Reddit!\u003C/p\u003E\n"},{"CreatedByName":"Aphobius","CreatedById":79391,"CreatedDateTime":"2015-03-24T17:29:06Z","Content":"\n\u003Cp\u003EHey, I was thinking about participating, but FAR greatly discourage me, some people just don\u0027t like mods.\u003C/p\u003E\u003Cp\u003EAnyway, in case I\u0027ll still participate or maybe you\u0027ll allow entries without FAR, I have a question. The rocket/script should be able to complete the challenge starting from any date or all of the 3 tests are going to take place on a new save file?\u003C/p\u003E\u003Cp\u003EThis is very important, since a script with precalculated data (mostly burns) is much easier to make than a script that can complete the challenge by starting from any date.\u003C/p\u003E\n"},{"CreatedByName":"TheGreatFez","CreatedById":82922,"CreatedDateTime":"2015-03-25T00:37:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Aphobius\u0022 data-cite=\u0022Aphobius\u0022\u003E\u003Cdiv\u003EHey, I was thinking about participating, but FAR greatly discourage me, some people just don\u0027t like mods.\u003Cp\u003EAnyway, in case I\u0027ll still participate or maybe you\u0027ll allow entries without FAR\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELet me think about this... FAR does add difficulty since you can\u0027t make sharp easy turns. The reason for its addition is the emphasis on efficiency for Tier 1 and Tier 3 and to a lesser extent Tier 2. FAR is much more efficient than stock aerodynamics so I wanted to give them the best chance they had. If I let people enter without FAR it might be concidered cheap since its there is much larger margins for error in stock than FAR. Which also makes it easier to write scripts... However the players without would suffer from efficiency so it might be counteracted by this. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Aphobius\u0022 data-cite=\u0022Aphobius\u0022\u003E\u003Cdiv\u003EThe rocket/script should be able to complete the challenge starting from any date or all of the 3 tests are going to take place on a new save file?\u003C/div\u003E\u003C/blockquote\u003E \u003Cp\u003EYou are welcome to run things at a precalculated date. I can start a new save file if \u003Cem\u003Enecessary\u003C/em\u003E. However... I suggest that you write into your code to determine when to launch based on the Universal Time. Since you can accelerate time to whatever date you wish at the launch pad you can move to the launch date that would best help you. After all, all launch windows come up every day/month with respect to Mun.\u003C/p\u003E\u003Cp\u003EHope this answers your questions! Let me know if you would still like to participate. I might add a section on those who do not wish to use FAR if there are enough people who wish to do this...\u003C/p\u003E\n"},{"CreatedByName":"Aphobius","CreatedById":79391,"CreatedDateTime":"2015-03-26T18:27:15Z","Content":"\n\u003Cp\u003EThank you for the answers. I might try it if I have time in the week-end.\u003C/p\u003E\n"},{"CreatedByName":"celem","CreatedById":91132,"CreatedDateTime":"2015-04-02T15:16:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Aphobius\u0022 data-cite=\u0022Aphobius\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThis is very important, since a script with precalculated data (mostly burns) is much easier to make than a script that can complete the challenge by starting from any date.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBoy, you aint kidding. My entry for this challenge hit exactly this issue, it worked beautifully... provided it launched at UT 0.\u003C/p\u003E\u003Cp\u003EMaking a pre-calculated script resilient to this is less of a chore than it seems however, KerboScript is pretty smart and has a lot of options including solid timewarp controls. Adapting a precalculated script to find its intended transfer from any launch time is fairly trivial. (afterall its a window that pops up once per orbital period of your ship for Mun, so probably every 90 minutes or so) Certainly an easier concept than making a script that uses no such pre-calculated data and genuinely finds its own way.\u003C/p\u003E\u003Cp\u003EWould strongly recommend those interested in diving into this challenge to stop by the subreddit, a number of us have been discussing the various hardships involved and solutions over there. (though you wont see any code, its a contest after all. XD)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-04-02T15:19:53Z\u0022 title=\u002204/02/2015 03:19  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 2, 2015\u003C/time\u003E by celem\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2015-04-02T16:24:46Z","Content":"\n\u003Cp\u003EI found that if you get to an 80km orbit then an FRT needs exactly 872Dv. The timing of the burn can be calculated by seeing if Mun is closer or further away, when it changes from getting closer to getting further away then it is exactly above you and you are at a fixed point. Can\u0027t remember the exact amount of seconds to wait but you then wait for a precise time (around 3/4 of an orbit) and burn prograde for 872Dv. I was able to get a Pe around Mun of between 10 and 15km by timing my burn accurately. burn retrograde 100 seconds before Pe (at least on my craft) for 120 seconds and you are in orbit. Tidy your orbit and circularise and you are in orbit around mun from any point in time.\u003C/p\u003E\u003Cp\u003EA good mix between checking and pre-calc and hardly any maths either...\u003C/p\u003E\u003Cp\u003EAFAIK it\u0027s how the Apollo people did it. They knew a lot of the numbers and hardcoded them and had the AGC figure out the limited number of things that would change in the mission. They had hardly any processing power or sensors so it was how they had to do it.\u003C/p\u003E\n"},{"CreatedByName":"TheGreatFez","CreatedById":82922,"CreatedDateTime":"2015-04-03T05:17:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022celem\u0022 data-cite=\u0022celem\u0022\u003E\u003Cdiv\u003EBoy, you aint kidding. My entry for this challenge hit exactly this issue, it worked beautifully... provided it launched at UT 0.\u003Cp\u003EMaking a pre-calculated script resilient to this is less of a chore than it seems however, KerboScript is pretty smart and has a lot of options including solid timewarp controls. Adapting a precalculated script to find its intended transfer from any launch time is fairly trivial. (afterall its a window that pops up once per orbital period of your ship for Mun, so probably every 90 minutes or so) Certainly an easier concept than making a script that uses no such pre-calculated data and genuinely finds its own way.\u003C/p\u003E\u003Cp\u003EWould strongly recommend those interested in diving into this challenge to stop by the subreddit, a number of us have been discussing the various hardships involved and solutions over there. (though you wont see any code, its a contest after all. XD)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOkay, I reallly hope this doesn\u0027t sound rude. But I am not sure exactly why a pre-calculated script is needed. Is it so you get the proper launch window to get to Mun? Could you explain in more detail why it is that you need to launch at exactly UT 0?\u003C/p\u003E\u003Cp\u003EMy issue here in understanding is that since you dont have any life support needed, then can you not get into orbit and then wait until you reach the proper phase angle to launch? \u003C/p\u003E\u003Cp\u003EAfter I understand the issue better I might be able to aid you guys by somehow starting the game for your test runs at the same time OR more helpfully I might be able to give you guys some help into solving the issue. \u003C/p\u003E\u003Cp\u003EI would greatly appreciate your input!\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EI also want to point out one thing to help incase anyone does not know already:\u003C/p\u003E\u003Cp\u003EYou can determine what the Longitude and Latitude of Mun is in respect to Kerbin. For example, if you \u0022print MUN:LONGITUDE.\u0022 it will give you the longitude that Mun is currently at on Kerbin. This is kind of important since you can use this data to then get a phase angle between you and Mun. Using this you can then figure out when to launch, based on what altitude your parking orbit is. That part you will need to Google and find out yourself but I hope this helps others!\u003C/p\u003E\n"}]}