{"TopicId":102406,"ForumId":15,"TopicTitle":"[WIP] Moar Launchpads! (Need someone willing to texture)","CreatedByName":"Budgie","CreatedById":13840,"CreatedDateTime":"2015-03-21T17:43:38Z","PageNum":1,"Articles":[{"CreatedByName":"Budgie","CreatedById":13840,"CreatedDateTime":"2015-03-21T17:43:38Z","Content":"\n\u003Cp\u003EI\u0027m bored with KSC\u0027s launchpad. Its really dull to always take off from the same pad at the same spaceport for every flight. So I went ahead and started modelling some other launchpads, based on those found at real space centers like Kennedy Space Center and Vandenberg AFB. \u003C/p\u003E\u003Cp\u003ESo I present to you Launchpad 2A, based on the Delta IV\u0027s Mobile Service Tower, and 3A (model still WIP), based on the Atlas V rollout and launch pad system:\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/Gtv3w\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003ENow, its obviously very untextured right now. I have tried to make textures and I\u0027m really just bad at it. I was hoping someone would like to team up and help me give any new launchpads I\u0027m making some colour while I learn to use Kerbal Konstructs to introduce them to the game. (This also hinges on me figuring out how to make collision meshes for this, right?)\u003C/p\u003E\u003Cp\u003EI\u0027m always welcome to some constructive criticism and tips and tricks, since I\u0027m still figuring this modding stuff out, and any suggestions for new pads to make. Any ideas on making sure the memory footprint is as low as possible are also welcome\u003C/p\u003E\u003Cp\u003ENote: I really love the Kerbinside mod, but it\u0027s a little too much on the cartoon-y side for me. I\u0027m kinda hoping to provide an alternative to that, based a bit more on realism, aesthetically. As such, my pads and buildings will all be inspired by or based on actual launch facilities.\u003C/p\u003E\n"},{"CreatedByName":"Van Disaster","CreatedById":58876,"CreatedDateTime":"2015-03-21T21:39:26Z","Content":"\n\u003Cp\u003EMight want to be a bit wary of adding something so close to the pad - people love to make wide launchers! looking good so far though. I don\u0027t have time or much motivation to do texture work at the moment, but I might suggest - based on your other point about Kerbinside - that making the Kerbinside textures a little more grimy \u0026amp; shaded would be good texturing practice. If it\u0027s possible anyway, I\u0027ve not looked how they\u0027ve mapped those.\u003C/p\u003E\n"},{"CreatedByName":"Ikaneko","CreatedById":109214,"CreatedDateTime":"2015-03-21T21:48:32Z","Content":"\n\u003Cp\u003EAt first I thought this was yet another, \u0022I have no skill in texturing or coding, but am happy to lead the project\u0022 thing. I was pleasantly surprised; that\u0027s a mighty fine model there, although space is an issue. We don\u0027t want to add the launch tower back into our games.\u003C/p\u003E\u003Cp\u003EI hope you find a texturer (protip: Beale, of Tantares fame, is an excellent texturer if you can get him \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E)\u003C/p\u003E\n"},{"CreatedByName":"RobotsAndSpaceships","CreatedById":122975,"CreatedDateTime":"2015-03-21T21:52:57Z","Content":"\n\u003Cp\u003EWow, these are really pretty, since they\u0027re all simple shapes, I don\u0027t think it would be that hard to texture yourself.\u003C/p\u003E\n"},{"CreatedByName":"Budgie","CreatedById":13840,"CreatedDateTime":"2015-03-22T00:11:02Z","Content":"\n\u003Cp\u003EI think I fall into the camp of players that miss a launch tower next to the pad. My goal with this project is to add some variety to the KSC. Big, super wide asparagus-staging rockets should still take off from the biggest pad that already exists. Then I can provide smaller pads for 1.25 and 2.5m rockets to use. Of course, I can certainly put out a launch tower-less version if people want.\u003C/p\u003E\u003Cp\u003EThe biggest issue with the texturing right now, I think, is all the metal trusses on the inside of the Mobile Service Tower and the Launch Tower. I may try out a simpler model where the trusses are painted on instead of modelled, that will make the texturing a little easier to do, hopefully.\u003C/p\u003E\u003Cp\u003ETo all, thanks for the attention and the rep! I really want to put this mod out there for people to use, so I\u0027ll keep trying to figure things out slowly\u003C/p\u003E\n"},{"CreatedByName":"RobotsAndSpaceships","CreatedById":122975,"CreatedDateTime":"2015-03-24T07:11:37Z","Content":"\n\u003Cp\u003EIf you do really need someone to texture them, I\u0027d be up for it.\u003C/p\u003E\n"},{"CreatedByName":"SmallFatFetus","CreatedById":137860,"CreatedDateTime":"2015-04-15T01:15:21Z","Content":"\n\u003Cp\u003EBEALE! I SUMMON YE!\u003C/p\u003E\u003Cp\u003EReally like the idea of making a separate launchpad for smaller (1.25m) rockets. you could use kerbinside and branch the pad away from the KSP like this.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/YHe9n5u.jpg\u0022 alt=\u0022YHe9n5u.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis way we can have launch complex 38k and 39k! Maybe one of them can be the tier one pad and then you can unlock the ability to build the next one at the first heavy rocketry node on the tech tree, (where you first get 2.5m parts) Then you can upgrade that so it can support 3.75m\u002B parts. This way the pad that your first Trash-Bin-O-Boom launched on can still be applicable when you\u0027re building a colony on Laythe.\u003C/p\u003E\u003Cp\u003EEDIT: here\u0027s a picture i think you should look at. I really like the red color scheme.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Wd5G537.jpg\u0022 alt=\u0022Wd5G537.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-04-15T19:05:37Z\u0022 title=\u002204/15/2015 07:05  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 15, 2015\u003C/time\u003E by SmallFatFetus\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"AlphaAsh","CreatedById":105348,"CreatedDateTime":"2015-04-15T08:51:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Van Disaster\u0022 data-cite=\u0022Van Disaster\u0022\u003E\u003Cdiv\u003EMight want to be a bit wary of adding something so close to the pad - people love to make wide launchers! looking good so far though. I don\u0027t have time or much motivation to do texture work at the moment, but I might suggest - based on your other point about Kerbinside - that making the Kerbinside textures a little more grimy \u0026amp; shaded would be good texturing practice. If it\u0027s possible anyway, I\u0027ve not looked how they\u0027ve mapped those.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOne texture per material. No UV maps or texture atlases. There was no real benefit to using them. And feel free to re-use any textures from Kerbinside - consider the textures licence free.\u003C/p\u003E\n"},{"CreatedByName":"Budgie","CreatedById":13840,"CreatedDateTime":"2015-04-15T12:32:34Z","Content":"\n\u003Cp\u003EThe extra attention is getting me motivated. College exams are getting really close, but ill give the launchpad abother try if I find a chance!\u003C/p\u003E\n"}]}