{"TopicId":102564,"ForumId":55,"TopicTitle":"Simulator","CreatedByName":"Crusher48","CreatedById":135642,"CreatedDateTime":"2015-03-24T00:39:54Z","PageNum":1,"Articles":[{"CreatedByName":"Crusher48","CreatedById":135642,"CreatedDateTime":"2015-03-24T00:39:54Z","Content":"One thing that bugs me is how you have to send EVERY kerbal you want to train out into space, when real space center does not work that way. In the real space program, astronauts are trained by simulator before even touching a rocket. To simulate (pun not intended) this in Kerbal Space Program, it should be possible to use a simulator to train kerbals up to a level 1 lower than the level of your best-trained kerbal (level 5 kerbals will still require lots of interplanetary voyages). This will obviously cost funds, but less than what a training program involving chucking the kerbals into space and landing them all over the place would cost."},{"CreatedByName":"Rath","CreatedById":138223,"CreatedDateTime":"2015-03-24T04:27:56Z","Content":"They still send the big mission people in to space first: eg all Apollo astronaut hrs had been to orbit before."},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-03-24T04:58:28Z","Content":"\u003E \n\u003E They still send the big mission people in to space first: eg all Apollo astronaut hrs had been to orbit before.\n\nYeah but did they have to plant a flag on Minmus before they could change a tire?"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-03-24T05:03:05Z","Content":"They did train kerbals for them to be astronauts. But this being kerbals, it is not that strange for a kerbal to have to gain some actual experience first before the can change a tire or repair a panel. Remember how a kerbal just open his helmet to get a tool? They are not that smart."},{"CreatedByName":"mattinoz","CreatedById":118580,"CreatedDateTime":"2015-03-24T05:14:18Z","Content":"\u003E \n\u003E Yeah but did they have to plant a flag on Minmus before they could change a tire?\n\nThen Return to Kerbin before learning how to change the tire.\n\nEdit: \n\nNow I know why people are always asking for help to change a tire.\n\nThey\u0027ve never been to Minmus."},{"CreatedByName":"michaelsteele3","CreatedById":127113,"CreatedDateTime":"2015-03-24T16:08:36Z","Content":"I don\u0027t see how applying for a job counts as training. But whatever. They\u0027re kerbals."},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-03-24T16:41:10Z","Content":"\u003E \n\u003E They still send the big mission people in to space first: eg all Apollo astronaut hrs had been to orbit before.\n\nHuh? Some of the Apollo astronauts landed on the Moon on their first flight in space."},{"CreatedByName":"nholzric","CreatedById":7793,"CreatedDateTime":"2015-03-24T17:29:57Z","Content":"Last night I sent six Kerbal newbs to Minmus on a mission to gain experience, tonight they\u0027ll build and man a spacecraft for Eve. Before heading to Minmus I accepted a \u0022Build Base on Minmus\u0022 contract which paid for the trip (the lander had a docking port, power, and antenna and therefore qualified as a base).\n\nSo the requirement of training via experience does the following:\n\n1) Makes Mun, Minmus, and other non-groundbreaking contracts useful in that they can fund training excursions.\n\n2) Sorta gives your \u0022space agency\u0022 a sense of life in that you\u0027re still sending missions to the old places and not concentrating all your resources on the cutting edge destinations. Why have a base on the Mun if you never visit it, well, now there\u0027s a reason to visit it.\n\nBoth of those \u0022features\u0022 feel awfully grindy to me. Yeah, Minmus is awesome and I\u0027m excited to visit it each new game but last night I just wanted to go to Eve.\n\n(Thankfully, and especially since my tech tree is unlocked and there are probe cores to do any fancy SAS features, having experienced Kerbals was not a requirement to go to Eve. Apparently visiting Minmus wasn\u0027t grindy enough for me to skip it because in general I want to level up my Kerbals)"},{"CreatedByName":"Random Tank","CreatedById":104325,"CreatedDateTime":"2015-03-25T10:32:38Z","Content":"\u003E \n\u003E (level 5 kerbals will still require lots of interplanetary voyages).\n\nAs in... One? You can get a Kerbal to level 4 (which is currently max useful level for pilots and engineers) without even going to Duna. Kerbin Orbit -\u003E Mintmus Orbit -\u003E Land on Mintmus -\u003E Solar Orbit -\u003E Mun Orbit (via Kerbin Orbit again) -\u003E Return to Kerbin. That gives them enough XP to reach level 4; if you land on the Mun too, you\u0027ll then be a decent step towards level 5, you could probably just send them to land on Ike and then return them to be Level 5."},{"CreatedByName":"Mr. Scruffy","CreatedById":38540,"CreatedDateTime":"2015-03-25T11:11:20Z","Content":"\u003E \n\u003E One thing that bugs me is how you have to send EVERY kerbal you want to train out into space, when real space center does not work that way. In the real space program, astronauts are trained by simulator before even touching a rocket. To simulate (pun not intended) this in Kerbal Space Program, it should be possible to use a simulator to train kerbals up to a level 1 lower than the level of your best-trained kerbal (level 5 kerbals will still require lots of interplanetary voyages). This will obviously cost funds, but less than what a training program involving chucking the kerbals into space and landing them all over the place would cost.\n\nYes, iÃ‚Â´d like a training center, too."},{"CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2015-03-25T16:21:21Z","Content":"\u003E \n\u003E Huh? Some of the Apollo astronauts landed on the Moon on their first flight in space.\n\nI agree. Not all Apollo astronauts had been in the space program before, but some of the crews had been in other programs before. Gus Grissom was in all three, a shame he never got to land on the Moon... ![:(](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif)"}]}