{"TopicId":102531,"ForumId":21,"TopicTitle":"From Kerbal to Space experiences by a new Kerbal","CreatedByName":"Doodle","CreatedById":139448,"CreatedDateTime":"2015-03-23T14:59:41Z","PageNum":1,"Articles":[{"CreatedByName":"Doodle","CreatedById":139448,"CreatedDateTime":"2015-03-23T14:59:41Z","Content":"\n\u003Cp\u003EHi fellow Kerbals.\u003C/p\u003E\u003Cp\u003EI found this wonderfull game nearly 3 weeks ago and I have to say I really really like it. Even if I still havent seen most of the game yet. I played this game only in Career Mode cause I generally like the feeling that I have to be fund efficient and cant just make huge Insane rockets that cost hundret thousands of credits to send a single satelite into a Kerbin Orbit. So far I havent managed to visit any other planet and have only been to the Mun and Minmus but the next step is close.\u003C/p\u003E\u003Cp\u003EFor Mods I only use 2 Mods. Kerbal Engineer to see my Delta V after I failed way too much in the beginning without it and Kerbal Alarm Clock to be able to launch multiple Satelite Missions and Visits to Mun/Minmus at once without only concentrating on a single mission and wasting days. Currently my Space Programm is still in Year 1 Day 48.\u003C/p\u003E\u003Cp\u003EWith this post I just wanted to share my success so far in this game.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s1205.photobucket.com/user/Der_Doodle/media/KSP/First%20Satelite_zps89ptzijj.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i1205.photobucket.com/albums/bb428/Der_Doodle/KSP/First%20Satelite_zps89ptzijj.png\u0022 alt=\u0022First%20Satelite_zps89ptzijj.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe very first Satelite my Space Programm brought into Orbit (at this point we dont mention that it never fullfilled the contract cause the lack of SAS made me waste all his fuel without managing the correct orbit. \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s1205.photobucket.com/user/Der_Doodle/media/KSP/First%20Mun%20Orbit_zpsbxgs00fk.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i1205.photobucket.com/albums/bb428/Der_Doodle/KSP/First%20Mun%20Orbit_zpsbxgs00fk.png\u0022 alt=\u0022First%20Mun%20Orbit_zpsbxgs00fk.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EMy very first Mun fly-by. Even if the ship was designed to land on the Mun with his Landing Gear the mission got early aborted due to some fuel shortage and Jeb had to travel home without seting his foot on it.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s1205.photobucket.com/user/Der_Doodle/media/KSP/First%20Mun%20Landing_zpsqmgf8pkd.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i1205.photobucket.com/albums/bb428/Der_Doodle/KSP/First%20Mun%20Landing_zpsqmgf8pkd.png\u0022 alt=\u0022First%20Mun%20Landing_zpsqmgf8pkd.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EFinaly Jeb made it to the Mun sadly he did miss his designated landingpoint in the sun by quite abit and used up all the fuel of the bottom stage. But we learned from earlier mistakes about fuel calculations and the lander had a 2nd stage with a small tank and engine that just brought the capsule with Jeb and all those sweet Science Data back home to Kerbal.\u003C/p\u003E\u003Cp\u003EThis was the start of a succesfull Space Programm with many more Missions to follow.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s1205.photobucket.com/user/Der_Doodle/media/KSP/First%205%20Kerbal%20Mun%20Base_zpsnjvjozkj.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i1205.photobucket.com/albums/bb428/Der_Doodle/KSP/First%205%20Kerbal%20Mun%20Base_zpsnjvjozkj.png\u0022 alt=\u0022First%205%20Kerbal%20Mun%20Base_zpsnjvjozkj.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe first 5Kerbal Mun Base the docking port on top was used for a Landercapsule wich Jeb used to get home.\u003C/p\u003E\u003Cp\u003ESince this early start in Baselanding our designed improved:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s1205.photobucket.com/user/Der_Doodle/media/KSP/5%20Kerbal%20Base%20Advanced%20Edition_zpsylkbuxhe.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i1205.photobucket.com/albums/bb428/Der_Doodle/KSP/5%20Kerbal%20Base%20Advanced%20Edition_zpsylkbuxhe.png\u0022 alt=\u00225%20Kerbal%20Base%20Advanced%20Edition_zpsylkbuxhe.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThis is the new 5 Kerbal Base. To reach Mun/Minmus a set of 3 Siderockets with a Probecore each were used that make the transfer and land it safely before decoupling and suicide crashing somewhere away for beauty reasons.\u003C/p\u003E\u003Cp\u003ESadly the contracts for Bases needed bigger and bigger bases so I had to switch to some modular design.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s1205.photobucket.com/user/Der_Doodle/media/KSP/KSC%20Base%20Tests_zpsuchtysr1.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i1205.photobucket.com/albums/bb428/Der_Doodle/KSP/KSC%20Base%20Tests_zpsuchtysr1.png\u0022 alt=\u0022KSC%20Base%20Tests_zpsuchtysr1.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EHere is an early test at the KSC where you can see the Core 17Kerbal Unit, a Lab Unit, a 4 Kerbal Communication Unit, a 5 Kerbal Upgrade attachement (underneath you see the crawler) and a Power Mast.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s1205.photobucket.com/user/Der_Doodle/media/KSP/Mun%20Base%20Beta%2024%20Kerbals_zpshk12ka3p.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i1205.photobucket.com/albums/bb428/Der_Doodle/KSP/Mun%20Base%20Beta%2024%20Kerbals_zpshk12ka3p.png\u0022 alt=\u0022Mun%20Base%20Beta%2024%20Kerbals_zpshk12ka3p.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnd here a Base on the mun build with some earlier versions of this design. On the front Left you see the Sideattached Transfer/Landing Drums I used to get the center piece from Kerbal Orbit to the Mun and on the ground.\u003C/p\u003E\u003Cp\u003EKudos for Temstar at this point where i borrowed and reverse engineered the ideas of the Crawler to move the base pieces around and the idea of the truss pieces to put the base together \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/48876-The-art-of-modular-base-building\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/48876-The-art-of-modular-base-building\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESomewhere at this point we got our first Contract for something outside of Kerbals Sphere of Influence.\u003C/p\u003E\u003Cp\u003EA Solar Satelite sadly we didnt read the fineprint of the contract before accepting it. First time ever leaving Kerbils Sphere of Influence and then making some CLOCKWISE Satelite Orbit.... yeah well this was a dark point for our little Space Programm and this was a contract wich we abandoned after alot of frustration and wasted time/Credits and fuel. To this point I still dont know how to manage it (a 25k DeltaV Ion Powered Satelite failed aswell)\u003C/p\u003E\u003Cp\u003EBut we got another chance to step with out toes (do kerbals have toes? aeh nevermind) outside of Kerbals Sphere of Influence:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s1205.photobucket.com/user/Der_Doodle/media/KSP/First%205%20Kerbal%20Solar%20Station_zpstvuojivu.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i1205.photobucket.com/albums/bb428/Der_Doodle/KSP/First%205%20Kerbal%20Solar%20Station_zpstvuojivu.png\u0022 alt=\u0022First%205%20Kerbal%20Solar%20Station_zpstvuojivu.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EA Contract for a 5 Kerbal Solar Station.\u003C/p\u003E\u003Cp\u003EThe success in this mission gave our ideas some wings for the next non contract funded experimentation part:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s1205.photobucket.com/user/Der_Doodle/media/KSP/Kerbal%20Fuel%20Station_zpszf2dfkph.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i1205.photobucket.com/albums/bb428/Der_Doodle/KSP/Kerbal%20Fuel%20Station_zpszf2dfkph.png\u0022 alt=\u0022Kerbal%20Fuel%20Station_zpszf2dfkph.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnd know we have flying around Kerbal a permanent Space Station with 3 Orange Fuel Tanks (wich are sadly all full and never used so far since attaching them) But even if it is listed as a Refuel Station in Orbit the main use for this Station is its implemented \u003Cstrong\u003EAKRES\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s1205.photobucket.com/user/Der_Doodle/media/KSP/Kerbal%20Fuel%20Station%20AKRES%20closeup_zpskpu8armw.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i1205.photobucket.com/albums/bb428/Der_Doodle/KSP/Kerbal%20Fuel%20Station%20AKRES%20closeup_zpskpu8armw.png\u0022 alt=\u0022Kerbal%20Fuel%20Station%20AKRES%20closeup_zpskpu8armw.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI present the AKRES the Advanced Kerbal Rescue and Evacuation System. It contains 3 automated Escape Pods that can collect helpless Kerbels that fly (for whatever reason) around Kerbal. And if all 3 Pods are used I can just send a new set of 3 up to the station.\u003C/p\u003E\u003Cp\u003ESo far to our current successes. A new manned Mission to Minmus is currently underway to shoot some pictures and since I have currently 4 Visual Contracts for Minmus missions the Mission contains 3 AKRES pods with a pilot each to get those missions done and get save home to Kerbal.\u003C/p\u003E\u003Cp\u003EThe next big goals soon if a Transfer window opens finally will be the first Mission to Duna and Eve (and their moons) but that is still 100 days away. But apart of those Explore Missions I already have a \u00227 Kerbal Base for Ike\u0022 and a \u002211 Kerbal Base on Wheels on Eve\u0022 mission accepted the future will show if my designs will be able to land there.\u003C/p\u003E\u003Cp\u003EOh and before I forget it a picture of the powerhorse that made the bulk of all my funds for my space Programm:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s1205.photobucket.com/user/Der_Doodle/media/KSP/Satelite%20Launcher_zpsqtkpnavy.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i1205.photobucket.com/albums/bb428/Der_Doodle/KSP/Satelite%20Launcher_zpsqtkpnavy.png\u0022 alt=\u0022Satelite%20Launcher_zpsqtkpnavy.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Efor about 13.5k Credits this baby shoots all those nice Satelites into Kerbal/Mun/Minmus Orbit and since it is outfitted with a Probecore in the lifterstage it can deorbit to avoid unneeded litter in space.\u003C/p\u003E\u003Cp\u003EGreetings to all Kerbals out there.\u003C/p\u003E\u003Cp\u003EDoodle\u003C/p\u003E\n"},{"CreatedByName":"Mad Rocket Scientist","CreatedById":139256,"CreatedDateTime":"2015-03-23T19:16:19Z","Content":"\n\u003Cp\u003ENice space program!\u003C/p\u003E\u003Cp\u003EIs that your first mun lander? It\u0027s so compact compared to my first mun lander:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/MyWDBaV.png\u0022 alt=\u0022MyWDBaV.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EOh, and welcome to the forums!\u003C/p\u003E\n"},{"CreatedByName":"Doodle","CreatedById":139448,"CreatedDateTime":"2015-03-24T01:29:29Z","Content":"\n\u003Cp\u003EWell the first Munlander try was a pod, a small tank a 909 Engine and 3 Landing Struts... but that one never tried to land cause of some aeh... fuel issues. \u003C/p\u003E\u003Cp\u003EThe one landed there was my very first one that landed. it hat 2 Science Juniors and 2 Gootanks with it. some fuel with a 909 a decoupler to sent of a small fuel tank with another 909 and the capsule back home to kerbal.\u003C/p\u003E\u003Cp\u003EI try to build small and compact somehow always if possible. I used an upgraded Version of that lander to do some biome hopping with some small refueling in orbit. completet around 10 different biomes that way later on the mun.\u003C/p\u003E\n"},{"CreatedByName":"Master_Evar","CreatedById":98074,"CreatedDateTime":"2015-03-24T06:00:22Z","Content":"\n\u003Cp\u003EI have a tip for you if you want to build really efficient and cheap first stages.\u003C/p\u003E\u003Cp\u003EIf you have any stages on a rocket that only takes them up to 10km-15km, scrap it and put on radially attached jet engines, saves a lot of fuel cost for expensive first stages (may not be recommended for really big crafts, but can still work). Always put them on radially, as they do not turn off very quickly and only take them to 15-20km, afterwards they may fail and you get it probably.\u003C/p\u003E\n"},{"CreatedByName":"Doodle","CreatedById":139448,"CreatedDateTime":"2015-03-24T12:32:40Z","Content":"\n\u003Cp\u003EIsnt that kind of cheesy since the jet engines feel like abusing abug. They use up way to less fuel and their TWR for vertical liftoff compared to rockrets feels plain broken\u003C/p\u003E\u003Cp\u003EAtleast thasts what it feels like\u003C/p\u003E\n"},{"CreatedByName":"Master_Evar","CreatedById":98074,"CreatedDateTime":"2015-03-24T13:52:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Doodle\u0022 data-cite=\u0022Doodle\u0022\u003E\u003Cdiv\u003EIsnt that kind of cheesy since the jet engines feel like abusing abug. They use up way to less fuel and their TWR for vertical liftoff compared to rockrets feels plain broken\u003Cp\u003EAtleast thasts what it feels like\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt does feel a bit broken, but they have very low thrust i feel (it\u0027s the lack of fuel in the launch stage that may make it feel really powerful) and unless you actually abuse them by adding 30 air-intakes to each engine, I am okay with it. They only get you up to 15 km unless you overkill, and overkilling is just a waste of money, since engines still are more expensive than fuel.\u003C/p\u003E\n"},{"CreatedByName":"Doodle","CreatedById":139448,"CreatedDateTime":"2015-04-01T20:33:18Z","Content":"\n\u003Cp\u003EHi fellow Kerbonauts.\u003C/p\u003E\u003Cp\u003EAfter my little space program accomplished a couple of Mun and Minmus Missions all my Kerbals gathered around for a Company BBQ meeting.\u003C/p\u003E\u003Cp\u003EJeb suggested we hold the BBQ on the Mun and the Team went for it. Bill build quickly a Mun capable brazer with his Engineer Department while Bob and his Science Team fixed up a way to actually roast some beef and wieners on the Mun. The Pilot crew meanwhile gathered some Ice Boxes and a couple of Beer cans before the whole Team got shipped up to the Mun.\u003C/p\u003E\u003Cp\u003EAs a Lander the guys quickly fused some tanks and 2 LVN Rockets onto a MK3 passenger Module so everyone could have a nice comfy seat during the flight and the party train went off.\u003C/p\u003E\u003Cp\u003EDuring Final Approach to the Mun with Jeb at the Helm he suddenly realised something...\u003C/p\u003E\u003Cp\u003E\u0022Bill? Bill! Where the hell is the button for the landing gear?!?\u0022\u003C/p\u003E\u003Cp\u003E\u0022aeh Jeb you know aeh we were kind of busy fixing up the brazier for the food so we didnt have the time to fix this lander. We kinda aeh outsorced it to your pilots.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Great... and since they all went into early party mode it seems they did not only forget to attach any kind of landing gear no they even managed that the engines were sticking out at the end so we cant land on the cabin and are forced to use our two LVNs as Landing Legs....\u0022\u003C/p\u003E\u003Cp\u003E.... Well since Jeb was at the Helm all went fine ofcourse and the Mun party went great.\u003C/p\u003E\u003Cp\u003EHere is a little picture of the crew gathered around the improvised Landing Shuttle \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s1205.photobucket.com/user/Der_Doodle/media/KSP/Kerbal%20Holiday%20on%20Mun_zpsanmtrk2j.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i1205.photobucket.com/albums/bb428/Der_Doodle/KSP/Kerbal%20Holiday%20on%20Mun_zpsanmtrk2j.png\u0022 alt=\u0022Kerbal%20Holiday%20on%20Mun_zpsanmtrk2j.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EDuring the BBQ Gene suggested that with Mun and Minmus being explored and reached over a dozen times it would be the time to check out the other Planets in the Kerbol System and he already had a greeeeeat Contract for a Base on Wheels for Eve. He mumbled something like \u0022to infinity and beyond\u0022 but since most of the guys where already slightly drunk noone really remembers what Gene said. Everyone just screamed YEAH to EVE!\u003C/p\u003E\u003Cp\u003EAfter getting back to Kerbal the Design team started to work on an Eve Base.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s1205.photobucket.com/user/Der_Doodle/media/KSP/Eve%20Base%20Test_zpspocee73h.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i1205.photobucket.com/albums/bb428/Der_Doodle/KSP/Eve%20Base%20Test_zpspocee73h.png\u0022 alt=\u0022Eve%20Base%20Test_zpspocee73h.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EOn this Picture you see Dr. Kerbinson who was choosen to lead the expedition making some check ups on the Base with the Lander/Transfer Stage attached to it. A day later Dr. Kerbinson with his Family and a Pilot started their engines and went up into space.\u003C/p\u003E\u003Cp\u003EThis is one of the last pictures made from it before it started its engines to leave its parking orbit around Kerbin.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s1205.photobucket.com/user/Der_Doodle/media/KSP/Eve%20Base_zpsjqyxxczd.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i1205.photobucket.com/albums/bb428/Der_Doodle/KSP/Eve%20Base_zpsjqyxxczd.png\u0022 alt=\u0022Eve%20Base_zpsjqyxxczd.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAfter starting their \u003Cem\u003EHyperdrive\u003C/em\u003E Atomic Engines all Contact to the ship was lost. It seems some sabotage happened and the Base didnt depart from Kerbin with full fuel tanks and their fuel tanker never docked with it on its parking orbit it seems. On the way to Duna all Communications stopped... but we are sure the Base wasnt attacked by Interstellar Space Spiders and all rumours about it are fakes for sure.\u003C/p\u003E\u003Cp\u003EA couple of Days later Bill and Bob discovered something while checking the blueprints of the Eve Base. Even tanked up it seems the mission would have been a failure cause of something Bill called \u0022Launch Windows\u0022 and it would never have enough DeltaV to complete the mission. \u003C/p\u003E\u003Cp\u003EBut well this \u0022Launch Window\u0022 thing deserves some further research\u003C/p\u003E\u003Cp\u003EWhile Bill and his team started to work this out Gene came up with another \u0022great\u0022 Contract. A Base on Ike! So Bob and his guys patched up some designs but after the tragic \u0022accident\u0022 with Dr. Kerbinson noone of Jebs boys was willing to fly blindly to a different planet anymore. So the Ike Base was rebuild into an autopiloted version:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s1205.photobucket.com/user/Der_Doodle/media/KSP/Ike%20Base_zpslxsx0byr.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i1205.photobucket.com/albums/bb428/Der_Doodle/KSP/Ike%20Base_zpslxsx0byr.png\u0022 alt=\u0022Ike%20Base_zpslxsx0byr.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EWell and since the pilots were on a Strike Bob designed a couple of Probes to send out first to the different Planets:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s1205.photobucket.com/user/Der_Doodle/media/KSP/Moho%20Probe_zpsenf3uti7.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i1205.photobucket.com/albums/bb428/Der_Doodle/KSP/Moho%20Probe_zpsenf3uti7.png\u0022 alt=\u0022Moho%20Probe_zpsenf3uti7.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EA Picture of one of the three Moho/Eeloo/Dres Probes on its parking orbit waiting for its Launch Window\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s1205.photobucket.com/user/Der_Doodle/media/KSP/Duna%20Probe_zps9xp9dpvr.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i1205.photobucket.com/albums/bb428/Der_Doodle/KSP/Duna%20Probe_zps9xp9dpvr.png\u0022 alt=\u0022Duna%20Probe_zps9xp9dpvr.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EA Picture of one of the two Probes for Duna and Eve its parking orbit waiting for its Launch Window (notice the double Probe design with only the top probe having Parachutes)\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s1205.photobucket.com/user/Der_Doodle/media/KSP/Jool%20Probe2_zpsdmq2g34x.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i1205.photobucket.com/albums/bb428/Der_Doodle/KSP/Jool%20Probe2_zpsdmq2g34x.png\u0022 alt=\u0022Jool%20Probe2_zpsdmq2g34x.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnd the Jool Probe with 5 Satelites on top (2x Interplanetary Lander Xenon Edition, 2x Interplanetary Lander XL and 1 Interplanetary Lander Parachute Edition in the middle) and 2 Backup Probes on the sides.\u003C/p\u003E\u003Cp\u003EWell it is now Day 68 of the 1st Year of the Space Programm and we are awaiting our first Launch Windows hopefully soon.\u003C/p\u003E\n"},{"CreatedByName":"ExplorerKlatt","CreatedById":107424,"CreatedDateTime":"2015-04-01T21:16:41Z","Content":"\n\u003Cp\u003EThis is a great read but sounds like it belongs in the mission reports forum.\u003C/p\u003E\n"}]}