{"TopicId":102575,"ForumId":44,"TopicTitle":"Deflector shields.. sorta","CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2015-03-24T03:45:19Z","PageNum":1,"Articles":[{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2015-03-24T03:45:19Z","Content":"No, they won\u0027t shield anyone from bullets, but this is still really cool.\n\n**Aircraft and military manufacturer Boeing has been granted a patent on a system that is designed to prevent explosion shock-waves from harming a target.**\n\n[http://www.cnet.com/news/boeing-patents-star-wars-style-force-fields/](https://www.cnet.com/news/boeing-patents-star-wars-style-force-fields/)"},{"CreatedByName":"Sampa","CreatedById":130079,"CreatedDateTime":"2015-03-24T04:01:41Z","Content":"That...is...AWESOME!!!!!!!"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-03-24T04:32:59Z","Content":"I like this tidbit:\n\n\u0022Because this system heats and ionises the air, it is eminently unsuitable for enveloping a target and being held in place for any length of time. That kind of force field is technically feasible -- physics students last year determined that an electromagnetic field could by used to hold a plasma shield in place -- but it would likely also deflect light, leaving anyone inside blind as a bat.\u0022\n\nNot a lot of scifi shows force field shield blocking laser *and* light, even the two things are not so different. It would makes space battle much more interesting: Block enemies attack, but goes blind at the same time? Tactical decisions..."},{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2015-03-24T04:51:58Z","Content":"\u003E \n\u003E I like this tidbit:Not a lot of scifi shows force field shield blocking laser *and* light, even the two things are not so different. It would makes space battle much more interesting: Block enemies attack, but goes blind at the same time? Tactical decisions...\n\nI think technically they do. The point is though, just as in the IRL counterpart here, the shields only \u0027react\u0027 when they need to. So when a shot is blocked, you lose visibility, but only for that finite moment in time."},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-03-24T05:10:17Z","Content":"Why haven\u0027t any shows try showing tactics using that fact. DX Shower frontal shield with low power shots to block visibility for tactical maneuvers! And i think this apply more to smaller crafts rather than big crafts with likely better sensors that does not relies on visual confirmation."},{"CreatedByName":"Newt","CreatedById":131025,"CreatedDateTime":"2015-03-24T05:33:05Z","Content":"\u003E \n\u003E I think technically they do. The point is though, just as in the IRL counterpart here, the shields only \u0027react\u0027 when they need to. So when a shot is blocked, you lose visibility, but only for that finite moment in time.\n\nOr only to that particular wavelength. If your enemy ship blasts you with an x-ray laser, only, your shields can be set up to block x-rays, only. Of course, as this currently stands, Such specificity might be impractical.\n\nAs for the Boeing design, fascinating indeed. It does not seem so much like a deflector shield from Star Trek/Wars (as I have understood them), in that it essentially detects and responds to a shock wave (some of the exact means to do this listed are interesting.... firing lasers, shooting electric arcs) to reduce it, rather then acting as a sort of passively present barrier. I wonder what in and when and whether this shall be used anytime soon.\n\n It seems (I know little of Boeing\u0027s patent application policies, admittedly), that it may just be that some engineers thought it would be possible, did an analysis, patented it, and now will keep it available for future use when it becomes more practical and the company sees an interest. I hope they are making something."},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2015-03-24T08:12:51Z","Content":"Next in line...Lightsabers!"},{"CreatedByName":"Tommygun","CreatedById":41293,"CreatedDateTime":"2015-03-24T08:26:04Z","Content":"Unless I\u0027m not understanding this, it will only work inside an atmosphere.\n\nIt almost sounds like they are artificially creating something a little bit like an atmospheric inversion layer in the air?"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-03-24T08:44:02Z","Content":"From what I understand, they are just creating changes in the medium (in this case, air) in which a shockwave travel to disrupt it and preventing it from delivering the full impact to nearby objects and damage them. Probably works along with existing active protection system on vehicles that are used against RPGs and the like which detonate them a short distance away from the vehicle, and the shockwave can still damage the occupants or other more sensitive parts of the vehicles. This will prevent the shockwave from reaching them in harmful level.\n\n**Edited \u003Ctime datetime=\u00222015-03-24T10:02:09Z\u0022 title=\u002203/24/2015 10:02  AM\u0022 data-short=\u00229 yr\u0022\u003EMarch 24, 2015\u003C/time\u003E by RainDreamer**"},{"CreatedByName":"J.Random","CreatedById":63332,"CreatedDateTime":"2015-03-24T09:10:39Z","Content":"Looks like a load of bull to me. They may just as well sprinkle water into explosion\u0027s general direction. I don\u0027t see how ionized (over very brief period between close explosion detection and wave hitting the vehicle) air may counter that much energy.\n\nOr simply use shaped charges to create counter-propagating shock wave."},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-03-24T09:14:47Z","Content":"\\*shrug\\* it is a patent. They are just saying \u0022I got dibs\u0022 on a concept that they may or may not develop further."},{"CreatedByName":"Tommygun","CreatedById":41293,"CreatedDateTime":"2015-03-24T09:42:49Z","Content":"Now that I think about it, a few years back there was a company that was trying to promote a duel laser device for nonlethal crowd control.\n\nI think the two lasers fired at different frequencies in such a way that they created a pyrotechnical display (Induced Plasma) in the air.\n\nSo the technique isn\u0027t that new, they are just tweaking it and using it in a new way and purpose.\n\n[http://www.navysbir.com/n11_3/N113-171.htm](http://www.navysbir.com/n11_3/N113-171.htm)"},{"CreatedByName":"Darnok","CreatedById":85708,"CreatedDateTime":"2015-03-24T10:15:28Z","Content":"Something that can be used as radiation shield from solar flares for Orion like crafts?"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-03-24T10:19:50Z","Content":"\u003E \n\u003E Why haven\u0027t any shows try showing tactics using that fact. DX Shower frontal shield with low power shots to block visibility for tactical maneuvers! And i think this apply more to smaller crafts rather than big crafts with likely better sensors that does not relies on visual confirmation.\n\nI think in Star Trek, laser weapons are useless against starships due to the hull plating, but phasers can do damage, and shields protect against that. Of course, that\u0027s just Star Trek, no real bearing on reality."},{"CreatedByName":"dryer_lint","CreatedById":162541,"CreatedDateTime":"2015-03-24T10:31:31Z","Content":"I have to say it.\n\nThe comments on that article are the best part."},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2015-03-24T11:10:35Z","Content":"\u003E \n\u003E Something that can be used as radiation shield from solar flares for Orion like crafts?\n\nIt would require a lot of energy. I doubt solar panels, RTG\u0027s and fuel cells are up to the task right now. Maybe when we get lightweight nuclear reactors for spaceships..."},{"CreatedByName":"Darnok","CreatedById":85708,"CreatedDateTime":"2015-03-24T12:15:39Z","Content":"Could it be also used as nuclear power plant shielding for better safety, anti-nuke bunkers, protection from NERVA engines radiation, Moon/Mars bases shield, drones shielding, so laser won\u0027t shutdown its system?\n\nEnergy consuption when nuclear reactors are close shouldn\u0027t be a problem ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)"},{"CreatedByName":"J.Random","CreatedById":63332,"CreatedDateTime":"2015-03-24T12:29:56Z","Content":"I\u0027m kinda amazed both by this thread and comments on original article.\n\nWhat\u0027s patented: creating an area of hot ionized air to reduce the concussive capabilities of the blast wave (the BOOM part of the explosion, only it moves faster than the BOOM you hear and may make you into a jelly).\n\nWhat people think is patented: magic shield stopping bullets, rockets, lazers, nuclear radiation, solar flares and asteroids.\n\n**Edited \u003Ctime datetime=\u00222015-03-24T12:32:42Z\u0022 title=\u002203/24/2015 12:32  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 24, 2015\u003C/time\u003E by J.Random**"},{"CreatedByName":"Darnok","CreatedById":85708,"CreatedDateTime":"2015-03-24T12:40:00Z","Content":"\u003E \n\u003E I\u0027m kinda amazed both by this thread and comments on original article.\n\u003E What\u0027s patented: creating an area of hot ionized air to reduce the concussive capabilities of the blast wave (the BOOM part of the explosion, only it moves faster than the BOOM you hear and may make you into a jelly).\n\u003E \n\u003E What people think is patented: magic shield stopping bullets, rockets, lazers, nuclear radiation, solar flares and asteroids.\n\nI am just asking questions ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif) and never said I think it is going to stop bullets."},{"CreatedByName":"InterCity","CreatedById":98462,"CreatedDateTime":"2015-03-24T13:28:46Z","Content":"We have laser guns.\n\nWe have shields.\n\nWe just need a warp drive."},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2015-03-24T14:18:25Z","Content":"Looks like someone forgot about Newton\u0027s third law. For every action there\u0027s an opposite reaction.\n\nIf you act with a force on a shield, the shield will react with the equal and opposite force to you. That means that even if you aren\u0027t sprinkled by blast particles, you will get kicked into the air like a ragdoll.\n\nSounds like crap to me, and news designed for people whose only \u0022scientific\u0022 knowledge comes from SF movies."},{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2015-03-24T15:05:22Z","Content":"\u003E \n\u003E I\u0027m kinda amazed both by this thread -- \n\u003E --What people think is patented: magic shield stopping bullets, rockets, lazers, nuclear radiation, solar flares and asteroids.\n\nI kinda mentioned in the first post that it CAN\u0027T do that.\n\nConcept might be usable to protect against radiation, but the power required to have it constantly \u0022on\u0022 would probably be insane.\n\n\u003E \n\u003E I think the two lasers fired at different frequencies in such a way that they created a pyrotechnical display (Induced Plasma) in the air. So the technique isn\u0027t that new, they are just tweaking it and using it in a new way and purpose.\n\nThey\u0027re using a similar concept to project \u0027Star Wars\u0027 holograms. Vastly improved now too. The initial prototype for this made more noise than a Jacob\u0027s Ladder.\n\n[http://www.bitrebels.com/technology/real-hologram-mid-air-projection/](http://www.bitrebels.com/technology/real-hologram-mid-air-projection/)\n\n**Edited \u003Ctime datetime=\u00222015-03-24T15:10:49Z\u0022 title=\u002203/24/2015 03:10  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 24, 2015\u003C/time\u003E by vger**"},{"CreatedByName":"Hcube","CreatedById":137241,"CreatedDateTime":"2015-03-24T15:28:41Z","Content":"\u003E \n\u003E Looks like someone forgot about Newton\u0027s third law. For every action there\u0027s an opposite reaction.\n\u003E If you act with a force on a shield, the shield will react with the equal and opposite force to you. That means that even if you aren\u0027t sprinkled by blast particles, you will get kicked into the air like a ragdoll.\n\u003E \n\u003E Sounds like crap to me, and news designed for people whose only \u0022scientific\u0022 knowledge comes from SF movies.\n\nIm not sure to agree with you : i don\u0027t think that Newton\u0027s 3rd law is involved here.\n\nWhat the \u0022shield\u0022 does is emit laser beams (no 3rd law, no recoil) in order to change the characteristics of the air near the vehicule. So what will happen is the air will have different temperature, pression, molecular composition (maybe the plasma could turn some O2 into O3 (ozone) for example, i\u0027m not sure).\n\nWhat happens next is that the shockwaves propagates in a different way inside this sphere of \u0022different\u0022 air. The shockwaves can be reflected and refracted just like other kind of waves do, such as light or waves in water. This creates no recoil... (or does it? if anyone is an expert in this kind of physics please explain us what you know)\n\nHowever it is highly unlikely that a shockwave will be reflected, and it will probably be refracted and change its course slightly or something like that. I still wouldn\u0027t like to be inside that humvee ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif) ."},{"CreatedByName":"linkxsc","CreatedById":67350,"CreatedDateTime":"2015-03-24T15:32:12Z","Content":"\u003E \n\u003E Looks like someone forgot about Newton\u0027s third law. For every action there\u0027s an opposite reaction.\n\u003E If you act with a force on a shield, the shield will react with the equal and opposite force to you. That means that even if you aren\u0027t sprinkled by blast particles, you will get kicked into the air like a ragdoll.\n\u003E \n\u003E Sounds like crap to me, and news designed for people whose only \u0022scientific\u0022 knowledge comes from SF movies.\n\nActually it would probably be more like a small explosion next to your vehicle, that while transferring energy to what you\u0027re protecting, it interferes with the incoming blastwave.\n\nYou probably end up getting hit with the whole blastwave nonetheless, but not all at the same time, spreading the force out over a time. Similar to recoil systems in big guns."},{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2015-03-24T15:48:45Z","Content":"\u003E \n\u003E However it is highly unlikely that a shockwave will be reflected, and it will probably be refracted and change its course slightly or something like that. I still wouldn\u0027t like to be inside that humvee ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif) .\n\nIf you think about it, this is how all armor has worked since the beginning of history. It doesn\u0027t negate the energy, it just redistributes it. Instead of a focused point of impact, the energy is spread out more evenly.\n\n**Edited \u003Ctime datetime=\u00222015-03-24T15:50:47Z\u0022 title=\u002203/24/2015 03:50  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 24, 2015\u003C/time\u003E by vger**"}]}