{"TopicId":102649,"ForumId":44,"TopicTitle":"So, you have a plane on a conveyor belt...","CreatedByName":"Randazzo","CreatedById":136468,"CreatedDateTime":"2015-03-25T01:29:14Z","PageNum":15,"Articles":[{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2018-05-22T02:50:11Z","Content":"\u003E \n\u003E \n\u003E 6 hours ago, sevenperforce said:\n\u003E \n\u003E \n\u003E What I\u0027m taking issue with is the feedback loop in the conveyor belt\u0027s programming. You have to define what the conveyor belt is attempting to do in order to figure out what is going to happen.\n\u003E \n\nA PID loop on position of the plane OR wheel speed will result in constraints I\u0027ve given within reasonable error.\n\nYou need to keep in mind that what you really have direct control over is torque applied to the belt\u0027s driving axles, not the speed. So this is inherently a second order differential, which is exactly what PID is designed to deal with. And any errors that build up in PID loop decay exponentially, so long as parameters are correctly tuned.\n\n\u003E \n\u003E \n\u003E 1 hour ago, Mad Rocket Scientist said:\n\u003E \n\u003E \n\u003E It seems like part of it is confusion over acceleration and speed, and how the belt exerts backwards force on the plane both as a constant, tiny friction due to speed, and a greater backwards impulse that only occurs when the belt accelerates (I think). However, the thrust from the engines is always a constant acceleration, meaning that the belt must continuously and rapidly accelerate if it wants to overcome the acceleration of the engines.\n\u003E \n\nCorrect on all points. The caveat I\u0027m trying to point out is that all of this applies to a car on the belt as well. The \u0022thrust\u0022 output of car\u0027s engine does drop off with wheel speed, and there is an upper limit in theory, but it\u0027s way beyond the red line. Since a car is designed to overcome significant air resistance at cruising speeds, which isn\u0027t going to be present in the belt setup, it will still take an accelerating belt to keep a car in place if the driver is gunning it, and either the RPM limiter will kick in or something will mechanically fail long before this system reaches any sort of a steady state.\n\nSo for both a gas engine car and an airplane, if full throttle is applied, unless the belt constantly and very rapidly accelerates, the vehicle will be able to move forward. And if the belt does accelerate, within seconds mechanical limits of either vehicle will be exceeded.\n\nElectric cars are a more interesting case, as their motor speed is inherently limited by battery voltage, and their top no-load RPM tends to be at much more reasonable speeds. You probably could keep something like a Nisan Leaf on a belt/dynamo with the driver pressing accelerator into the floor without anything breaking."},{"CreatedByName":"sevenperforce","CreatedById":157695,"CreatedDateTime":"2018-05-22T14:10:50Z","Content":"\u003E \n\u003E \n\u003E 11 hours ago, K^2 said:\n\u003E \n\u003E \n\u003E A PID loop on position of the plane OR wheel speed will result in constraints I\u0027ve given within reasonable error.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E You need to keep in mind that what you really have direct control over is torque applied to the belt\u0027s driving axles, not the speed. So this is inherently a second order differential, which is exactly what PID is designed to deal with. And any errors that build up in PID loop decay exponentially, so long as parameters are correctly tuned.\n\u003E \n\nSo what is the programming?\n\n1 Get(VehiclePosition);  \n\n2 IF (VehiclePosition \u003E 0) BeltTorque\u002B\u002B;  \n\n3 ELSE IF (VehiclePosition \u003C 0) BeltTorque--;  \n\n4 GOTO 1"},{"CreatedByName":"Kartoffelkuchen","CreatedById":108501,"CreatedDateTime":"2018-05-22T14:34:57Z","Content":"\u003E \n\u003E \n\u003E 25 minutes ago, sevenperforce said:\n\u003E \n\u003E \n\u003E So what is the programming?\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E 1 Get(VehiclePosition);  \n\u003E \n\u003E 2 IF (VehiclePosition \u003E 0) BeltTorque\u002B\u002B;  \n\u003E \n\u003E 3 ELSE IF (VehiclePosition \u003C 0) BeltTorque--;  \n\u003E \n\u003E 4 GOTO 1\n\u003E \n\nNah, that would lead to loads of over- and undershooting, making the thing incredible unstable until it will just stop working eventually.\n\nYou\u0027d use a PID as [@K^2](https://forum.kerbalspaceprogram.com/index.php?/profile/57710-k2/) described to adjust the speed of the belt. It would work like this: The P (proportional) measures the distance of the plane to its \u0022target\u0022 position, like if it moves half a meter behind it\u0027s target, p will equal -0.5. D, derivative, measures the speed at which the plane is moving away from its target, and finally, I, integral, measures the error over time of the plane to its target position. For the last step, you\u0027d multiply P, I and D with unique constants to balance them and then add P, I and D together to get an output value for the belt. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022)\n\n**Edited \u003Ctime datetime=\u00222018-05-22T14:36:09Z\u0022 title=\u002205/22/2018 02:36  PM\u0022 data-short=\u00226 yr\u0022\u003EMay 22, 2018\u003C/time\u003E by Kartoffelkuchen**"},{"CreatedByName":"sevenperforce","CreatedById":157695,"CreatedDateTime":"2018-05-22T17:13:02Z","Content":"\u003E \n\u003E \n\u003E 20 minutes ago, Kartoffelkuchen said:\n\u003E \n\u003E \n\u003E Nah, that would lead to loads of over- and undershooting, making the thing incredible unstable until it will just stop working eventually.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E You\u0027d use a PID as [@K^2](https://forum.kerbalspaceprogram.com/index.php?/profile/57710-k2/) described to adjust the speed of the belt. It would work like this: The P (proportional) measures the distance of the plane to its \u0022target\u0022 position, like if it moves half a meter behind it\u0027s target, p will equal -0.5. D, derivative, measures the speed at which the plane is moving away from its target, and finally, I, integral, measures the error over time of the plane to its target position. For the last step, you\u0027d multiply P, I and D with unique constants to balance them and then add P, I and D together to get an output value for the belt. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022)\n\u003E \n\nSure.\n\nWith a car on a treadmill, it is a battle between the torque in the belt gearing and the torque in the vehicle transmission. The wheels are geared to the vehicle transmission; if the vehicle transmission cannot keep up with the rotation rate of the belt. With a plane on a treadmill, the wheels are decoupled and so it is a battle between wheel inertia and the belt gearing.\n\nIf the materials and components in the belt are anywhere close to the materials and components in the wheels, then the belt will fail before the wheels do."},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2018-05-22T20:25:15Z","Content":"\u003E \n\u003E \n\u003E 3 hours ago, sevenperforce said:\n\u003E \n\u003E \n\u003E If the materials and components in the belt are anywhere close to the materials and components in the wheels, then the belt will fail before the wheels do.\n\u003E \n\nWho says that it needs to be the same materials? The wheels usually fail due to overheating and centrifugal stress on the tires. In this setup, nothing is stopping us from using a kevlar belt running over titanium drums. That stuff can get to mach 1 before there is a problem. And I\u0027d probably use linac drive to just pull on the surface of the belt, since this whole thing just needs a few seconds of operation before the plane is completely destroyed."},{"CreatedByName":"Reactordrone","CreatedById":110060,"CreatedDateTime":"2018-05-22T20:47:00Z","Content":"\u003E \n\u003E \n\u003E 18 minutes ago, K^2 said:\n\u003E \n\u003E \n\u003E Who says that it needs to be the same materials? The wheels usually fail due to overheating and centrifugal stress on the tires. In this setup, nothing is stopping us from using a kevlar belt running over titanium drums. That stuff can get to mach 1 before there is a problem. And I\u0027d probably use linac drive to just pull on the surface of the belt, since this whole thing just needs a few seconds of operation before the plane is completely destroyed.\n\u003E \n\nIn that case we can also optimise the aircraft parts to avoid destruction and make them more like frictionless skids."},{"CreatedByName":"sevenperforce","CreatedById":157695,"CreatedDateTime":"2018-05-22T21:26:25Z","Content":"Come to think of it, once the wheels spin up high enough, they\u0027re going to have trouble maintaining traction. I bet traction fails before the wheels do, and at a high spin rate they\u0027ll have a different coefficient of friction than if they were braked and skidding."},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2018-05-22T21:44:17Z","Content":"\u003E \n\u003E \n\u003E 6 minutes ago, sevenperforce said:\n\u003E \n\u003E \n\u003E Come to think of it, once the wheels spin up high enough, they\u0027re going to have trouble maintaining traction. I bet traction fails before the wheels do, and at a high spin rate they\u0027ll have a different coefficient of friction than if they were braked and skidding.\n\u003E \n\nThat\u0027s called making stuff up. There is absolutely nothing in the physics of a tire that allows for a *significant* reduction of traction at high speeds, until you start to experience *equally significant* deformations, which leads to failure under load pretty much instantly. If anything, heating up the tires will slightly improve traction.\n\nThe reason aircraft have lower traction at high speeds is due to air speed, which reduces loading factor on the landing gear, and traction is always proportional to load. Stationary plane on a conveyor belt will experience no such reduction in traction.\n\n[@Reactordrone](https://forum.kerbalspaceprogram.com/index.php?/profile/110060-reactordrone/) Yes, skids are a different story. They experience an almost constant friction regardless of speed, which a plane at full thrust should be able to overcome. They have a whole lot of other problems when used as landing gear for an airplane, but none of them are relevant to this particular question. So if we are talking a plane on skids on a conveyor belt, it\u0027s definitely impossible to keep it fixed in place by varying speed of the belt. Still possible to destroy it, though, as heat generated by friction is still proportional to the relative speed of the surfaces."},{"CreatedByName":"sevenperforce","CreatedById":157695,"CreatedDateTime":"2018-05-22T22:41:59Z","Content":"\u003E \n\u003E \n\u003E 53 minutes ago, K^2 said:\n\u003E \n\u003E \n\u003E \u003E \n\u003E \u003E \n\u003E \u003E 1 hour ago, sevenperforce said:\n\u003E \u003E \n\u003E \u003E \n\u003E \u003E Come to think of it, once the wheels spin up high enough, they\u0027re going to have trouble maintaining traction. I bet traction fails before the wheels do, and at a high spin rate they\u0027ll have a different coefficient of friction than if they were braked and skidding.\n\u003E \u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E That\u0027s called making stuff up. There is absolutely nothing in the physics of a tire that allows for a *significant* reduction of traction at high speeds, until you start to experience *equally significant* deformations, which leads to failure under load pretty much instantly. If anything, heating up the tires will slightly improve traction.\n\u003E \n\nIf you\u0027re driving a car on a treadmill, rolling resistance losses sap from the engine and require a greater power output. Rolling resistance losses for free-rolling wheels, as with an airplane, are going to contribute to slippage, which robs the belt of its ability to slow the airplane.\n\n\u003E \n\u003E \n\u003E 53 minutes ago, K^2 said:\n\u003E \n\u003E \n\u003E The reason aircraft have lower traction at high speeds is due to air speed, which reduces loading factor on the landing gear...\n\u003E \n\nObviously."},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2018-05-23T00:31:13Z","Content":"\u003E \n\u003E \n\u003E 1 hour ago, sevenperforce said:\n\u003E \n\u003E \n\u003E If you\u0027re driving a car on a treadmill, rolling resistance losses sap from the engine and require a greater power output. Rolling resistance losses for free-rolling wheels, as with an airplane, are going to contribute to slippage, which robs the belt of its ability to slow the airplane.\n\u003E \n\nThat\u0027s not how it works. That\u0027s not how any of it works. Rolling resistance in landing gear is low enough that a human being can pull an airliner. Compare that with traction, which is roughly equal to airplane\u0027s weight. More importantly, rolling resistance doesn\u0027t really increase with speed by any significant amount. It just isn\u0027t a factor. We can take wheels to be frictionless, and it will be a fair approximation.\n\nThe only reason the belt can apply a significant force on the plane, is because wheels are not massless, and making them turn requires energy. That energy has to come from work done by plane, conveyor belt, or some linear combination (as usual, depending on your choice of coordinate system). Either way, it means that there is a force applied by the belt on the aircraft, and that force is directly proportional to acceleration, as previously derived in this thread.\n\nFor a car, you have added rotational inertia of the transmission and the engine. That can be rolled into the moment of inertia I, so that doesn\u0027t really change the physics, but does dramatically reduce acceleration of the belt required to keep the car put. In addition, there are viscous forces in the engine associated with air movement through manifolds. This is why a car is capable of engine-braking. As well as reduction in engine efficiency at high RPMs. This further makes it easier for the belt to keep the car in place at higher speeds, but the car on the belt easily exceeds maximum RPM for both the engine and the tires.\n\nSo we are still back to the situation where there is no qualitative difference between vehicles placed on the belt. The critical factor remains the amount of mass that has to be turning for the vehicle to roll forward. It\u0027s pretty small, but not insignificant, for an airplane, and much higher for a car. And that\u0027s that."},{"CreatedByName":"MaverickSawyer","CreatedById":11952,"CreatedDateTime":"2018-05-23T01:12:01Z","Content":"Gut feeling, based on my experiences with actual aircraft ground handling: You\u0027ll be able to take off, albeit it\u0027ll take a bit longer to break ground due to the need to overcome the slightly increased drag on the wheels and the fact that the aircraft will probably have to stop its rearward motion first. But, if you\u0027ve ever been around any sort of airplane, you\u0027ll know that it doesn\u0027t take much throttle to keep you rolling once you actually get going, if any. Breakaway thrust, though, is another matter altogether, but that\u0027s brief.\n\nNext time you go near an airport, watch and listen closely to taxiing aircraft. You\u0027ll hear them throttle up some to get rolling, but then almost immediately throttle back down to near idle to taxi."},{"CreatedByName":"Gargamel","CreatedById":64714,"CreatedDateTime":"2018-05-23T08:22:58Z","Content":"\u003E \n\u003E \n\u003E On 5/21/2018 at 9:58 AM, mrfox said:\n\u003E \n\u003E \n\u003E ![4f6251871c224.image.jpg](https://bloximages.chicago2.vip.townnews.com/nwitimes.com/content/tncms/assets/v3/editorial/a/ee/aee9632d-1787-5ae3-bd9e-f5479938c216/4f6251871c224.image.jpg)\n\u003E \n\u003E \n\u003E \n\u003E The effect would have been even better had they had some sort of speed indication for the turntable, plane and car wheels, and forward ground/airspeeds for the vehicles, but nevertheless a fun museum exhibit (photo lifted from newspaper article)\n\u003E \n\nHey, I remember seeing this exhibit at a museum before. \n\nYeah, it basically proves you can take off from a treadmill.   When the engine is off, the treadmill is going pretty fast, and the plane is going backwards.  Then you start the engine, the planes gathers forward speed and eventually takes off."},{"CreatedByName":"sevenperforce","CreatedById":157695,"CreatedDateTime":"2018-05-23T13:02:56Z","Content":"\u003E \n\u003E \n\u003E 11 hours ago, K^2 said:\n\u003E \n\u003E \n\u003E Rolling resistance in landing gear is low enough that a human being can pull an airliner.\n\u003E \n\nAt low speeds, yes.\n\n\u003E \n\u003E \n\u003E 11 hours ago, K^2 said:\n\u003E \n\u003E \n\u003E Compare that with traction, which is roughly equal to airplane\u0027s weight. More importantly, rolling resistance doesn\u0027t really increase with speed by any significant amount. It just isn\u0027t a factor.\n\u003E \n\nBut that simply isn\u0027t true. Rolling resistance includes hysteresis, wheel bearing resistance, vibration/oscillation losses, and wheel slippage. Of these, only wheel bearing resistance is *not* a function of RPM. Wheel slippage increases as a second-order effect of velocity due to the increase in hysteresis and vibration/oscillation.\n\nThe faster the wheels (and the belt) are spinning, the more total rolling resistance you will have.\n\n\u003E \n\u003E \n\u003E 11 hours ago, K^2 said:\n\u003E \n\u003E \n\u003E For a car, you have added rotational inertia of the transmission and the engine. That can be rolled into the moment of inertia I, so that doesn\u0027t really change the physics, but does dramatically reduce acceleration of the belt required to keep the car put. In addition, there are viscous forces in the engine associated with air movement through manifolds. This is why a car is capable of engine-braking. As well as reduction in engine efficiency at high RPMs. This further makes it easier for the belt to keep the car in place at higher speeds, but the car on the belt easily exceeds maximum RPM for both the engine and the tires.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E So we are still back to the situation where there is no qualitative difference between vehicles placed on the belt. The critical factor remains the amount of mass that has to be turning for the vehicle to roll forward. It\u0027s pretty small, but not insignificant, for an airplane, and much higher for a car. And that\u0027s that.\n\u003E \n\nBut there *is* a qualitative difference between the vehicles placed on the belt.\n\nIf you have a car on a belt, then the car\u0027s engine is using the transmission and wheels to exert a force on the belt in order to push the car forward against the rearward travel of the belt. Traction losses and rolling resistance reduce the engine\u0027s ability to fight the belt.\n\nIf you have a plane on a belt, then the belt is using the plane\u0027s wheel inertia to exert a force on the plane in order to push the plane backward against the forward travel produced by its engines. Traction losses and rolling resistance reduce the *belt\u0027s* ability to fight the engines.\n\nThat is the qualitative difference."},{"CreatedByName":"p1t1o","CreatedById":74091,"CreatedDateTime":"2018-05-23T15:31:07Z","Content":"I hate this question so much. Not the \u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E, nor the people having intelligent discussion. But I hate the question and questions like it.\n\nThe conveyor is merely a source of resistance to movement, and since its not a physical object, it can have properties such as arbitrary speed without any limitations.\n\nThe fact that the question usually says something like it \u0022matching\u0022 the \u0022speed\u0022 of the wheels is moot, effectively its a source of friction that can be scaled to any amount.\n\nIf the conveyor is moving a shade under the speed of light backwards, no, no plane will be able to successfully take off.\n\nIf the conveyor is moving backwards at only a few cm/s than off course the plane can take off.\n\nObviously there is a turning point at which the speed of the conveyor completely precludes its use as a runway.\n\nWhether or not the conveyor running at \u0022the speed of the planes wheels\u0022 is before or after this limit is just a case of knowing the values of the various physical characteristics of the system, like friction coefficients of all the various wheel-and-axle components, the surface of the conveyor etc.\n\nIt is possible to construct cases which match the question, and match both versions of the answer \u0022yes it will\u0022 and \u0022no it cant\u0022. But it \u003Cu\u003E\u003Cem\u003E\u003Cstrong\u003Esounds \u003C/strong\u003E\u003C/em\u003E\u003C/u\u003Elike there should be a definite and single answer, hence its possible for the discussion to go on to infinity.\n\nSo the next time someone smugly asks this, just challenge them \u0022You KNOW this question is unanswerable without knowing the coefficient of friction in the planes main wheel and nosewheel bearings,...and you havnt even told us what the conveyor is made of and what its power limitations are! Stop asking silly questions and get your facts straight! What is the static and dynamic thrust curve of the engines? What is the breakaway resistance?\u0022\n\n**Edited \u003Ctime datetime=\u00222018-05-23T15:32:39Z\u0022 title=\u002205/23/2018 03:32  PM\u0022 data-short=\u00226 yr\u0022\u003EMay 23, 2018\u003C/time\u003E by p1t1o**"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2018-05-23T17:00:16Z","Content":"There are much cheaper ways to destroy airplanes."},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2018-05-23T19:47:12Z","Content":"\u003E \n\u003E \n\u003E 6 hours ago, sevenperforce said:\n\u003E \n\u003E \n\u003E If you have a plane on a belt, then the belt is using the plane\u0027s wheel inertia to exert a force on the plane in order to push the plane backward against the forward travel produced by its engines. Traction losses and rolling resistance reduce the *belt\u0027s* ability to fight the engines.\n\u003E \n\nAll of these factors make it easier to pull the plane back. Think what happens if you apply brakes on a plane that\u0027s already sitting on top of a moving treadmill. Does the plane go forward or backward as a result?\n\nYou keep making up arguments, but it sounds like you have not taken the time to draw force diagrams and consider refernce frames. You have to be able to do this to analyze dynamics of a system. This problem is good practice.\n\nAccelerating belt can keep in place a plane at full throttle EVEN if wheels are frictionless. Friction makes it a LOT EASIER. If full brakes are applied, treadmill doesn\u0027t even need to move.\n\nUnder your analysis, applying brakes should be part of takeoff procedure, as it reduces ground\u0027s ability to slow down the plane.\n\nIf your analysis fails trivially under a change of coordinate system, you made a misstake. Always check.\n\nA car has more sources of drag and higher moment of inertia attached to wheels. That makes it easier for the belt, but that is the definition of quantitative difference.\n\nFinally, while there are always non-constant sources of friction, for landing gear, they just aren\u0027t significant enough to consider at speeds it can possibly reach before failing. Otherwise, planes would have a lot of trouble taking off. If rolling resistance increased significantly, as load decreases, wheels would fail to roll during large chunk of takeoff, that means dragging the gear on every takeoff. The wear would make next landing hazardous. So landing gear is designed to have minimal folling resistance in wide range of speeds."},{"CreatedByName":"sevenperforce","CreatedById":157695,"CreatedDateTime":"2018-05-23T20:31:25Z","Content":"\u003E \n\u003E \n\u003E 21 minutes ago, K^2 said:\n\u003E \n\u003E \n\u003E \u003E \n\u003E \u003E \n\u003E \u003E 7 hours ago, sevenperforce said:\n\u003E \u003E \n\u003E \u003E \n\u003E \u003E If you have a plane on a belt, then the belt is using the plane\u0027s wheel inertia to exert a force on the plane in order to push the plane backward against the forward travel produced by its engines. Traction losses and rolling resistance reduce the *belt\u0027s* ability to fight the engines.\n\u003E \u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E All of these factors make it easier to pull the plane back. Think what happens if you apply brakes on a plane that\u0027s already sitting on top of a moving treadmill. Does the plane go forward or backward as a result?\n\u003E \n\nYou\u0027re conflating static friction and kinetic friction. A wheel which is slipping while rolling has less purchase than a wheel which is not slipping while rolling.\n\nNaively, one might imagine that an increase in rolling resistance in the wheel would make it easier for the belt to exert a force on the body of the airplane. However, the sort of rolling resistance which increases with respect to velocity (hysteresis and oscillation/vibration) will produce slippage, which will reduce traction, which will reduce the belt\u0027s ability to transfer energy to the wheels via rotation.\n\n\u003E \n\u003E \n\u003E 21 minutes ago, K^2 said:\n\u003E \n\u003E \n\u003E You keep making up arguments, but it sounds like you have not taken the time to draw force diagrams and consider refernce frames.\n\u003E \n\nYou\u0027re the one advancing a reference frame under constant acceleration.\n\n\u003E \n\u003E \n\u003E 21 minutes ago, K^2 said:\n\u003E \n\u003E \n\u003E Accelerating belt can keep in place a plane at full throttle EVEN if wheels are frictionless. Friction makes it a LOT EASIER. If full brakes are applied, treadmill doesn\u0027t even need to move.\n\u003E \n\nIf the wheels are frictionless and both the wheels and the treadmill components have infinite structural integrity, then yes. But if the wheels are frictionless and the wheels and treadmill components have finite structural integrity, then the treadmill components will fail before the wheel components and the plane will take off. Remember that your model requires the belt to be under constant acceleration, so the airplane need only hold its engines at a constant thrust in order to force the belt to accelerate straight up to relativistic speeds.\n\nIf the wheels have ordinary friction, then yes, the acceleration rate of the treadmill can initially be lower than with frictionless wheels. However, if the wheels have friction, then second-order effects like vibration will rapidly reduce traction to the point that the treadmill will be unable to act on the wheels.\n\n\u003E \n\u003E \n\u003E 21 minutes ago, K^2 said:\n\u003E \n\u003E \n\u003E ...while there are always non-constant sources of friction, for landing gear, they just aren\u0027t significant enough to consider at speeds it can possibly reach before failing.\n\u003E \n\nBut this begs the question.\n\nYour construction requires the belt to accelerate continually while the engines need only maintain static thrust. The engines can maintain full thrust indefinitely. Thus, one of two things will happen:\n\nA) The belt will accelerate until the speeds involved exceed the structural limitations of its components. Assuming comparable structural integrity between the belt and the wheels, the belt will fail first. The plane will then proceed to a normal rolling takeoff.\n\nB) The belt will accelerate until second-order effects induce slippage and reduce traction. The belt will no longer be able to continue accelerating the wheels, and the plane will take off."},{"CreatedByName":"Gargamel","CreatedById":64714,"CreatedDateTime":"2018-05-24T08:46:27Z","Content":"\u003E \n\u003E \n\u003E On 5/23/2018 at 4:22 AM, Gargamel said:\n\u003E \n\u003E \n\u003E ![4f6251871c224.image.jpg](https://bloximages.chicago2.vip.townnews.com/nwitimes.com/content/tncms/assets/v3/editorial/a/ee/aee9632d-1787-5ae3-bd9e-f5479938c216/4f6251871c224.image.jpg)\n\u003E \n\u003E \n\u003E \n\u003E The effect would have been even better had they had some sort of speed indication for the turntable, plane and car wheels, and forward ground/airspeeds for the vehicles, but nevertheless a fun museum exhibit (photo lifted from newspaper article)\n\u003E \n\nI\u0027ll just bump and quote this again, in case some of you missed the significance of it. \n\nThis exhibit puts a plane.... on a treadmill..... and it flies...... \n\nIt\u0027s not a simulation or a video.  It\u0027s an actual tethered airplane, powered by a prop engine, on a circular treadmill.  \n\nIt flies....."},{"CreatedByName":"Blasty McBlastblast","CreatedById":164020,"CreatedDateTime":"2018-05-24T09:30:34Z","Content":"I guess whether or not the aeroplane will fly depends almost entirely\\* on the amount of air passing by the wing, resulting (or not) in lift either via the Bernoulli effect (pressure differential) or Newtonian deflection (conservation of momentum) \n\nTo achieve the outcome of air moving past the wing you could either:\n\n- move the wing through the stationary air\n- move the air around the stationary wing\n\nThe first option is precluded by the conditions of the experiment (i.e. a fictional magically-powered conveyor that can instantaneously reach any speed such that friction is provided to prevent the craft from moving forward.)\n\nHowever the second option is still viable, and can be achieved via several means such as a gust of wind, prop wash, or even an extreme boundary layer of air propelled by the moving surface of the belt as it approaches warp speed!\n\n\\*Thrust vectoring or a high \u003Cabbr title=\u0022Angle of Attack\u0022\u003EAOA\u003C/abbr\u003E of might also cause the aeroplane to break free of the conveyor\u0027s clutches through sheer brute force!"},{"CreatedByName":"DAL59","CreatedById":180784,"CreatedDateTime":"2018-05-24T10:46:35Z","Content":"\u003E \n\u003E \n\u003E 1 hour ago, Gargamel said:\n\u003E \n\u003E \n\u003E It\u0027s an actual tethered airplane, powered by a prop engine, on a circular treadmill\n\u003E \n\nThe treadmill isn\u0027t an ideal treadmill, nor does it match the speed of the wheels."},{"CreatedByName":"Gargamel","CreatedById":64714,"CreatedDateTime":"2018-05-24T10:52:01Z","Content":"\u003E \n\u003E \n\u003E 15 minutes ago, DAL59 said:\n\u003E \n\u003E \n\u003E The treadmill isn\u0027t an ideal treadmill, nor does it match the speed of the wheels.\n\u003E \n\nBe it a circle or a belt, a treadmill is a treadmill.   The parts not in contact with the plane have no bearing on the plane or the question.\n\nWhile in contact with the treadmill, the wheels will by default be matching the speed of the treadmill.   At startup in this case, the treadmill is going much faster than the plane is, so it has more of an \u0027effect\u0027 on the plane than the hypothetical one. \n\nThis exhibit was part of the mythbusters traveling exhibit that toured around 3-4 years ago, seen at many science museums. \n\nI got to see it, and I flew the plane off the treadmill. \n\nEDIT:  I googled the image trying to find the article it came from, and I found it: [http://www.nwitimes.com/niche/shore/shore-newsletter-article/mythbusters-exhibit-comes-to-chicago/article_98ae270c-917f-5d21-999f-4a6d1cae7630.html](http://www.nwitimes.com/niche/shore/shore-newsletter-article/mythbusters-exhibit-comes-to-chicago/article_98ae270c-917f-5d21-999f-4a6d1cae7630.html)\n\nBut the funny part is, google image search returns it\u0027s best guess as [air hockey](https://www.google.com/search?tbs=sbi:AMhZZivhuo_1-b5SLF7NVJgIj5LX_1xgZEqq80mLzjM4CI0M9c7xy8sqGJANsIt3G7fsYU2mQdJ20q5UmvM0CKVlguzrPb67M3Emw7JGzoTRQ0i4SpRfnuOFU9LzN8D0APcE57s8Qr-x3OmSj7bcGd7sPsiXtGh01hrZddZN1bxAklI0CPV0Fpq-WRS5wGorEd_1AP7k0NZ3ilhsCOwpI3ew9bhunspMGDXtguUVMEP87sSn9_1YeQrTnCueeGetNixkY4eCDTrg84CtGpHvWaX-v0ORRCbiOUo5Av824IezEHBHOEjgj_193ltcGP1sgAYaDFE4wudCZpOWaFZ-j9QsYkyFtVVsBlEEeeA\u0026client=firefox-b-1\u0026site=search\u0026sa=X\u0026ved=0ahUKEwj83bugl57bAhWDCjQIHT1pBh4Q9Q8IJigA).  When you look at the photo, you can see how it made that guess. \n\nEDIT2:\n\nFound a video of it:\n\n\u003Ciframe allowfullscreen=\u0022true\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/JJAoRCagsOI?feature=oembed\u0022 width=\u0022480\u0022\u003E\u003C/iframe\u003E\n\nYou can see that there is also a slot car on the treadmill, and it is affected by the treadmill.  \n\n**Edited \u003Ctime datetime=\u00222018-05-24T11:02:30Z\u0022 title=\u002205/24/2018 11:02  AM\u0022 data-short=\u00226 yr\u0022\u003EMay 24, 2018\u003C/time\u003E by Gargamel**"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2018-05-24T11:11:04Z","Content":"\u003E \n\u003E \n\u003E 14 hours ago, sevenperforce said:\n\u003E \n\u003E \n\u003E You\u0027re conflating static friction and kinetic friction. A wheel which is slipping while rolling has less purchase than a wheel which is not slipping while rolling.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Naively, one might imagine that an increase in rolling resistance in the wheel would make it easier for the belt to exert a force on the body of the airplane. However, the sort of rolling resistance which increases with respect to velocity (hysteresis and oscillation/vibration) will produce slippage, which will reduce traction, which will reduce the belt\u0027s ability to transfer energy to the wheels via rotation.\n\u003E \n\nAu contraire. Landing gear is going to remain firmly in the static friction regime. It\u0027s what it\u0027s designed to do. A slipping wheel cannot provide lateral forces allowing any sort of control. And while rudder does assist at all in early stages of landing or late stages of takeoff, you rely on wheels for much of steering during runup. If wheels began to even just noticeably slip during takeoff before you are ready to rotate, you would not be able to keep the plane on the runway. This I can tell you from first-hand experience.\n\nThe second piece of relevant information is that I\u0027m aware of no plane that has landing gear that will survive more than twice the takeoff speed. In other words, the wheels will be rolling at most twice the speed at which they are designed to operate routinely, before they fail. At these speeds you are not suddenly going to develop slipping, excessive friction, etc. The wheels will continue to operate as wheels, providing static friction with the ground, with minimal resistance to rolling, and almost no slipping, save for that necessary for deformation at contact point.\n\nWe have race cars that operate at higher speeds than landing gear failure point. Other than additional reinforcement, their physical properties are not that different. If what you were suggesting was remotely true, these cars would not be able to keep themselves on the race track.\n\n\u003E \n\u003E \n\u003E 14 hours ago, sevenperforce said:\n\u003E \n\u003E \n\u003E If the wheels are frictionless and both the wheels and the treadmill components have infinite structural integrity, then yes. But if the wheels are frictionless and the wheels and treadmill components have finite structural integrity, then the treadmill components will fail before the wheel components and the plane will take off. Remember that your model requires the belt to be under constant acceleration, so the airplane need only hold its engines at a constant thrust in order to force the belt to accelerate straight up to relativistic speeds.\n\u003E \n\nThe landing gear will fail within seconds. We don\u0027t need to be talking about relativistic speeds. We can deal with real materials and real vehicles here. And real airplanes have very real limitations. Their landing gear is not designed for very high speeds, because at these speeds the aircraft is not normally in contact with the ground.\n\nYour statement that belt has to fail first has zero ground. There are just two places where stress is necessary. Centrifugal stress on rollers themselves, which are likely to be solid metal and can far, far outlast landing gear tires, and the belt itself as it bends around at end-points. Belt has numerous advantages. It can be made from better materials than rubber. It can have more reinforcement. It does not experience the maximum stress in the same place as maximum curvature. And it does not experience heating. If that\u0027s not enough, I can always increase the diameter of the rollers, reducing curvature at end points, minimizing stress. None of these mitigating factors apply to the landing gear. I can easily design a treadmill that can survive transsonic speeds, but real landing gear fails at much lower speeds. And if I were to try and design better landing gear, I\u0027d still be unable to make one that\u0027s going to both perform its primary function sufficiently well and survive at higher speeds as the treadmill.\n\nHeck, even if we use the same metal for landing gear hubs as treadmill rollers, same rubber for main surface on both, and same cables for reinforcements on both, the treadmill is still going to be under far less stress and survive higher speeds. And at this point, we\u0027ve morphed landing gear into something monstrous, and the treadmill is still just a treadmill.\n\n\u003E \n\u003E \n\u003E 14 hours ago, sevenperforce said:\n\u003E \n\u003E \n\u003E Your construction requires the belt to accelerate continually while the engines need only maintain static thrust. The engines can maintain full thrust indefinitely. Thus, one of two things will happen:\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E A) The belt will accelerate until the speeds involved exceed the structural limitations of its components. Assuming comparable structural integrity between the belt and the wheels, the belt will fail first. The plane will then proceed to a normal rolling takeoff.\n\u003E \n\nAgain, completely unfounded. Real landing gear will fail way earlier, and one that\u0027s specifically designed to last as long as possible, made from same materials, merely slightly earlier. In both cases, in matter of seconds or less, I might add.\n\n\u003E \n\u003E \n\u003E 14 hours ago, sevenperforce said:\n\u003E \n\u003E \n\u003E B) The belt will accelerate until second-order effects induce slippage and reduce traction. The belt will no longer be able to continue accelerating the wheels, and the plane will take off.\n\u003E \n\nAnd this one\u0027s a plain impossibility. We are talking about thrust of the plane times hundreds of meters per second for this scenario, which is enough power delivered to wheels to melt not just the rubber, but the metal hubs of the landing gear. Meanwhile, the belt remains cool, since that\u0027s not where energy is released, and there is quite a bit of it, allowing cooling along the entire surface. If somehow you came up with magical materials that allowed landing gear not to fail in scenario A), this is where it fails. You simply cannot have sufficient slippage for takeoff without generating all that heat."},{"CreatedByName":"mrfox","CreatedById":69277,"CreatedDateTime":"2018-05-24T13:17:18Z","Content":"Quick google search shows max rated belt speeds today to be around 100m/s - around 200 knots - so it seems for high speed airplanes (most large airliners today have rated max tire speeds around 230 knots) both the belt and the wheels would fail around the same time.\n\nThe belt would heat up just as much as the tires would due to the mechanical deformation of the material as it bends around the rollers."},{"CreatedByName":"p1t1o","CreatedById":74091,"CreatedDateTime":"2018-05-24T13:35:53Z","Content":"\u003E \n\u003E \n\u003E 18 minutes ago, mrfox said:\n\u003E \n\u003E \n\u003E Quick google search shows max rated belt speeds today to be around 100m/s - around 200 knots - so it seems for high speed airplanes (most large airliners today have rated max tire speeds around 230 knots) both the belt and the wheels would fail around the same time.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E The belt would heat up just as much as the tires would due to the mechanical deformation of the material as it bends around the rollers.\n\u003E \n\nWhat on Earth does one use a 200kt belt for?!"},{"CreatedByName":"razark","CreatedById":32993,"CreatedDateTime":"2018-05-24T13:40:48Z","Content":"\u003E \n\u003E \n\u003E 4 hours ago, Gargamel said:\n\u003E \n\u003E \n\u003E I\u0027ll just bump and quote this again, in case some of you missed the significance of it. \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E This exhibit puts﻿ a plane.... on a treadmill..... and it flies...... \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E It\u0027s not a simulation or a video.  It\u0027s an actual tethered airplane, powered by a prop engine, on a circular treadmill.  \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E It flies..... ﻿\n\u003E \n\nSir, I think you miss the point.\n\nThis is the *internet*.  We will not have you derailing a perfectly good science discussion with such nonsense as *facts* and *reality*!  Take that silliness elsewhere!\n\n![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif \u0022;)\u0022)"}]}