{"TopicId":102787,"ForumId":36,"TopicTitle":"[Brainstorming] Part Test Contracts Replacement","CreatedByName":"nightingale","CreatedById":119307,"CreatedDateTime":"2015-03-27T16:01:55Z","PageNum":1,"Articles":[{"CreatedByName":"nightingale","CreatedById":119307,"CreatedDateTime":"2015-03-27T16:01:55Z","Content":"\n\u003Cp\u003EI\u0027m trying to decide between a few different ideas for my next contract pack for Contract Configurator. One of the ideas is a replacement to the stock Part Test contracts. I\u0027d like to throw it out to the community and gather some ideas about what might make for a better experience around part testing contracts.\u003C/p\u003E\u003Cp\u003EIf I decide to go ahead with this contract pack it would need to:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003EOffer a different enough experience from the stock Part Test. I\u0027m not looking to write \u0022part testing, but no launch clamps on the Mun\u0022.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EHave a progression in the contracts from early/mid-game/late-game. Using my \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/113621-0-90-Contract-Pack-Tourism-v1-0-0-2015-03-21\u0022 rel=\u0022external nofollow\u0022\u003Etourism contract pack\u003C/a\u003E as an example, it starts with a single contract to bring one dude to orbit, moves to bringing multiple Kerbals to orbit, then to the Mun, then building orbital attractions, etc.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EHave a specific purpose in mind. I don\u0027t know what this purpose should be, and I\u0027m open to idea. Is it a way to fund you space program. Is in a pre-requisite to unlock parts (ie. the reward of part testing is getting access to more parts). Something else?\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EA few random ideas that I already have (nothing set in stone though):\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003EMulti-part test contracts for one manufacturer. Test a bunch of parts for Kerbodyne.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EMulti-situation contracts. Have one vessel go test a part in flight and landed in a certain biome, for example.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E(From Invader Myk in \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/112300\u0022 rel=\u0022external nofollow\u0022\u003Ethis thread\u003C/a\u003E) Part testing is a \u003Cem\u003Epre-requisite \u003C/em\u003Eto unlocking the part for normal use.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EInternally track a sort of \u0022reputation\u0022 with specific part manufacturers. Testing more parts for that manufacturers gives a benefit (cheaper parts, maybe?).\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ERight now this is just a brainstorming session... nothing is off the table. If you have complaints about the stock part testing contracts, feel free to voice those as well - that\u0027ll help me avoid repeating the same mistakes. So what do you guys think?\u003C/p\u003E\n"},{"CreatedByName":"nightingale","CreatedById":119307,"CreatedDateTime":"2015-03-27T20:21:11Z","Content":"\n\u003Cp\u003ESelf-bump, as I had the mods move this to a move appropriate forum for me. Anyone have thoughts on this one?\u003C/p\u003E\n"},{"CreatedByName":"skykooler","CreatedById":60459,"CreatedDateTime":"2015-03-28T05:33:26Z","Content":"\n\u003Cp\u003EIt might be interesting to give a higher payout if you actually recover the tested parts - e.g. if you have a contract to test a radial decoupler, you\u0027d get a better paycheck if you recovered it on parachutes than just let it hit the ground (better than just the funds gained from recovery of parts, that is).\u003C/p\u003E\n"}]}