{"TopicId":102703,"ForumId":44,"TopicTitle":"NASA chooses to get boulder from asteroid rather than an entire redirect","CreatedByName":"YoetoJoe","CreatedById":126877,"CreatedDateTime":"2015-03-26T01:07:00Z","PageNum":1,"Articles":[{"CreatedByName":"YoetoJoe","CreatedById":126877,"CreatedDateTime":"2015-03-26T01:07:00Z","Content":"So what are you guy\u0027s thoughts on this. Personally i think a whole asteroid would be cooler but beggars cant be choosers.\n\n[http://www.space.com/28934-nasa-asteroid-capture-mission-boulder.html](http://www.space.com/28934-nasa-asteroid-capture-mission-boulder.html)"},{"CreatedByName":"xXIndestructibleEVAXx","CreatedById":110214,"CreatedDateTime":"2015-03-26T01:09:44Z","Content":"NASA shouldn\u0027t have to be beggars. They get HALF A PENNY per tax dollar! It\u0027s ridiculous! We\u0027ve gotten so much out of space exploration, yet they\u0027re budget is so small! \\*end of rant\\*\n\nOh, well. better than nothing."},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-03-26T01:09:48Z","Content":"I think the whole asteroid thing makes no sense. Build a gateway station out there, to act as a platform assisting in Lunar Exploration."},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2015-03-26T01:10:00Z","Content":"My main problem with that is that it would still be a small sample. Who knows that boulder is not different from the rest of the asteroid?"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2015-03-26T01:17:25Z","Content":"What are my thoughts? It\u0027ll never happen and the project will be scrapped. But saying \u0022well, we \\_could\\_ get the whole asteroid if we had money but instead we can only take a few bits out of the rubble pile\u0022 might be a good way to embarrass Congress in to giving them more money."},{"CreatedByName":"xXIndestructibleEVAXx","CreatedById":110214,"CreatedDateTime":"2015-03-26T01:21:15Z","Content":"I REALLY hope this doesn\u0027t get scrapped. It would be NASA\u0027s greatest achievement since Curiosity. So much SCIENCE! could be done. And just THINK about all the cool pictures..."},{"CreatedByName":"Budgie","CreatedById":13840,"CreatedDateTime":"2015-03-26T01:23:24Z","Content":"\u003E \n\u003E What are my thoughts? It\u0027ll never happen and the project will be scrapped. But saying \u0022well, we \\_could\\_ get the whole asteroid if we had money but instead we can only take a few bits out of the rubble pile\u0022 might be a good way to embarrass Congress in to giving them more money.\n\nLets hope something like this actually happens"},{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2015-03-26T01:28:36Z","Content":"I was also keen on the idea of having an object in our sky that could be tracked with an amateur telescope. We could look at it and think, \u0022Gee... WE moved that thing there.\u0022\n\nThat would spark the imagination of anyone who looked at it, in a way that nothing else in the sky could."},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-03-26T01:30:00Z","Content":"\u003E \n\u003E I was also keen on the idea of having an object in our sky that could be tracked with an amateur telescope. We could look at it and think, \u0022Gee... WE moved that thing there.\u0022\n\u003E That would spark the imagination of anyone who looked at it, in a way that nothing else in the sky could.\n\nSo, the fact that WE put the ISS in orbit isn\u0027t astonishing? 440 tons of material? Visible in the night sky?"},{"CreatedByName":"StrandedonEarth","CreatedById":89439,"CreatedDateTime":"2015-03-26T01:39:28Z","Content":"Well, part of the concept was to grab a boulder to increase the mass of the \u0022gravity tractor\u0022 probe."},{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2015-03-26T01:41:46Z","Content":"\u003E \n\u003E So, the fact that WE put the ISS in orbit isn\u0027t astonishing? 440 tons of material? Visible in the night sky?\n\nBeing in LEO, the ISS is VERY hard to track."},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-03-26T01:46:39Z","Content":"\u003E \n\u003E Being in LEO, the ISS is VERY hard to track.\n\nHard to track, yes. But still marvelous..."},{"CreatedByName":"Kibble","CreatedById":131042,"CreatedDateTime":"2015-03-26T02:36:01Z","Content":"Wow I totally didn\u0027t expect that"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2015-03-26T02:44:31Z","Content":"We know it can be done, so what I really expect is a VAB-sized boulder landed right next to the launch site in Cape Canaveral"},{"CreatedByName":"RocketPilot573","CreatedById":62803,"CreatedDateTime":"2015-03-26T02:58:13Z","Content":"Sorry but I really doubt that this will ever happen, NASA doesn\u0027t have the money. Also, am I reading this right? It appears that this is saying taking a tiny boulder would be MORE costly!"},{"CreatedByName":"GreenWolf","CreatedById":65798,"CreatedDateTime":"2015-03-26T03:00:09Z","Content":"\u003E \n\u003E We know it can be done, so what I really expect is a VAB-sized boulder landed right next to the launch site in Cape Canaveral\n\nIf you can land a rock that size with that much precision, I feel like there are some places that could do with the sudden addition of a very large rock garden."},{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2015-03-26T03:13:10Z","Content":"\u003E \n\u003E Hard to track, yes. But still marvelous...\n\nAlso not in view of everyone. Everyone has a chance to see the moon.\n\nI remember plotting Mir back in the day, only to find out that it only came above my local horizon for 5 minutes... at daybreak.\n\n\u003E \n\u003E Sorry but I really doubt that this will ever happen, NASA doesn\u0027t have the money. Also, am I reading this right? It appears that this is saying taking a tiny boulder would be MORE costly!\n\nI\u0027m definitely curious about how they plan on cutting the asteroid. Seems a lot more iffy than to just move the whole thing, which we at least are sure we know how to do. Drilling would be a very inefficient use of power and seems to have much more of a \u0022this might or might not work\u0022 vibe.\n\nMaybe the mishap with Philae has made everyone a bit sheepish about spending more money to go for the big jackpot?\n\n**Edited \u003Ctime datetime=\u00222015-03-26T03:16:45Z\u0022 title=\u002203/26/2015 03:16  AM\u0022 data-short=\u00229 yr\u0022\u003EMarch 26, 2015\u003C/time\u003E by vger**"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-03-26T03:15:03Z","Content":"\u003E \n\u003E Also not in view of everyone. Everyone has a chance to see the moon.\n\u003E I remember plotting Mir back in the day, only to find out that it only came above my local horizon for 5 minutes... at daybreak.\n\nYes. But the ISS is still a great achievement. And it can be observed, too."},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2015-03-26T07:46:08Z","Content":"The ARM mission\u0027s sole purpose was to give something for Orion to do. It was pretty much the only place Orion could go to without some expensive mission hardware that isn\u0027t funded.\n\nFirst, the Orion was supposed to fly out to the asteroid. But that was too hard and needed a mission module. Then the plan was to send a robot to bring the asteroid within reach of the Orion. But that is too expensive too. Now, it\u0027s just to retrieve a piece of rock from an asteroid and put it somewhere Orion can reach.\n\nAt this point, it\u0027s so small, they should probably just stick a parachute and heatshield on the rock and land it at Edwards AFB and forget about the Orion part of the mission. It\u0027s getting ridiculous.\n\n\u003E \u0022We are really trying to demonstrate capabilities that we think we\u0027re going to need in taking humans further into space, and ultimately to Mars,\u0022 Lightfoot said. \u0022That\u0027s what we\u0027re looking at.\u0022\n\nI really wish NASA would stop throwing around the \u0022M\u0022 word for everything it does, when there is clearly no funding or political mandate for a Mars mission and this has clearly no application for a Mars mission other than to prevent Orion from being cancelled.\n\n**Edited \u003Ctime datetime=\u00222015-03-26T07:50:37Z\u0022 title=\u002203/26/2015 07:50  AM\u0022 data-short=\u00229 yr\u0022\u003EMarch 26, 2015\u003C/time\u003E by Nibb31**"},{"CreatedByName":"prophet_01","CreatedById":111502,"CreatedDateTime":"2015-03-26T11:33:49Z","Content":"Nibb, you make me sad. Why do you have to be this convincing? ![:(](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif)\n\nBut it\u0027s rly not much more than a vastly overexpensive sample return. At this point it seems a lot more reasonable to simply bring that boulder back to earth and use something like a dragon or soyuz for further experiments and tests in zero-g.\n\nI also agree that such an object in munar orbit, as a visible object for the whole world to see, would be a truly inspiring achievement."},{"CreatedByName":"Albert VDS","CreatedById":74055,"CreatedDateTime":"2015-03-26T11:59:42Z","Content":"And here we are again with an other deviation of an actual goal, next thing you\u0027ll know it\u0027ll just be sending a probe there."},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2015-03-26T12:41:42Z","Content":"A 4m asteroid in lunar orbit will not be visible \u0022for the whole world to see\u0022."},{"CreatedByName":"StarStreak2109","CreatedById":118557,"CreatedDateTime":"2015-03-26T12:41:44Z","Content":"Guys,\n\nI would like to see some real progress in space exploration as well, but I guess there\u0027s a couple of issues with missions like this. First is justification, especially in the light of politics. Science is all nice and well, but what does it cost to redirect that asteroid and what is the resulting benefit? Secondly, this brings us to politics, most politicians have a prime objective and that is re-election. So why fund a project which is years into the future? And thirdly, what about priorities in the light of current geo-political events? IMHO some real progress will only happen under two circumstances: Either one of the major super-powers on this fair planet is going to challenge the US and Europe by taking supremacy in space (which may be likely) or suddenly worldwide peace is breaking out (rather unlikely), defering more funds to scientific research than right now...\n\nPersonally, I (if I were decisionmaker for a nation\u0027s space program) had rather have the opportunity to perform long-term in-situ studies on a whole asteroid, checking out opportunities for mining rare elements, fuel, you name it, for power generation or whatever may be in those lumps of rock. But that of course means putting such a thing in a reachable orbit and sending up a long-term laboratory and the likes...\n\nSo I guess, I\u0027d sooner see an asteroid redirected in my install of KSP than IRL...\n\nGreetings from Earth,\n\nSebastian"},{"CreatedByName":"FishInferno","CreatedById":106219,"CreatedDateTime":"2015-03-26T12:51:04Z","Content":"This mission will probably never happen. Even if it did, it is doing nothing to help us get to Mars (yes i said the m word). I would much rather wait 2 years and land on the Moon instead."},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2015-03-26T13:06:44Z","Content":"I find all kind of asteroid missions (more if they are not manned) boring."}]}