{"TopicId":102769,"ForumId":18,"TopicTitle":"Post Disaster Movie Humanity Discussion","CreatedByName":"Fr8monkey","CreatedById":76199,"CreatedDateTime":"2015-03-27T07:52:44Z","PageNum":1,"Articles":[{"CreatedByName":"Fr8monkey","CreatedById":76199,"CreatedDateTime":"2015-03-27T07:52:44Z","Content":"* * *\n We have all seen a disaster movie where the world is nearly destroyed and is saved at the last minute or has only a handful of survivors. Whether the Earth\u0027s going topsy-turvy (2012), a devastating plague (Twelve Monkeys), alien invasions (War of the Worlds), technology-gone awry (Terminator) or Bruce Willis blows up the asteroid with 2 seconds to spare... This is not to discuss the implausibility of the physics or reality of the film themselves; just the lasting repercussions. Here is the question.\nHow do you think mankind would react realistically to near extinction?\n\nWould we realize our humanity and put our cultural differences aside or would it be \u0022Whew, that was close!\u0022 and go back to treating each other like crap?"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-03-27T08:36:02Z","Content":"Humans are idiots. I\u0027m an idiot, you\u0027re an idiot, Bob over there is an idiot... Not to be rude. But it\u0027s the truth. When humanity loses its civilization or gains it, humans will be humans. \n\nI hope that when the apocalypse happens humanity will get its much needed kick in the groin. Finally being people, helping each other out. But people always divide into groups too small..."},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2015-03-27T09:22:34Z","Content":"Of course, the survived remains of humanity would put our cultural differences aside and establish modesty and justice all over the world.\n\nEvery tribe. Over all others."},{"CreatedByName":"FishInferno","CreatedById":106219,"CreatedDateTime":"2015-03-27T09:52:30Z","Content":"I think that different scenarios would result in different results. For example, a plague. I think it would very much be like in Dawn of the Apes, where most of the world is wiped out, the governments are shut down, and after a brief period of anarchy there are small pockets of survivors.\n\nAt first, people are crap to each other, but then they realize \u0022oh crap, if we keep fighting there wont be more humans\u0022"},{"CreatedByName":"Kibble","CreatedById":131042,"CreatedDateTime":"2015-03-27T12:35:20Z","Content":"It\u0027ll probably be pretty much the same as when there weren\u0027t very many humans on Earth to begin with."},{"CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2015-03-27T12:48:44Z","Content":"I actually think that a good example of how this works is the game Rust-\n\nNow, before you stop me I\u0027d like to point out that, yes, while it is still a video game, it\u0027s kinda interesting to see how players respond to being dropped in a post-apocalypse nuclear wasteland and have to fend for themselves. It\u0027s like a model of humanity\u0027s starting over: You have to craft your own tools, weapons, shelters, and defend them from other people who may band together in an attempt to steal your things. I find that Rust may just be a pretty decent example of human behavior in that type of situation. People will band together, but most people will attempt to dominate the surrounding groups of survivors that don\u0027t follow the same patterns.\n\nEh, probably doesn\u0027t have much to do with movies, but it\u0027s still humans post-apocalypse."},{"CreatedByName":"razark","CreatedById":32993,"CreatedDateTime":"2015-03-27T13:13:41Z","Content":"\u003E \n\u003E It\u0027ll probably be pretty much the same as when there weren\u0027t very many humans on Earth to begin with.\n\nExcept large areas of the planet are now full of people that wouldn\u0027t have the first clue how to survive. Probably the most capable survivors would be those from areas where subsistence farming with very little dependence on technology is a major way of life."},{"CreatedByName":"Brethern","CreatedById":15602,"CreatedDateTime":"2015-03-27T14:06:43Z","Content":"\u003E \n\u003E I actually think that a good example of how this works is the game Rust-\n\u003E Now, before you stop me I\u0027d like to point out that, yes, while it is still a video game, it\u0027s kinda interesting to see how players respond to being dropped in a post-apocalypse nuclear wasteland and have to fend for themselves. It\u0027s like a model of humanity\u0027s starting over: You have to craft your own tools, weapons, shelters, and defend them from other people who may band together in an attempt to steal your things. I find that Rust may just be a pretty decent example of human behavior in that type of situation. People will band together, but most people will attempt to dominate the surrounding groups of survivors that don\u0027t follow the same patterns.\n\u003E \n\u003E Eh, probably doesn\u0027t have much to do with movies, but it\u0027s still humans post-apocalypse.\n\nExcept you\u0027re missing one key point,\nIt\u0027s a video game, people know it\u0027s a game and know that they can do what ever they want.\n\nPersonally I think if something really happened the first 48 hours would be the most telling, within it the most violence is going to happen the most people are going to die and things are going to change the most after it the smart people. Ergo the ones who didn\u0027t attempt to reenact their left 4 dead fantasies are going to be left, then things are probably going to look as they were 150 years ago."},{"CreatedByName":"Kibble","CreatedById":131042,"CreatedDateTime":"2015-03-27T14:12:33Z","Content":"\u003E \n\u003E Except large areas of the planet are now full of people that wouldn\u0027t have the first clue how to survive. Probably the most capable survivors would be those from areas where subsistence farming with very little dependence on technology is a major way of life.\n\nI think one or two generations is enough to get us back on track. A lot of people will die because of lack of wilderness experience, but *some* people will live, and some is enough for a resourceful animal like *Homo sapiens*. Though it would probably be the saddest thing to ever happen on the Earth, as we steadily (and quickly) lose language, culture, and art. Fifty thousand years of progress wasted!"},{"CreatedByName":"razark","CreatedById":32993,"CreatedDateTime":"2015-03-27T14:25:11Z","Content":"\u003E \n\u003E I think one or two generations is enough to get us back on track. A lot of people will die because of lack of wilderness experience, but *some* people will live, and some is enough for a resourceful animal like *Homo sapiens*. Though it would probably be the saddest thing to ever happen on the Earth, as we steadily (and quickly) lose language, culture, and art. Fifty thousand years of progress wasted!\n\nOnce the canned food in the grocery stores runs out, and people can\u0027t travel far beyond the current location, vast numbers of them will die. Disease will spread. Modern society is not ready for that. While I\u0027m sure there will be some survivors in modern areas, there are people whose lives would not change very much, if at all. Remember, we live in a world where you can read about man walking on the moon, while flying hundreds of miles per hour, miles above the earth and there are people who have never, and will never, flush a toilet."},{"CreatedByName":"Kibble","CreatedById":131042,"CreatedDateTime":"2015-03-27T14:31:13Z","Content":"\u003E \n\u003E Once the canned food in the grocery stores runs out, and people can\u0027t travel far beyond the current location, vast numbers of them will die. Disease will spread. Modern society is not ready for that. While I\u0027m sure there will be some survivors in modern areas, there are people whose lives would not change very much, if at all. Remember, we live in a world where you can read about man walking on the moon, while flying hundreds of miles per hour, miles above the earth and there are people who have never, and will never, flush a toilet.\n\nWasn\u0027t claiming a lot of people, probably most, survivors of the catastrophe will die in the aftermath. But there was en evolutionary bottleneck where just ten thousand people existed on the planet. I think ten thousand people can survive and find each other. Actually when civilization is reestablished thousands of years later (since there will probably be lots of different isolated groups around the world, instead of one single group from Africa) we might have become a *very* diverse species, physically and culturally."},{"CreatedByName":"EdFred","CreatedById":108599,"CreatedDateTime":"2015-03-27T14:38:46Z","Content":"The Rednecks, Amish, and Tribal people will rule the world - or what\u0027s left of it."},{"CreatedByName":"FishInferno","CreatedById":106219,"CreatedDateTime":"2015-03-27T15:01:45Z","Content":"\u003E \n\u003E Once the canned food in the grocery stores runs out, and people can\u0027t travel far beyond the current location, vast numbers of them will die. Disease will spread. Modern society is not ready for that. While I\u0027m sure there will be some survivors in modern areas, there are people whose lives would not change very much, if at all. Remember, we live in a world where you can read about man walking on the moon, while flying hundreds of miles per hour, miles above the earth and there are people who have never, and will never, flush a toilet.\n\nRemember that this scenario assumes that something had already wiped out tons of people, probably pretty rapidly. So there wouldn\u0027t be lots of people to begin with. If you take away the threat of other humans, I think that more people would survive because they still have shelter (abandoned cities) and reasonable weapons (until ammo runs out). \n\nIf people were able to restore limited electricity, more people would have a shot of surviving. Not because of the luxuries that power brings, but because if we lost power, there would be tons of panic and anarchy would take hold."},{"CreatedByName":"razark","CreatedById":32993,"CreatedDateTime":"2015-03-27T15:06:15Z","Content":"\u003E \n\u003E But there was en evolutionary bottleneck where just ten thousand people existed on the planet.\n\nYes, but those ten thousand post-Toba people knew how to live in that world. How good are you at starting a fire without matches? Can you tell the edible berries from the poisonous ones? Take down an antelope with a spear? Care for a sick child without antibiotics? Those are the skills that most of us lack that would be needed to survive.\n\n\u003E \n\u003E I think ten thousand people can survive and find each other.\n\nI have no doubt that a number of populations of significant size would survive. If they have the correct set of skills, they might even be able to continue surviving. However, without modern technology, they are going to have a very hard time finding and maintaining communication between groups.\n\n\u003E \n\u003E I think that more people would survive because they still have shelter (abandoned cities) and reasonable weapons (until ammo runs out). \n\u003E If people were able to restore limited electricity, more people would have a shot of surviving.\n\nCities tend to be poor for growing food, and most people lack the knowledge of how to do it. Same for running most modern technology such as the power grid. Transportation technology would eventually break down, which means you can\u0027t move food from one area to another, even if there\u0027s someone capable of growing it. The survival of modern type people depends on a hell of a lot of stuff they don\u0027t understand.\n\n**Edited \u003Ctime datetime=\u00222015-03-27T15:10:57Z\u0022 title=\u002203/27/2015 03:10  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 27, 2015\u003C/time\u003E by razark**"},{"CreatedByName":"dryer_lint","CreatedById":162541,"CreatedDateTime":"2015-03-27T15:10:00Z","Content":"**Near-Extinction event (minor disease, non-global nuke war, etc. wiping out a good portion of humanity but not all of it):**\n\nMass panic for several weeks to several months. People mob the grocery stores. People try to hide in bunkers. The government tries to set itself back up, but the government is still run by *people*. Eventually, people form gangs or tribes, etc. and grow them into what you could probably call the new countries (or at least nations). Leaders are chosen. Some vague, new government is set up. People begin to settle down. Basically, it\u0027s the start of civilization again. It seems like it would go slowly, but you have to remember that even if infrastructure has been destroyed, we still have knowledge of technology. As long as there\u0027s enough people left, each country would end up with a few electricians, scientists, programmers, farmers, etc. It would be devastating, but it wouldn\u0027t take too long to rebuild. And of course, one of the tribe-countries tries to take over the world but is stopped by Resurrected \u0027Murica with their nukes. The world realizes their mistake, and as in World War Two, diplomacy improves and the Post-Apocalyptic UN is set up.\n\nI hope.\n\n-----\n\n**Extinction event (zombie plague, global thermonuclear war, etc. shredding humanity to pieces and leaving only a dozen survivors):**\n\nWe\u0027re *dead* in this scenario. We\u0027re pretty much screwed. With a dozen survivors left and the world irradiated or zombified, you\u0027d better hope you find a bunker full of people at the last moment. Even when the dozen survivors realize they\u0027re the only ones and stop killing each other, there\u0027s no technology left like in the last scenario. Your chances of having a scientist or engineer in the group is small. The group is probably hiding out somewhere on a desert island where the zombies or the nukes haven\u0027t killed them yet, and they\u0027re trying to \u0022repopulate the earth\u0022. I don\u0027t think this will work out. [http://www.smbc-comics.com/?id=3653](http://www.smbc-comics.com/?id=3653) explains this better than my wall of text ever could. People will start going crazy fast. The dozen survivors will end up committing suicide or starving. Here lies humanity, RIP.\n\nNuclear war *sucks*.\n\n-----\n\n**Unaffected (last minute asteroid explosion, spy saves humanity from doomsday device, etc. resulting in a scare but no damage):**\n\nThere would be some damage and global panic, but mostly it would get posted online and CNN would discuss it for a month or so. Alright, *maybe* the asteroid would result in some future asteroid-interception system being built.\n\nBut mostly CNN.\n\n-----\n\nI spent fifteen minutes of my life writing that. Enjoy."},{"CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2015-03-27T15:29:19Z","Content":"\u003E \n\u003E Except you\u0027re missing one key point,\n\u003E It\u0027s a video game, people know it\u0027s a game and know that they can do what ever they want.\n\nAha, but I respond with the argument that *Hey, it\u0027s the end of the world! We can do whatever we want now, there\u0027s no more rules!*\n\nMaybe the majority won\u0027t immediately devolve into complete murderous chaos like Rust, but also consider the Walking Dead, and the protagonist\u0027s devolution into feeling less regret about taking not just zombie lives, but harmful human lives as well."},{"CreatedByName":"Kibble","CreatedById":131042,"CreatedDateTime":"2015-03-27T16:25:29Z","Content":"\u003E \n\u003E Yes, but those ten thousand post-Toba people knew how to live in that world. How good are you at starting a fire without matches? Can you tell the edible berries from the poisonous ones? Take down an antelope with a spear? Care for a sick child without antibiotics? Those are the skills that most of us lack that would be needed to survive.\n\nMy point was that we\u0027ll learn how to survive. Each successive generation will have more survivors as the first makes mistakes and is bad at stuff, but learn things to teach to the next generation. They\u0027ll teach the same (and more) lessons to their children, and before you know it we\u0027ll be right at home in our natural habitat. And hunting antelope is (relatively) simple for a physically fit human. There\u0027s a reason we conquered the world!\n\n\u003E \n\u003E I have no doubt that a number of populations of significant size would survive. If they have the correct set of skills, they might even be able to continue surviving. However, without modern technology, they are going to have a very hard time finding and maintaining communication between groups.\n\nSo? As long as one big-enough group survives, then we aren\u0027t extinct. If more groups than that form, awesome - but they don\u0027t need to stay in contact, if they even know about each other."},{"CreatedByName":"Frybert","CreatedById":97766,"CreatedDateTime":"2015-03-27T16:38:11Z","Content":"Assuming human survival was still possible, I would imagine the world would continue on as it has."},{"CreatedByName":"razark","CreatedById":32993,"CreatedDateTime":"2015-03-27T16:43:24Z","Content":"\u003E \n\u003E My point was that we\u0027ll learn how to survive. Each successive generation will have more survivors as the first makes mistakes and is bad at stuff, but learn things to teach to the next generation. They\u0027ll teach the same (and more) lessons to their children, and before you know it we\u0027ll be right at home in our natural habitat. And hunting antelope is (relatively) simple for a physically fit human. There\u0027s a reason we conquered the world!\n\nMy point is that I have very little hope that any of those survivors will last long enough to breed the next generation, let alone pass on any knowledge they may have, unless they already possess the skills needed for a hunter/gatherer or subsistence agriculture lifestyle. I\u0027m not talking about spending a week or a month camping. I\u0027m talking about shifting an entire way of life to one that people simply are not familiar with anymore.\n\nWhat crops are suited to grow in your area? When do you plant them? When do you harvest them? How do you tend them while they are growing? How many acres do you need to plant to ensure enough food for *X* people? How do you store the seed so that it is ready for planting? How do you get the water to the crops if the rains don\u0027t come? How do you tend the livestock? Where do you get the livestock and seed? How do you keep the cattle alive over winter? How do you preserve the food with no refrigeration?\n\nThose are the questions that would matter.\n\n\u003E \n\u003E So? As long as one big-enough group survives, then we aren\u0027t extinct. If more groups than that form, awesome - but they don\u0027t need to stay in contact, if they even know about each other.\n\nI was responding to your point that those survivors would be able to find each other. If you\u0027re abandoning that point, then I agree."},{"CreatedByName":"Fr8monkey","CreatedById":76199,"CreatedDateTime":"2015-03-27T16:44:13Z","Content":"I hate to be that one person; but considering humanitys past, I have little hope people will start getting along anytime soon... disaster or not.\n\nHumans have been killing and hating each other since we lived in caves; and it is just going to continue."},{"CreatedByName":"Brethern","CreatedById":15602,"CreatedDateTime":"2015-03-27T17:07:17Z","Content":"\u003E \n\u003E Aha, but I respond with the argument that *Hey, it\u0027s the end of the world! We can do whatever we want now, there\u0027s no more rules!*\n\u003E Maybe the majority won\u0027t immediately devolve into complete murderous chaos like Rust, but also consider the Walking Dead, and the protagonist\u0027s devolution into feeling less regret about taking not just zombie lives, but harmful human lives as well.\n\nThere\u0027s a huge difference between killing to take someones supplies and killing a threat, normal humans should realize that the odds of them getting impaled vlad style goes up if they act like a jerk."},{"CreatedByName":"Kibble","CreatedById":131042,"CreatedDateTime":"2015-03-27T17:18:31Z","Content":"\u003E \n\u003E I was responding to your point that those survivors would be able to find each other. If you\u0027re abandoning that point, then I agree.\n\nOh I meant in thousands of years when they invent radio.\n\nAs for those various questions you posed, I don\u0027t know the answers. But we\u0027ll figure it out - nature is our species\u0027 natural habitat."},{"CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2015-03-27T17:33:33Z","Content":"\u003E \n\u003E There\u0027s a huge difference between killing to take someones supplies and killing a threat, normal humans should realize that the odds of them getting impaled vlad style goes up if they act like a jerk.\n\nI agree completely, but I\u0027d also like to share a sort of personal story in rebuttal. And to those who read it, please don\u0027t laugh! I mean, it sounds pretty funny, but It\u0027s something true.\n\nWhen I started playing Rust, I had the toughest time learning how to survive. There were so many things to do, and though I did have some friends help me learn the ropes of how to do basic survival (we had a little tribe of us three) it was the other players, the more experienced ones, that would sometimes kill us, threaten in the chat, all that standard video game nonsense.\n\nHowever, I noticed that whenever I thought about striking back, or perhaps even of finding some player that was even less experienced than I, to take their things so I could advance myself, the thought terrified me. I can\u0027t explain it- I\u0027ve played CoD and L4D and Counter Strike and all sorts of games where you kill people indiscriminately. Killing a virtual player meant little to me, but in Rust I simply didn\u0027t think I could do it. Not only that, my friends (also gamers with histories similar to my own) also thought that it would be super wrong to do, like it was a real evil to kill someone in Rust. We mostly kept to ourselves.\n\nAfter playing the game for a month, we grew tired of hiding and scavenging, and again considered the possibility heavily. We decided that we would try it, killing a player and stealing their resources to add to our collection. Long story short, it was one of my friends that did it first, killing a player under the pretense of friendly trading. His back was turned as he was shot by my friend, and we learned he had killed him through the Skype chat. I can\u0027t quite say for sure what my second friend was thinking, but I know that I felt horrible even then from the virtual life that was taken for our group\u0027s own betterment.\n\nIt was a short time later that it was my turn to kill for the group. It was a similar setup- We\u0027d find a lone player, offer to trade, and I would go to facilitate the trade with our supplies. Of course, I didn\u0027t bring anything with me besides my armor, a pistol, and several clips of ammunition. I didn\u0027t intend to come back empty-handed, or injured. \n\nI traveled to the player\u0027s outpost, a simple wooden shelter. As he opened the door and fetched supplies from the crate, I drew my pistol and took three shots. His body ragdolled hilariously as he dropped to the ground as my heart raced. In a rush, I grabbed his materials, raided the rest of his supply chest, and made a run for it. In real life, I looked down at my arms and found that I was physically shaking from the experience, and my voice had a slight waver as I told my friends through Skype what I had done.\n\nI\u0027ll remind you that I still can\u0027t explain why I felt this way- I dunno why I was shaking, why the murder would\u0027ve felt so different than the other times I\u0027d killed in video games. It just felt horrid.\n\nEventually, however, the game went on. I logged more and more hours in the game, and I noticed that my group was changing subtly. As the time went on, and we grew more experienced, we felt less guilty about the murder and the stealing. It was a game, sure, but we killed and stole to support ourselves where gathering was insufficient, or boring. We grew our operations, moved around, and became quite proficient at breaking and entering, killing people and stealing their goods before their reinforcements showed up. Each time I shot somebody, every time I took another life made up of code and textures, I still felt a pang in my heartstrings to remind me what I was doing. Over time, I learned to work with it, and continued the business. Even when my group got into a huge firefight with a rival gang, with huge quantities of materials on the line, it\u0027s an experience that is completely out of this world.\n\nI\u0027m not trying to promote Rust or anything, this is just my story. I used Rust as an example in this thread because I felt it was some kind of analogue, and there were plenty of stories just like mine, but I hadn\u0027t heard them. I usually killed them before I learned who they were. That\u0027s what I became, a raider, a bandit that new players are warned of. And to this day I continue this lifestyle in the game, just because it\u0027s what I know best. \n\nJust a little idea of the mental processes, that\u0027s all ![:blush:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif)![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)"},{"CreatedByName":"Kibble","CreatedById":131042,"CreatedDateTime":"2015-03-27T17:36:21Z","Content":"I guess thats how people become serial killers"},{"CreatedByName":"razark","CreatedById":32993,"CreatedDateTime":"2015-03-27T17:42:42Z","Content":"\u003E \n\u003E Oh I meant in thousands of years when they invent radio.\n\nAh.\n\n\u003E \n\u003E As for those various questions you posed, I don\u0027t know the answers. But we\u0027ll figure it out - nature is our species\u0027 natural habitat.\n\nThe problem is that you only have a limited amount of time to figure it out; if you don\u0027t get the crops planted at the right time, there\u0027s going to be a lot fewer people to try again next year. Hopefully, you\u0027ll get it figured out before the local \u0022tribe\u0022 become too small to sustain itself.\n\nIt\u0027s a major set of problems to overcome. Civilization has changed our way of life, and most people have lost the knowledge that used to be commonplace. People have a lot more knowledge than we did ten thousand, two thousand, even one hundred years ago. That knowledge, however, has become so specific that it is very hard for an individual person to keep a useful general base of knowledge about how their life works. The question I have is: When do we become so dependent on technology that we cannot survive a societal collapse? Have we passed that point already? I\u0027d argue that parts of human society already have."}]}