{"TopicId":102776,"ForumId":34,"TopicTitle":"[1.3] [Kopernicus] New Horizons v2.0.1 [2JUN17] - It\u0026#039;s Back!","CreatedByName":"KillAshley","CreatedById":128696,"CreatedDateTime":"2015-03-27T13:26:03Z","PageNum":35,"Articles":[{"CreatedByName":"KillAshley","CreatedById":128696,"CreatedDateTime":"2015-08-04T06:37:21Z","Content":"\n\u003Cp\u003Etrue, theres a couple planets that could be regarded as a new Duna. However each has it\u0027s own challenges now separating them off a little more. That\u0027s how i wanted it when designing the system, really. I needed a change-up from the standard minmus grind then straight to nice \u0026amp; easy Duna landings from stock playthroughs, at least with Nh i have made them different enough to warrant the slight fear of traveling there \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\u003Cp\u003E@eddiew - beautiful shot as always dude. I take it the color is fom KerbPaint or something? looks awesome!\u003C/p\u003E\u003Cp\u003E@Project Pluto - Arin is such a beautiful planet, and your screenshot shows it off nicely! Very nice work dude!\u003C/p\u003E\u003Cp\u003EKeep these screens coming in boys, they keep me motivated to keep working on polishing NH and looking at new things for it. I\u0027ll add some to the OP too so everyone can enjoy them \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2015-08-04T08:10:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Project Pluto\u0022 data-cite=\u0022Project Pluto\u0022\u003E\u003Cdiv\u003EA successful, but inefficient, capture burn!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAny capture you can fly away from... with standard heating, Arin toasts anything I dip into the atmosphere, so I can see why you needed a big ship with many nukes \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E How did landing (from orbital velocities) go?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003EIn many ways I see Serran as a \u0022new Duna\u0022. Both are among they closest worlds to Kerbin, both have atmospheres but not necessarily enough to land with chutes alone, both require an relatively modest amount of delta-V to launch from. Serran seems to be somewhat more challenging, but that seems fitting.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt does have a rather lower science multiplier though. Which is totally fair, given the nature of NH, but it does make it less rewarding target \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EIn other news, has anyone managed so much as a flyby of Ernus? Little bugger is evading my manoeuvre nodes \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-04T08:12:48Z\u0022 title=\u002208/04/2015 08:12  AM\u0022 data-short=\u00228 yr\u0022\u003EAugust 4, 2015\u003C/time\u003E by eddiew\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KillAshley","CreatedById":128696,"CreatedDateTime":"2015-08-04T08:22:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022eddiew\u0022 data-cite=\u0022eddiew\u0022\u003E\u003Cdiv\u003EIn other news, has anyone managed so much as a flyby of Ernus? Little bugger is evading my manoeuvre nodes \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Elittle tip - make sure your peri on your encounter doesn\u0027t go below ernus\u0027s orbit...it sits pretty precariously in a temperature zone of around 1500-1600K so anything closer sill make the heat even worse. make sure to bring a lot of radiators \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\u003Cp\u003ESeriously, Ernus is my favorite planet, especially seeing as it\u0027s such a hard end-game destination. High gravit \u0026amp; extreme heat makes it so much fun! Kerbals only get about 10 seconds on EVA before they explode from the heat....so satisfying! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2015-08-04T08:59:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KillAshley\u0022 data-cite=\u0022KillAshley\u0022\u003E\u003Cdiv\u003ESeriously, Ernus is my favorite planet, especially seeing as it\u0027s such a hard end-game destination. High gravit \u0026amp; extreme heat makes it so much fun! Kerbals only get about 10 seconds on EVA before they explode from the heat....so satisfying! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAre planets any cooler on the night side? Ernus looks like its tidally locked, my brain wants it to be freezing on back, but I\u0027m not sure if that can be modelled in KSP...\u003C/p\u003E\u003Cp\u003EI\u0027m inclined to set up a refuelling base on Laythe\u0027s moon first though. It seems like it would be a good staging ground for the inner solar system.\u003C/p\u003E\u003Cp\u003EI also realised this morning that it should be possible to burn for Laythe straight from Kerbin orbit - if the Sun, Kerbin, and Sonnah are in alignment. An experimental node gave me a PE that was dead right for less than 1km/s, just need to get the right launch timing, and suddenly it\u0027s a much less intimidating target with a lot less fuel budget than if you circularise around Sonnah first \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Unfortunately MechJeb is way out of its depth with this one, so it\u0027ll probably need a lot of fiddling, but I\u0027m hoping that Transfer Window Planner is giving me the right time, plus or minus half an orbit ^^;\u003C/p\u003E\n"},{"CreatedByName":"Nori","CreatedById":41334,"CreatedDateTime":"2015-08-04T14:34:50Z","Content":"\n\u003Cp\u003EAnyone though of setting up refueling on/around Aptur? Working on a mission there and planning ahead. Seems like it would be hard considering the really low gravity and small SOI, but probably is the best option. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EOH and I had to load a quicksave cuz Valentina feel down a small incline and never stopped. Just kept on bouncing around the planet. I gave up trying to regain control after 2KM.. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2015-08-04T16:46:42Z","Content":"\n\u003Cp\u003EFeeling a bit smug now \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/YTumeu5.jpg\u0022 alt=\u0022YTumeu5.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAsked Transfer Window Planner to give me a burn time for an orbit from 45,000km around Sonnah to get to Laythe, then took the nearest opportunity when the planets aligned... and it works. My previous Laythe burns all required me to circularise around Sonnah first, then go from there with MechJeb, but this is a significantly cheaper approach, verging on a stock run to Duna \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E TWP\u0027s suggestion was nearer 1100m/s; I needed 938, so it looks like there\u0027s some gain from using the combined orbital momentums to fling you out of Sonnah\u0027s SoI.\u003C/p\u003E\u003Cp\u003EJust to be sure, I deleted the node and recreated it. Purely by eyeballing it, I was able to get the encounter on two separate occasions. \u003C/p\u003E\u003Cp\u003EOf note, anyone wanting to do this with New Horizons will want to edit the settings.cfg file and make this change:\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022color:#008080;\u0022\u003ECONIC_PATCH_LIMIT = 5\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E...the default is 3, and doesn\u0027t do well at seeing past Sonnah\u0027s SoI from a Kerbin burn.\u003C/p\u003E\n"},{"CreatedByName":"KillAshley","CreatedById":128696,"CreatedDateTime":"2015-08-04T22:05:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tynrael\u0022 data-cite=\u0022Tynrael\u0022\u003E\u003Cdiv\u003EMinor SciDef alteration proposed for Eli\u0027s Orbital Telescope observation: \u0022Eli looks ill, you don\u0027t want \u003Cspan style=\u0022color:#ff0000;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027arial black\u0027;\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003Eat\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E land at all now.\u0022 to \u0022Eli looks ill, you don\u0027t want \u003Cspan style=\u0022color:#0000ff;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027arial black\u0027;\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003Eto\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E land at all now.\u0022\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EChers for letting me know dude! I\u0027ve updated the DMagic SciDefs, if you spot any others just let me know!\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003Eand just so you know i laughed pretty hard when you didn\u0027t pay attention to Dero\u0027s GeeASL and crashed your probe \u003C/span\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nori\u0022 data-cite=\u0022Nori\u0022\u003E\u003Cdiv\u003EAnyone though of setting up refueling on/around Aptur? Working on a mission there and planning ahead. Seems like it would be hard considering the really low gravity and small SOI, but probably is the best option. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003Cp\u003EOH and I had to load a quicksave cuz Valentina feel down a small incline and never stopped. Just kept on bouncing around the planet. I gave up trying to regain control after 2KM.. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EProbably around would be best in orbit with a lander transferring fuel from a mining ship on the surface. Haven\u0027t tried it yet myself though....\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022eddiew\u0022 data-cite=\u0022eddiew\u0022\u003E\u003Cdiv\u003EFeeling a bit smug now \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022color:#ff8c00;\u0022\u003ECONGRATULATIONS!\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E You\u0027ve finally stumbled upon my main challenge for NH! Been waiting a while for someone to mention things related to this! To be honest the main challenge from NH ISN\u0027T the delta-v requirements to get to other planets, it\u0027s all about the change in thinking about maneuvers and burns to other places. Using the initial orbital velocity of kerbin to shoot out at other planets is the first big step into the world of New Horizons, the change in thinking about how to harness the gravity of other planets is the next step...and that step is: SLINGSHOTS! It seems weird that until now people have been trying to brute force their way to the other planets, always wondered how long it would take for people to come to the conclusion that you have! Have a cookie:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.bnet.com/blogs/cookie.png\u0022 alt=\u0022cookie.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EYou\u0027ve earnt it, EddieW!\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-08-04T22:17:01Z","Content":"\n\u003Cp\u003ETo me it doesn\u0027t really look any different to leaving the Mun for an interplanetary trip, or departing Laythe or Tylo to go back to Kerbin, in the stock system. Though I\u0027ll grant that NH\u0027s inclination will add some complexity. In particular I imagine identifying the ideal parking orbit inclination for IP transfers will require breaking out a spot of trigonometry.\u003C/p\u003E\n"},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2015-08-04T22:27:40Z","Content":"\n\u003Cp\u003ELol, why thank you. I feel bad it took me so long to realise... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 alt=\u0022:blush:\u0022\u003E To be fair, even having thought about it (about 2am yesterday night as I stared at the ceiling) I wasn\u0027t sure the game would predict me an accurate path until I\u0027d tested it out. Thought it might not be accounting for the path through Sonnah\u0027s SoI properly - but I am delighted to be proven wrong, and may even increase my conics patch limit further and see what madness I can invoke.\u003C/p\u003E\u003Cp\u003EAnd if you want slingshots... \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/hrrDNjx.jpg\u0022 alt=\u0022hrrDNjx.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E...Kerbin to Serran to low (I think) Sonnah and back to Kerbin at a 35km periapsis. Total accident, but I thought it was brilliant. I would have loved to get that trajectory on an early launch...\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003ETo me it doesn\u0027t really look any different to leaving the Mun for an interplanetary trip, or departing Laythe or Tylo to go back to Kerbin, in the stock system. Though I\u0027ll grant that NH\u0027s inclination will add some complexity. In particular I imagine identifying the ideal parking orbit inclination for IP transfers will require breaking out a spot of trigonometry.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI never bothered going interplanetary from Mun, but I\u0027m sure you\u0027re right ^^\u003C/p\u003E\u003Cp\u003EWith regard to Laythe at least, I\u0027m consistently finding than when it\u0027s in its window, then a prograde burn (from Kerbin or Sonnah) gives you something very close to Laythe\u0027s inclination - which itself isn\u0027t that far off the rest of the inner planets... Really thinking that a Laythe staging ground is the way forward. Even though I don\u0027t have ore drilling/processing yet, I can send tanks there on the cheap and make the second phase of the journey easier to plot.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-04T22:43:36Z\u0022 title=\u002208/04/2015 10:43  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 4, 2015\u003C/time\u003E by eddiew\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tynrael","CreatedById":144990,"CreatedDateTime":"2015-08-05T00:05:29Z","Content":"\n\u003Cp\u003EI think I am going into the probe crashing business! The trick is to use Kerbals to create a high risk high reward scenario... At least that way I would feel bad if something blew up, though I have a nagging feeling explosions may be wanted by some!!\u003C/p\u003E\u003Cp\u003EThe problem with slingshots, can you work them into efficient transfer windows? I don\u0027t have a lot of experience with them myself but watching some Scott Manley he seems to be able to get anywhere for minimal fuel with them, but it takes a lot of orbiting and feels pretty dynamic and hard to plan.\u003C/p\u003E\n"},{"CreatedByName":"Tellion","CreatedById":116794,"CreatedDateTime":"2015-08-05T00:48:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tynrael\u0022 data-cite=\u0022Tynrael\u0022\u003E\u003Cdiv\u003EI think I am going into the probe crashing business! The trick is to use Kerbals to create a high risk high reward scenario... At least that way I would feel bad if something blew up, though I have a nagging feeling explosions may be wanted by some!!\u003Cp\u003EThe problem with slingshots, can you work them into efficient transfer windows? I don\u0027t have a lot of experience with them myself but watching some Scott Manley he seems to be able to get anywhere for minimal fuel with them, but it takes a lot of orbiting and feels pretty dynamic and hard to plan.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, I imagine accurately plotting multiple gravity assists would require something a little above the scope of Transfer Window Planner and such. The other option that comes to mind is the Trajectory Optimization Tool, but I doubt it takes in custom solar systems. If it did, that would be awesome of course.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-08-05T01:10:48Z","Content":"\n\u003Cp\u003EIt does. There\u0027s a plugin that can create a bodies file specifying all the planets and moons and their orbits, that the KSPTOT program can then read.\u003C/p\u003E\n"},{"CreatedByName":"Tynrael","CreatedById":144990,"CreatedDateTime":"2015-08-05T02:13:48Z","Content":"\n\u003Cp\u003EKSPTOT does let you load in all of the planets by connecting to KSP with a plugin, I did not have any luck with the porkchop plots for transfers however. My results were always 3-4x as expensive as what TWP would come up with- they were valid maneuvers but where TWP would give me a direct bounce to the Mun for example, KSPTOT would give me an encounter that shot out past Serran and then rendezvoused with the Mun on the way back for 3kdV versus TWPs 800 option. I do plead complete ignorance on using KSPTOT (IE I am sure it is my fault entirely) and while I meant to try the mission planner to see if it had better results I never found the time. It also did not like Aptur at all, it said Aptur had no sidereal year and a maneuver could not be calculated.\u003C/p\u003E\n"},{"CreatedByName":"Nori","CreatedById":41334,"CreatedDateTime":"2015-08-05T17:29:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tynrael\u0022 data-cite=\u0022Tynrael\u0022\u003E\u003Cdiv\u003EKSPTOT does let you load in all of the planets by connecting to KSP with a plugin, I did not have any luck with the porkchop plots for transfers however. My results were always 3-4x as expensive as what TWP would come up with- they were valid maneuvers but where TWP would give me a direct bounce to the Mun for example, KSPTOT would give me an encounter that shot out past Serran and then rendezvoused with the Mun on the way back for 3kdV versus TWPs 800 option. I do plead complete ignorance on using KSPTOT (IE I am sure it is my fault entirely) and while I meant to try the mission planner to see if it had better results I never found the time. It also did not like Aptur at all, it said Aptur had no sidereal year and a maneuver could not be calculated.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah I think Aptur is problematic because of it\u0027s really close orbit to Kerbin. TWP get\u0027s NAN results for a long of maneuvers there.\u003C/p\u003E\n"},{"CreatedByName":"KillAshley","CreatedById":128696,"CreatedDateTime":"2015-08-05T17:42:27Z","Content":"\n\u003Cp\u003Eyeah most of the transfer programs have issues with Aptur because of it\u0027s relative distance and strange orbital path. I have thought about changing it a couple times, but luckily it\u0027s close enough to home that you really don\u0027t need a transfer window planner \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-08-05T17:44:08Z","Content":"\n\u003Cp\u003EAptur is in a 1:1 orbital resonance with Kerbin isn\u0027t it? That would quite probably break all the usual calculations about transfer windows. I imagine you\u0027ll get similar results with Harvest in Kerbol Plus, which sits at the Sun-Kerbin L5 point (or the Sonnah-Kerbin L5 point if you have NH as well).\u003C/p\u003E\n"},{"CreatedByName":"KillAshley","CreatedById":128696,"CreatedDateTime":"2015-08-05T17:51:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003EAptur is in a 1:1 orbital resonance with Kerbin isn\u0027t it? That would quite probably break all the usual calculations about transfer windows. I imagine you\u0027ll get similar results with Harvest in Kerbol Plus, which sits at the Sun-Kerbin L5 point (or the Sonnah-Kerbin L5 point if you have NH as well).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eyeah it does, thats why Aptur is such a pain for planning tools haha!\u003C/p\u003E\u003Cp\u003EHarvest in K\u002B wouldnt be that breaking though I wouldn\u0027t think, as it\u0027s technically on it\u0027s own orbital path just 60degrees off from Kerbin. I\u0027ve yet to look at it though, as K\u002B is pretty buggy atm...\u003C/p\u003E\n"},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2015-08-05T17:59:06Z","Content":"\n\u003Cp\u003EThing with Harvest is that it\u0027s on the same orbit, so you can just drop to a lower solar altitude then back up again (or vice versa) whenever you want to. Aptur is tricky because it crosses orbits with Kerbin, and tends to be very close, so it\u0027s tricky to hit its SoI rather than Kerbin\u0027s. Certainly not impossible though, just takes a bit of time to figure out the best transfers \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-08-06T01:42:53Z","Content":"\n\u003Cp\u003ERegarding the sun in New Horizons, I was looking at how some of the body distances compare with standard KSP. Kerbin is about 2.3 times further from the sun than in stock, and that same multiplier in the 2-2.5x range multiplier comes up for Urlum and Neidon with OPM installed. On the other hand Eve and Jool are about level with their stock counterparts. Duna in its NH position ends up about 3.6x further from the sun.\u003C/p\u003E\u003Cp\u003EThis makes me think that a star 4-5 times as luminous as in stock KSP might be appropriate. If the sun stays the same size then applying the Stefan-Boltzmann law that should be a surface temperature 40-50% higher than in stock, which puts in in spectral type A, a bright white with maybe a hint of blue. (I\u0027m ignoring that the stock Sun is already underluminous for its size and temperature which could be explained away by the KSP universe having a different StefanÃ¢â‚¬â€œBoltzmann constant).\u003C/p\u003E\u003Cp\u003EOn the other hand that ought to make many of the inner bodies even hotter than they already are. Laythe in this imagined NH ought to be like Eve in stock, Eve ought to be hot as Venus I would guess, and Ernus probably should be boiled away \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EPS: Turns out there\u0027s a pretty simple equation to estimate the temperature of a planet or moon, \u003Ca href=\u0022https://en.wikipedia.org/wiki/Planetary_equilibrium_temperature\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Planetary_equilibrium_temperature\u003C/a\u003E . It\u0027s really only a starting point because atmospheric compositions and rotation rates and other factors come into play, but it could be used as a simple \u0022does this make sense\u0022 kind of check.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-06T01:50:22Z\u0022 title=\u002208/06/2015 01:50  AM\u0022 data-short=\u00228 yr\u0022\u003EAugust 6, 2015\u003C/time\u003E by cantab\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KillAshley","CreatedById":128696,"CreatedDateTime":"2015-08-06T08:27:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003E**snip**\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EInteresting thought, I\u0027ll keep it in mind, but the star has been pushed back yet again unfortunately. It will get here eventually though. I\u0027m currently trying to properly learn some of the more compicated PQS mods to create even better things in the future and along with work experimenting takes most of my free time.\u003C/p\u003E\u003Cp\u003EWith that said though:\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:24px;\u0022\u003E\u003Cspan style=\u0022color:#ff8c00;\u0022\u003Ev1.6.3 is now live!\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003ENothing too major in this update, a lot of terrain fixes, and some more of those lovely SciDefs (thanks to MinimumSky5)\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003EChangelog:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003E[B]SciDefs \u0026amp; Dmagic SciDefs:[/B]\u003Cbr\u003E-Ete\u003Cbr\u003E-Oree\u003Cbr\u003E-Vanor\u003Cbr\u003E-Tweaked typo for Ete\u003Cbr\u003E\u003Cbr\u003E  [B]Major .cfg cleanup[/B]\u003Cbr\u003E-Removal of \u0022junk\u0022 mods that have no effect on planetary bodies\u003Cbr\u003E\u003Cbr\u003E  [B]Terrain fix[/B]\u003Cbr\u003E-Removal of lines/stretchmarks across terrain ( [URL]http://imgur.com/a/lxdYG[/URL] )\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003EAs always, make sure to back up your savegames before installing, and report any issues straight back to me so can fix them up ASAP.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"run1235","CreatedById":26255,"CreatedDateTime":"2015-08-06T09:22:04Z","Content":"\n\u003Cp\u003Eany plans on adding this to ckan so we dont have to manually install it every time?\u003C/p\u003E\n"},{"CreatedByName":"KillAshley","CreatedById":128696,"CreatedDateTime":"2015-08-06T09:46:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022run1235\u0022 data-cite=\u0022run1235\u0022\u003E\u003Cdiv\u003Eany plans on adding this to ckan so we dont have to manually install it every time?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have to figure out how to do it, i set up the mod in 1.6 so that it will work for CKAN installation, however i just need to figure out how to get it there\u003C/p\u003E\n"},{"CreatedByName":"Tellion","CreatedById":116794,"CreatedDateTime":"2015-08-06T09:53:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KillAshley\u0022 data-cite=\u0022KillAshley\u0022\u003E\u003Cdiv\u003EI have to figure out how to do it, i set up the mod in 1.6 so that it will work for CKAN installation, however i just need to figure out how to get it there\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe fix for the ground was setting maxLevel to 6 from 12, right? Do you know what this does exactly? The Material section looks like it contains ground textures, but I am not sure here either... Mind pointing me to a description of that (if it exisits)? Thanks in advance \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Sigma88","CreatedById":113260,"CreatedDateTime":"2015-08-06T09:56:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KillAshley\u0022 data-cite=\u0022KillAshley\u0022\u003E\u003Cdiv\u003EI have to figure out how to do it, i set up the mod in 1.6 so that it will work for CKAN installation, however i just need to figure out how to get it there\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think you can just add a pull request here\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://github.com/KSP-CKAN/NetKAN/pulls\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/KSP-CKAN/NetKAN/pulls\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"KillAshley","CreatedById":128696,"CreatedDateTime":"2015-08-06T10:00:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tellion\u0022 data-cite=\u0022Tellion\u0022\u003E\u003Cdiv\u003EThe fix for the ground was setting maxLevel to 6 from 12, right? Do you know what this does exactly? The Material section looks like it contains ground textures, but I am not sure here either... Mind pointing me to a description of that (if it exisits)? Thanks in advance \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eit has to do with the general \u0027resolution\u0027 of the derived heightmap...still not 100% but it works really nicely for general smoothing. The material section governs the ground textures for any given planet, you can set them manually in the .cfg\u0027s if you want custom textures or if you use a template then you can just leave them out and it\u0027ll use your template\u0027s ground textures. There\u0027s no tutorial on them (yet....) so for now you\u0027ll have to experiment a lot \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\n"}]}