{"TopicId":102776,"ForumId":34,"TopicTitle":"[1.3] [Kopernicus] New Horizons v2.0.1 [2JUN17] - It\u0027s Back!","CreatedByName":"KillAshley","CreatedById":128696,"CreatedDateTime":"2015-03-27T13:26:03Z","PageNum":11,"Articles":[{"CreatedByName":"CleverLikeMe","CreatedById":98361,"CreatedDateTime":"2015-05-05T01:39:50Z","Content":"I\u0027ve had some issues using mechjeb ascent guidance. Anyone else having this issue? Didn\u0027t have a problem with the stock system."},{"CreatedByName":"wasml","CreatedById":120438,"CreatedDateTime":"2015-05-05T03:30:43Z","Content":"\u003E \n\u003E I want to look at changing this with something like Custom Asteroids Mod (if it still works)\n\nFYI - Custom Asteroids seems to be working in 1.0.2 - would be interesting going after asteroids in the leading and trailing Lagrange points of Kerbins gas giant."},{"CreatedByName":"KillAshley","CreatedById":128696,"CreatedDateTime":"2015-05-05T06:50:55Z","Content":"\u003E \n\u003E \\*snip\\*\n\nSo thaks for taking the time and letting me know dude, feedback like this is very important so lets adress the issues:\n\nOk SO! i did a fresh ksp install to check out whats happening, and yes i did indeed screw up Serran\u0027s atmosphere. It should have 0.4 atm pressure ASL, but it seems i have got it confused with Sonnah as it seems to share the same stats. I\u0027ll fix this immediately.\n\nAs far as the greatly reduced science science goes, I spoke about this earlier:\n\n\u003E \n\u003E The problem i have with Minmus, is that it\u0027s too easy to pillage for science. During early game, I\u0027d send ship after ship draining all science i can from that small low grav world, with little to no effort at all, and by the end of it the tech tree was (almost) complete! IMHO it ruined things for me, even though it was my fault for doing it, I could never resist the temptation of sending just one more ship to unlock the next node....\n\u003E So when i set out to make New Horizons, i wanted to create a challenge that I didn\u0027t find in the stock game. I wanted a completely new experience, one where I would have to work for my upgrades. I can understand this pack isn\u0027t for everyone, as every has different tastes, but for those looking for a better challenge and more variety should have a look.\n\nThe old way always left me feeling overpowered when i went to new planets, I wanted something that would challenge me, force me to make do with just a few parts for an Eve probe, make me improvise a lander for Duna. I took time creating a curve-based science mulitplier system, and adding a modifier for difficulty of reaching/landing on each body. True you can still grind away all the science at the KSC and I\u0027m certainly not going to stop you, but the intention behind everything is that you need to challenge yourself to making do with what you have to explore the system. oh, and Kerbin will get you the LEASt amount of science in the system, you do get more from sonnah/mun/aptur/serran, but not alot more. ![:wink:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)\n\nPerhaps i can release an alternate config option, leaving science based on the stock way if you really want. Although you will be incredibly overpowered really fast. Let me know what you think.\n\n\u003E \n\u003E I\u0027ve had some issues using mechjeb ascent guidance. Anyone else having this issue? Didn\u0027t have a problem with the stock system.\n\nI have heard there was issues with mechjeb previously, was hoping it was because of a conflict or a bad previous version. Unfortunately I\u0027ve never used it, so I wouldn\u0027t know what the issues mean. That being said, what exactly is the issue you\u0027re having?\n\n\u003E \n\u003E FYI - Custom Asteroids seems to be working in 1.0.2 - would be interesting going after asteroids in the leading and trailing Lagrange points of Kerbins gas giant.\n\nSweeeeeeet, I\u0027ll get onto it soon."},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2015-05-05T11:27:46Z","Content":"Exciting looking mod, I shall give this a go when I get home tonight ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nI feel like I\u0027ve read somewhere that attempts to make Kerbin a moon used to cause orbiting ships to disappear - is that no longer a thing?"},{"CreatedByName":"KillAshley","CreatedById":128696,"CreatedDateTime":"2015-05-05T11:42:13Z","Content":"Used to yes, stand alone kopernicus fixed this issue ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)\n\nI\u0027d probably wait till tomorrow if I were you. I\u0027\u0027ve found a few problems with atmospheres but need to wait till I finish work before I can upload the new update"},{"CreatedByName":"_Augustus_","CreatedById":115084,"CreatedDateTime":"2015-05-05T15:11:31Z","Content":"Please add that red giant Kerbol as an option and I will download this."},{"CreatedByName":"KillAshley","CreatedById":128696,"CreatedDateTime":"2015-05-05T16:11:51Z","Content":"Lol you\u0027re persistant with the red giant, ay? it\u0027s easy enough to do, the only issue would be the size/luminosity of the giant. I\u0027d have to shift all the orbits out, and then write a solar power curve that takes into account the suns light...I\u0027ll have a look into it, but at the moment the issue with atmospheres needs fixing ASAP"},{"CreatedByName":"HoloYolo","CreatedById":138353,"CreatedDateTime":"2015-05-05T16:13:12Z","Content":"\u003E \n\u003E Lol you\u0027re persistant with the red giant, ay? it\u0027s easy enough to do, the only issue would be the size/luminosity of the giant. I\u0027d have to shift all the orbits out, and then write a solar power curve that takes into account the suns light...I\u0027ll have a look into it, but at the moment the issue with atmospheres needs fixing ASAP\n\nI was thinking maybe, just maybe a comet or two. I would pay you (with a download) and do anything related with this mod."},{"CreatedByName":"KillAshley","CreatedById":128696,"CreatedDateTime":"2015-05-05T17:09:08Z","Content":"I actually had an idea for a sub-mod. Like a New Horizons minor bodies pack, designed to work for NH.\n\nThe idea is on the backburner though, until I\u0027m done polishing the main mod."},{"CreatedByName":"CaptRobau","CreatedById":41695,"CreatedDateTime":"2015-05-05T18:22:56Z","Content":"You can remove your SolarPowerCurve cfg as since 1.01 solar power is done without power curves"},{"CreatedByName":"KillAshley","CreatedById":128696,"CreatedDateTime":"2015-05-05T18:30:00Z","Content":"Awesome, didn\u0027t really check that out at all, cheers!\n\nIt\u0027ll be gone in the next update which should have atmospheres with correct pressure/temp curves I left put of the initial 1.0 release. Hopefully I can get it done tomorrow, depending on any issues I find along the way."},{"CreatedByName":"Therlun","CreatedById":133436,"CreatedDateTime":"2015-05-06T00:47:37Z","Content":"\u003E \n\u003E it seems i have got it confused with Sonnah as it seems to share the same stats.\n\nThat\u0027s one thing I forgot to mention. I think renaming some of the planets to make the names less similar would help. Planets should not have the same starting letter and the same number of syllables at the same time. Sonnah and Serran, Laythe and Lave, Arin and Atell being the main offenders. I would also change either Moh or Moho a bit. I get that one is the planet and the other is the moon, but it still slightly distracting since that particular planet/moon naming scheme is only used that once.\n\nWith enough play-time that effect will diminish and the player will have memorized it, but it does make getting into the new solar system more difficult.\n\n\u003E \n\u003E oh, and Kerbin will get you the LEASt amount of science in the system, you do get more from sonnah/mun/aptur/serran, but not alot more. ![:wink:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)\n\nAre you sure about Kerbin giving the least amount of science? According to my campaign experience and the .cfgs of Aptur and NH\\_VanillaScienceOverwrite it doesn\u0027t.\n\n    Aptur                                                               Kerbin landedDataValue = 0.71                            landedDataValue = 0.83inSpaceLowDataValue = 0.6                      inSpaceLowDataValue = 0.7inSpaceHighDataValue = 0.56                    inSpaceHighDataValue = 0.66recoveryValue = 0.71                                 recoveryValue = 0.83\n\nThat\u0027s what I mean when I said Aptur and the Mun are a waste of time. A surface sample from Aptur is worth notably less than one from Kerbin\u0027s grasslands (0.71 for Aptur, 0.83 for Kerbin). The Mun has almost the same data values as Kerbin, but is much more difficult to reach and return from.\n\nMy larger point is that there should be a remote connection between the difficulty and the science reward.\n\nAnother example: Leaving Sonnah\u0027s SOI and just doing high orbit science around the Sun (high space datavalue 13) gives twenty times the yield of the Mun. Which is in no relation to the effort/technology it requires to achieve. \n\nJust one trip out of Sonnah\u0027s SOI (without returning) will yield as much ore more science than thoroughly scouring (including landings and return trips) the Mun, Aptur and Serran combined.\n\nConcerning the science issue the mod has one overarching problem IMO: There is a conflict between the starting position and the need to balance it.\n\nPlacing Kerbin as a moon around a gas giant with several other moons makes the start more diverse and broadens the early game. It does make the start tougher and more interesting for sure. But the large reduction in science yields for those other moons makes it *less* rewarding and interesting at the same time as well, running directly against the reason to implement the new start to begin with. One of these issues has to be addressed in an extensive way to bring out the full potential of the mod in my opinion. \n\nIt is also worth keeping in mind that nerfing science yields has a lessened effect with the new processing lab, which allows you to generate infinite science anywhere if you really want it.\n\nThe easiest fix would be to remove one of the moons of Sonnah and up the science yield of the other two. But that would make it similar to the normal start again, with Kerbin and two moons, just slightly different in that all three are orbiting around Sonnah.\n\nAs an extreme solution I would change the starting position of Kerbin in a more drastic way again. I would have some suggestions here, but I don\u0027t just want to come barging into the thread and knocking over all your work for the sake of perceived balance.\n\nI really enjoy the mod. The changed solar system was what I was looking for. So I indeed hope all my criticisms come across as feedback from an interested player and not as pure complaints. ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)\n\nHave fun and thanks again for all your effort.\n\n**Edited \u003Ctime datetime=\u00222015-05-06T01:22:22Z\u0022 title=\u002205/06/2015 01:22  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 6, 2015\u003C/time\u003E by Therlun**"},{"CreatedByName":"KillAshley","CreatedById":128696,"CreatedDateTime":"2015-05-06T08:49:01Z","Content":"\u003E \n\u003E \\*snip\\*\n\ni see where you\u0027re coming from, don\u0027t worry I\u0027m not taking it as an attack. Balance is something i really want for the system and there\u0027s still a lot of work to do to get it right. Feedback is probably the only way I\u0027m finding these errors atm, as with working full time, the time i spend fixing the mod, and other IRL stuff leaves me no time to play the game to find these issues.\n\nI had a look at the configs and yeah it seems i have mixed up my numbers somewhere, the spreadsheet i used to calculate everything has quite a few different multipliers...I\u0027ll have to go back to my spreadsheet and make some changes to the science again and try to find where things went wrong.\n\nHow would you best suggest the tweaking of the numbers? obviously raising the starting moons to a higher touch. Maybe I should raise the whole scale which i based my numbers on to a slightly higher level, leaving the curve as you branch outwards through the system. Basically the way i made the scale, planets had an initial multiplier (Kerin was supposed to have 0.5/Sonnah was supposed to be 1 but that seems to not be right/laythe is 5) and then had a difficulty multiplier affecting it, then the modifiers for the different sciences (low/high space, landed, etc.) leaving the final numbers. I\u0027ll delay the atmosphere update i was going to release today to go over these numbers more and see how it goes.\n\nHaha I think I\u0027m too used to the names, really. They mainly got named back when i was just creating random planets to learn how it\u0027s done, way before i attempted a coherent system. Most of them are named after descriptive words i used for them (Ernus=Infernus/Arin=Arid/Derso=desolate) There are a few exceptions, like Lave was named after a argument with my housemate who called it the \u0027lavender colored planet\u0027, and Serran used to be a moon of a planet i ended up scrapping called Terran. Then theres Atell \u0026 Eli which used to be in a binary orbit at Vanor, which looked like an old RT setup i had, I called them s**ATELLi**te/sat**ELI**te. I can see there can be some confusion about the names but I\u0027m extremely bad at naming things, suggest a few names and I\u0027ll probably change them ![:wink:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif) Ideally i\u0027d rename Lave, don\u0027t quite know about the others, but if things get suggested that fit well I won\u0027t turn them down!"},{"CreatedByName":"Wolves_Hero","CreatedById":124106,"CreatedDateTime":"2015-05-06T21:39:00Z","Content":"I went to Serran planet but aero brake way too quick from 2300m/s to 15m/s in 1 sec on 50,000m ... broken parts on top. Serran bug or too much air pressure just 17 atm.\n\nPresMat Barometer I found 1atm on 50999m in 1 sec then 1500atm on surface holy crap lol.\n\nI alway aero brake with atmosphere planets slow down make orbit.\n\n**Edited \u003Ctime datetime=\u00222015-05-06T22:08:43Z\u0022 title=\u002205/06/2015 10:08  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 6, 2015\u003C/time\u003E by Wolves\\_Hero**"},{"CreatedByName":"KillAshley","CreatedById":128696,"CreatedDateTime":"2015-05-07T06:23:26Z","Content":"yeah sorry, atmospheres are a bit buggy atm, I\u0027ve almost got them perfected for the next update but for now thay are a little screwed up. I somehow mixed up serran\u0027s atmosphere and gave it 17 atm pressure asl when it\u0027s supposed to have 0.4. The barometer readouts always show 100x the atmosphere now, kerbain now says 100 asl. hopefully i can upload the new updated versions today."},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2015-05-07T06:54:02Z","Content":"\u003E \n\u003E Used to yes, stand alone kopernicus fixed this issue ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)\n\u003E I\u0027d probably wait till tomorrow if I were you. I\u0027\u0027ve found a few problems with atmospheres but need to wait till I finish work before I can upload the new update\n\nAwesome stuff, thanks for the reassurance ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nFinally got time to take a proper look and this planet pack is beautiful indeed ^^ Love the decision to make Laythe an inner planet - makes much more sense as a warm ocean world, and tingles my classic-sci-fi expectations of Venus before it was radar mapped.\n\nAnd at last, Dres is not a lonely potato! Does it still have procedural asteroids? ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"KillAshley","CreatedById":128696,"CreatedDateTime":"2015-05-07T07:36:07Z","Content":"Thanks mate. to be honest I\u0027ve been too busy trying to configure the atmospheres properly to see if dress has it\u0027s asteroids ![:(](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif) yeah the idea of laythe was exactly the same as yours, it seemed way more fitting to be an inner planet rather than an outer one...it just needed a little moon to keep it company ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\nI\u0027ll have the proper atmosphere setting done very soon, got a bit behind it due to work and other IRL stuff. At the moment ships grind to a halt as soon as they hit the outer atmosphere, which is pretty bad lol"},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2015-05-07T09:56:45Z","Content":"\u003E \n\u003E ...it just needed a little moon to keep it company ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\nThe moon for an oxygen atmosphere planet is actually very inline with current thinking; it regulates the axial tilt of the parent and provides tides to stir up the ocean currents, both of which are massive boons to living critters ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nIt may not be within your reach, but a tad more land area on Laythe wouldn\u0027t go amiss, if that\u0027s possible/easy? It was always a bit of a struggle to hit those little islands when using FAR (no trajectory predictions) and 1.0.2 kind of pushes towards that same scenario... Don\u0027t know whether it\u0027d be as simple as dropping the sea level by a few percent, depending on the landscaping under the surface?"},{"CreatedByName":"KillAshley","CreatedById":128696,"CreatedDateTime":"2015-05-07T10:04:52Z","Content":"it\u0027s doable, but i\u0027d need to custom edit the heightmap to provide more land mass, then do the texturing behind it. If you read the to-do list in the OP I\u0027m actually considering overhauling all stock bodies alternis-kerbol style, but thats once this is nice and stable and balanced which is more important for now!\n\nI\u0027m uploading another build now that (hopefully) fixes the issues with the atmospheres of the custom worlds....stops you insta-exploding when entering the atmosphere. Still got a lot of work to do with it, but its a small step forward at least."},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2015-05-07T10:10:30Z","Content":"Ok, good stuff - quite understand the priority decisions, always go for stability before frills ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif) Will pick up the new build after work tonight, thanks for sorting it out so fast ^^\n\n(I haven\u0027t even started a career since 1.0, so from my personal perspective you can go ahead and take aaaalll the time you need xD)\n\nOh, yeah, meant to ask; is there any kind of delta-v map for New Horizons?"},{"CreatedByName":"KillAshley","CreatedById":128696,"CreatedDateTime":"2015-05-07T10:12:07Z","Content":"haha its not 100% yet, drag is still a little over the top...but hopefully it stops ships insta-exploding during reentry, which is a good thing hopefully!"},{"CreatedByName":"KillAshley","CreatedById":128696,"CreatedDateTime":"2015-05-07T11:49:37Z","Content":"Update 1.4.1 live on curseforge\n\nFixed Serran\u0027s atmospheric pressure from being 18atm back to 0.4atm\n\nTweaked Serran\u0027s texture \u0026 normals slightly\n\nChanged all atmospheres to a better curve to (hopefully) stop instantly overheating ships\n\nAltered Sonnah system\u0027s science levels to a better starting position (more balance needed in future)"},{"CreatedByName":"ITAsimo456","CreatedById":131436,"CreatedDateTime":"2015-05-07T14:16:09Z","Content":"Don\u0027t use KSPRC, it\u0027s outdated, it glitched my game."},{"CreatedByName":"KillAshley","CreatedById":128696,"CreatedDateTime":"2015-05-07T17:11:45Z","Content":"yes, it hasn\u0027t been updated yet for 1.0, there are ways to get ksprc working though if you read the ksprc thread. I\u0027d remove the link, but there are still ways to get it installed so it\u0027s better to leave it for people that have installed it"},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2015-05-07T20:09:20Z","Content":"Not sure if this is your realm or Kopernicus\u0027, but I get very funny effects when flying near Sonnah... I can only zoom into my ship at 5x timewarp or higher - at 1x it sort of runs away from the camera along a diagonal path towards the top right of the screen ![:blush:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif)"}]}