{"TopicId":102763,"ForumId":16,"TopicTitle":"Scenario Creation Threads?","CreatedByName":"oriramikad","CreatedById":133379,"CreatedDateTime":"2015-03-27T02:34:43Z","PageNum":1,"Articles":[{"CreatedByName":"oriramikad","CreatedById":133379,"CreatedDateTime":"2015-03-27T02:34:43Z","Content":"\n\u003Cp\u003ECan someone refer me to threads on how to make in-game tutorials and scenarios? Searching the forums hasn\u0027t come up with much (or maybe I\u0027m just searching wrong). \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-27T15:54:16Z\u0022 title=\u002203/27/2015 03:54  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 27, 2015\u003C/time\u003E by oriramikad\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Scarecrow88","CreatedById":66043,"CreatedDateTime":"2015-03-27T06:33:13Z","Content":"\n\u003Cp\u003EI created some scenarios from beginner to advanced, each containing a variety of available tasks, from flying aircraft, launching to orbit and rendezvous and docking. I am on iPhone at the moment but if no one else has replied by the time I get home, I will see if I can give a more detailed answer.\u003C/p\u003E\u003Cp\u003EETA:\u003C/p\u003E\u003Cp\u003EI see no one else has chipped in, so I will see if I can get you started by describing what I did.\u003C/p\u003E\u003Cp\u003EFirst thing is to start a new game save. Give it a distinct name to keep it separate from your normal game saves. I set mine up in Sandbox mode so that I had access to all the parts I needed.\u003C/p\u003E\u003Cp\u003EIn the new game save, you can either build the ships/structures you need, or copy them in to the appropriate ship folders.\u003C/p\u003E\u003Cp\u003EPut all your vehicles/craft/structures in to their starting positions. To make this easier, you might want to use hyperedit.\u003C/p\u003E\u003Cp\u003EOnce everything is in place, you can quit out of the game.\u003C/p\u003E\u003Cp\u003EYou now need to find the saved persistent.sfs file from this game and copy and paste it in to the scenarios folder in your game folder structure.\u003C/p\u003E\u003Cp\u003EOnce in the scenarios folder, you should rename it as appropriate. You will see the stock scenario files in this folder, and the names you see and use here is how they will appear on the scenario menu in game.\u003C/p\u003E\u003Cp\u003EYou will now need to edit this persistent file. I use Microsoft notepad to do this, but any standard text editor should do.\u003C/p\u003E\u003Cp\u003EIn the first few lines you can amend the title and should add a description.\u003C/p\u003E\u003Cp\u003EIf you have more than one craft in your scenario and want to give the player a choice of which one he controls, change the line scene = n, to scene = 8 This will put them in the tracking station view with the option of selecting which craft to control\u003C/p\u003E\u003Cp\u003EIf you want your scenario to start with the player in control of a craft, change the line scene = n to scene = 7, but note that this will default to the first craft in the vessel section of the file. I have had asteroids occupy this part, so if this happens to you, you will need to delete the data for the asteroid.\u003C/p\u003E\u003Cp\u003EOther parts that may or may not wish to change, depending on what facilities you want to make available to the player are the following lines, which you will find near the beginning of the file:\u003C/p\u003E\u003Cp\u003ECanLeaveToEditor =\u003C/p\u003E\u003Cp\u003ECanLeaveToTrackingStation =\u003C/p\u003E\u003Cp\u003ECanLeaveToSPaceCenter =\u003C/p\u003E\u003Cp\u003ECanLeaveToMainMenu =\u003C/p\u003E\u003Cp\u003EThe default values for a normal game save are True, True, True and False respectively. Each should be self explanatory, and the stock scenarios have these set as False, False, False and True respectively.\u003C/p\u003E\u003Cp\u003EYou can choose to set them as your own scenario requires.\u003C/p\u003E\u003Cp\u003EI think that\u0027s about it, and hope that helps.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-27T15:17:35Z\u0022 title=\u002203/27/2015 03:17  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 27, 2015\u003C/time\u003E by Scarecrow88\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"oriramikad","CreatedById":133379,"CreatedDateTime":"2015-03-27T15:48:05Z","Content":"\n\u003Cp\u003EWow, thanks!\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2015-03-27T18:46:07Z","Content":"\n\u003Cp\u003EIn \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/28352-The-Drawing-Board-A-library-of-tutorials-and-other-useful-information\u0022 rel=\u0022external nofollow\u0022\u003EThe Drawing Board\u003C/a\u003E the only in-game tutorials made by players are by blizzy98, who of course also has several mods to his credit.\u003C/p\u003E\u003Cp\u003EYou might want to download those and look at the source code in C#\u003C/p\u003E\n"},{"CreatedByName":"ilo","CreatedById":130783,"CreatedDateTime":"2015-03-29T08:23:45Z","Content":"\n\u003Cp\u003EHere is a tutorial on writting tutorials..\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/23028-Article-Writing-Tutorials-A-Demo-%28and-some-source-code%29?p=1584655\u0026amp;viewfull=1#post1584655\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/23028-Article-Writing-Tutorials-A-Demo-%28and-some-source-code%29?p=1584655\u0026amp;viewfull=1#post1584655\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"ilo","CreatedById":130783,"CreatedDateTime":"2015-03-29T13:39:09Z","Content":"\n\u003Cp\u003EAdditionally, if you create a custom Scenario addon or a tutorial, you will have to make sure the module is loaded with the game. For this you must make sure your addon DOES NOT START on every game automatically and you have to add it to your SFS file manually.\u003C/p\u003E\u003Cp\u003EEdit your SFS tutorial or Scenario and add the following chunk as a new Scenario module (you will find other scenarios being loaded in the SFS file as well).\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.vbulletin.org/forum/misc.php?do=bbcode#code\u0022 rel=\u0022external nofollow\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E[/URL]\u003Cbr\u003E\tSCENARIO\u003Cbr\u003E\t{\u003Cbr\u003E\t\tname = THENAMEOFYOURSCENARIOORTUTORIALCLASS\u003Cbr\u003E\t\tscene = 5, 7, 8, 6 // the scenes you want your class to be instantiated.\u003Cbr\u003E\t}\u003Cbr\u003E[URL=\u0022http://www.vbulletin.org/forum/misc.php?do=bbcode#code\u0022]\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EJust need to put in there your module name and the scenes to load your addon. When the Scenario or Tutorial (the sfs file) gets loaded, KSP will find your scenario and spawn it.\u003C/p\u003E\u003Cp\u003EWen you have everything ready, you would want to change your game mode to Scenario (within the main Game node there is a \u0022Mode\u0022 Attribute), or Scenario no resumable if you don\u0027t want the player to abandon it in the middle and continue later.\u003C/p\u003E\u003Cp\u003EGood luck!\u003C/p\u003E\n"}]}