{"TopicId":102781,"ForumId":29,"TopicTitle":"Making a personal mod - .dll question","CreatedByName":"MatterBeam","CreatedById":133334,"CreatedDateTime":"2015-03-27T14:33:27Z","PageNum":1,"Articles":[{"CreatedByName":"MatterBeam","CreatedById":133334,"CreatedDateTime":"2015-03-27T14:33:27Z","Content":"\n\u003Cp\u003EHi.\u003C/p\u003E\u003Cp\u003EI\u0027m making a reactor mod for personal use only. I can handle the .cgf file part, but the .dll is a complete mystery.\u003C/p\u003E\u003Cp\u003EThe original mod is Near Future Electrical. Due to interactions with KSP Interstellar and the whole Waste Heat, Ec/s, KW, MW and MJ resource messes that result, their performance rapidly degrades in orbit. Their temperatures always rise despite an abundance of radiators, and with it, they have a performance drop not predicted by the Thermal Manager toolbar in the VAB. \u003C/p\u003E\u003Cp\u003EPlus, the Near Future Engines use Ec/s, the reactors generate KW and the radiators remove MW.\u003C/p\u003E\u003Cp\u003EMy idea was to create a folder that contained reactors that:\u003C/p\u003E\u003Cp\u003E-Had the Near Future Electrical models (resized, or I resize and reskin stock models, I\u0027m not sure for now)\u003C/p\u003E\u003Cp\u003E-Used the .cfg file parameters of the stock RTG\u003C/p\u003E\u003Cp\u003EIt was simple and clearcut work, until I realized I had to deal with the \u0027plugin\u0027 folder, and it contained a file called \u0027NearFutureElectrical.dll\u0027, that my trusty Notepad\u002B\u002B could not read.\u003C/p\u003E\u003Cp\u003EWhat should I do?\u003C/p\u003E\n"},{"CreatedByName":"Crzyrndm","CreatedById":92871,"CreatedDateTime":"2015-03-27T20:30:45Z","Content":"\n\u003Cp\u003EIf you\u0027re using only the stock RTG modules, you can remove the .dll\u003C/p\u003E\u003Cp\u003EIf you\u0027re using one of Nertea\u0027s custom modules, you leave the .dll somewhere in GameData (only need one copy)\u003C/p\u003E\u003Cp\u003EThe .dll provides the game with information on how the capacitor/generator/reactor modules should function.\u003C/p\u003E\n"},{"CreatedByName":"MatterBeam","CreatedById":133334,"CreatedDateTime":"2015-03-27T21:24:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Crzyrndm\u0022 data-cite=\u0022Crzyrndm\u0022\u003E\u003Cdiv\u003EIf you\u0027re using only the stock RTG modules, you can remove the .dll\u003Cp\u003EIf you\u0027re using one of Nertea\u0027s custom modules, you leave the .dll somewhere in GameData (only need one copy)\u003C/p\u003E\u003Cp\u003EThe .dll provides the game with information on how the capacitor/generator/reactor modules should function.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, I found out through empirical testing.\u003C/p\u003E\n"}]}