{"TopicId":102876,"ForumId":16,"TopicTitle":"Oscillating ship when SASing","CreatedByName":"seyss","CreatedById":137952,"CreatedDateTime":"2015-03-28T21:29:13Z","PageNum":1,"Articles":[{"CreatedByName":"seyss","CreatedById":137952,"CreatedDateTime":"2015-03-28T21:29:13Z","Content":"\n\u003Cp\u003EHello,\u003C/p\u003E\u003Cp\u003EFor some reason my ship shakes and oscillates when I burn using SAS pointed to prograde/retrograde/normal/anti-normal/radial/anti-radial as shown in the video below. (when pointed to Stability Assist there\u0027s no shake)\u003C/p\u003E\u003Cp\u003ECan anyone give me any info about this oscillation? It ends up screwing my injection burns. Thanks.\u003C/p\u003E\u003Cp\u003ENote: between the big fuel tank and the other engine (next stage), I have an Advanced Reaction Wheel. So there are 3 torques here being used by SAS: engine gimbal, adv. reaction wheel, and the reaction wheel in the command pod.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/pLFAWloO3DE?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-04-13T01:33:04Z\u0022 title=\u002204/13/2015 01:33  AM\u0022 data-short=\u00229 yr\u0022\u003EApril 13, 2015\u003C/time\u003E by seyss\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Slam_Jones","CreatedById":125101,"CreatedDateTime":"2015-03-28T21:32:24Z","Content":"\n\u003Cp\u003EYou might need to put some struts from the tank up to the trusses. If you don\u0027t have it yet, I recommend Kerbal Attachment System, which gives you (among other things) struts that can be placed and moved while in flight.\u003C/p\u003E\u003Cp\u003EEdit: Another option might be to add SAS to the ends of the trusses to keep em stable.\u003C/p\u003E\n"},{"CreatedByName":"WuphonsReach","CreatedById":130759,"CreatedDateTime":"2015-03-28T21:49:04Z","Content":"\n\u003Cp\u003EOr add the Kerbal Joint Reinforcement mod.\u003C/p\u003E\n"},{"CreatedByName":"Reactordrone","CreatedById":110060,"CreatedDateTime":"2015-03-28T21:58:42Z","Content":"\n\u003Cp\u003EYeah, even with small ships the the SAS direction holds cause vibrations as they try to constantly adjust the ship heading.\u003C/p\u003E\n"},{"CreatedByName":"Deutherius","CreatedById":125381,"CreatedDateTime":"2015-03-28T23:03:02Z","Content":"\n\u003Cp\u003EIt\u0027s not a problem with your design, the fault lies in stock SAS. Any craft told to point pro/retrograde (or other directions determined by orbit) will wobble, as the SAS is overcompensating for its own movement - unless being pointed \u003Cstrong\u003Eexactly\u003C/strong\u003E in the direction you want it to and having no thrust offset torque whatsoever. And even then it\u0027s not going to last, because when you thrust, you change the orbital parameters and therefore the precise position of the node itself, which the ship is going to try and follow - and overcorrect itself.\u003C/p\u003E\u003Cp\u003EYou can observe this effect more clearly when you tell your craft to point somewhere and it has to turn around on its own - it\u0027s going to go full reaction wheel/RCS power until it reaches the correct position, and ONLY THEN it\u0027s going to try correcting any momentum that\u0027s left (which is a lot, usually). This causes the craft to wobble back and forth over the chosen node as it overcorrects a little less each time.\u003C/p\u003E\u003Cp\u003EThe reason why simple stability assist doesn\u0027t wobble is it\u0027s not trying to point anywhere in particular, it\u0027s just trying to kill any rotational momentum by producing torque in the opposite direction, until the ship is steady.\u003C/p\u003E\u003Cp\u003EThe solution is simple - use less thrust (so the ship has less momentum to overcorrect), turn on smooth controls (caps) or use stability assist, and pray for SQUAD to implement a better node tracking method.\u003C/p\u003E\n"},{"CreatedByName":"Mad Rocket Scientist","CreatedById":139256,"CreatedDateTime":"2015-03-28T23:15:52Z","Content":"\n\u003Cp\u003ETurning off one of your control systems should help.\u003C/p\u003E\n"},{"CreatedByName":"bakanando","CreatedById":126310,"CreatedDateTime":"2015-03-29T00:00:21Z","Content":"\n\u003Cp\u003EThe gimbaling engine will give you the worst wobble so locking it will help.\u003C/p\u003E\u003Cp\u003E But as was mentioned earlier, this is an implementation bug (feature?) that is better fixed by not using it. Struts and disabling one or two control parts will definitely help though.\u003C/p\u003E\n"},{"CreatedByName":"seyss","CreatedById":137952,"CreatedDateTime":"2015-03-29T00:02:47Z","Content":"\n\u003Cp\u003EI tried disabling other control parts and the effect was undesirable.. I put a couple of struts as Slam_Jones said [in Scott Manley\u0027s voice] and....... [/in Scott Manley\u0027s voice] problem fixed! Thanks.\u003C/p\u003E\n"},{"CreatedByName":"Slam_Jones","CreatedById":125101,"CreatedDateTime":"2015-03-29T00:58:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022seyss\u0022 data-cite=\u0022seyss\u0022\u003E\u003Cdiv\u003EI tried disabling other control parts and the effect was undesirable.. I put a couple of struts as Slam_Jones said [in Scott Manley\u0027s voice] and....... [/in Scott Manley\u0027s voice] problem fixed! Thanks.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENice! Glad I could help \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}