{"TopicId":102862,"ForumId":39,"TopicTitle":"MY Kerbal Backstory- and future. With spoilers to future writings (Pictures coming soon, I hope)","CreatedByName":"Rolanvorxariat","CreatedById":117146,"CreatedDateTime":"2015-03-28T17:15:12Z","PageNum":1,"Articles":[{"CreatedByName":"Rolanvorxariat","CreatedById":117146,"CreatedDateTime":"2015-03-28T17:15:12Z","Content":"\n\u003Cp\u003EOkay, so, with so many people writing their own Kerbal histories, i decided to write my own. Here it is.\u003C/p\u003E\u003Cp\u003ESome terminology:\u003C/p\u003E\u003Cp\u003EBHE (Before History Era)\u003C/p\u003E\u003Cp\u003ERHE(recorded History era)\u003C/p\u003E\u003Cp\u003EMKE(Modern Kerbal Era)\u003C/p\u003E\u003Cp\u003EKE(Kold Era)\u003C/p\u003E\u003Cp\u003ENKE(New Kerbal Era)\u003C/p\u003E\u003Cp\u003EAKS(Advenced Kerbal Society Era)\u003C/p\u003E\u003Cp\u003ESE(Superluminal Era)\u003C/p\u003E\u003Cp\u003EStory on the existence of the kerbal universe\u003C/p\u003E\u003Cp\u003ESo, at first, the universe was just a \u0022floating\u0027 city in the bulk (The space outside of the universe, except the universe didn\u0027t exist at the time), on the planet of MeksicoCity. It was a highly intelligent civilization, but a few professors in the city were bored. So, they decided to create a universe, a brane, and observe it. so, They started on the project and formed a group called Squad, led by Harvesteros. The group worked for millenias and millenias, and finally, released their masterpiece in a large explosion known to modern day kerbls as \u0022The Big Kerblooey Theory\u0022. They created the universe with a single star and planet, with life, and all sort of exotic metals and other elements. They weren\u0027t satisfied. SQUAD first added a stationary moon called the \u0022Mun\u0022 to the skies of Kerbin. They thought there needed to be more interesting life on the planet, and thus, they modeled and created the kerbals. They still weren\u0027t satisfied. As kerbalkind eveolved, they programmed proper physics and relativity in, readying to release a whole bunch of other celestial objects, which are the present day planets and moons. But at the same time, kerbalkind had it\u0027s own path.\u003C/p\u003E\u003Cp\u003EBHE (No years listed- This is before properly recorded history\u003C/p\u003E\u003Cp\u003EKerbals began growing more intelligent, based on their nature to go \u0022Huh?\u0022 This made them become curious, and they tried to figure out everything in nature. They lived in small nomadic bands at first, but as more kerbals started arising and Kerbalkind figured out how to farm, tthey started forming tribes, and eventually, city-states. The stongest city-states, the Kromus and Kerbilonia, conquerd the surrounding city states and formed the first empires, The Kesopotamian and KSPQR empire. The empires eventually were united under the Greakerbs, the most intelligent civilization at the time. The greakerbs invented Kapitolism, Demokracy, and algebra. It was around this time when some famous and influencial Kerbals started popping up. \u003C/p\u003E\u003Cp\u003EThe scientific revolution(200 RHE- 14 MKE)\u003C/p\u003E\u003Cp\u003EIt was Isiah Keomaneton that began it all.He first discovered the laws of physics, and found that the Mun and Minmus where far away, not in the atmosphere. Keristoles Manley found the value of Pi and founded Kalculus Academy, a colledge dedicated to Mathematics and Science. Keristoles\u0027s apprentice, Kerplerana Von Kerman, discovered the moons of Kerbin have elliptical motions, and invented the telescope to further observe. Jalililei Kaimana, a astronomer from the neighboring empire of Kina, got his hands on a telescope, and first discovered Eve, Duna/Ike, and Jool, though he had no idea that the dots next to it were mons and the lined obscuring his view were rings (In my universe, Jool Has rings). The Greakerb Union collapsed due to poor rule, and the nations of Keomaneteonis, Feranence, and Kausland. This was a proper beginning for modern Kerbal society. And finally, The kinese Tsiolkovsky Koddarda invented rocket fuel, and invented fireworks.\u003C/p\u003E\u003Cp\u003EThe Society Revolution(39MKE-102MKE) and The Great War of Kerbin(99MKE-118MKE)\u003C/p\u003E\u003Cp\u003EKerbal society was founded, and while politics was the main thing, scientific research remained strong. A group of astronomers speculated the location Eeloo and discovered Moho, as well as a Asteroid Belt around Kerbol. Molecules, like Propellium (P), Oxium (O2),and Karbon dioxide (KO2) where mostly discovered, and a new isotope of propellium, Deuterillium, was discoverd to explain how Kerbol generated energy through fusion. Karllson Maerks founds Maerksism in Feranence, while Adleys Hetliris founded the Kahszi Reihk, which won over Keomeneteonis through propanganda. Short-range Telephone and telegraph was created, and people could communicate with each other. At about this time, the Kinese empire began it\u0027s political ascent. The Reihk was hungry for power and global domination, so it invaded Feranence, completely taking it over. This was the beginning of the Great War of Kerbin. Aircraft was developed and put into mass production, and propellors were invented. rockets were put into Military use, and rocket developement centers popped up everywhere. Kina became a nation and took south Feranence, while Kausland Developed The Blutonium Bomb. To end the war, Kausland launched the first ICBM at the kapitol of the Reihk, Kerlin, and blew it up to ruins.\u003C/p\u003E\u003Cp\u003EPost-war recovery, and the formaion of Konastra(120 MKE-344MKE)\u003C/p\u003E\u003Cp\u003EWith so many bombers left from the war, the various nations converted them to passenger planes, starting the first commercial use of planes. Rockets were put into secret storages, as the public opinion on them was terrifying. keomaneteonis became a Kapitolist Nation, while Feranece recovered. Kinese society advanced, while the othwer societies declined. Kausland split into Great Kausland And Keoland. New Kausland Conquered lands to the east, and arrived at the continent of Kolus, establishing the Territory of Konastra. Konastra struck Gold. Well, black Gold. Propellium, Petroleum, Blutonium, Explodium- The oil reserved were enormous. Konastra demanded independance, and it got just that. The econmy of Konastra Rose like a rocket ascending, and it began a industrial revolution. Life was utopia. And then it all went wrong, as SQUAD got bored.\u003C/p\u003E\u003Cp\u003EDead Era(344MKE-1KE, period of 40 years)\u003C/p\u003E\u003Cp\u003EKerbal civilization collapsed, Konastra\u0027s welthiest bank, Kehyman Brothers, shattered. The global economy was in chaos, and a grat depression started. Then Kebin unleashed its fury. the Supervolcano Krakentoa erupted, and destroyed the land of West Konastra, forming the Kraken sea. Global temperatures skyrocketed, nd earthquakes where everywhere. kerbal society was gone, and only a few million or so kerbs remained alive. But fortunately, the era came to and end, and society was refounded- under the evil of Kerpilasrism and Mediskenism. The nations of USKK and CFKN were born, and their fate is up for brilliant writer Calculuswarrior to decide on his story, the Kold War.\u003C/p\u003E\u003Cp\u003EKold Era\u003C/p\u003E\u003Cp\u003Eread:\u003Ca href=\u0022https://sites.google.com/site/koldwarstory/\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://sites.google.com/site/koldwarstory/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThen, a few decaes after whatever Calculus warrior does in his story, a kerbal revolution overthrows the two governments, and a new, brighter era began. that will be in the next post.\u003C/p\u003E\n"}]}