{"TopicId":102894,"ForumId":20,"TopicTitle":"Conceptual Idea - Mission Control Centre","CreatedByName":"Ork","CreatedById":139856,"CreatedDateTime":"2015-03-29T02:17:18Z","PageNum":1,"Articles":[{"CreatedByName":"Ork","CreatedById":139856,"CreatedDateTime":"2015-03-29T02:17:18Z","Content":"\n\u003Cp\u003EHello all.\u003C/p\u003E\u003Cp\u003EPlease excuse my ineptness, I\u0027m not great with forums.\u003C/p\u003E\u003Cp\u003EI had an idea the other night and thought I\u0027d run it by you all.\u003C/p\u003E\u003Cp\u003EThis is, I suppose, for those who like a little realism to their KSP but potentially for any other player in general.\u003C/p\u003E\u003Cp\u003EA mission control center that is just that, mission control. Somewhere you can run you missions from in a more detached manner as opposed to the very omnipresent way in which the game is currently structured to play.\u003C/p\u003E\u003Cp\u003EI should state at this juncture that I have absolutely no skill in programing what so ever! I am a drawer, artist, thinker. I have about as much programing knowledge as a dead non-programmy thing that can\u0027t program.\u003C/p\u003E\u003Cp\u003EThis is a quick conceptual idea of how the mod may look.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i8.photobucket.com/albums/a27/OrkHarrid/Mission%20Control_zps8muuos2j.png\u0022 alt=\u0022Mission%20Control_zps8muuos2j.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EEach screen could/would be interchangeable with the main screen (the one in the middle). The screens themselves would be customizable dependent on what the user wanted.\u003C/p\u003E\u003Cp\u003EThe Kerbal flag (with the light on) would be replaced with whichever flag was used by the user and the flags up top are for nothing more than place filling and aesthetics.\u003C/p\u003E\u003Cp\u003EThe idea is that the game is played from this center instead of using the 3rd person \u0027god cam\u0027 to give a more authentic feel to the whole shebang. This would kick in one the user went to the launch pad.\u003C/p\u003E\u003Cp\u003EAnyone with any ideas on how this would/could be done?\u003C/p\u003E\u003Cp\u003ECould it be done?\u003C/p\u003E\u003Cp\u003EDoes anyone want it to be done?\u003C/p\u003E\u003Cp\u003EWhy are women drawn to shoes?\u003C/p\u003E\u003Cp\u003EWhy do men refuse to hug?\u003C/p\u003E\u003Cp\u003EWhy am I asking these questions?\u003C/p\u003E\u003Cp\u003EWhy am I still up at 02:30?\u003C/p\u003E\u003Cp\u003EWhy is all the rum gone?\u003C/p\u003E\u003Cp\u003EAll this and more, for no apparent reason....\u003C/p\u003E\u003Cp\u003EThank you for your time guys \u0027n\u0027 girls.\u003C/p\u003E\n"},{"CreatedByName":"hab136","CreatedById":75997,"CreatedDateTime":"2015-03-29T09:24:47Z","Content":"\n\u003Cp\u003ECheck out \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/67450-WIP-IVA-PLUGIN-ProbeControlRoom-1-0-beta8a-IVA-All-the-things%21-new-3D-RPM-17\u0022 rel=\u0022external nofollow\u0022\u003EProbe Control Room\u003C/a\u003E. Be sure to read through the thread, there are some updates like \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/67450-WIP-IVA-PLUGIN-ProbeControlRoom-1-0-beta8a-IVA-All-the-things%21-new-3D-RPM-17?p=1567185\u0026amp;viewfull=1#post1567185\u0022 rel=\u0022external nofollow\u0022\u003Ethis one\u003C/a\u003E\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/licM2\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Ork","CreatedById":139856,"CreatedDateTime":"2015-03-30T01:15:04Z","Content":"\n\u003Cp\u003EHi Hab136,\u003C/p\u003E\u003Cp\u003EThank you for your response.\u003C/p\u003E\u003Cp\u003EI\u0027ve given this a go and I have to say it\u0027s not bad at all, gave me a good chuckle. Even though it appears some bits do not work well 0.90.\u003C/p\u003E\u003Cp\u003EIt is not however totally to my liking so I may have to see if I can mess around a bit. What I really want is to lay it out in a very similar fashion to the quick pic I posted, but without the people and with more MFD\u0027s.\u003C/p\u003E\u003Cp\u003ESo a cross between PCR and my piccy.\u003C/p\u003E\u003Cp\u003EAn example would be that rather than having all those chunky buttons taking up valuable space, the screens could be changed via right click menus or something similar. Leaving more room for screens and less clutter.\u003C/p\u003E\n"}]}