{"TopicId":102959,"ForumId":24,"TopicTitle":"How hard is now to learn the game ?","CreatedByName":"roarke","CreatedById":27433,"CreatedDateTime":"2015-03-30T09:24:41Z","PageNum":1,"Articles":[{"CreatedByName":"roarke","CreatedById":27433,"CreatedDateTime":"2015-03-30T09:24:41Z","Content":"I played the first demo in the past and didn\u0027t reach even the moon. I have now a new pc, besides the slower netbook. How hard is now to learn the game ? I\u0027m attracted, but not like physics (Newton etc.). If i were, i will among the few in my peoples country. I\u0027m sensing that the game goes from some time in a more physical approach and less than a 100 % video game."},{"CreatedByName":"Flixxbeatz","CreatedById":29991,"CreatedDateTime":"2015-03-30T10:10:08Z","Content":"Like what some guy said here, \u0022KSP doesn\u0027t have a learning curve, it\u0027s more of a learning wall\u0022"},{"CreatedByName":"Dazpoet","CreatedById":132380,"CreatedDateTime":"2015-03-30T10:54:32Z","Content":"your biggest challange is getting into orbit. Once there you\u0027re halfway to anywhere in the game.\n\nTo get into orbit build a rocket and fire straight up, at 10 000 metres height tip the rocket 45 degrees to the \u0022right\u0022 and keep burning while watching mapview (press the \u0027M\u0027 key). When you apoapsis is around 90km stop burning and aim the rocket towards the green/yellow prograde marker and start burning when you\u0027re close to the apoapsis. Once you have a circular orbit you have mastered the arguably toughest challange in the game from a newbie perspective ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"PawelECieslak","CreatedById":116672,"CreatedDateTime":"2015-03-30T14:48:57Z","Content":"Kerbal Space Program, as a game, is really easy to learn - but almost impossible to master. Even Scott Manley, one of the biggest authorities in KSP community, makes simple mistakes. I would recommend watching some tutorials and \u0027gameplays\u0027. Once you see how it\u0027s done by someone else you can try to copy it, and once you can do it their style you can try to make your own flying style. Kerbal Space Program is not about perfection - so don\u0027t expect from yourself to ace every mission on first try - have fun and with time you should get hang of enough maneuvers and tricks to fly wherever you want.\n\nBut, as would Scott Manley say: \u0022Fly safe.\u0022"},{"CreatedByName":"sgt_flyer","CreatedById":57690,"CreatedDateTime":"2015-03-30T16:12:38Z","Content":"You can see ksp \u0027learning curve\u0027 as a series of big tall steps ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif) you\u0027ll start with getting to orbit, then orbital manoeuvers, then orbital rendez-vous, then launch windows, etc ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif) once you get the \u0027how\u0027 one of these steps work, you won\u0027t forget it ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif) (and once you managed to be able to do those steps easily, you\u0027ll try to do harder challenges - be it in mission complexity, VAB designs, etc)\n\nOnce understood, the basic concepts behind spacecraft are somehow simple - it just needs to clic into place for you ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nOne of the things the game has which helps a lot, is the manoeuver tool - which has been a great help since his implementation, has imroved nicely over time. One tip about it : clic and drag the middle ring around your current orbit ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)"},{"CreatedByName":"Mad Rocket Scientist","CreatedById":139256,"CreatedDateTime":"2015-03-30T20:12:01Z","Content":"If you want to go to every planet in KSP, you\u0027re going to have to learn a lot; but if you want to just build kerbal deathtraps, then it won\u0027t be very hard. That\u0027s the great thing about KSP, you can do whatever you like! People make anything and everything: [http://forum.kerbalspaceprogram.com/threads/52548-What-are-the-weirdest-things-you-ve-done-in-KSP](https://forum.kerbalspaceprogram.com/threads/52548-What-are-the-weirdest-things-you-ve-done-in-KSP)\n\nYou can build a submarine, or a ship, or hyperedit a kerbal bowling alley to minimus! You can build the [Eiffel tower](http://imgur.com/a/2eVh2#0)\n\nOr a WW2 bomber with working propeller engines!\n\nThe motto of KSP is: How hard can rocket science be any way? And the answer is: As hard as you want."},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2015-03-31T01:12:12Z","Content":"This demo rocket did a mum orbit and return\n\n![oFErrqg.jpg](http://i.imgur.com/oFErrqg.jpg)\n\n![X63Uy3X.jpg](http://i.imgur.com/X63Uy3X.jpg)\n\nThis demo rocket made it to Mun and back with ease.\n\n![ZKwYv2M.jpg](http://i.imgur.com/ZKwYv2M.jpg)\n\n![QcmRBwb.jpg](http://i.imgur.com/QcmRBwb.jpg)\n\nThe game is as easy or has hard as you make it in playing career. Go easy steps at a time to build up your skills.\n\n**Edited \u003Ctime datetime=\u00222015-03-31T01:16:36Z\u0022 title=\u002203/31/2015 01:16  AM\u0022 data-short=\u00229 yr\u0022\u003EMarch 31, 2015\u003C/time\u003E by SRV Ron**"},{"CreatedByName":"mattinoz","CreatedById":118580,"CreatedDateTime":"2015-03-31T01:35:05Z","Content":"If your happy for a combo of mods and revert to save to be your co-pilot then you don\u0027t need to learn that much at all.\n\nThat being said the more you play the more you want to learn it\u0027s sneaky addictive like that."},{"CreatedByName":"Thraeorn","CreatedById":132746,"CreatedDateTime":"2015-04-03T08:47:52Z","Content":"The game is easy to learn and it is easy to build something that would fly, orbit can be achieved easy with just the beginning parts if you were to do career. But there are a few things the game doesn\u0027t tell and it is for that reason there is even discovery at all. After a while with the game it becomes addicting as you try to push your rockets further and further. The UI is simple enough not to create confusion. Altimeter, Speedometer and thrust level indicator. Other lights let you know if your RCS or SAS is enabled. The top of the screen in the upper right gives you a few statistics on your fuel and battery levels. Since the game takes a bit of a comical simulator approach resourses is important. No diffrent than the sims where feeding them keeps them from starving. Electricity is need to keep your kerbals from not going anywhere. Fuel and other sourses as well come to play but isn\u0027t hard to understand as all the capasities are labeled when you create your vessel. \n\nCreating is one of the major areas this game shines as you just build and as the game doesn\u0027t always have goals other than exploration. You can go wild Unless in career where there may be contracts but even there you can go wild! All parts are listed on the left of the screen as you are taken to the vehicle assembly building or hanger. It is just a matter of picking parts then arranging them. If you can play minecraft then you can build in this game and create. The limits is in the physics if it will fly like a rocket, plane or just make pretty fireworks. Either way it isn\u0027t hard to do either and many tutorials are build in the game to help out with any new players. Wernher von Kerman is a very insightfull man when it comes to new players as his tutorials will help you get off the ground easy. In career mode the contracts also simplify things by starting small and allowing only afew parts this makes it easier to learn by building up to bigger things. In the end it still is up to you how you want to play and if you wish, you might just like the fireballs left on your runway. \n\n[h=1][/h] Jump to: [navigation](http://wiki.kerbalspaceprogram.com/wiki/Wernher_von_Kerman#mw-navigation), [search](http://wiki.kerbalspaceprogram.com/wiki/Wernher_von_Kerman#p-search)"},{"CreatedByName":"Climberfx","CreatedById":57126,"CreatedDateTime":"2015-04-04T20:00:57Z","Content":"For me, the best way to learn the game, are putting your face on, and try and error.\n\nKeep doing things and watching the results.\n\n![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2015-04-05T01:56:16Z","Content":"Yeah, I agree with Climber. Just get in there and get your hands dirty!\n\nThe game is actually not to hard to learn from a physics standpoint. There\u0027s virtually no math or anything required. But most people find that after learning a few key tasks (landing on the Mun being one of the biggest ones), you actually start to *want* to learn more, so that you can progress even faster.\n\nWelcome to the forums! ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\nCheers,\n\n~Claw"},{"CreatedByName":"Lohan2008","CreatedById":80945,"CreatedDateTime":"2015-04-05T02:20:55Z","Content":"Practice the tutorials, have a look at Scott Manley\u0027s youtube page. KSP is a game, play it for the fun, enjoy the challenge."},{"CreatedByName":"roarke","CreatedById":27433,"CreatedDateTime":"2015-04-05T08:12:54Z","Content":"Thank you all."}]}