{"TopicId":103158,"ForumId":25,"TopicTitle":"The mega Eve SSTO competition","CreatedByName":"Deddly","CreatedById":62955,"CreatedDateTime":"2015-04-01T18:20:33Z","PageNum":1,"Articles":[{"CreatedByName":"Deddly","CreatedById":62955,"CreatedDateTime":"2015-04-01T18:20:33Z","Content":"Nobody has ever tried it before, and there has never been a challenge for it, so here it is, people, the big one!\n\nBuild a stock SSTO for Eve.\n\nNo cheats, no mods, no parts clipping, no bugs exploitation.\n\nPOINTS SYSTEM\n\nMake a SSTO that works on Eve: 500 points\n\nFor every unit of payload: 1 point\n\nBONUS\n\nMake it able to take off from Kerbin, fly to Eve, land at sea level, reach orbit and land back at Kerbin: Extra 10 points\n\nSUPER BONUS\n\nApril fool: 6000 points"},{"CreatedByName":"gigaboom2","CreatedById":112218,"CreatedDateTime":"2015-04-01T20:10:49Z","Content":"\u003E \n\u003E SUPER BONUS\n\u003E April fool: 6000 points\n\nSo the whole challenge is a joke? Or do we need to get it done today?"},{"CreatedByName":"Slam_Jones","CreatedById":125101,"CreatedDateTime":"2015-04-01T20:33:51Z","Content":"I believe the idea is that making an SSTO that can actually get to Eve without refueling is impossible within the confines of the current game. *Especially* landing and taking off from the surface.\n\nIf anyone manages to do it, though, I\u0027ll be mighty impressed."},{"CreatedByName":"gigaboom2","CreatedById":112218,"CreatedDateTime":"2015-04-01T22:44:12Z","Content":"\u003E \n\u003E I believe the idea is that making an SSTO that can actually get to Eve without refueling is impossible within the confines of the current game. *Especially* landing and taking off from the surface.\n\u003E If anyone manages to do it, though, I\u0027ll be mighty impressed.\n\nIt is very possible to make an SSTO that is launched from kerbin and goes to eve without refueling. If it is ion powered, it can fly around on the surface too. It is just getting of the giant planet that makes it so difficult."},{"CreatedByName":"Deddly","CreatedById":62955,"CreatedDateTime":"2015-04-02T05:02:35Z","Content":"Yes, the entire challenge was of course a joke. I thought the first line would give it away, since there have been so many threads about this, all of them shot down pretty quickly. But I guess it wasn\u0027t very funny. Sorry about that.\n\nFor the record, as of .90, nobody has been able to make an Eve SSTO for Stock KSP without using exploits and it is considered impossible. Nobody has even managed to get it to work with infiniglide and ions. \n\nI suggest we don\u0027t discuss it and let this thread die, because this has been discussed at length in many older threads."},{"CreatedByName":"Rath","CreatedById":138223,"CreatedDateTime":"2015-04-02T08:06:13Z","Content":"Actually someone made an eve ssto with a ladderdrive but I think it might be possible with massless mono prop engines loads and loads of mono prop tanks and a supercomputer"},{"CreatedByName":"Findthepin1","CreatedById":139989,"CreatedDateTime":"2015-04-06T23:21:08Z","Content":"if we could float the rocket on balloons to the ~1atm level or higher it could ascend like a normal ssto"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2015-04-07T08:08:09Z","Content":"Locked, per OP request.\n\nCheers,\n\n~Claw"}]}