{"TopicId":103165,"ForumId":69,"TopicTitle":"FlightState breaking, losing all flights in progress","CreatedByName":"pi11e","CreatedById":140310,"CreatedDateTime":"2015-04-01T19:16:37Z","PageNum":1,"Articles":[{"CreatedByName":"pi11e","CreatedById":140310,"CreatedDateTime":"2015-04-01T19:16:37Z","Content":"Hi everybody, I hope I\u0027m in the right place for my problem. \n\nSometimes (~33% subjective reproducibility) when I save my game and then load it, all flights in progress are gone.\n\nSimilarly, sometimes \u0022recovering\u0022 a vehicle after e.g. landing, I just see the space center and there is no mission end dialog (information about funds, crew, science recovered), resulting in the crew \u0022missing in action\u0022. Zero Mods installed, it\u0027s a career game I started after 0.9 was released.\n\nI can see this behavior from the quicksaves, where the \u0022flightstatus\u0022 group of properties goes missing from one save to another, see links / image below.\n\n![merge.png](https://dl.dropboxusercontent.com/u/25907280/merge.png)\n\n[https://dl.dropboxusercontent.com/u/25907280/quicksave%20%2341%20to%20Duna%21.sfs](https://dl.dropboxusercontent.com/u/25907280/quicksave%20%2341%20to%20Duna%21.sfs)\n\n[https://dl.dropboxusercontent.com/u/25907280/quicksave%20%2341.sfs](https://dl.dropboxusercontent.com/u/25907280/quicksave%20%2341.sfs)\n\nNaturally, this is quite annoying as I have to start missions over even if they went perfectly fine and likely will never complete my beautiful space station... because it\u0027s usually gone after two KSP sessions.\n\nI\u0027m playing on a Macbook Air 13\u0022 Mid-2012 (Mac OS X Yosemite 10.10.2, 1,8 GHz Intel Core i5, Intel HD4000 Graphics, , also sometimes on my Gaming PC (Windows 8.1, Core i5 CPU, AMD R280X, 8GB RAM). I synchronize my savegames via Dropbox, I\u0027m quite sure this setup hasn\u0027t given me trouble before the 0.9 beta update with losing flights in progress.\n\nFor reference, here\u0027s two screenshots out of my tracking station (quicksave41 \u0022to Duna!\u0022 vs. quicksave 41 taken after Duna mission). Note that even my flag on the Mun is gone (see top menu bar). I\u0027d appreciate any advise and/or help.\n\n![quicksave41%20to%20Duna.png](https://dl.dropboxusercontent.com/u/25907280/quicksave41%20to%20Duna.png)\n\n![quicksave41.png](https://dl.dropboxusercontent.com/u/25907280/quicksave41.png)"}]}