{"TopicId":103197,"ForumId":16,"TopicTitle":"My brain just suggested something lunatic - Colonizing and hauling an E-Class Asteroid to Duna","CreatedByName":"Commissioner Tadpole","CreatedById":91993,"CreatedDateTime":"2015-04-02T02:00:38Z","PageNum":1,"Articles":[{"CreatedByName":"Commissioner Tadpole","CreatedById":91993,"CreatedDateTime":"2015-04-02T02:00:38Z","Content":"Yes, you read that right. (And this includes the part about my brain having a life of its own. Don\u0027t ask.) ![:blush:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif)\n\nRecently, I\u0027ve been contemplating how to fulfill this idea: Finding and redirecting an E-Class asteroid into Medium Kerbin Orbit, and then slowly setting up a space station around it... then haul it to Duna to work as a space station *there*. Why I want my Duna Space Station to be based around an asteroid rather than taking the easy path and making them be artificially-built I don\u0027t know, but heck if I like the idea.\n\nThing is: I\u0027m mediocre at rendezvous - and I\u0027ve *never* redirected an asteroid, let alone an E-Class one. I\u0027d like to see some tips on how to redirect these monstrous beasts into MKO, the best way to construct a station around them(I intend them to have basic space for ~16 astronauts, a Science! laborotory, a fuel depot, and five Duna landers), and *finally* how to transport that behemoth into an orbit around Duna. All while knowing that I\u0027ve never redirected an asteroid in my life, and am not an expert in a rendezvous.\n\nYeah, I\u0027m crazy, no need to tell me that.\n\n**Edited \u003Ctime datetime=\u00222015-04-05T00:14:19Z\u0022 title=\u002204/05/2015 12:14  AM\u0022 data-short=\u00229 yr\u0022\u003EApril 5, 2015\u003C/time\u003E by Commissioner Tadpole**"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2015-04-02T02:18:47Z","Content":"For the general topic of asteroid rendezvous, you may find [this guide](https://forum.kerbalspaceprogram.com/threads/75759-Asteroid-Rendezvous-Outside-of-Kerbin%E2%80%99s-SOI?p=1076130) by my fellow moderator Claw to be quite useful. I\u0027ll leave the specifics of how to build and fly a craft capable of putting an E-class asteroid in Kerbin\u0027s orbit to those with a little more experience in doing so, as sadly I haven\u0027t quite managed it myself."},{"CreatedByName":"nightingale","CreatedById":119307,"CreatedDateTime":"2015-04-02T02:53:09Z","Content":"In my Tourism contract pack there\u0027s a contract for setting up a station with multiple asteroids for tourists to visit. One thing I learned while testing is to be careful and *fear the Kraken*. Basically, save often, and keep multiple saves, because I found myself getting into situations where one of the multiple vessels I was working with (station, tug, asteroid) would suddenly go into crazy mode (basically seemed to decide it had zero velocity, and started crashing away towards Kerbin)."},{"CreatedByName":"Commissioner Tadpole","CreatedById":91993,"CreatedDateTime":"2015-04-02T13:49:40Z","Content":"\u003E \n\u003E For the general topic of asteroid rendezvous, you may find [this guide](https://forum.kerbalspaceprogram.com/threads/75759-Asteroid-Rendezvous-Outside-of-Kerbin%E2%80%99s-SOI?p=1076130) by my fellow moderator Claw to be quite useful. I\u0027ll leave the specifics of how to build and fly a craft capable of putting an E-class asteroid in Kerbin\u0027s orbit to those with a little more experience in doing so, as sadly I haven\u0027t quite managed it myself.\n\nIt is interesting, but I don\u0027t think a rendezvous in Solar orbit would do since I want to set up the base before the next Kerbin-Duna transfer window. I already have three Kerbals sitting on a Duna base there and I don\u0027t want them to stay bored and lonely for that long.\n\nAh well, I\u0027ll try it anyway. (Hopefully there is an E-Class potatoroid around for me to redirect.)\n\n\u003E \n\u003E In my Tourism contract pack there\u0027s a contract for setting up a station with multiple asteroids for tourists to visit. One thing I learned while testing is to be careful and *fear the Kraken*. Basically, save often, and keep multiple saves, because I found myself getting into situations where one of the multiple vessels I was working with (station, tug, asteroid) would suddenly go into crazy mode (basically seemed to decide it had zero velocity, and started crashing away towards Kerbin).\n\nUh oh. The last thing I want is to have an entire space station with Kerbals in it compromised.\n\nAh well, no risk no reward I guess."},{"CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-04-02T13:58:30Z","Content":"Hey, partially in response to this question I posted my hauler, the Kranefly Mk.E [http://forum.kerbalspaceprogram.com/threads/114595-Asteroid-Hauler-Kranefly-Mk-E](https://forum.kerbalspaceprogram.com/threads/114595-Asteroid-Hauler-Kranefly-Mk-E). It worked for me to get class E rocks into Kerbin and Minmus orbit. No reason it can\u0027t haul to Duna as well, if I were doing that I would just build a bunch of tankers with their own klaws and link those to the rock somewhere in Kerbin orbit (then dump them when empty).\n\nHopefully this gives you some design ideas. The key learnings I applied to this ship were (1) it\u0027s a lot easier to pull (with klaw set for Free Pivot!) than push (2) if you\u0027re going to pull you need a long boom so the exhaust doesn\u0027t hit the asteroid and cancel thrust."},{"CreatedByName":"Commissioner Tadpole","CreatedById":91993,"CreatedDateTime":"2015-04-03T15:04:40Z","Content":"Claw\u0027s tutorial is very confusing; I still haven\u0027t managed to do an encounter yet. Thankfully I quicksaved."},{"CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-04-03T15:52:51Z","Content":"Well you know you won\u0027t get an \u0022encounter\u0022 like the ones you get for a planet or moon, right? You can only get an \u0022intercept\u0022 since the asteroid is a Part that has no gravity. That said--how far along are you getting before giving up? When I do it, I typically start looking for an intercept once reaching solar SOI, on a parallel course with the target rock."},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-04-03T16:20:01Z","Content":"From a fuel usage perspective you are much better off not stopping in Kerbin orbit. Meet the asteroid in solar orbit and arrange a gravity assist, possibly powered, to boost you on to Duna. I strongly recommend the PreciseNode mod for any gravity assist work. Then either build the station once the rock is at Duna, or send the station parts up to meet the rock during its flyby of Kerbin. The latter approach is what I took when I sent a C class to Ike.\n\nIf you must stop in Kerbin orbit, consider an aerocpature into an elliptical one, something like 100x10,000 km. Make sure it\u0027s safe from Mun encounters.\n\nAs for construction, be aware that while multiple station modules clawed to the asteroid looks cool it also attracts game bugs. If you\u0027re happy with a single block of station bits then attach with a single claw."},{"CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-04-03T17:36:45Z","Content":"\u003E \n\u003E If you must stop in Kerbin orbit, consider an aerocpature into an elliptical one, something like 100x10,000 km. Make sure it\u0027s safe from Mun encounters.\n\nThis one is I think a very good idea. A high elliptical orbit would keep the asteroid and hauler within range for easy refueling (if needed), but minimize fuel cost on the transfer to Duna."},{"CreatedByName":"Commissioner Tadpole","CreatedById":91993,"CreatedDateTime":"2015-04-03T21:31:49Z","Content":"Good news: I managed to rendezvous with the asteroid, using Kuzzter\u0027s craft.\n\nBad news: IT. WON\u0027T. STEER. And if you try, it makes the orbit dance like crazy. I also burned through most of the craft\u0027s fuel in the process, so it\u0027ll have to wait in Kerbin orbit before bouncing to Duna.\n\nEDIT: Would the glitches with the Claw dissipate if I used KerbalInventorySystem to attach Docking Ports into the asteroid, and attach vessels to said docking ports?\n\n**Edited \u003Ctime datetime=\u00222015-04-03T22:00:54Z\u0022 title=\u002204/03/2015 10:00  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 3, 2015\u003C/time\u003E by Commissioner Tadpole**"},{"CreatedByName":"helaeon","CreatedById":101767,"CreatedDateTime":"2015-04-04T01:20:47Z","Content":"\u003E EDIT: Would the glitches with the Claw dissipate if I used KerbalInventorySystem to attach Docking Ports into the asteroid, and attach vessels to said docking ports?\n\nYou know... it might... That\u0027s a really good idea actually. You should try it and let us know how it goes!\n\nMake sure you quicksave and re-load the save though. There are some KAS/KIS weirdness when you add parts like that.\n\nFor example sometimes you can remove a fuel pipe and the ship you fly away lists in the direction of the pipe like it were still attached. Reload the quicksave and it flies like it should."},{"CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-04-04T03:30:12Z","Content":"\u003E \n\u003E Bad news: IT. WON\u0027T. STEER. And if you try, it makes the orbit dance like crazy. I also burned through most of the craft\u0027s fuel in the process, so it\u0027ll have to wait in Kerbin orbit before bouncing to Duna.\n\nYou mean you\u0027re trying to steer a 3000t asteroid using RCS and reaction wheels? Um, maybe someone else\u0027s ship can do that, but mine certainly cannot. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif) Best practice here is to set your maneuver node, undock, then fly the ship to redock with the asteroid such that you are aimed in the correct direction to pull the asteroid on course. Then be certain to set the klaw for \u0027free pivot\u0027 and thrust away."},{"CreatedByName":"Commissioner Tadpole","CreatedById":91993,"CreatedDateTime":"2015-04-04T15:44:45Z","Content":"\u003E \n\u003E You mean you\u0027re trying to steer a 3000t asteroid using RCS and reaction wheels? Um, maybe someone else\u0027s ship can do that, but mine certainly cannot. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif) Best practice here is to set your maneuver node, undock, then fly the ship to redock with the asteroid such that you are aimed in the correct direction to pull the asteroid on course. Then be certain to set the klaw for \u0027free pivot\u0027 and thrust away.\n\n...you should\u0027ve told me that *beforehand*. Its reaction wheels are also still pretty weak and lacks enough RCS thrusters. Bugger.\n\nWell, with an orbit that not only dances insanely, but is massively elliptical(it extends past Minmus\u0027 orbit) AND inclined, I don\u0027t think I can do a rendezvous. I\u0027ll still try, though. Is there a way to improve the ship\u0027s reaction wheels(such as attaching multiple vessels with ASAS units to the boulder), or I\u0027ll have to ditch it and come up with a better one?"},{"CreatedByName":"Beowolf","CreatedById":48927,"CreatedDateTime":"2015-04-04T22:36:06Z","Content":"No, Kuzzter\u0027s right. I\u0027m too lazy to calc it, but the delta-v required to rotate, and then stop, a 3000t asteroid in reasonable time is going to be absurd. It isn\u0027t a job for RCS or reaction wheels; more like a full stage of main engine fuel. And you can\u0027t afford that, so you\u0027ll have to grab/dock with your engines pointing roughly where they need to be.\n\nSince his design has the engines pulling the asteroid, once anchored you can \u0022free pivot\u0022 the klaw, then use reaction wheels to aim your engines, and have limited steering that way."},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2015-04-04T23:26:17Z","Content":"I\u0027m sorry if my tutorial is confusing. If you let me know what part doesn\u0027t make sense, I can update it or try to clarify for you.\n\nBeyond that, my tutorial is mostly aimed at capturing the asteroid around Kerbin. If you are serious about capturing a Class E as the base for a station around Duna, I would highly recommend meeting up with it well outside of Kerbin\u0027s SOI. Then, you can adjust it\u0027s inbound Kerbin trajectory such that it crosses around the equator (for correct inclination) and set it up for aero braking. That will save loads of dV on the capture and takes a lot less dV to adjust it\u0027s inbound Kerbin trajectory. If you get lucky enough, you might be able to find an asteroid that is set up such that you can use the Kerbin flyby to slingshot it toward Duna, and bypass setting it up in LKO all together.\n\nWhen capturing it around Kerbin, you can leave it in an elliptical orbit to save fuel when sending it along to Duna. However, if you\u0027re going to to that, you need to make sure the Apoapsis is pointed the right way for a trans-duna injection. Otherwise it won\u0027t help out at all and may, in fact, make it much more difficult.\n\nAs for asteroid control, you can attach multiple RCS and torque control units via small helper claw ships all around the asteroid. Monopro and electricity are shared all over the ship (including through an asteroid), so that makes it a little easier to keep the part count down with all the extra helper ships (they don\u0027t all need solar panels or RTGs). Distributing RCS makes it easier to control, and adding torque units to them helps distribute the torque load and prevent all bending from going through a single claw.\n\nKeep in mind, as has been noted, that the claw is quite buggy. Using multiple claws can make things worse. So save often and keep backups. If you run into a problem, don\u0027t be afraid to exit KSP completely, then transfer over a quicksave as your persistent before reloading. Once you hit a claw bug, quickloading generally doesn\u0027t make it go away.\n\nBe patient. Moving 3,000t takes a lot of patience and time. And yeah, disconnecting and reconnecting the puller is sometimes more efficient for major orbit maneuvers."},{"CreatedByName":"Commissioner Tadpole","CreatedById":91993,"CreatedDateTime":"2015-04-05T00:14:06Z","Content":"Thanks for the help, everyone(especially you, Kuzzter), but after some time thinking, I guess I came to the conclusion that hauling the E-Class to Duna just isn\u0027t worth it.\n\nI mean, what\u0027s the point? Besides looking cool, it just makes work harder due to having to tow 3k tons around just for something a normal space station can do with much more ease. And, as some have mentioned, the Klaw is quite buggy, and the last thing I want to suffer after killing myself to bring an asteroid to Duna orbit with a space station attached to it is for said station to break thanks to the Klaw. That, and I don\u0027t have the patience to do it(rendezvous and docking are already hard for me) - and due to my... *anger issues*, I was already getting a headache from trying to manuever the vessel around the asteroid.\n\nAh well, thanks again for all the help. Maybe I\u0027ll try to haul a D or C-class instead of an E later on, but for now I\u0027m beat."},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-04-05T00:36:15Z","Content":"\u003E \n\u003E When capturing it around Kerbin, you can leave it in an elliptical orbit to save fuel when sending it along to Duna. However, if you\u0027re going to to that, you need to make sure the Apoapsis is pointed the right way for a trans-duna injection. Otherwise it won\u0027t help out at all and may, in fact, make it much more difficult.\n\nCan this not be worked around by waiting for a Duna departure window that puts the asteroid\u0027s elliptical orbit at the right angle?"},{"CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-04-05T11:44:38Z","Content":"\u003E \n\u003E Thanks for the help, everyone(especially you, Kuzzter), but after some time thinking, I guess I came to the conclusion that hauling the E-Class to Duna just isn\u0027t worth it.\n\nYou\u0027re welcome. I\u0027d encourage you to see what you can do with the asteroid you have, and yes to try and improve on the Kranefly. I daresay you\u0027ll learn a lot that way.\n\nIf you really do want to get an asteroid to Duna, think hard about the dV involved... you now have some idea of how much dV you can put on a large rock with a reasonably sized towship. You also know something about the challenges of steering a large rock. If you can manage your goal, that will be a very rep-worthy mission report.\n\nCome to think of it, I might try and drag a class-E to Duna myself with the Kranefly, just to show it can be done ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2015-04-05T19:12:39Z","Content":"\u003E \n\u003E Can this not be worked around by waiting for a Duna departure window that puts the asteroid\u0027s elliptical orbit at the right angle?\n\nSure, although I\u0027ve never bothered to look at how harmonic the windows are. But really, my comment was based on...\n\n\u003E \n\u003E It is interesting, but I don\u0027t think a rendezvous in Solar orbit would do since I want to set up the base before the next Kerbin-Duna transfer window. I already have three Kerbals sitting on a Duna base there and I don\u0027t want them to stay bored and lonely for that long.\n\nIn which case, if the areocapture around Kerbin is with the AP pointed the wrong way, it won\u0027t do him much good because he doesn\u0027t want to wait for another transfer window.\n\nCheers,\n\n~Claw"},{"CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-04-05T19:35:29Z","Content":"\u003E \n\u003E In which case, if the areocapture around Kerbin is with the AP pointed the wrong way, it won\u0027t do him much good because he doesn\u0027t want to wait for another transfer window.\n\nIndeed. I was thinking about this some more, and the easiest way by far must be to intercept in solar SOI and nudge toward Duna aerocapture. Remember, it costs over 1000dV to go from Kerbin SOI to Duna, and a ship the size of the Kranefly can only give a Class E about 150m/s before needing a refuel. If you pick the right asteroid it should be possible to hit Duna on one tank...IF you pick the right asteroid. The trouble is that you can\u0027t play around with patched conics and maneuver nodes to get an intercept solution until you have an active ship in similar orbit or attached to the asteroid. \n\nIf I were to do this (and I am in the middle of tanking up for an Eve attempt, so no probably not until after 1.0) I might send a bunch of fast drones to scout some asteroids between Kerbin and Duna; drag maneuver nodes until I find a promising candidate, then dispatch a Kranefly to finish the job.\n\n- - - Updated - - -\n\n\u003E \n\u003E Since his design has the engines pulling the asteroid, once anchored you can \u0022free pivot\u0022 the klaw, then use reaction wheels to aim your engines, and have limited steering that way.\n\nYes, this works, but the asteroid\u0027s momentum WILL swing it around considerably... in my experience the oscillations will damp out in a reasonable time, provided you are not trying to correct by more than a few degrees at a time."},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2015-04-05T19:53:29Z","Content":"Not that I\u0027ve sent an asteroid to Duna myself, but I agree that I would probably lean toward redirecting the Class E toward Duna, vice trying to capture it around Kerbin first. I imagine it would be far less expensive (fuel and ship wise) to push the station infrastructure to Duna and meet the asteroid there, vice capturing around Kerbin, building, then pushing that huge mass out to Duna. I might also consider trying to do the slingshot off of Kerbin, but probably wouldn\u0027t try to speed up station parts to meet it, since it\u0027s likely going faster than I care to push the station parts. But that may all highly depend on the asteroid and it\u0027s path.\n\n\u003E \n\u003E If you pick the right asteroid it should be possible to hit Duna on one tank...IF you pick the right asteroid. The trouble is that you can\u0027t play around with patched conics and maneuver nodes to get an intercept solution until you have an active ship in similar orbit or attached to the asteroid. ... I might send a bunch of fast drones to scout some asteroids between Kerbin and Duna; drag maneuver nodes until I find a promising candidate, then dispatch a Kranefly to finish the job.\n\nYes. This is precisely why I posted my tutorial about intercepting well outside of Kerbin\u0027s SOI. With a small probe, you can really pour on the dV when leaving Kerbin for the intercept. Even without trying to go excessively fast, you can intercept asteroids in 1/3 to 1/4 of the time compared to waiting until they get into Kerbin\u0027s SOI. That still leaves plenty of time to dispatch a proper mission craft for the job, and know what kind of rock you\u0027ll find when you get there.\n\nCheers,\n\n~Claw\n\n**Edited \u003Ctime datetime=\u00222015-04-05T19:57:58Z\u0022 title=\u002204/05/2015 07:57  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 5, 2015\u003C/time\u003E by Claw**"}]}