{"TopicId":103248,"ForumId":36,"TopicTitle":"[WIP] Config Refinig Tool","CreatedByName":"prog","CreatedById":139695,"CreatedDateTime":"2015-04-02T16:24:18Z","PageNum":1,"Articles":[{"CreatedByName":"prog","CreatedById":139695,"CreatedDateTime":"2015-04-02T16:24:18Z","Content":"\n\u003Cp\u003EI made this tool for personal use and then realized that it could be useful for someone else.\u003C/p\u003E\u003Cp\u003EMain goal of Config Refinig Tool is namely to refine and adjust configuration files of KSP in a bunch of different ways before you even start a game.\u003C/p\u003E\u003Cp\u003ECurrent feature list:\u003C/p\u003E\u003Cp\u003E- automated backup so all changes could be reverted\u003C/p\u003E\u003Cp\u003E- basic modlist change detection so one could put new mod into gamedata folder and just run refining tool one more time\u003C/p\u003E\u003Cp\u003E- config refinement - old configs are all get removed and replaced with generated ones\u003C/p\u003E\u003Cp\u003E- config adjustment - generated configuration files could contain wide variety of tweaks\u003C/p\u003E\u003Cp\u003E- simple scripting language for making adjustments while generating configs (Lua with simplest API possible)\u003C/p\u003E\u003Cp\u003E- basic link counting functionality so all unlinked parts, techtree nodes, resources and anything else could be automatically removed from generated config\u003C/p\u003E\u003Cp\u003E- basic ModuleManager config compatibility so some simple MM patches could be recognized and applied to generated config without MM\u003C/p\u003E\u003Cp\u003EPending feature list before release is possible:\u003C/p\u003E\u003Cp\u003E- UI or at least a way to configure all hardcoded things I made for personal use\u003C/p\u003E\u003Cp\u003E- full ModuleManager config compatibility so one could have MM-style patches without MM itself. So, yes, all mods depending on MM will be compatible with Config Refinig Tool without additional effort. And it\u0027s good alternative to all that scary Lua things as well.\u003C/p\u003E\u003Cp\u003E- better Lua sandbox so no one could use lua script to do something outside of KSP game data folder. Actually, sandbox will be restricted to changes in config files only and even more, writing to config files is outside of sandbox scope so no way to write tricky binary to cfg file instead of actual config.\u003C/p\u003E\u003Cp\u003EExample use-cases:\u003C/p\u003E\u003Cp\u003E- to really remove all that unused parts from config files instead of just making them unreachable\u003C/p\u003E\u003Cp\u003E- to perform some math on values, for example to recalculate Firespitter FSfuelSwitch tank costs avoiding \u0022negative part cost\u0022 problems or to make any wide-range balancing\u003C/p\u003E\u003Cp\u003E- to ban and then remove from configs any part or module or resource or anything you don\u0027t like, for example I used this to remove all KAS grab modules from parts when KIS is installed and to remove some unbalanced/buggy parts from other mods without hand-editing of KSP configs\u003C/p\u003E\u003Cp\u003EPros:\u003C/p\u003E\u003Cp\u003E- it\u0027s not runtime plugin but standalone application so you run it once and then use generated config files until you want to change your mods\u003C/p\u003E\u003Cp\u003E- it could slightly speed up loading and reduce memory usage\u003C/p\u003E\u003Cp\u003E- it will be completely opensource once released\u003C/p\u003E\u003Cp\u003ECons:\u003C/p\u003E\u003Cp\u003E- it\u0027s freaking standalone application so you HAVE to run it every time you change list of your mods or update one of mods\u003C/p\u003E\u003Cp\u003E- it could have compatibility issues with some mods\u003C/p\u003E\u003Cp\u003E- it\u0027s written using Java\u003C/p\u003E\u003Cp\u003ENo ETA for release yet, but surely not before KSP 1.0.\u003C/p\u003E\n"}]}