{"TopicId":103281,"ForumId":44,"TopicTitle":"Could one control a plane only using CG changes?","CreatedByName":"mardlamock","CreatedById":38972,"CreatedDateTime":"2015-04-02T23:32:05Z","PageNum":1,"Articles":[{"CreatedByName":"mardlamock","CreatedById":38972,"CreatedDateTime":"2015-04-02T23:32:05Z","Content":"\n\u003Cp\u003EThe germanwings crash got me thinking, and im just wondering what you guys think. Could the passengers in a commercial aircraft actively control the aircrafts pitch by moving towards the aft end and therefore changing the CG? I think so, but maybe you can get some numbers on how plausible this would be.\u003C/p\u003E\n"},{"CreatedByName":"andrewas","CreatedById":24662,"CreatedDateTime":"2015-04-02T23:49:11Z","Content":"\n\u003Cp\u003E150 passengers have enough mass to alter the balance of the plane, but I doubt they could overpower its control surfaces and, if they could force it to pull up, the copilot could still have cut the throttle and let the plane stall.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-04-02T23:52:30Z\u0022 title=\u002204/02/2015 11:52  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 2, 2015\u003C/time\u003E by andrewas\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-04-02T23:50:23Z","Content":"\n\u003Cp\u003EYou would change the CG instead of the CL.... Could work, if it could be done.\u003C/p\u003E\n"},{"CreatedByName":"mardlamock","CreatedById":38972,"CreatedDateTime":"2015-04-03T00:04:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022andrewas\u0022 data-cite=\u0022andrewas\u0022\u003E\u003Cdiv\u003E150 passengers have enough mass to alter the balance of the plane, but I doubt they could overpower its control surfaces and, if they could force it to pull up, the copilot could still have cut the throttle and let the plane stall.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWithout power they would move towards the nose and allow the plane to glide. The question is wether they could have more authority than the control surfaces.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2015-04-03T00:10:24Z","Content":"\n\u003Cp\u003EThat is not what you asked \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"StrandedonEarth","CreatedById":89439,"CreatedDateTime":"2015-04-03T03:06:39Z","Content":"\n\u003Cp\u003EAt any rate the copilot could move the control surfaces faster than the passengers could move from one end to the other.\u003C/p\u003E\n"},{"CreatedByName":"Iskierka","CreatedById":2116,"CreatedDateTime":"2015-04-03T03:33:04Z","Content":"\n\u003Cp\u003EA plane with free-floating controls, or controls fixed to neutral, can be controlled quite easily by small changes in CG. However, CG change only results in a gentle control moment - what it does quite a lot of is reduce or increase aircraft stability margins. If someone actively pushed the nose down and everyone moved to the back of the plane, all that would happen is the plane would become rather more twitchy as it was forced to the ground, if the pilot was truly determined - or if just pushing down gently, and not trying to keep the plane under control, then you might overpower the controls, but you would then very quickly push the aircraft into a stall and lose control altogether.\u003C/p\u003E\n"},{"CreatedByName":"Armchair Rocket Scientist","CreatedById":76165,"CreatedDateTime":"2015-04-03T03:35:59Z","Content":"\n\u003Cp\u003EOne thing not mentioned: airliners are narrow enough that you couldn\u0027t control roll with this method. The copilot could easily have rolled the plane sideways or upside-down.\u003C/p\u003E\n"},{"CreatedByName":"andrewas","CreatedById":24662,"CreatedDateTime":"2015-04-03T11:10:00Z","Content":"\n\u003Cp\u003EOr put it into a vertical dive, in which case the passengers lose their leverage, and all wind up in a heap against the cockpit door. The best he passengers can do in that situation is to send their last words to facebook or phone their families, because theres nothing anyone can do once the cockpit is locked. Hopefully, the new rules on having two in the cockpit at all times will prevent a repeat.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2015-04-03T12:02:53Z","Content":"\n\u003Cp\u003EEven if you could influence the attitude of the aircraft, the flight control system would fight back and compensate. If it\u0027s told to maintain 2500ft it will do its best to maintain 2500ft regardless of the CG.\u003C/p\u003E\u003Cp\u003EWhen you get on board a plane, a train, a bus, or an amusement park ride, you are always at the mercy of the person at the controls. If a pilot wants to crash an airplane, he will crash the airplane, regardless of whether there is someone with him in the cockpit or not.\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2015-04-05T17:07:12Z","Content":"\n\u003Cp\u003EI don\u0027t see why we simply can\u0027t have a smarter plane with its own self preservation system. If the pilot puts the craft into a dangerous trajectory the plane should resist. \u003C/p\u003E\u003Cp\u003EHowever theres... Always something. And evil will find a way.\u003C/p\u003E\n"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-04-05T17:20:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Motokid600\u0022 data-cite=\u0022Motokid600\u0022\u003E\u003Cdiv\u003EI don\u0027t see why we simply can\u0027t have a smarter plane with its own self preservation system. If the pilot puts the craft into a dangerous trajectory the plane should resist. \u003Cp\u003EHowever theres... Always something. And evil will find a way.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe problem is how to have the system detect such things. Sometimes the pilot has to pull dangerous measure like hard landing on water, and if the system thought it is sabotage, it could cause further problem, like trying to pull up and perhaps hit a building on the way.\u003C/p\u003E\u003Cp\u003EI think it would be better if we have more reliable communication system that can reach across the world in a short time. If the system detect strange trajectory/movement, it will send a signal back to the nearest ground control responsible for the plane, and ground control can see what is going on, and perhaps talk the pilot out of it. A remote control system to override pilot control might be possible, but imagine something like that fall in the hand of terrorists...\u003C/p\u003E\n"},{"CreatedByName":"EdFred","CreatedById":108599,"CreatedDateTime":"2015-04-05T18:51:46Z","Content":"\n\u003Cp\u003EMy brother and I were in my first airplane, and I got everything trimmed out so I could fly \u0022hands off\u0022 for about 10 minutes. All we had to do was lean forward and the cg moved enough to pitch the nose down. We leaned back and got the plane to climb. We leaned side to said and made it turn appropriately. \u003C/p\u003E\u003Cp\u003ESo yes, as long asthe pilot doesn\u0027t have autopilot engagedm\u003C/p\u003E\n"},{"CreatedByName":"Van Disaster","CreatedById":58876,"CreatedDateTime":"2015-04-05T19:30:10Z","Content":"\n\u003Cp\u003EYou might be able to upset the pitch balance of a small ( say 20 passenger ) plane if you all crammed at one end and it wasn\u0027t loaded right; as for actually controlling a plane by weightshift, if it\u0027s a hang-glider, sure.\u003C/p\u003E\u003Cp\u003EEmergency flight modes using CG shift by pumping fuel around ( as part of a mode where you\u0027ve lost flight controls, as happens occasionally ) might be something to look at. Not sure how fast you can pump fuel around an airliner though.\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2015-04-05T19:48:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Van Disaster\u0022 data-cite=\u0022Van Disaster\u0022\u003E\u003Cdiv\u003EEmergency flight modes using CG shift by pumping fuel around ( as part of a mode where you\u0027ve lost flight controls, as happens occasionally ) might be something to look at. Not sure how fast you can pump fuel around an airliner though.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs you\u0027ve pointed out, a hang glider is an obvious example of an aircraft that is controled by shifting the pilot\u0027s weight around, but for a crippled airliner, you\u0027d be better off trying to use differential thrust from the engines as the crew of \u003Ca href=\u0022https://en.m.wikipedia.org/wiki/United_Airlines_Flight_232\u0022 rel=\u0022external nofollow\u0022\u003EUnited Airlines flight 232\u003C/a\u003E did in their efforts to land their crippled DC-10 in Sioux City.\u003C/p\u003E\n"},{"CreatedByName":"Van Disaster","CreatedById":58876,"CreatedDateTime":"2015-04-05T19:55:09Z","Content":"\n\u003Cp\u003EYeah, I was wondering if pumping fuel around might help in differential thrust mode - not sure you could do it fast enough to help kill phugoid issues though, for instance, although that\u0027s better done with the throttles anyway. Might help trimming turns a bit perhaps. \u003C/p\u003E\u003Cp\u003EBaghdad A300 is probably a better example, that one actually landed properly.\u003C/p\u003E\n"},{"CreatedByName":"cpast","CreatedById":112846,"CreatedDateTime":"2015-04-06T00:21:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Motokid600\u0022 data-cite=\u0022Motokid600\u0022\u003E\u003Cdiv\u003EI don\u0027t see why we simply can\u0027t have a smarter plane with its own self preservation system. If the pilot puts the craft into a dangerous trajectory the plane should resist. \u003Cp\u003EHowever theres... Always something. And evil will find a way.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA dangerous trajectory like \u003Ca href=\u0022https://en.wikipedia.org/wiki/US_Airways_Flight_1549\u0022 rel=\u0022external nofollow\u0022\u003Einto a river\u003C/a\u003E? Or \u003Ca href=\u0022https://en.wikipedia.org/wiki/TACA_Flight_110\u0022 rel=\u0022external nofollow\u0022\u003Eon a levee\u003C/a\u003E? For that matter, what if the pilot turns off the computers that tell whether it\u0027s on a dangerous trajectory (the pilot on an aircraft can turn off any electrical system)?\u003C/p\u003E\n"},{"CreatedByName":"Van Disaster","CreatedById":58876,"CreatedDateTime":"2015-04-06T00:50:29Z","Content":"\n\u003Cp\u003EAnd there\u0027s good reasons pilots need to be able to turn everything and anything off, like fires \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E. Even Airbus which has some funny ideas about what the pilot should be doing has Manual Law where it\u0027s as near to a direct control of the aircraft as is possible, so that would just bypass any flight control software link to GPWS.\u003C/p\u003E\n"},{"CreatedByName":"WestAir","CreatedById":59115,"CreatedDateTime":"2015-04-06T00:53:12Z","Content":"\n\u003Cp\u003EI\u0027ve heard a story about a passenger causing a Grand Caravan to crash by switching seats during climbout. The aircraft entered a stall out of 14000 and crashed.\u003C/p\u003E\u003Cp\u003EThe wreckage is at the University I graduated from. Looked legit.\u003C/p\u003E\n"},{"CreatedByName":"rpayne88","CreatedById":58336,"CreatedDateTime":"2015-04-06T08:32:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EEven if you could influence the attitude of the aircraft, the flight control system would fight back and compensate. If it\u0027s told to maintain 2500ft it will do its best to maintain 2500ft regardless of the CG.\u003Cp\u003EWhen you get on board a plane, a train, a bus, or an amusement park ride, you are always at the mercy of the person at the controls. If a pilot wants to crash an airplane, he will crash the airplane, regardless of whether there is someone with him in the cockpit or not.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUnless you exceed its limits. There is a point (usually when a plane exceeds its critical AOA and stalls) that the autopilot shuts off. This is done as a safety feature to prevent the autopilot from flying the plane into a deep stall. The AP would try to maintain altitude by pitching up (or rather trying to) instead of recovering from the stall by decreasing AOA. \u003C/p\u003E\u003Cp\u003EThat being said, good luck getting there using only COG changes.\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-04-06T11:23:28Z","Content":"\n\u003Cp\u003EThere\u0027s been a lot of crashes over the years where cargo has shifted, creating pitch moments that the elevators couldn\u0027t overcome.\u003C/p\u003E\u003Cp\u003E That was at much slower speeds, though...\u003C/p\u003E\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2015-04-06T11:32:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GoSlash27\u0022 data-cite=\u0022GoSlash27\u0022\u003E\u003Cdiv\u003EThere\u0027s been a lot of crashes over the years where cargo has shifted, creating pitch moments that the elevators couldn\u0027t overcome.\u003Cp\u003E That was at much slower speeds, though...\u003C/p\u003E\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, but the cargo can be pretty heavy, making it impossible to correct for. Worse case is one single heavy object. \u003C/p\u003E\u003Cp\u003EI was in a plane where we passengers was rearranged they moved us all forward in plane, this plane was however just 25%-30% capacity so its possible they took more cargo and it was not balanced enough?\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2015-04-06T14:43:19Z","Content":"\n\u003Cp\u003Ei saw a submarine design awhile back that mounted the batteries on rails and moved them back and fourth to pitch up and down, thus changing the angle the dive planes.\u003C/p\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2015-04-06T14:50:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nuke\u0022 data-cite=\u0022Nuke\u0022\u003E\u003Cdiv\u003Ei saw a submarine design awhile back that mounted the batteries on rails and moved them back and fourth to pitch up and down, thus changing the angle the dive planes.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhen you watch \u0022Das Boot\u0022 (and many other submarine war movies I guess) you\u0027ll see that for emergency dives most crew had to collect at the front of the ship to help it dive.\u003C/p\u003E\u003Cp\u003EMore related to the topic, I know that the Concorde pumped full between the various tanks as a way to trim the airplaine.\u003C/p\u003E\u003Cp\u003EMoving passengers around to \u003Cem\u003Ecounter\u003C/em\u003E actions by the pilot -- I doubt that\u0027s going to work in a jetliner. Passengers weigh not that much. And \u003Cem\u003Eeven\u003C/em\u003E if you succeed, you can\u0027t control roll that way, so the pilot would simply bank into a 90Ã‚Â° turn and crash the plane that way.\u003C/p\u003E\n"},{"CreatedByName":"goldenpeach","CreatedById":34566,"CreatedDateTime":"2015-04-07T21:52:59Z","Content":"\n\u003Cp\u003EIf the pilot wanted to crash the plane, I doubt that the passenger could avoid that by changing the center of mass: all the pilot would have to do is doing sudden and unexpected maneuver:if the passenger move to the rear of the plane, the pilot could fake an attempt to dive so the passenger would go at the very end of the plane.\u003C/p\u003E\u003Cp\u003EThen, suddenly, the pilot would pull up, forcing the plane into a stall.\u003C/p\u003E\u003Cp\u003EOr, even simpler, he could cut the thrust, deploy the flap, deploy the landing gears and the spoiler. The drag would be immense and the passenger would have no chances of making the plane glide on a runway.\u003C/p\u003E\u003Cp\u003EOr: simply using the rudder. Good luck with that.\u003C/p\u003E\n"}]}