{"TopicId":103372,"ForumId":16,"TopicTitle":"How to calculate exact time to launch vessel to rendez vous at LKO?","CreatedByName":"juvilado","CreatedById":106978,"CreatedDateTime":"2015-04-04T07:55:51Z","PageNum":1,"Articles":[{"CreatedByName":"juvilado","CreatedById":106978,"CreatedDateTime":"2015-04-04T07:55:51Z","Content":"Hi rocketeers, \n\nId want to know if you have any trick or way to calculate the best time to launch a vessel for making a rendez vous at LKO in the most fuel efficient way. I supose the best tie will be when the orbiting vessel come near above the kerbal complex, but can it be more accurately calculed?\n\nThanks"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2015-04-04T08:12:41Z","Content":"If you want super precision, that largely depends on how much time your rocket will need to reach space. Getting it \u0022just right\u0022 is difficult and even minor variations in your ascent can ruin everything; so I recommend that you start a little too late and enter a somewhat lower orbit, then rendezvous as usual. I consider it to be a success if I can achieve RV within the first orbit after launch. \n\nAs a rule of thumb: while still on the pad, chose the vessel in orbit as target. Timewarp until it appears on your navball, then wait a little more. If my launcher is a rocket, I usually ignite the engines when the target is at 70 degrees up; if it\u0027s a spaceplane, I start considerably sooner, at 30-40 degrees."},{"CreatedByName":"SalehRam","CreatedById":138066,"CreatedDateTime":"2015-04-04T08:17:20Z","Content":"For me I always time it to get the target I want to rendezvous flying above the large gulf to the west of KSC\n\nLike this:\n\n![ANIIIS4.png](http://i.imgur.com/ANIIIS4.png)\n\nUsually I end up not too far, or even right next to my target if I make a good gravity turn during my ascending."},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2015-04-04T12:16:24Z","Content":"Autopilot instuctions (true) for lazy navigators:\n\n1. When aiming for a buoy or other mark first determine the target\u0027s latitude and longitude.\n\n2. Adjust these 100m at 90-degrees to your course. So, if approaching from East or West, adjust the target position North or South.\n\n3. Enter the adjusted figures into the autopilot and engage it.\n\n(Yes, people \\*cough\\* do hit buoys because their figures are *too* accurate)."},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2015-04-04T14:24:55Z","Content":"I usually set whatever I\u0027m trying to dock at as my target, then wait util the pink meatball (Target Prograde) is just visible on the edge of my Navball while sitting on the pad. Launch and ascend as normal. then it\u0027s only a few minor corrections to get within range, I usually put my apoapsis slightly higher than my targets, the plop a maneuver node at the second intersection (The purple triangles) and adjust my orbit there until I get to less than 2km."},{"CreatedByName":"celem","CreatedById":91132,"CreatedDateTime":"2015-04-04T15:09:09Z","Content":"\u003E \n\u003E For me I always time it to get the target I want to rendezvous flying above the large gulf to the west of KSC\n\u003E Like this:\n\u003E \n\u003E -snipped image-\n\u003E \n\u003E Usually I end up not too far, or even right next to my target if I make a good gravity turn during my ascending.\n\nI like this idea, I\u0027ve been using the navball and \u0027target\u0027 like Laie suggests, however lining it up on the map should work well provided its a fairly regular altitude you rendezvous at. The reason this appeals to me so much is that the spot SalehRam has circled is also the point I aim to hit the atmosphere for KSC re-entry, so i\u0027m well used to finding it on the map."},{"CreatedByName":"MarvinKitFox","CreatedById":99545,"CreatedDateTime":"2015-04-04T16:17:22Z","Content":"As the time required to reach an orbit varies by ship design, flying style, and final orbit, this question is almost impossible to solve using a general formula.\n\nThe empirical solution is quite trivial though.\n\n1) Launch your ship to the desired orbit. Be sure to exactly match altitude and inclination and eccentricity etc. Take note of your mission elapsed time(T). Take note of your ground position at the instant you achieve this(D).\n\nrevert to launch.\n\n2) For your target ship, place a maneuver node at this position (D). When it is exactly (T) seconds from reaching this point, Launch your interceptor.\n\nAssuming your new launch follows your test launch closely enough, you will reach the desired orbit just as your target reaches the same spot you are in. A trivial docking solution should suffice now.\n\nPersonally though, I never bother with this. My launches are sufficiently variable that my time-to-orbit varies by 30 seconds or more. At orbital speed of \u003E2km/s , 30 seconds is just a too far miss.\n\nInstead, I simply launch when the target is about above KSC, thus ensuring that I enter orbit well behind my target but not too far from it. I do launch to a much lower orbit though, so I am rapidly catching up in position.\n\nOne orbital rendesvous intercept later, and I\u0027m at docking range. Usually before completing one full orbit.\n\n**Edited \u003Ctime datetime=\u00222015-04-04T16:23:39Z\u0022 title=\u002204/04/2015 04:23  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 4, 2015\u003C/time\u003E by MarvinKitFox**"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-04-04T17:04:58Z","Content":"The savings for doing it this way is just not worth the time and effort. And if you miss you could spend MORE fuel than just getting to orbit first.\n\nNASA does some crazy stuff to save fuel and they never bother to do this, so I don\u0027t either."},{"CreatedByName":"impyre","CreatedById":116031,"CreatedDateTime":"2015-04-04T18:01:07Z","Content":"I\u0027ve stubbornly tried to master this exact thing for a great many hours. Sadly, it\u0027s nigh impossible. As everyone else points out, there are far too many variables. If your angles or velocity at \\*any\\* point in your ascent is even slightly off, your timing will be different. Also consider drag, weight, TWR, staging... all factors which can vary from one ship to another (especially as your technology improves). If you use NEAR/FAR and fairings, have attained top tier techs, and have designed a general purpose launcher capable of delivering decent payloads of various shapes/sizes to LKO.... \\*then\\* you may want to consider mastering this (but I still say it isn\u0027t worth the trouble). A parking orbit at 250km is what I use for my stations... it\u0027s low enough that it\u0027s easy to get to and high enough that I don\u0027t have to wait very long for an intercept burn."},{"CreatedByName":"juvilado","CreatedById":106978,"CreatedDateTime":"2015-04-04T19:45:26Z","Content":"Thanks for all your advices!\n\nI\u0027m looking for changing the thread to answered but can\u0027t find where or how to do it, any last help?\n\n**Edited \u003Ctime datetime=\u00222015-04-05T11:14:35Z\u0022 title=\u002204/05/2015 11:14  AM\u0022 data-short=\u00229 yr\u0022\u003EApril 5, 2015\u003C/time\u003E by juvilado**"}]}