{"TopicId":103359,"ForumId":21,"TopicTitle":"SP Madrid modular ssto. To space, the other continents, or just around the block.","CreatedByName":"Jakalth","CreatedById":136495,"CreatedDateTime":"2015-04-04T02:15:27Z","PageNum":1,"Articles":[{"CreatedByName":"Jakalth","CreatedById":136495,"CreatedDateTime":"2015-04-04T02:15:27Z","Content":"I figured it would be easier to simply give this it\u0027s own thread.\n\nThis is the SP Madrid.\n\n![spmadridmodular1_zpsygrp9n3j.jpg](http://i1346.photobucket.com/albums/p685/Jakalth/SP%20Madrid%20modular/spmadridmodular1_zpsygrp9n3j.jpg)\n\nYou might say; \u0022Haven\u0027t you posted this somewhere already?\u0022, and you\u0027d be correct. But this version is the finished modular design version with 7 interchangeable modules for it. This version has the elevated \u0022stilt\u0022 landing gear setup to allow module attachment under the Madrid as well as on top of it. Each Madrid can hold two modules at a time. It also has a Docking Port Jr under it\u0027s nose for refueling.\n\nThe first module is the simplest. The Assist module. This modules sole job is to help the Madrid get its self and other modules into orbit.\n\n![spmadridassistmodule1_zpsarmb4sk3.jpg](http://i1346.photobucket.com/albums/p685/Jakalth/SP%20Madrid%20modular/spmadridassistmodule1_zpsarmb4sk3.jpg)\n\nThe next module fills a couple rolls. It\u0027s the High Performance module. This module can assist the Madrid into orbit as well as be used simply to make the Madrid faster and more fun to play with in atmosphere.\n\n![spmadridhpmodule1_zpsfmn06qvq.jpg](http://i1346.photobucket.com/albums/p685/Jakalth/SP%20Madrid%20modular/spmadridhpmodule1_zpsfmn06qvq.jpg)\n\nThe next module is a simple and versitile Cargo module. This module has a full size MK2 Cargo bay and a 1/2 size MK2 Cargo bay along with some rocket fuel and an engine to help get the Madrid into orbit. Once loaded with cargo, it\u0027s weight balance will still be good. Cargo weight limit is not known atm.\n\n![spmadridcargomodule1_zpsgx9vankp.jpg](http://i1346.photobucket.com/albums/p685/Jakalth/SP%20Madrid%20modular/spmadridcargomodule1_zpsgx9vankp.jpg)\n\nIf you need to get 16 Kerbals into or out of orbit this module is for you. It is the Passenger module. It holds up to 16 Kerbals, some rocket fuel, and an engine.\n\n![spmadridpassengermodule1_zpsdv6bmzfi.jpg](http://i1346.photobucket.com/albums/p685/Jakalth/SP%20Madrid%20modular/spmadridpassengermodule1_zpsdv6bmzfi.jpg)\n\nNow if a little extra fuel is needed instead, This Refueler module is just what you need. This module has it\u0027s own RCS, a probe core, and power generation(solar panels) so it can be detached from the Madrid and moved around in space on its own. It also has a second docking port for when you want to refuel something without detaching it.\n\n![spmadridrefuelermodule1_zpsuabvzkc8.jpg](http://i1346.photobucket.com/albums/p685/Jakalth/SP%20Madrid%20modular/spmadridrefuelermodule1_zpsuabvzkc8.jpg)\n\nNow, if 1 Madrid just can\u0027t quite carry enough snacks for your Kerbals, then why not two? Now, how about if you want to send both up at the same time? Well, this module is for you then. It is the Twin Coupler module. This module simply attaches two Madrids together into a single craft. It also has an attachment point for another module letting you carry 3 additional modules between the Madrids and the coupler. It also has a fuel tank and an engine to help move its self along.\n\n![spmadridtwinlinkmodule1_zpsqhuqxeqy.jpg](http://i1346.photobucket.com/albums/p685/Jakalth/SP%20Madrid%20modular/spmadridtwinlinkmodule1_zpsqhuqxeqy.jpg)\n\nWhat did I hear? 2 Madrids is still not enough? Then how about 4? Yep, the Quad Coupler module does just that, it lets you attach 4 Madrids into a single craft. It has it\u0027s own fuel tank and engine included and has a docking port for attaching another module to the coupler. This allows you to carry another 5 modules between the coupler and 4 Madrids.\n\n![spmadridquadlinkmodule1_zpsm9g5lsj5.jpg](http://i1346.photobucket.com/albums/p685/Jakalth/SP%20Madrid%20modular/spmadridquadlinkmodule1_zpsm9g5lsj5.jpg)\n\nThat still not enough? Want to make your game bend down and beg for mercy? Well... I can\u0027t help you there. This is all I have for the Madrid so far. I can add more modules if needed but these 7 should cover most of your needs.\n\nThings to remember:\n\n1: Struts, use them. Tie the modules down in front and back so they do not flap around(twin and quad couplers need no struts, they are stable enough as is)\n\n2: Action groups. You\u0027ll need to add the engines from any module you attach, to the correct action group. This includes additional Madrids. Otherwise staging gets messy.\n\n3: Struts, did I mention using them to keep the modules steady?\n\n4: Modifications... I\u0027m fine with modifications. Your free to modify these designs as you see fit. Be sure to have fun with it. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\n5: make sure you have at least 1 Kerbal in the cockpit of each Madrid. So you can fly them back separately if you so choose.\n\n6: be sure to have all Rapiers set to manual switch, air breathing mode, and toggle their mode using the [2] action group.\n\nTo get a second, third, fourth Madrid for linking them together:\n\n1: start out with the SP Madrid modular by its self.\n\n2: attach a truss, beam, or other similar part, to the top front docking port.\n\n3: use the root node tool to set the piece you just added to be the root node.\n\n4: [ALT] click on the top front docking port to make a copy of the madrid\n\n5: place this copy off to the side for now\n\n6: be sure to use the root node tool to set the MK2 cockpit to be the root node on the original Madrid.\n\n7: attach the twin/quad coupler to the original Madrid by rotating it so the front docking port on the coupler and Madrid line up.\n\n8: now move the copy of the original Madrid into place so that the top front docking port on the copy madrid and the coupler also line up and attach them.\n\n9: additional copies can now be made by [alt] clicking on the top front docking port of the first Madrid copy.\n\nAction Groups:\n\nNumber key [1]: Activates the Turbojet engines and Rapiers\n\nNumber key [2]: Shuts down the Turbojet engines and switches the mode of the Rapiers\n\nAny Rapiers used by the modules should be added to action group [1] with activate as the command, and set to action group [2] with the switch mode command.\n\nAny rocket engines used by the modules should be added to the action group [1] with deactivate as the command, and set to action group [2] with activate as the command.\n\nDownload: [SP Madrid modular \u002B modules](http://www./download/vhzh9tnq9igy3yb/SP_Madrid_modular.zip)\n\nThe \u0022SP Madrid modular\u0022 should be added to the ships/SPH folder while the 7 modules should be added to the subassemblies folder.\n\nEnjoy. ![:cool:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif)"},{"CreatedByName":"Yukon0009","CreatedById":109376,"CreatedDateTime":"2015-04-04T02:17:54Z","Content":"Niice! Rep for you."},{"CreatedByName":"Jakalth","CreatedById":136495,"CreatedDateTime":"2015-04-04T15:33:40Z","Content":"I should probably add. The slightly lengthy method for making copies of the Madrid is needed. I tried making a \u0022module\u0022 version of the madrid but it kept breaking the struts and fuel lines that hold the craft together and keep fuel flow consistant. But if you make copies of the original craft on the spot, the fuel lines and struts stay where they should be and it operates just fine.\n\nI do have to admit, landing the twin coupler Madrid requires precise alignment with the runway or the landing gear can twist. \n\nI also have to admit, landing the quad coupler is borderline impossible. \n\nSo far, I have made several successful landings with a fully laden twin Madrid with 3 modules on board, but not once have I been able to land the quad coupled Madrid. At least not while it was still linked up. Separating them in orbit and recovering the 5th module off the coupler, then landing each of the 4 Madrids separately... Now that works without any problems, but it means you have to leave the poor coupler in orbit."}]}