{"TopicId":103441,"ForumId":32,"TopicTitle":"How do generally install/deinstall your mods?","CreatedByName":"CaptRobau","CreatedById":41695,"CreatedDateTime":"2015-04-05T11:39:28Z","PageNum":1,"Articles":[{"CreatedByName":"CaptRobau","CreatedById":41695,"CreatedDateTime":"2015-04-05T11:39:28Z","Content":"\n\u003Cp\u003EAbout half a year ago I posted a \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/98092-How-do-you-manage-your-mods\u0022 rel=\u0022external nofollow\u0022\u003Esimilar poll\u003C/a\u003E with this question. Now at the eve of KSP 1.0 I wanted to see how this changed, especially with the arrival of CKAN.\u003C/p\u003E\n"},{"CreatedByName":"Elowiny","CreatedById":117659,"CreatedDateTime":"2015-04-05T12:12:19Z","Content":"\n\u003Cp\u003EI manually add them and remove them from GameData.\u003C/p\u003E\u003Cp\u003EThat\u0027s how kittens do it.\u003C/p\u003E\n"},{"CreatedByName":"Fourjays","CreatedById":60289,"CreatedDateTime":"2015-04-05T12:31:55Z","Content":"\n\u003Cp\u003EManually add/remove from GameData. I\u0027ve yet to come across a \u0022manager\u0022 that doesn\u0027t find some way to screw everything up, whatever the platform involved (game mods, dev environments, operating systems, etc).\u003C/p\u003E\n"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-04-05T12:42:06Z","Content":"\n\u003Cp\u003EManual. I know what I am doing and I sometimes do my own config for parts and MM. That said, I would love to see more modder using KSP-AVC so I don\u0027t have to do manual update too, that is a pain, and one thing that I would consider getting a mod manager for.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2015-04-05T13:02:39Z","Content":"\n\u003Cp\u003EManually add/remove from GameData. What is CKAN? I have no idea what your talking about.\u003C/p\u003E\n"},{"CreatedByName":"Varsi","CreatedById":120571,"CreatedDateTime":"2015-04-05T14:40:17Z","Content":"\n\u003Cp\u003ETried CKAN and returned to manual immediately. I just don\u0027t feel comfortable if I don\u0027t know exactly what changes.\u003C/p\u003E\n"},{"CreatedByName":"forenci","CreatedById":63070,"CreatedDateTime":"2015-04-05T14:51:57Z","Content":"\n\u003Cp\u003EI used to do it all manually, but now that I\u0027m using multiple installs of KSP I have found CKAN to be quite good at keeping track what is installed and isn\u0027t. A pet peeve of mine is mods that have GameData folders that don\u0027t actually have the name of the mod as the folder name. Makes it quite challenging when going through multiple installs and having to see what mods you do and do not have installed.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-04-05T15:07:36Z","Content":"\n\u003Cp\u003EGenerally by manually adding/removing folders from Gamedata. I currently have 3 installs:\u003C/p\u003E\u003Cp\u003E1. Vanilla. For bug testing, this install sometimes has a single mod installed for testing.\u003C/p\u003E\u003Cp\u003E2. Stock parts with info/vfx mods. This is my \u0022main\u0022 install, where I do most of my playing.\u003C/p\u003E\u003Cp\u003E3. RSS/RO. My \u0022hard mode\u0022 game, has many physics, info and parts mods installed. This one is managed with CKAN.\u003C/p\u003E\n"},{"CreatedByName":"klgraham1013","CreatedById":105132,"CreatedDateTime":"2015-04-05T16:01:02Z","Content":"\n\u003Cp\u003EI\u0027ve tried CKAN on a few occasions, but typically install the manual way.\u003C/p\u003E\u003Cp\u003ECurrently messing around with an RSS linux install with far to many mods. Have a stock windows install I mess around with new mods in, though KER is always installed on that one. I have a semi-realism windows install I\u0027m not playing to much these days. To be honest, I\u0027m on a half-break right now, waiting to see how 1.0 turns out.\u003C/p\u003E\n"},{"CreatedByName":"bobcook","CreatedById":73597,"CreatedDateTime":"2015-04-05T16:28:38Z","Content":"\n\u003Cp\u003EI manually manage the install/remove process from GameData, and I usually have two KSP installs going: one for nearly stock, one with a dozen or so mods. I\u0027ve heard of CKAN before, never tried it, not sure I have the problem it is trying to solve (changing mods is pretty rare).\u003C/p\u003E\n"},{"CreatedByName":"Thomas988","CreatedById":92699,"CreatedDateTime":"2015-04-05T16:32:31Z","Content":"\n\u003Cp\u003EI have a vanilla KSP I play on, then another copy for mods and yet another for making custom planets.\u003C/p\u003E\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2015-04-05T16:37:51Z","Content":"\n\u003Cp\u003EIf it\u0027s on CKan I use that, if not (or for some reason it is incompatible, maybe due to license) I manually add and remove.\u003C/p\u003E\u003Cp\u003EMy preference is CKAN as it is easy to see which mods need updating before you load the game. Also you know you have the related mods.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-04-05T16:46:04Z","Content":"\n\u003Cp\u003EManually. I think at the moment I\u0027ve just got a couple of 0.90 installs, a main one and a bone stock one.\u003C/p\u003E\u003Cp\u003EI tried CKAN, it pulled in all of Firespitter when I wanted KAX so I promptly went back to manual. (\u003Cem\u003EI know, I know\u003C/em\u003E, CKAN can be configured not to do that, but the default did and that was enough to put me off further use.)\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-04-05T16:59:37Z","Content":"\n\u003Cp\u003EOh crap, I voted wrong, should have been the second option. I used CKAN for one of my installs but I mainly do it manually.\u003C/p\u003E\n"},{"CreatedByName":"TeddyDD","CreatedById":28806,"CreatedDateTime":"2015-04-05T17:10:31Z","Content":"\n\u003Cp\u003ECKAN. There is no better way to do this.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI tried CKAN, it pulled in all of Firespitter when I wanted KAX so I promptly went back to manual. (\u003Cem\u003EI know, I know\u003C/em\u003E, CKAN can be configured not to do that, but the default did and that was enough to put me off further use.)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI fixed this recently. Also, you could use Part Manager Plugin to get rid of unwanted parts. Or fix metadata by yourself \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-04-05T18:56:56Z\u0022 title=\u002204/05/2015 06:56  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 5, 2015\u003C/time\u003E by TeddyDD\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Robotengineer","CreatedById":104525,"CreatedDateTime":"2015-04-05T17:12:34Z","Content":"\n\u003Cp\u003EI wish you made it multiple choice, I use both the manual and CKAN methods on multiple installs.\u003C/p\u003E\n"},{"CreatedByName":"diomedea","CreatedById":93700,"CreatedDateTime":"2015-04-05T17:25:34Z","Content":"\n\u003Cp\u003EI use a mod manager (KSP Mod Admin) for my \u0022main\u0022 game installs, and must say it works very well. \u003C/p\u003E\u003Cp\u003EBut, I also open a number of different installs for specific purposes (testing versions, or checking issues for support) and want to have absolute control over anything going in those. I manually copy/paste a lot to customize those installs as desired, no tool can provide the fine degree of control I need (sure not tools intended to automate installs and updates).\u003C/p\u003E\n"},{"CreatedByName":"Stone Blue","CreatedById":77721,"CreatedDateTime":"2015-04-05T17:30:31Z","Content":"\n\u003Cp\u003EI voted \u0022Other\u0022, as I use a combination of methods:\u003C/p\u003E\u003Cp\u003EI usually run 3-5 separate installs for various reasons.\u003C/p\u003E\u003Cp\u003EI usually install manually, but sometimes use KSP ModAdmin to manage mods...I mostly use it to streamline and strip out unneeded parts, so i can stuff MORE mods into the game... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Its also good for figuring out craft files and missing mod parts...\u003C/p\u003E\u003Cp\u003EI tried KSP-AVC for a little while, but it only worked for a miniscule amount of mods. I cant use CKAN, due to my router completely blocking the Github domain for some unknown reason...(Which means I skip most mods that are only available direct from Github links.. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E )\u003C/p\u003E\u003Cp\u003EI just recently came across TinkerTime, and will probably give that a try soon.\u003C/p\u003E\n"},{"CreatedByName":"Flixxbeatz","CreatedById":29991,"CreatedDateTime":"2015-04-05T17:33:39Z","Content":"\n\u003Cp\u003EOnly limiting myself to part add-ons most of the time.\u003C/p\u003E\u003Cp\u003EBasically... manually dropping them in GameData folder.\u003C/p\u003E\n"},{"CreatedByName":"Loligoat","CreatedById":99368,"CreatedDateTime":"2015-04-05T17:34:34Z","Content":"\n\u003Cp\u003EI manage my mods manually and I have 3 installs. 1 is just for mods, 1 is for Realism Overhaul, and I keep one without any mods and no saves as a backup.\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2015-04-05T17:40:19Z","Content":"\n\u003Cp\u003EManual. I have a bad opinion on mod managers.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2015-04-05T17:42:07Z","Content":"\n\u003Cp\u003EI don\u0027t see any need for CKAN (up until recently I had no idea it existed) when it\u0027s so easy to install a mod in KSP.\u003C/p\u003E\n"},{"CreatedByName":"yorshee","CreatedById":135011,"CreatedDateTime":"2015-04-05T17:52:19Z","Content":"\n\u003Cp\u003EI used to use CKAN until it kept installing old versions of mods, or was installing mods incorrectly. I just do it manually nowadays.\u003C/p\u003E\n"},{"CreatedByName":"MGCJerry","CreatedById":95202,"CreatedDateTime":"2015-04-05T19:57:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fourjays\u0022 data-cite=\u0022Fourjays\u0022\u003E\u003Cdiv\u003EManually add/remove from GameData. I\u0027ve yet to come across a \u0022manager\u0022 that doesn\u0027t find some way to screw everything up, whatever the platform involved (game mods, dev environments, operating systems, etc).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESame here for the same reasons.\u003C/p\u003E\n"},{"CreatedByName":"andrewas","CreatedById":24662,"CreatedDateTime":"2015-04-05T20:31:07Z","Content":"\n\u003Cp\u003ECKAN. \u003C/p\u003E\u003Cp\u003EI typically install a set of mods for each playthrough, so if CKAN screws up I can just go back to a clean install and start again. Life\u0027s too short to chase dependencies by hand if you don\u0027t absolutely have to.\u003C/p\u003E\n"}]}