{"TopicId":103563,"ForumId":16,"TopicTitle":"Catching Dunwin Kerman","CreatedByName":"spudnik54","CreatedById":140571,"CreatedDateTime":"2015-04-06T23:52:01Z","PageNum":1,"Articles":[{"CreatedByName":"spudnik54","CreatedById":140571,"CreatedDateTime":"2015-04-06T23:52:01Z","Content":"It seems that the contract to catch Dunwin Kerman in orbit is impossible. He does not grab on to any external ladders and crew members on EVA seem incapable of grabbing him. Does anyone know how to catch Dunwin short of catching him in a cargo bay?"},{"CreatedByName":"Asharad","CreatedById":107448,"CreatedDateTime":"2015-04-07T00:35:14Z","Content":"did you switch to him and use \u0022F\u0022 to grab the ladder?"},{"CreatedByName":"Randazzo","CreatedById":136468,"CreatedDateTime":"2015-04-07T00:36:14Z","Content":"You will need to switch control to master Dunwin with the [ or ] key. Once in control, press R to activate his suits thrusters and navigate him to a suitable ladder. \n\nIf you have done both of these things and he won\u0027t grab on to anything, my thought is perhaps you have a life support mod installed and he\u0027s starved before you got to him?\n\nOther than that, dunno.\n\nEdit: And what that pro ninja above me said."},{"CreatedByName":"Master Tao","CreatedById":110410,"CreatedDateTime":"2015-04-07T01:05:15Z","Content":"\u003Cmoderation\u003EMoved to Gameplay Questions.\u003C/moderation\u003E\n\nWhat they said. Close to within 2.3 km, switch to Dunwin using the [ or ] keys, then use the EVA pack to move the Kerbal to your rescue craft."},{"CreatedByName":"OhioBob","CreatedById":128005,"CreatedDateTime":"2015-04-07T04:52:38Z","Content":"Or move your rescue craft to the Kerbal. I still haven\u0027t gotten the knack for controlling Kerbals on EVA. Instead, I just slowly maneuver my ship to the Kerbal and, as soon as he\u0027s within reach of the ladder, I switch the the Kerbal and immediately grab hold."},{"CreatedByName":"Kras","CreatedById":140583,"CreatedDateTime":"2015-04-07T05:15:43Z","Content":"\u003E \n\u003E Or move your rescue craft to the Kerbal. I still haven\u0027t gotten the knack for controlling Kerbals on EVA. Instead, I just slowly maneuver my ship to the Kerbal and, as soon as he\u0027s within reach of the ladder, I switch the the Kerbal and immediately grab hold.\n\nThis generally tends to be the best way of going about it in my *opinion*, the simplest designs I\u0027ve utilized consisted of 2 MK1 Pods attached to each other, chuted \u0026 lifted by a small rocket to rendezvous within ~2km of the poor soul you\u0027re trying to rescue (closer if you can!). Then it\u0027s a simple matter of switching, enabling the RCS Pack and jumping on board by grabbing the ladder with \u0022F\u0022 when close!"},{"CreatedByName":"Khazar","CreatedById":138578,"CreatedDateTime":"2015-04-07T08:38:46Z","Content":"I would say that controlling Kerbals on EVA is much easier than controlling a craft. Keyboard controls depend on your facing. If you are looking directly at target, then A will move you left, D right, W forward, S backward, Shift - up and ctrl - down. You rotate with mose. If you turn lets say 90\u0027 right, then your target would be on your left and therefore to move in its direction you would have to press A instead of w."},{"CreatedByName":"Varsi","CreatedById":120571,"CreatedDateTime":"2015-04-07T08:50:55Z","Content":"Can you save Kerbals using the Klaw? Would be somewhat harder than switching conrol to Kerbal tho."},{"CreatedByName":"jarmund","CreatedById":126888,"CreatedDateTime":"2015-04-07T09:03:46Z","Content":"\u003E \n\u003E Can you save Kerbals using the Klaw? Would be somewhat harder than switching conrol to Kerbal tho.\n\nYou can, but you have to Klaw him very precisely.\n\nI once did one of those contracts by having a cargo bay on my craft. If it wasn\u0027t for the fact that loose items in cargo bays doesn\u0027t get recovered with the rest of the craft, that would have been my way of solving the mission. But in my eyes, I saved him."}]}