{"TopicId":103521,"ForumId":29,"TopicTitle":"GUIStyles question","CreatedByName":"Diazo","CreatedById":81549,"CreatedDateTime":"2015-04-06T13:42:50Z","PageNum":1,"Articles":[{"CreatedByName":"Diazo","CreatedById":81549,"CreatedDateTime":"2015-04-06T13:42:50Z","Content":"Good day, I have a question with GUIStyles and why the changes I make to them do not seem to be sticking.\n\nFirst, I create my style during the Start() method of the Flight scene as so:\n\n    AGXSkin = (GUISkin)MonoBehaviour.Instantiate(HighLogic.Skin);AGXBtnStyle = new GUIStyle(AGXSkin.button);//AGXBtnStyle.Variables get set here.\n\nI never set any part of the AGXBtnStyle again, it is all in the Start() method.\n\nThis results in a window that looks like this most of the time (bottom window):\n\n![AGExtQuickStart2.jpg](http://members.shaw.ca/diazo/AGExtQuickStart2.jpg)\n\nHowever, sometimes exterior factors seem to affect my GUIstyle, notably bringing up the in-game ESC menu causes this (top window):\n\n![35ip477.jpg](http://i58.tinypic.com/35ip477.jpg)\n\nNote the black box that seems to have appeared (also visible in the lower box covering the Window Title text) and while the second screen shot isn\u0027t clear, the font itself has changed slightly and moved upwards a few pixels on the button.\n\nNow, the first two lines in the Start code are both supposed to make stand alone copies of the Style that, in my understanding, would prevent outside forces from changing my style. This is not what is happening as simply bringing up the in-game ESC menu causes my GUIStyle to change somehow.\n\nI\u0027ve bashed my head against this for quite a while now and gotten no where, does anyone have any ideas on what causes this, or what I am missing in my understanding of GUIStyles?\n\nD."},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2015-04-06T14:24:09Z","Content":"It looks like you might not really be making an independent copy of the stock GUISkin. \n\nI would check TriggerAu\u0027s code for doing this, as it seems to work fine: [http://forum.kerbalspaceprogram.com/entries/1259-An-Adventure-in-Plugin-Coding-6-Lay-some-skin-on-me](https://forum.kerbalspaceprogram.com/entries/1259-An-Adventure-in-Plugin-Coding-6-Lay-some-skin-on-me)"},{"CreatedByName":"philotical","CreatedById":109390,"CreatedDateTime":"2015-04-06T14:26:16Z","Content":"Is this used inside GUILayout or inside GUI?\n\nThose buttons are on top of each other as soon as it goes wrong - right?\n\nThat indicates it\u0027s GUI - GUI needs strict positioning..\n\nCould it be, that these buttons are positioned by GUI-functions and somehow lose theire position Rect values?\n\nJust guessing..\n\nwould need more insight to debug.."},{"CreatedByName":"Crzyrndm","CreatedById":92871,"CreatedDateTime":"2015-04-06T14:55:16Z","Content":"The only differences I see between how you approach it and how I have approached it with Pilot Assistant are:\n\n1) [I build the GUISkin/GUIStyles in the first draw call](https://github.com/Crzyrndm/Pilot-Assistant/blob/master/PilotAssistant/PresetManager.cs#L90). I seem to recall it throwing errors when I tried to do it in Start, never bothered to figure out why. I assume that\u0027s not an issue here since things seem to be working...\n\n2) I skip the need to assign GUIStyles to every GUI object and just set GUI.Skin to my saved GUISkin before anything else in the draw calls. That way you can be sure you aren\u0027t missing any, and only need to specify the style where it doesn\u0027t match (eg. drawing a box as a button). When I had this issue it was all down to one or two objects that didn\u0027t get a style attached.\n\nPS\n\nWould you mind specifying some relevant lines in Github. Your flight scene code is somewhat long and I\u0027m having some difficulty matching sections of code to individual windows...\n\n\u003E \n\u003E I would check TriggerAu\u0027s code for doing this, as it seems to work fine\n\nIt\u0027s the same base method as used by TriggerAu\n\n**Edited \u003Ctime datetime=\u00222015-04-06T15:04:32Z\u0022 title=\u002204/06/2015 03:04  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 6, 2015\u003C/time\u003E by Crzyrndm**"},{"CreatedByName":"Diazo","CreatedById":81549,"CreatedDateTime":"2015-04-06T15:23:21Z","Content":"Ya, my code\u0027s kind of gotten out of control at this point.\n\nAnd I use GUI, not GUILayout.\n\nSo, code reference:\n\n[Start() method where I copy the skin and styles.](https://github.com/SirDiazo/AGExt/blob/master/AGExt/Flight.cs#L489)\n\n[FlightWindow() method that draws the window in question.](https://github.com/SirDiazo/AGExt/blob/master/AGExt/Flight.cs#L1624)\n\n[The \u0022KeySet1\u0022 button.](https://github.com/SirDiazo/AGExt/blob/master/AGExt/Flight.cs#L1641)\n\n[GUI.BeginScrollWindow that is the smaller, darker, rectangle behind the buttons that sticks out to the right.](https://github.com/SirDiazo/AGExt/blob/master/AGExt/Flight.cs#L1659)\n\n@Button positioning: Button position is fine and does not move. When this issue occurs, the text on the button moves up a few pixels relative the button the text is drawn by. The font also changes slightly for some reason. (I\u0027ll try to get some zoomed in pictures to show this when I can.) IE: The KeySet1 button stays still on the screen while the \u0022KeySet1\u0022 text itself moves on the screen a few pixels. If I was not assigning the alignment every frame the window is drawn, I would think my alignment value is being changed somehow from MiddleCenter to TopCenter.\n\n@Using GUI.Skin: As I understand things, this is my problem. GUI.Skin and Highlogic.Skin are Static objects in KSP. Any changes made by any mod to these objects carry over to other mods using said objects. Therefore I\u0027m jumping through all these hoops trying to make a GUISkin/Style that is totally separate from GUI.Skin (or Highlogic.Skin) that I can use exclusively for my mod because (I think) this issue is caused by other mods (or base KSP when the pause menu opens) modifying HighLogic.Skin on me.\n\n@GUI.BeginScrollView: Digging into my code some more, part of my problem is that I can\u0027t figure out how to assign a style to GUI.BeginScrollView, these are the boxes that are appearing on top of everything. The BeginScrollWindow object only allows assigning styles for the scrollbars, not for the window itself. If I could figure this part out, it might be enough to mitigate what is going on that I could proceed.\n\nI still feel like I\u0027m grasping at straws here, my understanding of what I think GUIStyles do and what is actually happening are two very different things and I am open to any help you guys can give me.\n\nD.\n\n**Edited \u003Ctime datetime=\u00222015-04-06T15:26:27Z\u0022 title=\u002204/06/2015 03:26  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 6, 2015\u003C/time\u003E by Diazo**"},{"CreatedByName":"philotical","CreatedById":109390,"CreatedDateTime":"2015-04-06T16:45:08Z","Content":"I think it\u0027s not your style, it is GUI\n\nGUI is in CSS terms the \u0022absolute\u0022 - GuyLayout is \u0022relative\u0022\n\nif you have two buttons in vertical GUILayout, the will automatically be positioned propperly and the box height wll be increased to make them fit\n\nGUI on the other hand, allways messures from the reference box by your Rect values..\n\nif you diplay the button for example in an other box with other messurements, those carefully set RectValues are non-sense in that reference..\n\nMy suggestion might sound drastic at first, but if you don\u0027t have a special reason for using GUI, it might be worth it..\n\nReplace all GUI with GUILayout and see what happens..\n\nmy gutt says, the problems will just be gone..\n\nOnly reason for GUI, is pixelperfect positioning - for example if you have two textures that need to be over each other and one rotates or so - for a gauge or something..\n\nall other GUI \u0022should\u0022 IMO be GuiLayout - less headache\n\nIf I had to guess, I\u0027d say, the box that contains these button loses it\u0027s Rect Height- or Top-Value somehow - and that destroys your layout..\n\nwith GUILayout, this will never happen..\n\nmy 2 cents..\n\nHTH"},{"CreatedByName":"Diazo","CreatedById":81549,"CreatedDateTime":"2015-04-06T17:14:38Z","Content":"But the *button* position is fine and not changing. It\u0027s the *button text* that is moving on the button. Hence why I\u0027m trying to figure out GUIStyles, as I understand things the GUIStyle is what controls how the button text appears on the button.\n\nD."},{"CreatedByName":"sarbian","CreatedById":57146,"CreatedDateTime":"2015-04-06T20:47:06Z","Content":"Anything GUI needs to be done in OnGUI or the game just ignore it (and spew errors)"},{"CreatedByName":"Crzyrndm","CreatedById":92871,"CreatedDateTime":"2015-04-06T22:31:33Z","Content":"\u003E \n\u003E Ya, my code\u0027s kind of gotten out of control at this point.\n\nHeh.\n\n\u003E \n\u003E @Using GUI.Skin: As I understand things, this is my problem. GUI.Skin and Highlogic.Skin are Static objects in KSP. Any changes made by any mod to these objects carry over to other mods using said objects. Therefore I\u0027m jumping through all these hoops trying to make a GUISkin/Style that is totally separate from GUI.Skin (or Highlogic.Skin) that I can use exclusively for my mod because (I think) this issue is caused by other mods (or base KSP when the pause menu opens) modifying HighLogic.Skin on me.\n\nGUI.Skin is the current default GUIStyles for each object that is to be drawn (which defaults to the Unity skin, and gets altered by KSP and mods as required). By setting GUI.Skin to be your saved defaults, you remove any chance of KSP/other mods from making changes that affect your GUI. After that, you only need to specify styles where the style to use isn\u0027t the default one. Things like the GUIStyle of a scrollview aren\u0027t an issue.\n\nEDIT\n\nOk, that is wierd. The alignment setting should work just fine, but the text in both buttons appears to be using TopCenter, not MiddleCenter (I may have missed your issue the first time round...). The only thing I can think of is that it\u0027s trying to print multiple lines of text, is there any chance of a newline character being added to KeySetNamesFlight[int id]? I\u0027m guessing not, so I\u0027m totally stumped as to why this didn\u0027t work ([https://github.com/SirDiazo/AGExt/blob/master/AGExt/Flight.cs#L1627](https://github.com/SirDiazo/AGExt/blob/master/AGExt/Flight.cs#L1627))\n\nPS\n\nDrawing the right button and then the left button? Are you trying to confuse yourself? ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)\n\n**Edited \u003Ctime datetime=\u00222015-04-06T22:37:53Z\u0022 title=\u002204/06/2015 10:37  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 6, 2015\u003C/time\u003E by Crzyrndm**"},{"CreatedByName":"Diazo","CreatedById":81549,"CreatedDateTime":"2015-04-06T23:57:00Z","Content":"Okay, to detail what is going on:\n\n![r5W9t12.png](http://i.imgur.com/r5W9t12.png)\n\nOnly difference between left and right is hitting the ESC key.\n\nLeft: As desired\n\nRight: Font on button changes and moves upwards, black rectangle (GUI.ScrollView) shows across the top, just below the Actions title and across the Queued Actions text.\n\n@Sarbian: I\u0027ve never used OnGUi() for any of my mods and this has been the only issue I\u0027ve been unable to resolve with doing GUI stuff.\n\n@Crzyrndm: How does that work? When I look at UnityEngine.GUI.SKin in the object browser it is a static, so if I do something like \n\n    UnityEngine.GUI.Skin.button.normal.textcolor = color.red;\n\n am I not turning the text on all buttons across all mods that use GUI.Skin.button red, not just my own mod?\n\nAs I don\u0027t want to do that and want my GUI settings exclusive to my mod only, I\u0027m posting this thread trying to figure out how to do that.\n\nD."},{"CreatedByName":"Crzyrndm","CreatedById":92871,"CreatedDateTime":"2015-04-07T00:35:18Z","Content":"If you don\u0027t want to affect anyone else, just remember what the skin was and set it back after you\u0027re done.\n\n    GUISkin orginalSKin = (GUISkin)MonoBehaviour.Instantiate(GUI.Skin);;Gui.Skin = MySkin;// Your GUI StuffGui.Skin = originalSkin;\n\nBut really, that doesn\u0027t help other people IMO. KSP itself makes changes to GUI.Skin when certain windows are open (the esc menu is one) never mind mods that do so, so the only way to have a consistent GUI is to use your own skin (A \u0022how to maintain your GUI\u0022 could be useful for newcomers though).\n\nPS\n\nI can\u0027t reproduce the issue using your current release? Are you sure this isn\u0027t a mod interaction? (E: Nevermind, something Pilot Assistant was doing fixed it. I\u0027m assuming because I set the GUISkin to the Unity Skin)\n\nEDIT\n\nOnGUI is what the drawQueue\u0027s are called in. You can\u0027t use GUI methods outside that environment normally.\n\n- - - Updated - - -\n\nYou could try setting GUI.Skin back to it\u0027s default ([http://docs.unity3d.com/ScriptReference/GUI-skin.html](http://docs.unity3d.com/ScriptReference/GUI-skin.html) : \u0022If you set it null, it reverts to the default Unity Skin\u0022). That won\u0027t affect any other mods (because it\u0027s the default), and It seems to fix the issue if the interaction with PA is anything to go by\n\n**Edited \u003Ctime datetime=\u00222015-04-07T00:38:10Z\u0022 title=\u002204/07/2015 12:38  AM\u0022 data-short=\u00229 yr\u0022\u003EApril 7, 2015\u003C/time\u003E by Crzyrndm**"},{"CreatedByName":"Diazo","CreatedById":81549,"CreatedDateTime":"2015-04-07T00:43:42Z","Content":"Is this a computer specific thing now?\n\nTo test, I nuked all mods from my steam install, verified cache then copied just this mod back in, issue still happens as per the picture in my last post.\n\nNote that the error only happens when the ESC menu is up, hitting ESC a second time to close the menu and everything reverts back to what I want to see.\n\nWindows 32 bit KSP run through Steam for this test, also happens in my dev environment not run through Steam.\n\n64-bit Windows 7\n\nNo errors or related messages that I can find in the log.\n\nWhat system setup were you not able to replicate this with?\n\nAs for the OnGUI thing, I hook directly into the rendering manager so I have more flexibility, so for the purposes of this thread, all the code in question is running \u0022inside OnGUI\u0022 I believe.\n\nD.\n\n**Edited \u003Ctime datetime=\u00222015-04-07T00:46:00Z\u0022 title=\u002204/07/2015 12:46  AM\u0022 data-short=\u00229 yr\u0022\u003EApril 7, 2015\u003C/time\u003E by Diazo**"},{"CreatedByName":"Crzyrndm","CreatedById":92871,"CreatedDateTime":"2015-04-07T00:58:03Z","Content":"That was my bad, my lauch shortcut automatically copies my mods from the development folder, so even though I cleared GameData I had some interference...\n\nOf particular importance in edits\n\n\u003E \n\u003E You could try setting GUI.Skin back to it\u0027s default ([http://docs.unity3d.com/ScriptReference/GUI-skin.html](http://docs.unity3d.com/ScriptReference/GUI-skin.html) : \u0022If you set it null, it reverts to the default Unity Skin\u0022). That won\u0027t affect any other mods (because it\u0027s the default), and It seems to fix the issue if the interaction with PA is anything to go by"},{"CreatedByName":"Diazo","CreatedById":81549,"CreatedDateTime":"2015-04-07T01:04:57Z","Content":"Apparently I can\u0027t do that.\n\nHighLogic.Skin = null; //does not compile as that is read-only\n\nGUI.Skin = null; //compiles but throws nullref errors all over the place.\n\nAt this point if I can figure the scrollbars out I\u0027ll be happy. I\u0027ll just have to live with the text going funny sometimes.\n\nD."},{"CreatedByName":"Crzyrndm","CreatedById":92871,"CreatedDateTime":"2015-04-07T01:07:45Z","Content":"Save the default GUISkin when you enter the flight scene and use that then\n\n    GUISkin UnitySkin;// drawCallif (UnitySkin == null)    UnitySkin = (GUISkin)Monobehaviour.Instantiate(GUI.Skin);GUI.Skin = UnitySkin;// continue as normal\n\n**Edited \u003Ctime datetime=\u00222015-04-07T01:10:11Z\u0022 title=\u002204/07/2015 01:10  AM\u0022 data-short=\u00229 yr\u0022\u003EApril 7, 2015\u003C/time\u003E by Crzyrndm**"},{"CreatedByName":"xEvilReeperx","CreatedById":75857,"CreatedDateTime":"2015-04-07T01:47:44Z","Content":"GUI.Window saves the current skin, matrix, etc and restores it when the method ends. The problem you\u0027re seeing is that somebody is manipulating those things (GUI.Skin) from a RenderingManager callback but outside of GUI.Window and not restoring them correctly. Your choices are:\n\n1. Use OnGUI instead of RenderingManager (my preference), or\n2. During startup, clone HighLogic.Skin and make your modifications. Then set the current GUI.Skin inside your DrawWindow methods to the copy you made as the first thing you do inside every DrawWindow callback.\n\nI avoid using RenderingManager because if any other mod using it throws an exception inside their callback, your GUI gets hosed. I\u0027m not sure what flexibility it adds (?)"},{"CreatedByName":"Diazo","CreatedById":81549,"CreatedDateTime":"2015-04-07T03:40:06Z","Content":"Okay, piecing together everyone\u0027s comments, I think I\u0027ve figured out what is going on.\n\nFirst, there is two GUI Skins, GUI.skin and HighLogic.Skin\n\nGUI.Skin is the Unity Default and SQUAD made there own skin for the HighLogic.skin object. However, they did not clone GUI.skin, they just made a reference copy of it. (As per GUISkin HighLogic.skin = GUI.skin in C# code).\n\nTherefore, when I made a clone of HighLogic.skin, I copied the *references* present, not the actual values I wanted.\n\nThen for whatever reason, when the ESC menu is opening, the **default skin changes**, including the font. Because my GUISkin object has a reference to the default font in it, not an explicit font definition, my buttons pick up this font change. (It\u0027s Arial normally and Calibri when the ESC menu is open for reference.)\n\nGoing back over my GUI with this knowledge, I believe I understand how things are working. I can\u0027t get the Arial font to assign yet, but that\u0027s just a matter of tracking it down.\n\n@EvilReeper: I use rendering manager because it gives me more flexibility, or thought it did. Based on the Unity docs, you can only use stuff like GUI.Button in it so I went with accessing rendering manager directly. \n\nLooking into it just now because of your post, it appears that was wrong and OnGui allows me to do anything directly accessing the rendering manager does.\n\n[http://docs.unity3d.com/ScriptReference/MonoBehaviour.OnGUI.html](http://docs.unity3d.com/ScriptReference/MonoBehaviour.OnGUI.html)\n\nSo, this is resolved I believe, I just have to wrap the loose ends up.\n\nD."}]}