{"TopicId":103680,"ForumId":20,"TopicTitle":"Elite-like experience","CreatedByName":"cttw","CreatedById":2670,"CreatedDateTime":"2015-04-08T11:16:14Z","PageNum":1,"Articles":[{"CreatedByName":"cttw","CreatedById":2670,"CreatedDateTime":"2015-04-08T11:16:14Z","Content":"\n\u003Cp\u003EThis is an idea I\u0027ve been tumbling around my head, and unfortunately I won\u0027t be able to implement it. However if someone else wants to do it, go right ahead.\u003C/p\u003E\u003Cp\u003ESo the basic idea is that instead of running the space program of the Kerbal civilization, you are now a private spacer in the near future of space resource exploitation, at a single system level. Here\u0027s some gameplay elements:\u003C/p\u003E\u003Cp\u003E- Mod Space Stations (and ground sites) could be created to simulate a space economy/infrastructure\u003C/p\u003E\u003Cp\u003E- The player has a bank balance that he earns by mining or transporting, either at fixed prices (per station) or contract dependent, like deliver some large amount of stuff\u003C/p\u003E\u003Cp\u003E- The challenge would be in finding and economic place for yourself in the system and creating ships/mission plans that still turn a profit.\u003C/p\u003E\u003Cp\u003E- You can design new ships at buy them. They could be cheaper if bought in Kerbin, but then they must reach orbit to buy fuel at a station, or you could buy them in orbital shipyards for extra cost but free from the gravity well.\u003C/p\u003E\u003Cp\u003E- Some of the stations / ground sites / parts could become available over time to increase choices and goals.\u003C/p\u003E\u003Cp\u003E- The economy should allow for someone to capture an asteroid and park it by the asteroid dust buying station at considerable cost, but at the same time without crashing the economy, like reducing the price of stuff you sell enormous amounts of.\u003C/p\u003E\u003Cp\u003E- You can buy fuel from stations or you could drop Karbonite-style refuel probe landers that continuously produce fuel so that you dont have to timewarp a year and lose your contracts.\u003C/p\u003E\u003Cp\u003EGame situations:\u003C/p\u003E\u003Cp\u003E- Starting tech is crap, but you manage to create a moon mining infrastructure that will drop parachuted loads of cargo into kerbal at considerable cost.\u003C/p\u003E\u003Cp\u003E- Orbital shipyard is now up in Kerbin and you now deliver larger amounts of moon stuff on a single ship that does not have to take off from Kerbin ever.\u003C/p\u003E\u003Cp\u003E- You took a big contract to deliver cargo to Duna, and now you ferry minerals from Ike while you wait for a return window. At the last moment there is a passenger transport contract that requires a pickup from Duna surface which would require another trip to refuel at your ike refuel probe. Do you have time to do it inside the return window?\u003C/p\u003E\u003Cp\u003E- The Laythe colony hungers for resources but lack of access to an orbital spaceyard makes every mistake very costly.\u003C/p\u003E\u003Cp\u003E- Warp drives make outer planets available for direct trading and exploitation, but realistic reentry makes burning off that excess delta-v difficult on a heavy freighter.\u003C/p\u003E\u003Cp\u003ELater stuff:\u003C/p\u003E\u003Cp\u003E- NPC ships in the economy, at least those within sensor range and in the map view.\u003C/p\u003E\u003Cp\u003E- Hired crew with special abilities like bargaining, prospecting, engine tuning, navigation, etc.\u003C/p\u003E\u003Cp\u003EThanks for reading.\u003C/p\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2015-04-08T11:29:24Z","Content":"\n\u003Cp\u003EWhat I remember from Elite is that you had to make hundreds of flights to make any money. Of course there was plenty of action within those flights but that\u0027s with a highly simplified \u0022battlestar galactica\u0022 flight model. It will be a challenge to come up with an economic model that requires fewer flights (to prevent the game from getting grindy) without opening up the opportunity to \u0022use loopholes\u0022 and rake in millions in ways that weren\u0027t intended, or by running one particular kind of mission.\u003C/p\u003E\u003Cp\u003EI can see the potential though. The \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/113642-0-90-Contract-Pack-Kerbin-Space-Station-1-0-%2804-04-15%29?highlight=station\u002Bcontract\u0022 rel=\u0022external nofollow\u0022\u003ESpace Station Contract Pack\u003C/a\u003E is taking things in the direction I\u0027d like to see, giving you the ability to make serious money without grinding too much and at the same time keep the challenges fun.\u003C/p\u003E\n"},{"CreatedByName":"Van Disaster","CreatedById":58876,"CreatedDateTime":"2015-04-08T12:41:45Z","Content":"\n\u003Cp\u003ESimply having contracts available to service NPC stations would be a good first step ( I\u0027ve thought this for a while \u0026amp; suggested it a couple of times ), and well... that\u0027s exactly what is happening with the ISS. Expand that a step to servicing a station around say, Duna. Now expand that to shipping ISRU resources mined by a NPC corp on Duna. So far nothing is outside scope of 1.0. Now all you need to add is the ability to directly buy and sell resources rather than sell your ability to ship them - and then you can run your own processing facility to refine stuff \u0026amp; print cash, because refining doesn\u0027t cost anything to run \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EHalf of it is there already though.\u003C/p\u003E\n"}]}