{"TopicId":103845,"ForumId":44,"TopicTitle":"Could the Portuguese Man Of War become a new organism?","CreatedByName":"Everten P.","CreatedById":103089,"CreatedDateTime":"2015-04-10T15:00:25Z","PageNum":1,"Articles":[{"CreatedByName":"Everten P.","CreatedById":103089,"CreatedDateTime":"2015-04-10T15:00:25Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022https://en.m.wikipedia.org/wiki/Portuguese_man_o%27_war\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.m.wikipedia.org/wiki/Portuguese_man_o%27_war\u003C/a\u003E \u003C/p\u003E\u003Cp\u003EUnfortunately I have to begin this forum post with a Wikipedia link for basic information on the Portuguese Man Of War. However my question is, could the Portuguese Man Of War become proof of many organisms becoming one, new organism? It is believed that mitochondria were once an independent bacteria that became part of cells when they realized survival and reproduction were more likely as part of a cell than alone. \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://learn.genetics.utah.edu/content/cells/organelles/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://learn.genetics.utah.edu/content/cells/organelles/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe Portuguese Man Of War seems to be working in the same way. With multiple organisms working together because survival and reproduction are more likely. Could in the next 50-100 years could we start seeing whole Portuguese Man Of Wars being born instead of the cluster that we see today (my estimate may be off but I am no biologist \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E )\u003C/p\u003E\n"},{"CreatedByName":"pincushionman","CreatedById":98495,"CreatedDateTime":"2015-04-10T16:26:37Z","Content":"\n\u003Cp\u003EIt seems you think these colonies are a collection of separate individuals of various species that come together - I don\u0027t think that\u0027s the case: \u003Ca href=\u0022http://www.thenakedscientists.com/forum/index.php?topic=28025.0\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.thenakedscientists.com/forum/index.php?topic=28025.0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt seems they\u0027re born as a kind of larva which buds off the other specialized individuals. Kind of like a colony of ants, bees, or termites which are made up of caste individuals all descended from a single queen.\u003C/p\u003E\u003Cp\u003ENow, there \u003Cem\u003Eare\u003C/em\u003E colonial organisms which exhibit this \u0022come together\u0022 behavior, but they\u0027re pretty mch all lichens, and they haven\u0027t really made any steps toward true integration since being some of the very first land organisms ever, so I don\u0027t wxpect them to change in the next hundred years.\u003C/p\u003E\n"},{"CreatedByName":"fenderzilla","CreatedById":70047,"CreatedDateTime":"2015-04-10T16:29:09Z","Content":"\n\u003Cp\u003EMitochondria are the powerhouses of the cell\u003C/p\u003E\n"},{"CreatedByName":"Dkmdlb","CreatedById":70275,"CreatedDateTime":"2015-04-10T16:51:31Z","Content":"\n\u003Cp\u003EThanks for sharing that Mr. Zilla.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2015-04-10T18:40:51Z","Content":"\n\u003Cp\u003EThis creature is a colony of zooids. And yes, it is possible that during very long periods of time (100 years is painfully little time to consider) their dependancy on one another will be so high that it could be called one organism.\u003C/p\u003E\u003Cp\u003EAfter all, that\u0027s how multicellular organisms came to be. Not all branches of the evolutionary tree are proceeding at the same speed, and some of them go backwards. It\u0027s a blind process. What\u0027s optimal, survives, no matter how weird it seems to be.\u003C/p\u003E\u003Cp\u003EThere are weird creatures all over the Earth, but the general public rarely encounters them and, sadly, most of the latest \u0022natural documentary shows\u0022 only know of feriocious mammals and reptiles. Life on Earth is vastly more interesting than that.\u003C/p\u003E\n"},{"CreatedByName":"hugix","CreatedById":55379,"CreatedDateTime":"2015-04-10T20:00:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022fenderzilla\u0022 data-cite=\u0022fenderzilla\u0022\u003E\u003Cdiv\u003EMitochondria are the powerhouses of the cell\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI thought it was what the force was made of???\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2015-04-10T20:12:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022hugix\u0022 data-cite=\u0022hugix\u0022\u003E\u003Cdiv\u003EI thought it was what the force was made of???\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027re thinking of metaclorians... Best you forget about those (see Rule #3 of \u0022\u003Ca href=\u0022http://www.dearjjabrams.com/\u0022 rel=\u0022external nofollow\u0022\u003E4 Rules To Make Star Wars Great Again\u003C/a\u003E\u0022).\u003C/p\u003E\n"},{"CreatedByName":"moronwrocket","CreatedById":134908,"CreatedDateTime":"2015-04-10T21:23:30Z","Content":"\n\u003Cp\u003EThe bacteria that live inside us outnumber the number of cells in our body. And many in the microbiome do provide useful services to us. It\u0027s possible that given enough time they could become incorporated into our cells directly like mitochondria and chloroplasts at some point in the future.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3298082/#S5title\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.ncbi.nlm.nih.gov/pmc/articles/PMC3298082/#S5title\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2015-04-11T01:54:32Z","Content":"\n\u003Cp\u003EKeep it on-topic, please.\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-04-11T17:25:39Z","Content":"\n\u003Cp\u003EThe Man of War is a single species.\u003C/p\u003E\u003Cp\u003EIts like asking if an ant colony can become a new organism.\u003C/p\u003E\u003Cp\u003EThis isn\u0027t symbiosis like mitochondria and eukaryotic cells.\u003C/p\u003E\u003Cp\u003EThis is more like an ant colony. There are different forms, they all depend on each other, and they are all the same species.\u003C/p\u003E\u003Cp\u003EThere\u0027s a large grey area in terms of where you draw the line between a collection of single celled organisms working together, and a \u0022true\u0022 multicellular organism.\u003C/p\u003E\u003Cp\u003ELikewise... while we don\u0027t currently recongize any multi-organism-superorganisms... one could imagine a grey area too.\u003C/p\u003E\u003Cp\u003EThe individuals are to the superorganism what cells are to multicellular organisms.\u003C/p\u003E\u003Cp\u003EThe man-o-war would be one candidate for such an organism.\u003C/p\u003E\u003Cp\u003EHymenoptera colonies would be another.\u003C/p\u003E\u003Cp\u003ECorrals would be another\u003C/p\u003E\u003Cp\u003EHuman tribes, clans, nations, civilizations, etc would be another\u003C/p\u003E\u003Cp\u003E...\u003C/p\u003E\u003Cp\u003Eand so on\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022fenderzilla\u0022 data-cite=\u0022fenderzilla\u0022\u003E\u003Cdiv\u003EMitochondria are the powerhouses of the cell\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey are also (in multicellular organisms) involed in the immune response, in apoptosis, and are the site of Fe-S cluster formation.\u003C/p\u003E\u003Cp\u003EThey also play a role in branched chain amino acid synthesis.\u003C/p\u003E\u003Cp\u003EIts quite an oversimplification to say they are just the powerhouse (ie ATP source).\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003Ethey realized survival and reproduction were more likely as part of a cell than alone. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey didn\u0027t realize anything.\u003C/p\u003E\u003Cp\u003EFirst, they are most closely related to alpha proteobacteria that are parasitic.\u003C/p\u003E\u003Cp\u003EThey were likely invading cells long before becoming mitochondria.\u003C/p\u003E\u003Cp\u003EWhat likely happened, was that they evolved ot be rather benign (too virulent, and you kill your hosts too quickly... much like the selection pressure for lambda phage... and a lot of viruses that are persistant, but not lethal).\u003C/p\u003E\u003Cp\u003EAnd if you\u0027re going to be a long term parasite of your host (much like mycoplasma today), if your host does better, so do you.\u003C/p\u003E\u003Cp\u003EWhat we\u0027ve got, is a parasite that evolved to be more and more benign, to the point it became beneficial.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-04-11T17:30:58Z\u0022 title=\u002204/11/2015 05:30  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 11, 2015\u003C/time\u003E by KerikBalm\u003C/strong\u003E\n\u003C/span\u003E\n"}]}