{"TopicId":103875,"ForumId":32,"TopicTitle":"Squadcast Summary (2015-04-11) - Arrangement Of S.H.I.E.L.Ds Edition!","CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2015-04-11T00:48:13Z","PageNum":3,"Articles":[{"CreatedByName":"Eric S","CreatedById":57117,"CreatedDateTime":"2015-04-11T10:40:00Z","Content":"\u003E \n\u003E No heatshields?\n\nThey said no dedicated heatshield parts. It\u0027s not the first time they said that either. First time I remember it was over two years ago, so this wasn\u0027t a matter of not making the deadline. It looks like they have a vision for reentry that doesn\u0027t quite line up with your vision. Or maybe they plan on using something that\u0027s already in the (v1.0) game, like fairings. There\u0027s quite a lot of wiggle room in what has actually been said, and we don\u0027t have enough info to really evaluate this.\n\nAs for complete, they said that the game would have everything that they originally envisioned would be in the game. They also said that development of the game would continue. Yeah, I expect some fan reviews to be upset by a non-final 1.0, but to be honest, anyone looking at the game from the outside probably wouldn\u0027t realize that there\u0027s some minor stuff missing.\n\nI\u0027m I saying that 1.0 is going to be close to perfect? Nope, too soon to tell. I\u0027ve always been sceptical of devs that say they\u0027re going to fix everything in a single patch, but at least it sounds like the game will be less buggy (especially memory leaks, which are a major issue with 0.90). The major functionality is going to be there. We won\u0027t know how well it hits the target until we get our hands on it.\n\n**Edited \u003Ctime datetime=\u00222015-04-11T10:42:32Z\u0022 title=\u002204/11/2015 10:42  AM\u0022 data-short=\u00229 yr\u0022\u003EApril 11, 2015\u003C/time\u003E by Eric S**"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-04-11T11:07:42Z","Content":"\u003E \n\u003E One thing I forgot to point out before: There\u0027s no such thing as rounded fairings in KSP at all. They\u0027re all using triangle-based meshes, as that\u0027s what your video card renders~\n\nTrue...but pedantic and irrelevant IMHO. It\u0027s perfectly straightforward to make things that look quite round enough. Ie 90% of parts in the game."},{"CreatedByName":"Majorjim!","CreatedById":61954,"CreatedDateTime":"2015-04-11T11:13:32Z","Content":"\u003E \n\u003E True...but pedantic and irrelevant IMHO. It\u0027s perfectly straightforward to make things that look quite round enough. Ie 90% of parts in the game.\n\n100% agreed! Limiting the fairings to pointy ones is not good at all. It is perfectly possible to impliment rounder cones. \n\nCome on Squad!! What are you doing??"},{"CreatedByName":"GusTurbo","CreatedById":57552,"CreatedDateTime":"2015-04-11T11:15:44Z","Content":"\u003E \n\u003E 100% agreed! Limiting the fairings to pointy ones is not good at all. It is perfectly possible to impliment rounder cones. \n\u003E Come on Squad!! What are you doing??\n\nI watched the \u0027cast, and I believe Max said you could also make round ones."},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2015-04-11T11:24:50Z","Content":"\u003E \n\u003E That sounds to me like squad doesn\u0027t understand that a released game is meant to be feature complete. If they\u0027re skipping this to try and push 1.0 out then that suggests that there needs to be a 0.95 before it.\n\nI take offense to that statement. 0.91. *At best*."},{"CreatedByName":"Yukon0009","CreatedById":109376,"CreatedDateTime":"2015-04-11T11:30:35Z","Content":"Or hopefully, they choose to give wings and structural panels heat shielding."},{"CreatedByName":"Karriz","CreatedById":58036,"CreatedDateTime":"2015-04-11T11:39:37Z","Content":"I think every part will have a set amount of heat tolerance. Wings and structure parts would be more resistant than solar panels, for example.\n\nLogically, they\u0027d be resistant enough to withstand a re-entry, because otherwise the game would be broken."},{"CreatedByName":"Renegrade","CreatedById":96629,"CreatedDateTime":"2015-04-11T11:44:00Z","Content":"\u003E \n\u003E True...but pedantic and irrelevant IMHO. It\u0027s perfectly straightforward to make things that look quite round enough. Ie 90% of parts in the game.\n\nYeah, but using the point-by-point drawing system, you can ALSO draw round-LOOKING fairings. They won\u0027t be actually round, but then again, the other, third party fairings, aren\u0027t actually round either.\n\nIt will just be click-ier, that\u0027s all.\n\nThe no-round-fairings bit is the pedantic and irrelevant thing (actually more like wrong and irrelevant), as you can draw them as close to round as you like~ I seem to recall reading somewhere that the fuel tanks have a very small number of sides (relatively speaking) of something like... [24](http://wiki.kerbalspaceprogram.com/wiki/Part_Modelling_Guidelines#Standards) or 32 or such. Making a payload fairing by hand that\u0027s rounded would be about half that in terms of clicks, and that\u0027s probably overkill unless you routinely zoom *all the way in* during launches.\n\nHere\u0027s an example of a 5-click profile, with the clicks highlighted:\n\n![Stock-FairingProfile.png](http://alpha.renegrade.net/images/Stock-FairingProfile.png)\n\nWould take like nine clicks total to make it like that at both ends.\n\nThe discussions of aero from Squad before implied fairly heavily that the shielding effects will be available to modders and parts and such, so it should be easy to adapt fixed and procedural fairings to the system.\n\nThe only real problem with them (barring bugs and shortcomings in the actual implementation, and the bit where Maxmaps said that the fairing \u0022forgot\u0022 the definition when removed, which could suck if he didn\u0027t actually delete the part) is that they are the same profile all around - ie. you couldn\u0027t fairing a flat shape without wasting a lot of space (and thereby cross-sectional area and thereby drag). However, ALL of the fairings I\u0027ve seen from mods have this same problem too."},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-04-11T11:44:04Z","Content":"As cool as having fairings is, I will be super honest when I say that the moment I saw the model for the fairing I was disappointed. They look too bare and boring. A little ridge on a edge of a fairing piece or maybe construction out of corrugated metal would look so much better!"},{"CreatedByName":"Hcube","CreatedById":137241,"CreatedDateTime":"2015-04-11T12:10:49Z","Content":"\u003E \n\u003E As cool as having fairings is, I will be super honest when I say that the moment I saw the model for the fairing I was disappointed. They look too bare and boring. A little ridge on a edge of a fairing piece or maybe construction out of corrugated metal would look so much better!\n\nI agree that the yellow line thing makes them look weird, but then a corrugated metal look would\u0027nt be good either i think... What i REALLY whish for is having a BIG mission flag painted on the fairing, and maybe give it the \u0022style\u0022 of the flag : if you choose a gray-blue one, it would appear on the fairing and the rest of the fairing would also be mostly gray-blue. See what i mean ?\n\nCause the mission flags are never painted on the launchers, and that\u0027s too bad. IRL, most rockets are covered up with small \u0022sticker-like\u0022 flags."},{"CreatedByName":"Gkirmathal","CreatedById":135480,"CreatedDateTime":"2015-04-11T12:23:26Z","Content":"\u003E \n\u003E Squad has patched a whole ton of bugs and RAM leaks - \u0022KSP is behaving waaahaahaaay better now\u0022. No 64bit yet though, not yet.\n\nThis makes me feel more warm and fuzzy on the inside about 1.0 ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif) Especially if that mean \u0027better stability\u0027 when modding.\n\nThe fairings look good but in my opinion they seem rather segmented, as in several separate parts. Which is something I personally tried to avoid when looking for my current fairings mod PF."},{"CreatedByName":"Daze","CreatedById":57997,"CreatedDateTime":"2015-04-11T12:29:05Z","Content":"The fairings construction should be very good if it would be possible to have \u0022snap\u0022 after maybe 50cm and locked inclination. Also i would like to see a discret quantity of option for them, like \u0022number\u0022 of fairings, the possibility to export them in subassemblies so it is possible to have \u0022standard\u0022 fairings and \\*notveryimportant\\* to have the possibility to change decal or color"},{"CreatedByName":"smjjames","CreatedById":134004,"CreatedDateTime":"2015-04-11T12:32:53Z","Content":"As far as the fairing textures, maybe they\u0027re intentionally leaving it that way so that modders could fill in with their own textures?"},{"CreatedByName":"klgraham1013","CreatedById":105132,"CreatedDateTime":"2015-04-11T12:40:27Z","Content":"\u003E \n\u003E Precisely. You don\u0027t need blunt-shaped ablative heat shield for Mach 6-7, you just have to use something that\u0027s a bit more heat resistant than plywood.\n\u003E Normally that shouldn\u0027t be a problem, but I suspect Jeb\u0027s Junkyard builds primarily out of plywood and duct tape..\n\nYes, but I\u0027d much rather have a nice looking heat shield than structural plates beneath my rover. It\u0027s also why I would use nice looking fairings as opposed to wing parts."},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2015-04-11T12:42:16Z","Content":"\u003E \n\u003E Come on Squad!! What are you doing??\n\nWell, they\u0027re trying to implement a boatload of new features, that should have gone into versions .91, .92, .93, .94, .95 and .96 in a gold release version that really should just be focusing on removing that last few bugs (the ones that weren\u0027t squashed in said versions .91, .92, .93, .94 ,.95 and .96)"},{"CreatedByName":"klgraham1013","CreatedById":105132,"CreatedDateTime":"2015-04-11T12:44:46Z","Content":"\u003E \n\u003E Really? \n\u003E No heatshields? \n\u003E \n\u003E Building tiers left out? \n\u003E \n\u003E I know that squad does not care that much about details but - this time didn\u0027t they said the game will be complete?\n\u003E \n\u003E I don\u0027t know but either they are very brave or they don\u0027t care about ratings from gaming sites. I don\u0027t think they will achieve this rating [4Players Link](https://tinyurl.com/mwc3w45) When they publish in an incomplete state on the other hand why really care? They sold many copies and should have made their profit.\n\u003E \n\u003E And not to forget there is a mod ![:mad:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_angry.gif)\n\nThey probably figure that since they\u0027ve sold so many copies of an incomplete game already, that selling an incomplete finished game won\u0027t affect sells much."},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2015-04-11T13:03:54Z","Content":"\u003E \n\u003E As far as the fairing textures, maybe they\u0027re intentionally leaving it that way so that modders could fill in with their own textures?\n\nWhen you\u0027re working yourself to the bone to get the \u0022gold 1.0\u0022 release out you\u0027re going to focus on what is essential, everything else will be left out. The real problem here is rushing the 1.0 version. Fairings should have been a .91 release. Fixing the bugs we\u0027re going to find with the fairings a .92 release. Adding features that we, the community, consider \u0022lacking\u0022 a .93 release. And THEN and ONLY THEN when fairings are solidly in play, the .95 release would be having the long awaited atmospheric model, and you\u0027d need another two or three releases to tweak it and to have the fairings interact with it nicely.\n\nIn parallel, and along the same path, you\u0027d be introducing heat shields. First cosmetic, but get the \u0027procedural heat shields\u0027 right and once that\u0027s in play introduce re-entry heat (and consequences) in .95\n\nSame for the buildings, deep space fueling, career overhaul, etc. You would want to have a handful of version so by the time 1.0 comes out the game is \u0022perfect\u0022\n\nI really, really think that 99% of the people on this forum would have no problems at all with a 1.0 version whose \u0022modest\u0022 features are that all the bugs have been squashed, as that would have been an epic achievement. And THEN Squad can focus on adding features like Infernal Robotics, KAS, Life Support and other cool stuff to new releases updates. Where I now think we\u0027re going to see a pretty long procession from 1.0 to 1.13 of bug fixes."},{"CreatedByName":"klgraham1013","CreatedById":105132,"CreatedDateTime":"2015-04-11T13:20:14Z","Content":"\u003E \n\u003E Come on Squad!! What are you doing??\n\nI, currently, default to this statement most of the time.\n\nedit: Yeah, there\u0027s snark there, but no heat shields, flaps, other required aero parts, delaying features to push out 1.0. I take this way to seriously.\n\n**Edited \u003Ctime datetime=\u00222015-04-11T13:24:08Z\u0022 title=\u002204/11/2015 01:24  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 11, 2015\u003C/time\u003E by klgraham1013**"},{"CreatedByName":"r4pt0r","CreatedById":90471,"CreatedDateTime":"2015-04-11T13:34:19Z","Content":"\u0022They make a desert and call it peace.\u0022\n\nhidden text to make the spacing look nice-Tacitus\n\n\u0022They make a second Beta and call it 1.0.\u0022\n\nmore hidden text for spacing-Me\n\nTheres no point in it klgrahm1013. In my head I will just call 1.0 .95 instead. There is a huge thread where ~75% of people think its too early still for 1.0. Squad is still doing it anyway, so just enjoy .95 when it comes out."},{"CreatedByName":"r_rolo1","CreatedById":26192,"CreatedDateTime":"2015-04-11T13:37:15Z","Content":"Ok, I\u0027ve been in the Squadcast yesterday and TBH I don\u0027t see where people here got the idea that all the fairings would be pointy. Maxmaps said specifically than that would not be the case and that the pics he had with pointy fairings were just because he had designed them that way for aesthetic reasons.\n\nThat said, I\u0027m not so hot ( pun intended ) on the fairings departement , or better said , on the lack of mention of ablative shields, especially with Maxmaps saying somewhere in the yesterday Squadcast that up to this point he wasn\u0027t able so far to do a sucessful reentry with a plane on the new atmo model on default settings. Not that max is the best pilot in KSP history ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif) , but i find that kind of statement worrying ..."},{"CreatedByName":"TMS","CreatedById":57134,"CreatedDateTime":"2015-04-11T13:49:37Z","Content":"\u003E \n\u003E \u0022They make a desert and call it peace.\u0022\n\u003E hidden text to make the spacing look nice-Tacitus\n\u003E \n\u003E \u0022They make a second Beta and call it 1.0.\u0022\n\u003E \n\u003E more hidden text for spacing-Me\n\u003E \n\u003E Theres no point in it klgrahm1013. In my head I will just call 1.0 .95 instead. There is a huge thread where ~75% of people think its too early still for 1.0. Squad is still doing it anyway, so just enjoy .95 when it comes out.\n\nI still refer to it as 0.27."},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2015-04-11T13:51:21Z","Content":"Hmmm yeah,.. I do hope curved nose cones are implemented. I mean I\u0027ll deal if I have to make them from segments but it would be nice. Could be an easy tweakable option. I\u0027ll also sign on to say I\u0027m a little bummed that we\u0027re skipping heat shields, but so long as it\u0027s physically possible to do an interplanetary aerocapture with stock parts I\u0027m cool waiting for 1.1."},{"CreatedByName":"Merinsan","CreatedById":57629,"CreatedDateTime":"2015-04-11T14:02:55Z","Content":"\u003E \n\u003E Ok, I\u0027ve been in the Squadcast yesterday and TBH I don\u0027t see where people here got the idea that all the fairings would be pointy. Maxmaps said specifically than that would not be the case and that the pics he had with pointy fairings were just because he had designed them that way for aesthetic reasons.\n\u003E That said, I\u0027m not so hot ( pun intended ) on the fairings departement , or better said , on the lack of mention of ablative shields, especially with Maxmaps saying somewhere in the yesterday Squadcast that up to this point he wasn\u0027t able so far to do a sucessful reentry with a plane on the new atmo model on default settings. Not that max is the best pilot in KSP history ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif) , but i find that kind of statement worrying ...\n\n\u0022I find that quite worrying too. But I find this a little more worrying:\n\nFun fact: Squad sometimes actually uses Danny2462\u0027s videos for bugfixing. If they can replicate the steps and consider it severe enough, they will patch it. But sometimes, they just think **\u0027oh, attaching 2 claws to a kerbal breaks the universe? How about you just don\u0027t do that..\u0027**\u0022\n\nNot fixing a bug because it\u0027s not something a \u0022normal\u0022 user shouldn\u0027t do is foolish IMO. Bugs like this often have a root cause that can create other issues. Sure, if you can\u0027t reproduce the problem, ignore it, but ignoring it up front is just lazy."},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2015-04-11T14:03:59Z","Content":"I hope that cursor is optional. Call me strange but I prefer the system default cursor, especially after I went to all the trouble of making myself a custom one. Plus it\u0027s too tilty.\n\nAnd can I mention yet again that \u0022Danny\u0027s 2 Klaws on a Kerbal Glitch\u0022 wasn\u0027t discovered by Danny and doesn\u0027t require a Kerbal? Or even 2 Klaws actually? Just drive any old thing into a Klaw on another ship. I posted a bug report about it way back when the Klaw first came out. I guess I should start making videos so people notice..."},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-04-11T14:13:11Z","Content":"\u003E \n\u003E \u0022I find that quite worrying too. But I find this a little more worrying:\n\u003E Fun fact: Squad sometimes actually uses Danny2462\u0027s videos for bugfixing. If they can replicate the steps and consider it severe enough, they will patch it. But sometimes, they just think **\u0027oh, attaching 2 claws to a kerbal breaks the universe? How about you just don\u0027t do that..\u0027**\u0022\n\u003E \n\u003E Not fixing a bug because it\u0027s not something a \u0022normal\u0022 user shouldn\u0027t do is foolish IMO. Bugs like this often have a root cause that can create other issues. Sure, if you can\u0027t reproduce the problem, ignore it, but ignoring it up front is just lazy.\n\nYou\u0027re taking the wrong message from that. No bug gets ignored, but they do get triaged and prioritized as developer/tester time is finite and they need to spend that time wisely, i.e. on the most critical bugs that affect the most people. If the only way to reproduce a bug is through an unlikely scenario then it is less of a priority to fix than bugs that are more easily and commonly tripped."}]}