{"TopicId":103813,"ForumId":44,"TopicTitle":"High density high capacity coolants for open cycle nuclear reactor cooling","CreatedByName":"MatterBeam","CreatedById":133334,"CreatedDateTime":"2015-04-10T02:30:40Z","PageNum":1,"Articles":[{"CreatedByName":"MatterBeam","CreatedById":133334,"CreatedDateTime":"2015-04-10T02:30:40Z","Content":"\n\u003Cp\u003EHi.\u003C/p\u003E\u003Cp\u003EI was wondering if there was a coolant that is both high density and high thermal capacity for use in nuclear reactors. This coolant is dumped overboard at the end of the cooling cycle. \u003C/p\u003E\u003Cp\u003ESodium is the obvious candidate, but are there any others? I read mentions of tin being used (boiling point 2602C). If the liquid is well handled to just under boiling temperature through pressurization, we could easily have a huge amount of waste heat dissipated for very little volume of coolant.\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2015-04-10T06:58:49Z","Content":"\n\u003Cp\u003EAnd why would we want an open cycle nuclear reactor cooling system in the first place?\u003C/p\u003E\u003Cp\u003EThe thing about fission reactors is, they can run for years at high output settings. No matter how dense and high capacity your coolant is, if you have an open cycle cooling system, you\u0027re going through coolant many orders of magnitude faster than you\u0027re going through nuclear fuel.\u003C/p\u003E\u003Cp\u003EBesides, reactor coolant isn\u0027t just there to keep the reactor from melting itself. It\u0027s an energy transfer medium. Fission reactors don\u0027t generate any power, they just generate heat. Nothing but heat (and radiation). The coolant is the stuff that takes up the heat and delivers it to a heat engine, which then converts the heat into a different from of energy (usually kinetic). In doing so, the coolant itself is cooled down again and can be reused. Therefore, the whole idea of having a coolant that gets dumped overboard once it is heated up all the way is a little bit weird. It\u0027s like, you want to build a nuclear reactor for the express purpose of generating absolutely no power at all! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EThere\u0027s only one single realworld application for an open cycle reactor cooling system, and that is a nuclear thermal rocket (NTR). In such an engine, a monopropellant is pumped through the hot reactor core and takes up all the heat, thereby increasing its own energy. It is then ejected through a nozzle out the back, providing a very fuel efficient propulsion method thanks to all the extra heat energy it got from the reactor. However, in an NTR, the choice of coolant is not governed by its density or heat storage capacity. Those are all entirely secondary concerns. The primary concern is its usefulness as a propellant. And research has shown that the usefulness as a propellant increases as the atomic (or molecular) mass decreases. The best-performing propellant is therefore hydrogen. All others are worse, with heavier elements/molecules being increasingly worse.\u003C/p\u003E\n"},{"CreatedByName":"Iskierka","CreatedById":2116,"CreatedDateTime":"2015-04-10T10:25:25Z","Content":"\n\u003Cp\u003EOpen-cycle does not mean the coolant is dumped without generation, and your presumptions about the desires for nuclear reactors are a bit strange. Are you assuming that this would have to be a space-based reactor? Earth-based reactors would very much prefer to be open-cycle, as it would mean a lower incoming coolant temperature (you can\u0027t cool a closed loop back to ambient). The reason they are not fully open-cycle is because of the corrosion they would face from water impurities and radiological concerns - so instead they have a closed-loop primary coolant which is re-cooled by a secondary open-loop coolant, which avoids radiation and keeps corrosives away from the reactor core. This is done \u003Cem\u003Eafter\u003C/em\u003E as much energy as possible is extracted from the primary coolant, and if the primary coolant was open-cycle, it would do the same thing, and then be ejected back into the sea/river that was supplying the reactor.\u003C/p\u003E\u003Cp\u003ENow, asking about high-density and high-capacity coolants for Earth reactors is a bit redundant, as water performs well and is abundant, whereas anything else is in limited supply. In space however, everything is in limited supply, so you wouldn\u0027t want open-cycle cooling due to limited coolant - but the same coolants may be very good for closed-cycle, also. In vacuum all your cooling has to be done by radiating heat, and the primary affecting factor for how fast heat is lost by a radiator is its emissive temperature - which increases power emitted to the fourth power. Doubling temperature means 16x (2^4) more cooling, so suddenly it looks quite desirable to find something other than water, which is limited to a few hundred degrees with reasonable pressures. Say that water is operating at 900 K (very high for steam), while tin could be run at 2700K. The tin coolant can therefore emit 81x (3^4) more power per radiator area, assuming the radiator reaches the same % of coolant temperature.\u003C/p\u003E\u003Cp\u003ENow, there\u0027s some other concerns, such as that you could only throttle the reactor back so far - the tin can\u0027t be allowed to re-solidify. But, if you know there\u0027s going to be enough minimum load on the reactor - or you have tricks such as partially folding the radiator, so it heats itself and keeps the tin hot - then the same question of what materials would get a high density and capacity are quite suitable for a closed-loop reactor.\u003C/p\u003E\n"},{"CreatedByName":"MatterBeam","CreatedById":133334,"CreatedDateTime":"2015-04-10T13:19:33Z","Content":"\n\u003Cp\u003EI was thinking of an \u0027afterburner\u0027 mode for a space-based nuclear reactor. The interest in high density open cycle cooling systems is for me to create a nuclear reactor that does not require modelling of animated radiators.\u003C/p\u003E\u003Cp\u003EThe actual reactor is a gaseous core \u0027lightbulb\u0027 design.\u003C/p\u003E\u003Cp\u003EIn the low-temp mode, it consumes little fuel and produces only enough heat to keep the tin coolant liquid. The coolant works in closed cycle in this mode, providing a 4000K to 500K temperature difference for electrical power generation. The tin circulates into solid graphite radiator.\u003C/p\u003E\u003Cp\u003EIn high temp mode, the core temperature rises to 10k. Tin boils off at 2500k. It can be ejected either into space or a cooling tower. This creates a huge temperature difference for a massive power output increase.\u003C/p\u003E\u003Cp\u003EIf it is ejected into space, it is lost. If it goes into a cooling tower, it first has to be ionized so that it can be moved away from the walls electrostatically. Internal circulation can be established to keep the gaseous tin circulating for longer. When the tin liquefies, it is ejected from the loop and hits the walls. These are centrifuged and slated to direct the fluid into an equatorial collection channel.\u003C/p\u003E\u003Cp\u003EIn modding terms, I\u0027d only have to create 3 symmetrical parts and 2 resources. The first is a 2.5x2.5m cylindrical reactor with integrated black radiators surrounding it. The second is a coolant fuel tank, again, a simple cylinder. The third part is a 2.5x10m cooling tower... again, a simple transparent cylinder with a ring in the middle.\u003C/p\u003E\u003Cp\u003EIn game, the reactor would be dual-mode. The first mode is tailored for electricity generation during long interplanetary coasting. The second mode is for the short, high-power burns at either end of the interplanetary coast. Due to losses, this consumes coolant at a high rate without the tower, or a low rate with the tower.\u003C/p\u003E\n"},{"CreatedByName":"EzinX","CreatedById":118288,"CreatedDateTime":"2015-04-10T19:47:10Z","Content":"\n\u003Cp\u003EUse a droplet radiator. Instead of losing coolant permanently, recollect it. \u003Ca href=\u0022http://www.5596.org/cgi-bin/dropletradiator.php\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.5596.org/cgi-bin/dropletradiator.php\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EVFX wise, a droplet radiator is a foggy mist in a 2d plane. It\u0027s perfectly 2d - the electrostatic guidance of the droplets at either end would force it into such a plane. The droplets are too small to be seen, so too small for a particle effect.\u003C/p\u003E\u003Cp\u003EThere\u0027s absolutely no reason to vent coolant permanently because the droplet radiator can have vast surface area basically for free - the systems would be about the same mass whether the droplet area were 100 meters long or multiple kilometers long. (A really long droplet system would probably need intermediate electrostatic booms that stick out and smooth the path of the droplets as they travel, but to first approximations it\u0027s the same)\u003C/p\u003E\u003Cp\u003EAt 1000 kelvin, Tin coolant does have a vapor pressure, so you are losing coolant over time. For an interstellar spacecraft, you would probably need some kind of exotic system that perhaps uses solid ceramic nanoscale spheres or something instead of droplets so that no vapor is lost. \u003C/p\u003E\u003Cp\u003EAlso, at high temperatures, you get enormously more performance - black body radiation is proportional to T^4. Once you are talking 1000 kelvin or more, raising the temperature to the fourth power gets you crazy high heat rejection rates.\u003C/p\u003E\u003Cp\u003EFor instance, using that calculator, and 1000 Kelvin for the coolant temperature, a 100 x 1 kilometer droplet radiator radiates 155 gigawatts. You\u0027d have a pair of them, for about 310 gigawatts of capacity. Even with crazy high performance gas core reactors...how much power did you have in mind? The thing is, your problem is that if you are doing nuclear thermal, the velocity of the exiting particles is determined by the temperature that the physical materials your rocket motor nozzle can tolerate. \u003C/p\u003E\u003Cp\u003EIf you are doing nuclear electric, the mass of your radiator is only one component. You also have the mass of the generators, the mass of the heat engine, the mass of the core, the control systems, and the mass for the electric engine. This is why when you sum it all up, you get disappointing levels of thrust and you have to run the engine for the entire journey and still take years.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-04-10T20:09:15Z\u0022 title=\u002204/10/2015 08:09  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 10, 2015\u003C/time\u003E by EzinX\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MatterBeam","CreatedById":133334,"CreatedDateTime":"2015-04-10T22:10:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022EzinX\u0022 data-cite=\u0022EzinX\u0022\u003E\u003Cdiv\u003EUse a droplet radiator. Instead of losing coolant permanently, recollect it. \u003Ca href=\u0022http://www.5596.org/cgi-bin/dropletradiator.php\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.5596.org/cgi-bin/dropletradiator.php\u003C/a\u003E\u003Cp\u003EVFX wise, a droplet radiator is a foggy mist in a 2d plane. It\u0027s perfectly 2d - the electrostatic guidance of the droplets at either end would force it into such a plane. The droplets are too small to be seen, so too small for a particle effect.\u003C/p\u003E\u003Cp\u003EThere\u0027s absolutely no reason to vent coolant permanently because the droplet radiator can have vast surface area basically for free - the systems would be about the same mass whether the droplet area were 100 meters long or multiple kilometers long. (A really long droplet system would probably need intermediate electrostatic booms that stick out and smooth the path of the droplets as they travel, but to first approximations it\u0027s the same)\u003C/p\u003E\u003Cp\u003EAt 1000 kelvin, Tin coolant does have a vapor pressure, so you are losing coolant over time. For an interstellar spacecraft, you would probably need some kind of exotic system that perhaps uses solid ceramic nanoscale spheres or something instead of droplets so that no vapor is lost. \u003C/p\u003E\u003Cp\u003EAlso, at high temperatures, you get enormously more performance - black body radiation is proportional to T^4. Once you are talking 1000 kelvin or more, raising the temperature to the fourth power gets you crazy high heat rejection rates.\u003C/p\u003E\u003Cp\u003EFor instance, using that calculator, and 1000 Kelvin for the coolant temperature, a 100 x 1 kilometer droplet radiator radiates 155 gigawatts. You\u0027d have a pair of them, for about 310 gigawatts of capacity. Even with crazy high performance gas core reactors...how much power did you have in mind? The thing is, your problem is that if you are doing nuclear thermal, the velocity of the exiting particles is determined by the temperature that the physical materials your rocket motor nozzle can tolerate. \u003C/p\u003E\u003Cp\u003EIf you are doing nuclear electric, the mass of your radiator is only one component. You also have the mass of the generators, the mass of the heat engine, the mass of the core, the control systems, and the mass for the electric engine. This is why when you sum it all up, you get disappointing levels of thrust and you have to run the engine for the entire journey and still take years.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI guess you\u0027re right.\u003C/p\u003E\u003Cp\u003EA droplet radiator inline module of 3.75x5m can radiate (using tin @ 2800K, emissivity 0.04) about 1.5GW, which enough waste heat capacity to cover a 60% efficient reactor of 2.5GWt/1GWe.\u003C/p\u003E\u003Cp\u003EBeing inline also does away with acceleration problems that would fling your droplets all over the place.\u003C/p\u003E\n"}]}