{"TopicId":103892,"ForumId":70,"TopicTitle":"Glitch Device effect when docking base parts","CreatedByName":"yorshee","CreatedById":135011,"CreatedDateTime":"2015-04-11T05:32:53Z","PageNum":1,"Articles":[{"CreatedByName":"yorshee","CreatedById":135011,"CreatedDateTime":"2015-04-11T05:32:53Z","Content":"\n\u003Cp\u003E(I have a modded game but I don\u0027t think it matters since this also happens in the stock game)\u003C/p\u003E\u003Cp\u003EI\u0027ve been working on an extravagant Minmus base for a few days now, shipping new pieces from Kerbin and attaching them to the main part of the base by scooting them along Minmus\u0027s surface using RCS and into the docking ports, but sometimes I keep getting that Glitch Device effect. You know the one, right? Danny did a video on it, the one where you attach a Kerbal to two claws and then the surface disappears from underneath you and anything in the planetoid\u0027s SOI falls to its invisible core and explodes. That keeps happening, but it happens when I\u0027m sticking my base together for some reason.\u003C/p\u003E\u003Cp\u003EWhat exactly triggers this bug? I\u0027d like to know so I can think of some workaround way of building my base so I can avoid that bug. I hope it gets fixed in 1.0!\u003C/p\u003E\n"},{"CreatedByName":"Kystery","CreatedById":135332,"CreatedDateTime":"2015-04-11T05:46:55Z","Content":"\n\u003Cp\u003EIf you\u0027re sticking two Claws together, that could be the issue... but if you\u0027re really just docking two ships, that shouldn\u0027t happen. The fact that your game is modded may very well be an issue.\u003C/p\u003E\n"},{"CreatedByName":"yorshee","CreatedById":135011,"CreatedDateTime":"2015-04-11T06:01:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kystery\u0022 data-cite=\u0022Kystery\u0022\u003E\u003Cdiv\u003EIf you\u0027re sticking two Claws together, that could be the issue... but if you\u0027re really just docking two ships, that shouldn\u0027t happen. The fact that your game is modded may very well be an issue.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s true. It also happened once when I was using KAS pipes to load one of my resource-transferring rovers with Karbonite, though when I reloaded the save and tried it again, it worked.\u003C/p\u003E\u003Cp\u003EI guess the relevant mods I have installed are Kerbal Attachment System and Karbonite for that one-off bug I just mentioned, and for the more persistent bug that I explained in the OP, would be the USI Kolonization mod since I was using their docking ports and tube things.\u003C/p\u003E\u003Cp\u003E...I still have this funny feeling it isn\u0027t because of my mods though, since both of my bugs as well as Danny\u0027s example all have one thing in common, and it has to do with attaching things together. I\u0027ll try to replicate the effect with a vanilla install later.\u003C/p\u003E\n"}]}