{"TopicId":103805,"ForumId":70,"TopicTitle":"KSP Crashes to desktop before loading title screen","CreatedByName":"braedan51","CreatedById":100988,"CreatedDateTime":"2015-04-10T01:00:40Z","PageNum":1,"Articles":[{"CreatedByName":"braedan51","CreatedById":100988,"CreatedDateTime":"2015-04-10T01:00:40Z","Content":"\n\u003Cp\u003EMy game was working fine but now it crashes every time before loading.\u003C/p\u003E\u003Cp\u003EMy install is heavily modded, but I\u0027ve been playing for several days with no problems.\u003C/p\u003E\u003Cp\u003EIf someone could take a look at this error.log \u0026amp; let me know if they see anything wonky I\u0027d really appreciate it.\u003C/p\u003E\u003Cp\u003EThanks in advance.\u003C/p\u003E\u003Cp\u003E~Eric\u003C/p\u003E\u003Cp\u003E[Error.log] removed to preserve the sanity of my mobile friends.\u003C/p\u003E\u003Cp\u003EProblem SOLVED. Along w/ corrupted display settings, the small stock one man lander can \u0022model.mu\u0022 file seems to have been damaged.\u003C/p\u003E\u003Cp\u003EI reinstalled KSP to an new directory, copied the \u0022model.mu\u0022 from thew new directly to the old directory \u0026amp; restarted my computer, all issues went away \u0026amp; the game worked normally.\u003C/p\u003E\u003Cp\u003EThanks to ExplorerKlatt for your response \u0026amp; etiquette tips.\u003C/p\u003E\u003Cp\u003E~Eric\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EI was able to get KSP to load by tweaking the the graphics settings via the launcher (lowering terrain detail, turning off anti-aliasing, etc).\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EI tried editing the graphics settings via the launcher, which got the game to load. However, I\u0027m getting all kinds of weird random crashes.\u003C/p\u003E\u003Cp\u003EShips that I\u0027ve flown several missions with won\u0027t load.\u003C/p\u003E\u003Cp\u003EThe stage stack disappears occasionally, so I reverted launch, spacebar wouldn\u0027t launch.\u003C/p\u003E\u003Cp\u003EWhen I went EVA on the launchpad the screen went black (but mechjeb, the stock altimeter \u0026amp; the staging stack were still visible).\u003C/p\u003E\u003Cp\u003EWeird....\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EUpdate: the revert button is grayed out now \u0026amp; is totally unusable.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-04-10T02:36:38Z\u0022 title=\u002204/10/2015 02:36  AM\u0022 data-short=\u00229 yr\u0022\u003EApril 10, 2015\u003C/time\u003E by braedan51\u003C/strong\u003E\n\u003Cbr\u003EProblem Solved\n\u003C/span\u003E\n"},{"CreatedByName":"ExplorerKlatt","CreatedById":107424,"CreatedDateTime":"2015-04-10T01:47:41Z","Content":"\n\u003Cp\u003EFirst, the error.log doesn\u0027t help much. Get the output_log.txt. \u003C/p\u003E\u003Cp\u003ESecond, use a site like Dropbox or Pastebin to upload the logs the post a link here. The wall of text from posting a log directly into the forums is gonna deter a lot of people. It is especially harsh for those using mobile devices to view the forums.\u003C/p\u003E\n"}]}