{"TopicId":103971,"ForumId":32,"TopicTitle":"Any landing you can walk away from...","CreatedByName":"Wolf Baginski","CreatedById":138549,"CreatedDateTime":"2015-04-12T14:00:59Z","PageNum":1,"Articles":[{"CreatedByName":"Wolf Baginski","CreatedById":138549,"CreatedDateTime":"2015-04-12T14:00:59Z","Content":"\n\u003Cp\u003EJust don\u0027t try it with a flying boat.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://pbs.twimg.com/media/CCZV1yAWIAEKgfv.png\u0022 alt=\u0022CCZV1yAWIAEKgfv.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis can be done with stock parts. The idea is that by making the base wide, it can land on slopes without falling over. But I had set MechJeb to show the TWR on Mun, and then I tried to land on Kerbin. and there wasn\u0027t quite enough thrust.\u003C/p\u003E\u003Cp\u003EOne thing I had done was use one of the multiple-engine adaptors in the Space-Y set. which gave me space to carry extra fuel and stuff. The sky over the Space Center experienced a rain of decouplers and part-filled fuel tanks. but I couldn\u0027t quite get rid of enough weight.\u003C/p\u003E\n"},{"CreatedByName":"Sorcie","CreatedById":61164,"CreatedDateTime":"2015-04-12T17:40:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Wolf Baginski\u0022 data-cite=\u0022Wolf Baginski\u0022\u003E\u003Cdiv\u003EBut I had set MechJeb to show the TWR on Mun, and then I tried to land on Kerbin. and there wasn\u0027t quite enough thrust.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve done this! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Wolf Baginski","CreatedById":138549,"CreatedDateTime":"2015-04-13T15:03:38Z","Content":"\n\u003Cp\u003EI rather like the cockpit. It\u0027s the M27 from the B9 Aerospace Parts mod, but it took me a while to find it. You can put a tube under the cockpit to mount a docking port, but I recommend adding a few struts if you want the connection to the cockpit to hold up to parachutes. The Fustek set has a docking module which works well, and there\u0027s a couple of alternatives. With two kerbonauts in the cockpit and four in that conical capsule you have something that can be a good start for supporting a space-station.\u003C/p\u003E\u003Cp\u003EThere are other alternatives in stock that can carry the extra kerbonauts. The PDP-10 Hitchhiker container, for instance, has the same diameter as the command capsule. A bit of length, to allow two widespaced rings of RCS thrusters, lets the beast handle some awkward objects.\u003C/p\u003E\u003Cp\u003EI have already mentioned this on Twitter. Searching for the right part can be tricky. I should have done some better planning when I loaded the Mods, there are some thoroughly awkward Mod creators out there, and the default filters (use the Advanced tab in the VAB) could be better. You can filter by the (fictional) manufacturer, you pick by clicking on the corporate flags, but they are tiny grey-scales. Some designs, OK in colour, are just grey blobs. At least there is a text pop-up.\u003C/p\u003E\u003Cp\u003EThis is a bit like discovering that you only have one button on the mouse.\u003C/p\u003E\n"}]}