{"TopicId":103940,"ForumId":39,"TopicTitle":"Share your Headcanons!","CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-04-11T21:46:58Z","PageNum":1,"Articles":[{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-04-11T21:46:58Z","Content":"\n\u003Cp\u003EI hope to start a sort of a small megathread on sharing your headcanons about Kerbal biology, relationships, science, and history!\u003C/p\u003E\u003Cp\u003EFor me, ever since the beginning, I thought of Jebediah, Bill, and Bob Kerman as being brothers. Bill was the oldest and tries to keep his little brothers safe, Jebediah was the middle child, badS, who was always blowing stuff up and playing too dangerously on the playgrounds to Bill\u0027s dismay, and Bob was a little nerd who was obsessed with Space from a much earlier age and assisted Jeb with the chemistry of the blow-stuff-up stuff. At some point Jebediah and Bob founded a junkyard to gather materials for their experiments, eventually culminating in their failed attempts at rocket engines. Bill then joined as the engineer, mostly just to keep his brothers from blowing each other up.\u003C/p\u003E\u003Cp\u003EIn human-age-equivalent terms (that is, not Kerbin-years or even necessarily Earth years), at Y1 of the Space Program, Jeb is 27, Bob is 24, and Bill is 30.\u003C/p\u003E\u003Cp\u003ENow to fit Valentina into all this. Val is Jeb, Bill, and Bob\u0027s little sister. Val was born six years after Bob, so she is 18 at KSC start. Fitting her into my headcanon was easy. She was always fascinated by Jeb and Bob\u0027s stuff so she wanted to do it as well, but she was too young to participate. She was just as crazy as Jeb, probably even more so. She was hired as a test-pilot by C7 Aviation Division when she was 17, and finally she left for the space program.\u003C/p\u003E\u003Cp\u003EWernher von Kerman (Birth name Wernher von GrÃƒÂ¼n) was an engineer and astronomer on the other side of Kerbin about 20 Kerbin Years prior to Space Program start. He knew what rockets were for. They were meant to get Kerbalkind off of Kerbin and into the space environment. During a minor war that his country was fighting, his rocket experiments were funded by the government, but to his dismay they ended up using his rockets as missile-bombs, rather than science packages. As the war came to a close, he defected to the country that would eventually house the space program. His L-V2 Liquid Fueled Rocket Motors were lost, but the concept was used to develop Jebediah and Company\u0027s LV-T series rocket engines. His group of engineers and scientists also came with him, eventually making the bulk of the KSC staff.\u003C/p\u003E\u003Cp\u003EWell that covers the relationships and a little bit of the history part.\u003C/p\u003E\n"},{"CreatedByName":"Yukon0009","CreatedById":109376,"CreatedDateTime":"2015-04-12T08:35:05Z","Content":"\n\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/112566-Human-Space-Program\u0022 rel=\u0022external nofollow\u0022\u003EA popular Kerbal video game.\u003C/a\u003E\n"},{"CreatedByName":"CG_Kerbin","CreatedById":117777,"CreatedDateTime":"2015-04-12T12:35:14Z","Content":"\n\u003Cp\u003EThe only kerbal history I really like is the giant creator on kerbin was caused by a giant Astroid that smashed into kerbin and the debris from it formed the moon! \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://wiki.kerbalspaceprogram.com/w/images/d/d4/KerbinCraterElevation.jpg\u0022 alt=\u0022KerbinCraterElevation.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-04-12T12:38:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CG_Kerbin\u0022 data-cite=\u0022CG_Kerbin\u0022\u003E\u003Cdiv\u003EThe only kerbal history I really like is the giant creator on kerbin was caused by a giant Astroid that smashed into kerbin and the debris from it formed the moon! \u003Cp\u003E\u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/w/images/d/d4/KerbinCraterElevation.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.kerbalspaceprogram.com/w/images/d/d4/KerbinCraterElevation.jpg\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt couldn\u0027t have big enough. A Mun-forming asteroid would be the size of Duna hitting something the size of Laythe, mixing materials to form Kerbin and shooting them out to form Mun.\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2015-04-12T16:57:13Z","Content":"\n\u003Cp\u003EI have quite an extensive headcanon, most of which is explored in my \u003Cem\u003EFirst Flight\u003C/em\u003E fanfic. I could write up a summary for this thread if anyone is interested and GregroxMun doesn\u0027t mind?\u003C/p\u003E\n"},{"CreatedByName":"Rolanvorxariat","CreatedById":117146,"CreatedDateTime":"2015-04-12T18:01:56Z","Content":"\n\u003Cp\u003EMy fanfic world is huge, but here is just a quick sum-up about the life of Jebediah Kerman (And sons). I\u0027ll post the whole history of the Kerbal Universe, If i am allowed to.\u003C/p\u003E\u003Cp\u003EJebediah Kerman is born during the first Mun landings and watches them live when he was 5. He was then determined to become an Kerbonaut for his nation, the Union of City-states of Konastra Kolus, and after joining the military as a test pilot for three years, he is given the role of piloting the first manned mission to Mun Base Omega. He commands it for 1 year, before heading home. After 1 year, he has a 7 month expedition to the International Kerbin Orbital Research Facility (IKORF). He then retires from the Kerbonaut Corps. and becomes the head administrator of the Konastrian Space Agency during the Project Kolonation Manned Duna mission. He has three kids with his wife Klara Kerman, named Bill, Bob, and Jeb Jr. (Sr.\u0027s name is Jebediah, but Jr.\u0027s name is just Jeb). Bill becomes a engineer, Bob becomes a astrobiologist and minors in physics, while Jeb Jr. Continues his pioting heritage and surpasses his dad\u0027s skills. Bill, Bob, and Jeb are all aboard the IKORF, when a malfunction in the docking guidance system couses the \u003Cem\u003EPhoton\u003C/em\u003E Space shuttle to collide with the IKORF, and Bill, Bob, and Aldner Kerman Evacuate on the Kerion while Bob is on the crippled shuttle. The station reenters with the shuttle docked to it, and while Bob finally successfully undocked it, a half-burnt up station module rammed into it, breaking the shuttle. Everyone thinks Bob is dead, and public outrage and lack of funding causes the shutdown of the space program. However, Bob had safetly parachuted to the surface of a island, and is found by a rescue copter salvaging the debris (The public is still unaware). Then, the Ekerla pandemic starts, and the UCKK governent secretly builds a facility on the secret island Bob found. Jeb has a daughter, Astera, around this time. Jeb, Bill, and Bob are called upon to lead the INTEGRITY mission to Jool to find a new home for kerbalkind. The rest is history.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-04-13T04:26:55Z\u0022 title=\u002204/13/2015 04:26  AM\u0022 data-short=\u00229 yr\u0022\u003EApril 13, 2015\u003C/time\u003E by Rolanvorxariat\u003C/strong\u003E\n\u003C/span\u003E\n"}]}