{"TopicId":104040,"ForumId":16,"TopicTitle":"Single Launch Vessels \u0026amp; Docking Ports","CreatedByName":"plotz","CreatedById":140852,"CreatedDateTime":"2015-04-13T13:28:41Z","PageNum":1,"Articles":[{"CreatedByName":"plotz","CreatedById":140852,"CreatedDateTime":"2015-04-13T13:28:41Z","Content":"\n\u003Cp\u003EGreetings, fellow Kerbals!\u003C/p\u003E\u003Cp\u003EAfter quite a few months of reading articles and posts on this forum, I decided to finally register here. I have been playing KSP since a year or so and finally gotten around to learning the \u0022fine arts\u0022 of this game: Efficient SSTO design (w/o R.A.P.I.E.Rs \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E ), station building, docking. \u003C/p\u003E\u003Cp\u003EMy question revolves around the latter two aspects. I\u0027ve got a nice little station in orbit around Kerbin (career mode). Docking and undocking various vessels has not caused any problems yet. However, I am using the Station Science mod. Thus I sent up a vessel consisting of the Mod\u0027s lab and two experiments (plant growth and prograde kuarqs) that are DOCKED with their small return vessels. Now the game will not let me undock these vessels and only offers me the \u0022control from here\u0022 option, when I right-click the docking ports (any side). \u003C/p\u003E\u003Cp\u003EThe ports are aligned OK, all vessels have command modules, power,... .\u003C/p\u003E\u003Cp\u003EHow do I get these to undock now? I\u0027ve attached a screenshot. Any help is greatly appreciated. The KSS is bound to be extended and docking ports are in high demand \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E .\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://abload.de/image.php?img=screenshot3rcsyl.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://abload.de/thumb/screenshot3rcsyl.png\u0022 alt=\u0022screenshot3rcsyl.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThanks!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-04-13T14:57:11Z\u0022 title=\u002204/13/2015 02:57  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 13, 2015\u003C/time\u003E by plotz\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Harry Rhodan","CreatedById":119953,"CreatedDateTime":"2015-04-13T14:20:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022plotz\u0022 data-cite=\u0022plotz\u0022\u003E\u003Cdiv\u003Etwo experiments (plant growth and prograde kuarqs) that are DOCKED with their small return vessels.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThose aren\u0027t docked. You clipped the docking ports into each other. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Octa","CreatedById":140058,"CreatedDateTime":"2015-04-13T14:24:35Z","Content":"\n\u003Cp\u003EThe Experiment Vessels were docked to the lab in the VAB?\u003C/p\u003E\u003Cp\u003EIt looks like the docking port of the experiment vessel is \u0022clipped\u0022 into the lab port. Go back to the VAB, you should be able to move it a bit outwards. The port has a plate on top, you can see it in the back of your screenshot (with purple light). This plate should be visible.\u003C/p\u003E\n"},{"CreatedByName":"plotz","CreatedById":140852,"CreatedDateTime":"2015-04-13T14:56:23Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E - that eluded me. Sadly, the module is in space for some days game time now. Guess I am going to just launch it again then. The other one is at least guaranteed to produce a spectacular fireball across Kerbin\u0027s sky.\u003C/p\u003E\u003Cp\u003EThanks for pointing this out, Harry and Octa!\u003C/p\u003E\n"},{"CreatedByName":"THX1138","CreatedById":113955,"CreatedDateTime":"2015-04-14T01:10:29Z","Content":"\n\u003Cp\u003EI blame the game for this. It\u0027s stupid that the VAB is genuinely \u003Cem\u003Eeager\u003C/em\u003E to clip docking ports into each other. It should be coded to quit doing this.\u003C/p\u003E\n"},{"CreatedByName":"celem","CreatedById":91132,"CreatedDateTime":"2015-04-14T09:34:38Z","Content":"\n\u003Cp\u003EIt is one of those things that a lot of us are probably watching for automatically and by this point sub-consciously. Bugs me too and always has.\u003C/p\u003E\n"}]}