{"TopicId":104029,"ForumId":16,"TopicTitle":"Stock probes","CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-04-13T08:29:08Z","PageNum":1,"Articles":[{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-04-13T08:29:08Z","Content":"I use non landing probes for eliptic polar orbits. They have a thermometer and a gravity detector. I use them to get low space temperature and low and high space gravity per biome. Having that before landing max science. I gathered 2500science from 6 joolian probes before my landers got 37500 more\n\nWhat do you use probes for ?"},{"CreatedByName":"Speeding Mullet","CreatedById":62635,"CreatedDateTime":"2015-04-13T08:46:03Z","Content":"I use probes for, well probes. But also for a variety of other applications including, but not limited to:\n\nMicro landers\n\nDirectional control (i.e. when you have a horizontal rover but would find a vertical control input useful)\n\nAs part of a larger unmanned vehicle. SSTO cargo delivery for example.\n\nIn satellites\n\nStructural use\n\nHope that helps \n\nSM"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-04-13T09:18:32Z","Content":"Well, I forgot to tell that I use probe core in most of my Tugs, but it\u0027s only to not beeing converted to debris while waiting for the carried ship to return. Also, I used a lot of probe core on various mission to ship payload to space station. But again, it\u0027s not \u0022really\u0022 a probe/artifical satellite."},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-04-13T09:18:38Z","Content":"I like using a probe to scout out where my bases are going to go. Probes, being very small, can go VERY far on a little fuel. Also, because they\u0027re light, cheap, and unmanned it doesn\u0027t hurt to lose one. You can bounce around a half dozen times around Mun until you find a nice flat spot and then when you\u0027re landing your base, you can go right for the probe and be sure that if you land near it, you\u0027ll have a flat area for your base."},{"CreatedByName":"el_coyoto","CreatedById":49292,"CreatedDateTime":"2015-04-13T11:32:17Z","Content":"I tend to use probe cores everywhere, even on my manned vehicles. If anything goes wrong, it frees up one seat for a rescue mission... ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\nEven if nothing goes wrong (lol), I like the operational freedom of having a vehicle that doesn\u0027t require a crew to be piloted, especially when launching exploration armadas where the bases, rovers and other auxiliary systems can fly on their own."},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-04-13T12:16:19Z","Content":"Yes yes. The topic wasn\u0027t about using probes core in our designs, but about lauching a probe/satellite to orbit. What for, except to gather gravity and temperature data ?"},{"CreatedByName":"Starhawk","CreatedById":131400,"CreatedDateTime":"2015-04-13T14:30:51Z","Content":"An excellent use that I read about recently is as an interplanetary launch window finder. Put a probe/satellite in a solar orbit with the same parameters as Kerbin, only just ahead of it.\n\nYou can then create maneuver nodes on the probe\u0027s orbit to see when you have a launch window to another body.\n\nHappy landings!"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-04-13T14:37:15Z","Content":"Yes, great idea. Do you have a link ?"},{"CreatedByName":"Starhawk","CreatedById":131400,"CreatedDateTime":"2015-04-13T14:49:04Z","Content":"Not at the moment. There wasn\u0027t much more to it than what I wrote.\n\nThe idea seems pretty straightforward. Say you want to go to Duna and assume the probe is already in place. You create a maneuver node on the probe\u0027s orbit. Add prograde until the probe\u0027s orbit touches Duna\u0027s orbit. Then grab the maneuver node and slide it along the orbit line until you get an encounter. If you don\u0027t get one, right-click the maneuver node and use the little button underneath to advance the maneuver node one or more full orbit(s), and then slide it around until you have an encounter.\n\nYou then know when to launch to have an encounter with Duna. You can then remove the maneuver node.\n\nI would imagine you might want to add a small amount of time to the time shown by the maneuver node, because Kerbin will be slightly behind the probe. Of course, you still have to make sure you get the ejection angle right as well as the timing, but that is just about patience and fine-tuning the maneuver node that you actually use for your burn.\n\nHappy landings!\n\n**Edited \u003Ctime datetime=\u00222015-04-13T14:53:28Z\u0022 title=\u002204/13/2015 02:53  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 13, 2015\u003C/time\u003E by Starhawk**\n  \nclarity"},{"CreatedByName":"el_coyoto","CreatedById":49292,"CreatedDateTime":"2015-04-13T15:07:59Z","Content":"\u003E \n\u003E Yes yes. The topic wasn\u0027t about using probes core in our designs, but about lauching a probe/satellite to orbit. What for, except to gather gravity and temperature data ?\n\nWooops ![:wink:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)\n\nApart from keeping a probe in orbit to complete the \u0022gather science around ...\u0022 contracts, I use probes to unlock quick science with the reusable science experiments as a vanguard to manned exploration, or \u0022science heavy\u0022 probes for targets where returning kerballed flights is too expensive/too dangerous. (eve landing, jool atmo, etc.)\n\nMy most stereotypical use is sending a light probe rover to scout for an anomaly or an interesting future base location and then use the rover as landing target for the manned landings. I love trying to land on top of that poor little rover... ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)"},{"CreatedByName":"stibbons","CreatedById":57865,"CreatedDateTime":"2015-04-13T15:13:13Z","Content":"I send probes to scout out landing sites. In a career game I\u0027ll drop three or four probes in different parts of a body. It might be a little cheaty, but once a probe is on the surface you can zoom in and out and get a good idea of the terrain for several kilometres around it, looking for good flat landing sites for a crewed mission. For bonus points, a robotic rover can drive around to find the perfect landing site, and then sit on the surface acting as a beacon to home in on during descent.\n\nFor a modded game they become much more important. First, I send one or two big Remotetech relay satellites, that sit in a high orbit and have the big antennas to communicate back to Kerbin. Then the smaller Scansat probes, that maneuvre in to polar orbits and scan for resources and map data. Then the robotic landers for initial surface science and landing site investigation. Only then do I think about sending actual Kerbals."},{"CreatedByName":"Bev7787","CreatedById":136501,"CreatedDateTime":"2015-04-14T00:29:02Z","Content":"I use my standard probes (Probodyne OKTO, Thermometer, 2 mystery goo, Gravioli detector, Material bay, LV-909, fuel tank, solar panels and antenna) for contract completion while managing to squeeze science in as well. I place some in polar orbit for good photographs"}]}