{"TopicId":104031,"ForumId":44,"TopicTitle":"What would a Kinetic Orbital Bombardment Strike looks like?","CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-04-13T09:11:36Z","PageNum":1,"Articles":[{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-04-13T09:11:36Z","Content":"\n\u003Cp\u003EI keep wondering about it when I see this:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/jOKf5r_JMAo?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EIs that going to be how it look (inaccuracy in the stuff that is shown on their computer screen and the things they say aside)? Would it cause a massive shockwave that actually transform the ground in such dramatic fashion? or would it bore a deep hole into the ground and leaving more precise destruction?\u003C/p\u003E\n"},{"CreatedByName":"Deutherius","CreatedById":125381,"CreatedDateTime":"2015-04-13T09:18:58Z","Content":"\n\u003Cp\u003E(Please note that I cannot view the video with sound at this time) Unless it is a really powerful bomb, I think this is just overdramatized for the purposes of \u0022hurr durr suparwepon\u0022. The projectile would most likely just bore itself REALLY deep into the ground, destroying everything in it\u0027s path. Probably some tremors, but not such a dramatic terraforming event.\u003C/p\u003E\u003Cp\u003EI believe that was the original purpose of the rods from god (Project Thor If I recall correctly), right? To destroy underground bunkers.\u003C/p\u003E\n"},{"CreatedByName":"biohazard15","CreatedById":91655,"CreatedDateTime":"2015-04-13T09:25:50Z","Content":"\n\u003Cp\u003EThe rod needs to be the size (and weight) of Empire State Building to produce such effects. The real \u0022telegraph pole\u0022 would just bury itself deep in the ground, maybe with some sorts of explosion, but it would be something in range of heavy conventional bomb, not a megaton-class nuke.\u003C/p\u003E\n"},{"CreatedByName":"Tommygun","CreatedById":41293,"CreatedDateTime":"2015-04-13T09:26:55Z","Content":"\n\u003Cp\u003EFrom what I understand a 10 ton tungsten rod drop at orbital speeds (about 28,000 kph) would have the kinetic energy of a 10 ton bomb explosion.\u003C/p\u003E\u003Cp\u003EThe energy would only be released when it hits the ground, so a lot of energy, but not all is going into the ground and then reflect out and up too.\u003C/p\u003E\u003Cp\u003EI don\u0027t know any percentages, but nothing like a land wave is going to happen. Even an atomic weapon doesn\u0027t create land waves like that.\u003C/p\u003E\n"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-04-13T09:45:39Z","Content":"\n\u003Cp\u003EIt is a good thing that we might never see such a weapon used in reality, but I am really curious about how it might really look...\u003C/p\u003E\n"},{"CreatedByName":"Deutherius","CreatedById":125381,"CreatedDateTime":"2015-04-13T09:45:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tommygun\u0022 data-cite=\u0022Tommygun\u0022\u003E\u003Cdiv\u003EEven an atomic weapon doesn\u0027t create land waves like that.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMost atomic weapons would be detonated in the air above target, because of the logistic problem that is getting the bomb in the ground below the target.\u003C/p\u003E\u003Cp\u003EThere have been nuclear bomb tests below ground level, but none that I have seen have produced \u003Cstrong\u003Esuch\u003C/strong\u003E a dramatic effect.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/Hy0cjVobjOs?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd even if they did, a tungsten pole just doesn\u0027t release its energy in the same way that the nuclear bomb does.\u003C/p\u003E\u003Cp\u003EEDIT: To clarify, I agree with Tommygun\u0027s post, just providing additional stuff\u003C/p\u003E\n"},{"CreatedByName":"Darnok","CreatedById":85708,"CreatedDateTime":"2015-04-13T09:53:05Z","Content":"\n\u003Cp\u003EYou guys didn\u0027t seen electromagnetic cannons?\u003C/p\u003E\u003Cp\u003EHaving in orbit satellite with huge electromagnetic cannon you could speed up even few tons projectile, of course it would have to be built from alloys that won\u0027t burn down on re-entry.\u003C/p\u003E\u003Cp\u003EAnd shock wave might be caused not by explosion or impact itself, but from seismic reaction. What if you shot few projectiles, few tons of metal each, into seismic rifts?\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2015-04-13T10:24:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tommygun\u0022 data-cite=\u0022Tommygun\u0022\u003E\u003Cdiv\u003EFrom what I understand a 10 ton tungsten rod drop at orbital speeds (about 28,000 kph) would have the kinetic energy of a 10 ton bomb explosion.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAt the speeds you are quoting, it\u0027d be closer to 70T. But there are significant losses in atmosphere. The impact is closer to 3km/s, which gives the 10T yield.\u003C/p\u003E\n"},{"CreatedByName":"Darnok","CreatedById":85708,"CreatedDateTime":"2015-04-13T10:28:15Z","Content":"\n\u003Cp\u003EOne more thing what if we would shot from satellite orbiting around the Moon? \u003C/p\u003E\u003Cp\u003EIt should increase speed of projectile even further \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2015-04-13T10:38:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Deutherius\u0022 data-cite=\u0022Deutherius\u0022\u003E\u003Cdiv\u003EThe projectile would most likely just bore itself REALLY deep into the ground, destroying everything in it\u0027s path. Probably some tremors, but not such a dramatic terraforming event.\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022biohazard15\u0022 data-cite=\u0022biohazard15\u0022\u003E\u003Cdiv\u003EThe real \u0022telegraph pole\u0022 would just bury itself deep in the ground, (...)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, depends how you define \u0022really deep\u0022. As Isaac Newton already showed, a typical impactor can embed itself no deeper into the target than its own length, times the difference in densities.\u003C/p\u003E\u003Cp\u003ENow, tungsten has one of the highest densities recorded among the elements (but not the highest). It is about 8 times more dense then concrete, or 7 times more dense than solid rock (on average, because there are even more variants of concrete than there are of rock). So it could be argued that a \u0022rod of god\u0022 about 3 meters in length* would bury no deeper than maybe 22 meters. The rod is also not a completely blunt impactor, but rather tapered specifically for penetration, so it\u0027ll go deeper than the first approximation suggests... but I don\u0027t know how much deeper. Maybe 10 to 12 times its own length. So about 35 meters at most.\u003C/p\u003E\u003Cp\u003EStill makes it a useful bunker buster, but doesn\u0027t really carry it far below the surface, in absolute terms. Keep in mind: the rod is going to come down at an angle. A relatively flat angle. Certainly nowhere near vertically down. This is an object on a very fast suborbital trajectory that only juuuust grazes the surface where it is meant to hit (because that maximizes the speed and therefore the impact energy). So all that impact depth is going to go largely \u003Cem\u003Esideways\u003C/em\u003E. For a very good visualization - Scott Manley made a video on it where he tries to hit KSC with such an impactor. Spoiler: it\u0027s very difficult to pull off.\u003C/p\u003E\u003Cp\u003EAssuming it hits nothing but solid ground on its way down, the energy released will go largely upwards, because that\u0027s the path of least resistance. I expect that the effect would not be unlike seeing a blurry flash of light lance down from the heavens, which impacted in a brief, extremely bright event that disappeared in the blink of an eye as it burrows in. But within that same blink of an eye you\u0027d get a fountain of superheated rock getting thrown upwards - perhaps not unlike the water spray caused by a speeding object hitting the ocean at a flat angle and being suddenly slowerd down. It would be a single blast event, lasting a second at most. The resulting crater would be as \u0022deep\u0022 as the projectile burrowed, if slanted very much sideways, and fairly sharply cone-shaped. The top section would likely be missing, though, so it might be more like a trench. Though that (and the crater size) depends on the surface material and the way it breaks up under stress. The blast wave would seriously damage surrounding buildings (and shatter all windows in a fairly large radius) but not collapse them.\u003C/p\u003E\u003Cp\u003EAssuming the impactor hits something on its way down that it can release its energy into, then it will do so. For example, a bunker, if hit by such a projectile, will take a large portion of the impact energy because it\u0027s so conveniently empty (from the energy\u0027s point of view). An underground cavern system would be affected disastrously, likely leading to widespread collapse of the entire system. Such a thing could lead to the whole ground above suddenly falling a bit, or caving in in places, over an area much larger than the impact crater. This would naturally collapse most large buildings that relied on this ground for structural stability. If you assume that the ground below Westminster is sort of swiss cheese like (maye they have more catacombs than Paris? I dunno), then you could potentially get an effect somewhat similar to what is portrayed in the movie. But on the grand average, it seems like a rather contrived scenario and the single-blast, trench digging variant seems more likely. And the impact angle is wrong in every case.\u003C/p\u003E\u003Cp\u003E* completely made up number for illustration purposes\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-04-13T10:54:11Z\u0022 title=\u002204/13/2015 10:54  AM\u0022 data-short=\u00229 yr\u0022\u003EApril 13, 2015\u003C/time\u003E by Streetwind\u003C/strong\u003E\n\u003Cbr\u003ETypos, typos everywhere!\n\u003C/span\u003E\n"},{"CreatedByName":"Tommygun","CreatedById":41293,"CreatedDateTime":"2015-04-13T10:56:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K^2\u0022 data-cite=\u0022K^2\u0022\u003E\u003Cdiv\u003EAt the speeds you are quoting, it\u0027d be closer to 70T. But there are significant losses in atmosphere. The impact is closer to 3km/s, which gives the 10T yield.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI guess I should have been more specific, I meant dropped from orbit at orbital speeds of 28000 kph, not hitting the ground traveling at that speed.\u003C/p\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2015-04-13T11:12:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Streetwind\u0022 data-cite=\u0022Streetwind\u0022\u003E\u003Cdiv\u003Esnip\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPretty good description, and you make a point of mentioning the flash of light. Considering how fast the energy is deposited on the ground, a significant fraction must be spent creating a thermal flash, not to mention the column of superheated plasma the warhead leaves travelling at hypersonic speed in the low atmosphere. Hell, the shockwaves of the atmospheric portions of the flight will shatter some windows on the way to the target.\u003C/p\u003E\u003Cp\u003EBut on the other hand, a few kiloricks can\u0027t blow up London. These things have yields comparable with conventional explosives, after all. So we can conclude: a lot less rumble, but slightly more flashy.\u003C/p\u003E\u003Cp\u003ERune. And if someone suggests additional electromagnetic acceleration of the round, doing that to London would have ejected the station form orbit, because that round had to be relativistic to make such a mess. Expensive shot.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2015-04-13T11:36:33Z","Content":"\n\u003Cp\u003ENo, the video is just fancy but totally unrealistic. It assumes most of the kinetic energy would be converted to mechanical energy which is not correct. Most is converted into heat.\u003C/p\u003E\n"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-04-13T12:03:53Z","Content":"\n\u003Cp\u003EHmm...so a lot of heat in the area ( enough to melt stuff around it?) along with tremor similar to a light earthquake then? Wonder what would be the area of effect for such things.\u003C/p\u003E\n"},{"CreatedByName":"ChrisSpace","CreatedById":140622,"CreatedDateTime":"2015-04-13T12:18:13Z","Content":"\n\u003Cp\u003EWhat film is the clip from?\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-04-13T12:46:14Z","Content":"\n\u003Cp\u003EUmmm it says on the video....\u003C/p\u003E\u003Cp\u003EAnyway, one does not simply \u0022drop it\u0022\u003C/p\u003E\u003Cp\u003EThey would indeed need to launch it retrograde from the sat.\u003C/p\u003E\u003Cp\u003EThe next thing to consider, is that the impact can only be a small fraction of the power of the rocket that launched it.\u003C/p\u003E\u003Cp\u003EEven though orbital rockets are big.... they don\u0027t make booms on the scale of nukes when they blow up.\u003C/p\u003E\u003Cp\u003EAnd the amount of energy actually imparted to the payload is but a small fraction (most of the energy is imparted to the exhaust/reaction mass, and then the stages that don\u0027t make it to orbit with the payload).\u003C/p\u003E\u003Cp\u003EThen you lose even more energy from air resistance on reentry.\u003C/p\u003E\u003Cp\u003EI don\u0027t see how it could be more powerful than an ICBM carrying an inert payload instead of a nuclear warhead.\u003C/p\u003E\u003Cp\u003EI of course mean a long range ICBM, one that reaches near orbital speeds (by the time the payload re-enters and nears the surface, the velocity difference should be negligable)\u003C/p\u003E\n"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-04-13T12:52:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerikBalm\u0022 data-cite=\u0022KerikBalm\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI don\u0027t see how it could be more powerful than an ICBM carrying an inert payload instead of a nuclear warhead.\u003C/p\u003E\u003Cp\u003EI of course mean a long range ICBM, one that reaches near orbital speeds (by the time the payload re-enters and nears the surface, the velocity difference should be negligable)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt is not going to be more powerful at all. The weapon platform simply take advantage of being an orbital platform that can attack from space with very little warning and difficult to counter, and slip through the space treaty that bans weapon of mass destruction in space (it is a conventional weapon by definition). But those are kind of negligible advantage, comparing to the cost of putting it in space, hence it is not going to appear in reality in anytime soon. And also the reason why I wonder what such an impact would look like as there is not going to be any real example.\u003C/p\u003E\n"},{"CreatedByName":"cicatrix","CreatedById":120831,"CreatedDateTime":"2015-04-13T13:04:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Darnok\u0022 data-cite=\u0022Darnok\u0022\u003E\u003Cdiv\u003EYou guys didn\u0027t seen electromagnetic cannons?\u003Cp\u003EHaving in orbit satellite with huge electromagnetic cannon you could speed up even few tons projectile, of course it would have to be built from alloys that won\u0027t burn down on re-entry.\u003C/p\u003E\u003Cp\u003EAnd shock wave might be caused not by explosion or impact itself, but from seismic reaction. What if you shot few projectiles, few tons of metal each, into seismic rifts?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd of course this satellite should do something about the recoil force which will be equal to the force that have been applied to the projectile.\u003C/p\u003E\u003Cp\u003EAs for the original video - the laws of conservation are obviously violated. In order to deliver the energy capable of turning London upside down the bomb should have this energy in any form. E = mv\u003Csup\u003E2\u003C/sup\u003E/2 if I\u0027m not mistaken. Although the energy of the falling rod from the orbit would be quite large it would be several orders of magnitude less than what\u0027s been shown in the video.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K^2\u0022 data-cite=\u0022K^2\u0022\u003E\u003Cdiv\u003EAt the speeds you are quoting, it\u0027d be closer to 70T. But there are significant losses in atmosphere. The impact is closer to 3km/s, which gives the 10T yield.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBesides, the rod itself should lose some part of its mass as it burns through the atmosphere.\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2015-04-13T13:17:01Z","Content":"\n\u003Cp\u003ENukes are generally detonated in the air to maximize destructive area. Ground bursts (nukes) are typically used for hardened targets like missile silos.\u003C/p\u003E\u003Cp\u003EAside for the timing of the movie weapns being absurd, so clearly is the velocity. For a given mass weapon, we could easily calculate the velocity required for the KE to equal hundreds of kt of TNT.\u003C/p\u003E\n"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-04-13T13:25:29Z","Content":"\n\u003Cp\u003EWell, I don\u0027t think there is any actual stats about the size and mass of the rod being dropped from space, and the perspective of the station in orbit can be deceiving. It could be a building-sized rod, eying it from the screencap of the drop alone. But..*shrug*\u003C/p\u003E\n"},{"CreatedByName":"cicatrix","CreatedById":120831,"CreatedDateTime":"2015-04-13T13:36:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RainDreamer\u0022 data-cite=\u0022RainDreamer\u0022\u003E\u003Cdiv\u003EWell, I don\u0027t think there is any actual stats about the size and mass of the rod being dropped from space, and the perspective of the station in orbit can be deceiving. It could be a building-sized rod, eying it from the screencap of the drop alone. But..*shrug*\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDon\u0027t give up hope, imagine the inside of the rod had several kilograms of antimatter suspended in electromagnetic field. But still it would be a fireball...\u003C/p\u003E\n"},{"CreatedByName":"YNM","CreatedById":98447,"CreatedDateTime":"2015-04-13T13:55:47Z","Content":"\n\u003Cp\u003EWhy not a slightly huuge ball of water ice, akin of \u003Ca href=\u0022https://en.wikipedia.org/wiki/Comet\u0022 rel=\u0022external nofollow\u0022\u003Ethis\u003C/a\u003E ? The impacts for are quite, \u003Ca href=\u0022http://impact.ese.ic.ac.uk/cgi-bin/crater.cgi?dist=7\u0026amp;distanceUnits=1\u0026amp;diam=300\u0026amp;diameterUnits=1\u0026amp;pdens=1000\u0026amp;pdens_select=0\u0026amp;vel=11\u0026amp;velocityUnits=1%CE%B8=60\u0026amp;wdepth=30\u0026amp;wdepthUnits=1\u0026amp;tdens=2500\u0022 rel=\u0022external nofollow\u0022\u003Ewell...\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2015-04-13T14:12:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022YNM\u0022 data-cite=\u0022YNM\u0022\u003E\u003Cdiv\u003EWhy not a slightly huuge ball of water ice, akin of \u003Ca href=\u0022https://en.wikipedia.org/wiki/Comet\u0022 rel=\u0022external nofollow\u0022\u003Ethis\u003C/a\u003E ? The impacts for are quite, \u003Ca href=\u0022http://impact.ese.ic.ac.uk/cgi-bin/crater.cgi?dist=7\u0026amp;distanceUnits=1\u0026amp;diam=300\u0026amp;diameterUnits=1\u0026amp;pdens=1000\u0026amp;pdens_select=0\u0026amp;vel=11\u0026amp;velocityUnits=1%CE%B8=60\u0026amp;wdepth=30\u0026amp;wdepthUnits=1\u0026amp;tdens=2500\u0022 rel=\u0022external nofollow\u0022\u003Ewell...\u003C/a\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo no, you\u0027re doing it wrong. If you want to be unreasonable, \u003Ca href=\u0022http://tvtropes.org/pmwiki/pmwiki.php/Main/ColonyDrop\u0022 rel=\u0022external nofollow\u0022\u003Ethis is the only way to be properly unreasonable\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EForgive me father for I have sinned.\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"tomf","CreatedById":57809,"CreatedDateTime":"2015-04-13T14:15:00Z","Content":"\n\u003Cp\u003EI guess the 10-tonne of explosive makes sense\u003C/p\u003E\u003Cp\u003EThe rod isn\u0027t gong to have more energy than the chemical energy rocket that put it into orbit.\u003C/p\u003E\u003Cp\u003EIf a sensible sized rocket could throw an impactor that did nuclear levels of damage they wouldn\u0027t bother puttting nuclear weapons on top of them.\u003C/p\u003E\n"},{"CreatedByName":"impyre","CreatedById":116031,"CreatedDateTime":"2015-04-13T15:12:20Z","Content":"\n\u003Cp\u003EIf you were to strike from space, you\u0027d use explosives or some other destructive payload. \u0022Kinetic\u0022 orbital strikes makes about as much sense as a space catapult. As others have pointed out, the amount of fuel spent establishing an advantageous orbit would be many times more effective when used established a depressed suborbital trajectory.\u003C/p\u003E\n"}]}