{"TopicId":104019,"ForumId":16,"TopicTitle":"Spacecraft Designs?","CreatedByName":"MAFman","CreatedById":101780,"CreatedDateTime":"2015-04-13T04:46:47Z","PageNum":1,"Articles":[{"CreatedByName":"MAFman","CreatedById":101780,"CreatedDateTime":"2015-04-13T04:46:47Z","Content":"\n\u003Cp\u003ESo, I haven\u0027t even bought the game nor will I be able to for quite some time, but I\u0027m already pretty seriously addicted from YouTube videos I\u0027ve watched (primarily Scott Manley \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E) Anyway, I am planning a family of launch vehicles for when I do buy KSP, and I need help.\u003C/p\u003E\u003Cp\u003EFirst, I need \u0022light\u0022, \u0022medium\u0022, \u0022heavy\u0022, and \u0022super-heavy\u0022 lifters. What would you say would be a typical mass range for each category?\u003C/p\u003E\u003Cp\u003ESecond, how would I go about designing the ideal rocket for each class? (TWR\u0027s are around 1.5 to 2.5)\u003C/p\u003E\u003Cp\u003EThird, I am also planning to have a family of upper stages for interplanetary use, also corresponding to the mass classification system outlined above. I need help designing this as well. Each upper stage has a delta-V of about 3 km/s and an acceleration of 1.5g.\u003C/p\u003E\u003Cp\u003EThanks! (And sorry if this was all the biggest n00b question you\u0027ve ever seen \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E )\u003C/p\u003E\n"},{"CreatedByName":"jaredkzr","CreatedById":73023,"CreatedDateTime":"2015-04-13T04:55:40Z","Content":"\n\u003Cp\u003EWell designing the rocket is half the fun! It might detract from the experience if you got one of us to show you how to do it! If you really just want to dive into the actual flight experience then I\u0027d head over to the Spacecraft Exchange subforum to pick up some craft files.\u003C/p\u003E\n"},{"CreatedByName":"MegaFlop10","CreatedById":114575,"CreatedDateTime":"2015-04-13T05:03:21Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/33381-0-20-2-Zenith-rocket-family-%28modernised-for-0-20-x-with-perfect-subassembly%29\u0022 rel=\u0022external nofollow\u0022\u003EThese\u003C/a\u003E rockets are pretty good, you can take them as example.\u003C/p\u003E\u003Cp\u003EThere are also \u003Ca href=\u0022https://en.wikipedia.org/wiki/Launch_vehicle#By_size\u0022 rel=\u0022external nofollow\u0022\u003EWikipedia pages\u003C/a\u003E about launcher weights and such.\u003C/p\u003E\u003Cp\u003EAlso try putting together your designs with \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Parts\u0022 rel=\u0022external nofollow\u0022\u003Ethese parts\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EIf you can send me your designs I might be able to build the rocket and give you tips and all that. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"UmbralRaptor","CreatedById":2767,"CreatedDateTime":"2015-04-13T05:04:10Z","Content":"\n\u003Cp\u003EWell, a standard approach is to start with \u003Ca href=\u0022https://en.wikipedia.org/wiki/Tsiolkovsky_rocket_equation\u0022 rel=\u0022external nofollow\u0022\u003Ethe rocket equation\u003C/a\u003E, \u003Ca href=\u0022https://en.wikipedia.org/wiki/Kepler%27s_laws_of_planetary_motion#Third_law\u0022 rel=\u0022external nofollow\u0022\u003EKepler\u0027s laws\u003C/a\u003E, and the \u003Ca href=\u0022https://en.wikipedia.org/wiki/Vis-viva_equation\u0022 rel=\u0022external nofollow\u0022\u003EVis-viva equation.\u003C/a\u003E The first one for rocket performance, and the second and third help to get a handle on various requirements for orbital maneuvers.\u003C/p\u003E\u003Cp\u003EFor lifter classes, it ultimately depends on what sorts payloads you want and where you want to put them. I\u0027d also argue that for upper stages, 1.5 g is nice to have but far from necessary once you\u0027re in orbit. Or even for the last 500-1000 m/s on getting to orbit.\u003C/p\u003E\n"},{"CreatedByName":"Chaos_Klaus","CreatedById":140720,"CreatedDateTime":"2015-04-13T09:27:04Z","Content":"\n\u003Cp\u003EWhy don\u0027t you check out the demo? :]\u003C/p\u003E\u003Cp\u003EI personally design the lifters based on the payload. When Version 1.0 is out in a few weeks, we will all need to reevaluate our lifter designs anyway, as aerodynamics and engine behaviour changes.\u003C/p\u003E\n"},{"CreatedByName":"OhioBob","CreatedById":128005,"CreatedDateTime":"2015-04-13T17:04:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MAFman\u0022 data-cite=\u0022MAFman\u0022\u003E\u003Cdiv\u003EFirst, I need \u0022light\u0022, \u0022medium\u0022, \u0022heavy\u0022, and \u0022super-heavy\u0022 lifters. What would you say would be a typical mass range for each category?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI generally classify as \u0022light\u0022 any launcher made exclusively of 1.25 m parts. As soon as I start adding 2.5 m parts I classify it as \u0022medium\u0022. When I start adding 3.75 m parts it becomes \u0022heavy\u0022. I consider \u0022super-heavy\u0022 to be launchers that start adding additional 3.75 m parts attached radially.\u003C/p\u003E\u003Cp\u003EWhen you say \u0022typical mass\u0022 do you mean the total launch mass or the mass of the payload (i.e. lift capacity). Although there are no precise lines of demarcation, my light launch vehicles generally have lift capacities of 5 tonnes or less; my medium launchers lift between 6 and 30 tonnes, my heavy launchers between 30 and 80 tonnes, and my super-heavy launchers \u0026gt;80 tonnes. In regard to total launch mass, light is approximately \u0026lt;40 tonnes, medium 40-200 tonnes, heavy 200-450 tonnes, and super-heavy \u0026gt;450 tonnes.\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2015-04-13T19:04:47Z","Content":"\n\u003Cp\u003EGenerally I design the rocket for the payload. I need to lift 20t to LKO, no problem. I need to get it to the Mun? That\u0027s a bigger rocket. I\u0027ve only recently started standardizing my rockets, but if I put up a payload with a rocket, I consider that the Maximum Payload Weight for that rocket and anything lighter than that get\u0027s the rocket attached, anything heavier gets a new rocket designed.\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-04-13T19:16:59Z","Content":"\n\u003Cp\u003EIn the past I also designed for the payload. I\u0027ve been thinking about building standard lifters but I want to make sure they are scalable so if I build a 50t and 100t lifter and my payload is 75t, I can remove pieces rather than waste fuel and part cost.\u003C/p\u003E\u003Cp\u003EIn any case, I\u0027m not going to do that until I know how the ISP and aerodynamic changes affect them in 1.0. There is just no point right now, it would be a waste of time.\u003C/p\u003E\n"},{"CreatedByName":"scarybeard","CreatedById":140873,"CreatedDateTime":"2015-04-14T00:26:50Z","Content":"\n\u003Cp\u003EI played the Demo for like 3 months before purchasing the game. for basic knowledge, its all you need. In fact, I recommend building there for a while with limited parts available so that you get a grasp of basics before being over-burdened with options in the full sandbox mode.\u003C/p\u003E\n"},{"CreatedByName":"juanml82","CreatedById":105344,"CreatedDateTime":"2015-04-14T01:17:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022OhioBob\u0022 data-cite=\u0022OhioBob\u0022\u003E\u003Cdiv\u003EI generally classify as \u0022light\u0022 any launcher made exclusively of 1.25 m parts. As soon as I start adding 2.5 m parts I classify it as \u0022medium\u0022. When I start adding 3.75 m parts it becomes \u0022heavy\u0022. I consider \u0022super-heavy\u0022 to be launchers that start adding additional 3.75 m parts attached radially.\u003Cp\u003EWhen you say \u0022typical mass\u0022 do you mean the total launch mass or the mass of the payload (i.e. lift capacity). Although there are no precise lines of demarcation, my light launch vehicles generally have lift capacities of 5 tonnes or less; my medium launchers lift between 6 and 30 tonnes, my heavy launchers between 30 and 80 tonnes, and my super-heavy launchers \u0026gt;80 tonnes. In regard to total launch mass, light is approximately \u0026lt;40 tonnes, medium 40-200 tonnes, heavy 200-450 tonnes, and super-heavy \u0026gt;450 tonnes.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI call my 60 tons lifters \u0022medium\u0022 lifters. Heavy is anything above 100 tons.\u003C/p\u003E\u003Cp\u003EAs for the OP, as others said, 1.0 should change parts and the way they react to the atmosphere, so it\u0027s likely to change.\u003C/p\u003E\u003Cp\u003EMy interplanetary transfer stages are typically an orange jumbo tank with four nuclear engines (or the MRS quad nuke at the bottom) radially mounted using girders. That, coupled with assorted docking ports, and everything needed to the ship to act on its own (probe cores, power, rcs)\u003C/p\u003E\u003Cp\u003EAt this point, I usually keep that as a subassembly and I also keep about three lifters as subassemblies. This way, I just design the payload, check it\u0027s weight and decide which is the preset I\u0027ll use to put it wherever I want to.\u003C/p\u003E\u003Cp\u003EMy medium to heavy lifters use the 3.5 meters parts, with a KR-L2 or the quad engine at the center (depending on whether the KR-L2 thrust can handle the load) with the double engine which is also a fuel tank around it in an asparagus configuration - the problem with those is placing SRBs below. Typically, that\u0027s a girder holding a structural fuselage and the rockets go below it, but that\u0027s rather wobbly. I could change the outer rockets to Mainsails, so I just place the S1 rockets below.\u003C/p\u003E\n"}]}