{"TopicId":104114,"ForumId":20,"TopicTitle":"Which mods use most RAM?","CreatedByName":"That guy what did it","CreatedById":140892,"CreatedDateTime":"2015-04-14T16:03:01Z","PageNum":1,"Articles":[{"CreatedByName":"That guy what did it","CreatedById":140892,"CreatedDateTime":"2015-04-14T16:03:01Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i60.tinypic.com/n2kiad.jpg\u0022 alt=\u0022n2kiad.jpg\u0022\u003EHi fellow Kerbonauts, \u003C/p\u003E\u003Cp\u003EWould anyone be able to advise me of which mods are particularly high RAM users out of the attached picture of my Gamedata folder?\u003C/p\u003E\u003Cp\u003EI have been getting OOM crashes very regularly recently, and I think that the only course of action is to remove some beloved mods.\u003C/p\u003E\u003Cp\u003EI am already running on OpenGL with ATM and half res on the ksp settings.\u003C/p\u003E\u003Cp\u003EThanks!!\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-04-14T16:09:37Z","Content":"\n\u003Cp\u003EB9, NovaPunch, and KW Rocketry are pretty part-heavy, and thus RAM-heavy (despite using texture trickery to minimize their footprints, it\u0027s still a \u003Cem\u003Elot\u003C/em\u003E of parts). Aside from those I would say EVE (BoulderCo) is a culprit, too.\u003C/p\u003E\n"},{"CreatedByName":"michaelsteele3","CreatedById":127113,"CreatedDateTime":"2015-04-14T16:09:51Z","Content":"\n\u003Cp\u003EThe Derby Mod. (Bad-Dum-Tss!)\u003C/p\u003E\u003Cp\u003EBut really, whichever one seems to be the most complicated in terms of how many parts, and how well-scripted it is.\u003C/p\u003E\u003Cp\u003EAnd can\u0027t you see what size a folder is with WinRar?\u003C/p\u003E\n"},{"CreatedByName":"That guy what did it","CreatedById":140892,"CreatedDateTime":"2015-04-14T16:14:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022michaelsteele3\u0022 data-cite=\u0022michaelsteele3\u0022\u003E\u003Cdiv\u003EThe Derby Mod. (Bad-Dum-Tss!)\u003Cp\u003EBut really, whichever one seems to be the most complicated in terms of how many parts, and how well-scripted it is.\u003C/p\u003E\u003Cp\u003EAnd can\u0027t you see what size a folder is with WinRar?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks for a quick response guys, \u003C/p\u003E\u003Cp\u003EI can see the size of the folders, but have read that \u0022some mods\u0022 can use way more RAM than their size on disk would suggest, but no specifics.\u003C/p\u003E\u003Cp\u003EI might try removing EVE as suggested and see how that works.\u003C/p\u003E\n"},{"CreatedByName":"Sampa","CreatedById":130079,"CreatedDateTime":"2015-04-14T16:32:30Z","Content":"\n\u003Cp\u003EInterstellar might also be a culprit as well. I have installed and uninstalled that thing so many times due to space available, it\u0027s not even funny!\u003C/p\u003E\n"},{"CreatedByName":"Van Disaster","CreatedById":58876,"CreatedDateTime":"2015-04-14T20:01:36Z","Content":"\n\u003Cp\u003EEVE and well, texture replacer doesn\u0027t use anything much by itself, but if you\u0027ve got some big textures in there they can use a fantastic amount ( although now your image loaded I see you don\u0027t have it at all: try installing texture replacer without any textures, it might save a bit by unloading some textures after load ). The worst culprit is squad, try Ven\u0027s stock revamp.\u003C/p\u003E\u003Cp\u003EI would look at FASA, that\u0027s as big as NP \u002B B9 together on my install. I\u0027d also suggest picking one of KW or Novapunch, not both.\u003C/p\u003E\n"}]}