{"TopicId":104286,"ForumId":70,"TopicTitle":"the librarian krackin!","CreatedByName":"billycop32","CreatedById":93407,"CreatedDateTime":"2015-04-17T00:27:37Z","PageNum":1,"Articles":[{"CreatedByName":"billycop32","CreatedById":93407,"CreatedDateTime":"2015-04-17T00:27:37Z","Content":"\n\u003Cp\u003Eok so background story first: my computer at home is as advanced these days as fire is to us. \u0026gt;.\u0026gt; so I installed KSP via a steam library onto my 16 gb flash drive. KSP and a less than 1 GB speed boost program are the only things on it.\u003C/p\u003E\u003Cp\u003EI added mechjeb2 for the precision burns,\u003C/p\u003E\u003Cp\u003Estage recovery because i\u0027m playing career mode\u003C/p\u003E\u003Cp\u003Estation science so I have a reason to build a space station besides refueling.(side note: where are the experiments? I can\u0027t find them in the tech tree/VAB)\u003C/p\u003E\u003Cp\u003Enow onwards to the \u003Cem\u003Einteresting\u003C/em\u003E part\u003C/p\u003E\u003Cp\u003EI launched a team of 2 kerbals (1 pilot, 1 scientist) to perform a zoom by of the satellite body minmus ( please forgive me if spelling is incorrect. it\u0027s the second satellite around kerban.) to grab some delicious science. I collected a large amount and was ready to escape back to kerbin when \u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003E\u003Cem\u003EBAM\u003C/em\u003E\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E my team fails to escape properly and all h**l breaks lose. my \u0022orbit\u0022 if you can call it that \u003Cem\u003E \u003C/em\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cem\u003Eradically changes on it\u0027s own\u003C/em\u003E\u003C/span\u003E and forces me to reset the launch.\u003C/p\u003E\u003Cp\u003Ei\u0027ve tried reseting the launch 3 times. I\u0027ve even reset the game by quitting and relaunching. nothing so far.\u003C/p\u003E\u003Cp\u003Eany ideas where this bug is coming from? at least I can orbit and escape mun just fine. I haven\u0027t tried to escape kerbin yet though.\u003C/p\u003E\u003Cp\u003Efinal note: I have about a hour left of computer time at library when I post this and I can\u0027t return till monday. \u003C/p\u003E\u003Cp\u003Ethank you all for helping or at least reading!\u003C/p\u003E\n"},{"CreatedByName":"Feradose","CreatedById":111211,"CreatedDateTime":"2015-04-26T00:33:27Z","Content":"\n\u003Cp\u003EIs there part clipping?\u003C/p\u003E\n"},{"CreatedByName":"Capt. Hunt","CreatedById":97860,"CreatedDateTime":"2015-04-29T19:17:50Z","Content":"\n\u003Cp\u003Eit sounds like you were captured by minmus\u0027s gravity.\u003C/p\u003E\n"}]}