{"TopicId":104274,"ForumId":18,"TopicTitle":"What softwares to use?","CreatedByName":"jake9039","CreatedById":122602,"CreatedDateTime":"2015-04-16T21:35:05Z","PageNum":1,"Articles":[{"CreatedByName":"jake9039","CreatedById":122602,"CreatedDateTime":"2015-04-16T21:35:05Z","Content":"\n\u003Cp\u003EI would like to make YouTube videos, and want advice from the experts on what recording software and then what editing software I should use.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/p\u003E\u003Cp\u003Emy plan is to start without any indication(not even voice) on who I am, and as I increase in people, I will increase in trust, until eventually I will trust YouTube. but until then, what should I use to record? My planned games are:\u003C/p\u003E\u003Cp\u003E-Minecraft\u003C/p\u003E\u003Cp\u003E-kerbal space program:cool:\u003C/p\u003E\u003Cp\u003E-space engineers\u003C/p\u003E\u003Cp\u003E-(maybe) some portal\u003C/p\u003E\u003Cp\u003E-(maybe-er) some skyrim.\u003C/p\u003E\n"},{"CreatedByName":"dryer_lint","CreatedById":162541,"CreatedDateTime":"2015-04-16T21:46:33Z","Content":"\n\u003Cp\u003EWindows Movie Maker.\u003C/p\u003E\u003Cp\u003EOkay, I\u0027m kidding. What OS are you using though? I don\u0027t have much experience at all with Youtube, but maybe someone else will know.\u003C/p\u003E\n"},{"CreatedByName":"Brethern","CreatedById":15602,"CreatedDateTime":"2015-04-16T23:03:42Z","Content":"\n\u003Cp\u003EFraps is the normal screen capture software, at least one of the better ones.\u003C/p\u003E\u003Cp\u003EAs for editing software if you want to buy something Sony vegas. However I\u0027ve been hearing good things about camtasia studios.\u003C/p\u003E\n"},{"CreatedByName":"*Aqua*","CreatedById":103926,"CreatedDateTime":"2015-04-17T01:22:31Z","Content":"\n\u003Cp\u003EAfaik a lot of YouTube people use Dxtory to capture gameplay. In the cases where Dxtory doesn\u0027t work they\u0027ll use FRAPS.\u003C/p\u003E\u003Cp\u003EFor editing I don\u0027t know what is commonly used. Adobe Premiere maybe?\u003C/p\u003E\n"},{"CreatedByName":"jake9039","CreatedById":122602,"CreatedDateTime":"2015-04-20T03:38:51Z","Content":"\n\u003Cp\u003EI am on a windows 8.1, and need free software. I currently looking at using bandicam, but still need an editing software like adobe premier, because I have some expirience with it, but like I said, pricenrange is 50 cents\u003C/p\u003E\n"},{"CreatedByName":"Dizzle","CreatedById":31588,"CreatedDateTime":"2015-04-20T03:48:45Z","Content":"\n\u003Cp\u003EHaving experience with this, I\u0027d go with what\u0027s been said: FRAPS for recording, Sony Vegas for editing. If you intend to speak, make sure you adjust the audio levels accordingly, so that your voice isn\u0027t drowned out by the games. Alternatively, record your voice separately in a program like Audacity and sync it with the video track in editing, which is probably the best option.\u003C/p\u003E\n"},{"CreatedByName":"Randox","CreatedById":18034,"CreatedDateTime":"2015-04-20T03:52:29Z","Content":"\n\u003Cp\u003EAs someone whose toyed with the idea of doing this (and that did involve some test uploads), I really like OBS (open broadcast software). I don\u0027t think you\u0027ll find anything better without paying money. It\u0027s a bit more feature limited than something like Dxtory with regards to stuff like recording formats, but it works just fine once you set it up properly. That may be the biggest downside to it really, that it is almost certainly not the easiest recording software to setup, so you\u0027ll probably want to spend a couple minutes googling recording settings, and watch a video or two on youtube. I can provide the settings I use to record if you like.\u003C/p\u003E\u003Cp\u003EAnd of course, if you ever get into streaming, that\u0027s actually the bread and butter of what OBS does, so you can do both with the same program. One of the youtubers I watch has actually started recording everything with OBS instead of using dxtory for his youtube material to make his life a bit simpler.\u003C/p\u003E\u003Cp\u003EYou\u0027ll still need a program for video editing. For simple stuff, like cuts or some text on the screen, you can absolutely get away with windows movie maker, and I\u0027d actually recommend that you do exactly that, at least long enough to decide if this is something you want to keep doing and spend money on. And actually, to that end, I\u0027d definitely suggest starting with OBS and windows movie maker, since they\u0027ll at least be able to meet your needs long enough for you to decide if you want to keep going or not.\u003C/p\u003E\n"},{"CreatedByName":"LordFerret","CreatedById":111598,"CreatedDateTime":"2015-04-20T04:32:50Z","Content":"\n\u003Cp\u003EThere\u0027s a lot of stuff folks use, but I always turn to AV Linux ... it\u0027s free, and it\u0027s got a ton of stuff to work with.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.bandshed.net/AVLinux.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.bandshed.net/AVLinux.html\u003C/a\u003E\u003C/p\u003E\n"}]}