{"TopicId":104367,"ForumId":32,"TopicTitle":"V 1.0 Stock fairing seperation.","CreatedByName":"Majorjim!","CreatedById":61954,"CreatedDateTime":"2015-04-18T10:15:32Z","PageNum":4,"Articles":[{"CreatedByName":"jlo96","CreatedById":62307,"CreatedDateTime":"2015-04-18T16:15:16Z","Content":"\u003E \n\u003E But most people learn from their silly and disappointing past.\n\u003E [snip]\n\u003E \n\u003E Snark? ![:wink:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)\n\nYou want to cite those silly and disappointing things?\n\nAnd, you know, maybe this IS how kerbal fairings work. It\u0027s about how the devs feel their world calls for these fairings to work, and to be completely fair, as has been pointed out in this thread before, we\u0027re speculating *purely* on a single picture. That\u0027s not really.... much of anything.\n\nEDIT: \n\n\u003E \n\u003E From Harv: [snippity] A fairing that is 10 sections high and divided into 4 sides would have 40 panels, yes. How many objects this will produce on deployment depends on how they group together (that\u0027s next up on my to-do list actually) [/snippity].\n\nLooking at this, it makes me think he still has some work to do with fairing seperation, specifically what it looks like (explosion versus clamshell). So just, reserve judgement, yeah?\n\n**Edited \u003Ctime datetime=\u00222015-04-18T16:20:05Z\u0022 title=\u002204/18/2015 04:20  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 18, 2015\u003C/time\u003E by jlo96**"},{"CreatedByName":"Destroyer713","CreatedById":136956,"CreatedDateTime":"2015-04-18T17:12:06Z","Content":"While I\u0027m certainly not happy with how the fairings separate based on that single image we have, I\u0027m still happy we\u0027re getting fairings to begin with. In all honesty, I probably could live with fairings separating like that (I could always mentally justify it that\u0027s how Kerbals do things), but it would be nice if they separated like real life fairings, too.\n\nHere\u0027s to hoping the Devs clarify the issue in the next Dev Notes! ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"lucretius","CreatedById":134445,"CreatedDateTime":"2015-04-18T17:32:35Z","Content":"\u003E \n\u003E You want to cite those silly and disappointing things?\n\u003E And, you know, maybe this IS how kerbal fairings work. It\u0027s about how the devs feel their world calls for these fairings to work, and to be completely fair, as has been pointed out in this thread before, we\u0027re speculating *purely* on a single picture. That\u0027s not really.... much of anything.\n\nCommon we all know the reason KSP is so great is due to its \u0027fairly realistic\u0027 simulation of things, thats why its interesting, satisfying and fun. the whole kerbal thing is a side gimmick, a good one, i think its fine and fun. but its far from the point. So thatd be a pretty dum excuse to have the fairings behave like that. lol and i hope the picture was misleading and in reality they\u0027ve thought the fairings though properly."},{"CreatedByName":"Daze","CreatedById":57997,"CreatedDateTime":"2015-04-18T17:37:45Z","Content":"And it would be better if we could select what specific panel to detach"},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2015-04-18T17:43:22Z","Content":"Oh, no, this is EXACTLY how Kerbals would design their fairings. Maximal debris means maximal explosions, which is only the Kerbal way."},{"CreatedByName":"Hanuman","CreatedById":116709,"CreatedDateTime":"2015-04-18T17:45:00Z","Content":"I know it matters to some people, and I\u0027m not going to belittle that at all. That said and just speaking for myself, I think that if I ever found myself caring what fairings looked like after they separated, I\u0027d probably make an appointment with a doctor to either get the part that cares about it cut out or get some kind of medication to treat it."},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-04-18T18:07:23Z","Content":"\u003E \n\u003E I know it matters to some people, and I\u0027m not going to belittle that at all. That said and just speaking for myself, I think that if I ever found myself caring what fairings looked like after they separated, I\u0027d probably make an appointment with a doctor to either get the part that cares about it cut out or get some kind of medication to treat it.\n\nHaha... If this isn\u0027t belittling, I\u0027d hate to see what is! ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)\n\n I\u0027m personally not wound- up about it. I would prefer to have smexy clamshell fairings, but it won\u0027t break my game experience if I don\u0027t get it. I don\u0027t consider caring about it a medical condition.\n\nBest,\n\n-Slashy"},{"CreatedByName":"GusTurbo","CreatedById":57552,"CreatedDateTime":"2015-04-18T18:24:04Z","Content":"\u003E \n\u003E Oh, no, this is EXACTLY how Kerbals would design their fairings. Maximal debris means maximal explosions, which is only the Kerbal way.\n\u003E It\u0027s not how they make any of their other parts. They\u0027re clearly very sophisticated. Look at the Mk3 cargo bay, for example.\n\u003E \n\u003E \n\u003E \u003E \n\u003E \u003E I know it matters to some people, and I\u0027m not going to belittle that at all. That said and just speaking for myself, I think that if I ever found myself caring what fairings looked like after they separated, I\u0027d probably make an appointment with a doctor to either get the part that cares about it cut out or get some kind of medication to treat it.\n\u003E \n\u003E \n\u003E There is no need to be rude. Real life fairing separation looks cool, and it would be a missed opportunity if we were unable to recreate that in KSP.\n\n**Edited \u003Ctime datetime=\u00222015-04-18T18:26:21Z\u0022 title=\u002204/18/2015 06:26  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 18, 2015\u003C/time\u003E by GusTurbo**"},{"CreatedByName":"Frybert","CreatedById":97766,"CreatedDateTime":"2015-04-18T18:26:52Z","Content":"Hmmm...should make my Kessler syndrome attempts much easier."},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2015-04-18T18:37:34Z","Content":"It is my guess that the photo presented is simply a glamour shot showing the different pieces. (FASA and NovaPunch fairings separate as shown in the pic) It is my understanding that the fairings are semi-procedural in that they can be shaped with the Mouse, meaning if you would like fairing halves then you would have only two pieces. But if you want more sections they would decouple as shown.\n\nFrom the [4-11 Squadcast](https://forum.kerbalspaceprogram.com/threads/115316-Squadcast-Summary-%282015-04-11%29-Arrangement-Of-S-H-I-E-L-Ds-Edition!) (Curtesy of ObsessedWithKSP)\n\n\u003E \n\u003E The way you build them is with your mouse - click on fairing base, it follows the mouse around. Click to make an \u0027anchor\u0027, move the mouse to somewhere else, click again to anchor again etc.It\u0027s like join the dots, but you decide on where the dots are. But wait, weren\u0027t the fairings parts? How can I fiddle with the insides after the fairings are set?"},{"CreatedByName":"Majorjim!","CreatedById":61954,"CreatedDateTime":"2015-04-18T18:38:19Z","Content":"I just had a thought. I don\u0027t know if someone has mentioned this before but the nose cone comes off as a separate part too.."},{"CreatedByName":"ImJake","CreatedById":100029,"CreatedDateTime":"2015-04-18T18:45:31Z","Content":"In the grand-scheme of things how fairings separate isn\u0027t important, though clamshell\u003Econfetti. If I\u0027ve learned anything from the barn and round8 is that if the community complains enough about something, SQUAD will fix it. So (respectfully) voice your opinions and hope for the best."},{"CreatedByName":"Hanuman","CreatedById":116709,"CreatedDateTime":"2015-04-18T18:46:05Z","Content":"\u003E There is no need to be rude. Real life fairing separation looks cool, and it would be a missed opportunity if we were unable to recreate that in KSP.\n\nOh, I\u0027m not being rude, man. I know this kind of thing matters to some people, and that\u0027s great. People are all different, after all. I\u0027m just putting my perspective out there is all. If it matters to people, and matters to enough people to then make it matter to SQUAD, then yeah, they should see if they can change it.\n\nMe? I don\u0027t care if it\u0027s 2 pieces or confetti or what, and just can\u0027t imagine a scenario in which it WOULD matter to me."},{"CreatedByName":"lucretius","CreatedById":134445,"CreatedDateTime":"2015-04-18T19:00:56Z","Content":"\u003E \n\u003E Oh, I\u0027m not being rude, man. I know this kind of thing matters to some people, and that\u0027s great. People are all different, after all. I\u0027m just putting my perspective out there is all. If it matters to people, and matters to enough people to then make it matter to SQUAD, then yeah, they should see if they can change it.\n\u003E Me? I don\u0027t care if it\u0027s 2 pieces or confetti or what, and just can\u0027t imagine a scenario in which it WOULD matter to me.\n\nI think most people agree a normal realistic fairing is the way to go... obviously a silly fairing isnt going to compromise the entire game but thats not an argument to not correct things. Also its a fairly simple change. hence fairly easy to get right so no reason not to."},{"CreatedByName":"Rocketfeline","CreatedById":137938,"CreatedDateTime":"2015-04-18T19:10:21Z","Content":"Fairings was one of the things that made me very hyped. Because now I don\u0027t need to see the ugly probe I slapped onto a lifter. But the thing that got my attention was fairing\u002Bheat shield. Or different textured fairings too. Plus I can strap a kerbal to a fairing to be ejected with the fairing into space ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)."},{"CreatedByName":"Daze","CreatedById":57997,"CreatedDateTime":"2015-04-18T19:33:23Z","Content":"\u003E \n\u003E I just had a thought. I don\u0027t know if someone has mentioned this before but the nose cone comes off as a separate part too..\n\nJesus... This is the worst part"},{"CreatedByName":"Seshins","CreatedById":71258,"CreatedDateTime":"2015-04-18T19:38:47Z","Content":"I admit i cringed a bit when i saw the seperation pic - but will reserve judgement until release. If i can at least attached struts to the inside of the fairing pieces to join them up il be content with that."},{"CreatedByName":"SelectHalfling0","CreatedById":105051,"CreatedDateTime":"2015-04-18T19:50:30Z","Content":"I just want to point out that it\u0027s not like squad is one person nor are they insane. If this many people don\u0027t like how they separate in that pic, I\u0027m sure someone from squad brought it up.\n\nEDIT: considering the community saved the lifesaver, they will definitely \u0022fix\u0022 fairing deployment.\n\n**Edited \u003Ctime datetime=\u00222015-04-18T19:54:05Z\u0022 title=\u002204/18/2015 07:54  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 18, 2015\u003C/time\u003E by SelectHalfling0**"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2015-04-18T21:07:58Z","Content":"[YOU CAN ALREADY HAVE CLAM SHELL DEPLOYMENT WITHOUT ANY CHANGES TO THE FAIRING SYSTEM!](https://forum.kerbalspaceprogram.com/threads/115316-Squadcast-Summary-%282015-04-11%29-Arrangement-Of-S-H-I-E-L-Ds-Edition!)"},{"CreatedByName":"Slam_Jones","CreatedById":125101,"CreatedDateTime":"2015-04-18T21:20:48Z","Content":"The heck? Why would I want to initiate Kessler Syndrome every time I make it to orbit?\n\nSeparating to two pieces is perfectly fine, thank you very much..."},{"CreatedByName":"AbhChallenger","CreatedById":106911,"CreatedDateTime":"2015-04-18T21:24:42Z","Content":"First and foremost. KSP is a game. And guess what? Traditional fairing separation is BORING compared to the confetti. So in the remote chance that you can\u0027t make traditional fairings. Just install the mod. It is well maintained. (And please don\u0027t bellyache about ram. If that small a mod is what breaks the camels back. Your KSP is likely already crashing from the slightest leak)\n\nSQUAD needs to focus on bug fixing whatever the experimental team finds. So they can get 1.0 out and (hopefully) start porting to Unity 5 for 1.1 not redesign the fairing system because people can\u0027t stand anything else being game vs realistic.\n\n\u003E \n\u003E The heck? Why would I want to initiate Kessler Syndrome every time I make it to orbit?\n\u003E Separating to two pieces is perfectly fine, thank you very much...\n\nWhy are you separating in orbit? Separation happens when the drag is no longer a significant factor at altitude. Not in orbit where they are nothing but wasted mass.\n\n**Edited \u003Ctime datetime=\u00222015-04-18T21:27:07Z\u0022 title=\u002204/18/2015 09:27  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 18, 2015\u003C/time\u003E by AbhChallenger**\n  \nadd quote"},{"CreatedByName":"Technical Ben","CreatedById":10512,"CreatedDateTime":"2015-04-18T21:28:38Z","Content":"\u003E \n\u003E Hmm, really? Where did you hear this?\n\nIf true, it\u0027s best for us not to get angry. A lot of work went into these. If there is a problem on release, then make bridges, not flamethrowers. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nPS, as others have posted above. This is AWESOME. The fairings also allow interstages (which I was wondering about especially for inline storage options instead of ejection fairings). So Squad has a really good head and does clever things... they are however human, and we are all different and even make mistakes on occasion.\n\n**Edited \u003Ctime datetime=\u00222015-04-18T21:32:44Z\u0022 title=\u002204/18/2015 09:32  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 18, 2015\u003C/time\u003E by Technical Ben**"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-04-18T21:30:54Z","Content":"\u003E \n\u003E The heck? Why would I want to initiate Kessler Syndrome every time I make it to orbit?\n\u003E Separating to two pieces is perfectly fine, thank you very much...\n\nI believe Ted mentioned the debris from fairing separation is not persistent, i.e. it disappears once it leaves physics range. You might encounter brief Kessler syndrome around the vessel, but you won\u0027t be filling up LKO with it."},{"CreatedByName":"Varsi","CreatedById":120571,"CreatedDateTime":"2015-04-18T21:31:19Z","Content":"\u003E \n\u003E Why are you separating in orbit? Separation happens when the drag is no longer a significant factor at altitude. Not in orbit where they are nothing but wasted mass.\n\nI\u0027ve been wondering the same. Don\u0027t people usually drop fairings while still suborbital?\n\nI don\u0027t want the nose to blow up in a dozen pieces tho. That looks terrible."},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2015-04-18T21:47:48Z","Content":"\u003E \n\u003E I\u0027ve been wondering the same. Don\u0027t people usually drop fairings while still suborbital?\n\u003E I don\u0027t want the nose to blow up in a dozen pieces tho. That looks terrible.\n\nSome people wait till the vessel is orbital to ditch the fairings. The disadvantage is that you\u0027re carrying more mass to orbit (not a lot, but still *some*), and the advantage is that you have *more* control over how the fairings come off because after you\u0027re in orbit, you don\u0027t need to keep thrusting.\n\nDropping these fairings suborbital is going pose some issues because at this point the vessel is not done thrusting into orbit. When you blow these confetti fairings, you\u0027re generating a whole cloud of crap you may have to thrust through. The increased number of discarded fairing parts makes it more likely you will strike one of the fairing parts when you **do** initiate your orbital injection. With a clamshell fairing, you can start a spin and the fairings will fly away in a very predictable way. These confetti fairings are going to decouple in a much less predictable way, making thrusting away later much less comfortable."}]}