{"TopicId":104395,"ForumId":16,"TopicTitle":"Looking for a stable and agile rover","CreatedByName":"Garquill","CreatedById":135651,"CreatedDateTime":"2015-04-18T19:36:45Z","PageNum":1,"Articles":[{"CreatedByName":"Garquill","CreatedById":135651,"CreatedDateTime":"2015-04-18T19:36:45Z","Content":"I completely burned out on this game a couple months ago trying to build a rover that was able to move on the mun without always flipping over. It would always take very lengthy amounts of time to drive between the different sites in the crater I was supposed to visit, and during that time it was always a struggle to not flip over.\n\nI tried the rover provided in the games\u0027 files and a couple of my own, but totally lost patience. Can anyone recommend an effective rover so I can cheat and start liking the game again?"},{"CreatedByName":"Slam_Jones","CreatedById":125101,"CreatedDateTime":"2015-04-18T19:49:17Z","Content":"While there\u0027s no one single rover solution, there are a lot of ideas you can incorporate.\n\nThe biggest factors I\u0027ve come across in regards to stability are thus:\n\nKeep center of mass low, (so it is less likely to barrel-roll on you)\n\nKeep wheels far apart, (the further apart, the more stable (usually))\n\nSlow down for corners and ridges, (shouldn\u0027t have to explain why ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif))\n\nAdd SAS!\n\nI recommend driving in Docking Mode, as that will separate your pitch commands from your \u0022drive forward\u0022 commands. You can even go as far as to change up the key bindings to make it more comfortable.\n\nDon\u0027t get discouraged! It can be difficult, but the rewards are great ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\n![DSm8lzZ.jpg](http://i.imgur.com/DSm8lzZ.jpg)\n\n**Edited \u003Ctime datetime=\u00222015-04-18T19:52:13Z\u0022 title=\u002204/18/2015 07:52  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 18, 2015\u003C/time\u003E by Slam\\_Jones**"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2015-04-18T19:52:21Z","Content":"No matter how well a rover is designed, in low gravity it will flip very easy when driven incorrectly. Here are a few tips to drive safely:\n\n1. Toggle fine control with [Caps Lock]. The orange roll/pitch/yaw markers (bottom left) turn light blue.  \nThis will make your control input less direct. Your wheels will gradually turn instead of instantaneously.\n2. Remap rover control from WASD to IJKL or switch to docking mode.  \nBoth with IJKL and in docking mode you will still have the same control but the reaction wheels won\u0027t interfere. As a bonus with IJKL control you can still use WASD at the same time to counter any unplanned roll with reaction wheels.\n3. Disable brakes on the front wheels.  \nEspecially the TR-2L ruggedized wheels have high traction and can easily flip a rover when braking."},{"CreatedByName":"impyre","CreatedById":116031,"CreatedDateTime":"2015-04-18T20:11:27Z","Content":"I tend to use a rover-hopper with aircraft landing gear and a good roll cage. ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-04-18T20:30:35Z","Content":"\u003E \n\u003E No matter how well a rover is designed, in low gravity it will flip very easy when driven incorrectly. Here are a few tips to drive safely:\n\u003E \n\u003E \n\u003E 1. Toggle fine control with [Caps Lock]. The orange roll/pitch/yaw markers (bottom left) turn light blue.  \n\u003E This will make your control input less direct. Your wheels will gradually turn instead of instantaneously.\n\u003E 2. Remap rover control from WASD to IJKL or switch to docking mode.  \n\u003E Both with IJKL and in docking mode you will still have the same control but the reaction wheels won\u0027t interfere. As a bonus with IJKL control you can still use WASD at the same time to counter any unplanned roll with reaction wheels.\n\u003E 3. Disable brakes on the front wheels.  \n\u003E Especially the TR-2L ruggedized wheels have high traction and can easily flip a rover when braking.\n\nPretty much all of these, especially #2. Just be warned rover steering controls are the same as plane taxiing controls but NOT the same as plane yaw controls. (Taxiing can only be done up to a certain speed, yawing can always be done but is less effective at low speed)\n\nOne other thing you can do is add the ant engines to your rover. If you hit a ridge too fast, you can always fire them up, kill your lateral velocity, and land safely. This is one of the reasons I fought so hard to save the Round8, it\u0027s the perfect little tank for this.\n\n**Edited \u003Ctime datetime=\u00222015-04-18T20:51:40Z\u0022 title=\u002204/18/2015 08:51  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 18, 2015\u003C/time\u003E by Alshain**"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2015-04-19T02:21:08Z","Content":"All rovers are prone to flipping in low grav. All you can do is: \n\n#1. Build low and wide. \n\n![PYDnnj5.png](http://i.imgur.com/PYDnnj5.png)\n\n#2. Use the extra-grippy \u0022ruggedized\u0022 wheels (pictured) (but go easy on their brakes!) \n\n#3. And go slowly."},{"CreatedByName":"Slam_Jones","CreatedById":125101,"CreatedDateTime":"2015-04-19T03:04:34Z","Content":"As others have mentioned go easy on the brakes for the Ruggedized wheels. The best technique (that works for me) is to repeatedly tap the brakes, rather than holding them down."},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-04-19T04:28:46Z","Content":"If your looking for something smaller, you can use the smaller wheels. Just don\u0027t build a giant rover on tiny wheels, all the pictures above look like fairly large rovers. This one works just fine on the Mun. (though I forgot to get a screenshot of it there). Seen here with self-landing deployment ramp. If you are interested I can make the sub-assembly available. EDIT: Added a few pics on the Mun, but it\u0027s parked. Already brought all my Kerbals home for now. Brake light still works though.\n\n[Subassembly (Including lander)](https://www.dropbox.com/s/hd60dpai4dl3pnr/Expedition.craft?dl=0) - Just put it on a rocket, fits in a 2.5m fairing. Always fly it with SAS on, it\u0027s not perfectly balance, but it\u0027s close. For final landing, there is a probe on the bottom of the platform you can control from, however this probe is not adequate for controlling the rocket as it is at 90 degrees. You may want to have the brakes on before you decouple the rover.\n\n\u003E \n\u003E ![7E8D4A1CB3C9803975759E9524B6A153DDFF505E](http://cloud-4.steamusercontent.com/ugc/39746859838340953/7E8D4A1CB3C9803975759E9524B6A153DDFF505E/)\n\u003E \n\u003E ![E4F5412AB73F1EF59A750A0D284287302B5B297E](http://cloud-4.steamusercontent.com/ugc/39746859838341091/E4F5412AB73F1EF59A750A0D284287302B5B297E/)\n\u003E \n\u003E ![63BDAD0C2FB7019BC765557E454889F71FCC9C91](http://cloud-4.steamusercontent.com/ugc/39746859838369470/63BDAD0C2FB7019BC765557E454889F71FCC9C91/)\n\u003E \n\u003E ![C8DBB47C214251D2894ADD9E48CB1C766DF256A6](http://cloud-4.steamusercontent.com/ugc/39746859838369620/C8DBB47C214251D2894ADD9E48CB1C766DF256A6/)\n\u003E \n\u003E \n\n**Edited \u003Ctime datetime=\u00222015-04-19T04:55:54Z\u0022 title=\u002204/19/2015 04:55  AM\u0022 data-short=\u00229 yr\u0022\u003EApril 19, 2015\u003C/time\u003E by Alshain**"},{"CreatedByName":"Hodo","CreatedById":78218,"CreatedDateTime":"2015-04-19T05:04:06Z","Content":"I can do more than suggest one. I can show you where you can download one if you have the mods, I could even repost it without the one mod part on it.\n\n[LSR-1 Rover](http://kerbalx.com/Hodo/LSR-1)\n\n![FvtGVZJ.jpg](http://i.imgur.com/FvtGVZJ.jpg)\n\n![5iykd0e.jpg](http://i.imgur.com/5iykd0e.jpg)"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2015-04-19T05:29:22Z","Content":"1) Build a nuke-powered spaceplane (one nuke and two RAPIERs works nicely) with a landing gear setup that makes it hard to clip the wings or tail on rough ground.\n\n2) Add some tiny radial engines or Vernors for low-G VTOL.\n\n3) Fly to the Mun.\n\n4) Cruise all over the place on your landing gear with occasional puffs of nuke thrust."},{"CreatedByName":"UnusualAttitude","CreatedById":129962,"CreatedDateTime":"2015-04-19T18:53:47Z","Content":"Wanderfound, he\u0027ll never change... ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\nWhile I wouldn\u0027t go as far as recommending using a spaceplane as a rover, I also think the Mk2 spaceplane parts make good rover bodies, allowing you to keep that centre of mass low...\n\n![aAhHQw0.png](http://i.imgur.com/aAhHQw0.png)\n\n...and include passenger facilities and a utility bay to hide batteries, science equipment and accessories.\n\n![B3w4iu0.png](http://i.imgur.com/B3w4iu0.png)"},{"CreatedByName":"LordFerret","CreatedById":111598,"CreatedDateTime":"2015-04-20T05:22:14Z","Content":"For Sale: Seats 3 (or) runs autonomous, fast battery recharge, dual ladders (but not really needed), has fore / aft / starboard / port O-10 monopropellant engines to help climb hills or slow decent down hills and/or (if you\u0027re quick enough) help prevent it from flipping/rolling over ... just in case you didn\u0027t see that crater rim in front of you. Also has two sets of headlamps, complete science package (with lighting), com antenna, and an LV-N lander complex with mobile science lab. Best offer. .......... (just kidding ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif) )\n\n![icpArNl.png](http://i.imgur.com/icpArNl.png)\n\n*Edit:*\n\nActually, that\u0027s last year\u0027s model shown ... I don\u0027t have a picture of the current version. (oops)\n\n**Edited \u003Ctime datetime=\u00222015-04-20T05:25:15Z\u0022 title=\u002204/20/2015 05:25  AM\u0022 data-short=\u00229 yr\u0022\u003EApril 20, 2015\u003C/time\u003E by LordFerret**\n  \nforgot something"},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2015-04-20T10:10:57Z","Content":"If you\u0027re having problems with rover stability, there\u0027s two easy solutions that\u0027ll let you build basically anything with wheels and drive it ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\na) map the rover keys off WASD so you\u0027re not telling it to roll itself with torque, when you meant to turn left.\n\n![B)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png) drive in docking mode, with SAS on. This will mean SAS actively tries to keep your rover level. This for example is completely stable, because it has enough torque to turn itself over on Kerbin, and therefore *cannot* be flipped as long as it has power.\n\n![YtVPecl.jpg](http://i.imgur.com/YtVPecl.jpg)\n\n- - - Updated - - -\n\n\u003E \n\u003E 4) Cruise all over the place on your landing gear with occasional puffs of nuke thrust.\n\nI\u0027ve started doing this now, it\u0027s so much more fuel efficient than hopping between biomes ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif) Though admittedly mine do occasionally take off and have to be carefully guided back down again xD"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-04-20T10:40:28Z","Content":"Eddiew, your rover is very nice. You should have made it 6 wheeled to look even more insect-like ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2015-04-20T13:47:14Z","Content":"Will add one thing, keep your weight down, heavier rovers is far more likely to take damage. \n\nMy favorite design for fast rovers is three structural panels, small octagonal struts in corners and then wheels, small reaction wheel and probe core at center, this is also where you put docking port or skycrane decopler. Kerbals in front, science at back."},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2015-04-21T10:54:20Z","Content":"\u003E \n\u003E Eddiew, your rover is very nice. You should have made it 6 wheeled to look even more insect-like ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\nThank you ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif) Six wheels is an option, but it overlaps at the attachment points and looks weird. The wheelbase is actually shorter than it is wide - but naturally this doesn\u0027t matter when your SAS is preventing flipping (rather than inducing it) ^^ The only down side to driving in docking mode is that you can\u0027t turn with SAS enabled, because it\u0027ll go into sideways translation mode... but careful choice of ground makes it safe to slow down and toggle it off while you make your adjustment.\n\nNot really a driving style for those who prefer manoeuvrable rally racer, but very effective when you\u0027re on basic wheels and need to cover 5km to the next waypoint. Totally safe to 4x timewarp this little guy, for an effective 40m/s. 80 if you\u0027re willing to risk punctures ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)\n\n![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\n\u003E ![Tl21rUP.jpg](http://i.imgur.com/Tl21rUP.jpg)\n\n\u003E  - this one has two battery packs and one small reaction wheel; plenty to ensure that the kerbals never hit the floor even under aggressive braking. Unless you drive off a cliff and stun them on landing. Which I did. Fortunately, using the probe core to turn the rover back over shook them loose from their seats and they woke up again!"}]}