{"TopicId":104496,"ForumId":16,"TopicTitle":"What are some tips and tricks?","CreatedByName":"Nick7892","CreatedById":100672,"CreatedDateTime":"2015-04-20T06:31:54Z","PageNum":1,"Articles":[{"CreatedByName":"Nick7892","CreatedById":100672,"CreatedDateTime":"2015-04-20T06:31:54Z","Content":"\n\u003Cp\u003EI haven\u0027t really played since 0.22 and would like some tips and tricks for the newer versions!\u003C/p\u003E\n"},{"CreatedByName":"Xannari Ferrows","CreatedById":125369,"CreatedDateTime":"2015-04-20T07:14:19Z","Content":"\n\u003Cp\u003EExactly what kind of tips are you looking for? Construction, ascension, space travel, landing, maneuvering, or rendezvousing?\u003C/p\u003E\n"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-04-20T07:28:41Z","Content":"\n\u003Cp\u003EFuther more, 1.0 will change many things. Best to wait few days.\u003C/p\u003E\n"},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2015-04-20T10:05:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Warzouz\u0022 data-cite=\u0022Warzouz\u0022\u003E\u003Cdiv\u003EFuther more, 1.0 will change many things. Best to wait few days.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAFAIK there\u0027s been no word on a 1.0 release date, so if the OP feels like KSP \u003Cem\u003Enow\u003C/em\u003E, then I\u0027d say it\u0027s a fair call to start. For all we know, 1.0 won\u0027t hit until June/July \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E That said, it may make sense just to have a simple career game, rather than mod it to the max and go for a 6 month campaign.\u003C/p\u003E\u003Cp\u003EA few suggestions for newcomers to 0.90:\u003C/p\u003E\u003Cp\u003E- You can only take two missions at once; be careful which you choose initially. \u003C/p\u003E\u003Cp\u003E- Don\u0027t blow past all the height record missions at once. Take some fuel out of your early ships so you can get the rewards for 10, 25, and 50km in sequence. If your first shot breaks the atmosphere, you\u0027ve lost your chance at the later runs.\u003C/p\u003E\u003Cp\u003E- Prioritise upgrading your mission control, and tracking station to tier 2. This will give you the ability to take more missions at once (more profit!) and make manoeuvre nodes. Munlandings are practical with tier 1, but anything beyond is risky.\u003C/p\u003E\u003Cp\u003E- Beware of the MK3 parts. The joints are weak, and the wings/wheels/engines currently available aren\u0027t big enough for them. \u003C/p\u003E\u003Cp\u003E- SAS doesn\u0027t work without a pilot kerbal, or a probe that specifically says it has SAS (the Stayputnik does not!), so your early missions will probably have to be manned and flown by Jeb, or some other pilot you hire. Bill and Bob tend not to get a look in until you have multi-man capsules.\u003C/p\u003E\u003Cp\u003E- Remember you can\u0027t EVA or take surface samples until you upgrade your astronaut complex. See tooltips in KSC for details of how to unlock these features.\u003C/p\u003E\n"},{"CreatedByName":"Hcube","CreatedById":137241,"CreatedDateTime":"2015-04-20T10:54:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022eddiew\u0022 data-cite=\u0022eddiew\u0022\u003E\u003Cdiv\u003EAFAIK there\u0027s been no word on a 1.0 release date, so if the OP feels like KSP \u003Cem\u003Enow\u003C/em\u003E, then I\u0027d say it\u0027s a fair call to start. For all we know, 1.0 won\u0027t hit until June/July \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow in the world can you be unaware of the Kerbal Countdown ??? SQUAD is releasing daily riddles wich answer correspond to a countdown (check the thread, squadÃ‚Â´s twitter, reddit, or anything) wich is very likely to correspond to the release ! \u003C/p\u003E\u003Cp\u003EI\u0027d say we are very close to release, and itÃ‚Â´s worth waiting for 1.0 by now\u003C/p\u003E\u003Cp\u003E(just my opinion here, i might be wrong)\u003C/p\u003E\n"},{"CreatedByName":"Eric S","CreatedById":57117,"CreatedDateTime":"2015-04-20T18:15:25Z","Content":"\n\u003Cp\u003EI suspect that the countdown is to the release, but I\u0027m far from certain. This weekend will tell the tale. If we don\u0027t start seeing streamers showing 1.0 features by this weekend, then the countdown probably isn\u0027t for the release. It\u0027s possible that they may hold off lifting the media embargo until it actually releases, but that would be a deviation from their normal release process.\u003C/p\u003E\n"}]}