{"TopicId":104506,"ForumId":16,"TopicTitle":"Behavior of the Navball Under Thrust","CreatedByName":"SCCBrear","CreatedById":132053,"CreatedDateTime":"2015-04-20T11:24:22Z","PageNum":1,"Articles":[{"CreatedByName":"SCCBrear","CreatedById":132053,"CreatedDateTime":"2015-04-20T11:24:22Z","Content":"\n\u003Cp\u003EOK, REALLY new to the game, still working through the tuts. In Orbit 101 when thrusting the navball would move away from where you put it, but I managed to complete the objectives assigned to me, so I assumed that this was normal behavior and everything was working right. Onto the Mun part 1 and I set out the maneuver node correctly, I align the navball with the marker correctly and fire up the engines and the navball starts spinning again, I think nothing of this, until I notice that my apoapsis is going down.\u003C/p\u003E\u003Cp\u003ESo did I do something wrong, do I need to keep the navball aligned or what?\u003C/p\u003E\n"},{"CreatedByName":"Reactordrone","CreatedById":110060,"CreatedDateTime":"2015-04-20T11:41:28Z","Content":"\n\u003Cp\u003EDo you have SAS engaged? The ship won\u0027t hold a stable heading and will need to be flown constantly to keep it aligned if you don\u0027t. The only other thing I can think of is if you align to prograde early and then complete part of an orbit the heading will change, go around half an orbit and you\u0027ll be pointing retrograde.\u003C/p\u003E\n"},{"CreatedByName":"Feradose","CreatedById":111211,"CreatedDateTime":"2015-04-20T11:50:24Z","Content":"\n\u003Cp\u003EThrusting moves the navball away?\u003C/p\u003E\u003Cp\u003Edo you mean prograde or retrograde icon or maybe manuever node icon which is blue?\u003C/p\u003E\u003Cp\u003EIts common for manuever node icon to move, just you follow it, unless it requires \u0026gt;0,1 m/s, then you might want to ignore it and delete the nodr for a tiny bit of inaccuracy\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2015-04-20T12:54:13Z","Content":"\n\u003Cp\u003EYou may be executing a maneuver too early. Just because you put a maneuver down doesn\u0027t mean you can execute it right away. You need to look at the time to maneuver node next to the navball. If that is about half of the burn time you can execute the maneuver, if it\u0027s not you need to wait.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-04-21T00:46:01Z","Content":"\n\u003Cp\u003EHard to say without seeing a pic of your ship, but it might also be that you have too much reaction wheel steering your ship. Try pressing caps lock for finer control and see if that helps.\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2015-04-21T00:50:29Z","Content":"\n\u003Cp\u003EA few other questions, to help us diagnose what\u0027s actually going on:\u003C/p\u003E\u003Cp\u003E1. When are you actually burning for the maneuver? With some longer burns, it\u0027s actually slightly more accurate to start burning before the countdown fully counts down, as the maneuver node planner assumes instantaneous thrust at that particular point.\u003C/p\u003E\u003Cp\u003E2. Which marker are you pointing at when you execute the burn?\u003C/p\u003E\n"}]}