{"TopicId":104768,"ForumId":32,"TopicTitle":"What was your learning wall?","CreatedByName":"Endersmens","CreatedById":80723,"CreatedDateTime":"2015-04-23T17:02:45Z","PageNum":3,"Articles":[{"CreatedByName":"windows_x_seven","CreatedById":112926,"CreatedDateTime":"2015-04-23T20:28:00Z","Content":"THE BEGINNING\n\nGetting to orbit. ..........................|\n\nCircularizing properly. ..................|\n\nPowered descent. .......................|\n\nEfficient craft designing. ...............|\n\nRendezvous. ..............................|\n\nDocking. ....................................|\n\nInterplanetary. ...........................|\n\nLaunching to rendezvous. (current) V\n\nTODAY"},{"CreatedByName":"Slam_Jones","CreatedById":125101,"CreatedDateTime":"2015-04-23T20:29:15Z","Content":"My first \u0022wall,\u0022 I think, was learning rendezvous and docking. I buckled down and practiced it a fair bit, and now I can dock (usually) without the aid of RCS.\n\nAfter that, I think it was precision vacuum-body landings (putting modules down right next to each other). Same deal: practiced a bunch, now I can drop them basically right on top of each other.\n\nThe last \u0022wall\u0022 I hit was precision de-orbiting on atmospheric bodies. Again, some practice done and now I can land (reasonably close to) KSC on (most) de-orbits."},{"CreatedByName":"MisterDoubleSevens","CreatedById":119193,"CreatedDateTime":"2015-04-23T20:30:36Z","Content":"My first great challenge was landing.\n\nThen it was spaceplanes.\n\nNaturally, this brought up the problem of landing planes, both space and regular.\n\nThen it was NEAR, FAR\u0027s little brother.\n\nNow? It\u0027s figuring out multi-purpose craft (example: sending a Kerbal to Minmus and back while leaving a probe/rover behind using only one launch)."},{"CreatedByName":"EladDv","CreatedById":118368,"CreatedDateTime":"2015-04-23T20:30:40Z","Content":"i never used interplanetary phases and transfer windows i just got into a close enough orbit and wait. rendezvous was hard and so was docking. but now that i know how to do it all i am a \u0022pro\u0022. the new aero might be a wall with my plane design.....still i will probably wont use transfer windows"},{"CreatedByName":"Deutherius","CreatedById":125381,"CreatedDateTime":"2015-04-23T20:38:39Z","Content":"That is hard to answer without getting biased. Right now, most of the stuff seems trivial and natural - rockets, spaceplanes, SSTOs, rendezvous, docking, transfers, gravity assists\\*, precision landings, you name it. But I knew a complete jack about orbital mechanics or rocketry when I started playing KSP, so EVERYTHING was new and hard. It was like learning how to waddle, then walk, run, jump... I\u0027m pretty sure there wasn\u0027t a learning wall, there were several of them - it was more like learning stairs. The game itself is not hard to play once you know what you are doing, but figuring out exactly what to do for a complete newbie to the field is *very* hard. I feel no shame in admitting that most of my KSP journey was babysitted by various tutorials from people who have figured the stuff out before me.\n\nAnd I have no doubt that there is going to be a lot to learn in the future (especially new aerodynamics and re entry shock heating with 1.0, I have very little experience with FAR/NEAR and DR).\n\n\\*I still need a calculator when going for multiple slingshots, and that is probably never going to change"},{"CreatedByName":"wolfedg","CreatedById":58442,"CreatedDateTime":"2015-04-23T20:38:52Z","Content":"Spaceplanes that make it to orbit, spaceplanes that can re-enter without tumbling to death, spaceplanes that make it to orbit with a payload or enough fuel to do anything, and docking without using up all my rcs or accidentally activating my main engine. All of the are issues I still struggle with."},{"CreatedByName":"Speijker","CreatedById":31566,"CreatedDateTime":"2015-04-23T20:47:39Z","Content":"It took a long time to get interplanetary launch windows in stock down.\n\nI used to just burn into kerbol orbit, and then do a transfer: getting a launch window about halved my fuel needs, and Duna and Eve are easily reached now.\n\nLearning how to do this is not the wall mind; it\u0027s finding out things like launch windows exist in the first place (thanks, random forum poster!).\n\nI\u0027m still having trouble finding launch windows for planets not in the same plane as Kerbin though (I know mods help in this regard, but I like playing without any). If somebody\u0027s got an easy trick for it, that\u0027d be awesome.\n\nEdit: thinking about it, the hardest thing to learn was landing on the MÃƒÂ¼n. Before there was landing gear. Or a map view which predicted intersects. . .\n\nFound the\n\n\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/bGd_BFu9e10?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\n (note Minmus wasn\u0027t even discovered yet).\n\n**Edited \u003Ctime datetime=\u00222015-04-23T21:08:14Z\u0022 title=\u002204/23/2015 09:08  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 23, 2015\u003C/time\u003E by Speijker**"},{"CreatedByName":"SelectHalfling0","CreatedById":105051,"CreatedDateTime":"2015-04-23T20:47:56Z","Content":"I actually figured out how to orbit on my own after a few hours. As time went on, I figured out the best way to reach orbit. My learning wall was docking (I used mechjeb for docking, and eventually tried it on my own).\n\nNow I can launch at the right time to reach my apoapsis only 1 kilometer from my destination."},{"CreatedByName":"Bandock","CreatedById":28934,"CreatedDateTime":"2015-04-23T20:55:48Z","Content":"\u003E \n\u003E That\u0027s what uncrewed fuel tankers are for!\n\u003E Seriously though, that\u0027s one of the things I love about KSP. If something goes wrong on a mission, it isn\u0027t game over--it\u0027s inspiration for the next mission!\n\nI completely forgot about bringing fuel tankers. It could be because I rarely used them before as most of my missions were done in one shot (with the exception of anything that deals with space station construction, rendezvous for Apollo-styled missions, or rescue missions)."},{"CreatedByName":"zarakon","CreatedById":5160,"CreatedDateTime":"2015-04-23T20:56:26Z","Content":"I never really had to overcome any **walls**. There were a lot of things that I didn\u0027t get on the first try, or wasn\u0027t very good at, but nothing that really frustrated me for any long period of time. My biggest obstacle is just a lack of *motivation* to do really large or complex missions."},{"CreatedByName":"Fel","CreatedById":57121,"CreatedDateTime":"2015-04-23T21:10:29Z","Content":"I\u0027ve never really understood the *idea* of \u0022learning curve\u0022...\n\nI remember one of the first times I asked for help, I specifically told everyone that I do not want spoilers. The problem was something about stabalizing a launcher I had designed, I think the launcher was 1000T designed to bring 90T to LKO but whatever. I didn\u0027t want people telling me how to redesign my launcher, I didn\u0027t want people telling me to turn it into asparagus because that\u0027s what all the cool people do... I just wanted hints at what I could do to stop it from blowing up before I even launch it.\n\nMost people complained, it isn\u0027t the type of request that is common and I knew it wouldn\u0027t be. But there were those who gave advice that proved very useful and I took my rocket apart, redesigned, cut down the part count and spacetape... and managed to get it to launch. The cargo? A fuel tank I edited to weigh 90T. I hadn\u0027t even left the system yet, I hadn\u0027t even set up a moonbase, an orbiting space station... I just wanted to challenge myself and work through a problem.\n\nNow, I think the problem is that people don\u0027t work through small problems before going out to bigger ones... the \u0022boring stuff\u0022 isn\u0027t boring. You cannot set sail for jool until you\u0027ve managed your first orbit; and even if you want your first ship to reach jool, you\u0027re STILL going to need to manage your first orbit. You\u0027ll have more fun working up to a problem and find only a learning slump, than putting the hardest problem on your plate. Heck, my launcher was a learning problem in stabilization; the design was based off of the Saturn V; (mass ratios, thrust ratios, length ratios, fuel, etc); I only had the small goal to get it to launch; I later adjusted it a bit to get it to go to orbit.\n\nBut the point is, the experience I gained over a small goal; mimic the Saturn V launcher, has given me experience that I can use to explore the universe. People who haven\u0027t even attempted the problem before hit \u0022the wall\u0022 instead of \u0022the hump\u0022. Even my initial attempts weren\u0027t just falling down and exploding (well... it was complicated. First I had to prevent it from exploding when physics initialized, then I had to prevent it from exploding as physics propagated to the top; and some in between. ); I didn\u0027t go into this blind... I just had a problem that a small nudge made better.\n\nIn short, going slow = learning slump not learning wall.\n\n**Edited \u003Ctime datetime=\u00222015-04-23T21:23:45Z\u0022 title=\u002204/23/2015 09:23  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 23, 2015\u003C/time\u003E by Fel**"},{"CreatedByName":"Threadsinger","CreatedById":100886,"CreatedDateTime":"2015-04-23T21:21:07Z","Content":"While everything was a new experience, the three challenges I remember requiring a lot more effort were:\n\n1. Getting a rocket into space without having to strain my fingers while in atmo - I didn\u0027t know about RCS, or SAS, or even the effects of wing stubs, and boy would my hands get stressed trying to control the drift on those early, KSP-naive rocket designs of mine\n\n2. Designing and landing a craft onto Mun (even one way - often did not have enough fuel to make a safe landing, and I didn\u0027t use a dV calculator back then, and I had a hard time estimating braking times versus distance remaining... clipped many a mountain on the way down)\n\n3. Docking. \u0027Nuff said. \n\nThere\u0027s certainly some things I haven\u0027t done yet, like landing and taking off from Eve (using stock parts), building a grand tour ship, or rescuing Bob from a polar, solar orbit, but I\u0027ll get there."},{"CreatedByName":"Yakky","CreatedById":94432,"CreatedDateTime":"2015-04-23T21:21:08Z","Content":"My learning wall, which I still haven\u0027t fully overcome, is to learn how to design spacecraft with enough margin for error to allow them to survive imperfectly executed missions. I always err too much on the side of weight/cost savings and performance efficiency and invariably don\u0027t build in enough redundancy or robustness because that $h1t costs mass and money. I assume the mission is going to go exactly as planned, which of course it never does.\n\nA few examples and their consequences:\n\n**Mistake:** Trying to save money by using uncontrollable solid rocket boosters when I should be using liquids.\n\n**Result:** Dead Kerbals\n\n**Mistake:** Not attaching a parachute directly to the friggin\u0027 capsule because hey, I have chutes on other nearby parts and what are the chances that a rapid unplanned disassembly event actually happens on this mission?\n\n**Result:** Dead Kerbals\n\n**Mistake:** Not putting stabilizing fins on my booster stages because fins are expensive and I\u0027m absolutely certain I\u0027m going to fly that gravity turn trajectory so well that there\u0027s *no chance* it will tumble head-over-teakettle in the high dynamic loadings of the max-Q regime\\*\n\n**Result:** Dead Kerbals\n\n\\* I play with FAR/DRE\n\n**Mistake:** Not enough struts because I\u0027m pretty sure it\u0027s strong enough as-is\n\n**Result:** Dead Kerbals\n\n**Mistake:** Flying a mission with a scientist instead of a pilot to rack up more science points, even though it means I won\u0027t have SAS\n\n**Result:** Dead Kerbals\n\n**Mistake:** Using a too-low TWR engine for my final orbital insertion stage because I\u0027m already going to be mostly horizontal and really fast by then anyway, and a bigger engine is heavy\n\n**Result:** Dead Kerbals\n\n**Mistake:** Scrimping on Separatrons when using strap-on side boosters because this time I\u0027m pretty sure I\u0027ll be mostly out of the atmosphere by the time they separate and so there\u0027s not really much risk of them hitting the center stage and destroying the engine, is there?\n\n**Result:** Dead Kerbals\n\n**Mistake:** Not bothering to insert a stage separator between the final stage and the capsule, because I might as well recover that last engine after re-entry to recoup some funds, and I *think* the combined parts will probably still re-enter tail first and not overheat and explode.\n\n**Result:** Dead Kerbals\n\n**Mistake:** Getting greedy by trying to grab one last EVA Report in the upper atmosphere just after we\u0027ve started re-entry\n\n**Result:** Dead Kerbals\n\n**Mistake:** Cutting out the launch clamps to stay below the 30-part limit early in the game\n\n**Result:** Dead Kerbals\n\n**Mistake:** Using the LTV-30 engine instead of the LTV-45 because it\u0027s higher performance and I think the capsule torque stabilization should be enough\n\n**Result:** Dead Kerbals\n\n**Mistake:** Building elaborately wacky designs to try to achieve things that are probably not achievable with the weight, size, and part limitations I have\\*\n\n**Result:** Dead Kerbals\n\n\\* in my mind I hear Scott Manley saying, \u0022aye, what a clever design for such a wee rocket\u0022\n\n**Mistake:** Not bothering with extra batteries on my probe missions because I\u0027ll remember to shut down the probe\u0027s battery when not in use\n\n**Result:** Dead Probes\n\nFootnote: It is also true that even though my learning wall is aggravating, it\u0027s also part of what I absolutely love about KSP. Sometimes I *do* get away with these things even though I shouldn\u0027t, and that can be pretty exciting.\n\n**Edited \u003Ctime datetime=\u00222015-04-23T21:37:49Z\u0022 title=\u002204/23/2015 09:37  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 23, 2015\u003C/time\u003E by Yakky**"},{"CreatedByName":"Loligoat","CreatedById":99368,"CreatedDateTime":"2015-04-23T21:30:50Z","Content":"My biggest problem was never having enough fuel. I could never find the balance of just enough fuel for the least weight. I eventually got good at it, though. I couldn\u0027t possibly say how many kerbals I had to rescue of the Mun when I did eventually figure it out."},{"CreatedByName":"Hcube","CreatedById":137241,"CreatedDateTime":"2015-04-23T21:38:07Z","Content":"Maneuver nodes and navball simbols seemed very complicated to me for some time. After my first rendez-vous and docking though, it all became crystal-clear ! \n\nOne thing I still cannot figure out well enough is interplanetary transfer windows. I use a online calculator, but still i can\u0027t get the angle precisely enough from the mission control view...\n\nLast thing : gravity assists : because of the reason stated above, i dont often go to Jool and so i haven\u0027t really experimented with gravity assists with multiple swings around many moons yet. I\u0027m only doing some assists with Mun to go to Minmus..."},{"CreatedByName":"Dman979","CreatedById":123837,"CreatedDateTime":"2015-04-23T22:00:27Z","Content":"First one? Getting stuck in IVA. Second one? Throttling down \u0022to be more efficient\u0022"},{"CreatedByName":"worir4","CreatedById":75980,"CreatedDateTime":"2015-04-23T22:28:29Z","Content":"I came here from Orbiter 2010 So I knew a bit on orbital mechanics but it was here that I learned HOW it worked.\n\nThe most difficult bit for me was building rockets. I used to build really streamlined rockets but then I read on the forums that pancakes taste nicer so I changed. I will be changing back again with 1.0!"},{"CreatedByName":"Endersmens","CreatedById":80723,"CreatedDateTime":"2015-04-23T22:31:51Z","Content":"Wow, this thread took off pretty quickly. Glad to hear your guys\u0027 replies!"},{"CreatedByName":"mikegarrison","CreatedById":137807,"CreatedDateTime":"2015-04-23T22:49:09Z","Content":"\u003E \n\u003E haha, eve return...funny..don\u0027t think I\u0027ll ever get over that one.\n\nEve return isn\u0027t especially hard if you are playing sandbox and you don\u0027t care that your spaceship is unrealistic. The only thing you need is a stage DV calculator like Mech Jeb has. You just keep adding more and more \u0022asparagus\u0022 stages until you have all the DV needed to get to orbit, transfer to Eve, control your landing (aerobraking and parachutes do most of the work), make Eve orbit, and come home.\n\nI hadn\u0027t intended to do more than return to Eve orbit so I didn\u0027t have parachutes on my capsule, but I had left myself enough margin for error that I actually flew back to Kerbin with my final stages and made a safe powered water landing.\n\n(That was with stock aero. Wouldn\u0027t work with a less-soupy atmosphere.)"},{"CreatedByName":"2001kraft","CreatedById":120475,"CreatedDateTime":"2015-04-23T22:51:22Z","Content":"Docking. Docking was my weak spot. The first thing I struggled with was docking. I remember being already quite experienced, I even built a working SSTO. I just couldn\u0027t dock though, just couldn\u0027t. I still do it rather goofily and most of the time miss my target drastically, so let\u0027s just say that I just rammed into that learning wall and I can\u0027t find the door to let me out behind it."},{"CreatedByName":"keeper","CreatedById":124530,"CreatedDateTime":"2015-04-23T23:43:37Z","Content":"There were many test launches trying to get a pod into an orbit, or to dock, then to transfer to mun , landing seems ok on flats, because i couldn\u0027t get my head around inclination, then minmus and rendezvous, and my wall for the last year or so is getting to another planet. \n\nstill forget to add solar panels and batteries on various vessels"},{"CreatedByName":"Srpadget","CreatedById":111267,"CreatedDateTime":"2015-04-24T00:03:29Z","Content":"My biggest \u0027wall\u0027? Violating decades of training and experience, and forcing myself to do what others insisted worked better in the stock soupmosphere: fly STRAIGHT UP for the first 10km and then pitch over HARD to 45 degrees.\n\nFinally bit the bullet, tried it that way, and managed to get to orbit in short order...after, I don\u0027t remember, days? weeks, even? of trying to do a proper NASA-standard gravity turn and failing to attain orbit.\n\nOnce I managed THAT, everything else was pretty straightforward (other than the occasional Kraken encounter, floating-point issue, and docking-port bugs)."},{"CreatedByName":"Commissioner Tadpole","CreatedById":91993,"CreatedDateTime":"2015-04-24T00:06:13Z","Content":"I\u0027ve went through several.\n\n**Learning Wall One:** Managing to make it out of Kerbin\u0027s atmosphere\n\n**Difficulty:** 3/5\n\n**Status:** Overcame it!\n\n**Learning Wall Two:** Managing to make it into Kerbin Orbit\n\n**Difficulty:** 3/5\n\n**Status:** Overcame it!\n\n**Learning Wall Three:** Managing to make it into Kerbin orbit without running out of fuel\n\n**Difficulty:** 4/5\n\n**Status:** Overcame it!\n\n**Learning Wall Four:** Managing to make it to the Mun\n\n**Difficulty:** 4/5\n\n**Status:** Overcame it!\n\n**Learning Wall Five:** Managing to make it to the Mun, circularize orbit, land on it, and return to Kerbin safely\n\n**Difficulty:** 5/5\n\n**Status:** Overcame it!(phew)\n\n**Learning Wall Six:** Manage to make it to Minmus and return\n\n**Difficulty:** 3/5\n\n**Status:** Overcame it!\n\n**Learning Wall Seven:** Go interplanetary\n\n**Difficulty:** 4/5\n\n**Status:** Overcame it!\n\n**Learning Wall Eight:** Rendezvous!\n\n**Difficulty:** 6/5\n\n**Status:** Overcame it!\n\n**Learning Wall Nine:** Dock!\n\n**Difficulty:** 3/5\n\n**Status:** Overcomming it\n\n**Learning Wall Ten:** Control an armada of launches to another stellar body\n\n**Difficulty:** 2/5\n\n**Status:** Overcame it!\n\n**Learning Wall Eleven:** Land within 30km of another vessel\n\n**Difficulty:** 4/5\n\n**Status:** Overcame it!\n\n**Learning Wall Twelve:** Land within 2km of another vessel\n\n**Difficulty:** 7/5\n\n**Status:** Yet to manage this\n\n**Learning Wall Thirteen:** Go to somewhere other than Duna and Eve, you bum\n\n**Difficulty:** 5/5\n\n**Status:** Yet to manage this ![:(](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif)\n\n**Edited \u003Ctime datetime=\u00222015-04-24T00:08:46Z\u0022 title=\u002204/24/2015 12:08  AM\u0022 data-short=\u00229 yr\u0022\u003EApril 24, 2015\u003C/time\u003E by Commissioner Tadpole**"},{"CreatedByName":"Lhathron the Elf","CreatedById":118706,"CreatedDateTime":"2015-04-24T00:09:36Z","Content":"After I finally figured out how to get to the Mun I sort of figured out everything else... I had another small learning wall when I performed my first manual orbital rendezvous."},{"CreatedByName":"LadyAthena","CreatedById":88614,"CreatedDateTime":"2015-04-24T00:09:39Z","Content":"For me it\u0027s 3 things. Been playing 2 yrs about and I still have issues with these. \n\n- Building proper space planes that don\u0027t go full ...... on me at high altitude, or run out of fuel before they should. \n\n- Building rockets with proper Dv that aren\u0027t over kill or under parred. \n\n- Building a rocket that can return from other atmospheric planets (partly due to problem #2 and Dv\u0027s)"}]}