{"TopicId":104861,"ForumId":24,"TopicTitle":"Dawn of a new Er-- User.","CreatedByName":"Suicider","CreatedById":141344,"CreatedDateTime":"2015-04-24T18:10:21Z","PageNum":1,"Articles":[{"CreatedByName":"Suicider","CreatedById":141344,"CreatedDateTime":"2015-04-24T18:10:21Z","Content":"\n\u003Cp\u003EOhaidar. I\u0027ve been lurking around (Oh no another lurker!) since...The rover update? Forgot the version number. There has been several times where i was like, maybe i should do that whole registering thing.... Naaaah. However, seeing that 1.0 is literally right around the corner, figured now would be a good time. \u003C/p\u003E\u003Cp\u003ESo, who am i? Whelp, no one special. I\u0027ve put Rovers on Duna and Eve (Sandbox), a Successful Mun trip and back with very low fuel remaining in Career mode, and that about sums up what major things i\u0027ve done. I spend most of my time in KSP trying to design Spaceplanes which is going to be more interesting with the upcoming update. My other hours spent in game have been 3 attempts to build space stations, All ending with a game update and me de-orbiting them.\u003C/p\u003E\u003Cp\u003ESo i\u0027ll be lurking around, may or may not post something here and there or reply to something, but lurking.\u003C/p\u003E\u003Cp\u003E**Note about my Username** If it offends you in someway, which i can see happening because it has in the past, Please forgive it. I have had this username for ages on other games,websites and of course steam until recently. So please, if it bugs you in someway, ignore or block me if you wish. Acceptable nicknames are Sui and Sui Pig pig (Ha ha. Farm joke..... No? Never mind then)\u003C/p\u003E\u003Cp\u003ESteam username: suicider2012 or search [TV] (Sui) Private Piggingtons\u003C/p\u003E\u003Cp\u003EKSP Hours played as of post: 252\u003C/p\u003E\u003Cp\u003EKSP Steam screenshots: 123\u003C/p\u003E\n"},{"CreatedByName":"Starhawk","CreatedById":131400,"CreatedDateTime":"2015-04-24T18:31:46Z","Content":"\n\u003Cp\u003EWelcome Suicider! Glad to have you aboard.\u003C/p\u003E\u003Cp\u003EIt\u0027s always good to see another lurker step up and become part of the community.\u003C/p\u003E\u003Cp\u003EHappy landings!\u003C/p\u003E\n"},{"CreatedByName":"EtherDragon","CreatedById":82405,"CreatedDateTime":"2015-04-24T18:41:52Z","Content":"\n\u003Cp\u003EWelcome! I would offer you access to the free Snacks, but it sounds like you already know about those.\u003C/p\u003E\n"},{"CreatedByName":"Suicider","CreatedById":141344,"CreatedDateTime":"2015-04-24T19:04:09Z","Content":"\n\u003Cp\u003E-Mouth full of snacks- Wut...\u003C/p\u003E\n"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2015-04-24T23:07:42Z","Content":"\n\u003Cp\u003EHello! Welcome to the forum. Glad to have you with us.\u003C/p\u003E\n"},{"CreatedByName":"RAINCRAFTER","CreatedById":127524,"CreatedDateTime":"2015-04-25T00:02:34Z","Content":"\n\u003Cp\u003EHi Sui. Welcome the forum, we are very helpful here.\u003C/p\u003E\n"}]}