{"TopicId":104856,"ForumId":16,"TopicTitle":"Boosters destroying main engine","CreatedByName":"iStickyDuck","CreatedById":75908,"CreatedDateTime":"2015-04-24T16:28:29Z","PageNum":1,"Articles":[{"CreatedByName":"iStickyDuck","CreatedById":75908,"CreatedDateTime":"2015-04-24T16:28:29Z","Content":"\n\u003Cp\u003EI\u0027ve been playing KSP since .18 and I\u0027ve never had this problem before\u003C/p\u003E\u003Cp\u003ERecently, for every multistage rocket I make, if I have a central rocket in the middle with a couple of boosters attached, when I decouple the boosters the top of them falls into the rocket, destroying it. I\u0027ve tried with and without struts, separatrons, different decouplers, going slower and cutting the engines all together. The only way this doesn\u0027t happen is if my rocket is spinning at a rather sickening speed... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003EHow do I prevent this from happening? Currently any rocket blows up before it gets to space (I still lack the skill to make SSTOs)\u003C/p\u003E\u003Cp\u003EEdit: I think I\u0027ll just wait until Monday \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-04-26T07:10:33Z\u0022 title=\u002204/26/2015 07:10  AM\u0022 data-short=\u00229 yr\u0022\u003EApril 26, 2015\u003C/time\u003E by iStickyDuck\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Randazzo","CreatedById":136468,"CreatedDateTime":"2015-04-24T16:33:59Z","Content":"\n\u003Cp\u003EIt is apparently a known bug. Downloading the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/97285-KSP-v0-90-Stock-Bug-Fix-Modules-(Release-v0-1-7d-28-Feb-15)-Misc-Utilities-(18-Jan-15)\u0022 rel=\u0022external nofollow\u0022\u003EStock Bugfix Modules \u003C/a\u003E(cue the inevitable \u0022I hate people who say download a mod!\u0022) mod will fix it. \u003C/p\u003E\u003Cp\u003EOtherwise you\u0027ll just need to find a separatron setup that works.\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-04-24T16:37:17Z","Content":"\n\u003Cp\u003EIt has been confirmed fixed in 1.0. We all know your frustration, but fortunately in 3 days it won\u0027t be an issue any longer.\u003C/p\u003E\n"},{"CreatedByName":"r_rolo1","CreatedById":26192,"CreatedDateTime":"2015-04-24T16:39:35Z","Content":"\n\u003Cp\u003EAlternatively you can wait for a couple of days, since that bug is said to be fixed in the next version, that comes out Monday\u003C/p\u003E\u003Cp\u003EP.S. My writing-fu is too weak. I was ninja-ed \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"smjjames","CreatedById":134004,"CreatedDateTime":"2015-04-24T16:54:24Z","Content":"\n\u003Cp\u003EPut separatrons on the boosters for now. Maxmaps has said that the radial decoupler bug that causes this is fixed in 1.0.\u003C/p\u003E\u003Cp\u003EAlso, while using the stock bugfix module can help, they can still smack into your rocket.\u003C/p\u003E\n"},{"CreatedByName":"EtherDragon","CreatedById":82405,"CreatedDateTime":"2015-04-24T17:03:46Z","Content":"\n\u003Cp\u003EThe pain, I feels them.\u003C/p\u003E\u003Cp\u003EWe\u0027ve all suffered this same known issue - which is confirmed fixed in 1.0 (due to release on Monday).\u003C/p\u003E\n"},{"CreatedByName":"Slam_Jones","CreatedById":125101,"CreatedDateTime":"2015-04-24T17:45:24Z","Content":"\n\u003Cp\u003EWhat I\u0027ve done is \u003C/p\u003E\u003Cp\u003E-Place Sepratrons on top of the boosters at a 45 degree angle.\u003C/p\u003E\u003Cp\u003E-Drain 90% of Sepratron fuel\u003C/p\u003E\u003Cp\u003EThis will give the top of the booster a kick away from the main engine, but not so much that the bottom strikes it instead.\u003C/p\u003E\u003Cp\u003EOooor wait for 1.0 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"EtherDragon","CreatedById":82405,"CreatedDateTime":"2015-04-24T17:50:03Z","Content":"\n\u003Cp\u003EThis usually occurs mostly when you have your booster separation occur at the same time your main engines are active, too.\u003C/p\u003E\u003Cp\u003EIn the missions where this was a real heavy issue, I cut off the main engine for staging, stage off the boosters, and reactivate main engines when the boosters are clear.\u003C/p\u003E\n"},{"CreatedByName":"smjjames","CreatedById":134004,"CreatedDateTime":"2015-04-24T19:41:00Z","Content":"\n\u003Cp\u003EFor smaller boosters, putting separatrons (or mini-boosters from other mods that perform a similar function) at about the middle of it is usually enough to keep it from colliding with the rocket. For the larger and heavier ones, I put them at the top, bottom, and middle. What I do is place the separatrons facing the rocket, but angle them horizontally so that the booster jet doesn\u0027t hit the rocket tanks.\u003C/p\u003E\n"},{"CreatedByName":"Empiro","CreatedById":112072,"CreatedDateTime":"2015-04-24T19:54:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022EtherDragon\u0022 data-cite=\u0022EtherDragon\u0022\u003E\u003Cdiv\u003EThis usually occurs mostly when you have your booster separation occur at the same time your main engines are active, too.\u003Cp\u003EIn the missions where this was a real heavy issue, I cut off the main engine for staging, stage off the boosters, and reactivate main engines when the boosters are clear.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey still tend to collide with the center core though, but it won\u0027t destroy it because the relative velocities are low. I\u0027m just glad this will be fixed for 1.0.\u003C/p\u003E\n"},{"CreatedByName":"EtherDragon","CreatedById":82405,"CreatedDateTime":"2015-04-24T20:46:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Empiro\u0022 data-cite=\u0022Empiro\u0022\u003E\u003Cdiv\u003EThey still tend to collide with the center core though, but it won\u0027t destroy it because the relative velocities are low. I\u0027m just glad this will be fixed for 1.0.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYea, they still bonk the center stage ungracefully. But, at least the mission could continue.\u003C/p\u003E\n"},{"CreatedByName":"TheXRuler","CreatedById":125517,"CreatedDateTime":"2015-04-24T20:46:42Z","Content":"\n\u003Cp\u003EI usually get a clean seperation only by adding on the top AND bottom of the bosster, then it is only a question of balancing the thrust correctly. Also I often rotate the upper sepatrons upward a little (since the upper part of a booster is lighter than the rest) so the booster is not only being pulled away, but it also falls behind the rest of the rocket a little slower, thereby giving it time to distance itself from the central engine before passing it. Once the thrust has been properly balanced out there is barely anything that can go wrong, at least in my experience.\u003C/p\u003E\n"},{"CreatedByName":"THX1138","CreatedById":113955,"CreatedDateTime":"2015-04-24T21:09:12Z","Content":"\n\u003Cp\u003EYou said you tried seperatrons but are you sure they fired? When I had my seperatrons staged to fire with the decoupling of the boosters, they didn\u0027t fire! I had to stage them separately, to fire before I decoupled the boosters. Shifting items around within a stage might help but I could never get them to move where I wanted within the same stage.\u003C/p\u003E\n"},{"CreatedByName":"mudkest","CreatedById":115812,"CreatedDateTime":"2015-04-24T21:24:34Z","Content":"\n\u003Cp\u003Echeck teh flight log(f3 I think?) to make sure your seperatons are not what is actualy destroying your rocket, have had that happen a couple of times. \u0022mainsail damaged by seperaton exhaust\u0022 or something along those lines. Kept adding \u0022moar boosters\u0022 cause my main tank or engine kept getting destroyed, then I removed them all and I got to orbit \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"TheXRuler","CreatedById":125517,"CreatedDateTime":"2015-04-24T22:37:42Z","Content":"\n\u003Cp\u003Emudkest might be onto something there, the relevant line would be: [your central engine] damaged by engine exhaust from [whatever you use as seperation motors] I think.\u003C/p\u003E\n"},{"CreatedByName":"Green Baron","CreatedById":107381,"CreatedDateTime":"2015-04-25T17:41:39Z","Content":"\n\u003Cp\u003EThat\u0027s funny ... :-)\u003C/p\u003E\u003Cp\u003EI didn\u0027t even realise that this is a bug, Thought that, together with FAR, this happened because of aerodramatic effects. I placed my sepratrons above the boosters center of mass and designed my crafts so that the boosters engine were clear of the center engine during (throttled down) staging.\u003C/p\u003E\u003Cp\u003Ek\u003C/p\u003E\n"}]}