{"TopicId":104961,"ForumId":16,"TopicTitle":"Nuclear engine efficiency","CreatedByName":"ImperialistPigDog","CreatedById":60825,"CreatedDateTime":"2015-04-25T20:47:18Z","PageNum":1,"Articles":[{"CreatedByName":"ImperialistPigDog","CreatedById":60825,"CreatedDateTime":"2015-04-25T20:47:18Z","Content":"\n\u003Cp\u003EWhen you want to make an efficient rocket for interplanetary travel, is it better to have more or less nuclear engines? I have a 121.9 ton ship with 8 nuclear engines and about 6300 gallons of fuel, but it can\u0027t make it to Dres.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-04-25T21:11:33Z\u0022 title=\u002204/25/2015 09:11  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 25, 2015\u003C/time\u003E by ImperialistPigDog\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"worir4","CreatedById":75980,"CreatedDateTime":"2015-04-25T20:50:49Z","Content":"\n\u003Cp\u003EIt is better to have less but then your burns will take a long time. Each one you add gives more power but is less efficient.\u003C/p\u003E\n"},{"CreatedByName":"NoMrBond","CreatedById":69263,"CreatedDateTime":"2015-04-25T20:57:32Z","Content":"\n\u003Cp\u003EThe absolute most efficient is one engine, because every engine after that is extra mass which also needs moving\u003C/p\u003E\u003Cp\u003EHowever, it\u0027s also painfully head-on-desk slow because you\u0027ve only got one engines thrust to move your whole ship\u003C/p\u003E\u003Cp\u003EBest way I\u0027ve found is to work backwards (starting with what is coming back to Kerbin) and work to minimise your mass at each stage\u003C/p\u003E\u003Cp\u003EOnce you\u0027ve minimised the amount of mass you\u0027re moving at each stage, the transfer stage and lifter could end up a lot smaller which usually means more dV\u003C/p\u003E\n"},{"CreatedByName":"ImperialistPigDog","CreatedById":60825,"CreatedDateTime":"2015-04-25T20:58:00Z","Content":"\n\u003Cp\u003EI see, so having just 4 would be better, giving it more delta-V?\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2015-04-25T21:06:31Z","Content":"\n\u003Cp\u003Edelta V = the natural logarithm (ln) of wet mass / dry mass\u003C/p\u003E\u003Cp\u003E(then multiplied by exhaust velocity, i.e. Isp * g0, 9.80665m/s).\u003C/p\u003E\u003Cp\u003EAs you can see, minimizing dry mass matters a lot.\u003C/p\u003E\n"},{"CreatedByName":"Hcube","CreatedById":137241,"CreatedDateTime":"2015-04-25T21:15:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DwindlingSovereignty\u0022 data-cite=\u0022DwindlingSovereignty\u0022\u003E\u003Cdiv\u003E8 nuclear engines and about 6300 gallons of fuel\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWant some advice ? If you\u0027re playing KSP, you better start using the metric system. Good luck calculating delta-V and TWRs with gallons, inches, feet, yards and whatnot. \u003C/p\u003E\u003Cp\u003E(back on topic, can you give us more info about your ship ? amount of fuel (in gallons, rofl) is just not detailed enough for anyone to give a good answer ! Good luck with your craft anyway \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E )\u003C/p\u003E\n"},{"CreatedByName":"ImperialistPigDog","CreatedById":60825,"CreatedDateTime":"2015-04-25T21:37:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Hcube\u0022 data-cite=\u0022Hcube\u0022\u003E\u003Cdiv\u003EWant some advice ? If you\u0027re playing KSP, you better start using the metric system. Good luck calculating delta-V and TWRs with gallons, inches, feet, yards and whatnot.\u003Cp\u003E(back on topic, can you give us more info about your ship ? amount of fuel (in gallons, rofl) is just not detailed enough for anyone to give a good answer ! Good luck with your craft anyway )\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, sorry I wasn\u0027t quite sure what Kerbals measure in. The ship has 6660... liters, I guess, of liquid fuel.\u003C/p\u003E\n"},{"CreatedByName":"Foxster","CreatedById":113764,"CreatedDateTime":"2015-04-25T22:03:21Z","Content":"\n\u003Cp\u003EI\u0027d shelve this until Monday. The nuke engines are changing a lot, they will no longer use oxidiser for instance.\u003C/p\u003E\n"},{"CreatedByName":"juanml82","CreatedById":105344,"CreatedDateTime":"2015-04-25T22:10:13Z","Content":"\n\u003Cp\u003Eup to 0.90, I usually use four nuclear engines per interplanetary transfer stage. You loose some delta-v but the longer burn times will result in a more inaccurate trajectory which has to be corrected (by burning more fuel) later. Plus the tedium of 10\u002B minutes burns.\u003C/p\u003E\u003Cp\u003EAnd (this is specially true regarding Moho, but I think it may still apply to Dres), you may also have little time zooming through your destination\u0027s SOI. If you go with one nuke to Moho to save Dv, you may find out that your circularization burn requires 35 minutes, but you\u0027ll zoom across Moho\u0027s SOI in 30 minutes. And, again, you\u0027ll loose efficiency by having to burn far away from the periapsis. So while TWR doesn\u0027t matter as much in interplanetary travels than it does in getting of the surface, it\u0027s not irrelevant either.\u003C/p\u003E\n"},{"CreatedByName":"Admac","CreatedById":126280,"CreatedDateTime":"2015-04-26T00:35:10Z","Content":"\n\u003Cp\u003EIf you use Mechjeb/KER pick a speed you like and add engines until you get there, with slower always being more Delta Vee. Personally I find 1-2 M/s is plenty for interplanetary burns. You CAN do some missions with as little a 0.05 m/s but it will be a nightmare. Burns taking multiple orbits etc.\u003C/p\u003E\n"},{"CreatedByName":"Radam","CreatedById":79910,"CreatedDateTime":"2015-04-26T12:20:09Z","Content":"\n\u003Cp\u003EAlso in 1.0 nuke will weigh 3t instead of 2.25t. So it will be even heavier.\u003C/p\u003E\u003Cp\u003E120t ship with slow burn at 2m/s2 needs 4 nuclear engines. It takes about 2100m/s dv to dres orbit. So the ship also needs about 30t of fuel which is about one big red tank.\u003C/p\u003E\u003Cp\u003EProbably your biggest problem is burn time. Injection will take 6 minutes even with 8 nukes, and 12 minutes with 4. Which basically means ypu have to start burning 6 minutes before the node.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-04-26T12:32:24Z\u0022 title=\u002204/26/2015 12:32  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 26, 2015\u003C/time\u003E by Radam\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2015-04-27T07:54:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ImperialistPigDog\u0022 data-cite=\u0022ImperialistPigDog\u0022\u003E\u003Cdiv\u003EYeah, sorry I wasn\u0027t quite sure what Kerbals measure in. The ship has 6660... liters, I guess, of liquid fuel.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EKSP uses the metric system and its units for most things, with one exception: the volume units of fuel tanks. They are not liters, they are not gallons, they are a completely arbitrary unit that isn\u0027t even consistent between different tank types. If you were to measure out the actual volume of various tanks, for instance, you would quickly notice that monopropellant, liquid fuel and xenon all use a different \u0022unit\u0022. This is also the reason why the game never actually mentions anywhere what the units are supposed to represent... I always like to say that they might as well represent \u0022Kerbal Helmet Fillings\u0022 or something similar. They really mean nothing at all, though, and you cannot put them into physical equations and hope to get a proper result.\u003C/p\u003E\u003Cp\u003EThe reason for this is that if you were to stay metric and use liters, you\u0027d get absolutely gigantic numbers very quickly. And gigantic numbers make for very poor gameplay - they ruin the way the fuel gauges look ingame, and are (for most people) difficult to work with. It\u0027s pretty easy to tell whether a number has three or four digits with a quick glance, for example, but it\u0027s nearly impossible to tell if a number has nine or ten digits. It throws you off just \u003Cem\u003Elooking\u003C/em\u003E at that thing!\u003C/p\u003E\u003Cp\u003EIt\u0027s also possibly one of the oldest legacies of KSP, stemming from a time when the devs were still figuring out how much physics simulation they actually wanted to put into their game. (Famously, the whole orbital mechanics thing was only put in as a quick little experiment that HarvesteR was sure the community would instantly reject...)\u003C/p\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2015-04-27T17:29:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ImperialistPigDog\u0022 data-cite=\u0022ImperialistPigDog\u0022\u003E\u003Cdiv\u003EI see, so having just 4 would be better, giving it more delta-V?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs NathanKell has pointed out, you\u0027ll get the mostest delta-V if you use exactly 1 (one) engine.\u003C/p\u003E\u003Cp\u003EHowever, there\u0027s also the question of fuel expenditure: long, slow burns are less efficient that a short and powerful burst. With a very low TWR, it\u0027s entirely possible to spend 1300m/s on a maneuver that ought to be 1000m/s. To some extent, adding more nukes is a win-win situation: shorter burns and you have more \u003Cem\u003Eusable\u003C/em\u003E delta-V. Someone (OhioBob?) has made a table not too long ago, but I can\u0027t find it again. The rules of thumb I remember: if you want to go to Jool in one single maneuver, your TWR should be 0.35 or better. If you\u0027re willing to split the burn (seach for \u003Cem\u003Eperiapsis kicking\u003C/em\u003E), a TWR of 0.2 will do, barely. Less than that will probably waste more fuel on inefficient burns than you save from lower dry mass.\u003C/p\u003E\n"}]}