{"TopicId":105131,"ForumId":25,"TopicTitle":"[Stock Only][Work-In-Progress] Kerbal Space Program 1.0 VTOL Spaceplane Milestones Challenge","CreatedByName":"Bandock","CreatedById":28934,"CreatedDateTime":"2015-04-27T08:41:29Z","PageNum":1,"Articles":[{"CreatedByName":"Bandock","CreatedById":28934,"CreatedDateTime":"2015-04-27T08:41:29Z","Content":"\n\u003Cp\u003EDue to the new aerodynamics having been implemented to Kerbal Space Program, I have decided to open up a Milestones challenge. This is a community-endorsed challenge meaning anyone of y\u0027all posting can contribute any additional milestones related to the development of VTOL (Vertical to Lift) spacecraft.\u003C/p\u003E\u003Cp\u003EConditions:\u003C/p\u003E\u003Cp\u003E- You must develop a VTOL Spaceplane to achieve it.\u003C/p\u003E\u003Cp\u003E- You are only allowed to use landing legs. (No plane-based landing gears. I may change this one at anytime if it feels too difficult). Landing legs are not required, but they can help with the landing procedure.\u003C/p\u003E\u003Cp\u003E- You are allowed to use a fueling depot. (This can be very helpful when traveling around Kerbol.)\u003C/p\u003E\u003Cp\u003E- It must be piloted. (No probe cores unless you are delivering a satellite as a payload.)\u003C/p\u003E\u003Cp\u003E- SAS/Reaction Wheels is permitted to treat it like some form of autopilot.\u003C/p\u003E\u003Cp\u003E- Use stock parts only. (Reason for this condition is to see how capable anyone is without relying on any modded parts).\u003C/p\u003E\u003Cp\u003E- You must either take screenshots of each of the milestones or record videos. (Videos are normally best, but screenshots are acceptable due to the fact there are those who poor internet connections still.)\u003C/p\u003E\u003Cp\u003ECurrent Milestones:\u003C/p\u003E\u003Cp\u003E- Achieve Low Kerbin Orbit and Return to Kerbal Space Center\u003C/p\u003E\u003Cp\u003E- Achieve Successful Mun Landing and Return to Mun Orbit\u003C/p\u003E\u003Cp\u003E- Achieve Successful Minimus Landing and Return to Minimus Orbit\u003C/p\u003E\u003Cp\u003E- Return to Kerbin (Land at the Kerbal Space Center) after travelling to and landing on all of Kerbin\u0027s Moons in one flight\u003C/p\u003E\u003Cp\u003E- Achieve Duna Orbit and Successfully Land on Duna, then Return to Duna Orbit\u003C/p\u003E\u003Cp\u003E- Return to Kerbin (Land at the Kerbal Space Center) after successfully landing on Duna\u003C/p\u003E\u003Cp\u003E- Pick up Command Pods (similar to like a Drop Pod design) with a VTOL Spaceplane from any planet/moon and return to orbit (Inspired by sbski\u0027s question that I have replied to.)\u003C/p\u003E\u003Cp\u003EThis list can be expanded and I will list those who successfully achieved any of the milestones.\u003C/p\u003E\u003Cp\u003EThe reason for posting this challenge is to see how many can achieve the goal of a successfully constructed VTOL Spaceplane under the new aerodynamics. Imagine trying this challenge on FAR (which probably has already been done).\u003C/p\u003E\u003Cp\u003EAdmittedly, I probably won\u0027t be able to achieve all the milestones myself. However, it would be a great way to see how everyone is capable in developing VTOL Spaceplanes. This thread is more like a R\u0026amp;D type to encourage innovation. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-04-29T08:36:50Z\u0022 title=\u002204/29/2015 08:36  AM\u0022 data-short=\u00229 yr\u0022\u003EApril 29, 2015\u003C/time\u003E by Bandock\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Snakedoctor15","CreatedById":118318,"CreatedDateTime":"2015-04-28T17:32:11Z","Content":"\n\u003Cp\u003EI have a APL (All Purpose Lander) I made don\u0027t know if it counts but It uses the pre- 1.0 landing gear but is able to do a Vertical lading and takeoff or just land as a plane and take off as one. The reason being it can land with or with out an atmosphere, land or water, even go from land to water or vise versa. Perfectly balanced and can be refueled while landed in water or land. Have yet to test it in 1.0 news to come. Yep with a little tweaking still works.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-04-28T17:56:54Z\u0022 title=\u002204/28/2015 05:56  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 28, 2015\u003C/time\u003E by Snakedoctor15\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sbski","CreatedById":135580,"CreatedDateTime":"2015-04-28T20:32:28Z","Content":"\n\u003Cp\u003EQuestion: Can we have a detachable command pod to land on the mun and come back up to dock or is this cheating? Also, can we have drop tanks?\u003C/p\u003E\n"},{"CreatedByName":"Bandock","CreatedById":28934,"CreatedDateTime":"2015-04-29T06:54:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Snakedoctor15\u0022 data-cite=\u0022Snakedoctor15\u0022\u003E\u003Cdiv\u003EI have a APL (All Purpose Lander) I made don\u0027t know if it counts but It uses the pre- 1.0 landing gear but is able to do a Vertical lading and takeoff or just land as a plane and take off as one. The reason being it can land with or with out an atmosphere, land or water, even go from land to water or vise versa. Perfectly balanced and can be refueled while landed in water or land. Have yet to test it in 1.0 news to come. Yep with a little tweaking still works.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFeel free to test it out. I remember encountering some interesting VTOL designs pre-1.0. Heck, I even remember experimenting with it before new aerodynamics were implemented.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sbski\u0022 data-cite=\u0022sbski\u0022\u003E\u003Cdiv\u003EQuestion: Can we have a detachable command pod to land on the mun and come back up to dock or is this cheating? Also, can we have drop tanks?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI was going to say you wouldn\u0027t be able to meet some milestones, but I think your question has led to an interesting idea. That would be great for VTOL designs where you can come back and re-acquire command pods. That would make for an interesting milestone.\u003C/p\u003E\u003Cp\u003EEdit: I have now added it as a potential milestone.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-04-29T07:00:10Z\u0022 title=\u002204/29/2015 07:00  AM\u0022 data-short=\u00229 yr\u0022\u003EApril 29, 2015\u003C/time\u003E by Bandock\u003C/strong\u003E\n\u003Cbr\u003EAdded to the reply.\n\u003C/span\u003E\n"},{"CreatedByName":"Fengist","CreatedById":78435,"CreatedDateTime":"2015-04-29T07:09:50Z","Content":"\n\u003Cp\u003EGive Cupcake a day or two, he\u0027ll have em all done.\u003C/p\u003E\n"}]}