{"TopicId":105202,"ForumId":34,"TopicTitle":"[1.12.x] USI Life Support","CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2015-04-27T17:37:19Z","PageNum":135,"Articles":[{"CreatedByName":"V[Sky]","CreatedById":171607,"CreatedDateTime":"2016-11-27T20:54:12Z","Content":"i have performance issues since the last update.... I will try to track down if its actually LS thats causing it...;) just letting everyone know in case there are others having the same issue"},{"CreatedByName":"MajorTomKerman","CreatedById":171226,"CreatedDateTime":"2016-11-27T21:31:30Z","Content":"I\u0027m experiencing a significant performance hit with 0.5.7.  I switched back and forth between 0.5.7 and 0.5.5 to confirm and it does seem to be 0.5.7 causing the problem.  I didn\u0027t think to check the log but it could be due to the issue [@symmeclept](https://forum.kerbalspaceprogram.com/index.php?/profile/89546-symmeclept/) is reporting above."},{"CreatedByName":"mcortez","CreatedById":153791,"CreatedDateTime":"2016-11-27T21:47:14Z","Content":"\u003E \n\u003E \n\u003E 54 minutes ago, symmeclept said:\n\u003E \n\u003E \n\u003E I\u0027m getting hardcore log spam from latest version:\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E     \n\u003E     \n\u003E     [LOG 14:48:54.366] ERROR Operation is not valid due to the current state of the object IN ModuleLifeSupport\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Happens in both existing and new crafts, manned and unmanned.\n\u003E \n\nI can also confirm this happening, quite a bit of log spam."},{"CreatedByName":"Tau137","CreatedById":100466,"CreatedDateTime":"2016-11-27T23:10:57Z","Content":"(Filename: C:/buildslave/unity/build/artifacts/generated/common/runtime/UnityEngineDebugBindings.gen.cpp Line: 42)\n\nERROR Operation is not valid due to the current state of the object IN ModuleLifeSupport  \n\n(Filename: C:/buildslave/unity/build/artifacts/generated/common/runtime/UnityEngineDebugBindings.gen.cpp Line: 42)\n\nERROR Operation is not valid due to the current state of the object IN ModuleLifeSupport"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2016-11-27T23:21:10Z","Content":"hrm....  Well that\u0027s a new one lemme see what I can repro on my own save."},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2016-11-27T23:53:36Z","Content":"Ok - 0.5.8 uploading now, will sort this."},{"CreatedByName":"Gilph","CreatedById":150861,"CreatedDateTime":"2016-11-28T00:01:04Z","Content":"Hi, Sorry, but 0.5.8 still had the spam and caused the heisenbug in my base for the first time.  This is in my modded career save."},{"CreatedByName":"danfarnsy","CreatedById":67183,"CreatedDateTime":"2016-11-28T00:10:36Z","Content":"\u003E \n\u003E \n\u003E 11 minutes ago, Gilph said:\n\u003E \n\u003E \n\u003E Hi, Sorry, but 0.5.8 still had the spam and caused the heisenbug in my base for the first time.  This is in my modded career save.\n\u003E \n\nThat\u0027s odd. Spam appears to be fixed in my save with 0.5.8. I was definitely getting it in 0.5.7.  \n\nEdit: ~~Nevermind, it only fixed it in pre-launch status.~~ This is why I try to double-check before I run my mouth.\n\n**Edited \u003Ctime datetime=\u00222016-11-28T00:12:41Z\u0022 title=\u002211/28/2016 12:12  AM\u0022 data-short=\u00227 yr\u0022\u003ENovember 28, 2016\u003C/time\u003E by danfarnsy**"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2016-11-28T00:11:32Z","Content":"[@Gilph](https://forum.kerbalspaceprogram.com/index.php?/profile/150861-gilph/) - delete your LifeSupport folder and give the install another go please."},{"CreatedByName":"Gilph","CreatedById":150861,"CreatedDateTime":"2016-11-28T00:23:18Z","Content":"\u003E \n\u003E \n\u003E 2 hours ago, RoverDude said:\n\u003E \n\u003E \n\u003E [@Gilph](https://forum.kerbalspaceprogram.com/index.php?/profile/150861-gilph/) - delete your LifeSupport folder and give the install another go please.\n\u003E \n\nI deleted my folder completely when I installed 0.5.8.  Will try it again when I get back on.\n\nEdit1: Good news: no error spam after I deleted the folder and reinstalled.  But, the heisenbug was still there\n\nEdit2: Spoke too soon...got the error spam about 15 minutes into the session. It started when I switched to a small unmanned sat with a relay. No life support at all: ERROR Operation is not valid due to the current state of the object IN ModuleLifeSupport\n\n**Edited \u003Ctime datetime=\u00222016-11-28T02:24:14Z\u0022 title=\u002211/28/2016 02:24  AM\u0022 data-short=\u00227 yr\u0022\u003ENovember 28, 2016\u003C/time\u003E by Gilph**\n  \nupdate"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2016-11-28T03:01:39Z","Content":"Ok let me repro that case then ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022)\n\nOk.. 0.5.9 going up now.  Hopefully the last one for a while ![:wink:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif \u0022;)\u0022)\n\n[@Gilph](https://forum.kerbalspaceprogram.com/index.php?/profile/150861-gilph/) - can you reiterate your specific bug and do you have it reproducible in a \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E\u002BStock save?"},{"CreatedByName":"Alvargon","CreatedById":70009,"CreatedDateTime":"2016-11-28T03:15:57Z","Content":"Hi guys, I have a question about life Support, is it responsable of the kerbal to tourist transformation? when the kerbal stay long time in a place the retard change his profesión to \u0022tourist\u0022 and I didn\u0027t discover the pattern or what I have to do to solve that or avoid it.\n\nAny help?\n\nthx"},{"CreatedByName":"DStaal","CreatedById":155685,"CreatedDateTime":"2016-11-28T04:25:10Z","Content":"\u003E \n\u003E \n\u003E 1 hour ago, Alvargon said:\n\u003E \n\u003E \n\u003E Hi guys, I have a question about life Support, is it responsable of the kerbal to tourist transformation? when the kerbal stay long time in a place the retard change his profesión to \u0022tourist\u0022 and I didn\u0027t discover the pattern or what I have to do to solve that or avoid it.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Any help?\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E thx\n\u003E \n\nYep, that\u0027s life support.  Depending on your settings (and the design of your ships) several things can be causing it, but it\u0027s likely that they are getting homesick or running out of habitation.  To avoid you need to make sure you have enough habitation (and supplies, and EC, the other main LS variables) for your mission.  To turn the Kerbal back to his former profession, you need to return them to Kerbin.  (Or - if it\u0027s not habitation - get them supplies/EC.)"},{"CreatedByName":"Enorats","CreatedById":141841,"CreatedDateTime":"2016-11-28T05:52:04Z","Content":"So, I\u0027m new to the whole \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E LS thing. Doing my first missions outside of Kerbin\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E, headed to Duna.. and may have found some bugs. Not sure. Went a little overkill and spent the whole day building a Karibou rover/MKS Duna series mashup for a main base, several additional Karibou rovers for fuel production and ground exploration, and a relay satellite network. Sent the whole thing out unmanned in about five pieces, landed what needed to be and got it set up. The manned exploration rover had ~60 days supplies/hab time, which was massively overkill. The main base had something like 4-5 years hab time, and an unknown amount of supplies.. they were to be farming (mining water/substrate and using cultivation). Even without that they had enough supplies for several years, and a backup nom-o-matic system that\u0027d alternatively use the fertilizer and mulch to extend supplies in case water/substrate was unavailable (which ended up being the case). Several issues here, but ended up getting it to work. The Duna Series MKS nuclear reactor kept turning off every time I swapped to a new ship, so that ship would be out of power when I would return to it.. which was frustrating. Had to Hyperedit in some electric charge to get things running again. No idea why it kept turning off, even had radiators attached and running.  \n\nNext, I put together a transfer vehicle that was composed of a nuclear powered space hotel (2.5m tundra Kerbitat, science lab, numerous luxuries) and a lander that was designed to refuel on the ground and return to orbit and dock for a Kerbin return. The whole setup had something like 2-3 years of hab time and supplies and the lander portion a good month\u0027s time for my 4 kerbals. Sent it out.. and ran into, well.. problems. Lots of them. Got my ship into orbit around Duna and found that I only had about 30 days worth of supplies remaining. I should have had the better part of year or two remaining, more than enough for a return to Kerbin. Turns out the Kerbitat, even though it was set up for \u0022Recycler\u0022 (the 81% one that only uses EC), wasn\u0027t doing anything. It was turned on, but it hadn\u0027t actually functioned at all. The science lab\u0027s 50% recycler had helped a bit, but left me with a nearly empty mothership. Bug maybe? Figure.. oh well, I can drop my crew on the surface and they out to be able to last until resupply from Kerbin. Load them up into the lander portion, decouple the docking port, swap back to the main mothership and start shutting down systems since it\u0027s empty now.. and all my guys decide to call it quits. Turns out the lander was sharing hab time with the nearby mothership, and for some reason the crew now thinks I\u0027m shoving them into a tin can or something. The \u0022lander\u0022 apparently doesn\u0027t register as a \u0022new vehicle\u0022, so the hab time isn\u0027t being reset. As soon as the lander leaves the \u0022shared\u0022 zone around the mothership, even if I leave its systems online.. the crew quits. I can still land remotely, but they won\u0027t EVA to set up my base and move in. Luckily I was able to think of a solution.. decoupling, redocking, then undocking caused it to reset properly.. then my lander stopped being controllable briefly when it lost signal, despite having 4 kerbals (pilot included) on board.. pilot in a command pod even. Guessing that wasn\u0027t \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E though, probably some other issue."},{"CreatedByName":"symmeclept","CreatedById":89546,"CreatedDateTime":"2016-11-28T06:59:41Z","Content":"\u003E \n\u003E \n\u003E 3 hours ago, RoverDude said:\n\u003E \n\u003E \n\u003E Ok let me repro that case then ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022)\n\u003E \n\u003E \n\u003E \n\u003E Ok.. 0.5.9 going up now.  Hopefully the last one for a while ![:wink:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif \u0022;)\u0022)\n\u003E \n\nYup, that done it ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif \u0022:D\u0022) Thanks Roverdude!"},{"CreatedByName":"steve_v","CreatedById":69272,"CreatedDateTime":"2016-11-28T08:08:15Z","Content":"\u003E \n\u003E \n\u003E 8 hours ago, Gilph said:\n\u003E \n\u003E \n\u003E No life support at all: ERROR Operation is not valid due to the current state of the object IN ModuleLifeSupport\n\u003E \n\nFWIW (looks similar, but may not be related), I upgraded from 0.5.6 (which worked, and fixed the earlier habitation issue) to 0.5.9 and I\u0027m seeing something like this too. Nothing shown in the LS window, no resources consumed, on a (previously working) station.  \n\nGoing EVA and re-boarding with the sole occupant triggered this log entry a dozen or so times:\n\nSpoiler\n\nException handling event onVesselChange in class ModuleLifeSupportSystem:System.InvalidOperationException: Operation is not valid due to the current state of the object\n      at System.Linq.Enumerable.First[Part] (IEnumerable\u00601 source, System.Func\u00602 predicate, Fallback fallback) [0x00000] in :0 \n      at System.Linq.Enumerable.First[Part] (IEnumerable\u00601 source, System.Func\u00602 predicate) [0x00000] in :0 \n      at LifeSupport.ModuleLifeSupportSystem.UpdateVesselInfo () [0x00000] in :0 \n      at LifeSupport.ModuleLifeSupportSystem.UpdateVessel (.Vessel thisVessel) [0x00000] in :0 \n      at EventData\u00601[Vessel].Fire (.Vessel data) [0x00000] in :0 \n     \n    (Filename: /home/builduser/buildslave/unity/build/artifacts/generated/common/runtime/UnityEngineDebugBindings.gen.cpp Line: 42)\n    \n    InvalidOperationException: Operation is not valid due to the current state of the object\n      at System.Linq.Enumerable.First[Part] (IEnumerable\u00601 source, System.Func\u00602 predicate, Fallback fallback) [0x00000] in :0 \n      at System.Linq.Enumerable.First[Part] (IEnumerable\u00601 source, System.Func\u00602 predicate) [0x00000] in :0 \n      at LifeSupport.ModuleLifeSupportSystem.UpdateVesselInfo () [0x00000] in :0 \n      at LifeSupport.ModuleLifeSupportSystem.UpdateVessel (.Vessel thisVessel) [0x00000] in :0 \n      at EventData\u00601[Vessel].Fire (.Vessel data) [0x00000] in :0 \n    UnityEngine.DebugLogHandler:Internal_LogException(Exception, Object)\n    UnityEngine.DebugLogHandler:LogException(Exception, Object)\n    UnityEngine.Logger:LogException(Exception, Object)\n    UnityEngine.Debug:LogException(Exception)\n    EventData\u00601:Fire(Vessel)\n    FlightGlobals:setActiveVessel(Vessel, Boolean)\n    FlightGlobals:ForceSetActiveVessel(Vessel)\n    KerbalEVA:proceedAndBoard(Part)\n    KerbalEVA:BoardPart(Part)\n    KerbalEVA:m__58()\n    KerbalFSM:RunEvent(KFSMEvent)\n    KerbalFSM:updateFSM(KFSMUpdateMode)\n    KerbalFSM:UpdateFSM()\n    KerbalEVA:Update()\n\nThen LS magically started working again. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022) So far (and a few scene changes / vessel switches later) so good, no more errors.  \n\nThere\u0027s something funny still going on here, but ~~it seems a vessel state change fixes it, at least for me. No EVA possible on an unmanned vessel though.~~  \n\ned. Spoke too soon.  It happened again, though this time I spotted the instigator - undocking (in the first case, a spaceplane, and just now with a lander). After undocking, (in both cases the smaller / not station, unaffected vessel became the focus) the station looses all LS functions.  \n\nPlaying about with the lander \u0026 station in close proximity, the error is logged on every dock, undock or vessel switch.  \n\nUndock / dock or EVA doesn\u0027t seem to fix it this time either ![:(](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif \u0022:(\u0022).\n\nAll this on existing vessels, and with other mods. Really don\u0027t have the time to spend on a stock save ATM, barely time to play at all ![:(](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif \u0022:(\u0022). Bloody day job. ![:mad:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_angry.gif \u0022:mad:\u0022)\n\nRolled back to 0.5.6 for now, and everything appears to work as expected.\n\n**Edited \u003Ctime datetime=\u00222016-11-28T08:37:01Z\u0022 title=\u002211/28/2016 08:37  AM\u0022 data-short=\u00227 yr\u0022\u003ENovember 28, 2016\u003C/time\u003E by steve\\_v**"},{"CreatedByName":"bounty123","CreatedById":142602,"CreatedDateTime":"2016-11-28T09:04:21Z","Content":"\u003E \n\u003E \n\u003E 6 hours ago, Enorats said:\n\u003E \n\u003E \n\u003E Turns out the lander was sharing hab time with the nearby mothership, and for some reason the crew now thinks I\u0027m shoving them into a tin can or something. The \u0022lander\u0022 apparently doesn\u0027t register as a \u0022new vehicle\u0022, so the hab time isn\u0027t being reset. As soon as the lander leaves the \u0022shared\u0022 zone around the mothership, even if I leave its systems online.. the crew quits.\n\u003E \n\nI experienced a similar lander separates, crew quits problem. I\u0027m still in early stage of my \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E career, it happened me on a return trip from Minmus. Arrived to \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E with about 7 days hab time remaining, and after separating the return stage, during descent, the crew decided they\u0027ve had enough torture and quit, not the best timing. Is this intended so? I would imagine there should be some hab time remaining for them to land. In this case the 25km Kerbin limit saved them, but I bet that on Duna it would be messier.\n\nEdit: maybe the lander pod(s) shouldn\u0027t be occupied during the mission, and only be used during the landing and then it would have habitation remaining in the end? I\u0027ll test it at home.\n\n**Edited \u003Ctime datetime=\u00222016-11-28T12:02:09Z\u0022 title=\u002211/28/2016 12:02  PM\u0022 data-short=\u00227 yr\u0022\u003ENovember 28, 2016\u003C/time\u003E by bounty123**"},{"CreatedByName":"Levv","CreatedById":169143,"CreatedDateTime":"2016-11-28T10:04:31Z","Content":"Installing the newer versions fixed the \u0027refusing-to-work\u0027-problem for my station. \n\nRoverDude, youre doing an awsome job. Ive never seen bugs being fixed so quickly!"},{"CreatedByName":"Merkov","CreatedById":165068,"CreatedDateTime":"2016-11-28T13:13:17Z","Content":"I\u0027m seeing an odd little bug that I didn\u0027t see posted already. If I missed it, please disregard this:\n\nI noticed when using CTT in my career playthrough that the Nom O Matic 5000, 25000, and 25000-I all seem to be visible in the default tech tree node (survivability) AND their CTT node, hydroponics. These seem to be the only three parts that are affected this way. I tried starting with a fresh install of \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E-LS and its bundled dependencies and CTT. I started a new career and went straight to the R\u0026D facility, and the tech tree still showed the Nom O Matics in both tech tree nodes. Has anyone else seen this? \n\nHere is the [output log](https://drive.google.com/open?id=0B637QKLvNK3bRnNIS0dna2R1cGc) from that \u0022playthrough\u0022, as well as a [save](https://drive.google.com/open?id=0B637QKLvNK3bWmtsUFNZdGdvOVU) if needed. Only \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E-LS and CTT are needed. \n\nSlightly off-topic, but while I was looking into this (my version of looking into most programming-related things is PRETTY basic) I noticed that the new, larger recycler, the RT-5000, doesn\u0027t have a CTT config entry, so it just shows up in survivability, far sooner than the littler RT-500, which shows up in recycling. Is this its intended placement, or simply an oversight? Would you like a pull request (I can try to figure those things out!) with an updated CTT.cfg? If so, would you like it in the recycling node, or somewhere else? \n\nThanks for everything!\n\nEdit: I just re-posted this in the CTT thread, since in hindsight it might be more of an issue on that mod\u0027s end.\n\n**Edited \u003Ctime datetime=\u00222016-11-30T04:33:18Z\u0022 title=\u002211/30/2016 04:33  AM\u0022 data-short=\u00227 yr\u0022\u003ENovember 30, 2016\u003C/time\u003E by Merkov**"},{"CreatedByName":"Gilph","CreatedById":150861,"CreatedDateTime":"2016-11-28T15:34:26Z","Content":"\u003E \n\u003E \n\u003E 12 hours ago, RoverDude said:\n\u003E \n\u003E \n\u003E Ok let me repro that case then ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022)\n\u003E \n\u003E \n\u003E \n\u003E Ok.. 0.5.9 going up now.  Hopefully the last one for a while ![:wink:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif \u0022;)\u0022)\n\u003E \n\u003E \n\u003E \n\u003E  \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E [@Gilph](https://forum.kerbalspaceprogram.com/index.php?/profile/150861-gilph/) - can you reiterate your specific bug and do you have it reproducible in a \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E\u002BStock save?\n\u003E \n\nHi, will try to reproduce tonight in a \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E\u002BStock build, along with testing 0.5.9 in career build.\n\nTo reiterate, I loaded 0.5.8 and went to all of my bases and ships. On my third ship, I got the \u0022refused to work/back to work\u0022 message.  When I checked the log, no spam errors. Continued to switch to all active flights and went to a small sat that I need to get into an orbit in Minmus as part of a contract. There are only stock parts on this craft, and no life support as it\u0027s unmanned. At that point, the spam started with that error message.  Not sure if the timing is relevant."},{"CreatedByName":"Enorats","CreatedById":141841,"CreatedDateTime":"2016-11-28T15:50:38Z","Content":"\u003E \n\u003E \n\u003E 6 hours ago, bounty123 said:\n\u003E \n\u003E \n\u003E I experienced a similar lander separates, crew quits problem. I\u0027m still in early stage of my \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E career, it happened me on a return trip from Minmus. Arrived to \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E with about 7 days hab time remaining, and after separating the return stage, during descent, the crew decided they\u0027ve had enough torture and quit, not the best timing. Is this intended so? I would imagine there should be some hab time remaining for them to land. In this case the 25km Kerbin limit saved them, but I bet that on Duna it would be messier.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Edit: maybe the lander pod(s) shouldn\u0027t be occupied during the mission, and only be used during the landing and then it would have habitation remaining in the end? I\u0027ll test it at home.\n\u003E \n\nNear as I can tell decoupling doesn\u0027t reset the hab time. The Kerbals are still in the \u0022same ship\u0022 as before, so the hab time isn\u0027t reset. Redocking, then undocking resets it because it\u0027s undocking that the mod recognizes.\n\nThe solution is to do an Apollo style mission. Get to orbit, decouple your command pod (taking a huge hab time hit, but you just got up there so it won\u0027t matter), turn around and dock to your LEM. Hab time will reset and go back to normal. Go to moon, undock the lander.. do your stuff. For the ascent to orbit you can\u0027t leave any hab pieces behind as decoupling from them won\u0027t work. Long term landers could have trouble here, but short missions should be okay. Anywho, go back up.. redock, transfer crew, undock (or keep the LEM for extra hab), and head to Kerbin. Undock from the LEM before decoupling your pod if you kept it, simply decoupling will cause issues.\n\nIf you try to do the mission with just one vessel (say a command pod with hitchhiker can, with a decoupler in between to detach the pod for reentry), you\u0027ll be fine for the entire mission up until reentry. At that point you\u0027ll decouple your pod and the crew will more or less give up and quit because the mod thinks you\u0027ve effectively turned off the life support systems, not detached from them and created a new vessel your Kerbals should be happy to take for a short jaunt."},{"CreatedByName":"bounty123","CreatedById":142602,"CreatedDateTime":"2016-11-28T16:21:19Z","Content":"\u003E \n\u003E \n\u003E 25 minutes ago, Enorats said:\n\u003E \n\u003E \n\u003E Near as I can tell decoupling doesn\u0027t reset the hab time. The Kerbals are still in the \u0022same ship\u0022 as before, so the hab time isn\u0027t reset. Redocking, then undocking resets it because it\u0027s undocking that the mod recognizes.\n\u003E \n\nThanks, so un/redocking is the key, I\u0027ll keep that in mind. You probably saved several kerbal lives with this info!"},{"CreatedByName":"nascarlaser1","CreatedById":166190,"CreatedDateTime":"2016-11-28T19:06:32Z","Content":"Does the new update automatically go to \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E, or do I have to wait every time there is an update? (srry for any noob questions, am new to playing with mods.)"},{"CreatedByName":"ExplorerKlatt","CreatedById":107424,"CreatedDateTime":"2016-11-28T20:07:40Z","Content":"\u003E \n\u003E \n\u003E 59 minutes ago, nascarlaser1 said:\n\u003E \n\u003E \n\u003E Does the new update automatically go to \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E, or do I have to wait every time there is an update? (srry for any noob questions, am new to playing with mods.)\n\u003E \n\nIt usually takes about an hour or two for \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003Eckan\u003C/abbr\u003E to get it."},{"CreatedByName":"nascarlaser1","CreatedById":166190,"CreatedDateTime":"2016-11-28T21:47:21Z","Content":"\u003E \n\u003E \n\u003E 1 hour ago, ExplorerKlatt said:\n\u003E \n\u003E \n\u003E It usually takes about an hour or two for \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003Eckan\u003C/abbr\u003E to get it.\n\u003E \n\noh ok thxs."}]}