{"TopicId":105202,"ForumId":34,"TopicTitle":"[1.12.x] USI Life Support","CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2015-04-27T17:37:19Z","PageNum":155,"Articles":[{"CreatedByName":"spcan","CreatedById":174780,"CreatedDateTime":"2017-02-11T16:30:42Z","Content":"\u003E \n\u003E \n\u003E On 9/2/2017 at 8:54 PM, RoverDude said:\n\u003E \n\u003E \n\u003E Show us your GameData folder please.\n\u003E \n\nEdit: Uhhmm... I don\u0027t know if the image was posted so just in case here\u0027s the link:\n\n[https://drive.google.com/file/d/0B9-xUa44GzYaNW8tUGw1Z3VSb3M/view?usp=sharing](https://drive.google.com/file/d/0B9-xUa44GzYaNW8tUGw1Z3VSb3M/view?usp=sharing)\n\n**Edited \u003Ctime datetime=\u00222017-02-11T16:34:51Z\u0022 title=\u002202/11/2017 04:34  PM\u0022 data-short=\u00227 yr\u0022\u003EFebruary 11, 2017\u003C/time\u003E by spcan**\n  \nDon\u0027t know if image was attached"},{"CreatedByName":"goldenpsp","CreatedById":113874,"CreatedDateTime":"2017-02-11T23:00:56Z","Content":"[@spcan](https://forum.kerbalspaceprogram.com/index.php?/profile/174780-spcan/)\n\nwhile it is technically supposed to be ok it is generally recommended to remove older versions of modulemanager leaving only the latest dll"},{"CreatedByName":"Aramazia Kin","CreatedById":110761,"CreatedDateTime":"2017-02-12T10:29:07Z","Content":"\u003E \n\u003E \n\u003E On 2/7/2017 at 10:38 PM, WuphonsReach said:\n\u003E \n\u003E \n\u003E Well, things are a bit borked right now with regard to the hab-values (possibly the multipliers not working if another vessel is within 150m...)...\n\u003E \n\nWhat\u0027s wrong with habitation atm? I\u0027m asking because I have a station that should have several years of habitation but only actually had 60 days?"},{"CreatedByName":"maja","CreatedById":168379,"CreatedDateTime":"2017-02-12T12:16:35Z","Content":"\u003E \n\u003E \n\u003E 1 hour ago, Aramazia Kin said:\n\u003E \n\u003E \n\u003E What\u0027s wrong with habitation atm? I\u0027m asking because I have a station that should have several years of habitation but only actually had 60 days?\n\u003E \n\nDid you by any chance forgot to start habitation in right click menu of hab parts?"},{"CreatedByName":"omelaw","CreatedById":156483,"CreatedDateTime":"2017-02-12T12:47:02Z","Content":"Maybe it\u0027s stupid idea but Can I use this in my ongoing career save?"},{"CreatedByName":"danielboro","CreatedById":166078,"CreatedDateTime":"2017-02-12T13:24:41Z","Content":"[@omelaw](https://forum.kerbalspaceprogram.com/index.php?/profile/156483-omelaw/)\n\nyes\n\nbut.\n\ndo you have kerbals not on kerbin?\n\ncan you get them back to kerbin?\n\nonce you add LS you cant use the old ships you have as they dont have supplys and probably insufficient hub room\n\nusing an \u003Cabbr title=\u0022Module Manager (mod)\u0022\u003EMM\u003C/abbr\u003E you can add sum supplays to stok parts like the PPD(thers a copy in this tread somewhere)  \n\nbut the hub problem will stay for any thing out of kerbin \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E  \n\nin kerbin orbit and MUN adding extra parts for the hub and supplays is not hard or long  \n\nbut minmus needs a week and that can be too long a time for the kerbals whit LS\n\ni add \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E-LS to an ongoing career save my self\n\n**Edited \u003Ctime datetime=\u00222017-02-12T14:00:38Z\u0022 title=\u002202/12/2017 02:00  PM\u0022 data-short=\u00227 yr\u0022\u003EFebruary 12, 2017\u003C/time\u003E by danielboro**"},{"CreatedByName":"Aramazia Kin","CreatedById":110761,"CreatedDateTime":"2017-02-12T13:37:32Z","Content":"\u003E \n\u003E \n\u003E 1 hour ago, maja said:\n\u003E \n\u003E \n\u003E Did you by any chance forgot to start habitation in right click menu of hab parts?\n\u003E \n\nAh that was it, not played for awhile so didn\u0027t know that was a thing, thanks."},{"CreatedByName":"JadeOfMaar","CreatedById":167617,"CreatedDateTime":"2017-02-13T03:25:32Z","Content":"Hey all, and [@RoverDude](https://forum.kerbalspaceprogram.com/index.php?/profile/105198-roverdude/). I\u0027ve begun to make my own textures and a mod that adapts to various LS mods. It has 3 slots for converter/recycler parts in the form of short Mk2 fuselage. For \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E LS, what converter or generator parts can/may take these slots? I\u0027ll post screenshots soon.\n\nThe new avatar is a pleasant surprise, RoverDude. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022) \n\n**Edited \u003Ctime datetime=\u00222017-02-13T03:25:59Z\u0022 title=\u002202/13/2017 03:25  AM\u0022 data-short=\u00227 yr\u0022\u003EFebruary 13, 2017\u003C/time\u003E by JadeOfMaar**"},{"CreatedByName":"DStaal","CreatedById":155685,"CreatedDateTime":"2017-02-13T04:01:41Z","Content":"\u003E \n\u003E \n\u003E 27 minutes ago, JadeOfMaar said:\n\u003E \n\u003E \n\u003E Hey all, and [@RoverDude](https://forum.kerbalspaceprogram.com/index.php?/profile/105198-roverdude/). I\u0027ve begun to make my own textures and a mod that adapts to various LS mods. It has 3 slots for converter/recycler parts in the form of short Mk2 fuselage. For \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E LS, what converter or generator parts can/may take these slots? I\u0027ll post screenshots soon.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E The new avatar is a pleasant surprise, RoverDude. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022)\n\u003E \n\n\u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E-LS uses the following types of parts:\n\n- Recycler\n- Purifier (90% recycler with a water input)\n- Greenhouse  (MKS adds two extra types of greenhouses, with different inputs.)\n- Habitation\n- Habitation Multiplier\n\nBoth habitation and habitation multiplier parts should at least in theory be accessible by a Kerbal.  (A hab multiplier can get away with \u0027they can poke their head in when they want on occasion\u0027.)\n\nAnd of course for a modular system it\u0027s always nice to have storage for Supplies, Mulch, Fertilizer, and/or a combination of all three."},{"CreatedByName":"JadeOfMaar","CreatedById":167617,"CreatedDateTime":"2017-02-13T04:10:31Z","Content":"\u003E \n\u003E \n\u003E 2 minutes ago, DStaal said:\n\u003E \n\u003E \n\u003E \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E-LS uses the following types of parts:\n\u003E \n\nThanks. That\u0027s more than I expected so I may have to provide for more placeholder tanks in case no LS at all is installed (which I guess is fine since TAC LS also has 5 such parts but I assume I can realistically compress its 2 water converters and its two carbon processors into one part respectively). Is it safe to assume that the appropriate \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E ones for Mk2 short size are the Purifier, Greenhouse and Hab Multiplier?\n\nModular tanks for consumables are the primary focus already. The long and short fuel tanks are firstly repurposed this way. Should I include Replacement Parts in them or leave that for any crewed parts."},{"CreatedByName":"DStaal","CreatedById":155685,"CreatedDateTime":"2017-02-13T04:46:07Z","Content":"\u003E \n\u003E \n\u003E 14 minutes ago, JadeOfMaar said:\n\u003E \n\u003E \n\u003E Thanks. That\u0027s more than I expected so I may have to provide for more placeholder tanks in case no LS at all is installed (which I guess is fine since TAC LS also has 5 such parts but I assume I can realistically compress its 2 water converters and its two carbon processors into one part respectively). Is it safe to assume that the appropriate \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E ones for Mk2 short size are the Purifier, Greenhouse and Hab Multiplier?\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Modular tanks for consumables are the primary focus already. The long and short fuel tanks are firstly repurposed this way. Should I include Replacement Parts in them or leave that for any crewed parts.\n\u003E \n\nI\u0027d say the appropriate ones are: Recycler, Greenhouse, and then debate on exactly what the part is and how it works between Purifier and Hab Multiplier.  Purifiers are a bit of a specialty part: They should be heavy, take a heavy resource, and work best in combination with multiple recyclers.  Hab Multiplers are things like cupolas; things which make the ship nicer to live in.  They aren\u0027t that powerful on small ships, but quickly make large ships much more habitable.  Purifiers tend to excel on large planetary bases (where you have access to water), while hab multipliers tend to be a bit more widely used - anytime you want to go over 3-4 months of habitation time, multipliers start being very useful.\n\nBut the two basic parts you always want access to are a recycler and a greenhouse.  Even a trip to Minmus and back may find a recycler worth the weight, and an extended stay of over a month or so starts to mean greenhouses are useful.\n\nI\u0027m not sure Replacement Parts do much of anything at the moment - Wear was confusing, so RoverDude is rethinking the mechanic.  (And even when it was there, it wasn\u0027t a visible resource - basically, you\u0027d include it if the part is supposed to wear out over time.  While it\u0027s full of Replacement Parts, it\u0027ll work at 100% efficiency, but it will use them up slowly...)  In fact, they\u0027ve \\*never\\* done anything in straight \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E-LS, at least not out of the box.  They were enabled by MKS - which brings up the point that there\u0027s a lot of overlap between the two mods.  You might consider having storage for Machinery, MaterialKits, and SpecializedParts - all of those are MKS, but the first handles a wear-like mechanic for industrial parts, and the latter two are useful for a lot of things in MKS - including switching converters between modes, where they are configured to do that."},{"CreatedByName":"JadeOfMaar","CreatedById":167617,"CreatedDateTime":"2017-02-13T05:17:59Z","Content":"\u003E \n\u003E \n\u003E 46 minutes ago, DStaal said:\n\u003E \n\u003E \n\u003E I\u0027d say the appropriate ones are: Recycler, Greenhouse, and then debate on exactly what the part is and how it works between Purifier and Hab Multiplier.\n\u003E \n\nOkay then. The most important converter for me is a greenhouse. There needs to be a part that produces Supplies (namely for spaceplanes that skip between moons). The hab multiplier part gives me ideas now for a modified crew cabin which was not in the plan but can find a place in it and possibly the other LS mods.\n\nTell me a little about the Recycler part, how it really works. I\u0027ve never used full MKS, only MKS Lite and said Recycler (assuming it\u0027s now the RT-500, I have it open in Notepad\u002B\u002B) was nothing more to me than a leech on my batteries. I never saw its significance. If it\u0027s not the RT-500 is it in the full MKS mod? I\u0027d like to study it.\n\nAs for industrial resources, I may consider changing one of the Mk2 long tanks for this instead of holding only Mulch... For Mulch alone I think that\u0027d be a lot of wasted capacity. While I fear that having a tank at all hold industrial material may be going out of scope since my mod is about keeping crew fed and alive in style, I have a fair grasp on MKS\u0027 vision so maybe it would be just fine to go ahead with industrial tankage...?\u003Csub\u003E I might need a yes or no from RoverDude on this one?\u003C/sub\u003E\n\n**Edited \u003Ctime datetime=\u00222017-02-13T05:32:32Z\u0022 title=\u002202/13/2017 05:32  AM\u0022 data-short=\u00227 yr\u0022\u003EFebruary 13, 2017\u003C/time\u003E by JadeOfMaar**"},{"CreatedByName":"danielboro","CreatedById":166078,"CreatedDateTime":"2017-02-13T11:52:22Z","Content":"[@JadeOfMaar](https://forum.kerbalspaceprogram.com/index.php?/profile/167617-jadeofmaar/)\n\nmy thinking of mk2 for \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E-LS is\n\nan MK2-long that the first half can be 4 kerbal Habitation or Habitation Multiplier and the second half is a 4 kerbal 60%  Recycler whit room for supply\u0027s and mulch\n\nan MK2-short Greenhouse  (? EC\u002B1 fertilizer\u002B10 mulch --\u003E 11 supply\u0027s)\n\nand an MK2-short 4 kerbal 60%  Recycler\n\n**Edited \u003Ctime datetime=\u00222017-02-13T11:52:52Z\u0022 title=\u002202/13/2017 11:52  AM\u0022 data-short=\u00227 yr\u0022\u003EFebruary 13, 2017\u003C/time\u003E by danielboro**"},{"CreatedByName":"JadeOfMaar","CreatedById":167617,"CreatedDateTime":"2017-02-13T12:13:00Z","Content":"\u003E \n\u003E \n\u003E 21 minutes ago, danielboro said:\n\u003E \n\u003E \n\u003E my thinking of mk2 for \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E-LS is\n\u003E \n\nNew variants of the Mk2 cabin, even a long cabin sounds pretty epic actually. But while I\u0027ve begun to make textures I\u0027m far from able to model. I don\u0027t use Blender or Unity. I do use another software and maybe I could export and submit open-format object files for someone else to convert to .mu and insert things for me like emissives for lights or ray-catchers for solar panels.\n\nIf it\u0027s as easy as adding the light animation module to a tank and a named texture that fits it I can easily fake/emulate the cabins and greenhouses.\n\nHere\u0027s the raw concept before being made aware of crewable converters and industrial resources. It began around TAC LS and the texture theme is based on the 1.25m Supplies container.\n\n![Vi9aDwX.jpg](http://i.imgur.com/Vi9aDwX.jpg)\n\n**Edited \u003Ctime datetime=\u00222017-02-13T12:14:01Z\u0022 title=\u002202/13/2017 12:14  PM\u0022 data-short=\u00227 yr\u0022\u003EFebruary 13, 2017\u003C/time\u003E by JadeOfMaar**"},{"CreatedByName":"DStaal","CreatedById":155685,"CreatedDateTime":"2017-02-13T14:37:51Z","Content":"\u003E \n\u003E \n\u003E 8 hours ago, JadeOfMaar said:\n\u003E \n\u003E \n\u003E Okay then. The most important converter for me is a greenhouse. There needs to be a part that produces Supplies (namely for spaceplanes that skip between moons). The hab multiplier part gives me ideas now for a modified crew cabin which was not in the plan but can find a place in it and possibly the other LS mods.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Tell me a little about the Recycler part, how it really works. I\u0027ve never used full MKS, only MKS Lite and said Recycler (assuming it\u0027s now the RT-500, I have it open in Notepad\u002B\u002B) was nothing more to me than a leech on my batteries. I never saw its significance. If it\u0027s not the RT-500 is it in the full MKS mod? I\u0027d like to study it.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E As for industrial resources, I may consider changing one of the Mk2 long tanks for this instead of holding only Mulch... For Mulch alone I think that\u0027d be a lot of wasted capacity. While I fear that having a tank at all hold industrial material may be going out of scope since my mod is about keeping crew fed and alive in style, I have a fair grasp on MKS\u0027 vision so maybe it would be just fine to go ahead with industrial tankage...?\u003Csub\u003E I might need a yes or no from RoverDude on this one?\u003C/sub\u003E\n\u003E \n\nThe RT-500 is one of the recyclers - there\u0027s also the more powerful (but more situation-dependent) RT-5000, and MKS has a variety of them in various sizes.  What it does is directly reduce supply usage (at the cost of EC): So for the 500, instead of using 10.8 Supplies per day, your Kerbal will use 10.8\\*(1-0.6) = 4.32 Supplies per day.  Note that the 500 can only efficiently recycle the output of one Kerbal - any Kerbals in excess of that (assuming you have only the one recycler) will use the full 10.8 Supplies.\n\nSo, for short trips, you\u0027re better off carrying more supplies: The 500 weighs the same as 600 liters of supplies, so if you need less than that, it\u0027s not saving you anything.  However, let\u0027s say you\u0027re on a 60-day trip: you need 648 supplies with no recyclers.  With a 500, you need 259.2.  That\u0027s nearly half a ton of supplies you no longer have to carry.  On a 100-day trip you save three quarters of a ton.  200-day trip you save a ton and a half.  Etc.  And this is per-Kerbal, with the least powerful recycler.\n\nThis works in synergy with a greenhouse: If you have recyclers you don\u0027t need to produce as many supplies, so you don\u0027t need as much capacity from your greenhouse - or you need fewer, which means you\u0027ll also need less Fertilizer, etc.\n\nNow, so far we\u0027ve been talking about one recycler - they do combine, but they do it in a bit of an odd way: If all of your recyclers are the same, you just add up their Kerbal capacity and you\u0027re done.  However, if you have one that\u0027s more efficient, then that sets the max total recycling percentage for your whole ship - and you can use more smaller ones to get that percentage.  So if we were to have an imaginary RT-700 that recycles for 1 Kerbal at 80%, with a crew of two you could use one 700 and two 500s to recycle for \\*everyone\\* at 80%.  (And still have some capacity left over, I think.)   This is why purifiers are nice, but situational: They can do up to 90% recycling, using water as an input - but \\*one\\* purifier means that\u0027s now the max for your whole base.  Really good when you have \\*lots\\* of Kerbals and access to water, not so useful for smaller crews or when you need to ship water in."},{"CreatedByName":"WuphonsReach","CreatedById":130759,"CreatedDateTime":"2017-02-13T22:58:49Z","Content":"If wear does come back in, I\u0027m hoping that it only has an effect as the part wears down below 20%.  Repair should probably be a mix of specialized parts, machinery and material kits.  For simplicity, you should be able to just right-click one module on the vessel and have it start with the most worn parts and refurb everything that it can (until it runs out of material)."},{"CreatedByName":"JadeOfMaar","CreatedById":167617,"CreatedDateTime":"2017-02-14T06:22:02Z","Content":"Here it goes. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022) Down the core stack: the undecided modified crew cabin \u0022short rec centre\u0022 with hab multiplier (and only 2 crew capacity for kerbals to really stretch their legs and store stuff to keep them sane but I\u0027ll still keep 4 crew if anyone insists), followed by the Agroponics with a more fitting texture (in order to emulate the Mk2 long cabin idea) then the discreet Recycler, then the \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E to produce Fertilizer. i might delete the \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E, or put it into a separate group.\n\nThe waste tanks (with black and brown spots) are changed to MaterialKits, SpecializedParts or Fertilizer with some Mulch storage.\n\n![eo4acV2.jpg](http://i.imgur.com/eo4acV2.jpg)\n\n![fupazak.jpg](http://i.imgur.com/fupazak.jpg)\n\nSpoiler\n\nWith lights. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022) \n\n![0O83H1s.jpg](http://i.imgur.com/0O83H1s.jpg)\n\n![xG5Dl3s.jpg](http://i.imgur.com/xG5Dl3s.jpg)"},{"CreatedByName":"brygun","CreatedById":141392,"CreatedDateTime":"2017-02-16T04:23:19Z","Content":"Im doing yet another replay of Kerbal and debating on which/if on life support mods. \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E is on my short list. One concern I have is what can happen during high time warps with multiple ships in play. For example if flying to Dres you might time warp over a year. You might have the Kerbals on the other ships die off or become non-recoverable. \n\nIm wondering how playable it is while still having some life support concerns. What are people\u0027s experiences and views on this over other life support?\n\n**Edited \u003Ctime datetime=\u00222017-02-16T04:24:35Z\u0022 title=\u002202/16/2017 04:24  AM\u0022 data-short=\u00227 yr\u0022\u003EFebruary 16, 2017\u003C/time\u003E by brygun**\n  \nmaking a clear question"},{"CreatedByName":"Fobok","CreatedById":73999,"CreatedDateTime":"2017-02-16T05:10:41Z","Content":"\u003E \n\u003E \n\u003E 37 minutes ago, brygun said:\n\u003E \n\u003E \n\u003E Im doing yet another replay of Kerbal and debating on which/if on life support mods. \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E is on my short list. One concern I have is what can happen during high time warps with multiple ships in play. For example if flying to Dres you might time warp over a year. You might have the Kerbals on the other ships die off or become non-recoverable. \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Im wondering how playable it is while still having some life support concerns. What are people\u0027s experiences and views on this over other life support?\n\u003E \n\u003E \n\u003E \n\u003E \n\nI did have that issue once, where I fast forwarded past a space station running out of supplies, though I had the difficulty set so they just became tourists rather than dying. There may be integration with \u003Cabbr title=\u0022Kerbal Alarm Clock (mod)\u0022\u003EKAC\u003C/abbr\u003E, but I\u0027m not sure, I haven\u0027t really looked into it. I\u0027d just been setting alarms manually since then.\n\nI do, however, think this is the best of the life support mods. For one thing, it doesn\u0027t over complicate the supply situation with separate resources you\u0027d always bring together anyway. You just have supplies to represent all of them. However, what I most like is that it takes habitation into account. That\u0027s something you don\u0027t see anywhere else. One of the big difficulties in long-distance space travel is having enough room for astronauts not to get too cramped over long voyages. Imagine spending years trapped in your car, unable to leave. It just wouldn\u0027t work. Even the short duration of a few days was difficult for early astronauts in the tight early spacecraft."},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2017-02-16T09:52:02Z","Content":"\u003E \n\u003E \n\u003E 5 hours ago, brygun said:\n\u003E \n\u003E \n\u003E Im doing yet another replay of Kerbal and debating on which/if on life support mods. \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E is on my short list. One concern I have is what can happen during high time warps with multiple ships in play. For example if flying to Dres you might time warp over a year. You might have the Kerbals on the other ships die off or become non-recoverable. \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Im wondering how playable it is while still having some life support concerns. What are people\u0027s experiences and views on this over other life support?\n\u003E \n\nPlan ahead.  Use recyclers to diminish supply demand.  Use greenhouses to extend your supplies.  Use Kerbal Alarm Clock.\n\nProbably the only time you will have an issue with fixed duration missions, regardless of length, is if you planned poorly, and you\u0027re kinda hosed there regardless of whether you time warp or not."},{"CreatedByName":"Liquid5n0w","CreatedById":129089,"CreatedDateTime":"2017-02-16T14:14:10Z","Content":"\u003E \n\u003E \n\u003E 9 hours ago, brygun said:\n\u003E \n\u003E \n\u003E Im doing yet another replay of Kerbal and debating on which/if on life support mods. \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E is on my short list. One concern I have is what can happen during high time warps with multiple ships in play. For example if flying to Dres you might time warp over a year. You might have the Kerbals on the other ships die off or become non-recoverable. \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Im wondering how playable it is while still having some life support concerns. What are people\u0027s experiences and views on this over other life support?\n\u003E \n\nYou can use the mod that freezes them, I forget its name."},{"CreatedByName":"voicey99","CreatedById":166341,"CreatedDateTime":"2017-02-16T15:55:15Z","Content":"\u003E \n\u003E \n\u003E 1 hour ago, Liquid5n0w said:\n\u003E \n\u003E \n\u003E You can use the mod that freezes them, I forget its name.\n\u003E \n\nAssuming it\u0027s compatible, that\u0027s this mod:\n\n\u003Ciframe data-embedcontent=\u0022\u0022 frameborder=\u00220\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/112328-122-deepfreeze-v0232-8th-dec-2016\u0026do=embed\u0022\u003E\u003C/iframe\u003E\n\n(the \u003Cabbr title=\u0022Original Post(er). The first post in a thread, or the person who posted it.\u0022\u003EOP\u003C/abbr\u003E is pretty outdated btw) On its own, \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E-LS is a very simple LS mod ((fertiliser-\u003E)supplies-\u003Ekerbals), but when used with MKS (as is intended), \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E-LS is still simpler but harder than TAC, the main thing being habitation. In TAC you can just pack them off on a ship with all the various types of supplies they need and that\u0027s that, but in \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E-LS/MKS you have to give them both food (and power) and living quarters-while supplies are easily renewable, their habitation timers will constantly tick down and, unless you are very far along the MKS manufacturing tree, cannot be replenished without returning to Kerbin, though they can be extended with certain parts from MKS. It depends on your personal preference really, either you stick a load of TAC supply containers on your ship and be done with it or have to build a proper mothership with \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E-LS/MKS to stop your kerbals going nuts."},{"CreatedByName":"Gilph","CreatedById":150861,"CreatedDateTime":"2017-02-16T16:30:01Z","Content":"\u003E \n\u003E \n\u003E 12 hours ago, brygun said:\n\u003E \n\u003E \n\u003E Im doing yet another replay of Kerbal and debating on which/if on life support mods. \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E is on my short list. One concern I have is what can happen during high time warps with multiple ships in play. For example if flying to Dres you might time warp over a year. You might have the Kerbals on the other ships die off or become non-recoverable. \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Im wondering how playable it is while still having some life support concerns. What are people\u0027s experiences and views on this over other life support?\n\u003E \n\n\u003E \n\u003E \n\u003E 6 hours ago, RoverDude said:\n\u003E \n\u003E \n\u003E Plan ahead.  Use recyclers to diminish supply demand.  Use greenhouses to extend your supplies.  Use Kerbal Alarm Clock.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Probably the only time you will have an issue with fixed duration missions, regardless of length, is if you planned poorly, and you\u0027re kinda hosed there regardless of whether you time warp or not.\n\u003E \n\nIn addition, \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E will allow you to redshirt Kerbals, making them immune to the bad effects when you run out of stuff.  If you are unsure in your planning, send a redshirted Kerbal to test your design. Or, use the interface to disable the effects for everyone on your first trip."},{"CreatedByName":"Flamingo","CreatedById":164519,"CreatedDateTime":"2017-02-16T16:42:46Z","Content":"In mission control I found a rescue contract and quickly accepted it so I could get a new kerbal for my space program easily. Everything was going great, and after the rendezvous, I shifted to Munbrett\u0027s module to get him out on a quick EVA and over in the rescue module.  \n\nBut then this happened:  \n![agdo6EM.png](http://i.imgur.com/agdo6EM.png)\n\nDang it! ![:0.0:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif \u0022:0.0:\u0022)\n\nThis felt as bad as burning up in the atmosphere because your craft lost control because you didn\u0027t have enough hab-space.\n\nWell, guess I will have to use a winch or similar to get him down to Kerbin safely."},{"CreatedByName":"maja","CreatedById":168379,"CreatedDateTime":"2017-02-16T16:47:38Z","Content":"\u003E \n\u003E \n\u003E 4 minutes ago, Flamingo said:\n\u003E \n\u003E \n\u003E Dang it! ![:0.0:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif \u0022:0.0:\u0022)\n\u003E \n\n\u003Ciframe data-embedcontent=\u0022\u0022 frameborder=\u00220\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/141560-122-ksp-rescue-pod-validator-no-more-kerbals-spawning-in-inflatable-modules/\u0026do=embed\u0022\u003E\u003C/iframe\u003E"}]}