{"TopicId":105202,"ForumId":34,"TopicTitle":"[1.12.x] USI Life Support","CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2015-04-27T17:37:19Z","PageNum":33,"Articles":[{"CreatedByName":"rabidninjawombat","CreatedById":108889,"CreatedDateTime":"2015-09-05T03:55:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RoverDude\u0022 data-cite=\u0022RoverDude\u0022\u003E\u003Cdiv\u003EI will be adding almost no parts - I view that part as a framework for mods to extend (hence why it is toggleabgle).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m really looking foward to this!\u003C/p\u003E\n"},{"CreatedByName":"Vhaegrant","CreatedById":150722,"CreatedDateTime":"2015-09-05T11:01:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RoverDude\u0022 data-cite=\u0022RoverDude\u0022\u003E\u003Cdiv\u003EI will be adding almost no parts - I view that part as a framework for mods to extend (hence why it is toggleabgle).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks for the response \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI don\u0027t know how I didn\u0027t make the connection between Habitation space and the Workspace/Living space section of the \u0027Efficiency and Load\u0027 page on the USI Wiki. I take it they will be related or are they intended to be separate?\u003C/p\u003E\u003Cp\u003EI can throw in some additional MKV Inflatable Logistic Modules for 4 additional workspaces and consider them to be \u0027rest and relaxation\u0027 areas.\u003C/p\u003E\u003Cp\u003EAs to additional module assets, I suspect your stirling work on the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/133186-WIP-Karibou-Expedition-Rover\u0022 rel=\u0022external nofollow\u0022\u003EKaribou Expedition Rover\u003C/a\u003E will fill many of the gaps in my base building desires \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2015-09-08T21:08:34Z","Content":"\n\u003Cp\u003EShow and tell time \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Ug5Yl5S.png\u0022 alt=\u0022Ug5Yl5S.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe first new bit being added into USI-LS is the concept of living space.\u003C/p\u003E\u003Cp\u003EThis is expressed in two ways. First, how long a Kerbal has been away from Kerbin (a \u0027Home Sickness\u0027 factor). Better and roomier habs (or, habs that are not full to capacity) will increase this. This number does not go down, only up. So one very viable option is to just EVA all of your Kerbals and give them some \u0027alone\u0027 time (this is illustrated in the capsule above, where the \u0027home\u0027 value is different for the two Kerbals on board).\u003C/p\u003E\u003Cp\u003EThe second factor is all about being rested and comfortable in the short term. this one can go down, and is calculated based on the current circumstances (i.e. 44 days is for a 30-day capsule at 66% capacity). Unlike homesickness, this number resets every time the Kerbal enters a new vessel. So building R\u0026amp;R facilities is totally a possibility.\u003C/p\u003E\u003Cp\u003ESo an example:\u003C/p\u003E\u003Cp\u003EYou could have a large MKS base that gives your crew lots of space (and helps with homesickness), but they still need decent living space, and will also need someplace to sleep if they leave their base (in, say, an ascent ship or a Rover).\u003C/p\u003E\u003Cp\u003EIf *EITHER* of these numbers fail, your Kerbal gets sad and will take a penalty (fully configurable of course).\u003C/p\u003E\u003Cp\u003ELastly. The scavenging mechanic (where they poke around looking for food) is in place. I\u0027ll be using a chunk of this logic to also allow Kerbals to \u0027rest\u0027 in disconnected bases/modules. So a lander that lands near your R\u0026amp;R station can take advantage of it without having to manually disembark your Kerbals.\u003C/p\u003E\u003Cp\u003E(Most of this is wrapped up - ETA is \u0027soon\u0027)\u003C/p\u003E\n"},{"CreatedByName":"Businfu","CreatedById":116782,"CreatedDateTime":"2015-09-09T00:33:59Z","Content":"\n\u003Cp\u003EGotta say that even post show-and-tell I\u0027m not sure I understand the mechanic. Then again, I\u0027d rather you not waste any time explaining it and instead release it so I can try it out!!\u003C/p\u003E\n"},{"CreatedByName":"monstah","CreatedById":95210,"CreatedDateTime":"2015-09-09T13:34:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RoverDude\u0022 data-cite=\u0022RoverDude\u0022\u003E\u003Cdiv\u003EThis is expressed in two ways. First, how long a Kerbal has been away from Kerbin (a \u0027Home Sickness\u0027 factor). Better and roomier habs (or, habs that are not full to capacity) will increase this. This number does not go down, only up. So one very viable option is to just EVA all of your Kerbals and give them some \u0027alone\u0027 time (this is illustrated in the capsule above, where the \u0027home\u0027 value is different for the two Kerbals on board).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis wording is confusing. Better and roomier habs increase home sickness? Give them \u0027alone\u0027 time for what, if the number doesn\u0027t go down? Is it possible you mixed both factors in your explanation?\u003C/p\u003E\u003Cp\u003EIn any case, this sounds promising.\u003C/p\u003E\n"},{"CreatedByName":"Vhaegrant","CreatedById":150722,"CreatedDateTime":"2015-09-09T14:03:20Z","Content":"\n\u003Cp\u003EI came for the rocket science I stay for the Sims in Space \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI wonder just how far the interaction of Kerbals can go? Additional stats to reflect introversion/extroversion (need to be alone or with others), additional types of Kerbals beyond Pilot, Engineer, Scientist, Tourist to ease Homesickness such as \u0027Family\u0027. Kerbals that just don\u0027t work well together.\u003C/p\u003E\u003Cp\u003EProbably not at the harder mechanical edge of space exploration but social interaction and the long term psychological impact of isolation stand to be the big limiters of deep space exploration.\u003C/p\u003E\n"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2015-09-09T14:17:02Z","Content":"\n\u003Cp\u003EThen we shall try a rephrasing \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAssume that all parts have a rating. This is essentially how many Kerbal-months you can stuff a Kerbal into them without said Kerbal going bananas (and something bad happening). \u003C/p\u003E\u003Cp\u003EThe default is one Kerbal-Month (KM) per crew capacity. Hence, any default pod or structural element, when stuffed 100%, will have a rating of 30 days (and these are Kerbal six-hour days for clarity). Now. Odds are, you\u0027re going to want a mission longer than 30 days. So you have two choices: Add more hab space, or send less Kerbals. \u003C/p\u003E\u003Cp\u003ETo make adding hab space easier, I am adding in a partmodule that allows you to design parts specifically for habitation (and lets you plunk in, via a field, a KM rating). \u003C/p\u003E\u003Cp\u003EAdd up all of the KM\u0027s from crew capacity and KM\u0027s from your hab parts in this and other nearby ships (since disconnected bases are supported), as well as all of the crew in that range, and you have your hab rating.\u003C/p\u003E\u003Cp\u003EExample: A Karibou cab has a crew capacity of 3 and a KM bonus of 1 (because of the little bunk I added to the IVA) for a total of 4. The two inflatable emergency shelters have a crew capacity of 2 each, and a KM bonus of 10 each (for a total of 2\u002B2\u002B10\u002B10, or, 24 KMs). Note that the KM bonus only applies when inflatables are actually inflated \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo. That Karibou above has a KM rating of 8 when the shelters are deflated (3\u002B1\u002B2\u002B2), and an additional 20 (10\u002B10) when both shelters are inflated, for a max of 28 KMs.\u003C/p\u003E\u003Cp\u003EAssuming it has a full cab of 3 Kerbals, your final habitation rating is 9.3 months, or 280 days (we\u0027ll be using days in the rest of our examples, though in actuality we track it down to the second). \u003C/p\u003E\u003Cp\u003ENow. let\u0027s put these new numbers into practice.\u003C/p\u003E\u003Cp\u003EA Kerbal has TWO timers. The first, is how long they have been gone from Kerbin. So, let us assume you launched said Karibou to the Mun in preparation for building a larger ground base. We compare the time they departed Kerbin against the hab rating calculated above. So as long as they have better digs within 280 days, you\u0027re golden.\u003C/p\u003E\u003Cp\u003ENow let\u0027s say it\u0027s day 200.. and they finish their base. This new base has a hab rating of 1000. Since it\u0027s 200 days out from Kerbin, our brave explorers will tolerate it for another 800 days. This is the \u0027Home\u0027 value you see in the sample screenshot. The hab rating used to calculate this never goes down, only up (and you will see why below). \u003C/p\u003E\u003Cp\u003ESo, let\u0027s assume it is now day 300 since the crew left Kerbin. If your crew were still in the Karibou, they would all have gone nuts, unless they watney\u0027d it up, and you had only one Kerbal taking advantage of all of that open space (in which case, you could stick around for a sweet 840 days). Your base (which started with a rating of 1000) is still good for another 700 days (1000-300). \u003C/p\u003E\u003Cp\u003ESo what happens if your crew needs to take a spin in the Karibou?\u003C/p\u003E\u003Cp\u003EWell, it turns out we track TWO numbers. The first is what we\u0027ve seen so far, and based on Kerbin mission time and the HIGHEST hab rating the Kerbal has seen. So as your Kerbal moves from ship to ship, it looks and sees if said Kerbal can get an upgrade.\u003C/p\u003E\u003Cp\u003EThe second number is reset every time a Kerbal enters a vessel.\u003C/p\u003E\u003Cp\u003ESo in the example above, our first number (our Home value) is still \u002B700 (1000-300). Since they entered the base on day 200, their \u0027Rest\u0027 number is \u002B800 (1000-200). If they leave on day 300 to go take a trip in the Karibou, their rest number becomes 280 (0 \u002B the Karibou\u0027s 280 hab rating).\u003C/p\u003E\u003Cp\u003EAt this point, Home is \u002B700 and Rest is \u002B280, so all is good. \u003C/p\u003E\u003Cp\u003EOur Kerbals go running around for 250 days (cutting it close). They then re-enter the base. They have been off Kerbin for 550 days (300 \u002B 250). So their new Home rating upon entering the base is \u002B450 (1000-550). Their new Rest rating is 1000 (1000-0) because Rest resets every time they change ships.\u003C/p\u003E\u003Cp\u003EThis crew will of course have to find better digs or get rotated out in 450 days, since if EITHER of the numbers goes below 0, bad things happen (so in the same vein, if the rover trip above became a bit more permanent, the crew would have had bad things happen past day 280, even though at that time their Home value would have still been \u002B420).\u003C/p\u003E\u003Cp\u003ENow, that was a lot of stuff. But suffice it to say it can boil down to \u0027Have enough space to make your crew happy long term, and if you\u0027re moving around, make sure you have enough space to make them happy for the duration of their trip away from the main base\u0027.\u003C/p\u003E\u003Cp\u003EHope that helps a bit \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-09T14:27:28Z\u0022 title=\u002209/09/2015 02:27  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 9, 2015\u003C/time\u003E by RoverDude\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Bloody_looser","CreatedById":95664,"CreatedDateTime":"2015-09-09T14:26:30Z","Content":"\n\u003Cp\u003ESo, these timers apply to a said kerbal in a said vessel and not to the vessel itself? That\u0027s nice.\u003C/p\u003E\n"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2015-09-09T14:52:30Z","Content":"\n\u003Cp\u003EThey are tied to the kerbal but based on the vessel stats\u003C/p\u003E\n"},{"CreatedByName":"Sharkman Briton","CreatedById":148040,"CreatedDateTime":"2015-09-09T15:27:55Z","Content":"\n\u003Cp\u003EHey, Rover, I started work on a mod adding a resource inspired a bit by Karborundum, but it\u0027s a bit of a mess ATM (1.25m Xenon Tank missing colour, ISRU and Ion Engine gone.) so some help from you would be very appreciated, and any tips for mod-making is as well.\u003C/p\u003E\u003Cp\u003EHeres the post for it. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/133849-The-Unobtanium-Mod-My-first-attempt-at-a-mod?p=2186653#post2186653\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/133849-The-Unobtanium-Mod-My-first-attempt-at-a-mod?p=2186653#post2186653\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-09T15:30:13Z\u0022 title=\u002209/09/2015 03:30  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 9, 2015\u003C/time\u003E by Sharkman Briton\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"mhoram","CreatedById":78756,"CreatedDateTime":"2015-09-09T16:20:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RoverDude\u0022 data-cite=\u0022RoverDude\u0022\u003E\u003Cdiv\u003E ... long post ...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks for the details.\u003C/p\u003E\u003Cp\u003EDo I understand the system correct:\u003C/p\u003E\u003Cp\u003EI have a station in LKO with a crew-capacity of 100 Kerbal Years.\u003C/p\u003E\u003Cp\u003EI dock a small ship (crew capacity of 1 Kerbal month) with a single Kerbal and his Home-number should be set to 100 Kerbal Years.\u003C/p\u003E\u003Cp\u003EI undock and send the Kerbal in his small ship on a 100 year trip and once a month just before the Rest number goes down to 0, I go to Eva for 5 seconds so that the rest timer resets.\u003C/p\u003E\u003Cp\u003EIn this setup I can let the Kerbal travel 100 years in a small ship.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RoverDude\u0022 data-cite=\u0022RoverDude\u0022\u003E\u003Cdiv\u003EThe scavenging mechanic (where they poke around looking for food) is in place.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGood news. Looking forward to that - had some problems with the pilot of the USI-Logistics-rover quitting because he ran out of supplies, which ment that supplies were no longer distributed, because the logistics rover stopped working.\u003C/p\u003E\n"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2015-09-09T17:15:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mhoram\u0022 data-cite=\u0022mhoram\u0022\u003E\u003Cdiv\u003EThanks for the details.\u003Cp\u003EDo I understand the system correct:\u003C/p\u003E\u003Cp\u003EI have a station in LKO with a crew-capacity of 100 Kerbal Years.\u003C/p\u003E\u003Cp\u003EI dock a small ship (crew capacity of 1 Kerbal month) with a single Kerbal and his Home-number should be set to 100 Kerbal Years.\u003C/p\u003E\u003Cp\u003EI undock and send the Kerbal in his small ship on a 100 year trip and once a month just before the Rest number goes down to 0, I go to Eva for 5 seconds so that the rest timer resets.\u003C/p\u003E\u003Cp\u003EIn this setup I can let the Kerbal travel 100 years in a small ship.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYep And I am ok with that setup, because it means your Kerbal is at least getting outside and being able to do some interesting things.\u003C/p\u003E\n"},{"CreatedByName":"Vhaegrant","CreatedById":150722,"CreatedDateTime":"2015-09-09T17:46:28Z","Content":"\n\u003Cp\u003EWould you even need to place the larger habitation in orbit?\u003C/p\u003E\u003Cp\u003EBuilding a large tent city by the side of the runway and walking your Kerbals to it and then back to a spaceplane for getting them into orbit should work the same.\u003C/p\u003E\n"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2015-09-09T17:58:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vhaegrant\u0022 data-cite=\u0022Vhaegrant\u0022\u003E\u003Cdiv\u003EWould you even need to place the larger habitation in orbit?\u003Cp\u003EBuilding a large tent city by the side of the runway and walking your Kerbals to it and then back to a spaceplane for getting them into orbit should work the same.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESure, for your long term timer. Though you\u0027re still stuck with constantly moving Kerbals around to keep things interesting... which sounds fine in theory but would be an absolute bear in practice. Eventually, you\u0027re going to want a larger hab where you plan on having said Kerbals hang out. i.e. imagine having to place alarm clocks every 30 days on a two year transfer... and missing even one of them hoses your mission. Not fun. Far better to just include appropriate space.\u003C/p\u003E\n"},{"CreatedByName":"Vhaegrant","CreatedById":150722,"CreatedDateTime":"2015-09-09T18:13:15Z","Content":"\n\u003Cp\u003EI appreciate the micro-management would be a bit of a nightmare \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ELooking forward to the release so I can see how it works in game.\u003C/p\u003E\u003Cp\u003EWhen setting the Habitation rating on the Karibou in the example if you got the other passengers to take a long walk, or just dropped them off and went for a quick spin, would it then reset the Hab rating to the 9.3 month mark? Of course you\u0027d need to do that for each Kerbal in the rover.\u003C/p\u003E\u003Cp\u003EAny thoughts about the effects of being planetside as opposed to being in orbit or in transfer? Or are Kerbals just inherently homesick?\u003C/p\u003E\n"},{"CreatedByName":"IggyHitokage","CreatedById":145193,"CreatedDateTime":"2015-09-09T18:25:48Z","Content":"\n\u003Cp\u003EI\u0027m not entirely sure if this is the correct place to ask, but since some of us play with planet packs, we\u0027re generally looking at multi-year interplanetary travel just from Kerbin alone, not even accounting for an ideal window back plus travel time. Would Deep Freeze be able to counter or even halt the effects of habitation, at least until they\u0027re unfrozen? I know it currently supports USI-LS for Supply-freeze, but it would be reassuring that they can also tack on habitation alongside that.\u003C/p\u003E\n"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2015-09-09T18:27:33Z","Content":"\n\u003Cp\u003ESame as life support, being on Kerbin below a certain altitude kicks in the reset. Once you\u0027re in orbit, you are following the homesick hab rules.\u003C/p\u003E\u003Cp\u003EAnd yes, if folks take the long walk space is freed up and the numbers go up for remaining crew. They can later return, and the folks \u0027left alone\u0027 retain their higher home value though their rest value will go back down (this is shown in the screenshot above).\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022IggyHitokage\u0022 data-cite=\u0022IggyHitokage\u0022\u003E\u003Cdiv\u003EI\u0027m not entirely sure if this is the correct place to ask, but since some of us play with planet packs, we\u0027re generally looking at multi-year interplanetary travel just from Kerbin alone, not even accounting for an ideal window back plus travel time. Would Deep Freeze be able to counter or even halt the effects of habitation, at least until they\u0027re unfrozen? I know it currently supports USI-LS for Supply-freeze, but it would be reassuring that they can also tack on habitation alongside that.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETotally depends on how DeepFreeze works it, but I\u0027d expect you would just need appropriate habs that can handle multi-year voyages (MKS/OKS would have these).\u003C/p\u003E\n"},{"CreatedByName":"IggyHitokage","CreatedById":145193,"CreatedDateTime":"2015-09-09T18:43:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RoverDude\u0022 data-cite=\u0022RoverDude\u0022\u003E\u003Cdiv\u003ETotally depends on how DeepFreeze works it, but I\u0027d expect you would just need appropriate habs that can handle multi-year voyages (MKS/OKS would have these).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGuess we\u0027ll see, I\u0027m genuinely scared though. Fiddled with Transfer Window Planner and it\u0027s showing a 22-year minimum voyage for one of the outer planets. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Vhaegrant","CreatedById":150722,"CreatedDateTime":"2015-09-09T18:56:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RoverDude\u0022 data-cite=\u0022RoverDude\u0022\u003E\u003Cdiv\u003ESame as life support, being on Kerbin below a certain altitude kicks in the reset. Once you\u0027re in orbit, you are following the homesick hab rules.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI was really thinking about other planets and/or moons other than Kerbin, sorry if I wasn\u0027t clear.\u003C/p\u003E\u003Cp\u003EAre all planetary destinations eventually going to need a shift swap system ferrying the initial band of settlers back to Kerbin or brace for mutiny?\u003C/p\u003E\u003Cp\u003EShould the difference in planetary parameters (gravity/ temperature/ atmosphere) affect the homesickness? The more unlike Kerbin the quicker they get homesick.\u003C/p\u003E\n"},{"CreatedByName":"rabidninjawombat","CreatedById":108889,"CreatedDateTime":"2015-09-09T18:58:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022IggyHitokage\u0022 data-cite=\u0022IggyHitokage\u0022\u003E\u003Cdiv\u003EGuess we\u0027ll see, I\u0027m genuinely scared though. Fiddled with Transfer Window Planner and it\u0027s showing a 22-year minimum voyage for one of the outer planets. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI use Deep freeze currently with USI-LS and it works fine, the kerbals are pulled out of active and treated as Frozen(basically dead) so they do not use resources. I\u0027d imagine the DF Dev may need to update the mod for the new release of USI-LS, but i dont see why he wouldnt \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2015-09-09T19:37:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022IggyHitokage\u0022 data-cite=\u0022IggyHitokage\u0022\u003E\u003Cdiv\u003EGuess we\u0027ll see, I\u0027m genuinely scared though. Fiddled with Transfer Window Planner and it\u0027s showing a 22-year minimum voyage for one of the outer planets. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThen you better plan on building ark ships.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vhaegrant\u0022 data-cite=\u0022Vhaegrant\u0022\u003E\u003Cdiv\u003EI was really thinking about other planets and/or moons other than Kerbin, sorry if I wasn\u0027t clear.\u003Cp\u003EAre all planetary destinations eventually going to need a shift swap system ferrying the initial band of settlers back to Kerbin or brace for mutiny?\u003C/p\u003E\u003Cp\u003EShould the difference in planetary parameters (gravity/ temperature/ atmosphere) affect the homesickness? The more unlike Kerbin the quicker they get homesick.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENope, Kerbin is Kerbin. Homesick is kinda a misnomer, it\u0027s really an abstraction over wear and tear, personal space, comfort, etc.\u003C/p\u003E\u003Cp\u003EThat being said, I\u0027m not opposed to having a multiplier that helps out based on the situation.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rabidninjawombat\u0022 data-cite=\u0022rabidninjawombat\u0022\u003E\u003Cdiv\u003EI use Deep freeze currently with USI-LS and it works fine, the kerbals are pulled out of active and treated as Frozen(basically dead) so they do not use resources. I\u0027d imagine the DF Dev may need to update the mod for the new release of USI-LS, but i dont see why he wouldnt \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECorrect, because being dead won\u0027t help with this as it\u0027s not a resource consumption issue \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2015-09-09T19:52:24Z","Content":"\n\u003Cp\u003EIf someone is playing with deadly USILS, is the habitation aspect separate? Ie: If I run out of actual LS, my guys die, but if 3 are sent to Eeloo in nothing but a mk1-2 pod, they\u0027ll go crazy and on strike long before they run out of the massive stack of LS I included?\u003C/p\u003E\n"},{"CreatedByName":"DigitalProeliator","CreatedById":75677,"CreatedDateTime":"2015-09-09T20:22:29Z","Content":"\n\u003Cp\u003EI think having the option for something to reset the Homesick value would be a must for some mods like Civilian Population if people want to keep using USI-LS. Not having that option would totally hose my plan on colonizing the other planets or systems with some planet mods.\u003C/p\u003E\n"},{"CreatedByName":"monstah","CreatedById":95210,"CreatedDateTime":"2015-09-09T20:26:09Z","Content":"\n\u003Cp\u003EGreat explanation, RoverDude. I\u0027m completely okay with your setup and it\u0027s implications, and of the use of the word \u0022Watney\u0027d\u0022. Looking forward to it!\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RoverDude\u0022 data-cite=\u0022RoverDude\u0022\u003E\u003Cdiv\u003EThat being said, I\u0027m not opposed to having a multiplier that helps out based on the situation.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESay, the presence of oxygen in the atmosphere, for example.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-10T01:44:20Z\u0022 title=\u002209/10/2015 01:44  AM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 10, 2015\u003C/time\u003E by monstah\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2015-09-09T20:33:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tater\u0022 data-cite=\u0022tater\u0022\u003E\u003Cdiv\u003EIf someone is playing with deadly USILS, is the habitation aspect separate? Ie: If I run out of actual LS, my guys die, but if 3 are sent to Eeloo in nothing but a mk1-2 pod, they\u0027ll go crazy and on strike long before they run out of the massive stack of LS I included?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s a separate flag so you can mix and match.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DigitalProeliator\u0022 data-cite=\u0022DigitalProeliator\u0022\u003E\u003Cdiv\u003EI think having the option for something to reset the Homesick value would be a must for some mods like Civilian Population if people want to keep using USI-LS. Not having that option would totally hose my plan on colonizing the other planets or systems with some planet mods.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EResetting is the wrong answer. Having habitats that can have extraordinarily long habitation values is the right answer, and the design intent.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022monstah\u0022 data-cite=\u0022monstah\u0022\u003E\u003Cdiv\u003EGreat explanation, RoverDude. I\u0027m completely okay with your setup and it\u0027s implications, and of the use of the word \u0022Whatney\u0027d\u0022. Looking forward to it!\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003ESay, the presence of oxygen in the atmosphere, for example.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECorrect\u003C/p\u003E\n"}]}