{"TopicId":105202,"ForumId":34,"TopicTitle":"[1.12.x] USI Life Support","CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2015-04-27T17:37:19Z","PageNum":41,"Articles":[{"CreatedByName":"Mynar Moonshadow","CreatedById":118328,"CreatedDateTime":"2015-11-17T10:26:44Z","Content":"[quote name=\u0027Venusgate\u0027]It may be my playstyle, but a trip to minmus and back takes dangerously close to 15 days. But a snacks for one for 15 days is way too little to use the 1.25 tank, or even an asymmetrical radial tank. Any chance of a wee tank, or procedural parts cfg?[/QUOTE]  \n\nUse one or two life support mini paks? the 1.25 holds 500 and the mini paks hold 100 each. They should be right before the 1.25 inline tanks in the list.  \n\n~M~  \n\n[COLOR=\u0022silver\u0022][SIZE=1]- - - Updated - - -[/SIZE][/COLOR]  \n\n[quote name=\u0027GokouZWAR\u0027]Ok no sweat. I\u0027ve already rolled back to 1.5, but if it won\u0027t make a diff i\u0027ll put it back to \u00221.6\u0022 and roll with it. [/QUOTE]  \n\nUsing the previous version will cause all kinds of exceptions to be thrown. At least it did for me when I tried the same thing while testing.  \n\n[COLOR=\u0022silver\u0022][SIZE=1]- - - Updated - - -[/SIZE][/COLOR]  \n\n[quote name=\u0027GokouZWAR\u0027] ... This apparently has worked perfectly, because now she\u0027s back to engineer status. :) Are there any other places I should modify?[/QUOTE]  \n\nIf you can recall what each one was that you hired, it will work for you, certainly. You could even change all of the orange suits to be pilots if you felt like it. However, I will stand by what I said earlier ... give RD a chance to fix whatever is causing the problem. He\u0027ll find it and drop a MKS base on it to squish it permanently. Doing a \u0022workaround\u0022 to solve your immediate issue is completely legit, but let\u0027s not take this too far and assume it will not get fixed pretty fast.  \n\n~M~\n\n**Edited \u003Ctime datetime=\u00222015-11-17T10:30:40Z\u0022 title=\u002211/17/2015 10:30  AM\u0022 data-short=\u00228 yr\u0022\u003ENovember 17, 2015\u003C/time\u003E by Mynar Moonshadow**\n  \nspeeling optional"},{"CreatedByName":"Kershu5","CreatedById":143297,"CreatedDateTime":"2015-11-17T21:59:12Z","Content":"One more issue.. I resupplied a base that ran out of food, but the engineers within are still Tourists. ..I don\u0027t have to send them home to Kerbin first do I?"},{"CreatedByName":"Johould","CreatedById":152248,"CreatedDateTime":"2015-11-17T23:15:35Z","Content":"Resupplying the base is supposed to be enough. This thing with tourists seems to be a bug in the latest release or in it\u0027s interactions with 1.0.5 (which started recording professions in the save file, instead of computing them from names)."},{"CreatedByName":"GokouZWAR","CreatedById":142307,"CreatedDateTime":"2015-11-18T04:26:31Z","Content":"[quote name=\u0027Kershu5\u0027]One more issue.. I resupplied a base that ran out of food, but the engineers within are still Tourists. ..I don\u0027t have to send them home to Kerbin first do I?[/QUOTE]  \n\n[quote name=\u0027Johould\u0027]Resupplying the base is supposed to be enough. This thing with tourists seems to be a bug in the latest release or in it\u0027s interactions with 1.0.5 (which started recording professions in the save file, instead of computing them from names).[/QUOTE]  \n\nIf you read up above, this is what we\u0027ve been discussing. Its apparently a known issue. Unfortunatly when this happened to me, (when the kerbals ran out of supplies and turned to tourists) they are permanatly changed to tourists. I\u0027ve done some hacking to my save file to restore them back to \u0022normal\u0022 again, but unless you know what they were prior and you\u0027re comfortable working in your save file by hand, your best bet is to wait until a fix is in place or don\u0027t let your kerbals run out of supplies."},{"CreatedByName":"Kershu5","CreatedById":143297,"CreatedDateTime":"2015-11-18T04:27:59Z","Content":"My apologies, Gokou, didn\u0027t realize, you\u0027re right I should have read. So.. Huh. Permanently. Well if you could, how do I adjust that save file? I don\u0027t know what to look for."},{"CreatedByName":"GokouZWAR","CreatedById":142307,"CreatedDateTime":"2015-11-18T04:32:08Z","Content":"[quote name=\u0027Mynar Moonshadow\u0027]  \n\nUsing the previous version will cause all kinds of exceptions to be thrown. At least it did for me when I tried the same thing while testing. If you can recall what each one was that you hired, it will work for you, certainly. You could even change all of the orange suits to be pilots if you felt like it. However, I will stand by what I said earlier ... give RD a chance to fix whatever is causing the problem. He\u0027ll find it and drop a MKS base on it to squish it permanently. Doing a \u0022workaround\u0022 to solve your immediate issue is completely legit, but let\u0027s not take this too far and assume it will not get fixed pretty fast.~M~[/QUOTE]  \n\nnormally I\u0027d agree but roverdude hasn\u0027t said anything yet...he also hasn\u0027t been streaming the past few days so i\u0027m thinking he\u0027s on a leave for a bit which is fine, he works pretty hard already. Just worries me that with the holiday coming up soon he may not be as into doing development right now and i\u0027m trying to get as much streaming in before next monday when albion online\u0027s closed beta starts up again.  \n\n[COLOR=silver][SIZE=1]- - - Updated - - -[/SIZE][/COLOR]  \n\n[quote name=\u0027Kershu5\u0027]My apologies, Gokou, didn\u0027t realize, you\u0027re right I should have read. So.. Huh. Permanently. Well if you could, how do I adjust that save file? I don\u0027t know what to look for.[/QUOTE]  \n\nits a couple of posts up on the previous page of what I edited. You\u0027ll need to search in the persistant.sfs file for the kerbal\u0027s name, then switch the three tags I noted. They\u0027re in two separate areas within the file for each kerbal.  \n\nOnce you\u0027re done editing it, don\u0027t forget to load the game, then do a quick f5 to overwrite the previous quicksave file with the changes. Otherwise the next time you quickload you\u0027ll have to do it all over again."},{"CreatedByName":"Kershu5","CreatedById":143297,"CreatedDateTime":"2015-11-18T04:54:23Z","Content":"Awesome, thanks Gokou! This makes my life worlds easier."},{"CreatedByName":"mreadshaw","CreatedById":135349,"CreatedDateTime":"2015-11-18T21:27:22Z","Content":"I\u0027ve taken a few months off KSP but looking to get back into it now. Just before I stopped this thread had quite a bit going on about requiring kerbals to have extra crew capacity for longer missions. The OP doesn\u0027t mention anything about that now though. Is it still a WIP or was it scrapped or moved to one of Roverdude\u0027s other awesome mods?"},{"CreatedByName":"GokouZWAR","CreatedById":142307,"CreatedDateTime":"2015-11-19T01:18:47Z","Content":"[quote name=\u0027mreadshaw\u0027]I\u0027ve taken a few months off KSP but looking to get back into it now. Just before I stopped this thread had quite a bit going on about requiring kerbals to have extra crew capacity for longer missions. The OP doesn\u0027t mention anything about that now though. Is it still a WIP or was it scrapped or moved to one of Roverdude\u0027s other awesome mods?[/QUOTE]  \n\nNo, its still going. Theres a minor bug if you let the kerbals run out of supplies...so don\u0027t. ;) They turn into permanent tourists...:("},{"CreatedByName":"smjjames","CreatedById":134004,"CreatedDateTime":"2015-11-19T01:25:46Z","Content":"[quote name=\u0027GokouZWAR\u0027]No, its still going. Theres a minor bug if you let the kerbals run out of supplies...so don\u0027t. ;) They turn into permanent tourists...:([/QUOTE]  \n\nRofl, do they seriously change their status to tourist?  \n\nYou can probably fix that by editing the persistence file, in theory."},{"CreatedByName":"Kowgan","CreatedById":116874,"CreatedDateTime":"2015-11-19T01:42:39Z","Content":"That\u0027ll never happen to my saves, as I set CausesDeath = true :cool:  \n\nI\u0027m so evil."},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2015-11-19T02:37:12Z","Content":"FYI I\u0027ll be working on this this week and sorting the permanent tourist bug. Patience and all that, please."},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2015-11-19T16:12:04Z","Content":"[SIZE=5][B][COLOR=#FF0000]0.1.7.0 IS UP[/COLOR][/B][/SIZE]  \n\n0.1.7 - 2015.11.19  \n\n------------------  \n\nPushed version number up a bit due to some version number shenanigans  \n\nAdjusted mass of Nom-O-Matic 5000 (thanks mhoram!)  \n\nCorrected various part costs (thanks fat-lobyte!)  \n\nFixed an issue where returned Kerbals were remaining tourists  \n\n[COLOR=\u0022silver\u0022][SIZE=1]- - - Updated - - -[/SIZE][/COLOR]  \n\nMinor addendum - if you have Kerbals that should not be tourists, just remove the \u0027trait = Tourist\u0027 line from the persistence file and it will reset to their correct trait automagically."},{"CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-11-19T16:59:46Z","Content":"[quote name=\u0027RoverDude\u0027][SIZE=5][B][COLOR=#FF0000]0.1.7.0 IS UP[/COLOR][/B][/SIZE][/QUOTE]  \n\nExcellent! Have been meaning to add life support to the comics for Kerbfleet\u0027s next big mission."},{"CreatedByName":"Sonokort","CreatedById":153825,"CreatedDateTime":"2015-11-19T19:55:59Z","Content":"Hi there,   \n\nI have a short question. Is it normal that Kerbals only start \u0022starving\u0022 as soon as they are leaving Kerbin atmosphere?  \n\nBecause currently I\u0027m having the issue that when Kerbals are in a Vessel at Kerbins Atmosphere (doesnt matter if flying or not)  \n\nthey will use any supplies on board, but as soon as these run out the timer stops at zero. They wont start \u0022starving\u0022.  \n\nThe timer only starts running again/ they start starving if you reaches the upper atmosphere/space.  \n\nI tried to stay a few days in Orbit and returned when they only had like one day left before they would have died. When I left space the timer resetted completely to zero and they had 15 left again.  \n\nMy Question(s) is (are): Is this some sort of intentional Feature? Did maybe I just do something wrong? Or is this simply something that still needs to be fixed?  \n\nThanks in advance for any help."},{"CreatedByName":"ExplorerKlatt","CreatedById":107424,"CreatedDateTime":"2015-11-19T23:10:47Z","Content":"IIRC, kerbals do not use any supplies below 50km on kerbin. It is assumed that they can be resupplied on their own planet."},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2015-11-19T23:24:28Z","Content":"They do not NEED the supplies, but they will happily stuff their faces if they are available - at least the last time I read/checked/..."},{"CreatedByName":"mreadshaw","CreatedById":135349,"CreatedDateTime":"2015-11-20T19:29:57Z","Content":"[quote name=\u0027GokouZWAR\u0027]No, its still going. Theres a minor bug if you let the kerbals run out of supplies...so don\u0027t. ;) They turn into permanent tourists...:([/QUOTE]  \n\nCool thanks! Is there information about how it works somewhere and is it included in the main download or a special WIP version? I\u0027ll download and check it out!"},{"CreatedByName":"howkong","CreatedById":127511,"CreatedDateTime":"2015-11-22T04:13:05Z","Content":"[quote name=\u0027RoverDude\u0027][SIZE=5][B][COLOR=#FF0000]0.1.7.0 IS UP[/COLOR][/B][/SIZE]  \n\n0.1.7 - 2015.11.19  \n\n------------------  \n\nPushed version number up a bit due to some version number shenanigans  \n\nAdjusted mass of Nom-O-Matic 5000 (thanks mhoram!)  \n\nCorrected various part costs (thanks fat-lobyte!)  \n\nFixed an issue where returned Kerbals were remaining tourists  \n\n[COLOR=silver][SIZE=1]- - - Updated - - -[/SIZE][/COLOR]  \n\nMinor addendum - if you have Kerbals that should not be tourists, just remove the \u0027trait = Tourist\u0027 line from the persistence file and it will reset to their correct trait automagically.[/QUOTE]  \n\nUm...Does this conflict with TAC-LS? Or does it cover all the functions of TAC-LS? Some of my other installed mods might have dependencies on TAC-LS..."},{"CreatedByName":"goldenpsp","CreatedById":113874,"CreatedDateTime":"2015-11-22T07:29:09Z","Content":"[quote name=\u0027howkong\u0027]Um...Does this conflict with TAC-LS? Or does it cover all the functions of TAC-LS? Some of my other installed mods might have dependencies on TAC-LS...[/QUOTE]  \n\nIt is another Life support mod yes. You don\u0027t want to run 2 separate LS mods generally. Your Kerbals will get confused on what they are supposed to eat."},{"CreatedByName":"Kowgan","CreatedById":116874,"CreatedDateTime":"2015-11-22T07:48:55Z","Content":"I\u0027m really curious to see the fatigue thing (time outside of Kerbin) come into play. While I\u0027ll love to have a reason to cycle kerbals on stations and bases, I\u0027m also concerned about missions whithout an easy return ticket, like an Eve trip. Can\u0027t wait to see how\u0027s R.Dude\u0027s gonna solve that."},{"CreatedByName":"TheDog","CreatedById":137239,"CreatedDateTime":"2015-11-22T17:24:40Z","Content":"Not sure whether this is related to 1.0.5 itself, or just due to the latest USI-LS update...  \n\nI am quite sure I always had the LifeSuport icon in the aplauncher in the space center scene (or at least in the tacking station), giving me an immediate overview of all vessels and their LS status.  \n\nNow I only get the icon in the applauncher when flying a vessel, which is somewhat inconvenient.  \n\nWas this an intended change?  \n\nAny chance of bringing back the icon to the space center and/or tracking station?"},{"CreatedByName":"Domfluff","CreatedById":64903,"CreatedDateTime":"2015-11-25T10:17:59Z","Content":"I\u0027m really looking forward to the whole Home/Rest mechanics - that seems like it\u0027s a major missing piece right now, and gives meaning to part packs like Porkjet\u0027s inflatable hab modules, which otherwise are just crew cabins.  \n\nI really like \u0022Homesickness\u0022 as a term - it\u0027s descriptive and whimsical, in the same way that Mulch is, and more importantly it\u0027s meaning is strongly intuitive - you cure homesickness by going home.  \n\nI\u0027m not sure if \u0022Rest\u0022 is equally intuitive though? Since this apparently resets on EVA, would something like \u0022Boredom\u0022 be a little clearer? \u0022Fatigue\u0022 would imply to me that \\*not\\* using the Kerbal would be the way to restore fatigue, but \u0022Boredom\u0022 would imply that this Kerbal needs to get up and do something.  \n\n(This is mostly assuming I\u0027ve got a decent handle on how this is intended to work)."},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2015-11-25T22:27:56Z","Content":"I\u0027d really love to use this, but my framerate becomes unbearably small when I do."},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2015-11-26T00:59:06Z","Content":"[quote name=\u0027spink00\u0027]I\u0027d really love to use this, but my framerate becomes unbearably small when I do.[/QUOTE]  \n\nSounds like you\u0027re not using a current version then, or have some other install issue."}]}