{"TopicId":105347,"ForumId":16,"TopicTitle":"Has anyone got a spaceplane in orbit yet?","CreatedByName":"Redshift OTF","CreatedById":78679,"CreatedDateTime":"2015-04-27T21:10:22Z","PageNum":3,"Articles":[{"CreatedByName":"Johno","CreatedById":1491,"CreatedDateTime":"2015-04-28T11:18:50Z","Content":"\n\u003Cp\u003EIt\u0027s worth remembering that, if the aerodynamics are more realistic, it SHOULD be difficult to get an SSTO into orbit. After all, there\u0027s a reason they don\u0027t get used in real life!\u003C/p\u003E\n"},{"CreatedByName":"djnekkid","CreatedById":36328,"CreatedDateTime":"2015-04-28T11:25:03Z","Content":"\n\u003Cp\u003EIm at work now, so I cant post any pics, but building a SSTO were the first thing i did yesterday. Well, the only thing TBH ... Came home from work rather late (8pm ish).\u003C/p\u003E\u003Cp\u003EThe builds are about the same, but the flying is slightly different then before.\u003C/p\u003E\u003Cp\u003ESort of looked kinda like a Skylon, just with the engines close to the body, and not on the wingtips.\u003C/p\u003E\u003Cp\u003EFrom front to back I had:\u003C/p\u003E\u003Cp\u003EThe 2man aerodynamic cockpit\u003C/p\u003E\u003Cp\u003ELong tank of LFO\u003C/p\u003E\u003Cp\u003EShort tank of LF\u003C/p\u003E\u003Cp\u003ELong tank of LFO\u003C/p\u003E\u003Cp\u003Emk2 to 1m adapter\u003C/p\u003E\u003Cp\u003ENosecone just to look pretty\u003C/p\u003E\u003Cp\u003EI then sidemounted a precooler, with a ram intake in front, and rapiers in the back (with symmetry obviously)\u003C/p\u003E\u003Cp\u003ESome wings on the side, and some canards in the front, along with a tailfin. (I think the wings actually were the \u0022big\u0022 og \u0022huge tailfin\u0022 thingy)\u003C/p\u003E\u003Cp\u003EIt had plenti if fuel left when it were in a 80x80ish orbit. Could probably attach a cargobay and it could bring some sattelite, or something like that.\u003C/p\u003E\u003Cp\u003EThe return I had to do a few times, to get the hang of the deathzone, but retroburning roughly 90-100 degrees behind KSC did the trick. Aimed between \u0022the island\u0022 and \u0022the next continent\u0022, and I came in about at the mountains. A short jet-buring later, and i had landed.\u003C/p\u003E\u003Cp\u003EThe first couple if times i burned up, but keeping a roughly 20deg pitch up, along with the 4 aerobrakes i had attached did the trick. It seems it needs to sheed of enough velocity to be at about 8 or 900m/s at 20km altitude. Then everything seems fine.\u003C/p\u003E\u003Cp\u003ESwitching to fine controls when landing seemd to be a must, as the normal ones tended to overshoot what i intended.\u003C/p\u003E\n"},{"CreatedByName":"Cyk0","CreatedById":132280,"CreatedDateTime":"2015-04-28T11:29:27Z","Content":"\n\u003Cp\u003EGot to orbit easily with the first craft I built (After just plain overheating it in low atmo) Lost some peices during reentry. But overall I thought it was still easy but more interesting then previously.\u003C/p\u003E\u003Cp\u003EI did some testing that might be useful for some of you, seems like ram air intakes are no longer preferable since they are lost a bit to easy during reentry, shock cones seems to take a bit more heat or better still just pure engine nacelles are way more heat sturdy. (I haven\u0027t tested the inline intakes yet, they might be sturdy to)\u003C/p\u003E\u003Cp\u003ERapier is easy but limited if you want good ISP in orbit. Turbojets and Nerva is now even more handy with the ditching of oxidizer, sometimes (might be related to the preecolers the turbojets really push me hard) I have been using a totally different assent profile, no more high speed high altitude dash before shooting for orbit. I have had some very simple launches just building spaceplanes that are low drag and avoiding parts that burn of, and then just shooting out of the thick ~20 atmo at serious speed in 45% angle, just doing that can almost give you a 80 apoapsis and then you just circularize with the nervas. \u003C/p\u003E\u003Cp\u003EAir-brakes seem too good... Is that really just pure drag calculation? (Might be, my only fat plane so far did not do nearly the same speed as my thin ones) or it might just be me focusing on building heat resistant planes that think they make it to easy :/\u003C/p\u003E\u003Cp\u003EA well, when I get home today I\u0027l try to build a Nerva spaceplane miner that can go to minmus in a single stage (I hope it has deposits) After that most stuff should be within reach. Or maybe I\u0027l just polish my simple design to showcase how crazy easy it can be to launch an SSTO spaceplane now.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-04-28T12:40:43Z\u0022 title=\u002204/28/2015 12:40  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 28, 2015\u003C/time\u003E by Cyk0\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Xyrus","CreatedById":117194,"CreatedDateTime":"2015-04-28T11:38:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Captain_Party\u0022 data-cite=\u0022Captain_Party\u0022\u003E\u003Cdiv\u003EFirst thing I did in 1.0? Tried my hand at building an SSTO with the new aero model. Managed to get a small unmanned cargo space plane into orbit in 15 minutes from conception, to construction and finally to flight. \u003Cp\u003EStrangely, it\u0027s been much easier with the new aero. I could never make a reliable SSTO that worked with the old model.\u003C/p\u003E\u003Cp\u003ECheers, CP\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENew aero is much easier, at least for me. It works intuitively. The 3 day old pea-soup psuedo physics always screwed me up because the planes never worked the way I was intuitively expecting them to, especially on re-entry.\u003C/p\u003E\u003Cp\u003EI\u0027ve seen a number of complaints that the new aero and physics is \u0022just broken\u0022. It isn\u0027t. The old aero and physics were broken, and people just got used to it. Now you actually have to use real designs and real maneuvers for space planes. No more just dropping into the atmosphere. You actually have to use techniques like S curving to slow down or you\u0027ll burn your ship up. You can\u0027t just go nose in, you actually need to angle up like the shuttle.\u003C/p\u003E\n"},{"CreatedByName":"Duban","CreatedById":16399,"CreatedDateTime":"2015-04-28T11:56:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Johno\u0022 data-cite=\u0022Johno\u0022\u003E\u003Cdiv\u003E After all, there\u0027s a reason they don\u0027t get used in real life!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBecause the earth has four times the escape velocity of Kerbin? For reference, a round trip to Tylo has comparable delta-V to a moonlanding IRL. That\u0027s why SSTOs have always worked in KSP. Not because of the physics.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Xyrus\u0022 data-cite=\u0022Xyrus\u0022\u003E\u003Cdiv\u003ENew aero is much easier, at least for me. It works intuitively. The 3 day old pea-soup psuedo physics always screwed me up because the planes never worked the way I was intuitively expecting them to, especially on re-entry.\u003Cp\u003EI\u0027ve seen a number of complaints that the new aero and physics is \u0022just broken\u0022. It isn\u0027t. The old aero and physics were broken, and people just got used to it. Now you actually have to use real designs and real maneuvers for space planes. No more just dropping into the atmosphere. You actually have to use techniques like S curving to slow down or you\u0027ll burn your ship up. You can\u0027t just go nose in, you actually need to angle up like the shuttle.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAgreed. The new aerodynamics are incredible. I just glided a spaceplane onto the runway unpowered after missing my target. It\u0027s so much more intuitive and reliable.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-04-28T12:05:52Z\u0022 title=\u002204/28/2015 12:05  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 28, 2015\u003C/time\u003E by Duban\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Draekris","CreatedById":103172,"CreatedDateTime":"2015-04-28T12:07:07Z","Content":"\n\u003Cp\u003EThe new model definitely makes it much more difficult to get an SSTO into orbit, because of the heating effects (the new jets, especially rapier, are OP). I eventually managed to get into orbit by balancing on the line between speed and exploding due to compression heating, and I have to say I probably won\u0027t be using spaceplanes much anymore. This was my sixth or seventh attempt with this design (the others were ~500m/s short), and my fourth design attempt, the first to use rapiers.\u003C/p\u003E\u003Cp\u003EI have the heating display enabled so I can exactly how far I can push it. It\u0027s still glowing right now from getting into orbit.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/bk3uEOz.png\u0022 alt=\u0022bk3uEOz.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EPeriapse 74km, Apoapse 103km (I just burned until I was out of fuel)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/0PByFPD.png\u0022 alt=\u00220PByFPD.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"michaelsteele3","CreatedById":127113,"CreatedDateTime":"2015-04-28T12:13:30Z","Content":"\n\u003Cp\u003EReading this:\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EChallenge Accepted\u003C/strong\u003E\u003C/span\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"AmpsterMan","CreatedById":32671,"CreatedDateTime":"2015-04-28T12:27:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jarin\u0022 data-cite=\u0022Jarin\u0022\u003E\u003Cdiv\u003EAmpsterMan, what\u0027s your flight profile with that thing (i.e. how did you avoid exploding)? Also, is that really just two radial intakes under there?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E I don\u0027t quite remember the specifics because this was done during experimentals. Yes those are only two radials on the bottom. Space planing has on some ways become easier; in others harder. \u003C/p\u003E\u003Cp\u003ETo space plane, reduce drag as much as possible. Do this by streamling your craft. The less surfaces facing the airflow, the better. Reduce control surfaces and wings as much as possible; these produce a lot of drag. Make sure your planedoesn\u0027t need to fly at too steep an angle of attack; this reduces drag due to \u0022lifting backwards\u0022. \u003C/p\u003E\u003Cp\u003EYou need to be able to pass the sound barrier. Between Mach 0.8 to 1.2, drag skyrockets. Focus on beating the sound barrie first. Once you can beat it in a non spammy way (MOAR ENGINES) try to apply that lesson to spess planes.\u003C/p\u003E\u003Cp\u003ERapiers are indeed the best engines for very high altitude flight now.\u003C/p\u003E\n"},{"CreatedByName":"MainSailor","CreatedById":74050,"CreatedDateTime":"2015-04-28T12:27:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kaname\u0022 data-cite=\u0022Kaname\u0022\u003E\u003Cdiv\u003EBy the way... How do these new albums work?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPut the Imgur album code (without the #0) in between imgur tags. \u003C/p\u003E\u003Cp\u003ESo the album you posted would use (imgur)1LrUl(/imgur), but using brackets instead of parens\u003C/p\u003E\u003Cp\u003E...and look like:\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/1LrUl\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"diegzumillo","CreatedById":4869,"CreatedDateTime":"2015-04-28T13:59:57Z","Content":"\n\u003Cp\u003EI got it. Not very efficient but it makes it\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://minus.com/i/6KVxxIUVZmBP\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.minus.com/j6KVxxIUVZmBP.png\u0022 alt=\u0022j6KVxxIUVZmBP.png\u0022\u003E\u003C/a\u003E \u003C/p\u003E\u003Cp\u003EI made a thread to try and get a conversation about the new aerodynamics and described the process that got me to this plane but the thread didn\u0027t work.This community grew a lot over the years and, in the process, lost a lot of quality.\u003C/p\u003E\n"},{"CreatedByName":"Skyentist","CreatedById":107333,"CreatedDateTime":"2015-04-28T16:51:42Z","Content":"\n\u003Cp\u003EI just built a plane that gets into a 75x70km orbit... but has next to no fuel once there.\u003C/p\u003E\u003Cp\u003EMain fuselage was shock cone, linear cockpit, medium 1.25m fuel tank, engine cooler, turbo jet. Placed on the sides were a stack of six .6m black fuel tanks each, which both had 2 radial small orange rockets (4 rocket engines). Fuel tubes went from main body to side tanks. Wings were type A rectagular and triangular, make a trapezoid. Small delta wing used as vertical stabilizer. One control surface on each wing/stabilizer. May provide screenshot later.\u003C/p\u003E\u003Cp\u003EI feel the jets need more oomph or something. I can just barely above 1000 m/s @ ~23000km, then the engine starts to falloff in power, and I slow down and fall. This falloff costs me tens in m/s before the engine cuts off and I can switch to rocket. And then I need to punch through at least 20000 more km via rocket and still double my speed. I could, of course, just be somehow wrong.\u003C/p\u003E\u003Cp\u003EI feel that in order to compensate for the way jets act now, my accent looks more suitable for vertical rockets. I just can\u0027t spend much time riding on the jets.\u003C/p\u003E\n"},{"CreatedByName":"Roflcopterkklol","CreatedById":119190,"CreatedDateTime":"2015-04-28T18:11:14Z","Content":"\n\u003Cp\u003EGuys... Remember you could do this in the old aero with just Turbo jet engines \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/W3DqT4o.jpg\u0022 alt=\u0022W3DqT4o.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/vKquWIt.jpg\u0022 alt=\u0022vKquWIt.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/hTaRFhi.jpg\u0022 alt=\u0022hTaRFhi.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI have been trying to get an SSTO to work without rapiers and its a no go so far.\u003C/p\u003E\u003Cp\u003EAir hogging does not seem to help anymore.\u003C/p\u003E\u003Cp\u003EI kinda feel like the devs did not test SSTO\u0027s in the new aero. i will have to actually load up one of the stock SSTO\u0027s and see if it gets to orbit lol.\u003C/p\u003E\n"},{"CreatedByName":"spyker92","CreatedById":60251,"CreatedDateTime":"2015-04-28T18:15:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022waterlubber\u0022 data-cite=\u0022waterlubber\u0022\u003E\u003Cdiv\u003ENope, spaceplanes are impossible now. Give up! Abandon all hope all ye who enter here!\u003Cp\u003EIf someone does get a SSTO working, (Spaceplane), I would be very surprised. I think Das wasn\u0027t able to.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s doable. Still working on the \u0022getting down\u0022 part of it, but mine can \u0022get up\u0022. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 alt=\u0022:blush:\u0022\u003E\u003C/p\u003E\u003Cp\u003EClimb hard to 5k, coast to 10k on the engines, then burn the LFOs at 45. Total ascent time is around 7min. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://images.akamai.steamusercontent.com/ugc/544150955172896606/E739837E9E4195F211D5BCC9472633380C8E4AB9/\u0022 alt=\u0022E739837E9E4195F211D5BCC9472633380C8E4AB9\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://images.akamai.steamusercontent.com/ugc/544150955172899846/A20C19B2A8E4A70C76531548DA0F9656958BB202/\u0022 alt=\u0022A20C19B2A8E4A70C76531548DA0F9656958BB202\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://images.akamai.steamusercontent.com/ugc/544150955172899522/6F3B9684F841040DF7B26D4F0F16DF18902B375E/\u0022 alt=\u00226F3B9684F841040DF7B26D4F0F16DF18902B375E\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-04-28T18:20:40Z\u0022 title=\u002204/28/2015 06:20  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 28, 2015\u003C/time\u003E by spyker92\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"WanderingKid","CreatedById":110855,"CreatedDateTime":"2015-04-28T18:24:17Z","Content":"\n\u003Cp\u003EFor getting down, I \u0027cheated\u0027 a bit. I started my atmo entry ~90 degrees around Kerbin, and from there I shoved my plane nose down to ~45 degrees during the re-entry from 70k to 45k or so, using my entire wingspan as a giant airbrake. This bled off tons of speed while I got down into the thicker atmo. At ~40k I leveled off and popped two airbrakes. More than enough to get me under 800m/s. After that, I simply glided into KSC.\u003C/p\u003E\u003Cp\u003EYou need to dump all that speed up high. If you get under 30k over 1200 m/s you\u0027re in for a rough ride.\u003C/p\u003E\n"},{"CreatedByName":"Mat2ch","CreatedById":139755,"CreatedDateTime":"2015-04-28T18:24:29Z","Content":"\n\u003Cp\u003EJep, one of my first things to do was to build a spaceplane! I even wrote a short tutorial. Feel free to comment: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/116972-1-0-SSTO-Spaceplane-Things\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/116972-1-0-SSTO-Spaceplane-Things\u003C/a\u003E!\u003C/p\u003E\n"},{"CreatedByName":"Cyk0","CreatedById":132280,"CreatedDateTime":"2015-04-28T19:03:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Roflcopterkklol\u0022 data-cite=\u0022Roflcopterkklol\u0022\u003E\u003Cdiv\u003EI have been trying to get an SSTO to work without rapiers and its a no go so far.\u003Cp\u003EAir hogging does not seem to help anymore.\u003C/p\u003E\u003Cp\u003EI kinda feel like the devs did not test SSTO\u0027s in the new aero. i will have to actually load up one of the stock SSTO\u0027s and see if it gets to orbit lol.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo rapiers should not be any hindrance this was my first attempt at a spaceplane and it was very far from optimized...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://images.akamai.steamusercontent.com/ugc/534017684930349968/8AF0D6925541C33280C28F3245BA10A31076586C/\u0022 alt=\u00228AF0D6925541C33280C28F3245BA10A31076586C\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EReturning the the space center from an orbit of somewhere around a 100 with plenty of liquid fuel left to fly around with the efficient Nervas if need be.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EThe trick is just to build a plane that is low drag and avoid parts that burn up (Canards, regular air intakes, some of the cockpits, use heatsinking if needed) and putting vulnerable stuff in cargobays. Accent is more simple than ever, just point skyward at something like 45 degrees from the runway and ram the throttle home (I have not really tested the most fuel efficient way to do it) and shoot out of the thick atmo below 20km at over 1200 m/s and getting an orbit should be a breeze.\u003C/p\u003E\u003Cp\u003EIt makes reentry very simple to, you will actually be going hotter on the way up than down, turbojets give stupid amounts of thrust in high speed down low, they peak out at over 500 thrust. I had air breaks to give it a changed aerodynamic profile for reentry but it was not needed.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-04-28T21:26:31Z\u0022 title=\u002204/28/2015 09:26  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 28, 2015\u003C/time\u003E by Cyk0\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2015-04-28T19:32:11Z","Content":"\n\u003Cp\u003ESo ... we trying to survive a reentry in aluminum skin plane? I was looking at pictures above, and cannot see any thermal tiles \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EI think SQUAD should add a heat tiles, black and white. And players are expected to protect their shuttles by manually attaching them in pattern, that gives sufficient heat and dynamic pressure protection, while keeping weight to minimum. Yes, manually, all the 31000 of them \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EI did not updated to 1.0 yet, and I wonder: how really spaceplanes are being protected from heat in 1.0? There is special wings, do wing\u0027s upper and lower surface different, is there a tweakable slider to configure wing strength and amount of thermal protection? What about fuselages? I understand some parts were not updated, and they exploding at slightest heating?\u003C/p\u003E\u003Cp\u003EP.S.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Space_Shuttle_thermal_protection_system\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Space_Shuttle_thermal_protection_system\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-04-28T19:41:38Z\u0022 title=\u002204/28/2015 07:41  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 28, 2015\u003C/time\u003E by Guest\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Cyk0","CreatedById":132280,"CreatedDateTime":"2015-04-28T19:39:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022WildLynx\u0022 data-cite=\u0022WildLynx\u0022\u003E\u003Cdiv\u003EI did not updated to 1.0 yet, and I wonder: how really spaceplanes are being protected from heat in 1.0? There is special wings, do wing\u0027s upper and lower surface different, is there a tweakable slider to configure wing strength and amount of thermal protection? What about fuselages? I understand some parts were not updated, and they exploding at slightest heating?\u003C/div\u003E\u003C/blockquote\u003ENo special tiles or anything, but some wings do survive heat better than others\n"},{"CreatedByName":"Skyentist","CreatedById":107333,"CreatedDateTime":"2015-04-28T21:04:36Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/aBk15ON.jpg?1\u0022 alt=\u0022aBk15ON.jpg?1\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis design was able to work fine. Able to get into 80x70 km orbit with plenty enough fuel to return. It was able to re-enter without any permanent damage, but lack of power generation led to a crash landing. Pilot was able to walk away though.\u003C/p\u003E\n"},{"CreatedByName":"Redshift OTF","CreatedById":78679,"CreatedDateTime":"2015-04-28T21:40:41Z","Content":"\n\u003Cp\u003ESo it seems my best ascent profile so far is to take off, pitch to 30 degrees at full throttle and keep going till the rapiers die and switch modes. Kind of takes the art out of it. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E Also I placed a heat shield behind the front pointy nose cone and it kept everything behind it nice and cool enabling me to get higher speeds.\u003C/p\u003E\n"},{"CreatedByName":"Rodyle","CreatedById":103194,"CreatedDateTime":"2015-04-28T21:41:55Z","Content":"\n\u003Cp\u003EI got something into orbit. A bit of tweaking and it should be able to carry a light payload (fittable in mk2 parts) to orbit. The only issue I found was that I should get my joystick out of its hiding place. Jesus christ, the controls have become incredibly twitchy.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Redshift OTF\u0022 data-cite=\u0022Redshift OTF\u0022\u003E\u003Cdiv\u003ESo it seems my best ascent profile so far is to take off, pitch to 30 degrees at full throttle and keep going till the rapiers die and switch modes. Kind of takes the art out of it. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E Also I placed a heat shield behind the front pointy nose cone and it kept everything behind it nice and cool enabling me to get higher speeds.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat speeds do you get to on rapiers? My ascent profile is a bit different (get to Mach 1 ish ASAP, ascend to 14/15 kilometres, start increasing speed from there while maintaining a good enough climb rate that you don\u0027t explode). It\u0027s not perfect yet, but I get to slightly over 1 km/s on rapiers that way.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-04-28T21:44:22Z\u0022 title=\u002204/28/2015 09:44  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 28, 2015\u003C/time\u003E by Rodyle\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Spartwo","CreatedById":58131,"CreatedDateTime":"2015-04-28T21:50:46Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/puzor4w.png\u0022 alt=\u0022puzor4w.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/9s1BBo5.png\u0022 alt=\u00229s1BBo5.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI disintegrated throughout the flight.\u003C/p\u003E\n"},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2015-04-28T22:14:28Z","Content":"\n\u003Cp\u003E...I don\u0027t know if it can come down. Plenty of dv to deorbit, but not sure if it\u0027ll survive the heatwave...\u003C/p\u003E\u003Cp\u003EAlso the cargo bay contains fuel and parachutes \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/1Qc7nkJ.jpg\u0022 alt=\u00221Qc7nkJ.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Rodyle","CreatedById":103194,"CreatedDateTime":"2015-04-28T22:22:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022eddiew\u0022 data-cite=\u0022eddiew\u0022\u003E\u003Cdiv\u003E...I don\u0027t know if it can come down. Plenty of dv to deorbit, but not sure if it\u0027ll survive the heatwave...\u003Cp\u003EAlso the cargo bay contains fuel and parachutes \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/1Qc7nkJ.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/1Qc7nkJ.jpg\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELower periapsis to roughly 45K, point your nose up as far as possible and deploy air brakes. That worked for me.\u003C/p\u003E\n"},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2015-04-28T22:45:11Z","Content":"\n\u003Cp\u003EI might have been a bit more aggressive on the descent - but it survived. Airbrakes seem a bit OP, I got less heat coming down than going up... but since they\u0027re also utterly necessary, I\u0027m not gonna moan \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003ENot where I wanted to come down, obviously, but given that it\u0027s the first SSTO I\u0027ve made in 1.0 that survived the round trip, I\u0027ll take it as a victory!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/CwSNAQn.jpg\u0022 alt=\u0022CwSNAQn.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENow I just need to clear out that fuel can from the cargo bay so\u0027s it can be useful...\u003C/p\u003E\n"}]}