{"TopicId":105308,"ForumId":16,"TopicTitle":"Goo Canisters explode during reentry","CreatedByName":"Tery215","CreatedById":89094,"CreatedDateTime":"2015-04-27T20:06:01Z","PageNum":1,"Articles":[{"CreatedByName":"Tery215","CreatedById":89094,"CreatedDateTime":"2015-04-27T20:06:01Z","Content":"My goo canisters exploded during my 3rd space mission, but it\u0027s really weird because they exploded 1 km above the ocean...\n\n\u003E \n\u003E .Celestial bodies now accurately emit thermal radiation that makes nearby craft warmer.\n\u003E part temperatures can now be affected by such things as being exposed to sunlight and hypersonic flight heating\n\nHow do I make them stop exploding? Do I have to land at night?\n\n![zjpGIJp.png](http://i.imgur.com/zjpGIJp.png)\n\n**Edited \u003Ctime datetime=\u00222015-04-27T20:40:12Z\u0022 title=\u002204/27/2015 08:40  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 27, 2015\u003C/time\u003E by Tery215**\n  \nchanged to answered"},{"CreatedByName":"Merandix","CreatedById":135352,"CreatedDateTime":"2015-04-27T20:13:05Z","Content":"Put them in a service bay. You don\u0027t have to land at night, you just need to protect them from the rigours of re-entry. Basically, friction made them overheat and be ripped off (= boom)."},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2015-04-27T20:16:00Z","Content":"Place them much higher on the pod, so the pod shields them."},{"CreatedByName":"purpletarget","CreatedById":57317,"CreatedDateTime":"2015-04-27T20:38:24Z","Content":"If they\u0027re not blowing up until 1km, then chances are there\u0027s residual heat in the pod (which doesn\u0027t blow up until 2000K) that is conducting into the Goo Canisters until they blow up at 1200K. \n\nThe trick will be finding ways to slow down your pod enough that it doesn\u0027t heat up so much, so that it has a chance to cool below 1200K before the Goo heats up past 1200K. \n\nTry a couple things...Goo higher up, so that it is shielded from heating up from friction directly...and let the engine/tank sink the direct entry heat if you can, and dump them before they conduct all their heat into the pod. (careful that fins don\u0027t turn pod first into stream). Also, use whatever fuel you have left to decelerate before hitting the re-entry interface...lower speeds = less friction, and less mass = less intertia, which means drag should slow you down quicker."},{"CreatedByName":"Redwizard000","CreatedById":107736,"CreatedDateTime":"2015-04-27T20:39:59Z","Content":"I was having the exact same problem. Merandix is correct, unlock and use the service bay and the heat shield and you will have no more exploding goo problems."},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2015-04-28T09:28:39Z","Content":"\u003E \n\u003E chances are there\u0027s residual heat in the pod\n\nResidual heat ... is there tutorial/dev post regarding all the new heat mechanics somewhere?\n\nI had a pod explode \u0022long\u0022 after the giant solid fuel booster burned out and way up in thin atmosphere/space while coasting to AP the radial parachutes grew hotter (staging menu) and the pod suddenly popped.\n\nIf I activate the pods\u0027 visibility in the staging column, it will show heat, yes?\n\nstagingIcon = COMMAND\\_POD\n\n**Edited \u003Ctime datetime=\u00222015-04-28T09:35:13Z\u0022 title=\u002204/28/2015 09:35  AM\u0022 data-short=\u00229 yr\u0022\u003EApril 28, 2015\u003C/time\u003E by KerbMav**"}]}