{"TopicId":105364,"ForumId":32,"TopicTitle":"List of things needed in a hotfix","CreatedByName":"r4pt0r","CreatedById":90471,"CreatedDateTime":"2015-04-27T21:46:23Z","PageNum":9,"Articles":[{"CreatedByName":"Death Engineering","CreatedById":68528,"CreatedDateTime":"2015-04-30T14:40:11Z","Content":"When in the VAB, the floor paint vanishes when viewed from above.\n\n\u003E \n\u003E ![HZ2wRsk.png](http://i.imgur.com/HZ2wRsk.png)\n\u003E \n\u003E"},{"CreatedByName":"Gaarst","CreatedById":126740,"CreatedDateTime":"2015-04-30T14:47:12Z","Content":"Explosive overheating when decoupling jumbo-64 with Manifold strapped to a Kerbodyne 14400...\n\n(I made a thread about it, if someone wishes for more details: [http://forum.kerbalspaceprogram.com/threads/117645-Fuel-tank-exploding-after-%28radial%29-decoupling](https://forum.kerbalspaceprogram.com/threads/117645-Fuel-tank-exploding-after-%28radial%29-decoupling))"},{"CreatedByName":"hellion13","CreatedById":66719,"CreatedDateTime":"2015-04-30T14:47:48Z","Content":"Only issues ive had are the common ones like the heatshields and z fighting on the launch pad. Some bad wobbly rockets. Only one ctd so far."},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2015-04-30T15:01:44Z","Content":"\u003E \n\u003E When in the VAB, the floor paint vanishes when viewed from above.\n\u003E \n\u003E \n\u003E \n\u003E \u003E \n\u003E \u003E [http://i.imgur.com/HZ2wRsk.png](http://i.imgur.com/HZ2wRsk.png)\n\u003E \u003E \n\u003E \u003E\n\nCan confirm. I think it used to happen in 0.90 as well, but I thought it was a quirk of OpenGL - it\u0027s happening pure stock in 1.0 now."},{"CreatedByName":"Caelib","CreatedById":59329,"CreatedDateTime":"2015-04-30T15:24:49Z","Content":"Has there been any official status update from Squad on a hotfix for these issues? It is my expectation that the game would have a hotfix within a week or so to address the most pesky bugs."},{"CreatedByName":"Dizzle","CreatedById":31588,"CreatedDateTime":"2015-04-30T16:17:29Z","Content":"Don\u0027t know if it\u0027s been mentioned in this thread (haven\u0027t seen it anywhere, really), but does anyone else feel like new Kerbal hires are WAY too expensive? It seems strange that the very first hire cost me more than landing on the Mun."},{"CreatedByName":"basic.syntax","CreatedById":109920,"CreatedDateTime":"2015-04-30T16:31:19Z","Content":"\u003E \n\u003E Has there been any official status update from Squad on a hotfix for these issues? It is my expectation that the game would have a hotfix within a week or so to address the most pesky bugs.\n\nYes - [Check this thread](https://forum.kerbalspaceprogram.com/threads/117365-We-re-working-on-1-0-1). \nKerbal hires being expensive is a game balance / design choice. I\u0027ve seen it brought up in other threads, along with this good and probably intentional work-around: rescue contracts. They\u0027re quite grateful for the pick-up! ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"erikvcarlson","CreatedById":74743,"CreatedDateTime":"2015-04-30T16:38:04Z","Content":"\u003E \n\u003E What would you guys change about the jet engines exactly? Constructive feedback is far more valuable to the devs than just saying it needs changing.\n\nMake the basic engines more powerful and nerf the turbofans. Haven\u0027t got to rapier yet.\n\n- - - Updated - - -\n\n\u003E \n\u003E Yes - [Check this thread](https://forum.kerbalspaceprogram.com/threads/117365-We-re-working-on-1-0-1). \n\u003E Kerbal hires being expensive is a game balance / design choice. I\u0027ve seen it brought up in other threads, along with this good and probably intentional work-around: rescue contracts. They\u0027re quite grateful for the pick-up! ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nI love Jeb but can we pick our own kerbals to start. For example make the first 3 kerbals free."},{"CreatedByName":"Merandix","CreatedById":135352,"CreatedDateTime":"2015-04-30T17:14:35Z","Content":"Not really a large issue: Lights seem to be absent from the medium and large landing gears, despite the lights being present on the models. \n\nAlso, a minor design consideration: While I think it\u0027s fine that the large landing gear doesn\u0027t have steering, the medium one sort of needs to steer. Since it\u0027s the only fitting landing gear to go to when in need of nose-wheel when using heavy\u0027s as a main gear. However, the medium landing gear doesn\u0027t have steering as an option."},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2015-04-30T17:31:33Z","Content":"I\u0027m not planning on reading all 20\u002B pages if this has already been mentioned but this is one that has been bugging me (pun intended) ever since stock cargo bays were introduced.\n\nOX-STAT Photovoltaic Panels inside a fairing or closed cargo bay should not generate power."},{"CreatedByName":"adamzl","CreatedById":122229,"CreatedDateTime":"2015-04-30T17:38:19Z","Content":"i think the auto progression stuff has some issues. in my game i am getting progression contracts for pol but i have not even visited the mun yet. if i had to guess i think my contracts asking me to do kerbin escape tests has triggered some sort of logic that i\u0027m ready for pol contracts. i see both the generic \u0022visit pol\u0022 progress contract and a second contract flag planting on pol.\n\nthe full breadth of my contracts has been several kerbin orbital contracts, several orbital rescues, and two kerbin escape trajectory missions where i immediately deleted the craft after completion."},{"CreatedByName":"Rithsom","CreatedById":114646,"CreatedDateTime":"2015-04-30T17:38:31Z","Content":"Along the same lines of the vanishing VAB floor paint, a couple buildings of the Tier 2 R\u0026D have have models or textures that are off.\n\n\u003E ![AEUiNnG.jpg](http://i.imgur.com/AEUiNnG.jpg)\n\u003E ![qhQzNtb.jpg](http://i.imgur.com/qhQzNtb.jpg)\n\n**Edited \u003Ctime datetime=\u00222015-04-30T17:44:40Z\u0022 title=\u002204/30/2015 05:44  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 30, 2015\u003C/time\u003E by Rthsom**"},{"CreatedByName":"Death Engineering","CreatedById":68528,"CreatedDateTime":"2015-04-30T18:06:04Z","Content":"The heat model is just...bizarre. \n\n1) Science Jr. nestled immediately behind the heat shield overheats and explodes while pointing heat-shield down (using FlowerChilds\u0027s mass-fix). That cannot be by design. This is from a 100km orbit with re-entry Pe of 34km.\n\n2) 2 units of \u0027Ablator\u0027 consumed during ascent/while in orbit makes 0.0% sense. Heat shields, especially while still coupled to the sustainer, should not be consumed until re-entry. \n\n\u003E \n\u003E ![urOhkksl.png](http://i.imgur.com/urOhkksl.png)\n\u003E \n\u003E Pointing the correct end toward re-entry and still lost the Science Jr. How?\n\u003E \n\u003E ![fsJBXkVl.png](http://i.imgur.com/fsJBXkVl.png)\n\u003E \n\u003E \n\nThe heat shield colliding into the capsule and riding with it the rest of the way down was adding insult to injury...\n\n![oMvam3Jm.png](http://i.imgur.com/oMvam3Jm.png)\n\n**Edited \u003Ctime datetime=\u00222015-04-30T18:08:05Z\u0022 title=\u002204/30/2015 06:08  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 30, 2015\u003C/time\u003E by Death Engineering**"},{"CreatedByName":"basic.syntax","CreatedById":109920,"CreatedDateTime":"2015-04-30T18:11:35Z","Content":"\u003E \n\u003E i think the auto progression stuff has some issues. in my game i am getting progression contracts for pol but i have not even visited the mun yet...\n\nSounds like a known issue for 1.0 - [check this thread](https://forum.kerbalspaceprogram.com/threads/117118-Pol-contracts-already%21) to see if you agree. (I think a fix has a good chance of making it into the planned \u0027hotfix\u0027 patch - just my opinion based on that linked thread, tho.)"},{"CreatedByName":"FlowerChild","CreatedById":74289,"CreatedDateTime":"2015-04-30T18:40:27Z","Content":"\u003E \n\u003E Along the same lines of the vanishing VAB floor paint, a couple buildings of the Tier 2 R\u0026D have have models or textures that are off.\n\u003E \n\u003E \n\u003E \n\u003E \u003E [http://i.imgur.com/AEUiNnG.jpg](http://i.imgur.com/AEUiNnG.jpg)\n\u003E \u003E [http://i.imgur.com/qhQzNtb.jpg](http://i.imgur.com/qhQzNtb.jpg)\n\nOk, that picture of Jeb staring at the walled-over door had me crack up laughing. Kerbal engineering at its finest ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"Landge","CreatedById":57671,"CreatedDateTime":"2015-04-30T21:03:53Z","Content":"I know Squad has a lot on their plate but this needs to be added to the list:\n\nSave action grouping on mirrored/radial parts! How many times have you set an action key to a group of engines or other part only to find out later only one works because you had to move the part? Why has this never been addressed? Squad, please fix this."},{"CreatedByName":"Arsonide","CreatedById":32604,"CreatedDateTime":"2015-04-30T21:18:06Z","Content":"\u003E \n\u003E Sounds like a known issue for 1.0 - [check this thread](https://forum.kerbalspaceprogram.com/threads/117118-Pol-contracts-already%21) to see if you agree. (I think a fix has a good chance of making it into the planned \u0027hotfix\u0027 patch - just my opinion based on that linked thread, tho.)\n\n100% chance."},{"CreatedByName":"Goatgas","CreatedById":67221,"CreatedDateTime":"2015-04-30T23:30:05Z","Content":"Please fix the heat shield /Com issue, its pointless attempting to play the game only to be incinerated every time you try to reenter the atmosphere."},{"CreatedByName":"adamzl","CreatedById":122229,"CreatedDateTime":"2015-05-01T04:39:18Z","Content":"caused by doing a science collection at the flag pole, the sillyness!"},{"CreatedByName":"Nansuchao","CreatedById":135151,"CreatedDateTime":"2015-05-01T05:07:09Z","Content":"The atmosfere doesn\u0027t have enough drag during reentry. Instead of slow you down to terminal velocity it slow some and then let you accellerate again at more than Mach 2."},{"CreatedByName":"Renegrade","CreatedById":96629,"CreatedDateTime":"2015-05-01T05:30:06Z","Content":"\u003E \n\u003E Just tested it:\n\u003E [https://youtu.be/oRvaULxkb_4](https://youtu.be/oRvaULxkb_4)\n\nHmm, it does look like they have mass there....well, assuming drag isn\u0027t getting into the bay somehow :/\n\n(I\u0027ve had problems were bays were shielding half of my parachutes despite the parachutes not even being INSIDE the bays, so let\u0027s just say my bay confidence is low)\n\n\u003E \n\u003E The one I\u0027m talking about is when you\u0027re trying to place parts in symmetry mode, and instead of placing the part on the opposite side of the rocket, it winds up mirroring it internally within the rocket. Usually wiggling your mouse some to get the code to place it again will sort it out (sometimes it takes a few tries), but man...what a pain in the neck, especially if you don\u0027t notice it happened until after you\u0027ve made additional changes to your design.\n\nYeah - I\u0027ve been bitten by that one many times. I\u0027m surprised it made it into 0.26 even; Harv SAID he redid symmetry (and we have a whole bunch of new modes to show for it), but yet this durned bug persists :/\n\nIt\u0027s especially nasty when an SRB ends up attaching itself to both sides of a radial decoupler, meaning the other one is inside the core booster\u0027s tank....\n\n\u003E \n\u003E And yes, agreed, not being able to place maneuver nodes for unknown reasons in a released game really isn\u0027t reasonable. We\u0027re all used to interface bugs like this and the one above, and know how to work around them, but for a new player, that is likely struggling to understand concepts like maneuver nodes and part symmetry to begin with, that stuff is just plain broken.\n\nAgreed 100%.\n\n\u003E \n\u003E When in the VAB, the floor paint vanishes when viewed from above.\n\nIt sounds like it\u0027s a transparently textured polygon floating above the actual floor rather than part of it (z-fighting issue?). Easy fix is to simply apply it to the floor..although the floor might be using some sort of repeating texture or such.\n\n(some have noted in the past that it does visibly float above the floor at certain angles...)\n\n\u003E \n\u003E I\u0027m not planning on reading all 20\u002B pages if this has already been mentioned but this is one that has been bugging me (pun intended) ever since stock cargo bays were introduced.\n\u003E OX-STAT Photovoltaic Panels inside a fairing or closed cargo bay should not generate power.\n\nSolar panels work by taking in bay particles, which are generated through either explosions (like in the sun) or cargo bays. Of course, Michael Bay movies produce enormous levels of said particles, thus solar powered devices are especially useful in a theater during their showing... but that\u0027s kinda beside the point. Anyhow, panels in bays, due to the bay particles, should ALWAYS produce power, even when in a planet\u0027s shadow.\n\n(just kiddin\u0027. I think it\u0027s nuts too...although I\u0027ve been abusing the heck out of it for S\u0026G. I also thought that the game was supposed to account for that already?)\n\n\u003E \n\u003E 100% chance.\n\nExcellent news! As much as I love Pol, I ain\u0027t goin\u0027 there until someone ELSE confirms that the invisible walls are gone. Well, except maybe some invisible-wall finding probes.. still, will be nice to leave Pol on the back burner until AFTER Minmus~ (it showed up just AFTER the Mun for me)"},{"CreatedByName":"Black Talon","CreatedById":139093,"CreatedDateTime":"2015-05-01T05:49:58Z","Content":"Since 1.0, I have only started again in Science Mode from scratch.\n\nYes I noticed the Heatshield issues on re-entry. I have applied the fix for that. One thing I have noticed is the Ablator value never seems to change. So far I only have the 1.25m one, and the number stays locked on 200, even after a nice hot re-entry from 135km up, falling straight down.\n\nAnother thing that\u0027s really annoying me at the moment is there are some parts listed in multiple branches of the Tech Tree (and also multiple times in the same branch). This means that you can use them when building a ship. But when you go to launch said ship, you get a message saying you are trying to use parts that are not available yet. The Structural Fuselage is one for sure. It\u0027s listed in General Construction, and also in Advanced Construction. I\u0027ve unlocked General, but not Advanced, so it won\u0027t let me use it. The other is the 2HOT Thermometer. It\u0027s listed in Basic Science, then again in Space Exploration.\n\nI\u0027ve also got parts showing up twice in the Construction Panels...\n\nXM-G650 Radial Air Intake.\n\nWing Connector Type A, B and C.\n\nSwept Wing A and B.\n\nStructural Wing A and B.\n\nElevon 1.\n\nMKI Fuselage Intake.\n\n2HOT Thermometer.\n\nMKI Liquid Fuselage.\n\n**ALL** of those show up twice on the left side of the window.\n\nI haven\u0027t unlocked many levels of the Tech Tree yet, but this is a bit strange. I haven\u0027t tried a re-install yet though, but I was considering it."},{"CreatedByName":"Black Talon","CreatedById":139093,"CreatedDateTime":"2015-05-01T07:13:07Z","Content":"OK... So a fresh install seems to have fixed all of the issues with duplicate parts in the Tech Tree at this stage. I have just done a complete delete and then fresh install, and started a brand new game in Science Mode.\n\nI haven\u0027t got a clue why it was messed up though. Maybe someone could shed some light on that."},{"CreatedByName":"Maizel","CreatedById":138286,"CreatedDateTime":"2015-05-01T15:07:22Z","Content":"Probably already mentioned, but parachutes slow you down too fast even in their semi deployed state, and they should burn up at high speeds, like instantly. Re-entry heat has no purpose now. Also, heatshields are massless, so you tip over 90% of the time while on re-entry."},{"CreatedByName":"moronwrocket","CreatedById":134908,"CreatedDateTime":"2015-05-01T15:13:28Z","Content":"A high timewarp isn\u0027t correctly slowed down upon approach to a planet. Easy enough to duplicate, launch Jeb into a suborbital with 500km\u002B apoapsis, then set timewarp to max, and watch Jeb go \u0022poof\u0022 as he smashes into Kerbin. If you\u0027re lucky, you might see the capsule in the atmo at full timewarp before it rips apart.\n\nKerbals can still be ejected by radial stuff near, but not directly on, the hatch. Easiest way to duplicate is to put 2x radial chutes on a Mk 1 pod, and have Val go EVA. Had her do this on the ground after a successful flight, and she launched into the surface so fast she went \u0022poof\u0022. ![:(](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif)"}]}