{"TopicId":105382,"ForumId":32,"TopicTitle":"New Wings are a disappointment","CreatedByName":"Basilo1146","CreatedById":69489,"CreatedDateTime":"2015-04-27T22:11:17Z","PageNum":1,"Articles":[{"CreatedByName":"Basilo1146","CreatedById":69489,"CreatedDateTime":"2015-04-27T22:11:17Z","Content":"Well, I guess I was expecting a full set of large wings with fuel tanks, like we have with the smaller wings, but instead we have about 3(maybe 4, if you squeeze it) possible wing combinations. Where is the creativity? What am I even supposed to do with these? Most of the things I was going to be using them for I can\u0027t because they really aren\u0027t meant to be put together by the looks of it. Please tell me I\u0027m not the only one annoyed by this."},{"CreatedByName":"Hydrazine_Soup","CreatedById":91100,"CreatedDateTime":"2015-04-27T22:16:20Z","Content":"Yea, they are pretty much useless"},{"CreatedByName":"Robotengineer","CreatedById":104525,"CreatedDateTime":"2015-04-27T22:17:55Z","Content":"I found the names to also be disappointing. FAT-455? Seriously?"},{"CreatedByName":"worir4","CreatedById":75980,"CreatedDateTime":"2015-04-27T22:19:38Z","Content":"I lolled at FAT and Big-S.\n\nI too hope they change the big wings so that they can be built rather than just the single size."},{"CreatedByName":"Stocchinet","CreatedById":141412,"CreatedDateTime":"2015-04-27T23:40:51Z","Content":"I think the real issue is the lack of structural type big-s wings, we have standard delta wing and various structural wings to combine with, but the new Big-s ones only have the delta type, alone is too small to build a Shuttle-alike craft or anything quite big, i would be really good to have a complete set of it...![:huh:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif)"},{"CreatedByName":"Basilo1146","CreatedById":69489,"CreatedDateTime":"2015-04-27T23:47:52Z","Content":"That\u0027s what I was trying to say, but thanks for clarifying. I guess I tried to include that in \u0022a full set,\u0022 but yeah."},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2015-04-28T00:04:52Z","Content":"Same here, they seem mostly \u0022pre-made\u0022, not the Lego-like capabilities of the smaller wings and rocket parts."},{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2015-04-28T00:13:03Z","Content":"Yeah, I posted this the other day on the KSP reddit: I\u0027d like to see some post 1.0 focus on wing \u0022pieces\u0022 that let the user be creative. This includes fixing up a few issues with alignment, sizing and angles on the current wings, per these images:\n\n\u003E \n\u003E ![4KTNJ0o.png](http://i.imgur.com/4KTNJ0o.png)\n\u003E \n\u003E ![zABm2sw.png](http://i.imgur.com/zABm2sw.png)\n\u003E \n\u003E \n\nTo quote myself:\n\nA few relatively simple solutions come to mind. The obvious one is to get the lengths of parts to match. \n\nA slightly less obvious one would be to modify the black beveling such that it only extends the edge as far as the edge is thick, so that attaching parts at angles will not result in any protrusions. And further, to change the edging from a \u0022double angled\u0022 bevel into a single 45 degree bevel. If this is done, it may also be worthwhile to edge all sides of all pieces instead of having some sides edged and some not edged. Here\u0027s a quick picture of a change to the bevel that would make things a lot cleaner. [http://i.imgur.com/LGTjF6C.png](http://i.imgur.com/LGTjF6C.png)\n\nFinally, creating wings with complementary angles would help a lot."},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2015-04-28T00:17:58Z","Content":"\\*cough\\*procedural wings. \n\n... Sorry. Allergy season and all."},{"CreatedByName":"Khobai","CreatedById":83366,"CreatedDateTime":"2015-04-28T02:46:56Z","Content":"they need to add procedural wings"},{"CreatedByName":"CptRichardson","CreatedById":269,"CreatedDateTime":"2015-04-28T02:51:28Z","Content":"\u003E \n\u003E I think the real issue is the lack of structural type big-s wings, we have standard delta wing and various structural wings to combine with, but the new Big-s ones only have the delta type, alone is too small to build a Shuttle-alike craft or anything quite big, i would be really good to have a complete set of it...![:huh:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif)\n\nThe really big monsters, yeah, they\u0027re a bit small for, but an orbiter-sized craft? Plenty big and plenty enough lift to be insane depending on how you build the craft. I was pulling a Mk 3 off the runway at about 30 to 40 m/s and pulling it just about straight up and getting enough thrust to roughly put it into orbit off of four rapiers."},{"CreatedByName":"White Owl","CreatedById":10849,"CreatedDateTime":"2015-04-28T03:11:13Z","Content":"The only disappointment about Porkjet\u0027s wing parts is that we don\u0027t have more of them. I\u0027m hoping to see a wider variety of shapes and fuel types. I also think all the old wing parts need to carry small amounts of fuel."},{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2015-04-28T04:10:59Z","Content":"\u003E \n\u003E The only disappointment about Porkjet\u0027s wing parts is that we don\u0027t have more of them. I\u0027m hoping to see a wider variety of shapes and fuel types. I also think all the old wing parts need to carry small amounts of fuel.\n\nI\u0027d go the other way. I *absolutely do not* want to see more \u0022purpose built, preconfigured\u0022 wing parts. Adding more would just clutter up the already cluttered aero category with more parts that have extremely limited usefulness. I mean, sure, we could add a wing part to match every production aircraft from the last 50 years, and a cockpit, and an empennage, so we could find the five purpose-built F15 parts and snap them together to make an F15... but then there\u0027s no creativity left. You might as well just have a single \u0022Whole 15\u0022 part.\n\nOn the other hand, I would definitely like to see the old SPP wings get fuel (after having their geometry fixed up a bit)"},{"CreatedByName":"Jarin","CreatedById":71395,"CreatedDateTime":"2015-04-28T04:16:03Z","Content":"\u003E \n\u003E \\*cough\\*procedural wings. \n\u003E ... Sorry. Allergy season and all.\n\nIronic that Squad adding *more* wing parts is what\u0027s going to finally break down my resistance and make me install this..."},{"CreatedByName":"White Owl","CreatedById":10849,"CreatedDateTime":"2015-04-28T04:17:29Z","Content":"By \u0022wider variety of shapes\u0022 I meant various rectangles and triangles, to continue KSP\u0027s build-your-own-wing system with larger pieces. *Ideally* I\u0027d like to see procedural wings in the stock game... but more wing components would be good while waiting for that particular hell to freeze over."},{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2015-04-28T04:20:11Z","Content":"\u003E \n\u003E By \u0022wider variety of shapes\u0022 I meant various rectangles and triangles, to continue KSP\u0027s build-your-own-wing system with larger pieces. *Ideally* I\u0027d like to see procedural wings in the stock game... but more wing components would be good while waiting for that particular hell to freeze over.\n\nOh... yes, this would be good... but unfortunately the new parts have pretty accentuated airfoil cross sections, which means there\u0027s no way to turn them into pieces that can be snapped together in various ways to construct various different shapes."},{"CreatedByName":"Skyentist","CreatedById":107333,"CreatedDateTime":"2015-04-28T04:22:01Z","Content":"I think they are alright.\n\nYou trade mutability for extra fuel, solid singular parts, and less part count.\n\nHowever, I would not disagree with those that just want more options."},{"CreatedByName":"LadyAthena","CreatedById":88614,"CreatedDateTime":"2015-04-28T04:25:41Z","Content":"There are a crap ton of mods for this game. Why are you complaining? Procedural wings is already made and done. (No reason for Squad to flood the game with stuff when it\u0027s already made and can be decided on the player if they want it.) Not everyone likes to make planes, so forcing a crap ton of memory heavy stuff for planes into the game would be counter productive in the long run.. Seriously people quit whining."},{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2015-04-28T04:58:09Z","Content":"\u003E \n\u003E Seriously people quit whining\n\nHm, the way I read it, most people in this thread are making constructive suggestions. Oh! You were going for irony! ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)"},{"CreatedByName":"Spartwo","CreatedById":58131,"CreatedDateTime":"2015-04-28T14:44:32Z","Content":"The options given by the new wings are very limited, far more-so then the c7 wings. The shapes don\u0027t work together well and I still find the use of many small wings to be the better option."},{"CreatedByName":"Kilmeister","CreatedById":65062,"CreatedDateTime":"2015-04-28T14:54:25Z","Content":"I like the new big wing. I also like few of the other parts they threw in. Made a 727 mockup with them for fun yesterday while I wait for a few mods to come up to date before I start a career mode. But I agree, they should\u0027ve worked towards having a procedural wing as stock, but no worries, there\u0027s a mod for that =P."},{"CreatedByName":"ABalazs","CreatedById":97459,"CreatedDateTime":"2015-04-28T14:55:47Z","Content":"One particular advantage of those large wings is their rigidity. Strutting big wings together for heavy planes was painful and ineffective, so im really happy with the new parts. But if these were modular or even procedural, that would be real joy."},{"CreatedByName":"ZooNamedGames","CreatedById":103726,"CreatedDateTime":"2015-04-28T15:53:07Z","Content":"I agree and disagree here. The new parts are smaller than expected... I really would\u0027ve like a mk3 sized wing boards to form my own wings in the worst case... \n\nHowever I side with the devs here. The problem with wings in KSP is that nothing you can build can withstand the weight. Massive wings just don\u0027t have the internal support real aircraft have. So they collapse under their own weight when far enough away from the fuselage- regardless of struts. \n\nReal life aircraft- such as the Spruce Goose (current record holder for longest wingspan of an aircraft that was flown- also made out of wood hence \u0022Spruce\u0022) have materials that are either lightweight enough to support its own weight as it gets further away from the fuselage- or the wings have internal structural devices to keep the wing straight.\n\n![stol-wing-skeleton.gif](http://www.zenithair.com/design/stol-wing-skeleton.gif)\n\nAs shown here- the wing has a main bar going through the wing to keep it straight along with several pieces going down from the front to the back of the wing to keep it straight. KSP simply just doesn\u0027t have that.\n\nThe only solution is to make single part wings and the issue is there are too many different styles of wings. For example- there\u0027s the Boeing 747 style wing, then there an Antanov-225 wing, then there\u0027s a AC-130 wing... There are too many types of wings for there to be any simple solution...\n\nAlso- proceedural wings although a good idea- come at the cost of ruining the fun of MAKING aircraft. If I can get whatever wings I need the way I need them then KSP becomes too easy. However if you WANT that then you can download the mod. What I said is my own opinion but what I can say is that the devs likely won\u0027t go for it as it removes several key elements of the game that make it what it is. Such as being able to make your own fuel tanks and engines for rockets- it ruins the whole \u0022engineering\u0022 challenge and going anywhere becomes simplistic and easy. \n\nSo I hope this helped and spread some light on some things."},{"CreatedByName":"BoomShroom","CreatedById":124216,"CreatedDateTime":"2015-04-28T15:57:28Z","Content":"I was honestly expecting something closer to stock-a-like B9 wings. Instead we got shuttle wings that only carry LF and the ridiculously undersized FAT-455 which I find rather undeserving of the name."},{"CreatedByName":"ZooNamedGames","CreatedById":103726,"CreatedDateTime":"2015-04-28T16:03:36Z","Content":"Here\u0027s some more pics to prove my point-\n\n![117064148_6ec8ad2ad9_b.jpg](https://c1.staticflickr.com/1/55/117064148_6ec8ad2ad9_b.jpg)\n\nBoeing 747 wing\n\n![ac130_below_20071210.jpg](http://files.air-attack.com/MIL/ac130/ac130_below_20071210.jpg)\n\nAC-130 wing\n\n![1793022.jpg](http://cdn-www.airliners.net/aviation-photos/photos/2/2/0/1793022.jpg)\n\nAntanov-225 wing\n\n![howard-hughes-flying-boat.jpg](http://www.history.com/images/media/slideshow/inventions-transportation/howard-hughes-flying-boat.jpg)\n\nHughes H-4 Hercules \u0022Spruce Goose\u0022\n\n![File:Giant_planes_comparison.svg](https://en.m.wikipedia.org/wiki/File:Giant_planes_comparison.svg)\n\nAnd some wings from the above mentioned aircraft...\n\n**Edited \u003Ctime datetime=\u00222015-04-28T16:06:38Z\u0022 title=\u002204/28/2015 04:06  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 28, 2015\u003C/time\u003E by ZooNamedGames**"}]}