{"TopicId":105431,"ForumId":25,"TopicTitle":"1.02 Kollier Trophy (reset for the updates)","CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-04-27T23:56:24Z","PageNum":5,"Articles":[{"CreatedByName":"MunGazer","CreatedById":141954,"CreatedDateTime":"2015-05-02T21:32:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GoSlash27\u0022 data-cite=\u0022GoSlash27\u0022\u003E\u003Cdiv\u003EMunGazer,\u003Cp\u003E Try disabling your temperature gauge.\u003C/p\u003E\u003Cp\u003E It\u0027s got a memory leak and that may be why you\u0027re crashing.\u003C/p\u003E\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOk I will definitely try that, thanks.\u003C/p\u003E\n"},{"CreatedByName":"Aetharan","CreatedById":142082,"CreatedDateTime":"2015-05-02T21:45:38Z","Content":"\n\u003Cp\u003ECompletely unmodded this time-- no MechJeb, Engineer, or anything. It turned out that with this plane, what I needed wasn\u0027t a fly-by-wire backup, but enough experience to know what kind of turn to make. I should have done an inverted Immelmann turn (or whatever the proper name is for a maneuver combining a dive with a 180Ã‚Âº turn instead of a climb), but instead pulled a wide, slow bank. It just cost me too much fuel. Oh well, live and learn. Thus, what began as an Ironman attempt is instead submitted as not one, but two Open runs in the same flight.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/cIGWK\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"MunGazer","CreatedById":141954,"CreatedDateTime":"2015-05-02T22:17:57Z","Content":"\n\u003Cp\u003EOk, well turning off the temperature guages seems to work so far for keeping it from crashing. I\u0027ll probably have a submission for you soon \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E. Congrats Aetharan! I\u0027m making some slight changes to my Sojourn, and the next submission of it will be called the Sojourn Prototype 2. It has one primary new feature that distinguishes it from Prototype 1 that helps it in this new drag model. But it\u0027s classified for now! Top Secret! Haha. And Jebediah will be at the helm this time. Valentina declined the test flight because there isn\u0027t anywhere to put her snacks.\u003C/p\u003E\n"},{"CreatedByName":"Aetharan","CreatedById":142082,"CreatedDateTime":"2015-05-02T23:10:47Z","Content":"\n\u003Cp\u003EThanks for the encouragement, MunGazer. I decided to give the Skypiercer another attempt... and so, unless I\u0027m called on a technicality due to crummy brakes, I submit an Ironman run for consideration.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/4qfsZ\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"MunGazer","CreatedById":141954,"CreatedDateTime":"2015-05-03T00:14:35Z","Content":"\n\u003Cp\u003EI have completed my run and am currently working on the imgur album. Standby for some very cool stuff! MunGazer is happy again, and ok with the new aero.\u003C/p\u003E\n"},{"CreatedByName":"zekes","CreatedById":23840,"CreatedDateTime":"2015-05-03T00:42:06Z","Content":"\n\u003Cp\u003EWell that\u0027s frustrating - I did a two-way speedrun, got up to 1230 m/s, and as i descend to land.... game crash. Wow. \u003C/p\u003E\u003Cp\u003EI know for a fact this plane can land - can i has Ironman anyway? I\u0027m so upset that it crashed I could do it again but I dont feel that\u0027s nescecarry. it\u0027s my MiG-31, basically a MiG-25 with more fuel and engines.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/xNQbos3.jpg\u0022 alt=\u0022xNQbos3.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"MunGazer","CreatedById":141954,"CreatedDateTime":"2015-05-03T01:04:50Z","Content":"\n\u003Cp\u003EHey zeke I\u0027m 99% sure you have to press F10 to disable the temperature guages at the beginning of the flight very first thing to avoid the KSP.exe crash. It worked for me. Those guages have a memory leak, so it chews up your memory until you have none left, then bam. Game over.\u003C/p\u003E\n"},{"CreatedByName":"zekes","CreatedById":23840,"CreatedDateTime":"2015-05-03T01:11:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MunGazer\u0022 data-cite=\u0022MunGazer\u0022\u003E\u003Cdiv\u003EHey zeke I\u0027m 99% sure you have to press F10 to disable the temperature guages at the beginning of the flight very first thing to avoid the KSP.exe crash. It worked for me. Those guages have a memory leak, so it chews up your memory until you have none left, then bam. Game over.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, i fixed it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E But I don\u0027t want to do the run again....\u003C/p\u003E\n"},{"CreatedByName":"MunGazer","CreatedById":141954,"CreatedDateTime":"2015-05-03T01:11:52Z","Content":"\n\u003Cp\u003EOk Slashy, I have a submission for you for the Ironman class 1.0.2 Kollier Trophy speed and altitude records.\u003C/p\u003E\u003Cp\u003ELazies and gentlemen... I present to you: \u003Cstrong\u003ESojourn Prototype 2\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EIn an altitude and airspeed record setting circumnavigation run of Kerbin!\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/ltSbO\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/ltSbO\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EAirspeed: 1,427 m/s\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E- This can be verified by \u0022sample shot\u0022 1 through 3, you can see that airspeed either was the same or increased for those three photos, and that the altitude was \u002B/- 5 meters.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EAltitude: 27,250 meters\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E- This can be verified by \u0022sample shot\u0022 7 though 9, again, you can see that airspeed either was the same or increased for those three photos, and that the altitude was \u002B/- 5 meters.\u003C/p\u003E\u003Cp\u003EThis aircraft meets the requirements of having only stock parts, and also was created with a totally stock client. Also, re-entry heat is at the default 100% for the runs.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-03T03:20:04Z\u0022 title=\u002205/03/2015 03:20  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 3, 2015\u003C/time\u003E by MunGazer\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"HafCoJoe","CreatedById":80363,"CreatedDateTime":"2015-05-03T01:20:55Z","Content":"\n\u003Cp\u003EOooohhh I am SO in for this!\u003C/p\u003E\n"},{"CreatedByName":"Aetharan","CreatedById":142082,"CreatedDateTime":"2015-05-03T01:22:10Z","Content":"\n\u003Cp\u003EGeez, MunGazer. That\u0027s an impressive flight. I\u0027m not sure I have any chance at all of beating it-- certainly not with the Skypiercer, even slightly modified. Going to have to hit square one again. Still, I\u0027m learning lessons both from my own trial-and-error and from your beating me. I\u0027ll build something capable of competing!\u003C/p\u003E\n"},{"CreatedByName":"MunGazer","CreatedById":141954,"CreatedDateTime":"2015-05-03T01:46:58Z","Content":"\n\u003Cp\u003EI\u0027d like to throw in some of the lessons I\u0027ve learned in engineering these crafts for the more advanced players that are on the fence about this competition and maybe give them some pointers to get them on the board:\u003C/p\u003E\u003Cp\u003E1. Air intakes do seem to be sort of a diminishing return thing. I believe the ratio for the Sojourn Prototypes is 2 to 1; they have 4 intake air and two engines. Thus, you may want to be careful and make sure if you add more intakes than engines that you\u0027re getting more bang for your buck. They do create drag.\u003C/p\u003E\u003Cp\u003E2. Overheating is aggravated by having parts not lined up with your velocity vector. The \u0022velocity vector\u0022, if you don\u0027t know, is basically the direction your aircraft is flying relative to the air around you. It can often be different than the orientation of your aircraft with respect to the air around it. So, try to angle long nose cones, engines poking out the back, and other such things to include perhaps parts of the fuselage slightly to match your expected \u0022angle of attack\u0022 - which is the difference between your velocity vector and where the center line if your aircraft is pointing. For my Sojourn, it\u0027s usually around 5Ã‚Â°. I think I read somewhere that in real life, the SR-71 Black Bird has an AoA of around 7.5Ã‚Â° way up there at high altitudes. But leave your wings straight! Angling them would defeat the purpose. They generate the needed lift at their natural angle, unless it is a specific design example where there is an exception. And of course, hiding wings too tightly together or behind things may have consequences, I\u0027m not sure, but my guess is you\u0027d want to avoid that.\u003C/p\u003E\u003Cp\u003E3. Drag cross section profile as it relates to the velocity vector is very important and so you should try to get as many of the lifting surfaces and other components of your aircraft in line with the velocity vector as much as possible without really screwing up your stability or functionality. \u003C/p\u003E\u003Cp\u003E4. Unnecessary components - get rid of them. If there is anything on your aircraft that isn\u0027t serving a purpose, or that could accomplish the same mission with less mass or drag, or more lift or thrust, you should look at it with severe scrutiny. That is, if you want every edge you can get. My Sojourn isn\u0027t perfect and could probably be improved upon, but it was optimized.\u003C/p\u003E\u003Cp\u003E5. As far as piloting your craft, try to learn to use your pitch trim to adjust your nose up or down in relation to the velocity vector. This saved a large amount of fatigue and tenseness in my body when flying circumnavigation, and it also makes it a lot easier to maintain a consistent altitude. You do it by pressing Alt \u002B S to pitch up - keep pressing it for small increments. Alt \u002B W to pitch down. Alt \u002B X to reset your pitch trim - don\u0027t forget to do this when you decide to leave your current altitude and decide to descend! It can result in a sudden, unexpected loss of control and it can be dangerous. \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Aetharan\u0022 data-cite=\u0022Aetharan\u0022\u003E\u003Cdiv\u003EGeez, MunGazer. That\u0027s an impressive flight. I\u0027m not sure I have any chance at all of beating it-- certainly not with the Skypiercer, even slightly modified. Going to have to hit square one again. Still, I\u0027m learning lessons both from my own trial-and-error and from your beating me. I\u0027ll build something capable of competing!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELol thanks man. This whole thing is a blast. That first craft you made back in 1.0 was jaw dropping. Making this entry was somewhat easier for me since it was based on my first 1.0 submission - it mainly required angling of the engines and their pre-coolers to avoid overheating for that sustained 1427 m/s flight.\u003C/p\u003E\u003Cp\u003EI wish you the best of luck in your engineering endeavors, as well as everyone, and I\u0027d encourage you to focus on a systematic approach to beating my design - really think through what would be better than whoever holds the record with regard to thrust to drag ratio, lift, etc. It\u0027s a tricky balance. To be honest, circumnavigating makes it a tad easier for me since I don\u0027t have the complicated problem of knowing how far to extend from KSC and what not. However, the design of the craft does need to meet certain standards for circumnavigation capability, namely efficiency.\u003C/p\u003E\u003Cp\u003EAnother beautiful thing about this competition is that it does require a bit of piloting skill as well as good engineering. Honestly this is a tougher piloting challenge for me than Microsoft Flight Simulator X or X Plane 10.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-03T01:52:59Z\u0022 title=\u002205/03/2015 01:52  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 3, 2015\u003C/time\u003E by MunGazer\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MunGazer","CreatedById":141954,"CreatedDateTime":"2015-05-03T04:51:02Z","Content":"\n\u003Cp\u003EIn one of the other threads, someone in 1.0.2 saw my old 1.0 submission and thought I must be using no re-entry heat. I addressed the concern the best I could, and presented a craft file for anyone that wants to use it for any reason.\u003C/p\u003E\u003Cp\u003ESo, for anyone that questions the validity of my submission or simply wants to experiment with the Sojourn Prototype 2, here is the craft file:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/cguzsksfkv10r5f/Sojourn%20Prototype%202.craft?dl=0\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003Ehttps://www.dropbox.com/s/cguzsksfkv10r5f/Sojourn%20Prototype%202.craft?dl=0\u003C/span\u003E\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Three1415","CreatedById":85754,"CreatedDateTime":"2015-05-03T06:16:21Z","Content":"\n\u003Cp\u003EThis is my entry for the Kollier Challenge (Open Class) in 1.0.2, with the Cosmic Ray Mk II, a RAPIER-powered, short-range interceptor.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/ZeEXu\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EAs you can see, there is some discrepancy between the maximum speed as displayed on the navball and as in the mission report; use whichever you deem fit. \u003C/p\u003E\u003Cp\u003EIn any event, I broke 1500 m/s, something I have not seen without exploiting the occlusion bug (I am unsure whether or not that has been fixed in 1.0.2), so I am rather pleased with the result.\u003C/p\u003E\u003Cp\u003EAlso, I would enter again for the altitude competition, but I am uncertain as to how it is intended to work...If zoom climbing is not allowed, is coasting upwards on previously attained speed also banned? That is the primary method for one to gain altitude in any case, so it would be rather odd if it were; I do not really understand what is being asked of us in that field of competition.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-03T06:22:03Z\u0022 title=\u002205/03/2015 06:22  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 3, 2015\u003C/time\u003E by Three1415\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MunGazer","CreatedById":141954,"CreatedDateTime":"2015-05-03T06:45:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Three1415\u0022 data-cite=\u0022Three1415\u0022\u003E\u003Cdiv\u003EThis is my entry for the Kollier Challenge (Open Class) in 1.0.2, with the Cosmic Ray Mk II, a RAPIER-powered, short-range interceptor.\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/ZeEXu\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/ZeEXu\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAs you can see, there is some discrepancy between the maximum speed as displayed on the navball and as in the mission report; use whichever you deem fit. \u003C/p\u003E\u003Cp\u003EIn any event, I broke 1500 m/s, something I have not seen without exploiting the occlusion bug (I am unsure whether or not that has been fixed in 1.0.2), so I am rather pleased with the result.\u003C/p\u003E\u003Cp\u003EAlso, I would enter again for the altitude competition, but I am uncertain as to how it is intended to work...If zoom climbing is not allowed, is coasting upwards on previously attained speed also banned? That is the primary method for one to gain altitude in any case, so it would be rather odd if it were; I do not really understand what is being asked of us in that field of competition.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENice speed mark you set there! And that isn\u0027t easy to do in the new 1.0.2 aero.\u003C/p\u003E\u003Cp\u003ETo try and help you understand/answer the question in your post, I can quote some of the original rules that were set forth, this is from Slashy:\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E-Record must be recorded in level flight. No zoom climbs or dives to pad your results.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u0022Level flight\u0022 to me means that it has achieved an equillibrium state where the altitude and speed will not degrade over time.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EIn the screen shot where you\u0027re doing 1,500\u002B m/s, your vertical speed indicator is pointing straight up, and the question is also raised of whether or not the craft can sustain such speed - \u0022equilibrium\u0022. However, I\u0027m sure that the craft could be controlled enough for level flight for some duration and still hit that same speed mark. I\u0027m only mentioning all this in the interest of other competitors who may make crafts that adhere to the technicalities of the rules. I probably won\u0027t make an open class entry, I did a lot of work for my iron man class one and I\u0027m kinda pooped and stumbling around figuring out what to build next. Nevertheless, it\u0027s Slashy\u0027s competition and he will dictate. He may also adjust the rules - as he said, he\u0027s sort of figuring out this stuff as he goes.\u003C/p\u003E\u003Cp\u003ETo address your confusion about coasting up for altitude, I\u0027ll try to explain. Again, Slashy is the ultimate authority here. I\u0027m just active in this thread so I feel compelled to help.\u003C/p\u003E\u003Cp\u003EIn real life, altitude records are often about sheer altitude, and not the ability to sustain level flight at that altitude for a respectable duration like it is here in this game challenge. So, in this challenge, if it weren\u0027t for the rules and it was just about sheer altitude alone, I could in theory make a single stage to orbit air breathing engine powered projectile that gains insane speed in the atmosphere, and even after the engines have died from lack of oxygen, it could have enough momentum and velocity left to soar off out into space, and who knows how far it could go. That, or it could easily reach the edge of the atmosphere with little effort. There could be several hundred thousand entries that could do that, and it wouldn\u0027t seem challenging, thus the term \u0022challenge\u0022. I haven\u0027t explored the limits of escape velocities established only using air breathing engines, but even if you stayed within Kerbin\u0027s sphere of influence, you\u0027d basically be in orbit in the scenario of leaving the atmosphere - and at that point, is it really an altitude achievement? As Slashy said, this competition is about exploring the limits of ksp aerodynamics. That\u0027s the best I can offer you to explain it for now, but feel free to ask further questions.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-03T06:58:30Z\u0022 title=\u002205/03/2015 06:58  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 3, 2015\u003C/time\u003E by MunGazer\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Three1415","CreatedById":85754,"CreatedDateTime":"2015-05-03T06:56:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022\\\u0022 data-cite=\u0022\\\u0022\u003E\u003Cdiv\u003E\u0022Level flight\u0022 to me means that it has achieved an equillibrium state where the altitude and speed will not degrade over time.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is still easily exploited--I know I can make a suborbital hop, then activate engines with an angle of attack of ~70 degrees and stabilize my altitude at about 32km, but I still never could have gotten to that height without zoom climbing; thus, I am confused as to whether or not such strategies are legal. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022\\\u0022 data-cite=\u0022\\\u0022\u003E\u003Cdiv\u003EIn the screen shot where you\u0027re doing 1,500\u002B m/s, your vertical speed indicator is pointing straight up, and the question is also raised of whether or not the craft can sustain such speed - \u0022equilibrium\u0022.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, but if you look at my prograde marker, you see that my AoA is less than five degrees, and indeed I was attempting to lower the nose as my fuel cut out. The craft gets extremely twitchy at those altitudes and speeds, and I feared overcorrecting would ruin my chances of breaking 1500 m/s; likewise, speed only increases as I nose down further...So whatever. If necessary I can repeat the run while trying to maintain more level flight, but this is difficult when a one-degree AoA will result in a vertical speed in excess of 25 m/s....\u003C/p\u003E\n"},{"CreatedByName":"MunGazer","CreatedById":141954,"CreatedDateTime":"2015-05-03T07:12:31Z","Content":"\n\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E idk man haha. I\u0027m just gonna take my hands off and leave that one alone, I really don\u0027t know those are valid points and good questions. Nevertheless that is a pretty cool little machine. Slashy is quite involved in the deep mathematical and technical aspects of this game and probably frying bigger fish right now but I\u0027m sure he\u0027ll weigh in eventually when he has time. I almost wish someone would come kick my *** in the competition just so we\u0027d have another machine to look at \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-03T07:16:48Z\u0022 title=\u002205/03/2015 07:16  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 3, 2015\u003C/time\u003E by MunGazer\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"mikecool1000","CreatedById":142850,"CreatedDateTime":"2015-05-03T08:18:37Z","Content":"\n\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/8RfF6\u0022 rel=\u0022external nofollow\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cdiv\u003E\u003Ca href=\u0022http://imgur.com/a/8RfF6\u0022 rel=\u0022external nofollow\u0022\u003EHigh speed Kerbal runs 1.02\u003C/a\u003E\u003C/div\u003E\u003Ca href=\u0022http://imgur.com/a/8RfF6\u0022 rel=\u0022external nofollow\u0022\u003E\u003C/a\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/gallery/8RfF6/new\u0022 rel=\u0022external nofollow\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cdiv\u003E\u003Ca href=\u0022http://imgur.com/gallery/8RfF6/new\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/gallery/8RfF6/new\u003C/a\u003E\u003C/div\u003E\u003Ca href=\u0022http://imgur.com/gallery/8RfF6/new\u0022 rel=\u0022external nofollow\u0022\u003E\u003C/a\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/2Mz3pRo.jpg\u0022 alt=\u00222Mz3pRo.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003EAs you can see, this plane is capable of maintaining a speed of at least 1540 m/s, and possibly up to 1600, I too k many screenshots in a short amount of time to validate my climb/ descent rates and found that some of them may have given an advantage, however, the lowest speed i hit during the run is the screenshot where i am going 1540 m/s.\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003EThis craft was inspired by the f22\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"MunGazer","CreatedById":141954,"CreatedDateTime":"2015-05-03T16:47:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mikecool1000\u0022 data-cite=\u0022mikecool1000\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/8RfF6\u0022 rel=\u0022external nofollow\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cdiv\u003E\u003Ca href=\u0022http://imgur.com/a/8RfF6\u0022 rel=\u0022external nofollow\u0022\u003EHigh speed Kerbal runs 1.02\u003C/a\u003E\u003C/div\u003E\u003Ca href=\u0022http://imgur.com/a/8RfF6\u0022 rel=\u0022external nofollow\u0022\u003E\u003C/a\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/gallery/8RfF6/new\u0022 rel=\u0022external nofollow\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cdiv\u003E\u003Ca href=\u0022http://imgur.com/gallery/8RfF6/new\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/gallery/8RfF6/new\u003C/a\u003E\u003C/div\u003E\u003Ca href=\u0022http://imgur.com/gallery/8RfF6/new\u0022 rel=\u0022external nofollow\u0022\u003E\u003C/a\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/2Mz3pRo.jpg\u0022 rel=\u0022external nofollow\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cdiv\u003E\u003Ca href=\u0022http://i.imgur.com/2Mz3pRo.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/2Mz3pRo.jpg\u003C/a\u003E\u003C/div\u003E\u003Ca href=\u0022http://i.imgur.com/2Mz3pRo.jpg\u0022 rel=\u0022external nofollow\u0022\u003E\u003C/a\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003EAs you can see, this plane is capable of maintaining a speed of at least 1540 m/s, and possibly up to 1600, I too k many screenshots in a short amount of time to validate my climb/ descent rates and found that some of them may have given an advantage, however, the lowest speed i hit during the run is the screenshot where i am going 1540 m/s.\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003EThis craft was inspired by the f22\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENice! Looks legit for a qualified open class speed entry in my opinion! And it does look a lot like the F22.\u003C/p\u003E\u003Cp\u003EI like the pre-cooler up front and the way you placed and angled the control surfaces on the wing \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Three1415","CreatedById":85754,"CreatedDateTime":"2015-05-03T18:45:01Z","Content":"\n\u003Cp\u003EAfter realizing that my massive intake spam on the previous Cosmic Ray was only hampering my speed, I removed thirteen of them and ended up with this:\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/nunhB\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EMoral of the story: Never underestimate intake drag.\u003C/p\u003E\u003Cp\u003EAlso, I managed to level off this time. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"MunGazer","CreatedById":141954,"CreatedDateTime":"2015-05-03T22:01:28Z","Content":"\n\u003Cp\u003EI mone be me a win a competition. I maed dis:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/VqaJ6Zq.jpg\u0022 alt=\u0022VqaJ6Zq.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI mone call it: ULTRACLIPPERHYPERJUMPERHOPPERSCATTERFLYER.\u003C/p\u003E\u003Cp\u003EMaximonium speed: Ten thousand fast.\u003C/p\u003E\u003Cp\u003EHighest up altimeter-tude: see fo yo self. it iz verah high. I can say it is about 30 klickometers tall in its flight.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-03T22:05:45Z\u0022 title=\u002205/03/2015 10:05  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 3, 2015\u003C/time\u003E by MunGazer\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"goduranus","CreatedById":112154,"CreatedDateTime":"2015-05-04T04:49:40Z","Content":"\n\u003Cp\u003EI presume that by \u0022manned\u0022 you mean some kind of command pod rather than a command seat inside the cargo bay? \u003C/p\u003E\u003Cp\u003EAlso the \u0022level flight\u0022 criterion is a hard one, because you can sustain stable altitude for a long time but slowly losing speed, and this usually occurs at an altitude 1-2km higher than an altitude where both speed and altitude are stable. This effect occurs at the altitude range where most of the altitude entries will be places, thus confounding the results.\u003C/p\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2015-05-04T05:12:11Z","Content":"\n\u003Cp\u003EOne issue with the altitude records: how to differentiate genuine level flight from a screenshot taken at the apoapsis of a zoom climb? Perhaps two screenshots, ten seconds apart or so?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-04T15:54:45Z\u0022 title=\u002205/04/2015 03:54  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 4, 2015\u003C/time\u003E by Wanderfound\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MostExcellent","CreatedById":110994,"CreatedDateTime":"2015-05-04T11:18:32Z","Content":"\n\u003Cp\u003EMy first attempt: The Unladen Swallow\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/ElcUx\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"goduranus","CreatedById":112154,"CreatedDateTime":"2015-05-04T13:34:15Z","Content":"\n\u003Cp\u003EGoing for altitude, about 29220\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/2U1BrCt.jpg\u0022 alt=\u00222U1BrCt.jpg\u0022\u003E\u003C/p\u003E\n"}]}