{"TopicId":105497,"ForumId":69,"TopicTitle":"New Training \u0022Flight Basics\u0022 is buggy?","CreatedByName":"Black-Talon","CreatedById":57463,"CreatedDateTime":"2015-04-28T02:55:18Z","PageNum":1,"Articles":[{"CreatedByName":"Black-Talon","CreatedById":57463,"CreatedDateTime":"2015-04-28T02:55:18Z","Content":"**KSP Version:** v1.0.0.830 Windows 32-bit\n\n**What Happens:** All craft within physics range respond to control inputs.\n\n**Mods / Add-Ons:** All Stock - fresh 1.0 Steam Download\n\n**Steps to Replicate:**\n\n1. Launch KSP\n2. Click \u0022Start Game\u0022\n3. Click \u0022Training\u0022\n4. Select \u0022Flight Basics\u0022\n5. Gene Kerman \u0022Welcome\u0022 - Click Next\n6. Gene Kerman \u0022Basic Flight Controls\u0022 - Click Next\n7. Gene Kerman \u0022Basic Flight Controls: Pitch\u0022 - Click Next\n8. Gene Kerman \u0022Basic Flight Controls: Yaw\u0022 - Click Next\n9. Gene Kerman \u0022Basic Flight Controls: Roll\u0022 - (hard to understand from a rocket context - it rolls/spins your rocket) - Click Next\n10. Gene Kerman \u0022Pitch, Yaw and Ross\u0022 - Click Next\n11. Gene Kerman \u0022Throttle\u0022 - Click Next\n12. Gene Kerman \u0022Basic Flight Controls\u0022 - Click Next\n13. Gene Kerman \u0022Flight Controls: S.A.S.\u0022 - (might be too early to understand this) - Click Next\n14. Gene Kerman \u0022Flight Controls: RCS\u0022 - Click Next\n15. Gene Kerman \u0022Staging\u0022 - Click Next\n16. Gene Kerman \u0022The NavBall\u0022 - Click Next\n17. Gene Kerman \u0022Flight Instruments\u0022 - Click Next\n18. Gene Kerman \u0022Crew\u0022 - Click Next\n19. Gene Kerman \u0022Ready to Launch\u0022\n20. Press [z] (sets throttle to 100%)\n21. Press [sPACEBAR] (ignites engines)\n22. Press [sPACEBAR] (releases launch clamps)\n23. Gene Kerman \u0022Liftoff!\u0022 (says click next but I was busy and it went away later)\n24. (wait for 1st Asparagus Stage to run out of fuel)\n25. Press [sPACEBAR]\n26. (wait for 2nd Asparagus Stage to run out of fuel)\n27. Press [sPACEBAR]\n28. (wait for 3rd Asparagus Stage to run out of fuel)\n29. Press [sPACEBAR]\n30. Gene Kerman ...things I missed...\n31. Gene Kerman \u0022Almost there\u0022\n32. Move attitude indicator to horizon on NavBall using [WSADQR]\n33. Gene Kerman (at 50,000 meters): \u0022Close your orbit - You\u0027re in space ... Press [M] to see trajectory\u0022 - Press [M]\n34. **Previous/Occasional Result: UI Changes but view of planet doesn\u0027t move - no trajectory - effectively map mode does not load**\n35. Click Trajectory at \u0022Ap\u0022 syssmbol - select \u0022Warp here\u0022\n36. Attempt to Face Prograde  \n\n    1. \n    2. Note 1 - Prograde symbol isn\u0027t visible on NavBall without searching for it\n    3. Note 2 - Without throttle the ship is very reluctant to rotate - using throttle for the gimbal\n    4. ...run out of fuel...\n    5. ...realize you\u0027ve run out of fuel...\n    6. Read, \u0022If you run out of fuel in the middle get out of Map View, activate next stage, get back to Map View\u0022\n    7. ...realize exiting Map View can be done by pressing [M]\n    8. ...realize Stage (pressing [sPACE]) will separate\n    9. ...realize next engine isn\u0027t firing until Stage (pressing [sPACE]) is done again\n    10. Return to Map View - Press [M]\n    11. ...and then?\n    12. ...I\u0027ve got what appears to be an orbit\n    13. Does the tutorial proceed beyond \u0022Close your orbit\u0022 ?\n    14. Previously it failed at going to Map View at all so who knows.\n    15. Oh I see, I\u0027m back in the atmosphere at this point because burning prograde so long after Ap left my Pe too low.\n    16. Ship burns up - hit [Esc] - select \u0022Revert Flight\u0022 - graphics aren\u0027t right...\n    17. **hit [Esc] - select \u0022End Scenario\u0022 - select \u0022End Scenario\u0022 again - frozen game (reproducible)**\n    18. LOGS: [https://www.dropbox.com/s/7tb0cd8rux9gvk2/2015_04_27_output_log.zip?dl=0](https://www.dropbox.com/s/7tb0cd8rux9gvk2/2015_04_27_output_log.zip?dl=0)  \n\n**Result:**  \nAttempted scenario 5 times - first two failed due to map view not working in step 34 - attempted restarts froze game  \nAttempts 3 \u0026 4 had other failures or became stuck - attempted restarts froze game  \nFifth attempt completed successfully - but this was a day later having gotten sick of trying Training missions  \nI\u0027m disappointed because the tutorials got an overhaul for 1.0 yet in my experience thus far they barely work. I don\u0027t want to try to finish them. And I REALLY don\u0027t want to recommend them to others. I was excited to introduce the game to new people but not only are the tutorials buggy but they\u0027re not very good for new players. I will have to direct them elsewhere or attempt to teach them in a way they\u0027re comfortable with (typically not easy with significant others and spouses - they don\u0027t want my help :-p).  \nI\u0027m well aware that in game training is really really hard to do well. But as a lover of the game and appreciator of the more hardcore aspects...the game falls short of getting people up to speed on the basics...which leaves people running away in fear of it\u0027s difficulty and complexity.  \nI fear that the solution will be to make the game less difficult instead of improving the introduction to new players. Please improve the \u0022training\u0022 so you don\u0027t have to dumb down the mechanics. Some things to consider:  \n- In many cases it will take many many tries to get the hang of a concept - the training should all you to try and try again easily until you understand it - it should allow you to practice using the NavBall as it explains it to you for instance and when you fail you can start over easily - crashing when attempting to start over was unfortunate in my experience  \n- The NavBall is really complex and hard to understand at first - a visual guide to it\u0027s function and how to fly just using it alone feels required to me  \n- Concepts around how to build a stable rocket could use an intro - I\u0027ve watched too many people make very poor assumptions about what flies and what doesn\u0027t - when they\u0027re wrong it can often lead to a belief that the game is broken and stupid - not everyone realizes their assumptions about aerodynamics and flight were incorrect  \n- Long ago inDev the tutorial was strongly recommended when new games were started. I think KSP should return to this. Consider a nearly mandatory Tutorial that kicks off career mode as the only way to start playing on a new install unless an option is unchecked in the difficulty selector!  \n- A LOT of the content in KSP Tips (by TriggerAu) is excellent. And much higher quality than the game\u0027s Training... add content like that? It\u0027s basically an entire manual for the game which otherwise doesn\u0027t exist without a lot of searching/browsing/stumbling.  \n- Perhaps this comes in later build Training but things like \u0022Liquid Fuel\u0022 engines need fuel tanks, but \u0022Solid Fuel\u0022 boosters don\u0027t and can\u0027t use fuel tanks, could use an introduction for the first time player  \n- How to understand and properly setup staging isn\u0027t intuitive to the first time player  \n- How electricity is effecting the ability of the craft to do certain things often catches even veteran players much less new ones!  \n- What is an accent profile? What is sub-orbital vs orbital? How do I get \u0022orbital?\u0022 - Perhaps these are covered but again I lost patience with the buggy tutorial before I got to them.  \nNote that I\u0027m also curious to understand if this is even the right way to submit bugs? The support information isn\u0027t updated for release. The existing stickied posts remind me \u0022this isn\u0027t a released game yet,\u0022 etc, etc. I love the game, and the work you\u0027ve done is amazing, but a few things need to keep improving to be release ready in my humble opinion.  \n**UPDATE**: Having gone through the other Training I had far fewer problems - they seemed to be a much higher quality than \u0022Flight Basics\u0022 - when I introduce this to others I will probably just avoid the Flight Basics Training or attempt to hand-hold them through it.  \nThanks for reading,  \nTalon\n\n**Edited \u003Ctime datetime=\u00222015-04-29T01:58:05Z\u0022 title=\u002204/29/2015 01:58  AM\u0022 data-short=\u00229 yr\u0022\u003EApril 29, 2015\u003C/time\u003E by Black-Talon**\n  \nUpdate sentiment after other training missions"}]}