{"TopicId":105415,"ForumId":69,"TopicTitle":"Linux - old PC - apparently missing graphics","CreatedByName":"Esme","CreatedById":107436,"CreatedDateTime":"2015-04-27T23:10:43Z","PageNum":1,"Articles":[{"CreatedByName":"Esme","CreatedById":107436,"CreatedDateTime":"2015-04-27T23:10:43Z","Content":"Anyone reading this NOTE WELL: I have a very old PC, and was fully expecting some issues with my ability to run the finished game. This note is intended to inform SQUAD, not complain.\n\nWith that out of the way:\n\nIn the VAB, some parts simply show as black shapes:\n\nCommand modules: Mk1-2 command pod,Rovemate rover body,Stayputnik Mk1\n\nFuel tanks: FL-r10, fl-r25, fl-t200,fl-t800, Large holding tank\n\nEngines: O-10\n\nC\u0026C: Advanced large reaction wheel\n\nStructural: the multi-point connector\n\naerodynamic - no problems, all appear ok\n\nUtility: illuminator Mk2, Mk16 parachute, sevice bay (both .25 and 2.5m models)\n\nScience: M700 survey scanner\n\nExternal textures appear to be absent outside the VAB too (ie: still not visible when launched).\n\nAlso, whilst the cockpit/command module interiors are visible, the outside world is not in any cockpit/capsule. Outside just appears black no matter which way the capsule/cockpit is facing and no matter whether it\u0027s on the ground or in LKO. \n\nOnly slight variation is that from inside teh Mk3 cockpt, the windows appear a streaky blue - but still no sight of the outside world through them.\n\nNote that I have to have aerodynamic FX urned down to minimal, else I get a horrible dayglo pink mush instead (due to the age of my graphics card). Textures are set to quarter res (to aid performance). All other options at default. I note we no longer appear to be able to set the window resolution.\n\nOS is Linux Mint 17, CPU is Intel® Core2 CPU 6400 @ 2.13GHz I have 4GB RAM. Graphics card is given by sysinfo as AMD/ATI RV516 (Radeon X1300/X1550 series)\n\nPS: those graphics issues were absent in v0.9\n\n**Edited \u003Ctime datetime=\u00222015-04-27T23:13:06Z\u0022 title=\u002204/27/2015 11:13  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 27, 2015\u003C/time\u003E by Esme**"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-04-27T23:17:02Z","Content":"Hello Esme, we\u0027ll try to help ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nIf this is affecting only certain parts it\u0027s possible the textures for those parts never downloaded properly, 1.0 saw Squad change from .mbm and .tga files to .dds for textures, so they all should have been replaced.\n\nSomething to try first would be to verify the game cache in Steam, or see if the patcher is working with the store copy, you can run the launcher to get the latest patcher.\n\nFailing that, a redownload of the archive.\n\nIf that doesn\u0027t resolve the issue we\u0027ll have to look deeper."},{"CreatedByName":"Ethanadams","CreatedById":136913,"CreatedDateTime":"2015-04-28T00:05:51Z","Content":"Does it happen to look like this? [https://www.dropbox.com/sh/n2v1fefdkjyzfkj/AAAf_Kgk561vuPXwuq1x5Mwma?dl=0](https://www.dropbox.com/sh/n2v1fefdkjyzfkj/AAAf_Kgk561vuPXwuq1x5Mwma?dl=0)\n\ni have the same problems on my pic from 2007\n\n**Edited \u003Ctime datetime=\u00222015-04-28T00:11:52Z\u0022 title=\u002204/28/2015 12:11  AM\u0022 data-short=\u00229 yr\u0022\u003EApril 28, 2015\u003C/time\u003E by Ethanadams**"},{"CreatedByName":"Esme","CreatedById":107436,"CreatedDateTime":"2015-04-28T12:27:41Z","Content":"Thanks, SalVager. Non-Steam install here. Patcher archive wouldn\u0027t open, so I\u0027m running the launcher to try to get the patcher re-downloaded. It\u0027s been going an awfully long time; I\u0027ll give it another half-hour and if it hasn\u0027t finished then, will kill the launcher, restart and try again. If that doesn\u0027t work, I\u0027ll try re-downloading KSP from the store. Will let you know how I get on. \n\nEthanadams, yes, very much like that."},{"CreatedByName":"Esme","CreatedById":107436,"CreatedDateTime":"2015-04-28T13:39:21Z","Content":"Update - have been able to re-download the game and do a fresh install, and when I run the launcher it tries downloading the patcher, but frankly seems to be getting nowhere. Is the patcher available as a direct download anywhere else?\n\nAdditional - the completely fresh install has exactly the same apparently missing textures, and same non-display of outside world problem.\n\nFurther update 2015-4-28 20:30 UK time - the update function on the launcher really isn\u0027t working well. I\u0027ve been watching the activity on my ethernet connection, and there\u0027s an occasional brief spike, but for ages the reported file size of teh downloaded archive was 0 bytes. It\u0027s hit 55.4kb now, but the archive isn\u0027t complete (I\u0027ve tried taking a copy and seeing whether the archive can be expanded) yet. will leave it overnight if need be to see if it completes.\n\n**Edited \u003Ctime datetime=\u00222015-04-28T19:35:20Z\u0022 title=\u002204/28/2015 07:35  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 28, 2015\u003C/time\u003E by Esme**"},{"CreatedByName":"Coyote27","CreatedById":141964,"CreatedDateTime":"2015-04-28T20:49:51Z","Content":"I\u0027ve been having this exact same issue too, although I have a Windows 7 OS I have the same graphics card as Esme. Perhaps it\u0027s a problem with the video driver no longer being fully supported? It\u0027s strange that only some components are affected, some new and some old that previously had no issues. Why those particular components - are the textures for them somehow different than for other parts?\n\n**Edited \u003Ctime datetime=\u00222015-04-28T21:03:05Z\u0022 title=\u002204/28/2015 09:03  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 28, 2015\u003C/time\u003E by Coyote27**"},{"CreatedByName":"SilverWarior","CreatedById":80669,"CreatedDateTime":"2015-04-28T21:37:23Z","Content":"I guess that the reason why only some parts are affected this way is the fact that in KSP 1.0 some textures and also their shaders were updated. So it is possible that the new shaders that are used for these components require newer shading support that is not supported by that specific graphics card. \n\nIn game settings there is a specific option to \u0022Fallback part shaders\u0022 which might solve this but it might reduce game performance since the shading might be processed by the CPU instead of the GPU."},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-04-28T21:37:26Z","Content":"It\u0027d be strange to be a graphics driver issue and be cross platform, but not everyone is getting this, only a handful, which suggests bad files in the download or an uncommon settings issue.\n\nAlso, please just try the KSP.x86 and KSP.x86\\_64, not the launcher as the Squad patcher is not accessible at this time."},{"CreatedByName":"Ethanadams","CreatedById":136913,"CreatedDateTime":"2015-04-28T22:10:21Z","Content":"This is not from a bad copy because I tryed the same game and game file on a different computer (a slightly better computer) and all graphical glitches were nonexistent"},{"CreatedByName":"Esme","CreatedById":107436,"CreatedDateTime":"2015-04-28T22:13:31Z","Content":"\u003E \n\u003E It\u0027d be strange to be a graphics driver issue and be cross platform, but not everyone is getting this, only a handful, which suggests bad files in the download or an uncommon settings issue.\n\u003E Also, please just try the KSP.x86 and KSP.x86\\_64, not the launcher as the Squad patcher is not accessible at this time.\n\nSal, I was only running the launcher in order to try to get the patcher, as per your earlier email. I normally run the game from KSP.x86 file. Next chance I get, I\u0027ll try running KSP wiith default settings and see if the graphics oddity is present, and if not, will then try changing one thing at a time until I identify what setting is causing the issue. As I\u0027m back at work tomorrow (I\u0027ve been on leave for a long weekend) I might not be able to do much testing until the weekend though. \n\nDo please pass on my regards to the team at Squad for all their efforts on the game, I hope no-one\u0027s stressing out at the moment! For myself, even if it turns out that my system can\u0027t quite play v1.0 sensibly I won\u0027t mind too much, as it plays v0.9 fine, and I can have a lot of fun with that. And I hope to get a somewhat better PC later this year."},{"CreatedByName":"Coyote27","CreatedById":141964,"CreatedDateTime":"2015-04-28T22:37:32Z","Content":"I can confirm that fallback part shaders do *not* appear to help at all."},{"CreatedByName":"Bob_Harley","CreatedById":141946,"CreatedDateTime":"2015-04-28T23:34:44Z","Content":"I have had the same problem with the same parts. I have an old windows XP. I really hope theirs a way to fix this."},{"CreatedByName":"Coyote27","CreatedById":141964,"CreatedDateTime":"2015-04-29T01:13:32Z","Content":"Update: None of the graphics options seem to help, either... and considering that this seems to affect old video cards only, and in my case at least for computers below the \u0022minimum\u0022 \u0022requirements\u0022 of the game, I\u0027m not going to hold out any hope for a bug fix..."},{"CreatedByName":"Coyote27","CreatedById":141964,"CreatedDateTime":"2015-04-29T06:10:48Z","Content":"Here\u0027s a pastebin of my output.log - [http://pastebin.com/x6phiBx8](http://pastebin.com/x6phiBx8) - not only does it reference the following type of error: \n\n\u003E \n\u003E WARNING: Shader Unsupported: \u0027Decal/Blended\u0027 - Pass \u0027FORWARD\u0027 shader state not supported\n\nBut there\u0027s pages and pages of something else that\u0027s less explicable....\n\n\u003E \n\u003E Serialization depth limit exceeded at \u0027ThermalLink\u0027. There may be an object composition cycle in one or more of your serialized classes.\n\u003E \n\u003E (Filename: Line: 67)\n\nI have no idea what the second type of error relates to or what effect it\u0027s having."},{"CreatedByName":"SilverWarior","CreatedById":80669,"CreatedDateTime":"2015-04-29T06:27:04Z","Content":"\u003E \n\u003E It\u0027d be strange to be a graphics driver issue and be cross platform, but not everyone is getting this, only a handful, which suggests bad files in the download or an uncommon settings issue.\n\nI don\u0027t think this is a graphics driver issue but rather graphics hardware incompatibility issue. Most likely the older graphics cards that those with mentioned problems have don\u0027t support the required shader level that is needed for rendering those parts. \n\nI have expirienced similar isues on my old laptop when I tried running the game that required higher shader level support that was supported by my graphics card.\n\nIn a few cases I actually managed to fix this by manually changing the shader files that shipped with that specific game to forcefully lower the shader level that is required for even loading the specific shader. But this wasn\u0027t possible at all times becouse sometimes shaders had certain shading commands in them that were only available on higher shader levels.\n\nAnother reason why I\u0027m suspecting the shadder support problems is the fact that in the games changelog it specifically says that some parts shaders were redesigned to provide better visual expirience. So I asume those shaders were made with higher shading level support in mind.\n\nWhen I get home I Will try to check the game shaders (if I can find them) and compare them with previous version of KSP to see if my suspicions are correct."},{"CreatedByName":"Esme","CreatedById":107436,"CreatedDateTime":"2015-04-29T11:45:03Z","Content":"I wouldn\u0027t be at all surprised if you\u0027re correct, SilverWarrior (although I confess I wouldn\u0027t have a clue how to look into the things you;re describing there). I was pleasantly surprised that my PC would run something like KSP in the first place, let alone as well as it did, and if it turns out that realistically I just need to play 0.90 until I can afford a better PC, that\u0027s fine by me. I just thought it might be useful to Squad to have feedback from folk with older PC\u0027s so they have a better idea of where the lower-end of hardware that will work with the game is, so they can advise newcomers accordingly. I know I can have tremendous fun with 0.9 and a few 0.9 mods that I downloaded that\u0027ll keep me occupied for months, trying to set up a self-sustaining colony on Duna. :-}"},{"CreatedByName":"Coyote27","CreatedById":141964,"CreatedDateTime":"2015-04-29T19:30:32Z","Content":"Well, if he is correct, then this should be third-party-fixable by replacing the shaders. I haven\u0027t a clue how to do this properly, but I know that there\u0027s plenty of people around who do."},{"CreatedByName":"Ethanadams","CreatedById":136913,"CreatedDateTime":"2015-05-01T17:12:06Z","Content":"Could you change the textures of the objects completely to fix it?"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-05-01T17:14:47Z","Content":"It\u0027 strange though that they are only partially broken, you\u0027d expect them to either work or not."},{"CreatedByName":"Ethanadams","CreatedById":136913,"CreatedDateTime":"2015-05-02T13:27:04Z","Content":"We\u0027re can I find the files for part textures?"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-05-02T13:33:13Z","Content":"Look for the .dds files in \u0022Kerbal Space Program Steam/GameData/Squad/Parts/\u0022 ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"Coyote27","CreatedById":141964,"CreatedDateTime":"2015-05-28T21:27:27Z","Content":"Did any 3rd-party fixes for this ever get made?"},{"CreatedByName":"Phoenix1945","CreatedById":140132,"CreatedDateTime":"2015-09-24T15:02:17Z","Content":"Hello, I have exactly the same problem.\n\nI have 2 os, one ubuntu one windows. I had kerbal installed on windows first, but it was crushing when it hits memory ceiling. But the problem of textures was not present. \n\nWhen I pass to ubuntu, I can play as long as I want but of course have some of the textures missing. And its annoying. \n\nI tried to change the textures with 0.9 version of kerbal, but the texture was still black.\n\n Also can we use texture replacer mod to fix this somehow? \n\nThanks."},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-09-24T16:52:16Z","Content":"Exactly which textures are missing? And please upload your KSP.log"},{"CreatedByName":"Stone Blue","CreatedById":77721,"CreatedDateTime":"2015-09-24T17:06:33Z","Content":"Wasnt it KSP v1.0 that introduced the switch to .dds textures?\n\nAre all your mods current for the version of KSP your running?\n\nAlso, check this webpage to find out what graphics driver your actually using:\n\n[http://xmodulo.com/how-to-check-graphics-card-on-linux.html](http://xmodulo.com/how-to-check-graphics-card-on-linux.html)"}]}