{"TopicId":105550,"ForumId":70,"TopicTitle":"Can\u0027t set Yaw axis \u0026 settings not saving","CreatedByName":"Capt. Hunt","CreatedById":97860,"CreatedDateTime":"2015-04-28T06:45:24Z","PageNum":1,"Articles":[{"CreatedByName":"Capt. Hunt","CreatedById":97860,"CreatedDateTime":"2015-04-28T06:45:24Z","Content":"I had it working fine on the first flight, then my throttle and Yaw axes stopped working. I went back into settings and was able to reset the throttle, but when I tried to set the yaw axis the whole input screen grayed out.\n\nI only have a few mods installed right now all of them are the current versions, I\u0027m not sure any of them would have had an effect on that.\n\nMods:\n\nRealchutes\n\nRPM\n\nMechjeb\n\nand the FASA launch towers\n\n**Edited \u003Ctime datetime=\u00222015-05-03T00:11:39Z\u0022 title=\u002205/03/2015 12:11  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 3, 2015\u003C/time\u003E by Capt. Hunt**"},{"CreatedByName":"Capt. Hunt","CreatedById":97860,"CreatedDateTime":"2015-04-28T19:59:03Z","Content":"Ok, reinstalling seemed to have fixed it, but then it stopped working again.\n\nI\u0027m also having issues with settings randomly resetting themselves\n\n**Edited \u003Ctime datetime=\u00222015-04-28T20:54:45Z\u0022 title=\u002204/28/2015 08:54  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 28, 2015\u003C/time\u003E by Capt. Hunt**"},{"CreatedByName":"Capt. Hunt","CreatedById":97860,"CreatedDateTime":"2015-04-28T23:04:30Z","Content":"and now the throttle is completely ignoring my inputs and randomly jumping around."},{"CreatedByName":"Capt. Hunt","CreatedById":97860,"CreatedDateTime":"2015-04-30T18:54:46Z","Content":"ok, so the throttle works intermittently, but I still can\u0027t set the Yaw and all the rest of my settings reset every time I load the game. Anyone?"},{"CreatedByName":"xitywampas","CreatedById":42195,"CreatedDateTime":"2015-05-02T01:49:29Z","Content":"I\u0027m having similar problems. Mine is doing the greying out thing. It did it the first time I started the game (no mods). I was able to set one axis at the time, every time I set a axis I had to restart the game. After a few restarts it went to windowed for some reason and let me finish setting all my controls. Today after I broke my stand alone throttle. I needed to reassign a few axises and it will not let me set a throttle axis at all. Now it greys out every time no matter what I do. \n\nO, all the mods I have is MechJeb and Fuel Tanks Plus"},{"CreatedByName":"Capt. Hunt","CreatedById":97860,"CreatedDateTime":"2015-05-02T21:44:15Z","Content":"yeah, I\u0027ve had the same problem in a completely stock game, it\u0027s not a mod issue. I did figure out that it\u0027ll let me set the yaw axis if I delete the settings.cfg, but then it\u0027s still completely resetting my settings every time I load the game (even if I don\u0027t delete the .cfg).\n\nActually, I just looked at my settings.cfg, and it appears to have everything set right, even my yaw axis. This is telling me that for some reason the game is not reading the settings file on load.\n\nhere is my settings.cfg.\n\n[https://www.dropbox.com/s/ue0zvshj7299teu/KSP_settings.cfg?dl=0](https://www.dropbox.com/s/ue0zvshj7299teu/KSP_settings.cfg?dl=0)\n\n(yes, I know I changed the name, that was just so it would be easier to find in my dropbox, the original is still settings.cfg)\n\nAnd here is the output\\_log\n\n[https://www.dropbox.com/s/xcstvdgyx5xi4kv/output_log.txt?dl=0](https://www.dropbox.com/s/xcstvdgyx5xi4kv/output_log.txt?dl=0)\n\nSince this is apparently not a mod related bug, could someone move this to the unmodded support forum, please?\n\n**Edited \u003Ctime datetime=\u00222015-05-02T22:19:47Z\u0022 title=\u002205/02/2015 10:19  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 2, 2015\u003C/time\u003E by Capt. Hunt**"}]}