{"TopicId":105543,"ForumId":32,"TopicTitle":"Career Mode Progression and Game Design Analysis","CreatedByName":"Xavven","CreatedById":100398,"CreatedDateTime":"2015-04-28T06:22:46Z","PageNum":1,"Articles":[{"CreatedByName":"Xavven","CreatedById":100398,"CreatedDateTime":"2015-04-28T06:22:46Z","Content":"Here are some of my version 1.0 observations and suggestions with regards to Career mode on \u0022Hard\u0022, default \u0022hard\u0022 settings. My conclusion is that there are a few minor tweaks that can be made that will have a large positive effect on the progressive challenge of career mode, and smooth out some of the difficulty spikes. I will say that I should probably try this out on \u0022Normal\u0022 difficulty to compare and see if I encounter the same difficulty spikes. Counterbalancing that is the fact that I\u0027m already an expert player, so I may not see difficulty spikes on the lower difficulties whereas a new player might. Not sure what to say other than to compare notes with the community (you guys!)\n\n**Good early game**\n\nThe first 30 minutes of gameplay seems to guide the player well, and gives the player enough money to be able to experiment and fail. This is because of the huge money influx from all the World First altitude, distance, and speed records. The Flea booster might need its thrust toned down a bit, though. I launch with 20% thrust to achieve around a 1.5 TWR on my first couple of crafts. 100% thrust yields 11 g of acceleration (too much for a beginner\u0027s first launch).\n\nIt is reasonably easy to unlock the set of 15-20 science nodes of General Rocketry, Stability, and Survivability. Game progression up to this point seems well thought out, and smooth. Once the aforementioned nodes were unlocked, however, I encountered the first difficulty spike.\n\n**The first difficulty spike**\n\nThe next logical step at this point is to achieve a stable orbit, but this is best achieved with the Terrier engine in your upper stage, which is unfortunately locked away in a 45 science tier.\n\nDuring beta, the old tech tree had the LV-909 in the 15 science \u0022Survivability\u0022 node, which facilitated the player making orbit at this stage of the career progression. Instead, I found I had to use 6 FL-T200 fuel tanks on a Swivel engine as the upper stage, which is not efficient at all when the player has such a light payload in early game (usually just a Mk1 Command Pod and a parachute). While I could make it work (as an experienced player), it was a harder design challenge during a point in the game where you want the challenges to be *gentle* on a new player. Admittedly, I am playing this on \u0022Hard\u0022 so what should I expect? Duh, right? I will say however that the old tech tree had the LV-909 in the right place whereas I don\u0027t believe the new tree does.\n\nThis is also about the time where tourism contracts are appearing, but the Mk1 Inline Cockpit is also sealed away in a 45 science node. Stacking two Mk1 Command Pods on top of one another just looks completely silly.\n\nThis is also about the time where Kerbin survey contracts are appearing, but the Aviation node is sealed away at 45 science, too. What\u0027s worse, some of these contracts want surface reports, which requires precision landing. Planes are harder to design than rockets, and a new player probably cannot precision land an early plane on rough terrain. Not good contracts for a beginner to take.\n\nNo, at this point in the progression, the game should probably be nudging a newbie player in the direction of getting comfortable with making orbit and getting a Mun flyby down, followed by a Mun orbit. This is where the second problem arises:\n\n**The Mun difficulty spike**\n\nThere are three, maybe four key tools that a newbie needs to achieve an early-game Mun flyby successfully:\n\n1. The Terrier engine in the upper stage\n2. One launchpad upgrade\n3. Patched conics\n4. Maneuver nodes\n\nUnfortunately, the player does not quite have all of these things by the time the Mun is the next target. Ironically, it is the *expert* player that is able to overcome an early Mun mission because s/he has memorized the correct phase angle to begin burning prograde, already knows how burning prograde will affect the shape of the orbit, and can eyeball a Mun intercept without patched conics. AND the expert player further has memorized when to burn retrograde for Mun orbital insertion, and when to burn prograde again to leave Mun\u0027s SOI retrograde with respect to Kerbin in order to successfully return. This, at a time when a *newbie* player needs to learn these valuable skills. As an expert player, I managed to handle this Mun flyby, but I immediately recognized the problem with this game design:\n\nWhen you teach someone to ride a bike, you put the training wheels on first, and then take them off once the learner has gained sufficient skill. I have found KSP to be doing this backwards -- without patched conics and maneuver nodes it\u0027s like trying to learn how to ride a regular bike with no hands first, and once you have mastered that you get the handlebars and training wheels.\n\nNo, the building upgrades should instead act as GATES that the player must unlock before seeking greater challenges, and those gates must be timed with the player\u0027s progression. Here\u0027s what I suggest: patched conics and maneuver nodes should be immediately available in the tier 0 buildings, but only work in the Kerbin system. In order to get patched conics in the neighboring systems of Eve and Duna, the tracking station and mission control must be upgraded. There\u0027s even a good excuse to explain this: the tier 0 radar dishes on the tracking station aren\u0027t sensitive enough to work at long ranges, and upgrading them gets you patched conics farther out in the system.\n\n**Tech tree logical progression suggestions**\n\nParts seem to be a little bit too scattered at the moment. For example, the Rockomax Brand Decoupler (2.5m decoupler) is under \u0022General Construction\u0022, the Poodle and Skipper are in \u0022Heavy Rocketry\u0022 without any 2.5m fuel tanks at all, and the 2.5m fuel tanks are in Fuel Systems. The problem with this is that parts from three different nodes all must be used in concert, or else none of them are individually useful at all.\n\nInstead, I suggest thinking about what the player might be trying to achieve and grouping those parts together. For example, \u0022the player\u0027s objective is to begin using 2.5m rockets\u0022 so the first node contains the Skipper, a 2.5m fuel tank, a 2.5m decoupler, and a 1.25m -\u003E 2.5m adapter. The Poodle can be locked away in the next node, and the Mainsail in the next. Actually, Squad did a great job with the Aviation node in following this line of thinking, as well as the resource scanning and ISRU progression at the end of the tree.\n\nProper progression is most important in the early game when the player\u0027s options are limited, however. You can get away with some poor progression later on in the tech tree because by then, the player has plenty of different contracts to choose from and complete. Early to mid game, though? Whew... No, this is where it needs to be MOST polished.\n\nAnother example of poor tech tree placement is the Micro Landing Gear in the Survivability node. At that stage of the career, all of the engines the player has are physically too long, and the micro landing gear doesn\u0027t reach past the bell nozzle! I\u0027m better off using makeshift girder landing legs, but this is not something a *new* player would be expected to try. Instead, they are given a counter-intuitive part.\n\nAnother example is the science lab being grouped with extendable ladders. These are in no way related from a player intent point of view.\n\nOkay, enough tech tree bashing. Let\u0027s get back to contracts.\n\n**Rescue contracts**\n\nIn order to pull off a successful Rescue from Orbit contract, the player needs:\n\n1. Maneuver nodes\n2. A lot of delta-v to execute rendezvous, which requires...\n3. An upgraded VAB\n\nThe first rescue contract I accepted was in a high orbit (almost at Mun level) and was inclined. This meant I needed not only 3,500 delta-v to get to LKO, but also another 2,400 to correct the orbital plane and execute the rendezvous (I tried my best to launch into the right plane from the get go but still was off by 5 degrees) . Now I\u0027m no slouch -- I\u0027ve got a manned Eve return and Jool-5 under my belt, but I honestly can\u0027t eyeball an orbital rendezvous with a ship without maneuver nodes.\n\nIn addition, early game is tough because you have limited parts to work with. If I need more delta-v in early game, I can\u0027t just bring out the big guns (Skipper to Mainsail to Rhino (KR-2L), etc.) like I usually do. Instead, I have to use clusters of Reliants (LV-T30). This means more engines, more tanks, more radial decouplers, more nosecones, and struts to keep the radial bits stable. I quickly run into the VAB part limit.\n\nMy suggestion is to wait until later to start offering rescue contracts. Perhaps the player also needs a cheaper VAB upgrade to bump the part count restriction up a little, as the first upgrade is both too expensive and too much of a step in allowed size and part count -- we need an intermediate step between them.\n\nOkay, this is already getting too long, so I\u0027ll stop here. What do you think? Have you noticed anything similar? Or do you think I\u0027m just on \u0022Hard\u0022 and should shaddap about it? ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2015-04-28T06:36:58Z","Content":"I think you\u0027ve got your finger more or less on the pulse of the problem, actually. Quite a lot of the problem with tech trees in general is that they are designed with the most challenging components available earliest, with the parts that you can actually learn the game\u0027s systems on hidden away a few nodes off (or at worst, at the dead end of the tech tree). It\u0027s a classic shortcoming of game design: focusing too much on the numbers and not enough on the balance between skill required versus rewarding pay-off. A proper tech tree provides options that are completely reliable at the early stages, but give somewhat sub-par performance. The nodes that follow give better-performing items that require more skill to get that performance. The thing is, the Terrier is an entry-level engine for what it does: it\u0027s a low-thrust-high-ISP engine with good maneuvering that\u0027s an obvious choice for an upper stage engine. Putting it on the fourth tier completely misses this fact."},{"CreatedByName":"WanderingKid","CreatedById":110855,"CreatedDateTime":"2015-04-28T06:58:38Z","Content":"\u003E What do you think? Have you noticed anything similar? Or do you think I\u0027m just on \u0022Hard\u0022 and should shaddap about it? ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nHard vs. Easy has nothing to do with the progression of the game, so I think you\u0027re on target with the reasons for your examination. If you were whining about the amount of science you\u0027re getting, funds pressure, or something like that, it\u0027d be a different story. There\u0027s something to be said that the LV-909 in the 45 tier and lowered science returns possibly interfering with expectations, but that\u0027s a detailed examination of exact values to determine.\n\nI agree that the gate for conics in particular is a poor choice. Asteroids? Absolutely. Conics and Maneuver Nodes? Not so much. I like the idea of \u0027range\u0027 being the Tracking Center\u0027s gate. You could also gate the Tracking Center with range for usage of probe cores, though I\u0027d personally rather see that done via antenna on the probe core itself.\n\nMission Control is also tied into the problem. You need to upgrade both mission control AND the Tracking Station for Maneuver Nodes. This is definitely something a newer player needs. While I know that if I burn out to roughly the right orbit after eyeballing the AN/DN and making a burn there to save dV for my Kerbal rendezvous, I\u0027d agree a newer player wouldn\u0027t know this.\n\nIn the end, though, you\u0027re right. They\u0027re gating the tools that make it much easier to learn to play without the tools.\n\nI haven\u0027t had the chance tonight to dig deeply into the tech tree organization, but this post made me go poke around a while. I had no idea they pushed the Micro up that far. Those are probe landing legs, usually used with the 48-7S, and would barely reach past the 909. My guess is they did it because they break the easiest, but you\u0027re absolutely correct. This is a poorly played out organization of the tree. The only thought I have about why you would use the micro\u0027s at that stage was to give your capsule some legs after it parachuted into Kerbin.\n\nOf particular annoyance is starting with the modular girder, and not getting struts until the 45 tier as well. There are little to no uses for those girders in the very early game unless you\u0027re very experienced and playing with experimental crash cages. Of truly particular curiousity is locking the FLT-800 up along side \\*3\\* rockomax tanks and the fuel hose. \n\nLooking this process over, I\u0027m more and more convinced you\u0027re not meant for a Munshot until you\u0027re in the 90 tier of science. That\u0027s when you get your first solar panels... and wow you\u0027ll be avoiding tons of satellite spam until you get them (unless they fixed that little bug of the Probe Core opening it before you have everything you need to successfully complete it).\n\nFor the Tech Tree, I\u0027m sure a thread will open up shortly on it for a complete overhaul of the config file. It\u0027s completely user editable now, in theory, so hopefully someone can rebuild it more intuitively."},{"CreatedByName":"mikegarrison","CreatedById":137807,"CreatedDateTime":"2015-04-28T07:28:58Z","Content":"\u003E \n\u003E Okay, this is already getting too long, so I\u0027ll stop here. What do you think? Have you noticed anything similar? Or do you think I\u0027m just on \u0022Hard\u0022 and should shaddap about it? ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nNo, I\u0027ve been playing a career game on \u0022normal\u0022 and I found exactly the same problems. On normal, however, all the contract money you get essentially for free allows you to upgrade the launch pad, mission control, and tracking station relatively easily. On hard, that\u0027s probably a bigger issue.\n\nI think you are right -- the tech tree should be designed around paths to achieve goals (space planes ignored here):\n\n1) launch a rocket, learn to fly and survive\n\n2) achieve orbit\n\n3) mun/minmus orbit \u003Cor\u003E satellites \u003Cor\u003E rescue/tourism\u003C/or\u003E\u003C/or\u003E\n\n4) mun/minmus landing \u003Cor\u003E interplanetary probes \u003Cor\u003E docking/stations\u003C/or\u003E\u003C/or\u003E\n\n5) follow the paths in 3 and 4 you didn\u0027t follow\n\n6) Duna\n\n7) other planets\n\nI think the tech tree should be organized so that you can gain the tech needed for each goal in a directed manner. The player should be able to strategically choose to follow the paths for different routes that the player chooses to explore. But instead, the tech tree seems to randomly spam all the tech around so instead of working toward a strategic goal, it\u0027s just a race to get as much science as you can because you need to open up almost all the tree in order to do anything. (And then once you do, you can do everything.)"},{"CreatedByName":"Falkenherz","CreatedById":141969,"CreatedDateTime":"2015-04-28T07:52:53Z","Content":"Excellent OP."},{"CreatedByName":"Enorats","CreatedById":141841,"CreatedDateTime":"2015-04-28T08:09:47Z","Content":"The OP is totally correct on all accounts. The tech tree is an absolute mess. You need to unlock entire tiers in many cases before most things in the tier become useful. Other parts are absolutely invaluable but locked away in tiers that are so high that taking them limit what else you can get. All of that is damaging to an inexperienced player, and challenging to experienced ones.. but what\u0027s really annoying are the contracts. In .90 my early game was mostly spent flying around Kerbin doing survey missions with basic jets (so basic they\u0027re launched using mini solid boosters as a catapult because landing gear is several tiers out of reach). Now, those contracts are extremely difficult for even experienced players because jet engines are too weak to complete them.. and their science rewards are next to nothing (they were cut down to what, 1/20? 1/40 of what they were?). You\u0027re also left with tons of \u0022go test this\u0022 part, often in places you just plain can\u0027t get to.. like on a kerbin escape.. when you\u0027re still working on making a Mun flyby.\n\nEarly contracts should be tutorials. They should guide the player in basic operations, not throw them into the deep end with a bag of bricks tied to their leg and ask them to build a submarine while they hold their breath."},{"CreatedByName":"Falkenherz","CreatedById":141969,"CreatedDateTime":"2015-04-28T08:11:44Z","Content":"I might add, stacking M1 cockpits does not only look silly but is game-mechanic wise the most lightweight setup for multiple crews. Maybe they should change around mass values so that 2- and 3-manned cockpits are actually more efficient, mass-wise?"},{"CreatedByName":"nanobot","CreatedById":108199,"CreatedDateTime":"2015-04-28T08:26:57Z","Content":"1\u002B Rep, excellent feedback."},{"CreatedByName":"Moss","CreatedById":106413,"CreatedDateTime":"2015-04-28T08:29:56Z","Content":"I whole-heartedly agree with the OP."},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-04-28T08:44:17Z","Content":"It is odd that the harder stuff is earlier on...\n\nThe 30 part limit is a brick wall I have run into. The VAB looks spacious and a mere 30 parts looks small comparatively. So... It should be much more. Something like 60, or more. So... The 30 parts should be earlier on."},{"CreatedByName":"jimutt","CreatedById":28109,"CreatedDateTime":"2015-04-28T08:55:22Z","Content":"Sounds like you\u0027ve manage to pinpoint a lot of the problems with the career mode and tech tree. Personally I\u0027ve been struggeling to like the current career mod. First I thought that it is mainly due to the contracts being kind of all the same and the lack of depth. But after reading your post I kind of think that the tech tree is a bigger problem. If I had a tech tree which made any sense I would probably feel better doing the contracts as I would be able to use proper parts for my rockets. I don\u0027t have any problems fulfilling most of the contracts now as I\u0027ve been playing the game pretty much, but the tech tree just feels wrong."},{"CreatedByName":"Mipe","CreatedById":109421,"CreatedDateTime":"2015-04-28T09:05:59Z","Content":"I didn\u0027t find achieving LKO all that difficult, actually - I managed it with boosters (strap \u0027em to the rocket, adjust their thrust to around 1.5-2.0 to minimize drag loss inefficiency and launch away). As for tourists, stacking the command pods seems silly but is the only reasonable solution. At some point I had 5 command pods stacked up so i could take 4 tourists to LKO and back.\n\nFirst thing I upgraded was the launchpad so I could launch these silly tall rockets. As soon as possible, as wobbly things worry me greatly (it seems the tier 1 launchpad has some ground clipping, one of landing legs went right through ground).\n\nAs for science, I only have one word: experiments. Do them. A lot. I made a low tech biome hopper for this purpose alone (after exhausting the LKO and HKO science). This let me unlock several 45 nodes. Perhaps this needs to be emphasized in the game, as an inexperienced player may not be aware about this. Perhaps contracts instructing the player to visit certain biomes?"},{"CreatedByName":"Falkenherz","CreatedById":141969,"CreatedDateTime":"2015-04-28T09:27:57Z","Content":"Kerbal Engineer Redux has a hard time showing me the required deltaV of 4500\u002B m/s for achieving orbit. Some guy said he could do orbit with 3200\u002B m/s? Anyways, my trusted 0.9 setup based on the \u0022Hammer\u0022 booster (staged 2\u002B1, 1, 1) does show less deltaV than in 0.9 and does not achieve orbit anymore. Or is it just me having to adapt how to pilot that thing?"},{"CreatedByName":"Mipe","CreatedById":109421,"CreatedDateTime":"2015-04-28T09:30:42Z","Content":"We\u0027ve found that the required deltaV for LKO is ~3400 m/s. Source: [http://forum.kerbalspaceprogram.com/threads/116993-Helpful-1-0-observations](https://forum.kerbalspaceprogram.com/threads/116993-Helpful-1-0-observations)"},{"CreatedByName":"LostOblivion","CreatedById":111504,"CreatedDateTime":"2015-04-28T09:58:50Z","Content":"I agree with the OP on all accounts. What struck me the most was the 2m engines not coming with any 2m tanks, and the light legs coming before the medium ones. They cannot reach below the engines you most likely have at this point. Also, I do not unserstand why the Round-8 is in the same node as ion propulsion.\n\nI don\u0027t think a lot of the parts have to move around to fix the tech tree, just some.\n\nI\u0027m sure Squad already have a hotfix patch 1.0.1 coming. (Probably not 1.1 because the minor version is what their major patches will be all about.)"},{"CreatedByName":"Kerolyov","CreatedById":62002,"CreatedDateTime":"2015-04-28T10:05:35Z","Content":"Yes delta-V needed for orbit is much less with new aerodynamics.\n\nVery good post on tech tree \u002B contract issues. A few that I noticed:-\n\n\\* Survey contracts are quite grindy, particularly on other worlds such as Mun requiring quite a bit of delta-V to perform all the landings, fly at altitude and plane changes.\n\n\\* Be nice to get the 1.25m tanks in order of FLT400, FLT200, FLT100, FLT800 ie swapping the tiny tank FLT100 with the medium FLT400 one. The tiny one really limits early rocket designs with the part limit and doesn\u0027t really fit with the early T30 and T45 engines. The philosophy with engines has been start medium and then the small and large are engines are higher tech that unlock later, so not sure why same idea is no longer happening with 1.25 m tanks\n\n\\* I agree on the LV909, needs to be a tier or two earlier, could possibly move it back to suvivability or swap it with the BACC booster in General Rocketry\n\n\\* Could do with the stabilising AVT1 fin a tier earlier to help with stability.\n\n\\* Tricoupler and Rockomax Decoupler \u002B adapter have swapped nodes compared to 0.9 and I can\u0027t understand why. The tricoupler is useful for building bigger 1.25m boosters but now unlocks when you already have 2.5m tanks so it is not likely to get used in career, quadcoupler is even worse\n\n\\* Fairings are quite late in the tree and in tech tree nodes otherwise containing only plane parts. They are more useful for a rocket player. I guess there could be arguments to force a rocket player to not just unlock rocket parts only nodes, but I personally prefer to choose my play style by what I unlock.\n\n\\* The current tree and career doesn\u0027t seem to reward the plane player as survey contracts often have targets at too high an altitude and the plane parts don\u0027t really unlock before you are ready to go to the Mun."},{"CreatedByName":"Spheniscine","CreatedById":125755,"CreatedDateTime":"2015-04-28T10:05:42Z","Content":"\u003E \n\u003E Also, I do not unserstand why the Round-8 is in the same node as ion propulsion.\n\nApparently we saved the ROUND-8 (against being repurposed as a xenon tank), but they forgot to move it? o.o"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2015-04-28T10:17:34Z","Content":"\u002BRep for the constructive feedback.\n\nIf I could offer a slightly different perspective on the tech tree? I agree that there are a couple of odd placements (the micro-landing legs being one) but on the whole, I\u0027m finding that I\u0027m thinking a lot more about my tech progression now and how that ties in with the contracts I\u0027m taking and the next few mission types I want to do. I would say this is a good thing on the whole. \n\nAs an experienced (although I wouldn\u0027t say expert) player, I didn\u0027t really notice that first difficulty spike but right now I\u0027m seriously pondering what to do. Go for Fuel Systems and the necessary building upgrades to do crewed Munshots? Go for a cheaper but tech heavy approach, pick up Miniaturisation, Electrics and whatever that small engine tech is, and go for some early probes (and pick up my Explore Mun/Minmus contracts that way). Or focus on LKO operations, research-over-time and space tourism by beelining for Command Pods, then unlocking the Science Lab and Hitchhiker parts?\n\nIt\u0027s all trade-offs and figuring out how to balance science vs funds, which I\u0027m actually quite enjoying.\n\nWhat might be useful is for another early \u0027get some science\u0027 contract to go after the \u0027take a crew report from the launchpad\u0027 one. Something to point new players in the direction of adding a Goo pod or Materials Bay to their rockets perhaps. You can get an awful lot of early science that way which should make it easier to pick up a couple of 45 point techs, as well as being generally useful for climbing the rest of the tech tree."},{"CreatedByName":"Spheniscine","CreatedById":125755,"CreatedDateTime":"2015-04-28T10:34:49Z","Content":"\u003E \n\u003E \\* Survey contracts are quite grindy, particularly on other worlds such as Mun requiring quite a bit of delta-V to perform all the landings, fly at altitude and plane changes.\n\nActually, with a polar orbit, you won\u0027t need much delta-V for plane changes. Switching back to KSC so that you can warp faster than 50x could get tedious though."},{"CreatedByName":"tufduck","CreatedById":114910,"CreatedDateTime":"2015-04-28T11:33:24Z","Content":"Excellent analysis. Lots of valid and good points. SQUAD, please read!"},{"CreatedByName":"klgraham1013","CreatedById":105132,"CreatedDateTime":"2015-04-28T12:23:29Z","Content":"Maybe I won\u0027t need to do a blog post and I\u0027ll just add to this thread. The OP was great. I currently just made my first orbit. I\u0027ll give my opinions when I\u0027m further in."},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2015-04-28T13:05:35Z","Content":"Career mode is unchanged from 0.90 in any meaningful way. The tech tree paradigm was broken to start with, and reordering it just makes it differently broken. My 3d launch was a poor launch profile from orbit, corrected with the 4th (orbital) flight. I\u0027ve unlocked a few of the 45s.\n\nIn general, KSP is designed so that it is most difficult at the beginning and gets ever easier."},{"CreatedByName":"X-SR71","CreatedById":108775,"CreatedDateTime":"2015-04-28T13:20:28Z","Content":"The OP hit the nail on the head. There are design problems with the tech tree. Early contracts do no correlate well with available research. Survey contracts without proper plane parts are a pain. Personally I find solar panels too deep in the tech tree, especially if one consider using the LV-909 as mun transfer / landing stage, as it doesn\u0027t generate electricity. The sudden spike in difficulty after escaping atmosphere could frustrate new players a lot, especially due to the lack of patched conics. You need a lot of early upgrades to be able to build a proper rocket - launch pad, tracking station, VAB and mission control. The sense of progression on career could be better.."},{"CreatedByName":"willow","CreatedById":13072,"CreatedDateTime":"2015-04-28T13:23:47Z","Content":"Excellent OP."},{"CreatedByName":"klgraham1013","CreatedById":105132,"CreatedDateTime":"2015-04-28T13:28:06Z","Content":"I built my first plane and realized I don\u0027t have a ladder to EVA my Kerbal. How far am I from ladders? What? Why are they over there!?"}]}