{"TopicId":105589,"ForumId":69,"TopicTitle":"Wait.. that can\u0026#039;t be right... CoM bug in SPH?","CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2015-04-28T10:12:53Z","PageNum":1,"Articles":[{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2015-04-28T10:12:53Z","Content":"\n\u003Cp\u003EAdding more weight behind the CoM is moving the CoM slightly forward as shown in this Gfy:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://gfycat.com/GlossyInstructiveEyra\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://gfycat.com/GlossyInstructiveEyra\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-04-28T10:16:50Z","Content":"\n\u003Cp\u003EThe CoM of the jet engines was moved forwards to help reduce the effect of having what was essentially a really heavy exhaust nozzle with no actual engine mesh hanging off the back of our planes, the changed CoM simulates where the engine would be.\u003C/p\u003E\u003Cp\u003ESo you\u0027ll see this effect depending on where your crafts CoM is \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2015-04-28T10:28:27Z","Content":"\n\u003Cp\u003EOK, that\u0027s interesting. I don\u0027t particularly disagree with the reasoning but it\u0027s a bit... odd. I believe there are a few parts with mass that behave in odd ways (heatshields have been mentioned). I have no suggestions on how to make that more intuitive but it certainly caught me out!\u003C/p\u003E\n"},{"CreatedByName":"Kegereneku","CreatedById":66154,"CreatedDateTime":"2015-04-28T11:28:37Z","Content":"\n\u003Cp\u003EInteresting indeed, maybe disorienting as we came to expect CoM to change with mass.\u003C/p\u003E\u003Cp\u003EI wouldn\u0027t know either how to make it more intuitive...\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-04-28T11:31:07Z","Content":"\n\u003Cp\u003EWell, my choice would be to have an actual engine, not just a nozzle, but still have the attach node where it is currently so the player sees the bulk of the engine in going in the craft.\u003C/p\u003E\u003Cp\u003EBut it\u0027d be unnecessary and poke out of many builds.\u003C/p\u003E\n"},{"CreatedByName":"leopardenthusiast","CreatedById":26084,"CreatedDateTime":"2015-04-28T11:31:43Z","Content":"\n\u003Cp\u003ESounds like you could do some odd things with this - for instance, a craft with its CoM fully ahead of all of its parts.\u003C/p\u003E\n"}]}