{"TopicId":105653,"ForumId":69,"TopicTitle":"Constant crashes in 1.0","CreatedByName":"zpox357","CreatedById":14682,"CreatedDateTime":"2015-04-28T14:48:00Z","PageNum":1,"Articles":[{"CreatedByName":"zpox357","CreatedById":14682,"CreatedDateTime":"2015-04-28T14:48:00Z","Content":"\n\u003Cp\u003EHello,\u003C/p\u003E\u003Cp\u003ELooks like there has been a bombardment of error reports recently, so sorry to join the fuss. But I\u0027ve been experiencing a frustrating memory issue (I think) that completely prevents me from playing the game. I\u0027ve played KSP for a long time, and never had a problem like this. The last version, KSP .9 worked absolutely fine, with the graphics on high and even with visual enhancement mods installed. \u003C/p\u003E\u003Cp\u003EAfter downloading KSP 1.0, it seemed to be running fine, no obvious frame-rate drops or lengthy loading times. But within 2-3 minutes of loading the game up, it crashed after I loaded a spaceplane onto the runway. I tried loading the game several more times, and it would crash at completely random points all within the first few minutes of play. Even on the main menu. Like I said, the game would be running fine beforehand, and sometimes it would even clearly continue to run behind the \u0022oops\u0022 error message. The problem seems to get worse the more times I re-start the game. It gets to the point where it\u0027ll only load one texture on start-up before crashing. Re-booting helps a little.\u003C/p\u003E\u003Cp\u003EHonestly, I\u0027m not that knowledgeable when it comes to software. I tried lowering all my graphics settings. Exactly the same result. I\u0027ve tried limiting the program to 1 CPU, updating my graphics drivers, enabling extended RAM support, re-installing the game, re-booting my PC, stopping other programs running, running as admin etc. But still no luck.\u003C/p\u003E\u003Cp\u003EHere\u0027s one of the crash logs I got. Hopefully it\u0027s not too embarrassingly obvious.\u003C/p\u003E\u003Cp\u003EUnity Player [version: Unity 4.6.4f1_99f88340878d]\u003C/p\u003E\u003Cp\u003Emono.dll caused an Access Violation (0xc0000005)\u003C/p\u003E\u003Cp\u003E in module mono.dll at 0023:1010d1bb.\u003C/p\u003E\u003Cp\u003EError occurred at 2015-04-27_205112.\u003C/p\u003E\u003Cp\u003EC:\\Program Files (x86)\\Steam\\steamapps\\common\\Kerbal Space Program\\KSP.exe, run by (me)\u003C/p\u003E\u003Cp\u003E50% memory in use.\u003C/p\u003E\u003Cp\u003E0 MB physical memory [4094 MB free].\u003C/p\u003E\u003Cp\u003E0 MB paging file [0 MB free].\u003C/p\u003E\u003Cp\u003E0 MB user address space [2945 MB free].\u003C/p\u003E\u003Cp\u003ERead from location f8758bff caused an access violation.\u003C/p\u003E\u003Cp\u003EContext:\u003C/p\u003E\u003Cp\u003EEDI: 0x1fb1cee0 ESI: 0x00000000 EAX: 0xf8758bff\u003C/p\u003E\u003Cp\u003EEBX: 0x0000066d ECX: 0xe04e311f EDX: 0x00650068\u003C/p\u003E\u003Cp\u003EEIP: 0x1010d1bb EBP: 0x0031f310 SegCs: 0x00000023\u003C/p\u003E\u003Cp\u003EEFlags: 0x00010286 ESP: 0x0031f304 SegSs: 0x0000002b\u003C/p\u003E\u003Cp\u003EBytes at CS:EIP:\u003C/p\u003E\u003Cp\u003E39 08 0f 84 83 00 00 00 8b d0 8b 40 04 3b c6 75 \u003C/p\u003E\u003Cp\u003EThanks.\u003C/p\u003E\u003Cp\u003EEDIT: Well, strangely enough I just loaded the game and it worked fine. How peculiar. I made a point of not stressing the graphics too much soon after I started it, I don\u0027t know if that\u0027s why it worked this time. Anyways, I\u0027ll see if the issue persists.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-04-28T16:45:59Z\u0022 title=\u002204/28/2015 04:45  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 28, 2015\u003C/time\u003E by zpox357\u003C/strong\u003E\n\u003C/span\u003E\n"}]}