{"TopicId":105677,"ForumId":16,"TopicTitle":"ISRU-Converter - how does this work?","CreatedByName":"Bogeyman","CreatedById":136919,"CreatedDateTime":"2015-04-28T16:19:33Z","PageNum":1,"Articles":[{"CreatedByName":"Bogeyman","CreatedById":136919,"CreatedDateTime":"2015-04-28T16:19:33Z","Content":"\n\u003Cp\u003EBeing new to the mining - How does it all work with drilling up stuff, putting it into these raw materials tanks - then it must probably somehow be transferreed to this ISRU converter who in turn makes fuel out of raw material... Right?\u003C/p\u003E\u003Cp\u003EHow does the workflow go, which parts do I need?\u003C/p\u003E\u003Cp\u003EThanks in advance Chris\u003C/p\u003E\n"},{"CreatedByName":"Forty21112","CreatedById":125887,"CreatedDateTime":"2015-04-28T16:39:38Z","Content":"\n\u003Cp\u003EI\u0027m new to this mining stuff, so take my words with a grain of salt.\u003C/p\u003E\u003Cp\u003ETo see ores densities, you will have to send a probe to a 60km (min.) stable polar orbit. The probe in question must have the survey machine, which is located in the Science tab. An antenna to transmit data, and a lot of power.\u003C/p\u003E\u003Cp\u003EIf all goes well, you should see color overlapping the celestial body. Different colors mean different density of ores. \u003C/p\u003E\u003Cp\u003EAfter that, you need a craft with at least these 3 things.\u003C/p\u003E\u003Cp\u003EThe Drill, a Holding Tank (2 variants of it) and the ISRU converter.\u003C/p\u003E\u003Cp\u003EFind a suitable place (anywhere, even in the launchpad itself) and activate the drill. If all goes well, you see a new button appearing in the right-click menu. It might be start Surface drill or something along that line.\u003C/p\u003E\u003Cp\u003EThe drill automatically \u0022pump\u0022 ore into the holding tank, ready to be converted. Right click the converter and you see 4 (correct me on this) buttons. Convert to LFO, LF, O, Monoprop should be those buttons. Again, it maybe something along those lines.\u003C/p\u003E\u003Cp\u003EOne more thing, you can drill anywhere, but you will harvest more ore which are in more denser packets.\u003C/p\u003E\u003Cp\u003ETell me how it goes.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Bogeyman","CreatedById":136919,"CreatedDateTime":"2015-04-29T13:04:08Z","Content":"\n\u003Cp\u003EThanks for your answer.\u003C/p\u003E\u003Cp\u003EOne more question: If I converted to fuel, for example, I guess I also need to put a tank to my mining craft into which the ISRU can dump it?\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2015-04-29T13:17:03Z","Content":"\n\u003Cp\u003EThat is correct. You must have some sort of storage tank for the refined product.\u003C/p\u003E\n"},{"CreatedByName":"Bogeyman","CreatedById":136919,"CreatedDateTime":"2015-04-29T13:19:15Z","Content":"\n\u003Cp\u003EOk, and, guess what? Here comes another question: Can you let the ISRU run continuously and, for example, do some other mission while the ISRU produces fuel or do you have to be with it all the time?\u003C/p\u003E\n"},{"CreatedByName":"Cebi","CreatedById":138242,"CreatedDateTime":"2015-04-29T13:23:09Z","Content":"\n\u003Cp\u003EYes you can...you will produce fuel even if not in focus.\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-04-29T13:36:28Z","Content":"\n\u003Cp\u003EAt the moment, ISRU is just a heater... the convertor rapidly overheats and stops producing any resources... but continues to produce heat.\u003C/p\u003E\u003Cp\u003EI would not recommend using it, unless you are willing to manually start the thing, stop it to let it cool down, restart it.... for a very very very long time until your tanks are full.\u003C/p\u003E\u003Cp\u003EIt needs to be fixed.\u003C/p\u003E\n"},{"CreatedByName":"Bogeyman","CreatedById":136919,"CreatedDateTime":"2015-04-29T14:02:46Z","Content":"\n\u003Cp\u003EI have read that solar panels also function as radiators, so if you use plenty of solar panels it could be cooled down?\u003C/p\u003E\n"},{"CreatedByName":"2nwyka","CreatedById":141148,"CreatedDateTime":"2015-04-29T15:44:22Z","Content":"\n\u003Cp\u003EThe ISRU is effectively a heater, as KerikBalm has mentioned. \u003C/p\u003E\u003Cp\u003EFor my first attempt I built a mining ship based around a MK3 component set with, from bow to stern, a MK3 cockpit, monopropellant tank, large cargo bay, small cargo bay, long rocket fuel fuselage, and a Skipper. \u003C/p\u003E\u003Cp\u003EI nestled one inside of a MK3 cargo bay and shielded it as best I could with both dead space and engines. I was able to run it producing monopropellant for nearly an hour (compressed) before it began to finally heat up. It took a while for it to cool back down. \u003C/p\u003E\u003Cp\u003EKeep it out of the sun and it will produce fuel longer. \u003C/p\u003E\u003Cp\u003ESolar panels can function as radiators, but I\u0027ve only found them to work like that while they\u0027re shaded. I put four XL Arrays spaced around the MK3 fuselage and rolled the ship around to shade them and they tended to cool off the ISRU faster than when they were fully exposed. \u003C/p\u003E\u003Cp\u003EAfter having played 0.23 and 0.91 for so long this new realistic heat engine is taking some getting used to.\u003C/p\u003E\n"},{"CreatedByName":"Violent Jeb","CreatedById":130681,"CreatedDateTime":"2015-05-06T16:17:44Z","Content":"\n\u003Cp\u003EIt\u0027s probably producing so much heat because it is inside of a cargo bay. In my tests, I was able to convert 150units of ore into lf\u002Box in approximately 1/4 kerbin day. Using this metric it will take me apx 1 full day to produce 600 units, which means approximately a week to convert enough ore to fill an orange jumbo.\u003C/p\u003E\u003Cp\u003EOn kerbin, My solar components produced ~5-8 units of electricity per second optimally, using 10 1x6 solar panels\u003C/p\u003E\u003Cp\u003Ethe ISRU drew something like 30.\u003C/p\u003E\u003Cp\u003EBecause of this, I could only sustain the converter for a few minutes before having to turn it off and wait for battery charge to accumulate. The drill is much less intensive on resources. Testing has also shown that the ISRU does not need to be directly connected to the processed fuel tank, so it works somewhat like monoprop\u003C/p\u003E\u003Cp\u003EMy design uses 2 cubes (-) to keep the engines and ox/lf [] tanks physically separated from the ISRU \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:\u0027courier new\u0027;\u0022\u003E\u003Cem\u003E[]-[o]-[]\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:\u0027courier new\u0027;\u0022\u003E\u003Cem\u003E\\/ \u003C/em\u003E\u003C/span\u003E\u003Cem\u003E\u003Cspan style=\u0022font-family:\u0027courier new\u0027;\u0022\u003E\u003Cem\u003E \\/\u003C/em\u003E\u003C/span\u003E\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:verdana;\u0022\u003E\u003Cem\u003E\u003Cem\u003EEither i\u0027ve gotten lucky or my tests haven\u0027t revealed the same overheating issue as you guys have been experiencing - only electrical. I am wondering if your shut-offs are due to losing electric power. I have also experienced the issue where I can warp so long as i\u0027m not out of electrical power, and the ship will fill/convert infinitely, while my available charge does not change during this time (day or night).\u003C/em\u003E\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:verdana;\u0022\u003E\u003Cem\u003E\u003Cem\u003EI will be launching this mining rig from kerbin to the mun this evening so I will come back and share my findings.\u003C/em\u003E\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"Vectura","CreatedById":119212,"CreatedDateTime":"2015-05-06T16:40:05Z","Content":"\n\u003Cp\u003EAlso, for scanning to find ore:\u003C/p\u003E\u003Cp\u003E1) Use the big dish scanner ina polar orbit to get the basic planet overlay\u003C/p\u003E\u003Cp\u003E2) Use the surface scanner in a high-density area to \u0027map\u0027 that biome (I think it does the whole biome)\u003C/p\u003E\u003Cp\u003E3) Use the narrow band scanner to get a map of the area showing where the percentage of ore in the ground around you\u003C/p\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2015-05-06T16:46:23Z","Content":"\n\u003Cp\u003EDoes it still run hot? I was preparing my first ISRU attempt and relied on the last changelog, where it said the production rate would be limited by engineer skill, not heat.\u003C/p\u003E\u003Cp\u003EIf it still generates heat, can you throttle it somehow? Or is it necessary to constantly switch it on/off?\u003C/p\u003E\u003Cp\u003E(I seriously consider turning heat generation off -- thank \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Egod\u003C/span\u003E HarvesteR there are enough toggles and slider to do this)\u003C/p\u003E\n"},{"CreatedByName":"phunk","CreatedById":77377,"CreatedDateTime":"2015-05-06T17:26:17Z","Content":"\n\u003Cp\u003EI think they may have reduced the heat output, I didn\u0027t try it until 1.0.2 but it didn\u0027t seem to heat up at all.\u003C/p\u003E\n"}]}