{"TopicId":105755,"ForumId":16,"TopicTitle":"Fairing engine enclosure help","CreatedByName":"Dieguscus","CreatedById":60169,"CreatedDateTime":"2015-04-28T20:11:40Z","PageNum":1,"Articles":[{"CreatedByName":"Dieguscus","CreatedById":60169,"CreatedDateTime":"2015-04-28T20:11:40Z","Content":"For a while I\u0027ve been thinking in a new way of designing my aircraft fuselages so, since the announcement of the new fairings an idea popped up in my mind. Today, and as of motive of the release of KSP 1.0 (yay! ![:sticktongue:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif)) I finally tried surrounding a main aircraft body with this enclosures so that the craft could get the shape I wanted and also be more aerodinamic (image below showing an early X-37 concept with the technique described). Once I placed all the fuel tanks and the engine inside of them, I proceeded to launch but once I was on the runway and toggle up the engine, the game displayed a message saying: \u0022Cannot activate while stowed!\u0022. I tried to reattach the engine into an exterior part that weren\u0027t inside the fairing and then reposition it inside again with the idea in mind if that could do the trick, but again it displayed the same message. If anybody knows how to make it work I\u0027d be pretty thankful!\n\nP.D. sorry for my english. It\u0027s not my mater language ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)\n\n![kDhwpsw.png](http://imgur.com/kDhwpsw.png/)\n\n**Edited \u003Ctime datetime=\u00222015-04-28T20:22:09Z\u0022 title=\u002204/28/2015 08:22  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 28, 2015\u003C/time\u003E by Dieguscus**"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-04-28T20:16:34Z","Content":"You\u0027ll need to jettison the fairing, several parts were intended not to be usable while in a fairing or cargobay by design, sorry."},{"CreatedByName":"HazelPine","CreatedById":164526,"CreatedDateTime":"2015-04-28T21:21:28Z","Content":"Is there any way to disable it or change that in the cfg files? Because that\u0027s a pretty neat idea..."},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2015-04-29T01:49:21Z","Content":"Yeah. Unfortunately you would need a mod to be able to do what you are asking.\n\nCheers,\n\n-Claw"},{"CreatedByName":"Dieguscus","CreatedById":60169,"CreatedDateTime":"2015-04-29T11:39:01Z","Content":"@SaplingPick that\u0027s what I though for a moment but then I remembered I have pretty basic idea of how to edit the cfg ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif) so I don\u0027t know how to make it work besides modifying the entire rear.\n\n- - - Updated - - -\n\nUPDATE: I managed to make it work by updating slightly the rear portion of the vehicle. It still has the \u0022Thud\u0022 engine but now repurposed with the objective of making the new and functional \u0022Spark\u0022 engine more robust and bigger since it has lower isp.\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/JgiWC)"},{"CreatedByName":"HazelPine","CreatedById":164526,"CreatedDateTime":"2015-04-29T12:27:10Z","Content":"Oh well, at least it doesnÃ‚Â´t look that bad. As soon as I get round to playing 1.0 IÃ‚Â´m going to start messing with fairing configs to see if theres any way to whitelist/turn off engine occlusion in fairings and cargo bays. Maybe itÃ‚Â´s a setting in the engine configs?"}]}