{"TopicId":105724,"ForumId":148,"TopicTitle":"We\u0027re working on 1.0.1","CreatedByName":"KasperVld","CreatedById":40700,"CreatedDateTime":"2015-04-28T18:25:44Z","PageNum":6,"Articles":[{"CreatedByName":"Ival70","CreatedById":75336,"CreatedDateTime":"2015-04-30T08:51:04Z","Content":"1.0.1 you say? ![:o](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_ohmy.png) EVERYONE GET BACK ON THE TRAIN! ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)"},{"CreatedByName":"Curveball Anders","CreatedById":107529,"CreatedDateTime":"2015-04-30T11:28:29Z","Content":"\u003E \n\u003E Looking forward to the Devnote Tuesday (or whatever you\u0027re calling it now) later today.\n\nThere\u0027ll be devnotes, once the devs have recovered from the launch party.\n\nNow we need a poll to question why Kasp was the first one back to post?\n\n- He\u0027s underage.\n\n- He abstains from adult beverages.\n\n- His liver is amazing."},{"CreatedByName":"brienne","CreatedById":59216,"CreatedDateTime":"2015-04-30T11:39:39Z","Content":"Any quick patch incoming for parachute, heat shield, ...?\n\nDidn\u0027t play, just read, and I wait for 1.0 if it s a matter of days."},{"CreatedByName":"KasperVld","CreatedById":40700,"CreatedDateTime":"2015-04-30T11:58:58Z","Content":"\u003E \n\u003E There\u0027ll be devnotes, once the devs have recovered from the launch party.\n\u003E Now we need a poll to question why Kasp was the first one back to post?\n\u003E \n\u003E - He\u0027s underage.\n\u003E \n\u003E - He abstains from adult beverages.\n\u003E \n\u003E - His liver is amazing.\n\nA combination of #2 an #3 really. I highly value my liver but so far it\u0027s had very little work to do. On release day I was up until 5AM monitoring posts, social media etc.."},{"CreatedByName":"bpw823","CreatedById":109890,"CreatedDateTime":"2015-04-30T12:04:16Z","Content":"I think that hype will really pick up if they plan on adding multiplayer or new planets ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"Galileo Kerbonaut","CreatedById":65299,"CreatedDateTime":"2015-04-30T12:34:15Z","Content":"\u003E \n\u003E A combination of #2 an #3 really. I highly value my liver but so far it\u0027s had very little work to do. On release day I was up until 5AM monitoring posts, social media etc..\n\nDon\u0027t overvalue it too much. Amazingly the liver has the capability to re-grow itself ![:cool:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif). Even if you would cut of a big chunk of it (say half) it magically regenerates. How is that for some random off topic fact knowledge."},{"CreatedByName":"Kiro","CreatedById":139123,"CreatedDateTime":"2015-04-30T12:53:52Z","Content":"\u003E \n\u003E In my view it doesn\u0027t. It definitely deserves the release candidate badge. If it had been released as 1.0 RC or .99, that would have been much better.\n\u003E This update is great. The features added are great. The polish is great. It is a GREAT update. But it is still a release candidate. That isn\u0027t a step you can skip. They tried to skip it, and named it the release. They raised the expectations of a release level product. They said things like it will be ready when it is done. But the release has problems. And these problems would not nearly be perceived so negatively if it had been a 1.0 RC instead of just 1.0. After all, they are ~~mostly~~ all trivial issues. This release should have been a triumph.\n\u003E \n\u003E It is said what is in a name? That which we call a rose, by any other name would smell a sweet. That is true as far as it goes, and it doesn\u0027t go to expectations. 1.0 full release has expectations that 1.0 RC doesn\u0027t.\n\u003E \n\u003E That is my view on the matter, right or wrong.\n\nAbsolutely agree. No matter how much I love this game, this \u0022release\u0022 version is not worthy of the name."},{"CreatedByName":"StanE","CreatedById":32001,"CreatedDateTime":"2015-04-30T13:20:37Z","Content":"Minor bug: If the craft is destroyed mid air due to reentry heat, the sound of burning air continues indefinitely."},{"CreatedByName":"Bundyfly","CreatedById":104482,"CreatedDateTime":"2015-04-30T13:43:13Z","Content":"I like it. much more realism involved. Still got things to work out but as far as fresh releases go, this one wasn\u0027t too bad at all."},{"CreatedByName":"DexterMcKerbin","CreatedById":142276,"CreatedDateTime":"2015-04-30T15:28:23Z","Content":"I appreciate the changes, both big and small to an amazing game and all it represents. Keep up the good work Squad, your fighting the good fight!\n\nLife is like rocket science; you can\u0027t land a booster rocket on a tiny barge in the middle of the ocean without making a few adjustments first, right guys? ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"FlexGunship","CreatedById":32705,"CreatedDateTime":"2015-04-30T15:29:25Z","Content":"\u003E \n\u003E Be nice if everything I lift off didn\u0027t just start a flip feast, wasn\u0027t a problem in .90\n\nNew Aerodynamics. Load FAR or NEAR onto 0.90 and see if you get similar problems. If you do, it\u0027s your design and piloting that are in error."},{"CreatedByName":"panzer1b","CreatedById":95108,"CreatedDateTime":"2015-04-30T15:33:41Z","Content":"What they call 1.0 really doesnt matter to me, be it alpha, beta, or whatever, its still in my eyes an update that brought features and improvements period. Then again, i defenetely wouldnt label it finished with teh sheer amount of bugs present right now.\n\nA short list off the top of my head:\n\nOcclusion is completely broken both for heat AND for drag! You can \u0022occlude\u0022 a 3.5m tank with a cubic strut, and stuff that shouldve been occluded never gets occluded (such as radially mounted stuff even if they are behind the entire craft not exposed to airflow). While the occlusion mechanics are good, its so poorly implemented that designs that would never work can now bypass drag, and some 100% logical planes fail due to occlusion not shielding some things that are 100% behind another part. Now i know this is alot more complicated to fix then most bugs, but i still want my 3.5m tanks to have actual drag regardless of whether i leave them exposed or stick a cubic strut atop (try it, launchg an exposed fuel tank, watch the drag/mach#, and then retry this with a cubic strut atop, drag goes from 700\u002B to 5!\n\nParachutes are virtually indestructible and function at interplanetary velocities for some reason without either burning up or being torn off if deployed properly. I dont think i need to explain ANYTHING when it comes down to why this is broken!\n\nThe pods are notorious for flipping over backwards, and then burning up as the heat shield isnt even pointed in the right direction. Yes its a quickie fix by setting the heat shields to have physics enabled, but why wasnt this addressed in the actual game, unless none of the experimental/QA testers actually tried to reenter with a command pod atop a heat shield (which seems unlikely). Not that this one bug breaks the update, but something THIS SIMPLE should never have been in the final game (all it takes for now is a quick cfg edit!)."},{"CreatedByName":"basic.syntax","CreatedById":109920,"CreatedDateTime":"2015-04-30T16:11:29Z","Content":"The new parts, systems and overhauls in 1.0 are much appreciated; looking forward to what balance tweaks v1.0.1 might bring. Thank you!"},{"CreatedByName":"joebopie","CreatedById":49911,"CreatedDateTime":"2015-04-30T16:21:54Z","Content":"I think if they announced multiplayer I would derail the hype train as I smash through it with my only extreme hype. at witch point I would BE the hype train. ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)"},{"CreatedByName":"Darnok","CreatedById":85708,"CreatedDateTime":"2015-04-30T16:53:08Z","Content":"1.0.1 and 1.1 is big difference guys ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)"},{"CreatedByName":"Leszek","CreatedById":119053,"CreatedDateTime":"2015-04-30T17:57:56Z","Content":"\u003E \n\u003E 1.0.1 and 1.1 is big difference guys ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)\n\nAbsolutely. This is going to be a relatively quick fixer patch. No new features, only tweaks and bug fixes. Still plenty enough to hype train over. I would also expect this update wont break mods. (Err most likely.)\n\nNot that I know at all, that is just what is implied by the version numbers they chose."},{"CreatedByName":"Sampa","CreatedById":130079,"CreatedDateTime":"2015-04-30T18:00:09Z","Content":"oh, hey, yeah! I still need to get on and test out the 1.0 update! Been rather busy with school!"},{"CreatedByName":"iHover","CreatedById":142006,"CreatedDateTime":"2015-04-30T18:50:53Z","Content":"\u003E \n\u003E Yay. This is a consequence of everyone in the history of ever constantly repeating \u0022just fly to 10k and turn 45Ã‚Âº and she\u0027ll be right\u0022. **NOPEH**.\n\u003E There is an entire generation of KSP players who launch rockets in a manner that has zero relevance to actual flight and have very bad habits. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\u003E \n\u003E This really wasn\u0027t covered overly well in the release. Sadly. But - Aero absolutely now acts more like the real-deal. It *isn\u0027t* the real deal however or you\u0027d find it much more challenging.\n\u003E \n\u003E But, much like an actual rocket launch, the ascent is best handled by ensuring you have a positive ascent rate once clear of the pad, and slowly banking in the desired orbital direction in ~5Ã‚Âº (degree) increments. Anything more than about 10Ã‚Âº (degrees) of attack angle (i.e. you stand on the controls to do that ridiculous 45% turn in space at 10km) then you\u0027ll have a bad day.\n\u003E \n\u003E Folks will have habits that may need to be relearned. But at least the game now follows a more logical pattern in that respect. Good luck! ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nTried that still 90% of my launches don\u0027t make it past 3000. Is there any way to recover .90? I don\u0027t care if it ever gets updated Id just like to get my monies worth out of it. 1.0 just sucks"},{"CreatedByName":"neamerjell","CreatedById":86054,"CreatedDateTime":"2015-04-30T18:51:07Z","Content":"Okay, so we all (or at least the majority of us) agree 1.0 is great. I think we are arguing semantics at this point. As long as it is great and the devs are still working to make it even better, what does it matter what version it is called? It could be called version 1 \u002B ( SQRT(5) / 2 ) for all I care. So long as it is stable as it is and the devs are still committed to improving it even further, I\u0027m happy.\n\nEven Micro$oft gave up on version numbers with the release of Windows 95 and assigns seemingly arbitrary names to new versions of Windows. Heck, they even skipped a version and went straight from 8.1 to 10!"},{"CreatedByName":"iHover","CreatedById":142006,"CreatedDateTime":"2015-04-30T19:00:04Z","Content":"Is there a way to get .90 back? I was enjoying .90"},{"CreatedByName":"Captain Vlad","CreatedById":106306,"CreatedDateTime":"2015-04-30T19:42:49Z","Content":"Bug fixes are always welcome; overall I\u0027m having a hell of a lot of fun with this release. The addition of re-entry heat I both hate and love, but the new aero, despite me being skeptical, has been pretty dreamy.\n\nYes, there\u0027s snags and problems. There always are in any release this big; always have been, always will be. I hope, given some of the useless whining we\u0027ve seen on the forums the last few days, that the dev team realizes that most of their fans are more mature than the people making the most noise.\n\nLooking forward to 1.01."},{"CreatedByName":"StanE","CreatedById":32001,"CreatedDateTime":"2015-04-30T20:12:11Z","Content":"\u003E \n\u003E 1.0.1 and 1.1 is big difference guys ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)\n\nVersion numbering doesn\u0027t say anything about what and how many changes were made."},{"CreatedByName":"Cailean_556","CreatedById":12297,"CreatedDateTime":"2015-04-30T20:24:43Z","Content":"Squad,\n\nI am nothing short of thoroughly impressed with how KSP has evolved. v1.0 is an impressive leap forward. Yes, there are some bugs I believe the QA team should have identified in the Experimentals phase, but on the whole compared to 0.90 it\u0027s practically a whole new game.\n\nI\u0027m in a love/hate relationship with aerodynamics, but I\u0027ve learnt to adapt my previous designs to suit - the LVT-45 sees much more use in my rockets now (due to its gimbal). Science is now much more difficult to acquire and the science focus in the Admin building has been re-scaled (which initially caused me to have to rethink my strategy early-game). I\u0027ve yet to set foot on the Mun, I\u0027m trying to perfect the acquisition of science early-game without losing a Kerbal so I keep deleting and restarting a career...\n\nI have big(ger) plans for space stations (which I was never really a fan of as I\u0027m rather unskilled at orbital docking procedures, but getting better...ish...) this time around.\n\nI am disappointed that the QA/Experimentals team didn\u0027t identify that the heat shield causes pods to flip...you\u0027d think that occurence would have been among the first things identified. If it wasn\u0027t an issue for the team, I\u0027d like to know how they were able to conduct re-entry nose first with a heat shield.\n\nAnyway, my first post in erm...a few years...so good job overall guys, just some minor polish required."},{"CreatedByName":"jnz","CreatedById":121746,"CreatedDateTime":"2015-04-30T20:59:06Z","Content":"[![2YVBmOOm.png](http://i.imgur.com/2YVBmOOm.png)](http://imgur.com/2YVBmOO)"},{"CreatedByName":"Leszek","CreatedById":119053,"CreatedDateTime":"2015-04-30T21:33:29Z","Content":"\u003E \n\u003E [http://i.imgur.com/2YVBmOOm.png](http://i.imgur.com/2YVBmOOm.png)\n\nIf you set your speed to surface, you would see that you are about 25 m/s short of the target.\n\nAgreed that ambiguity like this should be more explicit but this isn\u0027t a fail."}]}