{"TopicId":105732,"ForumId":69,"TopicTitle":"Plane won\u0026#039;t acelerate with tail fin placed in engine exhaust","CreatedByName":"lyco","CreatedById":142069,"CreatedDateTime":"2015-04-28T18:54:40Z","PageNum":1,"Articles":[{"CreatedByName":"lyco","CreatedById":142069,"CreatedDateTime":"2015-04-28T18:54:40Z","Content":"\n\u003Cp\u003ESystem: Windows 64bit, KSP v1.0.0 32bit, Steam \u003C/p\u003E\u003Cp\u003EI tried to build plane inspired by Heinkel He 162, the early German jetplane with one engine placed at the top of the fuselage. Craft file at \u003Ca href=\u0022http://leteckaposta.cz/665485466\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://leteckaposta.cz/665485466\u003C/a\u003E screenshot at \u003Ca href=\u0022http://steamcommunity.com/sharedfiles/filedetails/?id=433795755\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://steamcommunity.com/sharedfiles/filedetails/?id=433795755\u003C/a\u003E Note the tailfin placed exactly behind the jet engine.\u003C/p\u003E\u003Cp\u003EWhen I start the plane\u0027s engine, the plane doesn\u0027t move, unles the tailfin is actuated. F3 report also tells me the tailfin has been damaged (which I expect and definitely is not bug). When the engine is left to run at max power for about a minute, the tailfin suddenly explodes and the plane instantly starts moving. When yaw control is used (with the tailfin still attached), the plane jerks, rolls partially and starts moving with reduced speed.\u003C/p\u003E\u003Cp\u003EI would think that in reality, the air would flow around the tailfin mostly undisturbed (unless the tailfin would be used to steer). In KSP, it looks like the thin fin blocks the exhaust. Is this a limitation of the aerodynamics model, or is it some kind of bug?\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-04-28T18:56:58Z","Content":"\n\u003Cp\u003EUh, this is how the game works, sorry, if you block the thrust they won\u0027t work.\u003C/p\u003E\u003Cp\u003ESome engines, like RCS thrusters don\u0027t cause damage so are unaffected, but most engines in KSP just won\u0027t provide thrust while blocked.\u003C/p\u003E\u003Cp\u003ESo yeah, it\u0027s a limitation of the game, it\u0027s been like this since the very early days so is unlikely to change, but we can still do some neat stuff like propel Kerbals through the air using rocket thrust, as they are separate \u0022vessels\u0022 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-04-28T19:02:59Z\u0022 title=\u002204/28/2015 07:02  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 28, 2015\u003C/time\u003E by sal_vager\u003C/strong\u003E\n\u003C/span\u003E\n"}]}