{"TopicId":105993,"ForumId":20,"TopicTitle":"What are the best mods out there?","CreatedByName":"Stealth2668","CreatedById":57377,"CreatedDateTime":"2015-04-29T14:39:53Z","PageNum":1,"Articles":[{"CreatedByName":"Stealth2668","CreatedById":57377,"CreatedDateTime":"2015-04-29T14:39:53Z","Content":"\n\u003Cp\u003EAssuming they have or will be updated for KSP ver. 1.0, what are some must have mods?\u003C/p\u003E\n"},{"CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2015-04-29T14:40:45Z","Content":"\n\u003Cp\u003EKerbal Engineer. It is a fantastic tool for providing you with Delta-v and other statistical information about your vessels.\u003C/p\u003E\n"},{"CreatedByName":"soulsource","CreatedById":110576,"CreatedDateTime":"2015-04-29T14:42:22Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/97285-0-25-Stock-Bug-Fix-Modules\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003EStock Bugfix Modules\u003C/strong\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/20451-0-23-5-Ferram-Aerospace-Research-v0-13-3-4-30-14\u0022 rel=\u0022external nofollow\u0022\u003EFerram Aerospace Research\u003C/a\u003E (not yet ready for 1.0, but will be within a couple of days)\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://sites.google.com/site/kerbalalarmclock/\u0022 rel=\u0022external nofollow\u0022\u003EKerbal Alarm Clock\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EEdit: If you want dV readout, check out \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/54533-0-23-VOID-Vessel-Orbital-Informational-Display\u0022 rel=\u0022external nofollow\u0022\u003EVessel Orbital Information Display\u003C/a\u003E, it has an awesome HUD.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-04-29T14:56:48Z\u0022 title=\u002204/29/2015 02:56  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 29, 2015\u003C/time\u003E by soulsource\u003C/strong\u003E\n\u003Cbr\u003EAdded links.\n\u003C/span\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-04-29T14:49:54Z","Content":"\n\u003Cp\u003EMoved this over to General Add-on Affairs, the place for all your mod-related questions. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"LN400","CreatedById":140595,"CreatedDateTime":"2015-04-29T16:24:33Z","Content":"\n\u003Cp\u003EBest is all in what each of us want KSP to be. To me and not counting parts mods, number 1 would be KOS simply because it adds a tremendous amount to what is involved in planning even the simplest mission, down to writing ship specific code for that particular rocket. MechJeb is a classic but to me I\u0027d much rather have the satisfaction, after cursing and shouting and pulling my hair out for a couple of days, to see all the work I put into that mission, like writing the auto pilot code, ended with success. How many games have I ever played before where I felt that completing the first orbit entitled me to having a cold one from the fridge?\u003C/p\u003E\u003Cp\u003EAnother top ace is Kerbal Engineer Redux. When you don\u0027t feel like having to put a ton of work into a mission, then it really is a LOT of help. Even if you do like all the nasty maths bits, KER in my opinion offers more than just a few numbers to make the build easier. If you want to think ground control is busy with their computers computing orbital time, rendezvous time, any-sort-of-time, delta v, then KER will offer you all that.\u003C/p\u003E\u003Cp\u003EIf you want more out of your satelite program then 2 mods: Remote Tech and SCANSat. RT in particular is a game changer as far as sats and probes go.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-04-29T16:30:27Z\u0022 title=\u002204/29/2015 04:30  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 29, 2015\u003C/time\u003E by LN400\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"lance0625","CreatedById":139939,"CreatedDateTime":"2015-04-29T17:39:05Z","Content":"\n\u003Cp\u003EI do like some features of some mods:\u003C/p\u003E\u003Cp\u003Emechjeb:I love the suicidal burn(when you are landing),it\u0027s just soo scary but fun at some times.\u003C/p\u003E\u003Cp\u003Ekerbal foundries:for the wheels this mod is a most plus it has anti-grav.\u003C/p\u003E\u003Cp\u003Ekethane:for mining but i haven\u0027t tested the mining of the stock ksp sooo yea...\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2015-04-29T18:02:20Z","Content":"\n\u003Cp\u003EKerbal Alarm Clock is a must have for everyone\u003C/p\u003E\n"},{"CreatedByName":"ultrasquid","CreatedById":10944,"CreatedDateTime":"2015-04-29T18:48:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sirrobert\u0022 data-cite=\u0022Sirrobert\u0022\u003E\u003Cdiv\u003EKerbal Alarm Clock is a must have for everyone\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have to agree here.\u003C/p\u003E\u003Cp\u003E\u0022Best mod\u0022 can mean a lot of different things to different people. I like Firespitter, RetroFuture, and other aviation mods because I like more choices when building planes. I like the range of parts I get in NovaPunch and Near Future. Editor Extensions is a great aid to craft building, and MechJeb makes so many things so much easier.\u003C/p\u003E\u003Cp\u003EBut Kerbal Alarm Clock is the one that has most fundamentally changed the way I play KSP. Where I used to launch one rocket at a time and time warp it all the way through to its mission objective and return, with KAC I can have several missions going simultaneously, with much less time warping.\u003C/p\u003E\n"},{"CreatedByName":"3Dave","CreatedById":102832,"CreatedDateTime":"2015-04-29T21:07:23Z","Content":"\n\u003Cp\u003EB9 Aerospace: love my massive 60\u002B ton payload SSTO jumbo jets (hope it gets updated soon).\u003C/p\u003E\u003Cp\u003ESome form of life support system. trying out USI-LS at the moment, but TAC is good too. Depends on how much challenge you want. I personally like having to ferry supplies to my remote outposts to keep the kerbals alive. hehe. \u003C/p\u003E\u003Cp\u003EMech Jeb: might be sorta cheaty, but it takes alot of the annoyance out of the game after you have colonies set up on several planets. launching and landing manually is only fun the first few times, then its just a drag. plus, real spacecraft are computer controlled. \u003C/p\u003E\u003Cp\u003ENear Future Tech \u0026amp; interstellar: love the huge solar panels really help cut down on part count for large stations. and who doesn\u0027t love reactors and radiators? \u003C/p\u003E\u003Cp\u003ERemoteTech: Again, great if you like a challenge. can be frustrating until you get a nice deep space satellite network built. But it adds a great sense of \u0022purpose\u0022 to your launches. \u003C/p\u003E\u003Cp\u003Eand a myriad of other various mods, i try to give everything a chance at least once, delete if im not using it or dont like it. etc. I usually play in sandbox mode, hence the lifesupport and drone comms mods to bring the challenge back in. your mileage may vary if you prefer science/career mode.\u003C/p\u003E\n"},{"CreatedByName":"Thnd3r","CreatedById":137708,"CreatedDateTime":"2015-04-29T22:00:37Z","Content":"\n\u003Cp\u003EChatterer for making KSP not so quiet \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"juanml82","CreatedById":105344,"CreatedDateTime":"2015-04-29T23:32:13Z","Content":"\n\u003Cp\u003EFusebox doesn\u0027t get the love it deserves. At a glance, you see how much electricity you\u0027re generating (if any) and how long until your batteries run out\u003C/p\u003E\n"}]}