{"TopicId":106030,"ForumId":21,"TopicTitle":"skylonesque high performance SSTO","CreatedByName":"Teutooni","CreatedById":76518,"CreatedDateTime":"2015-04-29T16:54:51Z","PageNum":1,"Articles":[{"CreatedByName":"Teutooni","CreatedById":76518,"CreatedDateTime":"2015-04-29T16:54:51Z","Content":"\n\u003Cp\u003EWhat started as a proof-of-concept plane for an SSTO with ISRU capability with the new 1.0 stock refinery and aerodynamics turned out to be a pretty solid SSTO design performance-wise. I present the Carina-Sagittarius heavy SSTO, inspired by the skylon spaceplane concept. It\u0027s a 135-ton spaceplane with one long mk3 cargobay and one short mk3 cargobay mounted upside down for fitting a drill inside. Payload fraction is at least 20%, which means one full orange fuel tank weighing 36 tons to 75kmx75km orbit (with almost 1km/s delta-v left after payload separation). Like skylon, it is unmanned. If you want crew, feel free to slap some command pods/passenger modules inside the cargobay. The upside down cargobay would be ideal for extensible ladders too.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/xipmpkc43sw96r4/Carina-Sagittarius%201_1.craft?dl=0\u0022 rel=\u0022external nofollow\u0022\u003EDropbox link to craft file.\u003C/a\u003E\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/LPkpO\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EAction groups as follows:\u003C/p\u003E\u003Cp\u003EAG1=toggle rapiers\u003C/p\u003E\u003Cp\u003EAG2=switch rapier mode\u003C/p\u003E\u003Cp\u003EAG3=toggle poodle\u003C/p\u003E\u003Cp\u003EThe ascent profile is a little complicated. I divide it into 4 phases.\u003C/p\u003E\u003Cp\u003EPhase 1: takeoff on rapiers in airbreathing mode. Climb at 20 degrees to 5km.\u003C/p\u003E\u003Cp\u003EPhase 2: at 5 km start leveling out to gain speed. If carrying heavy payload turn poodle on. Goal is to hit 450-500m/s. Don\u0027t be afraid to lose a little altitude to gain speed if under heavy load.\u003C/p\u003E\u003Cp\u003EPhase 3: once rapiers kick into full gear at mach 2, start climbing again at 20 degrees. At 13-15km start leveling out a little again but this time do not lose altitude. Goal is to hit 1200m/s at 20km (1400m/s at 23km with light payload).\u003C/p\u003E\u003Cp\u003EPhase 4: above 19km turn on poodle and open action menu of the rapiers. Once the thrust of a single rapier falls below ~150kN, switch them to closed cycle and burn at 5-15 degrees till you hit target apoapsis. Circularize.\u003C/p\u003E\u003Cp\u003EWith 4 airbrakes re-entry is a cakewalk. Just remember to pump some fuel to the nose to keep CoM in front of CoL. I found filling the second foremost tank (i.e. not the adapter) with whatever is left does the trick. If the plane spins to go tail first you need more fuel in front and if you get no control authority it\u0027s too nose-heavy.\u003C/p\u003E\u003Cp\u003EI did several test flights up to LKO, with the best figures being 1595 m/s delta-v left after circularizing 75km with the ISRU converter payload, way more than what is needed to land on minmus (mun would be tight). Around 600m/s left with full orange tank payload (36 tons) and 990 m/s after separation. Now that I think of it I should have also written down the delta-v if the fuel in the payload tank were to be used. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlso yeah, SSTOs are still possible, still useful.\u003C/p\u003E\n"},{"CreatedByName":"antbin","CreatedById":22389,"CreatedDateTime":"2015-04-29T18:05:11Z","Content":"\n\u003Cp\u003ENice build! The \u0022canards\u0022 look really clean. What are the RAPIERs attached to, precoolers? Do they improve anything? And finally, which parts are the first to explode from over-heating?\u003C/p\u003E\n"},{"CreatedByName":"Teutooni","CreatedById":76518,"CreatedDateTime":"2015-04-29T21:24:32Z","Content":"\n\u003Cp\u003EThanks! They are precoolers and they provide additional air intake. And they don\u0027t blow up. First to go when overheating are the intakes in the front of the nacelles, then front winglets. After that it takes a while but sooner or later the struts will start to melt (at the time I was going 1600 m/s 18km), followed by the big wings shortly thereafter and the whole plane a fraction of a second later. This gave me an idea to replace all air intakes with precoolers to improve very high speed performance.\u003C/p\u003E\n"},{"CreatedByName":"Roflcopterkklol","CreatedById":119190,"CreatedDateTime":"2015-04-29T21:31:42Z","Content":"\n\u003Cp\u003ESo it seems big is the answer for SSTOs now, im at 69 tons on mine and it only goes to LKO, \u002Brep this is the first SSTO i have seen that can leave LKO and it can do it with cargo, just awesome\u003C/p\u003E\n"},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2015-04-29T22:44:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Roflcopterkklol\u0022 data-cite=\u0022Roflcopterkklol\u0022\u003E\u003Cdiv\u003ESo it seems big is the answer for SSTOs now, im at 69 tons on mine and it only goes to LKO, \u002Brep this is the first SSTO i have seen that can leave LKO and it can do it with cargo, just awesome\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELKO with a small satellite turns out to be relatively easy: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/117025-The-Race-to-Publish-the-First-KSP-1-0-Compatible-Spaceplane-SSTO?p=1881827\u0026amp;viewfull=1#post1881827\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/117025-The-Race-to-Publish-the-First-KSP-1-0-Compatible-Spaceplane-SSTO?p=1881827\u0026amp;viewfull=1#post1881827\u003C/a\u003E \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EBeyond LKO... I haven\u0027t a clue xD Maybe Squad intentionally balanced it so that MK2 hulls are short range only, and you have to step up to MK3 for anything more than a light orbital lifter. Definite props to the OP for a big red in 1.0 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Teutooni","CreatedById":76518,"CreatedDateTime":"2015-04-29T23:17:43Z","Content":"\n\u003Cp\u003EThe biggest problem with small craft I found was heat management. See those massive fuel tanks in the front half of the large plane? Very good heat sinks. Small planes\u0027 noses/cockpits kept blowing up for me, even with fuel behind them. Large wings also tolerate heat very well, especially ones with fuel in them. Large planes benefit from relatively smaller surface section so less drag, relatively. Third, rapiers have enormous TWR at optimal operating range capable of lifting a lot if kept under those conditions. It is therefore effective to bring a lot of LFO\u002Brockets, squeeze everything out of those rapiers at mach 2-4 and then burn the massive amount of fuel they are capable of lifting to 20km.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-04-29T23:31:51Z\u0022 title=\u002204/29/2015 11:31  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 29, 2015\u003C/time\u003E by Teutooni\u003C/strong\u003E\n\u003C/span\u003E\n"}]}