{"TopicId":106038,"ForumId":32,"TopicTitle":"About recent community criticism in the direction of the QA \u0026 exp testers","CreatedByName":"KasperVld","CreatedById":40700,"CreatedDateTime":"2015-04-29T17:34:36Z","PageNum":11,"Articles":[{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-05-07T03:17:24Z","Content":"1.0 has happened. Let\u0027s all move on, and look forward to the future. Yes, mistakes were made. Yes, there are bugs. But it\u0027s 1.0. Too late to do anything about it."},{"CreatedByName":"Aerindel","CreatedById":109952,"CreatedDateTime":"2015-05-07T03:19:30Z","Content":"Meh. This thread is probably not going anywhere. It seems clear that we aren\u0027t going to get through. I\u0027m already losing interest in KSP anyway. After who knows how many hundreds of hours playing I\u0027m tired of being an alpha tester, I was hyped for 1.0 because I really wanted to stop messing around and start a real campaign, one saved game with everything in it, a game that would go on for years and just get better and better over time. But its clear that 1.0 was just another beta...and that we are still in beta and still waiting for this to be a finished game."},{"CreatedByName":"Landge","CreatedById":57671,"CreatedDateTime":"2015-05-07T03:30:54Z","Content":"It\u0027s not like Squad has closed the doors and moved on to other interests. They are committed to continuing development aren\u0027t they? Even with the hiccups and warts, I have continued to play KSP. Until the \u0022next best thing\u0022 comes along, there just hasn\u0027t been any \u0022next best thing\u0022 worth playing that has kept my interest as long as KSP."},{"CreatedByName":"Lord Aurelius","CreatedById":71687,"CreatedDateTime":"2015-05-07T03:35:01Z","Content":"The other thing to remember is that the devs are basically on vacation this week, we probably won\u0027t hear much from them until at least after that."},{"CreatedByName":"Aerindel","CreatedById":109952,"CreatedDateTime":"2015-05-07T04:01:42Z","Content":"\u003E \n\u003E Until the \u0022next best thing\u0022 comes along, there just hasn\u0027t been any \u0022next best thing\u0022 worth playing that has kept my interest as long as KSP.\n\nTrue enough. KSP was the \u0022next best thing\u0022 that made me drop minecraft after years of playing. Actually, it was Simple Rockets on my iPad that started it all, I got obsessed with that game and it had an ad for KSP right in the main menu."},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2015-05-07T04:23:28Z","Content":"Read the last two pages, decided my thoughts were necessary again.\n\nHere\u0027s what I see: There isn\u0027t really a small group of very hostile people as there are a very large quantity of moderately peeved people. That latter case is a heck of a lot harder to deal with as mods because you can\u0027t just shut them down as flamers, and there\u0027s way too many to shut down. I can understand the mod team going into firefighting mode (mods, yall\u0027s last few posts are definitely firefighting mode whether you\u0027re intending to or not). Back when 1.0 was announced, I made the prediction the lack of proper beta cycle would cause a buggy update that would flop. I think spaceplanes being near impossible, lead alone viable, for several days counts as a flop.\n\nWarning: bluntness\n\nI think Squad had this coming, I think they deserve it, and I think they need it. I don\u0027t ever recall an update ever receiving any kind of overall negative response. 1.0 garnered a good bit of it. Squad might just need a bit of a kick in the pants. Everyone learns by criticism and I think they might need a bit of a fire lit under them. I can understand why, reading through this, the mod team is reacting as they are. They\u0027re watching a community which holds their devs in the utmost light turn around and light a fire under them. If I were a mod, I\u0027d be panicking too. But truth be told, I think Squad needs to be confronted with this, a large fraction of the community dissatisfied with the 1.0 release. I\u0027d then hope they take that criticism in stride and learn from it. 1.0 came, and its a thing. It\u0027s a great update, but it was NOT ready to be the gold release. I believed that on announcement, and I believe it now.\n\nTL;DR I think Squad jumped the gun, and they need to deal with the fire from it. I think some constructive criticism/tough love might do them some good and I hope they take it in stride. And I most certainly know that what\u0027s done is done and we **ALL** need to move on.\n\nEDIT: Another thing I forgot to mention above.\n\nI think its equally important for us as community members and players to remember that HarvesteR and the rest of the devs at Squad are still mere mortal men, not the gods of sandbox game design we sometimes make them out to be. They can make mistakes, and while we can and will criticize them for it, its unfair of us to judge them as if they never make mistakes. Crap like this happens. There is an appropriate limit to how much you can hound Squad for the screw up. We\u0027re about at that threshold. We all need to turn the dial back a hair, wait for Squad to get back in the office after their hard earned week off, and then deal with the bonfire we built for them.\n\nThey aren\u0027t perfect, this shows that. We can be critical, but the more constructive we are, the easier it is for them to fix the issues we have and move on.\n\n**Edited \u003Ctime datetime=\u00222015-05-07T04:33:09Z\u0022 title=\u002205/07/2015 04:33  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 7, 2015\u003C/time\u003E by Captain Sierra**"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2015-05-07T04:30:48Z","Content":"I\u0027m guessing you either were not here for or forgot the 0.19 release, Captain Sierra. There was about as much bellyaching and complaining then as there is now from about as many people (relatively speaking; obviously KSP\u0027s audience has grown considerably since then)."},{"CreatedByName":"I_Killed_Jeb","CreatedById":84817,"CreatedDateTime":"2015-05-07T04:36:04Z","Content":"\u003E \n\u003E Read the last two pages, decided my thoughts were necessary again.\n\u003E Here\u0027s what I see: There isn\u0027t really a small group of very hostile people as there are a very large quantity of moderately peeved people. That latter case is a heck of a lot harder to deal with as mods because you can\u0027t just shut them down as flamers, and there\u0027s way too many to shut down. I can understand the mod team going into firefighting mode (mods, yall\u0027s last few posts are definitely firefighting mode whether you\u0027re intending to or not). Back when 1.0 was announced, I made the prediction the lack of proper beta cycle would cause a buggy update that would flop. I think spaceplanes being near impossible, lead alone viable, for several days counts as a flop.\n\u003E \n\u003E Warning: bluntness\n\u003E \n\u003E I think Squad had this coming, I think they deserve it, and I think they need it. I don\u0027t ever recall an update ever receiving any kind of overall negative response. 1.0 garnered a good bit of it. Squad might just need a bit of a kick in the pants. Everyone learns by criticism and I think they might need a bit of a fire lit under them. I can understand why, reading through this, the mod team is reacting as they are. They\u0027re watching a community which holds their devs in the utmost light turn around and light a fire under them. If I were a mod, I\u0027d be panicking too. But truth be told, I think Squad needs to be confronted with this, a large fraction of the community dissatisfied with the 1.0 release. I\u0027d then hope they take that criticism in stride and learn from it. 1.0 came, and its a thing. It\u0027s a great update, but it was NOT ready to be the gold release. I believed that on announcement, and I believe it now.\n\u003E \n\u003E TL;DR I think Squad jumped the gun, and they need to deal with the fire from it. I think some constructive criticism/tough love might do them some good and I hope they take it in stride. And I most certainly know that what\u0027s done is done and we **ALL** need to move on.\n\nthat\u0027s a nice theory except that so far there\u0027s nothing that shows SQUAD believed they made a mistake to start with. continued disengagement only makes me fear further.\n\nthe fact that there are save-breaking changes so close to release (and yes, in a spaceship building game, if a minor post-release patch breaks its ability to get to space, that\u0027s a save-breaking change), and that there are people (mainly mods, it seems) defending this (indeed, even spinning as a positive re: squad reaction time... lol) alienates me."},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2015-05-07T04:40:38Z","Content":"\u003E \n\u003E Professionals are expected to deal with criticism however it comes.\n\nFirstly, the testing and QA people are *not* professionals. They are volunteers. Since you\u0027re not paying them, the least you could do is show them a little gratitude and courtesy for their **volunteered** efforts. Secondly, they are human beings, and they will have emotional reactions to what is said to and about them. The question for you is, will you say, \u0022They should be able to handle this, therefore I\u0027m going to continue to express myself in a counter-productive way,\u0022 or will you say, \u0022I will be polite because it has a better chance of getting me what I want\u0022? Even if you do not care about their feelings, it would be smarter for you to use the approach that works better. *Politeness is in your own best interests*. \n\n\u003E \n\u003E It\u0027s incredible the lengths you go to convince yourself that everything about this game\u0027s design process is working as intended.\n\nNo one said the system is perfect or couldn\u0027t be improved. The subject of this thread is that the testers are due some courtesy for the volunteered efforts. Really, it is. [Go back and check, if you don\u0027t believe me.](https://forum.kerbalspaceprogram.com/threads/117712-About-recent-community-criticism-in-the-direction-of-the-QA-exp-testers?p=1880582\u0026viewfull=1#post1880582)But the problem is that posters in this thread are almost universally determined to ignore the actual subject of the thread, and just repeat the same complaints and accusations already posted in many other threads. If our replies to these complaints do not seem on-topic to you, it\u0027s because we are talking about the subject of the thread, and you are not. \n\nLook at the first line of that post of Sal\\_vager\u0027s you quoted. \n\n\u003E \n\u003E There have been many threads and many posts these last few days that have done little more than attack the guys and girls who have volunteered their time to test KSP so all of the rest of us can enjoy a playable game.\n\nHe is *not* saying the game is without flaws, and he is *not* saying the system can\u0027t be improved. He is imploring people not to insult and demean the volunteer testers. Because **that** is the topic of this thread."},{"CreatedByName":"I_Killed_Jeb","CreatedById":84817,"CreatedDateTime":"2015-05-07T04:56:53Z","Content":"\u003E \n\u003E Firstly, the testing and QA people are *not* professionals. They are volunteers. Since you\u0027re not paying them, the least you could do is show them a little gratitude and courtesy for their **volunteered** efforts. Secondly, they are human beings, and they will have emotional reactions to what is said to and about them. The question for you is, will you say, \u0022They should be able to handle this, therefore I\u0027m going to continue to express myself in a counter-productive way,\u0022 or will you say, \u0022I will be polite because it has a better chance of getting me what I want\u0022? Even if you do not care about their feelings, it would be smarter for you to use the approach that works better. *Politeness is in your own best interests*.\n\nI\u0027m not talking about the QA people, I\u0027m talking about SQUAD. \n\nFurthermore while I generally agree with you re: politeness my observation thusfar is that SQUAD seems to mostly respond to people raising a stink, not politely making requests.\n\n\u003E \n\u003E No one said the system is perfect or couldn\u0027t be improved. The subject of this thread is that the testers are due some courtesy for the volunteered efforts. Really, it is. [Go back and check, if you don\u0027t believe me.](https://forum.kerbalspaceprogram.com/threads/117712-About-recent-community-criticism-in-the-direction-of-the-QA-exp-testers?p=1880582\u0026viewfull=1#post1880582)But the problem is that posters in this thread are almost universally determined to ignore the actual subject of the thread, and just repeat the same complaints and accusations already posted in many other threads. If our replies to these complaints do not seem on-topic to you, it\u0027s because we are talking about the subject of the thread, and you are not.\n\nThe entire subject of the thread is a ridiculous strawman to prop up the notion that criticism of 1.0 was somehow mostly rooted in mistaken rage at QA. Any fair read of the situation shows otherwise. Since the premise of the thread itself is absurd to a lot (most?) of us we decided to talk about the actual problem at the root of this alleged hatred of QA people.\n\n\u003E \n\u003E Look at the first line of that post of Sal\\_vager\u0027s you quoted. \n\u003E \n\u003E He is *not* saying the game is without flaws, and he is *not* saying the system can\u0027t be improved. He is imploring people not to insult and demean the volunteer testers. Because **that** is the topic of this thread.\n\nMaybe *you* should actually look at his post. I am specifically responding to such ridiculous reductions like when he implies the problem with aero is entirely due to people being somehow irrationally attached to their own vision, as opposed to fact that it was **RELEASED POORLY TESTED**.\n\nto wit -\n\n\u003E \n\u003E Now with 1.0 aero we\u0027re seeing two things, first, it is not accurate enough for some and they complain, missing the point as they have done so since the beginning that KSP will not be as accurate as they want it to be.\n\u003E Second, it is very different to .90, it has changed so many things, many .90 craft are no longer tenable, everything from reaching orbit to landing to basic vessel design is changed, this came as a big shock to many and some don\u0027t want to adjust.\n\nHey if you have a problem with us straying from the topic maybe the mods shouldn\u0027t do it either since all I was doing was responding to specific comments that your colleague made. But hey I guess the best way to call for more civility in the community is to call them \u0022disgusting,\u0022 that\u0027s certainly in line with your lecture about counterproductive expression of ideas."},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2015-05-07T05:02:39Z","Content":"When I\u0027m having trouble keeping perspective, I find this useful:\n\n[http://inspiremetoday.com/blog/top-10-daily-mantras-to-get-you-going/](http://inspiremetoday.com/blog/top-10-daily-mantras-to-get-you-going/)\n\n**Edited \u003Ctime datetime=\u00222015-05-07T05:04:42Z\u0022 title=\u002205/07/2015 05:04  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 7, 2015\u003C/time\u003E by Pthigrivi**"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2015-05-07T05:05:26Z","Content":"\u003E \n\u003E I\u0027m guessing you either were not here for or forgot the 0.19 release, Captain Sierra. There was about as much bellyaching and complaining then as there is now from about as many people (relatively speaking; obviously KSP\u0027s audience has grown considerably since then).\n\nNo, I bought this game in 0.20.2. I was not here for whatever fiasco that 0.19 was. What, specifically, was the 0.19 release in terms of features?\n\n\u003E \n\u003E that\u0027s a nice theory except that so far there\u0027s nothing that shows SQUAD believed they made a mistake to start with. continued disengagement only makes me fear further.\n\u003E the fact that there are save-breaking changes so close to release (and yes, in a spaceship building game, if a minor post-release patch breaks its ability to get to space, that\u0027s a save-breaking change), and that there are people (mainly mods, it seems) defending this (indeed, even spinning as a positive re: squad reaction time... lol) alienates me.\n\nThe entire dev team is still on break after 1.0. Presuming the mod staff does not actively try to shield them from this (which I don\u0027t believe our mod staff is petty enough to do), they\u0027ll catch on. ALso, they might not publicly admit to their forum community that they screwed up. It doesn\u0027t change the fact that they\u0027re aware of it and the proof will be in both the 1.0.3 fix and the 1.1 patch.\n\n\u003E \n\u003E Firstly, the testing and QA people are *not* professionals. They are volunteers. Since you\u0027re not paying them, the least you could do is show them a little gratitude and courtesy for their **volunteered** efforts. Secondly, they are human beings, and they will have emotional reactions to what is said to and about them. The question for you is, will you say, \u0022They should be able to handle this, therefore I\u0027m going to continue to express myself in a counter-productive way,\u0022 or will you say, \u0022I will be polite because it has a better chance of getting me what I want\u0022? Even if you do not care about their feelings, it would be smarter for you to use the approach that works better. *Politeness is in your own best interests*. \n\u003E No one said the system is perfect or couldn\u0027t be improved. The subject of this thread is that the testers are due some courtesy for the volunteered efforts. Really, it is. [Go back and check, if you don\u0027t believe me.](https://forum.kerbalspaceprogram.com/threads/117712-About-recent-community-criticism-in-the-direction-of-the-QA-exp-testers?p=1880582\u0026viewfull=1#post1880582)But the problem is that posters in this thread are almost universally determined to ignore the actual subject of the thread, and just repeat the same complaints and accusations already posted in many other threads. If our replies to these complaints do not seem on-topic to you, it\u0027s because we are talking about the subject of the thread, and you are not. \n\u003E \n\u003E Look at the first line of that post of Sal\\_vager\u0027s you quoted. \n\u003E \n\u003E He is *not* saying the game is without flaws, and he is *not* saying the system can\u0027t be improved. He is imploring people not to insult and demean the volunteer testers. Because **that** is the topic of this thread.\n\nI looked for this bashing of testers and what I found was a small (yet scathing) minority. Generally speaking, of all of us displeased with how 1.0 was handled, the vast majority of us are not assigning blame to the Q\u0026A teams. We\u0027re assigning blame on the lack of a proper beta cycle due to rushed release schedule. the Q\u0026A \u0026 Experimentals teams were the only groups who GOT a beta cycle, so blame falling on them is due to this small group not understanding the facts.\n\nThe discussion has shifted towards the frustration over the development cycle because THAT is the root cause of the problem Kasper is addressing in the OP. Discussing the root cause of the issue which spawned this thread I feel is not out of scope at all."},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2015-05-07T05:19:05Z","Content":"\u003E \n\u003E I\u0027m not talking about the QA people, I\u0027m talking about SQUAD.\n\nThen do not post in a thread that is about the testing and QA team, as this one is. \n\n\u003E \n\u003E The entire subject of the thread is a ridiculous strawman to prop up the notion that criticism of 1.0 was somehow mostly rooted in mistaken rage at QA.\n\nThis is your opinion. It does not entitle you to diverge from the topic. \n\nHowever, since this thread absolutely refuses to stay on-topic, it\u0027s time to put an end to it."}]}