{"TopicId":106001,"ForumId":16,"TopicTitle":"Kerbonauts, what can they do?","CreatedByName":"krillin678","CreatedById":79985,"CreatedDateTime":"2015-04-29T15:14:05Z","PageNum":1,"Articles":[{"CreatedByName":"krillin678","CreatedById":79985,"CreatedDateTime":"2015-04-29T15:14:05Z","Content":"Having a hard time finding out information on this, especially with 1.0. I have seen the .90 wiki on this. So the main question is:\n\nKerbonauts level, what do they gain at each level?"},{"CreatedByName":"Poofer","CreatedById":110117,"CreatedDateTime":"2015-04-29T15:21:11Z","Content":"pilot 0= SAS\n\npilot 1 = prograde/retrograde\n\n...\n\n..\n\n?\n\nscientist 0 = reset science/ do science from outside\n\nengineer 0 ?\n\nall kerbals need astronaut center level 1 to get out of command module\n\nresearch level 1 allows surface samples"},{"CreatedByName":"krillin678","CreatedById":79985,"CreatedDateTime":"2015-04-29T15:23:13Z","Content":"Well, that is a start."},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2015-04-29T16:46:29Z","Content":"See: [http://wiki.kerbalspaceprogram.com/wiki/Experience](http://wiki.kerbalspaceprogram.com/wiki/Experience) at the very bottom.\n\nIn addition to what\u0027s listed there, these abilities are new in 1.0:\n\n- Engineers improve the performance of mining drills attached to the vessel they\u0027re in (apparently no level requirement, but maybe it scales with level? Who knows...)\n\n- Scientists can clean and reset goo canister and materials bay experiments, which are otherwise single-use only (unsure if level requirement)\n\nAdditionally, there\u0027s the reworked Mobile Processing Lab. Staffing it with Scientists would make sense, but I\u0027ve not actually seen Squad talk about this anywhere. They just explained that you can now have the MPL generate science constantly over an extended period of time. Does it require Scientists? Does the production rate scale with level? Nobody knows..."},{"CreatedByName":"Scrogdog","CreatedById":66879,"CreatedDateTime":"2015-04-29T17:17:45Z","Content":"Something else I noticed last night. After having Jeb and Val both gain an easy experience point by doing short biome hops near the space center, I figured why not try Bill and Bob too?\n\nAnd it worked; don\u0027t need SAS in this situation so it didn\u0027t matter that they could not turn it on. So now, Bill is a better engineer and Bob a better scientist via the XP they earned by piloting."},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2015-04-29T17:21:40Z","Content":"Small piece of advice: Once you\u0027ve trained you\u0027re crew up to level three there isn\u0027t much more they can learn. If you don\u0027t need their skills on your next mission leave them at KSC and start training rookies."}]}