{"TopicId":106111,"ForumId":55,"TopicTitle":"Squad has opened a can of worms with the new heating stuff!","CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-04-29T21:33:09Z","PageNum":1,"Articles":[{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-04-29T21:33:09Z","Content":"\n\u003Cp\u003EI have to say that I LOVE the new heat system! I really do! It is a great overhaul and it really makes the game feel more authentic. Problem is, there\u0027s no real way to know what parts are overheating without having the debug stuff turned on, and even that is a bit daunting to new users who just want to figure out why their ship is overheating.\u003C/p\u003E\u003Cp\u003EHow can we fix this stuff?\u003C/p\u003E\u003Cp\u003EHere\u0027s an idea: Make heat glow based on percent of maximum heat rather than the real temperatures that things start to glow.\u003C/p\u003E\u003Cp\u003ENow this does somewhat break realism, but I think this is one of those cases where realism should be replaced a bit with gameplay. I have a shuttle, the Edwin Abbot MkII, and its wing strakes (which are clearly designed to go on a shuttle where they do) keep breaking due to overheating, even when little to no shock heating is occurring. There\u0027s no warning, because its not actually hot enough to produce the red glow. So I figured, perhaps instead you could simply uncouple the heat glow directly from heat and couple it to percentage of maximum heat. Unfortunately, this would have the side effect of making things that SHOULD have a lower heat resistance, like the Mystery Goo or something, glow red when at relatively cool temperatures.\u003C/p\u003E\u003Cp\u003EAnother idea would be to have a thermometer (as a graphical thing, rather than a number, a GUI thing like the thrust limit) in the part\u0027s context menu, showing the percent of maximum heat.\u003C/p\u003E\u003Cp\u003EAnother problem with the heat system is the radiators, which has already been discussed. TLDR: We should have dedicated radiator panels.\u003C/p\u003E\u003Cp\u003EEager to see your suggestions.\u003C/p\u003E\n"},{"CreatedByName":"worir4","CreatedById":75980,"CreatedDateTime":"2015-04-29T21:44:08Z","Content":"\n\u003Cp\u003EI agree, however I think a simpler solution would be to blink a warning light when any part reaches 70% or something like that, of it\u0027s maximum temperature. But then I suppose you wouldn\u0027t know which part was over heating. Maybe a combination of both. When a part reaches around 70% of the max temperature then it begins to glow. That way not all things with low heat tolerance would glow all the time.\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2015-04-29T21:48:15Z","Content":"\n\u003Cp\u003EI would like \u003C/p\u003E\u003Cp\u003E1) an audible overheating alarm.\u003C/p\u003E\u003Cp\u003E2) a key (and assignable keyboard key) that I could press to toggle the heat display on/off for a quick look at WHAT\u0027s overheating.\u003C/p\u003E\n"},{"CreatedByName":"Hcube","CreatedById":137241,"CreatedDateTime":"2015-04-29T22:36:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Brotoro\u0022 data-cite=\u0022Brotoro\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E1) an audible overheating alarm.\u003C/p\u003E\u003Cp\u003E2) a key (and assignable keyboard key) that I could press to toggle the heat display on/off for a quick look at WHAT\u0027s overheating.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E^This. Really. A \u0022show thermal overlay\u0022 toggle. That is what we need, along with the alarm, so that we dont have to have to overlay ON most of the time to check if everything is ok, just check when the alarm goes off to see what parts are overheating.\u003C/p\u003E\u003Cp\u003EAlarm only : not precise enough.\u003C/p\u003E\u003Cp\u003EOverlay only : you would have to keep it on all the time to be sure everythibg is nominal.\u003C/p\u003E\u003Cp\u003EBoth : Perfection (IMO)\u003C/p\u003E\u003Cp\u003ENone : what we have now !\u003C/p\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-04-30T01:11:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Brotoro\u0022 data-cite=\u0022Brotoro\u0022\u003E\u003Cdiv\u003EI would like \u003Cp\u003E1) an audible overheating alarm.\u003C/p\u003E\u003Cp\u003E2) a key (and assignable keyboard key) that I could press to toggle the heat display on/off for a quick look at WHAT\u0027s overheating.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMaybe a way to make the thermometer usable here would be to require that a thermometer be attached to the craft for you to be able to see the heat levels? The thermometer would of course be given an insane heat tolerance to make sure it doesn\u0027t poof first.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-04-30T01:21:22Z","Content":"\n\u003Cp\u003EI really like the way the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/116773\u0022 rel=\u0022external nofollow\u0022\u003EHeatWarning\u003C/a\u003E mod does it, minus the alarm which I\u0027m going to tone down a (Luckily it\u0027s just an ogg file so you can replace it with anything).\u003C/p\u003E\u003Cp\u003EWhen you get up to a certain percentage the alarm goes off, and all affected parts get a little popup that shows how close they are to asploding. If you don\u0027t care, you can just click the toolbar icon and shut it up.\u003C/p\u003E\n"},{"CreatedByName":"nholzric","CreatedById":7793,"CreatedDateTime":"2015-04-30T01:49:19Z","Content":"\n\u003Cp\u003EThis may be too ambitious, but if there\u0027s a little window next to contracts, resources, etc, that when you opened it had a little silhouette of your ship from the three cardinal directions with either a heat-map or maybe just a blinking warning symbol that points to whatever part is overheating...\u003C/p\u003E\u003Cp\u003EI was inspired by the new feature of saving min-pictures in the VAB and HAB. But this could be a completely different mechanic, don\u0027t know how hard this would be.\u003C/p\u003E\n"},{"CreatedByName":"Robotengineer","CreatedById":104525,"CreatedDateTime":"2015-04-30T01:56:31Z","Content":"\n\u003Cp\u003EThere is also a mod called\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/116888-1-0-The-Plugin-Workshop-Small-plugins-of-varied-function\u0022 rel=\u0022external nofollow\u0022\u003E Thermal Monitor.\u003C/a\u003E That I have been using. I would like for some of these suggestions to be stock though.\u003C/p\u003E\n"},{"CreatedByName":"Wallygator","CreatedById":97357,"CreatedDateTime":"2015-04-30T04:27:34Z","Content":"\n\u003Cp\u003EIt might also be nice to have the staging column on the left converted to a ship systems display where all parts in each stage could be shown (they could be collapsed or expanded of course) \u003C/p\u003E\u003Cp\u003EThen if a part is overheating, it could show up in the associated stage in an appropriate flashing color. Click it, and the temp data could pop up adjacent. \u003C/p\u003E\u003Cp\u003EThrow in the audible alarm and bobs your uncle!\u003C/p\u003E\n"},{"CreatedByName":"Fel","CreatedById":57121,"CreatedDateTime":"2015-04-30T23:50:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022nholzric\u0022 data-cite=\u0022nholzric\u0022\u003E\u003Cdiv\u003EThis may be too ambitious, but if there\u0027s a little window next to contracts, resources, etc, that when you opened it had a little silhouette of your ship from the three cardinal directions with either a heat-map or maybe just a blinking warning symbol that points to whatever part is overheating...\u003Cp\u003EI was inspired by the new feature of saving min-pictures in the VAB and HAB. But this could be a completely different mechanic, don\u0027t know how hard this would be.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat, like mechwarrior and the 3d damage visuals?\u003C/p\u003E\n"},{"CreatedByName":"Hobbes Novakoff","CreatedById":129018,"CreatedDateTime":"2015-05-01T00:04:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Brotoro\u0022 data-cite=\u0022Brotoro\u0022\u003E\u003Cdiv\u003EI would like \u003Cp\u003E1) an audible overheating alarm.\u003C/p\u003E\u003Cp\u003E2) a key (and assignable keyboard key) that I could press to toggle the heat display on/off for a quick look at WHAT\u0027s overheating.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThing is, if I remember correctly, there\u0027s something like two keys on the normal keyboard that don\u0027t do something already.\u003C/p\u003E\n"},{"CreatedByName":"Commissioner Tadpole","CreatedById":91993,"CreatedDateTime":"2015-05-01T00:31:19Z","Content":"\n\u003Cp\u003EA can of worms is good; it\u0027s a good bait for fishing! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\u003Cp\u003ELame jokes(and funny aneurisms) aside, I agree on how there needs to be a thermal warning. For now I\u0027m going to be playing without heating.\u003C/p\u003E\n"},{"CreatedByName":"DundraL","CreatedById":118705,"CreatedDateTime":"2015-05-01T00:34:52Z","Content":"\n\u003Cp\u003E[h=2]\u003Cspan style=\u0022font-size:10px;\u0022\u003ERepost from my other thread on this: \u003C/span\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/118102-Ideas-to-warn-of-overheating-parts\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/118102-Ideas-to-warn-of-overheating-parts\u003C/span\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIdeas to warn of overheating parts.[/h] \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E So in many other threads, I\u0027m seeing alot of people asking for a way to know of a part getting too hot in ways other than seeing it explode.\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003EPeople want to know of problems before things start exploding so...\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003EOnce a part get to a threshold of heat, say 80% of the temp it explodes at, have it emit DARK BLACK smoke effects. IMO, it would be much more fun to see parts smoking before they went up instead of looking at whatever dials, right click menu ETC for a status on temp.....\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003EBut this smoke should be different from regular exhaust in the following ways:\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E-The particles comprising it need to grow from very small to large RAPIDLY. \u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003EThis is to allow a player to see with more detail what is overheating, while being very noticeable. Is it the battery on the side or the hull its attached to thats burning? This whole effect is essentially an arrow pointing to the part that\u0027s cooking after all.\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E-They need to be a very dark BLACK, to be noticeable even amid the shock heading, mach effects and engine exhaust. If it looks like anything else, it wont be noticed, and wont be useful.\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E-It need to be dense smoke to be noticeable, as ships suffering from overheating tend to be moving extremely fast. Having a puff of smoke every 100m isnt gonna warn of anything. This means rapidly spawning particle effects. To prevent loss of frame rate, they also need to be short lived.\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E-They need glowing orange sparks in the black clouds. This it to make the effect useful and visible in the black background of space. Of course there wond be any real glow effect, just orange sparks on the sprite used for the particle effects.\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E-Optional: Add more and more sparks and even flames as the part gets closer to overheating.\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003EAnd... that\u0027s it for now. Any one got other/ better ideas? It\u0027s the best i got on short notice, that doesn\u0027t break immersion, and still lets you see what part is having trouble.\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003EOther solutions I\u0027ve seen:\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003Eright-right clicking every part looking for trouble spots would be tedious and doesnt help you if you dont ride around with right click menu open.... right click info would be useful, but not as a warning of impending doom.\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003EHearing an alarm going off would let you know something is overheating... but just that... *something* is overheating. You still have no ideas whats overheating and you have no clue whats if the impending explosion is tolerable and to keep going, or would be catastrophic, and you need to be trying to get your kerbals out alive.\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003EAnd of course seeing an explosion isn\u0027t even all that informative until you hit F3. Unless your craft is already falling apart and then yo are just cussing anyway.\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003EPlacing bacon outside of craft. While delicious, it is hard to retrieve bacon in situations that allow for cooking.\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003ELemme know if you guys have better ideas for warning of impending thermal doom.\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003EUnrelated, but still important to me, since it got worse in 1.0 :\u003C/div\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/92819-An-arguement-for-a-simple-intake-jet-engine-tweak\u0022 rel=\u0022external nofollow\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cdiv\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/92819-An-arguement-for-a-simple-intake-jet-engine-tweak\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/...t-engine-tweak\u003C/a\u003E\u003C/div\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/92819-An-arguement-for-a-simple-intake-jet-engine-tweak\u0022 rel=\u0022external nofollow\u0022\u003E\u003C/a\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003EBump it if you agree! \u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2015-05-01T00:52:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Hobbes Novakoff\u0022 data-cite=\u0022Hobbes Novakoff\u0022\u003E\u003Cdiv\u003EThing is, if I remember correctly, there\u0027s something like two keys on the normal keyboard that don\u0027t do something already.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhew! Good thing we have two left. I want \u0022o\u0022 to be assigned by Squad to reopen a collapsed maneuver node in Map view (like Precise Node does), but I wouldn\u0027t mind if it also pulled up the \u0022Overheat\u0022 display when NOT in Map view.\u003C/p\u003E\n"},{"CreatedByName":"hawk_za","CreatedById":59433,"CreatedDateTime":"2015-05-01T05:26:28Z","Content":"\n\u003Cp\u003Ehow about just using the already implemented overheat system in the bottom left but instead of just engines it can now occurs for all part\u0027s\u003C/p\u003E\n"},{"CreatedByName":"supremeownage","CreatedById":142372,"CreatedDateTime":"2015-05-01T21:15:19Z","Content":"\n\u003Cp\u003EI\u0027d be happy with some sort of dedicated radiator items to actually lower heat levels...........\u003C/p\u003E\n"}]}