{"TopicId":106264,"ForumId":32,"TopicTitle":"Casual Player having problems with usefulness of planes","CreatedByName":"Masakakihara","CreatedById":100363,"CreatedDateTime":"2015-04-30T11:09:18Z","PageNum":1,"Articles":[{"CreatedByName":"Masakakihara","CreatedById":100363,"CreatedDateTime":"2015-04-30T11:09:18Z","Content":"\n\u003Cp\u003EHi Guys,\u003C/p\u003E\u003Cp\u003Eas i was enjoying my 1.0 career ive stumbled upon the mission to do some temperature scans, above i think 18km halfway across the globe.\u003C/p\u003E\u003Cp\u003ESo after unlocking my first jet engine and landing wheels i thought i was ready to go. Was just starting to have a lot of fun with planes in 0.90.\u003C/p\u003E\u003Cp\u003EBut after noticing my flight would take me about 45m real time to complete, i just gave up after 15m. \u003C/p\u003E\u003Cp\u003EIs it still possible to use planes for missions like these halfway around the globe?\u003C/p\u003E\u003Cp\u003EI\u0027ll still build planes for fun, but functionality seems pretty much gone atm. The flying itself is no problem, love the new aerodynamics.\u003C/p\u003E\u003Cp\u003EThanks for reading.\u003C/p\u003E\n"},{"CreatedByName":"T-Bouw","CreatedById":21500,"CreatedDateTime":"2015-04-30T11:13:14Z","Content":"\n\u003Cp\u003EAre you using physics warp?\u003C/p\u003E\u003Cp\u003EThat sped things up for me in 0.90.\u003C/p\u003E\u003Cp\u003EI haven\u0027t got that far yet in 1.0 though, so I don\u0027t know if that\u0027s still reliable.\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2015-04-30T11:13:54Z","Content":"\n\u003Cp\u003EYes, aircraft are most useful for part test contracts and short hops to nearby locations (at least early on). To get around the planet you need a suborbital space plane.\u003C/p\u003E\n"},{"CreatedByName":"Parkaboy","CreatedById":64208,"CreatedDateTime":"2015-04-30T11:14:03Z","Content":"\n\u003Cp\u003EBasic planes are mostly useful to do contracts close to the space center. It\u0027s easier to build a shuttle-type vehicle that can go orbital or suborbital to tackle those contracts further away, especially since the basic jet engine can\u0027t take you much higher than 13 km.\u003C/p\u003E\u003Cp\u003EOf course, planes don\u0027t have to be just planes. They can be spaceplanes or, as mentioned, spaceshuttles.\u003C/p\u003E\n"},{"CreatedByName":"Dizzle","CreatedById":31588,"CreatedDateTime":"2015-04-30T11:14:16Z","Content":"\n\u003Cp\u003EYeah, I don\u0027t bother with those missions. You can\u0027t take the basic jet engine up that high anyway.\u003C/p\u003E\n"},{"CreatedByName":"Masakakihara","CreatedById":100363,"CreatedDateTime":"2015-04-30T11:21:20Z","Content":"\n\u003Cp\u003EI\u0027ll have to see what i can come up with in my career.\u003C/p\u003E\u003Cp\u003EI do use timewarp but even then, the speed is so slow it drives me nuts. (about 400m/s max)\u003C/p\u003E\u003Cp\u003EIf i use a shuttle with a suborbital or orbital trajectory i\u0027ll have to go through that scan node when reentering else i\u0027ll never get that high again.\u003C/p\u003E\u003Cp\u003ESeems like a very difficult task so early on. \u003C/p\u003E\u003Cp\u003EI mean ive been to the mun/minmus, even set up a space station but cant manage to fly high and fast enough for a contract on my home planet.\u003C/p\u003E\n"},{"CreatedByName":"Cdr_Zeta","CreatedById":59015,"CreatedDateTime":"2015-04-30T11:26:37Z","Content":"\n\u003Cp\u003EHello,\u003C/p\u003E\u003Cp\u003EI noticed my contracts in 90 I think were far away; I planned on setting up a new base near those seemingly collective locations; sometimes you may run out of funds and this might be all that is left...play the game as it is what it is and if you run out of funds...\u003C/p\u003E\u003Cp\u003EZeta\u003C/p\u003E\n"},{"CreatedByName":"Masakakihara","CreatedById":100363,"CreatedDateTime":"2015-04-30T12:14:37Z","Content":"\n\u003Cp\u003EGuess this should be in gameplay Questions, sorry\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-04-30T12:54:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Masakakihara\u0022 data-cite=\u0022Masakakihara\u0022\u003E\u003Cdiv\u003EI\u0027ll have to see what i can come up with in my career.\u003Cp\u003EI do use timewarp but even then, the speed is so slow it drives me nuts. (about 400m/s max)\u003C/p\u003E\u003Cp\u003EIf i use a shuttle with a suborbital or orbital trajectory i\u0027ll have to go through that scan node when reentering else i\u0027ll never get that high again.\u003C/p\u003E\u003Cp\u003ESeems like a very difficult task so early on. \u003C/p\u003E\u003Cp\u003EI mean ive been to the mun/minmus, even set up a space station but cant manage to fly high and fast enough for a contract on my home planet.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf it says above 18km, then a single satelitte in a polar orbit can cover them.\u003C/p\u003E\u003Cp\u003EIf you can get to the Mun, and back, that means you can get to orbit, and still have 1,000 m/s left... that is enough to go suborbital to your destination, and if you miss it on the way down, you can land and still have \u0026gt;1,000 m/s to get up again... and that is plenty to get 18km high.\u003C/p\u003E\u003Cp\u003Eor you can go suborbital, if you miss it on the way down, fly on jet power to the location, do a zoom climb and fire the rockets again.... and you\u0027re done.\u003C/p\u003E\n"}]}