{"TopicId":106261,"ForumId":20,"TopicTitle":"Guide to JSGME - generic mod installer.","CreatedByName":"Watoh","CreatedById":141707,"CreatedDateTime":"2015-04-30T10:48:12Z","PageNum":1,"Articles":[{"CreatedByName":"Watoh","CreatedById":141707,"CreatedDateTime":"2015-04-30T10:48:12Z","Content":"\n\u003Cp\u003EHi Everyone,\u003C/p\u003E\u003Cp\u003EI\u0027m amazed seemingly so many people mod their game manually by jamming files into gamedata folder. This has many issues, especially when testing mods, removing problematic mods or ones you don\u0027t like can be a massive pain, especially if the conflict with other modified files. \u003Cstrong\u003EJSGME (JoneSoft Generic Mod Enabler)\u003C/strong\u003E can make using mods a 1000 times easier IMO.\u003C/p\u003E\u003Cp\u003EHere is a guide to installing and using JSGME I have adapted from another game forum. [thanks Ebs from forums.eagle.ru]\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EStart with a fresh install (no mods).\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EThe days of going through the file system to replace and backup are over! \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E1) Get yourself JSGME.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003Efrom here - \u003Ca href=\u0022http://www.gamefront.com/files/21681483\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.gamefront.com/files/21681483\u003C/a\u003E or here \u003Ca href=\u0022https://www41.zippyshare.com/view.jsp?locale=hu\u0026amp;key=2423962\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www41.zippyshare.com/view.jsp?locale=hu\u0026amp;key=2423962\u003C/a\u003E It\u0027s a 7zip file so you\u0027ll need WinRAR or (shockingly) 7zip to unzip it.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E2) Unzip the files to their new home.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EA lot of people say that you need to unzip JSGME in the game directory you\u0027re using it for. this is not true, it can be placed anywhere. JSGME does not need to be \u0027installed\u0027, just run.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E3) Set up your short-cut.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EThis is very important as we need to tell JSGME where to operate. Make a short-cut to the jsgme.exe. Right click the short-cut and choose properties..\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003E\u003Cstrong\u003EMake the \u0027Target\u0027 the JSGME exe. Mine looks like this: \u0022D:\\Games Library\\JSGME\\JSGME\\JSGME.exe\u0022\u003C/strong\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cstrong\u003EMake the \u0027Start In\u0027 point to the KSP root: e.g \u0022C:\\Games\\Steam\\SteamApps\\common\\Kerbal Space Program\u0022\u003C/strong\u003E\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EPlace the short-cut wherever is convenient for you.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E4) Run JSGME (\u003C/span\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003ENB: \u003C/span\u003E\u003C/span\u003Efrom the short-cut you made above)\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EIt will bring up a dialogue box asking for a folder to be created in KSP called \u0027MODS\u0027. Agree to this.. or change the name if you want.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EThen JSGME will open and look like this.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/UNxo5.png\u0022 alt=\u0022UNxo5.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E6) Generate Snapshot of Game Files (optional step)\u003C/span\u003E\u003C/p\u003E\u003Cp\u003ESee that blue word saying \u0027tasks\u0027 right in the centre...you\u0027re going to want to click that. In the little menu that pops up, click \u0022Generate Snapshot of Game Files\u0022 and then sit back and wait.\u003C/p\u003E\u003Cp\u003EThe purpose of the snapshot task is so that JSGME knows what your default KSP file/folder structure looks so when you install/deinstall mods JSGME can restore your original file/folder structure. JSGME can actually restore your original file/folder structure without this step.. but it does make it more robust if somehting goes wrong. (in 5\u002B years i\u0027ve not needed this.. it doesn\u0027t take long, so no harm in doing it.)\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E7) Installing and removing mods.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EAdding \u0026amp; removing mods is as easy as simply clicking the arrow to add or remove the mod. The trick is having the mod in the correct format.\u003C/p\u003E\u003Cp\u003EBelow is an example using MechJeb2:\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#b22222;\u0022\u003EMODS\\\u003C/span\u003E\u003Cspan style=\u0022color:#000080;\u0022\u003EMechJeb2-2.5.0.0\u003C/span\u003E\\GameData\\MechJeb2\\{content of mod}\u003C/p\u003E\u003Cp\u003EThe red folder is the folder created by JSGME, \u003Cstrong\u003Ewhere you place your mods.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThe blue folder is the folder you may have to create (depending on how the mod is packaged). This can be called whatever you want.. its what will show up as the mod name in JSGME.\u003C/p\u003E\u003Cp\u003EHere is a screenshot of my file structure to make this a bit clearer.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/9592060/ksp-files.jpg\u0022 alt=\u0022ksp-files.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis may all sound like a bit of a PITA but trust me, its easy to set-up..just make the short-cut and once you get used to sorting your mods out to give them the correct file structure it is super easy to use. Some mod makers make it easier than others! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EJSGME has a few other tricks up its sleeve under \u0027tasks\u0027. Mainly being able to save the order multiple mods were installed (as i\u0027m sure you know the order of mods installing can be very important) and reinstall them all with one click in the right order. \u003C/p\u003E\u003Cp\u003EHope this helps some, if you like modding games this is vital software. (works on any game/software)\u003C/p\u003E\u003Cp\u003EWatoh\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ETL;DR?\u003C/strong\u003E Take a deep breath and try again. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}