{"TopicId":106466,"ForumId":69,"TopicTitle":"Laggy VAB - Space Center Crew Option","CreatedByName":"Immashift","CreatedById":57223,"CreatedDateTime":"2015-05-01T02:41:31Z","PageNum":1,"Articles":[{"CreatedByName":"Immashift","CreatedById":57223,"CreatedDateTime":"2015-05-01T02:41:31Z","Content":"\n\u003Cp\u003EHey!\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EEdit down below.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ESo I\u0027ve run KSP for years on this particular system and had zero issues with my FPS unless I exceed maybe 300 parts or so, but with the release of 1.0, my framerates \u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003Einside the VAB and SPH only\u003C/strong\u003E\u003C/span\u003E have tanked. In literally every other screen, be it the map, launchpad, in spaaaaaaace, or whatever, I get a consistent ~150 fps. I go to the VAB, and it tanks down to 10-15 FPS. I have no idea what\u0027s causing it, but it makes dragging parts around a gigantic pain in the backside.\u003C/p\u003E\u003Cp\u003EThis occurs whether I run the game in a window, fullscreen, or borderless windowed as I prefer.\u003C/p\u003E\u003Cp\u003EI generally launch the game via a shortcut with the -popupwindow flag to get borderless windowed, but as I said, this happens regardless of that flag or not.\u003C/p\u003E\u003Cp\u003EIt\u0027s not a performance issue, since this rig is well beefy enough to handle anything KSP can throw at it.\u003C/p\u003E\u003Cp\u003EI\u0027ll detail my setup here. Perhaps something will catch someone\u0027s eye and I can solve this.\u003C/p\u003E\u003Cp\u003EMy comp:\u003C/p\u003E\u003Cp\u003ECPU: AMD FX 8320 8-core\u003C/p\u003E\u003Cp\u003ERAM: 8 GB\u003C/p\u003E\u003Cp\u003EGPU: Nvidia Geforce GTX960 SSC\u003C/p\u003E\u003Cp\u003EGPU Driver: 350.12\u003C/p\u003E\u003Cp\u003EOS: 64-bit Win7 Ultimate\u003C/p\u003E\u003Cp\u003EThink that\u0027s about all that matters. GPU is outputting to 2 monitors and is in multiple display performance mode. In the VAB, the GPU runs cool, is barely under any load, and has plenty of VRAM to spare. CPU isn\u0027t under load, and have tons of RAM free. So again, I really don\u0027t think it\u0027s a performance thing.\u003C/p\u003E\u003Cp\u003EGame-wise I have settings as such:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/qMfwa5e.png\u0022 alt=\u0022qMfwa5e.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ve also tried with zero AA, no difference, so believe me, the 8x AA makes no difference on this issue. And before you ask, in my drivers, it\u0027s set to let the game decide what graphics settings to use. I\u0027ve also tried at half res textures and no difference.\u003C/p\u003E\u003Cp\u003EAs stated, with these options I get ~150 FPS everywhere except the VAB and SPH, where it crawls along at 10-15.\u003C/p\u003E\u003Cp\u003EI tested KSP .90 as well, and the VAB/SPH were completely lag-free on it. So something with the 1.0 update is tanking it.\u003C/p\u003E\u003Cp\u003EIf I can provide any more info that could help, I\u0027ll be happy to.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EEDIT: After some poking around, I turned off \u0022Space Center Crew\u0022 in main settings before resuming a game, and that has taken the lag away. I\u0027m back up to my usual 150FPS.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EI would like to see the little dudes walking around though, so if anyone knows why that option causes lag with my system, please do tell.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-01T03:15:57Z\u0022 title=\u002205/01/2015 03:15  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 1, 2015\u003C/time\u003E by Immashift\u003C/strong\u003E\n\u003C/span\u003E\n"}]}