{"TopicId":106570,"ForumId":55,"TopicTitle":"Quality of Life improvements list","CreatedByName":"TothAval","CreatedById":142030,"CreatedDateTime":"2015-05-01T14:12:03Z","PageNum":2,"Articles":[{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-05-05T14:53:06Z","Content":"\n\u003Cp\u003EGreat thread idea.\u003C/p\u003E\u003Cp\u003EI\u0027d like default action group for toggling solar panels with its own dedicated key, like we have for landing gear and lights now. I end up wasting an action group on solar panels on almost every craft, as I\u0027m sure many other do.\u003C/p\u003E\u003Cp\u003EEdit: And one for ladders, too.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-06T10:39:54Z\u0022 title=\u002205/06/2015 10:39  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 6, 2015\u003C/time\u003E by Red Iron Crown\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"stevehead","CreatedById":137745,"CreatedDateTime":"2015-05-06T09:07:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CaptRobau\u0022 data-cite=\u0022CaptRobau\u0022\u003E\u003Cdiv\u003EA docking alignment indicator on the nav ball a la this mod: \u003Ca href=\u0022https://kerbalstuff.com/mod/23\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://kerbalstuff.com/mod/23\u003C/a\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI can\u0027t believe this still has not been added to stock yet, but they found the time to change the mouse icon... I\u0027m not asking for something along the lines of Navyfish\u0027s mod, but something like the above mod makes a world of a difference in docking and it\u0027s very Kerbal-ish. Is there a reason why Squad does not want us to be able to see our orientation while docking?\u003C/p\u003E\u003Cp\u003EI also think the UI for maneuver nodes needs to be redone. I\u0027m so tired of misclicking and ruining carefully planned nodes or even not being able to create a maneuver node at all because I have another orbit from the patched conics overlapping and I\u0027m constantly clicking that one instead of the one I want (I want the blue one, not the purple one that occurs a year later!). Precise node helps, but doesn\u0027t fix everything. Simple fix would be to allow us turn off some of the orbit visuals so we can focus on exactly what we want to work on.\u003C/p\u003E\u003Cp\u003EAlso, career mode and the tech tree are still pretty abysmal. I keep saying this: I want to be running a space program, not be a freelancer doing random contracts. Let us have more control in the direction of our space program such as mission planning.\u003C/p\u003E\n"},{"CreatedByName":"Joonatan1998","CreatedById":97636,"CreatedDateTime":"2015-05-06T09:33:46Z","Content":"\n\u003Cp\u003EHaving a counter for total completed/failed missions somewhere (probably in the mission control building) would be nice.\u003C/p\u003E\n"},{"CreatedByName":"TothAval","CreatedById":142030,"CreatedDateTime":"2015-05-06T15:00:20Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003Elist updated\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003Eintegrated ideas from other posts in \u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/forums/59-Suggestions-and-Development-Discussion\u0022 rel=\u0022external nofollow\u0022\u003ESuggestions and Development Discussion\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"arkie87","CreatedById":103434,"CreatedDateTime":"2015-05-06T15:23:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EGreat thread idea.\u003Cp\u003EI\u0027d like default action group for toggling solar panels with its own dedicated key, like we have for landing gear and lights now. I end up wasting an action group on solar panels on almost every craft, as I\u0027m sure many other do.\u003C/p\u003E\u003Cp\u003EEdit: And one for ladders, too.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, That needed to be implemented yesterday. No good reason it doesnt already exist...\u003C/p\u003E\n"},{"CreatedByName":"TothAval","CreatedById":142030,"CreatedDateTime":"2015-05-07T14:02:28Z","Content":"\n\u003Cp\u003E* more control over fuel transfer, f.e. set percentages, set tresholds, combine ressource transfers(LF\u002BO together)\u003C/p\u003E\u003Cp\u003E* key to rotate non surfaced, non athmospheric vessel/suit to dircetion of camera view\u003C/p\u003E\u003Cp\u003Elist updated\u003C/p\u003E\n"},{"CreatedByName":"arkie87","CreatedById":103434,"CreatedDateTime":"2015-05-07T23:14:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TothAval\u0022 data-cite=\u0022TothAval\u0022\u003E\u003Cdiv\u003E* more control over fuel transfer, f.e. set percentages, set tresholds, combine ressource transfers(LF\u002BO together)\u003Cp\u003E* key to rotate non surfaced, non athmospheric vessel/suit to dircetion of camera view\u003C/p\u003E\u003Cp\u003Elist updated\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA ship manifest to allow you to control every right clickable item without having to physically click on it. Useful if your ship is spinning out of control or part is partially occluded and hard to click on.\u003C/p\u003E\n"},{"CreatedByName":"panzer1b","CreatedById":95108,"CreatedDateTime":"2015-05-07T23:39:31Z","Content":"\n\u003Cp\u003EI support most this 100%.\u003C/p\u003E\u003Cp\u003Eid like to see alot of the in flight fixes done 1st, and then map stuff as those have been bugging me for a while.\u003C/p\u003E\n"},{"CreatedByName":"sumghai","CreatedById":66272,"CreatedDateTime":"2015-05-08T00:14:20Z","Content":"\n\u003Cp\u003EThanks for curating some of my ideas - I\u0027d like to humbly submit a few more items for consideration, in order of importance:\u003C/p\u003E\u003Cp\u003E - Store Kerbal profession as string value in separate parameter after hash-based generation, so that they can be changed later by savegame editing / add-ons (plus support for custom professions) \u003Cspan style=\u0022font-size:8px;\u0022\u003ESuggested by sumghai \u003C/span\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/108475-Kerbal-Profession-determined-by-its-own-parameter?p=1857085\u0026amp;viewfull=1#post1857085\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003Ehere\u003C/span\u003E\u003C/a\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E, \u003C/span\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003Ehypothetical implemention described\u003C/span\u003E\u003C/span\u003E \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/108475-Kerbal-Profession-determined-by-its-own-parameter?p=1883128\u0026amp;viewfull=1#post1883128\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E- Allow add-on authors to specify angle snap for docking ports \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/113201-Angle-snap-on-docking-ports?p=1795241\u0026amp;viewfull=1#post1795241\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EOriginally suggested by Yakky, hypothetical implemention described by sumghai\u003C/span\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E - Allow add-on authors to specify whether ModuleAnimateGeneric is enabled/disabled in the Flight Scene and EVA \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/112877-Allow-access-to-ModuleAnimateGeneric-to-be-enabled-disabled-in-the-Flight-Scene-and-EVA\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003ESuggested by sumghai\u003C/span\u003E\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"macdjord","CreatedById":5630,"CreatedDateTime":"2015-05-08T00:46:27Z","Content":"\n\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EMap Mode:\u003Cbr\u003E\u003Cul\u003E\u003Cli\u003EAmbient Lighting: I\u0027m actually opposed to an ambient lighting slider in flight mode. Space \u003Cem\u003Eshould\u003C/em\u003E be dark, if the sun is blocked; it makes a good and sensible gameplay restriction, too: if you want to do nighttime docking, you have to remember to bring docking lights, and if you choose to land on the night side of a plenet, you have to live with not being able to see the terrain on your way down. Map mode, on the other hand, is supposed to be, well, a \u003Cem\u003Emap\u003C/em\u003E. It should have enough ambient light that you can see the features of the night side of a planet. The KSC doesn\u0027t \u003Cem\u003Emove\u003C/em\u003E, so why should I have to wait for daylight there in order to target my reentry?\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EMap element controls: Interacting with map elements, though much improved from earlier versions, is still very awkward. The fundamental problem is the way SQUAD has overloaded a single control, namely left-click. With the exception of double-clicking on things to focus on them, \u003Cem\u003Eeverything\u003C/em\u003E in map view is done with unmodified single left-click. Adding a maneuver node? Left-click on your orbit. Opening a maneuver node? Left-click on it. Closing a maneuver node? Left-click \u003Cem\u003Eoff\u003C/em\u003E it. Selecting another craft, to target or control? Left-click \u003Cem\u003Eit\u0027s\u003C/em\u003E orbit. Locking a numeric display element (e.g. apoapsis hight)? Hover to bring it up, then left-click on it. Given how busy the map screen is, these elements often overlap, and since they all use the same single interaction, they conflict. SQUAD desperately needs to revamp these controls, and assign some of these functions to other interactions, e.g. right-click, shift-click, and alt-click.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E[*]Flight Controls:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ERCS Translation Controls Always On: The RCS translation controls should always work, even when the RCS toggle is off. The RCS toggle makes sense for attitude control, where there is a single set of rotation keys, and you need to be able to choose whether to use RCS or to only use reaction wheels. However, the translation keys are \u003Cem\u003Ededicated\u003C/em\u003E controls; they do nothing else. There\u0027s no reason to make them dependent on the RCS toggle to function.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EQuick Staging Option: The minimum delay between stagings is a good thing, since it prevent accidentally dumping two stages when you meant to fire only one. But there should be a way to fire multiple stages quickly if you need to (e.g. in a low-altitude abort, after using the abort action group to decouple your capsule and fire the LES, you need to quickly stage through all the lifter stages in order to fire your capsule parachutes). My suggestion would be Alt-Space, to \u0027force-stage\u0027 the same way Alt-Period is \u0027force-physical-timewarp\u0027.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E[*]Game Controls:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EQuicksave Delay: Accidentally hitting quicksave after things have gone wrong can be just as bad as accidentally hitting quickload when everything is fine. The quicksave key should have the same press-and-hold safety feature that quickload already does\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EUnQuickload: I\u0027m sure everyone has had the horrible experience of hitting quickload after a mistake, only to discover the quicksave is old and they\u0027ve lost a ton of work. My suggestion is that, whenever you hit quickload, the game first saves a snapshot of the situation you are in. Then, if you decide you\u0027d rather deal with your mistake than lose that much work, you can hit another key to reload that snapshot and go back to where you quickloaded from. This suggestion would replace @Bessy \u0027s suggestion of warning about how far you are going back before you go, and is superior because a) depending on the mission, one in-game day can be anywhere from 10 seconds to 10 hours of playtime, so it doesn\u0027t make a good limit, and \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E forcing the player to check the undo time and confirm they want to go back would defeat the purpose of \u003Cstrong\u003Equick\u003C/strong\u003Esave.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EForce High Orbital Timewarp: Like @madadam, I think we should be able to use higher timewarps when in low orbit, so long as the orbit is stable (important note: the \u0027stability\u0027 requirement has to include checking that your orbit does not cross the SOI of a moon as well as that it doesn\u0027t intersect the atmosphere). I would like to expand that suggestion by proposing that the current limits remain in effect, but that you be able to \u003Cem\u003Eoverride\u003C/em\u003E them by pressing Alt-Period, the same way you can force physical timewarp.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EPreserve the Revert Option: I recently lost Valentina to a physics glitch. After safely landing my first suborbital flight to space, she jumped from the command pod to get a surface EVA report for the biome she landed in. However, on hitting the ground, she ragdolled, skidded for a bit, then spontaneously exploded. Okay, that happens; that\u0027s why I\u0027m not playing ironman. So I hit \u0027revert to launch\u0027. However, while loading the launchpad, KSP froze, and I had to kill it. And when I restarted it, I found that the revert hadn\u0027t gone through: Val was still dead, and my revert option was gone. That shouldn\u0027t happen! There\u0027s no good reason to lose the revert option when you switch vessels, or return to the KSC, or quickload, or exit the game. Once a launch revert point is created, there\u0027s no reason it should be lost \u003Cem\u003Euntil you launch another vessel\u003C/em\u003E. (Exception: If you quickload to a point before the launch, then of course you lose the option to \u0027revert\u0027 to something that hasn\u0027t happened yet. But even then, the revert point shouldn\u0027t be thrown away immediately, in case the player uses the \u0027UnQuickload\u0027 option I suggested above.)\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E[*]VAB:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EAdd/remove Actions in Staging: You should be able to add actions that are normally triggered by action groups to the staging diagram, or remove actions that are staged by default entirely:\u003Cbr\u003E\u003Cul\u003E\u003Cli\u003EDecouplers, solid rockets, or parachutes that are part of your abort system and don\u0027t get fired at all in normal flight can be removed from the staging diagram so they don\u0027t get triggered accidentally\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EIf your ship carries probes attached to decouplers and you intend to trigger them manually, you can remove them to avoid clutter\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EUsing a docking node as a decoupler? Add the \u0027decouple\u0027 action to your staging instead of having to trigger it with an action group\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EDeploy solar panels or antennae at the appropriate point in your launch sequence by adding them to a stage\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ENot sure exactly which stage you\u0027ll be on when you want to ditch those fairings? Remove them from the stack entirely and trigger them with an action group instead.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAdd science experiments to the staging stack to trigger them at the appropriate points in ascent or descent without having to remember to fire an action group\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E[*]Duplicate-Place Parts: Hold alt while placing a part to add it to the craft while keeping a copy in your hand (same way you can currently alt-click to pick up a copy of a part while leaving the original where it is). This would make things like tiling a surface with solar panels much faster; instead of \u0027pick up solar panel, place, alt-click panel you just placed, place next...\u0027, you just go \u0027pick up solar panel, alt-click to place, alt-click to place, alt-click to place...\u0027.\u003C/p\u003E\u003Cp\u003E[*]Aligned Struts \u0026amp; Fuel Pipes: @MachXXV\u0027s Editor Extensions plugin add the ability to snap struts and fuel pipes so they are exactly straight and perpendicular to their origin. This means you can use them between a radially attached part and the central body without causing the radial part to twist and create spin. This needs to be stock.\u003C/p\u003E\u003Cp\u003E[*]Radial\u002BLateral Symmetry: When surface-attaching to a part that is itself part of a radial symmetry group, add an option to mirror whatever you\u0027re attaching across the parent part as well as duplicating it on the other copies of the parent. So, for example, assume you have a rocket with a large core and a pair of radial boosters (o-O-o), and you want to add some winglets, set at 45 degrees and attacked to the boosters. You add the first winglet to one of the boosters, and it gets duplicated to the other (\\o-O-o\\). Then you add the second. But because you did that manually, they aren\u0027t necessarily at quite the same height, or exactly the same angle, which means your rocket tends to spin. However, with this option, the first winglet would be mirrored across the booster as well as to the other boost (\u0026gt;o-O-o\u0026lt;), maintaining perfect symmetry.\u003C/p\u003E\u003Cp\u003E[*]Force-Add Locked Parts: Ever find yourself working on a design, deciding to use a part, paying the unlock fee, then finding it doesn\u0027t fit like you\u0027d hoped and you end up not using it at all? What I\u0027d like is the option to add parts to my design that I haven\u0027t actually unlocked yet. I wouldn\u0027t be able to \u003Cem\u003Euse\u003C/em\u003E the design, same as you can\u0027t use a design containing an experimental part after completing the contract that gave you access to the part. But I\u0027d be able to play around with the design, check sizes and weights and delta-v, then only pay for the parts I \u003Cem\u003Eactually\u003C/em\u003E need.\u003C/p\u003E\u003Cp\u003E[*]Abort Action Always: Tying the availability of action groups to the VAB upgrades is a neat gameplay mechanic, but it presents a problem for those playing in hard-core mode during the early- to mid-game: it is impossible to design an effective launch escape system without at least one action group. This is especially important given the new drag modelling; it\u0027s far too easy to create a design that flips out mid-launch for no apparent reason. I therefore propose that the abort action (and \u003Cem\u003Eonly\u003C/em\u003E the abort action) be available from the start, but only for manned launches.\u003C/p\u003E\u003Cp\u003E[*]Tweakable Consistency: Anything that can be set or tweaked in flight should be possible to do in the VAB. This includes: deploying solar panels, activating or deactivating fuel crossfeed, opening shielded or inline docking ports, activating or deactivating reaction wheels.\u003C/p\u003E\u003Cp\u003E[*]Tweakable Chute Deployment Speed: Chute deployment time should be adjustable. A chute used for a LES \u003Cem\u003Emust\u003C/em\u003E open quickly, because you might only be 100m up in the first place.\u003C/p\u003E\u003Cp\u003E[*]Tweak Precision: The sliders are a good way of tweaking values to start with, but sometime you need precision; there needs to be an option to type in an exact value. This would also allow you to set the slider limits to cover the \u003Cem\u003Etypical\u003C/em\u003E range, while not preventing people from using exceptional values when they need to. (There also needs to be a similar system for resource transfer.)\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E[*]Parts:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EEliminate the false distinction between LF and LFO tanks. Now that NERVA engines only burn LF, we need efficient ways of transporting it, but most of the LF-only tanks are only really suited for aircraft, and the LFO tanks are horribly inefficient when you\u0027re wasting half their capacity. Either add LF versions of all the 1.25 and 2.5 m tanks which hold twice as much LF but no O, or, better, make it so the existing LFO tanks can be tweaked between these two modes in the VAB.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThere are a number of \u003Cem\u003Egaping holes\u003C/em\u003E in the stock parts list - things that logically \u003Cem\u003Eshould\u003C/em\u003E exist, but don\u0027t, like an LES tower sized for the one-kerb capsule, or 0.625m and radial-mount drogue chutes. I consider these QoL issues, rather than suggestions, because they are \u003Cem\u003Enot\u003C/em\u003E new ideas, but rather things that a player would \u003Cem\u003Eexpect\u003C/em\u003E to find and has to work around the absence of. This is a tentative list:\u003Cbr\u003E\u003Cul\u003E\u003Cli\u003E0.625m fuel tanks in the standard sequence (i.e. 4 tanks, each twice as long and with twice the capacity of the previous one, with the largest having the same capacity as the smallest 1.25m tank)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAn LES scaled for the one-kerb capsule\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EA 0.65m version of the BZ-52 Radial Attachment Point\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E0.625m and radial-mount drogue chutes\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E3.75m stack separator\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ELow-profile 3.75m-2.5m adapter (like the FL-A5 1.25m-0.625m adapter)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EShielded Clamp-o-tron Sr. and Jr. docking ports\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"Sky_walker","CreatedById":113214,"CreatedDateTime":"2015-05-08T15:38:57Z","Content":"\n\u003Cp\u003EAbsolute, most important part of all:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EAn option to check delta-v and thrust to weight ratio for each stage (on hovering the stage in VAB or something similar - for how it\u0027d work in terms of numbers - look how it\u0027s done in Kerbal Engineer Redux)\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Eno idea how you could make a long list like that and still miss it. I mean seriously: It helps more than anything else in learning how to design rockets.\u003C/p\u003E\n"},{"CreatedByName":"TothAval","CreatedById":142030,"CreatedDateTime":"2015-05-08T16:38:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sky_walker\u0022 data-cite=\u0022Sky_walker\u0022\u003E\u003Cdiv\u003EAbsolute, most important part of all:\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EAn option to check delta-v and thrust to weight ratio for each stage (on hovering the stage in VAB or something similar - for how it\u0027d work in terms of numbers - look how it\u0027s done in Kerbal Engineer Redux)\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Eno idea how you could make a long list like that and still miss it. I mean seriously: It helps more than anything else in learning how to design rockets.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ei let it out because i heard that this is coming in some sort in 1.1 or so anyway. i will add it though, as it is probably one of the more, if not the most important qol feature \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003Eunfortunatly i don\u0027t have time today to update the list, i will do this tomorrow, you have thrown quite some work at me here, thx for the input \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"EricT43","CreatedById":142226,"CreatedDateTime":"2015-05-08T16:43:27Z","Content":"\n\u003Cp\u003EGood suggestions! I suggested in \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/120210-Shut-down-button-for-MPL%21\u0022 rel=\u0022external nofollow\u0022\u003Eanother thread \u003C/a\u003Ethat we have a \u0022stop\u0022 button on the MPL so that it doesn\u0027t highjack all the power of the vehicle. Or perhaps the ability to set electricity priority for the different items on the ship!\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2015-05-08T18:01:39Z","Content":"\n\u003Cp\u003EWhen building fairings, the \u0022[LMB] Place Cross-Section\u0022 text should not simply change color between orange and green to indicate whether or not a part is blocking the placement (because this color change can\u0027t be seen by some colorblind people). The text itself should change (possibly saying [bLOCKED] when the text is orange) or a checkmark should appear when the placement is not blocked.\u003C/p\u003E\n"},{"CreatedByName":"sherkaner","CreatedById":130303,"CreatedDateTime":"2015-05-08T18:06:24Z","Content":"\n\u003Cp\u003EGreat suggestions, all.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-05-08T18:08:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Brotoro\u0022 data-cite=\u0022Brotoro\u0022\u003E\u003Cdiv\u003EWhen building fairings, the \u0022[LMB] Place Cross-Section\u0022 text should not simply change color between orange and green to indicate whether or not a part is blocking the placement (because this color change can\u0027t be seen by some colorblind people). The text itself should change (possibly saying [bLOCKED] when the text is orange) or a checkmark should appear when the placement is not blocked.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s a great suggestion. I have very mild colorblindness and find it difficult to discern against some backgrounds, I can only imagine how it is for those with more severe colorblindness.\u003C/p\u003E\u003Cp\u003E(See also: Navball)\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2015-05-08T19:16:49Z","Content":"\n\u003Cp\u003E1) When the box for opening a ship into the VAB or SPH is up, I would like to be able to start typing the name of the ship and have the list jump to that point (just like happens with standard file-opening dialog boxes).\u003C/p\u003E\u003Cp\u003E2) When you right-click on an orbit, the buttons that pop up to allow you to \u0022Place Maneuver Node Here\u0022 and \u0022Warp to Here\u0022 should NOT jiggle around on the screen just because the AP/PE points are jiggling around on a near-circular orbit (it\u0027s too easy to click the wrong choice when the buttons are wobbling madly around). They should be stationary once you do the right-click.\u003C/p\u003E\u003Cp\u003E3) PLEASE implement the feature of Precise Node mod where a collapsed maneuver node can be reopened by pressing the \u0022o\u0022 key.\u003C/p\u003E\n"},{"CreatedByName":"wasml","CreatedById":120438,"CreatedDateTime":"2015-05-09T03:36:15Z","Content":"\n\u003Cp\u003E1) The ability to drag and drop sub assemblies into different categories.\u003C/p\u003E\u003Cp\u003E2) Though this would probably be better left as a mod I would like something that would put a number in the editor window indicating the number of parts used in existing craft when activated - would make it easier to weed out unused parts so I can add even more mods.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E3) More error checking while loading parts so a mis-configured part doesn\u0027t freeze the game while loading.\u003C/p\u003E\n"},{"CreatedByName":"TothAval","CreatedById":142030,"CreatedDateTime":"2015-05-09T09:33:11Z","Content":"\n\u003Cp\u003Euff, done \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E* option to set throttle default value for launches\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003Elist updated\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003Eintegrated ideas from other posts in \u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/forums/59-Suggestions-and-Development-Discussion\u0022 rel=\u0022external nofollow\u0022\u003ESuggestions and Development Discussion\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"TothAval","CreatedById":142030,"CreatedDateTime":"2015-05-10T12:52:39Z","Content":"\n\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003Eresizeable, customizeable navball\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Ebetter placement of launchbutton in the launchpad gui\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Elist updated\u003C/p\u003E\n"},{"CreatedByName":"Black-Talon","CreatedById":57463,"CreatedDateTime":"2015-05-11T01:23:32Z","Content":"\n\u003Cp\u003ESadly, the list is already too long, is there any easy way to prioritize a list like this?\u003C/p\u003E\u003Cp\u003ESecondly, there should be a list of things that brand new players want/need that has quite a bit of priority over the things us veterans desire for advanced features/customization/etc. Keeping in mind that the better job the game does at ramping up newbies to the game the higher degree of complexity and sophistication the game can have at the more advanced levels. Newbies and veterans alike benefit from games that find a way to teach complex subjects and game dynamics to new players quickly!\u003C/p\u003E\u003Cp\u003ESome ideas then:\u003C/p\u003E\u003Cp\u003E1) New players could use a better introduction to the NavBall.\u003C/p\u003E\u003Cp\u003E2) It would be nice if the game explained more about what was wrong - examples:\u003C/p\u003E\u003Cp\u003E- your parachute burned up or ripped off due to when it was deployed\u003C/p\u003E\u003Cp\u003E- your probe has run out of electric charge, that\u0027s why you don\u0027t have control of anything\u003C/p\u003E\u003Cp\u003E- your rocket has flipped due to their being more drag pulling on the nose than there is pulling on the tail - this is the traditional way of getting the \u0022cart in front of the horse\u0022 - the horse slows down more than the cart! Build rockets that force the cart to always be slower than the horse!\u003C/p\u003E\u003Cp\u003E3) I\u0027ve watched a lot of smart people fail at KSP and get very frustrated because it\u0027s not working \u0022the way they know it should!\u0022 Comitic failure is great entertainment - failure that a new player doesn\u0027t even begin to understand (or worse, they believe they understand it better than the game and the game didn\u0027t implement it correctly) immediately feels like crappy software to a new player.\u003C/p\u003E\u003Cp\u003ECareer mode (normal difficulty) could/should start off with tutorial content and contracts which demonstrate each component of the game at a time: Rocket Building; Rocket Launch and Piloting (what is the NavBall? how to use it?); Science Gathering and Recovery; Rocket Engineering and Design (from staging and thrust to weight ratio to Rocket Engine Fuels and DeltaV; Electrical systems; Stable Aerodynamic Flight; Control Surfaces; Reaction Wheels; Kerbal Skills; Getting to orbit; Orbital Maneuvers; Gravitational Capture; Engineering Planes \u0026amp; Rovers; Craft Recovery; Landing on Another Body with unknown characteristics such as gravity and atmospheric conditions; Interplanetary transfers; Simultaneous missions; ... where does the learning stop and the game begin?? I\u0027ve found my learning experience over the last few years to be a fantastic game that I hope never stops - I hope they are both there throughout Kerbal Space Program\u0027s lifetime ... there is after all \u0022Moderate\u0022 and \u0022Hard\u0022 difficulty levels to challenge people on their skills. ...but I do believe the game could help people learn, or re-learn, what they do not know.\u003C/p\u003E\u003Cp\u003EAnd ok, and idea for a more veteran player - Joysticks - it\u0027s still terrible for these reasons:\u003C/p\u003E\u003Cp\u003E1) I plug and un-plug lots of things from my PC depending on what I\u0027m playing (steering wheels, joystick, gamepads, keypads, 3D mouse, throttle, racing pedals, gear-shifter, etc, etc) - KSP gets confused regarding which one is plugged in causing me to go through setup every time I play. Ideally I could plug in controllers AT ANY TIME while I\u0027m playing but as it is I can\u0027t even just make sure they\u0027re plugged in before I launch the game.\u003C/p\u003E\u003Cp\u003E2) Have a mentioned that control setup isn\u0027t available in game? I have to revert to the opening menu in order to make adjustments to any of my controller settings.\u003C/p\u003E\u003Cp\u003E3) My (quite fancy) controllers have things like, left pedal on Axis 1, right pedal on Axis 2 ... KSP wants to know which axis I\u0027ll be using for Roll/Yaw? I require KSP to understand this common issue and either merge the two axises into one or allow me to pick different axises for left and right input.\u003C/p\u003E\u003Cp\u003E- Note, I use 3rd party software to solve most of these problems - they just are huge inconveniences for all kinds of reasons, many of which result in them never working and thus me never using my joystick(s) like I wish I could.\u003C/p\u003E\u003Cp\u003EOk, a simple one, Pods should require electric charge exactly like unmanned vehicals\u003C/p\u003E\u003Cp\u003E...and the \u0022Snacks\u0022 life support seems like a wonderful way to do life support that doesn\u0027t lead to death or game over and fits the feel of the game.\u003C/p\u003E\u003Cp\u003EMany more that you\u0027ve already listed. I mostly wanted to chime in about how these more complex desires would be better facilitated by a game that does a great job introducing them to new players (instead of dumbing everything down to keep it fun enough for new players).\u003C/p\u003E\n"},{"CreatedByName":"macdjord","CreatedById":5630,"CreatedDateTime":"2015-05-11T17:31:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Black-Talon\u0022 data-cite=\u0022Black-Talon\u0022\u003E\u003Cdiv\u003ECareer mode (normal difficulty) could/should start off with tutorial content and contracts which demonstrate each component of the game at a time: Rocket Building; Rocket Launch and Piloting (what is the NavBall? how to use it?); Science Gathering and Recovery; Rocket Engineering and Design (from staging and thrust to weight ratio to Rocket Engine Fuels and DeltaV; Electrical systems; Stable Aerodynamic Flight; Control Surfaces; Reaction Wheels; Kerbal Skills; Getting to orbit; Orbital Maneuvers; Gravitational Capture; Engineering Planes \u0026amp; Rovers; Craft Recovery; Landing on Another Body with unknown characteristics such as gravity and atmospheric conditions; Interplanetary transfers; Simultaneous missions; ... where does the learning stop and the game begin?? I\u0027ve found my learning experience over the last few years to be a fantastic game that I hope never stops - I hope they are both there throughout Kerbal Space Program\u0027s lifetime ... there is after all \u0022Moderate\u0022 and \u0022Hard\u0022 difficulty levels to challenge people on their skills. ...but I do believe the game could help people learn, or re-learn, what they do not know.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027d say that all that belongs in the \u003Cem\u003Etutorials\u003C/em\u003E, not in the main career mode.\u003C/p\u003E\n"},{"CreatedByName":"Sky_walker","CreatedById":113214,"CreatedDateTime":"2015-05-11T20:14:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Black-Talon\u0022 data-cite=\u0022Black-Talon\u0022\u003E\u003Cdiv\u003ESadly, the list is already too long, is there any easy way to prioritize a list like this?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWould be easier to just categorize it. Every person has a different priorities and making the list sorted by perceived priority could lead to pointless arguing.\u003C/p\u003E\n"},{"CreatedByName":"TothAval","CreatedById":142030,"CreatedDateTime":"2015-05-13T09:56:24Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003Elist updated\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003Eintegrated ideas from other posts in \u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/forums/59-Suggestions-and-Development-Discussion\u0022 rel=\u0022external nofollow\u0022\u003ESuggestions and Development Discussion\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Ei tried to better categorize the list, please tell me your thoughts on how to improve it more, categorization never felt like my strong suit \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"FishInferno","CreatedById":106219,"CreatedDateTime":"2015-05-13T10:39:18Z","Content":"\n\u003Cp\u003EWhat I would like is a \u0022do not show again\u0022 option for the \u0022welcome to the VAB, this is where...\u0022 messages\u003C/p\u003E\n"}]}