{"TopicId":106594,"ForumId":69,"TopicTitle":"Problem with vessel in Docking tutorial","CreatedByName":"stibbons","CreatedById":57865,"CreatedDateTime":"2015-05-01T16:14:37Z","PageNum":1,"Articles":[{"CreatedByName":"stibbons","CreatedById":57865,"CreatedDateTime":"2015-05-01T16:14:37Z","Content":"\n\u003Cp\u003EI tried out the Docking tutorial for the first time this evening and ran in to a fairly dire issue with the vessel it uses. Tagged OS X because that\u0027s the only platform I\u0027ve tried it on so far, but I suspect it\u0027s applicable to all of them.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EKSP version:\u003C/strong\u003E 1.0, on OS X Yosemite\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EProblem:\u003C/strong\u003E Docking Tutorial vessel detaches Hitchhiker Storage Container when parachutes are deployed.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMods installed:\u003C/strong\u003E None.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ESteps to reproduce:\u003C/strong\u003E I started the docking tutorial, and completed all steps. The final step suggests one way to rescue the Kerbals in the craft I\u0027ve docked to is to transfer them to my vessel, and then land. So I transferred all three from the Stranded command pod in to the Hitchhiker can on my vessel. Then I undocked, and burned retrograde to enter the atmosphere. Once within the atmosphere, I hit the stage key to deploy the parachutes. As well as the parachutes, the hitchhiker can and fuel tank and engine were decoupled. I had control of the pod, and the kerbals in the hitchhiker were lost.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EWhat I expect:\u003C/strong\u003E Staging should deploy the chutes. Decoupling the engine and fuel tank is optional. I certainly did not expect to lose the hitchhiker as well.\u003C/p\u003E\u003Cp\u003EHere\u0027s a picture of the vessel at the start of the scenario. Note the position of the decoupler, and the fact that it\u0027s currently set to stage with the parachutes in stage 0. The simplest fix to me seems to be moving the decoupler down to below the hitchhiker. That way staging will result in the hitchhiker and pod descending.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/zKFBAoB.png\u0022 alt=\u0022zKFBAoB.png\u0022\u003E\u003C/p\u003E\n"}]}