{"TopicId":106603,"ForumId":32,"TopicTitle":"alt\u002Bscroll in flight mode -\u003E crazy mode","CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2015-05-01T16:44:49Z","PageNum":1,"Articles":[{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2015-05-01T16:44:49Z","Content":"Either this is a new thing, or I\u0027ve never accidentally held down alt while using the mouse wheel to zoom while in flight mode.\n\nAs we all know scroll on it\u0027s own zooms in on your craft. Alt\u002Bscroll is like changing the curve of the camera\u0027s lens. This is on full in one direction (that\u0027s just a mk1 pod with a small nose cone)\n\n[![Ppf3Dkih.jpg](http://i.imgur.com/Ppf3Dkih.jpg)](http://imgur.com/Ppf3Dki)\n\nThis is a better comparison;\n\n**Zoomed Out** (note how far away the buildings appear)\n\n[![esA8XVYl.jpg](http://i.imgur.com/esA8XVYl.jpg)](http://imgur.com/esA8XVY)\n\n**Normal(ish)** (although I\u0027m not 100% sure and can\u0027t find how to reset to normal!)\n\n[![6q5x21gl.jpg](http://i.imgur.com/6q5x21gl.jpg)](http://imgur.com/6q5x21g)\n\n**Zoomed in** (hello VAB)\n\n[![Lrd9zBel.jpg](http://i.imgur.com/Lrd9zBel.jpg)](http://imgur.com/Lrd9zBe)\n\nAs mentioned, I can\u0027t figure out how to snap the camera back to normal. If you hold down mouse wheel to pan about then double clicking mouse wheel resets it, but I can\u0027t find anything like that to reset this. Had to restart KSP to be sure I was back to normal (how nice that KSP restarts so fast now!), thankfully it doesn\u0027t remember the crazy camera setting after a restart cos this was starting to make my head feel funny. But it\u0027s a cool thing to have for getting some stylized shots of craft.\n\noh and that little \u0022craft\u0022 is the VIP tour-pod I\u0027m working on, doesn\u0027t need any shielding and glides in pretty nicely (still working on that craft-ground problem as I don\u0027t have wheels yet)\n\n[![CGm8AcDm.jpg](http://i.imgur.com/CGm8AcDm.jpg)](http://imgur.com/CGm8AcD)"},{"CreatedByName":"jarmund","CreatedById":126888,"CreatedDateTime":"2015-05-01T16:50:38Z","Content":"Looks like it\u0027s changing the [FOV](https://en.wikipedia.org/wiki/Field_of_view). If I was into video making, I\u0027d start using that effect when flying low."},{"CreatedByName":"Kagame","CreatedById":141304,"CreatedDateTime":"2015-05-01T16:50:43Z","Content":"Huh, so KSP does have an FOV change function after all. Also, nice little tour-pod. Personally, I prefer using three \u0027chutes and deploying one early for my re-entry technique. The first one only burns sometimes, and when it does, that\u0027s what the other two are for. Yours probably lands much, much faster, though, so I\u0027ll have to give it a try."},{"CreatedByName":"robopilot99","CreatedById":102126,"CreatedDateTime":"2015-05-01T17:12:17Z","Content":"The new FOV change function was in the release notes for version 1, so yes it\u0027s new. I think it\u0027s quite nice personally."},{"CreatedByName":"1greywind","CreatedById":82369,"CreatedDateTime":"2015-05-01T17:48:56Z","Content":"Sad that we don\u0027t have \u0022reset FOV to default\u0022 button anywhere."}]}