{"TopicId":106641,"ForumId":32,"TopicTitle":"Flaunting Stupidity","CreatedByName":"theFredster","CreatedById":141918,"CreatedDateTime":"2015-05-01T19:09:02Z","PageNum":1,"Articles":[{"CreatedByName":"theFredster","CreatedById":141918,"CreatedDateTime":"2015-05-01T19:09:02Z","Content":"OK, I have 2 quick questions. Where are the \u0022Temp Gauges\u0022 they mention in the change log? I can\u0027t find any parameter that changes in the debug page when pressing F10 and see no change on-screen. I even went so far as to check the thermometer part for a display, based on myself being an idiot at times. Ok, only 97.8% of the time, when I\u0027m awake, and breathing.\n\nSecond, My fully upgraded space-plane hanger still has a VERY BUMPY dirt runway. Did I accidentally upset some concrete workers or are they on strike?\n\nI will gladly thank anyone for any response. Not publicly, but I will quietly thank you, subtly, when I\u0027m completely alone. \n\ntheFredster"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-05-01T19:15:36Z","Content":"Welcome to the forums!\n\nThe heat gauges show up only when a part is nearing its critical temperature.\n\nThe runway upgrades separately from the hangar, so you may have a fully upgraded hangar but haven\u0027t upgraded the runway."},{"CreatedByName":"Tssha","CreatedById":8465,"CreatedDateTime":"2015-05-01T19:18:23Z","Content":"First, I haven\u0027t gotten in game yet for the latest patch, but I think it\u0027s both that you can right-click on the part to see its temperature, and it\u0027ll change colour if it\u0027s exposed to a lot of heat for some reason. No colour change? No significant temperature change. But I could be wrong.\n\nSecond, and this answer I\u0027m definite on, you have to upgrade the runway itself. Just like you have to upgrade the launchpad, you\u0027re gonna have to right-click on the runway itself, upgrade it, and that\u0027ll...mostly smooth it out. It\u0027ll be totally smooth by the third and final upgrade, but it\u0027s 90% of the way there with the first upgrade (to tier two).\n\nMore verbose answers than Crown\u0027s. Glad to know I\u0027m on the same page though. ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)"},{"CreatedByName":"CalculusWarrior","CreatedById":58313,"CreatedDateTime":"2015-05-01T19:26:18Z","Content":"Yes, it looks like if you press F11, you will see the part heat overlay (either parts are coloured differently based upon their temperature, or their right-click menus show the heat information, or both; I\u0027ve not been able to play the most recent update either)"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2015-05-01T19:33:06Z","Content":"\u003E \n\u003E Yes, it looks like if you press F11, you will see the part heat overlay (either parts are coloured differently based upon their temperature, or their right-click menus show the heat information, or both; I\u0027ve not been able to play the most recent update either)\n\nThis makes me smile ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nAnd welcome to theFredster on the occasion of his first post!"},{"CreatedByName":"klesh","CreatedById":110814,"CreatedDateTime":"2015-05-01T19:36:46Z","Content":"The right-click menu temp readouts are still within the alt\u002Bf12 menu. F10 turns on little heat level bars and a glow around parts that are heating up, while f11 displays a color-coded cloak on your whole ship showing you what parts are the hottest. You need a combination of all 3 to get a complete heat picture."},{"CreatedByName":"theFredster","CreatedById":141918,"CreatedDateTime":"2015-05-01T19:36:57Z","Content":"Well (#(\\*@@. I guess I\u0027m not trying hard enough to burn stuff up. That will HAVE to change. Although, for now, I guess there won\u0027t be a picket line of Kerbal contractors, just me sitting next to the dirt runway with a sign that says \u0022Will Work for Asphalt\u0022.\n\nThanks for the reply\u0027s, even though I said I wasn\u0027t going to do that publicly. ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)\n\nTheFredster"},{"CreatedByName":"Suicider","CreatedById":141344,"CreatedDateTime":"2015-05-01T19:39:17Z","Content":"I did nothing besides re-entering kerbins atmosphere with a ship, and as i did my ladders (Which were hanging off the side) DID get little Thermal bars and started to glow red (Special and Differently from a hot part) So it should be on by default."}]}