{"TopicId":106627,"ForumId":55,"TopicTitle":"On the price of Cadet hires and Establish Base contracts.","CreatedByName":"Xacktar","CreatedById":88876,"CreatedDateTime":"2015-05-01T18:10:39Z","PageNum":1,"Articles":[{"CreatedByName":"Xacktar","CreatedById":88876,"CreatedDateTime":"2015-05-01T18:10:39Z","Content":"I am very sad right now in my career game.\n\nThis is because I want to do Establish Base contracts but I cannot without performing 10 rescue missions or driving myself into bankruptcy.\n\nIt now costs me 340,000 to hire a single cadet.\n\nI have a contract to make an 18-kerbal base that only gives a combined payout of 600,000. If I hired all the kerbals needed for this mission fresh from the academy it would cost me over five million funds.\n\nPlease lower and cap the price of hiring new kerbals or re-balance base missions to compensate for the cost. I don\u0027t mind there being a hiring cost, but having the cost stop me from doing missions makes me sad.\n\n**Edited \u003Ctime datetime=\u00222015-05-01T18:12:54Z\u0022 title=\u002205/01/2015 06:12  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 1, 2015\u003C/time\u003E by Xacktar**"},{"CreatedByName":"J.Random","CreatedById":63332,"CreatedDateTime":"2015-05-01T18:47:00Z","Content":"I don\u0027t recall base contracts to require kerbals. They needed enough space for certain amount of kerbals, which isn\u0027t the same. Was it changed?"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2015-05-01T18:50:29Z","Content":"\u003E \n\u003E I don\u0027t recall base contracts to require kerbals. They needed enough space for certain amount of kerbals, which isn\u0027t the same. Was it changed?\n\nIt says \u0022Supporting at least X Kerbals\u0022, and you need at least that much in your ship to fulfill the contract. As far as I know it\u0027s always been that way."},{"CreatedByName":"J.Random","CreatedById":63332,"CreatedDateTime":"2015-05-01T18:55:05Z","Content":"\u003E \n\u003E you need at least that much in your ship to fulfill the contract.\n\nOh. I guess I didn\u0027t pay enough attention. That sucks."},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2015-05-01T18:58:23Z","Content":"I have to try in 1.0, but it never required shipping the actual kerbals, just being able to support them."},{"CreatedByName":"Robotengineer","CreatedById":104525,"CreatedDateTime":"2015-05-01T18:58:59Z","Content":"\u003E \n\u003E It says \u0022Supporting at least X Kerbals\u0022, and you need at least that much in your ship to fulfill the contract. As far as I know it\u0027s always been that way.\n\nNope. You just need enough space for X number of kerbals, you don\u0027t actually have to have a kerbal in every seat."},{"CreatedByName":"Slam_Jones","CreatedById":125101,"CreatedDateTime":"2015-05-01T19:06:21Z","Content":"\u003E \n\u003E Nope. You just need enough space for X number of kerbals, you don\u0027t actually have to have a kerbal in every seat.\n\nI can confirm that was the case for 0.90, but haven\u0027t yet tried in 1.0.\n\nI suspect it\u0027s the same."},{"CreatedByName":"Xacktar","CreatedById":88876,"CreatedDateTime":"2015-05-01T19:47:55Z","Content":"\u003E \n\u003E Nope. You just need enough space for X number of kerbals, you don\u0027t actually have to have a kerbal in every seat.\n\nIf this is correct then the mission text should be changed. As of this moment, it reads: \n\n\u0027Have a facility **supporting** at least nine kerbals.\u0027\n\ninstead of \n\n\u0027Have a facility **capable of supporting** nine kerbals.\u0027\n\nEither way, I like fully-stocked bases. I\u0027m sure I could ship empty bases everywhere with Probe Core drivers, but why bother? I enjoy the IVAs, EVAs and other little bits of kerbals hanging around. Having a gameplay element that constricts this irks me.\n\n**Edited \u003Ctime datetime=\u00222015-05-01T19:52:23Z\u0022 title=\u002205/01/2015 07:52  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 1, 2015\u003C/time\u003E by Xacktar**"},{"CreatedByName":"Pax Kerbana","CreatedById":129558,"CreatedDateTime":"2015-05-01T21:11:23Z","Content":"All I can say is that the price of a Kerbal does not correlate with the price of spacecraft hardware. Seriously.\n\nIf:\n\nF-1 adjusted for inflation cost $15-20 million per engine today\n\nAstronauts make $100,000 per year average, not including pay for spaceflight\n\nThe S3 KS-25x4 has (4) F-1 equivalent engines (and costs 32,400 roots)\n\nThen:\n\nThe \u0022Mammoth\u0022 would cost $60-80 million per unit (engines only!)\n\nEach root is equivalent to $1,800-2,500 US\n\nXacktar\u0027s next hire is a low one-time cost of $630-840 million\n\nAnd:\n\nSomething is seriously wrong. Tell me that I did the math wrong by saying the Mammoth is equivalent to \u0022one\u0022 F-1 and still prove this point.\n\nThe cost for Kebral hires (per year) should be in the realm of 50-100 roots for my example and 200-400 if I\u0027ve got it off by 4x. I don\u0027t understand how a Kerbal can be \u0022bought\u0022 for a one-time fee. But let\u0027s say this is represents a 10-year contract. That puts the one-time cost somewhere between 500-1000 and 2000-4000 roots."},{"CreatedByName":"J.Random","CreatedById":63332,"CreatedDateTime":"2015-05-01T21:34:30Z","Content":"\u003E \n\u003E Astronauts make $100,000 per year average, not including pay for spaceflight\n\nI\u0027d guess they cost much, much more if you include their training."},{"CreatedByName":"Tery215","CreatedById":89094,"CreatedDateTime":"2015-05-01T21:54:21Z","Content":"I think the price cap should be based on the current reputation, so kerbals that are working for a well known and very safe space program would need less money because of insurance or competition to get hired."},{"CreatedByName":"MKI","CreatedById":77241,"CreatedDateTime":"2015-05-01T22:17:26Z","Content":"\u003E \n\u003E It says \u0022Supporting at least X Kerbals\u0022, and you need at least that much in your ship to fulfill the contract. As far as I know it\u0027s always been that way.\n\nI\u0027ve never sent kerbals on base missions WITH the mission itself. They are always controlled by probe cores and are emtpy.\n\nTo create a station or a base you DO NOT need kerbals within the ship. It\u0027s like this and WAS like this. \n\nI like the current way to pay for kerbals. Just like real spaceflight most difficult work is done by probes. As they cost pretty much nothing, which balances them out with Kerbals and their abilities to do things on the fly, and provide much more capable science return/station manning.\n\nGameplaywise this addition is important as Science Lab\u0027s can give back ton\u0027s of science for almost no secondary work (get it there with kerbals and you get sciences) But that means you need to INVEST at least 2 kerbals to that station for a long period off time. Which balances out financially, as it costs a good amount of cash to get those two kerbals, either by rescue missions or by just buying them.\n\nI dislike the idea of getting free kerbals from rescue missions. Kerbonauts shouldn\u0027t be cheap, since in terms of gameplay they are very important and neccessary in most missions if you want them to make the most of the mission. (EVA reports, surface samples, FLAGS!)"},{"CreatedByName":"Xacktar","CreatedById":88876,"CreatedDateTime":"2015-05-01T22:22:45Z","Content":"What if the Kerbals for the colony were provided like tourist kerbals are?\n\nColonist Kerbals!\n\nThat way they wouldn\u0027t detract from your own space program but would actually fill the base in question so you don\u0027t have empty husk bases all over the system.\n\n\u003E \n\u003E I think the price cap should be based on the current reputation, so kerbals that are working for a well known and very safe space program would need less money because of insurance or competition to get hired.\n\nI like this idea too!"}]}