{"TopicId":106885,"ForumId":32,"TopicTitle":"Has anyone else not bothered with career mode?","CreatedByName":"J2750","CreatedById":142720,"CreatedDateTime":"2015-05-02T15:19:27Z","PageNum":6,"Articles":[{"CreatedByName":"Bandus","CreatedById":8358,"CreatedDateTime":"2015-12-20T15:51:50Z","Content":"\n\u003Cp\u003E\nCareer mode really helped me after being away from the game for awhile. I had last played before all the physics changes and as a result alot of the knowledge I had about rocket design was no longer valid.\n\u003C/p\u003E\n\u003Cp\u003E\nCareer mode helped me to learn how to build smaller and more efficiently for a given payload. \n\u003C/p\u003E\n\u003Cp\u003E\nI did find, however, that once I had learned launching, rendezvousing, landing, and the other basic skills, I was ready to move back into sandbox and add mods as it felt like the contracts became a bit pointless and random.\n\u003C/p\u003E\n"},{"CreatedByName":"worir4","CreatedById":75980,"CreatedDateTime":"2015-12-20T15:52:15Z","Content":"\n\u003Cp\u003E\nIt would be good if they made a mode for just funds. I always add my self a 1000 science points to get past the grindy first stages of career. After that it is fun and just turns into sandbox with funds which i like.\n\u003C/p\u003E\n"},{"CreatedByName":"Majorjim!","CreatedById":61954,"CreatedDateTime":"2015-12-20T15:55:55Z","Content":"\n\u003Cp\u003E\nCareer mode is not what people wanted before it arrived.. We where expecting something grand and exciting, where we would be doing real science and exploration and actually feel like a real space program. Sadly Sqaud just tacked on a part unlocking mechanism. career as it stands today is a massive wasted opportunity.\n\u003C/p\u003E\n\u003Cp\u003E\n Sandbox forever! It is what the game is, a sandbox. To say otherwise is.. well..\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-12-20T15:57:25Z\u0022 title=\u002212/20/2015 03:57  PM\u0022 data-short=\u00228 yr\u0022\u003EDecember 20, 2015\u003C/time\u003E by Majorjim\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TheSaint","CreatedById":70033,"CreatedDateTime":"2015-12-20T16:02:29Z","Content":"\n\u003Cp\u003E\nI almost always play sandbox. Every once in a while I\u0027ll play through a career mode game, just to make sure I still don\u0027t like it. So far I haven\u0027t been wrong. \n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2015-12-20T17:24:37Z","Content":"\n\u003Cp\u003E\nI actually enjoy career mode since it encourages you to build logical designs and expand upon them as you get new parts. It also forces you to think about the costs and purposes of your ships rather than \u0022adding more boosters.\u0022 With such a wealth of parts, you actually question which of them you need most. I agree that it could still use more work in terms of balancing and contracts, but I think the system is solid nonetheless. Once you\u0027ve made it into late career mode and have tons of funds, it\u0027s pretty much the same as sandbox anyway.\n\u003C/p\u003E\n\u003Cp\u003E\nWithout career mode, I think it\u0027s safe to say that new players would just strap Kerbodyne tanks and engines together and wonder why they\u0027d explode.\n\u003C/p\u003E\n"},{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2015-12-20T17:50:59Z","Content":"\n\u003Cp\u003E\nI have \u003Cem\u003Ereally \u003C/em\u003Etried to like career mode, I wanted to enjoy it and I stuck at it for a while, but recently I decided to return to my native habitat of the sandbox and I\u0027m now rediscovering my love of KSP again. \n\u003C/p\u003E\n\u003Cp\u003E\nI do like the beginning of it, the challenge of getting as far as you can on limited parts is enjoyable. But that\u0027s it\u0027s only challenge, \u0022can you get to Mun on low tech parts?\u0022. Answer; yes, and now it has nothing interesting to offer.  I actually enjoyed the earlier versions of career more, when you could do more daft things like complete it in two launches. I don\u0027t enjoy the design \u0022challenges\u0022 the current career offers, its missions seem boring (even if \u0027spiced\u0027 up by doing multiple contracts in one mission) but far worse than that; I haven\u0027t liked (or enjoyed building) a single one of the craft I\u0027ve made in career.\u003Cbr\u003E\nAnd that\u0027s what KSP is about \u003Cem\u003Efor me, \u003C/em\u003Emaking craft for no other reason than it seems like a cool idea at the time (and then spending days/weeks and sometimes months building it). I always used to say that the best thing about KSP was that it had no defined point and it was up to you to invent one.  That got lost in my attempts to play career, but now I\u0027m back in pointless sandbox, the point of the game has returned!  \n\u003C/p\u003E\n"},{"CreatedByName":"McFarnsworth","CreatedById":73984,"CreatedDateTime":"2015-12-20T18:03:09Z","Content":"\n\u003Cp\u003E\nI haven\u0027t started a new career in 1.0.5, might try again once 1.1 is out. For me career mode is only fun when I can complete several complex contracts in one go and have to build some absurd contraptions with low tech parts to overcome the challenges that entails. This does mean I need to contract spam a lot, which the new rep mechanic punishes. I also find the initial grind for science really boring so I\u0027m never too motivated to start a new career.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve had my fun with it, and it taught me how to play without MechJeb again as I started relying on that far too much, but I pretty much only play sandbox now.\n\u003C/p\u003E\n"},{"CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2015-12-20T23:15:02Z","Content":"\n\u003Cp\u003E\nHuh. I don\u0027t remember replying to this thread. What was I thinking saying the career is alright?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOk, so the tech tree changed again and I can\u0027t launch some of my vessels because the parts they contained are beyond my reach (550 SP nodes and later).\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m torn apart now. Not sure if I should try to grind my way throuth the tree to them or start a new one with a modded (and more sane) tech tree. And I\u0027m not torn because I like the grind, but because I have already so many flights in my career and don\u0027t want to abandon them ;_; I\u0027ll miss you, Laythe Pigeon \u003Cspan style=\u0022font-size:8px;\u0022\u003Eyou were my favourite *creepy smooch*\u003C/span\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-12-20T23:17:19Z\u0022 title=\u002212/20/2015 11:17  PM\u0022 data-short=\u00228 yr\u0022\u003EDecember 20, 2015\u003C/time\u003E by Veeltch\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"nosirrbro","CreatedById":69814,"CreatedDateTime":"2015-12-20T23:43:06Z","Content":"\n\u003Cp\u003E\nI used to play it but recently I just cant be bothered. Personally I like setting my own constraints rather then having the game make them for me.\n\u003C/p\u003E\n"},{"CreatedByName":"NeMeSiS","CreatedById":5379,"CreatedDateTime":"2015-12-21T00:37:43Z","Content":"\n\u003Cp\u003E\nI did it a while back just to prove to myself that i could easily unlock everything in a few flights. This was a few versions back and i havent bothered with it since, i prefer building cool stuff without arbitrary restrictions.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEDIT: Also, i really do not enjoy having to actually manage a space program. I love doing individual missions and building stuff, but keeping track of several different missions at the same with time with kerbal alarm clock just gives me nightmares.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-12-21T00:39:12Z\u0022 title=\u002212/21/2015 12:39  AM\u0022 data-short=\u00228 yr\u0022\u003EDecember 21, 2015\u003C/time\u003E by NeMeSiS\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2015-12-21T00:55:36Z","Content":"\n\u003Cp\u003E\nCareer mode isn\u0027t doing it for me either. Just not engaging enough. \n\u003C/p\u003E\n"},{"CreatedByName":"Teilnehmer","CreatedById":143330,"CreatedDateTime":"2015-12-21T09:46:04Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00221878359\u0022 data-ipsquote-contentid=\u0022106885\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221430579967\u0022 data-ipsquote-userid=\u0022142720\u0022 data-ipsquote-username=\u0022J2750\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 02.05.2015 at 9:19 PM, J2750 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHas anyone else not played the career mode?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSandbox only!\n\u003C/p\u003E\n\u003Cp\u003E\nMoney-schmoney — not for me.\n\u003C/p\u003E\n"},{"CreatedByName":"Death Engineering","CreatedById":68528,"CreatedDateTime":"2015-12-21T15:23:03Z","Content":"\n\u003Cp\u003E\nMaybe already covered, but yeah stock career is a little flat. However, with the right set of mods Career is much more challenging and entertaining. Adding parts from Ven\u0027s \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/83696-105-stock-part-revamp-update-190/\u0022\u003EStock Part Revamp\u003C/a\u003E and Station Science, and the contracts from Tourism Plus and Kerbin Space Station, encourage a reasonably paced, incrementally more challenging game with rewards for building with re-use in mind.  Adding in RoverDude\u0027s \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/105202-105-usi-life-support-017-20151119/\u0026amp;page=1\u0022\u003EUSI Life Support\u003C/a\u003E also adds a little realism to the challenge without making missions just all about the life support.\n\u003C/p\u003E\n\u003Cp\u003E\nThose mods, plus Stockalike Station Expansion, is how I play lately and the career I just wrapped up was the most enjoyable I\u0027ve had in KSP. I especially enjoyed all the time spent at Jool performing Quark science/tourism combo missions. The utterly massive parts in Station Science along with the challenges of life-support made for some real white-knuckle moments.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-12-21T17:00:55Z\u0022 title=\u002212/21/2015 05:00  PM\u0022 data-short=\u00228 yr\u0022\u003EDecember 21, 2015\u003C/time\u003E by Death Engineering\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"pandaman","CreatedById":130621,"CreatedDateTime":"2015-12-21T20:21:02Z","Content":"\n\u003Cp\u003E\nI really, really like the idea of career mode,  but the few times I tried it I found myself just working to complete the tech tree.  I know that is largely down to the way I played, but something still felt \u0027missing\u0027 from the game.\n\u003C/p\u003E\n\u003Cp\u003E\nIt does feel to me as if the whole career mechanic need a rework. The science and tech tree progression and Kerbal XP in particular.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Andem","CreatedById":155578,"CreatedDateTime":"2016-01-30T22:20:50Z","Content":"\n\u003Cp\u003E\nI tend to stick with sandbox. At first career freaked me out a little, hearing of how terrible it was on the forums, all the management wasn\u0027t what I wanted KSP to be. then I tried it. Not as terrible as people make it out to be, but also not great. I actually want to see some things in current career that I actually want in sandbox as optional things.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nHere\u0027s the thread: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/131061-career-lite/\u0022\u003Ehttp://forum.kerbalspaceprogram.com/index.php?/topic/131061-career-lite/\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Elway358","CreatedById":157334,"CreatedDateTime":"2016-01-31T14:01:37Z","Content":"\n\u003Cp\u003E\nI\u0027m a very new player to KSP (about 2 or 3 weeks) and I can tell you for a fact that I would never have touched this game if it weren\u0027t for career mode. I don\u0027t ever see myself just doing sandbox as I like to have goals set for me to achieve. career mode does a great job with having to unlock things and set the pace for you IMO.\n\u003C/p\u003E\n"},{"CreatedByName":"pandaman","CreatedById":130621,"CreatedDateTime":"2016-01-31T17:57:30Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222387459\u0022 data-ipsquote-contentid=\u0022106885\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221454248897\u0022 data-ipsquote-userid=\u0022157334\u0022 data-ipsquote-username=\u0022Elway358\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Elway358 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027m a very new player to KSP (about 2 or 3 weeks) and I can tell you for a fact that I would never have touched this game if it weren\u0027t for career mode. I don\u0027t ever see myself just doing sandbox as I like to have goals set for me to achieve. career mode does a great job with having to unlock things and set the pace for you IMO.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nCareer as an idea is great, like you I sometimes like to have goals and limitations that I haven\u0027t set for myself, but for me it\u0027s just the current implementation that puts me off.\n\u003C/p\u003E\n\u003Cp\u003E\n It just seems a bit disjointed, and place holder like to me.  But now squad can see what the current career mode plays like over a long time for a lot of different players they can see where they think it needs work and address it over time.\n\u003C/p\u003E\n"},{"CreatedByName":"Overland","CreatedById":119812,"CreatedDateTime":"2016-02-01T06:00:00Z","Content":"\n\u003Cp\u003E\nIve had KSP since 0.20.. Ive driven trains since 0.25.. In 0.90 I brought a proper steering wheel and throttle..\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nTrains are a sandbox thing.. Im still 2 years on trying to complete my own contract.. Drive to KSC 2\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nCareer for me is like taking away my toybox and not getting it back until im a good boy\n\u003C/p\u003E\n\u003Cp\u003E\nSince smashing things in protest doesnt get it back... I never touch it \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWhen im restricted I tend to push boundries outside of the contract..\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThis is why we cant have nice things.... In limited quantitys\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-02-01T06:03:17Z\u0022 title=\u002202/01/2016 06:03  AM\u0022 data-short=\u00228 yr\u0022\u003EFebruary 1, 2016\u003C/time\u003E by Overland\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ehco Corrallo","CreatedById":154785,"CreatedDateTime":"2016-02-01T06:15:14Z","Content":"\n\u003Cp\u003E\nI didn\u0027t use to play career. Sandbox is plenty difficult without limitations like money and science and unlocked parts. I started a career game recently though, and I\u0027ve had fun with it, mostly only because it gives a point to the science parts, which are very cool, and add another layer of planning to an otherwise simple mission: \u0022Go here, land here, go home.\u0022 Having to build up to bigger missions is nice too.\n\u003C/p\u003E\n\u003Cp\u003E\nThat said, of the 350 odd hours I\u0027ve played, perhaps 10 of them have been in career. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Luis","CreatedById":55075,"CreatedDateTime":"2016-02-01T09:01:21Z","Content":"\n\u003Cp\u003E\nI definitely think that the game mode missing from KSP is a campaign story mode. In my current save, I am role playing a series of missions that has the Kerbals gradually learning about a threat from beyond Kerbin, centred on the easter eggs. Each mission gives them a specific task (eg send rovers to photograph each of the Munoliths) and I write them up in a notepad file to build an ongoing narrative. At the successful completion of each mission I award myself one or two new pieces of technology. These are always key pieces, like engines or fuel tanks. I assume that the little things like girders and adaptors are always available. Certain tech advances require some extra havesting - the uranium for the LV-N can only be mined from the Mun, for example.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027d dearly love it if KSP added a framework for campaign mode that allowed the community to write linear sequences of missions with their own briefing text, completion requirements and rewards. This would override th tech tree, because the missions would determine which parts were available. Money could exist as a limit to the total amount you could spend for that mission, but a new revert mode would always allow you to revert back to the start of the current mission, so you\u0027d never bankrupt yourself into a dead-end.\n\u003C/p\u003E\n"},{"CreatedByName":"flintlockmusket","CreatedById":144820,"CreatedDateTime":"2016-02-02T02:40:14Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222388623\u0022 data-ipsquote-contentid=\u0022106885\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221454317281\u0022 data-ipsquote-userid=\u002255075\u0022 data-ipsquote-username=\u0022Luis\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n17 hours ago, Luis said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u0022I definitely think that the game mode missing from KSP is a campaign story mode.\u0022\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell said Luis. \n\u003C/p\u003E\n\u003Cp\u003E\nI myself have not had fun using career mode as presented in the stock game.  Instead I use a custom made tech tree, and make up a set of missions to discover something or other in the system.  I don\u0027t use the contract system built in the game, as I don\u0027t feel the contracts really match what I trying to do.  By the way, I play in sandbox, with limits set by me, plus use a mod to give some chance of random failure.  Works out good, cause I get to plan everything out, then they to execute, with failure being a real option.  \n\u003C/p\u003E\n\u003Cp\u003E\nWho said fun came in a box.   \n\u003C/p\u003E\n"},{"CreatedByName":"Exploro","CreatedById":150492,"CreatedDateTime":"2016-02-02T04:53:49Z","Content":"\n\u003Cp\u003E\nif it weren\u0027t for career mode I wouldn\u0027t have found use for planes. Planes made a lot of the survey contracts a lucrative thing.\n\u003C/p\u003E\n"},{"CreatedByName":"Brainlord Mesomorph","CreatedById":110905,"CreatedDateTime":"2016-02-02T12:31:29Z","Content":"\n\u003Cp\u003E\nCareer mode does a really good job of teaching you how to use all the parts you never tried in Sandbox.\n\u003C/p\u003E\n\u003Cp\u003E\nOr trying things I didn\u0027t think of before, like putting things in particular orbits.\n\u003C/p\u003E\n\u003Cp\u003E\nBudget limits add a bit of realism too.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-02-02T12:46:29Z\u0022 title=\u002202/02/2016 12:46  PM\u0022 data-short=\u00228 yr\u0022\u003EFebruary 2, 2016\u003C/time\u003E by Brainlord Mesomorph\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Evanitis","CreatedById":145424,"CreatedDateTime":"2016-02-02T12:36:47Z","Content":"\n\u003Cp\u003E\nWhen science mode was introduced, I only played science mode. When career mode was introduced, I only played career mode... until very recently. I kinda\u0027 forgot that stuff like RTGs or nukes or generally the whole end of the tech-tree exist. When I unlocked everything, I restarted with different mods and / or starting conditions and self-imposed limitations.\n\u003C/p\u003E\n\u003Cp\u003E\nI just recently rediscovered the joy of launching a craft in sandbox while bits of the last one are still impacting around. \u003Cimg alt=\u0022^_^\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_happy.png\u0022 title=\u0022^_^\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThough if 1.1 arrives, I guess I\u0027ll just play career mode again. I like to do stuff I don\u0027t like to do.\n\u003C/p\u003E\n"},{"CreatedByName":"Just Jim","CreatedById":148725,"CreatedDateTime":"2016-02-02T12:53:01Z","Content":"\n\u003Cp\u003E\nHonestly, I\u0027ve never bothered with Sandbox or Science Mode.\u003Cbr\u003E\nI\u0027m a career player 100%\n\u003C/p\u003E\n"}]}