{"TopicId":106823,"ForumId":55,"TopicTitle":"saving","CreatedByName":"Bessy","CreatedById":30538,"CreatedDateTime":"2015-05-02T09:37:55Z","PageNum":1,"Articles":[{"CreatedByName":"Bessy","CreatedById":30538,"CreatedDateTime":"2015-05-02T09:37:55Z","Content":"\n\u003Cp\u003Ecan the F9 hold setting be changed to you press F9 and a pop up box and a little message saying hey this will push u back by 3yrs 18 days and the persistent save will auto update to that once u press yes to the bottom question would u still like to revert ?\u003C/p\u003E\u003Cp\u003Ei lifted my keyboard up to sort the legs and went that far back in my game it went back to the beginning all progress was lost \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003Ebig hugs\u003C/p\u003E\n"},{"CreatedByName":"sam.johnson841","CreatedById":104846,"CreatedDateTime":"2015-05-02T11:49:45Z","Content":"\n\u003Cp\u003E^this^\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E- Sam\u003C/p\u003E\n"},{"CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2015-05-02T13:00:45Z","Content":"\n\u003Cp\u003EWoah, you lost three game years worth? Was this all on one big playthrough or something? I think that reloading saves won\u0027t go back across multiple play sessions.\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2015-05-02T13:02:01Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E[Alt]\u003C/strong\u003E\u002B\u003Cstrong\u003E[F5]\u003C/strong\u003E and \u003Cstrong\u003E[Alt]\u003C/strong\u003E\u002B\u003Cstrong\u003E[F9]\u003C/strong\u003E are your friend.\u003C/p\u003E\u003Cp\u003EIf you don\u0027t know what I\u0027m talking about just give it a try.\u003C/p\u003E\n"},{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2015-05-02T13:16:03Z","Content":"\n\u003Cp\u003EI quite often use quick-loads to practice something, when doing that I quick-load a lot, so having an extra mouse click in that workflow would be annoying. If it was just a matter of hitting enter to confirm that would be ok, but most of the UI is mouse driven and not keyboard sensitive so that\u0027s a more annoying interaction. \u003C/p\u003E\u003Cp\u003EI agree KSP\u0027s save system is a bit simple, which is partly why I wrote \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/72212-Jebretary-Automatic-Version-Control-%28backups%29-for-craft-and-saves-v0-4-0\u0022 rel=\u0022external nofollow\u0022\u003EJebretary\u003C/a\u003E - automatically adds all quick saves and autosaves into version control, so you could do several quicksaves in a row and then go back to which ever one you wanted. You can also load any past autosave as a quicksave. It also does the same sort of thing for craft so you can rewind a craft to how it was at any past version.\u003C/p\u003E\n"}]}