{"TopicId":106904,"ForumId":32,"TopicTitle":"Science and Funds","CreatedByName":"TothAval","CreatedById":142030,"CreatedDateTime":"2015-05-02T16:39:03Z","PageNum":1,"Articles":[{"CreatedByName":"TothAval","CreatedById":142030,"CreatedDateTime":"2015-05-02T16:39:03Z","Content":"\n\u003Cp\u003Ei am, since careers(science only) where first introduced, a career-only player and i am ok with the system, nevertheless are some things missing that would make\u003C/p\u003E\u003Cp\u003Ethe progression in career so much more fun in my opinion. \u003C/p\u003E\u003Cp\u003Eas pointed out by many, career in it\u0027s current state is some grinding(which i don\u0027t care about, i love satellite and part testing contracts). i like the contract-system, but being forced to do contracts for private contractors all the time doesn\u0027t feel right and at some point it will get boring nevertheless. where is kerbalkind? where are the governments? \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003Ei think a second source of income for science and funds would be perfect for career mode. there should be government funding and science income through planetary research.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003Ebelow is what i feel would be a great addition for career. \u003C/p\u003E\u003Cp\u003EScience\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003Eincome doing contracts and experiments (as it is now)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Eslow income over time on a selected/random node by planetary research(originating from kerbalkinds universities, research groups, industry, and so on)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Etimewarping science would be possible, yes, but limiting the amount to max 100 science(or less) a year should make this an unattractive and boring approach\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Escience over time could be boosted via a strategy\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Etech-tree node progression could be boosted via strategy\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Enewstrategy: rush science\u003Cbr\u003E\u003Cul\u003E\u003Cli\u003Ereducesscience cost for tech-tree tiers significantly\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Eonlyone part of per node can be unlocked\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Etounlock more parts in a node unlocked this way parts need to be paidwith science and funds\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Echangingstrategy does not effect nodes which where unlocked using thisstrategy\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EFunds\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003Eincome doing contracts (as it is now)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Emonthly income based on reputation, science unlocked, science conducted, flights in progress, flights succesful returned, government contracts/goals fullfilled\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Emonthly income could also be limited by not performing launches(decaying reputation), killing kerbals, crashing craft on kerbin, pending government contracts/goals\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Emonthly income could be boosted via strategy\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Emonthly income could be boosted if research over time node in tech tree(as mentioned under science) was completed using science from experiments\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003Emonthly costs to counter the income, for example labor costs, maintainance, mission control for flights in progress, power consumption, pensions for relatives of killed kerbals,...\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Ecosts and income could also be adressed via building-upgrades\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EReputation\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003Esince managing and organizing a space program is a complex task, some developement to handle this aspect would be nice\u003Cbr\u003E\u003Cul\u003E\u003Cli\u003Efor example an additional small branch of the techtree costing reputation, funds and tiny amounts of science could improve administration(IA) of the program\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EIA could lead to hiring kerbals for less money, support more flights/contracts, purchase unlocked parts for less funds, increasing monthly funds, ...\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Eif it would ever cost time to assemble something on the launchpad, IA could reduce the time, would only require some simulation mode to build and test craft as usual\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E[*]more reputation could allow to make contracts with other agencies and grants access to other launchsites on kerbin(there are some as far as i know)\u003C/p\u003E\u003Cp\u003E[*]this contracts could require a monthly share on money and science\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Eimplementing something like this and make it a slideroption for difficulty, some tweaking of the techtree and career would be perfect in my opinion. i know ksp is about rockets,\u003C/p\u003E\u003Cp\u003Enot management and this is perfectly fine, but career offers a promise to me to play as a space agency struggeling to achieve what ever the goals are. but this aspect comes short\u003C/p\u003E\u003Cp\u003Eand this is why people are upset about career i think.\u003C/p\u003E\u003Cp\u003Ewhat do you think?\u003C/p\u003E\n"},{"CreatedByName":"WOODY01","CreatedById":129358,"CreatedDateTime":"2015-05-02T17:08:23Z","Content":"\n\u003Cp\u003EMy biggest problem with career mode is having to do the same type contracts over and over again to fund your program.\u003C/p\u003E\u003Cp\u003EPersonally I think contracts should be only given out once and pay out more. They should be given slightly before you have the tech to do it easily to challenge a player to come up with a design.\u003C/p\u003E\u003Cp\u003EAs an example for the sat contracts: \u003C/p\u003E\u003Cp\u003EContract to be put in a rather LKO and allow more deviation from the contract requirements\u003C/p\u003E\u003Cp\u003EContract for a esentric orbit and having to be more precise with the orbit\u003C/p\u003E\u003Cp\u003EContract for geosync orbit\u003C/p\u003E\u003Cp\u003EContracts for putting up a sat linked to your scince parts tech level. Unlock the thermometer you get a contract to put a sat up with one attached, same with the scanning parts.\u003C/p\u003E\u003Cp\u003EAfter you complete each you will no longer get sat contracts for Kerbin. \u003C/p\u003E\u003Cp\u003EDo the above should help with not turning the game into grinding the same contracts to fund upgrades and missions that you really want to do.\u003C/p\u003E\n"},{"CreatedByName":"TothAval","CreatedById":142030,"CreatedDateTime":"2015-05-03T10:40:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022WOODY01\u0022 data-cite=\u0022WOODY01\u0022\u003E\u003Cdiv\u003EAfter you complete each you will no longer get sat contracts for Kerbin. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI like your idea except of this. i love satellite contracts and want to fill kerbins soi with them \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E I would prefer an option to deactivate certain contract types for certain bodies or an option \u003C/p\u003E\u003Cp\u003Eto allow or disallow completion of a contract type(while allowing would lead to the results you suggested)\u003C/p\u003E\n"},{"CreatedByName":"Arsonide","CreatedById":32604,"CreatedDateTime":"2015-05-03T12:55:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TothAval\u0022 data-cite=\u0022TothAval\u0022\u003E\u003Cdiv\u003EI like your idea except of this. i love satellite contracts and want to fill kerbins soi with them \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E I would prefer an option to deactivate certain contract types for certain bodies or an option \u003Cp\u003Eto allow or disallow completion of a contract type(while allowing would lead to the results you suggested)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn GameData\\Squad\\Contracts\\Contracts.cfg there are many options that let you do these sorts of things. Look for things labeled \u0022MaximumAvailable\u0022 \u0022MaximumActive\u0022 and \u0022MaximumExistent\u0022. Setting these to lower or higher numbers will drastically affect what sorts of contracts you get, and there are many other options as well.\u003C/p\u003E\n"},{"CreatedByName":"TothAval","CreatedById":142030,"CreatedDateTime":"2015-05-03T13:23:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Arsonide\u0022 data-cite=\u0022Arsonide\u0022\u003E\u003Cdiv\u003EIn GameData\\Squad\\Contracts\\Contracts.cfg there are many options that let you do these sorts of things. Look for things labeled \u0022MaximumAvailable\u0022 \u0022MaximumActive\u0022 and \u0022MaximumExistent\u0022. Setting these to lower or higher numbers will drastically affect what sorts of contracts you get, and there are many other options as well.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGood info, although i would prefer having access to such customization ingame, and not via a cfg file, quality of life and such \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EGood contracts btw. so far, i really enjoy them.\u003C/p\u003E\n"},{"CreatedByName":"Cdr_Zeta","CreatedById":59015,"CreatedDateTime":"2015-05-03T16:27:30Z","Content":"\n\u003Cp\u003EHello,\u003C/p\u003E\u003Cp\u003EI maxxed out Science/Funds settings to custom mode and am stuck on getting into orbit; where are the rest of the contracts and when do they appear? Maxxed out Science/Funds contracts may have issues? I am seeing speed and altitude autocontracts more than I am able to handle as well.\u003C/p\u003E\u003Cp\u003EI am almost ready to start a trial career; I may have to now to see what contracts are really doing.\u003C/p\u003E\u003Cp\u003EZeta\u003C/p\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2015-05-05T15:01:12Z","Content":"\n\u003Cp\u003EI also would like to see a mode with time based payment- it would give you a lot more freedom to take the space program where you\u0027d like, rather than needing to follow the direction set by contracts. This way, some of the contracts could be made redundant- like the explore contracts. \u003C/p\u003E\u003Cp\u003EI\u0027m not convinced linking funds directly to reputation is the best approach- sometimes you will want to warp for a while, and having to grind to regain reputation would be annoying. But, a small reputation loss over time wouldn\u0027t be terrible, there should be a few things to deter you from warping willy-nilly.\u003C/p\u003E\u003Cp\u003EI also think a month might be to small a period- ok for programs focused on Kerbin\u0027s SOI, but go interplanetary, your shortest trip takes several months (kerbin time). I think at minimum, it should be 100 days, or even a (kerbin) year)\u003C/p\u003E\u003Cp\u003EHere is another concept for time based funding I wrote up a while ago.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/entries/3444-An-aproach-to-Time-based-funding\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/entries/3444-An-aproach-to-Time-based-funding\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"TothAval","CreatedById":142030,"CreatedDateTime":"2015-05-05T15:52:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tw1\u0022 data-cite=\u0022Tw1\u0022\u003E\u003Cdiv\u003EI also would like to see a mode with time based payment- it would give you a lot more freedom to take the space program where you\u0027d like, rather than needing to follow the direction set by contracts. This way, some of the contracts could be made redundant- like the explore contracts. \u003Cp\u003EI\u0027m not convinced linking funds directly to reputation is the best approach- sometimes you will want to warp for a while, and having to grind to regain reputation would be annoying. But, a small reputation loss over time wouldn\u0027t be terrible, there should be a few things to deter you from warping willy-nilly.\u003C/p\u003E\u003Cp\u003EI also think a month might be to small a period- ok for programs focused on Kerbin\u0027s SOI, but go interplanetary, your shortest trip takes several months (kerbin time). I think at minimum, it should be 100 days, or even a (kerbin) year)\u003C/p\u003E\u003Cp\u003EHere is another concept for time based funding I wrote up a while ago.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/entries/3444-An-aproach-to-Time-based-funding\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/entries/3444-An-aproach-to-Time-based-funding\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Enice article. seems like we\u0027re on the same site here \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003Eregarding the reputation loss. it\u0027s simply that an agency doing absolutely nothing will be forgotten someday. reputation loss should only occur when 0 flights(or less then 3 or whatever) are in progress. in my opinion having the three main ressources building up over time as well as contracts to boost the program faster and further is the best solution, with some less profits or even losses due to player failures or what ever.\u003C/p\u003E\u003Cp\u003Ei wouldn\u0027t even mind buying fuel over the administration building and store this fuel in a upgradeable storage facility, as long as i have the feeling to really run this agency, backed or hated by kerbalkind an its governments \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"}]}