{"TopicId":107011,"ForumId":20,"TopicTitle":"Procedural Science Contracts","CreatedByName":"zeekkay","CreatedById":142791,"CreatedDateTime":"2015-05-02T23:21:02Z","PageNum":1,"Articles":[{"CreatedByName":"zeekkay","CreatedById":142791,"CreatedDateTime":"2015-05-02T23:21:02Z","Content":"\n\u003Cp\u003EThis is probably insanely difficult, but it would make for a killer mod. I don\u0027t expect anyone to actually make this, it\u0027s more just an idea I wanted to unload.\u003C/p\u003E\u003Cp\u003EThe purpose behind this mod is to make the contracts a bit more varied and life-like. Real space programs work\u003C/p\u003E\u003Cp\u003Eclosely with other research programs to study the earth, the sun, and everything else.\u003C/p\u003E\u003Cp\u003EInstead of using science tools available from the tech tree/parts, the science tools are created procedurally and made available to you only while that contract is open.\u003C/p\u003E\u003Cp\u003EThe parts can take on one of dozens of shapes, with some fitting in a 1.25m service bay, others needing the 2.5m service bay, and some might even take unusual\u003C/p\u003E\u003Cp\u003Eshapes and require farings!\u003C/p\u003E\u003Cp\u003EIn extreme cases, the payload could be bulky, up to ten metric tons or in endgame even more! =D\u003C/p\u003E\u003Cp\u003EAnother idea might involve science modules in space in order to complete the contract. (Longitudinal Study)\u003C/p\u003E\u003Cp\u003EContracts should be issued based on what the user has available to them. No landing missions when mono-propellant isn\u0027t available and the user only has a tier 1 launch pad.\u003C/p\u003E\u003Cp\u003ENo unusual shapes of wide diameters until the user has the proper fairings for them.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-02T23:26:18Z\u0022 title=\u002205/02/2015 11:26  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 2, 2015\u003C/time\u003E by zeekkay\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Scientist","CreatedById":129760,"CreatedDateTime":"2015-05-03T00:09:39Z","Content":"\n\u003Cp\u003Eyou can make parts and set to an unobtainable tech tree node, say \u0022proprietry\u0022, and set the cfg file with moduletest whatever name was, itll give you parts that you cannot obtain in R\u0026amp;D, and no need to really make new contracts, just specify where the part can be tested in the module, you have access to the part until the contract is over, usually days\u003C/p\u003E\n"}]}