{"TopicId":107113,"ForumId":20,"TopicTitle":"Crew Events","CreatedByName":"Aanker","CreatedById":70274,"CreatedDateTime":"2015-05-03T08:15:06Z","PageNum":1,"Articles":[{"CreatedByName":"Aanker","CreatedById":70274,"CreatedDateTime":"2015-05-03T08:15:06Z","Content":"\n\u003Cp\u003EImagine your three Kerbals are on a 400 day mission to some distant planetary body. They have been locked up in a single crew capsule for what they perceive as an eternity. Tensions are running high between the crew - Shelby Kerman is turning increasingly aggressive, and mission control is starting to suspect an underlying mental instability. Brandon Kerman is barely managing to keep him in control, as the most influential and charismatic member of the crew. Jennifer Kerman is stable, having been on multiple longer missions before.\u003C/p\u003E\u003Cp\u003EThen one day, someone eats Shelby\u0027s ration of snacks. The player is thrust into a multi-choice dilemma on how to solve the unfolding psychological crisis. Since communications have been upgraded over the last couple of missions, the best brain shrinks Kerbin could offer have been sent to the KSP to ensure a favorable outcome no matter how the situation is addressed. But multiple factors must come together to ensure a safe outcome - will Brandon\u0027s leadership hold? Was Jennifer careless enough to eat the snacks - and if so, will her guilt be revealed? Is Shelby too unpredictable?\u003C/p\u003E\u003Cp\u003EThe player decides to pursue a non-confrontative path. But Shelby was clearly beyond the point of reason way before the incident. The signs were there - increasingly negative log entries (low morale), sporadic outbursts (short info popups) and the underlying knowledge that his crew compatibility was low...\u003C/p\u003E\u003Cp\u003EShelby\u0027s kerbal icon turns yellow. His skills and knowledge will no longer contribute to the mission - that is fine, as both Brandon and Jennifer were more experienced and competent. But if anything goes further wrong, it might turn orange. Or dreadfully red. And who knows what will happen then?\u003C/p\u003E\u003Cp\u003E***\u003C/p\u003E\u003Cp\u003EDrama aside, I\u0027ve always felt that the Kerbals should be of greater importance to the Kerbal Space Program. Crew skills already did some to accomplish this, but we haven\u0027t really delved down into the personalities and possible \u0027RPG\u0027 elements too much. Now, I know some people aren\u0027t terribly interested in becoming too attached to their Kerbals, or watching them go into a psychotic rage that results in the death of some other crew member, but that is why I\u0027d like to pitch this as a mod idea. I also think it could have some relevance to \u0027fun realism\u0027: we get to actively control the situation, the events should be simple and lenient enough to allow recovery at several points, and at the same time we are faced with one of the major challenges of spaceflight - how to keep a crew sane through months or even years of living in a tincan. \u003C/p\u003E\u003Cp\u003EThe exact approach could vary. But I would like to see something like this. It might even be worth it to learn some KSP modding techniques to get it done - depending on the complexity involved, of course \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-03T08:17:07Z\u0022 title=\u002205/03/2015 08:17  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 3, 2015\u003C/time\u003E by Aanker\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"BlackHat","CreatedById":138278,"CreatedDateTime":"2015-05-03T09:12:01Z","Content":"\n\u003Cp\u003ECheckout: Kerbal Feels Mod\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/114096-WIP-0-90-KerbalFeels-0-0-1-plugin-for-inter-kerbal-relationships-%283-26-2015%29\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/114096-WIP-0-90-KerbalFeels-0-0-1-plugin-for-inter-kerbal-relationships-%283-26-2015%29\u003C/a\u003E\u003C/p\u003E\n"}]}