{"TopicId":107288,"ForumId":16,"TopicTitle":"How to fix bug with electricity generation?","CreatedByName":"Steal823","CreatedById":142944,"CreatedDateTime":"2015-05-03T21:19:55Z","PageNum":1,"Articles":[{"CreatedByName":"Steal823","CreatedById":142944,"CreatedDateTime":"2015-05-03T21:19:55Z","Content":"\n\u003Cp\u003EI have a spaceplane that uses the giant solar panels to create electricity for the ore to fuel converter, but for some reason it only generates 5% of the electricity it should. According to the panel itself, it has a energy flow of 16, but my total electricity levels are going up by 0.8. The panels were extended from an open cargo bay but after testing it is still affect by the bug where even they are placed. This seems to affect all other electricity sources, but at different rates (10% for RTG, 20% for OX-STAT). I built a small test craft on the launch pad that generated at the right speeds, but even trying to launch the spaceplane from the launch pad instead of the runway still gives it the bugged electricity generation. \u003C/p\u003E\u003Cp\u003EHas anyone else had this problem or knows a solution?\u003C/p\u003E\n"},{"CreatedByName":"impyre","CreatedById":116031,"CreatedDateTime":"2015-05-04T04:59:26Z","Content":"\n\u003Cp\u003EIt\u0027s hard to tell what you\u0027re asking about here... your statements are a little confusing. I created some test vessels on the runway and had no issues. All panels were operating nominally. That being said, \u0022nominal\u0022 operation and \u0022rated\u0022 operation are two different things. Ratings give \u0022ideal\u0022 values, which will be off the mark... more or less depending on your situation. Partial occlusion may be a thing now. Panel output varies with distance to sun, and heat buildup also decreases their effectiveness. In my test rig, as panel temperature approached 500, I was only getting about 80% of nominal output (vs a panel in the same situation with the same exposure at sea level temps of around 300). And since nominal output was only about 87.5% of rated output, then output at tested heat level was around 70% of rated output. That said, the ore converter generates quite a bit of heat... it\u0027s possible that the heat is decreasing your power generating capability. \u0022my total electricity levels are going up by 0.8\u0022... well, that could be perfectly normal... it depends on your energy balance... how much electricity you\u0027re using versus how much you\u0027re generating. If you\u0027re using the converter to refine ore into LFO, I\u0027d highly recommend supplementing solar panels with fuel cell arrays.\u003C/p\u003E\u003Cp\u003EEDIT: Also don\u0027t forget to consider all potential uses of electricity, like reaction wheels, probe cores, lights (even landing gear lights), and possibly other parts if you have mods which introduce electricity dependent parts.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-04T05:03:57Z\u0022 title=\u002205/04/2015 05:03  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 4, 2015\u003C/time\u003E by impyre\u003C/strong\u003E\n\u003C/span\u003E\n"}]}