{"TopicId":107263,"ForumId":16,"TopicTitle":"Ship keeps shaking","CreatedByName":"MrMisu","CreatedById":121366,"CreatedDateTime":"2015-05-03T19:59:47Z","PageNum":1,"Articles":[{"CreatedByName":"MrMisu","CreatedById":121366,"CreatedDateTime":"2015-05-03T19:59:47Z","Content":"Hello guys,\n\nI\u0027ve ran into something strange and I\u0027m not sure if this is a bug or a feature ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif). \n\nTrying to build a rocket that can carry a drone to Laythe, but the rocket keeps shaking it\u0027s self (almost) apart - really bad control, after barely making it to a suborbital trajectory, I\u0027ve deployed the fairing to take a look inside: engine of, both RC-001S remote unit and CH-j3 nose cone are off, all control surfaces on the plane are off.\n\nBasically any control unit I activate in the lower part of the ship the thing starts to shake. Any ideas on how I can fix this? \n\nPicture:\n\n![EYpwXJo.gif](http://i.imgur.com/EYpwXJo.gif)"},{"CreatedByName":"Gaarst","CreatedById":126740,"CreatedDateTime":"2015-05-03T20:26:34Z","Content":"This is a known issue when using SAS on any other setting than stability assist, with larger crafts.\n\nBest solution is to set SAS on stability assist and orient the ship yourself."},{"CreatedByName":"MrCynical","CreatedById":116703,"CreatedDateTime":"2015-05-03T22:31:18Z","Content":"Unfortunately the SAS system is bugged and horribly overcompensates on anything other than the stability assist setting. Larger craft will actually drift away from the target trajectory and even get shaken to pieces. Plus it burns through monopropellant at a huge speed achieving nothing."},{"CreatedByName":"adinfinitum","CreatedById":49226,"CreatedDateTime":"2015-05-03T23:15:45Z","Content":"It might also be worth checking if any parts are clipped into each other a little bit. I\u0027ve had goo canisters inside service bays where the ship shakes if the door\u0027s closed, doesn\u0027t shake if the door is open. It might be able to happen with other parts, I\u0027m not sure though."},{"CreatedByName":"FancyMouse","CreatedById":142946,"CreatedDateTime":"2015-05-03T23:23:12Z","Content":"turning off RCS and gimbal (effectively lower the power that SAS can use) can alleviate a little bit, at a cost of slower turns (hopefully you don\u0027t solely rely on RCS/gimbal for SAS functionality)... but you may just want to control yourself."},{"CreatedByName":"MrMisu","CreatedById":121366,"CreatedDateTime":"2015-05-04T21:44:45Z","Content":"Thank you guys for the answers, it seems like a bug in the SAS that makes the ship resonate, I\u0027m using sas with stability assist and it works...."},{"CreatedByName":"A_name","CreatedById":134040,"CreatedDateTime":"2015-05-05T16:16:57Z","Content":"Issue not limited to large crafts either. This happens to me when I\u0027m flying a single capsule on reentry and I put SAS on retrograde mode.\n\nEdit:\n\nAlso, OP\u0027s rocket isn\u0027t something I\u0027d consider \u0022big\u0022 under my standards. More like on the verge between small and medium, on a scale of small-medium-large-huge."}]}