{"TopicId":107311,"ForumId":16,"TopicTitle":"Contract Progression Question","CreatedByName":"CloudlessEchoes","CreatedById":142599,"CreatedDateTime":"2015-05-03T23:29:09Z","PageNum":1,"Articles":[{"CreatedByName":"CloudlessEchoes","CreatedById":142599,"CreatedDateTime":"2015-05-03T23:29:09Z","Content":"\n\u003Cp\u003EHello,\u003C/p\u003E\u003Cp\u003EDo contracts in 1.0 still make it so you might miss some? For instance, I\u0027m doing a normal career game, and I\u0027ve never gotten a contract to explore the Mun. Is this because I might have done some Mun exploring before the contract came up? I think I got an orbit or flyby contract first and did that.\u003C/p\u003E\u003Cp\u003ERight now I have a Minmus flyby contract. If I made a probe and orbited it instead, will it preclude me getting an \u0022explore Minmus\u0022 contract? I\u0027d like to be able to do them all!\u003C/p\u003E\n"},{"CreatedByName":"ghpstage","CreatedById":129622,"CreatedDateTime":"2015-05-03T23:52:28Z","Content":"\n\u003Cp\u003EThe old Explore Mun contract seems to no longer exist, having been replaced by partial contracts of flyby, orbit, return from flyby and landing. I suspect the same is true of Minmus, but I have seen the old Explore Duna contract so perhaps it only applies in the Kerbin SOI.\u003C/p\u003E\u003Cp\u003EThere are a lot more of this type of contract now, and while you can\u0027t really miss most of the old altitude record type ones (the 2500m/s record is an exception that keeps vanishing without completion for me) theres a lot more to miss and the mission control seems very unpredictable in which contracts it hands out when.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-04T01:46:46Z\u0022 title=\u002205/04/2015 01:46  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 4, 2015\u003C/time\u003E by ghpstage\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Anquietas314","CreatedById":8761,"CreatedDateTime":"2015-05-04T01:47:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ghpstage\u0022 data-cite=\u0022ghpstage\u0022\u003E\u003Cdiv\u003EThe old Explore Mun contract seems to no longer exist\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOn my save I get both sets of contracts, although the partial ones are by far the most lucrative, even for Mun and Minmus.\u003C/p\u003E\n"},{"CreatedByName":"ghpstage","CreatedById":129622,"CreatedDateTime":"2015-05-04T01:49:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022armagheddonsgw\u0022 data-cite=\u0022armagheddonsgw\u0022\u003E\u003Cdiv\u003EOn my save I get both sets of contracts, although the partial ones are by far the most lucrative, even for Mun and Minmus.\u003C/div\u003E\u003C/blockquote\u003EInteresting. Any idea how to get the old ones to appear? I\u0027ve yet to see any but it may be because i\u0027ve moved forward as quickly as I could.\n"},{"CreatedByName":"Anquietas314","CreatedById":8761,"CreatedDateTime":"2015-05-04T02:14:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ghpstage\u0022 data-cite=\u0022ghpstage\u0022\u003E\u003Cdiv\u003EInteresting. Any idea how to get the old ones to appear? I\u0027ve yet to see any but it may be because i\u0027ve moved forward as quickly as I could.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs far as I can tell you just need to do the world first contracts in the right order without accidentally sending things into Mun or Minmus\u0027s SOI too early and similar. I don\u0027t know the specifics though.\u003C/p\u003E\n"},{"CreatedByName":"Arsonide","CreatedById":32604,"CreatedDateTime":"2015-05-04T04:24:20Z","Content":"\n\u003Cp\u003EThe Explore contracts are still present, but there are more contracts for the pool to choose from now, with world firsts, tourism, and grand tours. That means they have a slightly lower chance to appear now. It has always been random. The Explore contracts can also skip planets.\u003C/p\u003E\u003Cp\u003EThe partial World First contracts pay the same amounts (they have 25% of the objectives, and 25% of the rewards). They never skip planets. They can also theoretically be chained by one vessel more than four times, so indeed they are more lucrative. There are also hundreds of them, they require less time invested, and they are easily layered on other missions, so missing them is less of a problem.\u003C/p\u003E\n"},{"CreatedByName":"RebelCid","CreatedById":142513,"CreatedDateTime":"2015-05-04T05:19:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ghpstage\u0022 data-cite=\u0022ghpstage\u0022\u003E\u003Cdiv\u003E There are a lot more of this type of contract now, and while you can\u0027t really miss most of the old altitude record type ones (the 2500m/s record is an exception that keeps vanishing without completion for me) theres a lot more to miss and the mission control seems very unpredictable in which contracts it hands out when.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI thought that reputation plays a large role in the assigning of contracts? Example: Higher rep = higher variety and harder and more lucrative contracts and lower rep = easier and less lucrative contracts?\u003C/p\u003E\n"},{"CreatedByName":"Anquietas314","CreatedById":8761,"CreatedDateTime":"2015-05-04T14:56:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Arsonide\u0022 data-cite=\u0022Arsonide\u0022\u003E\u003Cdiv\u003EThe partial World First contracts pay the same amounts (they have 25% of the objectives, and 25% of the rewards).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn that case, I think there\u0027s something you should have a look at... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/Kemtcbn.png\u0022 alt=\u0022Kemtcbn.png\u0022\u003E\u003Cp\u003EThis was just the easiest way to get them on the same screenshot. They show the same values in the stock contracts screen\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003EWhen I said they were more lucrative I meant in terms of just raw rewards, not chaining etc. I saw similar results with the Mun and Minmus contracts. This is on the \u0022moderate\u0022 settings for career mode.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-04T15:01:23Z\u0022 title=\u002205/04/2015 03:01  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 4, 2015\u003C/time\u003E by armagheddonsgw\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MrCynical","CreatedById":116703,"CreatedDateTime":"2015-05-04T15:24:56Z","Content":"\n\u003Cp\u003EThe \u0022explore minmus\u0022 contract seems to be missing. The flyby, orbit etc contracts show up, but the old style explore contract never shows up in my game. The old explore contracts show up for all other celestial bodies, but it jumps straight from the explore mun contract to the explore Duna and Ike ones.\u003C/p\u003E\n"},{"CreatedByName":"Arsonide","CreatedById":32604,"CreatedDateTime":"2015-05-04T15:44:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022armagheddonsgw\u0022 data-cite=\u0022armagheddonsgw\u0022\u003E\u003Cdiv\u003EIn that case, I think there\u0027s something you should have a look at... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Ca href=\u0022http://i.imgur.com/Kemtcbn.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/Kemtcbn.png\u003C/a\u003E\u003Cp\u003EThis was just the easiest way to get them on the same screenshot. They show the same values in the stock contracts screen\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003EWhen I said they were more lucrative I meant in terms of just raw rewards, not chaining etc. I saw similar results with the Mun and Minmus contracts. This is on the \u0022moderate\u0022 settings for career mode.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOn average, they are 25% of the Explores, it varies with objective.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MrCynical\u0022 data-cite=\u0022MrCynical\u0022\u003E\u003Cdiv\u003EThe \u0022explore minmus\u0022 contract seems to be missing. The flyby, orbit etc contracts show up, but the old style explore contract never shows up in my game. The old explore contracts show up for all other celestial bodies, but it jumps straight from the explore mun contract to the explore Duna and Ike ones.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt is there, it\u0027s just random. There\u0027s no guarantee that it will appear.\u003C/p\u003E\n"},{"CreatedByName":"Anquietas314","CreatedById":8761,"CreatedDateTime":"2015-05-04T15:59:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Arsonide\u0022 data-cite=\u0022Arsonide\u0022\u003E\u003Cdiv\u003EOn average, they are 25% of the Explores, it varies with objective.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EErr, no... they\u0027re all pretty much about the same payout ratios as those in the screenshot in my experience. Certainly for Mun/Minmus, and Pol seems to fit the same pattern (flag POLe bug \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E)\u003C/p\u003E\n"},{"CreatedByName":"MrCynical","CreatedById":116703,"CreatedDateTime":"2015-05-04T16:09:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Arsonide\u0022 data-cite=\u0022Arsonide\u0022\u003E\u003Cdiv\u003EIt is there, it\u0027s just random. There\u0027s no guarantee that it will appear. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot convinced by that explanation. In every career game I\u0027ve played in this and previous versions the explore contracts have appeared for every single body in a relatively logical progression, and once they\u0027re on the list they never expire. Minmus in 1.0 is the first one that\u0027s just not shown up, even with me sitting there waiting for it. Given there are other threads reporting this - and its always the Minmus contract that\u0027s reported as missing not any other body - I think there\u0027s something off with that specific contract.\u003C/p\u003E\n"},{"CreatedByName":"Aviara","CreatedById":143060,"CreatedDateTime":"2015-05-04T21:49:48Z","Content":"\n\u003Cp\u003EI started two new games since 1.02 and in both it seems that after World\u0027s First \u0022Orbit Kerbin\u0022 I\u0027m not getting \u0022Fly-By the Mun\u0022, which I got on my other save I started with 1.0! On my seconds save after 1.02 on the other hand I do get a \u0022Ferry tourists\u0022 mission from World\u0027s First. Are World\u0027s First random now or is it a bug or is there something else I\u0027m missing??\u003C/p\u003E\n"},{"CreatedByName":"Kelderek","CreatedById":131312,"CreatedDateTime":"2015-05-04T22:49:54Z","Content":"\n\u003Cp\u003EI think the \u0022explore\u0022 contracts should be automatically enabled as soon as you enter the SOI of the associated body. The career should start with no explore contracts at all until you achieve orbit, and then it should automatically show you \u0022Explore the Mun\u0022 and \u0022Explore Minmus\u0022 together. As soon as you leave Kerbin\u0027s SOI you should automatically get \u0022Explore Eve\u0022 and \u0022Explore Duna\u0022. Make it a small chance to also see either Duna or Eve contracts sometime after you visit Mun or Minmus, but before you leave Kerbin\u0027s SOI. If you arrive at a planet\u0027s SOI, then you should automatically get the explore contracts for all of its moons. Gradually add the outer planet explore contracts as you venture away from Kerbin.\u003C/p\u003E\u003Cp\u003EYou could still make it so there is a random chance to see the explore contract a little earlier, but arriving at the SOI should give it to you automatically as well as the contracts for all of its moons.\u003C/p\u003E\n"},{"CreatedByName":"Arsonide","CreatedById":32604,"CreatedDateTime":"2015-05-05T00:55:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MrCynical\u0022 data-cite=\u0022MrCynical\u0022\u003E\u003Cdiv\u003ENot convinced by that explanation. In every career game I\u0027ve played in this and previous versions the explore contracts have appeared for every single body in a relatively logical progression, and once they\u0027re on the list they never expire. Minmus in 1.0 is the first one that\u0027s just not shown up, even with me sitting there waiting for it. Given there are other threads reporting this - and its always the Minmus contract that\u0027s reported as missing not any other body - I think there\u0027s something off with that specific contract.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHere is a more detailed explanation: the contract system picks randomly from the list of contracts it has available to it, including Explore contracts. The list of contracts available to the contract system have prerequisites before they can be added to this list, and those prerequisites can include progress milestones, technology research, or facility upgrades. As the player progresses through career, this list gets bigger, and therefore the chance of any particular contract type appearing gets smaller.\u003C/p\u003E\u003Cp\u003EExplores will not appear once you have visited a planet, and given that your average player spends quite a bit of time in the Kerbin system, they have a decent chance of visiting Minmus before its Explore contract pops up, especially if they have unlocked rescue contracts, tourism, base and station contracts, etc.\u003C/p\u003E\u003Cp\u003ESo to summarize, the chance for this to appear is equal to any other particular contract, unless you\u0027ve visited Minmus, in which case the chance is zero, but by the time you visit Minmus, you\u0027ve unlocked enough types of contracts to make this chance much lower, resulting in players perceiving that this chance is any lower than it is for other planets, when it is not. The reason this isn\u0027t a perceived issue for the Mun, is because the player will not unlock as many contract types before that has a chance to appear. It similarly isn\u0027t an issue for Duna, because the player will pause for a long time before going interplanetary, giving Duna a greater chance to appear in time even given the lower chance to appear.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-05T01:00:21Z\u0022 title=\u002205/05/2015 01:00  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 5, 2015\u003C/time\u003E by Arsonide\u003C/strong\u003E\n\u003C/span\u003E\n"}]}