{"TopicId":107368,"ForumId":16,"TopicTitle":"Is there a reason for the time warp limits at different altitudes?","CreatedByName":"THX1138","CreatedById":113955,"CreatedDateTime":"2015-05-04T07:20:51Z","PageNum":1,"Articles":[{"CreatedByName":"THX1138","CreatedById":113955,"CreatedDateTime":"2015-05-04T07:20:51Z","Content":"Is there a reason for the time warp limits at different altitudes? Switching craft isn\u0027t an option because I need the ore overlay."},{"CreatedByName":"Blu_C","CreatedById":39941,"CreatedDateTime":"2015-05-04T07:44:41Z","Content":"Yes.\n\nThe main reason is that time warp isn\u0027t actually simulating anything, it is just jumping ahead in time. Normally this is fine when it comes to objects that aren\u0027t simulating the physics (which is why when you time warp even your controlled craft is put on rails). However there is a problem: Since you are just skipping time and not actually simulating anything there can be very weird effects.\n\nYou can actually see the effects of this if you like! Get a craft in a very high parabolic orbit over Kerbin - at least out to Minimus, almost escape velocity would be even better. Then lower the periapsis to inside the atmosphere and engage time warp to maximum. Normally as you get close to a planet time warp is auto-throttled back to avoid these physics problems, however if you are at max timewarp it is completely possible to skip enough time that you completely fly past those thresholds in the jump forward (especially if you are moving quickly). Now since you have a periapsis inside the atmosphere you might expect your orbit to change, but time warp puts you on rails, so nothing will happen as you \u0022jump\u0022 through the atmosphere during the time skip.\n\nMove fast enough at a high enough time warp and you can actually time warp THROUGH the center of a planet without exploding, as your craft never actually ends up where the planet is, simply appearing on the other side after the time jump.\n\nThere also used to be effects you could see when changing SOI between bodies, and going through a SOI change at high time warp could really mess up your projected orbit (even to the point of screwing up a planed manuver), however they were supposed to have fixed that during the 1.0 release (I haven\u0027t actually tested so I don\u0027t know).\n\n**Edited \u003Ctime datetime=\u00222015-05-04T07:47:59Z\u0022 title=\u002205/04/2015 07:47  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 4, 2015\u003C/time\u003E by Blu\\_C**"},{"CreatedByName":"Boonestorm","CreatedById":89875,"CreatedDateTime":"2015-05-04T08:18:02Z","Content":"Great answer. 2 things to add:\n\n1. The SOI change actually works because the program automatically throttles back the timewarp to 50x before the change, so its more of a workaround than a fix, the underlying problem persists (and can\u0027t really be fixed).\n\n2. If you are waiting for a transfer window at low orbit, you can always go back to the space center, where you can always have maximum timewarp. Just warp to the correct time for the transfer (you can e.g. use Kerbal Alarm Clock for that [http://forum.kerbalspaceprogram.com/threads/24786-1-0-Kerbal-Alarm-Clock-v3-3-0-1-(Apr-28)](https://forum.kerbalspaceprogram.com/threads/24786-1-0-Kerbal-Alarm-Clock-v3-3-0-1-%28Apr-28%29)) and resume steering the capsule.\n\nCheers,\n\nBoone."},{"CreatedByName":"Crzyrndm","CreatedById":92871,"CreatedDateTime":"2015-05-04T08:45:44Z","Content":"\u003E \n\u003E 1. The SOI change actually works because the program automatically throttles back the timewarp to 50x before the change, so its more of a workaround than a fix, the underlying problem persists (and can\u0027t really be fixed).\n\nActually, if you read back through the devnotes a bit, Harvester apparently did fix the root cause of the SOI bug (when it detects an SOI shift, it backtracks to find the exact crossover point to create the new orbital parameters from). The warp throttling was added to 1.0 as well, but shouldn\u0027t actually be required."},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2015-05-04T09:33:42Z","Content":"Incidentally, if you come out of timewarp at just the right moment, it\u0027s possible to make your craft appear deep inside Kerbin\u0027s atmosphere while still at well above escape velocity.\n\nBoom."},{"CreatedByName":"Jaeleth","CreatedById":136435,"CreatedDateTime":"2015-05-04T10:13:05Z","Content":"There us no point in this unless the craft is inside atmosphere... Actually, it is quite an annoying feature. If you want to run max warp just go to space center, tracking station and choose to not fly ANY spacecraft, in this case you can run all the simulation at max warp, choose to fly one of them, and you can run only a altitude limited warp... Makes no sense... Unless a craft\u0027s trajectory passes through atmosphere, this should be fixed, since is quite a time waste to go to space center and then to tracking station in order to get a proper time warp speed, particularly because changing screens in ksp UI is not that fast..."},{"CreatedByName":"nablabla","CreatedById":96245,"CreatedDateTime":"2015-07-09T20:55:21Z","Content":"indeed I think they sould come up with a better solution, what is so difficult about computing the atmosphere intersect? It accurately computes SOI-intersects so it should be possible for the game to throttle the warp if and only if it the craft is entering an athmosphere and throttle it back accordingly. I wonder why there is no mod yet, which does that ![:confused:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif)\n\nAlso ther could be something like a descent time warp: Like enable 20x warp without physics but with athmospheric drag, or physics but no throtteling/control allowed.\n\nI use the BetterTimeWarp mod to do that on my own risk, and for aerobreaking its okay ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif) timesaver\n\n**Edited \u003Ctime datetime=\u00222015-07-09T20:58:11Z\u0022 title=\u002207/09/2015 08:58  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 9, 2015\u003C/time\u003E by nablabla**"}]}