{"TopicId":107415,"ForumId":16,"TopicTitle":"Career-Question: How do i orbit one tourist around Kerbin?","CreatedByName":"OldNugget","CreatedById":143014,"CreatedDateTime":"2015-05-04T12:46:09Z","PageNum":1,"Articles":[{"CreatedByName":"OldNugget","CreatedById":143014,"CreatedDateTime":"2015-05-04T12:46:09Z","Content":"\n\u003Cp\u003EHi everyone,\u003C/p\u003E\u003Cp\u003Ei am a newbie, started a new career, and have so far unlocked all tier 4 research (the one with aviation and advanced rocketry), and upgraded my base in order to create maneuver points. I have succesfully orbited Kerbin with just one pilot, but i am running very low on cash so i accepted a mission to orbit a tourist around Kerbin. I have tried to launch him with my \u0027normal\u0027 orbit-ship, but i can\u0027t fly it without SAS. So i need to design a rocket with 2 command pods. I have tried this now for the last 3 hours, but always failed miserably. So how should my spacecraft look like? Any help is highly appreciated.\u003C/p\u003E\u003Cp\u003Efurthermore i was not able to launch an aircraft - my jetengine does not start at all... i have connected it with a liquid fuel tank and air intake, but nothing happens:(\u003C/p\u003E\n"},{"CreatedByName":"miceliux","CreatedById":72239,"CreatedDateTime":"2015-05-04T12:59:36Z","Content":"\n\u003Cp\u003EHello,\u003C/p\u003E\u003Cp\u003EI just stack one pod over the other. Then, in the VAB assign a pilot to one seat and the tourist to the other.\u003C/p\u003E\n"},{"CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2015-05-04T13:06:35Z","Content":"\n\u003Cp\u003EUse OCTO or HEX, or whatever is first in the tech tree as a probe with SAS. I clip it into the bottom of the capsule and treat it as if I put an additional computer system inside as there\u0027s plenty of space when in IVA view.\u003C/p\u003E\n"},{"CreatedByName":"Wesreidau","CreatedById":75430,"CreatedDateTime":"2015-05-04T14:20:33Z","Content":"\n\u003Cp\u003EI interpret \u0022cannot fly without SAS\u0022 to mean \u0022cannot fly without control\u0022, which a tourist doesn\u0027t provide. SAS is different and mostly serves to stabilize your ship\u0027s heading, that is, pointing where you want to go instead of constantly drifting off to one side or the other. The Stayputnik can be used if you\u0027re willing to take control. I won\u0027t pretend this will be easy to fly into orbit, but it does make for good practice. And if you mean \u0022I can\u0027t fly without SAS\u0022 literally, well, \u003Cem\u003Eback in my day...\u003C/em\u003E\u003C/p\u003E\n"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-05-04T15:22:33Z","Content":"\n\u003Cp\u003EAlternative :\u003C/p\u003E\u003Cp\u003E- Stack 4 command pods \u003C/p\u003E\u003Cp\u003E- Build a rocket to make every thing to orbit\u003C/p\u003E\u003Cp\u003Ego to missions\u003C/p\u003E\u003Cp\u003E- Select rescue kerbonauts (one or 2 depending of seats)\u003C/p\u003E\u003Cp\u003E- Select orbiting tournism missions (on or 2)\u003C/p\u003E\u003Cp\u003EIn VAB, add tourist, keep rescue seat clear, add un experienced pilot (he\u0027ll get bas level 1)\u003C/p\u003E\u003Cp\u003ELaunch, rendez-vous with stranded ships. get money.\u003C/p\u003E\u003Cp\u003EImproovement : unlock hitchhicker\u0027s can (lighter) an fit a prob core (when no pilots need 2 XP).\u003C/p\u003E\n"},{"CreatedByName":"imperialus","CreatedById":102038,"CreatedDateTime":"2015-05-04T15:39:26Z","Content":"\n\u003Cp\u003EI\u0027ll post a picture of it when I get home but I built a rocket I called \u0022The Tourist Trap\u0022 It\u0027s got a mk2 inline cockpit, a Mk1 command pod an octo probe, and a pair of batteries. I can cram two tourists into it and still fly with SAS.\u003C/p\u003E\n"},{"CreatedByName":"Skorpychan","CreatedById":72052,"CreatedDateTime":"2015-05-04T16:15:24Z","Content":"\n\u003Cp\u003EI just designed a cheap but basic design with a couple of inline cockpits for tourists, and a mk1 capsule for Jeb to ride in. Simple and effective.\u003C/p\u003E\n"},{"CreatedByName":"adinfinitum","CreatedById":49226,"CreatedDateTime":"2015-05-04T16:28:11Z","Content":"\n\u003Cp\u003ELike what these guys are saying, a mk1 pod, with a couple inline cockpits below it works pretty well for tourist contracts\u003C/p\u003E\n"},{"CreatedByName":"EricT43","CreatedById":142226,"CreatedDateTime":"2015-05-04T18:09:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022adinfinitum\u0022 data-cite=\u0022adinfinitum\u0022\u003E\u003Cdiv\u003ELike what these guys are saying, a mk1 pod, with a couple inline cockpits below it works pretty well for tourist contracts\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u002B1\u003C/p\u003E\u003Cp\u003EFor two passengers (Mk1 plus two inline cockpits), I added a couple of extra heat shields on the bottom to shift the CoG below the midpoint. Otherwise it will flip over and burn up on descent.\u003C/p\u003E\n"}]}