{"TopicId":107443,"ForumId":16,"TopicTitle":"Fairings","CreatedByName":"-RanZ-","CreatedById":51892,"CreatedDateTime":"2015-05-04T15:30:37Z","PageNum":1,"Articles":[{"CreatedByName":"-RanZ-","CreatedById":51892,"CreatedDateTime":"2015-05-04T15:30:37Z","Content":"\n\u003Cp\u003EI seen a thread last week that said vehicle mass does not go down when fairings are ejected... has that been fixed? When you eject the fairings does the weight go with them? I tried searching for the thread but I could not find it.\u003C/p\u003E\n"},{"CreatedByName":"Rokmonkey","CreatedById":9319,"CreatedDateTime":"2015-05-04T15:32:46Z","Content":"\n\u003Cp\u003EYes, the mass goes down when ejecting fairings now. I\u0027ve watched the mass vanish in Kerbal Engineer myself when ejecting.\u003C/p\u003E\n"},{"CreatedByName":"FlipNascar","CreatedById":137605,"CreatedDateTime":"2015-05-04T15:33:38Z","Content":"\n\u003Cp\u003EOr you can test them yourself... And now for a more helpful answer: Yes. When you deploy the fairings your vessel\u0027s weight will go down. And thus, your delta-V will increase.\u003C/p\u003E\u003Cp\u003EEdit: /Ninja\u0027d\u003C/p\u003E\n"},{"CreatedByName":"-RanZ-","CreatedById":51892,"CreatedDateTime":"2015-05-04T15:35:48Z","Content":"\n\u003Cp\u003EI would and normally do test things test things myself but I am away for a couple days and was curious.\u003C/p\u003E\u003Cp\u003EDid they fix the fact that a 1.25m part could shield a 3.75m part from drag? I seen something in patch notes regarding occlusion so assuming they did\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-04T15:37:59Z\u0022 title=\u002205/04/2015 03:37  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 4, 2015\u003C/time\u003E by -RanZ-\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"severedsolo","CreatedById":80345,"CreatedDateTime":"2015-05-04T15:37:51Z","Content":"\n\u003Cp\u003EWhich leads to another question... at what height do the fairings stop helping? Or to put it another way, what\u0027s the best height to jettison your fairings?\u003C/p\u003E\u003Cp\u003EI tend to jettison just as my AP reaches it\u0027s target, but I know that isn\u0027t very efficient.\u003C/p\u003E\n"},{"CreatedByName":"Rokmonkey","CreatedById":9319,"CreatedDateTime":"2015-05-04T15:45:18Z","Content":"\n\u003Cp\u003EI eject my fairings in the 50km region. It depends on what my payload looks like, if there is some pointing things in there sticking out. eg. accidentally deployed solar panels, I wait until closer to 60km. This is subject to change if it\u0027s still in my main booster stage or the ascent stage. If it\u0027s the former, I don\u0027t bother too much, if it\u0027s the latter, I dump that fairing as soon as I feel brave enough.\u003C/p\u003E\n"},{"CreatedByName":"Juicy","CreatedById":142505,"CreatedDateTime":"2015-05-04T15:49:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022severedsolo\u0022 data-cite=\u0022severedsolo\u0022\u003E\u003Cdiv\u003EWhich leads to another question... at what height do the fairings stop helping? Or to put it another way, what\u0027s the best height to jettison your fairings?\u003Cp\u003EI tend to jettison just as my AP reaches it\u0027s target, but I know that isn\u0027t very efficient.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EShort answer: once you leave the atmosphere.\u003C/p\u003E\u003Cp\u003ELong answer: depending on whether the mass of the fairing is less than the drag caused by whatever it\u0027s covering, slightly below leaving the atmosphere, provided the contents of the faring do not overheat. Logically, it\u0027s also safer not to jettison farings while accellerating, since you might fly into the debris.\u003C/p\u003E\n"}]}