{"TopicId":107507,"ForumId":16,"TopicTitle":"Mk1 Pod Reentry","CreatedByName":"AletzN1","CreatedById":65154,"CreatedDateTime":"2015-05-04T20:30:21Z","PageNum":1,"Articles":[{"CreatedByName":"AletzN1","CreatedById":65154,"CreatedDateTime":"2015-05-04T20:30:21Z","Content":"\n\u003Cp\u003EBy some reason the Mk1 pod doesn\u0027t directly point towards the retrograde marker during reentry. It points towards the general direction.\u003C/p\u003E\u003Cp\u003EI know this is on purpose, but for what purpose?\u003C/p\u003E\n"},{"CreatedByName":"Randazzo","CreatedById":136468,"CreatedDateTime":"2015-05-04T20:33:05Z","Content":"\n\u003Cp\u003ECould be that drag is pulling it off heading slightly.\u003C/p\u003E\u003Cp\u003EIt\u0027s also possible that you are looking at \u0022Orbit mode\u0022 on your navball at altitudes where your relative surface velocity is what matters, but I thought that switched automatically. Your surface velocity heading can be different from orbital retrograde.\u003C/p\u003E\n"},{"CreatedByName":"AletzN1","CreatedById":65154,"CreatedDateTime":"2015-05-04T20:47:57Z","Content":"\n\u003Cp\u003EMaybe.\u003C/p\u003E\u003Cp\u003EI thought about that, but I clearly remember seeing the navball with surface mode.\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2015-05-04T21:47:42Z","Content":"\n\u003Cp\u003EThe pod (and attached things) will orient so the center of pressure is directly behind the center of mass along the line of velocity. This means that if the center of mass is offset sideways, you\u0027ll line up at an angle.\u003C/p\u003E\n"},{"CreatedByName":"rakutenshi","CreatedById":40086,"CreatedDateTime":"2015-05-04T21:50:20Z","Content":"\n\u003Cp\u003EI\u0027ve noticed the marker not always switching over to surface automatically when I\u0027d expect it to, that may be part of the issue, also if you\u0027ve added stuff to one side of the capsule and not in symmetry, that could do it too.\u003C/p\u003E\n"},{"CreatedByName":"Kelderek","CreatedById":131312,"CreatedDateTime":"2015-05-04T22:40:02Z","Content":"\n\u003Cp\u003EI\u0027ve found that for a very light weight vessel (like a simple command pod) the SAS doesn\u0027t do a good job of holding retrograde on re-entry. I\u0027m not sure why this happens, but I have better luck changing SAS to the stability control marker and manually aiming at retrograde on the navball - this holds it nice and steady.\u003C/p\u003E\n"},{"CreatedByName":"vonKerbin","CreatedById":68959,"CreatedDateTime":"2015-05-05T23:59:27Z","Content":"\n\u003Cp\u003EFor small capsule like the Mk1 (that\u0027s the \u0022Mercury,\u0022 right?) I don\u0027t even use SAS. The shape of the underside/shield on the capsule will naturally orient itself into the retrograde direction. (All assuming there isn\u0027t anything out of line of course.) \u003C/p\u003E\u003Cp\u003EDepending on when in the tech progression I am flying, I either have 1 parachute on the top, or a pair of radials. I have also run it with a heatshield before too. It stabilizes itself. I basically keep it on trajectory by either SAS or manual - until it starts heating. Then I just plain turn off SAS and take my hands off the keyboard. Oh ... has to be on 1x time though hehe.\u003C/p\u003E\n"},{"CreatedByName":"fjarandag","CreatedById":143217,"CreatedDateTime":"2015-05-06T10:11:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AletzN1\u0022 data-cite=\u0022AletzN1\u0022\u003E\u003Cdiv\u003EBy some reason the Mk1 pod doesn\u0027t directly point towards the retrograde marker during reentry. It points towards the general direction.\u003Cp\u003EI know this is on purpose, but for what purpose?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E1.0 . New aerodynamics, and (maybe) some wrinkles still to iron.\u003C/p\u003E\u003Cp\u003E#1 It is realistic that your vehicles will \u0022want\u0022 to flip over if your Center of Mass (CoM) is backwards. This happens both at lift-off and at reentry. Be sure to check the CoM at the VAB. Notice empty fuel tanks and experiments have lower density. Relocate items in rocket stack at will.\u003C/p\u003E\u003Cp\u003E#2 There was an issue in 1.0.0 with the PhysicsSignificance in HeatShield1.cfg which affects the flying attitude of returning capsules. It is corrected (so is other stuff) in 1.0.1.\u003C/p\u003E\u003Cp\u003E#3 Since we are talking about Mk1 pods. If you activate debug/physics/heat and look at the numbers, there seems to be some tendency for the convective heat flux to skyrocket if you are aiming at the wrong direction at the wrong time (too fast and not high enough, as if it was accounting for some gigantic angular drag and there were no protective shockwaves). Idk if that is fully realistic, but inestable pods will be prone to blow up from overheating, or conduct too much heat into sensitive neighbors (like probe cores). I had a few tourist ships doomed because of that.\u003C/p\u003E\n"},{"CreatedByName":"Poynting","CreatedById":103397,"CreatedDateTime":"2015-05-06T12:31:18Z","Content":"\n\u003Cp\u003EI noticed in 1.0.0 that rolling the capsule can alter the angle of attack of the heat shield. I believe this is entirely on purpose as it is used by the soyuz in real life. It is caused by intentionally offsetting the centre of mass from the physical centre of the capsule. It allows you to generate more or less lift just by rotating the capsule. Looked like the centre of mass was pushed towards the capsule door.\u003C/p\u003E\u003Cp\u003EI think this is a really cool feature but I can see why it would seem odd if you haven\u0027t thought about capsule generating lift. (lift allows you to shallow out your re-entry profile reducing heating)\u003C/p\u003E\n"}]}