{"TopicId":107657,"ForumId":20,"TopicTitle":"Mod for Integrating Kerbal Experience into Other Mods","CreatedByName":"arkie87","CreatedById":103434,"CreatedDateTime":"2015-05-05T15:18:14Z","PageNum":1,"Articles":[{"CreatedByName":"arkie87","CreatedById":103434,"CreatedDateTime":"2015-05-05T15:18:14Z","Content":"\n\u003Cp\u003ESo, AFAIK, Squad has said they arent interested in ever creating an autopilot. As such, it\u0027s obviously not possible that squad will ever incorporate such things into pilot experience.\u003C/p\u003E\u003Cp\u003EI was wondering if anyone thought of writing a mod to integrate it?\u003C/p\u003E\u003Cp\u003EFor instance: \u003C/p\u003E\u003Cp\u003ELevel 0 pilots have SAS stability\u003C/p\u003E\u003Cp\u003ELevel 1 can point at all 6 primary directions\u003C/p\u003E\u003Cp\u003ELevel 2 can point at AND execute maneuver nodes (using mechjeb)\u003C/p\u003E\u003Cp\u003ELevel 3 can execute ascents and orbital insertion (using MechJeb)\u003C/p\u003E\u003Cp\u003ELevel 4 can execute transfers (using MechJeb)\u003C/p\u003E\u003Cp\u003ELevel 5 can execute targeted landings and docking (using MechJeb)\u003C/p\u003E\u003Cp\u003EOr something of the sort?\u003C/p\u003E\u003Cp\u003EFurthermore, perhaps engineers, rather than gaining piloting skills, can gain access to information from MechJeb and/or use of Kerbal Attachment System (KAS), for instance:\u003C/p\u003E\u003Cp\u003ELevel 0 engineers can fix broken parts\u003C/p\u003E\u003Cp\u003ELevel 1 can use Kerbal Attachment System\u003C/p\u003E\u003Cp\u003ELevel 2 has access to transfer windows (using MechJeb) \u003C/p\u003E\u003Cp\u003ELevel 3 can see trajectory in flight (to make manual targeted landings easier)\u003C/p\u003E\u003Cp\u003ELevel 4 (need ideas?)\u003C/p\u003E\u003Cp\u003ELevel 5 (need ideas?)\u003C/p\u003E\u003Cp\u003EWhat do you guys think? Other ideas to make this mod better?\u003C/p\u003E\n"},{"CreatedByName":"hab136","CreatedById":75997,"CreatedDateTime":"2015-05-07T19:02:51Z","Content":"\n\u003Cp\u003EThis wouldn\u0027t be a standalone mod, but rather MechJeb and KAS would have to be modified.\u003C/p\u003E\u003Cp\u003EIn fact KAS has been partially replaced by \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/113111\u0022 rel=\u0022external nofollow\u0022\u003EKIS\u003C/a\u003E which does require Engineers (KAS will also be updated). \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/59545\u0022 rel=\u0022external nofollow\u0022\u003EEPL\u003C/a\u003E requires engineers and the level matters.\u003C/p\u003E\u003Cp\u003ESo basically.. if you can think of a way that a mod could be enhanced by checking Kerbal skills (or SAS availability), then petition that mod to do so. Or better yet contribute a patch. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}