{"TopicId":107695,"ForumId":32,"TopicTitle":"KSP 1.0 The best ksp yet","CreatedByName":"halbert5150","CreatedById":77092,"CreatedDateTime":"2015-05-05T18:15:25Z","PageNum":1,"Articles":[{"CreatedByName":"halbert5150","CreatedById":77092,"CreatedDateTime":"2015-05-05T18:15:25Z","Content":"I know theres alot of people who dont like the new update but Im not one of them. I LOVE it. I love the new challenges that the areo puts on designing and launching rockets, I love the re-entry heat (I have it cranked to 120%), I love the new resource system... I just don\u0027t find any of it lacking. I do think theres some balance issues with the rocket engines but I know that kind of stuff will be worked out by squad over time.\n\nSo thanks squad for the best KSP yet."},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-05-05T18:19:05Z","Content":"Still needs a bit of tweaking, but I completely agree. Best stock experience so far by a long shot."},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-05-05T18:22:29Z","Content":"Totally agreed."},{"CreatedByName":"sam.johnson841","CreatedById":104846,"CreatedDateTime":"2015-05-05T18:30:36Z","Content":"I suspect 90% of forum user agree but there is just that 10% who make themselves heard. \n\nI love it too, it will be even better with updated mods (as it has been for all versions)\n\n - Sam"},{"CreatedByName":"Linear","CreatedById":26619,"CreatedDateTime":"2015-05-05T18:36:50Z","Content":"\u003E \n\u003E I suspect 90% of forum user agree but there is just that 10% who make themselves heard. \n\u003E I love it too, it will be even better with updated mods (as it has been for all versions)\n\u003E \n\u003E  - Sam\n\nA lot of the people complaining about certain things (myself included) wholeheartedly agree that if these comparitavely small things are fixed, 1.0 will be a massive triumph. I expect this to occur around 1.1."},{"CreatedByName":"WhirlwindMonk","CreatedById":142384,"CreatedDateTime":"2015-05-05T18:39:06Z","Content":"I\u0027ll sign onto that claim as well. Definitely still room for improvement, but every time this game drags me back in with a new update, it\u0027s better than ever. I am really looking forward to getting far enough in my new career try out the new resource system."},{"CreatedByName":"r_rolo1","CreatedById":26192,"CreatedDateTime":"2015-05-05T18:48:25Z","Content":"Well, TBH I think that the OP is confusing two things: believing that 1.0.x is the best KSP so far in full experience angle has nothing to do directly wth believing that in some parts 1.0.x might be objectively worse than previous versions. As for a example, while my opinion is that 1.0 is by far the best KSP I ever played, IMHO the UI in 1.0.x is objectively worse than in 0.90, even if because there are more menus scattered around in nonsensical places and worse, intel that should be upfront and easy to reach is tucked into the dev toolbar, in the same standing that the cheats menu. And those beliefs are not contradictory ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)"},{"CreatedByName":"hawk_za","CreatedById":59433,"CreatedDateTime":"2015-05-05T18:59:09Z","Content":"I am in full agreement with the op \n\nman to have nose cone that do things and are not just dead weight is a great and grand thing"},{"CreatedByName":"J.Random","CreatedById":63332,"CreatedDateTime":"2015-05-05T19:10:32Z","Content":"I have to agree. It\u0027s definitely the best (or at least one of) release among all we\u0027ve had. Even if it lacks proper Release quality."},{"CreatedByName":"Captain Vlad","CreatedById":106306,"CreatedDateTime":"2015-05-05T19:18:11Z","Content":"There\u0027s been no KSP update release that hasn\u0027t made the game better. This one was no different; its made one of the best game\u0027s I\u0027ve ever played significantly better."},{"CreatedByName":"Renegrade","CreatedById":96629,"CreatedDateTime":"2015-05-05T19:18:14Z","Content":"Well, I can definitely agree that it\u0027s the best release to date. A bit rough with the emergency patches, but it didn\u0027t feel as bad as 0.24\u0027s patches did.\n\nFunny thing to mention the engines - I\u0027d say they\u0027re a lot better balanced than they ever were historically (although there\u0027s still some oddities like the ant and aerospike)."},{"CreatedByName":"teepee2345","CreatedById":98846,"CreatedDateTime":"2015-05-05T19:20:16Z","Content":"i have had a lot more fun in 1.0 then in any other release version. on a scale of 1 to 10 ksp 1.0 is 100 for me"},{"CreatedByName":"Valley","CreatedById":73883,"CreatedDateTime":"2015-05-05T19:23:18Z","Content":"Well, I have to say yes. I am working on a KSP universe in the Fan Fiction area and this new version will create interesting problems to overcome. \n\nThe whole reentry problem for example. I am testing to see what designs work. Not sure my old SSTO will survive but stuff happens..."},{"CreatedByName":"Randox","CreatedById":18034,"CreatedDateTime":"2015-05-05T19:27:46Z","Content":"I\u0027m really enjoying it, even though I\u0027m not yet used to all the changes. I feel like it\u0027s already forced me to become a better pilot, but things also now behave more as I would expect them too, which is actually making it easier for me design a stable rocket, or fly a plane. With the in game resource system seeming to be a good replacement to the Kethane mod I was using, the only thing I am really sour about right now is losing the docking cam mod. I can dock without it, but it\u0027s not as fun or awesome ![:(](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif)\n\nWithout all the translation and alignment data, I can\u0027t set up the glide well enough to watch from another ship or on EVA like I used too.\n\nStill, the game just keeps getting better and better, and I can\u0027t argue with that."},{"CreatedByName":"Renegrade","CreatedById":96629,"CreatedDateTime":"2015-05-05T19:28:22Z","Content":"\u003E \n\u003E i have had a lot more fun in 1.0 then in any other release version. on a scale of 1 to 10 ksp 1.0 is 100 for me\n\n100/10 would crash rocket into launchpad again -IGN ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)"},{"CreatedByName":"monstah","CreatedById":95210,"CreatedDateTime":"2015-05-05T20:55:34Z","Content":"It has its issues, but I agree it is the best stock experience we\u0027ve had. Let\u0027s make a crowd here, too?"},{"CreatedByName":"Ridge363","CreatedById":123194,"CreatedDateTime":"2015-05-05T21:32:05Z","Content":"By far the best update. So many new parts, features, and improvements. This is how I felt when I first started adding mods to the game"},{"CreatedByName":"Eric S","CreatedById":57117,"CreatedDateTime":"2015-05-05T22:43:29Z","Content":"\u003E \n\u003E Still needs a bit of tweaking, but I completely agree. Best stock experience so far by a long shot.\n\nI agree as well. 1.0 had a problem where deployed parachutes wouldn\u0027t burn up and heatshields affected the center of pressure but not the center of mass, causing flipping. And there might have been a few minor balance issues. Minor things considering the fact that the memory leaks seemed gone and we had a more realistic aerodynamics system, etc. \n\nThen in 1.0.2 (I didn\u0027t get the chance to install 1.0.1 before 1.0.2 came out, so I missed out on that one), the parachutes and heatshields are fixed, but now the balance is wonky enough that heatshields aren\u0027t necessary. The worst part about it is that we got a memory leak mixed in there. So mostly minor bugs mixed in with balancing. I\u0027m having fun, haven\u0027t gotten frustrated by any of the bugs except the memory leak."}]}