{"TopicId":107763,"ForumId":21,"TopicTitle":"Rosetta/Philae Replica","CreatedByName":"Zucal","CreatedById":139764,"CreatedDateTime":"2015-05-05T23:21:52Z","PageNum":1,"Articles":[{"CreatedByName":"Zucal","CreatedById":139764,"CreatedDateTime":"2015-05-05T23:21:52Z","Content":"I was bored and felt like doing some low-g somersaults, so I went and built this quick n\u0027 dirty Rosetta mission recreation, using Gilly as the stand-in comet. Rosetta and Philae are two spacecraft currently investigating the comet Churyumov-Gerasimenko. Rosetta is the orbiter, while a few months ago Philae became the first spacecraft to land on a comet.\n\n**Craft Info**: 137 parts, 4.4 tons, 700 m/s of dv. Philae is equipped with its own 4 RCS thrusters, over-adequate for Gilly\u0027s gravity.\n\nBeauty shots!\n\n![4YxO2OX.png](http://i.imgur.com/4YxO2OX.png)\n\n![Z40pzbi.png](http://i.imgur.com/Z40pzbi.png)\n\n![3hYRmET.png](http://i.imgur.com/3hYRmET.png)\n\nThanks for viewing, and leave some rep if you enjoyed!"},{"CreatedByName":"pTrevTrevs","CreatedById":131541,"CreatedDateTime":"2015-05-06T00:41:39Z","Content":"Gah, I was going to rep you, but I must \u0022spread some Reputation around before giving it to Zucal again\u0022\n\nGreat mission. I wonder though, what ever became of Philae in real life? I heard it landed in the shadow and was unable to recharge its batteries. Is it still functioning?"},{"CreatedByName":"Columbia","CreatedById":135031,"CreatedDateTime":"2015-05-06T05:46:03Z","Content":"Wha~ Zucal, why do you keep doing this?! I thought it was impossible to build a Rosetta-Philae replica myself, but you just beat me to it!\n\nRepped! Are you going to make the Ariane 5 anytime soon?"},{"CreatedByName":"Sky_walker","CreatedById":113214,"CreatedDateTime":"2015-05-07T22:35:08Z","Content":"Very nice ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif) And I see you used Gilly as a comet? Hehehe, I did the same with my iteration."},{"CreatedByName":"ThatGuyWithALongUsername","CreatedById":140817,"CreatedDateTime":"2015-05-08T16:16:16Z","Content":"\u0022You have to spread some rep around before giving it to Zucal again.\u0022 ![;.;](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif) WHY?!\n\nSeriously, you make really good probe replicas."}]}