{"TopicId":107708,"ForumId":16,"TopicTitle":"Basic Planetary Survey Procedures","CreatedByName":"Odyssey","CreatedById":28858,"CreatedDateTime":"2015-05-05T19:01:06Z","PageNum":1,"Articles":[{"CreatedByName":"Odyssey","CreatedById":28858,"CreatedDateTime":"2015-05-05T19:01:06Z","Content":"\n\u003Cp\u003EI\u0027m in career mode and I see (in items I haven\u0027t unlocked yet) that there are parts to scan planets (and presumably moons).\u003C/p\u003E\u003Cp\u003ECan anyone tell me the basics for good scans? (I look for realism and this is kind of my way of talking to the engineers that build the sensors.)\u003C/p\u003E\u003Cp\u003EHow do I get the most accurate scans as quickly (and presumably cheaply) as possible.\u003C/p\u003E\u003Cp\u003EAll I\u0027m talking about is the function of the different scanning devices. I get the basic orbital mechanics (i.e. polar orbits for max coverage).\u003C/p\u003E\u003Cp\u003ECan you tell me which scanners to use where? Is altitude a factor? And if so, how big a factor?\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2015-05-05T20:21:13Z","Content":"\n\u003Cp\u003EPlace the M700 Survey Scanner in a roughly polar orbit (\u002B/- 10 degrees) and activate it within an orbital altitude range (different for each world, but it will tell you when you try it), and it instantly scans the entire world\u0027s surface, and provides a resource intensity overlay in map view. This device only works in orbit. \u003C/p\u003E\u003Cp\u003EOnce that scan has been performed, the M4435 Narrow Band Scanner, when activated, provides a close-up view of the rectangle of terrain underneath its position, giving a color readout of ore intensity. This device works on the surface and in orbit. Probably on aircraft as well, but I haven\u0027t tried it. \u003C/p\u003E\u003Cp\u003EThe Surface Scanning Module tells you what biome you are on or over, and gives a numerical reading of the ore intensity at that precise spot. It does not have a pictorial display, but works on the surface and aircraft. Haven\u0027t tried it from orbit.\u003C/p\u003E\n"}]}