{"TopicId":107714,"ForumId":50,"TopicTitle":"Care and Feeding of your MPL-LG-2 Mobile Processing Lab in 1.0\u002B - How to be a science farmer","CreatedByName":"BluetoothThePirate","CreatedById":75760,"CreatedDateTime":"2015-05-05T19:40:01Z","PageNum":1,"Articles":[{"CreatedByName":"BluetoothThePirate","CreatedById":75760,"CreatedDateTime":"2015-05-05T19:40:01Z","Content":"\n\u003Cp\u003EThis tutorial is based on my own experience in career and RoverDude\u0027s information from \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/117461-New-Mobile-Processing-Lab-mechanics\u0022 rel=\u0022external nofollow\u0022\u003Ethis answered question thread\u003C/a\u003E. This is a basic tutorial with just text for now, pictures to follow if I think of it later or something needs clarity. It also ignores how to go and get the results because earlier tutorials from past versions still cover that part in fine detail.\u003C/p\u003E\u003Cp\u003EFirst, some terms as I\u0027m using them. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003E\u003Cstrong\u003EScience\u003C/strong\u003E is the blue currency you spend in the R\u0026amp;D building to unlock the tech tree. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cstrong\u003EData\u003C/strong\u003E is the raw material used to make science in the lab. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cstrong\u003EExperiments\u003C/strong\u003E are the physical science parts themselves. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cstrong\u003EResults\u003C/strong\u003E are the part you can take out of the experiment with a Kerbal and move around from pod to pod.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EHow the lab works (now)\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EAt the most basic level, the lab analyses a result, makes data from it, and converts data into stored science over time (even when not on the focused vessel). At the command of the player, it will take its stored science and transmit it back to Kerbin and into your science bank account. Generating data from a result does not destroy the result, once a lab has made data from a result that result can be used in other ways. It can be returned to Kerbin for the full payout or transmitted for a fraction, just like before. The transmission bonus for processing in the lab is gone now, replaced by this new system.\u003C/p\u003E\u003Cp\u003EA lab can still be used to reset the goo and science jr. experiments as before, but now a scientist on EVA can do that job so it\u0027s mostly a matter of convenience. A lab needs to be manned by two scientist kerbals, and their levels affect its efficiency and yield, so level them up any way you can. They will not level up from doing their work in the lab, you need to take them places to grow their levels.\u003C/p\u003E\u003Cp\u003EA lab can produce data from one unique result exactly once, but it\u0027s tracked per-lab. Meaning, you can take the results from one goo canister, transfer it to a lab, process it for data, then transfer it to another lab and process it for more data, but you can\u0027t take a second goo measurement (or crew report or surface sample or whichever) from the same biome and altitude and get more data in the same lab. The amount of data you get from an experiment is determined by where the lab is when you process the result. There\u0027s a bonus for being on or around the same body as the result is from, and being landed is more valuable than being in orbit (this is reversed on Kerbin, a landed lab there yields almost no data). The data yields scale with the raw science payout from the result, so surface samples are big and crew reports are small. Also remember, a lab can get full data from a result even if it\u0027s been returned to Kerbin and all its direct science yield is depleted. Doesn\u0027t matter what the blue bar says, if this particular lab hasn\u0027t seen it it\u0027s valuable!\u003C/p\u003E\u003Cp\u003EA lab can only hold 500 data in reserve. If you have extra results and try to process them, it will refuse if it can\u0027t hold the data. The lab can hold an arbitrary number of stored results just like any manned part, so you can hold onto results for the future without processing them. When the lab is processing or researching it consumes a lot of power and converts data to science in a 5:1 ratio. The rate of conversion is based on how much data is in storage so it falls off over time. A lab with full data and two one-star scientists yields about 1 science every 4 days. When the lab\u0027s science buffer is full work stops. You must switch to the vessel with the lab and manually transmit the stored science to resume work.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ESome important things to note\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EThe kerbals in the lab must both be scientists. Their level matters. Other scientists on the same vessel will also contribute.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe lab draws a lot of power. Load up on solar panels and batteries.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EYou can still return experiments after the lab has analysed them, so make it a point to get all your results into labs if you can.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe stored science in a lab has to be transmitted, returning and recovering a lab does nothing, so you need to have an antenna on a lab vessel.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E Check on your science bases periodically since they need to transmit manually. Smart use of renaming vessels and assigning categories can make this easier, if you\u0027re doing this aggressively you might have a lot of stations and bases.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe Mun has a long night, so expect your solar-powered science base to be shut down half the time. It doesn\u0027t need to be on to produce science in your absence but it needs to be on to transmit. It might be worth it to fill the lab with data on the ground for the bonus but then let it do its work in orbit.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E Being on the surface or on a more distant body increases data yields so the lab\u0027s data buffer will fill up sooner, but it still takes the same amount of time to process it into science no matter where it\u0027s located.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E The science per day is determined by how much data is stored, so it slows down over time to a trickle. Keep the lab topped up with data to keep the yield high.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ESome contracts will pay you to put lab-bearing stations in various places, so don\u0027t waste the opportunity if someone else is willing to foot the bill. If they ask for a station in orbit of Kerbin, put on some extra delta-V, complete the contract for the payout then fly it to Minmus or Munar orbit (or land it, if it\u0027s really overbuilt).\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EDo the rescue contracts, getting enough scientists to fill out the bases can get expensive if you pay for all the hiring but if you aggressively recruit via rescue you get about a third scientists, and they gain a full star of XP in the process of being rescued.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ERemember that the lab isn\u0027t a command pod, so you can\u0027t do anything without a command pod (with a third kerbal in it) or probe core (and then you can\u0027t do anything when the power runs out.)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EEVA reports in orbit are biome-specific when almost nothing else is, so an easy source of early-mid-game data is to pop one of the scientists out for EVA reports from the ladder as your station orbits Kerbin. You can transmit those for full science afterwards.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E Don\u0027t put two labs on one vessel, it doesn\u0027t work the way you expect. You can have two parked near each other, just not docked.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E Labs are still useful after the tech tree is fully unlocked because your administrators can convert science income into funds and reputation. High-end parts are pricey and everyone needs a little PR once in a while.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ll add to this as I learn more. Questions or corrections below please!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-15T21:06:04Z\u0022 title=\u002205/15/2015 09:06  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 15, 2015\u003C/time\u003E by BluetoothThePirate\u003C/strong\u003E\n\u003Cbr\u003EMore details from down the thread.\n\u003C/span\u003E\n"},{"CreatedByName":"MacroNova","CreatedById":126611,"CreatedDateTime":"2015-05-06T16:26:26Z","Content":"\n\u003Cp\u003ENot sure if this is intended behavior, but it seems the scientists don\u0027t need to be physically in the Lab for it to do research. They can be in an attached command pod and get the same rate of conversion.\u003C/p\u003E\n"},{"CreatedByName":"BigFatStupidHead","CreatedById":44217,"CreatedDateTime":"2015-05-09T21:25:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MacroNova\u0022 data-cite=\u0022MacroNova\u0022\u003E\u003Cdiv\u003ENot sure if this is intended behavior, but it seems the scientists don\u0027t need to be physically in the Lab for it to do research. They can be in an attached command pod and get the same rate of conversion.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EImportantly this allows more than two scientists to give bonuses to a lab. A full lab with a third scientist in an attached pod will work faster than just a full lab. I suppose they work in shifts.\u003C/p\u003E\n"},{"CreatedByName":"FreeThinker","CreatedById":117389,"CreatedDateTime":"2015-05-12T12:51:43Z","Content":"\n\u003Cp\u003ETHe Biodome EVA report are just realy silly, the same should be possible from a window in a spacestation. Probably better as you have access to tools, paper, pen. In 0.90 I always switch Science gathering for EVA with Crew reports. Saves me the frustration of missing a science report because I couldn\u0027t get into my EVA suit fast enough.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003ESo from my understanding, If a created a science vilage in space, and transfer the research between them I could create lots of additional science? This seems a bit broken..\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-12T13:32:35Z\u0022 title=\u002205/12/2015 01:32  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 12, 2015\u003C/time\u003E by FreeThinker\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"yafeshan","CreatedById":130191,"CreatedDateTime":"2015-05-12T13:25:59Z","Content":"\n\u003Cp\u003EGenerating science out of experiment analysis is fine but doing it again in another lab is completely broken.\u003C/p\u003E\n"},{"CreatedByName":"FreeThinker","CreatedById":117389,"CreatedDateTime":"2015-05-12T13:34:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022yafeshan\u0022 data-cite=\u0022yafeshan\u0022\u003E\u003Cdiv\u003EGenerating science out of experiment analysis is fine but doing it again in another lab is completely broken.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIndeed, it should only be allowed once globally. Now you simply build 100 Processing labs, collect a bit of science and allowed it to be processed by each of the 100 processing labs.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-12T13:53:25Z\u0022 title=\u002205/12/2015 01:53  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 12, 2015\u003C/time\u003E by FreeThinker\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Skorpychan","CreatedById":72052,"CreatedDateTime":"2015-05-12T13:52:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FreeThinker\u0022 data-cite=\u0022FreeThinker\u0022\u003E\u003Cdiv\u003EIndeed, it should only be allowed once globally. Now you simply build 100 Processing labs, collect a bit of science and allowed it to be processed by each of the 100 processing labs.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIndeed you could, but this is balanced by getting them all there in the first place.\u003C/p\u003E\u003Cp\u003EOf course, this DOES give me the idea of creating a science lab for processing data on Kerbin, or in LKO. Maybe put it on a plane to fly it out to wherever you landed the return capsule, and process the science.\u003C/p\u003E\n"},{"CreatedByName":"stampy","CreatedById":142278,"CreatedDateTime":"2015-05-12T18:02:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FreeThinker\u0022 data-cite=\u0022FreeThinker\u0022\u003E\u003Cdiv\u003EIndeed, it should only be allowed once globally. Now you simply build 100 Processing labs, collect a bit of science and allowed it to be processed by each of the 100 processing labs.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027ll need 200 Kerbals.\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2015-05-12T18:47:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022yafeshan\u0022 data-cite=\u0022yafeshan\u0022\u003E\u003Cdiv\u003EGenerating science out of experiment analysis is fine but doing it again in another lab is completely broken.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt is a rather balanced way to get more science after all experiments have been sucked dry.\u003C/p\u003E\u003Cp\u003EEnsures you have something to to and to trade for funds/rep with strategies.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FreeThinker\u0022 data-cite=\u0022FreeThinker\u0022\u003E\u003Cdiv\u003EIndeed, it should only be allowed once globally. Now you simply build 100 Processing labs, collect a bit of science and allowed it to be processed by each of the 100 processing labs.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you really want to, yes - I myself plan on having a copy of every experiment I ever did somewhere safe - crazy gamer and all. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"FreeThinker","CreatedById":117389,"CreatedDateTime":"2015-05-13T09:57:57Z","Content":"\n\u003Cp\u003EWell it does motivate players to build a permanent research base at minumus and send all their measurement there to generate extra research. Even though it\u0027s a bit unrealsitic if takes litterly, from a gaeplay perspective is might be fun.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-13T10:02:48Z\u0022 title=\u002205/13/2015 10:02  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 13, 2015\u003C/time\u003E by FreeThinker\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"AndreZero","CreatedById":137363,"CreatedDateTime":"2015-05-13T14:28:58Z","Content":"\n\u003Cp\u003EDoes this mean that once you have sufficient science to unlock the mobile processing lab, you should do never transmit your results (because they can\u0027t be processed after they have been transmitted) and you should not allow your results to be recovered with your craft (for the same reason)?\u003C/p\u003E\u003Cp\u003EWhat is the difference between processing (the yellowish beaker icon) and having your processing lab \u0022researching?\u0022\u003C/p\u003E\n"},{"CreatedByName":"BigFatStupidHead","CreatedById":44217,"CreatedDateTime":"2015-05-13T20:41:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AndreZero\u0022 data-cite=\u0022AndreZero\u0022\u003E\u003Cdiv\u003EDoes this mean that once you have sufficient science to unlock the mobile processing lab, you should do never transmit your results (because they can\u0027t be processed after they have been transmitted) and you should not allow your results to be recovered with your craft (for the same reason)?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou can always just gather the science again. Collect it once for return to Kerbin and immediate science gains, and a second time to give to all of your science labs for forever research.\u003C/p\u003E\n"},{"CreatedByName":"AndreZero","CreatedById":137363,"CreatedDateTime":"2015-05-14T17:06:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BigFatStupidHead\u0022 data-cite=\u0022BigFatStupidHead\u0022\u003E\u003Cdiv\u003EYou can always just gather the science again. Collect it once for return to Kerbin and immediate science gains, and a second time to give to all of your science labs for forever research.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAh... so even though the second time you do the experiment it is worth little (or no) science, it still produces data that can be used to produce science in the lab? For some reason I was thinking that you needed an experiment that yielded science for the lab to useful.\u003C/p\u003E\n"},{"CreatedByName":"BluetoothThePirate","CreatedById":75760,"CreatedDateTime":"2015-05-15T00:11:50Z","Content":"\n\u003Cp\u003EYou can transmit or recover the science after you process it in a lab. You don\u0027t lose the result when you process it. If you\u0027re really obsessed with minmaxing the system you can hold onto your results and launch a lot of labs, but given that it\u0027s easy to find enough data to fill a lab almost anywhere it\u0027s probably not worth it.\u003C/p\u003E\n"},{"CreatedByName":"Coga19000","CreatedById":125394,"CreatedDateTime":"2015-05-15T07:22:55Z","Content":"\n\u003Cp\u003EI don\u0027t see why the ability to process one science experiment in multiple labs is broken. It is the equivalent of taking multiples of the same experiment and having multiple labs process each, only sans the frustration of having to get the same experiment over and over again. \u003C/p\u003E\u003Cp\u003EPlus, do you think RL research is conducted only on one research facility at a time? In contrast, the results of one lean are being moved to another for further analysis, and so on.\u003C/p\u003E\n"},{"CreatedByName":"BluetoothThePirate","CreatedById":75760,"CreatedDateTime":"2015-05-15T21:02:02Z","Content":"\n\u003Cp\u003EI think what people don\u0027t like is the sheer yield of it, they think it makes clearing the tree too easy. Let\u0027s be honest here, the lab is heavy and expensive to put in place, and hiring and leveling up scientists is really expensive. And more to the point, finding 500 data is really easy almost anywhere, so it ultimately doesn\u0027t matter of you pass the same experiments around or just get new ones everywhere, 500 data is 500 data.\u003C/p\u003E\n"},{"CreatedByName":"g.koster","CreatedById":115794,"CreatedDateTime":"2015-05-17T07:36:20Z","Content":"\n\u003Cp\u003Eif you play 10% science be aware that any science below 1 will effectively not be transported to the lab. so in effect all sciences on herbal eva\u0027s, crew reports, materials bay, barometer, temperature and soil samples. all give below 1 science so give 0 science in the lab\u003C/p\u003E\n"},{"CreatedByName":"DarkGravity","CreatedById":143383,"CreatedDateTime":"2015-06-02T07:32:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022yafeshan\u0022 data-cite=\u0022yafeshan\u0022\u003E\u003Cdiv\u003EGenerating science out of experiment analysis is fine but doing it again in another lab is completely broken.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot completely broken imho, but ideally there should be diminishing returns for multiple labs processing the same data. I used to run a research lab irl. Multiple labs working on the same problem, each with slightly different approaches is a good thing. The second lab working on one problem might even get a slight boost, reflecting the competition/synergy that happens between labs. 3 or 4 labs working on the same problem should still produce a pretty high return, but after that it should drop off considerably. But if you don\u0027t want to invest time into coding all of that, I\u0027d say leaving it as it is, is pretty good. Not many people are going to have 5 labs working on the same data, considering how easy it is to get fresh data.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-02T07:53:43Z\u0022 title=\u002206/02/2015 07:53  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 2, 2015\u003C/time\u003E by DarkGravity\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"A_name","CreatedById":134040,"CreatedDateTime":"2015-07-14T20:20:28Z","Content":"\n\u003Cp\u003ESo what happens if you dock 2 together? I\u0027m planning a Duna mission and I figured I\u0027d take 2 along since a single one will fill up rather quickly.\u003C/p\u003E\n"},{"CreatedByName":"moronwrocket","CreatedById":134908,"CreatedDateTime":"2015-07-14T20:24:29Z","Content":"\n\u003Cp\u003EOnly one will operate if you dock two together. With the latest update, it seems like extra scientists outside the lab no longer contribute, so having a separate spacecraft with its own lab is best. What I did for my reusable landing craft was to add a pod along with the mobile science lab, and store all science experiments in both. Then when I liftoff and goto space, drop off the pod science experiments in the MSL orbiting in a space station, and send the LCV back down to collect more science somewhere else.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-08-22T12:31:26Z","Content":"\n\u003Cp\u003EGreat tutorial, this really helps understand one of the \u0022game mechanic\u0022 aspects of the game.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BluetoothThePirate\u0022 data-cite=\u0022BluetoothThePirate\u0022\u003E\u003Cdiv\u003EA lab can produce data from one unique result exactly once, but it\u0027s tracked per-lab.\u003C/div\u003E\u003C/blockquote\u003EDoes this mean that, for example, if I use a lab in Mun orbit to process results from the Mun, I can\u0027t then land that same lab on the Mun\u0027s surface and process the same results, but I can put a new lab *anywhere*, even in Mun orbit again, and process the same results?\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-08-22T21:07:48Z","Content":"\n\u003Cp\u003EYou know... I had originally intended to do this as part of my career development before the tech tree was complete, but I soon realized that it just plain isn\u0027t worth it in terms of time and effort.\u003C/p\u003E\u003Cp\u003E It would take years to process enough data to unlock the tree, while simply retrieving enough science to Kerbin can be done in less than a month.\u003C/p\u003E\u003Cp\u003E I\u0027m sure it\u0027d be a different story once the tree is unlocked, when the idea is to generate operating funds.\u003C/p\u003E\u003Cp\u003E Best,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"},{"CreatedByName":"BluetoothThePirate","CreatedById":75760,"CreatedDateTime":"2015-08-23T00:08:03Z","Content":"\n\u003Cp\u003EThat is exactly what that means, yes.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-09-05T20:07:39Z","Content":"\n\u003Cp\u003EA little detail I noticed. To convert results into data only required any single Kerbal in the lab, at least in Science Mode. So pilots or engineers can if desired get the lab filled up with data ready for a later arrival of scientists. It\u0027s a bit situational but that could be useful in installs with life support.\u003C/p\u003E\n"},{"CreatedByName":"kamitora","CreatedById":151698,"CreatedDateTime":"2015-09-29T08:01:45Z","Content":"\n\u003Cp\u003EHow can i send data to MPL to research it.\u003C/p\u003E\u003Cp\u003ESometimes a button appears just below the \u0022Keep Data\u0022 buton called \u0022Process in Lab Module\u0022 but sometimes don\u0027t\u003C/p\u003E\u003Cp\u003EAnd i couldn\u0027t figure out when that button appears \u003C/p\u003E\u003Cp\u003EI read some articles which saying that it button appears when the vessel connected to MPL but i transmitted data to MPL from far away using antenna (from Sun orbit to Kerbin orbit)\u003C/p\u003E\u003Cp\u003EWhat is the matter when that button appears ?\u003C/p\u003E\u003Cp\u003EThanks In Advance\u003C/p\u003E\n"}]}