{"TopicId":107966,"ForumId":69,"TopicTitle":"KSP takes 20 minutes to launch","CreatedByName":"Tripod27","CreatedById":68324,"CreatedDateTime":"2015-05-06T21:07:33Z","PageNum":1,"Articles":[{"CreatedByName":"Tripod27","CreatedById":68324,"CreatedDateTime":"2015-05-06T21:07:33Z","Content":"\n\u003Cp\u003EFor some reason this version of KSP takes something like 20 minutes to load the first half or so of the files (and a lot of them are just flags or other textures that take 30 seconds to load individually) and then loads the other half in 10 seconds\u003C/p\u003E\u003Cp\u003EI figured it was just because it was my first time launching the game but when I tried again just now it\u0027s again taking forever to load\u003C/p\u003E\n"},{"CreatedByName":"Padishar","CreatedById":97386,"CreatedDateTime":"2015-05-06T21:20:52Z","Content":"\n\u003Cp\u003EYou probably have one or more network adapters installed but not connected (or some software such as Hamachi that basically does the same thing). Try disabling all network adapters that you aren\u0027t actually using.\u003C/p\u003E\n"},{"CreatedByName":"Tripod27","CreatedById":68324,"CreatedDateTime":"2015-05-06T21:45:43Z","Content":"\n\u003Cp\u003EYou sure? I\u0027m not patching or anything, just starting the .exe and skipping the launcher entirely\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-05-06T21:49:58Z","Content":"\n\u003Cp\u003EFor some reason KSP on Windows can bog down while loading for some players, and it seems to be caused by network adapters, it does not affect everyone and no one knows why.\u003C/p\u003E\u003Cp\u003EIt\u0027s not even known whether the fault is in KSP or Unity, and it is even caused by virtual networks.\u003C/p\u003E\n"},{"CreatedByName":"Tripod27","CreatedById":68324,"CreatedDateTime":"2015-05-06T21:54:19Z","Content":"\n\u003Cp\u003EI was just hoping it wasn\u0027t because I tried uninstalling hamachi just yesterday and had trouble\u003C/p\u003E\u003Cp\u003EGuess I gotta go try again\u003C/p\u003E\u003Cp\u003EEDIT: yeah that fixed it, now it\u0027s only 2 seconds. Weird fix but whatever, it works, thanks guys!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-06T21:59:53Z\u0022 title=\u002205/06/2015 09:59  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 6, 2015\u003C/time\u003E by Tripod27\u003C/strong\u003E\n\u003C/span\u003E\n"}]}