{"TopicId":107967,"ForumId":16,"TopicTitle":"On calculating atmospheric delta-v","CreatedByName":"Rosco P. Coltrane","CreatedById":61065,"CreatedDateTime":"2015-05-06T21:10:00Z","PageNum":1,"Articles":[{"CreatedByName":"Rosco P. Coltrane","CreatedById":61065,"CreatedDateTime":"2015-05-06T21:10:00Z","Content":"\n\u003Cp\u003ESo, with all the discussions about needed dV to orbit now with the new aero... Does anyone knows or can offer a pointer as to how mathematically calculate this? I know this will depend on the shape of the rocket, whereas in pre-1.0 pretty much all parts had a drag coefficient of 0.2. But in any case, is there a method that would give as a ball-park figure? \u003C/p\u003E\u003Cp\u003EI tried launching multiple times by hand but I got very different values, even with the same rocket... because my skills are lacking I guess. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Venusgate","CreatedById":125730,"CreatedDateTime":"2015-05-06T21:27:35Z","Content":"\n\u003Cp\u003EAt some point, I think you jsut have to plan for the worst, or use mechjeb.\u003C/p\u003E\u003Cp\u003EIt\u0027s not just shape of the rocket, it\u0027s your speed, relative to terminal velocity (which changes with altitude), and angle of attack: which are impossible to flawlessly reproduce.\u003C/p\u003E\u003Cp\u003Ein reality, 90% of your design and skill are going to save you up to 500 m/s. The last 10% of perfection is only going to save you ~15-20 m/s\u003C/p\u003E\n"},{"CreatedByName":"Garius","CreatedById":142266,"CreatedDateTime":"2015-05-07T01:19:36Z","Content":"\n\u003Cp\u003EThere\u0027s unlikely to be a nice closed form formula even for reasonably simple ascent profiles, you\u0027d most likely need to use numerical methods. Even in the old model with fixed 0.2 drag, optimal delta v speeds could only be calculated in closed form for vertical ascent, and I\u0027m not sure if the amount needed could be computed algebraically.\u003C/p\u003E\u003Cp\u003ESpitballing some ideas, you could start by using energy to calculate a minimum, and then try to add in Gravity, drag, and steering losses, but, as I said, you\u0027d likely be using numerical methods to find the latter three.\u003C/p\u003E\n"},{"CreatedByName":"SkyeRangerDelta","CreatedById":143259,"CreatedDateTime":"2015-05-07T22:26:02Z","Content":"\n\u003Cp\u003EIf you are looking to calculate delta-V, you can install the mod Kerbal Engineer Redux (KER) and I know its 1.0.2. Each engine you add to the rocket will add a value to a table and give you detailed information on not only your rocket but your orbit as well such as inclination, ETA\u0027s and more. I use, I love it.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-05-07T22:34:20Z","Content":"\n\u003Cp\u003EIf you\u0027re getting vastly different amounts of fuel (thus dV) in orbit with the same vessel on multiple launches, all I can say is keep launching until you\u0027ve got a consistent profile. No amount of math will get you past that.\u003C/p\u003E\u003Cp\u003EAnd once you have a consistent (and moderately efficient) profile, screw the math. Just note your dV on launch and in orbit (and your TWR at launch, and also how your TWR changes during launch), and you can expect roughly the same for vessels with similar dV and TWR.\u003C/p\u003E\n"},{"CreatedByName":"Rosco P. Coltrane","CreatedById":61065,"CreatedDateTime":"2015-05-08T00:58:13Z","Content":"\n\u003Cp\u003EProblem is, as the author of a dV map, I\u0027d like to have something to back me up. So when somebody comes saying \u0022your numbers sux, dude\u0022 I have something to answer that would make look smart. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E But no seriously, that\u0027s pretty much, I\u0027d like to have something to reference when asked.\u003C/p\u003E\n"},{"CreatedByName":"Kryxal","CreatedById":102688,"CreatedDateTime":"2015-05-08T01:05:44Z","Content":"\n\u003Cp\u003EI\u0027d think the problem only arises on Kerbin, Eve, and Laythe ... and on Eve, you have enough of a problem anyway! It seems like there\u0027s a fairly good consensus on Kerbin ascent by this time. About all you can do, in the end, is say \u0022this is what people who know what they\u0027re doing are getting\u0022.\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2015-05-08T01:56:47Z","Content":"\n\u003Cp\u003EEven on airless bodies, ascent dV is highly sensitive to TWR (or rather, gravity losses are sensitive to ascent time). So your numbers were already ballpark. Indeed, due to drag, things even out a bit at the high-TWR range for aired bodies. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-05-08T02:18:49Z","Content":"\n\u003Cp\u003EOn every ascent, put a little * next to the number.\u003C/p\u003E\u003Cp\u003EAt the bottom of the chart, put *YdVMV. Numbers are based on community consensus and optimal ascent trajectories. It\u0027s not my fault if you lack the skillz, bro.\u003C/p\u003E\u003Cp\u003E...or something slightly less cheeky.\u003C/p\u003E\n"},{"CreatedByName":"Rosco P. Coltrane","CreatedById":61065,"CreatedDateTime":"2015-05-08T03:32:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NathanKell\u0022 data-cite=\u0022NathanKell\u0022\u003E\u003Cdiv\u003EEven on airless bodies, ascent dV is highly sensitive to TWR (or rather, gravity losses are sensitive to ascent time).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh yes, but that ballpark figure was backed up by a solid set of equations that worked in giving you said ballpark figure. So I had the excuse! Listen buddy, don\u0027t blame me, blame the math if you like but I have nothing to do with it. My method for getting those numbers is objective and you can calculate them too if you like... and a long list of etceteras where I don\u0027t take any responsibility for the newbie\u0027s misunderstanding of what a dV map is about. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EI think I\u0027m gonna wait until MechJeb is updated and they punch the numbers for different ascent into the autopilot and see how they work. Last time I checked in 1.0 MJ was having one hell of a time piloting your rockets on the way up... so I don\u0027t know. Might as well try with kOS or KSPRC scripts.\u003C/p\u003E\n"},{"CreatedByName":"ajburges","CreatedById":26570,"CreatedDateTime":"2015-05-08T04:57:50Z","Content":"\n\u003Cp\u003EIf you\u0027re making a dV map, keep the estimates conservative.\u003C/p\u003E\u003Cp\u003EFewer people complain about having more gas in the tank then planned.\u003C/p\u003E\u003Cp\u003ECommunity consensus is the best approach anyway. That way when people ask for help to hit those numbers...\u003C/p\u003E\n"},{"CreatedByName":"purpletarget","CreatedById":57317,"CreatedDateTime":"2015-05-08T06:02:10Z","Content":"\n\u003Cp\u003EYeah, I\u0027m pretty sure this is one of those problems that can\u0027t be solved analytically. Rather you could play with numerical models to assist, but there\u0027s still going to be variations based on differing grav losses from TWR, and drag losses, especially in the turns, or when they\u0027re done...or what shape the rocket is in. (Tall vs wide)\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-05-08T06:08:39Z","Content":"\n\u003Cp\u003EI do not think the old dV maps were calculated. I think they were done experimentally. That\u0027s why they varied a bit.\u003C/p\u003E\n"},{"CreatedByName":"metaphor","CreatedById":57640,"CreatedDateTime":"2015-05-08T16:17:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00225thHorseman\u0022 data-cite=\u00225thHorseman\u0022\u003E\u003Cdiv\u003EI do not think the old dV maps were calculated. I think they were done experimentally. That\u0027s why they varied a bit.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYep. For ascent from atmospheric bodies, I just tried some ascents experimentally to come up with delta-v values. It depends a lot on the size and shape of your rocket (and on the heat tolerance of your parts), even assuming that you fly the perfect gravity turn.\u003C/p\u003E\u003Cp\u003EOrbital maneuvers in vacuum can be calculated, atmospheric maneuvers not so much.\u003C/p\u003E\n"},{"CreatedByName":"Kelderek","CreatedById":131312,"CreatedDateTime":"2015-05-08T17:28:07Z","Content":"\n\u003Cp\u003EI would think that the DV would depend more on engine selection than on drag. Drag will affect all launches fairly evenly, with exceptions only being for funky shaped designs. But your DV needed will vary by a large amount depending on what engines you use at the various altitudes of your launch because of the changes to engine ISP and thrust.\u003C/p\u003E\n"},{"CreatedByName":"metaphor","CreatedById":57640,"CreatedDateTime":"2015-05-08T20:50:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kelderek\u0022 data-cite=\u0022Kelderek\u0022\u003E\u003Cdiv\u003EI would think that the DV would depend more on engine selection than on drag. Drag will affect all launches fairly evenly, with exceptions only being for funky shaped designs. But your DV needed will vary by a large amount depending on what engines you use at the various altitudes of your launch because of the changes to engine ISP and thrust.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDrag losses can be very different between large, thin rockets and small, fat rockets. Drag force is proportional to the surface area that goes into the windstream. The acceleration due to drag (i.e. delta-v losses) is drag force divided by mass. For example, a 1.25m ship will have twice as much drag losses as a 2.5m ship that has the same shape but scaled up.\u003C/p\u003E\n"}]}