{"TopicId":107973,"ForumId":55,"TopicTitle":"The Problem with Contract Science","CreatedByName":"The Yellow Dart","CreatedById":107172,"CreatedDateTime":"2015-05-06T21:41:58Z","PageNum":1,"Articles":[{"CreatedByName":"The Yellow Dart","CreatedById":107172,"CreatedDateTime":"2015-05-06T21:41:58Z","Content":"\n\u003Cp\u003EI\u0027ve been wondering if others feel like I do on this subject. This is a problem I\u0027ve hade with the contract system since its inception. The fact that contracts inevitably have science attached to them means that science stops having any value, especially as you increase the difficulty settings. The main purpose of the contract system was to create an economy so we can earn money to pay for a space program, and a secondary purpose was added with the reputation system. \u003C/p\u003E\u003Cp\u003EThe problem with adding science to contracts as well is that, when funds are in short supply you are force to grind a bit and do a lot of small contracts to make enough to move foreword, but since you are earning science the whole time you are rarely limited by science. You generally have plenty of science for where you are in the game and so science stops mattering. And what\u0027s worse is that when you increase the difficulty, science matters less and less because you are forced to do more and more. \u003C/p\u003E\u003Cp\u003EI would prefer a fixed amount of science with none coming from contracts, or at least a more limited system where there is only small bits of science coming from the one time contracts, like achieve orbit Or return from the Mun, with none ever coming from the endlessly regenerating contracts. But a bare minimum would be to add it as an option in the Difficulty Menu. As it is, you can only decrease overall percent science received, but with unlimited contract science, this isn\u0027t very helpful. Any thoughts on this?\u003C/p\u003E\n"},{"CreatedByName":"r4pt0r","CreatedById":90471,"CreatedDateTime":"2015-05-06T21:50:06Z","Content":"\n\u003Cp\u003EYou shoulda seen the old versions, part testing contracts gave you a bunch of science, they really cut it down already.\u003C/p\u003E\n"},{"CreatedByName":"The Yellow Dart","CreatedById":107172,"CreatedDateTime":"2015-05-06T21:51:33Z","Content":"\n\u003Cp\u003EYeah, I\u0027ve noticed that it is less now, which is good, but it is still technically unlimited while the tech tree is not.\u003C/p\u003E\u003Cp\u003EIn 0.90 I used a little mod someone made to remove it, but it seems like it should be a stock option, since we have so many other difficulty options now anyway.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-06T21:54:29Z\u0022 title=\u002205/06/2015 09:54  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 6, 2015\u003C/time\u003E by The Yellow Dart\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Renegrade","CreatedById":96629,"CreatedDateTime":"2015-05-06T21:52:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The Yellow Dart\u0022 data-cite=\u0022The Yellow Dart\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI would prefer a fixed amount of science with none coming from contracts, or at least a more limited system where there is only small bits of science coming from the one time contracts, like achieve orbit Or return from the Mun, with none ever coming from the endlessly regenerating contracts. But a bare minimum would be to add it as an option in the Difficulty Menu. As it is, you can only decrease overall percent science received, but with unlimited contract science, this isn\u0027t very helpful. Any thoughts on this?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree with the concept of \u0022\u003Cem\u003E\u003Cstrong\u003Eonly\u003C/strong\u003E\u003C/em\u003E from the one time contracts\u0022 as those are mostly exploration contracts. Other contracts shouldn\u0027t have science at all.\u003C/p\u003E\u003Cp\u003EFortunately, 1.0 has already trimmed down contract science \u003Cem\u003E\u003Cstrong\u003Eenormously\u003C/strong\u003E\u003C/em\u003E (it was NOT hard to one-shot tiers 6, 7, and 8 with a single high-end contract \u002B research strategy in 0.90 (0.26~)), so we\u0027re already in a better position now, and getting rid of the rest of it should be fairly easy.\u003C/p\u003E\n"},{"CreatedByName":"TJ_Tas","CreatedById":5465,"CreatedDateTime":"2015-05-06T21:53:30Z","Content":"\n\u003Cp\u003EI\u0027m having precisely the opposite problem personally with this version. I have plenty of money but just can\u0027t seem to get enough science to do anything with. I\u0027m getting very few parts contracts nor anything else which gives science. I\u0027m finding now that a previous change which reduced the science available from repeating a science operation is now killing me.\u003C/p\u003E\n"},{"CreatedByName":"SelectHalfling0","CreatedById":105051,"CreatedDateTime":"2015-05-06T21:54:21Z","Content":"\n\u003Cp\u003EI would assume rescuing a kerbal would give you science (because you interview him according to the end-report) and test part contracts should give you science (I mean, they are asking you to \u003Cem\u003Etest\u003C/em\u003E the part). Also, contracts like \u0022explore -------\u0022 should give you science because you explored the body (theoretically the probe took pics, which is not simulated in the stock game).\u003C/p\u003E\n"},{"CreatedByName":"Renegrade","CreatedById":96629,"CreatedDateTime":"2015-05-06T21:58:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TJ_Tas\u0022 data-cite=\u0022TJ_Tas\u0022\u003E\u003Cdiv\u003EI\u0027m having precisely the opposite problem personally with this version. I have plenty of money but just can\u0027t seem to get enough science to do anything with. I\u0027m getting very few parts contracts nor anything else which gives science. I\u0027m finding now that a previous change which reduced the science available from repeating a science operation is now killing me.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EScience operations have ALWAYS had the diminishing return system (career was introduced in 0.22, and had that right away).\u003C/p\u003E\u003Cp\u003EA given experiment has a fixed total science it can return from a given applicable situation/biome combo..and chasing the second or third time in today\u0027s system is pretty much a waste unless you\u0027re desperate somehow.\u003C/p\u003E\u003Cp\u003EMake a Minmus lander, put as many science experiments on it, and return the results to Kerbin (use crew to remove the result from the experiment and store \u0027em in the pod, and then all you\u0027ve gotta return is the pod). If you aren\u0027t getting like 300\u002B science from that one landing, you\u0027re doing something wrong. And landed experiments are fairly uniformly biome-specific, so Minmus has like ahh.. 9? 10? of \u0027em, and the Mun has like.. 15 (slightly lower value though and higher grav).\u003C/p\u003E\u003Cp\u003EI\u0027ve never been science squeezed. I usually end up completing all the nodes available to me before unlocking the next level of the research center.\u003C/p\u003E\u003Cp\u003EHere\u0027s a simple landed checklist, by the way:\u003C/p\u003E\u003Cp\u003E[ ] EVA report from surface\u003C/p\u003E\u003Cp\u003E[ ] EVA report from just above the surface (assuming you haven\u0027t gotten this already - easy to get, just jump~)\u003C/p\u003E\u003Cp\u003E[ ] Surface sample\u003C/p\u003E\u003Cp\u003E[ ] Thermometer reading\u003C/p\u003E\u003Cp\u003E[ ] Pressure reading\u003C/p\u003E\u003Cp\u003E[ ] Seismic reading (this one is big)\u003C/p\u003E\u003Cp\u003E[ ] Gravioli reading (also big)\u003C/p\u003E\u003Cp\u003E[ ] Goo pod\u003C/p\u003E\u003Cp\u003E[ ] Science Jr\u003C/p\u003E\u003Cp\u003ENot sure if the Fluid Spectro-Variometer works on an airless body or not~\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-06T22:02:09Z\u0022 title=\u002205/06/2015 10:02  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 6, 2015\u003C/time\u003E by Renegrade\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"The Yellow Dart","CreatedById":107172,"CreatedDateTime":"2015-05-06T22:05:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Renegrade\u0022 data-cite=\u0022Renegrade\u0022\u003E\u003Cdiv\u003EI agree with the concept of \u0022\u003Cem\u003E\u003Cstrong\u003Eonly\u003C/strong\u003E\u003C/em\u003E from the one time contracts\u0022 as those are mostly exploration contracts. Other contracts shouldn\u0027t have science at all.\u003Cp\u003EFortunately, 1.0 has already trimmed down contract science \u003Cem\u003E\u003Cstrong\u003Eenormously\u003C/strong\u003E\u003C/em\u003E (it was NOT hard to one-shot tiers 6, 7, and 8 with a single high-end contract \u002B research strategy in 0.90 (0.26~)), so we\u0027re already in a better position now, and getting rid of the rest of it should be fairly easy.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, it is definitely better, the main problem is that science gets easier as money gets harder, since you are already going to do loads of contracts anyway if you are in hard mode. I nickel and dime\u0027d my way through a couple different nodes trying to earn enough to upgrade the VAB. It should shouldn\u0027t work that way.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SelectHalfling0\u0022 data-cite=\u0022SelectHalfling0\u0022\u003E\u003Cdiv\u003EI would assume rescuing a kerbal would give you science (because you interview him according to the end-report) and test part contracts should give you science (I mean, they are asking you to \u003Cem\u003Etest\u003C/em\u003E the part). Also, contracts like \u0022explore -------\u0022 should give you science because you explored the body (theoretically the probe took pics, which is not simulated in the stock game).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI am talking strictly from a gameplay perspective, in that it kind of breaks the whole science/tech tree aspect when science is essentially unlimited. You can unlock the whole tree just putting satellites around Kerbin and the Mun if you just keep accepting them. Agreed that plenty of science would be gained from many different contracts. But if we are going to talk about realism and science, you don\u0027t really learn a whole lot about airplane wings by launching satellites, yet I just unlocked a butt load of them with satellite science. So yeah, we probably shouldn\u0027t talk about realism and the science system.\u003C/p\u003E\n"},{"CreatedByName":"zarakon","CreatedById":5160,"CreatedDateTime":"2015-05-06T22:05:38Z","Content":"\n\u003Cp\u003EI\u0027d rather get MORE science from contracts. Maybe diminishing returns for repeating the same type at the same place. I think there should be contracts that give mostly funds, others that give mostly rep, and others that give mostly science.\u003C/p\u003E\u003Cp\u003EI\u0027d also like to see diminishing returns for doing multiple biomes so that you can\u0027t get tons of science just by taking the time to EVA report and grav scan every biome in a polar orbit, and to bring a bit more balance between the amount of science you can get at worlds with many biomes vs few\u003C/p\u003E\n"},{"CreatedByName":"TJ_Tas","CreatedById":5465,"CreatedDateTime":"2015-05-06T22:05:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Renegrade\u0022 data-cite=\u0022Renegrade\u0022\u003E\u003Cdiv\u003EScience operations have ALWAYS had the diminishing return system (career was introduced in 0.22, and had that right away).\u003Cp\u003EA given experiment has a fixed total science it can return from a given applicable situation/biome combo..and chasing the second or third time in today\u0027s system is pretty much a waste unless you\u0027re desperate somehow.\u003C/p\u003E\u003Cp\u003EMake a Minmus lander, put as many science experiments on it, and return the results to Kerbin (use crew to remove the result from the experiment and store \u0027em in the pod, and then all you\u0027ve gotta return is the pod). If you aren\u0027t getting like 300\u002B science from that one landing, you\u0027re doing something wrong. And landed experiments are fairly uniformly biome-specific, so Minmus has like ahh.. 9? 10? of \u0027em, and the Mun has like.. 15 (slightly lower value though and higher grav).\u003C/p\u003E\u003Cp\u003EI\u0027ve never been science squeezed. I usually end up completing all the nodes available to me before unlocking the next level of the research center.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI know all this. I\u0027ve been playing since the beginning. The point i was making is that this factor is now hitting me harder with the overall reduced science and lots more to buy. What you say about Minimus is true and if I had enough science to make a ship to get there and land I would. I am stuck on tier 2/3 with virtually no science coming in and not enough to buy the big rockets or fuel tanks i need to get there. This to me seems a catch 22 as i\u0027m no longer able to get science from orbit as i\u0027ve taken it all (which i\u0027ve never agreed with). The only thing i seem to be able to get science from is farming the biomes on kerbal which is dull.\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-05-06T22:09:45Z","Content":"\n\u003Cp\u003EI\u0027d prefer no science from contracts as it\u0027d encourage players to go further than Kerbin/Mun/Minmus just to get science, it\u0027d be both a reward for going out to the planets and add an element of planning when choosing which contract to do, players would want contracts that pay for the trip to new places just so they can do experiments there.\u003C/p\u003E\n"},{"CreatedByName":"marza","CreatedById":11730,"CreatedDateTime":"2015-05-06T22:10:05Z","Content":"\n\u003Cp\u003EI\u0027ve experienced the same thing TJ_Tas has. I\u0027ve been playing a moderate difficulty career and whilst the contracts leave me awash with funds, the science earned is meagre. Implementing strategies to convert 35% of funds and reputation earned from contracts into science helped a lot, but it doesn\u0027t compare to what can be earned by launching a dedicated science ship/probe.\u003C/p\u003E\n"},{"CreatedByName":"TJ_Tas","CreatedById":5465,"CreatedDateTime":"2015-05-06T22:14:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022marza\u0022 data-cite=\u0022marza\u0022\u003E\u003Cdiv\u003EI\u0027ve experienced the same thing TJ_Tas has. I\u0027ve been playing a moderate difficulty career and whilst the contracts leave me awash with funds, the science earned is meagre. Implementing strategies to convert 35% of funds and reputation earned from contracts into science helped a lot, but it doesn\u0027t compare to what can be earned by launching a dedicated science ship/probe.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI wonder if its a difficulty level problem. I\u0027m playing on Moderate too. Its getting pretty frustrating to be honest. The lower tier engines don\u0027t have a good power to fuel return now and getting the science to upgrade is too damned hard.\u003C/p\u003E\n"},{"CreatedByName":"adinfinitum","CreatedById":49226,"CreatedDateTime":"2015-05-06T22:21:55Z","Content":"\n\u003Cp\u003EThe contracts for anything around Kerbin and its moons give like what, 15 science max? Sure its a nice little bonus, but it in no way replaces actually going out and doing experiments. I don\u0027t know what player would place hundreds of satellites in orbits to unlock the tech tree, so I don\u0027t see it as negatively affecting gameplay.\u003C/p\u003E\n"},{"CreatedByName":"marza","CreatedById":11730,"CreatedDateTime":"2015-05-06T22:24:20Z","Content":"\n\u003Cp\u003EGetting science is a bottleneck to progress, especially in the early game, but I wouldn\u0027t say it\u0027s too hard \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"The Yellow Dart","CreatedById":107172,"CreatedDateTime":"2015-05-06T22:34:04Z","Content":"\n\u003Cp\u003EOooh! I just thought of another possibility. Since the tech tree is limited, we want science to be limited as well, right? Otherwise you can finish it without leaving the Kerbin. So what if the slider in the difficulty menu, rather than adjusting a global percentage of science received, adjusted the total amount of science available in game, with the minimum value being the total value of the whole tech tree (an incredibly hard game where you have to clean every bit of science from the entire solar system). This could include a certain predetermined percentage of the science that would come from contracts, so that you can still get science from contracts, but it is exhaustible and spread out over different planets, i.e. a certain amount of contract science for the Mun, a different amount for Dune etc. \u003C/p\u003E\u003Cp\u003EThis way you could easily and dependably adjust the science difficulty, determining how far you have to go/how many planets you must visit to complete the tree.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022adinfinitum\u0022 data-cite=\u0022adinfinitum\u0022\u003E\u003Cdiv\u003EThe contracts for anything around Kerbin and its moons give like what, 15 science max? Sure its a nice little bonus, but it in no way replaces actually going out and doing experiments. I don\u0027t know what player would place hundreds of satellites in orbits to unlock the tech tree, so I don\u0027t see it as negatively affecting gameplay.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut when you put the game in hard mode, you have to do lots of contracts just to stay above water, and keep advancing, all the while earning small amounts of science for something you had to do anyway. So what I\u0027m saying is that increasing difficulty actually makes this aspect of the game easier, and that is a problem to me.\u003C/p\u003E\n"},{"CreatedByName":"uglyduckling81","CreatedById":129740,"CreatedDateTime":"2015-05-06T22:35:51Z","Content":"\n\u003Cp\u003EYou should set your difficulty to custom. 100% Money so there is less grind and 50% science. These 2 figures are just examples to start at. You will need to find your own sweet spot which you like to play at.\u003C/p\u003E\u003Cp\u003EThis set up allows you to earn enough cash to unlock buildings etc and hopefully enough to send rockets to collect science perhaps without even having a contract.\u003C/p\u003E\u003Cp\u003EFor instance you find you don\u0027t have enough science to unlock heavy rockets but you have 200k money. You build a rocket and go to Minmus with no contract. Collect a few bits of science while there and return with enough to unlock another few items and continue with your game.\u003C/p\u003E\u003Cp\u003ETo me the science should always be the limiting factor. When you unlock something new it should be a WOW factor of look what I can build now. Grinding out a bunch of repeat contracts for cash is boring and contracts are the only way to make money. Science can always be gathered contract or no which mean you can send your own science collecting missions like I said.\u003C/p\u003E\u003Cp\u003EIt also encourages you to be more resourceful with your builds. No heavy rockets? How do I get all the experiments and equipment to Minmus to collect the science I need. MOAR BOOSTERS!!.......oh parts count limit \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-06T22:40:32Z\u0022 title=\u002205/06/2015 10:40  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 6, 2015\u003C/time\u003E by uglyduckling81\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"giltirn","CreatedById":66962,"CreatedDateTime":"2015-05-06T22:42:48Z","Content":"\n\u003Cp\u003EI\u0027d also rather get more science from contracts. Please add this option to the poll for a fair result.\u003C/p\u003E\n"},{"CreatedByName":"Gerandar","CreatedById":136705,"CreatedDateTime":"2015-05-06T22:44:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sal_vager\u0022 data-cite=\u0022sal_vager\u0022\u003E\u003Cdiv\u003EI\u0027d prefer no science from contracts as it\u0027d encourage players to go further than Kerbin/Mun/Minmus just to get science, it\u0027d be both a reward for going out to the planets and add an element of planning when choosing which contract to do, players would want contracts that pay for the trip to new places just so they can do experiments there.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eeven if contracts didnt give science Im pretty sure I can fill the entire tech tree with just the mun, minmus, and kerbin.\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2015-05-06T22:45:27Z","Content":"\n\u003Cp\u003EI think nearly ALL science should be MISSION based. The idea of \u0022contracts\u0022 for many things in KSP is absurd, particularly \u0022science.\u0022 If all science contracts are renamed Missions, and they come from your own program, then they suddenly make loads of sense. Note that satellite launches, and parts testing can stay strictly commercial, and keep the name contracts.\u003C/p\u003E\u003Cp\u003ETo visualize this, forget the word contract, as it implies doing a task for renumeration, I will use \u0022mission\u0022 going forward for all these \u0022contracts\u0022 that make sense coming from your own space program, not as a commercial money making scheme.\u003C/p\u003E\u003Cp\u003EThe general missions are things like \u0022Explore the Mun.\u0022 The specific missions, like \u0022visual survey of area X on the Mun\u0022 are areas your own program\u0027s scientists think merit specific observation. The funds allotted are a BUDGET, and the science is excess science your scientists think can be gained by comparing those areas. Science from orbit? Same thing, various missions Linus, Werner, et al, have come up. \u003C/p\u003E\u003Cp\u003ERemember that the entire points system is already entirely arbitrary, and no less gamey than having your science staff direct some particular landing spot locations to you. You can always go to the meeting, and tell them you think that\u0027s a dumb idea, and come up with a more interesting spot to study (i.e.: reject the mission and wait for a better one).\u003C/p\u003E\n"},{"CreatedByName":"Wiseman","CreatedById":116239,"CreatedDateTime":"2015-05-06T22:45:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sal_vager\u0022 data-cite=\u0022sal_vager\u0022\u003E\u003Cdiv\u003EI\u0027d prefer no science from contracts as it\u0027d encourage players to go further than Kerbin/Mun/Minmus just to get science, it\u0027d be both a reward for going out to the planets and add an element of planning when choosing which contract to do, players would want contracts that pay for the trip to new places just so they can do experiments there.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s my feeling on it too. In .90, between the high science values from certain parts-testing contracts (Mainsail in orbit was giving something like 400k funds, plus gobs of science), and the funds-to-science strategy, I didn\u0027t even need to biome-hop Mun and Minmus to clear the tree, I was doing it with super boring test contracts. I rapidly lost interest in those playthroughs since I was just unlocking nodes to get better part testing contracts, to unlock more nodes, and then whoops, the tree was totally unlocked and I hadn\u0027t left Kerbin\u0027s SOI.\u003C/p\u003E\u003Cp\u003EI enjoy the lower science payout on contracts now, since I don\u0027t have to worry about them overshadowing my actual science vessels. I very much like, conceptually, the idea of taking fund-payout contracts to set up and send science expeditions that are coming straight out of pocket. Tourism is another great way that we\u0027re starting to see a decoupling of funds and science missions. My only complaint with the system as it is, is the inconsistency of the the big hard-coded contracts (explore X, fly-by Y, etc). There is an opportunity here to use those as kind of guidance through a career, pointing players to their next big target.\u003C/p\u003E\n"},{"CreatedByName":"marza","CreatedById":11730,"CreatedDateTime":"2015-05-06T22:46:48Z","Content":"\n\u003Cp\u003EI strongly oppose the idea to limiting science into a finite resource as a sink for science already exists in stock in the form of strategies converting it into funds and reputation. Some mods also provide other sinks for this \u0027infinite science problem\u0027 as well as extend the tech tree, but that\u0027s for another discussion.\u003C/p\u003E\u003Cp\u003ESure, it\u0027s possible for players to unlock the entire tech tree and never leave Kerbin\u0027s atmosphere. I\u0027m going to say the vast, vast, vast majority of players find fun playing their career in a different fashion and that this isn\u0027t a problem to be worried about.\u003C/p\u003E\n"},{"CreatedByName":"Wiseman","CreatedById":116239,"CreatedDateTime":"2015-05-06T22:48:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tater\u0022 data-cite=\u0022tater\u0022\u003E\u003Cdiv\u003EI think nearly ALL science should be MISSION based...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, that, exactly. Having commercial contracts as a separate way to get money, and then \u0022missions\u0022 coming from inside your own agency to provide reputation, science, and direction on your next celestial body to target would be my ideal Career mode.\u003C/p\u003E\n"},{"CreatedByName":"Renegrade","CreatedById":96629,"CreatedDateTime":"2015-05-06T23:07:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TJ_Tas\u0022 data-cite=\u0022TJ_Tas\u0022\u003E\u003Cdiv\u003EI know all this. I\u0027ve been playing since the beginning. The point i was making is that this factor is now hitting me harder with the overall reduced science and lots more to buy. What you say about Minimus is true and if I had enough science to make a ship to get there and land I would. I am stuck on tier 2/3 with virtually no science coming in and not enough to buy the big rockets or fuel tanks i need to get there.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETier 2/3? Like with normal numbering (start being \u00271\u0027) or with programmer/offset numbering (start being \u00270\u0027)? (I actually prefer the latter numbering system, but I would expect a game to use the former system)\u003C/p\u003E\u003Cp\u003EAnyhow, as long as you have some T30s or T45s and liquid tanks and decouplers, you can pretty much go anywhere. The higher tier engines are only a little better, and the LF/O tanks all have the same ratio now as far as I can see (the higher ones are just cheaper per ton of fuel, and not incredibly so). Part count limits from the VAB might get in the way, but if you\u0027re awash with money, that shouldn\u0027t be a problem even in Hard.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TJ_Tas\u0022 data-cite=\u0022TJ_Tas\u0022\u003E\u003Cdiv\u003EThis to me seems a catch 22 as i\u0027m no longer able to get science from orbit as i\u0027ve taken it all (which i\u0027ve never agreed with). \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDo you have EVA unlocked? I believe the Astronaut Complex has that in it. The EVA orbital stuff is pretty good science wise, but I have to admit I often skip it and head directly to the Mun.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TJ_Tas\u0022 data-cite=\u0022TJ_Tas\u0022\u003E\u003Cdiv\u003EThe only thing i seem to be able to get science from is farming the biomes on kerbal which is dull.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAgreed, it\u0027s dull and really fake too. It should be removed.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022marza\u0022 data-cite=\u0022marza\u0022\u003E\u003Cdiv\u003EI\u0027ve experienced the same thing TJ_Tas has. I\u0027ve been playing a moderate difficulty career and whilst the contracts leave me awash with funds, the science earned is meagre. Implementing strategies to convert 35% of funds and reputation earned from contracts into science helped a lot, but it doesn\u0027t compare to what can be earned by launching a dedicated science ship/probe.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve played Normal and Hard only in 1.0 (I did a 10% science custom in previous versions of couple of times though~), and have no such problems in either save.\u003C/p\u003E\u003Cp\u003EI DO launch dedicated science ships, and frequently. There\u0027s no reason not to. You can even stack on some related contracts to pay for \u0027em. A simple \u0022plant a flag on the Mun\u0022 mission easily pays for my standard any-target one-shot Mun lander (ditto for Minmus), can often hit the orbital science (or surface science) contracts on the way there, etc.\u003C/p\u003E\u003Cp\u003EHard is actually \u003Cem\u003Eworse\u003C/em\u003E than Normal for the science overload even; science only reduces a bit, whereas building costs double at the same time as income going down, so I end up with like 1,500 science waiting to unlock the bloody third tier research center.\u003C/p\u003E\u003Cp\u003EI think the real problem here is lack of leveraging the available science and equipment or something like that.\u003C/p\u003E\n"},{"CreatedByName":"adinfinitum","CreatedById":49226,"CreatedDateTime":"2015-05-06T23:14:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The Yellow Dart\u0022 data-cite=\u0022The Yellow Dart\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EBut when you put the game in hard mode, you have to do lots of contracts just to stay above water, and keep advancing, all the while earning small amounts of science for something you had to do anyway. So what I\u0027m saying is that increasing difficulty actually makes this aspect of the game easier, and that is a problem to me.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPerhaps another easy fix would be to increase the amount of science required to unlock the research nodes?\u003C/p\u003E\n"}]}