{"TopicId":108081,"ForumId":16,"TopicTitle":"Mun base with liquid fuel","CreatedByName":"michaelvf","CreatedById":21146,"CreatedDateTime":"2015-05-07T17:40:32Z","PageNum":1,"Articles":[{"CreatedByName":"michaelvf","CreatedById":21146,"CreatedDateTime":"2015-05-07T17:40:32Z","Content":"\n\u003Cp\u003ESo I have a new contract where I have to build a Mun base and have at least 2000 liquid fuel... I was wondering if I could just take 3 of the rockomax x200-8 tanks which have 360 liquid and 440 oxidiser to begin with and just fill it all with liquid fuel on my next Mun stop?\u003C/p\u003E\u003Cp\u003ESo the question is, Can I fill a tank with only liquid or oxidiser if I so wish?\u003C/p\u003E\n"},{"CreatedByName":"Gaarst","CreatedById":126740,"CreatedDateTime":"2015-05-07T17:46:11Z","Content":"\n\u003Cp\u003EYes you can fill it with only LF but only the specified amount, ie: if your tank is 360 LF and 440 Ox, then you can only fill 360 LF, not more.\u003C/p\u003E\n"},{"CreatedByName":"michaelvf","CreatedById":21146,"CreatedDateTime":"2015-05-07T17:47:34Z","Content":"\n\u003Cp\u003Eah bugga... thanks for the answer. I was hoping to save dragging a big ass tank up there...\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-05-07T17:48:40Z","Content":"\n\u003Cp\u003EWhy not use a Mk3 tank, which only holds LF to begin with? Makes for a more compact rocket.\u003C/p\u003E\u003Cp\u003EThe big question is, whether it\u0027s cheaper to fly the fuel out from the ground on Kerbin or fly out a drill and ISRU to make the fuel once you get there?\u003C/p\u003E\n"},{"CreatedByName":"michaelvf","CreatedById":21146,"CreatedDateTime":"2015-05-07T17:54:24Z","Content":"\n\u003Cp\u003EI dont have the tech for either a MK3 or a drill yet... And since this contract pays a lot im trying to do it one launch \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\n"},{"CreatedByName":"Invader Jim","CreatedById":142312,"CreatedDateTime":"2015-05-07T19:09:58Z","Content":"\n\u003Cp\u003EI have a similar contract but it is to set up a Munar space station with 6,000 fuel on hand. This is going to take multiple trips.\u003C/p\u003E\n"},{"CreatedByName":"michaelvf","CreatedById":21146,"CreatedDateTime":"2015-05-07T19:20:25Z","Content":"\n\u003Cp\u003Ewith the thing Im building and the amount of time it is taking to get this bloody station into orbit..... Maybe I should just go for several stages...\u003C/p\u003E\n"},{"CreatedByName":"michaelvf","CreatedById":21146,"CreatedDateTime":"2015-05-07T19:59:20Z","Content":"\n\u003Cp\u003EDamn.... All this work for nothing... But I learned a lot. Like having an assymetrical mun station with its center of mass way off is really really really impossible to land...\u003C/p\u003E\u003Cp\u003EInvader Jim any hints on how to get a connected base down to the ground? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E. Or do you just land seperated modules? Does that still count in that contract?\u003C/p\u003E\n"}]}