{"TopicId":108011,"ForumId":32,"TopicTitle":"\u0026quot;Preview Contract Parameters\u0026quot; Button in Mission Control","CreatedByName":"Dis Pater","CreatedById":143316,"CreatedDateTime":"2015-05-07T03:28:34Z","PageNum":1,"Articles":[{"CreatedByName":"Dis Pater","CreatedById":143316,"CreatedDateTime":"2015-05-07T03:28:34Z","Content":"\n\u003Cp\u003ENot sure if this has been discussed, but has anyone considered a contract, only to exit the Mission Control building, to enter the Tracking Station just to visually see the Mission parameters? I like numbers, and the Mission Control building gives us that and then some which is great. But I\u0027m more of a visual learner and would like to see an orbit \u0027preview\u0027 of the satellite/rescue/tourism contract before its accepted.\u003C/p\u003E\n"},{"CreatedByName":"AlexinTokyo","CreatedById":104401,"CreatedDateTime":"2015-05-07T04:49:46Z","Content":"\n\u003Cp\u003EYou can see satellite-contract orbits and survey-contract waypoints in the tracking station before accepting the contracts. \u003C/p\u003E\u003Cp\u003EI do think it would be nice if you could see them without having to leave Mission Control, enter the tracking station, leave the tracking station, and reenter Mission Control, though.\u003C/p\u003E\n"},{"CreatedByName":"Merinsan","CreatedById":57629,"CreatedDateTime":"2015-05-07T05:33:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AlexinTokyo\u0022 data-cite=\u0022AlexinTokyo\u0022\u003E\u003Cdiv\u003EYou can see satellite-contract orbits and survey-contract waypoints in the tracking station before accepting the contracts. \u003Cp\u003EI do think it would be nice if you could see them without having to leave Mission Control, enter the tracking station, leave the tracking station, and reenter Mission Control, though.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou can\u0027t see the rescue missions though, until the mission is accepted. I think this would be good to have.\u003C/p\u003E\u003Cp\u003EAlso, this probably should be in the suggestions forum.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2015-05-07T07:34:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Merinsan\u0022 data-cite=\u0022Merinsan\u0022\u003E\u003Cdiv\u003EYou can\u0027t see the rescue missions though, until the mission is accepted. I think this would be good to have.\u003Cp\u003EAlso, this probably should be in the suggestions forum.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERescue missions tend to be of two flavors, 80 km or high orbit. Yes its nice to know the setup as its nice to grab 3 kerbals in an pod but you can usualy see this on the payout for the mission.\u003C/p\u003E\n"}]}