{"TopicId":108018,"ForumId":55,"TopicTitle":"Venting the 1.0 launch","CreatedByName":"r4pt0r","CreatedById":90471,"CreatedDateTime":"2015-05-07T05:53:56Z","PageNum":5,"Articles":[{"CreatedByName":"Yakuzi","CreatedById":85181,"CreatedDateTime":"2015-05-07T19:02:08Z","Content":"I think 1.0 is a great update, and applaud Squad for their accomplishment! Whether it is an appropriate release version for this amazing game is subjective as has become clear from the huge amount of constructive as well as emotional feedback from the community (both positive and negative)^1^. However this version is \\*relatively\\* bug free (unfortunately the current software release standards are not something to be proud of). On the other hand, since the devs mentioned they delayed release by about a month for balancing/bug-hunting purposes in response to the [overwhelming concern expressed by the community](https://forum.kerbalspaceprogram.com/threads/108318-Do-you-feel-KSP-is-ready-for-1-0), it\u0027d be interesting to have seen the state of the game if they hadn\u0027t (particularly since the devs were still fixing bugs the day before release). I hope that both KS^quad^P and $quad, the marketing company, reflect on the decisions they made leading up to release so the future development of KSP will be a bit more rational and slightly less \u0022go-feverish\u0022.\n\n^1^ Personally I think the devs could\u0027ve slotted in a couple more beta versions (1.0.2/1.0.3/1.x could\u0027ve been the actual release). It is in my opinion a bit frustrating that I have to redesign craft after the game\u0027s release because critical systems like aerodynamics are still under development."},{"CreatedByName":"Aerindel","CreatedById":109952,"CreatedDateTime":"2015-05-07T20:23:04Z","Content":"Here is a new theory. 1.0 was a deliberate troll by Squad.\n\nI mean...if you watch the release trailer they pretty much told us exactly what 1.0 was going to be like. Rockets that blow up on ascent and pods that can\u0027t safely land, followed by denial and finger pointing from mission control!\n\n\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/7kTbo1wmN-w?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\n\nIt explains everything!"},{"CreatedByName":"Sky_walker","CreatedById":113214,"CreatedDateTime":"2015-05-07T22:29:09Z","Content":"\u003E \n\u003E As the [community criticism in the direction of the QA \u0026 exp testers](https://forum.kerbalspaceprogram.com/threads/117712-About-recent-community-criticism-in-the-direction-of-the-QA-exp-testers?p=1880582\u0026viewfull=1#post) thread was locked because people kept derailing the thread to talk about how its not the QA/EXP teams fault, but rather Squads poor decision making, the[\u0022Is it ready for 1.0\u0022](https://forum.kerbalspaceprogram.com/threads/108318-Do-you-feel-KSP-is-ready-for-1-0) thread is proof to Squad: \n\u003E We tried to warn you.\n\u003E \n\u003E We understand that this update brought the game to a point where the devs feel it is complete. But at that point it should have been KSP .95 \u0022Coming in hot!\u0022.\n\u003E \n\u003E Why? All the new systems you added were never subjected to a proper public beta. Thus your untested new features required 1.0.1, 1.0.2, and very likely will get 1.0.3. This is a result of the decision making, and is by no means the QA/EXP teams fault. Again, this not the testers faults. The last release should not have tons of brand new content.\n\u003E \n\u003E Yes I also understand that many games have patches and bugfixes post 1.0. The point is it was not ready for that.\n\n\u002B1. No idea why they rushed it so much. The very first day I heard about the release schedule I knew it cannot end well... and as pretty much everyone predicted: it didn\u0027t. Not to mention even the most fundamental matters - if it should be released at all considering how many things we don\u0027t have that were planned (eg. finishing the IVAs or adding some variety to the planets, like geysers, cryovolcanos, proper ice caps that aren\u0027t just a different texture, radiation belts, volcanic activity, etc.).\n\n**Edited \u003Ctime datetime=\u00222015-05-08T08:08:21Z\u0022 title=\u002205/08/2015 08:08  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 8, 2015\u003C/time\u003E by Sky\\_walker**"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2015-05-07T23:15:33Z","Content":"\u003E \n\u003E stop the \u0022releases always have bugs, deal with it\u0022 and \u0022stop whining\u0022.\n\nYou know what? This thing is released, and no amount of whining will unrelease it.\n\nNot that this confines you to silence -- you may lobby for your pet peeves to be fixed first, for example. But \u0022don\u0027t go 1.0\u0022? That train has left the station two weeks ago."},{"CreatedByName":"JedTech","CreatedById":104003,"CreatedDateTime":"2015-05-07T23:37:06Z","Content":"Squad let us believe that the community was an important part of development. Everyone here signed up to help test the early access software. We were excited to help alpha test and beta test. Then Squad took a change in direction and decided to add lots of features without letting us beta test it before the 1.0 release.\n\nWe desperately wanted to be involved, but Squad rejected us saying \u0022trust us\u0022.\n\nWell, now we are venting. Not that venting will accomplish anything. If Squad decides to listen again, then the community will still be involved with balancing and fixing 1.0. \n\nEventually 1.0.x or 1.1 will be the \u00221.0\u0022 we were all hoping to help create.\n\n**Edited \u003Ctime datetime=\u00222015-05-07T23:42:52Z\u0022 title=\u002205/07/2015 11:42  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 7, 2015\u003C/time\u003E by JedTech**"},{"CreatedByName":"razark","CreatedById":32993,"CreatedDateTime":"2015-05-08T01:15:21Z","Content":"1.0 is out. Whether (part of/a majority of) the community agreed or not, Squad released 1.0. My reaction: it\u0027s not as bad as I feared, nor as polished as I had hoped. I wish they had taken a bit more time to get it finished up, but it\u0027s here now. I haven\u0027t had much time to muck about in 1.0.2 yet. It\u0027s playable, but I\u0027m waiting on a couple of mods to really get into it. \n\nWhat I\u0027m about to say, I say as an outside observer. I don\u0027t know what goes on inside Squad, and I have no right to expect Squad to reveal any of it. Maybe there\u0027s rational reasons for the course of events.\n\nThe problem some of us have is that Squad seems to be making some questionable decisions. They seemed to switch plans with regard to beta releases for no apparent reason. They showed signs of \u0022Go Fever\u0022, even though a lot of people wanted them to take time to test and polish the game. They went from \u0022alpha\u0022 to \u0022beta\u0022 to \u0022release\u0022 so fast, and with no apparent change in what they\u0027re doing. Squad decided they were going to put a lot of brand new material in the release version, which seems to go against the very idea of \u0022beta\u0022. They had to know that the aerodynamic system alone would require massive rebalancing to get working properly, not to mention integrating properly with new parts and systems like reentry heating. They told us repeatedly that they had full control of when the release was, even while they said they were dropping features to meet the release date. Less than a week after release, two patches were released to fix a number of bugs. The patches also changed features of the new aerodynamic system. And that release video, which seemed to be as close as they could get to *Challenger*, was kind of in bad taste, in my opinion.\n\nOne particular bug raises some questions. There are three basic phases of spaceflight. Launch/ascent, flight operations, and reentry/landing. In the released 1.0 version of the game, reentry didn\u0027t work with a capsule and heatshield. That\u0027s one third of spaceflight right there, not working, and in an extremely obvious way. As I said, I wasn\u0027t involved with any of it, so I don\u0027t know how it happened. Maybe that was something they didn\u0027t have time to fix. But when something that obvious makes it into release, people are going to question what happened to allow it in. Even though there could be a thousand other reasons, two possibilities are clear to anyone, and those raise some rather major concerns. Either the process was rushed, and there wasn\u0027t time to test properly, or no one cared enough to fix the bug. It also makes people wonder if something this visible got released, what other issues have slipped through?\n\nWe don\u0027t raise these criticisms because we just want to scream at someone on the internet. We do it because we care about the game. We see a lot of potential yet unrealized, and we want to see it grow into what it could be. Sometimes we can be a bit harsh.\n\nAnyway, I\u0027ve said what I have to say. I\u0027m going to go check the mods I\u0027m waiting on and get as much enjoyment out of this game as I can."},{"CreatedByName":"78stonewobble","CreatedById":97559,"CreatedDateTime":"2015-05-08T07:51:01Z","Content":"\u003E \n\u003E This thread is in the \u0027General KSP *discussion*\u0027 forum. Prefacing a statement here with an \u0027In my opinion\u0027 disclaimer is tautological.\n\nYou could argue that, but because you can also discuss objective fact in addition to subjective matters in such a place. I think it\u0027s nice to keep a clear distinction between when a person is presenting objective fact and when it is a matter of subjectivity and too often an oppinion is uttered as a universal fact, when it\u0027s not."},{"CreatedByName":"ColourOfFire","CreatedById":135926,"CreatedDateTime":"2015-05-08T12:18:55Z","Content":"\u003E \n\u003E Squad let us believe that the community was an important part of development. Everyone here signed up to help test the early access software. We were excited to help alpha test and beta test. Then Squad took a change in direction and decided to add lots of features without letting us beta test it before the 1.0 release.\n\u003E We desperately wanted to be involved, but Squad rejected us saying \u0022trust us\u0022.\n\u003E \n\u003E Well, now we are venting. Not that venting will accomplish anything. If Squad decides to listen again, then the community will still be involved with balancing and fixing 1.0. \n\u003E \n\u003E Eventually 1.0.x or 1.1 will be the \u00221.0\u0022 we were all hoping to help create.\n\nBut it\u0027s a ridiculous assumption to be involved. The community has been involved in a lot of features, priorities and other stuff, but in the end when it comes to business decisions like releasing a version as a certain number it\u0027s totally up to the developer. The developer has a company to run and has different things on it\u0027s mind than a bunch of people who just want a game to be awesome and want their features in it and their pet peeves fixed. They have no obligation towards the community, if they want to be nice guys, awesome, if they decide it\u0027s time to do things their way, no hard feelings.\n\nIt\u0027s not like they pulled a Spacebase DF-9 on us, we\u0027re not going to be stuck with this version, they felt it was important to lose the early access stamp. If you look at some more early access developers you see more of them that feel that the early access hinders your work and income by stigmas caused by some notable failures and bad publicity.\n\nAs much as the community has been helpful in development, at the same time it has cost extra time to keep every version playable and enjoyable. They have always done their best to keep save files compatible and keep stock craft functional at the cost of development speed. If they had released a 0.95 the opinions about the new aero would be as divided as they are now, to get everyone happy about a 1.0 could take ages...\n\n**Edited \u003Ctime datetime=\u00222015-05-08T12:23:17Z\u0022 title=\u002205/08/2015 12:23  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 8, 2015\u003C/time\u003E by ColourOfFire**"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-05-08T12:24:25Z","Content":"\u003E \n\u003E ...to get everyone happy about a 1.0 could take ages...\n\nWould never happen. People want different things from the game, there is no pleasing everyone. They essentially have to pick a balance they like and let people complain.\n\nThankfully the game is moddable enough to tune it to one\u0027s tastes if stock is too far from them."},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-05-08T12:35:34Z","Content":"There is a misconception amongst players that their early access purchase meant that they were alpha or beta testers for Squad, when early access was only that, access to the game as it developed.\n\nHowever, Squad has listened to the players since the start, both when the game and fanbase was small and it was easier to deal with issues raised by players, and later even after it became abundantly clear that too many voices made public bugs difficult to manage.\n\nSquad is still listening to the players now, but the balance of the game is ultimately their choice, rather than the players, and as has been said Squad cannot please everyone."},{"CreatedByName":"DJK","CreatedById":114951,"CreatedDateTime":"2015-05-08T13:04:41Z","Content":"I don\u0027t see the point of these kind of threads.. whats done is done. Deal with it. Don\u0027t act like a spoiled self entitled kid.. The game was had very few noticeable bugs when 1.0 was released, then it was patched up by SQUAD. If you were expecting a perfect release just for you.. with all the features that you wanted as you wanted.. well, that pretty much says it all.."},{"CreatedByName":"DoToH","CreatedById":68428,"CreatedDateTime":"2015-05-08T13:56:53Z","Content":"\u003E \n\u003E whats done is done. Deal with it.\n\nAsking for broken mechanics (reentry) to be fixed/balanced is how I deal with it.\n\nDeal with it."},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2015-05-08T14:06:34Z","Content":"\u003E \n\u003E Here is a new theory. 1.0 was a deliberate troll by Squad.\n\nNo more need for theories -\n\nAs per the latest Squadcast, Squad\u0027s opinion is that the game is not yet properly complete."},{"CreatedByName":"michaelsteele3","CreatedById":127113,"CreatedDateTime":"2015-05-08T15:46:09Z","Content":"\u003E \n\u003E Not quite. There were issues with that O2 tank that were missed. The heater thermostat fused in the \u0027on\u0027 position during ground testing and the O2 boiled off much faster than it should have but nobody noticed or they didn\u0027t realize the implications.\n\nThe irony is how this thread began to derail before the first page was done."},{"CreatedByName":"DevoidLight","CreatedById":60164,"CreatedDateTime":"2015-05-08T16:01:32Z","Content":"I won\u0027t consider this game finished until we get a god damn delta-v readout."},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2015-05-08T22:40:59Z","Content":"These threads have gotten beyond tedious. Can we just chill for a couple of weeks and let squad do their thing? Pretty please?\n\n**Edited \u003Ctime datetime=\u00222015-05-08T22:43:56Z\u0022 title=\u002205/08/2015 10:43  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 8, 2015\u003C/time\u003E by Pthigrivi**"},{"CreatedByName":"Lord Aurelius","CreatedById":71687,"CreatedDateTime":"2015-05-08T23:11:16Z","Content":"I was majorly disappointed by the 1.0 launch as well, but I have to agree with the last several posts in saying that we\u0027ve had enough threads like this. The message has been sent, KasperVld started a thread that had to be closed that\u0027s filled with post after post expressing dissatisfaction with 1.0. I\u0027m not trying to be rude to those who are disappointed with the update, I\u0027m with you and understand (go look up my posts in that closed thread), but it\u0027s time to move on.\n\nSquad is planning on continuing development, and modders are already hard at work updating their mods. The current state of the game is not going to be the final state.\n\nInstead of venting here, go participate in a discussion thread seeking to generate some constructive ideas Squad can use to improve the game going forwards. If you have the propensity for it, create or assist with a mod that addresses the aspects of the game that you feel need improvement. If necessary, take a break from KSP and play/do something else for a bit while the rough edges get ironed out.\n\n**Edited \u003Ctime datetime=\u00222015-05-08T23:14:53Z\u0022 title=\u002205/08/2015 11:14  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 8, 2015\u003C/time\u003E by Lord Aurelius**"},{"CreatedByName":"herbal space program","CreatedById":112590,"CreatedDateTime":"2015-05-09T01:03:19Z","Content":"\u003E \n\u003E What is really so \u0022bungled\u0022 about it? There were a few bugs, but got quickly patched away.\n\nAlthough there are a few problems with the simulation engine that should probably have been fixed before calling the release 1.0, I think where the devs really fell short is in providing enough depth and play-testing to the career part of the game. They have a fantastic system of building and flying simulated spaceships, but in the end really very few interesting things out there in the Kerbolar system for you to go and explore. Moreover, the whole system of contracts, tech acquisition, and building upgrades has a slapped-together feel to it and just seems like an afterthought. It\u0027s based on incomplete development of all those features, which have been around for way less time than all the essential aspects of the simulation engine, that I feel like this release really shouldn\u0027t have been called 1.0.\n\n**Edited \u003Ctime datetime=\u00222015-05-09T01:06:16Z\u0022 title=\u002205/09/2015 01:06  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 9, 2015\u003C/time\u003E by herbal space program**"}]}