{"TopicId":108149,"ForumId":46,"TopicTitle":"2 requests for Wiki moderators: front page update and fix uploads","CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2015-05-08T02:50:34Z","PageNum":1,"Articles":[{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2015-05-08T02:50:34Z","Content":"\n\u003Cp\u003EI went to make some updates to the KSP Wiki tonight and discovered a pair of issues that the common user cannot fix. The first issue is that the main page is completely impossible for anyone but those registered as moderators of the Wiki to edit. This is mainly an issue because it is literally 2 years out of date and does not mention anything about Science Mode, Career Mode, or anything pertaining to them. As we common users cannot fix it, we must petition to the moderators of the Wiki to do so.\u003C/p\u003E\u003Cp\u003EThe second issue is a bit more pressing: it\u0027s currently impossible to upload anything, either for new files or updates. The Wiki throws up a Fatal exception of type MWException error every single time a file upload is attempted. Again, common users cannot fix this, so we must petition moderators of the Wiki for help. Thank you!\u003C/p\u003E\n"},{"CreatedByName":"xZise","CreatedById":59798,"CreatedDateTime":"2015-05-08T06:20:32Z","Content":"\n\u003Cp\u003EOkay the second problem is known but well not to the people who can do anything about it. And regarding the first point: the main page just relies on some templates which can be edited by anyone: \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/index.php?title=Special%3APrefixIndex\u0026amp;prefix=Main\u002BPage\u0026amp;namespace=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.kerbalspaceprogram.com/index.php?title=Special%3APrefixIndex\u0026amp;prefix=Main\u002BPage\u0026amp;namespace=0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBut the question what can be changed there. The links to the three modes have been already added which is fine but at some point there are so many links that it\u0027s just confusing.\u003C/p\u003E\n"},{"CreatedByName":"UmbralRaptor","CreatedById":2767,"CreatedDateTime":"2015-05-10T00:59:36Z","Content":"\n\u003Cp\u003EAlready nailed the first one, and asked about the second in the other wiki forum but with no response.\u003C/p\u003E\n"}]}