{"TopicId":108242,"ForumId":16,"TopicTitle":"Please recommend a lander design","CreatedByName":"EricT43","CreatedById":142226,"CreatedDateTime":"2015-05-08T17:16:44Z","PageNum":1,"Articles":[{"CreatedByName":"EricT43","CreatedById":142226,"CreatedDateTime":"2015-05-08T17:16:44Z","Content":"\n\u003Cp\u003EI\u0027ve managed to land both kerballed and unkerballed craft on the Mun and Minmus, but have not been successful at returning anything to Kerbal. My landers thus far have been a command module with drone for SAS (scientist-flown), a Science Jr., 200 fuel tank and a 909. The contraption is rather tall, and my only kerballed landing tipped over on landing. Also ran out of fuel, but that\u0027s a different story.\u003C/p\u003E\u003Cp\u003EAnyway, I have unlocked the Mk1 lander module, and thought of trying that. Just wondering what lander designs you all would recommend for a beginner that are fairly easy to land and stay upright, can collect a reasonable amount of science, and have enough fuel to get back home?\u003C/p\u003E\n"},{"CreatedByName":"Orange_Slime_","CreatedById":109168,"CreatedDateTime":"2015-05-08T17:22:06Z","Content":"\n\u003Cp\u003EMy system was a large SRB for getting to the moon, a few smaller ones to slow down enough, landed, then SRB\u0027d my way back. Took hours of physics and launch calculations though, and a design with thrusters would probably be better I guess.\u003C/p\u003E\n"},{"CreatedByName":"Kelderek","CreatedById":131312,"CreatedDateTime":"2015-05-08T17:30:24Z","Content":"\n\u003Cp\u003EAre you in sandbox, science, or career? If career or science, then how far into the tech tree are you?\u003C/p\u003E\n"},{"CreatedByName":"Melfice","CreatedById":3143,"CreatedDateTime":"2015-05-08T17:35:21Z","Content":"\n\u003Cp\u003EI don\u0027t have pictures, unfortunately. And it\u0027s hardly the most efficient design to bring into Kerbin orbit without fairings (oh, the agony. THE AGONY.).\u003C/p\u003E\u003Cp\u003EBut, from top of the lander to the bottom:\u003C/p\u003E\u003Cp\u003EAny command module. Probe core, lander can, or pod.\u003C/p\u003E\u003Cp\u003EScience Junior.\u003C/p\u003E\u003Cp\u003EService bay, loaded with batteries, and all the (radial) science equipment you have unlocked.\u003C/p\u003E\u003Cp\u003EHeatshield.\u003C/p\u003E\u003Cp\u003ERadially in a tripod configuration, top to bottom (use whatever decoupler you like; I used the TT-38K):\u003C/p\u003E\u003Cp\u003EAerodynamic nose cone\u003C/p\u003E\u003Cp\u003EFL-T400\u003C/p\u003E\u003Cp\u003ELV-909\u003C/p\u003E\u003Cp\u003ERadially on that, LT-5 landing struts (as many as you think are necessary, but one of each engine pod should suffice), but if you have them unlocked use the LT-1s. It (hopefully) shouldn\u0027t make too much of an impact on your dV numbers.\u003C/p\u003E\u003Cp\u003EPlace parachutes as and where you feel necessary. Likewise with solar panels.\u003C/p\u003E\u003Cp\u003EThis design should be able to deorbit on the MÃƒÂ¼n, return to orbit around the MÃƒÂ¼n, and fly back to Kerbin in a direct descent, ditching the engine pods in orbit as I did reentry.\u003C/p\u003E\u003Cp\u003EThere is some fuel left, but I don\u0027t know if it\u0027s enough to establish orbit around Kerbin when you return and still be able to deorbit.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-08T17:49:45Z\u0022 title=\u002205/08/2015 05:49  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 8, 2015\u003C/time\u003E by Melfice\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"EtherDragon","CreatedById":82405,"CreatedDateTime":"2015-05-08T17:36:02Z","Content":"\n\u003Cp\u003ETwo Stage lander designs are complicated, but a great way to go.\u003C/p\u003E\u003Cp\u003EAttach all of your science experiments to the lower stage (the lander).\u003C/p\u003E\u003Cp\u003EDo all the science you want on the surface, then move all the experiments into the capsule, for storage and transport.\u003C/p\u003E\u003Cp\u003EThen, an ascent stage is the only stage that returns to orbit / Kerbin.\u003C/p\u003E\u003Cp\u003EHaving tall landers are really problematic because any slope can topple them over.\u003C/p\u003E\n"},{"CreatedByName":"Anquietas314","CreatedById":8761,"CreatedDateTime":"2015-05-08T17:58:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022EtherDragon\u0022 data-cite=\u0022EtherDragon\u0022\u003E\u003Cdiv\u003ETwo Stage lander designs are complicated, but a great way to go.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETbh, for stock they\u0027re not really worth it. You can get home with a stupidly small amount of fuel \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EOP: Here\u0027s what I\u0027ve been using in my career save:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/TjJm3IA.jpg\u0022 alt=\u0022TjJm3IA.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EThe design is reasonably early game and the fairing isn\u0027t strictly necessary (but helps with efficiency and overheating issues with the rebalanced reentry heat mod), with a pretty decent margin for error (I screw up far more than I\u0027d like to admit \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 alt=\u0022:blush:\u0022\u003E). Depending on what you have available you can obviously just swap nosecones/tanks as appropriate. Lander legs used are the ones intended for probes - they work just fine as long as you don\u0027t hit the ground too hard \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 alt=\u0022:rolleyes:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2015-05-08T18:17:23Z","Content":"\n\u003Cp\u003ETo be wholly honest, I\u0027m still having luck with \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/62368-0-23-Tutorial-Mission-Planning-and-Ship-Design-for-SCIENCE%21\u0022 rel=\u0022external nofollow\u0022\u003EGeschosskopf\u0027s Sci Lander design\u003C/a\u003E from 0.23; with a set of FL-T400s on the sides it can get to either of Kerbin\u0027s moons, get into orbit, land, launch and return to Kerbin on its own. The tricky bit is getting it into orbit; these days you can do it by putting the whole assembly into a fairing; I use Procedural Fairings myself and haven\u0027t yet tried out the stock fairings to see how well they\u0027d work (if at all). I\u0027ve also started placing a service bay between the cockpit and the girder and putting all the extra instruments and in there; heat shields go under the sci jrs and another one goes on the bottom of the girder. The beauty of the Sci Lander design is that it puts a lot of mass up towards the top of the rocket inherently, making any booster less prone to flipping out of control. Does make the rocket wide, which is in general a no-no, but in this case it works (in my experience at least).\u003C/p\u003E\n"}]}