{"TopicId":108241,"ForumId":51,"TopicTitle":"Dunashot","CreatedByName":"VASMIR","CreatedById":143455,"CreatedDateTime":"2015-05-08T17:09:24Z","PageNum":1,"Articles":[{"CreatedByName":"VASMIR","CreatedById":143455,"CreatedDateTime":"2015-05-08T17:09:24Z","Content":"The story of the first Kerbals to reach Duna."},{"CreatedByName":"Endersmens","CreatedById":80723,"CreatedDateTime":"2015-05-08T17:30:41Z","Content":"\u003E \n\u003E The story of the first Kerbals to reach Duna.\n\nI\u0027m....confused....? ![:confused:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif)"},{"CreatedByName":"VASMIR","CreatedById":143455,"CreatedDateTime":"2015-05-08T21:21:26Z","Content":"I will post pics of the mission later.\n\nExpect the first post no later than next Monday.\n\nCurrently I am testing some mods that will be in the mission report.\n\n**Edited \u003Ctime datetime=\u00222015-05-08T23:22:15Z\u0022 title=\u002205/08/2015 11:22  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 8, 2015\u003C/time\u003E by Master Tao**\n  \nmerge posts"},{"CreatedByName":"VASMIR","CreatedById":143455,"CreatedDateTime":"2015-05-09T00:15:22Z","Content":"As some unexpected roadblocks appeared, don\u0027t expect an episode for a while. However, this series is supposed to be realistic. For example, the main ship in which the crew inhabits will be designed to rotate for artificial gravity."},{"CreatedByName":"VASMIR","CreatedById":143455,"CreatedDateTime":"2015-06-10T01:09:05Z","Content":"Delete this thread"},{"CreatedByName":"Wallygator","CreatedById":97357,"CreatedDateTime":"2015-06-10T22:04:38Z","Content":"yet the title of the thread is so lovely...\n\nSad..."},{"CreatedByName":"VASMIR","CreatedById":143455,"CreatedDateTime":"2015-06-11T01:08:55Z","Content":"There is a glimmer of hope, but don\u0027t dwell on it. I am currently working on such a mission, but the fact that I have not made an account with an image-posting website is a real setback.\n\nOh yeah, and building the DunaExplorationFleet."},{"CreatedByName":"TrooperCooper","CreatedById":110599,"CreatedDateTime":"2015-06-11T08:35:16Z","Content":"[https://imgur.com/](https://imgur.com/) doesnt need an account. Just click \u0022upload images\u0022 at the top and you are good to go. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2015-06-11T13:52:35Z","Content":"Nooo. ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)"},{"CreatedByName":"VASMIR","CreatedById":143455,"CreatedDateTime":"2015-06-11T19:51:35Z","Content":"Thanks for the Imgur tip, but what are the steps in order to paste an image here?\n\nTried to post a test image, but it is not working.![fUCjjmr.png](How%20do%20I%20resize%20pictures?%20%20Other%20than%20that,%20Dunashot%20is%20%20a%20go%20for%20launch.%20%20I%20repeat,%20GO%20FOR%20LAUNCH!%5Bimg%5Dhttp://i.imgur.com/fUCjjmr.png)\n\n**Edited \u003Ctime datetime=\u00222015-06-11T22:05:01Z\u0022 title=\u002206/11/2015 10:05  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 11, 2015\u003C/time\u003E by VASMIR**"},{"CreatedByName":"VASMIR","CreatedById":143455,"CreatedDateTime":"2015-06-12T16:26:34Z","Content":"I have already designed and tested the Hab and DAV modules in simulators, however, there is a slight(very bad)problem. As the DAV weighs 40 tons fully fueled, nothing in my launch vehicle fleet can lift it straight to Duna. I am RPing that it uses the Mars Direct plan of launching to Duna nearly unfueled, and making its fuel there, but no KSP mod can do that. This leaves me with a choice: I can either launch to Duna unfueled, and use Hyperedit magic to help me, or I can launch to Duna fully fueled, and have a gigantic lifter or a Nerva transfer stage. Other than that, progress is going well.\n\n- - - Updated - - -\n\n![CsyljOY.png](%5Bimg%5Dhttp%3A//i.imgur.com/CsyljOY.png)![qZYuCYm.jpg](%5Bimg%5Dhttp%3A//i.imgur.com/qZYuCYm.jpg)![aPSzpxo.png](%5Bimg%5Dhttp%3A//i.imgur.com/aPSzpxo.png)"},{"CreatedByName":"VASMIR","CreatedById":143455,"CreatedDateTime":"2015-06-12T17:55:07Z","Content":"It has been decided that I will just use hyperedit to pretend that the DAV refueled on Duna.\n\nIn other news, I will create another thread for the actual mission itself. This one will just be the development thread leading up to the mission."},{"CreatedByName":"TrooperCooper","CreatedById":110599,"CreatedDateTime":"2015-06-12T18:06:25Z","Content":"You could use the new ISRU converter module and ore drills to produce fuel on Duna just fine.\n\nJust a tip. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif) Not sure how it fits into your design plans..."},{"CreatedByName":"VASMIR","CreatedById":143455,"CreatedDateTime":"2015-06-12T18:29:52Z","Content":"Thats actually a good idea, but it will mean that I would have to make my crew amount smaller. Currently, its 4."},{"CreatedByName":"VASMIR","CreatedById":143455,"CreatedDateTime":"2015-06-12T19:32:20Z","Content":"![OsUVAmu.png](%5Bimg%5Dhttp%3A//i.imgur.com/OsUVAmu.png)![dis9Yqw.jpg](%5Bimg%5Dhttp%3A//i.imgur.com/dis9Yqw.jpg)\n\nThough this test craft was successful, later analysis had shown that it would be very difficult to make an ascent upper stage that was an SSTO. Also, later reports had shown that the RTGs would decay faster than expected, and that the craft would run out of power halfway through filling its upper tank. Lastly, though some modifications could have made this craft 4-man capable, budget cuts halted the development of the DAV. Only 2 kerbals will fly to Duna at a time.(Thank god)\n\nThank you for the advice Cooper, this will be in the final design.\n\n**Edited \u003Ctime datetime=\u00222015-06-12T19:37:46Z\u0022 title=\u002206/12/2015 07:37  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 12, 2015\u003C/time\u003E by VASMIR**"},{"CreatedByName":"VASMIR","CreatedById":143455,"CreatedDateTime":"2015-06-15T14:35:26Z","Content":"Hello everyone! As I am doing the \u0022We Are the Explorers\u0022 series based off this plan, make sure to check it out. Also, the KASA finally has a Duna plan.\n\nLaunch 1 is a reusable HLV that launches the DAV to Duna on a low-energy transfer. After 8 months, the DAV lands and begins mining ore and converting it into fuel to help with the ascent.\n\nLaunch 2 happens the same year, but this time with the habitat module. The hab is unmanned, and lands as close as possible to the DAV. It sits and waits for 8 months.\n\nLaunch 3 happens 2 years later, this time carrying the ion-propelled KRV. The KRV is launched to Duna on a chemical booster, but enters orbit using its engines.\n\nLaunch 4 happens at the same time as Launch 3. This launch has a copy of the Hab Module, but this time, its manned by a crew of 2 Kerbonauts.(This time, its Jeb and Val) The Hab II lands near the other 2 spacecraft, and the crew is unloaded onto the surface, where they stay for 7 months before departing into LDO. The crew use the DAV\u0027s command module to dock with the KRV, before taking a 3-month-long burn to reach Kerbin. The crew then enter the DAV\u0027s command module where they re-enter Kerbin\u0027s atmosphere and land.\n\nLets just hope this works."},{"CreatedByName":"VASMIR","CreatedById":143455,"CreatedDateTime":"2015-06-15T22:46:01Z","Content":"Delete this thread, as Dunashot will now be hosted on We Are the Explorers"}]}