{"TopicId":108249,"ForumId":69,"TopicTitle":"Something odd happened...then..well just read.","CreatedByName":"Pleco","CreatedById":143458,"CreatedDateTime":"2015-05-08T17:50:21Z","PageNum":1,"Articles":[{"CreatedByName":"Pleco","CreatedById":143458,"CreatedDateTime":"2015-05-08T17:50:21Z","Content":"I\u0027m pretty new to the game and not sure the steps I should take to report this, maybe someone can help.\n\nPlaying career mode, about 40 days in with apx 7 satellites in various mun orbits, including poor jeb stuck in orbit around the mun. My first sat. attempt to orbit the moon failed, and has since been escaping to a sun orbit with no propulsion. It was a good 4-6 million miles away(if I recall properly) when I selected it from tracking to see if I could get any deep space data from it. When I clicked to fly it it took me to proper screen, but I instantly shot up to around 7324856435724582349246557289459234923462645629067m/s and watched as the whole system vanished to a speck. I attempted to return to mission control, when I did, the typical money/rep/science bars were at the top along with the time meter on the bottom, but the center was still the view of space. It locked up, I had to shut it down from program manager. When I reloaded, all my satellites are gone...including poor Jeb. The only remaining vessel is the Kerbal I have landed on Minmus. All other stats/money/science is still there, and it appears I could continue on...which is fine. But, I figure if this can help by reporting it, I should. Any thoughts?\n\nedited: Quicksave data will load to previous game and has re-created the bug when I select the same satellite.\n\n**Edited \u003Ctime datetime=\u00222015-05-08T17:54:53Z\u0022 title=\u002205/08/2015 05:54  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 8, 2015\u003C/time\u003E by Pleco**"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2015-05-09T00:30:25Z","Content":"This happens from time to time, and most people call it a Kraken. The exact trigger isn\u0027t known, but when it happens it often eats the ship completely (and sometimes the save). Hopefully you have a quicksave from sometime recent. If you do, then you can copy it and rename it persistence.sfs (to replace the existing persistence). Then restart KSP and load it up!\n\nWelcome to the forums! ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\nCheers,\n\n~Claw"}]}