{"TopicId":108298,"ForumId":16,"TopicTitle":"Physics.cfg - what do the numbers mean?","CreatedByName":"BmB","CreatedById":42188,"CreatedDateTime":"2015-05-08T23:22:26Z","PageNum":1,"Articles":[{"CreatedByName":"BmB","CreatedById":42188,"CreatedDateTime":"2015-05-08T23:22:26Z","Content":"I\u0027ve been tweaking the numbers somewhat, greatly assisted by the debug menu which prevents you from having to restart every time. And while the Aero numbers are now fairly clear to me, the thermal numbers are also fairly opaque. Considering that the complete absence of re-entry heating is a key problem with 1.0.2, this is not good.\n\n    aeroFXStartThermalFX = 2aeroFXFullThermalFX = 3.5aeroFXExponent = 3\n\nStart and full is pretty obvious, it\u0027s a range between no aeroFX and full aeroFX. Is aeroFX purely the visual effect or does it affect heating? What is the unit? Is it mach number? Is it a multiplier of a hidden value? If so, what is that value? What is the exponent and what does it do?\n\n    thermalMaxIntegrationWarp = 100\n\nI can\u0027t even guess. I assume it\u0027s related to timewarping. Maybe it\u0027s the timewarp factor where something will happen. What will happen? Nobody knows.\n\n    solarLuminosityAtHome = 1360solarInsolationAtHome = 0.15\n\nPresumably this is some multiplier of solar power at 1 AU from Kerbol. Does it affect the visual brightness? Does it enable any kind of solar heating? Or is it just the amount of power generated by solar panels? What is the \u0022Insolation\u0022? Is it supposed to be insUlation? What does it insulate from? Is it related to heat? What is the unit of luminosity, is it lux? Candela? How does it relate to the power output or heating?\n\n    convectionDensityExponent = 1convectionVelocityExponent = 3convectionFactorSplashed = 300fullConvectionAreaMin = 0.2machConvectionStart = 2machConvectionEnd = 4machConvectionExponent = 3newtonianConvectionFactorBase = 2newtonianConvectionFactorTotal = 3convectionFactor = 40\n\nEverything convection related. Testing with the debug seems to reveal that convection is heat loss to an atmosphere. The factor is easy enough, just a multiplier for how fast convection occurs. The splashed factor is also pretty straightforward, same for how fast heat is lost to water.\n\nBut density and velocity exponents? What is that even? fullConvectionAreaMin? Is it the minimum area a part can lose heat from regardless of its actual area? What is the unit? Is it m^2?\n\nMach convection start-end, mach numbers? Almost has to be. Does it mean heat is lost faster to flying fast? Would make sense. Or does it mean all convection happens at a greater rate, including atmospheric heating? By how much is it increased? Is that what the exponent means??? Or is it another hidden value?\n\nWhat is newtonian convection? Excuse my ignorance. What is the difference between the base and the total?\n\nOverall this part is a big mystery to any would be tweakers.\n\n    spaceTemperature = 4fullToCrossSectionLerpStart = 0.8fullToCrossSectionLerpEnd = 1.5partEmissivityExponent = 4radiationFactor = 1NewtonianVelocityExponent = 1.5conductionFactor = 10internalHeatProductionFactor = 0.03aerodynamicHeatProductionFactor = 1standardSpecificHeatCapacity = 800\n\nEverything we missed. Again the factors are fairly easy. Conduction seem to be transfer between parts, presumably a multiplier of a part-specific value. Space temperature also would seem to be self explanatory, being the kelvin-value for how low the temperature of a given part can get? Seems utterly pointless to simulate a 4 degree difference but each to their own.\n\nBut what is a specific heat capacity? Is it in kelvins? With every other temperature in the game being measured this way it would make sense. What is a newtonian velocity? Why is part emissivity an exponent? What number specifically is it an exponent of? What is the cross section lerp? Is it related to the new cube system?\n\nOverall there\u0027s not a lot of useful information here, and with most of these values hidden from the debug menu meaningful testing is terribly slowed down by restarting the game every time. Far too tedious to bother with. It\u0027s all well and good that these numbers are exposed for advanced players to customize their game, but with no means to understand what most of the values do it\u0027s also fairly meaningless to have exposed them in the first place. Undocumented features do not exist."},{"CreatedByName":"Rhomphaia","CreatedById":2440,"CreatedDateTime":"2015-05-09T04:11:07Z","Content":"\u003E \n\u003E solarLuminosityAtHome = 1360solarInsolationAtHome = 0.15\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Presumably this is some multiplier of solar power at 1 AU from Kerbol. Does it affect the visual brightness? Does it enable any kind of solar heating? Or is it just the amount of power generated by solar panels? What is the \u0022Insolation\u0022? Is it supposed to be insUlation? What does it insulate from? Is it related to heat? What is the unit of luminosity, is it lux? Candela? How does it relate to the power output or heating?\n\n[http://en.wikipedia.org/wiki/Insolation](https://en.wikipedia.org/wiki/Insolation)"},{"CreatedByName":"adinfinitum","CreatedById":49226,"CreatedDateTime":"2015-05-09T06:18:50Z","Content":"I\u0027m pretty sure the thermalMaxIntegrationWarp is the highest warp speed that heat movement and dissipation is actually calculated. I\u0027d noticed when watching the heat on my nuclear tug that above 100x warp the temperature didn\u0027t seem to change, but I never looked into physics.cfg to see if it was actually a setting. I\u0027m not sure what raising it up to 1000 would do to your game though."},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-05-09T11:49:40Z","Content":"Specific heat capacity is a measure of how much heat energy it takes to increase something\u0027s temperature, the units are kilojoules per kelvin-ton (kJ/Kt). The standardSpecificHeatCapacity value is the default for all parts unless modified by their configs, and its value of 800 means it takes 800kJ of heat to raise the temperature of a 1 ton part by 1 Kelvin."},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2015-05-09T19:27:22Z","Content":"start therma and full thermal control when the white aeroFX start and finish changing to orange. They\u0027re mach numbers. The exponent is the exponent to velocity used in aeroFX for effect strength (3 is the same as the exponent used for velocity in convective heating).\n\nthermalMaxIntegrationWarp is the maximum warp rate at which thermodynamics are integrated (i.e. changed a little bit each frame). Beyond that, the resting temperature of the vessel is solved analytically by getting the sum of all fluxes except outgoing radiation and solving for the temperature where outgoing radiation balances them.\n\nsolarLuminosityAtHome describes the solar flux (in W) in Kerbin orbit. It\u0027s used for solar heating and solar panel power generation. solarInsolationAtHome describes how much solar flux is lost when you\u0027re at 1.225kg/m^3 atmosphere density with the sun directly overhead (i.e. you get 85% flux at sea level at noon at the equator).\n\nConvection is heat gain or loss from the fluid medium in which the vessel lies--gain or loss because you might cool if you\u0027re hotter, or on reentry gain heat...Two methods of convection are used: Newtonian convection, where the flux is equal to (external temperature - part temperature) \\* coefficient, and mach convection, where teh flux is proportional to density ^ convectionDensityExponent \\* velocity ^ convectionVelocityExponent \\* convectionFactor. The coefficient for Newtonian convection is based on density times newtonianConvectionFactorBase plus velocity ^NewtonianVelocityExponent, all times newtonianConvectionFactorTotal. If the part is splashed, convectionFactorSplashed is used instead.\n\nThe area used for convection starts as the radiative area (i.e. full wetted area) and then lerps down to just the exposed cross-sectional area. The lerping starts at fullToCrossSectionLerpStart and ends at fullToCrossSectionLerpEnd . fullConvectionAreaMin is added to the mach value first. However, it looks like a sign error, and it should have been subtracted instead; for that reason change it from 0.2 to -0.2.\n\nConvection lerps between netonian and mach convection using machConvectionStart and machConvectionEnd. However, it\u0027s not linear, instead it\u0027s machConvectionExponent (default cubic) interpolation, i.e. the interpolation values is ((mach - machConvectionStart) / (machConvectionEnd - machConvectionStart) ) ^ machConvectionExponent.\n\nspaceTemperature is the temperature of background radiation in space, so nothing will ever be colder than this. partEmissivityExponent is the exponent used in black-body radiation (4 is the real life value). conductionFactor is a multiplier to part-part conduction (which is also modified by the product of the two parts\u0027 heatConductivity fields, and by the minimum of the facing area between the parts). internalHeatProductionFactor is a multiplier to heat production from engines (an engine creates heatProduction \\* thrust / maxThrust / flowMultiplier \\* part.thermalMass \\* internalHeatProductionFactor watts of heat).\n\naerodynamicHeatProductionFactor is a multiplier to velocity used when figuring out shock temperature (\u0027external temperature\u0027).\n\nI suggest you not give up so easily. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"BmB","CreatedById":42188,"CreatedDateTime":"2015-05-09T22:13:56Z","Content":"I just want drag and lift values that are slightly more reasonable, and re-entry heating that actually matters. I feel like all of this stuff is terribly overcomplicating something that ought to be fairly simple for gameplays sake. The fact that deadly re-entry is still being worked on shows that something is quite amiss with the standard heating model. I don\u0027t really have the drive to spend hours on each setting, I really just want to play the game.\n\nAlso I found a real gem, apparantly the \u0022tempext\u0022 is equal to some calculated value for the atmosphere, which is fine in itself, hovering at about 30 degrees C at the KSC. But then is equal in kelvin to the airspeed in m/s when that value is greater than the ambient temperature.\n\nI have never heard of a direct conversion from m/s to kelvin like that before. Surely the \u0022external temperature\u0022 as such should be calculated by the ambient\\*compression \u002B friction? Not **math.max(ambient, m/s\\*aeroheating)**.\n\nAlso the developers should consider hungarian notation as these types of values are prime candidates for it. Prefixes could denote the units used, as well as the type of value that it is, which would shorten things like \u0022Exponent\u0022 considerably. For example a K\\_ or a W\\_ prefix for kelvin or watts. Or an Ex\\_ or Coeff\\_ for those types of values.\n\n**Edited \u003Ctime datetime=\u00222015-05-10T03:01:09Z\u0022 title=\u002205/10/2015 03:01  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 10, 2015\u003C/time\u003E by BmB**"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2015-05-11T08:34:43Z","Content":"\u003E \n\u003E I have never heard of a direct conversion from m/s to kelvin like that before. Surely the \u0022external temperature\u0022 as such should be calculated by the ambient\\*compression \u002B friction? Not **math.max(ambient, m/s\\*aeroheating)**.\n\nThat\u0027s the reality of the situation. The compressed shockwave in front of the vehicle (where front = the direction in which it is travelling regardless of orientation) has a temperature value in Kelvin equal to its velocity in m/s.\n\nThat is half of why reentry heating feels so weak. How often are you travelling even as fast as 3 km/s during reentry? Over Earth you\u0027ll be doing 7.8 km/s from orbit. Less when starting from suborbital. A Mun return... is what, 9 km/s? 10?\n\nA Minmus return doesn\u0027t provide the peak temperature of even 1/3rd of a Moon return to Earth. Coupled with the fact that you\u0027re spending 1/5th the time doing any really intense heating as you would be over Earth.\n\nThat\u0027s half of the problem. The other half is (because that\u0027s actually still quite a bit of heat) that in order to raise your temperature one degree, you have to absorb your mass \\* specific heat \\*thermal mass multiplier. And by mass, I mean the mass for the entire part. In reality, only a fraction of that mass would matter: The mass of the skin of the spacecraft in the area actually undergoing convection heating. (for a capsule, the bottom area)\n\nThe skin issue is the only real oversight that I consider to exist in the new model. The rest of it (peak heating / heat load) is an unfortunate and unavoidable problem stemming from doing a reentry over such a small planet. To mitigate it means dealing with multipliers and exponents and there\u0027s no way around that part. (except to have real solar system sized planets, and that\u0027s not for everyone)"},{"CreatedByName":"selfish_meme","CreatedById":125899,"CreatedDateTime":"2016-02-10T09:10:27Z","Content":"\u003E \n\u003E \n\u003E On 8 May 2015 at 5:27 AM, NathanKell said:\n\u003E \n\u003E \n\u003E start therma and full thermal control when the white aeroFX start and finish changing to orange. They\u0027re mach numbers. The exponent is the exponent to velocity used in aeroFX for effect strength (3 is the same as the exponent used for velocity in convective heating).\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E thermalMaxIntegrationWarp is the maximum warp rate at which thermodynamics are integrated (i.e. changed a little bit each frame). Beyond that, the resting temperature of the vessel is solved analytically by getting the sum of all fluxes except outgoing radiation and solving for the temperature where outgoing radiation balances them.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E solarLuminosityAtHome describes the solar flux (in W) in Kerbin orbit. It\u0027s used for solar heating and solar panel power generation. solarInsolationAtHome describes how much solar flux is lost when you\u0027re at 1.225kg/m^3 atmosphere density with the sun directly overhead (i.e. you get 85% flux at sea level at noon at the equator).\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Convection is heat gain or loss from the fluid medium in which the vessel lies--gain or loss because you might cool if you\u0027re hotter, or on reentry gain heat...Two methods of convection are used: Newtonian convection, where the flux is equal to (external temperature - part temperature) \\* coefficient, and mach convection, where teh flux is proportional to density ^ convectionDensityExponent \\* velocity ^ convectionVelocityExponent \\* convectionFactor. The coefficient for Newtonian convection is based on density times newtonianConvectionFactorBase plus velocity ^NewtonianVelocityExponent, all times newtonianConvectionFactorTotal. If the part is splashed, convectionFactorSplashed is used instead.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E The area used for convection starts as the radiative area (i.e. full wetted area) and then lerps down to just the exposed cross-sectional area. The lerping starts at fullToCrossSectionLerpStart and ends at fullToCrossSectionLerpEnd . fullConvectionAreaMin is added to the mach value first. However, it looks like a sign error, and it should have been subtracted instead; for that reason change it from 0.2 to -0.2.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Convection lerps between netonian and mach convection using machConvectionStart and machConvectionEnd. However, it\u0027s not linear, instead it\u0027s machConvectionExponent (default cubic) interpolation, i.e. the interpolation values is ((mach - machConvectionStart) / (machConvectionEnd - machConvectionStart) ) ^ machConvectionExponent.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E spaceTemperature is the temperature of background radiation in space, so nothing will ever be colder than this. partEmissivityExponent is the exponent used in black-body radiation (4 is the real life value). conductionFactor is a multiplier to part-part conduction (which is also modified by the product of the two parts\u0027 heatConductivity fields, and by the minimum of the facing area between the parts). internalHeatProductionFactor is a multiplier to heat production from engines (an engine creates heatProduction \\* thrust / maxThrust / flowMultiplier \\* part.thermalMass \\* internalHeatProductionFactor watts of heat).\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E aerodynamicHeatProductionFactor is a multiplier to velocity used when figuring out shock temperature (\u0027external temperature\u0027).\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E I suggest you not give up so easily. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\u003E \n\nI know this thread is quite old, but I could not really find a closer explanation of what I am looking for. I want to tone down the \u0027Mach Effects\u0027, not eliminate them completely but make them less obvious and to come in at higher speeds, the picture below illustrates a plane at about Mach 1.5, and it looks to be right on the edge of turning orange, in reality this type of plane could approach mach 2.8 without ever having a \u0027glow\u0027. I know that some missiles that take of very fast can have their nose cones glow white hot from heat, but I am not sure at what speed that glow is apparent, but I am guessing above Mach 5. Going by the above these seem to be the settings in physics.cfg that control the aerodynamic effects, but I am unsure if they cover the  start of the Mach Effects or just the start of the Orange glow.\n\n\u003E \n\u003E \n\u003E Quote\n\u003E \n\u003E \n\u003E aeroFXStartThermalFX = 2.5 // Speed in m/s when aeroFX starts changing from white to orange  \n\u003E \n\u003E aeroFXFullThermalFX = 3.75 // Speed in m/s when aeroFX is fully orange  \n\u003E \n\u003E aeroFXVelocityExponent = 3.5 // Exponent to velocity used when calculating aeroFX strength\n\u003E \n\nthe labelling seems to indicate they are in m/s and not Mach but I would think not.\n\nPicture of plane at Mach 1.5\n\n![VW9Z0wo.png](http://i.imgur.com/VW9Z0wo.png)\n\n**Edited \u003Ctime datetime=\u00222016-02-10T09:10:58Z\u0022 title=\u002202/10/2016 09:10  AM\u0022 data-short=\u00228 yr\u0022\u003EFebruary 10, 2016\u003C/time\u003E by selfish\\_meme**"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2016-02-10T17:40:37Z","Content":"Yes, they are in mach. Oops. That does mean they won\u0027t even start going orange until Mach 2.5, so you\u0027re not \u0022right on the edge\u0022 if you\u0027re at Mach 1.5. You\u0027ll want to mess with the first velocity exponent and density exponent to tune low altitude mach effects."},{"CreatedByName":"selfish_meme","CreatedById":125899,"CreatedDateTime":"2016-02-10T23:31:56Z","Content":"\u003E \n\u003E \n\u003E 5 hours ago, NathanKell said:\n\u003E \n\u003E \n\u003E Yes, they are in mach. Oops. That does mean they won\u0027t even start going orange until Mach 2.5, so you\u0027re not \u0022right on the edge\u0022 if you\u0027re at Mach 1.5. You\u0027ll want to mess with the first velocity exponent and density exponent to tune low altitude mach effects.\n\u003E \n\nCrazy new upvote button"}]}