{"TopicId":108323,"ForumId":16,"TopicTitle":"Sub-Orbital Question","CreatedByName":"Cyborg Pirate Ninja Jesus","CreatedById":143499,"CreatedDateTime":"2015-05-09T01:37:39Z","PageNum":1,"Articles":[{"CreatedByName":"Cyborg Pirate Ninja Jesus","CreatedById":143499,"CreatedDateTime":"2015-05-09T01:37:39Z","Content":"\n\u003Cp\u003ESo on the KSP Wiki the definition of sub-orbital claims that a craft in sub-orbital orbit will eventually \u0022collide with the body being orbited\u0022. That being said I\u0027ve had a craft in sub-orbit for the past 13 days (In-game) but I\u0027ve noticed no decrease in its orbit that would indicate it\u0027s orbit is decaying, which is what the wiki is suggesting imo. It could be that it just takes a lot longer than 13 days for this to become noticeable. Anyway my question is: Is the wiki correct and if so how long would it take for (very roughly) my craft to \u0022collide\u0022 with the planet?\u003C/p\u003E\u003Cp\u003EIf it helps my craft is orbiting Kerbin, has a Periapsis of 66.077m and a Apoapsis of 559,665m.\u003C/p\u003E\u003Cp\u003EApologizes if this has been asked before, I tried a few searches but couldn\u0027t find anything related.\u003C/p\u003E\u003Cp\u003ECPNJ\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-09T02:23:08Z\u0022 title=\u002205/09/2015 02:23  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 9, 2015\u003C/time\u003E by Cyborg Pirate Ninja Jesus\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Boomerang","CreatedById":92198,"CreatedDateTime":"2015-05-09T01:54:03Z","Content":"\n\u003Cp\u003EWhat I imagine happening is that you haven\u0027t been focused on that craft for those 13 days. So long as your periapsis is above something like 25-30km and you\u0027re focused on another craft or in the tracking station, the craft will be \u0027on rails\u0027 and atmospheric drag won\u0027t be calculated. \u003C/p\u003E\u003Cp\u003EIf you go to your sub-orbital craft and time warp, then each time you pass through the atmosphere around the periapsis, you\u0027ll notice your apoapsis drop due to drag and eventually the orbit will decay to the point that the craft crashes/burns up in reentry. \u003C/p\u003E\u003Cp\u003EThis is done so that the game isn\u0027t forced to do active physics calculations on -every- craft that you have floating around the system.\u003C/p\u003E\u003Cp\u003EEdit - Also, at 66km, the atmosphere is going to be -very- thin and you\u0027re going to be traveling at quite a clip with that high of an apoapsis, so it will take quite a while for your orbit to decay significantly -if- you\u0027re even focused on it.\u003C/p\u003E\n"},{"CreatedByName":"Aser","CreatedById":139420,"CreatedDateTime":"2015-05-09T01:57:34Z","Content":"\n\u003Cp\u003EWith a Periapsis of 66km, you\u0027re just barely inside the atmosphere. It\u0027ll slow you down a \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Elittle\u003C/span\u003E bit each pass. The atmosphere is so thin that high up it will probably only be ~100 meters (wild guess) change in your apoapsis each pass.\u003C/p\u003E\u003Cp\u003E^ninja\u003C/p\u003E\n"},{"CreatedByName":"Cyborg Pirate Ninja Jesus","CreatedById":143499,"CreatedDateTime":"2015-05-09T02:22:06Z","Content":"\n\u003Cp\u003EAhh so the orbit will decay over time but only if I\u0027m focused on the craft. Thats good to know as I was worried it might decay to the point of reentry whilst my attention is elsewhere.\u003C/p\u003E\u003Cp\u003EThanks for the speedy replies \u0026amp; info, much appreciated.\u003C/p\u003E\u003Cp\u003ECPNJ\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-05-09T13:39:44Z","Content":"\n\u003Cp\u003EPerapsis above 23km on kerbin, and no active craft nearby?\u003C/p\u003E\u003Cp\u003E-Stable orbit.\u003C/p\u003E\u003Cp\u003EIf it gets to within \u0022physics load range\u0022 of an active vessel, the atmosphere will start dragging it down.... which will happen fast at 24km...\u003C/p\u003E\u003Cp\u003E66km? you are safe for a long, long time, even if it was the active vessel.\u003C/p\u003E\n"}]}