{"TopicId":108391,"ForumId":69,"TopicTitle":"[OSX] Launch Clamp kind of stays attached?","CreatedByName":"justidutch","CreatedById":99185,"CreatedDateTime":"2015-05-09T13:56:07Z","PageNum":1,"Articles":[{"CreatedByName":"justidutch","CreatedById":99185,"CreatedDateTime":"2015-05-09T13:56:07Z","Content":"\n\u003Cp\u003EThis is my first bug report I\u0027ve filed, so I hope I do it properly. I\u0027ll describe the issue first:\u003C/p\u003E\u003Cp\u003EI built a (very large) ship in VAB last night, it took a long time because it\u0027s complex. I did a number of test launched throughout the build process to test out various aspects of it as I went. Quite frequently the ship exploded for various reasons, but that\u0027s okay, it was testing. But a couple of times I am sure, as a part exploded, I very briefly saw a launch clamp attached to the ship, and I think perhaps to the part that exploded.\u003C/p\u003E\u003Cp\u003EThis morning I completed the ship\u0027s construction and tried launching it for real, fully crewed, etc. Nearing the time when the first stage would separate (several thousand meters up), the ship exploded and I definitely, though very briefly, saw a launch clamp still attached to the ship (I believe to the part that exploded, I think it was a LFB KR-1x2 engine). So, I thought to post this in hopes that this could be researched and squashed. I created a zip folder with a screen shot, the .craft file and the .log file, which you can download from my personal website \u003Ca href=\u0022http://jscript.ca/ksp-images/Launch%20Clamp%20Bug.zip\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E. I didn\u0027t take a close look through the log file myself, it might include my entire morning\u0027s work and not just the launch itself.\u003C/p\u003E\u003Cp\u003EAlso, after the ship exploded, I tried reverting to the launch, then the KSP program hung up/crashed. Just so you know, the ship has about 500 parts.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EKSP version:\u003C/strong\u003E \u003C/p\u003E\u003Cp\u003Ebuild id = 00842\u003C/p\u003E\u003Cp\u003E2015-05-01_14-10-53\u003C/p\u003E\u003Cp\u003EBranch: master\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EWhat Happens:\u003C/strong\u003E \u003C/p\u003E\u003Cp\u003ECraft explodes, can briefly see a launch clamp still attached to ship several thousand meters up.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMods / Add-Ons:\u003C/strong\u003E \u003C/p\u003E\u003Cp\u003EAll Stock\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ESteps to Replicate:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E1) load .craft file contained in zip file (link is above)\u003C/p\u003E\u003Cp\u003E2) launch the ship\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EResult:\u003C/strong\u003E \u003C/p\u003E\u003Cp\u003EFor me, the ship explodes several thousand meters up, just a little bit before the first staging action should occur.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMy Machine:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E Model Name: MacBook Air\u003C/p\u003E\u003Cp\u003E Model Identifier: MacBookAir6,2\u003C/p\u003E\u003Cp\u003E Processor Name: Intel Core i7\u003C/p\u003E\u003Cp\u003E Processor Speed: 1.7 GHz\u003C/p\u003E\u003Cp\u003E Number of Processors: 1\u003C/p\u003E\u003Cp\u003E Total Number of Cores: 2\u003C/p\u003E\u003Cp\u003E L2 Cache (per Core): 256 KB\u003C/p\u003E\u003Cp\u003E L3 Cache: 4 MB\u003C/p\u003E\u003Cp\u003E Memory: 8 GB\u003C/p\u003E\u003Cp\u003E Boot ROM Version: MBA61.0099.B12\u003C/p\u003E\u003Cp\u003E SMC Version (system): 2.13f9\u003C/p\u003E\u003Cp\u003E Software: OS X 10.8.5 (12F2518)\u003C/p\u003E\u003Cp\u003E Graphics: Intel HD Graphics 5000 1024 MB\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-09T14:03:19Z\u0022 title=\u002205/09/2015 02:03  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 9, 2015\u003C/time\u003E by justidutch\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-05-10T18:06:59Z","Content":"\n\u003Cp\u003EThere seems to be a bug when you use a lot of launch clamps, I\u0027ve seen this on Linux and others have reported it on Windows, try to use as few launch clamps as possible.\u003C/p\u003E\n"}]}