{"TopicId":108473,"ForumId":16,"TopicTitle":"Transmit Science bug?","CreatedByName":"Cardano","CreatedById":143056,"CreatedDateTime":"2015-05-09T22:06:00Z","PageNum":1,"Articles":[{"CreatedByName":"Cardano","CreatedById":143056,"CreatedDateTime":"2015-05-09T22:06:00Z","Content":"\n\u003Cp\u003EOK - I\u0027ve been playing for more than a year now so I\u0027ve transmitted science before -- but now in my career game I complete the transmission but no science is awarded.\u003C/p\u003E\u003Cp\u003EDid I miss something in the changelog about this? I\u0027ve now upgraded all the buildings once and most of them twice, but my big shiny MPL orbiting Mun with 500 science to transmit is not able to achieve anything.\u003C/p\u003E\u003Cp\u003Efor the record, I\u0027m playing on a steam version and I \u0027deleted local content\u0027 before the 1.0 arrival to attempt to get a clean install - however I did not nuke the whole folder - in case there is a bad old file that is causing this.\u003C/p\u003E\u003Cp\u003Eplease let me know if anyone else has run into this kind of issue before.\u003C/p\u003E\u003Cp\u003EThanks,\u003C/p\u003E\u003Cp\u003ECardano.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-09T23:21:56Z\u0022 title=\u002205/09/2015 11:21  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 9, 2015\u003C/time\u003E by Cardano\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Anquietas314","CreatedById":8761,"CreatedDateTime":"2015-05-09T22:22:15Z","Content":"\n\u003Cp\u003EYou need to click the \u0022start research\u0022 button on the MPL\u0027s action menu before it\u0027ll do anything (requires data and power). Transmitting doesn\u0027t do anything until you have at least 1.0 science stored \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Cardano","CreatedById":143056,"CreatedDateTime":"2015-05-09T22:33:59Z","Content":"\n\u003Cp\u003EThanks - Have already done that and it\u0027s got 500 data and 500 science now - so It\u0027s time to clean it out by sending all that info home.\u003C/p\u003E\u003Cp\u003Efor what it\u0027s worth - I started a completely new career game - flew a mission to buy the communitron -and tried on the launch pad to transmit a crew report.\u003C/p\u003E\u003Cp\u003Eit took time and energy and said it transmitted, but I got no science back in the space center screen and I can attempt to do the same crew report for the same value transmit again ( like it knows it didnt go through ) \u003C/p\u003E\u003Cp\u003Eso either it\u0027s my install or some other corrupt file.\u003C/p\u003E\u003Cp\u003EI just wanted to be sure that it wasnt some feature I had missed in reading the release notes ( like \u0027 you must upgrade mission control to level 2 before you can transmit science \u0027 or \u0027you have to build a *thingy* to transmit science ) .\u003C/p\u003E\u003Cp\u003EThanks,\u003C/p\u003E\u003Cp\u003ECardano\u003C/p\u003E\n"},{"CreatedByName":"TheMoonRover","CreatedById":136199,"CreatedDateTime":"2015-05-09T23:02:49Z","Content":"\n\u003Cp\u003EIf you have enough power and an antenna on your ship to transmit data, and are in career mode (or science mode), it should work. If it weren\u0027t for the fact that you said it was a new save for 1.0 I would say it\u0027s likely something wrong with the save file. It still might be, but it\u0027s not as likely.\u003C/p\u003E\u003Cp\u003EYou don\u0027t happen to be using Linux in a foreign language do you? That can mess up the numbers.\u003C/p\u003E\u003Cp\u003EHave you tried closing and reopening the game? That might fix it.\u003C/p\u003E\u003Cp\u003EOtherwise yes it\u0027s probably the install or a corrupt save file. Or possibly a mod conflict.\u003C/p\u003E\n"},{"CreatedByName":"Cardano","CreatedById":143056,"CreatedDateTime":"2015-05-09T23:35:10Z","Content":"\n\u003Cp\u003EThanks - I will probably wind up nuking everything and downloading a new clean install.\u003C/p\u003E\u003Cp\u003EMods installed : AVC / Precise Node / MechJeb / EngineerRedux / NavBallScale\u003C/p\u003E\u003Cp\u003EWindows - Steam - English\u003C/p\u003E\u003Cp\u003Etried closing / rebooting / new career game\u003C/p\u003E\u003Cp\u003EYou see the Communitron extend and the packets transmit - and the energy go away - but after it says \u0027Done\u0027 then i get no change in Science total.\u003C/p\u003E\u003Cp\u003Eoh well - i wanted to make my career progression a little more clean on a new game anyway - I only ever flew jeb before so my scientists and engineers were going to have to take some training flights anyway.\u003C/p\u003E\u003Cp\u003Eall the help is appreciated.\u003C/p\u003E\u003Cp\u003EThanks,\u003C/p\u003E\u003Cp\u003ECardano.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EAnd that fixed it.\u003C/p\u003E\u003Cp\u003EBummer for the dead Mun MPL mission and starting a new career game - Yea! for being able to re-do career knowing more about it this time.\u003C/p\u003E\u003Cp\u003EThanks for the help.\u003C/p\u003E\u003Cp\u003ECardano\u003C/p\u003E\n"},{"CreatedByName":"mcalisi","CreatedById":146056,"CreatedDateTime":"2015-06-13T06:59:49Z","Content":"\n\u003Cp\u003EWhat fixed it? I have a base on the Mun that has this error, the Communotron is stuck extended, it says it is transmitting still after the \u0022Done\u0022 message appears, no science rewarded or removed. If I click on abort transmission, it get\u0027s stuck on \u0022Aborting Transmission\u0022. In the debug menu, there is an error that reads \u003C/p\u003E\u003Cp\u003E\u0022[Error]: [R\u0026amp;D]: No Science Subject found with id sciencelab@Mun\u0022.\u003C/p\u003E\u003Cp\u003EI have four other research labs that work fine, but this one is broken.\u003C/p\u003E\n"},{"CreatedByName":"Soda Popinski","CreatedById":92416,"CreatedDateTime":"2015-06-18T15:07:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mcalisi\u0022 data-cite=\u0022mcalisi\u0022\u003E\u003Cdiv\u003EWhat fixed it? I have a base on the Mun that has this error, the Communotron is stuck extended, it says it is transmitting still after the \u0022Done\u0022 message appears, no science rewarded or removed. If I click on abort transmission, it get\u0027s stuck on \u0022Aborting Transmission\u0022. In the debug menu, there is an error that reads \u003Cp\u003E\u0022[Error]: [R\u0026amp;D]: No Science Subject found with id sciencelab@Mun\u0022.\u003C/p\u003E\u003Cp\u003EI have four other research labs that work fine, but this one is broken.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESame exact error. Any fixes? May have to edit the save game at this point. Just not sure what to do.\u003C/p\u003E\n"},{"CreatedByName":"Val","CreatedById":126227,"CreatedDateTime":"2015-06-18T15:15:43Z","Content":"\n\u003Cp\u003EI had a similar issue, where it wouldn\u0027t transmit data, even though the antenna extended. Turned out that the antenna was mounted too close to a service bay, and the antenna would only function when the service bay was open.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-18T15:21:34Z\u0022 title=\u002206/18/2015 03:21  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 18, 2015\u003C/time\u003E by Val\u003C/strong\u003E\n\u003Cbr\u003EGrammar\n\u003C/span\u003E\n"},{"CreatedByName":"mcalisi","CreatedById":146056,"CreatedDateTime":"2015-06-25T04:04:47Z","Content":"\n\u003Cp\u003EAfter the reinstall was unsuccessful in clearing the issue, I decided to take advantage of the unique design of my research base. It was built to carry two docked rovers to the moon with me, each of which were held attached by a junior docking ring, each of which carried the only antennae installed on the base. The first of the rovers was damaged during initial exploration, the second held the bugged antenna. I detached the rover, drove it a considerable distance from the base, and destroyed it to eliminate the bug. I then launched an autonomous rover equipped with a claw to land on the moon. After successfully landing only 3 km from the base, I drove over and attached to the base. Its antenna was able to successfully transmit the science data home, and since I loaded it with a few new science implements, I was able to increase the science production at the same time.\u003C/p\u003E\n"},{"CreatedByName":"BUJI","CreatedById":150390,"CreatedDateTime":"2015-08-28T16:26:17Z","Content":"\n\u003Cp\u003EI had this same problem. Had a roving science lab on Mun that was full of science like a thanksgiving turkey, it would transmit to 100% and then just start over again. Sometimes I would leave it to go check on another ship and come back to try it again to find it stuck etc. I fixed it by sending chauffeuringineer Bill out with a KAS wrench, removed the antenna, and re-attached it. Worked like a charm after that. I have KIS, KAS, Planetshine, and EVE installed mods and that\u0027s it.\u003C/p\u003E\n"},{"CreatedByName":"ManuxKerb","CreatedById":139441,"CreatedDateTime":"2016-01-06T14:39:06Z","Content":"\n\u003Cp\u003E\nHi Fellow kerbonauts,\n\u003C/p\u003E\n\u003Cp\u003E\nIm hitting the same issue.\n\u003C/p\u003E\n\u003Cp\u003E\nBut if i click \u0022Transfer science\u0022 just nothing happens. Note that my antenae is also not on the module itself but on the emergency return capsule with a heat shield and debaupler in between. But normal science transmision does work. Just not the one from the MPL.\n\u003C/p\u003E\n\u003Cp\u003E\nAny Ideas ?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"battlekruiser","CreatedById":158966,"CreatedDateTime":"2016-02-20T09:22:17Z","Content":"\n\u003Cp\u003E\nI have similar problem. When I click on \u0022transmit data\u0022 it acts just like it\u0027s really transmitting (power consumption, time, antenna moving) but no science is granted. When I unfold tab displaying money, it then says zero money and a blank window for science. This seems to happen when I load quicksaves and possibly when I cross SOI, so reloading save fixes it most of the time (also fixed transmission is like 5 times or so faster than broken) though I have some craft on moho orbit which don\u0027t seem to fix. Science labs works mostly good. Save is good old, so new game is unwanted solution.\n\u003C/p\u003E\n\u003Cp\u003E\nGame version 1.0.5, 64-bit.\n\u003C/p\u003E\n\u003Cp\u003E\nMods installed: Toolbar plugin, Ambient light adjustment, Community resource pack, CrossFeed Enabler, Interstellar Fuel Switch, Kerbal attachment system, Kerbal Engineer redux, Kerbal joint reinforcement, Kerbal inventory system, Infernal robotics, OpenResourceSystem, Planetshine, Precise node, RCS sounds, TAC Life support, Kerbal Alarm Clock, Tweakscale, ModuleManager, Persistent thrust, solar sail navigation plugin and KSP Interstellar extended.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-02-20T18:20:11Z","Content":"\n\u003Cp\u003E\nSo here\u0027s one thing I\u0027ve noticed about the \u0022transmit science\u0022 option for the MPL:\n\u003C/p\u003E\n\u003Col\u003E\u003Cli\u003E\nI tell it \u0022transmit science\u0022\n\u003C/li\u003E\n\u003Cli\u003E\nThere\u0027s a long, slow period while it does the transmitting, and I can watch the \u0022percentage complete\u0022 gradually increase\n\u003C/li\u003E\n\u003Cli\u003E\nIt gets to 100%\n\u003C/li\u003E\n\u003Cli\u003E\nIt says \u0022done\u0022\n\u003Cul\u003E\u003Cli\u003E\n\u003Cspan style=\u0022font-size:10px;\u0022\u003ENote, this is a novel use of the word \u0022done\u0022 with which you are likely unfamiliar, because it isn\u0027t actually done and nothing important has happened yet\u003C/span\u003E\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EThere is a pause of 2-3 seconds \u003C/strong\u003E\u003Cspan style=\u0022font-size:9px;\u0022\u003Efor no readily identifiable reason\u003C/span\u003E\n\u003C/li\u003E\n\u003Cli\u003E\nI actually get the science \u0022deposited in my account\u0022\n\u003Cul\u003E\u003Cli\u003E\n\u003Cspan style=\u0022font-size:9px;\u0022\u003EThis is the step that \u003Cem\u003E\u003Cu\u003Eactually matters\u003C/u\u003E\u003C/em\u003E.  This is where the science is actually transferred out of the lab.\u003C/span\u003E\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003C/ol\u003E\u003Cp\u003E\nThat step #5 has bitten me several times.  Because what I typically do is,\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nSwitch to the MPL so I can clean out the science\n\u003C/li\u003E\n\u003Cli\u003E\nImpatiently wait a loooong time until it\u0027s finished transmitting\n\u003C/li\u003E\n\u003Cli\u003E\nI see the \u0022Done!\u0022 notification\n\u003C/li\u003E\n\u003Cli\u003E\nI immediately \u003Cspan style=\u0022font-size:10px;\u0022\u003E(without waiting, \u0027coz I\u0027m impatient by this time)\u003C/span\u003E switch back to KSC\n\u003C/li\u003E\n\u003Cli\u003E\n\u0022Hey, where\u0027s my science?!\u0022\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nAnd what happened here:  I switched away from the lab \u003Cstrong\u003Eimmediately when I saw the \u0022done\u0022 notification\u003C/strong\u003E (i.e. at step #4), and I didn\u0027t wait a few seconds (step #5), and thereby switched away before step #6, which is the step that really counts.\n\u003C/p\u003E\n\u003Cp\u003E\nThe good news is that the science isn\u0027t lost; the only thing that\u0027s wasted is my time, and the electricity it consumed while trying to transmit.  If I go back to the science lab, the science is still sitting there, waiting to be transmitted, so I can go through the rigamarole again, only more patiently.\n\u003C/p\u003E\n\u003Cp\u003E\nNo idea if that\u0027s the thing that\u0027s biting the various posters on this thread, but I\u0027ve been bitten by it \u003Cem\u003E\u003Cu\u003Erepeatedly\u003C/u\u003E\u003C/em\u003E (despite knowing about the problem!), so it wouldn\u0027t be surprising if it\u0027s responsible for at least some of the woes I\u0027m reading about here.  \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-02-20T18:23:13Z\u0022 title=\u002202/20/2016 06:23  PM\u0022 data-short=\u00228 yr\u0022\u003EFebruary 20, 2016\u003C/time\u003E by Snark\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"battlekruiser","CreatedById":158966,"CreatedDateTime":"2016-02-21T14:19:09Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222420299\u0022 data-ipsquote-contentid=\u0022108473\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221455960137\u0022 data-ipsquote-userid=\u0022158966\u0022 data-ipsquote-username=\u0022battlekruiser\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 20.02.2016 at 0:22 PM, battlekruiser said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI have similar problem. When I click on \u0022transmit data\u0022 it acts just like it\u0027s really transmitting (power consumption, time, antenna moving) but no science is granted. When I unfold tab displaying money, it then says zero money and a blank window for science. This seems to happen when I load quicksaves and possibly when I cross SOI, so reloading save fixes it most of the time (also fixed transmission is like 5 times or so faster than broken) though I have some craft on moho orbit which don\u0027t seem to fix. Science labs works mostly good. Save is good old, so new game is unwanted solution.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nFor some reason, my bugged Moho satellite became fixed when I set anthenna to \u0022require complete\u0022 option. Will have to investigate that.\n\u003C/p\u003E\n\u003Cp\u003E\n____\n\u003C/p\u003E\n\u003Cp\u003E\nSwitching it back to \u0022allow partioal\u0022 mode made it bugged again, and next switch didn\u0027t work. It seems that Alt\u002BTab is messing with it too. At this point, reloading a quicksave seems to fix it, but not always.\n\u003C/p\u003E\n\u003Cp\u003E\n____\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve moved from fullscreen mode to windiwed and from x64 \u0022patch\u0022 to normal. For now, it ssems fine.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-02-22T10:10:19Z\u0022 title=\u002202/22/2016 10:10  AM\u0022 data-short=\u00228 yr\u0022\u003EFebruary 22, 2016\u003C/time\u003E by battlekruiser\u003C/strong\u003E\n\u003Cbr\u003EFurther investigations\n\u003C/span\u003E\n"}]}