{"TopicId":108599,"ForumId":70,"TopicTitle":"Updating to 1.0? Mods, crafts compatibility etc.","CreatedByName":"MrUberGr","CreatedById":78026,"CreatedDateTime":"2015-05-10T15:36:41Z","PageNum":1,"Articles":[{"CreatedByName":"MrUberGr","CreatedById":78026,"CreatedDateTime":"2015-05-10T15:36:41Z","Content":"\n\u003Cp\u003EHello. I had been playing for quite some time, until a few months ago. Now with the release of 1.0 I\u0027ve decided to restart. However, I have some questions.\u003C/p\u003E\u003Cp\u003EFirst and foremost, what will happen to the 400\u002B crafts I\u0027ve made over time? Most, if not all include mod parts, from mods such as tweakscale, firespitter, mechjeb, spaceplane plus etc. For one, I know spaceplane has been integrated to the full game. What about the rest. If I were to reinstall them, would I be able to play?\u003C/p\u003E\u003Cp\u003ESecondly, has anything changed considering non-steam updates? I had purchased from the website and wasn\u0027t able to transfer over to steam, for better or worse!\u003C/p\u003E\u003Cp\u003EThanks a bunch!\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-05-10T15:40:42Z","Content":"\n\u003Cp\u003EWell, I\u0027d back up all my saves and craft first.\u003C/p\u003E\u003Cp\u003EModded craft and saves may break if the mods they use have not been updated or have changed significantly, even stock saves and craft may break which is why it\u0027s important to make back-ups.\u003C/p\u003E\u003Cp\u003EThe patcher is AWOL so non-Steam updates require a full re-download.\u003C/p\u003E\u003Cp\u003EHope this helps \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"MrUberGr","CreatedById":78026,"CreatedDateTime":"2015-05-10T15:52:24Z","Content":"\n\u003Cp\u003EAnd where does one shop for mods these days? Google says curse, and \u0022kerbalstuff\u0022? What the 2nd?\u003C/p\u003E\u003Cp\u003EAd one last thing. I hear that the new aerodynamic model is pretty challenging. How does it match up to stock pre-1.0 KSP and Far pre-1.0\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-05-10T16:05:00Z","Content":"\n\u003Cp\u003ECurse is providing addon hosting for Squad, and there\u0027s player provided sites like \u003Ca href=\u0022https://kerbalstuff.com/\u0022 rel=\u0022external nofollow\u0022\u003EKerbalstuff\u003C/a\u003E and \u003Ca href=\u0022http://kerbalx.com/\u0022 rel=\u0022external nofollow\u0022\u003EKerbalX\u003C/a\u003E for craft and the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/100067-The-Comprehensive-Kerbal-Archive-Network-%28CKAN%29-Package-Manager\u0022 rel=\u0022external nofollow\u0022\u003EComprehensive Kerbal Archive Network\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EAero is changed yes, you won\u0027t be able to wing-spam as drag will keep your speed down, and there\u0027s no infiniglide anymore, it\u0027s best you just try it for yourself \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"MrUberGr","CreatedById":78026,"CreatedDateTime":"2015-05-10T16:19:57Z","Content":"\n\u003Cp\u003EHuh, I go to my account, click on \u0022download\u0022 and I\u0027m prompted to re-buy the game. Am I supposed to download from somewhere else?\u003C/p\u003E\n"}]}