{"TopicId":108500,"ForumId":16,"TopicTitle":"Are LV-N\u0027s still worth it?","CreatedByName":"BlackAdder128","CreatedById":111431,"CreatedDateTime":"2015-05-10T00:18:56Z","PageNum":1,"Articles":[{"CreatedByName":"BlackAdder128","CreatedById":111431,"CreatedDateTime":"2015-05-10T00:18:56Z","Content":"I\u0027ve recently been playing with some unmanned probe designs in 1.0.2, and I happened to notice that for my initial designs, nuclear engines seem to give me less delta-V per weight, cost, and part than Terriers or Poodles, even when I dump the oxidizer. Is there something I\u0027m doing wrong? Anyone else find a good home for LV-N\u0027s in their designs?"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-05-10T00:26:05Z","Content":"Well, LV-Ns are heavy. That\u0027s probably the biggest culprit here.\n\nBut the RTGs are so expensive in comparison... Even the fuel cells are cheaper by a few orders of magnitude!"},{"CreatedByName":"jarmund","CreatedById":126888,"CreatedDateTime":"2015-05-10T00:30:00Z","Content":"While writing this, my 9-man duna expedition is orbiting duna with its lander slowing down in the upper atmosphere. The mothership consists of mostly MK3 parts (because I only need oxidizer for the lander), equipped with 2x LV-Ns, and what I noticed is this:\n\n1) They\u0027re not as efficient as they used to be (at least not in my use case), so I\u0027ll have to use another fuel tank for future designs.\n\n2) I will need to upgrade to 4x LV-Ns, as its TWR is horrible as it is.\n\nThey\u0027re worth it, but not as much as before, in my opinion. Personally, I think this is a good thing, because that will give other engines some attention too. In pre-1.0, pretty much all interplanetary ships used LV-Ns after a while, and its efficiency allowed you to go almost anywhere. Now, combinations and careful considerations dictate the engine choice rather than just choosing how many LV-Ns to stick on there."},{"CreatedByName":"Gaarst","CreatedById":126740,"CreatedDateTime":"2015-05-10T00:39:30Z","Content":"They are worth it for heavy crafts. IMO 20 ton is a good limit: lv-909 (or others) are better under 20t, and the lv-n is better over 20t."},{"CreatedByName":"BlackAdder128","CreatedById":111431,"CreatedDateTime":"2015-05-10T00:57:01Z","Content":"Good answers, thanks! I\u0027ll probably stick with the lighter engines for my travel stage on probes, and try to make the LV-Ns work on motherships. I guess if inter-planetary travel is too efficient, there\u0027s no incentive to play around with mining bases. I\u0027m enjoying the fact that setting up stations now makes sense in career mode (so far, I like the structure). But I\u0027ve been really looking forward to building a monstrocity to go \u0022colonize\u0022 Jool\u0027s SOI."},{"CreatedByName":"windows_x_seven","CreatedById":112926,"CreatedDateTime":"2015-05-10T01:02:53Z","Content":"I never really used the LV-N, as I preferred the Skipper (Oh god that engine is ***PERFECT***) and other engines.\n\nThough now you can use jet fuel with the LV-N, so crafts using it should be somewhat lighter now, and carry more fuel."},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2015-05-10T02:50:56Z","Content":"I still can\u0027t quite get a grasp on the attraction to the Skipper. According to my calculations, in 1.0 it\u0027s both less efficient and has an inferior TWR to a cluster of LV-T30/45 engines, while the Mainsail, which unlocks one node later, is far more powerful and efficient."},{"CreatedByName":"dryer_lint","CreatedById":162541,"CreatedDateTime":"2015-05-10T02:59:01Z","Content":"B-b-but... the ***Skipper***, man\n\nI don\u0027t know what it is, but something about the Skipper is just awesome ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)"},{"CreatedByName":"Gargamel","CreatedById":64714,"CreatedDateTime":"2015-05-10T03:04:10Z","Content":"\u003E \n\u003E They are worth it for heavy crafts. IMO 20 ton is a good limit: lv-909 (or others) are better under 20t, and the lv-n is better over 20t.\n\nIf that\u0027s your heavy.... \n\nPrevious versions my ultralightweight ships were 20t. What would you recommend for the 700t ship I used to run? ![:cool:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif)\n\nAnd yes, I attend the grand holy church of whackjob."},{"CreatedByName":"Rhomphaia","CreatedById":2440,"CreatedDateTime":"2015-05-10T03:21:29Z","Content":"\u003E \n\u003E I still can\u0027t quite get a grasp on the attraction to the Skipper. According to my calculations, in 1.0 it\u0027s both less efficient and has an inferior TWR to a cluster of LV-T30/45 engines, while the Mainsail, which unlocks one node later, is far more powerful and efficient.\n\nNot sure where you get that from. skippers ISP is tied with T30 in atmo, tied with the T45 in vacuum and has a better twr than either in any circumstance (except maybe Eve surface)"},{"CreatedByName":"saskwach","CreatedById":57658,"CreatedDateTime":"2015-05-10T03:42:09Z","Content":"I just sent a station to interplanetary orbit, and the LV-N gave me less dV than the poodle I ended up with. Maybe I forgot to drain the oxidizer? I don\u0027t know, but it felt wrong.\n\nEdit: Whoops, I just checked on that ship (dry mass 18,440kg), and if I drain all the oxidizer out I get 4637 m/s with an LV-N (.18 TWR though...gag) and 3755 with the poodle and the ox back in. If I use 2 extra LV-Ns on the drop tanks, my TWR goes up to .46(max .63) (then .32(max .40) after dropping) and my dV goes down to 4,111 m/s. Those suckers are HEAVY. Incidentally, the poodle got me a TWR from .51 to 1.80. For about 1km/s.\n\nSo LV-Ns can still be worth while, but you have to accept the really low TWR or else you cut into your dV savings. Plus, you have to think about cooling them because they\u0027re HOT.\n\n**Edited \u003Ctime datetime=\u00222015-05-10T03:59:46Z\u0022 title=\u002205/10/2015 03:59  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 10, 2015\u003C/time\u003E by saskwach**\n  \ndata"},{"CreatedByName":"Pax Kerbana","CreatedById":129558,"CreatedDateTime":"2015-05-10T05:29:58Z","Content":"Show me your calculations."},{"CreatedByName":"Lupus Irae","CreatedById":131480,"CreatedDateTime":"2015-05-10T06:05:04Z","Content":"\u003E \n\u003E .....Plus, you have to think about cooling them because they\u0027re HOT.\n\nPerhaps the amount of cooling they require is a bug, or a change they did not intend to make? Hopefully so."},{"CreatedByName":"Kibble","CreatedById":131042,"CreatedDateTime":"2015-05-10T06:07:23Z","Content":"The more realism you add, the less nuclear rocket engines are worth it."},{"CreatedByName":"Pixel of Life","CreatedById":45646,"CreatedDateTime":"2015-05-10T06:17:59Z","Content":"\u003E \n\u003E They are worth it for heavy crafts. IMO 20 ton is a good limit: lv-909 (or others) are better under 20t, and the lv-n is better over 20t.\n\nFrom what I\u0027ve seen, that limit is somewhere between 60t and 100t."},{"CreatedByName":"Renegrade","CreatedById":96629,"CreatedDateTime":"2015-05-10T06:26:57Z","Content":"NOte that when building LV-N designs, it\u0027s most efficient to use the spaceplane parts. While LF/O tanks have a 9:1 ratio, that\u0027s only if you\u0027re using the oxidizer. As an example, a FL-T800 has a dry mass of 0.5, and carries 4t of LF/O, or 1.8t of LF. Those are mass ratios of 9:1 and 3.6:1 respectively. By comparison, even the crappy mk1 jet fuel tank has a ratio of 6:1, and the better mk2 parts have 8:1. Using only LF simulates the bulky, inefficient tankage of H2 in a real NTR.\n\nI\u0027d support toggle-able tanks, but only if they obey these ratios (ex. for a T800, it should hold 4T of LF\u002BO, or be toggle-able to hold 3.5t of LF-only). \n\n(I\u0027m not sure why the jet fuel tank\u0027s ratio is lower ratio than the mk2 or mk3 parts though)\n\n\u003E \n\u003E I still can\u0027t quite get a grasp on the attraction to the Skipper. According to my calculations, in 1.0 it\u0027s both less efficient and has an inferior TWR to a cluster of LV-T30/45 engines, while the Mainsail, which unlocks one node later, is far more powerful and efficient.\n\nWat? While the Mainsail has some TWR advantage, it\u0027s about three percent less efficient in terms of specific impulse and *double* the mass of the Skipper.\n\nThe T30 comes nowhere near in terms of TWR (and the T45 even less so), and only the T45 can match the Skipper\u0027s specific impulse. Granted if you have a small, light ship, the mass difference for the T30/45 may become important at some point..but that point might not exist as the 909 may overrun it. I scribbled up simple software that can make charts like Tavert\u0027s, but I haven\u0027t updated it with 1.0.x stats yet (due to lazy. Also due to busy but the lazy answer is sillier)."},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2015-05-10T07:05:31Z","Content":"\u003E \n\u003E B-b-but... the ***Skipper***, man\n\u003E I don\u0027t know what it is, but something about the Skipper is just awesome ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)\n\nI know what you mean, sometimes it is not the best choice on paper but I do like the skipper."},{"CreatedByName":"Jouni","CreatedById":97346,"CreatedDateTime":"2015-05-10T14:21:28Z","Content":"The Skipper has been a good general-purpose since the engine rebalancing in 0.24. It has good TWR, good sea level Isp, and good vacuum Isp, and the size is also about right. You can use it as the main engine when launching small payloads, in the upper stage when launching medium payloads, and as a vacuum engine in large ships. No other engine is as widely useful as the Skipper."},{"CreatedByName":"BlackAdder128","CreatedById":111431,"CreatedDateTime":"2015-05-10T14:27:42Z","Content":"Gotta agree that the Skipper is a good mid-stage engine with decent TWR and efficiency. The mainsail is a better lifter for anything not ultra-light, but when I\u0027m playing career and don\u0027t have the ARM rockets yet, it\u0027s also my favorite asparagus."}]}