{"TopicId":108681,"ForumId":55,"TopicTitle":"OS X App Signing Please!","CreatedByName":"jshier","CreatedById":57571,"CreatedDateTime":"2015-05-10T22:40:45Z","PageNum":1,"Articles":[{"CreatedByName":"jshier","CreatedById":57571,"CreatedDateTime":"2015-05-10T22:40:45Z","Content":"\n\u003Cp\u003EI know this has been posted before but it bears repeating: please buy an app certificate from Apple and sign the app and launcher bundles as I know Unity can do. This may have been acceptable during development but a 1.0 game that still doesn\u0027t get through the Gatekeeper check automatically is rather silly.\u003C/p\u003E\n"},{"CreatedByName":"Murph","CreatedById":90837,"CreatedDateTime":"2015-05-10T22:50:18Z","Content":"\n\u003Cp\u003EAbsolutely, this should be a short term priority to get sorted out. It should be fairly easy to do, and is low cost. Here\u0027s where to sign up:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://developer.apple.com/devcenter/mac/index.action\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://developer.apple.com/devcenter/mac/index.action\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s also the first step towards being able to sell the game via the Mac App Store, which should be a positive thing as well.\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2015-05-11T02:01:43Z","Content":"\n\u003Cp\u003EI agree that this needs to be done.\u003C/p\u003E\n"},{"CreatedByName":"Fel","CreatedById":57121,"CreatedDateTime":"2015-05-11T04:25:31Z","Content":"\n\u003Cp\u003ESo... if you pay apple $100, or hack a weaker company to get their key, you can sign your own malicious software and get it past gatekeeper. (Generally, you want to self-sign executables, but I get how they market these things.)\u003C/p\u003E\u003Cp\u003EEither way, it really looks simple, pay Apple $100 (or use a third party with a shared key). Shouldn\u0027t be too difficult for SQUAD to do.\u003C/p\u003E\n"},{"CreatedByName":"Murph","CreatedById":90837,"CreatedDateTime":"2015-05-11T05:14:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fel\u0022 data-cite=\u0022Fel\u0022\u003E\u003Cdiv\u003ESo... if you pay apple $100, or hack a weaker company to get their key, you can sign your own malicious software and get it past gatekeeper. (Generally, you want to self-sign executables, but I get how they market these things.)\u003Cp\u003EEither way, it really looks simple, pay Apple $100 (or use a third party with a shared key). Shouldn\u0027t be too difficult for SQUAD to do.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe fee prevents people just signing up with throw away email accounts, and similar. Apple can, and do, revoke keys used maliciously or in violation of their developer agreements, with the OS regularly downloading the current revoked keys list. They can also block individual apps, rather than an entire developer, for cases where there\u0027s something which is problematic but not malicious. There has been signed malware in the past, I believe, and not just on Apple\u0027s platforms. It\u0027s not a high security system, but raises the bar quite significantly and adds risk of being traced by authorities for malicious acts.\u003C/p\u003E\u003Cp\u003EUsing a 3rd party key would be a quite silly thing for any legitimate developer, as your apps could get blacklisted due to improper behaviour by someone else.\u003C/p\u003E\u003Cp\u003EThe annual fee also gets you access to closed betas (and various other closed downloads), and the ability to publish via their App Store.\u003C/p\u003E\n"},{"CreatedByName":"mattinoz","CreatedById":118580,"CreatedDateTime":"2015-05-11T07:21:47Z","Content":"\n\u003Cp\u003EOn the plus side if Squad sign up they get Crash logs when you hit the \u0022Send Report\u0022 button. \u003C/p\u003E\u003Cp\u003EWhich should be good to crush a bug or two.\u003C/p\u003E\n"},{"CreatedByName":"Wallygator","CreatedById":97357,"CreatedDateTime":"2015-05-11T16:26:55Z","Content":"\n\u003Cp\u003EYes please! I support this request 100%.\u003C/p\u003E\n"},{"CreatedByName":"Hobbes Novakoff","CreatedById":129018,"CreatedDateTime":"2015-05-12T05:55:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mattinoz\u0022 data-cite=\u0022mattinoz\u0022\u003E\u003Cdiv\u003EOn the plus side if Squad sign up they get Crash logs when you hit the \u0022Send Report\u0022 button. \u003Cp\u003EWhich should be good to crush a bug or two.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA certificate would be nice, but this, and only this, would be amazing.\u003C/p\u003E\n"},{"CreatedByName":"spinomonkey","CreatedById":102142,"CreatedDateTime":"2015-05-12T13:24:06Z","Content":"\n\u003Cp\u003EWow. Why hasn\u0027t squad done this yet?\u003C/p\u003E\n"},{"CreatedByName":"Robotengineer","CreatedById":104525,"CreatedDateTime":"2015-05-12T13:32:02Z","Content":"\n\u003Cp\u003EIn addition to this, it would be nice to see KSP on the App Store.\u003C/p\u003E\n"}]}