{"TopicId":108787,"ForumId":51,"TopicTitle":"A Deddly Ascent [Stock, teamwork, no \u0026quot;simulations\u0026quot;] \u0026lt;now with PART 7\u0026gt;","CreatedByName":"Deddly","CreatedById":62955,"CreatedDateTime":"2015-05-11T17:46:03Z","PageNum":1,"Articles":[{"CreatedByName":"Deddly","CreatedById":62955,"CreatedDateTime":"2015-05-11T17:46:03Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003EPart 1\u003C/strong\u003E (this post)\u003Cbr\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/120826-A-Deddly-Ascent-Stock-teamwork-no-simulations?p=1935669\u0026amp;viewfull=1#post1935669\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003EPart 2\u003C/strong\u003E\u003C/a\u003E\u003Cbr\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/120826-A-Deddly-Ascent-Stock-teamwork-no-simulations?p=1936898\u0026amp;viewfull=1#post1936898\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003EPart 3\u003C/strong\u003E\u003C/a\u003E\u003Cbr\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/120826-A-Deddly-Ascent-Stock-teamwork-no-simulations?p=1957219\u0026amp;viewfull=1#post1957219\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003EPart 4\u003C/strong\u003E\u003C/a\u003E\u003Cbr\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/120826-A-Deddly-Ascent-Stock-teamwork-no-simulations?p=1968450\u0026amp;viewfull=1#post1968450\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003EPart 5\u003C/strong\u003E\u003C/a\u003E \u0022For Valentina\u0022\u003Cbr\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/120826-A-Deddly-Ascent-Stock-teamwork-no-simulations?p=2104533\u0026amp;viewfull=1#post2104533\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003EPart 6\u003C/strong\u003E\u003C/a\u003E \u0022Health and Safety\u0022\u003Cbr\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/120826-A-Deddly-Ascent-Stock-teamwork-no-simulations?p=2142674\u0026amp;viewfull=1#post2142674\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003EPart 7\u003C/strong\u003E\u003C/a\u003E \u0022a real, working flighty-type thing with wings!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nIt all started one hot summer day, when two rival companies decided to pool resources in order to accomplish the impossible: \u003Cstrong\u003ETo make something fly!\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nMany laughed at the ridiculous proposition. The idea of an object heavier than air levitating was simply preposterous. Nevertheless, Deddly Design began hiring the brightest and least terrified people who happened to walk in the door and marked out a large area on the ground where they would attempt to not blow things up. They termed this area the \u0022runway\u0022 because hopefully everyone would be able to run away from debris quickly enough to avoid getting hit by it.\n\u003C/p\u003E\n\u003Cp\u003E\nOnly days before, an exotic kind of goo had been invented - the latest \u0022wonder material\u0022 that everyone hoped would solve most of the world\u0027s problems. The brightest and only engineer on the team - Bill Kerman - came up with the theory that perhaps this exotic material could be collected in canisters and be used to levitate a simple capsule into the air. His calculations showed that, if controlled carefully, the capsule should easily get to Duna and back within three hours.\n\u003C/p\u003E\n\u003Cp\u003E\nAmongst great excitement, Bill personally rolled his design onto the \u0022runway\u0022 and climbed in. The mysterious goo was protected by specially-designed fins that Bill said would protect them from damage on landing.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot1.png\u0022 src=\u0022https://dl.dropboxusercontent.com/u/20576590/KSP/Deddly%20Ascent/screenshot1.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nEverything went just as planned, until Bill activated the goo canisters. First there was a pause, then a longer one. A short waiting period came next, which was followed by a moment of hesitation. After a few minutes, there was a time where nothing happened, then all fell silent.\n\u003C/p\u003E\n\u003Cp\u003E\nAlthough he was somewhat disappointed by the results, Bill managed to find 13 pieces of science just lying there in the dirt! He put them to good use right away, with the hopes that new materials and ideas would make the dream a reality.\n\u003C/p\u003E\n\u003Cp\u003E\nMeanwhile, Bill could see accross the grass (which, incidentally, appeared greener on the other side) that Ascent were busy making a roundish slab of concrete on the ground. He wondered how on earth they thought they would get that in the air. Fools.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-30T20:03:25Z\u0022 title=\u002211/30/2015 08:03  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 30, 2015\u003C/time\u003E by Deddly\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"JumpsterG","CreatedById":63396,"CreatedDateTime":"2015-05-11T19:00:50Z","Content":"\n\u003Cp\u003E\u0022Thread Tools\u0022 -\u0026gt; \u0022Subscribe to this thread...\u0022\u003C/p\u003E\u003Cp\u003ELooking forward to more. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"polan","CreatedById":131811,"CreatedDateTime":"2015-05-11T19:14:51Z","Content":"\n\u003Cp\u003EThis looks fabulous. Can\u0027t wait for more!\u003C/p\u003E\n"},{"CreatedByName":"Ascent","CreatedById":143750,"CreatedDateTime":"2015-05-13T13:55:27Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EPart 2\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EBob was a scientist without a lab. See Bob used to put leftover chemicals in a bin, and light them on fire, he liked the colors. Only this time it did more than sparkle and fizz, this time his lab acquired a new building-sized skylight, when the roof suddenly took flight.\u003C/p\u003E\u003Cp\u003EWhen Ascent heard that there was a scientist out there that had experience with flight they hired him immediately. Work progressed, and while Deddly Design was playing around with some slime they had found the vehicle took shape. Only once it was finished did they find out what Bobs experience was, and it was decided that he himself should be the one to pilot his deathtrap/vehicle.\u003C/p\u003E\u003Cp\u003EHe climbed in, and while the other Kerbals turned it pointy side up, he went over his theory in his head again. Turn the bin upside down, it had to work, right? \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/OdZfomf.jpg\u0022 alt=\u0022OdZfomf.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis was it, Bob knew he had proven himself. He also knew he never wanted to do this again.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-14T00:48:23Z\u0022 title=\u002205/14/2015 12:48  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 14, 2015\u003C/time\u003E by Ascent\u003C/strong\u003E\n\u003Cbr\u003Etypo\n\u003C/span\u003E\n"},{"CreatedByName":"Deddly","CreatedById":62955,"CreatedDateTime":"2015-05-13T18:35:56Z","Content":"\n\u003Cp\u003EJumpster and Moarpower, thank you for the encouragement! It\u0027s good to have you along for the ride. Best fasten your seatbelts, it\u0027s likely to be a bumpy one...\u003C/p\u003E\n"},{"CreatedByName":"Deddly","CreatedById":62955,"CreatedDateTime":"2015-05-13T20:59:05Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EPart 3\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u0022What do you do with the goo, anyway?\u0022 Asked Valentina Kerman as she delivered the latest case of the mysterious material to Deddly Design.\u003C/p\u003E\u003Cp\u003EBill was signing the delivery note and looked up in surprise. \u0022You haven\u0027t heard about my thesis on the hypothetical levitation properties of viscous semiliquiform deposits?\u0022 he asked, increduously. \u0022It was published on my blog only days ago!\u0022\u003C/p\u003E\u003Cp\u003EValentina was trying to find a polite answer, which was evading her rather successfully, when just in the nick of time, what sounded like an explosion went off behind her. Spinning around to look, she saw a flimsy conical container soaring into the atmosphere. She had no idea what had just happened - all she knew was that someone had just hurtled himself high into the air on top of a trashcan full of boom, and she wanted in on it.\u003C/p\u003E\u003Cp\u003EWith Bill\u0027s assurance that \u0022boom\u0022 plus \u0022goo\u0022 would be even more exciting, Valentina gleefully signed up for the first flight of what Bill affectionally called the \u0022Finstrosity\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/20576590/KSP/Deddly%20Ascent/screenshot02.png\u0022 alt=\u0022screenshot02.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EBill assured Valentina that the specially reconfigured canisters of goo would, according to his calculations, cause the craft to instantaneously reach 1400 m/s, which - according to his calculations - would be easily enough to reach the moon within five minutes. The trashcan filled with Bob\u0027s special mixture that had kindly been lent to him from Ascent accross the field was mainly to aid in stability at low speeds. \u003C/p\u003E\u003Cp\u003ESitting in the shiny new cockpit of this very special craft, Valentina optimistically set her speed display to show orbital velocity and pressed an inviting-looking red button. \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EWOOSH\u003C/strong\u003E went the trashcan in the back, shooting the Finstrosity forward with impressive force\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/20576590/KSP/Deddly%20Ascent/screenshot3.png\u0022 alt=\u0022screenshot3.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EShe was in the air! She was flying! Valentina grinned with delight. This was at least 12% more fun than delivering goo, though an argument could be made for 15%.\u003C/p\u003E\u003Cp\u003EBy jiggling her weight around inside the cockpit, Valentina found that she could change the direction the Finstrosity was facing, which made things even more fun:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/20576590/KSP/Deddly%20Ascent/screenshot5.png\u0022 alt=\u0022screenshot5.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/20576590/KSP/Deddly%20Ascent/screenshot10.png\u0022 alt=\u0022screenshot10.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E...and so she actually managed to come in for a very smooth landing:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/20576590/KSP/Deddly%20Ascent/screenshot12.png\u0022 alt=\u0022screenshot12.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E...at which point the management at Deddly Design quickly cancelled it\u0027s recruitment process for new pilots.\u003C/p\u003E\u003Cp\u003EBill was disappointed that the goo didn\u0027t seem to add all that much speed to the design, but he was convinced that this wonder material would definitely work as intended with a little reconfiguration (according to his calculations, that is).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-13T21:08:30Z\u0022 title=\u002205/13/2015 09:08  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 13, 2015\u003C/time\u003E by Deddly\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TheKutKu","CreatedById":117026,"CreatedDateTime":"2015-05-14T07:15:45Z","Content":"\n\u003Cp\u003ESuscribed!\u003C/p\u003E\n"},{"CreatedByName":"Ascent","CreatedById":143750,"CreatedDateTime":"2015-05-20T15:01:20Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EPart 4\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EBob was back at it with the science after his demonstration, helping to develop all kinds of useful things for future launches. His temporary glory after the first successful launch was fading, so he was motivated to continue proving himself, this time by developing a new kind of engine, one that ran on liquid fuel, an idea he got at the party after his mission, where a party trick involving flaming shots inspired him. He also thought to make the engines throttleable, \u0022just like a faucet\u0022, as opposed to the solid fuel engines that once you light them you just have to hope for the best.\u003C/p\u003E\u003Cp\u003EOne day there was an announcement from Mission Control: \u003Cem\u003E\u0022Administration says that legally we cannot call ourselves a space program without actually going to space\u0022\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EWith those words looming, the people of the not-legally-space-center set out to leave the atmosphere. Luckily a test pilot had already been selected, Jebediah \u0022Jeb\u0022 Kerman, if only because he won a bet with Administration (and no-one else was willing to do it).\u003C/p\u003E\u003Cp\u003EThe new design created to achieve this used a lot of the newly developed technology coming out of Research and Development, as well as some goo borrowed from Deddly Design, as a favour to Bill, whose calculations suggested that it would increase the vehicle\u0027s acceleration by just over 160% once in the higher atmosphere.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/1OjVV01.png\u0022 alt=\u00221OjVV01.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/cYp3t8X.png\u0022 alt=\u0022cYp3t8X.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EStage separation, success! The liquid courage/fuel works!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Ege1bYv.png\u0022 alt=\u0022Ege1bYv.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Xb2DmmV.png\u0022 alt=\u0022Xb2DmmV.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThings got a little hot during re-entry, but using the leftover fuel Jeb managed to slow his decent enough that no damage was sustained.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/4k5pjYO.jpg\u0022 alt=\u00224k5pjYO.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EOnce he was safely recovered, the Kerbin World-Firsts Record-Keeping Society rewarded him with the title of \u0022Badass\u0022, and Deddly-Ascent with \u0022Actually Space Program\u0022\u003C/p\u003E\u003Cp\u003EThis was a turning point for the Space Center, as contracts started piling up in Mission Control, everything from taking VIPs on trips, to testing parts for manufacturers.\u003C/p\u003E\u003Cp\u003EThe future seems bright for the joint effort, or is that just an afterimage from staring at boosters too long? I guess we\u0027ll see.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-20T15:06:40Z\u0022 title=\u002205/20/2015 03:06  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 20, 2015\u003C/time\u003E by Ascent\u003C/strong\u003E\n\u003Cbr\u003Eredundancy\n\u003C/span\u003E\n"},{"CreatedByName":"UFO Researcher","CreatedById":144447,"CreatedDateTime":"2015-05-20T16:12:44Z","Content":"\n\u003Cp\u003ECool!!!\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003ECOOL!!!\u003C/p\u003E\n"},{"CreatedByName":"Deddly","CreatedById":62955,"CreatedDateTime":"2015-05-20T19:12:31Z","Content":"\n\u003Cp\u003EThanks TheKutKu and UFO Researcher, we hope you\u0027re enjoying it as much as we are!\u003C/p\u003E\n"},{"CreatedByName":"Deddly","CreatedById":62955,"CreatedDateTime":"2015-05-24T20:47:36Z","Content":"\n\u003Cp\u003EValentina smiled as she took the controls of the Finstrosity 1.2. She felt comfortable here. Although the plane had been stripped down to its basics for a complete overhaul (to make use of \u0022enabling technologies and breakthrough engineering\u0022, Bill had informed her), it still felt like the good old Finstrosity that had taken the world by storm with its amazing ability to fly horizontally.\u003C/p\u003E\u003Cp\u003ESince Ascent had performed the incredible and actually managed to fire a man out of the atmosphere, the Deddly-Ascent collaboration had been inundated with unusual requests. Finstrosity 1.2 had been designed and dragged onto the runway to perform a very special task for C7 Aerospace. They had offered to pay Deddly Design handsomely to test a new kind of technology. Deddly Design was, of course, more than happy to put its valuable personnel in danger for the sake of science and the good of Kerbalkind. It was absolutely nothing to do with the money and how dare the media assume such a thing. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/20576590/KSP/Deddly%20Ascent/screenshot16.png\u0022 alt=\u0022screenshot16.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EC7 Aerospace called this experimental engine the \u0022Wheesley\u0022 jet engine, and it was touted as a breakthrough in science and technology, although most people knew it was just a ventilation fan forced to run at hundreds of times its design capacity. \u003C/p\u003E\u003Cp\u003EBill had taken the opportunity to install some groundbreaking technology of his own. Ever since mastering the art of forming the mystery goo into elongated canisters, he had been keeping the bits that had spilled onto the floor in his box of odds and ends. He had recently noticed that many rusty old pieces of ... (well he didn\u0027t quite remember what they were, but they looked important and they would probably be useful one day)... had fused together and reacted with the goo in interesting ways. He expertly shoved these trinkets into a suitable container and thereby invented what he called a \u0022Science Jool Return\u0022 because it was decidedly sciencey and because Bill had calculated that, when exposed to the atmosphere, the device would power the craft to Jool and Return it safely to Kerbin whilst using only 35 units of the \u0022liquid fuel\u0022 left over from Ascent\u0027s party that they had the other day.\u003C/p\u003E\u003Cp\u003EWith great anticipation, then, Valentina hit the throttle - the only control on the craft. Much to everyone\u0027s dismay, however, the Wheeseley engine simply fizzed and, well, wheezed. C7 Aerospace were greatly disappointed but were more than happy to transfer the promised funds to Deddly Design\u0027s offshore bank account after a friendly visit by one of their suspiciously strong-looking lawyers. \u003C/p\u003E\u003Cp\u003EFed up with this incompetence, Bill tore off the malfunctioning piece of scrap and replaced it with a special version of the liquid fuel engine that Ascent had recently tested over on the launchpad. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/20576590/KSP/Deddly%20Ascent/screenshot27.png\u0022 alt=\u0022screenshot27.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis was a special favour to Jebediah, whose side business (Jebediah Kerman\u0027s Junkyard and Spacecraft Parts Co) had made a new version with what is in technical terms referred to as a twisty-turney nozzle. With this engine in place, the Finstrocity 1.2 took off at such a rate that the camera man couldn\u0027t keep up with it. It was glorious. It was FAST! Valentina was grinning ear to ear as she expertly shifted her weight around in the cockpit and aimed the craft for the middle of the space centre to impress the bosses. As she carefully eased the plane towards the gently-sloping grass, an urgent voice crackled accross the radio link. It was Bill Kerman.\u003C/p\u003E\u003Cp\u003E\u0022Val, you\u0027re coming in too fast! Pull up!\u0022\u003C/p\u003E\u003Cp\u003E\u0022It\u0027s fine you big sissy\u0022\u003C/p\u003E\u003Cp\u003E\u0022Val, I really think you should lift the nose\u0022\u003C/p\u003E\u003Cp\u003E\u0026lt;sigh\u0026gt; \u0022OK fine... it doesn\u0027t lift very quickly, does it?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Val! You\u0027re barely above the ground, you \u003Cem\u003Emust\u003C/em\u003E lift the nose.\u0022\u003C/p\u003E\u003Cp\u003EA sudden realisation sent a chill down Bill\u0027s spine;\u003C/p\u003E\u003Cp\u003E\u0022You haven\u0027t activated the goo!\u0022 he cried.\u003C/p\u003E\u003Cp\u003EAlas, without the goo activated, Bill knew that the craft would be unable to sustain level flight for long. Time seemed to slow down and all he could do was watch in horror as Valentina fumbled for the goo controls. She was only a fraction of a second from the ground and Bill knew the canisers would never open in time. Valentina leaned back as far as she could and the nose was laboriously rising, but it wasn\u0027t enough. At almost level flight, the Finstrocity brushed the ground at over 72 m/s. In the blink of an eye she was gone.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/20576590/KSP/Deddly%20Ascent/screenshot19.png\u0022 alt=\u0022screenshot19.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/20576590/KSP/Deddly%20Ascent/screenshot21.png\u0022 alt=\u0022screenshot21.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/20576590/KSP/Deddly%20Ascent/screenshot22.png\u0022 alt=\u0022screenshot22.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EA somber mood hung over the Deddly-Ascent complex as the very first flag-planting ceremony was conducted. It seemed fitting that the bravest Kerbal who ever died in a spaceplane should be honoured with a permanent flag, as a solemn reminder of the dangers faced by these heroes every day.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/20576590/KSP/Deddly%20Ascent/screenshot26.png\u0022 alt=\u0022screenshot26.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis episode is dedicated to Valentina Kerman\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-27T14:51:13Z\u0022 title=\u002207/27/2015 02:51  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 27, 2015\u003C/time\u003E by Deddly\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-05-24T21:31:38Z","Content":"\n\u003Cp\u003EFair winds and following seas, Valentina \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Windspren","CreatedById":134441,"CreatedDateTime":"2015-05-24T22:56:51Z","Content":"\n\u003Cp\u003E.... And then she walked back in to the Astronaut complex, asking if she could fly a bigger plane next time.\u003C/p\u003E\n"},{"CreatedByName":"Deddly","CreatedById":62955,"CreatedDateTime":"2015-05-25T09:05:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Laythe Dweller\u0022 data-cite=\u0022Laythe Dweller\u0022\u003E\u003Cdiv\u003E.... And then she walked back in to the Astronaut complex, asking if she could fly a bigger plane next time.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf only that were true. Denial is common when dealing with the pain of death. Allow yourself to cry, it\u0027s a normal part of the grieving process\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/20576590/KSP/Deddly%20Ascent/screenshot28.png\u0022 alt=\u0022screenshot28.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-05-25T12:16:35Z","Content":"\n\u003Cp\u003EWell that\u0027s sad... it\u0027ll be interesting to see how you take the story from here.\u003C/p\u003E\n"},{"CreatedByName":"Windspren","CreatedById":134441,"CreatedDateTime":"2015-05-25T17:35:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Deddly\u0022 data-cite=\u0022Deddly\u0022\u003E\u003Cdiv\u003EIf only that were true. Denial is common when dealing with the pain of death. Allow yourself to cry, it\u0027s a normal part of the grieving process\u003Cp\u003E\u003Ca href=\u0022https://dl.dropboxusercontent.com/u/20576590/KSP/Deddly%20Ascent/screenshot28.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://dl.dropboxusercontent.com/u/20576590/KSP/Deddly%20Ascent/screenshot28.png\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E*Hacks into your computer, turns on \u0022Missing Crew Respawn\u0022*\u003C/p\u003E\n"},{"CreatedByName":"Deddly","CreatedById":62955,"CreatedDateTime":"2015-07-27T14:40:30Z","Content":"\n\u003Cp\u003EMonths had passed since the ill-fated Finstrosity 1.2 launch and subsequent disaster. Although little seemed to be happening, the Health and Safety Department had been in a frenzy. Launch procedures had been reviewed, and all available data had been examined to try to determine the exact cause of the crash. Up until a few weeks ago, the whole complex had been teeming with journalists who all wanted to ask the same question: \u0022How do you feel about Valentina\u0027s death?\u0022, to which Bill\u0027s response had invariably been: \u0022Much worse than I\u0027m going to feel about yours in a minute.\u0022 But now it had all calmed down and the complex seemed eerily quiet, as if silently mourning the loss of a dear friend of its own.\u003C/p\u003E\u003Cp\u003EAfter painstakingly reviewing all available data, the Health and Safety Department had at last issued it\u0027s verdict and released it\u0027s clamp-down on all launches, provided that its new directives were adopted. It\u0027s report is reproduced in full below:\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u0027The Health and Safety Department has determined from its thorough review of all data related to the Finstrosity 1.2 disaster that spaceplanes are dangerous, and should henceforth be fitted with a warning sign reading \u0022Danger\u0022. Furthermore, pilots should be more careful and not hit the ground so hard.\u0027\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EWith the new direction in force, Bill had a new ship developed that was almost an exact copy of the original Finstrosity, since it was a design known to work well. The new Finstrosity was dragged out to the runway with a slightly unwilling new pilot. This boy was until now unknown to the world, but it was he who personally planted the flag in Valentina\u0027s honour. He hoped to some day match Valentina\u0027s courage and piloting skills. He \u003Cem\u003Ewanted\u003C/em\u003E to just go home and play computer games, but he \u003Cem\u003Ehoped\u003C/em\u003E to match Valentina\u0027s courage and piloting skills...\u003C/p\u003E\u003Cp\u003EAlas:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/20576590/KSP/Deddly%20Ascent/screenshot29.png\u0022 alt=\u0022screenshot29.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/20576590/KSP/Deddly%20Ascent/screenshot31.png\u0022 alt=\u0022screenshot31.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EJoeely\u0027s first two flights did at least show that the Health and Safety department were correct about spaceplanes being dangerous.\u003C/p\u003E\u003Cp\u003EAfter collecting all the pieces for the second time, Bill decided that something had to be done about this problem, and his thoughts definitely didn\u0027t involve a bigger \u0022Danger\u0022 sign, like the Health and Safety Department had been talking about.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-27T14:52:14Z\u0022 title=\u002207/27/2015 02:52  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 27, 2015\u003C/time\u003E by Deddly\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Deddly","CreatedById":62955,"CreatedDateTime":"2015-08-17T13:30:30Z","Content":"\n\u003Cp\u003EBill had been in a foul mood ever since Joeely had managed to totally destroy the Finstrosity. The only parts that had survived were the cockpit and the pilot. Bill would have preferred a total loss. Mind you, as terrible a pilot as he was, Joeely was currently the only person who could be coerced to get in a cockpit. \u003C/p\u003E\u003Cp\u003EThis time was going to be different, though. Bill\u0027s mood had lightened considerably since he had come into the hangar to admire his latest creation. It involved two major leaps forward in technology: \u003C/p\u003E\u003Cp\u003EFirstly, Bill had an idea that just might be able to make use of that utter failure of an engine, the \u0022Wheesley\u0022, that C7 Aerospace had sent him a while back. The highly-skilled and very-well-paid lawyers at Deddly Design had managed to secure an out-of-court settlement that included C7 Aerospace paying Deddly Design for testing the product, as well as giving them the product. Bill wasn\u0027t quite sure how that worked out, but it was something to do with the fact that it was really a ventilation fan, and he had been assured that he could keep the engine and nobody would dare to challenge him. Since then it had just been sitting in a box on the shelf along with all his other precious trinkets that he was certain would be useful one day. \u003C/p\u003E\u003Cp\u003EBut the Wheesley had popped back into Bill\u0027s mind as he was pondering over how to increase fuel efficiency of engines. He reasoned that a ventilation fan should probably work more efficiently if it had air. A few clicks around on his favourite online auction site and he had secured the biggest vacuum-cleaner nozzle he could get hold of.\u003C/p\u003E\u003Cp\u003EThe second major breakthrough was literally revolutionary: Bill calculated that, despite being designed to fly in the air, his contraption would be at least 15% safer if it were able to gently roll along the runway in a controlled manner instead of scraping perillously and uncontrollably accross the ground as had been the norm up until this point.\u003C/p\u003E\u003Cp\u003EBill smiled as he inspected the new craft:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/20576590/KSP/Deddly%20Ascent/Episode%207/screenshot32%20-%20air.png\u0022 alt=\u0022screenshot32%20-%20air.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHe had personally had Joeely clean the hangar floor with that vacuum-cleaner nozzle, and it had worked so beautifully that he was confident it was up to the task. He had emptied the contents of the vacuum cleaner into the Science JR, since there were so many small fragments of goo in there. He calculated that the extra goo would make up for the added weight of the wheels, and increase the craft\u0027s maximum speed to escape velocity within 30 seconds of takeoff.\u003C/p\u003E\u003Cp\u003EThe only problem was that Joeely was being an utter wimp and didn\u0027t want to fly. He had only been in a few plane crashes, so Bill didn\u0027t know what was wrong with him. Somehow he managed to convince him to at least have a look at the brand new cockpit - which actually had \u003Cem\u003Econtrolls\u003C/em\u003E now. Once Joeely was inside, it was a simple matter of Bill hitting the launch button, slamming the door and running away.\u003C/p\u003E\u003Cp\u003EWith a wheese, the Wheesley coughed into life, shrouding the end of the runway in a cloud of dust, bits of goo and whatever else had been on the floor of the hangar. Bill cheered gleefully, but Joeeley was not so happy about the success.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/20576590/KSP/Deddly%20Ascent/Episode%207/screenshot33it%20works%2C%20sad%20Joeely.png\u0022 alt=\u0022screenshot33it%20works%2C%20sad%20Joeely.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhat with all the new technology on board, Bill had named this marvel of engineering in the name of science. The Scientology flew beautifully, and Bill told the pilot to climb to a safe altitude to test how slowly he could fly without stalling. He did as he was told, but he was \u003Cem\u003Enot\u003C/em\u003E happy about it:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/20576590/KSP/Deddly%20Ascent/Episode%207/screenshot36%20testing%20stall%20speed.png\u0022 alt=\u0022screenshot36%20testing%20stall%20speed.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ENext up was what Bill referred to as the \u0022reverse goo levitation\u0022 test:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/20576590/KSP/Deddly%20Ascent/Episode%207/screenshot37%20testing%20upside%20down%20aero.png\u0022 alt=\u0022screenshot37%20testing%20upside%20down%20aero.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHe was satisfied with the result, and was glad to see that his idea of mounting the goo away from the main fuselage so as to maximise its effect of lift was working so well. Joeely wasn\u0027t convinced that this was such a good idea:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/20576590/KSP/Deddly%20Ascent/Episode%207/screenshot38%20testing%20upside%20down%20aero.png\u0022 alt=\u0022screenshot38%20testing%20upside%20down%20aero.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ESince he was scared of heights, Joeely decided to fly a little closer to the ground. It felt slightly safer that way:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/20576590/KSP/Deddly%20Ascent/Episode%207/screenshot40%20holding%20on%20for%20dear%20life.png\u0022 alt=\u0022screenshot40%20holding%20on%20for%20dear%20life.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/20576590/KSP/Deddly%20Ascent/Episode%207/screenshot41%20holding%20on.png\u0022 alt=\u0022screenshot41%20holding%20on.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/20576590/KSP/Deddly%20Ascent/Episode%207/screenshot42%20holding%20on.png\u0022 alt=\u0022screenshot42%20holding%20on.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E...although, in retrospect, he realised that it wasn\u0027t \u003Cem\u003Eall\u003C/em\u003E that much safer, after all. He also realised that he didn\u0027t like high G-Forces:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/20576590/KSP/Deddly%20Ascent/Episode%207/screenshot43%20pull%20up.png\u0022 alt=\u0022screenshot43%20pull%20up.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EDeciding that mountains were probably not the safest place to be testing an experimental aircraft, Joeely went on to test the top speed of the Scientology and get home ASAP. He hated every minute of it, but finally came in for his first ever safe landing, which he enjoyed very much, after getting out.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/20576590/KSP/Deddly%20Ascent/Episode%207/screenshot44%20max%20speed.png\u0022 alt=\u0022screenshot44%20max%20speed.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/20576590/KSP/Deddly%20Ascent/Episode%207/screenshot45%20Test%20landing.png\u0022 alt=\u0022screenshot45%20Test%20landing.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EJoeely was very happy to be back on the ground, and after a celebratory glass of water, he was manhandled back into the cockpit for a celebratory spin in the Scientology, which he wasn\u0027t particularly pleased about. This time, he was told to try a steep climb, which terrified him immensely:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/20576590/KSP/Deddly%20Ascent/Episode%207/screenshot47%20off%20again.png\u0022 alt=\u0022screenshot47%20off%20again.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/20576590/KSP/Deddly%20Ascent/Episode%207/screenshot48%2045%20degree%20climb.png\u0022 alt=\u0022screenshot48%2045%20degree%20climb.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EInstead of coming home right away, he made the decision to try landing somewhere else, where he wouldn\u0027t be forced to fly whatever other wierd contraptions Bill might come up with:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/20576590/KSP/Deddly%20Ascent/Episode%207/screenshot49%20look%20at%20the%20island.png\u0022 alt=\u0022screenshot49%20look%20at%20the%20island.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EJoeely was very surprised at how smooth the landing was. He wondered how the ground here was so perfectly flat. Whatever the reason, it did make the landing more comfortable, and it didn\u0027t feel quite as death-defying as landing back home on the bumpy runway.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/20576590/KSP/Deddly%20Ascent/Episode%207/screenshot52%20jealous%20of%20the%20runway.png\u0022 alt=\u0022screenshot52%20jealous%20of%20the%20runway.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EMore certain than ever that the ground was for him, Joeely now informed Bill via radio that he wasn\u0027t coming home. This was where he wanted to stay and nothing was going to change his mind.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/20576590/KSP/Deddly%20Ascent/Episode%207/screenshot53%20checking%20out%20the%20tower.png\u0022 alt=\u0022screenshot53%20checking%20out%20the%20tower.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ENope, he wasn\u0027t going to use that thing again!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/20576590/KSP/Deddly%20Ascent/Episode%207/screenshot55%20How%20to%20get%20back%20in%20the%20plane.png\u0022 alt=\u0022screenshot55%20How%20to%20get%20back%20in%20the%20plane.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ETo show that he meant what he said, he decided to plant a flag in this nice room at the top of his new home. Mysteriously, the flag magically disappeared from his hand and planted itself on the roof. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/20576590/KSP/Deddly%20Ascent/Episode%207/screenshot56%20magic%20flag.png\u0022 alt=\u0022screenshot56%20magic%20flag.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EStill, whatever was going on here, it was better than whatever would be going on back there at the spaceplane hangar, and he was \u003Cem\u003Enever\u003C/em\u003E going back. \u003C/p\u003E\u003Cp\u003EHe was getting a bit hungry though...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-17T13:45:03Z\u0022 title=\u002208/17/2015 01:45  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 17, 2015\u003C/time\u003E by Deddly\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-08-17T17:32:45Z","Content":"\n\u003Cp\u003EYou tell \u0027em Joeely! Though now that you\u0027ve mastered that one plane (which does have a parachute after all so not sure why you\u0027re so nervous) you just might be able to not crash the next one.\u003C/p\u003E\n"}]}