{"TopicId":108721,"ForumId":70,"TopicTitle":"KSP 1.-- hates welded parts... anybody know why?","CreatedByName":"little square dot","CreatedById":42920,"CreatedDateTime":"2015-05-11T04:15:59Z","PageNum":1,"Articles":[{"CreatedByName":"little square dot","CreatedById":42920,"CreatedDateTime":"2015-05-11T04:15:59Z","Content":"\n\u003Cp\u003EG\u0027day.\u003C/p\u003E\u003Cp\u003EMy welded parts, that haven\u0027t previously caused physics troubles, are going bananas since I updated KSP. To name a few issues:\u003C/p\u003E\u003Cp\u003E1. surfaceFX on welded engines are permanently on, even when the throttle is at 0 and the engines deactivated.\u003C/p\u003E\u003Cp\u003EDebugger says: [Error]: [ModuleSrfFX]: No IThrustProvider module found at index 0!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/sI3MKrSh.png\u0022 alt=\u0022sI3MKrSh.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E2. welded capsules sink. -no errors in debugger.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/gaEmV9ih.png\u0022 alt=\u0022gaEmV9ih.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E3. changing values in welded parachute .cfgs does nothing to alter their performance, and parachutes work underwater when they\u0027re connected to one of my sinking capsules. -no errors in debugger.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/oLyPCnOh.png\u0022 alt=\u0022oLyPCnOh.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe list of odd behaviours is far more extensive than this, but those are the most irritating issues I\u0027ve encountered. Any ideas?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-11T04:37:00Z\u0022 title=\u002205/11/2015 04:37  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 11, 2015\u003C/time\u003E by little square dot\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"little square dot","CreatedById":42920,"CreatedDateTime":"2015-05-11T05:53:10Z","Content":"\n\u003Cp\u003ESurfaceFX problem solved... I had a sneaky non-engine module reference near the top of the .cfgs, hiding amongst my model references.\u003C/p\u003E\u003Cp\u003E...but I still can\u0027t get my capsules to float or my parachutes to create more drag. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"moogoob","CreatedById":118251,"CreatedDateTime":"2015-05-11T12:58:25Z","Content":"\n\u003Cp\u003EDoes part welding create a new part from two or more different ones? Maybe it\u0027s not adding up the physics of both parts correctly. As I understand it, each part has a front, side and rear drag value - and presumably other things are handled like this too- heat dissipation, buoyancy etc. If the game is looking for a skipper in the physics file, it finds the skipper\u0027s drag cube and all is well. If it\u0027s looking for a skipper/tank monstrosity, it finds nothing and uses default or broken values. Could that be the reason?\u003C/p\u003E\n"},{"CreatedByName":"little square dot","CreatedById":42920,"CreatedDateTime":"2015-05-11T15:53:53Z","Content":"\n\u003Cp\u003EI\u0027m not sure how KSP handles multiple models/drag cubes within one part, but the models are referenced and loaded individually, so KSP isn\u0027t looking for the drag values of frankenpart, rather it\u0027s somehow calculating a frankencube based on one or more of the models in use...or it could be ignoring them altogether. I really have no idea how it works. \u003C/p\u003E\u003Cp\u003EDoes it add the values, assign the drag cube of the first model loaded, ignore them altogether unless the otherwise specified in the .cfg....? Who knows, but I \u003Cem\u003Ereally\u003C/em\u003E hope the game is at least moderately sane about the process, \u0027cause the thought of having to individually assign several hundred unique drag cubes makes me a tad nauseous. =/\u003C/p\u003E\n"},{"CreatedByName":"moogoob","CreatedById":118251,"CreatedDateTime":"2015-05-11T15:57:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022little square dot\u0022 data-cite=\u0022little square dot\u0022\u003E\u003Cdiv\u003EI\u0027m not sure how KSP handles multiple models/drag cubes within one part, but the models are referenced and loaded individually, so KSP isn\u0027t looking for the drag values of frankenpart, rather it\u0027s somehow calculating a frankencube based on one or more of the models in use...or it could be ignoring them altogether. I really have no idea how it works. \u003Cp\u003EDoes it add the values, assign the drag cube of the first model loaded, ignore them altogether unless the otherwise specified in the .cfg....? Who knows, but I \u003Cem\u003Ereally\u003C/em\u003E hope the game is at least moderately sane about the process, \u0027cause the thought of having to individually assign several hundred unique drag cubes makes me a tad nauseous. =/\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMaybe try asking this in one of the modding forums - those folks who are willing to go more than surface-deep into the files and engine could be able to answer your questions a bit more. But it does sound like the physics config file and how the game loads it might be a culprit. \u003C/p\u003E\u003Cp\u003EMay I ask - why are you welding parts? What does that accomplish? Smaller part count? More rigid joints? Just curious. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Harry Rhodan","CreatedById":119953,"CreatedDateTime":"2015-05-11T16:39:19Z","Content":"\n\u003Cp\u003EThe first post of the welding mod thread says that it is still more or less incompatible with 1.0.x and it advices to not weld engines.\u003C/p\u003E\n"},{"CreatedByName":"little square dot","CreatedById":42920,"CreatedDateTime":"2015-05-12T02:28:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Harry Rhodan\u0022 data-cite=\u0022Harry Rhodan\u0022\u003E\u003Cdiv\u003EThe first post of the welding mod thread says that it is still more or less incompatible with 1.0.x and it advices to not weld engines.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t use the welding mod.\u003C/p\u003E\n"},{"CreatedByName":"little square dot","CreatedById":42920,"CreatedDateTime":"2015-05-12T07:15:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022moogoob\u0022 data-cite=\u0022moogoob\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EMay I ask - why are you welding parts? What does that accomplish? Smaller part count? More rigid joints? Just curious. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERigid joints and reduced memory footprint (new parts without adding new models/textures) are nice perks, but I love welding because you can build whatever the heck you want, in as much detail as your imagination will allow, without requiring any third-party assets, .cfgs excepted. Your parts retain the stock look that we know and love, and believe it or not, welding parts can be a lot of fun...if you can handle staring at notepad and a calculator for hours on end. \u003C/p\u003E\u003Cp\u003EThey\u0027re generally quite hassle free as well, major aerodynamic overhauls notwithstanding, and .cfgs can be modified, updated, manipulated, etc. with ease by anyone who so desires.\u003C/p\u003E\u003Cp\u003EMost people think of welding as a way to reduce part counts and strengthen joints, but stacking and fusing truss segments, struts, tanks etc. is really just the tip of the iceberg. Highly detailed manipulations are possible as well...same principles, more imagination. \u003C/p\u003E\u003Cp\u003EI threw together a couple of albums of 100% stock welds to show you what I mean.\u003C/p\u003E\u003Cp\u003EWelded 3.75m capsule \u002B launch escape system: 3 parts in total, capsule has fully functioning hatch, antenna, docking port, IVA etc. \u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/SJBRi\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EVarious odds and ends including rovers, habitation modules, engines, landers, spherical tanks, etc.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/46BJW\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003ECan a mod please relocate this thread elsewhere? I\u0027m not sure why it was moved to the support forum for modded installs...cfg edits, while technically modifications, probably shouldn\u0027t qualify for the modded installs forum, and regardless, I\u0027m not looking for tech support. \u003C/p\u003E\u003Cp\u003EI\u0027m interested in learning about how KSP determines part buoyancy and drag, so a move elsewhere would be much appreciated.\u003C/p\u003E\n"}]}