{"TopicId":108727,"ForumId":20,"TopicTitle":"Best 1.0.2 flight/unmanned first tech trees so far?","CreatedByName":"Errol","CreatedById":118622,"CreatedDateTime":"2015-05-11T06:36:27Z","PageNum":1,"Articles":[{"CreatedByName":"Errol","CreatedById":118622,"CreatedDateTime":"2015-05-11T06:36:27Z","Content":"\n\u003Cp\u003ENow that remote tech and xf have been updated many of us are itching to start our career saves. However, for me at least, the final piece of the puzzle isn\u0027t a mod not being updated yet. It\u0027s the one thing squad said would be EASIER to mod, and that was already modded by many folks in great ways, who\u0027ve now had waste time on converting their mods to work with the new system instead on of new features or balance passes. \u003C/p\u003E\u003Cp\u003EThis isn\u0027t just my first new thread on this forum to gripe though.\u003C/p\u003E\u003Cp\u003EThe question is, are there any tech trees (besides CTT, I\u0027m looking for things that give alternate starts to the stock manned rocket flight tech start) updated for 1.0.2 that I\u0027ve missed so far?\u003C/p\u003E\n"},{"CreatedByName":"uglyduckling81","CreatedById":129740,"CreatedDateTime":"2015-05-11T06:45:35Z","Content":"\n\u003Cp\u003ECheck out SETI Community Tech tree and SETI Contracts to go with it.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://kerbalstuff.com/mod/748/SETI-CommunityTechTree\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://kerbalstuff.com/mod/748/SETI-CommunityTechTree\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://kerbalstuff.com/mod/742/SETI-Contracts\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://kerbalstuff.com/mod/742/SETI-Contracts\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Errol","CreatedById":118622,"CreatedDateTime":"2015-05-11T15:08:55Z","Content":"\n\u003Cp\u003EThank you, I had briefly looked at that, but skipped it because it looked like a complete game overhaul, which I\u0027m not interested in. I read deeper after checking it out from your post, and noticed it has separate tech tree, contracts, and balance components. So I went with just the tech tree and contracts.\u003C/p\u003E\n"},{"CreatedByName":"Gryphon","CreatedById":58513,"CreatedDateTime":"2015-05-16T22:19:22Z","Content":"\n\u003Cp\u003ESo, is the SETI Community Tech Tree the only one?\u003C/p\u003E\n"}]}