{"TopicId":108717,"ForumId":25,"TopicTitle":"[Stock 1.0.2] Early Career 5-Flight Challenge","CreatedByName":"Maolagin","CreatedById":129708,"CreatedDateTime":"2015-05-11T03:18:34Z","PageNum":1,"Articles":[{"CreatedByName":"Maolagin","CreatedById":129708,"CreatedDateTime":"2015-05-11T03:18:34Z","Content":"Okay, there\u0027s been some debate back and forth about whether the new career mode is too easy or too grindy. Let\u0027s put it to a challenge!\n\nSo here you are with a fledgling space program. Pity nobody\u0027s heard of you or allocated a budget, though. Sure, you could work diligently and spend weeks sending out explorer after explorer to boot up your program, but why wait? How far can you get in EXACTLY FIVE FLIGHTS?\n\nAs your starting scenario, select \u0022Hard Mode\u0022 and set starting funds, science, and reputation to zero. Obviously feel free to prototype your missions before flying for real -- whether this means trying first in sandbox or turning Revert back on doesn\u0027t matter to me. Your game should be 1.0.2 Stock. Informational mods are fine in the VAB, but turn \u0027em off in flight. Otherwise MJ and friends negate too much of the downside of the Tier-0 Tracking Station. \n\nOther than that, the only rules are, get as far as you can with your five flights. If you roll it out on the Launchpad/Runway and hit Spacebar, it counts, even if it\u0027s just a \u0022Test on the launchpad\u0022 contract. To make things clearer in your screenshots or video, name your craft like I do below, \u0022Number One\u0022 through \u0022Number Five\u0022 or something similar. \n\nEDIT: RULES CLARIFICATIONS\n\n\\* Yes you can revert or use quicksaves if you want.\n\n\\* You get to deploy five crafts from the VAB/SPH, period. A pod that rolls around the KSC still counts as one of your \u0022flights.\u0022 \n\nSCORING: The interesting variable is how far you got, not how rich you got. So scoring will be by experience. Refer to the Experience table here: [http://wiki.kerbalspaceprogram.com/wiki/Experience](http://wiki.kerbalspaceprogram.com/wiki/Experience)\n\nYour score will be the highest experience award any of your Kerbals would get over the course of your missions. So if you got a Kerbal to Kerbin orbit, you get 2 points. If you planted a flag on Duna, you get 12.5 points, even if they haven\u0027t gotten the XP yet because the return craft would be Number Six.\n\nSince the first contestant to submit a finished campaign also nearly maxed out this method of scoring, you also get a tie-breaker score. Ties are broken by total XP accomplishments for your entire program -- that is, add up the highest XP accomplishments per SOI just like the game does, but total it as if your entire space program was executed by a single Kerbal. So if Jeb went to Laythe but Val also orbited Mun at some point, your headline score is 20 points (Flag on Laythe), and your tie-breaker score is 40 points (Kerbin orbit \u002B Mun orbit \u002B Kerbol orbit \u002B Jool orbit \u002B Laythe flag).\n\nAnd in the interest of not relying TOO heavily on the \u0022Jeb can come home on flight 6\u0022 rule, you get a 20% bonus to the tie-breaker score if all Kerbonauts are recovered back on Kerbin after five flights.\n\nHere\u0027s my take, to give you the idea. As you see, I manage to get set up to farm almost unlimited funds, but only make it to Mun orbit. So only 3 points for me:\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/Uxjnr)\n\nGood luck!\n\nLEADERBOARD:\n\n1. [RocketPropelledGiraffe](https://forum.kerbalspaceprogram.com/threads/120746-Stock-1-0-2-Early-Career-5-Flight-Challenge?p=1955092\u0026viewfull=1#post1955092) -- Laythe flag = 20 points, tie-breaker score = 40 points (Kerbin-\u003EJool, Laythe flag, Mun orbit, no return bonus)\n\n2. ...\n\n3. ...\n\n**Edited \u003Ctime datetime=\u00222015-05-29T21:19:05Z\u0022 title=\u002205/29/2015 09:19  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 29, 2015\u003C/time\u003E by Maolagin**\n  \nadd tie-breaker scoring"},{"CreatedByName":"Kystery","CreatedById":135332,"CreatedDateTime":"2015-05-11T18:17:40Z","Content":"I like the idea of this. I\u0027m quite tempted to try it myself, but that means making sure any mods and modded savegames are gone from a copy of KSP.\n\nSee you in 10 years -gets to deleting files-"},{"CreatedByName":"Moesly_Armlis","CreatedById":112247,"CreatedDateTime":"2015-05-12T16:45:08Z","Content":"Tried this and had some fun. At times it was a blast.\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/WsVGh)\n\nI will continue updating the imgur album and post when finished.\n\nDid you indicate that reverting does not matter? I could redo this attempt if no reverting does matter. \n\nAlso concerning the first vessel roll out. No space bar was pressed. So is that right on target with the rules? If so then you might need to revise the rule to include the first engine ignition must be with space bar. For example I can right click and start engine and that is without space bar. My reason for this is that I have a launchpad contract for both the terrier and swivel for which is on a vessel designed for a mun encounter. I need to shut down the engines after staging and return to see Gene and obtain the contract for break the atmosphere and orbit kerbin.\n\n**Edited \u003Ctime datetime=\u00222015-05-12T18:46:46Z\u0022 title=\u002205/12/2015 06:46  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 12, 2015\u003C/time\u003E by MoeslyArmlis**"},{"CreatedByName":"Maolagin","CreatedById":129708,"CreatedDateTime":"2015-05-12T20:39:37Z","Content":"\u003E \n\u003E Tried this and had some fun. At times it was a blast.\n\u003E [http://imgur.com/a/WsVGh](http://imgur.com/a/WsVGh)\n\u003E \n\u003E I will continue updating the imgur album and post when finished.\n\u003E \n\u003E Did you indicate that reverting does not matter? I could redo this attempt if no reverting does matter. \n\u003E \n\u003E Also concerning the first vessel roll out. No space bar was pressed. So is that right on target with the rules? If so then you might need to revise the rule to include the first engine ignition must be with space bar. For example I can right click and start engine and that is without space bar. My reason for this is that I have a launchpad contract for both the terrier and swivel for which is on a vessel designed for a mun encounter. I need to shut down the engines after staging and return to see Gene and obtain the contract for break the atmosphere and orbit kerbin.\n\nHah, nice work blowing up the VAB on your first launch! Yes, I\u0027m fine with reverting, this challenge is about clever ship design and game mechanic exploitation. I\u0027m looking forward to seeing the rest of your flights!\n\nHowever, the spirit of the rule was supposed to be that you get to deploy five craft, period, so I would count your pod-roller as craft #1. I\u0027ll see if I can edit the top post to make that clearer."},{"CreatedByName":"Moesly_Armlis","CreatedById":112247,"CreatedDateTime":"2015-05-13T00:39:23Z","Content":"\u003E I would count your pod-roller as craft #1.\n\nThe pod roller and the launch was to gather science and I wasn\u0027t up for a stroll around the KSC.  Why not throw in some starting science so there won\u0027t be a reason to visit the KSC at all. Will now need to include in the first launch are dropping science pod rollers.\n\n**Edited \u003Ctime datetime=\u00222015-05-13T00:46:57Z\u0022 title=\u002205/13/2015 12:46  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 13, 2015\u003C/time\u003E by MoeslyArmlis**"},{"CreatedByName":"ghpstage","CreatedById":129622,"CreatedDateTime":"2015-05-18T20:49:12Z","Content":"Will have a go at this on the weekend. \n\nIf I can get out of the Kerbin SOI I will be aiming for Gilly as theres a good chance of a return mission. I don\u0027t want to leave Bob on Duna ![;.;](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif)"},{"CreatedByName":"Maolagin","CreatedById":129708,"CreatedDateTime":"2015-05-19T18:31:30Z","Content":"\u003E \n\u003E Will have a go at this on the weekend. \n\u003E If I can get out of the Kerbin SOI I will be aiming for Gilly as theres a good chance of a return mission. I don\u0027t want to leave Bob on Duna ![;.;](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif)\n\nI\u0027m looking forward to seeing if you can do it!"},{"CreatedByName":"RocketPropelledGiraffe","CreatedById":143863,"CreatedDateTime":"2015-05-19T20:58:18Z","Content":"I like the idea of this challenge, since you have to get to the limits of what is possible with the very early technology. \n\nI am trying to go for an interplanetary run, but I do not have a lot of time atm. I only managed the first two flights so far...\n\nNext target: Mun!\n\nFinally did it. Placed Val on Laythe in four launches, I am told her return is planned some time in the future...\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/kyuCM)\n\nI got to the point where I did not expect a fifth launch to make a difference. It seems a lot more money and science is needed to get the upgrades to put together a Laythe return mission or to be able to get to Eeloo or Moho.\n\n**Edited \u003Ctime datetime=\u00222015-05-22T01:31:52Z\u0022 title=\u002205/22/2015 01:31  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 22, 2015\u003C/time\u003E by RocketPropelledGiraffe**"},{"CreatedByName":"Maolagin","CreatedById":129708,"CreatedDateTime":"2015-05-22T15:54:36Z","Content":"\u003E \n\u003E I like the idea of this challenge, since you have to get to the limits of what is possible with the very early technology. \n\u003E I am trying to go for an interplanetary run, but I do not have a lot of time atm. I only managed the first two flights so far...\n\u003E \n\u003E Next target: Mun!\n\u003E \n\u003E Finally did it. Placed Val on Laythe in four launches, I am told her return is planned some time in the future...\n\u003E \n\u003E [http://imgur.com/a/kyuCM](http://imgur.com/a/kyuCM)\n\u003E \n\u003E I got to the point where I did not expect a fifth launch to make a difference. It seems a lot more money and science is needed to get the upgrades to put together a Laythe return mission or to be able to get to Eeloo or Moho.\n\nWow, very impressive! You are the first to finish, and according to [the table](http://wiki.kerbalspaceprogram.com/wiki/Experience) planting a flag on Laythe nets you 20 XP points! \n\nSince the only way to beat that score would be to visit Eeloo, I may have to think of a way to do tiebreakers ... you\u0027re dangerously close to maxing out my scoring system here!"},{"CreatedByName":"ToneStack","CreatedById":142969,"CreatedDateTime":"2015-05-23T18:30:19Z","Content":"\u003E \n\u003E Wow, very impressive! You are the first to finish, and according to [the table](http://wiki.kerbalspaceprogram.com/wiki/Experience) planting a flag on Laythe nets you 20 XP points! \n\u003E Since the only way to beat that score would be to visit Eeloo, I may have to think of a way to do tiebreakers ... you\u0027re dangerously close to maxing out my scoring system here!\n\nIt looks like an exciting challenge, I will invest some time over the weekend in it...\n\nThough, i looked at the experience table and... I think the experience is additive across all the S.O.I.\u0027s you visit, though only 1 achievement per SOI is counted. \n\nSo, the person who went to Jool \u0026 Laythe would get at least points for; Kerbin Orbit \u002B Kerbol Orbit \u002B Jool Orbit \u002B Laythe plant flag \n\n=\u003E 2 \u002B 6 \u002B 9 \u002B 20 = 37 points\n\nI bet though they also visited the Mun and/or Minmus for more points.\n\nSome tie breakers might be; \n\n1. How did the 2nd best kerbol for the trip score for exp points\n\n2. What was the best score after only 4 flights =\u003E 3 flights =\u003E 2 flights\n\nor, if it is only the best single SOI that is scored.\n\n3. How many total SOI\u0027s did they visit during the 5 flights?\n\nLooking forward to doing the challenge later this weekend\n\nTone"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2015-05-23T18:44:35Z","Content":"So would this result in more points if you sent multiple Kerbals out and thus earned more experience across the lot of them in the process? Or does only the most experienced Kerbal count?"},{"CreatedByName":"ToneStack","CreatedById":142969,"CreatedDateTime":"2015-05-23T19:28:56Z","Content":"\u003E \n\u003E So would this result in more points if you sent multiple Kerbals out and thus earned more experience across the lot of them in the process? Or does only the most experienced Kerbal count?\n\nThe way the contest was written, it is only the most experienced kerbal that determines your point value.\n\nI wonder though, if the 1st vessel made consists of just the command pod, and did not fulfill the launch the first vessel contract, would it still count as a vessel for this contest?\n\n**Edited \u003Ctime datetime=\u00222015-05-23T19:38:08Z\u0022 title=\u002205/23/2015 07:38  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 23, 2015\u003C/time\u003E by ToneStack**"},{"CreatedByName":"RocketPropelledGiraffe","CreatedById":143863,"CreatedDateTime":"2015-05-23T19:36:17Z","Content":"\u003E \n\u003E Some tie breakers might be; \n\u003E \n\u003E 1. How did the 2nd best kerbol for the trip score for exp points\n\u003E \n\u003E 2. What was the best score after only 4 flights =\u003E 3 flights =\u003E 2 flights\n\u003E \n\u003E or, if it is only the best single SOI that is scored.\n\u003E \n\u003E 3. How many total SOI\u0027s did they visit during the 5 flights?\n\u003E \n\u003E Looking forward to doing the challenge later this weekend\n\u003E \n\u003E Tone\n\nI think some tie breakers are propably a good idea. Maybe the least number of unlocked parts or used parts in the best launch is another idea - and obiously bonus points for return missions.\n\nYour other thought sounds like a nice idea for a separate challenge actually: How many experience points can you get for a single Kerbal in the first career flights?"},{"CreatedByName":"LittleBlueGaming","CreatedById":144665,"CreatedDateTime":"2015-05-23T21:26:53Z","Content":"Going to have to give this a try. I haven\u0027t been anywhere outside of the Kerbin system yet, so that will be fun. ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)"},{"CreatedByName":"LittleBlueGaming","CreatedById":144665,"CreatedDateTime":"2015-05-24T02:30:05Z","Content":"**Launch 1**\n\nI wanted to get all 5 contracts, ended up getting 6. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif) Set the thrust limiter on all the boosters to 0.3, still hit heavy atmospheric drag at the end but I don\u0027t think it would have mattered if I turned it down more.\n\nThe only thing I can think of to improve that flight would be building it so I could get down on the ground, and grinding science all over the KSC for hours and hours...\n\n**Launch 2** \n\nFigured I could fly 3 science bays up past 70km... success. Had a little trouble keeping the heat-shield pointed down during re-entry, and I don\u0027t even know if it\u0027s necessary(I haven\u0027t lost anything to re-entry yet).\n\nI probably could have stuck on 2 more fuel tanks, flown north, gotten the next record distance, and landed in a new biome instead of the ocean again.\n\n**Launch 3**\n\nNot sure if it was the right choice, but I decided to do a science grind. My hope was to unlock enough tech to land on Minmus for launch 4. Ended up banking 100 science.\n\nI could have tooled around and picked up more biomes outside the KSC, but didn\u0027t feel like it. Too bad, I was 4 science short of unlocking another Tier 4 node.\n\n**Launch 4 (Pending)** \n\nI\u0027ve tried a few different things, but haven\u0027t figured out how to maximize the potential for this mission yet. Fly with Jeb and multiple experiments, or forego a bunch of science and just do a few goo samples, crew reports, and EVA reports? Take multiple experiments, or figure out how to take Bob along as well? Go for a landing or two on Minmus?\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/QANQN)"},{"CreatedByName":"g.koster","CreatedById":115794,"CreatedDateTime":"2015-05-25T12:29:03Z","Content":"ok this challenge is pure grinding, as theoretically you can get any money and science from part testing in orbital around Kerbin. \n\nhereby I claim that it possible that with craft five you can visit all planets and moons in one go if your computer allows, have all sciences and all upgrades, no matter what difficulty."},{"CreatedByName":"Maolagin","CreatedById":129708,"CreatedDateTime":"2015-05-26T17:20:02Z","Content":"Okay, I was offline for most of the weekend but I\u0027m back now. Let\u0027s see what\u0027s up...\n\n\u003E \n\u003E It looks like an exciting challenge, I will invest some time over the weekend in it...\n\u003E Though, i looked at the experience table and... I think the experience is additive across all the S.O.I.\u0027s you visit, though only 1 achievement per SOI is counted. \n\u003E \n\u003E So, the person who went to Jool \u0026 Laythe would get at least points for; Kerbin Orbit \u002B Kerbol Orbit \u002B Jool Orbit \u002B Laythe plant flag \n\u003E \n\u003E =\u003E 2 \u002B 6 \u002B 9 \u002B 20 = 37 points\n\u003E \n\u003E I bet though they also visited the Mun and/or Minmus for more points.\n\u003E \n\u003E Some tie breakers might be; \n\u003E \n\u003E 1. How did the 2nd best kerbol for the trip score for exp points\n\u003E \n\u003E 2. What was the best score after only 4 flights =\u003E 3 flights =\u003E 2 flights\n\u003E \n\u003E or, if it is only the best single SOI that is scored.\n\u003E \n\u003E 3. How many total SOI\u0027s did they visit during the 5 flights?\n\n\u003E \n\u003E I think some tie breakers are propably a good idea. Maybe the least number of unlocked parts or used parts in the best launch is another idea - and obiously bonus points for return missions.\n\nIt\u0027s true that the game counts XP additively as you describe, but it also doesn\u0027t award XP until the Kerbonaut is recovered back on Kerbin. So in the spirit of rewarding \u0022furthest progress\u0022 above all, here\u0027s what I propose:\n\nBasic score remains as in the original rules -- highest single XP achievement for any Kerbal in your space program.\n\nAfter that, ties are broken by additive XP accomplishments for your entire program -- that is, add up the highest XP accomplishments per SOI just like the game does, but total it as if your entire space program was executed by a single Kerbal. So if Jeb went to Laythe but Val also orbited Mun at some point, your headline score is 20 points, and your tie-breaker score is 37 \u002B 3 = 40 points.\n\nAnd in the interest of not relying TOO heavily on the \u0022Jeb can come home on flight 6\u0022 rule, let\u0027s give a 20% bonus to the tie-breaker score if all Kerbonauts are recovered back on Kerbin after five flights.\n\nLet me know if any of that seems horribly broken to you guys, otherwise I\u0027ll update the rules with this next time I edit the top post.\n\n\u003E \n\u003E ok this challenge is pure grinding, as theoretically you can get any money and science from part testing in orbital around Kerbin. \n\u003E hereby I claim that it possible that with craft five you can visit all planets and moons in one go if your computer allows, have all sciences and all upgrades, no matter what difficulty.\n\nThat would certainly be tedious! I\u0027m also not sure if it\u0027s true, because what I\u0027m observing is that as you complete contracts the game gradually ups the difficulty, probably going by your reputation. So if you\u0027re looking to unlock the whole tech tree by spamming \u0022transmit science from Kerbin orbit\u0022 contracts, after the first couple of times you\u0027re only going to get a couple of science points, and I am seriously skeptical that the game even will give you that contract a thousand times without you doing something in the meantime to lose rep points.\n\n- - - Updated - - -\n\n\u003E \n\u003E **Launch 1**\n\u003E I wanted to get all 5 contracts, ended up getting 6. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif) Set the thrust limiter on all the boosters to 0.3, still hit heavy atmospheric drag at the end but I don\u0027t think it would have mattered if I turned it down more.\n\u003E \n\u003E The only thing I can think of to improve that flight would be building it so I could get down on the ground, and grinding science all over the KSC for hours and hours...\n\nJust a note, timewarp 4x and holding shift to run is your friend. You can run all over the KSC in just a few minutes that way. It\u0027s still minimal payoff, as those surface EVA reports are only worth a point or so each, but if that\u0027s difference between unlocking two or three nodes for Launch 2 it\u0027s worth it.\n\n\u003E \n\u003E **Launch 2** \n\u003E \n\u003E Figured I could fly 3 science bays up past 70km... success. Had a little trouble keeping the heat-shield pointed down during re-entry, and I don\u0027t even know if it\u0027s necessary(I haven\u0027t lost anything to re-entry yet).\n\u003E \n\u003E I probably could have stuck on 2 more fuel tanks, flown north, gotten the next record distance, and landed in a new biome instead of the ocean again.\n\u003E \n\u003E **Launch 3**\n\u003E \n\u003E Not sure if it was the right choice, but I decided to do a science grind. My hope was to unlock enough tech to land on Minmus for launch 4. Ended up banking 100 science.\n\u003E \n\u003E I could have tooled around and picked up more biomes outside the KSC, but didn\u0027t feel like it. Too bad, I was 4 science short of unlocking another Tier 4 node.\n\u003E \n\u003E **Launch 4 (Pending)** \n\u003E \n\u003E I\u0027ve tried a few different things, but haven\u0027t figured out how to maximize the potential for this mission yet. Fly with Jeb and multiple experiments, or forego a bunch of science and just do a few goo samples, crew reports, and EVA reports? Take multiple experiments, or figure out how to take Bob along as well? Go for a landing or two on Minmus?\n\u003E \n\u003E [http://imgur.com/a/QANQN](http://imgur.com/a/QANQN)\n\nNice start! Looking forward to seeing how flights 4 and 5 turn out!\n\nIf I can make a request to everyone, in your screenshots please include a shot of the KSC before you start, to confirm to us all that you\u0027re starting with 0-0-0 funds/science/rep. If you want to screenshot the difficulty settings dialog that\u0027s great too, but I\u0027m willing to take you at your word that you correctly set the difficulty. Also, let us know which buildings you upgrade when, as that\u0027s also an important element of the strategy to this."},{"CreatedByName":"Jonboy","CreatedById":134111,"CreatedDateTime":"2015-05-26T17:20:34Z","Content":"\u003E \n\u003E ok this challenge is pure grinding, as theoretically you can get any money and science from part testing in orbital around Kerbin. \n\u003E hereby I claim that it possible that with craft five you can visit all planets and moons in one go if your computer allows, have all sciences and all upgrades, no matter what difficulty.\n\nMaybe you\u0027re right, maybe you aren\u0027t. If you want, why don\u0027t you try it for yourself and let us know how it goes? If not, no need to complain.\n\nSince the goal is to be as efficient as possible, this challenge is going to be a little tedious and \u0022gamey\u0022, but that doesn\u0027t make it invalid."},{"CreatedByName":"RocketPropelledGiraffe","CreatedById":143863,"CreatedDateTime":"2015-05-26T19:11:13Z","Content":"I had good fun playing around with this challenge and doing launches, which were clearly aimed at getting as much as possible, but still felt \u0022organic\u0022 like you would play in a normal career game. I confess I omitted the fourth \u0022natural\u0022 launch - landing on Minmus - because it would not have gotten me any further. \n\nIf it is fun for someone else to grind \u0022Science from Kerbin Orbit\u0022 for 50 hours, I don\u0027t think anyone will stop him.\n\n@LittleBlueGaming:\n\nIf you want to maximize your science in the fourth launch, try to work with EVA reports from both Mun andMinmus orbit. I am not sure if you can have enough delta-v to make multiple hops on Minmus if you bring along a Science Jr. and Bob. You propably cannot collect surface samples, which yield the most science from landing - the R\u0026D Upgrade is expensive..."},{"CreatedByName":"LittleBlueGaming","CreatedById":144665,"CreatedDateTime":"2015-05-26T20:48:18Z","Content":"\u003E \n\u003E @LittleBlueGaming:\n\u003E \n\u003E If you want to maximize your science in the fourth launch, try to work with EVA reports from both Mun andMinmus orbit. I am not sure if you can have enough delta-v to make multiple hops on Minmus if you bring along a Science Jr. and Bob. You propably cannot collect surface samples, which yield the most science from landing - the R\u0026D Upgrade is expensive...\n\nThanks for the advice. I painted myself into a corner WRT funds, so I\u0027m going to need to redo launch 3 and try something else."},{"CreatedByName":"ToneStack","CreatedById":142969,"CreatedDateTime":"2015-05-27T06:55:03Z","Content":"Forgive me, but for some reason my attempt to start the game out with 0 funds did not take and the game loaded with 10,000 funds ![:(](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif), the science and rep did indeed load at zero\n\nI have looked in the screenshots, and I have never started or ended a launch with fewer than 10,000 funds, so have a question?\n\nIs it ok to effectively say that I completed the same challenge as the others, as the game does not add interest to the money like a bank account or bond? \n\nor would the additional 10,000 at some point in the game might post additional/significantly different contracts \n\nthan it would with the 10,000 fund correction reduction? \n\nI did not catch this until after my 3rd launch a couple hours into my journey, \n\nso know that my actual remaining funds are always 10,000 less than it\u0027s showing in all my screenshots.\n\nThe only mod I installed is Kerbal Engineer to help calculate delta V\u0027s in the VAB.\n\nAlso, I did not know at the time that my screenshots though showing periapsis and apoapsis tags when i hit F1 to take it, \n\ndid not show in the actual jpg images ![:(](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif). It has been a learning curve for me figuring out how screenshots work.\n\nI don\u0027t know how to correct those ones\n\na brief description of my journey below\n\nVVVVVVVVVV\n\nFlight one \n\nWalking science (DV 0)\n\nGot total of 35 science, no launch first vessel contract fulfillment but got quite a bit of funds from science data, but counted as requested\n\nFlight two (DV 2,279)\n\nUp Through Atmosphere into space\n\nFlight Three (DV S6 1415 \u002B S3 1383 \u002B S2 3244 = 6041)\n\nJeb Kerman up to Kerbin Orbit (using all but about half of stage 2 fuel) =\u003E Mun Orbit =\u003E \n\nand back on inclined kerbin orbit for science collection or crew/eva reports totaling 130.2 science\n\nFlight Four (DV S5 1586 \u002B S4 1411 \u002B S2 3453 = 6430)\n\nJeb and Bob Kerman to Kerbin Orbit (leaving 310 of 540 of Stage 2 fuel left) =\u003E Mun Orbit (leaving 125 of 540 fuel left) =\u003E Minmus transfer (98.65 fuel left)\n\n=\u003E Bob eva\u0027s down to Minmus surface and plants a flag with only 1.59 of 5 of eva propellant remaining =\u003E \n\nJeb goes home with a lot of stored science in material bay studies of Kerbin, Mun \u0026 Minmus Totaling 345.3 science\n\nJeb and Bob Kerman into Kerbin orbit,\n\nFlight Five \n\nNot yet done\n\n{Once i figure out how to attach the screenshot files, I will be reediting this post to put them in there... It looks like I don\u0027t have permission to Post Attachments right now, I don\u0027t know why ![:(](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif). Can a moderator help me here please?}"},{"CreatedByName":"Maolagin","CreatedById":129708,"CreatedDateTime":"2015-05-27T16:27:49Z","Content":"\u003E \n\u003E Forgive me, but for some reason my attempt to start the game out with 0 funds did not take and the game loaded with 10,000 funds ![:(](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif), the science and rep did indeed load at zero\n\u003E I have looked in the screenshots, and I have never started or ended a launch with fewer than 10,000 funds, so have a question?\n\u003E \n\u003E Is it ok to effectively say that I completed the same challenge as the others, as the game does not add interest to the money like a bank account or bond?\n\nAs long as your screenshots show that you never went below 10,000 funds, then I suppose I\u0027ll allow it.\n\n\u003E Once i figure out how to attach the screenshot files, I will be reediting this post to put them in there... It looks like I don\u0027t have permission to Post Attachments right now, I don\u0027t know why ![:(](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif). Can a moderator help me here please?\n\nImages are not hosted on the forum itself, you have to use an outside service. The most common thing to do around here is go to imgur.com and create a gallery. Then you can use the [imgur tag](https://forum.kerbalspaceprogram.com/misc.php?do=bbcode#imgur) to embed the gallery in a post."},{"CreatedByName":"ToneStack","CreatedById":142969,"CreatedDateTime":"2015-05-27T19:41:39Z","Content":"\u003E \n\u003E As long as your screenshots show that you never went below 10,000 funds, then I suppose I\u0027ll allow it.\n\u003E Images are not hosted on the forum itself, you have to use an outside service. The most common thing to do around here is go to imgur.com and create a gallery. Then you can use the [imgur tag](https://forum.kerbalspaceprogram.com/misc.php?do=bbcode#imgur) to embed the gallery in a post.\n\nOk, I will try out imgur.com to get my gallery out later this week... Am not sure if I spend more time in KSP or more time in narrating the screenshots and such, But am having a whole lot of fun learning how the screenshot system, science system, funds system, experience system, contract system works and such all from this greatly crafted challenge, thank you ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nTone Stack\n\n**Edited \u003Ctime datetime=\u00222015-05-27T19:48:04Z\u0022 title=\u002205/27/2015 07:48  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 27, 2015\u003C/time\u003E by ToneStack**\n  \ncorrect the autocorrected word imager"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2015-05-28T15:48:15Z","Content":"\u003E \n\u003E ok this challenge is pure grinding, as theoretically you can get any money and science from part testing in orbital around Kerbin. \n\u003E hereby I claim that it possible that with craft five you can visit all planets and moons in one go if your computer allows, have all sciences and all upgrades, no matter what difficulty.\n\nI will be very interested to see your submission as you plainly have so much skill that challenges like this are easily won. ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)\n\nI expect you to obtain first place when you do submit. I also expect nothing less than a visit to every moon and planet.\n\nThe only thing reasonable to do with claims (as far as challenges go) is to back them up with a submission that proves your claim while staying within the rules..."},{"CreatedByName":"MarvinKitFox","CreatedById":99545,"CreatedDateTime":"2015-05-28T19:26:38Z","Content":"Ok, this will be easy. Or not.\n\nShort-Short summary..\n\nMission1:\n\nLocal hopper. Get eva reports for all ksp biomes, grassland, tundra, shore.\n\nFly to 5000m.\n\nSci: 50.2 Funds: 50000\n\nMission2: \n\nPolar Orbit Observer.\n\nPolar orbit. High orbit. Crew reports, eva reports all kerbin biomes. No science instruments, thanx, too heavy!\n\ndo 5 \\* surface observe contracts. \n\ndo 3 \\* science-in-orbit contracts.\n\nland on south pole.\n\nSci income: 65\n\nfunds: 120k. upgraded mission control, training.\n\nMission3:\n\nMun polar, Minmus Polar\u002Blanding, return.\n\nUpgrade the launchpad to allow heavier ships.\n\nBuild the best 30-part ship I can. Includes enough delta-v to go to Mun low orbit, then to Minmus low orbit, then fly back for recovery.\n\nMaybe, \\*maybe\\* enough delta-v for minmus landing. The ship has a margin of only 120m/s, and \\*\\*BOB\\*\\* is going to be piloting!\n\nYes, I am loading a scientist, so I can Do endless cycles of science on the Goo Cannister and the Material Science bay.\n\n.\n\nLaunch, fine.\n\nGo to Mun, mostly fine.\n\nMun capture, not so fine. Without the use of a decent tracking system, the interface LIES to me and predicts an orbit, but when I get to the Apogee i \u0022fall off\u0022 Mun\u0027s SOI.\n\nNo problem, I get recaptured less than 2 years later.\n\nEnter 11800m circular polar orbit. \n\nGet all wanted sciend, from all biomes.\n\nAlso get 3 contracts for observations and Temperature sensing.\n\nDo all the \u0022above xxx m\u0022 reports.\n\ndrop orbit to 8500m (using mere vapors of fuel), do all the \u0022below xxx m\u0022 reports.\n\nGo to mission control, pick up another 3 similar contracts.\n\nand repeat\n\nand repeat.\n\nand repeat!\n\nOk, I have now exceeded 2 000 000 funds, and 130 science just from recycling mun orbital contracts!\n\nThis is where I quit, sorry. Given enough patience, I could gather infinite science, and about 13000\\*infinite funds doing this. \n\nAlbum , first two and a half missions:\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/Qi4fr)\n\n**Edited \u003Ctime datetime=\u00222015-05-30T12:52:34Z\u0022 title=\u002205/30/2015 12:52  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 30, 2015\u003C/time\u003E by MarvinKitFox**\n  \nUpdate, mission 3"}]}