{"TopicId":108734,"ForumId":16,"TopicTitle":"Massive steady reusable heavy SSTO (rocket)","CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-05-11T08:18:25Z","PageNum":1,"Articles":[{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-05-11T08:18:25Z","Content":"\n\u003Cp\u003EI like big rocket (don\u0027t ask me why \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E)\u003C/p\u003E\u003Cp\u003EIn carreer mode, big rockets are costly. I have a space station in LKO, I would like to refuel it but I only have a 22T launcher partially reusable. I want to build something bigger and scalable (50 /10 / 150T)\u003C/p\u003E\u003Cp\u003EAs my 22T launcher is very stable and easy to fly rocket (both manually and with MJ), I wanted to start from there\u003C/p\u003E\u003Cp\u003E(Sorry I can\u0027t post screenshot now, I\u0027ll try this evening)\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EBasic design\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s a 3 or 4 S3-720 extra large fuel tanks (I don\u0027t have the biggest yet) on to of a mamoth. It\u0027s helped by 2 or 4 biggest SRB. I\u0027ve added 4 wings at the bottom and 4 winglets in the middle to help control. This stage can go to space, circularize the payload and deorbit itself.\u003C/p\u003E\u003Cp\u003EAs I only have the smallest flat probe core, I put it on top of the stage under the payload decoupler. I only need 4 struct to get it stable, even with tall payloads under fairing. It\u0027s quite ugly, but it works.\u003C/p\u003E\u003Cp\u003EThe 2 renetry I did got different results, but successful. The first one went head first until the chute was open. The second one went sideways and didn\u0027t even burn in atmosphere (nearly no flame effect). In both cas, landing (in water) let me salvaged ALL the stage (except SRB which were ditch after take-off).\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EThe new design\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EI go for the heaviest first (able to lift off nearly 150T). I have a central 4 * S3-720 tanks with no engines at the bottom and 6 lateral 3 * S3-720 tanks with mamoth at the bottom. Each engin has one wing at the bottom. winglets is added at the bas of the stage nose cone). Fuel lines feed the lateral tank with the central tank. No SRB are needed. With 145T / 4 orange tanks (stacked and fuel locked), I get a dV of 3700m/s. I only use 6 struts to fix the first stage. Yes, it\u0027s a big rocket...\u003C/p\u003E\u003Cp\u003EI succeeded in orbiting at LKO (manually and with MJ). It\u0027s quite stable except in the first few seconds seconds, but I suspect it\u0027s due to the very tall payload. I get 400m/s (without payload) to deorbit the first stage. Now the tricky part :\u003C/p\u003E\u003Cp\u003EI need a probe core, and some batteries. I don\u0027t want to put them at the top because they are too small. So I put them in a bay at the bottom of the central tank (the one without engine). I add some adapters (the very large one and the rockamax). Then the small bay and a small heat shield.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EAnd my problem\u003C/strong\u003EOn reentry, the rocket always come bottom first. The rockamax adapter overheats quickly and blast. The bay is deconnected from the rocket (which don\u0027t have battery and probe controle). I\u0027m unable to open the chutes in low atmosphere.\u003C/p\u003E\u003Cp\u003EAnd an non important thing : I also loose my 6 winglets, which is strange because on the basic stage reentry I didn\u0027t loose anything.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E- How can I organise the central bottom of my craft to add that stuff and survive reentry ?\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ENB : I\u0027ll add some screen this evening\u003C/p\u003E\n"},{"CreatedByName":"Xannari Ferrows","CreatedById":125369,"CreatedDateTime":"2015-05-11T09:06:39Z","Content":"\n\u003Cp\u003EHow steeply are you entering? Technically there\u0027s no figure for how to survive reentry. If you don\u0027t have a heat shield, take it slow and steady. If you still encounter this issue, I\u0027d need to see the craft\u0027s appearance to help.\u003C/p\u003E\n"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-05-11T09:16:55Z","Content":"\n\u003Cp\u003EI don\u0027t know exatly. I made a 120m/s retrograde at 75km and then, when starting heating, an additionnal 250m/s (all the fuel left) to slow down a bit.\u003C/p\u003E\u003Cp\u003EMy goal is to land as near as KSC as possible.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2015-05-11T11:31:16Z","Content":"\n\u003Cp\u003EGood idea with an heatshield on it, test it, you probably don\u0027t need all the abalastive covering. You could also put this below the nosecone on the side rockets if I understand your design right.\u003C/p\u003E\u003Cp\u003EAirbrakes high up is also an good idea, this let you get more control on you landing, basicaly you overshoot a bit then use airbrakes to slow down. \u003C/p\u003E\u003Cp\u003ESame with some parachutes.\u003C/p\u003E\n"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-05-11T11:41:19Z","Content":"\n\u003Cp\u003EI\u0027ll test that as soon as possible.\u003C/p\u003E\u003Cp\u003EOther question : \u003C/p\u003E\u003Cp\u003EHow to use drogue chutes ?\u003C/p\u003E\u003Cp\u003EFor now I only use regular radial chutes (I have 24 of them, probably not enough, but that\u0027s easy to fix afterwards). Can I use drogue chute to deploy in upper atmoshere to slow down (until they burn). If not, how do you use them ?\u003C/p\u003E\n"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-05-11T13:10:42Z","Content":"\n\u003Cp\u003EAfter some dirty calculations, the first stage has a 13% efficiency in mass (wet payload mass / wet total mass). This is quite low, but I hope to recover 100% of the dry mass and funds (except discount for distance to KSC). As the first stage is not only on suborbital but taken into orbit, you can land it anywhere and not only on the other side of Kerbin, where recover rate is around 20%. 80% refund on dry mass should be reasonnable.\u003C/p\u003E\u003Cp\u003EThe effective funds / payload ton should be quite low.\u003C/p\u003E\n"},{"CreatedByName":"TheXRuler","CreatedById":125517,"CreatedDateTime":"2015-05-11T16:34:46Z","Content":"\n\u003Cp\u003EI haven\u0027t played much 1.0 but I would recommend a smaller braking burn, in .90 with FAR and DRE I usually circularized at ~71km and then lowered my Pe to ~35km. Also, dump all your leftover fuel before reentering the lighter you are the faster you will slow down \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe drogue chutes probably will not make much difference, they should burn up more or less instantly (at least as soon as you get enough pressure to slow down), however maybe airbrakes in the upper atmosphere could help a little.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-11T17:10:29Z\u0022 title=\u002205/11/2015 05:10  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 11, 2015\u003C/time\u003E by TheXRuler\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-05-11T17:37:33Z","Content":"\n\u003Cp\u003EOK, I used a doble heat shield. That worked\u003C/p\u003E\u003Cp\u003EFirst landing : damaged but nothing exploded. I need more chutes...\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://tof.canardpc.com/view/08a045a7-2fd2-49e5-a3e0-2e07504f1082.jpg\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://tof.canardpc.com/preview/08a045a7-2fd2-49e5-a3e0-2e07504f1082.jpg\u0022 alt=\u002208a045a7-2fd2-49e5-a3e0-2e07504f1082.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ll try a more shallow angle.\u003C/p\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2015-05-11T18:24:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Warzouz\u0022 data-cite=\u0022Warzouz\u0022\u003E\u003Cdiv\u003EI don\u0027t know exatly. I made a 120m/s retrograde at 75km \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s actually quite a lot and will make for a very steep re-entry. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Warzouz\u0022 data-cite=\u0022Warzouz\u0022\u003E\u003Cdiv\u003EOther question : \u003Cp\u003EHow to use drogue chutes ?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELike any other. They seem to be a little pointless right now: ordinary parachutes act as drogues when semi-deployed... I never really felt the need to add drogues. \u003C/p\u003E\u003Cp\u003EBesides, the lowest possible semi-deployment altitude is somewhere around 4200-4500m; the highest possible drogue deployment is 5000. That leaves drogues with only a few short moments to do their work.\u003C/p\u003E\n"},{"CreatedByName":"TheXRuler","CreatedById":125517,"CreatedDateTime":"2015-05-11T18:38:25Z","Content":"\n\u003Cp\u003EI agree with laie on that the drogue chutes are pretty much useless. Semi-deployment should not act as a drogue chutes (as far as I know it doesen\u0027t do that in real life) however with chutes fully deploying instantly and ripping crafts apart I see why they do it that way, I just think they should either slightly rework semi-deployment (ie a max amount of time like 30 seconds) or do it more like the realchutes mod in wich chutes deploy gradually, then at least drogues would have a use \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-05-11T18:58:20Z","Content":"\n\u003Cp\u003EI did a 60m/s deorbit and hit water past KSC at 10m/s. The winglets survived (I added airbrakes and doubled the chutes - 48 now). Still, I broke something but I recovered most of it.\u003C/p\u003E\u003Cp\u003EStage price with fuel : 439 600\u003C/p\u003E\u003Cp\u003EStage price without fuel : 366 900\u003C/p\u003E\u003Cp\u003EStage recovery : 340 500 at 94% \u003C/p\u003E\u003Cp\u003ETotal loss in funds : 99.1k\u003C/p\u003E\u003Cp\u003EPer payload ton : 683 funds / ton\u003C/p\u003E\u003Cp\u003EFull rocket weight : 1138T\u003C/p\u003E\u003Cp\u003EStage weight (fueled) : 994T\u003C/p\u003E\u003Cp\u003EPayload weight : 144.3T\u003C/p\u003E\u003Cp\u003EWeight efficiency : 12.7%\u003C/p\u003E\u003Cp\u003ETWR : 1.51 on launch pad\u003C/p\u003E\u003Cp\u003EdV for 145T = 3675m/s\u003C/p\u003E\u003Cp\u003EdV to deorbit (without payload) = 350m/s\u003C/p\u003E\u003Cp\u003EI\u0027ll do more tweaking tomorrow\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://tof.canardpc.com/view/eecd43ea-d014-460e-8ffd-f22f54f169d6.jpg\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://tof.canardpc.com/preview/eecd43ea-d014-460e-8ffd-f22f54f169d6.jpg\u0022 alt=\u0022eecd43ea-d014-460e-8ffd-f22f54f169d6.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E(click to enlarge)\u003C/p\u003E\n"},{"CreatedByName":"TheXRuler","CreatedById":125517,"CreatedDateTime":"2015-05-11T19:04:50Z","Content":"\n\u003Cp\u003E~140t to orbit for ~100k is actaully quite reasonable, the only way to exceed this that I know of is using a gigantic SSTO.\u003C/p\u003E\n"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-05-12T07:58:24Z","Content":"\n\u003Cp\u003EI\u0027m still hitting the ground at 10m/s with 48 chutes (15m/s with 24 chutes)\u003C/p\u003E\u003Cp\u003EAt that speed, the engins aren\u0027t detroyed but tanks can. How can I secure the rocket without adding more chutes ?\u003C/p\u003E\u003Cp\u003EFor now, lateral engines and tanks are connected to the central tank at the topmost tank. Then I added tanks top to bottom and finally the engine. I fixed the engines with a single strut to the central tank, then added fuel line.\u003C/p\u003E\u003Cp\u003EDo you think that would matter if I attached the engine first (not even sure that I can)? or even the bottom tank. then build bottom to top and attach a strut at the top ?\u003C/p\u003E\n"},{"CreatedByName":"TheXRuler","CreatedById":125517,"CreatedDateTime":"2015-05-12T09:08:47Z","Content":"\n\u003Cp\u003EHmmm I don\u0027t think it\u0027ll be possible to slow down much by adding more chutes, either keep a little fuel to make one last braking burn right before touchdown, or avoid landing in the ocean, if you touchdown on land your landing legs can absorb the shock with far less damage to your spacecraft.\u003C/p\u003E\n"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-05-12T10:59:01Z","Content":"\n\u003Cp\u003EI usually have fuel left after dorbit which I use to slowdown (usually nearly 300m/s). I could keep it for a near touch down burn. I\u0027m not sure that 300m/s slowdown in upper atmo does much for heat protection.\u003C/p\u003E\u003Cp\u003EI don\u0027t have landing struts just because it\u0027s not too easy to target landing point. Let\u0027s say I\u0027ve 50% to overshoot KSC.\u003C/p\u003E\u003Cp\u003EI\u0027ll try some tweaks. But tests are quite long to perform... (take-off, circularize, release payload, set deorbit node, manage renetry, final landing)...\u003C/p\u003E\u003Cp\u003EAlso I\u0027ll try to ass some more aerobrakes. I\u0027ve only added 1 per engine. Maybe I could save on heatshields.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2015-05-12T11:13:54Z","Content":"\n\u003Cp\u003EWhy don\u0027t use the engines to slow down before landing, this way you save on parachute mass too. you only need trust a few seconds.\u003C/p\u003E\n"},{"CreatedByName":"TheXRuler","CreatedById":125517,"CreatedDateTime":"2015-05-12T11:29:25Z","Content":"\n\u003Cp\u003EIf you go shallow enough the high altitude braking burn shouldn\u0027t be necessary. What I reccomend is to remember how much fuel you have left in orbit after your initial deorbit burn, then go to the VAB and edit your fuel tanks so that you have the same level of fuel as after your initial deorbit burn and then find out how many engines you have to turn of to get a TWR of about 0.9. Maybe set an action group for this? If neccesarry you could play around with the thrust limiters to fine tune your TWR. Then when you want to deorbit you just activate the action group/set the thrust limiters and deorbit as usual, burn ~all your fuel leaving about 3 seconds of fuel for the final braking burn. Then, when you are only ~2 seconds from impact you hit the \u0022z\u0022 (or \u0022y\u0022 depending on qwertz or qwerty) key to fire your engines up to 100%, that should slow you down sufficiently.\u003C/p\u003E\n"},{"CreatedByName":"n0xiety","CreatedById":143324,"CreatedDateTime":"2015-05-12T11:32:09Z","Content":"\n\u003Cp\u003EI land this huge thing with no parachutes when im returning from duna. Mining really made it too easy tho. I land refuel go for another planet land refuel continiue.\u003C/p\u003E\u003Cp\u003EIf i were to try landing with parachutes im guessing more than 100 would be needed\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/VorbV\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-12T11:34:45Z\u0022 title=\u002205/12/2015 11:34  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 12, 2015\u003C/time\u003E by n0xiety\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2015-05-12T13:07:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022n0xiety\u0022 data-cite=\u0022n0xiety\u0022\u003E\u003Cdiv\u003EI land this huge thing with no parachutes when im returning from duna.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThats... impressive. Though I wonder why you land it at all, rather than refuel on, say, the Mun. \u003C/p\u003E\u003Cp\u003EThat said and back to topic: personally, I prefer to have a few chutes even when going for a powered landing. Don\u0027t need to be many, but they do straighten out your ship and make sure that you don\u0027t even have to think about controls. You\u0027ll come down nose up without sideslip and can concentrate on throttling.\u003C/p\u003E\n"},{"CreatedByName":"n0xiety","CreatedById":143324,"CreatedDateTime":"2015-05-12T13:47:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Laie\u0022 data-cite=\u0022Laie\u0022\u003E\u003Cdiv\u003EThats... impressive. Though I wonder why you land it at all, rather than refuel on, say, the Mun. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell ofc i can just keep this thing at minmus and just send shuttles back and forth for my kerbals and the science i bring back from planets yet when returning from another planet aerobreaking is a must at kerbin and it just seems easier to me to reenter and salvage the craft then send another one for a different mission. About the landing the bottom part is so heavy because of the engines and the fuel being consumed at the top levels first leaving only the bottom ones with fuel it never tries to flip and goes bottom first, tho i could always swap 4 of those nose cones with XL chutes for more stability. Btw noticed you accomplished jool-5 challenge. Bet it would be too easy with this thing now that we have mining. If it can takeoff from kerbin and reach minmus to refuel it can takeoff from anything excluding jool and eve ofc.\u003C/p\u003E\n"},{"CreatedByName":"Dreambish","CreatedById":140312,"CreatedDateTime":"2015-05-12T14:35:01Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003E@Laie on Drogue chutes: Like any other. They seem to be a little pointless right now: ordinary parachutes act as drogues when semi-deployed... I never really felt the need to add drogues.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EThey seem nice for small, awesome planes that you just want to have a small, red braking parachute trailing behind it after landing :\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-12T14:36:07Z\u0022 title=\u002205/12/2015 02:36  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 12, 2015\u003C/time\u003E by Dreambish\u003C/strong\u003E\n\u003Cbr\u003EWell, dunno how the quotes work yet\n\u003C/span\u003E\n"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-05-12T19:23:18Z","Content":"\n\u003Cp\u003EWell, I tried a powered landing. easy, finally, except those western mountains of KSC aren\u0027t a safe place to land ...\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://tof.canardpc.com/view/94fa2dd9-b5e2-42cd-8e37-91f5f13fa9de.jpg\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://tof.canardpc.com/preview/94fa2dd9-b5e2-42cd-8e37-91f5f13fa9de.jpg\u0022 alt=\u002294fa2dd9-b5e2-42cd-8e37-91f5f13fa9de.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAh, better\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://tof.canardpc.com/view/4c8f8728-fce4-4d66-8640-b977ca3b0956.jpg\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://tof.canardpc.com/preview2/4c8f8728-fce4-4d66-8640-b977ca3b0956.jpg\u0022 alt=\u00224c8f8728-fce4-4d66-8640-b977ca3b0956.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Eedit : BTW, airbrakes are VERY usefull to tweak landing site. They really create a LOT of drag. I landed at KSC just after reloading my previous descent in the mountains.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-12T19:45:11Z\u0022 title=\u002205/12/2015 07:45  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 12, 2015\u003C/time\u003E by Warzouz\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"kulkan1","CreatedById":143911,"CreatedDateTime":"2015-05-13T14:28:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022n0xiety\u0022 data-cite=\u0022n0xiety\u0022\u003E\u003Cdiv\u003EI land this huge thing with no parachutes when im returning from duna. Mining really made it too easy tho. I land refuel go for another planet land refuel continiue.\u003Cp\u003EIf i were to try landing with parachutes im guessing more than 100 would be needed\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/VorbV\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/VorbV\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAre you using any mods for this? Would you mind sharing the .craft? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-05-14T08:22:53Z","Content":"\n\u003Cp\u003EHmmm, my test launches when smoothly, so I reduced the size of the bottom wing. I thought that having a very tall (4 stacked orange tank (\u002B bay and nose cone) payload would be a sufficient limit test.\u003C/p\u003E\u003Cp\u003EBut using my launcher in real situation turned badly. I\u0027m trying to orbit space stations elements. Even using struts, I can\u0027t avoid heavy wobble. I can\u0027t event add 2 orange tanks with docking ports and struts (I don\u0027t have the BIG ports)\u003C/p\u003E\u003Cp\u003EWith wobble, the rocket tend to flip. I had to return to the big wings.\u003C/p\u003E\u003Cp\u003EStill struggling with ascent it seems.\u003C/p\u003E\u003Cp\u003ESuggestions ?\u003C/p\u003E\n"},{"CreatedByName":"Bev7787","CreatedById":136501,"CreatedDateTime":"2015-05-14T09:26:07Z","Content":"\n\u003Cp\u003EApparently air brakes deployed in atmo works. Try that\u003C/p\u003E\n"}]}