{"TopicId":108900,"ForumId":16,"TopicTitle":"Crew Capsules and SAS","CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2015-05-12T13:35:38Z","PageNum":1,"Articles":[{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2015-05-12T13:35:38Z","Content":"I don\u0027t exactly understand what Squad was shooting for with the crewed pods having no SAS without a pilot. I agree with the Stayputnik core, though it is irritating that it also has no guidance options.\n\nDid the Mercury astronauts have to hold onto the controls for the ascent?\n\nSo, is it safe to assume that crew pods are supposed to have no internal guidance or stability systems? What is the logic behind this decision? If they did it seems like the scientists and engineers could just flick a switch: in fact, **there is a light for SAS in the console.**\n\n(Read: question, not angry rhetorical question)"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2015-05-12T14:33:58Z","Content":"Gameplay.\n\n(Read: design decision)\n\nWhat job would pilots have then? Just using up all the EC and monoprop to turn the ship prograde? ![:wink:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)"},{"CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2015-05-12T14:38:11Z","Content":"\u003E \n\u003E Did the Mercury astronauts have to hold onto the controls for the ascent?\n\nI do get what you\u0027re saying, but Eisenhower DID pick the Seven because they were all test pilots, so they enabled SAS control that way (Not to mention every single one of them had BadS=true! ![:sticktongue:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif))\n\nIn all honesty though, I never run into the problem. I use pilots for all the early crewed missions, and by the time I need Scientists too I usually have the multi-crew pods so I can bring a pilot along. Even if I didn\u0027t, I\u0027d find a probe core that has SAS functionality and slap it on the top of the pod."}]}