{"TopicId":108915,"ForumId":36,"TopicTitle":"Old to New - DDS texture questions","CreatedByName":"tg626","CreatedById":112361,"CreatedDateTime":"2015-05-12T15:57:09Z","PageNum":1,"Articles":[{"CreatedByName":"tg626","CreatedById":112361,"CreatedDateTime":"2015-05-12T15:57:09Z","Content":"I have parts that the original author last updated in .24 - so far they have worked fine BUT, with the new fast loading DDS support I\u0027d like to convert the textures to DDS.\n\nI already know how to flip and convert the diffuse TGA textures to DDS BUT there are also XXX\\_NRM.tga normal maps that I don\u0027t quite know what to do with.\n\nDo they need to be greyscaled?\n\nDo they need to be made the alpha layer of the diffuse DDS?\n\nOr do they simply need to be flipped vertically and saved as a DXT1 DDS file?"},{"CreatedByName":"Konnor","CreatedById":95430,"CreatedDateTime":"2015-05-12T17:16:55Z","Content":"They need to be flipped vertically and saved with DXT5nm compression.\n\nAlso, check [this thread](https://forum.kerbalspaceprogram.com/threads/119873) out.\n\n**Edited \u003Ctime datetime=\u00222015-05-12T17:20:00Z\u0022 title=\u002205/12/2015 05:20  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 12, 2015\u003C/time\u003E by Konnor**"},{"CreatedByName":"tg626","CreatedById":112361,"CreatedDateTime":"2015-05-12T18:14:12Z","Content":"Good resource!\n\nI use \u0022[DXTBmp](http://www.mwgfx.co.uk/programs/dxtbmp.htm)\u0022 which goes back to my Flight Simulator days - it simply lets you open/save various formats and separates the RGB and Alpha Channels.\n\nFor the part I was testing on (Turbo Nisu\u0027s big hemispherical tank) I found the following to be true\n\nbigTankCap.dds (made from bigTankCap.tga) needed an alpha channel added to it, which I made mostly black with a small bit of white for the \u0022bands\u0022 around the edge of the tank. this was based on a guess of what would look good after looking at the stock X200-16 textures. I\u0027m not sure what the Alpha channel is doing in this texture however.\n\nbigTankCap\\_NRM.dds (made from bigTankCap\\_NRM.tga) I had to move the normal map from the RGB to the Alpha (which made it greyscale) and then darken it a touch. I then set the RGB channel to the same grey color found in model001.dds texture of the X200-16 tank.\n\nI used the X200-16 tank as my research subject because Turbo Nisu\u0027s \u0022BigTankCap\u0022 is \\*Clearly\\* intended to match the visual style of the X200 tanks.\n\nDXTBmp refers to the RGB image as \u0022Norm\u0022 and the Alpha channel as \u0022Trans\u0022. \n\nBased on my experiments so far, I have concluded:\n\nDiffuse DDS:\n\n- [\\*=1]Norm (RGB) = visible texture image  \n[\\*=1]Trans (Alpha) = ????\n\nNormal Map DDS:\n\n- [\\*=1]Norm (RGB) = Reflection/Shine (is this called \u0022Specualrity?\u0022)  \n[\\*=1]Trans (Alpha) = Bump Map"},{"CreatedByName":"shaw","CreatedById":64788,"CreatedDateTime":"2015-05-12T18:49:46Z","Content":"Diffuse texture: RGB = colour, alpha = depends on shader: can be transparency, \u0022specularity\u0022 or ignored.\n\nNormal map: red = ignored, green = Y component of normal vectors, blue = ignored, alpha = X component. Y is usually also copied to red and blue channels to lessen compression artefacts.\n\n**Edited \u003Ctime datetime=\u00222015-05-12T18:54:14Z\u0022 title=\u002205/12/2015 06:54  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 12, 2015\u003C/time\u003E by shaw**"},{"CreatedByName":"tg626","CreatedById":112361,"CreatedDateTime":"2015-05-13T00:36:33Z","Content":"I assume \u0022X Component\u0022 = X Component of normal vectors?\n\nAnd in any case, can you show me to a resource that will learn me what \u0022Y component of normal vectors\u0022 means? ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)"},{"CreatedByName":"shaw","CreatedById":64788,"CreatedDateTime":"2015-05-13T20:55:27Z","Content":"x and y component of per-pixel normal vector relative to surface, e.g. [0, 0, 1] means that normal points straight out of the surface, [1, 0, 0] points in the direction of the first texture coordinate (tangent) and [0, 1, 0] points in the direction of the second texture coordinate (binormal).\n\nGoogle bump-mapping."}]}