{"TopicId":108907,"ForumId":69,"TopicTitle":"SPH bug - disabled UI, and buttons, can\u0027t exit or do anything (Support files Included!)","CreatedByName":"Scarf123","CreatedById":133538,"CreatedDateTime":"2015-05-12T14:09:23Z","PageNum":1,"Articles":[{"CreatedByName":"Scarf123","CreatedById":133538,"CreatedDateTime":"2015-05-12T14:09:23Z","Content":"So just from browsing I\u0027ve noticed I\u0027m not the only one with this problem. Basically what\u0027s happening is I\u0027ve recently re-installed KSP a vanilla version of KSP. I\u0027m in early Career and I\u0027ve only just unlocked the space plane components. So when I head to the SPH and create a vehicle, I press Save, and then try to Launch. Just then, the UI grays itself out, the buttons become useless, and I can\u0027t bring up the menu or exit to the main Complex. If I quit the game, and start over, the vehicle isn\u0027t even available when I try to load it. (There\u0027s simply nothing, as if I never created a craft in the first place). This is evident in the .craft files as well, seeing as it\u0027s not even there. This is important for me, especially early in Career mode, because the plane helps gather a lot of science around Kerbin.\n\nI\u0027ve verified the game cache and upon reaching 100% it gives me a message saying something about one file being unverifiable and will be \u0022reacquired\u0022. I don\u0027t know what this means, I\u0027ve never seen this message whilst verifying the game cache.\n\nI\u0027m running KSP v1.0.2 through Steam on 64-bit Windows.\n\nHere\u0027s a link to a Dropbox folder with the output.txt, a screenshot, a .craft file (It\u0027s from the VAB but I thought maybe it wouldn\u0027t hurt to include), my saved game and a dxdiag.txt with my system specs.\n\n[https://www.dropbox.com/sh/u5lvcfbcn7kjlmg/AACNPnOpOQl3xUB2Qrh0mvQ3a?dl=0](https://www.dropbox.com/sh/u5lvcfbcn7kjlmg/AACNPnOpOQl3xUB2Qrh0mvQ3a?dl=0)\n\nI hope this is sufficient information at least to get started on this problem because it\u0027s evident on these forums and reddit (so basically, all of the internet), that a lot of people are having this problem. My most current install is probably the third time and the third new save file I\u0027ve created because bugs have made the game unplayable. I\u0027m trying not to complain, but it\u0027s pretty frustrating considering I\u0027ve never experienced the mid to end-game KSP gameplay because game breaking bugs. \n\nThanks for any help or advice that you fine gentlemen or ladies may be able to provide me with. Good day!"},{"CreatedByName":"iStickyDuck","CreatedById":75908,"CreatedDateTime":"2015-05-12T16:44:08Z","Content":"I posted about this earlier - It\u0027s clearly a fairly common bug. Needs to be fixed asap as it\u0027s annoying as hell!"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-05-14T10:37:42Z","Content":"Scarf123, please make sure your PC is not powering off your hard drives while you play KSP, your log shows that KSP cannot access the game files.\n\n    DirectoryNotFoundException: Directory \u0027C:\\Program Files (x86)\\Steam\\steamapps\\common\\Kerbal Space Program\\saves\\newest\\Ships\\SPH\u0027 not found.\n\n    IsolatedStorageException: Could not find a part of the path \u0022C:\\Program Files (x86)\\Steam\\steamapps\\common\\Kerbal Space Program\\saves\\newest\\Ships\\SPH\\Support Plane.craft\u0022.\n\nYou will need to check your powersave options."},{"CreatedByName":"iStickyDuck","CreatedById":75908,"CreatedDateTime":"2015-05-15T14:52:31Z","Content":"Found a fix!\n\nGo to [your install path]\\Kerbal Space Program\\saves\\[savename]\\Ships\n\nThe problem is caused by a missing SPH folder, if it\u0027s not there just create a new folder called SPH\n\nFixed it for me"},{"CreatedByName":"Scarf123","CreatedById":133538,"CreatedDateTime":"2015-05-16T05:46:46Z","Content":"So I used iStickyDuck\u0027s solution of creating a SPH folder in the \u0027ships\u0027 folder in the \u0027saved\u0027 folder for my affected game save and this did the trick! I\u0027m stoked."}]}