{"TopicId":109045,"ForumId":69,"TopicTitle":"Odd issue and intolerable framerate during tutorial missions in 1.0.2","CreatedByName":"Gurn94","CreatedById":143925,"CreatedDateTime":"2015-05-13T14:50:28Z","PageNum":1,"Articles":[{"CreatedByName":"Gurn94","CreatedById":143925,"CreatedDateTime":"2015-05-13T14:50:28Z","Content":"\n\u003Cp\u003EI thought I\u0027d try some of the tutorials after launch and have been getting some weird issues:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003ESometimes when I try to launch a tutorial mission that should start in space the game loads above Kerbin but there is no ship to control! The camera is stuck with nothing to focus on and no controls seem responsive. This happens maybe half of the time - if I quit and then launch the tutorial again chances are it will load properly and the ship will be there.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EMy framerate during tutorial missions is extremely inconsistent, but in a consistent way. If I start the docking tutorial for example and it loads correctly then my framerate is fine while looking at my ship, but then when I bring up the map screen it plummets to a slideshow. Closing the map screen after this point does not help - my framerate will still be bad in ship view. If I fight through this and do what the tutorial text tells me (set another ship as my target) then my framerate instantly smooths out again, but will plummet later on when I have to burn towards my point of intersection.\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ve dabbled in Sandbox mode as well but have so far had smooth framerates both in ship view and map view, so it seems to be a problem with the tutorials.\u003C/p\u003E\u003Cp\u003EOperating System\u003C/p\u003E\u003Cp\u003E Windows 7 Home Premium 64-bit SP1\u003C/p\u003E\u003Cp\u003ECPU\u003C/p\u003E\u003Cp\u003E AMD Athlon II X4 635 \u003C/p\u003E\u003Cp\u003E Propus 45nm Technology\u003C/p\u003E\u003Cp\u003ERAM\u003C/p\u003E\u003Cp\u003E 4.00GB Dual-Channel DDR2 @ 401MHz (6-6-6-18)\u003C/p\u003E\u003Cp\u003EMotherboard\u003C/p\u003E\u003Cp\u003E BIOSTAR Group N61PB-M2S (Socket AM2 ) \u003C/p\u003E\u003Cp\u003EGraphics\u003C/p\u003E\u003Cp\u003E L1710B (1280x1024@60Hz)\u003C/p\u003E\u003Cp\u003E 1023MB NVIDIA GeForce GTX 560 (ASUStek Computer Inc) \u003C/p\u003E\u003Cp\u003EStorage\u003C/p\u003E\u003Cp\u003E 465GB Western Digital WDC WD50 00AAKX-001CA SCSI Disk Device (SATA)\u003C/p\u003E\u003Cp\u003EOptical Drives\u003C/p\u003E\u003Cp\u003E TSSTcorp CDDVDW SH-S223C SCSI CdRom Device\u003C/p\u003E\u003Cp\u003EAudio\u003C/p\u003E\u003Cp\u003E NVIDIA Virtual Audio Device (Wave Extensible) (WDM)\u003C/p\u003E\n"}]}