{"TopicId":109098,"ForumId":21,"TopicTitle":"Official FAR Craft Repository","CreatedByName":"tetryds","CreatedById":50204,"CreatedDateTime":"2015-05-13T20:53:41Z","PageNum":11,"Articles":[{"CreatedByName":"gilflo","CreatedById":62881,"CreatedDateTime":"2015-06-14T20:54:32Z","Content":"New very long range cargo, low cross section and weak Mach 1 drag...\n\n[![608773screenshot100.png](http://img15.hostingpics.net/pics/608773screenshot100.png)](http://www.hostingpics.net/viewer.php?id=608773screenshot100.png)\n\n[![413533screenshot27.png](http://img15.hostingpics.net/pics/413533screenshot27.png)](http://www.hostingpics.net/viewer.php?id=413533screenshot27.png)"},{"CreatedByName":"FourGreenFields","CreatedById":139309,"CreatedDateTime":"2015-06-14T21:07:22Z","Content":"\u003E \n\u003E New very long range cargo, low cross section and weak Mach 1 drag...\n\nMind to show the cross section area \u002B cross section curves with raised gear? The way it looks with dropped gear, I wouldn\u0027t exactly call it a low-drag design."},{"CreatedByName":"kcs123","CreatedById":127158,"CreatedDateTime":"2015-06-14T23:14:55Z","Content":"[**SETIctt Rescue drones**](https://www.dropbox.com/s/r65vb7k2qqhf84j/SETIctt_RescueDrone.zip?dl=0) - craft files\n\nSomething for more/less early SETIctt career mod. Designed with only one **48-7S-Spark** engine. Both drones can take off from runway, although to reach orbit those need special launcher. Both crafts with launcher can be used with level 2 VAB/Launchpad. \n\nI will need some time to upload picture gallery taken trough test flights to show capabilities of those small crafts. It will be available in my craft thread soon.\n\n![gNCW9nc.png](http://i.imgur.com/gNCW9nc.png)"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2015-06-15T01:02:24Z","Content":"4km/s dV in LKO without a refuel:\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/APnLM)\n\nCraft file at [https://www.dropbox.com/s/zaxc83yiklu3ndd/Kerbodyne%20Norfolk%20LR.craft?dl=0](https://www.dropbox.com/s/zaxc83yiklu3ndd/Kerbodyne%20Norfolk%20LR.craft?dl=0)\n\n**Edited \u003Ctime datetime=\u00222015-06-15T12:09:18Z\u0022 title=\u002206/15/2015 12:09  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 15, 2015\u003C/time\u003E by Wanderfound**"},{"CreatedByName":"kcs123","CreatedById":127158,"CreatedDateTime":"2015-06-15T19:11:51Z","Content":"Test flights with some of my crafts. So I wondered, have you tried something similar ?\n\nOnly 8m @ nearly 1 mach.\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/vwfbz)"},{"CreatedByName":"Dnoe","CreatedById":105767,"CreatedDateTime":"2015-06-15T19:59:30Z","Content":"Hello, this is me being bored.\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/0HntX)"},{"CreatedByName":"FourGreenFields","CreatedById":139309,"CreatedDateTime":"2015-06-15T20:52:36Z","Content":"![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nCockpit \u002B canards \u002B the battery and spinny thingies I clipped into the connection part \u002B overheated connection part = this\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/fqBYe)\n\n I think I\u0027ll turn this into my standart lander ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)\n\n**Edited \u003Ctime datetime=\u00222015-06-16T07:01:20Z\u0022 title=\u002206/16/2015 07:01  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 16, 2015\u003C/time\u003E by FourGreenFields**\n  \nthanks kcs"},{"CreatedByName":"kcs123","CreatedById":127158,"CreatedDateTime":"2015-06-15T21:14:15Z","Content":"\u003E \n\u003E ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\u003E Cockpit \u002B canards \u002B the battery and spinny thingies I clipped into the connection part \u002B overheated connection part = this\n\u003E \n\u003E [http://imgur.com/a/fqBYe](http://imgur.com/a/fqBYe) (And I still have no idea how to properly post an imgur album - the \u0022embed\u0022 link there doesnt work... somebody mind to share the secret?)\n\u003E \n\u003E  I think I\u0027ll turn this into my standart lander ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)\n\nCheck out this page for [BB codes](https://forum.kerbalspaceprogram.com/misc.php?do=bbcode)\n\nFor your album you should write something like this\n\n    [noparse][imgur]fqBYe[imgur]For picture you will want to write this:[img=http://i.imgur.com/XSE2z0c.jpg][/noparse]"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2015-06-16T00:24:56Z","Content":"\u003E \n\u003E Test flights with some of my crafts. So I wondered, have you tried something similar ?\n\u003E Only 8m @ nearly 1 mach.\n\u003E \n\u003E [http://imgur.com/a/vwfbz](http://imgur.com/a/vwfbz)\n\nMach 3.2 at 178m:\n\n![Dum71zP.jpg](http://i.imgur.com/Dum71zP.jpg)\n\nMach 1.5 at 11m:\n\n![bz0HAMh.jpg](http://i.imgur.com/bz0HAMh.jpg)\n\nAround Mach 3 appears to be the limit; more than a few seconds of that and I reliably explode from overheating."},{"CreatedByName":"FourGreenFields","CreatedById":139309,"CreatedDateTime":"2015-06-16T11:18:20Z","Content":"Basic jet engine, Mach 1.350, 6m. Roughly level flight speed (although I was losing alt a tad too fast, and had to pull up)\n\n![PLtw4NX.jpg](http://i.imgur.com/PLtw4NX.jpg)"},{"CreatedByName":"kcs123","CreatedById":127158,"CreatedDateTime":"2015-06-16T16:41:17Z","Content":"\u003E \n\u003E Mach 3.2 at 178m:\n\u003E [http://i.imgur.com/Dum71zP.jpg](http://i.imgur.com/Dum71zP.jpg)\n\u003E \n\u003E Mach 1.5 at 11m:\n\u003E \n\u003E [http://i.imgur.com/bz0HAMh.jpg](http://i.imgur.com/bz0HAMh.jpg)\n\u003E \n\u003E Around Mach 3 appears to be the limit; more than a few seconds of that and I reliably explode from overheating.\n\n11m above ground is not the same thing as 11m above sea level. Otherwise, great piloting skill on that Kerbinside air race track.\n\nIt seems that you are right, anything higher than 3 mach will melt down your plane in seconds. On sea level some parts might break off from plane sooner due to aerodynamic stress.\n\nWith basic jet engine you can barely break Mach one, while with TurboJet you need to be carefull to adjust thrust to be just enough to achieve good speed, but not too much thrust to break down plane at same time."},{"CreatedByName":"larkvi","CreatedById":108735,"CreatedDateTime":"2015-06-16T22:49:28Z","Content":"I am trying to build a Skylon-inspired orange tank hauler to LKO, and am having some issues. I would love pointers.\n\nFor starters, it needs more runway than is available: after exhausting the entire runway, it gets to 20m over the water before it reaches the 200m/s is needs to climb. I then fly 45 degrees up until about 13-14,000m, where I start leveling off. At around 20,000m, I can get up to about 1100m/s before I have to switch to closed-cycle and point way up, as the nose, ram intakes, and engines will all start to dangerously overheat. I was under the impression that some planes are going 1400m/s before having this issue--is this true? Once I get out of the heat danger zone, I can make it most of the way to LKO, but, as you can see from the image, it takes part of the content of the orange tank to finish getting to 100x100 (my target altitude). Adding more fuel does not seem to help a lot, as it has trouble overcoming the added weight--it can barely take off as it is. Here is a short album:\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/0N4XF)\n\nFirst image shows it empty on the runway, just to show that it starts with 44 tonnes of fuel. 4th image shows how much of the orange tank I have to use. Data \u002B stability derivatives for 10k/mach1, 15k/mach2, 20k/mach4 are all green, but I nevertheless experiencing trouble with the nose bouncing up and down. When re-entering empty (periapsis set to 20k), it goes into a flat spin as soon as it encounters air, but then recovers around 15k, and actually has an good glide ratio (something like 50:3).\n\nWhich of the FAR windows would be helpful in improving this plane? Tricks on how to avoid so much heat building up?\n\nIn case anyone is motivated enough to look at the craft: [https://www.dropbox.com/s/287gtds2rbhdg66/Skylon%2002%20TEST.craft?dl=0](https://www.dropbox.com/s/287gtds2rbhdg66/Skylon%2002%20TEST.craft?dl=0)\n\nRequired mods: FAR (dev version), B9 Procedural wings, Tweakscale, Adjustable Landing Gear, Mechjeb.\n\n**Edited \u003Ctime datetime=\u00222015-06-16T22:56:00Z\u0022 title=\u002206/16/2015 10:56  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 16, 2015\u003C/time\u003E by larkvi**"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2015-06-17T00:19:38Z","Content":"Skylon can get away with tiny wings precisely because it uses an insanely long runway. You don\u0027t have that option.\n\nTo shorten your takeoff run: you either need to increase your acceleration (more thrust, less mass) or reduce your takeoff speed (more lift, less mass). Notice the common element? Shave all of the excess mass that you can. What mass tweakables are you using on the wings? How much monoprop and other such luxuries are you carrying? Etc.\n\nYou\u0027ll probably find enhancing lift to be more useful than trying to increase thrust. Firstly: are you using flaps? There are good reasons why almost all aircraft use flaps during takeoff and landing; they substantially enhance lift if set up right. Adding a bit more wing also wouldn\u0027t hurt. Just reducing the dihedral on the wingtips would add a fair bit of lift.\n\nWith heating: Part of the reason for your trouble is the relatively low-TWR design. Heat is a function of time as well as speed; a slower ship that accelerates over a long period can acquire more heat than one that blasts up to speed quickly. Get out of the thick lower atmosphere as rapidly as you can and try to do your acceleration in the low-drag thin stuff. But there\u0027s a balance there; go too high too soon and the RAPIERs will never get up to full power.\n\nThe other trick is to attach the overheating bits to parts with high thermal mass and good radiative properties. Never put small things onto other small things.\n\nA well-built ship should be able to get well above 20,000m before switching to oxidiser. What is prompting you to switch modes? Lack of air, lack of climb or lack of acceleration?\n\nRe: the nosebounce. Are you using *Dynamic Deflection* or *Kerbal Pilot Assistant*?\n\n**Edited \u003Ctime datetime=\u00222015-06-17T00:22:21Z\u0022 title=\u002206/17/2015 12:22  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 17, 2015\u003C/time\u003E by Wanderfound**"},{"CreatedByName":"FourGreenFields","CreatedById":139309,"CreatedDateTime":"2015-06-17T08:55:05Z","Content":"Well, if moar powa is only a problem during takeoff you can use takeoff boosters. Just some Fleas or stuff like that will get you a long way, and you can either add a gear to them (when dropped while still on the ground) and/or chutes (when dropped from alt).\n\nWorks like a charm for planes. 6 Hammer boosters \u002B 6 normal prop engines (KAX) can lift my Messerschmitt Me 323 \u0022Gigant\u0022 (\u0022Giant\u0022) with 2 orange tanks loaded, weighing nearly 200 tons.\n\nSadly though, SSTOs need more power to weight than planes.\n\nIf your problem isn\u0027t as much the power to weight, as getting the thing to orbit without using your fuel, maybe add a weak-but-efficient engine.\n\nFor re-entry (especially stability during rentry) add airbrakes to the tail. They both slow you down, and pull your tail back -\u003E nose prograde.\n\nAs for how to imrpove your design, maybe try adding another RAPIER pair in front of the wings (but so that they dont damage the wings ofcourse) (with pre-cooler, and either intake, or aerodynamic stuff). Alternate placement would be sticking them/one out the behind.\n\nI\u0027d use both those options, one for RAPIER, one for fuel (or one for fuel, one for normal rocket engine/nuclear engine)\n\n**Edited \u003Ctime datetime=\u00222015-06-17T10:12:20Z\u0022 title=\u002206/17/2015 10:12  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 17, 2015\u003C/time\u003E by FourGreenFields**"},{"CreatedByName":"larkvi","CreatedById":108735,"CreatedDateTime":"2015-06-17T14:14:42Z","Content":"I admit that I really don\u0027t understand how flaps and spoilers work in FAR. If I add a procedural control surface to the front of the delta wing, and then set it to flap, then activate it through an action group once before takeoff, is that how one makes a flap?\n\nI have not used either Dynamic Deflection or Kerbal Pilot Assistant, as I don\u0027t actually know what settings I would want to change. If I was going to use Dynamic Deflection, what settings would I change?\n\nI have the main pwings going from 0.600 down to 0.480 -- I assumed they would need to be strong to hold the 1.875 Rapiers. Is that wrong? The tail is narrower, 0.280 down to 0.240.\n\nI am finding that the intakeAir reads as 0 around 20,000m. I see the actual thrust go down from 1.5MN to around 600kN in MJ before I switch over, as the closed-cycle creates over 600kN.\n\nI will see what I can reduce. It currently carries 500 units of monoprop, since it has no reaction wheels, but perhaps I can shave off some small amounts of weight."},{"CreatedByName":"FourGreenFields","CreatedById":139309,"CreatedDateTime":"2015-06-17T16:31:24Z","Content":"\u003E \n\u003E I admit that I really don\u0027t understand how flaps and spoilers work in FAR. If I add a procedural control surface to the front of the delta wing, and then set it to flap, then activate it through an action group once before takeoff, is that how one makes a flap?\n\u003E I have the main pwings going from 0.600 down to 0.480 -- I assumed they would need to be strong to hold the 1.875 Rapiers. Is that wrong? The tail is narrower, 0.280 down to 0.240.\n\n[https://en.wikipedia.org/wiki/High-lift_device](https://en.wikipedia.org/wiki/High-lift_device)\n\nFlaps are on the trailing edge. I have yet to experiment with leading edge slats, but you could use both I suppose.\n\nSpoilers reduce lift by causing a stall on the wing they\u0027re attached to. They are usually also airbrakes, intendet to add drag, but not every airbrake is a spoiler afaIk.\n\nAfaIk, strength of the wings is not influenced by how thick they are, but I might be wrong, have yet to use B9 Procedural Wings (downloaded, but haven\u0027t tested them in flight). You don\u0027t usually need to do any high G maneuvers when flying SSTOs though, so I doubt you need to build it too robust anyway (ofcourse it shouldn\u0027t fall apart when slowing down fast, but I have yet to see that happen).\n\n**Edited \u003Ctime datetime=\u00222015-06-17T17:03:07Z\u0022 title=\u002206/17/2015 05:03  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 17, 2015\u003C/time\u003E by FourGreenFields**"},{"CreatedByName":"kcs123","CreatedById":127158,"CreatedDateTime":"2015-06-17T17:12:29Z","Content":"\u003E \n\u003E AfaIk, strength of the wings is not influenced by how thick they are, but I might be wrong, have yet to use B9 Procedural Wings. You don\u0027t usually need to do any high G maneuvers when flying SSTOs though, so I doubt you need to build it too robust anyway (ofcourse it shouldn\u0027t fall apart when slowing down fast, but I have yet to see that happen).\n\nYou are right. Both, thin and thick wing of the same shape (altough different root and tip thicknes) have the same wing/mass. Talking about B9PW.\n\nStock parts use predefined thicknes, so you can\u0027t compare those with B9PW. And strength/mass is entierly handled by FAR mod, B9PW does not change anything related to wing strength/mass.\n\nAsked same thing in B9PW thread, not so long time ago. Now, when I think some more of it, thicker wing does not have to be stronger or have more mass, because it could be holow inside mesh and only edges of wing surface contribute to wing mass and strength. That hole within wing mesh could be filled with fuel, though.\n\nIn that case fuel inside wing adds more mass, but whole wing is not stronger because of additional mass from fuel.\n\nDon\u0027t know if it is intended or not for procedural wing to behave in such way, but there is some logic behind it."},{"CreatedByName":"FourGreenFields","CreatedById":139309,"CreatedDateTime":"2015-06-17T19:31:32Z","Content":"Ok, after experimenting a little with slats, I have no idea how to make them work.\n\nAttaching them the same as normal flaps doesn\u0027t work. It reduces lift, and doesn\u0027t increase max AoA.\n\nAttaching them like flaps, but deflecting upwards simply causes the wing to stall sooner.\n\nAttaching them in front of the wings doesn\u0027t seem to make a difference. Same if mounted slightly in front and above, or below.\n\nMounting them inside the wing, and deflecting down didn\u0027t help. It did help a little when deflecting just barely out the top of the wing, but I don\u0027t realy count that as succes.\n\nAnyone got ideas, or knows how to make them work?"},{"CreatedByName":"kcs123","CreatedById":127158,"CreatedDateTime":"2015-06-17T20:06:39Z","Content":"Didin\u0027t messed too much with leading edge surfaces, but from things that I did before with canrads, maybe you will get better result if you set -100% AoA for leading control surfaces and also set other controls: pitch/roll/yaw to zero. Not exactly the same thing as flaps or slats, but I think that you will get desired effect with that.\n\nTrailing control surfaces should use normal pitch/roll/yaw settings like you have used to do it.\n\nShould you use \u002B or - sign for AoA% depends how far is whole wing from CoM. I have used positive AoA% on this plane to help adjusting yelow line(pitching) slope on FAR graph and to get additional lift, as main wing area was not enough for heavy cargo inside. Still waiting for B9 AeroPack to update, so I can recreate something similar.\n\n![kiryTTH.jpg](http://i.imgur.com/kiryTTH.jpg)"},{"CreatedByName":"FourGreenFields","CreatedById":139309,"CreatedDateTime":"2015-06-17T20:11:37Z","Content":"\u003E \n\u003E Didin\u0027t messed too much with leading edge surfaces, but from things that I did before with canrads, maybe you will get better result if you set -100% AoA for leading control surfaces and also set other controls: pitch/roll/yaw to zero. Not exactly the same thing as flaps or slats, but I think that you will get desired effect with that.\n\u003E Trailing control surfaces should use normal pitch/roll/yaw settings like you have used to do it.\n\u003E \n\u003E Should you use \u002B or - sign for AoA% depends how far is whole wing from CoM. I have used positive AoA% on this plane to help adjusting yelow line(pitching) slope on FAR graph and to get additional lift, as main wing area was not enough for heavy cargo inside. Still waiting for B9 AeroPack to update, so I can recreate something similar.\n\nThing is, I want to find out how to mount leading edge surfaces that increase lift and/or max AoA. Assigning them to AoA might be usefull when using them, but it won\u0027t change the ammount of lift gained at a certain AoA and slat position."},{"CreatedByName":"tetryds","CreatedById":50204,"CreatedDateTime":"2015-06-17T20:13:09Z","Content":"\u003E \n\u003E Didin\u0027t messed too much with leading edge surfaces, but from things that I did before with canrads, maybe you will get better result if you set -100% AoA for leading control surfaces and also set other controls: pitch/roll/yaw to zero. Not exactly the same thing as flaps or slats, but I think that you will get desired effect with that.\n\u003E Trailing control surfaces should use normal pitch/roll/yaw settings like you have used to do it.\n\u003E \n\u003E Should you use \u002B or - sign for AoA% depends how far is whole wing from CoM. I have used positive AoA% on this plane to help adjusting yelow line(pitching) slope on FAR graph and to get additional lift, as main wing area was not enough for heavy cargo inside. Still waiting for B9 AeroPack to update, so I can recreate something similar.\n\u003E \n\u003E [http://i.imgur.com/kiryTTH.jpg](http://i.imgur.com/kiryTTH.jpg)\n\nYou are aware that on supersonic your wings L/D ratio drops a lot, and after that body lift becomes more important the faster you go, and that having the engines on the top of them will kill your design after such interactions are implemented, right? ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)"},{"CreatedByName":"kcs123","CreatedById":127158,"CreatedDateTime":"2015-06-17T23:08:06Z","Content":"\u003E \n\u003E You are aware that on supersonic your wings L/D ratio drops a lot, and after that body lift becomes more important the faster you go, and that having the engines on the top of them will kill your design after such interactions are implemented, right? ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)\n\nYep. All of those put in consideration. That plane was made in v0.90, lifted 367,4t of payload with that plane. Pure payload, not additional fuel inside cargo bay.\n\nAlso it was considered that once in space thrust must be aligned with CoM, otherwise you will be spining in place instead going forward.\n\nIt was not easy task to choose between wing surface area that brings additional drag and that were dead weight in space and to put additional engine on plane.\n\nBut, for engine you will also need air intakes and additional fuel that provide lost dV due to engine and air intakes weight itself.\n\nSo, while I was building that plane, I found that additional lifting surfaces are only half of weight compared with engine\u002Bair intake \u002B fuel.\n\nYou need to plan ascent path carefully, to get into upper part of atmosphere where drag is low and to get there on more/less low speeds you need large lifting surfaces to have stability above 20km.\n\nAnyway, whole test flight to orbit is recorded in [this galery](http://imgur.com/a/FfTZY#0).\n\nFor nuFAR, I would probably need to make some adjustments and put area ruling in consideration too.\n\n- - - Updated - - -\n\n\u003E \n\u003E Thing is, I want to find out how to mount leading edge surfaces that increase lift and/or max AoA. Assigning them to AoA might be usefull when using them, but it won\u0027t change the ammount of lift gained at a certain AoA and slat position.\n\nWith flaps/slats you will not gain magicaly insane amount of lift. Overall lift will not be so much higher, but you will shift high L/D ratio in lower AoA area by using flaps/slats and you can also benefit to have high L/D ratio on higher AoA. L/D will not rapidly drop on high AoA compared with and without flaps usage.\n\nAll that is valid only at low subsonic speeds. As you gain speed, flaps will bring more drag than lift they provide."},{"CreatedByName":"Vegatoxi","CreatedById":134066,"CreatedDateTime":"2015-06-18T00:24:27Z","Content":"Most of my crafts, which flies good in stock, completely messed up in FAR.\n\nRussian IL-76 replica. Only craft which fly good enough to not break the keyboard in a rage attack\n\n[spoiler=]\n\n![UYxAu2G2-z0.jpg](http://cs625729.vk.me/v625729249/37f9e/UYxAu2G2-z0.jpg)\n\nBut... when i tried to turn it\u0027s just splash into piecies. Lolwhut??!\n\nRussian Su-27 replica. Constantly flips to the back, constantly shakes in flight, almost uncontrollable. In stock aero it can do same what it\u0027s real prototype do. I mean supermaneuverability. But in FAR... it\u0027s pretty miserable.\n\n\u003E \n\u003E ![-0nyxddhMFM.jpg](http://cs625729.vk.me/v625729249/37fa7/-0nyxddhMFM.jpg)\n\u003E \n\u003E \n\n---\n\n\u003E \n\u003E ![NHx3G2N8PHY.jpg](http://cs625729.vk.me/v625729249/37fb0/NHx3G2N8PHY.jpg)\n\u003E \n\u003E \n\nAnd last - SR-71 replica, which flies exactly like a brick. Besides it\u0027s almost unreal to take-off despite the fact that center of lift matches the center of thrust.\n\n[spoiler=]![YSWDKJREjbo.jpg](http://cs625729.vk.me/v625729249/37fb9/YSWDKJREjbo.jpg)"},{"CreatedByName":"steve_v","CreatedById":69272,"CreatedDateTime":"2015-06-18T03:22:20Z","Content":"Post images with stability derivatives page open. More to the point, check them yourself at a range of speeds and altitudes. If a craft is unstable, the FAR SPH tools will explain why far more effectively than just eyeballing it.\n\n- - - Updated - - -\n\n\u003E \n\u003E But... when i tried to turn it\u0027s just splash into piecies. Lolwhut??!\n\nWhat\u0027s your velocity / altitude / dynamic pressure at this point? What are your wing strengths set to? \nGoing supersonic at sea level will probably rip the wings off anything not specifically designed for it.\n\n\u003E \n\u003E Besides it\u0027s almost unreal to take-off despite the fact that center of lift matches the center of thrust.\n\nAnd what exactly does COL/COT alignment have to do with takeoff?"},{"CreatedByName":"DKnight54","CreatedById":133114,"CreatedDateTime":"2015-06-18T05:10:14Z","Content":"\u003E \n\u003E Ok, after experimenting a little with slats, I have no idea how to make them work.\n\u003E Attaching them the same as normal flaps doesn\u0027t work. It reduces lift, and doesn\u0027t increase max AoA.\n\u003E \n\u003E Attaching them like flaps, but deflecting upwards simply causes the wing to stall sooner.\n\u003E \n\u003E Attaching them in front of the wings doesn\u0027t seem to make a difference. Same if mounted slightly in front and above, or below.\n\u003E \n\u003E Mounting them inside the wing, and deflecting down didn\u0027t help. It did help a little when deflecting just barely out the top of the wing, but I don\u0027t realy count that as succes.\n\u003E \n\u003E Anyone got ideas, or knows how to make them work?\n\nFrom my own experience with flaps in front of wings, you\u0027d need to set deploy angle to negative to get them to generate lift. Else they will deploy downwards and actually cause negative lift. Also, you need to set negative AOA else the flap will stall ( along with the rest of the wing) as soon as you pull up .\n\nOn my plane, I set flap deploy to -13.5 degrees, AOA to -90% and control surface deflection to 10 degrees\n\nSee if that helps.\n\nEdit:\n\nfor true slats, we\u0027d need something that pushes the leading control surface fowards.... Insane robotics might work except it\u0027d be wobbly... Or maybe Ferram can add code to deploy slats?\n\n**Edited \u003Ctime datetime=\u00222015-06-18T05:16:44Z\u0022 title=\u002206/18/2015 05:16  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 18, 2015\u003C/time\u003E by DKnight54**\n  \nThinking about slats"}]}