{"TopicId":109043,"ForumId":32,"TopicTitle":"What to do with all the science?","CreatedByName":"cicatrix","CreatedById":120831,"CreatedDateTime":"2015-05-13T14:45:32Z","PageNum":1,"Articles":[{"CreatedByName":"cicatrix","CreatedById":120831,"CreatedDateTime":"2015-05-13T14:45:32Z","Content":"I\u0027ve just unlocked the last tech node and still have about 2K unspent science points. There are also tons of science points left scattered on different planets but there\u0027s no more incentive to grab them. I\u0027m here to open a discussion about what\u0027s the best way to drive players to grab more science points. What can we do with all the science we get? We can always convert it to cash, of course, but money too are easy to get and flying to Eeloo and back for money just to plant a flag there is not very inspiring. \n\nCertainly the cost of late tech nodes can be increased, but anyway, eventually all tech nodes will be open. End game?\n\nWhat do you think can be done here?"},{"CreatedByName":"vicwarrior","CreatedById":120410,"CreatedDateTime":"2015-05-13T15:18:19Z","Content":"build super motherships and go on a tour across the system, build colonies on all the celestial bodies, take challenges etc etc...\n\nThis game is a sandbox."},{"CreatedByName":"adinfinitum","CreatedById":49226,"CreatedDateTime":"2015-05-13T15:30:10Z","Content":"It doesn\u0027t seem to be that we need a drive for more science points, its that we need something to to drive players to go to other planets. The goal of space programs, at least in their heyday, was exploration to pave the way for colonization of other worlds. Perhaps a set of parts based on future technologies, where you can only unlock them once you\u0027ve gotten a certain amount of science from each planet, would give players that incentive.\n\nFor example, you could have the unlock from Moho be advanced radiators/heat shielding, from Eve be a new, lightweight, more powerful fuel, from Eeloo the tech to make an engine that can handle that fuel, etc. It would add a nice little bit of story, and the end game could be you\u0027ve gotten all those techs, you now have the ability to travel to a new star system and explore there"},{"CreatedByName":"Mister Spock","CreatedById":116542,"CreatedDateTime":"2015-05-13T15:31:29Z","Content":"There are mods that extend the tech tree, but I\u0027m not exactly sure which. KSP Interstellar (and its offshoots, like KSPI Extended) adds stuff to the end of the tech tree, doesn\u0027t it? I tried it in .24 but never finished that career, so I didn\u0027t really get to explore it. Near Future Technologies might be another? Maybe someone can chime in here with a more accurate and comprehensive list."},{"CreatedByName":"Cdr_Zeta","CreatedById":59015,"CreatedDateTime":"2015-05-13T15:49:08Z","Content":"Hello,\n\nWhat mode...easy, normal, hard??? My Tree total Science is around 40,000 and there is supposedly 400,000 out there...\n\nCmdr Zeta"},{"CreatedByName":"cicatrix","CreatedById":120831,"CreatedDateTime":"2015-05-13T15:52:42Z","Content":"I do that, but revealing the tech tree makes a solid portion of parts useless. I didn\u0027t ask what to do once I unlocked all the parts. The question was about what can be done to get motivation to continue mining science. What can be the other ways to spend science. I only see one so far - upgrading specific parts on specific vessels so that they will be better than the same parts in VAB"},{"CreatedByName":"Oafman","CreatedById":110386,"CreatedDateTime":"2015-05-13T16:12:31Z","Content":"The KSP Interstellar mod gave good options for spending excess science; upgrading special parts etc. Otherwise I know of nothing to do with it. Maybe build up as much as possible then brag about your accomplishment?"},{"CreatedByName":"Mister Spock","CreatedById":116542,"CreatedDateTime":"2015-05-13T16:21:24Z","Content":"I think it\u0027s a good question. I like a sandbox as much as anyone else, but the \u0022achiever\u0022 part of me also thrives on externally-created goals.\n\nI\u0027ve been thinking about making a mod that would let you start building a growing monument (e.g., \u0022The Ksingularity\u0022) with endgame science -- a sort of hi-tech version of the \u0022Throne Room\u0022 you used to build in the Civ games, with aesthetic choices about how the direction your monument should take. Unlock the next tech node, choose one of various possible Lego Bricks for the next piece of your monument. Or maybe use the VAB to create this Ksingularity thing, brick by brick. Show it off to others for bragging rights. Or, if RAM or other limitations make a lego-brick system impractical, maybe just an ever-growing 2D \u0022throne room\u0022, but always with choices about how to expand your room, so that no two players ever build the same exact room. I used to love building my Throne Room in the old Civ games, and I was disappointed when the Civ designers removed it in later iterations of the series. I dunno, maybe that sort of thing doesn\u0027t appeal to others.\n\nI\u0027d like to see more endgame stuff too, and I may try my hand at creating a mod to enhance the endgame."},{"CreatedByName":"Baenki","CreatedById":67219,"CreatedDateTime":"2015-05-13T22:18:56Z","Content":"Use the Science -\u003E Funds strategy with 100% comittment to earn some funds.\n\nIt won\u0027t be a lot of cash and i don\u0027t think you can use the science you already collected to your account. \n\nBut why not. A small funding boost to a big program that wants to do missions besides contracts could be useful.\n\nBuild some expensive sattelites and lifters for the sole purpose of letting them desintegrate in the sun. Call it an experiment.\n\nTry to leave the solar system.\n\nBuild a huge space station with a lot of modules and room for hundreds of kerbals and deorbit it.\n\nMaybe you will need to stop the sci -\u003E funds strategy after that and insted opt into a 100% sci -\u003E rep one. ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)"},{"CreatedByName":"AbacusWizard","CreatedById":116476,"CreatedDateTime":"2015-05-13T23:27:22Z","Content":"My favorite thing to do with the throne room in Civ II was to upgrade, for as long as possible, everything *except* the throne itself. I\u0027d have an extravagant palace with sculpted marble columns and elaborately woven rugs and tapestries... and a rough-hewn boulder to sit on."},{"CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2015-05-13T23:43:33Z","Content":"You can send it over to me. Still got some nodes needing unlocking.\n\nTry doing small things again. I\u0027ve never completed the tech tree yet, but I can tell you what I do in sandbox. I go places and do things just for the sake of it. Or start career again with some mods this time, if you don\u0027t use any.\n\nI don\u0027t think you can do much with the science in stock once you don\u0027t need it anymore.\n\nEdit: Or try super hardcore mode. I once did that. Took way more time to do anything and any penalties/vessel-wrecking landings were unforgiving\n\n**Edited \u003Ctime datetime=\u00222015-05-13T23:48:50Z\u0022 title=\u002205/13/2015 11:48  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 13, 2015\u003C/time\u003E by Veeltch**"}]}