{"TopicId":109179,"ForumId":16,"TopicTitle":"how to re assign the de bug menu?","CreatedByName":"Roflcopterkklol","CreatedById":119190,"CreatedDateTime":"2015-05-14T12:34:13Z","PageNum":1,"Articles":[{"CreatedByName":"Roflcopterkklol","CreatedById":119190,"CreatedDateTime":"2015-05-14T12:34:13Z","Content":"\n\u003Cp\u003EMy function keys are dysfunctional so i have been without a debug menu through my entire time playing KSP (i havent had them since like 6 months after i bought this keyboard in 09 lol), i have always been good at finding the problem in things so i never really worried about it but with all the bugs im finding atm and not having a clue on how to fix them i am wanting that de bug menu pretty badly. \u003C/p\u003E\u003Cp\u003E my keyboard is a logitech g19 so it does have 12 spare macro keys i can re assign the functions to for what ever reason so no need buying a new one, only i can not do it in the game menu so how do i do it? \u003C/p\u003E\u003Cp\u003EI am assuming there will be a way in the game files, anyone know how i could do this? \u003C/p\u003E\u003Cp\u003EAnd no i will not be re assigning the G keys to F1-12 on the PC, that would work but i use the G keys in a lot of games.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-14T12:37:09Z\u0022 title=\u002205/14/2015 12:37  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 14, 2015\u003C/time\u003E by Roflcopterkklol\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-05-22T13:54:59Z","Content":"\n\u003Cp\u003EI don\u0027t think it\u0027s possible in stock, you could ask in General Add-on Affairs for someone to gin up a plugin for it.\u003C/p\u003E\n"},{"CreatedByName":"michaelsteele3","CreatedById":127113,"CreatedDateTime":"2015-05-22T13:58:39Z","Content":"\n\u003Cp\u003EWould it be possible to re-assign which keys do it somewhere in the game files?\u003C/p\u003E\n"},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2015-05-22T14:55:06Z","Content":"\n\u003Cp\u003EDunno if on-screen keyboard could do the job? (Hit the Fn button along the bottom.)\u003C/p\u003E\n"}]}