{"TopicId":109155,"ForumId":16,"TopicTitle":"kerbal ladder gymnastics","CreatedByName":"endl","CreatedById":119320,"CreatedDateTime":"2015-05-14T04:52:45Z","PageNum":1,"Articles":[{"CreatedByName":"endl","CreatedById":119320,"CreatedDateTime":"2015-05-14T04:52:45Z","Content":"\n\u003Cp\u003Eis there any advice for trying to get a kerbal into an access hatch located directly above said kerbal from the ground, i tried attaching two ladders at right angles from each other but the kerbal would not transition over in either direction\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-05-14T05:47:56Z","Content":"\n\u003Cp\u003ECan you be a little more specific about the layout? Is the hatch over your head on a ceiling, or just high up a wall out of reach? Also, where (i.e. what sort of gravity) is it-- Kerbin, or somewhere lighter?\u003C/p\u003E\n"},{"CreatedByName":"endl","CreatedById":119320,"CreatedDateTime":"2015-05-14T09:15:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Snark\u0022 data-cite=\u0022Snark\u0022\u003E\u003Cdiv\u003ECan you be a little more specific about the layout? Is the hatch over your head on a ceiling, or just high up a wall out of reach? Also, where (i.e. what sort of gravity) is it-- Kerbin, or somewhere lighter?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOver your head on kerbin\u003C/p\u003E\n"},{"CreatedByName":"cybersol","CreatedById":81136,"CreatedDateTime":"2015-05-14T09:20:09Z","Content":"\n\u003Cp\u003EKerbels can go at right angles between ladders if you press a or d at the exact right place. Also, for a hatch straight over your head, you might be able to use a single ladder because most hatches have short built in ladders.\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-05-14T17:48:35Z","Content":"\n\u003Cp\u003EAlso, kerbals can have trouble with sudden sharp angles in ladders, particularly \u0022concave\u0022 ones (i.e. where the next segment is bending towards the kerbal). One way to handle this is to adjust the angles so that they don\u0027t get too sharp. 45 degrees is probably OK, 90 is problematic.\u003C/p\u003E\u003Cp\u003EFor example, if the height of the overhead ceiling with the hatch isn\u0027t too high, you could probably do this with a single extendible ladder-- just don\u0027t make it go straight down to the ground, but instead at a 45 degree angle (so the kerbal is hanging from its underside while climbing. My guess is that this would work, as long as the ladder can reach the ground.\u003C/p\u003E\u003Cp\u003EAnother approach would be to send the ladder straight down (like you\u0027re doing), but at the right-angle join, add another short ladder segment at a 45 degree angle to the horizontal \u0026amp; vertical parts (i.e. so your kerbal makes two 45 degree turns instead of a single 90 degree turn while climbing). If 45 degrees turns out to be too sharp, use two ladder segments so there can be three 30-degree turns, you get the idea. Gradual rather than sharp turns.\u003C/p\u003E\n"}]}