{"TopicId":109276,"ForumId":16,"TopicTitle":"Struts vs Wheels for landing vs girders","CreatedByName":"tranenturm","CreatedById":143304,"CreatedDateTime":"2015-05-14T22:23:57Z","PageNum":1,"Articles":[{"CreatedByName":"tranenturm","CreatedById":143304,"CreatedDateTime":"2015-05-14T22:23:57Z","Content":"\n\u003Cp\u003EI\u0027m looking to do a mid-career science lab to the mun and wanted it mobile. I was looking at landing gear and saw their m/s values. Then I looked at wheels and they were measured in vastly different units.\u003C/p\u003E\u003Cp\u003EHow do I compare impact tolerance of wheels and struts.\u003C/p\u003E\u003Cp\u003EI also noticed the girders had VERY high impact resistance, anyone use those for landings?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-15T13:45:03Z\u0022 title=\u002205/15/2015 01:45  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 15, 2015\u003C/time\u003E by tranenturm\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-05-14T23:11:23Z","Content":"\n\u003Cp\u003EI-beams and girders make good landing gear but have their drawbacks:\u003C/p\u003E\u003Cp\u003E1. (new to 1.x) DRAAAAAGGGGG. You can\u0027t retract them, so they\u0027ll be sticking out during launch and fairings wide enough to cover the whole assembly make the launcher fly very poorly.\u003C/p\u003E\u003Cp\u003E2. (from before) No traction. If you land on even a moderate slope, your lander will slowly slide down the hill. And as it does so, 1 or more girders will get a good grip momentarily as the rest of the lander keeps moving, so the leg will bend. Then either the girder will lose its grip and the lander will jerk forward, or the girder will break off and the lander will fall over.\u003C/p\u003E\u003Cp\u003EBut seriously, Mun has low enough gravity than the normal lander legs will work most of the time.\u003C/p\u003E\n"},{"CreatedByName":"n0xiety","CreatedById":143324,"CreatedDateTime":"2015-05-14T23:16:31Z","Content":"\n\u003Cp\u003EThere are parts that has like 60m/s crash tolerance but that doesn\u0027t mean rest of your craft has the same values. Even if those girders don\u0027t explode the rest of the craft might just get separated and explode. Besides landing struts give you stability when you land on a slope.\u003C/p\u003E\n"},{"CreatedByName":"Jaeleth","CreatedById":136435,"CreatedDateTime":"2015-05-15T13:25:49Z","Content":"\n\u003Cp\u003EIn short: do what you would do in the real world and it\u0027ll be the most sensible. Landing gear is perfectly fine for... Landing. Specially the most sturdy model, which I would recommend for a larger vehicle, like that mobile lab. You should never approach ground at a speed that would damage the landing gear, it\u0027s unrealistic, i always make my touch down at speed below 3 m/s, unless something gone terribly wrong, like running out of fuel a few meters above ground, as it happened to me once, on the Mun.\u003C/p\u003E\u003Cp\u003Eadd a few roboust wheels that will make contact with the ground when you raise the landing gear and you\u0027ve got yourself a very workable rover/lander\u003C/p\u003E\n"},{"CreatedByName":"tranenturm","CreatedById":143304,"CreatedDateTime":"2015-05-15T13:44:34Z","Content":"\n\u003Cp\u003EI found the m/s values for the rover wheels, which is what I was confused about (it also has impact values). I\u0027ll be attaching the rovemax M1 wheels to the sci lab (with cupola as command module for effect). The M1 wheels are listed at 50 m/s which is far more than I need. I wanted to land the rocket on its side and just wanted to be sure the rover wheels could handle it. \u003C/p\u003E\u003Cp\u003EI do my best to land in a realistic manner, but as a novice I like to over engineer my rockets to account for my lack of pilot skills.\u003C/p\u003E\u003Cp\u003EThanks all!\u003C/p\u003E\n"},{"CreatedByName":"xtoro","CreatedById":79015,"CreatedDateTime":"2015-05-15T14:18:15Z","Content":"\n\u003Cp\u003EGo big or go home! Don\u0027t be afraid of large wheels or large payloads or fairings.\u003C/p\u003E\u003Cp\u003EHere\u0027s my mining rover getting ready for launch:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/R3vjt73\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/R3vjt73h.png\u0022 alt=\u0022R3vjt73h.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThis is what\u0027s inside the fairing:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/TrSQ9WB\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/TrSQ9WBh.png\u0022 alt=\u0022TrSQ9WBh.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EGot to orbit no problems. Drag isn\u0027t a huge problem, just keep the speed down for the first 10k ascent and slowly speed up after that. My rover is based on the MK3 parts and holds over 5k LF and O2. It\u0027s now landed on Minmus and drilling for ore. The large wheels are great, they never break and can take a hard landing.\u003C/p\u003E\u003Cp\u003EXT\u003C/p\u003E\n"},{"CreatedByName":"Jaeleth","CreatedById":136435,"CreatedDateTime":"2015-05-15T16:33:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tranenturm\u0022 data-cite=\u0022tranenturm\u0022\u003E\u003Cdiv\u003EI found the m/s values for the rover wheels, which is what I was confused about (it also has impact values). I\u0027ll be attaching the rovemax M1 wheels to the sci lab (with cupola as command module for effect). The M1 wheels are listed at 50 m/s which is far more than I need. I wanted to land the rocket on its side and just wanted to be sure the rover wheels could handle it. \u003Cp\u003EI do my best to land in a realistic manner, but as a novice I like to over engineer my rockets to account for my lack of pilot skills.\u003C/p\u003E\u003Cp\u003EThanks all!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s a good principle. Not for the beginner only, but for all kerbonauts. Backups, always carry backups. Specially in long duration missions. More than once I saved my missions, Apollo 13 style, using gear that I carried in a different way it was planned to be used, but because I always put that \u0022little extra\u0022 beyond what was considered \u0022mission essential\u0022.\u003C/p\u003E\n"}]}