{"TopicId":109263,"ForumId":16,"TopicTitle":"Surface scanning module energy consumption","CreatedByName":"ScottyDoesKnow","CreatedById":70796,"CreatedDateTime":"2015-05-14T21:03:14Z","PageNum":1,"Articles":[{"CreatedByName":"ScottyDoesKnow","CreatedById":70796,"CreatedDateTime":"2015-05-14T21:03:14Z","Content":"\n\u003Cp\u003EAnswered: single panels just suck.\u003C/p\u003E\u003Cp\u003ECan anyone confirm that the surface scanning module drains power? I have a small rover that seems to draw power when it\u0027s doing nothing, just sitting with brakes on. Only thing I can think of is the scanner, but it doesn\u0027t say anything in the description and has no way to disable it that I can see.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-14T23:38:07Z\u0022 title=\u002205/14/2015 11:38  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 14, 2015\u003C/time\u003E by ScottyDoesKnow\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"vicwarrior","CreatedById":120410,"CreatedDateTime":"2015-05-14T21:56:16Z","Content":"\n\u003Cp\u003EProbes consme power slowly.\u003C/p\u003E\u003Cp\u003EIf your rover uses a probe to control it then that is your culprit.\u003C/p\u003E\u003Cp\u003ERemember to always bring power sources along probes.\u003C/p\u003E\n"},{"CreatedByName":"ScottyDoesKnow","CreatedById":70796,"CreatedDateTime":"2015-05-14T22:45:17Z","Content":"\n\u003Cp\u003EIt\u0027s an OKTO2 with 4 panels on the sides facing outwards. The usage of just the core seems to be higher than the panels can produce except for sunrise and sunset, which wasn\u0027t a problem before.\u003C/p\u003E\u003Cp\u003ELooking it up, the OKTO2 is supposed to take 0.03, and the panels are definitely generating more than that.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-05-14T22:58:00Z","Content":"\n\u003Cp\u003EOre concentration is constant per biome (you can verify this by using the NBS). The surface scanner reports the concentration of the biome it\u0027s currently in and tells you all you\u0027ll ever know about it, even if you come back later with the NBS. Thus, you only need to run it once per biome, you don\u0027t need to run it constantly.\u003C/p\u003E\u003Cp\u003EOtherwise, probe cores, lights, and SAS all consume electricity just sitting there, so disable the SAS and lights if you don\u0027t need them at the moment. Also, where is this rover? If it\u0027s further out from the sun than Kerbin, you\u0027ll see a very noticeable drop in power at Duna and especially Dres compared to before 1.0, and further out they don\u0027t do much good at all.\u003C/p\u003E\u003Cp\u003EBut to really settle the question, 1st turn off everything (except the probe core, which has no switch). Then right-click on the solar panels to see how much juice they\u0027re really making. If this turns out to be more than what the probe core needs, then you\u0027ve got something else going on. What could it be? Well, there are the wheels. If you\u0027ve got a sticky key on your keyboard, it could be the wheels are trying to turn and thus consuming power. But I suspect the problem is that the panels aren\u0027t producing nearly as much juice as you think they are.\u003C/p\u003E\n"},{"CreatedByName":"ScottyDoesKnow","CreatedById":70796,"CreatedDateTime":"2015-05-14T23:37:13Z","Content":"\n\u003Cp\u003EYou\u0027re right Gesch, looks like they nerfed the hell out of the panels when they changed em to be more efficient with heat. When the sun rises on Eve (closer than Kerbin), I get 98% sunlight and produce 0.01. Sitting in the same place all day, pointing horizontally towards the sunrise, the max it gets is 0.04 at 77% sunlight.\u003C/p\u003E\u003Cp\u003EThe biome thing doesn\u0027t seem to be true. I have two rovers a ways apart in the lowlands biome on Eve, and they report 5.28% and 6.18%. How are the ore percentages calculated, anyways? On the planet view it says ore is 2.5%, threshold is 80%, and then I\u0027m in one of the still bright areas getting those numbers. Image of the rovers with the biomes debug turned on:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/e0XmxQx.jpg\u0022 alt=\u0022e0XmxQx.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-05-15T00:05:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ScottyDoesKnow\u0022 data-cite=\u0022ScottyDoesKnow\u0022\u003E\u003Cdiv\u003EYou\u0027re right Gesch, looks like they nerfed the hell out of the panels when they changed em to be more efficient with heat. When the sun rises on Eve (closer than Kerbin), I get 98% sunlight and produce 0.01. Sitting in the same place all day, pointing horizontally towards the sunrise, the max it gets is 0.04 at 77% sunlight.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn real life, ground-mounted solar panels aren\u0027t as effective as the same panels in LEO because the atmosphere blocks some of the light. I\u0027ve never noticed that happening in KSP but, as Squad changed both the atmosphere and solar panels, it wouldn\u0027t surprise me if that was now part of the game. Eve\u0027s got a very thick, dense atmosphere so would block rather more light than Kerbin\u0027s. Maybe enough to explain this, even with Eve being closer to the sun.\u003C/p\u003E\u003Cp\u003EIf that\u0027s not the cause, then maybe it\u0027s temperature. I believe Squad actually made solar panels work less well at higher temps. Eve\u0027s surface temp as I recall is pretty Hellish, or at least should be, so that might be it. What sort of temps are you getting there these days?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThe biome thing doesn\u0027t seem to be true. I have two rovers a ways apart in the lowlands biome on Eve, and they report 5.28% and 6.18%. How are the ore percentages calculated, anyways? On the planet view it says ore is 2.5%, threshold is 80%, and then I\u0027m in one of the still bright areas getting those numbers. Image of the rovers with the biomes debug turned on:\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOK, ore distribution and what the scanners say...\u003C/p\u003E\u003Cp\u003EIf you look in Gamedata/Squad/Resources, there\u0027s a file called Ore.cfg that explains a lot. First off, it says that the default abundance for all planets is between 1% and 15%, although it has a \u0022variance=50\u0022, whatever that means. It also specifically excludes Kerbol, Jool, and the oceans of Eve, Kerbin, and Laythe from having any at all. Dunno how asteroids work---they\u0027re not mentioned in the file and I hear they can be made almost entirely of ore.\u003C/p\u003E\u003Cp\u003EI would assume that your different surface readings in the lowlands are due either to some accuracy limit of the ground sensor (and thus a reason to get the NBS further up the tech tree), or that discontiguous regions with the same biome name are treated as separate biomes and thus can really have different values. I recommand asking Roverdude (the code author), who is quite forthcoming on the details. However, in my own experience so far, the NBS always shows the same value for the same biome name, even in discontiguous areas, so I currently suspect it\u0027s a limit of the ground sensor.\u003C/p\u003E\u003Cp\u003EAnyway, the big, clamshell orbital scanner is wildly inaccurate and easily confused. At best, it can point you to a general area that might be better than the others, but don\u0027t for a minute believe the concentrations it reports there, because I\u0027m guessing the most any biome can ever have is 22.5 (15 \u002B 50% of 15). When the orbital scanner says there\u0027s more there, what it\u0027s really saying is that area has more of the high-concentration biome than other areas of the planet.. For instance, in the sandbox game I\u0027m currently testing such things in, the highest value on Kerbin is 7.5% in the shores biome. But the orbital scanner shows like 80% abundance on most of the islands. Why? Because the islands are mostly shore and are surrounded by water which has zero by definition.\u003C/p\u003E\n"}]}