{"TopicId":109315,"ForumId":16,"TopicTitle":"minimum dV for changing orbit direction","CreatedByName":"Cardano","CreatedById":143056,"CreatedDateTime":"2015-05-15T05:31:36Z","PageNum":1,"Articles":[{"CreatedByName":"Cardano","CreatedById":143056,"CreatedDateTime":"2015-05-15T05:31:36Z","Content":"so I have a career contract to rescue a pair of idiots around minmus and did not notice before launch that they are orbiting in opposite directions. and now that I have the first one in the bag, erm command module, i need to figure out the mininum dV path to get into a similar but backwards orbit. I think I can manage it, but wanted to ask if it\u0027s best to go out to a large AP like with inclination changes, or to land and take off the other way.\n\nyes, I have a degree in physics and might be able to work out the math myself, but this is the 21st century and its so much easier to just ask others who know off the top of their heads.\n\nThanks,\n\nCardano.\n\n**Edited \u003Ctime datetime=\u00222015-05-15T13:07:01Z\u0022 title=\u002205/15/2015 01:07  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 15, 2015\u003C/time\u003E by Cardano**"},{"CreatedByName":"Reactordrone","CreatedById":110060,"CreatedDateTime":"2015-05-15T05:52:56Z","Content":"Landing and taking off will take more delta v than just reversing direction by burning retrograde but if you were going to land anyway then it\u0027s essentially free. if you don\u0027t need to land, then pushing out the AP and doing the inclination burn when you\u0027re going slow will be cheaper than just reversing direction at your current altitude."},{"CreatedByName":"MarvinKitFox","CreatedById":99545,"CreatedDateTime":"2015-05-15T06:04:29Z","Content":"Land \u0026 return is the worst option.\n\nU-turn in orbit is not much better.\n\nHeading WAY out and then u-turning is the best option. As long as your apogee is more than 11 times your current circular orbit, that will be the optimal approach (bi-elliptic transfer)\n\notoh, this is Minmus we are talking about, right?\n\nSimply fly past your rescue-ee at full orbital speeds, \u0022[\u0022 to him and use his RCS thrusters to catch your rescue ship.\n\nMinmus orbital speeds are \\*piffle\\*"},{"CreatedByName":"Jonboy","CreatedById":134111,"CreatedDateTime":"2015-05-15T06:05:13Z","Content":"You\u0027re on Minmus, so depending on how high your apoapsis is, it might not actually be that bad. What is your orbital velocity? It should take exactly double that to reverse your orbit burning retrograde. (You can always try quicksaving and see what happens.)"},{"CreatedByName":"Cebi","CreatedById":138242,"CreatedDateTime":"2015-05-15T06:42:39Z","Content":"MarvinKitFox suggestion is best.\n\nEVA fuel will last for aprox 500 m/s. Best option is to make high speed randevous and switch to stranded kerbal. Then you can reverse his orbit for \u0022free\u0022 or even land him on surface."},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-05-15T11:30:12Z","Content":"\u003E \n\u003E Heading WAY out and then u-turning is the best option. As long as your apogee is more than 11 times your current circular orbit, that will be the optimal approach (bi-elliptic transfer)\n\nJust a minor correction here: bi-elliptic transfers are different from bielliptic-style inclination changes. For transfers, bielliptic becomes more efficient (if slower) when the semi-major axis of the target orbit is either \u003E11x or \u003C1/11th of the current orbit\u0027s SMA.\n\nFor inclination changes, the current and target SMA is the same, so that doesn\u0027t apply. I read a [great thread](https://forum.kerbalspaceprogram.com/threads/69659) by the rocket scientist types around here, it was [shown mathematically](https://forum.kerbalspaceprogram.com/threads/69659-Apoapsis-plane-change-manoeuvre-%CE%94v?p=971064\u0026viewfull=1#post971064) that for inclination changes \u003E39 degrees it is better to raise Ap for the inclination change, and for changes \u003E60 degrees it is best to raise it right to the edge of the SoI."},{"CreatedByName":"Cardano","CreatedById":143056,"CreatedDateTime":"2015-05-15T13:15:01Z","Content":"Thanks y\u0027all - thankfully with this being minmus I can do any of the above. but SOI -\u003E reverse seems like the surest bet. I would hate to need 600ms on the eva-kerbal or hit him instead of miss him but get close enough to [. I\u0027m trying not to F5 but since it was bed time last night there nothing wrong with closing out kerbal and thinking things through ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"}]}