{"TopicId":109356,"ForumId":16,"TopicTitle":"Ideal launchpad TWR","CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-05-15T14:24:43Z","PageNum":1,"Articles":[{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-05-15T14:24:43Z","Content":"After much testing, I find that TWR=1.6 on launch pas is ideal. \n\nFull throttle on launchpad, then 60%, then 100% later on.\n\nWhat are your ascent TWR, and throttle ?"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-05-15T14:28:42Z","Content":"Ideal from which perspective? Minimizing dV to orbit? Maximizing payload fraction? Minimizing cost?"},{"CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2015-05-15T14:32:44Z","Content":"What RIC said. Different versions and different situations call for different TWRs. Pre-1.0, people liked using roughly 1.6-1.8 as their TWR, while now it\u0027s usually better to have an initial TWR of about 1.3 or thereabouts to maximize efficiency. That\u0027s just a general rule, of course, different payloads need different tweaks."},{"CreatedByName":"xtoro","CreatedById":79015,"CreatedDateTime":"2015-05-15T14:35:13Z","Content":"For 1.0.2 I try for between 1.5-2.5, but it depends on the payload. I think anything over 2.5 is a bit if a waste. Just my 0.02m/s"},{"CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2015-05-15T14:44:01Z","Content":"\u003E \n\u003E For 1.0.2 I try for between 1.5-2.5, but it depends on the payload. I think anything over 2.5 is a bit if a waste. Just my 0.02m/s\n\nYup. Literally anything from exactly 1 and up is enough to make you rise. Technically, a TWR of exactly 1 will enable the rocket to hover, and absolutely any external force will be enough to move the rocket in any direction. It just won\u0027t stay that way for long as fuel is burning from that time, so 1 and up lifts you up."},{"CreatedByName":"JoCRaM","CreatedById":84138,"CreatedDateTime":"2015-05-15T14:45:13Z","Content":"Where possible don\u0027t throttle, in my head it adds weight and complexity.\n\nThe only rocket I built in 1.0.2 has about 3x TWR on launch, to get it moving, then stages off the boosters to drop down to around 1-1.5. As it\u0027s ascent is entirely airodynamically contolled, it needs that kick to get prograde ahead of it before the aerodynamics start moving it to prograde...."},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-05-15T14:56:43Z","Content":"\u003E \n\u003E Ideal from which perspective? Minimizing dV to orbit? Maximizing payload fraction? Minimizing cost?\n\nThat would be nearly the same, isn\u0027t it ? But mostly to minimize dV and get an easy ascent.\n\nI found that with 1.6, you get quite fast to 100m/s and start turning, then I reduce throttle to the speed around 340m/s and slowly rise up when around 20k/25k. I found that going too fast increase flipping and drag. flipping can be counteracted by adding bigger fins/wings.\n\nI find that starting at 1.4 offers an harder flight, for a marginal dV gain.\n\nAnd about payload tweak, you mean payload weight or shape/drag ? As I\u0027m building standard rockets, I gives them the same TWR."},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-05-15T15:07:47Z","Content":"\u003E \n\u003E That would be nearly the same, isn\u0027t it ? But mostly to minimize dV and get an easy ascent.\n\nNot really. In 0.90 and before optimizing for dV meant a TWR of 2ish, to ride terminal velocity, while optimizing for payload fraction was more like 1.3 to minimize engine mass. Cost is another thing altogether.\n\nHaven\u0027t really tried to heavily optimize in 1.0.x, though I\u0027ve had good results from ~1.5ish initial TWRs."},{"CreatedByName":"ArchGaden","CreatedById":116362,"CreatedDateTime":"2015-05-15T15:12:44Z","Content":"Ideal TWR would be infinite. Of course, we don\u0027t have ideal engines. If your Launchpad TWR is \u003E1, then you could add more fuel to get more d/v... albit used inefficiently at some point and you\u0027ll have to be patient. I generally aim for 1.8 because it gets the rocket moving reasonably fast, but not too fast that I suffer terrible aerodynamic stability issues. 1.6-2.0 is a good range to fall in. \n\nEven knowing what condition you intend to maximize (cost, payload, d/v efficiency, time to orbit, ect) the problem is very complicated with new aerodynamics. \n\nMaximizing for payload, you can pile on more fuel until your TWR is nearly 1. That will get more payload to orbit, but the costs and inefficiency go up.\n\nMaximizing for cost becomes incredibly complicated with the new aerodynamics. You\u0027ll probably want to utilize SRBs as well, since they provide a bigger bang for the buck... but they also complicate control. You\u0027ll likely end up with a higher TWR when using SRBs as you\u0027ll want to ditch them earlier to avoid control issues that could provoke a more costly design. I generally hit 2.0 to 2.5 with SRB using cost-friendly crafts early on. 1.6 is probably a good number to ballpark for cost efficiency. \n\nMaximizing for d/v efficiency is really just an academic exercise...as there is little point in doing that. Using more d/v can be cheaper, faster, and/or lower cost. In 0.9, ~1.8 was the magic number, but the new aero has clouded that. Depending how your craft handles in the atmosphere, it might be more efficient to clear 35km sooner (higher TWR). There are so many factors here, you\u0027ll just have to experiment with whatever payload you\u0027re working with. \n\nThere is something to be said for maximizing for time-to-orbit though. In sandbox mode or later in career when cost isn\u0027t a concern, I want to get launches over quick. It isn\u0027t the interesting part of the game at that point. Higher TWR gets you up faster! I quite often overbuild my launch stages in late career as I just want to get the craft up and doing its job ASAP. Spending an extra 20k to do it is fine when I\u0027m sitting on 5M and the missions are paying 200-500k. My \u0027get it done\u0027 TWR is 2.0-2.2. Even my less routine (big payload) missions end up around 1.8 still. \n\nAttempting to balancing all factors, I find 1.6-2.0 to be a great range."},{"CreatedByName":"Jouni","CreatedById":97346,"CreatedDateTime":"2015-05-15T15:35:39Z","Content":"My typical rockets have launchpad TWR 1.2-1.4, which increases to 2.5-3.0 towards the end of the first stage. A higher TWR would probably be more cost-effective (because engines are so cheap in KSP), but it makes aerodynamics less forgiving. If you fly a bit slower in the lower atmosphere, you don\u0027t have to care about aerodynamic stability, making rocket design much easier."},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2015-05-15T16:01:59Z","Content":"I haven\u0027t taken any notes or run any numbers, but my impression is that 1.2 to start with wastes fuel to a slow ascent; somewhere around 1.4ish seems to work out better at first, but increases in TWR too quickly and ends up creating dramatic mach effects around 25km. Dunno if this is as lossy as it looks, though.\n\nI recently started toying around with using (recoverable) fleas for an initial kick, then continue on TWR\u003C1.2... looks promising, but makes for a frantic ten seconds after launch and looks just plain silly: often the rocket is sitting on a literal launch-pad comprised of small boosters."},{"CreatedByName":"Aethon","CreatedById":110755,"CreatedDateTime":"2015-05-15T16:15:30Z","Content":"Ideal pad TWR is ship specific. What\u0027s right for one ship won\u0027t be the same for another. \n\nI\u0027m pretty early in career, with not much of a fleet designed and therefore not much data on this yet. My solid 1st stages are set around TWR 1.90. Kerbal Engineer Redux\u0027s atmospheric efficiency stat shows me at 100% efficiency just as the solids burn out. After that, terminal velocity races away so fast that my liquid stages never catch up."},{"CreatedByName":"xtoro","CreatedById":79015,"CreatedDateTime":"2015-05-15T16:16:33Z","Content":"Just wanted to clarify my reasoning that too much twr is a waste,it\u0027s because for one, the first 10km need to be slowish anyways because of drag. And secondly, high twr engines are extra weight, and throttling them down is not using their full potential. So my advice is, if your twr is a little on the low side at launch, don\u0027t put bigger engines, strap on boosters instead."},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-05-15T16:44:06Z","Content":"\u003E \n\u003E Ideal pad TWR is ship specific. What\u0027s right for one ship won\u0027t be the same for another.\n\nI don\u0027t understand why that would be the case, except for hugely different payload shape.\n\nAfter testing many rockets I noticed the same TWR rocket behaves mostly the same (providing they have enough control and fins). No ?\n\nFor example, I\u0027m building a NASA parts rocket based on mammoths. I have a 6 mammoth configuration, a 4 a 2 and a 1 mammoth. I calculate the payload to be at 1.6TWR on each rocket. I tested different fins. All configuration ended to be stable with the same surface wing. The ascent (each with different dead weight (test) payload mass from 22T to 230T) are roughly the same and they burn the same dV. They have mostly the same default : they tend not to curve fast enough, I have to force them to a little.\n\nThe only real difference I noticed about payloads it their various capacity to wobble. Wobbling payload makes rockets escape their prograde vector and loose control. I solved that with Joint Reinforcement mod."},{"CreatedByName":"Aethon","CreatedById":110755,"CreatedDateTime":"2015-05-15T17:43:03Z","Content":"\u003E \n\u003E except for hugely different payload shape.\n\nYes. Different drag coefficients will change pad TWR requirements. \n\nMy ships are all using about the same TWR, but I know some of the Wackjobian erections made by others here may require more TWR to keep up with terminal velocity."},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-05-17T09:39:17Z","Content":"I have notice that the 1.6TWR was the VAC value. I\u0027m more on 1.45/1.47 on the launchpad."},{"CreatedByName":"Xannari Ferrows","CreatedById":125369,"CreatedDateTime":"2015-05-17T09:41:52Z","Content":"This question... is far too dependent on your rocket\u0027s cross-sectional aerodynamic coefficients. Even adding a single part can change the result drastically."},{"CreatedByName":"fjarandag","CreatedById":143217,"CreatedDateTime":"2015-05-17T14:18:00Z","Content":"I feel it is not so different to 0.90 and before. 1.8 TWR is still a good choice, just throttle back when you are near trans-sonic. Now I use 250 as the new terminal velocity until i am above the 10 km. The problem is not so much efficiency as the insane torque that will make your rocket flip over.\n\nTWR \u003C 1.5 will mean more time in the thick atmosphere, thrusting far away from orbital prograde/spending a huge fraction of your fuel just to defeat gravity. 1.2 TWR is a hovering slug.\n\nFor cheap satellite/orbiter launchers, I would rather go for 3 insane fleas at bottom stage (\u003E= 3 TWR), to get my weaker LV-T45 up to a decent 150 m/s. Side SRBs work best for the mass limit, but lateral separators are more expensive than the booster themselves ! ![:huh:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif)"},{"CreatedByName":"Dispatcher","CreatedById":78707,"CreatedDateTime":"2015-05-17T16:16:52Z","Content":"Of course the aerodynamics/ physics have changed with 1.0.2. The densest air used to be found up to 10-12Km above sea level. Now the lower atmosphere goes up to about 7Km. As for TWR, often my launch TWR is partly dependent on the mission needs and launch/ part restrictions. Of course if I don\u0027t have enough, I can always tweak my fuel/ oxidizer levels, but that affects dV. But in an ideal world, if it flies, its good."},{"CreatedByName":"strollen","CreatedById":142693,"CreatedDateTime":"2015-05-17T23:13:58Z","Content":"To me the most important thing in career mode is dv/$. Although stability is important obviously. I decided to do some testing for a satellite designed for doing a mission on Mun or Minimus. The lower stage was T45 swivel and upper V900 and a basic satellite. I varied the fuel tanks and had mechjeb autopilot put the sat in LKO at 75KM.\n\nSatA. stage 0 TWR 2.14/.53 stage 1 1.65/1.40 Upper T400, Lower T800,T400,T200 total cost $7,030 remaining dV at orbit 2,784\n\nSatB stage 0 TWR 1.52/.38 stage 1, 1.53/1,28 Upper T400, T200, Lower T800,T400,T200 total cost $7505 remaining dV at orbit 3,100\n\nSatC stage 0 TWR 1.30/1.10 stage1 1.20/.29 Upper T800 Lower T800, T800 total cost $7550 remaining dv at orbit 3,287\n\nSo to me it is worth the extra $500 for an additional 500 dv now if you don\u0027t need the dV than cheaper is better. But rockets with a 1.1 fly ok, in fact you never have to worry about throttling them back"},{"CreatedByName":"cybersol","CreatedById":81136,"CreatedDateTime":"2015-05-18T00:12:38Z","Content":"\u003E \n\u003E But rockets with a 1.1 fly ok, in fact you never have to worry about throttling them back\n\nI never throttle the ones that start at 2.1 TWR back either, I just have to build better rockets!"},{"CreatedByName":"strollen","CreatedById":142693,"CreatedDateTime":"2015-05-18T07:20:34Z","Content":"I don\u0027t when it make sense to throttle rockets back either, but I figure if I don\u0027t see flames coming from the rocket on the ascent stage, I\u0027m probably ok. With the lower thrust rockets you never that."},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-05-18T12:58:40Z","Content":"\u003E \n\u003E To me the most important thing in career mode is dv/$. Although stability is important obviously. I decided to do some testing for a satellite designed for doing a mission on Mun or Minimus. The lower stage was T45 swivel and upper V900 and a basic satellite. I varied the fuel tanks and had mechjeb autopilot put the sat in LKO at 75KM.\n\u003E SatA. stage 0 TWR 2.14/.53 stage 1 1.65/1.40 Upper T400, Lower T800,T400,T200 total cost $7,030 remaining dV at orbit 2,784\n\u003E \n\u003E SatB stage 0 TWR 1.52/.38 stage 1, 1.53/1,28 Upper T400, T200, Lower T800,T400,T200 total cost $7505 remaining dV at orbit 3,100\n\u003E \n\u003E SatC stage 0 TWR 1.30/1.10 stage1 1.20/.29 Upper T800 Lower T800, T800 total cost $7550 remaining dv at orbit 3,287\n\u003E \n\u003E So to me it is worth the extra $500 for an additional 500 dv now if you don\u0027t need the dV than cheaper is better. But rockets with a 1.1 fly ok, in fact you never have to worry about throttling them back\n\nI\u0027ll try to reduce thust on my engines to test if I get to orbit with higher dV.\n\nI\u0027ve designed 10 rocket SSTO launchers from 12T to 236T. Each of them has 3650m/s. They all end in LKO (75km) with 100 to 200m/s left before releasing their payload. I always throttle back to 60/70% around 250m/s.\n\nIf I wasn\u0027t designing SSTO, I would reduce the engine size and add boosters for the vertical ascent part. Asparagus also naturally reduces thrust as you dump external engines."},{"CreatedByName":"Janos1986","CreatedById":132068,"CreatedDateTime":"2015-05-18T13:29:24Z","Content":"1.7 is my magic number."},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-05-18T14:09:10Z","Content":"\u003E \n\u003E 1.7 is my magic number.\n\nVac or atmo ?"}]}