{"TopicId":109409,"ForumId":32,"TopicTitle":"Please let me transfer tourists!","CreatedByName":"nadreck","CreatedById":89087,"CreatedDateTime":"2015-05-15T22:00:55Z","PageNum":1,"Articles":[{"CreatedByName":"nadreck","CreatedById":89087,"CreatedDateTime":"2015-05-15T22:00:55Z","Content":"The only thing I find frustrating about tourists is not having them be able to change vehicles! Not all of them want to go downtown, some of them want to transfer to the cross town rocket.\n\nOk letting them Eva would be nice too! They spend all this cash and then they can\u0027t even go outside."},{"CreatedByName":"RocketPilot573","CreatedById":62803,"CreatedDateTime":"2015-05-15T22:05:31Z","Content":"You can transfer them... Just click on the hatch and use crew transfer (I\u0027ve done it myself multiple times)."},{"CreatedByName":"Dizzle","CreatedById":31588,"CreatedDateTime":"2015-05-15T22:06:54Z","Content":"I\u0027ve said it before, but I wish they could EVA when their craft is landed."},{"CreatedByName":"oglommi","CreatedById":127214,"CreatedDateTime":"2015-05-15T22:08:43Z","Content":"I gave up on tourism.\n\nI don\u0027t like the contracts. 4 tourists in one contract and all of them want to do different stuff. It\u0027s just an abysmal amount of work, if one want to go suborbital into the sun, one want to go to duna, and yet another want to go to Pol. Some of the tourists don\u0027t dissappear after finished contracts. I had 3 stars tourists with no contract freeriding on my spacebus\n\nSquad should make all the tourists in one contract do the same stuff."},{"CreatedByName":"Hotaru","CreatedById":135669,"CreatedDateTime":"2015-05-15T22:12:35Z","Content":"I also wish for at least landed-only EVA. Using KCT I\u0027d like to be able to service my SSTO\u0027s on the ramp without having to recover and relaunch them just for the tourists, and I worry about tourists getting permanently stranded just because their ship doesn\u0027t have a docking port for me to rescue them. Plus, what\u0027s the point of buying a ticket to the Mun if you don\u0027t even get to go outside?\n\nAgreed on all tourists in the same contract should have the same itinerary. I\u0027m liking the tourism contracts on the whole but having to keep track of who all wants to go where is getting tedious."},{"CreatedByName":"Sattorin","CreatedById":119076,"CreatedDateTime":"2015-05-16T15:17:32Z","Content":"\u003E \n\u003E I gave up on tourism.\n\nIt is insanely frustrating that my tourist options are:\n\n1 guy wants a suborbital flight on Kerbin\n\n2 girls want to orbit Kerbin\n\n4 tourists want to land on Pol, suborbital flight on Laythe, fly by Duna and suborbital flight over the Sun.\n\nCome on! Give me a Mun tourist that I can try to SSTO up and back!"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-05-16T15:27:08Z","Content":"\u003E \n\u003E I\u0027ve said it before, but I wish they could EVA when their craft is landed.\n\nI have read (but haven\u0027t tried myself) that you can get them to EVA by going IVA with them and clicking the door handle."},{"CreatedByName":"luizopiloto","CreatedById":97503,"CreatedDateTime":"2015-05-16T16:19:58Z","Content":"W/o warpdrivers, space tourism should be limited to Kerbin\u0027s SOI only... Deep Space is for Kerbonauts... ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)"}]}