{"TopicId":109439,"ForumId":21,"TopicTitle":"XB-70 Valkyrie... SSTO?!","CreatedByName":"Kagame","CreatedById":141304,"CreatedDateTime":"2015-05-16T02:22:47Z","PageNum":1,"Articles":[{"CreatedByName":"Kagame","CreatedById":141304,"CreatedDateTime":"2015-05-16T02:22:47Z","Content":"\n\u003Cp\u003EThis is probably the most surprising SSTO I\u0027ve made. It started out as a project to re-create the XB-70 Valkyrie within KSP. The project worked, with generally agreeable flight manners and far too much Oxidizer due to me being lazy and not draining it from the bicouplers. So then I thinks: What would happen if I put some RAPIERs on this thing? Well, I did, and this happened.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/lP4kC\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EAscent pattern:\u003C/p\u003E\u003Cp\u003EStep 1: Lift off. Surprisingly enough, she doesn\u0027t take the entire runway, like most other six-engine behemoths do.\u003C/p\u003E\u003Cp\u003EStep 2: Climb @ 30 degrees until you hit 10,000 meters. Full throttle.\u003C/p\u003E\u003Cp\u003EStep 3: Once you\u0027re at 10,000 meters, level off (ish) to gain speed. Don\u0027t pull up until you\u0027ve topped 1,000 m/s. Don\u0027t worry, nothing will kersplode. If the little temperature gauges show up, feel free to climb a bit faster if it makes you feel better. It\u0027ll make the plane feel better too.\u003C/p\u003E\u003Cp\u003EStep 4: When you\u0027ve topped 1000 m/s, resume your 30 degree climb. I occasionally pitch up to about 40-50 degrees when the RAPIERS switch to closed cycle..\u003C/p\u003E\u003Cp\u003EStep 5: When you\u0027ve attained a 75km apoapsis, shut down the engines and create a maneuvering node (or just burn prograde) to circularize. Don\u0027t execute until you\u0027re above 70km, otherwise it might get hinky. Might be useful to turn on RCS at this point.\u003C/p\u003E\u003Cp\u003EStep 6: Once you\u0027ve de-orbited (burn retrograde) and have re-entered the atmosphere (on a properly shallow trajectory, nothing will blow up), you will probably be in a spin about all three axis. This, admittedly, is a design issue. Here\u0027s a quick guide on how to recover, shamelessly borrowed from a \u003Ca href=\u0022http://axenty.com/blog/training/recovering-from-a-spin/\u0022 rel=\u0022external nofollow\u0022\u003Ewebsite\u003C/a\u003E dealing with real piloting: PARE. Power: Off. (Adding more power just exacerbates the spin.) Aileron: Neutral. Rudder: Full opposite to the direction of the spin. (Guess, it\u0027s what I did.) Elevator: Down. (Your wings are stalled, you\u0027ll need to get more airflow across them.) After a bit, you\u0027ll find that you\u0027re suddenly pointing down. Recover as per usual.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/u8r9gb2z3lrxtum/XB-70%20Mk_%206.craft?dl=0\u0022 rel=\u0022external nofollow\u0022\u003EDownload the Craft File\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EPlease note: While the Valkyrie does in fact have a large amount of cargo bay space, I wouldn\u0027t advise putting anything heavier than a can of snakes in there.\u003C/p\u003E\u003Cp\u003EThat\u0027s all for this post!\u003C/p\u003E\n"},{"CreatedByName":"SHiftER2O","CreatedById":141087,"CreatedDateTime":"2015-05-16T13:03:45Z","Content":"\n\u003Cp\u003EI\u0027m buying it! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"}]}