{"TopicId":109661,"ForumId":20,"TopicTitle":"Design ideas: kerbal breeding","CreatedByName":"undercoveryankee","CreatedById":103505,"CreatedDateTime":"2015-05-17T15:18:52Z","PageNum":1,"Articles":[{"CreatedByName":"undercoveryankee","CreatedById":103505,"CreatedDateTime":"2015-05-17T15:18:52Z","Content":"\n\u003Cp\u003EFans of Extraplanetary Launchpads and its insatiable appetite for engineers have been asking for anything that adds more sources of cheap kerbals. I\u0027ve seen suggestions for a \u0022kuddle shack\u0022 or cloning facility to add new kerbals in the field.\u003C/p\u003E\u003Cp\u003EA dedicated part for breeding doesn\u0027t quite have the feel I\u0027d like to play, so here are a few design ideas I\u0027ve had. \u003C/p\u003E\u003Cp\u003EOnce an in-game day, look at every manned shop with at least one empty seat whose time since launch is at least 15 days. (Time cutoff should be configurable; I picked 15 based on the default maximum time out of supply in USI Life Support.)\u003C/p\u003E\u003Cp\u003EEach eligible ship has a chance to spawn a new kerbal in an empty seat. Probability proportional to the total number of kerbals on the ship and the male/female ratio. The geometric man of the numbers of male and female kerbals has the right kind of properties. \u003C/p\u003E\u003Cp\u003EIf a kerbal is born, randomly select one male and one female as parents. Probabilities for courage, stupidity, BadS, and tourist based on the parents\u0027 attributes. Class can\u0027t be inherited directly because it\u0027s a function of the name, but kerbals of the new addition\u0027s class could be given a bonus to being selected as parents.\u003C/p\u003E\u003Cp\u003ETo keep the light-hearted \u0022don\u0027t think about it too closely\u0022 attitude of the base game, I\u0027d rather not worry about childhood. Any crew member kerbal created would be able to function immediately. If you\u0027re playing without a mod to give kerbals experience in the field, award a fraction of the stars the parents have, especially same-class parents.\u003C/p\u003E\u003Cp\u003EBy not requiring a dedicated part, we allow a chance that any interplanetary ship could arrive with fewer empty seats than it took off with. That\u0027s a kind of spontaneity I think would be fun.\u003C/p\u003E\n"},{"CreatedByName":"Wesreidau","CreatedById":75430,"CreatedDateTime":"2015-05-17T15:28:07Z","Content":"\n\u003Cp\u003EYeah, I dunno. A Homestead module that only works out of Kerbin SOI is one thing, but do we really want Val giving birth in a Mk2 Lander Can while we assemble a space station? Besides, I like to imagine there\u0027s at least some level of professionalism among the Kerbonauts. I mean if you want to ship Jeb and Val and ship them to Laythe to found a colony then that\u0027s your thing, but I\u0027m sure the two of them would rather get to the honeymoon destination first.\u003C/p\u003E\n"},{"CreatedByName":"undercoveryankee","CreatedById":103505,"CreatedDateTime":"2015-05-17T16:28:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Wesreidau\u0022 data-cite=\u0022Wesreidau\u0022\u003E\u003Cdiv\u003EYeah, I dunno. A Homestead module that only works out of Kerbin SOI is one thing, but do we really want Val giving birth in a Mk2 Lander Can while we assemble a space station? Besides, I like to imagine there\u0027s at least some level of professionalism among the Kerbonauts. I mean if you want to ship Jeb and Val and ship them to Laythe to found a colony then that\u0027s your thing, but I\u0027m sure the two of them would rather get to the honeymoon destination first.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI would tune the overall growth rate to where new kerbals anywhere would be rare unless you intentionally deploy a module with a big crew like the EPL workshop. \u003C/p\u003E\u003Cp\u003EBut you\u0027re right that it could use some level of control beyond the overall rate.\u003C/p\u003E\u003Cp\u003ENow I\u0027m thinking fertility multipliers for different SoIs and landed vs. orbital, so the mod can blacklist or reduce places that shouldn\u0027t be treated as colony sites. \u003C/p\u003E\u003Cp\u003EAnother knob you could use is a ramp of fertility from zero at the initial eligibility MET to reach full only after a longer time like the length of a Duna Hohmann.\u003C/p\u003E\n"},{"CreatedByName":"Minwaabi","CreatedById":91050,"CreatedDateTime":"2015-05-18T01:21:18Z","Content":"\n\u003Cp\u003EWouldn\u0027t fixing the hiring cost of Kerbal\u0027s be a simpler/more logical solution? You don\u0027t have to worry about male/female ratios, time in flight, room, skipping childhood, genetics or anything else. Simply making it so the hiring cost makes sense would be ideal for most applications. Maybe make the price inversely proportional to rep (plus some base constant) and make it so you have serious hits to your rep if a Kerbal dies. The current cost formula only makes sense if the Kerbal population is very very small or your killing Kerbals left and right.\u003C/p\u003E\n"},{"CreatedByName":"TheMoonRover","CreatedById":136199,"CreatedDateTime":"2015-05-18T01:40:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022undercoveryankee\u0022 data-cite=\u0022undercoveryankee\u0022\u003E\u003Cdiv\u003EThe geometric \u003Cstrong\u003Eman\u003C/strong\u003E of the numbers of male and female kerbals has the right kind of properties.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s a rather ironic typo.\u003C/p\u003E\u003Cp\u003EA few more ideas:\u003C/p\u003E\u003Cp\u003E\u0026gt; Perhaps the baby kerbal could be temporarily flagged as a tourist, allowing them to mature over time?\u003C/p\u003E\u003Cp\u003E\u0026gt; Only allow kerbals to breed in parts without command authority or any other purpose (e.g. Hitchhiker Storage Container, Mk2 Crew Cabin, Mk3 Passenger Module) because there\u0027s more space in there (and you wouldn\u0027t want to contaminate any of the experiments in the science lab now would you?)\u003C/p\u003E\u003Cp\u003E\u0026gt; If possible, have the child use parts of their parent\u0027s names, for example Gregrod (Male) and Valelle (Female) might have a child called Valrod (M) or Gregelle (F)\u003C/p\u003E\n"},{"CreatedByName":"Kibble","CreatedById":131042,"CreatedDateTime":"2015-05-18T02:45:25Z","Content":"\n\u003Cp\u003E\u003Cem\u003EThis\u003C/em\u003E thread again.\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2015-05-18T12:56:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kibble\u0022 data-cite=\u0022Kibble\u0022\u003E\u003Cdiv\u003E\u003Cem\u003EThis\u003C/em\u003E thread again.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGot a link? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EHonestly, I do not think this would work out reasonably for kerbonauts, but introducing colonists alongside tourists might work - but without a complimenting life support and stuff ...\u003C/p\u003E\n"},{"CreatedByName":"Janos1986","CreatedById":132068,"CreatedDateTime":"2015-05-18T13:36:04Z","Content":"\n\u003Cp\u003EWe shall call it... the FANFICTION MOD!\u003C/p\u003E\n"},{"CreatedByName":"hab136","CreatedById":75997,"CreatedDateTime":"2015-06-05T12:54:34Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/112142\u0022 rel=\u0022external nofollow\u0022\u003ECivilian Population\u003C/a\u003E lets you breed new Kerbals in a non-cheaty way.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/106103\u0022 rel=\u0022external nofollow\u0022\u003EKolonists\u003C/a\u003E lets you push button, get Kerbal.\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2015-06-05T13:15:59Z","Content":"\n\u003Cp\u003EWill the baby kerbals eat all your mined resources?\u003C/p\u003E\u003Cp\u003EGeeze Kathy what happened to all or LfOx?\u003C/p\u003E\u003Cp\u003EOh, I thing junior broke into the storage, my has he grown.\u003C/p\u003E\u003Cp\u003EWe don\u0027t have a biological resource flow yet in the stock game, all the resources flow is for non-biologicals.\u003C/p\u003E\u003Cp\u003EBefore you can have an effective breeding colony given\u003C/p\u003E\u003Cp\u003EKerbals have mass\u003C/p\u003E\u003Cp\u003EE = Mc^2 (Yes I know this is crudely applied here, but chemical energy must be stored in biologicals in terms of C-H bond energies (100kcal per mole).\u003C/p\u003E\u003Cp\u003ETherefore increasing the mass of kerbals requires energetics and\u003C/p\u003E\n"}]}