{"TopicId":109606,"ForumId":18,"TopicTitle":"Any good games you could recommend me?","CreatedByName":"Cloakedwand72","CreatedById":38144,"CreatedDateTime":"2015-05-17T03:27:02Z","PageNum":1,"Articles":[{"CreatedByName":"Cloakedwand72","CreatedById":38144,"CreatedDateTime":"2015-05-17T03:27:02Z","Content":"Any good games you could recommend me that work on Windows 8.1?I like Action FPS and open would games like Mount and blade and the Elder scrolls and Fallout 3 and Fallout New Vegas and Minecraft.And i am in to flight games like FSX and KSP.And i am in to stealth games like Deus ex and Dishonored and Splinter cell series.And i am in to story game as will like Mass Effect series and Dragon age series.And i am in to games with signal player offline mode.I am not in to these genres of games like Tower defense or point and click Adventure games or JRPGs or cRPGs or DOTA and MOBA.Could you guys recommend me any games that would interest me?Thanks for helping."},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2015-05-17T04:14:56Z","Content":"If you like building games, like KSP is, you might like [Cities Skylines](http://store.steampowered.com/app/255710/). It is everything SimCity 5 was supposed to be and more. It is cheap and will provide many, many hours of gameplay."},{"CreatedByName":"gooddog15","CreatedById":59110,"CreatedDateTime":"2015-05-17T04:17:37Z","Content":"cant go wrong with portal and portal 2. Those two are complete masterpieces.\n\nAlso black mesa looks pretty good."},{"CreatedByName":"Cloakedwand72","CreatedById":38144,"CreatedDateTime":"2015-05-17T04:18:04Z","Content":"\u003E \n\u003E If you like building games, like KSP is, you might like [Cities Skylines](http://store.steampowered.com/app/255710/). It is everything SimCity 5 was supposed to be and more. It is cheap and will provide many, many hours of gameplay.\n\nIs Cities Skylines hard to get in to for new players?"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2015-05-17T04:21:08Z","Content":"\u003E \n\u003E Is Cities Skylines hard to get in to for new players?\n\nNot really, they made it accessible to almost anyone. If you want there are official mods and excellent third party mods to make the game more challenging, so it really is for everyone.\n\nTo me it is the best game I have played since KSP, which in turn was the best game I played since Minecraft. All have been a bit of an obsession."},{"CreatedByName":"Cloakedwand72","CreatedById":38144,"CreatedDateTime":"2015-05-17T04:30:22Z","Content":"\u003E \n\u003E Not really, they made it accessible to almost anyone. If you want there are official mods and excellent third party mods to make the game more challenging, so it really is for everyone.\n\u003E To me it is the best game I have played since KSP, which in turn was the best game I played since Minecraft. All have been a bit of an obsession.\n\nIs the Digital Deluxe version of Cities Skyline needed to play the base game i found the standard version on G2A for a good deal?So dos it has a high self life of gameplay like the Roller coaster tycoon and Zoo tycoon games?"},{"CreatedByName":"The Destroyer","CreatedById":36109,"CreatedDateTime":"2015-05-17T04:44:18Z","Content":"\u003E \n\u003E Is the Digital Deluxe version of Cities Skyline needed to play the base game i found the standard version on G2A for a good deal?So dos it has a high self life of gameplay like the Roller coaster tycoon and Zoo tycoon games?\n\nAs far as I can tell, its just a little more content in deluxe, some wonders like the statue of liberty, just for supporting the devs. You can get standard\n\nI\u0027ve seen C:S, I want it, must have."},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-05-17T06:31:44Z","Content":"I don\u0027t like City skyline that much actually. It has a great building system and utility management, but having building restricted to the road and the economy management not as detailed as city XL (haven\u0027t tried XXL, heard bad stuff about it) makes me feel a bit...lacking.\n\nRight now I am playing planet explorer, and I would recommend it, even though it is in the alpha mess with lots of bugs and glitches and stuff. It has a pretty robust, voxel based creation system that let you create items and vehicles for your character. You can also manipulate the environment and build structure to create colonies and stuff. It is great for the creative mind. It is like a combination of RPG (your character in the story mode can interact with story NPC and make choices and stuff), open world exploration sandbox (not that much different from minecraft, just with non-blocky graphic), strategy game (building your colony is like building bases in other strategy games), and building game (you can actually create a battleship and fly it around the planet, wreaking havoc with your big guns.)\n\n**Edited \u003Ctime datetime=\u00222015-05-17T06:37:18Z\u0022 title=\u002205/17/2015 06:37  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 17, 2015\u003C/time\u003E by RainDreamer**"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2015-05-17T07:18:23Z","Content":"\u003E \n\u003E I don\u0027t like City skyline that much actually. It has a great building system and utility management, but having building restricted to the road and the economy management not as detailed as city XL (haven\u0027t tried XXL, heard bad stuff about it) makes me feel a bit...lacking.\n\nThat just means you did not play long enough. At first I thought it was pretty cool but not too complex, but after a while you find that the gameplay is incredibly deep and has many, many layers. And yes, there is a focus on roads and traffic, but to be fair, traffic is actually one of the main challenges in any big real life city.\n\nCities XL was good, but lacked in finishing. There were just too many things left unpolished to play the game in a pleasant manner, some really game breaking. Big cities are barely or not at all playable due to performance issues. Cities Skylines does not seem to have problems of that magnitude and is even still improving too. I really wanted to like Cities XL, but Monte Cristo went bankrupt just a bit too early.\n\n\u003E \n\u003E Is the Digital Deluxe version of Cities Skyline needed to play the base game i found the standard version on G2A for a good deal?So dos it has a high self life of gameplay like the Roller coaster tycoon and Zoo tycoon games?\n\nThe standard version would be fine, though I bought the deluxe edition to support the developers. They did a great job, you might want to consider the same.\n\n**Edited \u003Ctime datetime=\u00222015-05-17T07:23:02Z\u0022 title=\u002205/17/2015 07:23  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 17, 2015\u003C/time\u003E by Camacha**"},{"CreatedByName":"theend3r","CreatedById":97560,"CreatedDateTime":"2015-05-17T07:18:28Z","Content":"\u003E \n\u003E I don\u0027t like City skyline that much actually. It has a great building system and utility management, but having building restricted to the road and the economy management not as detailed as city XL (haven\u0027t tried XXL, heard bad stuff about it) makes me feel a bit...lacking.\n\u003E Right now I am playing planet explorer, and I would recommend it, even though it is in the alpha mess with lots of bugs and glitches and stuff. It has a pretty robust, voxel based creation system that let you create items and vehicles for your character. You can also manipulate the environment and build structure to create colonies and stuff. It is great for the creative mind. It is like a combination of RPG (your character in the story mode can interact with story NPC and make choices and stuff), open world exploration sandbox (not that much different from minecraft, just with non-blocky graphic), strategy game (building your colony is like building bases in other strategy games), and building game (you can actually create a battleship and fly it around the planet, wreaking havoc with your big guns.)\n\nPlanet Explorers looks very interesting. Do you need to be online to play it?"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2015-05-17T07:36:11Z","Content":"What about [ANNO 1404](https://en.wikipedia.org/wiki/Anno_1404)? I played it for a long, long time and never lost the fun. With the Venice addition it is even nicer and overall a great economical strategy game with real-time strategy elements.\n\nYou could also try [ANNO 2070](https://en.wikipedia.org/wiki/Anno_2070) (everything gets funnier if you have nukes), but IÃ‚Â´m not sure if it works on Windows 8.1. However, you need Uplay in order to run it."},{"CreatedByName":"LN400","CreatedById":140595,"CreatedDateTime":"2015-05-17T11:34:09Z","Content":"I noticed you mentioned stealth games. If you haven\u0027t already, look up Thief 2 The Metal Age. I wouldn\u0027t know about the others in the series but T2 is one I would recommend."},{"CreatedByName":"InterCity","CreatedById":98462,"CreatedDateTime":"2015-05-17T15:50:22Z","Content":"I\u0027d say Cities Skylines for building games, Bioshock series for shooters (Dishonored is my fave but you say you\u0027ve played that) and my all time favourite is StarCraft II (I\u0027m a big strategy games fan). Don\u0027t have that much time for gaming now, so idk about the new titles. :/"},{"CreatedByName":"Slam_Jones","CreatedById":125101,"CreatedDateTime":"2015-05-19T03:11:00Z","Content":"If you don\u0027t mind gratuitous violence, GTA 5 is pretty expansive. Planes, boats, cars, shooting, etc.\n\nAnd it looks oh so pretty.\n\n\u003E ![EfmfdpO.jpg](http://i.imgur.com/EfmfdpO.jpg)"},{"CreatedByName":"Helix935","CreatedById":71312,"CreatedDateTime":"2015-05-19T13:59:27Z","Content":"if you\u0027re into some turn-based strategy or just games with true difficulty, try [XCOM: Enemy Unknown](https://en.wikipedia.org/wiki/XCOM:_Enemy_Unknown), it took me weeks to stop being addicted to it, even after beating the game multiple times. This is coming from a guy who is a fan of FPS games but i still love strategy when i get it. i would also suggest getting it with all DLC included as the DLC actually does what it is suppose to do and utterly change the gameplay without making it feel like playing the same game.\n\n[may cost $50 (with DLC) now on steam but since its steam, you can wait for sales](http://store.steampowered.com/app/200510/)\n\nI would also suggest that you try [Space Engineers](http://store.steampowered.com/app/244850/) if you liked playing minecraft. Its another procedurally generated sandbox game but with an intense amount of space thrown in, you could build space ships, space stations, mine asteroids and has thousands of mods to use on steam. it cause about $25 so its pretty cheap and really fun once you wrap your mind around how to design your craft and bases. And if you get tired of building stuff and want action, check out some of the servers for any war games or battle the randomly generated ships that pop out every once in while (although they are easy)"},{"CreatedByName":"megatiger78","CreatedById":114940,"CreatedDateTime":"2015-05-19T15:35:30Z","Content":"planetside 2, and Gmod."},{"CreatedByName":"Dman979","CreatedById":123837,"CreatedDateTime":"2015-05-19T18:27:26Z","Content":"Kinda similar to some stealth games: Red Orchestra 2/ Rising Storm, but an FPS. You know the suppression system in Battlefield? Can\u0027t hold a candle to this game. My favorite line from the Steam Store was \u0022Ever wanted PTSD but couldn\u0027t join the army? Play this.\u0022 You will die, and die a lot. You will keep being killed by a rife at 200\u002B meters that you couldn\u0027t even see. You will learn to keep your head down, and find out that it doesn\u0027t help when running through artillery. But if you like realistic FPS, this is the game for you. You will learn the difference between cover and concealment, and eventually you will be the one making those 200 meter headshots."},{"CreatedByName":"Kinglet","CreatedById":58832,"CreatedDateTime":"2015-05-20T19:03:15Z","Content":"\u003E \n\u003E planetside 2, and Gmod.\n\nI would not recommend Gmod as its building system is useless. It also has a bad community, so you NEED to play with friends as there is no playable content apart from role play and user made game modes."},{"CreatedByName":"Special Agent Sigvan","CreatedById":92033,"CreatedDateTime":"2015-05-22T06:18:32Z","Content":"The original Postal."},{"CreatedByName":"Nikolai","CreatedById":23085,"CreatedDateTime":"2015-05-22T13:58:04Z","Content":"If you like strategy games and don\u0027t mind learning-by-death, I\u0027ve really enjoyed *Invisible, Inc.* Its learning curve is absolutely brutal, but it\u0027s also full of tense moments and narrow escapes. If you screw up, it\u0027s your fault -- and if you\u0027re clever, you\u0027ll do better next time (which is what drew me into *Kerbal Space Program*, honestly). Since it\u0027s turn-based, it\u0027s just you and your brain against the computer. And the game settings are endlessly tweakable, so you can (to a large extent) modify the game to be as challenging as you want in the ways that you want.\n\nThe \u0022story\u0022 is kind of bare, but honestly, with the kind of puzzles you\u0027re solving, a narrative might just get in the way of good pacing. And the animation and voice-acting are really nice."},{"CreatedByName":"Pixel of Life","CreatedById":45646,"CreatedDateTime":"2015-05-22T15:32:04Z","Content":"Counter-Strike Global Offensive, if you like competitive games and first-person shooters. I know, I know - it\u0027s overrated. But it really isn\u0027t that bad. You\u0027ll always learn something new when playing it. Stuff like predicting your enemies\u0027 actions so that you can blast them right between the eyes when they come around the corner. It actually requires tactical thinking, and when you get it right it\u0027s really satisfying. Play with a bunch of friends for maximum fun."},{"CreatedByName":"Randox","CreatedById":18034,"CreatedDateTime":"2015-05-22T16:56:35Z","Content":"For stealth and story, **Alpha Protocol**. It doesn\u0027t have to be a stealth game, but it\u0027s probably one of the most engaging approaches. This game is also a shining example of how to let a player make meaningful choices, and how to tell a story. The player impact on the game, the story telling, the morality system (sort of), and the gameplay are all brilliant. This is easily one of the best games I have ever played. Rather than a proper morality system with nicely labeled options like Mass Effect, you are presented with approaches you can take, and it\u0027s up to you to decide how people will react, and what reaction you even want. You\u0027ll often need to change things up during an interaction. Also, things like mission order impact the game. For example, you will be buying your weapons on the black market, and if you carry out a mission to take out a major cache of weapons and smugglers in the area, that\u0027s going to impact what is available to you for purchase. Other choices impact how the story develops and so on. This makes gathering and understanding intelligence in the game important if you want to be able to anticipate the consequences of your actions on how the game is going to play out. As stated in game, \u0022there are no good or bad choices, just results\u0022.\n\nYou might also like **DCS World**. It\u0027s a combat flight simulator, and it is a free game that comes with the Su-25t (and a mustang trainer. Other planes are paid DLC). The planes are detailed to various levels. The Su-25t is on the lighter end. You can start it up with a key keyboard commands, though if you really want to get the most out of it, your probably looking at a few hours on youtube (Robert Sogomonian has a fantastic set of videos for it, which serve as a good look at what you can expect from the game as well). You also have planes like the A-10C which have much more involved computer systems than something like the 25t. The flight as well is fantastic.\n\nAnd one final thought. You might like the Myst games. They\u0027re essentially point and click puzzle games. The first game was recently redone (for the second time) and is truly spectacular. You can also walk around the world, a feature not found in the original games until the fourth one (I think. Might have just been the last game, number five that has that). Riven is also available on steam, though it may not work. At the very least, the map viewer, one of the last puzzles, may not function correctly and require you to look up the answer. The second and third games are the best if you ask me, with Riven (#2) taking the cake and Exile (#3) being the close second. Both games a entirely point and click, with point to point movement. Exile has better graphics, and 360 degree camera movement. Do note that both these games are pre-rendered (they predate personal computers that could have rendered such graphics in real time), so there is nothing you can really do to improve them graphically."},{"CreatedByName":"Hcube","CreatedById":137241,"CreatedDateTime":"2015-05-25T23:00:13Z","Content":"\u003E \n\u003E Counter-Strike Global Offensive, if you like competitive games and first-person shooters. I know, I know - it\u0027s overrated. But it really isn\u0027t that bad. You\u0027ll always learn something new when playing it. Stuff like predicting your enemies\u0027 actions so that you can blast them right between the eyes when they come around the corner. It actually requires tactical thinking, and when you get it right it\u0027s really satisfying. Play with a bunch of friends for maximum fun.\n\nInsurgency is probaby better. All the good sides of CSGO, without the annoying ones. And it\u0027s very realistic and breath-taking"},{"CreatedByName":"Kozak","CreatedById":128114,"CreatedDateTime":"2015-05-26T00:10:59Z","Content":"Arma 3\n\nmy personal favorite\n\nArma 3 is a third/first person shooter that doesn\u0027t require a very beefy computer to play if you don\u0027t care for graphics\n\nStory is amazing, and has tons of gameplay, any cinematics are short, and entertaining to watch.\n\nYou actually have control of the story and how it goes!"},{"CreatedByName":"Lord Aurelius","CreatedById":71687,"CreatedDateTime":"2015-05-26T01:15:48Z","Content":"I would recommend [Red Faction Guerrilla](http://store.steampowered.com/app/20500/).\n\nIt\u0027s a sci-fi open world shooter with fully destroyable, physics modeled buildings. If you knock out the main supports with demolition charges (or a sledgehammer) it will collapse fairly realistically. Stealing tanks and driving through buildings is great fun as well. It also has multiplayer (including a hotseat turn based destruction mode and more traditional deathmatches) which can be pretty entertaining when the entire map is leveled at the end of a match.\n\nThe main story isn\u0027t all that bad either, it\u0027s nothing special compared to the likes of mass effect, but it\u0027s not bad for what it is.\n\nIt\u0027s a little older game now (which means you can run it on pretty much anything), but it\u0027s actively being updated again after a change in IP ownership (THQ went bankrupt and Nordic games got the Red Faction franchise)."}]}