{"TopicId":109626,"ForumId":20,"TopicTitle":"Game crashing when loading mods and other issues with Steam?","CreatedByName":"Fishslap","CreatedById":143204,"CreatedDateTime":"2015-05-17T08:25:25Z","PageNum":1,"Articles":[{"CreatedByName":"Fishslap","CreatedById":143204,"CreatedDateTime":"2015-05-17T08:25:25Z","Content":"\n\u003Cp\u003EI\u0060m not sure if this is the correct place for this thread but here goes. I haven\u0060t tried any mods yet because I wanted to get a feeling for what I wanted first, rather than flood myself with mods I hadn\u0060t developed a need for yet. But now I tried some mods and to my disappointment I can\u0060t even load up the game if I have any mods in the Game Data folder. If I remove them the game starts up fine again. Have I put them in the wrong place or is there something else I need to do first?\u003C/p\u003E\u003Cp\u003ESecondly I am having greater and greater trouble with random crashes and excessive loading times. I was wondering if that is a Steam issue or something with the latest patch. As it is the game is pretty much unplayable, at least on the difficulty I prefer. On my last mission the game crashed during reentry and I had to relaunch it, which took about five minutes. I then had to get back to the flight using the tracking station. When I did my parachute had already exploded because of heat and I crashed to the ground, losing two contracts I was doing as well as Jebediah because I was unable to revert mission. I prefer to play without saving to make it more exciting so I couldn\u0060t reload. So that was that game basically, which I had spent many hours on, and I now feel as if I have to restart the career. But why bother when it\u0060s just gonna crash and kill me again right?\u003C/p\u003E\u003Cp\u003ERight now I am feeling slightly ripped off by KSP, simply because I can\u0060t play it when I really wish I could.\u003C/p\u003E\u003Cp\u003EPS: Edit: I was actually just now able to run the game with some mods installed. I just had to remove a few of them. Maybe that\u0060s just a version issue then.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-17T08:34:18Z\u0022 title=\u002205/17/2015 08:34  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 17, 2015\u003C/time\u003E by Fishslap\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Harry Rhodan","CreatedById":119953,"CreatedDateTime":"2015-05-17T10:24:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fishslap\u0022 data-cite=\u0022Fishslap\u0022\u003E\u003Cdiv\u003EI was wondering if that is a Steam issue or something with the latest patch.\u003Cp\u003EOn my last mission the game crashed during reentry\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou can always launch the game without steam by using the executable from the installation folder.\u003C/p\u003E\u003Cp\u003EThat sounds more like a driver issue and probably belongs in one of the support forums.\u003C/p\u003E\n"},{"CreatedByName":"Fishslap","CreatedById":143204,"CreatedDateTime":"2015-05-17T10:39:44Z","Content":"\n\u003Cp\u003EI tried that too and it didn\u0060t help. Also I haven\u0060t had any problems before. Anyway, you\u0060re probably right. Just a bit frustrated.\u003C/p\u003E\n"},{"CreatedByName":"UnanimousCoward","CreatedById":109698,"CreatedDateTime":"2015-05-17T11:07:10Z","Content":"\n\u003Cp\u003EWhat you\u0027re describing sounds a lot like memory-related crashes to me.\u003C/p\u003E\u003Cp\u003EThe more mods you use, the more memory KSP uses and the longer it takes to load. I guess you\u0027re playing the 32-bit version in Windows - it has a hard memory limit of 3.5 Gb. As soon as memory usage rises above that level, the game crashes. It doesn\u0027t matter how much RAM your computer has available, KSP can only use 3.5 Gb. The more textures and parts the game has to load, the more memory it uses.\u003C/p\u003E\u003Cp\u003EYou can confirm it by looking in the log file after a crash (it\u0027s Kerbal Space Program\\\u003Cspan style=\u0022color:#333333;\u0022\u003EKSP_Data\\output_log.txt). It\u0027s a huge file, but skip to the end and you\u0027ll probably see something like \u0022System out of memory!\u0022 or similar.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EThere are some ways to help limit the RAM usage, for example \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/59005-1-0-Release-5-0-April-28-2015-Active-Texture-Management-Save-RAM%21\u0022 rel=\u0022external nofollow\u0022\u003EActive Texture Management\u003C/a\u003E can be very helpful. Many people \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/84203-Less-memory-usage-by-using-OpenGL\u0022 rel=\u0022external nofollow\u0022\u003Erun the game under OpenGL\u003C/a\u003E rather than DirectX, as it seems to use a lot less memory that way. You can \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/98672-WIN-KSP-to-DDS-texture-converter\u0022 rel=\u0022external nofollow\u0022\u003Econvert your mods textures to DDS format \u003C/a\u003Eto save memory and speed up loading time as well.\u003C/p\u003E\u003Cp\u003EHowever, as Windows only officially has a 32-bit version of the game, there\u0027s always going to be a limit to how many mods you can run. On Linux, there\u0027s a proper, stable 64-bit version of KSP, so you can run pretty much as many mods as you like.\u003C/p\u003E\u003Cp\u003EEdit--\u003C/p\u003E\u003Cp\u003EOne last tip - if you\u0027re using the Steam version and you want to play with loads of mods, it\u0027s probably a good idea to make a copy of the entire Kerbal Space Program folder somewhere else on your computer and play it from there. It prevents any possible Steam-related problems (e.g. updates that break mods).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-17T11:10:06Z\u0022 title=\u002205/17/2015 11:10  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 17, 2015\u003C/time\u003E by UnanimousCoward\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Fishslap","CreatedById":143204,"CreatedDateTime":"2015-05-17T12:33:17Z","Content":"\n\u003Cp\u003EThanks. I\u0060ll try this.\u003C/p\u003E\u003Cp\u003ESo it\u0060s basically switch to Linux or live in squalor then? No plan for a 64 bit Windows version of KSP?\u003C/p\u003E\n"},{"CreatedByName":"Harry Rhodan","CreatedById":119953,"CreatedDateTime":"2015-05-17T14:28:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fishslap\u0022 data-cite=\u0022Fishslap\u0022\u003E\u003Cdiv\u003ENo plan for a 64 bit Windows version of KSP?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot in the near future. There\u0027s a community workaround in the Tutorials forum but a few mods like FAR aren\u0027t going to work with it.\u003C/p\u003E\n"},{"CreatedByName":"UnanimousCoward","CreatedById":109698,"CreatedDateTime":"2015-05-17T14:53:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Harry Rhodan\u0022 data-cite=\u0022Harry Rhodan\u0022\u003E\u003Cdiv\u003ENot in the near future. There\u0027s a community workaround in the Tutorials forum but a few mods like FAR aren\u0027t going to work with it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf it\u0027s still even half as buggy as the 0.90 64-bit one, then I wouldn\u0027t go anywhere near it. People do seem to be saying it\u0027s better, though. OTOH, you\u0027re not likely to get much in the way of support from many mod authors if you run Windows 64-bit.\u003C/p\u003E\n"},{"CreatedByName":"hbkmog","CreatedById":144011,"CreatedDateTime":"2015-05-17T15:30:39Z","Content":"\n\u003Cp\u003EYeah the lack of 64bit support of the game is a huge bummer. Even without mods, the game can crash after prolonged session due to memory leaks and whatnot. As for now, I don\u0027t even hope for content update. I just want 64bit support and more stable game.\u003C/p\u003E\n"},{"CreatedByName":"Fishslap","CreatedById":143204,"CreatedDateTime":"2015-05-19T07:09:03Z","Content":"\n\u003Cp\u003EI just wanted to mention that I updated my Nvidia drivers and remembered the feature GeForce has for optimizing games. When I activated KSP optimization there it really helped me with performance. I haven\u0060t crashed since I did that and the loading times are much more manageable.\u003C/p\u003E\n"}]}