{"TopicId":109787,"ForumId":70,"TopicTitle":"Possible virus or malware phishing in a KSP mod","CreatedByName":"Seaview123","CreatedById":130421,"CreatedDateTime":"2015-05-18T09:53:38Z","PageNum":1,"Articles":[{"CreatedByName":"Seaview123","CreatedById":130421,"CreatedDateTime":"2015-05-18T09:53:38Z","Content":"Hello all, \n\nYesterday, I had a problem which is keeping me from loading my game. I wrote about it in this thread. [http://forum.kerbalspaceprogram.com/threads/121851-Game-Crash-on-load-right-before-Main-Page](https://forum.kerbalspaceprogram.com/threads/121851-Game-Crash-on-load-right-before-Main-Page)\n\nAfter updating some mods using CKAN I started seeing a popup labeled \u0022KSP Stats Tracker\u0022 that opens up right after Module Manager finishes loading patches, and asks if I would allow game data to be sent off for study. \n\nRight after this window starts my memory usage (on Windows Task Manager) spikes, filling all of my RAM (8Gig) and my game crashes. Has anyone else seen this popup window? Is it a Squad thing or something added by a modder? Could it be a virus or other malware phishing in the KSP community?"},{"CreatedByName":"Rocketfeline","CreatedById":137938,"CreatedDateTime":"2015-05-18T12:00:42Z","Content":"It could be possible.. But Im very scared to assume."},{"CreatedByName":"Jansn","CreatedById":131392,"CreatedDateTime":"2015-05-18T12:19:41Z","Content":"Isn\u0027t KSP Stats Tracker part of the original game?\n\nDo you mean the window asking of tracking your game and (dont) send your IP?"},{"CreatedByName":"Mokmo","CreatedById":62363,"CreatedDateTime":"2015-05-18T16:27:36Z","Content":"I tried finding an image but no one seem to have bothered to post a screenshot. The game has one built in that asks you on your first start if you want to send statistics to Squad with some options not to send your IP (doing this from memory, i think there\u0027s another option, maybe anonymize?)\n\nAs for your memory use, per your other post you could try removing the Astronomer\u0027s pack modules and see what happens"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-05-18T17:22:46Z","Content":"If you are referring to this:\n\n![Stats.png](https://dl.dropboxusercontent.com/u/61004449/KSP/Misc/Stats.png)\n\nThen that is Squad\u0027s data collection, it is present in an unmodded install. It is not malware or a virus, and can be easily disabled."},{"CreatedByName":"Seaview123","CreatedById":130421,"CreatedDateTime":"2015-05-19T00:14:11Z","Content":"That is the window I was referring to, and thanks for clearing that up. I originally let it send my game data, but when I was checking my memory usage, it seemed to coincide with the window poping up and thought I\u0027d better ask the forum. \n\nAnd Mokmo, I\u0027ll try disabling the Astronomer\u0027s modules and see what happens. \n\nThanks again for for your help."},{"CreatedByName":"nukeboyt","CreatedById":68397,"CreatedDateTime":"2015-05-19T00:44:13Z","Content":"\u003E \n\u003E That is the window I was referring to, and thanks for clearing that up. I originally let it send my game data, but when I was checking my memory usage, it seemed to coincide with the window poping up and thought I\u0027d better ask the forum. \n\u003E And Mokmo, I\u0027ll try disabling the Astronomer\u0027s modules and see what happens. \n\u003E \n\u003E Thanks again for for your help.\n\nDoes it KEEP COMING UP each time you start KSP? If it does, delete the settings.cfg and let it make a new one on your next boot of the game. I had this problem when I tried copying a settings.cfg file from an old 0.9 game into 1.0. They are not all-that compatible."},{"CreatedByName":"Seaview123","CreatedById":130421,"CreatedDateTime":"2015-05-19T10:05:13Z","Content":"It does keep coming up, and I\u0027ll try that too. It\u0027s a little annoying."},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-05-19T10:51:12Z","Content":"Settings resetting is a problem some players have been having, you can check [this thread](https://forum.kerbalspaceprogram.com/threads/118981-Settings-keep-resetting) for some discussion of it."}]}