{"TopicId":109737,"ForumId":36,"TopicTitle":"Where do I start for Modding?","CreatedByName":"Sgt.Shutesie","CreatedById":141397,"CreatedDateTime":"2015-05-18T00:51:39Z","PageNum":1,"Articles":[{"CreatedByName":"Sgt.Shutesie","CreatedById":141397,"CreatedDateTime":"2015-05-18T00:51:39Z","Content":"Well, I kinda want to try modding. Simple stuff, like my \u0022Decaying Electrics\u0022 idea. Where batteries, like in real life, will slowly loose power storage capability with recharging and lower power amounts will offer slower reactions from powered devices (expanding solar panels, wheels, reaction wheels, etc). Maybe even nonchargeable batteries that will come first in the game and are cheap. \n\nAnywhere I can look to find where to start? Is there such a place? What code is KSP? Am I even in the right part of the forum?"},{"CreatedByName":"cybersol","CreatedById":81136,"CreatedDateTime":"2015-05-18T01:31:12Z","Content":"You want to ask that here: [http://forum.kerbalspaceprogram.com/forums/37-Add-on-Development](https://forum.kerbalspaceprogram.com/forums/37-Add-on-Development)\n\nMaybe a nice mod will move it over there for you. Coding is in C# and Unity. You can start with the stickies there, and I\u0027m sure you will get better advice than mine once this is asked over there ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)"},{"CreatedByName":"mielgato","CreatedById":113298,"CreatedDateTime":"2015-05-18T01:33:35Z","Content":"C# is the language used for KSP on top of unity engine \n\nI would recommand you this [=\u003Elink\u003C=](https://forum.kerbalspaceprogram.com/threads/94638-Mod-Development-Links-Compilation-START-HERE), it might help you at least a little to get into KSP modding\n\ngot owned by cybersol ![:sticktongue:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif)\n\nAs cybersol mentionned, you\u0027d better be asking over the general [add-on DEV](https://forum.kerbalspaceprogram.com/forums/37-Add-on-Development) forum section\n\n**Edited \u003Ctime datetime=\u00222015-05-18T01:41:07Z\u0022 title=\u002205/18/2015 01:41  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 18, 2015\u003C/time\u003E by mielgato**"},{"CreatedByName":"Vectura","CreatedById":119212,"CreatedDateTime":"2015-05-18T10:47:20Z","Content":"And if you want to model parts, start with a free program like Blender 3D (some claim it is hard to learn but I never had a problem)."},{"CreatedByName":"jaredkzr","CreatedById":73023,"CreatedDateTime":"2015-05-18T11:08:28Z","Content":"\u003E \n\u003E And if you want to model parts, start with a free program like Blender 3D (some claim it is hard to learn but I never had a problem).\n\nWorst part about Blender is the terrible UI. It\u0027s a cluttered mess where the majority of useful functions are unintuitive keyboard shortcuts. With that said, it\u0027s free and extremely powerful so I can let it slide. \n\nSo yeah, OP, for coding you\u0027ll want to look into Unity and C#. You\u0027re lucky since C# isn\u0027t actually too difficult to get a feel for unlike C\u002B\u002B which requires a lot more knowledge and time to figure out. Additionaly, Unity has got a massive userbase so you\u0027ll be able to find plenty of help for coding with it.\n\nIt think a mod like you are describing would be very cool! Might give RTG\u0027s even more use since you won\u0027t have to worry about them failing after a few years like you would with batteries. I wish you the best of luck!"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2015-05-19T18:02:10Z","Content":"Moved to Addon Dev. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2015-05-19T21:08:15Z","Content":"\u003E \n\u003E Worst part about Blender is the terrible UI. It\u0027s a cluttered mess where the majority of useful functions are unintuitive keyboard shortcuts.\n\nBest part about blender is that the majority of the most common functions are just a key-press away, in addition to your usual menus."}]}