{"TopicId":109727,"ForumId":32,"TopicTitle":"Is it just me, or are the tourist contracts easy cash cows?","CreatedByName":"LordCurlyton","CreatedById":125432,"CreatedDateTime":"2015-05-17T23:03:29Z","PageNum":1,"Articles":[{"CreatedByName":"LordCurlyton","CreatedById":125432,"CreatedDateTime":"2015-05-17T23:03:29Z","Content":"To be fair, that only applies once you start getting in-Kerbin SoI missions beyond \u0022suborbital flight on Kerbin\u0022. Its very easy for me to rack up 300-400k on a 40k rocket to accomplish the various Mun/Minmus desires. Just cycle the ones that require you to land on the Mun. You can even include some of the Solar ones by popping just out of Kerbin\u0027s SoI. Its what I\u0027m doing to farm cash now that I have the Hitchhiker capsule unlocked."},{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2015-05-17T23:49:20Z","Content":"yeah, I\u0027m mining tourists now. I\u0027ve built a mostly reusable process to take 16 tourists at a time for trips around Mun and Minmus. I\u0027ve got an SSTO to take them into orbit, a reusable shuttle-bus-thing to take them to Mun where I\u0027ve got a lander to take just those who need to land on Mun, then back on the bus and off to Minmus where the bus can land before heading back to Kerbin and aero-brake back into orbit. The only costs are now refueling the Bus and Mun-lander (and now I\u0027ve got a mining operation around Mun, that\u0027s even easier). \n\nFirst mission with that setup (including the 1 off costs of putting everything in place) brought in 1.9 million profit!!"},{"CreatedByName":"SelectHalfling0","CreatedById":105051,"CreatedDateTime":"2015-05-18T00:11:23Z","Content":"Once you unlock SSTO technology, tourists become viable sources of income. Of course, before that point you will rarely make a profit."},{"CreatedByName":"zarakon","CreatedById":5160,"CreatedDateTime":"2015-05-18T02:10:24Z","Content":"In my experience, the tourist contracts seem to come in two flavors:\n\n1. Take one or two tourists on Kerbin suborbital or orbital flights. They are very poor and can only pay with dirt. Not worth bothering with.\n\n2. Take 5 or 6 tourists to various locations. They pay well, but in addition to requiring too many of them and too many different locations, there\u0027s always one or two of them who want something absurd like suborbital flight on the sun or atmospheric flight at Jool. Would be nice if these were broken up into individual contracts, but as a whole they\u0027re just asking too much.\n\nI wish they would just have a single destination request, and that all tourists in a contract would request the same thing, or at least nearby places - like Duna and Ike together, not Eve and Jool.\n\n**Edited \u003Ctime datetime=\u00222015-05-18T02:12:39Z\u0022 title=\u002205/18/2015 02:12  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 18, 2015\u003C/time\u003E by zarakon**"},{"CreatedByName":"LordCurlyton","CreatedById":125432,"CreatedDateTime":"2015-05-18T22:59:13Z","Content":"Its not that difficult to make a profit even on the early 2 tourist suborbital Kerbin ones. Its just not a large one but I can generally double the amount I spent to put them up there, especially if one decides they want to orbit Kerbin. They are mainly better to grind a bit of rep to unlock bigger, better missions (which is what i presume high rep does). The ones I like are the 3 or 4 kerbal tourist missions in kerbin SoI, as one Hitchhiker can will hold them all."},{"CreatedByName":"Tourist","CreatedById":143403,"CreatedDateTime":"2015-05-18T23:11:37Z","Content":"They can be quite useful if you combine them with other contracts too. For instance, I had a rescue mission from around Minmus, with Tourist mission around Minmus. Used the Mk1-2 command pod. Had Jeb in the pilot seat, the tourist in the other seat and a vacant one for the hitchhiker. Think I also picked up a science from around Kerbin contract at the same time."},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2015-05-18T23:12:12Z","Content":"\u003E \n\u003E Once you unlock SSTO technology, tourists become viable sources of income. Of course, before that point you will rarely make a profit.\n\nHuh? *Tourists* are insanely profitable, on the order 120k for a tour of Mun and Minmus. Without even landing, mind you. You\u0027re probably thinking of *VIPs* that only want to go (sub)orbital on Kerbin. Those barely pay the bill if you do it with rockets, but they give a lot of reputation. Do a few VIPs and you will soon have much better contracts on offer."},{"CreatedByName":"samstarman5","CreatedById":12469,"CreatedDateTime":"2015-05-19T09:01:31Z","Content":"I don\u0027t touch them, myself, at the moment, but I am getting very tempted to just shanghai them to use for mining for ore on other planets. It would be interesting to see if the contract penalty exceeds or is just pennies to the reward of free kerbals bringing back valuable ore."},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-05-19T09:10:56Z","Content":"Kerbin orbit tourists are easy, but you don\u0027t get a lot from your mission. Farther bodies tourists may be a hassle. They want to got to various bodies and you\u0027re stuck with the mission for a long time. I\u0027m less and less interested by tourists, now and I didn\u0027t even quit Kerbal SOI.\n\nEDIT : but early on, it\u0027s a very good income especially combined with rescue Kerbonauts."},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2015-05-19T09:14:42Z","Content":"\u003E \n\u003E Once you unlock SSTO technology, tourists become viable sources of income. Of course, before that point you will rarely make a profit.\n\nBy SSTO technology you mean fuel tanks and a LV-T30, right? That\u0027s all you need, plus the capsule and chutes.\n\nRune. 3.5km/s on 300s isp is a measly mass ratio of 3.3."},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2015-05-19T21:33:11Z","Content":"\u003E \n\u003E By SSTO technology you mean fuel tanks and a LV-T30, right? That\u0027s all you need, plus the capsule and chutes.\n\u003E Rune. 3.5km/s on 300s isp is a measly mass ratio of 3.3.\n\nProblem is to land the stack close enough to KSC, you do not want to overshoot or hit the mountain west of it.\n\n- - - Updated - - -\n\nMy problem with tourists is the stupid one who want to go suborbital on the sun.\n\nDuna, Ike and other bodies can be solved if you have spare room in ship.\n\nFor a LOL, you can transfer kerbals trough KAS wires. Why not you can put an docking port on the edge of an grinder segment, dock and transfer."}]}