{"TopicId":10986,"ForumId":21,"TopicTitle":"[0.15 STOCK] F-104/NF-104 Starfighter","CreatedByName":"Chairborneranger","CreatedById":17675,"CreatedDateTime":"2012-05-20T03:52:15Z","PageNum":1,"Articles":[{"CreatedByName":"Chairborneranger","CreatedById":17675,"CreatedDateTime":"2012-05-20T03:52:15Z","Content":"\\*Outside the brand new KSC spaceplane hanger\\*\n\nJeb: Hey Bill, you got any Beeman\\\u0027s?\n\nBill: I might just have me a stick.\n\nJeb: Well lend me some, I\\\u0027ll pay you back later!\n\nBill: Fair enough.\n\nJeb:...Go grab Bob. I think there\\\u0027s a plane over there with our names on it.\n\nBill: Now you\\\u0027re talkin\\\u0027!\n\nThe NASA/USAF buff in me couldn\\\u0027t resist, so I present my stock mockups of the F-104 and NF-104 Starfighters. Craft files down below!\n\n\u003E ![jNekP.jpg](http://i.imgur.com/jNekP.jpg)\n\u003E ![HGjoO.jpg](http://i.imgur.com/HGjoO.jpg)\n\nThe tail tank is a necessity on the NF-104 due to the rocket requirement, and I decided to leave it in as she\\\u0027s very unruly when lacking an avionics package. I had to downgrade to the LV-909 due to excessive pitch caused by the aerospike rocket. Still, the NF will push over 24,000M if handled properly. \n\nSome flying tips:\n\n1. She needs the ENTIRE runway. She\\\u0027ll also be very squirrely on takeoff, so I recommend setting SAS on until you just run out of tarmac. Make SLIGHT adjustments using precision controls. Right before she reaches the end, pull back hard and keep it level.\n\n2. Once airborne, pick up speed and point her skyward. Both aircraft will start accelerating into a 30 degree climb around 1500M. Operating altitude is 12,000M to 15,000M, and when half the fuel is gone you\\\u0027ll make mach 1.5 at 14,000-15,000M.\n\n3. Flying with SAS on constantly is STRONGLY encouraged. She\\\u0027ll fly level and true at low altitude and maneuvers well.\n\n4. Exceeding the flight envelope at high mach WILL KILL YOU! Many crews have met their fate falling in a flat spin.\n\n5. Keep in mind that the NF is equipped with a RCS system for orientation in high atmosphere.\n\nThat said, go out there and break some records! My altitude record in the NF is 24,986M. Here\\\u0027s an album with some of my flying shots:\n\n[http://imgur.com/a/lLmAy](http://imgur.com/a/lLmAy)\n\nEDIT: blah, spelling."}]}