{"TopicId":109800,"ForumId":18,"TopicTitle":"Budget Gaming Laptop [Some gaming, Computer Science Student] ~$850-1,000","CreatedByName":"vaironl","CreatedById":125811,"CreatedDateTime":"2015-05-18T13:36:11Z","PageNum":1,"Articles":[{"CreatedByName":"vaironl","CreatedById":125811,"CreatedDateTime":"2015-05-18T13:36:11Z","Content":"Hello All,\n\nI apologize for a question that has been asked so many times on this forum, but I just wanted to make the right decision before proceeding with the nightmare of buying a costly product. 5 years ago I bought a $1,000 crappy laptop which heated often and had all sorts of problems in a short period of time. I then built a gaming rig 2 years ago for the purpose of playing video games and coding. Now I\u0027ll be finishing the last 2 years of university and will need a laptop. If you ask yourself why I didn\u0027t get one sooner as a computer science student is because I was a community college student, where I didn\u0027t require a laptop. Before I proceed with my questions, can the community make a recommended laptops sticky? There was a similar thread I saw, but it would be grade if that list was updated in a certain period of time for the next couple of years and all that people would have to do isread the reviews, choose something within their budget, and purchase the product.\n\nAnyways... All I need this laptop for is mainly programming. I mainly program in Java, Python, Android Studio (Java as well, but take into account the emulator), and sometimes I venture off to other programming languages. I am now playing video games in a small portion of my time due to school and work, but I definitely like to play Kerbal Space Program, Terraria, Minecraft, and similar games. These are the only games I expect to sometimes play on a laptop, anything else will probably be done in my gaming rig.\n\nMy budget is $850 I am willing to go up to $1,000. Please try not to suggest anything above $1,000. I am trying to save as much money as possible to pay for my university out of pocket, and remember I have a dedicated gaming rig at home. I have some laptops in mind which are: Lenovo Y50, Dell XPS13, ASUS X55LA-DB71, ASUS N550JK-DS71T. The press around Lenovo has scared me a bit, even after some redditors reassured me they don\u0027t have the superfish problem on the 2015 models. Again thanks for the great help and if you can elaborate on actual experience with the model you suggest, it would be great. I had some people simply tell me \u0022go buy this model\u0022 and that doesn\u0027t really help me much to understand why I should get it. Also, if you know of a laptop that I should definitely NOT get list that below. \n\nThanks a lot!\n\nLAPTOP QUESTIONNAIRE\n\n- Country of purchase: USA\n- Budget range: 0- $850\n- Purpose (netbook, ultraportable, mainstream, gaming, desktop replacement, etc.): Mainly web browsing, programming, some gaming.\n- Screen size preference: ~15in\n- OS preference (Windows/Mac/Linux): Windows\n- Gaming requirements (example games and desired fps/settings): I will not be gaming much, but when I do it will be things like Kerbal space program, terraria, minecraft. [desired setting will be medium for each game]\n- Other performance requirements (video editing, CAD, etc.): Can program with eclipse and run android emulator.\n- Brand preferences and reasons (already owned accessories, familiarity, business compatibility): None\n- Any particular style that you like (examples are great): None\n\nWhich of the following qualities would you prefer? (Choose one, two, or balanced)\n\n- Long battery life -vs- Low weight -vs- High performance: balanced between long battery life and high performanced.\n- Build quality -vs- Low price -vs- High performance: Balanced between high performance and build quality\n- Low noise/heat -vs- High performance: Low noise/heat\n\nWhich features would you pay a premium for?\n\n- High resolution screen: Not necessary\n- A great keyboard: Will pay premium for\n- A great touchpad/mouse buttons: Doesn\u0027t need to be fancy, but it would be great if it doesn\u0027t heat up.\n- Great audio: Not necessary"},{"CreatedByName":"Lord Aurelius","CreatedById":71687,"CreatedDateTime":"2015-05-21T04:23:12Z","Content":"A quick search on Newegg revealed this:\n\n[MSI GP60](http://www.newegg.com/Product/Product.aspx?Item=N82E16834152744\u0026ignorebbr=1)\n\nMSI makes decent gaming laptops from the reviews I\u0027ve read. The GPU in this one is a little weak compared to other gaming laptops, but if you\u0027re only going for medium settings it should be fine for anything, even at the 1080p native resolution (which you definitely want for coding, the extra real estate makes a huge difference). It comes with a $100 rebate right now, which I would use to get a 256GB ssd for it.\n\n[ASUS ROG GL551JW](http://www.newegg.com/Product/Product.aspx?Item=N82E16834232404)\n\nIt\u0027s slightly over $1000, but it\u0027s actually a better IMHO deal since you get a nice GPU bump (you can\u0027t upgrade this later) and 16GB of RAM. Also, ASUS makes good stuff.\n\nAlso take a look at [XoticPC](http://www.xoticpc.com/custom-gaming-laptops-notebooks-laptops-ct-95_51_147.html), they have a nice selection and will build to order, and carry some of the off brand (but awesome) laptops from Clevo (rebranded as Sager). The [Sager NP7155](http://www.xoticpc.com/sager-np7155-clevo-n155sd-eta-may-p-8083.html) looks really nice, if you add a SSD to the base price it comes in at just under $1000 (and has free shipping, and likely no tax unless you happen to live in the same state as them).\n\nI would stay away from Lenovo, their thinkpad line may be decent but their home consumer products are basically junk from my experience."},{"CreatedByName":"theend3r","CreatedById":97560,"CreatedDateTime":"2015-05-21T06:45:38Z","Content":"\u003E \n\u003E [ASUS ROG GL551JW](http://www.newegg.com/Product/Product.aspx?Item=N82E16834232404)\n\u003E It\u0027s slightly over $1000, but it\u0027s actually a better IMHO deal since you get a nice GPU bump (you can\u0027t upgrade this later) and 16GB of RAM. Also, ASUS makes good stuff.\n\nI have G75VW (predecessor with larger screen) and it\u0027s a great machine. Good display, silent, powerful. I\u0027m having some problems with the battery now but otherwise it\u0027s taken all my abuse rather well. Sound could be better but I use a headset anyway. Recommended."},{"CreatedByName":"vaironl","CreatedById":125811,"CreatedDateTime":"2015-05-25T17:01:36Z","Content":"\u003E \n\u003E A quick search on Newegg revealed this:\n\u003E [MSI GP60](http://www.newegg.com/Product/Product.aspx?Item=N82E16834152744\u0026ignorebbr=1)\n\u003E \n\u003E MSI makes decent gaming laptops from the reviews I\u0027ve read. The GPU in this one is a little weak compared to other gaming laptops, but if you\u0027re only going for medium settings it should be fine for anything, even at the 1080p native resolution (which you definitely want for coding, the extra real estate makes a huge difference). It comes with a $100 rebate right now, which I would use to get a 256GB ssd for it.\n\u003E \n\u003E [ASUS ROG GL551JW](http://www.newegg.com/Product/Product.aspx?Item=N82E16834232404)\n\u003E \n\u003E It\u0027s slightly over $1000, but it\u0027s actually a better IMHO deal since you get a nice GPU bump (you can\u0027t upgrade this later) and 16GB of RAM. Also, ASUS makes good stuff.\n\u003E \n\u003E Also take a look at [XoticPC](http://www.xoticpc.com/custom-gaming-laptops-notebooks-laptops-ct-95_51_147.html), they have a nice selection and will build to order, and carry some of the off brand (but awesome) laptops from Clevo (rebranded as Sager). The [Sager NP7155](http://www.xoticpc.com/sager-np7155-clevo-n155sd-eta-may-p-8083.html) looks really nice, if you add a SSD to the base price it comes in at just under $1000 (and has free shipping, and likely no tax unless you happen to live in the same state as them).\n\u003E \n\u003E I would stay away from Lenovo, their thinkpad line may be decent but their home consumer products are basically junk from my experience.\n\nThanks a lot for your suggestions!! After a bit of research I was going a bit crazy and decided to settle down on a GE60 Apache Pro this one in specific: MSI GE60 Apache Pro-867 15.6\u0022 i7-4720HQ 16GB 120GB SSD \u002B 1TB 7200rpm HDD NVIDIA GTX 960M 2GB Full HD Windows 8.1 Gaming Laptop Computer [https://www.amazon.com/dp/B00TUEP0Y8/ref=cm_sw_r_awd_Jh1yvb03GFFTP](https://www.amazon.com/dp/B00TUEP0Y8/ref=cm_sw_r_awd_Jh1yvb03GFFTP). I got a gift card after selling some books on Amazon and decided to raise my budget a bit more. I think it has more power than I will ever need, but the other laptops I found had one missing feature that I wanted. Macs with a 15 in. screen and 8gb of ram were quite expensive. Normal laptops that met almost all requirements either didn\u0027t have a full 1080p screen, or only had 4gb, or a 5,400 rpm HDD. This MSI seemed to have met all requirements. The only downside is that is relatively new so it doesn\u0027t have many reviews to prove of it\u0027s durability. But like you said they seem to be making decent gaming laptops. Another problem these models seemed to have in the past were overheating gpu\u0027s, but I believe the 960m might take care of that. Thanks again for your suggestions.\n\n\u003E \n\u003E I have G75VW (predecessor with larger screen) and it\u0027s a great machine. Good display, silent, powerful. I\u0027m having some problems with the battery now but otherwise it\u0027s taken all my abuse rather well. Sound could be better but I use a headset anyway. Recommended.\n\nI was really close to getting an ROG or the acer nitro, chose an MSI G60 instead. Thanks for the suggestions! \n\nI hope that other people in the future take advantage of this thread."},{"CreatedByName":"Lord Aurelius","CreatedById":71687,"CreatedDateTime":"2015-05-26T02:25:27Z","Content":"Looks like a solid choice, hopefully it serves you well for the duration of your program. The new maxwell nvidia cards run much cooler than the previous generation so overheating shouldn\u0027t be an issue as long as you give the laptop proper ventilation while gaming (i.e. use a laptop cooler or at the very least prop it up). You should be able to run KSP totally maxed with a full load of visual mods at 1080p on there without issues (my current laptop has a 765m and it manages to do that so you\u0027ll get even better performance)."},{"CreatedByName":"harlan","CreatedById":144937,"CreatedDateTime":"2015-06-10T15:06:17Z","Content":"I think you can go for Asus ROG series laptops, they are the best for gaming\n\n**Edited \u003Ctime datetime=\u00222015-06-10T23:27:53Z\u0022 title=\u002206/10/2015 11:27  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 10, 2015\u003C/time\u003E by harlan**"},{"CreatedByName":"harlan","CreatedById":144937,"CreatedDateTime":"2015-06-10T23:28:15Z","Content":"Something like here recommend gaming laptops around your price: [http://pcgamerhome.com/gaming-laptops-under-1000/](http://pcgamerhome.com/gaming-laptops-under-1000/)"},{"CreatedByName":"Eleven","CreatedById":60502,"CreatedDateTime":"2015-06-11T01:36:11Z","Content":"\u003E \n\u003E Something like here recommend gaming laptops around your price: [http://pcgamerhome.com/gaming-laptops-under-1000/](http://pcgamerhome.com/gaming-laptops-under-1000/)\n\nI have this one, the Y50-70 Touch to be exact. I bought 2. One is Win8 only for the family and the other I dual-boot Linux Mint and Win8. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"}]}