{"TopicId":109908,"ForumId":44,"TopicTitle":"Hubble time lapse of an \u0026#039;exploding star\u0026#039;","CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2015-05-19T04:41:09Z","PageNum":1,"Articles":[{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2015-05-19T04:41:09Z","Content":"\n\u003Cp\u003EOkay, not literally exploding, but that\u0027s what was originally thought when it happened.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThe unusual variable star V838 Monocerotis (V838 Mon) continues to puzzle astronomers. This previously inconspicuous star underwent an outburst early in 2002, during which it temporarily increased in brightness to become 600,000 times more luminous than our Sun. Light from this sudden eruption is illuminating the interstellar dust surrounding the star, producing the most spectacular \u0022light echo\u0022 in the history of astronomy.\u003Cp\u003EAs light from the eruption propagates outward into the dust, it is scattered by the dust and travels to the Earth. The scattered light has travelled an extra distance in comparison to light that reaches Earth directly from the stellar outburst. Such a light echo is the optical analogue of the sound echo produced when an Alpine yodel is reflected from the surrounding mountainsides.\u003C/p\u003E\u003Cp\u003EThe NASA/ESA Hubble Space Telescope has been observing the V838 Mon light echo since 2002. Each new observation of the light echo reveals a new and unique \u0022thin-section\u0022 through the interstellar dust around the star. This video morphs images of the light echo from the Hubble taken at multiple times between 2002 and 2006. The numerous whorls and eddies in the interstellar dust are particularly noticeable. Possibly they have been produced by the effects of magnetic fields in the space between the stars.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E It\u0027s older news, but searching the science labs showed no mention of it. Apologies if this HAS appeared here before.\u003C/p\u003E\u003Cp\u003Ewww.youtube.com/watch?v=U1fvMSs9cps \u003C/p\u003E\u003Cp\u003E(no idea why this isn\u0027t embedding)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-19T04:46:10Z\u0022 title=\u002205/19/2015 04:46  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 19, 2015\u003C/time\u003E by vger\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2015-05-19T05:46:28Z","Content":"\n\u003Cp\u003EIf anyone is wondering, the reason the image looks kind of fake-ish is because it uses morphs as means of interpolation between frames.\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2015-05-19T07:03:58Z","Content":"\n\u003Cp\u003EHow bright is that light echo? Would we seen anything with a naked eye if a interstellar starship travelled there?\u003C/p\u003E\n"},{"CreatedByName":"miracmert","CreatedById":67128,"CreatedDateTime":"2015-05-20T09:44:15Z","Content":"\n\u003Cp\u003EWow, this is one of the coolest space image I\u0027ve seen \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E But I didn\u0027t understand a lot about what puzzles astronomers. Is it that more light scattered into interstellar dust than it should have?\u003C/p\u003E\n"},{"CreatedByName":"andrewas","CreatedById":24662,"CreatedDateTime":"2015-05-20T11:30:04Z","Content":"\n\u003Cp\u003EThey are puzzled by the explosion itself. Stars don\u0027t usually increase their output 600,000 times without exploding.\u003C/p\u003E\n"},{"CreatedByName":"Slam_Jones","CreatedById":125101,"CreatedDateTime":"2015-05-20T18:44:38Z","Content":"\n\u003Cp\u003EWow, gorgeous!\u003C/p\u003E\u003Cp\u003EThanks for sharing \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}