{"TopicId":109903,"ForumId":32,"TopicTitle":"Pff this new Areo stuff is Easy! - enter Spaceplane (at last)","CreatedByName":"Fraggle","CreatedById":143115,"CreatedDateTime":"2015-05-19T04:09:49Z","PageNum":1,"Articles":[{"CreatedByName":"Fraggle","CreatedById":143115,"CreatedDateTime":"2015-05-19T04:09:49Z","Content":"Im totally fibbing.\n\nIts a really bugger to deal with.. But once you get it figured... Piece of cake!\n\nIm glad its not going full Aero models like some Simulators we know and love, but this micky mouse version they have is brutally unforgiving... I love it!\n\n\u0022If it were easy, it wouldn\u0027t be fun!\u0022\n\nAnyway!\n\nHoorah! Finally got a spaceplane, a reusable SSTO version too! (design number 5) into orbit (for the most part) and had 4 Kerbals long for the ride. The Areo in 1.0.2 is a bugger, but fun as hell. Notes: Breaks!. The whole thing was glowing danger red on the way down, getting the speed arrested was problematic. But, it stayed together and the crew enjoyed a nice soft landing and roll out.\n\n![ksp_11_zpsscmgnial.jpg](http://i1292.photobucket.com/albums/b580/fragglea/ksp_11_zpsscmgnial.jpg)\n\nIts so strange when you play about.\n\nFor the longest time I was using just the 2 engines and those big Delta wings. It refused, totally refused to get over mach 1.1 or 15km.\n\nDumped the current design, pondered my Kerbal Science Bomber design.\n\nSwapped the wings, added a singe Ram Jet engine and Blamo... left the atmosphere first attempt in the new design.\n\nComparing the two different setups, (and remembering to add the \u0022Close AirIntake\u0022 action group) I understand better what was going wrong.\n\nSo! Orbital science platform plans can now be drawn up, and spaceplanes can be the reusable Kerbal shuttle system. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"Sidereus","CreatedById":135263,"CreatedDateTime":"2015-05-19T10:40:46Z","Content":"I\u0027m a little surprised those wings make it into orbit; their temperature limit is 1200K, where as all the other wings are 2000. I almost went with those for my SSTO space plane, except the way I get into orbit almost always gets some parts up past 1500. I lost several shock cone air intakes before I realized that they had changed them so that the Ram air intakes take in more air, and have higher temperature limits. ![:confused:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif)\n\nAnd yeah, MOAR ENGINES seems to be the way to into space with SSTOs these days. I played with several different designs for my MK3 SSTO before settling on 6 RAPIERs. I could get it into space with 5, but the design didn\u0027t look as good and it took some doing. \n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/pufru)"},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2015-05-19T11:09:33Z","Content":"Airbrakes will solve the re-entry heat issues - just a pair would bring that down with hardly a flame ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nTurbojets are currently very useful (almost mandatory) for stock aero spaceplanes because rapiers have a serious lack of power below mach 1.5. Turbos on the other hand are delivering a proper wallop at lower speeds, and will push you into the zone where the rapiers take over ^^ I too took a long time to learn this hard lesson :/"},{"CreatedByName":"Fraggle","CreatedById":143115,"CreatedDateTime":"2015-05-20T06:05:35Z","Content":"\u003E \n\u003E Airbrakes will solve the re-entry heat issues - just a pair would bring that down with hardly a flame ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\u003E Turbojets are currently very useful (almost mandatory) for stock aero spaceplanes because rapiers have a serious lack of power below mach 1.5. Turbos on the other hand are delivering a proper wallop at lower speeds, and will push you into the zone where the rapiers take over ^^ I too took a long time to learn this hard lesson :/\n\nYup yup.. That was my break through.\n\nI ditched the 100% rapier engine method. Totally inefficient I found.\n\nThe system in the above image uses 2 rapiers upto 10k, then the Ramjet is activated which throws it hard upto 20k. By 23k the Ramjet blows out and I coast up to 24k on the rapiers before I close the air intakes and go closed cycle into orbit.\n\nA method I shall be experimenting with for my next HeavyLifter SSTO attempt."},{"CreatedByName":"ComradeGoat","CreatedById":59041,"CreatedDateTime":"2015-05-21T12:17:48Z","Content":"My current spaceplane is limited in its ascent profile by the ram intakes overheating. Any tips for helping to cool them?"},{"CreatedByName":"TORCHWOOD","CreatedById":144040,"CreatedDateTime":"2015-05-22T05:05:20Z","Content":"Do they overheat on the way up or on the way down?\n\nFor the way up, try using girders to ablate heat, it /kinda/ works for me.\n\nOn the way down? Slap air brakes on it."},{"CreatedByName":"selfish_meme","CreatedById":125899,"CreatedDateTime":"2015-05-22T05:50:02Z","Content":"I have found that you can do without turbojets if you want, if you have trouble reaching mach 1, either do a gentle dive from 12-15000 metres or add another rapier or two to help push you past mach 1. My Mk3 spaceplane has 8 rapiers and no turbojets and can break mach quite easily."},{"CreatedByName":"Pairs","CreatedById":142565,"CreatedDateTime":"2015-05-22T05:58:20Z","Content":"It only took you 5 designs for an SSTO in 1.0!? Bravo, my friend. You are ahead of the curve."}]}