{"TopicId":110097,"ForumId":20,"TopicTitle":"Too many identical resources","CreatedByName":"Dreadp1r4te","CreatedById":98426,"CreatedDateTime":"2015-05-20T13:11:42Z","PageNum":1,"Articles":[{"CreatedByName":"Dreadp1r4te","CreatedById":98426,"CreatedDateTime":"2015-05-20T13:11:42Z","Content":"\n\u003Cp\u003ESo in my current install, due to the variety of mods I have, there exists several redundant resources on planets, compounded by the new resource system integrated into the vanilla game. Is there any way to consolidate these into one unifying resource database and disable the unneeded ones? Something akin to Minecraft Forge\u0027s ore dictionary, which makes similar or duplicate resources cross compatible with other mods using the same resource? So if X mod adds, say, Copper, and Y mod adds Copper, you can disable one mod\u0027s copper generation and use the other mod\u0027s copper for both mods? \u003C/p\u003E\u003Cp\u003EI currently have Ore, MetalOre, and MetallicOre in my resource scanner. Problem is I have no idea which I need for which mod. Ore is the basic KSP resource, and can be refined into liquid fuel and oxidizer, and I guess it can also be refined into RocketParts for EPL? So what are the other two for? I\u0027m not even sure what mod adds those; the only other mods I\u0027m using that add resources are KSP-I Extended and USI. A bunch of USI parts and UniversalStorage parts add storage for Hydrogen and Oxygen, but I use USI Life Support so those are useless to me to! It\u0027s very confusing; any help would be appreciated.\u003C/p\u003E\n"},{"CreatedByName":"SAI Peregrinus","CreatedById":125558,"CreatedDateTime":"2015-05-20T14:56:43Z","Content":"\n\u003Cp\u003EMetalOre is the ore used by EPL for making rocket parts. Ore is the stock ore used to make liquid fuel and oxidizer. None of the mods listed should add MetallicOre as far as I can tell. It\u0027s not listed in the Community Resource Pack spreadsheet (\u003Ca href=\u0022https://docs.google.com/spreadsheets/d/1F2NYLj47O6VdThCXqBcI_hB-bDIMh4ZWB2FFyrjMLkg/edit#gid=650840806\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://docs.google.com/spreadsheets/d/1F2NYLj47O6VdThCXqBcI_hB-bDIMh4ZWB2FFyrjMLkg/edit#gid=650840806\u003C/a\u003E) so none of the mods that use the CRP are the source.\u003C/p\u003E\u003Cp\u003EHydrogen and Oxygen are used by KSP-I for some of the advanced engines and such. That mod adds a LOT of different resources.\u003C/p\u003E\n"},{"CreatedByName":"Raptor831","CreatedById":68286,"CreatedDateTime":"2015-05-20T15:01:47Z","Content":"\n\u003Cp\u003EThis is why CRP was made, so that every mod that wanted to could use a base set of resources that don\u0027t conflict. USI, Universal Storage, KSPI-E, and EPL all use CRP, if I am remembering correctly. If that\u0027s the case, everyone\u0027s \u0022Oxygen\u0022 is the same exact resource, so there\u0027s no stomping on anything. You can have resources defined and not uses without ill effect, so if you find random ones it\u0027s not \u003Cstrong\u003Etoo\u003C/strong\u003E bad of an issue. Just more an annoyance, I guess.\u003C/p\u003E\n"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2015-05-20T16:21:22Z","Content":"\n\u003Cp\u003EMetalOre is EL, MetallicOre is CRP. The reason for the distinction is that in EL, you can make RocketParts from a single resource. With the USI/MKS stuff, we require three different resources. Hence the difference.\u003C/p\u003E\n"},{"CreatedByName":"Dreadp1r4te","CreatedById":98426,"CreatedDateTime":"2015-05-20T22:01:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SAI Peregrinus\u0022 data-cite=\u0022SAI Peregrinus\u0022\u003E\u003Cdiv\u003EMetalOre is the ore used by EPL for making rocket parts. Ore is the stock ore used to make liquid fuel and oxidizer. None of the mods listed should add MetallicOre as far as I can tell. It\u0027s not listed in the Community Resource Pack spreadsheet (\u003Ca href=\u0022https://docs.google.com/spreadsheets/d/1F2NYLj47O6VdThCXqBcI_hB-bDIMh4ZWB2FFyrjMLkg/edit#gid=650840806\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://docs.google.com/spreadsheets/d/1F2NYLj47O6VdThCXqBcI_hB-bDIMh4ZWB2FFyrjMLkg/edit#gid=650840806\u003C/a\u003E) so none of the mods that use the CRP are the source.\u003Cp\u003EHydrogen and Oxygen are used by KSP-I for some of the advanced engines and such. That mod adds a LOT of different resources.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, KSP-I uses \u003Cem\u003ELiquid\u003C/em\u003E Oxygen, not standard Oxygen. As far as I can tell, the only mod I\u0027ve seen that uses just plain Oxygen is TAC-LS and similar, but I don\u0027t have those so at the moment UniversalStorage is just taking up RAM adding parts I don\u0027t need. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EMetalOre is EL, MetallicOre is CRP. The reason for the distinction is that in EL, you can make RocketParts from a single resource. With the USI/MKS stuff, we require three different resources. Hence the difference.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIs there anyway to simplify this down a bit further on a case-by-case basis? A CFG I can change maybe? Or better yet, which EPL parts are safe to remove that are replaced by USI/UKS parts? Does USI/UKS have its own smelter, etc.?\u003C/p\u003E\n"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2015-05-21T00:58:51Z","Content":"\n\u003Cp\u003ERemove all EPL parts other than the survey stake and the mallet. And lqdoxygen is very different than oxygen \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"}]}