{"TopicId":110181,"ForumId":18,"TopicTitle":"Thoughts on Majors/minors in college","CreatedByName":"Halo_003","CreatedById":76050,"CreatedDateTime":"2015-05-21T01:21:06Z","PageNum":1,"Articles":[{"CreatedByName":"Halo_003","CreatedById":76050,"CreatedDateTime":"2015-05-21T01:21:06Z","Content":"\n\u003Cp\u003ETL;DR version: To do physics minor/major or not?\u003C/p\u003E\u003Cp\u003ERight now I\u0027ve finished 2 years of undergrad. Due to financial aid being lost after my first year (due to IRS income report error, not bad grades) I was at a local community college this year. I would have transferred to a different university but the school I attended freshman year (which is a private school at $50k\u002B/yr), notified me \u003Cstrong\u003EJuly 31st\u003C/strong\u003E that my aid for the upcoming year had been removed entirely.\u003C/p\u003E\u003Cp\u003ENotification so late in the summer left me literally one option, which was to do community college and finish my AA. (Which I have now done). I started first semester of freshman year as a Computer Engineering major and hated it, and have been a business major since then. I have a high cumulative GPA, about 3.8. My HS GPA was 3.92, SAT scores all 700\u002B, 4 AP courses senior year alone, 5\u0027s on all of the tests, honors for most everything else in HS, at a private HS, not public.\u003C/p\u003E\u003Cp\u003EI\u0027ve been accepted to two schools in FL, UF and Rollins College (Private), thus far. Both schools accepted me as a Business major, but at this point I\u0027m concerned it might not be the best choice for me. I\u0027m considering the following possibilities:\u003C/p\u003E\u003Cp\u003EA) Business major, economics minor\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E Business major, physics minor\u003C/p\u003E\u003Cp\u003EC) Econ. major, physics minor\u003C/p\u003E\u003Cp\u003ED) Physics major, econ minor\u003C/p\u003E\u003Cp\u003EE) Physics major, business minor\u003C/p\u003E\u003Cp\u003EWhen/if I get a master\u0027s degree, I\u0027d like it to be in Physics more so than an MBA. But even there I\u0027m not really sure. I know the first question on the mind of one reading this is probably what I want to do. Ideally, power industry, not as an engineer but as a high level businessman with a grasp on the science.\u003C/p\u003E\u003Cp\u003EI\u0027m not really sure if I would be able to change majors so drastically as D and E would suggest, but I am open to any thoughts. Feedback appreciated. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"theend3r","CreatedById":97560,"CreatedDateTime":"2015-05-21T07:16:41Z","Content":"\n\u003Cp\u003E\u003Cem\u003E\u0022Education is what remains after one has forgotten what one has learned in school.\u0022\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EPhysics would probably be better, Jack Welch also graduated in chemical engineering, not business.\u003C/p\u003E\u003Cp\u003EMy personal opinion is that \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E sounds good.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-21T07:22:03Z\u0022 title=\u002205/21/2015 07:22  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 21, 2015\u003C/time\u003E by theend3r\u003C/strong\u003E\n\u003C/span\u003E\n"}]}