{"TopicId":110143,"ForumId":16,"TopicTitle":"How well does the game model exhaust impacting your own spacecraft?","CreatedByName":"PTNLemay","CreatedById":30142,"CreatedDateTime":"2015-05-20T20:41:02Z","PageNum":1,"Articles":[{"CreatedByName":"PTNLemay","CreatedById":30142,"CreatedDateTime":"2015-05-20T20:41:02Z","Content":"I came up with an idea for a ship that could use a heat-shield large enough to cover the whole ship, yet still have engines to move around. I didn\u0027t trust putting the shield on the nose (also it would look weird) so I came up with this design.\n\n[http://i.imgur.com/8MdVjON.png](http://i.imgur.com/8MdVjON.png)\n\nAs you can see the exhaust from the engines just clips the edges of the shield... Will this hinder some of my thrust? Also will it cause the shield to overheat when I burn for long periods? (*and yes, I realize I put the fairing-base on the wrong side of the decoupler...*)\n\n**Edited \u003Ctime datetime=\u00222015-05-20T21:00:34Z\u0022 title=\u002205/20/2015 09:00  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 20, 2015\u003C/time\u003E by PTNLemay**"},{"CreatedByName":"Reddeyfish","CreatedById":142160,"CreatedDateTime":"2015-05-20T20:44:57Z","Content":"open up the flight log. If you\u0027ve been firing the engines and you don\u0027t have any \u0022\u003Cpart name=\u0022\u0022\u003E was damaged by engine exhaust from \u003Cengine\u003E\u0022, then there is no thrust loss and there is no extra heating.\u003C/engine\u003E\u003C/part\u003E"},{"CreatedByName":"Foxster","CreatedById":113764,"CreatedDateTime":"2015-05-20T20:48:08Z","Content":"Don\u0027t think you will lose thrust from the chance of hitting the shield. Generally, either engines are completely blocked or not at all. \n\nWhere you will lose thrust is because the engines aren\u0027t pointed at the back. Angling engines like that always knobbles their performance. \n\nPlus you might get the fairing cooked by the engines and have it overheat and explode."},{"CreatedByName":"PTNLemay","CreatedById":30142,"CreatedDateTime":"2015-05-20T21:00:23Z","Content":"Hmm, doesn\u0027t look like it\u0027s damaging anything. Good to know.\n\nOn another note, I have learned without a doubt that the shroud base is a stabilization nightmare. [http://i.imgur.com/6rccJ0T.png](http://i.imgur.com/6rccJ0T.png)\n\nIt works much better with only the heat-shield."},{"CreatedByName":"Anglave","CreatedById":62706,"CreatedDateTime":"2015-05-20T22:30:14Z","Content":"A reentering craft will tend to lead with its center of mass.\n\nI suspect you\u0027re having trouble reentering your design with the shield leading because it\u0027s not near the CoM."},{"CreatedByName":"THX1138","CreatedById":113955,"CreatedDateTime":"2015-05-21T13:19:04Z","Content":"I think this design is wasteful because part of the thrust vector is cancelled out between engines. Instead of carrying heat shields around everywhere you go, why not leave some in LKO and dock to them prior to re-entry? (assuming you\u0027re not using it to enter the atmosphere of another planet) If you do need to carry it around, I\u0027d still carry it on the front by docking port and then move it to the back prior to re-entry."},{"CreatedByName":"PTNLemay","CreatedById":30142,"CreatedDateTime":"2015-05-21T15:13:24Z","Content":"\u003E \n\u003E why not leave some in LKO and dock to them prior to re-entry? (assuming you\u0027re not using it to enter the atmosphere of another planet)\n\nYes, unfortuantely that is the plan. I wanted to use something like this for one of the 4-planet missions, where I have to visit both Duna and Eve in a single run. Aerobreaking would be very very advantageous in a situation like this.\n\n\u003E \n\u003E If you do need to carry it around, I\u0027d still carry it on the front by docking port and then move it to the back prior to re-entry.\n\n Hmm... that\u0027s actually not a bad idea. Really I only need to include a small maneuvering unit on the shield. Or even just a reaction wheel to keep it level and have the ship do the maneuvering.\nThough I do sort of like the aesthetic of it... the angled engines look a bit silly, but they\u0027re growing on me."}]}