{"TopicId":11015,"ForumId":21,"TopicTitle":"Vertical launch horizontal landing shuttle [0.15 stock]","CreatedByName":"sneakeypete","CreatedById":3989,"CreatedDateTime":"2012-05-20T13:57:55Z","PageNum":1,"Articles":[{"CreatedByName":"sneakeypete","CreatedById":3989,"CreatedDateTime":"2012-05-20T13:57:55Z","Content":"After leaning that rotated craft in the Space plane Hangar launch rotated, i realized it was that we now have an easier way to build shuttles with the symmetry option in there. After a few hours tinkering around i came up with this basic design, modeled off of the space shuttle.\n\n\u003E \n\u003E ![SpaceplaneMK2showcase1.jpg](http://i38.photobucket.com/albums/e149/thesneakster/SpaceplaneMK2showcase1.jpg)\n\u003E \n\u003E ![SpaceplaneMK2showcase2.jpg](http://i38.photobucket.com/albums/e149/thesneakster/SpaceplaneMK2showcase2.jpg)\n\u003E \n\u003E \n\n**Description and Takeoff**\n\nThe shuttle\\\u0027s main body has 3 gimballing engines, fed by a strap-on fuel tank, as well as 2 strap on boosters for takeoff thrust.\n\nObviously, balance is quite an issue. To keep the thrust somewhat inline with the center of mass, the \u0027top\u0027 of the 3 gimballing engines does not fire at the start. SAS should be engaged to fly the craft, and manual input to keep the craft facing vertical during flight may also be required.\n\n The craft is stable until approximately halfway through the second tank of the strap on boosters where upon the centre of mass varies to much. Jettisoning the boosters (after killing thrust temporarily) is advised. After this point, the craft should again be stable, and as it is getting to the upper atmosphere, tilt over and start to gain some more horizontal momentum. partway through the last tank of the strap on fuel, the craft should again become unstable, but this can be used to tilt over into an orbital direction if you\\\u0027re tricky. Upon jettisoning the strap on tank (again, killing thrust is advised), the final engine on the main craft can then be activated to give uniform thrust on the shuttle body. Simply boost into a ballistic trajectory with an apoapsis of \u003E70km, and circularize when you get there.\n\nCurrently, there won\\\u0027t be much fuel to spare at this point, so trips further afield aren\\\u0027t possible, and if the wrong flight path is taken on the way up you might not be able to achieve orbit.\n\n\u003E \n\u003E ![ShuttleMK2sunset.jpg](http://i38.photobucket.com/albums/e149/thesneakster/ShuttleMK2sunset.jpg)\n\u003E \n\u003E \n\n**Landing**\n\nThe craft can be landed as a glider upon reentry. It is advisable to use SAS to hold the craft pointing towards its direction of travel, as due to its instability if it is pointed more than around 30 degrees from the direction of travel it may back-flip. Its twitchy flight handing characteristics make it difficult to land. I\\\u0027ve found holding the nose at an angle of attack of around 20-25 degrees with SAS on the glide in approach is required to have minimal vertical velocity. upon contact with the ground, stage to activate the parachute brakes. With luck you\\\u0027ll have the shuttle ready to refuel and reuse. With a little less luck you might have a spectacular explosion but otherwise unharmed Kerbals.\n\n\u003E \n\u003E ![ShuttleMK2approach.jpg](http://i38.photobucket.com/albums/e149/thesneakster/ShuttleMK2approach.jpg)\n\u003E \n\u003E ![ShuttleMK2landing.jpg](http://i38.photobucket.com/albums/e149/thesneakster/ShuttleMK2landing.jpg)\n\u003E \n\u003E \n\n**Further Improvement**\n\nBy disabling the flow of certain tanks until later in the ascent, the stability of the rocket might be maintained for longer, allowing more fuel to be burnt from the tanks which otherwise need to be jettisoned full right now. Reducing the boosters by a single tank (or perhaps just replacing them with 2 sequential pairs of SRB\\\u0027s) and changing the non fuel structure parts in the shuttle to fuel tanks would also probably result in a much better design. I may make a revision of the design in the future.\n\nComments, criticism and questions welcome, enjoy."},{"CreatedByName":"Kreuzung","CreatedById":21035,"CreatedDateTime":"2012-05-20T14:04:18Z","Content":"We can rotate SHIPS and not only parts?"},{"CreatedByName":"RC1062","CreatedById":10709,"CreatedDateTime":"2012-05-20T14:05:38Z","Content":"\u003E \n\u003E We can rotate SHIPS and not only parts?\n\nYup. Grab the cockpit and rotate."},{"CreatedByName":"sneakeypete","CreatedById":3989,"CreatedDateTime":"2012-05-20T14:13:01Z","Content":"I just found a better way to use this. Instead of Jettisoning the boosters once the ship becomes unstable, bring forward the firing of the last main shuttle engine. This re-balances the forces, although it uses up the strap-on fuel tank before the boosters. adding another fuel tank onto that stack would probably fix that, So maybe i\\\u0027ll do a new Mark in the morning.\n\nAfter Further testing i\\\u0027ve determined that landing this without exploding is almost impossible, the amount of weight clustered at the rear causes the angle of attack to be so high that the engines hit the ground first, exploding everything."},{"CreatedByName":"Kreuzung","CreatedById":21035,"CreatedDateTime":"2012-05-20T14:48:18Z","Content":"That\\\u0027s why I use parachutes as landing support. It\\\u0027s a bit tricky to fly with chutes out but works."},{"CreatedByName":"RC1062","CreatedById":10709,"CreatedDateTime":"2012-05-20T19:54:00Z","Content":"\u003E \n\u003E I just found a better way to use this. Instead of Jettisoning the boosters once the ship becomes unstable, bring forward the firing of the last main shuttle engine. This re-balances the forces, although it uses up the strap-on fuel tank before the boosters. adding another fuel tank onto that stack would probably fix that, So maybe i\\\u0027ll do a new Mark in the morning.\n\u003E \n\u003E After Further testing i\\\u0027ve determined that landing this without exploding is almost impossible, the amount of weight clustered at the rear causes the angle of attack to be so high that the engines hit the ground first, exploding everything.\n\nYou could try altering the angle of the wings so they point down (Hmm... That\\\u0027ll be odd... Though I think the real shuttle had wings like that...)\n\n\\*EDIT\\* They do slope slightly down..."},{"CreatedByName":"sneakeypete","CreatedById":3989,"CreatedDateTime":"2012-05-21T00:30:24Z","Content":"Success!\n\n\u003E ![ShuttleMK2landing2.jpg](http://i38.photobucket.com/albums/e149/thesneakster/ShuttleMK2landing2.jpg)"},{"CreatedByName":"jinxville","CreatedById":23428,"CreatedDateTime":"2012-05-21T00:50:37Z","Content":"\u003E \n\u003E Yup. Grab the cockpit and rotate.\n\nwow you just made my day, i hadn\\\u0027t thought of that. 8)"},{"CreatedByName":"RC1062","CreatedById":10709,"CreatedDateTime":"2012-05-21T16:05:39Z","Content":"\u003E \n\u003E wow you just made my day, i hadn\\\u0027t thought of that. 8)\n\nNeither had I. ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)"},{"CreatedByName":"Kosmo-not","CreatedById":14082,"CreatedDateTime":"2012-05-21T16:24:55Z","Content":"You can also transfer the craft file to the VAB folder if you want to launch from the launchpad."}]}