{"TopicId":110137,"ForumId":70,"TopicTitle":"LV-N Atomic Rocket Motor Not transferring heat","CreatedByName":"The Pav","CreatedById":138747,"CreatedDateTime":"2015-05-20T19:55:01Z","PageNum":1,"Articles":[{"CreatedByName":"The Pav","CreatedById":138747,"CreatedDateTime":"2015-05-20T19:55:01Z","Content":"KSP 1.0.2 Windows 32 bit\n\nProblem: LV-N \u0022Nerv\u0022 Atomic rocket motor retains ALL heat. Parts it\u0027s attached to stay cool with no transference. Causes Atomic rocket motor to overheat and explode before 500 DeltaV burn can complete even.\n\nMods Installed:\n\nTextureReplacer-2.4.4\n\nPlanetShine-0.2.3.1\n\nEnvironmentalVisualEnhancements-7-4-LR\n\nDistant\\_Object\\_Enhancement\\_bis-v1.5.5\n\nAstronomer\u0027s Visual Pack - Interstellar V2 (only a few effects, not the large memory intensive ones, such as clouds or auroras)\n\nB9\\_Aerospace\\_Pack-R5.2.8\n\nActive Texture Management Basic-Release\n\nChatterer-0.9.1\n\nCRP\\_0.4.2\n\nUSI Explorer pack ExpPack\\_0.4.0\n\nFerram\\_Aerospace\\_Research-v0.15.1\\_Fanno\n\nFilter.Extensions.v2.1.3\n\nFirespitter\\_7.1.2 (no parts, .dll only)\n\nHyperEdit-1.4\\_for-KSP-1.0\n\nInfernalRobotics.0.21.2\n\nKAS\\_v0.5.1\n\nKerbal\\_Joint\\_Reinforcement-v3.1.3\n\nKerbalAlarmClock\\_3.3.1.1\n\nKIS\\_v1.1.4\n\nKSP\\_Interstellar\\_Extended-1.1.7\n\nKSP-AVC-1.1.5.0\n\nMechJeb2-2.5.1.0\n\nOuter\\_Planets\\_Mod-1.7\\_Beta\\_1\n\nRasterPropMonitor-v0.19.3\n\nRemoteTech-1.6.5\n\nScience\\_Funding-1.1.1\n\nSmartParts-1.6.5\n\nTacLifeSupport\\_0.11.1.20\n\nTweakScale\\_-\\_Rescale\\_Everything-v2.1\n\nUSITools\\_0.4.1\n\nReproduction Steps: Build a craft utilizing LV-N Atomic Rocket Motor and attempt a long burn (such as to reach another planet). Heat overlay indicates no heat is transferring to attached parts and all is retained by engines.\n\nLog:\n\nNone generated unless I\u0027m missing something. Please advise.\n\nDebug menu indicated only 1082 Mb Used memory, 1182 Mb Reserved memory, 104 Mb Unused Reserved.\n\nI\u0027m not sure how to record a video of it, but if I can get some advice as to how, I\u0027d be happy to."},{"CreatedByName":"Requia","CreatedById":112924,"CreatedDateTime":"2015-05-20T20:11:43Z","Content":"Somebody on the KSPI thread mentioned that the waste-heat and new heating mechanics seem to be conflicting, I\u0027d try pulling that (if you have any idea how,please share, game freezes when I try)."},{"CreatedByName":"The Pav","CreatedById":138747,"CreatedDateTime":"2015-05-20T20:13:33Z","Content":"It may have been me. I posted there too because I suspected that was the issue since both are using heat systems which don\u0027t work the same way. What\u0027s a freeware way to record and post video? I\u0027ve never done that."},{"CreatedByName":"The Pav","CreatedById":138747,"CreatedDateTime":"2015-05-21T03:39:42Z","Content":"Ok, it IS caused by KSPI extended configuration. It\u0027s a temporary problem until FreeThinker integrates the the two heat systems or converts the Interstellar heat system to stock. I edited the engine part config file to produce 1/3 as much heat as a temporary measure so I can keep playing until it\u0027s fixed. It still gets hot, but won\u0027t instantly explode."}]}