{"TopicId":110189,"ForumId":16,"TopicTitle":"I cannot warp in low jool orbit due to a constant very very small acceleration.","CreatedByName":"nhnifong","CreatedById":12196,"CreatedDateTime":"2015-05-21T02:18:05Z","PageNum":1,"Articles":[{"CreatedByName":"nhnifong","CreatedById":12196,"CreatedDateTime":"2015-05-21T02:18:05Z","Content":"\n\u003Cp\u003EI\u0027ve turned off all engines, and I have observed this with two different ships. The only thing to do is put it on max physics warp and wait until you are in a higher orbit and the acceleration drops down.\u003C/p\u003E\u003Cp\u003EIs there some cfg I can change to disable this warning?\u003C/p\u003E\n"},{"CreatedByName":"The Destroyer","CreatedById":36109,"CreatedDateTime":"2015-05-21T02:26:58Z","Content":"\n\u003Cp\u003EI\u0027ve experienced this too, oddly. Not sure what causes it.\u003C/p\u003E\n"},{"CreatedByName":"nhnifong","CreatedById":12196,"CreatedDateTime":"2015-05-21T04:55:05Z","Content":"\n\u003Cp\u003EFor a moment I though squad had added orbital decay - until I realized my apo was rising.\u003C/p\u003E\n"},{"CreatedByName":"Jonboy","CreatedById":134111,"CreatedDateTime":"2015-05-21T05:49:34Z","Content":"\n\u003Cp\u003EI\u0027ve noticed this as well. It seems to allow you to time warp as regular, but if you drop out of warp too close to Jool, you will be forced to use only physics time warp until you are a long ways out from the planet. All of this when you are not actually in the atmosphere. It\u0027s very annoying.\u003C/p\u003E\n"},{"CreatedByName":"Mastikator","CreatedById":135309,"CreatedDateTime":"2015-05-21T12:04:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022nhnifong\u0022 data-cite=\u0022nhnifong\u0022\u003E\u003Cdiv\u003EFor a moment I though squad had added orbital decay - until I realized my apo was rising.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWait you were actually getting free energy?\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-05-21T12:20:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mastikator\u0022 data-cite=\u0022Mastikator\u0022\u003E\u003Cdiv\u003EWait you were actually getting free energy?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t think so. The situation I have is as follows:\u003C/p\u003E\u003Cp\u003E1. Coming in for an aerocapture or maybe an aerobrake to intercept a moon, I can use regular warp all the way down until I hit the atmosphere. I can even stop the warp very close to Jool, tweak my Pe a bit, and then resume warping.\u003C/p\u003E\u003Cp\u003E2. I can physics warp within the atmosphere.\u003C/p\u003E\u003Cp\u003E3. Once out of the atmosphere again, I go to zero warp to switch from physical back to normal warp. But it won\u0027t let me do regular warp, saying the ship is under acceleration. This effect lasts for a considerable distance above the top of the atmosphere. While using physics warp to get this over with quickly, I do not observe any changes in my Ap.\u003C/p\u003E\u003Cp\u003EIt appears to me that the game is confused about when you leave the atmosphere. The effects on your trajectory of being in the atmosphere go away when they\u0027re supposed to, but the game still treats you as if you\u0027re in the atmosphere for warp purposes. And I agree, it\u0027s totally annoying.\u003C/p\u003E\u003Cp\u003EEDIT: This problem is on the bug tracker already. I confirmed it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-21T12:30:32Z\u0022 title=\u002205/21/2015 12:30  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 21, 2015\u003C/time\u003E by Geschosskopf\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Lukaszenko","CreatedById":95776,"CreatedDateTime":"2015-05-21T13:12:34Z","Content":"\n\u003Cp\u003EI have this too, with multiple ships. Right below 1000 km you can\u0027t toggle warp anymore. I have to make all corrections before then, and then warp to just above the atmosphere.\u003C/p\u003E\u003Cp\u003EAnd then my ship usually gets destroyed \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"}]}