{"TopicId":110209,"ForumId":16,"TopicTitle":"Ore return contract","CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-05-21T09:44:07Z","PageNum":1,"Articles":[{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-05-21T09:44:07Z","Content":"\n\u003Cp\u003ESo, after I unlocked ISRU tech, I immediately sent a mission to set up ISRU on Minmus.\u003C/p\u003E\u003Cp\u003EShortly thereafter, I got a contract to return ore from minmus - so I accepted.\u003C/p\u003E\u003Cp\u003EWhereas: \u003C/p\u003E\u003Cp\u003E* my ISRU\u002B tanker operation is not set up to survive rentry to Kerbin - and even if it was, I don\u0027t want to have to launch a new base just for that,\u003C/p\u003E\u003Cp\u003E* I\u0027ve read some people having issues with ore tanks exploding when setting them down on kerbin with parachutes\u003C/p\u003E\u003Cp\u003E* I rely mostly on SSTOs now\u003C/p\u003E\u003Cp\u003EI decided that I\u0027d simply launch an SSTO with an internal ore tank, and then after a docking even, transfer ore into it, and recover the SSTO...\u003C/p\u003E\u003Cp\u003EBut I\u0027m wondering if the contract will recognize this as completing the contract.\u003C/p\u003E\u003Cp\u003EI\u0027m concerned that doing a resource transfer of docked craft will result in the ore in the SSTO not being considered as being freshly derived from Minmus.\u003C/p\u003E\u003Cp\u003ECan anyone advise me?\u003C/p\u003E\n"},{"CreatedByName":"FancyMouse","CreatedById":142946,"CreatedDateTime":"2015-05-21T09:59:13Z","Content":"\n\u003Cp\u003EResources don\u0027t have launchID tracked so they\u0027re fine. The only place where it could screw up is when you dock with the ISRU tanker, which is launched before the contract. Not sure whether this will contaminate your SSTO with the old ID (so that after docking it might be recognized as old) - I\u0027m just suspecting. No evidence for either side. I guess it should be fine, but I\u0027m not confident myself (and didn\u0027t get a chance yet to have a try)\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2015-05-21T11:46:40Z","Content":"\n\u003Cp\u003EFunny how you only think about something when questioned about it ... I have no clue how the game decides if the ore is from Minmus - worst case: it wants you to build a whole new rig, in which case the contract is description might be misleading. Maybe the designer had in mind to first send the player to build a base and later to have him add a mining rig and return some ore (in a tank that was launched at the same time).\u003C/p\u003E\n"},{"CreatedByName":"kulkan1","CreatedById":143911,"CreatedDateTime":"2015-05-21T13:14:20Z","Content":"\n\u003Cp\u003EWhat exactly does the contract ask of you?\u003C/p\u003E\u003Cp\u003EDoes it sound like this:\u003C/p\u003E\u003Cp\u003E\u0022- Mine x amount of ore from Minmus\u0022\u003C/p\u003E\u003Cp\u003E\u0022- Have x amount of ore in craft\u0022\u003C/p\u003E\u003Cp\u003E\u0022- Landed on Kerbin\u0022\u003C/p\u003E\u003Cp\u003EOr is it simply \u0022- Orbiting Kerbin\u0022? I have seen a lot of contracts that just requires you to be in orbit for a ore return contract. Even though it\u0027s named \u0022Return ore to Kerbin\u0022, it might just ask you to deliver it to orbit. But if it sounds like the criterias I listed, then it shouldn\u0027t be a problem. I have a stationary mining base on Minmus, and for the \u0022return ore to kerbin orbit\u0022 contracts, I just have a designated ore lifter which I send out of Minmus SOI, and then right back after being in Kerbin SOI for 10 seconds. Not sure if it works in a special way because I have the vehicles docked while mining, but I think I remember it working after transferring the ore over too.\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-05-23T21:47:46Z","Content":"\n\u003Cp\u003ETL:DR version- The game doesn\u0027t care where the ore is from. Just mine the amount needed from the target, and you can spawn a new vessel with ore, have it do a 2 meter hop, and complete the contract.\u003C/p\u003E\u003Cp\u003ESo... I launched a craft to go to minmus and collect the ore, to bring back to kerbin....\u003C/p\u003E\u003Cp\u003EI had 1 condition checked: Mine 500 units of ore from minmus\u003C/p\u003E\u003Cp\u003EThe next condition: have 500 units of ore in your cargohold (My ISRU operation didn\u0027t have that much... because.. conversion and all, but I could easily get it)\u003C/p\u003E\u003Cp\u003ENext condition: land the ore (?) 500 units of ore (?) on Kerbin\u003C/p\u003E\u003Cp\u003ENext: maintain stability for 10 seconds...\u003C/p\u003E\u003Cp\u003EI wondered... after the first condition completes, could I just launch a vessel with 500 ore, and immediately recover it to complete?\u003C/p\u003E\u003Cp\u003ESo I filled up some ore tanks in the VAB... I got the 500 in cargohold checked, but not the landed on Kerbin condition.\u003C/p\u003E\u003Cp\u003EI attached some basic jet engines, got up a few meters, and set back down: CHECK!\u003C/p\u003E\u003Cp\u003E10 game seconds later, all conditions were met, and the contract was completed.\u003C/p\u003E\n"}]}