{"TopicId":11041,"ForumId":32,"TopicTitle":"The true origin of Minmus.","CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2012-05-20T18:18:32Z","PageNum":1,"Articles":[{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2012-05-20T18:18:32Z","Content":"\n\u003Cp\u003EKerbin\\\u0027s government would have us believe an entire \u003Cem\u003Emoon\u003C/em\u003E has lain hidden from the population for centuries, that it is some kind of captured \u003Cem\u003Eice comet\u003C/em\u003E, when everyone knows any moon worth it\\\u0027s tidal forces is good hard \u003Cem\u003Erock.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EThe \u003Cem\u003EKerbol\\\u0027s\u003C/em\u003E trusty tabloid reporters have spent hundreds of seconds researching this story, and have found that a \u003Cem\u003Esecret organization\u003C/em\u003E known only by the mysterious name of \u003Cem\u003ESquad\u003C/em\u003E has been working behind the scenes, and has ties to the \u003Cem\u003Eice cream mafia\u003C/em\u003E.\u003C/p\u003E\u003Cp\u003ESecret night launches of heavy, black painted rockets, and the sudden rise in price of mint softscoop can only mean one thing, Minmus is \u003Cem\u003Emade\u003C/em\u003E of ice cream!\u003C/p\u003E\u003Cp\u003EThe evidence is damming, the Kerbol has examined the images released by the \u0027Space Program\u0027 and it\\\u0027s clear this \u0027new moon\u0027 is Kerman made, most likely with tools similar to \u003Ca href=\u0022https://en.wikipedia.org/wiki/File:Kitchen-Scooper-Large.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ethis!\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThis image clearly shows the scoop marks in this hastily assembled \u003Cem\u003Emoon\u003C/em\u003E.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote class=\u0022ipsStyle_spoiler\u0022 data-ipsspoiler=\u0022\u0022 tabindex=\u00220\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/mFS9H.jpg\u0022 alt=\u0022mFS9H.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EFurther evidence in the photo above is the lack of stars, everyone knows there\\\u0027s stars in space right?, just look up at night, unless it\\\u0027s cloudy!\u003C/p\u003E\u003Cp\u003EAnd there\\\u0027s more! Why are the Kerbals in every photo wearing helmets? Is it to protect them from the lack of air? \u003Cstrong\u003ENO,\u003C/strong\u003E it\\\u0027s to protect them from the smell of mint or they\\\u0027d be too tempted to start \u003Cem\u003Eeating\u003C/em\u003E Minmus! Have you ever seen a Kerman with a \u003Cem\u003Espoon\u003C/em\u003E in any official photo? \u003Cstrong\u003EMore evidence!\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThe Kerbols diligent reporters say that it\\\u0027s \u003Cem\u003Equite likely\u003C/em\u003E the mysterious \u003Cem\u003ESquad\u003C/em\u003E like ice cream, the links just keep adding up! There\\\u0027s even telling reports from ex-kerbolnauts cleaners that they overheard the first ever Minmus landing took place in an \u003Cem\u003Eice cream factory!\u003C/em\u003E\u003C/p\u003E\u003Cp\u003ESo far the mysterious \u003Cem\u003ESquad\u003C/em\u003E have made no comment \u003Cem\u003Econfirming\u003C/em\u003E or \u003Cem\u003Edenying\u003C/em\u003E these allegations, yet more proof!\u003C/p\u003E\u003Cp\u003ENew evidence comes to light! This recently declassified \u003Ca href=\u0022http://i.imgur.com/l3eNp.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ephoto\u003C/a\u003E shows this \u0027moon\u0027 has begun to melt! Are our \u003Cem\u003Emoons\u003C/em\u003E not safe from the global warming menace as well?!\u003C/p\u003E\n"},{"CreatedByName":"Orange7093","CreatedById":11179,"CreatedDateTime":"2012-05-20T18:21:04Z","Content":"\n\u003Cp\u003EI like my ice cream fresh, Not full of space pebbles and dust that has been sitting there for billions of years :L\u003C/p\u003E\n"},{"CreatedByName":"VincentMcConnell","CreatedById":14492,"CreatedDateTime":"2012-05-20T18:32:49Z","Content":"\n\u003Cp\u003EFunny how we had the same reaction to Minmus. The first time I saw it, I said it looked like a ball of Mint icecream.\u003C/p\u003E\n"},{"CreatedByName":"glugg23","CreatedById":26082,"CreatedDateTime":"2012-05-20T18:36:50Z","Content":"\n\u003Cp\u003EI have to laugh at this! ;P =P\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2012-05-20T18:39:18Z","Content":"\n\u003Cp\u003EVincent, I think some people take the world of Kerbal Space Program far too seriously, even going so far as to discuss the history of a lumpy green icy moon that was plonked down into the game only days ago.\u003C/p\u003E\u003Cp\u003EI think it\\\u0027s pretty safe to assume at this point that the Kerbol star system has no relation to Sol, HarvesteR and the team can be inventive, but I\\\u0027m also pretty sure Harv likes his mint flavoured icy treats \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Cykyrios","CreatedById":17639,"CreatedDateTime":"2012-05-20T18:47:34Z","Content":"\n\u003Cp\u003EHaha, that was a good one \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs long as people come up with theories but don\\\u0027t start saying \u0027This is the TRUE reason for X or Y\u0027 there\\\u0027s no problem at all; I personally like the ice cream theory, although I doubt there was enough to create a 60-km-diameter ball of ice cream...\u003C/p\u003E\u003Cp\u003EI guess I\\\u0027ll have to make a spoon part and launch a rocket to try mining Munmis \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Twinky827","CreatedById":17455,"CreatedDateTime":"2012-05-20T18:50:30Z","Content":"\n\u003Cp\u003Elooks like rocky, icy popcorn..\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2012-05-20T19:16:51Z","Content":"\n\u003Cp\u003ENew evidence comes to light! This recently declassified \u003Ca href=\u0022http://i.imgur.com/l3eNp.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ephoto\u003C/a\u003E shows this \u0027moon\u0027 has begun to melt! Are our \u003Cem\u003Emoons\u003C/em\u003E not safe from the global warming menace as well?!\u003C/p\u003E\n"}]}