{"TopicId":110475,"ForumId":16,"TopicTitle":"Career SSTO\u0027s","CreatedByName":"Good_Cat","CreatedById":137286,"CreatedDateTime":"2015-05-23T12:23:53Z","PageNum":1,"Articles":[{"CreatedByName":"Good_Cat","CreatedById":137286,"CreatedDateTime":"2015-05-23T12:23:53Z","Content":"I\u0027ve tried building a few SSTO\u0027s in career I\u0027ve jumped forward to unlock the turbo jets and have a few parts mods installed but struggling to get them into orbit, its either my TWR is below 1 so i cant break the sound barrier and keep accelerating or i don\u0027t have enough delta v.\n\nI can go much smaller but then i don\u0027t have any cargo or passenger capacity.\n\nIn the end i mashed to two together and jammed on a launch stage from the runway ( because i least i got some from the runway to space and its a plane but i used a rocket, so almost there.)\n\nAnybody got any pics of not massive but smallish with a either a passenger or cargo capability.\n\nThis was my passenger.\n\n![ZsQc5X9.jpg](http://i.imgur.com/ZsQc5X9.jpg)\n\nAnd here\u0027s the mash up of the cargo and passenger attached to a very early weedy KSS, destined never to climb out of Kerbal\u0027s atmosphere on it own power. Does make a good looking SOI runaround though.\n\n![OEyCWyY.png](http://i.imgur.com/OEyCWyY.png)"},{"CreatedByName":"Chaos_Klaus","CreatedById":140720,"CreatedDateTime":"2015-05-23T13:00:39Z","Content":"There is a few things that changed with 1.0:\n\nAir breathing engines lose thrust at a certain altitude, even if you have enough intake air. So spamming intakes is no longer useful.\n\nThat also means that you need to use your rocket engines earlier and need to bring more oxidizer.\n\nToo many wings will induce a lot of drag. From what I read in the Squadcast Summary, there is a bug with part occlusion that generates more drag then intended. Don\u0027t know if that applies to wings. From what I see in the screenshots, you don\u0027t have too many wings though. (I think)\n\nIf you have trouble breaking the soundbarrier, do the following. Climb to a high altitude, gain as much speed as you can, then go into a light dive to gain more speed. That way you can breach th sound barrier without additional engine power. When you reach mach 1.2, drag will decrease again."},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2015-05-23T14:44:37Z","Content":"This is a RAPIER/Nuke design, but if you take the airframe and convert it to turbojets and LV-T45\u0027s it should work for you.\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/E2XwW)\n\nCraft file at [https://www.dropbox.com/s/re2mmiimpcy5d55/Kerbodyne%20Triskenne.craft?dl=0](https://www.dropbox.com/s/re2mmiimpcy5d55/Kerbodyne%20Triskenne.craft?dl=0)"}]}