{"TopicId":110425,"ForumId":51,"TopicTitle":"PROJECT GERONIMO - Ongoing tale of redemption, snacks, explosions and stupidity","CreatedByName":"VelocityPolaris","CreatedById":101162,"CreatedDateTime":"2015-05-22T22:30:03Z","PageNum":1,"Articles":[{"CreatedByName":"VelocityPolaris","CreatedById":101162,"CreatedDateTime":"2015-05-22T22:30:03Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022screenshot615.png\u0022 alt=\u0022screenshot615.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAND WE HAVE LIFTOFF, of the KSEV-5305 Geronimo, the first step into crewed Interplanetary Space for the Kerbal race, carrying hopefully brave Callie, Mauya, Matsted, Obler and Gicella Kerman with it! The Geronimo will advance the frontier of modern science, earn the redemption of the peoples of Kerbin after that nasty incident where we lost Jeb Bill Bob and Val, and change the world as we know it! \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022screenshot617.png\u0022 alt=\u0022screenshot617.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s speeding up, faster and faster! Nothing will stop us from achieving our rightful place in the stars!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022screenshot618.png\u0022 alt=\u0022screenshot618.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EOh... Ok, let\u0027s try that one again, shall we?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022screenshot620.png\u0022 alt=\u0022screenshot620.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAS I WAS SAYING... We have liftoff! of the KSEV-5305 Geronimo, the first step into crewed Interplanetary Space for the Kerbal race, carrying...\u003C/p\u003E\u003Cp\u003EIt\u0027s achieved orbit... mission control has given the go to decouple the side boosters!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022screenshot623.png\u0022 alt=\u0022screenshot623.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EOh... darn. Weeeell... Don\u0027t mind me, I\u0027m just reloading the save file...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022screenshot620.png\u0022 alt=\u0022screenshot620.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EANYWAY... KSEV-something Geronimo, first step crewed interplanetary Kerbal, caring...\u003C/p\u003E\u003Cp\u003EMEANWHILE ABOARD THE GERONIMO...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022screenshot621.png\u0022 alt=\u0022screenshot621.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EOk guys, flight wants you to try not to screw up again, ok?\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EObler: On it! Ok guys, any ideas?\u003C/p\u003E\u003Cp\u003EMatsted: Not sure, the entire system is integrated and we have to decouple those side boosters...\u003C/p\u003E\u003Cp\u003EMauya: What if we turned off the SRB\u0027s, so it didn\u0027t slice the ship in half whenever we decouple?\u003C/p\u003E\u003Cp\u003EGicella: That could, work, actually!\u003C/p\u003E\u003Cp\u003EMatsted: Why didn\u0027t I think of that... So how do we get past the boosters? They\u0027re still going to flip round and hit us, SRB powered or not.\u003C/p\u003E\u003Cp\u003ECallie: Seriously, whoever designed this thing...\u003C/p\u003E\u003Cp\u003EObler: We could try to slide past them on RCS. What do you think, Callie?\u003C/p\u003E\u003Cp\u003ECallie: Why are you asking me? \u003C/p\u003E\u003Cp\u003EObler: You\u0027re the pilot?\u003C/p\u003E\u003Cp\u003ECallie: oh, right. Yeah, that might work.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003ECapcom: Hate to interrupt guys, but it\u0027s time to decouple those side boosters.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EMatsted: Right... hopefully we don\u0027t sever the propulsion section this time.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022screenshot626.png\u0022 alt=\u0022screenshot626.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EObler: Phew! Right, great work everyone.\u003C/p\u003E\u003Cp\u003ECallie: Mission Control we\u0027ve established orbit and decoupled side boosters, what\u0027s the plan now?\u003C/p\u003E\u003Cp\u003E...\u003C/p\u003E\u003Cp\u003ECallie: Mission Control?\u003C/p\u003E\u003Cp\u003EMauya: Not reading anything on the radio dishes...\u003C/p\u003E\u003Cp\u003EGicella: Look out the window.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022screenshot637.png\u0022 alt=\u0022screenshot637.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EMatsted: Fantastic... the comm arrays are gone. Must have brushed with the boosters on decoupling.\u003C/p\u003E\u003Cp\u003ECallie: I am going to strangle whoever designed this ship. Can we come out of our straps now? My jaws feel all loose and funny...\u003C/p\u003E\u003Cp\u003EObler: Sure, everyone undo your seatbelts.\u003C/p\u003E\u003Cp\u003ECallie: Ah, that\u0027s betaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa!\u003C/p\u003E\u003Cp\u003EObler: What?\u003C/p\u003E\u003Cp\u003EMauya: I think... I\u0027m... going to barf...\u003C/p\u003E\u003Cp\u003ECallie: Me- *HURK*\u003C/p\u003E\u003Cp\u003EObler: Ah geep. BARF BAGS! \u003C/p\u003E\u003Cp\u003EObler grabs several barf bags from under his seat and passes them around, where the other four crew unsuccesfully attempt to grab them, their hands reaching just short.\u003C/p\u003E\u003Cp\u003EMatsted: GAH my eyes feel weird, I can\u0027t see [redacted]!\u003C/p\u003E\u003Cp\u003EGicella: WHERE\u0027S THE SPACE TOILET?!\u003C/p\u003E\u003Cp\u003EObler gestures toward a hatch at the bottom of the spacecraft.\u003C/p\u003E\u003Cp\u003EObler: In the hab below the main room, there\u0027s two of them. Why is everyone sick all of the sudden?\u003C/p\u003E\u003Cp\u003EMatsted: I DONT KNOW \u003C/p\u003E\u003Cp\u003ECallie: *Hurk* gah, maybe bacteria snuck on board and they\u0027re killing us!\u003C/p\u003E\u003Cp\u003EGicella (On way to toilet): It\u0027s called space sickness, idiot! Our perspectives all took a big hit, and now our bodies are having an allergic reac*HURK*\u003C/p\u003E\u003Cp\u003EMatsted: I can\u0027t see, what\u0027s up, why do I feel w*HURK*\u003C/p\u003E\u003Cp\u003EObler: Oh kod, did I leave the flight recorder camera on? TURN IT OFF! THIS IS TOO DISGUSTING TO SHOW TO ANYONE EVER!\u003C/p\u003E\u003Cp\u003E-footage missing, camera disabled-\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022screenshot0.png\u0022 alt=\u0022screenshot0.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ECaptain\u0027s log, day 2, Project Geronimo.\u003C/p\u003E\u003Cp\u003EThe entire crew is sick except me for unknown reasons. Cause: Spacesickness. Everyone else is in the hab most of the time, that\u0027s off limits. We\u0027ve got an excellent observation deck, that\u0027s how I snapped that photo. Kerbin looks amazing from space. But we have problems. Gicella and Matsted are starting to recover, but regardless everyone is deeply ill, Mauya can\u0027t even move around properly, and Callie\u0027s panicked, he\u0027s backed himself into a little corner and refuses to leave. To top it off, that hard decouple knocked off both our comm relays AND the emergency storage containers. The PV arrays deployed perfectly, but unless we get the crew back on their feet soon, this ship is going to fall apart. I have to admit, the sudden isolation and loss of perspective take it\u0027s toll, plus all the thrill. I\u0027m surprised the first Kerbal in space didn\u0027t suddenly have a heart attack when he looked down. Then again, not every Spaceship captain is afraid of heights. So I have to end it right there, I need to go think of something clever.\u003C/p\u003E\u003Cp\u003EDay 3, Science Officer Personal Log - Finally not sick anymore, I can sort of move around properly. Matsted is okay off, but still a big trouble for him just to move. Mauya is still sick but calming down, and frankly, Callie seems to be a lost cause. He refuses to budge, he rants hysterically and has even clawed at me. He keeps repeated that we\u0027re stranded, and we\u0027re dying. Oh geep, the mission hasn\u0027t technically even started yet and one\u0027s down already. Funny, I can\u0027t contact Obler. And the airlock just said loss of pressure!? Hold on. OBLER!\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EWHA PICTURES OK I GIVE UP\u003C/p\u003E\n"},{"CreatedByName":"Redhaze","CreatedById":137633,"CreatedDateTime":"2015-05-22T23:07:57Z","Content":"\n\u003Cp\u003ERegarding the images: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/48073-Forum-FAQ-%E2%80%93-Answers-for-New-Users?p=637095#post637095\u0022 rel=\u0022external nofollow\u0022\u003ERead here\u003C/a\u003E\u003C/p\u003E\n"}]}