{"TopicId":110857,"ForumId":32,"TopicTitle":"Saving Jalotte Kerman","CreatedByName":"uglyduckling81","CreatedById":129740,"CreatedDateTime":"2015-05-26T02:50:49Z","PageNum":1,"Articles":[{"CreatedByName":"uglyduckling81","CreatedById":129740,"CreatedDateTime":"2015-05-26T02:50:49Z","Content":"So I launched a rescue mission for Jalotte Kerman orbiting around the Mun.\n\nWhen I got out there her capsule is there but it\u0027s empty.\n\nI thought ok then there\u0027s a bug, Ill just revert and try it again.\n\nArrive a second time and she is definitely not there. Just her capsule.\n\nThe mission is to bring her home and not her capsule.\n\nI can\u0027t complete the mission.\n\nHas anyone else experienced this problem?\n\nJeb just making sure she isn\u0027t hiding inside the capsule and not communicating.\n\n![56U3XMO.png](http://i.imgur.com/56U3XMO.png)\n\n**Edited \u003Ctime datetime=\u00222015-05-26T02:59:24Z\u0022 title=\u002205/26/2015 02:59  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 26, 2015\u003C/time\u003E by uglyduckling81**"},{"CreatedByName":"Camaron","CreatedById":100218,"CreatedDateTime":"2015-05-26T02:54:29Z","Content":"Huh. That\u0027s weird. I haven\u0027t encountered this.\n\nWhat I would do: Pretend you collected Jalotte, and legitimately land your rescue craft after rendezvouzing with the empty pod as if things had gone normally. Then, Use debug menu to force-pass that mission. If you don\u0027t get Jalotte Kerman, I would then recruit any random female astronaut from the facility and go into the save data once you\u0027ve closed the game and rename her Jalotte, all just to simulate the mission working normally. (persistent.sfs in saves) Then you can proceed, and pretend the bug never happend, and the result will be virtually identical."},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2015-05-26T03:23:35Z","Content":"Did you look for Jalotte in the Astronaut Complex? Is she assigned to the mission vessel?\n\nIt\u0027s possible you already retrieved her and forgot, as I have done once or twice."},{"CreatedByName":"AbacusWizard","CreatedById":116476,"CreatedDateTime":"2015-05-26T05:40:38Z","Content":"\u003E \n\u003E Did you look for Jalotte in the Astronaut Complex? Is she assigned to the mission vessel?\n\u003E It\u0027s possible you already retrieved her and forgot, as I have done once or twice.\n\nHah, yes... I recently sent out a rescue craft all the way to Minmus only to find an empty cockpit in orbit. I finally realized that the former occupant was safely on board Starbridge Station in LKO awaiting the next shuttle down to the surface. Whoops. Since then I\u0027ve made a habit of having stranded kerbals declare their own pods \u0022debris\u0022 as soon as they\u0027re rescued."},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2015-05-26T06:03:52Z","Content":"\u003E \n\u003E Hah, yes... I recently sent out a rescue craft all the way to Minmus only to find an empty cockpit in orbit. I finally realized that the former occupant was safely on board Starbridge Station in LKO awaiting the next shuttle down to the surface. Whoops. Since then I\u0027ve made a habit of having stranded kerbals declare their own pods \u0022debris\u0022 as soon as they\u0027re rescued.\n\nThis is an good tips and I use it myself, you can anyway know if an kerbal is rescued if you can switch to the craft, if not rescued it only give the view in tracking station option."},{"CreatedByName":"LittleBlueGaming","CreatedById":144665,"CreatedDateTime":"2015-05-26T06:05:57Z","Content":"I had a weird rescue mission. Made the rendezvous at the Mun, then the game crashed. When I reloaded, I had a message saying I had saved the astronaut, his pod was in orbit around Kerbin, and he was nowhere to be found."},{"CreatedByName":"uglyduckling81","CreatedById":129740,"CreatedDateTime":"2015-05-26T08:15:25Z","Content":"\u003E \n\u003E Did you look for Jalotte in the Astronaut Complex? Is she assigned to the mission vessel?\n\u003E It\u0027s possible you already retrieved her and forgot, as I have done once or twice.\n\nNa she isn\u0027t there. This was my second trip to the Mun for this campaign. The first one just being a flyby as I didn\u0027t have enough Dv for a capture and return. Just to collect some science as I went past and back to Kerbin.\n\nI unlocked heavy rockets with that science and used the new 2.5m parts to do the rescue mission.\n\nI think I figured it out now though. I\u0027m pretty sure this is a ghost left over from when I trialled Interstellar Flight Inc - Kerbal Life Support Mod. I installed to try instead of Tac Life Support. I tried a rescue mission around Kerbin previously with the mod and the Kerbal was gone which I attributed to having no life support on the stranded craft. I removed the mod and am playing this campaign now.\n\nI didn\u0027t immediately make the association because it\u0027s no longer installed and the fact it has happened to me twice now I thought maybe it\u0027s actually bug in the game and was never the mods fault at all.\n\nThe fact no one else has experienced this issue now makes me think I need a clean slate."},{"CreatedByName":"uglyduckling81","CreatedById":129740,"CreatedDateTime":"2015-05-29T23:28:09Z","Content":"So I have come across a weird issue on my very next mission. I haven\u0027t been able to play since I last posted ![:(](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif)\n\nI accepted 2 more rescue missions around Kerbin. One is there and other I can\u0027t see. I double check the tracking station info, one of them is orbiting the Mun not Kerbin like it says.\n\n![0t3IDLD.jpg](http://i.imgur.com/0t3IDLD.jpg)"},{"CreatedByName":"bakanando","CreatedById":126310,"CreatedDateTime":"2015-05-30T03:31:20Z","Content":"The mission says from orbit of Mun though, so it seems ok."}]}