{"TopicId":110907,"ForumId":32,"TopicTitle":"What is the rationale behind playing completely stock?","CreatedByName":"falloutaddict","CreatedById":140606,"CreatedDateTime":"2015-05-26T15:27:04Z","PageNum":8,"Articles":[{"CreatedByName":"Fishslap","CreatedById":143204,"CreatedDateTime":"2015-05-27T21:12:25Z","Content":"\n\u003Cp\u003EMy rationale is that the game crashes too much for me to play it properly even without any mods running. The 32 bit Windows version of KSP is no good. At least that\u0060s my working hypothesis. I had zero problems with 0,90. It never crashed and I could run mods. Then 1.0, very excited, pay Squad money and instantly no more game. And it then got even worse after 1.02. The last time I bothered trying KSP it insisted on crashing every time I landed a ship. Having temperature gauges on each landing strut was too much for it I guess, and you can\u0060t turn those off. Have now uninstalled KSP and am waiting for a 64 bit version or something promising in future patch notes to make the game playable for me. It demands way too much investment for it to randomly crash all the time like it does.\u003C/p\u003E\n"},{"CreatedByName":"SAI Peregrinus","CreatedById":125558,"CreatedDateTime":"2015-05-27T21:23:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fishslap\u0022 data-cite=\u0022Fishslap\u0022\u003E\u003Cdiv\u003EMy rationale is that the game crashes too much for me to play it properly even without any mods running. The 32 bit Windows version of KSP is no good. At least that\u0060s my working hypothesis. I had zero problems with 0,90. It never crashed and I could run mods. Then 1.0, very excited, pay Squad money and instantly no more game. And it then got even worse after 1.02. The last time I bothered trying KSP it insisted on crashing every time I landed a ship. Having temperature gauges on each landing strut was too much for it I guess, and you can\u0060t turn those off. Have now uninstalled KSP and am waiting for a 64 bit version or something promising in future patch notes to make the game playable for me. It demands way too much investment for it to randomly crash all the time like it does.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/120731\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/120731\u003C/a\u003E turns of temp gauges. It\u0027s pretty much required to either use this or turn of edge highlighting in the options on any OS due to the massive memory leak.\u003C/p\u003E\n"},{"CreatedByName":"Beowolf","CreatedById":48927,"CreatedDateTime":"2015-05-27T22:14:57Z","Content":"\n\u003Cp\u003EI bought KSP, launched exactly ONE rocket, then went looking for a mod to display TWR and dV. It\u0027s been two years, and to this day I can\u0027t comprehend why anyone would want to play this game without that critical information. It\u0027s a completely different game with a dV display, and IMO ten times more fun. Doesn\u0027t running out of fuel mid-mission get old? Stock-only players seem to be complaining about that happening constantly.\u003C/p\u003E\u003Cp\u003EThen Kerbal Alarm Clock showed me still another layer, opening up possibilities for simultaneous missions too complex to keep track of manually. In the planetary-exploration phase of my last career game, at one time I noticed I had fifteen simultaneous active missions.\u003C/p\u003E\u003Cp\u003EIncidentally, mods don\u0027t make you run out of memory. Adding lots of new parts is what does that, so it\u0027s only that specific kind of mod. All those magnificent plugins that enhance the KSP experience only cost a few kilobytes.\u003C/p\u003E\n"},{"CreatedByName":"Yemo","CreatedById":114412,"CreatedDateTime":"2015-05-27T22:45:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Beowolf\u0022 data-cite=\u0022Beowolf\u0022\u003E\u003Cdiv\u003EI bought KSP, launched exactly ONE rocket, then went looking for a mod to display TWR and dV. It\u0027s been two years, and to this day I can\u0027t comprehend why anyone would want to play this game without that critical information. It\u0027s a completely different game with a dV display, and IMO ten times more fun. Doesn\u0027t running out of fuel mid-mission get old? Stock-only players seem to be complaining about that happening constantly.\u003Cp\u003EThen Kerbal Alarm Clock showed me still another layer, opening up possibilities for simultaneous missions too complex to keep track of manually. In the planetary-exploration phase of my last career game, at one time I noticed I had fifteen simultaneous active missions.\u003C/p\u003E\u003Cp\u003EIncidentally, mods don\u0027t make you run out of memory. Adding lots of new parts is what does that, so it\u0027s only that specific kind of mod. All those magnificent plugins that enhance the KSP experience only cost a few kilobytes.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt is funny that squad eg makes the tech tree starting with kerbals intstead of probes to make the game more accessible, nerfs reentry heating and aero model and so on, so that casuals can enjoy it and then refuses to provide the one crucial information to reliably reach targets beyond LKO...\u003C/p\u003E\u003Cp\u003EIt is like an airport/trainstation, specifically designed for kids/disabled people/foreigners/whatever and then they paint all windows black and switch the lights off...\u003C/p\u003E\n"},{"CreatedByName":"herbal space program","CreatedById":112590,"CreatedDateTime":"2015-05-28T00:31:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Yemo\u0022 data-cite=\u0022Yemo\u0022\u003E\u003Cdiv\u003EIt is funny that squad eg makes the tech tree starting with kerbals intstead of probes to make the game more accessible, nerfs reentry heating and aero model and so on, so that casuals can enjoy it and then refuses to provide the one crucial information to reliably reach targets beyond LKO...\u003Cp\u003EIt is like an airport/trainstation, specifically designed for kids/disabled people/foreigners/whatever and then they paint all windows black and switch the lights off...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m pretty sure they nerfed the aero model and reentry heating because not to have done so would have made the game just about unplayable. they hide the deltaV and TWR info because they want you to figure it out on your own. Anyway, calculating TWR is truly essential but it\u0027s really easy if you know the weight of the ship. Having exactly the right deltaV is seldom critical for any mission. You experiment, then overbuild, then gradually learn how to do it at higher and higher efficiency. If you can just look all that stuff up from the get-go, IMO it nerfs the game worse than any of the other stuff you mentioned.\u003C/p\u003E\n"},{"CreatedByName":"joekidd1992","CreatedById":110769,"CreatedDateTime":"2015-05-28T01:22:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Beowolf\u0022 data-cite=\u0022Beowolf\u0022\u003E\u003Cdiv\u003EI bought KSP, launched exactly ONE rocket, then went looking for a mod to display TWR and dV. It\u0027s been two years, and to this day I can\u0027t comprehend why anyone would want to play this game without that critical information. It\u0027s a completely different game with a dV display, and IMO ten times more fun. Doesn\u0027t running out of fuel mid-mission get old? Stock-only players seem to be complaining about that happening constantly.\u003Cp\u003EThen Kerbal Alarm Clock showed me still another layer, opening up possibilities for simultaneous missions too complex to keep track of manually. In the planetary-exploration phase of my last career game, at one time I noticed I had fifteen simultaneous active missions.\u003C/p\u003E\u003Cp\u003EIncidentally, mods don\u0027t make you run out of memory. Adding lots of new parts is what does that, so it\u0027s only that specific kind of mod. All those magnificent plugins that enhance the KSP experience only cost a few kilobytes.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYour post is what makes me want to use mods. I do think there\u0027s something missing in stock and it isn\u0027t all that fun trial and erroring your way everywhere.\u003C/p\u003E\n"},{"CreatedByName":"LittleBlueGaming","CreatedById":144665,"CreatedDateTime":"2015-05-28T01:38:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Beowolf\u0022 data-cite=\u0022Beowolf\u0022\u003E\u003Cdiv\u003EI bought KSP, launched exactly ONE rocket, then went looking for a mod to display TWR and dV. It\u0027s been two years, and to this day I can\u0027t comprehend why anyone would want to play this game without that critical information. It\u0027s a completely different game with a dV display, and IMO ten times more fun. Doesn\u0027t running out of fuel mid-mission get old? Stock-only players seem to be complaining about that happening constantly.\u003Cp\u003EThen Kerbal Alarm Clock showed me still another layer, opening up possibilities for simultaneous missions too complex to keep track of manually. In the planetary-exploration phase of my last career game, at one time I noticed I had fifteen simultaneous active missions.\u003C/p\u003E\u003Cp\u003EIncidentally, mods don\u0027t make you run out of memory. Adding lots of new parts is what does that, so it\u0027s only that specific kind of mod. All those magnificent plugins that enhance the KSP experience only cost a few kilobytes.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI installed KER very early on, but I decided I wanted to know how to calculate things on my own, so that\u0027s what I\u0027m doing in my stock career. I\u0027m sure it will get old at some point, but right now I\u0027m learning and I think more about which parts I\u0027m using and why.\u003C/p\u003E\u003Cp\u003EI have nothing against mods, and nothing against stock... it\u0027s just two different flavors.\u003C/p\u003E\n"},{"CreatedByName":"Jouni","CreatedById":97346,"CreatedDateTime":"2015-05-28T09:36:31Z","Content":"\n\u003Cp\u003EI haven\u0027t played stock KSP for a long time. On the other hand, KSP is probably the first game I\u0027ve played modded since Quake I, so I understand something about the stock mentality.\u003C/p\u003E\u003Cp\u003EPlaying stock is simple. If I like the game, I play it. If I don\u0027t like the game, I don\u0027t play it. Playing modded is much more complicated. Every single aspect of the game becomes my personal responsibility. If I don\u0027t like something in the game, it\u0027s my job to find a mod that changes it, or create a new mod myself. I have to judge things and make choices all the time, which is mentally exhausting.\u003C/p\u003E\u003Cp\u003EChoices are hard. Every choice I make in a game is one less choice I\u0027ll be able to do well elsewhere in my life. Most of the time, it\u0027s simply not worth the effort. The choices I make outside the game are usually more important, interesting, and/or fun.\u003C/p\u003E\u003Cp\u003EEven though I play KSP modded, I rarely install new mods, as they would bring unnecessary choices to the game. My list of \u0022stock mods\u0022 used to include FAR, DRE, Procedural Fairings, MechJeb, and Docking Port Alignment Indicator. The first three are no longer necessary, so I\u0027m down to two mods at the moment. I\u0027m going to give the new FAR a try after completing my current career mode game, though I\u0027m probably going to miss the ease of building planes in stock 1.0.\u003C/p\u003E\n"},{"CreatedByName":"SpaceChipmunk","CreatedById":142023,"CreatedDateTime":"2015-05-28T09:41:45Z","Content":"\n\u003Cp\u003EI try to play stock whenever a new version has been released. But after a few hours of building rockets and constantly switching to the map to see the AP. I give up and get KER. It is the first and most essential mod. Having the dV, TWR and when in flight the AP is just too invaluable to ignore.\u003C/p\u003E\u003Cp\u003EBut I am finding that KCT is getting to be a necessity for me as well. What is the point in contracts giving you years to complete them when you can launch several years worth of rockets without leaving the first day???!!!\u003C/p\u003E\n"},{"CreatedByName":"Plume \u0026amp; Akakak","CreatedById":142955,"CreatedDateTime":"2015-05-28T18:04:56Z","Content":"\n\u003Cp\u003EHello everyone,\u003C/p\u003E\u003Cp\u003EI play stock to keep the game a simple, and shareable experience.\u003C/p\u003E\u003Cp\u003EIt\u0027s a lowest common denominator. As a social tool, I like my game to be the same that other people are playing, it\u0027s like speaking a common language.\u003C/p\u003E\u003Cp\u003EMy professional background in art has slowly taken me away from the \u0022add more options\u0022 thing. At some point I looked at my sequencer and was thinking that these piles of audio and visual plugins correcting each others\u0027outputs were absurd. I was focusing on hundreds-of-knobs precision at the expense of making something significant.\u003C/p\u003E\u003Cp\u003ENow I work with a single keyboard, which is plugged to a resonant filter bank plugged into a 4-track analog tape recorder.\u003C/p\u003E\u003Cp\u003EOr \u0022play\u0022 Reason, no matter how much unprofessional it is for some people. I have always liked its toy side. I just find Reason so fun to use.\u003C/p\u003E\u003Cp\u003ESame goes for KSP in my experience. I cannot but think that the quest for mods may bridle creativity, and be a neverending upgrade frenzy. I\u0027m not into such tuning.\u003C/p\u003E\u003Cp\u003EI do with what\u0027s available in this particular coloured-pencils box. I feel it more like an open space this way.\u003C/p\u003E\u003Cp\u003EDon\u0027t get me wrong, I\u0027m fine with what many people here are achieving with mods, like tinier and more efficient ships, to name just a single, and evident example.\u003C/p\u003E\u003Cp\u003EI\u0027m only trying to share my view and yes, what I think can be the greatness of a more humble approach...\u003C/p\u003E\u003Cp\u003E(in a clumsy and maybe indigest English, sorry)\u003C/p\u003E\u003Cp\u003EHere, with a nation of goofy little green men (each with a stat of dumbness) trying to conquer space, all the fun I have is about failing gloriously, or succeeding miserably, unpredictably or improbably : ) So no, I am not into mod-assisted optimal designs and flights.\u003C/p\u003E\u003Cp\u003EStories where princesses are heroically rescued get boring with time. \u003C/p\u003E\u003Cp\u003EAbout visual mods...\u003C/p\u003E\u003Cp\u003EI\u0027m fine with the stock graphics.\u003C/p\u003E\u003Cp\u003EThe crashed plane in \u003Cem\u003EMercenary\u003C/em\u003E has always looked great, and Gomez of \u003Cem\u003EFez\u003C/em\u003E is cool and friendly, even when you put the retro trend aside.\u003C/p\u003E\u003Cp\u003EHappy KSPing\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-29T02:32:20Z\u0022 title=\u002205/29/2015 02:32  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 29, 2015\u003C/time\u003E by Plume \u0026amp; Akakak\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Rus-Evo","CreatedById":107004,"CreatedDateTime":"2015-05-28T22:03:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nansuchao\u0022 data-cite=\u0022Nansuchao\u0022\u003E\u003Cdiv\u003EI have only one opinion about people that plays completely stock: they\u0027re scared from crashes. Mods makes you RAM easily running on the limit of KSP, causing crashes and other weird thing. But playing stock it\u0027s actually play just 50% of KSP.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENope, not worried about crashes, I just like the challlenge of doing everything with just what they gave us (which I think requires more creativity from me).\u003C/p\u003E\n"},{"CreatedByName":"Linear","CreatedById":26619,"CreatedDateTime":"2015-05-28T22:12:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rus-Evo\u0022 data-cite=\u0022Rus-Evo\u0022\u003E\u003Cdiv\u003ENope, not worried about crashes, I just like the challlenge of doing everything with just what they gave us (which I think requires more creativity from me).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think that\u0027s the real defining attitude. Some people believe the stock game forces you to be more thoughtful and creative, whereas other believe it can be limiting, boring and easy after a while.\u003C/p\u003E\u003Cp\u003EE: Of course, neither is \u0027right\u0027 :-)\u003C/p\u003E\n"},{"CreatedByName":"Robje","CreatedById":59484,"CreatedDateTime":"2015-05-28T22:28:24Z","Content":"\n\u003Cp\u003EI feel i want to explore the entire game, all the parts in all it\u0027s facets and efficiencies before i add more to the game. I also like the challenge of no aids. But i can not play seriously for indefinately. Eventualy i find the temptations of bombs, airplane-parts,winches, whatever too great when i am fealing creative (sandboxy).\u003C/p\u003E\u003Cp\u003EAlso: \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022herbal space program\u0022 data-cite=\u0022herbal space program\u0022\u003E\u003Cdiv\u003E\u0022We play with stock-only capabilities and do the other things, not because they are easy, but because they are hard.\u0022\u003Cp\u003E-John F. Kerman\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell said.\u003C/p\u003E\n"},{"CreatedByName":"boxman","CreatedById":61559,"CreatedDateTime":"2015-05-29T01:00:52Z","Content":"\n\u003Cp\u003EFor me it is the performance issues/memory, inability to share crafts and the fear of the next version breaking the mod, which has happened quite a few times.\u003C/p\u003E\n"},{"CreatedByName":"shizophrenic","CreatedById":107022,"CreatedDateTime":"2015-05-29T02:23:31Z","Content":"\n\u003Cp\u003EI think there is no one right way to play KSP. Mod it or don\u0027t Mod it the way you want. \u003C/p\u003E\u003Cp\u003EBefore 0.25 i did all manover by hand and building by estimating and now i use Mods. I hope some of the concepts of mods make it into later versions of the game.\u003C/p\u003E\u003Cp\u003EThe reasons can reduced mainly to: \u003C/p\u003E\u003Cp\u003E- better visuals/audio\u003C/p\u003E\u003Cp\u003E- more game depth (Scansat, Contract packs)\u003C/p\u003E\u003Cp\u003E- lazyness, because even if i can do it i don\u0027t want to waste my precious gaming time on calculating dV (KER) or eyeballing docking alignment (NavHud)\u003C/p\u003E\n"},{"CreatedByName":"falloutaddict","CreatedById":140606,"CreatedDateTime":"2015-05-29T09:37:42Z","Content":"\n\u003Cp\u003EYou guys rock. I didn\u0027t expect to get this kind of response! Seems like there are quite a few of you stockers out there (that is what they like to be called right?). Well either way, you\u0027ve convinced me to uninstall all of my mods and give stock career a go, not something I\u0027ve done since pre 1.0. And when I say stock I mean 100%, I even made a little spreadsheet for calculating TWR and dV although I must admit I haven\u0027t really used it. Having played a bit I can pretty well eyeball how many boosters to put on my rocket for the simple things I\u0027m doing right now but I imagine it will come in handy for interplanetary trips possibly.\u003C/p\u003E\u003Cp\u003EI have to agree with many of you when you say that there is a different kind of challenge here, especially those few of you that forgo using mechjeb or ker. There is a certain level of guess work that adds an level of mystery almost. Before I could get my dV read and know I have 7700 dV for my trip to the mun and back. Now I know I have 160 fuel left in my last stage, at max throttle I\u0027m burning 1.6 units of fuel/s therefore I can burn for 100 seconds and it\u0027s going to take a 60 second burn to get there and probably about 10 back which should leave me with more than enough and so forth. So there is definitely a different train of thought that goes with playing this way. I think the mod I miss the most however is KAC. I find it to be infinitely useful. \u003C/p\u003E\u003Cp\u003EOne other thing I would like to note on after playing stock is that I find this game to be fantastic in it\u0027s current state. I would definitely consider it a complete game and well worth the $20 I spent on it. I agree that there are some minor bugs to be hashed out (maneuver nodes can be kind of difficult or downright impossible to place when you have a soi transfer ahead of you), but other than that 1.0 is in my opinion a finished product and one to be proud of. The fact that there is such a variety of mods and the promise of continued updates and even more features is just awesome to me.\u003C/p\u003E\u003Cp\u003EAnd just so you guys don\u0027t think I\u0027m a scrub that\u0027s all talk, here is a picture I found in my screenshot folder from months ago that proves otherwise.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/NvgkwoI.jpg\u0022 alt=\u0022NvgkwoI.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Olterin","CreatedById":116073,"CreatedDateTime":"2015-05-29T10:12:23Z","Content":"\n\u003Cp\u003EI played stock at first. Then, upon finding out how easy it was to install mods, I tried plenty of those out.\u003C/p\u003E\u003Cp\u003EHowever, over time it\u0027s become tiring to keep up-do-date with all of them and the stock game is \u0022close enough\u0022 for my realism \u0022requirements\u0022 to keep having fun launching planes and rockets - so I went back to playing purely stock. I keep a spreadsheet around for calculating my deltaV budgets, something many seem to do with a mod - I find that doing so manually makes me think the mission through more carefully (and overall immerses me more).\u003C/p\u003E\n"},{"CreatedByName":"georgTF","CreatedById":57397,"CreatedDateTime":"2015-05-29T11:06:23Z","Content":"\n\u003Cp\u003EI play stock. Generally i dislike mods in most games. Sometimes because they\u0027re unfinished or i don\u0027t agree with them or they \u0022rebalance\u0022 things. That said, a good mod deserves heaps of praise and requires a lot of effort, so i\u0027m carefull not to dis mods too much.\u003C/p\u003E\u003Cp\u003EFor KSP i tried several mods of which Alarm is really something that needs to be part of the game. A major failing of KSP is that you can only handly a single mission at a time without a way to easily and sensibly keep track of multiple ongoing missions. Given you can explore the Mun several times over in the time it takes to reach the nearest planet, it\u0027s a shame that there\u0027s no proper \u0022mission control\u0022. It\u0027s probably a major reason a lot of planets/moons are rarely visited and it\u0027s very silly to force an entire space program to shut down while a mission to a faraway planet is timewarped.\u003C/p\u003E\u003Cp\u003EAnother mod i used was the multiplayer mod although i wouldn\u0027t call that a mod. I don\u0027t know what to call it though, but it\u0027s not like it adds parts or alters gameplay mechanics. It allwed me to play and crash the game horribly together with other people, so it\u0027s quite amazing.\u003C/p\u003E\u003Cp\u003ELastly i was very happy to use TAC, but eventually was happier to stop using it when the next version of KSP came out. While the idea seems fine, the execution is fairly dull and repetitive. Same way as you make sure to have the means of generating and storing power, you make sure you have the parts needed to keep crew alive and happy. It boiled down to basically attaching some parts, but it was fun initially. One major disadvantage is that part count rises steadily as you use docking/orbital/station craft though that is a fault of the game and not the mod. I played the game with an \u0022all flights must be manned\u0022 rule and the part count became annoying. Even a skycrane had TAC parts tacked on as it had to be manned and thus reusable. But again, it\u0027s a good mod and well worth trying once at least.\u003C/p\u003E\n"},{"CreatedByName":"haltux","CreatedById":29407,"CreatedDateTime":"2015-05-29T11:59:15Z","Content":"\n\u003Cp\u003ESquad has balanced the game to make it just as difficult as it should be, at each difficulty level, to make every single game mechanism not too weak and not too powerful. Not sure they did it perfectly but at least they tried, like any other game designer.\u003C/p\u003E\u003Cp\u003EWhen I install plugins, I always suspect it will ruin this balance. So I think it does make sense to play stock to have the gameplay Sqaud has balanced for you.\u003C/p\u003E\u003Cp\u003EThat being said, I don\u0027t want to play without KER.\u003C/p\u003E\n"},{"CreatedByName":"Linear","CreatedById":26619,"CreatedDateTime":"2015-05-29T12:03:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022haltux\u0022 data-cite=\u0022haltux\u0022\u003E\u003Cdiv\u003ESquad has balanced the game to make it just as difficult as it should be, at each difficulty level, to make every single game mechanism not too weak and not too powerful. Not sure they did it perfectly but at least they tried, like any other game designer.\u003Cp\u003EWhen I install plugins, I always suspect it will ruin this balance. So I think it does make sense to play stock to have the gameplay Sqaud has balanced for you.\u003C/p\u003E\u003Cp\u003EThat being said, I don\u0027t want to play without KER.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIs all that data not a massive balance change? That\u0027s the reason why it hasn\u0027t been added yet...\u003C/p\u003E\n"},{"CreatedByName":"Pappus","CreatedById":100574,"CreatedDateTime":"2015-05-29T13:19:19Z","Content":"\n\u003Cp\u003EMechjab and that one that helps with ascension profile look really interesting, but I feel I would be moving away from the spirit of the game. It also doesn\u0027t help me that much since I specifically do not want to calculate while designing and so those numbers would only lead for me to check if I have them or not.\u003C/p\u003E\u003Cp\u003EI also don\u0027t want to follow up closely on mod upgrades, with kerbal in steam I know it is always up-to-date whenever I press play. If I start modding the game it might not be the case.\u003C/p\u003E\u003Cp\u003EAlso I found myself so often at mun in a situation where I thought: Can I land one more time or do I need to go back, my fuel looks good, but.... I don\u0027t know, but regardless you go forward knowing full well that if it fails it means rescue mission so you get ready for the next landing, but then you decide .... it - back home it is \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"herbal space program","CreatedById":112590,"CreatedDateTime":"2015-05-29T17:53:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022falloutaddict\u0022 data-cite=\u0022falloutaddict\u0022\u003E\u003Cdiv\u003EYou guys rock. I didn\u0027t expect to get this kind of response! Seems like there are quite a few of you stockers out there (that is what they like to be called right?). Well either way, you\u0027ve convinced me to uninstall all of my mods and give stock career a go, not something I\u0027ve done since pre 1.0. And when I say stock I mean 100%, I even made a little spreadsheet for calculating TWR and dV although I must admit I haven\u0027t really used it. Having played a bit I can pretty well eyeball how many boosters to put on my rocket for the simple things I\u0027m doing right now but I imagine it will come in handy for interplanetary trips possibly.\u003Cp\u003EI have to agree with many of you when you say that there is a different kind of challenge here, especially those few of you that forgo using mechjeb or ker. There is a certain level of guess work that adds an level of mystery almost. Before I could get my dV read and know I have 7700 dV for my trip to the mun and back. Now I know I have 160 fuel left in my last stage, at max throttle I\u0027m burning 1.6 units of fuel/s therefore I can burn for 100 seconds and it\u0027s going to take a 60 second burn to get there and probably about 10 back which should leave me with more than enough and so forth. So there is definitely a different train of thought that goes with playing this way. I think the mod I miss the most however is KAC. I find it to be infinitely useful. \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-29T17:58:56Z\u0022 title=\u002205/29/2015 05:58  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 29, 2015\u003C/time\u003E by herbal space program\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Columbia","CreatedById":135031,"CreatedDateTime":"2015-05-29T17:59:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022pxi\u0022 data-cite=\u0022pxi\u0022\u003E\u003Cdiv\u003EAlso Mozart is objectively better then Beethoven.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E[sarcasm]Also, Beethoven was deaf meaning he is better, because I think he\u0027s better and you all should follow my opinion.[/sarcasm]\u003C/p\u003E\u003Cp\u003EBack on topic:\u003C/p\u003E\u003Cp\u003EI find that playing stock feels more \u0022fair\u0022 - I don\u0027t want to have a \u0022handicap\u0022 for my every goal, and it feels more triumphant and challenging. I rarely use part mods as sometimes, it is an unfair advantage \u003Cem\u003Efor myself\u003C/em\u003E. But why would I judge if someone else did?\u003C/p\u003E\u003Cp\u003EAlthough I don\u0027t paly completely stock - I have KER, Kerbin City and Kerbal Konstructs. I\u0027m not too much of a stock person. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 alt=\u0022:blush:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"haltux","CreatedById":29407,"CreatedDateTime":"2015-05-29T18:27:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Linear\u0022 data-cite=\u0022Linear\u0022\u003E\u003Cdiv\u003EIs all that data not a massive balance change? That\u0027s the reason why it hasn\u0027t been added yet...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt is defintely a balance change, it clearly makes the game easier. But I don\u0027t think it is the reason why it has not been added.\u003C/p\u003E\u003Cp\u003EI think the main (bad) reason Delta-V has not been added is that it gives a number which has to be somehow processed by the player. The rest of KSP does not require that at all. You can just assemble rockets like lego and play with them, and retry if it does not work. With KER you need to make a target deltaV computation (even if it is basic) yourself, in the principle it makes a big difference, it feels more geeky.\u003C/p\u003E\u003Cp\u003EFurthermore a game has to be self-contained, you should not need to check an external deltaV map. So this map should be somehow integrated in the game.\u003C/p\u003E\u003Cp\u003EOne option would be to provide some info about your mission (target, or even manoeuvre) and it would give you a warning if you don\u0027t have enough delta-V. In terms of UI it is not that straightforward.\u003C/p\u003E\n"},{"CreatedByName":"Olterin","CreatedById":116073,"CreatedDateTime":"2015-05-29T18:55:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022haltux\u0022 data-cite=\u0022haltux\u0022\u003E\u003Cdiv\u003EIt is defintely a balance change, it clearly makes the game easier. But I don\u0027t think it is the reason why it has not been added.\u003Cp\u003EI think the main (bad) reason Delta-V has not been added is that it gives a number which has to be somehow processed by the player. The rest of KSP does not require that at all. You can just assemble rockets like lego and play with them, and retry if it does not work. With KER you need to make a target deltaV computation (even if it is basic) yourself, in the principle it makes a big difference, it feels more geeky.\u003C/p\u003E\u003Cp\u003EFurthermore a game has to be self-contained, you should not need to check an external deltaV map. So this map should be somehow integrated in the game.\u003C/p\u003E\u003Cp\u003EOne option would be to provide some info about your mission (target, or even manoeuvre) and it would give you a warning if you don\u0027t have enough delta-V. In terms of UI it is not that straightforward.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E... Well, to be fair, when you plan maneuvers using maneuver nodes, you do get a deltaV required displayed on those nodes. But I feel this discussion is best suited for another topic.\u003C/p\u003E\n"}]}