{"TopicId":111012,"ForumId":18,"TopicTitle":"PC for KSP","CreatedByName":"DanielHB","CreatedById":145058,"CreatedDateTime":"2015-05-27T14:19:48Z","PageNum":1,"Articles":[{"CreatedByName":"DanielHB","CreatedById":145058,"CreatedDateTime":"2015-05-27T14:19:48Z","Content":"\n\u003Cp\u003EDear fellow KSPers,\u003C/p\u003E\u003Cp\u003EI am looking to buy an actual gaming PC as compared to only using my laptop, and one of the key factors as to which PC I buy is whether it can play KSP smoothly. I was wondering whether the computer in the link would be able to do this.\u003C/p\u003E\u003Cp\u003ELINK: \u003Ca href=\u0022http://www.ebay.co.uk/itm/ULTRA-FAST-Quad-Core-4-2Ghz-16GB-1TB-Desktop-Gaming-PC-Computer-AMD-HD-/191124576369?pt=LH_DefaultDomain_3\u0026amp;hash=item2c7fe99871\u0022 rel=\u0022external nofollow\u0022\u003EHERE\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EPlease let me know.\u003C/p\u003E\u003Cp\u003EMany thanks,\u003C/p\u003E\u003Cp\u003EDaniel HB\u003C/p\u003E\n"},{"CreatedByName":"michaelsteele3","CreatedById":127113,"CreatedDateTime":"2015-05-27T14:32:38Z","Content":"\n\u003Cp\u003EIt\u0027s blocked for me (Dangit school!)\u003C/p\u003E\u003Cp\u003ECan you copy \u0026amp; paste the specs here?\u003C/p\u003E\u003Cp\u003EThank you, and welcome to the forums!\u003C/p\u003E\n"},{"CreatedByName":"montyben101","CreatedById":74173,"CreatedDateTime":"2015-05-27T14:33:48Z","Content":"\n\u003Cp\u003EI would really build it yourself, The price is not bad for what it is (actually its really good) but the GPU is pretty poor. The CPU is not bad and should run KSP decently but will get bottle-necked by the GPU\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2015-05-27T14:43:43Z","Content":"\n\u003Cp\u003EThat is \u003Cem\u003Enot\u003C/em\u003E a gaming PC. There isn\u0027t even a videocard installed into it. There\u0027s only the CPU-integrated graphics engine.\u003C/p\u003E\u003Cp\u003E...mind you, AMD has pretty good CPU-integrated graphics engines, and they\u0027re something that can play the odd game when requested to, but they\u0027re in no way, shape or form \u0022gamer\u0022 hardware. That Ebay seller is counting on people who don\u0027t know about hardware to fall for flashy-looking numbers and promises.\u003C/p\u003E\u003Cp\u003ESomething you should understand: you\u0027re not going to get gaming-grade hardware at that price point, because relevant, useful video cards start somewhere around 100 pounds alone (and you\u0027ll need to fork over at least twice that if you want something you can actually show off with). The system offered in that link is probably halfway decent for the price, if a bit unbalanced (16 GB RAM and 500W power, seriously?) and will make a good family PC. Just don\u0027t call it a \u0022gaming\u0022 PC \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/25004-KSP-Unofficial-Official-Computer-Building-Buying-Megathread-%28All-Questions-Acceptable-%29\u0022 rel=\u0022external nofollow\u0022\u003EWe have a thread on the forums here\u003C/a\u003E, I\u0027m sure the people there can help you find a good deal for your budget.\u003C/p\u003E\n"},{"CreatedByName":"Volix","CreatedById":144192,"CreatedDateTime":"2015-05-27T14:43:47Z","Content":"\n\u003Cp\u003EThat\u0027s quite a bit better than what I play on, and I find my experience is pretty smooth and only falls off when I have hundreds of parts. My relevant stats:\u003C/p\u003E\u003Cp\u003E3 GHz quad core (Intel core 2)\u003C/p\u003E\u003Cp\u003E8Gb ram\u003C/p\u003E\u003Cp\u003ENvidia 650TI graphics (not sure how that compares to the AMD HD8570D, but it\u0027s a couple years old)\u003C/p\u003E\u003Cp\u003EWindows 7 x64 (running KSP 32 bit), Looks like you\u0027ll need to buy an OS along with this PC\u003C/p\u003E\u003Cp\u003EOnly thing I would note is if you plan on using Linux at all you might want to get a PC with a Nvidia graphics card (\u003Ca href=\u0022http://www.phoronix.com/scan.php?page=article\u0026amp;item=linux_gpus_2014start\u0026amp;num=2\u0022 rel=\u0022external nofollow\u0022\u003EBenchmark\u003C/a\u003E). If you\u0027re looking at windows you should be fine.\u003C/p\u003E\u003Cp\u003EEDIT: Others bring up good points as well. This would run KSP better than my rig, but that doesn\u0027t mean you couldn\u0027t do even better. I built my computer 5-6 years ago, so anything recent would probably be better. Also, welcome to the forums!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-27T14:53:44Z\u0022 title=\u002205/27/2015 02:53  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 27, 2015\u003C/time\u003E by Volix\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2015-05-27T15:06:19Z","Content":"\n\u003Cp\u003EI don\u0027t want to sound unkind, but there\u0027s no such thing as an ultra-fast PC for that kind of price. It\u0027s also not balanced very well for KSP in particular.\u003C/p\u003E\u003Cp\u003EOn the other hand, I seriously couldn\u0027t build a rig that I would consider \u003Cem\u003Egood\u003C/em\u003E within Ã‚Â£300. If your budget isn\u0027t flexible, then that may well be the best you\u0027ll get. It will of course \u003Cem\u003Eplay\u003C/em\u003E KSP, but you may find that your maximum part count before lag is somewhat lower than you\u0027d like.\u003C/p\u003E\u003Cp\u003EIf you \u003Cem\u003Ecan\u003C/em\u003E find some more monetary headroom, then consider that for KSP, the primary bottleneck tends to be single-threaded CPU performance; AMD\u0027s per-core performance is poor, and there\u0027s no point in having four of them since only one will do any work. On a tight budget, I\u0027d seriously be considering an Intel Pentium Anniversary Edition and overclock the nuts off it. I suspect a reasonable rig aimed at KSP could be built around that for maybe Ã‚Â£400-450.\u003C/p\u003E\u003Cp\u003E*Disclaimer: my pretty-beefy PC also can\u0027t run KSP smoothly in many situations. Spaceplanes over 150 parts at high speed in atmosphere are laggy. Large stations are laggy. Large anything is laggy. A computer isn\u0027t really struggling with KSP until you find it won\u0027t handle anything past 100 parts.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Volix\u0022 data-cite=\u0022Volix\u0022\u003E\u003Cdiv\u003EThat\u0027s quite a bit better than what I play on, and I find my experience is pretty smooth and only falls off when I have hundreds of parts. My relevant stats:\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s not a lot better... I\u0027d hazard a guess that it\u0027d bench 20% faster in single-threaded applications. GHz means nothing between brands :/\u003C/p\u003E\n"},{"CreatedByName":"lazarus1024","CreatedById":65276,"CreatedDateTime":"2015-05-27T15:10:36Z","Content":"\n\u003Cp\u003EI\u0027d stay away from AMD, especially for KSP. With the transition to Unity 5, things may change a bit, but right now it is single threaded performance that means a bit more for KSP and AMD\u0027s single thread performance is abysmal in comparison to Intel. On multithreaded, well, things may be somewhat closer there. I can\u0027t really speak to whether KSP leverages a lot of integer or floating point calculations, but generally in most gaming comparisons, Intel has quite a lead when you include any discrete graphics card in to the mix.\u003C/p\u003E\u003Cp\u003EHonestly, KSP is pretty graphics light. I have a $100 Nvidia GTX750 and it runs KSP smoothly at 1080p and all of the nits turned up. Where I can get stumbling is truely massive ships. My i5-3570 running at 4GHz however can lift most of what is KSP pretty easily however. I can\u0027t say I\u0027ve run a spaceplane with 150 parts in any circumstance, but multi hundred part rockets and space stations don\u0027t really cause issues for it.\u003C/p\u003E\u003Cp\u003EFrankly if on a budget, I\u0027d look for something like an Intel i3-4330 processor with 8GB of RAM and something like an Nvidia GTX750 or 750ti to drive it (frankly AMD\u0027s current GPUs are also energy thristy without great performance and prices aren\u0027t super attractive either). Assembling it yourself you could probably put it all together for $550-650 depending on exact choices in case, SSD/HDD, power supply, etc.\u003C/p\u003E\u003Cp\u003EAt a price point of $300, you aren\u0027t going to be able to assemble anything decent. Really $500 is the starting point for a \u0022decent\u0022 gaming system. Obviously an uber awesome one is more like $2,000 but you can make a pretty respectably good one for $500-600.\u003C/p\u003E\n"},{"CreatedByName":"Volix","CreatedById":144192,"CreatedDateTime":"2015-05-27T15:12:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022eddiew\u0022 data-cite=\u0022eddiew\u0022\u003E\u003Cdiv\u003EIt\u0027s not a lot better... I\u0027d hazard a guess that it\u0027d bench 20% faster in single-threaded applications. GHz means nothing between brands :/\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFair enough, I haven\u0027t looked at processor benchmarks for a long time, and there\u0027s a reason I went with Intel over AMD. That\u0027s why I threw up the edit, I built mine to be a gaming rig, it\u0027s just old.\u003C/p\u003E\n"},{"CreatedByName":"SpaceChipmunk","CreatedById":142023,"CreatedDateTime":"2015-05-27T15:18:19Z","Content":"\n\u003Cp\u003ETo add my opinion to this debate. I work in IT and always build my own machines, plus I know Unity 5 quite well. This machine will do the job and do it well. But if you want to play anything a bit more advanced then you would need to get a new dedicated Graphics Card. yes Intel has better performance for their CPU, but for KSP you will not really notice a great deal of improvement between the two. It is a quad core, it has a lot of RAM. The power supply is perfectly fine. Even upgrading the GPU the 500 would be fine (especially if you go for nVidia rather than AMD).\u003C/p\u003E\u003Cp\u003Eedit: you will not notice any difference in performance from this cpu and an i3 (An i3 is not an ideal gaming processor at all. Always best to look at i5 or i7)\u003C/p\u003E\u003Cp\u003EFor the price it is good. But it will not future proof you. But in the future you could re-use parts (like HDD, RAM) in a better machine when you have more cash!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-27T15:20:46Z\u0022 title=\u002205/27/2015 03:20  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 27, 2015\u003C/time\u003E by SpaceChipmunk\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sam.johnson841","CreatedById":104846,"CreatedDateTime":"2015-05-27T15:23:51Z","Content":"\n\u003Cp\u003EAlso not that the machine doesn\u0027t come with an operating system, you will need to buy one or use a free one. \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003EAlternatively i think you can transfer the licence from your laptop.\u003C/span\u003E \u003C/p\u003E\u003Cp\u003E - Sam\u003C/p\u003E\u003Cp\u003EEDIT: I assume you will also need a monitor and other peripherals?\u003C/p\u003E\u003Cp\u003EEDIT2: Apparently you cant transfer licences anymore.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-27T15:52:25Z\u0022 title=\u002205/27/2015 03:52  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 27, 2015\u003C/time\u003E by sam.johnson841\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SpaceChipmunk","CreatedById":142023,"CreatedDateTime":"2015-05-27T15:25:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sam.johnson841\u0022 data-cite=\u0022sam.johnson841\u0022\u003E\u003Cdiv\u003EAlso not that the machine doesn\u0027t come with an operating system, you will need to buy one or use a free one. Alternatively i think you can transfer the licence from your laptop.\u003Cp\u003E - Sam\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Etechnically Microsoft allow you to install your Desktop Windows operating system on your laptop, however I am not sure if it matters whether you do it in reverse?\u003C/p\u003E\u003Cp\u003EThough it might be a good move to download an ISO of SteamOS which is Linux based. Make the most use of all that lovely RAM!\u003C/p\u003E\n"},{"CreatedByName":"Stormweaver","CreatedById":96698,"CreatedDateTime":"2015-05-27T15:26:46Z","Content":"\n\u003Cp\u003EAye, building something yourself is probably going to be a better bet - even here in the UK. Pre-builts have to cut a fair few corners to get decent looking prices, and you don\u0027t want to have re-buy everything further down the line because your PSU failed and fried everything, or the supplied cooling let everything fry itself.\u003C/p\u003E\u003Cp\u003EAs a general rule, if you see a pre-build with \u0027ultra fast\u0027 or \u0027gaming\u0027 anywhere in the title, I\u0027d stay away.\u003C/p\u003E\n"},{"CreatedByName":"lazarus1024","CreatedById":65276,"CreatedDateTime":"2015-05-27T15:33:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SpaceChipmunk\u0022 data-cite=\u0022SpaceChipmunk\u0022\u003E\u003Cdiv\u003ETo add my opinion to this debate. I work in IT and always build my own machines, plus I know Unity 5 quite well. This machine will do the job and do it well. But if you want to play anything a bit more advanced then you would need to get a new dedicated Graphics Card. yes Intel has better performance for their CPU, but for KSP you will not really notice a great deal of improvement between the two. It is a quad core, it has a lot of RAM. The power supply is perfectly fine. Even upgrading the GPU the 500 would be fine (especially if you go for nVidia rather than AMD).\u003Cp\u003Eedit: you will not notice any difference in performance from this cpu and an i3 (An i3 is not an ideal gaming processor at all. Always best to look at i5 or i7)\u003C/p\u003E\u003Cp\u003EFor the price it is good. But it will not future proof you. But in the future you could re-use parts (like HDD, RAM) in a better machine when you have more cash!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESince KSP is currently a lot more focused on single thread performance...that isn\u0027t true at all.\u003C/p\u003E\u003Cp\u003EAlso back to AMD versus Intel...yeah, you\u0027ll probably notice a big difference. My Laptop has roughly similar single thread performance to most of the newer AMD desktop processors. I can tell you I notice a BIG difference between my desktop and laptop with extremely low graphical settings (to ensure zero of the bottlenecks are the iGPU on my laptop). Yeah, my laptop will handle some fairly good sized ships, but my desktop is a beast in comparison. Which it should with a good 60% higher single thread performance.\u003C/p\u003E\u003Cp\u003EYeah, I\u0027ve limited the threads on my desktop so I can ensure the \u0022quad core\u0022 part wasn\u0027t coming in to play (technically, my laptop had more threads because it is hyperthreaded and my desktop isn\u0027t).\u003C/p\u003E\u003Cp\u003EKSP relies heavily on single thread performance right now.\u003C/p\u003E\n"},{"CreatedByName":"LostOblivion","CreatedById":111504,"CreatedDateTime":"2015-05-27T15:34:57Z","Content":"\n\u003Cp\u003EI built my gaming rig almost 7 years ago and overclocked it, and it still won\u0027t throw in the towel when it comes to performance in new games. Today\u0027s computers don\u0027t get outdated as quickly as they did 15-20 years ago, so when buying a new computer today, you might indeed spend a few more bucks with a smile, because you know it\u0027ll last a long time if you treat it well.\u003C/p\u003E\n"},{"CreatedByName":"lazarus1024","CreatedById":65276,"CreatedDateTime":"2015-05-27T15:35:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SpaceChipmunk\u0022 data-cite=\u0022SpaceChipmunk\u0022\u003E\u003Cdiv\u003Etechnically Microsoft allow you to install your Desktop Windows operating system on your laptop, however I am not sure if it matters whether you do it in reverse?\u003Cp\u003EThough it might be a good move to download an ISO of SteamOS which is Linux based. Make the most use of all that lovely RAM!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EErr, no, you cannot transfer the license. It is locked to the BIOS. Try to move it to a different machine, unless you are desoldering the BIOS to take it with you, Windows will not activate. Calling MS to explain they MIGHT allow the activation if you are swapping boards within a machine. They likely will not give you a telephone activation code if you are swapping across machines entirely.\u003C/p\u003E\n"},{"CreatedByName":"SpaceChipmunk","CreatedById":142023,"CreatedDateTime":"2015-05-27T15:41:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lazarus1024\u0022 data-cite=\u0022lazarus1024\u0022\u003E\u003Cdiv\u003ESince KSP is currently a lot more focused on single thread performance...that isn\u0027t true at all.\u003Cp\u003EAlso back to AMD versus Intel...yeah, you\u0027ll probably notice a big difference. My Laptop has roughly similar single thread performance to most of the newer AMD desktop processors. I can tell you I notice a BIG difference between my desktop and laptop with extremely low graphical settings (to ensure zero of the bottlenecks are the iGPU on my laptop). Yeah, my laptop will handle some fairly good sized ships, but my desktop is a beast in comparison. Which it should with a good 60% higher single thread performance.\u003C/p\u003E\u003Cp\u003EYeah, I\u0027ve limited the threads on my desktop so I can ensure the \u0022quad core\u0022 part wasn\u0027t coming in to play (technically, my laptop had more threads because it is hyperthreaded and my desktop isn\u0027t).\u003C/p\u003E\u003Cp\u003EKSP relies heavily on single thread performance right now.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lazarus1024\u0022 data-cite=\u0022lazarus1024\u0022\u003E\u003Cdiv\u003EErr, no, you cannot transfer the license. It is locked to the BIOS. Try to move it to a different machine, unless you are desoldering the BIOS to take it with you, Windows will not activate. Calling MS to explain they MIGHT allow the activation if you are swapping boards within a machine. They likely will not give you a telephone activation code if you are swapping across machines entirely.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m sorry but you are too focused on the thread issue. While the physics is handled over a single thread (which Unity 5 changes) the application runs like any other application taking whatever thread is available at the time.\u003C/p\u003E\u003Cp\u003EI do believe it is stated in the EULA for Microsoft. I have A LOT of dealing with Microsoft when at work. When you have installed several thousand copies of an operating system and had plenty of issues that needed MS input you get to know little quirks in the way they do business.\u003C/p\u003E\u003Cp\u003EWhat makes you think that running an i3 quad will outperform an AMD quad by such a noticeable amount on a game that is quite frankly hardly a CPU hog? It may have a higher cache, maybe a higher FSB. But the difference is seriously tiny when you are running the game.\u003C/p\u003E\u003Cp\u003EEdit: Just noticed that you limited the threads on your desktop to make sure the cores were not an issue. In that case if there is really such a large performance hit, then I apologise.\u003C/p\u003E\u003Cp\u003EEdit2: Microsoft have withdrawn the ability to install on primary desktop and a laptop. I have been out of the lower end of the support field for longer than I thought it would seem a lot has changed in the past couple of years. So apologies again.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-27T15:50:16Z\u0022 title=\u002205/27/2015 03:50  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 27, 2015\u003C/time\u003E by SpaceChipmunk\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"pincushionman","CreatedById":98495,"CreatedDateTime":"2015-05-27T15:51:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lazarus1024\u0022 data-cite=\u0022lazarus1024\u0022\u003E\u003Cdiv\u003EErr, no, you cannot transfer the license. It is locked to the BIOS. Try to move it to a different machine, unless you are desoldering the BIOS to take it with you, Windows will not activate. Calling MS to explain they MIGHT allow the activation if you are swapping boards within a machine. They likely will not give you a telephone activation code if you are swapping across machines entirely.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt depends what kind of license he already has. If he has a \u0022full\u0022 type he bought in a store (or online, whatever; it\u0027s the $200 or so complete install) he can remove it from the old and put it on the new whenever he wants. If it\u0027s an \u0022OEM\u0022 license (costs sbout half as much on Newegg OR it was preinstalled by the manufacturer) it was locked to the motherboard model on first activation maybe the BIOS, but I think it\u0027s a case of \u0022if your mobo dies, you can swap it with the \u003Cem\u003Eexact same model\u003C/em\u003E and it will be fine\u0022. If it was an upgrade, the upgrade itself can be transferred, but the original OS is still subject to the full/OEM restriction.\u003C/p\u003E\n"},{"CreatedByName":"SpaceChipmunk","CreatedById":142023,"CreatedDateTime":"2015-05-27T15:54:53Z","Content":"\n\u003Cp\u003EYou are right on that count. But we should assume he still wants to use his laptop \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-27T16:27:59Z\u0022 title=\u002205/27/2015 04:27  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 27, 2015\u003C/time\u003E by Red Iron Crown\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sam.johnson841","CreatedById":104846,"CreatedDateTime":"2015-05-27T15:59:36Z","Content":"\n\u003Cp\u003EIf you could, i would squeeze an i3 into your desktop over any \u0022A Series\u0022 chip, it will help with cpu bound games such as KSP, this is due to better instructions per clock than AMD rivals. It also has all right integrated graphics, (source: I use them for a while). Not they will be up to much in games other than KSP and TF2, which you may have to turn settings down for it to run smoothly. A large amount depends on what other things you might want to do/play. How much of a budget you have. Do you have the full licence, as detailed above and what/if any parts do you have already (screen, keyboard, mouse ECT)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E - Sam\u003C/p\u003E\n"},{"CreatedByName":"_Aramchek_","CreatedById":12588,"CreatedDateTime":"2015-05-27T16:03:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SpaceChipmunk\u0022 data-cite=\u0022SpaceChipmunk\u0022\u003E\u003Cdiv\u003Eyes Intel has better performance for their CPU, but for KSP you will not really notice a great deal of improvement between the two. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis statement couldn\u0027t be more wrong, you notice a HUGE difference between Intel/AMD, moreso in KSP than in other games even. Which is saying a lot.\u003C/p\u003E\u003Cp\u003EA stock I5 will will give you a good 20-fps advantage over a heavily clocked AMD quad/octo core cpu.\u003C/p\u003E\u003Cp\u003EAnd when you overclock the I5....the fps difference widens even more.\u003C/p\u003E\u003Cp\u003EDo not buy AMD for KSP, even a dual core intel will be faster. Look up Dmagic\u0027s thread from a while back, it\u0027s a fairly thorough comparison and will show you what I\u0027ve just said is true.\u003C/p\u003E\u003Cp\u003EI know this is from an older version of KSP, but performance is roughly the same now as it was then. \u003C/p\u003E\u003Cp\u003EAMD does not do well for KSP.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/42877-CPU-Performance-Database\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/42877-CPU-Performance-Database\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-27T16:11:28Z\u0022 title=\u002205/27/2015 04:11  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 27, 2015\u003C/time\u003E by _Aramchek_\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SpaceChipmunk","CreatedById":142023,"CreatedDateTime":"2015-05-27T16:12:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022_Aramchek_\u0022 data-cite=\u0022_Aramchek_\u0022\u003E\u003Cdiv\u003EThis statement couldn\u0027t be more wrong, you notice a HUGE difference between Intel/AMD, moreso in KSP than in other games even. Which is saying a lot.\u003Cp\u003EA stock I5 will will give you a good 20-fps advantage over a heavily clocked AMD quad/octo core cpu.\u003C/p\u003E\u003Cp\u003EI know this is from an older version of KSP, but performance is roughly the same now as it was then. \u003C/p\u003E\u003Cp\u003EAMD does not do well for KSP.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/42877-CPU-Performance-Database\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/42877-CPU-Performance-Database\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnd when you overclock the I5....the fps difference widens even more.\u003C/p\u003E\u003Cp\u003EDo not buy AMD for KSP, even a dual core intel will be faster. Look up Dmagic\u0027s thread from a while back, it\u0027s a fairly thorough comparison and will show you what I\u0027ve just said is true.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI since retracted the statement. But we were not talkin about an i5. We were talking about an i3 its little brother. The i3 has smaller cache and a cut down command set. Yet lazarus has pointed out that he has tested the two, so I am willing to concede the point.\u003C/p\u003E\n"},{"CreatedByName":"pincushionman","CreatedById":98495,"CreatedDateTime":"2015-05-27T16:14:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SpaceChipmunk\u0022 data-cite=\u0022SpaceChipmunk\u0022\u003E\u003Cdiv\u003EYou are right on that count. But we should assume he still wants to use his laptop \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003EÃ¢â‚¬Â¦\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat is a decision he will need to consider himself, but it is a fair point. Alternately, he could consider a Linux distro for one or both computers.\u003C/p\u003E\u003Cp\u003ENewegg has OEM versions of both 7 and 8.1 home/pro for $99/140, or full versions (transferrable) of 8.1 For $120/200. Either of these offer free upgrades to win10 for the first year (your old computer probably qualifies too, if it\u0027s 7 or 8).\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SpaceChipmunk\u0022 data-cite=\u0022SpaceChipmunk\u0022\u003E\u003Cdiv\u003EÃ¢â‚¬Â¦Been using it for a few months and it is brilliant. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003EGlad to hear this.\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-27T16:28:36Z\u0022 title=\u002205/27/2015 04:28  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 27, 2015\u003C/time\u003E by Red Iron Crown\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"_Aramchek_","CreatedById":12588,"CreatedDateTime":"2015-05-27T16:16:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SpaceChipmunk\u0022 data-cite=\u0022SpaceChipmunk\u0022\u003E\u003Cdiv\u003EI since retracted the statement. But we were not talkin about an i5. We were talking about an i3 its little brother. The i3 has smaller cache and a cut down command set. Yet lazarus has pointed out that he has tested the two, so I am willing to concede the point.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAn I3 will still be faster than any quad/octo AMD cpu as well, I know from personal experience/have tried various cpu\u0027s in the game myself.\u003C/p\u003E\u003Cp\u003EA dual core I3 will wipe the floor with whatever AMD cpu you compare it to, especially in this game. IPC is king for physics calc\u0027s, and those calc\u0027s are the biggest bottleneck of the game.\u003C/p\u003E\n"},{"CreatedByName":"SpaceChipmunk","CreatedById":142023,"CreatedDateTime":"2015-05-27T16:20:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022_Aramchek_\u0022 data-cite=\u0022_Aramchek_\u0022\u003E\u003Cdiv\u003EAn I3 will still be faster than any quad/octo AMD cpu as well, I know from personal experience/have tried various cpu\u0027s in the game myself.\u003Cp\u003EA dual core I3 will wipe the floor with whatever AMD cpu you compare it to, especially in this game. IPC is king for physics calc\u0027s, and those calc\u0027s are the biggest bottleneck of the game.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EApologies for double post. This is only true with some games and applications. Some levels of AMD, normally their hex and octo cores are far superior to the i3, but then they are more expensive and really get destroyed by the Intel equivalents. I was running a 7 year old i7 and it completely wiped the floor with my brothers year old octo core AMD. I now use an OC\u0027d i5 and it still outperforms his machine.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-27T16:28:59Z\u0022 title=\u002205/27/2015 04:28  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 27, 2015\u003C/time\u003E by Red Iron Crown\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2015-05-27T16:51:20Z","Content":"\n\u003Cp\u003E...and somewhere, the threadstarter sits and wonders what the heck he kicked loose \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"}]}