{"TopicId":111020,"ForumId":70,"TopicTitle":"Stuttering with UI on","CreatedByName":"zeropositivo","CreatedById":133563,"CreatedDateTime":"2015-05-27T15:23:46Z","PageNum":1,"Articles":[{"CreatedByName":"zeropositivo","CreatedById":133563,"CreatedDateTime":"2015-05-27T15:23:46Z","Content":"Modlist here: [http://pastebin.com/1NQWSikC](http://pastebin.com/1NQWSikC)\n\nHello. As the Pastebin also shows, I\u0027m running Kubuntu 14.04 and KSP 64bit 1.0.2\n\nI have noticed that my performance was really poor ingame, so I installed GCMonitor to find out a bit more about what was going on, and what I could remove to improve the framerate\n\nAs it turns out, framerate was NOT being recorded as being an issue, instead being stable at 25-30 fps (yea yea not perfect, whatever, I can live with 25). But the game stutters all over the place. Interestingly enough, if I hide the UI (f2) the stuttering is gone completely.\n\nLooking around a bit, I found that Contrac Window \u002B was often cited as being a heavy offender when it comes for this issue, so I removed that, as well as other UI-heavy mods I had. The situation has improved, slightly, but when playing with the UI on, there\u0027s still a noticeable stuttering issue\n\nQuestion is, is it possible to fix? If not, what do I need to remove to lessen the effect as much as possible?\n\nThank you very much for the assistance, let me know if anything else is required"},{"CreatedByName":"zeropositivo","CreatedById":133563,"CreatedDateTime":"2015-05-28T19:21:23Z","Content":"I hate to do this, but any assistance would really be welcome..."},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-05-28T19:24:11Z","Content":"I don\u0027t know about addons, but the stock game will stutter if your mouse polling rate is too high, and most gamers have a high DPI mouse these days."},{"CreatedByName":"zeropositivo","CreatedById":133563,"CreatedDateTime":"2015-05-28T19:31:33Z","Content":"\u003E \n\u003E I don\u0027t know about addons, but the stock game will stutter if your mouse polling rate is too high, and most gamers have a high DPI mouse these days.\n\nis it as simple as reducing mouse DPI, or is there another trick to it? \n\nThanks for the reply"},{"CreatedByName":"OddFunction","CreatedById":143805,"CreatedDateTime":"2015-05-28T21:40:57Z","Content":"OP,\n\nI am a linux 64bit user. I had horrible stuttering just like you. I fixed it with the following post:\n\n[http://forum.kerbalspaceprogram.com/threads/94378-Linux-Camera-Rotation-Stutter?p=1898724\u0026viewfull=1#post1898724](https://forum.kerbalspaceprogram.com/threads/94378-Linux-Camera-Rotation-Stutter?p=1898724\u0026viewfull=1#post1898724)\n\nYou need to change your mouse polling rate, changing the DPI will do nothing. However after you change the polling rate to 125hz you will notice a huge difference. It went from being unplayable for me to very smooth.\n\nPlease note that many gaming mouses do not support linux. So in order for your new \u0027125hz\u0027 setting to stick permanantly, you\u0027ll need to boot into an operating system that has your mouse drivers installed (usually windows), save the new profile with the new polling rate to the mouse instead of the system, and when you reboot in linux it should stick with the new settings. That\u0027s how I did it and I have absolutely no problems at all. Logitech g700 here.\n\nGood luck and be sure to post back your results."},{"CreatedByName":"zeropositivo","CreatedById":133563,"CreatedDateTime":"2015-05-29T16:49:30Z","Content":"Thanks. Changing mouse polling rate helped somewhat, and now dragging doesn\u0027t stutter\n\nHowever, the UI is still a major source for the remaining of the stuttering"},{"CreatedByName":"OddFunction","CreatedById":143805,"CreatedDateTime":"2015-05-29T19:18:28Z","Content":"\u003E \n\u003E Thanks. Changing mouse polling rate helped somewhat, and now dragging doesn\u0027t stutter\n\u003E However, the UI is still a major source for the remaining of the stuttering\n\nFor your Linux, are you using the Proprietary drivers or the opensource ones? Do you have a Nvidia or AMD videocard?"},{"CreatedByName":"zeropositivo","CreatedById":133563,"CreatedDateTime":"2015-05-29T19:56:14Z","Content":"I recently had some issues with drivers, so I did a complete wipe of the OS, and reinstalled everything from scratch\n\nI\u0027m running an Nvidia Geforce GTX 850m with the proprietary Nvidia drivers"},{"CreatedByName":"OddFunction","CreatedById":143805,"CreatedDateTime":"2015-05-29T20:03:18Z","Content":"\u003E \n\u003E I recently had some issues with drivers, so I did a complete wipe of the OS, and reinstalled everything from scratch\n\u003E I\u0027m running an Nvidia Geforce GTX 850m with the proprietary Nvidia drivers\n\nSame as me.\n\nUnfortunately I do not know how to further diagnose your problem then. Hopefully somebody else will. Good luck!"},{"CreatedByName":"zeropositivo","CreatedById":133563,"CreatedDateTime":"2015-05-29T21:21:29Z","Content":"\u003E \n\u003E Same as me.\n\u003E Unfortunately I do not know how to further diagnose your problem then. Hopefully somebody else will. Good luck!\n\nWell, that\u0027s a shame. Thanks pal!"},{"CreatedByName":"cybersol","CreatedById":81136,"CreatedDateTime":"2015-05-30T08:14:21Z","Content":"I can confirm your symptoms of a slow game interface, and that some mods cause it to be worse. Also, removing the UI does help everything a LOT here. I have no solution for you, but I am having similar behavior on Gentoo Linux with Nvidia drivers."}]}