{"TopicId":111112,"ForumId":18,"TopicTitle":"Iss","CreatedByName":"uglyduckling81","CreatedById":129740,"CreatedDateTime":"2015-05-28T07:33:20Z","PageNum":1,"Articles":[{"CreatedByName":"uglyduckling81","CreatedById":129740,"CreatedDateTime":"2015-05-28T07:33:20Z","Content":"I\u0027ve been watching the ISS on live stream for about 30 minutes. It looks to me that it has some solar arrays in the camera shot which either don\u0027t rotate and aren\u0027t fitted with panels on both sides or the rotator is broken as the panels (it looks like a static item), if there are any are not facing the sun.\n\nThe camera changes every now and then so I took a screen shot of what I\u0027m talking about.\n\n[![4meLjeA.jpg](http://i.imgur.com/4meLjeA.jpg)](http://imgur.com/4meLjeA)\n\n[http://www.esa.int/Our_Activities/Human_Spaceflight/International_Space_Station/Where_is_the_International_Space_Station](http://www.esa.int/Our_Activities/Human_Spaceflight/International_Space_Station/Where_is_the_International_Space_Station)"},{"CreatedByName":"Pipcard","CreatedById":2541,"CreatedDateTime":"2015-05-28T08:12:15Z","Content":"That\u0027s part of a Soyuz or Progress spacecraft."},{"CreatedByName":"uglyduckling81","CreatedById":129740,"CreatedDateTime":"2015-05-28T08:29:06Z","Content":"\u003E \n\u003E That\u0027s part of a Soyuz or Progress spacecraft.\n\nSo the ISS just flew over my house. It was so bright in the sky. It\u0027s just gone dark here (slightly past dusk), so I guess the sun was still hitting the ISS. It was like a huge spotlight in the sky going over. Very impressed. My 2.5yr old was very excited by it as well and made me jump with him to reach it."},{"CreatedByName":"ChrisSpace","CreatedById":140622,"CreatedDateTime":"2015-05-28T08:36:20Z","Content":"It is interesting how-\n\n-Wait, what, okay this just in:\n\nTonight, about half an hour ago, my mum rushed me outside to see the ISS passing over, and I did see the station with my own eyes! It basically looked like a moving star, but to me it was... beautiful. A perfect symbol of what can be achieved when the world works together instead of killing each other. That brief minute or so when mum and I saw it coming over, it was quite emotional."},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2015-05-29T21:00:17Z","Content":"What you see there in that pic is not part of the ISS. That is the Russian Soyuz/Progress with its fixed solar panels docked to the ISS. As for seeing the ISS. It\u0027s actually more frequent then you imagine. Check out Heavens Above and enter your location information it\u0027ll give you everything you need to know in order to spot the ISS and everything else that\u0027s up there."}]}