{"TopicId":111118,"ForumId":18,"TopicTitle":"For the first time ever, i have seen the ISS. Who else has?","CreatedByName":"ChrisSpace","CreatedById":140622,"CreatedDateTime":"2015-05-28T08:56:31Z","PageNum":1,"Articles":[{"CreatedByName":"ChrisSpace","CreatedById":140622,"CreatedDateTime":"2015-05-28T08:56:31Z","Content":"This evening, about half an hour ago, my mum asked me what time it was and when I told her, she immediately rushed me outside. At first I was like \u0027Have we forgotten to get the bins out again?\u0027, but then she pointed up at the clear sky. Since there are no bins in the sky, this got me quite interested in what mum was trying to show me. And then she told me, and I saw it.\n\nI remember back when I was a little kid, every night I would come out with my telescope to look at the moon and sometimes other space things. It was cool to observe the lunar landscape, with the valleys and mountains and craters and highlands and ballast flats. At other times I saw the couldy stripes of Jupiter, and the jovian moons. I think I even saw venus or mars once. But I never saw something man-made, never a satellite or space station. That was all I wanted, to see something while its \u0027alive\u0027. \n\nTonight, I saw it. The international Space Station, right there before my eyes. A true symbol of what the world is capable of in space, when we stop fighting and work together on something. Sure, I saw the decommissioned space shuttle at the Kennedy Space Center 2 or 3 years ago, along with a bunch of other cold-war relics. But here was an object, an operational human station that was operational right as I saw it and had people inside right as I saw it. This was the first time I had seen anything *like* that. It gave me a feeling, a kind of emotion, that I had not felt since the Kennedy Space Center, or when first saw the lunar landscape through a telescope and thought \u0027people have actually gone there\u0027.\n\nAnyway, enough about me, have any of you seen the ISS before? Or any other satellite?"},{"CreatedByName":"Yukon0009","CreatedById":109376,"CreatedDateTime":"2015-05-28T09:05:39Z","Content":"\\*sigh\\*\n\nI never saw any astronomical objects besides Jupiter, the Moon and a handful of stars, because of the apalling air pollution here where I live."},{"CreatedByName":"r4pt0r","CreatedById":90471,"CreatedDateTime":"2015-05-28T09:15:59Z","Content":"I\u0027ve seen a few satalites, and mars, the moon of course, but my favorite has been Saturn. With the scope I used, the rings diameter was about the size of a penny at arms length. Saturn moved across the eyepiece in less than 10 seconds, so keeping track of it was fun.\n\nJust mind blowing how distant and massive space is."},{"CreatedByName":"maltesh","CreatedById":17144,"CreatedDateTime":"2015-05-28T09:45:55Z","Content":"A couple years ago, , when I was mucking around with Google Shee\u0027ts scripting, I wound up hacking together a script that would scrape the Heavens Above site for my location, and put the results into my Google Calendar. I had a bit more free time back then, so I\u0027d go out and look at the ISS every time the skies were clear and Heavens Above predicted a -3.0 Magnitude pass or brighter for the ISS, or Iridium Flares brighter than -7.0. At the mid-latitudes, I\u0027d generally say that days on which the ISS can be seen (assuming clear skies), either in the post-sunset hours, or in the pre-dawn hours, are more common than ones where it can\u0027t.\n\nI trhink I\u0027ve seen Tiangong-1 once. It was nowhere near as bright as the ISS."},{"CreatedByName":"SpaceChipmunk","CreatedById":142023,"CreatedDateTime":"2015-05-28T10:10:50Z","Content":"Would love to see the ISS. \n\nI have seen pretty much all the planets and some satellites. See Jupiter and Saturn through the big telescope at Greenwich Royal Observatory (London, England). I don\u0027t think it is possible to see a more humbling sight. I am not normally lost for words, but there really are no words to describe the sheer majesty of the sight. Highly recommended! ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-05-28T10:33:58Z","Content":"You have an awesome mom.\n\nISS flash by way too fast for a telescope to see it anytime longer than a fraction of a second, sadly enough, or you could have set up something and took a picture for us through the scope."},{"CreatedByName":"Columbia","CreatedById":135031,"CreatedDateTime":"2015-05-28T10:45:09Z","Content":"Dammit I\u0027m so jelly ![:sticktongue:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif)\n\nBecause of where I live (Manila), never seen much astronomical objects *although I\u0027d desperately want to..* ![;.;](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif)"},{"CreatedByName":"benzman","CreatedById":82512,"CreatedDateTime":"2015-05-28T10:45:50Z","Content":"When I was fourteen years old I stood on a street corner and watched the first Sputnik fly over. It was the most amazing thing that I had ever seen. Since then, like everyone, I have seen any number of satellites. They are like shooting stars, stay outside for a while on any clear night and you will see them, but a few years ago I went out especially to see the ISS. It is vastly different to see a moving light in the sky and know that there are actually people living up there. Amazing."},{"CreatedByName":"razark","CreatedById":32993,"CreatedDateTime":"2015-05-28T11:42:51Z","Content":"I\u0027ve seen ISS many times, and many other satellites.\n\nI remember seeing Mir and a shuttle many years ago. It was awesome seeing those two lights moving across the sky."},{"CreatedByName":"StrandedonEarth","CreatedById":89439,"CreatedDateTime":"2015-05-28T21:04:22Z","Content":"I\u0027ve seen numerous satellites and the ISS a few times. I even saw it getting chased by a Dragon a couple of times. \n\nStargazing (meteor and satellite spotting) is my favourite part of camping."},{"CreatedByName":"CelticCossack51","CreatedById":127600,"CreatedDateTime":"2015-05-28T22:14:27Z","Content":"A number of years ago, I think it was near Christmas, I believed I saw the ISS from my backyard. I was not quite sure, but it was too dim and quick to be an airplane."},{"CreatedByName":"razark","CreatedById":32993,"CreatedDateTime":"2015-05-28T22:46:04Z","Content":"No one has posted this yet?\n\nGet out there and see some space stuff!\n\n[http://www.heavens-above.com](http://www.heavens-above.com)"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2015-05-28T23:00:23Z","Content":"The ISS? Yes. Spotted it over Houston a couple months back. \n\nOther satellites? Yes, a few of those too, usually things in polar orbit because their motion jumps out. Where I grew up the skies were clear and there was hardly ever light pollution, so things were easy to see. You\u0027d have no idea what it was though, unlike today where you can pull out StarWalk or something similar on your phone and look it up. \n\nThe clouds of Jupiter? Never. The telescope I had as a kid was pretty bad, as were my eyes, and there\u0027s no sense in buying one with where I live now. Saturn\u0027s rings? Never."},{"CreatedByName":"Flymetothemun","CreatedById":17689,"CreatedDateTime":"2015-05-28T23:01:35Z","Content":"Huh, I wish. Every time the ISS flyover calculator (Can\u0027t remember the website, I think it had Astroscan in the title) calculates a time where it\u0027ll be bright enough there\u0027s always clouds, rain, sun, or fireworks."},{"CreatedByName":"The Destroyer","CreatedById":36109,"CreatedDateTime":"2015-05-28T23:21:58Z","Content":"I got an app, got up at 6 am, and I didn\u0027t see it... ![:(](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif)"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2015-05-29T00:39:56Z","Content":"I saw Mir, ISS, few shuttles, Tiangong, handful of satellites (lost count of it) and all of the planets visible with naked eye, from Mercury to Uranus.\n\n\u003E \n\u003E \\*sigh\\*\n\u003E I never saw any astronomical objects besides Jupiter, the Moon and a handful of stars, because of the apalling air pollution here where I live.\n\nIf you saw Jupiter and Venus, ISS is also visible. It\u0027s extremely bright when it\u0027s overhead."},{"CreatedByName":"Newt","CreatedById":131025,"CreatedDateTime":"2015-05-29T03:16:23Z","Content":"I live in an area with nice (that is to say, very little) light pollution. Outside of a small town with three observatories. I can see satellites just by looking at the sky in the eveneings, sometimes I have seen more than thirty in a night. Plus the planets, of course. Moons of Jupiter are fun to watch zipping around, and I have had some interesting times looking for specific features on the Moon as well.\n\nThe ISS is always very neat to see. Incredibly bright, fast, and big. I probably have seen it more often than I realize, as often when I do see it, it is by thinking that the path, size and speed were consistent and then checking. I do not always check.\n\nOne site that I have found useful in checking the times that the ISS will fly over is [here](http://iss.astroviewer.net/observation.php). Also, [this](http://www.stoff.pl/) peice of software can be quite helpful for general satelite tracking, if anyone is interested."},{"CreatedByName":"Jonboy","CreatedById":134111,"CreatedDateTime":"2015-05-29T03:39:34Z","Content":"Back in January, I flew down to Kennedy Space Center for a day to watch the CRS-5 Falcon 9 launch. ISS passed right overhead a few minutes before the launch window, which was awesome. Since it was directly overhead, it was visible for quite a few minutes. Unfortunately, the launch was scrubbed at about T-30 seconds, so I didn\u0027t get to see the launch. Overall, it was very cool."},{"CreatedByName":"ChrisSpace","CreatedById":140622,"CreatedDateTime":"2015-05-29T08:31:58Z","Content":"Well, today mum brought me out just in time to see it again. I got an app now that shows where all the satellites and space stations are from my location, and I think I might get a few tiangong sightings soon:D"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2015-05-29T11:33:57Z","Content":"The staple of satellite tracking is [Heavens Above](http://heavens-above.com/). That site (and since recently, it has an application for smartphones, too) is the granddaddy of satellite tracking sites. Luckily, it still uses plain HTML style so that even if you\u0027re god knows where with a poor connection, you will be able to load the data, unlike other sites which pepper the pages with useless animations and other stuff."},{"CreatedByName":"hugix","CreatedById":55379,"CreatedDateTime":"2015-05-29T14:36:36Z","Content":"NASA has a email service that sends you E-mails / text messages that alert you when a visible pass is near your area. \n\nspotthestation.nasa.gov\n\nIt works quite well I\u0027ve seen the ISS about 20-30 times now thanks to the alerts."},{"CreatedByName":"worir4","CreatedById":75980,"CreatedDateTime":"2015-05-29T14:42:14Z","Content":"It moves so fast in the sky. When i first saw it i thought it was a plane but it was so bright. Still, it only looks like a fast moving dot to me."},{"CreatedByName":"Trann","CreatedById":83801,"CreatedDateTime":"2015-05-29T16:32:19Z","Content":"Living on the rural prairie, I\u0027ve seen it many times. My favourite was when I was in Florida on vacation and the final launch of Discovery (STS-133) was supposed to happen around then but it got delayed. Months later, I caught sight of it at home chasing down ISS in the early evening sky. Very cool."},{"CreatedByName":"jmiki8","CreatedById":94688,"CreatedDateTime":"2015-05-29T17:00:14Z","Content":"I\u0027ve observed the ISS once, with my uncle\u0027s professional 300/1500 (300 mm is the primary mirror\u0027s diameter!) Newtonian telescope. I used its motorized tracking mount to follow the ISS, as it rushed through the sky in some seconds."},{"CreatedByName":"LABHOUSE","CreatedById":107761,"CreatedDateTime":"2015-05-30T03:37:29Z","Content":"I have saw the ISS, the last time the shuttle landed, all the planets (and dwarf planets) except uranus, and neptune."}]}