{"TopicId":11119,"ForumId":25,"TopicTitle":"The Sattelite Retrieval challenge!","CreatedByName":"Speider","CreatedById":25920,"CreatedDateTime":"2012-05-21T13:56:07Z","PageNum":1,"Articles":[{"CreatedByName":"Speider","CreatedById":25920,"CreatedDateTime":"2012-05-21T13:56:07Z","Content":"\n\u003Cp\u003EHi guys! \u003C/p\u003E\u003Cp\u003EAre you ready for The Kerbin Sattelite Retrieval Challenge?\u003C/p\u003E\u003Cp\u003EEasy as pie, it is. Using (hopefully) no more than two (2) crews total, not only must you put a sattelite in \u003C/p\u003E\u003Cp\u003Eorbit around Kerbin, but you will have to bring it down again. The challenge is scored on an easy system, \u003C/p\u003E\u003Cp\u003Eso by showing screenshots, or even better, a mission video, we can all revel in the awesomeness of the \u003C/p\u003E\u003Cp\u003Eobjectively most awesome astronauts and engineers Kerbin can muster.\u003C/p\u003E\u003Cp\u003EHere\\\u0027s the scoring:\u003C/p\u003E\u003Cp\u003E1 point for putting a sattelite in orbit.\u003C/p\u003E\u003Cp\u003E1 point for getting the sattelite back to Kerbin. (on a separate launch)\u003C/p\u003E\u003Cp\u003E1 point for not killing more than 6 astronauts. (2 crews)\u003C/p\u003E\u003Cp\u003E5 points for only using 3 astronauts (1 crew)\u003C/p\u003E\u003Cp\u003E5 points for bringing down the sattelite less than 1 km from KSA\u003C/p\u003E\u003Cp\u003E10 points for bringing the sattelite down to Kerbin in one piece (as in: not explode)\u003C/p\u003E\u003Cp\u003E1 point for screenshots OR 2 points for mission video\u003C/p\u003E\u003Cp\u003EPost your story/pictures/mission video and your score here. Can you manage 20 or more points,\u003C/p\u003E\u003Cp\u003Eand have your astronauts join the elitest of the elite?\u003C/p\u003E\u003Cp\u003EP.S. Mods are fully allowed, but if you want to use a radio controlled ship, you must first use your astronauts for comsat-deployment.\u003C/p\u003E\u003Cp\u003EP.P.S. Initial deployment of sattelite MUST be done by astronauts.\u003C/p\u003E\u003Cp\u003EP.P.P.S. Be creative and resourceful when it comes to bringing down a sattelite in one piece. Using robot claws are encouraged.\u003C/p\u003E\u003Cp\u003ELet the challenge begin!\u003C/p\u003E\u003Cp\u003EP.P.P.P.S. Feel free to post a message if you\\\u0027re embarking on the challenge, \u003C/p\u003E\u003Cp\u003Eand to give feedback on whether or not it seems doable, too hard, too easy etc. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}