{"TopicId":111237,"ForumId":16,"TopicTitle":"Supersized rover tips?","CreatedByName":"MiniMatt","CreatedById":78749,"CreatedDateTime":"2015-05-29T11:39:10Z","PageNum":1,"Articles":[{"CreatedByName":"MiniMatt","CreatedById":78749,"CreatedDateTime":"2015-05-29T11:39:10Z","Content":"\n\u003Cp\u003ENow, I\u0027m pretty good at regular rovers, I may even go so far as to say very good - I can churn out effective light autonomous science rovers and moon buggies and, with judicious use of the f5 key, race around lunar landscapes all day long.\u003C/p\u003E\u003Cp\u003EBut with 1.0.x bringing mining, the need for much larger rovers has become apparent - fuel tankers and mobile drilling rigs etc. I\u0027m having increasing difficulty designing rovers of this size which don\u0027t eat their own wheels or shake them off their mountings. Clearly Unity 5, with it\u0027s reworked wheel colliders, is likely to make significant improvements in this regard, but for the meantime, wondering if anyone has any hints?\u003C/p\u003E\u003Cp\u003EThose I\u0027ve managed to deduce thus far seem to be:\u003C/p\u003E\u003Cp\u003E1) Consider if you need powered wheels at all - plane landing gear, especially the original (LY-10), coupled with rocket thrust can work quite well in low gravity vacuums.\u003C/p\u003E\u003Cp\u003E2) Less may be more - more wheels (often needed to support greater mass without compressing suspension down to it\u0027s stops) seems to correlate to wheels shaking themselves to pieces the moment you encounter slightly uneven terrain or try to turn.\u003C/p\u003E\u003Cp\u003E3) Enable steering on as few wheels as possible - steering sets up all manner of friction differentials which seem to overwhelm wheel mountings.\u003C/p\u003E\u003Cp\u003E4) Try using the inflatable (Rovemax Model M1) wheel rather than (TR-2L) rugged wheel. Whilst the rugged wheel would seem the obvious choice (and is lighter, and more impact tolerant than the inflatable wheel) it seems to have extra friction - a great thing on smaller rovers, but enough to rip wheels from their mountings on larger 8\u002B wheeled rovers.\u003C/p\u003E\u003Cp\u003EAny other tips people can offer? Any mountings which people are finding better than others at keeping wheels attached? Landing gear \u002B powered wheel combinations? Maximum mass per wheel in a given gravity? Trail steering or forward steering?\u003C/p\u003E\n"},{"CreatedByName":"Docsprock","CreatedById":113468,"CreatedDateTime":"2015-05-29T11:54:23Z","Content":"\n\u003Cp\u003EI use the ruggedized wheels on most of my rovers. Very few problems unless going too fast. I usually attach them to the ends of I-beams, (depending on design)\u003C/p\u003E\u003Cp\u003EI also use struts to web the wheels into position. Generally 2 tons mass/wheel is the maximum I feel comfortable with.\u003C/p\u003E\n"},{"CreatedByName":"MiniMatt","CreatedById":78749,"CreatedDateTime":"2015-05-29T12:10:27Z","Content":"\n\u003Cp\u003EThanks, I\u0027ll have to try with i-beams, been using modular XL girders a lot lately, and they\u0027re not as sticky as I\u0027d like. Been trying to avoid strut-welding each individual wheel if at all possible as it increases part count significantly once you\u0027re into the realms of 16\u002B wheeled 50 ton tankers.\u003C/p\u003E\n"},{"CreatedByName":"Feradose","CreatedById":111211,"CreatedDateTime":"2015-05-29T12:39:16Z","Content":"\n\u003Cp\u003EI use the ruggedized wheels with only front pair steering and only back ones powering, it might get a bigger turning radius but its very stable if I keep 10 ton per wheel rule (thats kerbin only info, not so sure about mun)\u003C/p\u003E\n"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2015-05-29T12:50:40Z","Content":"\n\u003Cp\u003EDon\u0027t be ashamed to part-clip the large landing gear. They prove quite useful as rover wheels. Do be wary of retracting them if they are clipping, though, as Bad Things\u003Csup\u003Etm\u003C/sup\u003E may happen.\u003C/p\u003E\u003Cp\u003ELess wheels are better for steering.\u003C/p\u003E\u003Cp\u003EEven distribution of wheels if you have more than six is not beneficial to handling. Try grouping them as front steering, middle locked (powered, though) and back steering. All may be powered.\u003C/p\u003E\u003Cp\u003EInverting steering as an action group for rear wheels has an interesting strafing effect.\u003C/p\u003E\u003Cp\u003EMore brake torque on rear wheels will lessen the chance of a braking-induced flip.\u003C/p\u003E\n"},{"CreatedByName":"Ferdoni","CreatedById":140765,"CreatedDateTime":"2015-05-29T13:11:15Z","Content":"\n\u003Cp\u003EMaybe an advanced grabbing unit underneath the rover as an immediate brake?\u003C/p\u003E\n"},{"CreatedByName":"ArchGaden","CreatedById":116362,"CreatedDateTime":"2015-05-29T13:35:37Z","Content":"\n\u003Cp\u003EI-beams and most structural elements are heavy. If you\u0027re going heavy, you might as well just throw on some RoveMax XL3s instead. I say \u0027instead\u0027 because you can mount the RoveMax on structural fuselages or fuel tanks and still reach the ground with plenty of clearance to keep your vessel safe. Structural fuselage is only 0.1t... compared to 0.38 for an I-beam, it practically sells itself! The RoveMax mega-wheels are practically indestructible for any rational use. Structural fuselage weight is low, so you can spread out a bit and make a wide-stable design. Then you can cover some distance without having to drive timidly. Bring some silver cake spray so you can chrome up before the drive. \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/RoveMax_Model_XL3\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.kerbalspaceprogram.com/wiki/RoveMax_Model_XL3\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Structural_Fuselage\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.kerbalspaceprogram.com/wiki/Structural_Fuselage\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EFor big mining rigs, I generally mount the ISRU in the center and stick a big SAS below that, which acts as a mounting ring since parts don\u0027t want to attach to the ISRU. I\u0027ll fix four structural fuselages to the SAS and then add fuel tanks, ore tanks, and fuselages to square off the design. I stick some rovemax XL3s wheels at the corner and fix some terriers for engines wherever they fit, as long as it stays balanced. I generally create an extension with a fuselage that will have a grabber on it, so I can refuel surface vessels as needed. My drill will be on the opposite side from that to keep a better balance. A utility bay a the top will have a probe core, RTGs, batteries and other small bits. A few big solar arrays will finish it off. The whole thing weighs under 20t and will have 2-3k d/v for the engines, allowing landings on most bodies, and for most moons the ability to get back into orbit and land again, sparing some fuel for an orbital refueling operation if needed.\u003C/p\u003E\u003Cp\u003EI\u0027ve tried various combinations of the smaller rover wheels, hoping to cut my weight down, but a mining rig with an ISRU will have to be heavy, and only the XL3 can take that weight. I could go with 10\u002B ruggedized wheels, but those won\u0027t reach the ground from a fuselage, so I\u0027ll have to use I-beams and heavier stuff... resulting in a vessel about the same weight in the end, but with a higher part count and lower durability. The ruggedized wheels can hit a much higher speed though...so if you\u0027re going a long distance on the ground, that might be your best bet. I generally use the terriers and just fly out if I need to go a long distance though.\u003C/p\u003E\u003Cp\u003EI haven\u0027t tried some of the heavier landing gear though... that might be even better for my use cases.\u003C/p\u003E\n"},{"CreatedByName":"MiniMatt","CreatedById":78749,"CreatedDateTime":"2015-05-29T15:00:28Z","Content":"\n\u003Cp\u003EPerhaps some pictures would help:\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/lqUh3\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EFirst picture, 16 wheels - just about works ok, but a lot of disconcerting wheel wobble and absolute max speed of 10m/s (~22mph) around even the gentlest of KSC terrain or it\u0027ll rip it\u0027s own wheels off.\u003C/p\u003E\u003Cp\u003ESecond picture, 6 wheels clearly insufficient for the weight, just rolling off the runway is enough to take all six wheels out.\u003C/p\u003E\u003Cp\u003EThird picture, 10 wheels with all wheels individually strut welded to their mounting girders, results were very similar, slightly worse, than first 16 wheel design.\u003C/p\u003E\u003Cp\u003EFourth picture, hybrid landing gear \u002B two powered wheels - this thing is by far my most successful design - only 2 wheel drive, but can speed around the KSC taking all the slight dips and inclines at full pelt (just under 20m/s) without a hint of wheel wobble or explosions.\u003C/p\u003E\u003Cp\u003EFifth picture, full size tank wheels - I think this design may have some promise (and thanks for the hint ArchGaden - you\u0027re correct, mass difference is fairly negligible) but nevertheless, rolling off the runway at under 15m/s was still sufficient to take out a tyre.\u003C/p\u003E\u003Cp\u003EI suspect it\u0027ll be a case of all these working much better in the field rather than in the relatively high gravity of Kerbin - I\u0027m aiming these things at Dres \u002B lighter gravity environments. Further I\u0027m testing at max load, whereas in the field the most arduous driving is likely to be when it\u0027s near enough empty (ie. landed a km or two out from the refinery).\u003C/p\u003E\n"},{"CreatedByName":"moogoob","CreatedById":118251,"CreatedDateTime":"2015-05-29T16:09:16Z","Content":"\n\u003Cp\u003EFunny to have all these rover threads pop up as I\u0027ve just started seriously experimenting with them too. I\u0027ve noticed that the ruggedized wheels can do this.. bugging out thing. Where you\u0027re driving on Kerbin at 20m/s and the whole thing will bounce about like it was in a frying pan for a few seconds. It also loses some speed and acceleration while this is happening. Perhaps an engine limitation?\u003C/p\u003E\n"},{"CreatedByName":"Peebothuhlu","CreatedById":105537,"CreatedDateTime":"2015-05-29T16:21:06Z","Content":"\n\u003Cp\u003EHello!\u003C/p\u003E\u003Cp\u003ELong time lurker and down loader of the forums. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo!\u003C/p\u003E\u003Cp\u003ERovers!\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://postimg.org/image/z6eunic4t/75c2300a/\u0022 rel=\u0022external nofollow\u0022\u003E Image \u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://postimg.org/image/4ggml6f8n/44e0b17e/\u0022 rel=\u0022external nofollow\u0022\u003E Image \u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThis is my current (In 1.0 what ever) fastest rover design.\u003C/p\u003E\u003Cp\u003EThe rugged wheels are the \u0027fastest\u0027.. Though that \u0027skip\u0027 effect?\u003C/p\u003E\u003Cp\u003Eit\u0027s the space where the different terrain tiles meet causing a glitch. ( I think. Least, that\u0027s where I seem to notice it happening...)\u003C/p\u003E\u003Cp\u003EAs for suspension in low gravity? Remember! Your rover\u0027s mass is still the same. So expect higher speeds and eventually bigger crunches.\u003C/p\u003E\u003Cp\u003EEventually.. the rover pictured will have the small aviation wheels tucked under the main wheel assemblies. The better to absorb low gravity high jumps.\u003C/p\u003E\u003Cp\u003EI\u0027ve been working at rover suspension for a while as well... no where near happy with where I\u0027m at atm. \u003C/p\u003E\u003Cp\u003EHope the image helps. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EMuch cheers to all.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-29T17:45:24Z\u0022 title=\u002205/29/2015 05:45  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 29, 2015\u003C/time\u003E by Peebothuhlu\u003C/strong\u003E\n\u003C/span\u003E\n"}]}