{"TopicId":111464,"ForumId":20,"TopicTitle":"Ornithopter Wings","CreatedByName":"0111narwhalz","CreatedById":110660,"CreatedDateTime":"2015-05-31T04:46:58Z","PageNum":1,"Articles":[{"CreatedByName":"0111narwhalz","CreatedById":110660,"CreatedDateTime":"2015-05-31T04:46:58Z","Content":"\n\u003Cp\u003EAfter rereading Frank Herbert\u0027s \u003Cem\u003EDune\u003C/em\u003E series, I have become somewhat obsessed with ornithopters. In case you didn\u0027t know, ornithopters are vehicles which are propelled by flapping wings, like a bird or an insect. I imagine such a device could be created using snjo\u0027s Firespitter plugin (specifically the VTOL engine functionality) and a clever animation. We\u0027ve seen helicopter engines which transition into wings, courtesy of D12 Aerotech from PolecatEZ. We\u0027ve seen engines which vector thust from vertical to horizontal, in both Firespitter and B9. But, we\u0027ve not seen a winged example (unless, of course, we have, in which case, please reply with a link).\u003C/p\u003E\u003Cp\u003EAnd no, I\u0027m not satisfied with horrific abominations derived from robotics. I tried to create one myself, but it failed to produce thrust.\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2015-05-31T06:03:32Z","Content":"\n\u003Cp\u003EI too still hope this will be done some day. Orni wings get suggested/requested from time to time. I myself did so too a few years ago but they were found to be \u0027unrealistic\u0027 and nobody picked it up. \u003C/p\u003E\u003Cp\u003EBut wait ... Ornithopter wings unrealistic? NERVA and SABRE engines and fusion power only work on paper. Warp drive is still only possible in science fiction. And they are either stock or modded. Ornithopters actually DO WORK in real life. And when you scale it down to model plane size they perform even better.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/a-qS7oN-3tA?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"Shad0wCatcher","CreatedById":98819,"CreatedDateTime":"2015-05-31T18:43:12Z","Content":"\n\u003Cp\u003EDidn\u0027t NERVAs have actual run tests done back in the 50s and 60s before the non-proliferation treaty was signed? Off topic for sure; but food for thought. I too wouldn\u0027t mind seeing ornithopters (even scaled down) as probe propulsion.\u003C/p\u003E\n"}]}