{"TopicId":111408,"ForumId":16,"TopicTitle":"a few issues I\u0027ve encountered","CreatedByName":"ForScience6686","CreatedById":144187,"CreatedDateTime":"2015-05-30T19:03:42Z","PageNum":1,"Articles":[{"CreatedByName":"ForScience6686","CreatedById":144187,"CreatedDateTime":"2015-05-30T19:03:42Z","Content":"First time poster, long time forum browser. First off, thanks to the community for the insight gained here at the forums. Please excuse grammatical errors, I\u0027m posting mobile.\n\nProblem #1: action groups not working on all symmetry placed parts. This is a random occurrence, usually only the part that was selected operates and it takes a revert to get it working, but most likely another group starts acting up. Anyone had similar issues?\n\nProblem #2: very unusual spinning while landing on minimus. Rcs was able to bring it under control, but them started to spin the craft the k opposite direction. Had to revert, and ended the science day for me. This was an odd craft with two identical landers mounted radially. Would it be the extra probe cores or reaction wheels causing this? The problem only occurred once under about 3k altitude on minimus.\n\nIssue #3: will connecting a module to a base via the claw with a docking port on the module satisfy a docking port requirement?\n\nAdvance thanks for any answers."},{"CreatedByName":"moogoob","CreatedById":118251,"CreatedDateTime":"2015-05-30T20:00:24Z","Content":"ALl I can tell you is my experience with #1 - I\u0027ve only seen this happen when I change a part\u0027s placement and/or symmetry AFTER making the action group - it applies itself to one (EG) solar panel (the one I clicked on ro re-place) but not the others."},{"CreatedByName":"Xannari Ferrows","CreatedById":125369,"CreatedDateTime":"2015-05-30T20:15:44Z","Content":"For problem 2, this could be because of your reference calibration. Try hitting Alt\u002BX with SAS off, and on.\n\nFor problem 3, although the crafts will be considered docked by the module state, I believe it is dependent on the parts themselves. [scans the savestate for docking ports]"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-05-30T23:10:58Z","Content":"\u003E \n\u003E First time poster, long time forum browser. First off, thanks to the community for the insight gained here at the forums. Please excuse grammatical errors, I\u0027m posting mobile.\n\nWelcome aboard!\n\n\u003E \n\u003E Problem #1: action groups not working on all symmetry placed parts. This is a random occurrence, usually only the part that was selected operates and it takes a revert to get it working, but most likely another group starts acting up. Anyone had similar issues?\n\nYeah, this is a known annoyance. If you ever move symmetrical parts after you\u0027ve set an action group for them, it hoses the action group. To fix this, go to the action group menu and remove all the actions for that group, then put them back in.\n\n\u003E \n\u003E Problem #2: very unusual spinning while landing on minimus. Rcs was able to bring it under control, but them started to spin the craft the k opposite direction. Had to revert, and ended the science day for me. This was an odd craft with two identical landers mounted radially. Would it be the extra probe cores or reaction wheels causing this? The problem only occurred once under about 3k altitude on minimus.\n\nProbably control shifted to one of the radial landers. This is a frequent annoyance as well. To fix this, right-click on a centrally mounted pod or probe core and select \u0022control from here\u0022. If that doesn\u0027t work, then it\u0027s some other problem I\u0027m unaware of.\n\n\u003E \n\u003E Issue #3: will connecting a module to a base via the claw with a docking port on the module satisfy a docking port requirement?\n\nDunno. Worth trying but don\u0027t be surprised if it doesn\u0027t satisfy the contract."},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2015-05-31T00:27:58Z","Content":"\u003E \n\u003E Problem #1: action groups not working on all symmetry placed parts. This is a random occurrence, usually only the part that was selected operates and it takes a revert to get it working, but most likely another group starts acting up. Anyone had similar issues?\n\nFrom memory, that\u0027s actually intended behaviour - you set action groups for a part and then if you move the part, you must also update the action groups for it. It\u0027s stupid and very weird, but it\u0027s working as intended. If you\u0027re not against modding, Claw\u0027s StockBugFixModules includes a fix for this."},{"CreatedByName":"ForScience6686","CreatedById":144187,"CreatedDateTime":"2015-05-31T15:14:38Z","Content":"Thanks for the help. I\u0027ll keep that in mind for the action groups. Unfortunately my miner is already producing so I won\u0027t be reverting. I disabled the reaction wheels on the landers and everything went smoothly. These landers were adding the docking port and it f did fulfill the base contract. Now I need to figure out a landing platform for my refueling ship. I was thinking a low square pad with a docking port. Land above it and raise the gear to dock. Any suggestions on that aspect?"}]}