{"TopicId":111479,"ForumId":25,"TopicTitle":"[HAVOC] The Hardest Nasa Challenge Ever","CreatedByName":"Rdivine","CreatedById":66317,"CreatedDateTime":"2015-05-31T08:57:33Z","PageNum":1,"Articles":[{"CreatedByName":"Rdivine","CreatedById":66317,"CreatedDateTime":"2015-05-31T08:57:33Z","Content":"\n\u003Cp\u003EGreetings!\u003C/p\u003E\u003Cp\u003EI\u0027m sure many of you have heard about the nasa havoc mission, a plan to explore venus\u0027 atmosphere and its environment. If you haven\u0027t, watch the video below:\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/0az7DEwG68A?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E \u003Cp\u003E---\u003Cstrong\u003ECHALLENGE\u003C/strong\u003E---\u003C/p\u003E\u003Cp\u003EI am aware that there are no airship parts in Kerbal Space Program, so you are allowed to use substitutes, such as chutes, wing clipping, ion engines etc. No rockets and jet engines are allowed to keep the vessel aloft. The vessel must be stock.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYou can cheat your whole vessel to space, but you are not allowed to use cheats after deorbiting. Getting it to space is easy. Getting it to work is hard.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ETo complete the challenge, you must fulfill the criterion.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EEasy\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E-Construct a vessel that can de-orbit from space and re-enter kerbin\u0027s atmosphere, glide at altitudes below 25km, and use a rocket propelled craft to return to space.\u003C/p\u003E\u003Cp\u003E-No requirement to carry any kerbals.\u003C/p\u003E\u003Cp\u003E-Vessel must not have any visible Wing parts.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMedium\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E-Construct a vessel that can de-orbit from space and re-enter kerbin\u0027s atmosphere, glide at altitudes below 25km, and use a rocket propelled craft to return to space\u003C/p\u003E\u003Cp\u003E-Must carry 2 kerbals. No more, no less.\u003C/p\u003E\u003Cp\u003E-Must be able to glide for over 2minutes under 25km in altitude.\u003C/p\u003E\u003Cp\u003E-must not have any visible wing parts.\u003C/p\u003E\u003Cp\u003E-Vessel must contain ALL science gathering instruments, except for seismometer.\u003C/p\u003E\u003Cp\u003E-The return vessel does not require to carry the instruments;kerbals can transfer science around the vessel.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EHard\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E-Construct a vessel that can de-orbit from space and fly below 25km of kerbin, and have a rocket-propelled return ship return to orbit.\u003C/p\u003E\u003Cp\u003E-Vessel must carry 2 kerbals.\u003C/p\u003E\u003Cp\u003E-Vessel must be able to glide for over 2 minutes under 25km, \u003Cem\u003EWhile maintaining a surface speed of more than 200m/s\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E-Vessel must not have any visible wing parts\u003C/p\u003E\u003Cp\u003E-Vessel must carry 2x of all science instruments, but need not carry it back to space.\u003C/p\u003E\u003Cp\u003E-Return vessel MUST be the 1.5m capsule, and capable of docking and rendezvous.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EHardest\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E-Construct a vessel that can de-orbit from space and fly below 10km of kerbin, and have a rocket-propelled return ship return to orbit.\u003C/p\u003E\u003Cp\u003E-Vessel must carry 2 kerbals.\u003C/p\u003E\u003Cp\u003E-Vessel must be able to glide for over 10 minutes under 25km\u003C/p\u003E\u003Cp\u003E-Vessel must demonstrate full control by stopping still in the air, maintaining a surface speed of 0m/s.\u003C/p\u003E\u003Cp\u003E-Vessel must not have any visible wing parts\u003C/p\u003E\u003Cp\u003E-Vessel must carry 2x of all science instruments, but need not carry it back to space.\u003C/p\u003E\u003Cp\u003E-Return vessel MUST be the 1.5m capsule, and capable of docking and rendezvous.\u003C/p\u003E\u003Cp\u003E-Vessel must contain a cargo bay capable of delivering a 1t probe to the surface.\u003C/p\u003E\u003Cp\u003E-All vessels must contain 2 parts.\u003C/p\u003E\u003Cp\u003EThe first part is the atmospheric part, which contains all the science equipment and parts that keep the vessel gliding and aloft.\u003C/p\u003E\u003Cp\u003EThe second part is the rocket return part, which detaches from the first part while gliding, and return to orbit with the capsule.\u003C/p\u003E\u003Cp\u003E-The whole vessel must weigh less than 95t.\u003C/p\u003E\u003Cp\u003E- try to make the vessel resemble that shown in the HAVOC video.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EThis may be the hardest challenge on KSP, and i hope you\u0027ll prove me wrong! \u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EI dare you, scott manley and danny, to attempt the hardest mode! \u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ESorry if the words are not clear, typed this on my phone.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-31T09:02:33Z\u0022 title=\u002205/31/2015 09:02  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 31, 2015\u003C/time\u003E by Rdivine\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Sirine","CreatedById":74830,"CreatedDateTime":"2015-05-31T12:56:19Z","Content":"\n\u003Cp\u003EShow us your own attempted. Please.\u003C/p\u003E\n"},{"CreatedByName":"Rdivine","CreatedById":66317,"CreatedDateTime":"2015-05-31T14:48:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sirine\u0022 data-cite=\u0022Sirine\u0022\u003E\u003Cdiv\u003EShow us your own attempted. Please.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have previously attempted with wing clippings using the old atmosphere. I have tried clipping wings in the 1.0 atmosphere and it seemed to work fine, which may be a bug.\u003C/p\u003E\u003Cp\u003EThe craft i made was able to reenter and glide around, and i experimented with large parachutes to \u0022hover\u0022. I was able to return to suborbital flight, just ~300m/s away from orbit.\u003C/p\u003E\u003Cp\u003EI am making this challenge to see how others would attempt it, and if its really worth the effort to be used on bodies like eve and laythe. I hope it would outweigh landers and their cost.\u003C/p\u003E\u003Cp\u003EHowever i am unable to post any pictures of my attempt as i am away from my computer, which is why I\u0027m using my phone to find out how others attempt this. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"KandoKris","CreatedById":103873,"CreatedDateTime":"2015-06-01T22:00:38Z","Content":"\n\u003Cp\u003EOK so let me get this right....\u003C/p\u003E\u003Cp\u003EYou want to see a wingless glider on kerbin to compare to an airship above eve....\u003C/p\u003E\u003Cp\u003Ewhy not use Hooligan Labs so you can skip the kerbin practice and just make it an Eve airship challenge wher ther winner is the closest to the Vid, aka return rocket attached etc.\u003C/p\u003E\u003Cp\u003EOnly thing is I wish hooligan had \u0022deflated\u0022 balloons as without them it wont look the same as the nasa vid craft.\u003C/p\u003E\u003Cp\u003EOther then that this is a KSP do-able mission \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}