{"TopicId":111564,"ForumId":16,"TopicTitle":"Self-refuelling interplanetary ship - possible?","CreatedByName":"Boots","CreatedById":144409,"CreatedDateTime":"2015-06-01T02:04:39Z","PageNum":1,"Articles":[{"CreatedByName":"Boots","CreatedById":144409,"CreatedDateTime":"2015-06-01T02:04:39Z","Content":"\n\u003Cp\u003EI\u0027m getting close to the top of the tech tree in my career save. I\u0027ve built multiple-launch orbital stations, sent a crewed mission to Duna, sent probes to Jool, Moho and Eve, played around with nukes and Ion engines. I\u0027ve also downloaded a few parts mods - nothing too far from stock, so no antimatter, no warp, no liquid hydrogen for nukes. \u003C/p\u003E\u003Cp\u003ENow I\u0027m toying with the idea of a massive interplanetary ship that will be built in high kerbin orbit from several sections - CM, SM, engine block - before having a few smaller craft attached to it for independent landings. It\u0027s powered by six nukes and when fuelled, currently has around 8k Dv (though I anticipate this will drop to 6k once it\u0027s fully equipped). I figure that\u0027s enough to get to Jool from HKO and have a bit of a poke around. However, getting back is hard - and my plan for this ship is that it\u0027s 100% self-contained once it leaves Kerbin\u0027s SoI. So basically I want some help with the design of its refuelling unit.\u003C/p\u003E\u003Cp\u003EI can see three possible ISRU strategies:\u003C/p\u003E\u003Cp\u003E1) refine on surface, ship fuel only back to mothership. This seems to be the most efficient, but given that it will leave its refinery, drill and ore containment behind, it\u0027s not self-contained.\u003C/p\u003E\u003Cp\u003E2) refinery drop-ship that mines, refines, and returns. This seems horridly inefficient - experiments on minmus with a similar setup produced poor results; the lander used up almost all the fuel it produced returning to orbit.\u003C/p\u003E\u003Cp\u003E3) lander mines, mothership refines. I\u0027ve also toyed with this idea on Minmus, but with little luck. Getting enough Dv to lug the drills, tanks and ore around burns a lot of fuel.\u003C/p\u003E\u003Cp\u003EAny thoughts? Should I give up on the self-contained idea, and just start flinging scanning probes, automated surface refineries and orbital tankers at various parts of the system? Or is a self-contained interplanetary voyager possible?\u003C/p\u003E\u003Cp\u003EEDIT: Just thought of a possible option 4: refinery, drill and ore tanks in one ship, tanker as a second one, with the tanker making several runs to refuel the mothership. Is that more efficient, or is it a false hope?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-01T13:54:24Z\u0022 title=\u002206/01/2015 01:54  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 1, 2015\u003C/time\u003E by Boots\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-06-01T02:09:23Z","Content":"\n\u003Cp\u003E#3 and the fact that Kethane has pretty much died is the reason I\u0027ve given up on ISRU in this game. Until something like Kethane comes along to fill the gap, there might as well not be a resources system.\u003C/p\u003E\u003Cp\u003EThe way it was described initially made it sound like orbital refining would work but it is just still too inefficient.\u003C/p\u003E\n"},{"CreatedByName":"n0xiety","CreatedById":143324,"CreatedDateTime":"2015-06-01T02:40:42Z","Content":"\n\u003Cp\u003EAh its possible but the ship needs to be really big to be able to support the mining equipment and logistics. I have one which can travel anywhere but it comes with a price. You have to refuel at every chance. Like lets say i takeoff from kerbin i can barely reach minmus and land. After refueling go for Duna then land refuel takeoff go for ike land refuel. This works for pretty much any planet even for jool system. Excluding the obvious choice Eve ofc. \u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/VorbV\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EMechjeb dV values are wrong since i have a rhino engine at the middle. I deactivate the mamooths once i am at high atmosphere and i no longer need the twr of mamooths. As you can see it has enough slt and twr to takeoff from anywhere but EVE. I barely reach minmus and land. After refueling going anywhere and landing is easy with that much dV. Oh by easy i mean it is easy with mechjeb since it can manage the dV perfectly and not waste a single drop of fuel.\u003C/p\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2015-06-01T03:13:09Z","Content":"\n\u003Cp\u003ESelf-fuellers don\u0027t need to be that big:\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/dC6PN\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003E(swap the cupola on that for a Poodle and it\u0027ll happily go interplanetary after refuelling itself)\u003C/p\u003E\u003Cp\u003EOr:\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/IbXOa\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"n0xiety","CreatedById":143324,"CreatedDateTime":"2015-06-01T03:34:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Wanderfound\u0022 data-cite=\u0022Wanderfound\u0022\u003E\u003Cdiv\u003ESelf-fuellers don\u0027t need to be that big\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOfc they don\u0027t need to be that big but don\u0027t forget that i carry a lab \u002B 16 kerbal crew compartmant with a sattelite probe at the tip \u002B its an ssto rocket i don\u0027t drop anything. This is an older version actually i have rovers in the upgraded one for various gravity situations and a small plane for laythe in 4*mk3 cargo bays. Just wanted to build something that can do everything which turned out getting bigger and bigger as the payload got bigger.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-01T03:37:13Z\u0022 title=\u002206/01/2015 03:37  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 1, 2015\u003C/time\u003E by n0xiety\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2015-06-01T07:31:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Boots\u0022 data-cite=\u0022Boots\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E2) refinery drop-ship that mines, refines, and returns. This seems horridly inefficient - experiments on minmus with a similar setup produced poor results; the lander used up almost all the fuel it produced returning to orbit.\u003C/p\u003E\u003Cp\u003E3) lander mines, mothership refines. I\u0027ve also toyed with this idea on Minmus, but with little luck. Getting enough Dv to lug the drills, tanks and ore around burns a lot of fuel.\u003C/p\u003E\u003Cp\u003EAny thoughts? Should I give up on the self-contained idea, and just start flinging scanning probes, automated surface refineries and orbital tankers at various parts of the system? Or is a self-contained interplanetary voyager possible?\u003C/p\u003E\u003Cp\u003EEDIT: Just thought of a possible option 4: refinery, drill and ore tanks in one ship, tanker as a second one, with the tanker making several runs to refuel the mothership. Is that more efficient, or is it a false hope?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIs the refinery (I am not there yet) that heavy, that it makes such a significant difference to take it down to the surface or not?\u003C/p\u003E\u003Cp\u003EAs ore and fuel weigh the same, the weight of the refinery is the only thing that counts I think; I gather it would make a difference to reuse fuel tanks and engines for landing and travelling as much as possible, also combining the mining and crew lander.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022n0xiety\u0022 data-cite=\u0022n0xiety\u0022\u003E\u003Cdiv\u003EOfc they don\u0027t need to be that big but don\u0027t forget that i carry a lab \u002B 16 kerbal crew compartmant with a sattelite probe at the tip \u002B its an ssto rocket i don\u0027t drop anything. This is an older version actually i have rovers in the upgraded one for various gravity situations and a small plane for laythe in 4*mk3 cargo bays. Just wanted to build something that can do everything which turned out getting bigger and bigger as the payload got bigger.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETyring to use a ship of that size without going modular sounds unhealthy and brainfrying! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EPlease do not forget to make a mission report with screenshots! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Alshain\u0022 data-cite=\u0022Alshain\u0022\u003E\u003Cdiv\u003E#3 and the fact that Kethane has pretty much died is the reason I\u0027ve given up on ISRU in this game. Until something like Kethane comes along to fill the gap, there might as well not be a resources system.\u003Cp\u003EThe way it was described initially made it sound like orbital refining would work but it is just still too inefficient.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI cannot follow. What did Kethane do differently?\u003C/p\u003E\u003Cp\u003EThe way I see it, orbital refining seems to make sense if the weight of the refinery is big enough.\u003C/p\u003E\n"},{"CreatedByName":"Nookos","CreatedById":144067,"CreatedDateTime":"2015-06-01T09:21:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Wanderfound\u0022 data-cite=\u0022Wanderfound\u0022\u003E\u003Cdiv\u003ESelf-fuellers don\u0027t need to be that big:\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/dC6PN\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/dC6PN\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E(swap the cupola on that for a Poodle and it\u0027ll happily go interplanetary after refuelling itself)\u003C/p\u003E\u003Cp\u003EOr:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/IbXOa\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/IbXOa\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E Krokoduck \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E So evolution is true after all. Kirk is not going to be pleased. And good job on the krokodil. I ve been trying to do sthg similar for a while but no success. I m rubbish at spaceplane.\u003C/p\u003E\u003Cp\u003EOn topic, I find it much easier to set up mining outpost and space station on most planets/moons so you can move around with a more efficient ship. Rather than an all in one solution. Plus part count is something to keep in mind in order to keep the ksp experience lag free.\u003C/p\u003E\n"},{"CreatedByName":"Jesrad","CreatedById":49762,"CreatedDateTime":"2015-06-01T10:01:34Z","Content":"\n\u003Cp\u003EUnless you are OK with doing multiple landing-drilling-refueling trips back and forth between your mothership and the local moons, I\u0027d strongly advise you keep your first design idea and make your ship an \u0022all-in-one\u0022. Just integrate everything into a single vehicle: one or two drills, an ISRU, an ore tank, biiiiig fuel tanks, and a big efficient engine or twelve.\u003C/p\u003E\u003Cp\u003EThis way, you can get away with having just one of the smallest ore tanks, for a start. That would apply to your solution 2 as well.\u003C/p\u003E\u003Cp\u003ESecondly, you\u0027ll want to land and explore anyway, so you might as well do it with the full complement of instruments, crew cabin, etc.\u003C/p\u003E\u003Cp\u003EThirdly, you won\u0027t have to guesstimate beforehand the amount of fuel you want to send your refill shuttle with. And that cost won\u0027t be \u0022sunk\u0022: you\u0027ll only be paying it when necessary to move.\u003C/p\u003E\u003Cp\u003EAs for generic advice, I\u0027d suggest sizing your ship for a 4000 m/s DeltaV at a minimum, 5000 for comfort. The Rhino engine is probably your best choice, it has nice TWR, high thrust, and one of the highest ISP among chemical engines of KSP. This would let you get intersects to any planet and have enough left for landing comfortably afterward, anywhere. Well you might need to stop by Pol or Bop for refuel before attempting to land on Tylo, but that\u0027s the only limitation I can foresee. Ah, and you\u0027ll need fuel cells, of course. You can fully power the mining and refining processes from a fuel cell from the LFO they produce (no, this does not contradicts the laws of thermodynamics, because the ore is not really an \u0022ash\u0022 and is very different from the by-products of burning the LFO for thrust or for electricity).\u003C/p\u003E\u003Cp\u003ELaunching it: you don\u0027t have to make it an SSTO ! Except for exploring Laythe or Eve surface, you\u0027ll only need to push it once through any significant atmosphere. So, you can safely assume it\u0027ll only do vacuum landings. Have launch stages on it for the initial climb out of Kerbin, and don\u0027t bother any further. You can even expend all but 1500-2000 m/s of its last deltaV, and plan to refuel at Minmus before leaving Kerbin. This way, you can make it simpler and lighter than anticipated, and it\u0027ll give you an opportunity to train at landing-refuels in one of the easiest setting possible (yeah, Minmus is easy).\u003C/p\u003E\u003Cp\u003EThat leaves the problem of Kerbin return... I think you don\u0027t need to bother with it either: you can bring the crew and science data back to the ground with another vehicle, later.\u003C/p\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2015-06-01T11:41:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jesrad\u0022 data-cite=\u0022Jesrad\u0022\u003E\u003Cdiv\u003EI\u0027d strongly advise you keep your first design idea and make your ship an \u0022all-in-one\u0022. [...] you\u0027ll want to land and explore anyway, so you might as well do it with the full complement of instruments, crew cabin, etc.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBe aware that you won\u0027t know much about the resource distribution until you have explored the surface; given the presumed size of this vessel, it will also be advisable to send an ahead team and scout for a good landing site. It makes sense to include a much smaller lander/rover for this task; bonus points if it can dock to the mothership on the ground so you can bring the whole shebang back into orbit in a single launch.\u003C/p\u003E\u003Cp\u003EAnything but Eve-Laythe-Tylo can reasonably run on nukes; \u0022reasonable\u0022 in terms of TWR and delta-V, though the part count and heat problems are something else entirely. Eve definitely warrants its own, dedicated solution. Laythe can be covered with a relatively small, jet-powered lander. No need to bring down the entire mothership.\u003C/p\u003E\u003Cp\u003ETylo is a though nut. Landing and takeoff without ISRU requires a monstrous lander, or staging (iow, not reusable). Moving the ISRU parts into the scout/rover/lander will again give you a monster that\u0027s totally overbuilt for everywhere else. Personally, I went with a lander that can only land on Tylo; in order to leave again, it has to drive around until it finds a suitable and resource-rich landing site where it flags down the main vessel.\u003C/p\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2015-06-01T11:53:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nookos\u0022 data-cite=\u0022Nookos\u0022\u003E\u003Cdiv\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E Krokoduck \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E So evolution is true after all. Kirk is not going to be pleased.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EOne more on a similar theme:\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/XrLl9\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003ECraft file at \u003Ca href=\u0022https://www.dropbox.com/s/1m53ww9y81bh5qm/Krokoduck%20SP.craft?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/1m53ww9y81bh5qm/Krokoduck%20SP.craft?dl=0\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-01T11:55:56Z\u0022 title=\u002206/01/2015 11:55  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 1, 2015\u003C/time\u003E by Wanderfound\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Dilli","CreatedById":142986,"CreatedDateTime":"2015-06-01T12:32:27Z","Content":"\n\u003Cp\u003EI have been thinking about something similar.\u003C/p\u003E\u003Cp\u003ESo far I have come to the conclusion that the best and easiest is to have a engine section that is also the ISRU miner and convertor. I have only had time to play with the idea on minus so far but a 4X nuclear engine section that lands near empty, mines until all ore / fuel tanks are full then takes off and docks with remainder of the ship in orbit works.\u003C/p\u003E\u003Cp\u003EThe caveat is that I am designing from the point of view that kerbals will be spending a few months doing science at each body, so the engine section will only have 1 or 2 drills and 1 ISRU but a lvl 5 engineer to run them.\u003C/p\u003E\u003Cp\u003EI believe refining on the surface is more efficient, it allows more fuel tanks and less ore tanks to be used; fuel tanks weighing less for a set amount of fuel/ore\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-01T12:37:06Z\u0022 title=\u002206/01/2015 12:37  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 1, 2015\u003C/time\u003E by Dilli\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MarvinKitFox","CreatedById":99545,"CreatedDateTime":"2015-06-01T13:04:30Z","Content":"\n\u003Cp\u003E\u0022Self-refuelling interplanetary ship - possible?\u0022 no. or yes but very very hard.\u003C/p\u003E\u003Cp\u003E\u0022Self-refuelling inter-moon ship - possible?\u0022 easy.\u003C/p\u003E\u003Cp\u003EDoing an all-in-one ship that is science and ISRU and interplanetary propulsion is not too hard.\u003C/p\u003E\u003Cp\u003E.\u003C/p\u003E\u003Cp\u003E.\u003C/p\u003E\u003Cp\u003EAs long as you play around with low-gravity planets.\u003C/p\u003E\u003Cp\u003EBy definition, you ship needs to be Single Stage to Orbit AND same single stage to interplanetary transfer AND same single stage to Orbital insertion at target AND same single stage to landing on a new ore body at target.\u003C/p\u003E\u003Cp\u003EBut it must also carry the very inert mass of ISRU unit, drill, Ore tank and power systems.\u003C/p\u003E\u003Cp\u003EThis makes for a pretty hefty payload, attached to a pretty ambitious delta-v requirement.\u003C/p\u003E\u003Cp\u003EBig delta-v * big payload == BIIIIG ship.\u003C/p\u003E\u003Cp\u003EI have a self-fuelling dunebuggy* that can easily hop between Mun, Minmus, Gilly, and any of the lesser Jool moons.\u003C/p\u003E\u003Cp\u003EIke can be handled without too much sweat.\u003C/p\u003E\u003Cp\u003EDuna though, is a one-way pit.\u003C/p\u003E\u003Cp\u003EAs is Kerbin, Laythe, Tylo, Moho, Eve(of course).\u003C/p\u003E\u003Cp\u003EI think Eeloo is in reach, but it may require some fancy footwork near Jool.\u003C/p\u003E\u003Cp\u003EP.S.\u003C/p\u003E\u003Cp\u003ENot tried yet, but I think using a passing asteroid as refueller will be quite doable! Sure its a pain to rendesvous \u0026amp; mine, but then you are in deep space away from any gravity well other than Kerbol. From there you could *go* anywhere, just maybe not return.\u003C/p\u003E\u003Cp\u003E* when I say dunebuggy, i mean that horrid contraption I had to build for the \u0022gilly with science with 11 kerbals with 13000 ore capacity, on wheels\u0022 contract. This baby has 4 orange tanks just for the fuel!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-01T13:08:35Z\u0022 title=\u002206/01/2015 01:08  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 1, 2015\u003C/time\u003E by MarvinKitFox\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Boots","CreatedById":144409,"CreatedDateTime":"2015-06-01T13:50:27Z","Content":"\n\u003Cp\u003EThanks for all the advice guys! One thing I should make clear, I was hoping to build something a bit like \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/93963-Avalon-A-mission-to-every-planet-and-moon-Investigation-Via-EVA\u0022 rel=\u0022external nofollow\u0022\u003Ethis\u003C/a\u003E, with lots of fun little purpose-built detachable bits to do various things planetside. Hence, I wasn\u0027t thinking of making an SSTO - perfectly happy to launch in multiple stages and stitch them together in LKO. I don\u0027t imagine the ship itself ever landing once it\u0027s in orbit; that will be left to purpose-built reusable landers like I\u0027ve got used to using with my minmus and mun bases.\u003C/p\u003E\u003Cp\u003EI\u0027ve run into two other problems, and I\u0027m not sure what\u0027s causing them. The first is that I\u0027m planning to construct it in orbit, but I\u0027m having real trouble with docking ports. There\u0027s so much warp under thrust that the ship threatens to tear itself apart under any sustained burn. Are modular orbitally-constructed ships viable without using KAS/KIS?\u003C/p\u003E\u003Cp\u003EThe second is the Taurus HCV. I love what it looks like, but it\u0027s so heavy than when I try to launch the command module it flips after ditching the first stage, every time. I can\u0027t seem to get it into orbit!\u003C/p\u003E\u003Cp\u003EObviously these are pretty big flaws in my plan. Any suggestions as to what I might be doing wrong?\u003C/p\u003E\n"},{"CreatedByName":"n0xiety","CreatedById":143324,"CreatedDateTime":"2015-06-01T14:03:25Z","Content":"\n\u003Cp\u003EUse \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/55657-1-0-2-Kerbal-Joint-Reinforcement-v3-1-3-4-27-15\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/55657-1-0-2-Kerbal-Joint-Reinforcement-v3-1-3-4-27-15\u003C/a\u003E and \u003Ca href=\u0022https://github.com/UbioWeldingLtd/UbioWeldContinued/blob/dev-1.0/UbioWeldContinued-2.1.3.zip\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/UbioWeldingLtd/UbioWeldContinued/blob/dev-1.0/UbioWeldContinued-2.1.3.zip\u003C/a\u003E (click View Raw to download) Ubizur welding is updated for 1.02 but it is only available as a devpost. So there might still be some bugs but im using it and it works. It simply lets you weld parts together so you can actually create a section of the ship and then weld it together to get 1 big part. After that you can connect those parts at orbit and here you go sturdy and unbreakable ship, well almost \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Atleast it won\u0027t do the snake dance and invite the kraken \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Oh another thing is it is super light on performance since you will be welding maybe 30\u002B parts together and create 1 part which will reduce the total part count of your ship immensly. Thanks to this i can create 1000 part ships but only have 50 parts total.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-01T14:08:06Z\u0022 title=\u002206/01/2015 02:08  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 1, 2015\u003C/time\u003E by n0xiety\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"xtoro","CreatedById":79015,"CreatedDateTime":"2015-06-01T14:30:16Z","Content":"\n\u003Cp\u003ECheck my signature. It\u0027s quite overkill because it\u0027s designed to tour the entire system but it is self refuelling. It\u0027s also heavily nodded but you can do something similar with stock and using the stock ore drill and refinery. All details of the Avalon are on the first page including all of its parts.\u003C/p\u003E\u003Cp\u003ESo yes, it\u0027s definitely do able.\u003C/p\u003E\u003Cp\u003EEDIT: LOL nevermind, I see you were already using my ship as an example of what you want to do \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-01T14:33:16Z\u0022 title=\u002206/01/2015 02:33  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 1, 2015\u003C/time\u003E by xtoro\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-06-01T14:37:35Z","Content":"\n\u003Cp\u003EThe Hummlebee (see comic in sig) is a stock self-fueler. About 2600dV fully loaded on two aerospikes. Hopefully good enough for Duna, should also be able to handle the Joolian moons or Gilly.\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2015-06-01T14:43:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Boots\u0022 data-cite=\u0022Boots\u0022\u003E\u003Cdiv\u003EI\u0027ve run into two other problems, and I\u0027m not sure what\u0027s causing them. The first is that I\u0027m planning to construct it in orbit, but I\u0027m having real trouble with docking ports. There\u0027s so much warp under thrust that the ship threatens to tear itself apart under any sustained burn. Are modular orbitally-constructed ships viable without using KAS/KIS?\u003Cp\u003EThe second is the Taurus HCV. I love what it looks like, but it\u0027s so heavy than when I try to launch the command module it flips after ditching the first stage, every time. I can\u0027t seem to get it into orbit!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETry using the large docking ports or two/three of the medium ones at the same time - part count though ...\u003C/p\u003E\u003Cp\u003EThe thing is a top heavy rocket flies better - so I think the Taurus generates to much air resistance which is what pushes the thing around.\u003C/p\u003E\u003Cp\u003EExperiment: Take the troublesome stage into the VAB, activate center of mass and center of lift, tilt the whole thing a few degrees to the side (shift-leftclick anywhere, shift-d to rotate - just in case ... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E )\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-02T09:32:32Z\u0022 title=\u002206/02/2015 09:32  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 2, 2015\u003C/time\u003E by KerbMav\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"n0xiety","CreatedById":143324,"CreatedDateTime":"2015-06-01T14:50:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerbMav\u0022 data-cite=\u0022KerbMav\u0022\u003E\u003Cdiv\u003ETry using the large docking ports or two/three of the medium once at the same time - part count though ...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDocking ports are too fragile and they always cause kraken problems when used on big ships. Thats why he needs Kerbal Joint Reinforcement mod as i said earlier and Ubizur welding mod for the part count. If you are thinking about the biggest docking port which is the Sn docking port it is somehow more fragile then Jn and lags the hell out of the game when i build a ship containing 4 or 5 sections at orbit...\u003C/p\u003E\n"},{"CreatedByName":"xtoro","CreatedById":79015,"CreatedDateTime":"2015-06-01T15:39:08Z","Content":"\n\u003Cp\u003EI vouch for KJR as being essential for large ships, also, if you have many docking ports, Quantum Struts cleverly placed is also essential.\u003C/p\u003E\n"},{"CreatedByName":"Jouni","CreatedById":97346,"CreatedDateTime":"2015-06-01T15:48:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022n0xiety\u0022 data-cite=\u0022n0xiety\u0022\u003E\u003Cdiv\u003EDocking ports are too fragile and they always cause kraken problems when used on big ships. Thats why he needs Kerbal Joint Reinforcement mod as i said earlier and Ubizur welding mod for the part count. If you are thinking about the biggest docking port which is the Sn docking port it is somehow more fragile then Jn and lags the hell out of the game when i build a ship containing 4 or 5 sections at orbit...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDocking ports are not fragile and they don\u0027t cause kraken attacks. If you have kraken problems, they\u0027re probably caused by the Ritual of Kraken Summoning (also known as part clipping). If you design your ships properly, docking ports won\u0027t be the weakest link, even if the total mass of the ship is thousands of tonnes.\u003C/p\u003E\u003Cp\u003E(In \u003Ca href=\u0022http://jltsiren.kapsi.fi/ksp/0.25/tylo_ship_2.jpeg\u0022 rel=\u0022external nofollow\u0022\u003Ethis ship\u003C/a\u003E, seven large docking ports held the 1800-tonne Kerbin escape stage and the 750-tonne transfer stage/payload together just fine. The weakest link were the structural parts in the midsection.)\u003C/p\u003E\n"},{"CreatedByName":"xtoro","CreatedById":79015,"CreatedDateTime":"2015-06-01T17:30:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jouni\u0022 data-cite=\u0022Jouni\u0022\u003E\u003Cdiv\u003EDocking ports are not fragile and they don\u0027t cause kraken attacks. If you have kraken problems, they\u0027re probably caused by the Ritual of Kraken Summoning (also known as part clipping). If you design your ships properly, docking ports won\u0027t be the weakest link, even if the total mass of the ship is thousands of tonnes.\u003Cp\u003E(In \u003Ca href=\u0022http://jltsiren.kapsi.fi/ksp/0.25/tylo_ship_2.jpeg\u0022 rel=\u0022external nofollow\u0022\u003Ethis ship\u003C/a\u003E, seven large docking ports held the 1800-tonne Kerbin escape stage and the 750-tonne transfer stage/payload together just fine. The weakest link were the structural parts in the midsection.)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s not only a matter of Kraken attacks but also long parts bending, and when you have a long burn and things start wobbling it gets worse and worse...\u003C/p\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2015-06-01T17:47:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022xtoro\u0022 data-cite=\u0022xtoro\u0022\u003E\u003Cdiv\u003EIt\u0027s not only a matter of Kraken attacks but also long parts bending, and when you have a long burn and things start wobbling it gets worse and worse...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYe goode olde three-point connection goes a long way. I did the following in part to find out how far I can take the concept, and it worked extremely well. Three pillars strutted against each other turned out to be more stable than many a simple single-stack vessel. This thing had no noticable bend or wobble, giving me absolutely no trouble. It\u0027s not even many struts; the nuclear drive section and the passenger module have six struts each. Without welding or KJR, just the stock connections as of KSP 0.24 (or whatever we had last summer).\u003C/p\u003E\u003Cp\u003EThat said, with the recent addition of even more physics depressing the possible part count by another 30%, I meanwhile consider KJR to be essential.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://ksp.schnobs.de/stuff/screenshot155.png\u0022 alt=\u0022screenshot155.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003EEdit to add:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MarvinKitFox\u0022 data-cite=\u0022MarvinKitFox\u0022\u003E\u003Cdiv\u003E\u0022Self-refuelling interplanetary ship - possible?\u0022 no. or yes but very very hard.\u003Cp\u003E[...]\u003C/p\u003E\u003Cp\u003EBy definition, you ship needs to be Single Stage to Orbit AND same single stage to interplanetary transfer AND same single stage to Orbital insertion at target AND same single stage to landing on a new ore body at target.\u003C/p\u003E\u003Cp\u003EBut it must also carry the very inert mass of ISRU unit, drill, Ore tank and power systems.\u003C/p\u003E\u003Cp\u003E[...]\u003C/p\u003E\u003Cp\u003EBig delta-v * big payload == BIIIIG ship.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBig isn\u0027t hard. Big is big. This is my WIP I talked about earlier, the science rover/lander approaching the Big-S ISRU Tug. Aptly named \u0022Gran Tourismo\u0022, the tug as pictured can land, refuel and SS-to-next-surface from anywhere but Eve and Kerbin, but unless I add another twenty parts (either reaction wheels or RCS nozzles, preferably both), it will be dangerously clumsy. I\u0027ve recently struck Laythe from the list of possible landing sites: a simple jet can touch all biomes without refuelling and return the data to orbit, after all. The latest variant has two KR2L instead of the four Mainsails, still enough for Tylo and saving 12 parts.\u003C/p\u003E\u003Cp\u003EI\u0027ve modded my Nervas to weigh 20t@360kn; in stock parts, that would be 48 nuclear engines (and another 150 structural and radiator pieces). With ISRU, I find that I can well afford 4-5m/sÃ‚Â² from nuclear engines, but sadly, my computer can not.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://ksp.schnobs.de/stuff/ISRU_GT.jpg\u0022 alt=\u0022ISRU_GT.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-01T18:11:54Z\u0022 title=\u002206/01/2015 06:11  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 1, 2015\u003C/time\u003E by Laie\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"n0xiety","CreatedById":143324,"CreatedDateTime":"2015-06-01T18:08:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Laie\u0022 data-cite=\u0022Laie\u0022\u003E\u003Cdiv\u003EYe goode olde three-point connection goes a long way. I did the following in part to find out how far I can take the concept, and it worked extremely well. Three pillars strutted against each other turned out to be more stable than many a simple single-stack vessel. It\u0027s not even many struts; the nuclear drive section and the passenger module have six struts each. Without welding or KJR.\u003Cp\u003EThat said, with the recent addition of even more physics depressing the possible part count by another 30%, I meanwhile consider KJR to be essential.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI am curious how you manage to keep the overheating of 4 nervas connected like that. Those 4 or 3 way connections should be horrible at conducting heat are they not?\u003C/p\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2015-06-01T18:43:14Z","Content":"\n\u003Cp\u003EThe kind of overheating you worry about didn\u0027t exist back then. Truth be told, I still don\u0027t get how the current system improves gameplay in any way, shape or form.\u003C/p\u003E\u003Cp\u003EBut that\u0027s besides the point: the key takeaway message is that you can get a lot of rigidity by strutting two or more columns against each other, and that it doesn\u0027t need to many struts.\u003C/p\u003E\u003Cp\u003EThe rigidity of docking ports has been much improved lately. But even in previous versions, you could get very stable connections if you had three points, \u003Cem\u003Eand\u003C/em\u003E the points were some distance apart (see my solution above; by comparison, three standard ports on a tricoupler are barely any improvement over a single Sr. connection). I\u0027ve also had great success with a single Senior port in the center, and a number of Junior ports on outriggers (say, wingtips).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-01T19:02:51Z\u0022 title=\u002206/01/2015 07:02  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 1, 2015\u003C/time\u003E by Laie\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"xtoro","CreatedById":79015,"CreatedDateTime":"2015-06-01T20:08:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Laie\u0022 data-cite=\u0022Laie\u0022\u003E\u003Cdiv\u003EYe goode olde three-point connection goes a long way. I did the following in part to find out how far I can take the concept, and it worked extremely well. Three pillars strutted against each other turned out to be more stable than many a simple single-stack vessel. This thing had no noticable bend or wobble, giving me absolutely no trouble. It\u0027s not even many struts; the nuclear drive section and the passenger module have six struts each. Without welding or KJR, just the stock connections as of KSP 0.24 (or whatever we had last summer).\u003Cp\u003EThat said, with the recent addition of even more physics depressing the possible part count by another 30%, I meanwhile consider KJR to be essential.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhile that can work in the configuration you have, it doesn\u0027t work so well with an in-line setup that\u0027s very front-heavy like my ship, The Avalon.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/sairmAN\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/sairmANh.png\u0022 alt=\u0022sairmANh.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s 740 tons and 657 parts.\u003C/p\u003E\u003Cp\u003EMy mining/refining ship is tugged behind it.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/5Ob7BJh\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/5Ob7BJhh.png\u0022 alt=\u00225Ob7BJhh.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\n"}]}