{"TopicId":111659,"ForumId":69,"TopicTitle":"Game Freeze when trying to launch a spaceplane from the Hangar.","CreatedByName":"KonanTheDestructor","CreatedById":145462,"CreatedDateTime":"2015-06-01T20:08:18Z","PageNum":1,"Articles":[{"CreatedByName":"KonanTheDestructor","CreatedById":145462,"CreatedDateTime":"2015-06-01T20:08:18Z","Content":"\n\u003Cp\u003EHello, I have KSP Version 1.0.2. I\u0027ve reinstalled game recently on steam (a few days ago) and started a new game (career). This is the first time I\u0027ve tried to make a spaceplane on this save, and basically what happens is I make the plane, check that it doesn\u0027t have too many parts or weigh too much, save it and then click on \u0022Launch\u0022. And that\u0027s when the game freezes (or my like half-freezes). The Launch, Save, New and Close buttons go grey and I can\u0027t click them (Esc doesn\u0027t do anything either) and I\u0027m stuck in the hangar. \u003C/p\u003E\u003Cp\u003EThe music keeps playing, it seems as though the game is running normally (I don\u0027t get \u0022not responding\u0022 messages), and certain buttons seem to work as normal and get highlighted when I mouse over them. For example, I can mouse over parts and navigate the parts sections, but I can\u0027t click on them and put them on the spaceplane, I can read my contracts, change my mission flag and type into the name box. However I can\u0027t pan my view or zoom in and out anymore, I\u0027m just stuck and can\u0027t get out, and when I reload the save I find that it hasn\u0027t even saved my spaceplane.\u003C/p\u003E\u003Cp\u003EI tried closing and opening the game, clearing the runway etc... the first time this happened my spaceplane had too many parts so I thought that might be the problem, but I\u0027ve upgraded my hangar the next time I opened the game, and the same thing happened. It doesn\u0027t happen on the rocket assembly area, just the spaceplane hangar. It there a way to upload a picture from my computer or do I need to put it on the internet and type the URL in?\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-06-01T21:00:54Z","Content":"\n\u003Cp\u003EHi Konan, can you post the pics to \u003Ca href=\u0022imgur.com\u0022 rel=\u0022external nofollow\u0022\u003Eimgur\u003C/a\u003E please, and your logs to a text paste site.\u003C/p\u003E\n"},{"CreatedByName":"KonanTheDestructor","CreatedById":145462,"CreatedDateTime":"2015-06-02T21:40:29Z","Content":"\n\u003Cp\u003EHi, here\u0027s an imgur link to a screenshot of the hangar after the freeze. I can still move my mouse, still navigate the parts menus and most buttons get highlighted normally when I mouse over them. However, as you can see, the Launch, Close, Save and New buttons are greyed out and they don\u0027t work.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ABXGO48.jpg?1\u0022 alt=\u0022ABXGO48.jpg?1\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlso, I tried it again today and the same thing happened. Even when I made a very simple ship (just the cockpit and a booster), the game froze in the spaceplane hangar when I tried to launch. Here is the log, I hope it worked: I basically made the problem happen, closed KSP and then copied the output log file (there is no actual crash when this happens, I have to manually turn the game off).\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/657vl1zrvfqgb40/output_log.txt?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/657vl1zrvfqgb40/output_log.txt?dl=0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThanks for the help. It\u0027s still happening and I can\u0027t use my spaceplane hangar now \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E.\u003C/p\u003E\n"},{"CreatedByName":"chrism78","CreatedById":145687,"CreatedDateTime":"2015-06-05T01:27:36Z","Content":"\n\u003Cp\u003EHi, I did a clean install of KSP recently and I encountered the same issue. I was able to fix it by creating the folder SPH in path_to_KSP\\saves\\name_of_your_savegame\\Ships\\\u003C/p\u003E\u003Cp\u003EIt was just missing. It seems it is the same error in your case because of the following line in your log: \u003C/p\u003E\u003Cp\u003EIsolatedStorageException: Could not find a part of the path \u0022C:\\Program Files (x86)\\Steam\\steamapps\\common\\Kerbal Space Program\\saves\\Darth Kerman\\Ships\\SPH\\Auto-Saved Ship.craft\u0022.\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-06-05T12:17:24Z","Content":"\n\u003Cp\u003EI expect chrism78\u0027s fix is what you need as you have this in the log.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003EDirectoryNotFoundException: Directory \u0027C:\\Program Files (x86)\\Steam\\steamapps\\common\\Kerbal Space Program\\saves\\Darth Kerman\\Ships\\SPH\u0027 not found.\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"KonanTheDestructor","CreatedById":145462,"CreatedDateTime":"2015-06-06T21:22:51Z","Content":"\n\u003Cp\u003EYes, I think that fixed it. Thank you very much for the help \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\n"}]}