{"TopicId":111663,"ForumId":32,"TopicTitle":"Is KSP too expensive?","CreatedByName":"SmallFatFetus","CreatedById":137860,"CreatedDateTime":"2015-06-01T20:37:41Z","PageNum":2,"Articles":[{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-06-01T22:13:09Z","Content":"\n\u003Cp\u003EWell look on the bright side, now it\u0027s 1.0\u002B they can\u0027t increase the price any further, and you all have already bought it, your friends can wait for a sale and Squad (almost) always sells KSP at 40% off*\u003C/p\u003E\u003Cp\u003E*except at the 1.0 release when it was 20% off.\u003C/p\u003E\n"},{"CreatedByName":"Caelib","CreatedById":59329,"CreatedDateTime":"2015-06-01T22:35:50Z","Content":"\n\u003Cp\u003EIt\u0027s worth $60.\u003C/p\u003E\n"},{"CreatedByName":"Frozen_Heart","CreatedById":118627,"CreatedDateTime":"2015-06-01T22:42:57Z","Content":"\n\u003Cp\u003EEasily worth it. Spent so many thousands of hours on this game that the price per hour is essentially free! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"selfish_meme","CreatedById":125899,"CreatedDateTime":"2015-06-01T23:22:10Z","Content":"\n\u003Cp\u003EI have purchased it several times, not everyone has gotten the same value out of it that I have. Still I do not regret a single giveaway. i think I have got more play value from this game in comparison to Half-Life (counter-strike), Star Craft, Battlefield Series (even then I had to buy new games) and Oblivion/skyrim. Most of those games were around for years after release as AAA games didn\u0027t move as fast then. These days a AAA game lasts a few weeks.\u003C/p\u003E\n"},{"CreatedByName":"Lord Aurelius","CreatedById":71687,"CreatedDateTime":"2015-06-01T23:22:32Z","Content":"\n\u003Cp\u003EIt\u0027s a definitely overpriced considering that 1.0 is still really more like 0.27 and it still feels like an early access title. Once the devs actually get the game to a state that matches what a 1.0 product should be (i.e. no more placeholders (graphics and audio are still mostly placeholders), full balance/polish pass, proper career mode), then I would definitely consider it to be a reasonable price and be able to recommend it to others again.\u003C/p\u003E\u003Cp\u003EAs far as cost per hour, it\u0027s very good, but there are excellent free sandbox games like Dwarf Fortress that you can easily spend just as much time on, not to mention Skyrim is available for $5 now on sale and has more mods than KSP for near infinite replayability.\u003C/p\u003E\n"},{"CreatedByName":"TheMoonRover","CreatedById":136199,"CreatedDateTime":"2015-06-01T23:26:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022EtherDragon\u0022 data-cite=\u0022EtherDragon\u0022\u003E\u003Cdiv\u003EThat said, the question really is this: Would Squad get more GROSS Dollars for KSP at $20, $30 or at $40?\u003Cp\u003EAt $20:\u003C/p\u003E\u003Cp\u003E6 sales = $120\u003C/p\u003E\u003Cp\u003EAt $30\u003C/p\u003E\u003Cp\u003E4 sales = $120\u003C/p\u003E\u003Cp\u003EAt $40\u003C/p\u003E\u003Cp\u003E3 sales = $120\u003C/p\u003E\u003Cp\u003EAt $20, would SQUAD more than double their sales volume, compared to $40?\u003C/p\u003E\u003Cp\u003EAt $30, would sales increase by more than 33%, compared to $40?\u003C/p\u003E\u003Cp\u003EAt $40, would sales volume exceed dollar losses at lower price-points?\u003C/p\u003E\u003Cp\u003EA Steam study from last year ( or was it 2013?) found that games that sold at lower price-points more than make up for it in total volume, increasing Gross Income (often times drastically!) Based on this finding, I might be inclined to say \u0022yes!\u0022 it might be \u0022over-priced.\u0022\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGiven that SQUAD is (or certainly was) primarily a marketing company, I reckon they\u0027ll have thought of that.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-01T23:29:38Z\u0022 title=\u002206/01/2015 11:29  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 1, 2015\u003C/time\u003E by TheMoonRover\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tank Buddy","CreatedById":69635,"CreatedDateTime":"2015-06-02T00:10:30Z","Content":"\n\u003Cp\u003EThe value of the entertainment this game provides is priceless. I bought it at ~ 0.18.1 for $20. Now I would be willing to pay more than full retail price. Compared to games like battlefield that charge $60 \u002B $60 for \u0022premium\u0022, I\u0027d say KSP is a steal.\u003C/p\u003E\n"},{"CreatedByName":"GusTurbo","CreatedById":57552,"CreatedDateTime":"2015-06-02T00:17:22Z","Content":"\n\u003Cp\u003EI bought it for $23, and I think it\u0027s overpriced. $40 is too much for a game that feels so unfinished. I say that as someone who absolutely loves KSP\u003C/p\u003E\n"},{"CreatedByName":"Windspren","CreatedById":134441,"CreatedDateTime":"2015-06-02T00:24:21Z","Content":"\n\u003Cp\u003EI\u0027m glad I got it for $27. It should be $30 at the most.\u003C/p\u003E\n"},{"CreatedByName":"cybersol","CreatedById":81136,"CreatedDateTime":"2015-06-02T00:32:42Z","Content":"\n\u003Cp\u003EIt\u0027s not overpriced by a long shot. Squad should really be commended from their approach to pricing. I wish more games started out cheap in early access and got more expensive along the way as the game became more complete. Instead, you usually have the opposite where they want $90 for the privilege of using the buggy game early, then reduce it by $20 dollars a month later, etc. until they are 75% off $40 by actual launch (this was the real progression of a RTS game). Or they could charge $40 dollars for the initial game as KSP was around 0.20 and then $20 dollars for the science expansion, $20 for the careers, $20 for building expansions, and $10 for 3.5m parts. \u003C/p\u003E\u003Cp\u003EPlus despite being only $40 I\u0027ve still spent many more hours in KSP than I have in those other games. Not to mention the fact value-per-entertainment-hour value I get out of games in general compared to what I spend on say 2 hour movies.\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2015-06-02T00:40:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Laythe Dweller\u0022 data-cite=\u0022Laythe Dweller\u0022\u003E\u003Cdiv\u003EI\u0027m glad I got it for $27. It should be $30 at the most.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think I\u0027d have an easier time compelling people to purchase the game at $30 without having to send them a \u0022full demo\u0022 version.\u003C/p\u003E\u003Cp\u003EI see a lot of people talking about the optimization, visuals, and what not (or rather the lack thereof in most cases), so here\u0027s my opinion on that:\u003C/p\u003E\u003Cp\u003EThe gameplay of KSP is so strong in most cases that I can get past that. I think 1.1 will go a long way towards that, however I previously did and still do believe that the current 1.0 version should not have been a 1.0 release. I think that was a mistake and trying to market what is, without any doubt, a beta game at best, as a gold release, is arguable.\u003C/p\u003E\u003Cp\u003EIf I strip my personal bias from 1200 hours away and examine the game as a whole, I honestly struggle a bit to justify a $40 price tag. If I imagine myself as a newer player who bought the game as soon as 1.0 dropped, I\u0027d be pretty annoyed with the handling of the hotfixes, mostly because the game was no longer early access and I wanted something bug free.\u003C/p\u003E\u003Cp\u003EUltimately this is a matter of opinion. Given my experience, I answer the title question with a resounding no, however looking more objectively while still including my raw experiences with gameplay, bugs, and patches, I struggle to give the same answer.\u003C/p\u003E\n"},{"CreatedByName":"rollo1002","CreatedById":145192,"CreatedDateTime":"2015-06-02T00:44:39Z","Content":"\n\u003Cp\u003EI just bought the game at $40.00. Is enjoyable? Yes. Is it worth $40? No. At it\u0027s current state, I\u0027d say $30 would be a good price point; however, a few more revisions and updates and yes the game would be worth the $40 I paid. There is a lot of things that are not polished and still rough around the edges. Tutorials and Training need more work and there is a lot of things that leave you wondering how do I do that? Does it make the game less enjoyable again no but it\u0027s that expectation of I paid this much I should get a game that is at this level.\u003C/p\u003E\n"},{"CreatedByName":"Razhan","CreatedById":144381,"CreatedDateTime":"2015-06-02T00:50:33Z","Content":"\n\u003Cp\u003EIf we go to the hours played per dollar, KSP is the second cheapest game I\u0027ve ever bought (it\u0027s hard to beat Binding of Isaac when it cost me less than $2). I bought it when it came to steam, in a sale for less than $20 (I think it was the KSP Is available in steam sale, sort of). However, convincing someone to buy KSP for $40, I think it will be hard. And let\u0027s be honest, KSP is a game you either love or don\u0027t care about (hard to imagine, but shortly after buying it for myself I gave two copies away, and they didn\u0027t like it. Maybe I should ask them to try again, or maybe I shouldn\u0027t have tried to convince lawyers to play it (my bad).\u003C/p\u003E\u003Cp\u003EAnyway, $40 is a quite important prize in the PC world, and although once you bought it, if you like it, you will love it and consider it a steal, many people won\u0027t try\u003C/p\u003E\n"},{"CreatedByName":"boxman","CreatedById":61559,"CreatedDateTime":"2015-06-02T01:17:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SmallFatFetus\u0022 data-cite=\u0022SmallFatFetus\u0022\u003E\u003Cdiv\u003EI bought the game for 20 dollars in a steam sale. I saw it today for 39.99. I know this isn\u0027t my place to judge, but I think that\u0027s a bit much. Don\u0027t get me wrong, I love the game and have logged hundreds of hours on it, but I see it as a bit of a barrier to entry. I\u0027ve recommended KSP several people about it and every one of them said it was too expensive. I would love to hear your opinions on this. \u003Cp\u003ESmallFatFetus\u003C/p\u003E\u003Cp\u003EEDIT: think of whether it\u0027s a turn off to new players. Is $40 too steep for a game they might not like?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEven though I think it was worth every single penny and even more I still think it is way overpriced for a indie game.\u003C/p\u003E\u003Cp\u003EAs it is now people just dont expect to pay anywhere near AAA price for indie games, so I think lowering the price would actually make squad more profits/sales.\u003C/p\u003E\n"},{"CreatedByName":"Ten Key","CreatedById":123319,"CreatedDateTime":"2015-06-02T01:28:08Z","Content":"\n\u003Cp\u003EI think the availability of dozens of high quality mods that let you polish and tailor the game as you see fit help justify a forty or even sixty dollar price point. \u003C/p\u003E\u003Cp\u003EFor me, the stock game is less of a finished product and more of a modular canvas. And that is a major selling point. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-06-02T02:03:01Z","Content":"\n\u003Cp\u003EI paid $17 for it and I think the \u0022release product\u0022 I got in 1.0.x was worth that, not much more. The graphics are substandard, the game could be much better optimized, career mode wasn\u0027t designed so much as slapped together from pieces found by the side of the road... There are a lot of great things about KSP but it\u0027s no $40 game. It may be in the future, but the release version isn\u0027t.\u003C/p\u003E\n"},{"CreatedByName":"Tourist","CreatedById":143403,"CreatedDateTime":"2015-06-02T02:12:45Z","Content":"\n\u003Cp\u003EWorth it! Can\u0027t remember what I paid originally, but it is very low considering the time I\u0027ve put into it. I\u0027m even considering buying if for a friend, for no other reason that I feel, relative to what the AAA market usually expects you to pay for a \u0022full length game\u0022, I\u0027ve gotten much much more value. \u003C/p\u003E\u003Cp\u003EIs it perfect? no. A rough diamond certainly. But a diamond nonetheless.\u003C/p\u003E\n"},{"CreatedByName":"helaeon","CreatedById":101767,"CreatedDateTime":"2015-06-02T02:12:49Z","Content":"\n\u003Cp\u003E$40 is a screaming deal. I\u0027ve bought the game twice (gave a copy to a friend). So I think I\u0027m at $50 now. I\u0027d gladly buy it for someone at $40 (and am considering it).\u003C/p\u003E\u003Cp\u003EEtherDragon\u0027s logic is the best for determining the price point. I think it\u0027s so they have somewhere to go for the sales. If they sell it for $30 on the sale and score a bunch of sales making up in volume. So sell 7 for $30 rather than 5 for $40, that\u0027s great. Harder to do that if you really should/need to get $30 for each copy, and it\u0027s always there so can\u0027t join in on the sales as you really can\u0027t sell it for less and make out even with volume.\u003C/p\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2015-06-02T02:16:00Z","Content":"\n\u003Cp\u003EIf you look at it from an outside view, then yeah, $40 could be seen as expensive for what is is. But when you look at it next to other full release games like Far Cry 4, GTA V, Assassins Creed WhateverIt\u0027sOnNow etc, it\u0027s pretty darn cheap. Also, I can guarantee you that in strictly hours spent playing per dollar, KSP wins by a country mile.\u003C/p\u003E\n"},{"CreatedByName":"mikeb30165","CreatedById":60789,"CreatedDateTime":"2015-06-02T02:19:18Z","Content":"\n\u003Cp\u003EYes it\u0027s overpriced, \u0026amp; I\u0027m saying that as a hardcore addict who\u0027s been playing KSP since 18.3. If anything, the game (stock or otherwise) feels even more unbalanced \u0026amp; \u0022rough around the edges\u0022 than it did back in 0.90 (even some old, annoying bugs are re-appearing - like the dreaded radial symmetry bug that I thought had been ironed out in 0.25!). \u003C/p\u003E\u003Cp\u003ESurely a new purchaser (which is what Squad needs a lot of to keep the game viable), would expect something at least a little more \u0022polished\u0022 than it is at the moment for their precious 40 bucks, especially when you consider Unity 5 is on the horizon? The game is bound to be even more buggier when it moves over to \u00275 initially and it certainly will be very, very different (and not necessarily better - all those broken mods/ balance issues!).\u003C/p\u003E\u003Cp\u003EAnd another thing; when is the demo going to be updated? Now it is no longer early access, this is about the only thing to tempt a wary newbie into a purchase; at the moment the demo does the game no justice at all and is very unrepresentative of the current version.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-02T02:33:12Z\u0022 title=\u002206/02/2015 02:33  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 2, 2015\u003C/time\u003E by mikeb30165\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"loch.ness","CreatedById":101329,"CreatedDateTime":"2015-06-02T02:26:30Z","Content":"\n\u003Cp\u003EI paid about 25-30 USD buying in at .23. \u003C/p\u003E\u003Cp\u003EI\u0027ve bought a few other games at that price range and Dragon Age Inquistion at double that.\u003C/p\u003E\u003Cp\u003EHours played (KSP beats everything by 10x or more).\u003C/p\u003E\u003Cp\u003EReplay value (KSP never truely ends and I don\u0027t seem to get bored of it).\u003C/p\u003E\u003Cp\u003EBrain stimulation: KSP has lead to me doing a lot of research into how real missions were flown and principles of rocketry and orbital mechanics. I\u0027ve begun doing mathematics and engineering for fun for some time now. I also have enormous fun recording some of my adventures as fiction over in Mission Reports.\u003C/p\u003E\u003Cp\u003EGraphics: For as simple as they are - with a few basic mods there are some sights which just blow you away. Kerbin rise on Mun is more impressive to be than all the blood-spatter of DA:I. Would I love an upgrade? Yeah. I wasn\u0027t able to get astronomers pack to work in V. 0.90 - I\u0027ll try again in Unity 5.\u003C/p\u003E\u003Cp\u003ESound: I usually wind up muting it - but this is rarely the most important part of a game.\u003C/p\u003E\u003Cp\u003EIn a meaningful analysis of value (monetary) compared to value (entertainment) I\u0027d say KSP was too cheap. In needs to be because the learning curve is so high and the perfect story of player traits is niche enough - but Its returned the investment many fold already when most games barely scratch the surface.\u003C/p\u003E\n"},{"CreatedByName":"DexterMcKerbin","CreatedById":142276,"CreatedDateTime":"2015-06-02T02:33:18Z","Content":"\n\u003Cp\u003Ebest 20 or so dollars I ever spent! (I bought the Steam beta) For me, the only game that even comes close in terms of hours logged is Skyrim \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"tg626","CreatedById":112361,"CreatedDateTime":"2015-06-02T02:34:28Z","Content":"\n\u003Cp\u003EEverything I\u0027ve read defending the price is predicated on knowing its value as a player, this us not the state if someone deciding if they should \u0022pull the trigger\u0022. You need a price point where someone us w ilking to take tgevgambke that they won\u0027t end up with a game they don\u0027t like. That\u0027s why I waited for a sale, and then later bought it again at full price.\u003C/p\u003E\n"},{"CreatedByName":"mikeb30165","CreatedById":60789,"CreatedDateTime":"2015-06-02T02:44:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tg626\u0022 data-cite=\u0022tg626\u0022\u003E\u003Cdiv\u003EEverything I\u0027ve read defending the price is predicated on knowing its value as a player, this us not the state if someone deciding if they should \u0022pull the trigger\u0022. You need a price point where someone us w ilking to take tgevgambke that they won\u0027t end up with a game they don\u0027t like. That\u0027s why I waited for a sale, and then later bought it again at full price.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETotally agree - the defenders are converts: newbies need to be converted. Put it this way: we know its a great game \u0027cos we took a punt on it when it was cheap, so forgave its \u0022quirks\u0022. Later, we really got ito it \u0026amp; now its an addiction (well, it is for me). But, $40 for a comparatively unknown indie game is a big ask for a newbie, \u0026amp; it looks overpriced (especially when you consider its far from the \u0022finished article\u0022).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-02T02:47:17Z\u0022 title=\u002206/02/2015 02:47  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 2, 2015\u003C/time\u003E by mikeb30165\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-06-02T03:21:32Z","Content":"\n\u003Cp\u003EKSP doesn\u0027t cost $40. The $40 cost is so when it\u0027s on sale for $30 or $20 people buy it. If it cost $20, nobody would buy it unless it was on sale for $15.\u003C/p\u003E\n"}]}