{"TopicId":111712,"ForumId":44,"TopicTitle":"Free-propellant space propulsion using graphene and light","CreatedByName":"Jesrad","CreatedById":49762,"CreatedDateTime":"2015-06-02T08:14:31Z","PageNum":1,"Articles":[{"CreatedByName":"Jesrad","CreatedById":49762,"CreatedDateTime":"2015-06-02T08:14:31Z","Content":"An unexpected discovery about graphene\u0027s weird properties: [it can \u0022turn\u0022 photons into electrons (turn the photons into pure momentum for its electrons, more accurately), and it can emit those electrons coherently, in one direction.](http://www.newscientist.com/article/mg22630235.400-spacecraft-built-from-graphene-could-run-on-nothing-but-sunlight.html) This makes it possible to get useful amounts of momentum by shining a laser or even raw sunlight (that was tested successfully) at graphene sheets. I mean \u0022useful\u0022 as in \u0022orders of magnitude more than a conventional solar sail\u0022. **The boffins were able to physically push a graphene sponge around with mere sunlight.**\n\nSimply said, this is a totally-OP form of solar sail. We live in exciting times."},{"CreatedByName":"monophonic","CreatedById":76902,"CreatedDateTime":"2015-06-02T08:26:23Z","Content":"This smells of cold fusion. Even if this was true, it would soon exhaust the electron supply in the spacecraft and leave it as a brick-in-space with a strong positive charge. I think some other phenomenon must be what caused the material to move."},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2015-06-02T08:55:53Z","Content":"\u003E \n\u003E This smells of cold fusion. Even if this was true, it would soon exhaust the electron supply in the spacecraft and leave it as a brick-in-space with a strong positive charge. I think some other phenomenon must be what caused the material to move.\n\nIn LEO, you can pick up pretty decent supply of matter to use as reaction mass in that manner. Even in interplanetary space, solar wind has enough intensity for this to outperform a solar sail, which relies on light pressure almost exclusively.\n\nMind, the thrust obtained in this manner is still minuscule. This won\u0027t compete even with current generation of ion thrusters. But if you are limited purely by reaction mass, and your only other option is a light sail, this can do way, way better in theory. Whether it ever becomes practical is another question."},{"CreatedByName":"vitekc45c","CreatedById":98257,"CreatedDateTime":"2015-06-02T09:04:10Z","Content":"So, a photon drive? What exactly is new about this?"},{"CreatedByName":"Perry Apsis","CreatedById":97519,"CreatedDateTime":"2015-06-02T11:48:15Z","Content":"\u003E \n\u003E So, a photon drive? What exactly is new about this?\n\nI think you must not have read the summary, much less the article. It doesn\u0027t emit photons, it absorbs them and emits electrons.\n\n(Although they didn\u0027t seem very confident that they actually knew what was happening.)"},{"CreatedByName":"Jesrad","CreatedById":49762,"CreatedDateTime":"2015-06-02T11:58:31Z","Content":"Yeah it\u0027s a solar-powered electron cannon which happens to be extremely lightweight and simple (two very desirable qualities for a space drive)."},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2015-06-02T12:08:28Z","Content":"\u003E \n\u003E (Although they didn\u0027t seem very confident that they actually knew what was happening.)\n\nIt\u0027s not like anyone famous ever got a Nobel Prize for discovering something like a photoelectric effect over a century ago, or anything.\n\nYeah, I\u0027m being facetious. But it\u0027s basically the same thing. The main difference is that electrons are thoroughly delocalized in graphene, so if you excite them with coherent light source, such as, say, a laser, you end up with the same coherence on the emitted electrons. And because electrons act as a wave here, you end up with a directed beam. Neat stuff, but it\u0027s honestly not rocket science. More like undergraduate level solid state physics in any decent university."},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2015-06-02T13:31:29Z","Content":"I wonder how big is the propulsion against simple photons boucing. They talk about orders of magnitud higher, I will like to know a more accurate measure.\n\nIt seems that graphene sponge can only resist 900c degress, but if the force is much higher, then I am interested.\n\nOne problem is that even if the graphene sponge is very light, is not as light as few graphene layers, so this affect the acceleration.\n\nSo we end with lightmass/lowforce vs heavymass/highforce ratio. It seems interesting.. I want to know more."}]}