{"TopicId":11189,"ForumId":25,"TopicTitle":"The K Prize - 100% reusable spaceplane to orbit and back","CreatedByName":"boolybooly","CreatedById":6572,"CreatedDateTime":"2012-05-22T08:29:40Z","PageNum":49,"Articles":[{"CreatedByName":"Damaske","CreatedById":60029,"CreatedDateTime":"2014-01-20T16:24:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022boolybooly\u0022 data-cite=\u0022boolybooly\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EDamaske, I am happy to say you are definitely in receipt of misinformation regarding mechjeb and the K-Prize. The OP states the rules clearly and all mods are allowed except those which alter stock flight physics. Mechjeb is perfectly acceptable. Personally I would encourage anyone playing KSP to experiment with manual control as it is rewarding when you get the knack and you feel like you have learnt something when you begin to understand the relationship between navball and craft flight, though I admit it can be a long and quite explodey learning curve. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAh ok i just love misinformation, And to clearifly I do not make use of the mechjeb\u0027s ascent, or lander auto pilots I only set them up and use em as a guild. I also HATE the ingame way to make maneuver nodes as they are so fekking hard to make so i use the maneuver planer also. The only times i use mechjebs auto pilot is to approach and dock with other craft since I\u0027ve not found a way to make it show me a guild, yet and docking well last time i tried to do that on my own i destroyed the docking ports somehow.... and no i was not moving fast together. \u003C/p\u003E\u003Cp\u003EWill be putting together a few submissions for this once I get a stock install loaded up and ready to go, I currently have restore installed and i don\u0027t want to accidentally use a item from there. Even though its just a bunch of scripts to \u0022weld\u0022 stock parts into one, or enlargements of squad parts. \u003C/p\u003E\u003Cp\u003EAlso Since the current minimalistic winner is a probe is there a title for a manned version? I have one in my head that i\u0027ma going to whip up and see how it goes. \u003C/p\u003E\u003Cp\u003EDamaske\u003C/p\u003E\n"},{"CreatedByName":"immelman","CreatedById":90345,"CreatedDateTime":"2014-01-20T20:02:25Z","Content":"\n\u003Cp\u003EHi boolybooly, can I join Mesklin in the making it to Laythe party?\u003C/p\u003E\u003Cp\u003ELaythe and back in my \u0022Big Silly Bird 3\u0022, the Joolian system is gorgeous, especially using some of the graphics mod textures out there.\u003C/p\u003E\u003Cp\u003EWith more landing gears and drogues landing on Laythe was a lot more straight forward, this craft has more than 8200 delta v, so when I have time I should have a try at Eeloo.\u003C/p\u003E\u003Cp\u003EThank you for an awesome challenge!\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/RFjYU\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2014-01-20T21:40:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022immelman\u0022 data-cite=\u0022immelman\u0022\u003E\u003Cdiv\u003EHi boolybooly, can I join Mesklin in the making it to Laythe party?\u003Cp\u003ELaythe and back in my \u0022Big Silly Bird 3\u0022, the Joolian system is gorgeous, especially using some of the graphics mod textures out there.\u003C/p\u003E\u003Cp\u003EWith more landing gears and drogues landing on Laythe was a lot more straight forward, this craft has more than 8200 delta v, so when I have time I should have a try at Eeloo.\u003C/p\u003E\u003Cp\u003EThank you for an awesome challenge!\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/RFjYU\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/RFjYU\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOK, now I have to fly my spaceplane if there\u0027s a trend.\u003C/p\u003E\u003Cp\u003EJust FYI: a transfer directly from Laythe to Kerbin is just over 1 km/s, rather than the nearly 2km/s you used.\u003C/p\u003E\n"},{"CreatedByName":"boolybooly","CreatedById":6572,"CreatedDateTime":"2014-01-20T21:47:18Z","Content":"\n\u003Cp\u003Ejmiki8 thanks for your mission report on Puli SAT which has successfully won the K-Prize and earned a very useful Utilitarial Commendation as well as the Advanced Pilot Precision Award for a precise landing on KSC runway. Duly linked on the guest list so I guess that is two tickets.\u003C/p\u003E\u003Cp\u003Eimmelman, looks like you have made it to the Laythe party with fuel to spare and accompanying honours with Big Silly Bird 3. It is a pretty select group so I think there is a snug off the lounge bar where Laythe voyagers can meet up and arm wrestle or play chequers or something \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E glad you are enjoying the challenge, thanks and you are welcome.\u003C/p\u003E\u003Cp\u003EDamaske if I start doing that I will end up looking at one minimalist record per capsule type and I have enough trouble keeping track of one (so no) ! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E But you are allowed to detach a capsule before launch and transfer a Kerbal to use the chair and the capsule wont count as lift off weight. I dont know how \u0022restore\u0022 works but it sounds like it alters mechanical properties of stock parts which would be against the rules, but I am willing to be corrected if anyone knows different. With docking it helps to set the target port as target and use \u0022control from here\u0022 on the approaching port then setting the camera to chase can also help though the navball should give you all the info you need for RCS control, also btw 0.3m/s max final fyi.\u003C/p\u003E\n"},{"CreatedByName":"immelman","CreatedById":90345,"CreatedDateTime":"2014-01-20T21:47:24Z","Content":"\n\u003Cp\u003ECome and join the party!\u003C/p\u003E\u003Cp\u003ERegarding the best way to return from Jool: I\u0027d like to know how you manage 1k/s, when I looked at it I quickly checked out using Tylo for a slingshot, but could not get an intercept. Should I have explored this further?\u003C/p\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2014-01-20T21:58:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022immelman\u0022 data-cite=\u0022immelman\u0022\u003E\u003Cdiv\u003ECome and join the party!\u003Cp\u003ERegarding the best way to return from Jool: I\u0027d like to know how you manage 1k/s, when I looked at it I quickly checked out using Tylo for a slingshot, but could not get an intercept. Should I have explored this further?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUsing a pork chop generator, e.g. \u003Ca href=\u0022http://alexmoon.github.io/ksp/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://alexmoon.github.io/ksp/\u003C/a\u003E type in that you\u0027re leaving from Jool at a circular orbit of 27184 km -- you are, because you\u0027re leaving from Laythe. That tells you that you need to leave that circular orbit with a roughly 1550 m/s burn. Burn when Kerbin is at -115 degrees phase, and when Laythe is 137 degrees to Jool\u0027s retrograde.\u003C/p\u003E\u003Cp\u003EBut that\u0027s assuming you were in orbit there on your own; actually, you\u0027re orbiting Laythe. On the one hand you have to fight its gravity, but on the other you already have ~1900 m/s relative to Laythe since you\u0027re in orbit. I have a \u003Ca href=\u0022https://github.com/numerobis/KSP-scripts/blob/master/planet.py#L213\u0022 rel=\u0022external nofollow\u0022\u003Escript\u003C/a\u003E to do that calculation (based on a \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/16511-Tutorial-Interplanetary-How-To-Guide\u0022 rel=\u0022external nofollow\u0022\u003Ethread\u003C/a\u003E by Kosmo-not), which tells me that if I\u0027m orbiting at 55km and want to be going 1550 m/s at the border of Laythe\u0027s SOI, I need to burn 1024 m/s. I have successfully used this calculation quite a few times.\u003C/p\u003E\u003Cp\u003EMy calculation doesn\u0027t say where you should be to Laythe\u0027s prograde. The goal is that you\u0027re going 1550 m/s at the border of Laythe\u0027s SOI and going parallel to Laythe\u0027s orbit, so you probably want to burn a bit before 90 degrees to Laythe\u0027s prograde, maybe 120 degrees? I don\u0027t know how to calculate this (it\u0027s probably easy?)\u003C/p\u003E\u003Cp\u003EThat assumes a circular 55km orbit. On Laythe you can be going much faster off your jets alone. If you set periapsis in the right place (somewhere between 90-120 degrees to prograde), every m/s extra you go is a m/s less you need to burn on that escape burn: conceivably you might be well under 1km/s of interplanetary burn.\u003C/p\u003E\u003Cp\u003EI did all of this sometime early last year, except I read the phase angle wrong, and ended up precisely where Kerbin would have been had Kerbin not been 180 degrees away in its orbit.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-20T22:10:39Z\u0022 title=\u002201/20/2014 10:10  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 20, 2014\u003C/time\u003E by numerobis\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"immelman","CreatedById":90345,"CreatedDateTime":"2014-01-21T00:09:48Z","Content":"\n\u003Cp\u003EThis is very helpful, I have been looking for information like this, the thread by Kosmo-not is what I needed. \u003C/p\u003E\u003Cp\u003EThank you!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-21T00:30:42Z\u0022 title=\u002201/21/2014 12:30  AM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 21, 2014\u003C/time\u003E by immelman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"jmiki8","CreatedById":94688,"CreatedDateTime":"2014-01-22T21:10:46Z","Content":"\n\u003Cp\u003EHere is my new minmus-capable SSTO, the \u0022Atomic\u0022 which has a seat for a pilot and one passenger. KSP didn\u0027t save some pictures, while getting into Kerbin orbit (or did I forgot to take them?), so I don\u0027t know if it counts as a successful mission.\u003C/p\u003E\u003Cp\u003ESo except for the Kerbin ascend pictures, here are the screenshots about the maiden mission:\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/8994L\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-22T21:15:21Z\u0022 title=\u002201/22/2014 09:15  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 22, 2014\u003C/time\u003E by jmiki8\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"boolybooly","CreatedById":6572,"CreatedDateTime":"2014-01-22T23:26:35Z","Content":"\n\u003Cp\u003EYes it counts jmiki8, in fact your word is good enough, though your screenies prove that you entered a different (Minmus) SOI which counts as completing the orbital phase of the mission and even if technically the PE on exit would not be outside the atmosphere, its regarded as sufficient as the dV you need to reach another SOI would easily put you in orbit. But in your case you landed on Minmus which means you were definitely orbiting Kerbin outside the atmosphere. Thanks for your report and congratulations on earning the coveted Astrokerbal Distinction and highly regarded Advanced Pilot Precision Award. Interesting coaxial engine mounting!\u003C/p\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2014-01-23T06:19:52Z","Content":"\n\u003Cp\u003EHere\u0027s a flight to LKO. Just a test flight so far; this plane will go further yet (but with some minor modifications):\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/jznKT\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EThe design has hab modules way out on the wingtips so that it can be spun up for artificial gravity during the long interplanetary transfer. Also, long, thick wings for STOL characteristics -- handy when you\u0027re trying to land in the wilderness. Three pilots; all the science equipment except the high-gain antennas; three hab modules. Enough fuel, theoretically, to make it to Laythe and back, but I need some practice piloting to achieve that.\u003C/p\u003E\u003Cp\u003EI messed up the bit where you reach orbital speed: I had too much vertical speed, too little horizontal speed (I was going over 100m/s vertical when I ran out of air). That cost me about 1km/s worth of jet fuel, more than I can afford to waste.\u003C/p\u003E\u003Cp\u003EI might also practice my landings; Bill had to go out and pump the burst tires after I hit the runway hard and overshot. I won\u0027t be flying with those wheels -- all they do is let me get a 17 m/s head start on liftoff, which is fun but not highly pointful. I was thinking of using them to steer on the ground, forgetting that normal landing gear do that too now.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-23T07:01:24Z\u0022 title=\u002201/23/2014 07:01  AM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 23, 2014\u003C/time\u003E by numerobis\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NikkyD","CreatedById":97466,"CreatedDateTime":"2014-01-23T10:09:40Z","Content":"\n\u003Cp\u003E:thumbs up: for thinking out of the box with the gravity during travel \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EQuite the monster u built there. Did u use FAR ?\u003C/p\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2014-01-23T17:04:52Z","Content":"\n\u003Cp\u003EStock \u002B mechjeb.\u003C/p\u003E\u003Cp\u003EI\u0027m pretty sure you need a much bigger plane for spinning to work. With too small a baseline, a Kerbal standing up in one of the hab modules would feel a lot more gravity at its feet than at its head, and they\u0027d get dizzy looking out the window. Practicable designs I\u0027ve seen call for a tether between the habitable parts and a counterbalance (eg spent fuel tanks), and then you spin around the mutual center of mass. The tether can be made quite long, which allows for a slow rotation and little difference in apparent gravity from head to toe.\u003C/p\u003E\n"},{"CreatedByName":"boolybooly","CreatedById":6572,"CreatedDateTime":"2014-01-25T10:54:34Z","Content":"\n\u003Cp\u003Enumerobis, I am assuming that by LKO you mean orbit with PE \u0026gt; 70km and I also made up a name for your craft. Congratulations on completing the K-Prize challenge with such an unusual design and making it back to the runway, welcome to the party guest list aka roll of honour.\u003C/p\u003E\n"},{"CreatedByName":"Sniper-Worms","CreatedById":63885,"CreatedDateTime":"2014-01-26T18:13:54Z","Content":"\n\u003Cp\u003ESo before taking advantage of the new overpowered Rapier engine, I decided to finally succeed at flying an SSTO old style (no Rapier) and it appears that it went way better than I expected :\u003C/p\u003E\u003Cp\u003EAfter docking to my station in orbit at 150km, I realised that I got enough fuel to make a fly-by of Minmus and I also got one of the Mun for the same price. Unfortunately I missed the landing at KSC but for a first launch I think I got pretty lucky.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/MuS6b\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd thanks for this awesome challenge that made me crash so many designs before getting the good one.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-26T18:46:32Z\u0022 title=\u002201/26/2014 06:46  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 26, 2014\u003C/time\u003E by Rich\u003C/strong\u003E\n\u003Cbr\u003EReplaced iframe with \u0026quot;imgur\u0026quot; tags\n\u003C/span\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2014-01-26T22:35:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022boolybooly\u0022 data-cite=\u0022boolybooly\u0022\u003E\u003Cdiv\u003Enumerobis, I am assuming that by LKO you mean orbit with PE \u0026gt; 70km and I also made up a name for your craft. Congratulations on completing the K-Prize challenge with such an unusual design and making it back to the runway, welcome to the party guest list aka roll of honour.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESorry, that was the Laytheill. The Laythewell will make it to Laythe and back, but without the suggestive undercarriage.\u003C/p\u003E\u003Cp\u003EI was in an unusually high orbit for me, 85km or so IIRC. Circularized, forgot to take a picture, then retro burn right away for the landing. All the drama is around 12-13km where lift drops off but thrust hasn\u0027t picked up yet, and again when the air runs out, so I forgot to take pictures after. I will need to write an automated ascent: I keep getting distracted.\u003C/p\u003E\n"},{"CreatedByName":"Dr.Moo","CreatedById":101899,"CreatedDateTime":"2014-01-27T20:32:59Z","Content":"\n\u003Cp\u003ESo here I have my submission: The Cicada. You can see a video of it in action at my youtube channel here:\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/ewUOG3Aswf0?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"boolybooly","CreatedById":6572,"CreatedDateTime":"2014-01-28T12:23:36Z","Content":"\n\u003Cp\u003ECongratulations Sniper-Worms for not only completing the K-Prize mission successfully but also docking with a space station and visiting the SOIs of MÃƒÂ¼n and Minmus before making a safe landing on Kerbin, for which you properly earned the much admired \u003Cspan style=\u0022color:#333333;\u0022\u003EKosmokerbal Commendation and the highly regarded Advanced Pilot Precision Award with Cydonia. Welcome to the K-Prize party invite list aka the roll of honour.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EOK thanks numerobis, name fixed. GL with your Laythe mission.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EDr.Moo thanks for posting your mission video set to music which provided the K-Prize committee with much entertainment, though I am sorry to say it was not possible to grant a K-Prize award for a vertical take off craft because this breaks rule #2 of the longstanding K-Prize rules! \u003C/span\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003E cf Cupcake\u0027s gatecrash for a precedent.\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003ERules\u003C/span\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003E1. The craft may not lose any parts in flight, no decoupling allowed. \u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003E2. \u003C/span\u003E\u003Cstrong\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EThe craft must lift off horizontally\u003C/span\u003E\u003C/strong\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003E, reach orbit (PE \u0026gt; 70,000m) and land intact ready for \u0027refuelling\u0027.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003E3. All fuel tanks, wings (lift generators) and engine parts must be stock, for fairness. \u003C/span\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003ESo with great respect and hoping you will enjoy the notoriety and or have another go, The Cicada mission has to be linked as a gatecrasher ! \u003C/span\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2014-01-28T15:26:21Z","Content":"\n\u003Cp\u003EI only recently gathered enough information to build successful spaceplanes - so I figured the time has finally come for me to make an entry in this long-running challenge. I hereby present the maiden operational flight of the Auk-IV Space Transportation System as my entry in this challenge.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/EYfpK\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EI did do some test runs with the design, obviously; this is the first time I ever had a spaceplane ever actually \u003Cstrong\u003Edo\u003C/strong\u003E something.\u003C/p\u003E\u003Cp\u003EAll stock parts of course, but from the album it\u0027s obvious I used a number of piloting assistance mods - KER, KAC, Precise Node, Enhanced Nav Ball, Crew Manifest and TAC Fuel Balancer. I also used my long-running sandbox game for the flight; I had previously set out a series of ground beacons for the KSC runway (which I set out in 0.21 and were rendered obsolete for runway alignment purposes with 0.22). The Julin MÃƒÂ¼n space station (my final destination for this flight) was established as an early part of Operation Outland (an effort to put satellites and stations in orbit around every body in the system and rovers on their surfaces). \u003C/p\u003E\u003Cp\u003EShould be a good enough flight for a Kosmokerbal Commendation, Pilot Proficiency Medal and Advanced Pilot Precision Award 1stClass - not sure about that last one. I mean, I did pull a docking maneuver, but not in orbit of Kerbin...\u003C/p\u003E\n"},{"CreatedByName":"boolybooly","CreatedById":6572,"CreatedDateTime":"2014-01-28T16:28:07Z","Content":"\n\u003Cp\u003ELooks good to me capi3101, the pilot proficiency medal is included in the \u003Cspan style=\u0022color:#333333;\u0022\u003EAdvanced Pilot Precision Award 1stClass by the way. Thanks for your thorough mission report and congratulations on completing the K-Prize mission successfully and with flying colours. Welcome to the K-Prize party guest list aka the roll of honour.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"Rhomphaia","CreatedById":2440,"CreatedDateTime":"2014-01-31T15:46:01Z","Content":"\n\u003Cp\u003EThe second test flight of the Siskin. A small but functional SSTO designed as a single Kerbal transport to stations in LKO. This flight was to test the tweaked fuel loading (could still be tweaked further) and RCS systems.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/9VzPw\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"boolybooly","CreatedById":6572,"CreatedDateTime":"2014-01-31T20:26:54Z","Content":"\n\u003Cp\u003EThanks for your mission report and congratulations Romphaia for completing the K-Prize challenge at last and earning the highly regarded Advanced Pilot Precision Award 1stClass for docking Siskin in orbit and landing safely on Kerbin at the KSC runway. Welcome to the guest list for the K-Prize party! I can leave the earlier gatecrasher listing in place in the roll of honour / infamy unless you would like to have it removed, as is your right having succeeded in completing the challenge.\u003C/p\u003E\n"},{"CreatedByName":"Tarmenius","CreatedById":16990,"CreatedDateTime":"2014-02-03T19:12:58Z","Content":"\n\u003Cp\u003EI, like many others, have been playing around a bit with the new R.A.P.I.E.R. engine. Although it feels easier to use, it is definitely less effective than other, more traditional configurations. Still, it is fun to play with.\u003C/p\u003E\u003Cp\u003EThis design, the Distesa, was a hopeful attempt at making a R.A.P.I.E.R. SSTO that could reach higher orbits(~600km) without the need for refueling. But given the performance limitations of the engine, I think it will be better suited to small crew transfers to stations at or below 200km. If I\u0027m going to need to add more complexity to the design to make it work, I may as well use a configuration that\u0027s more effective to begin with.\u003C/p\u003E\u003Cp\u003EAt any rate, here is the Distesa (SSTO-R 3):\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/Vcou7\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2014-02-03T21:11:51Z","Content":"\n\u003Cp\u003EWould a spaceplane that lands vertically on the KSC launchpad, but take off horizontally be allowed?\u003C/p\u003E\u003Cp\u003EThat\u0027s my design for the XRP-17B\u003C/p\u003E\n"},{"CreatedByName":"boolybooly","CreatedById":6572,"CreatedDateTime":"2014-02-04T14:59:43Z","Content":"\n\u003Cp\u003EYes NASAFanboy, K-Prize missions can land any way you like as long as it is one piece!\u003C/p\u003E\u003Cp\u003ETarmenius, welcome back to the K-Prize challenge, thanks for your mission report, congratulations on winning an \u003Cspan style=\u0022color:#333333;\u0022\u003EAdvanced Pilot Precision Award 1stClass with \u003C/span\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003Ethe Distesa twin rapier based spaceplane for docking in orbit and landing at KSC runway. Nice attention to aesthetics with the wing shape and tailplane design btw.\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"Rhomphaia","CreatedById":2440,"CreatedDateTime":"2014-02-04T19:14:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022boolybooly\u0022 data-cite=\u0022boolybooly\u0022\u003E\u003Cdiv\u003EThanks for your mission report and congratulations Romphaia for completing the K-Prize challenge at last and earning the highly regarded Advanced Pilot Precision Award 1stClass for docking Siskin in orbit and landing safely on Kerbin at the KSC runway. Welcome to the guest list for the K-Prize party! I can leave the earlier gatecrasher listing in place in the roll of honour / infamy unless you would like to have it removed, as is your right having succeeded in completing the challenge.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI would like to leave it where it is. The Phoenixhammer line has come along a bit since that prototype though and I have finally tried my hand at an LV-N powered space plane. Presenting the Phoenixhammer MK1-N\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/cjPZA\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"}]}