{"TopicId":111838,"ForumId":16,"TopicTitle":"Current Scale Heights? (also, terminal velocities plots)","CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-06-03T11:38:23Z","PageNum":1,"Articles":[{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-06-03T11:38:23Z","Content":"\n\u003Cp\u003EWhat are current Scale Heights of planet atmospheres? As I understand, they are currently functions rather than constants? (still, a decent approximation would be sufficient).\u003C/p\u003E\u003Cp\u003EI\u0027m trying to create a graph of terminal velocities for various planets, and using the \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Atmosphere\u0022 rel=\u0022external nofollow\u0022\u003EAtmosphere\u003C/a\u003E article I got to create a script...\u003C/p\u003E\u003Cp\u003EAs you see below, \u0022Hw\u0022 - scale heights - exist in two variants. The first is data gathered from the wiki. The other I got from \u003Ca href=\u0022http://http//kos.wikia.com/wiki/Atmospheric_Calculations\u0022 rel=\u0022external nofollow\u0022\u003Ethis article.\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBoth are dubious. The Wiki data for Jool means you\u0027re getting a sharp cut-off at its 200,000km atmospheric border, terminal velocity at some 560m/s turning into nothing. Also, Duna would be about the same as Kerbin in terms of terminal velocity, despite the atmosphere being much thinner, and similar Laythe hardly better than Eve. The other link data seems like nice, round numbers (too nice?) with believable curves, but dates back to 2013.\u003C/p\u003E\u003Cp\u003ECould someone give me current Scale Height values? (and also, check if I didn\u0027t goof somewhere else)?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003E# drag coefficient, vehicle dependent\u003Cbr\u003Ed=0.2\u003Cbr\u003E\u003Cbr\u003Enames = \u0022Duna Laythe Kerbin Eve Jool\u0022\u003Cbr\u003E\u003Cbr\u003E# zero altitude pressure\u003Cbr\u003Ep0w = \u00220.2 0.6 1 5 15\u0022\u003Cbr\u003E\u003Cbr\u003E# Scale Height\u003Cbr\u003E#Hw = \u00226000 8000 5600 7300 31000\u0022\u003Cbr\u003EHw = \u00223000 4000 5000 7000 10000\u0022\u003Cbr\u003E\u003Cbr\u003E# Planet masses\u003Cbr\u003EMw = \u00224.5154812e21 2.9397663e22 5.2915793e22 1.2244127e23 4.2332635e24\u0022\u003Cbr\u003E\u003Cbr\u003E#Planet radii\u003Cbr\u003Erw = \u0022320000 500000 600000 700000 6000000\u0022\u003Cbr\u003E\u003Cbr\u003E#Atmospheric heights (graph cut-off)\u003Cbr\u003Emhw = \u002250000 50000 70000 90000 200000\u0022\u003Cbr\u003E\u003Cbr\u003Ep0(n) = 1.0*word(p0w,n)\u003Cbr\u003EH(n) = 1.0*word(Hw,n)\u003Cbr\u003EM(n) = 1.0*word(Mw,n)\u003Cbr\u003Er(n) = 1.0*word(rw,n)\u003Cbr\u003Emw(n) = 1.0*word(mhw,n)\u003Cbr\u003E\u003Cbr\u003EVtn(h,n) = sqrt((250 * 6.67384e-11 * M(n)) / (((r(n) \u002B h)**2) * 1.2230948554874 * p0(n) * exp(-h/H(n)) * d ))\u003Cbr\u003E\u003Cbr\u003Eset dummy h\u003Cbr\u003Eset xlabel \u0022Altitude [m]\u0022\u003Cbr\u003Eset ylabel \u0022Terminal velocity [m/s]\u0022\u003Cbr\u003E\u003Cbr\u003Eset xrange [1 : 90000]\u003Cbr\u003Eset yrange [0 : 5000]\u003Cbr\u003Eset grid x y\u003Cbr\u003E\u003Cbr\u003Eplot for [i=1:words(names)] (h \u0026gt; mw(i))?NaN:Vtn(h,i) title word(names, i) \u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/wSBoWB2.png\u0022 alt=\u0022wSBoWB2.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/P4Xfdfw.png\u0022 alt=\u0022P4Xfdfw.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-03T17:36:01Z\u0022 title=\u002206/03/2015 05:36  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 3, 2015\u003C/time\u003E by Sharpy\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Redhaze","CreatedById":137633,"CreatedDateTime":"2015-06-03T11:54:12Z","Content":"\n\u003Cp\u003EIn general, with the new atmospheric model, you\u0027re goofing already, simply because of making the assumption that terminal velocity still remains the same regardless of shape, volume and weight. You\u0027re better off mapping atmospheric density, which at least remains somewhat the same, assuming conditions (temperature) remain the same.\u003C/p\u003E\u003Cp\u003EAbout Kerbin and Duna: That\u0027s actually about right. Duna\u0027s thinner atmosphere is offset by it\u0027s lower gravity. (and lower temperature)\u003C/p\u003E\u003Cp\u003ETL,DR: The atmospheric model doesn\u0027t work that way any more.\u003C/p\u003E\n"},{"CreatedByName":"Murph","CreatedById":90837,"CreatedDateTime":"2015-06-03T12:03:00Z","Content":"\n\u003Cp\u003EThe model has completely changed. We updated the scale heights on the wiki, but they are now no longer high precision, and not accurate over the entire altitude range. The numbers on the wiki for \u0022scale height\u0027 are probably as good as you will get, but are basically a quite rough approximation over the majority of the altitude range, and particularly inaccurate at the upper limit of the atmospheres. They are just a very rough approximation to the completely new model. At the very upper end, Squad\u0027s new model basically forces the pressure rapidly to zero (off the top of my head, that\u0027s somewhere around 62.5km upwards on Kerbin). The new model does not have a single equation from sea level to space.\u003C/p\u003E\u003Cp\u003EThat Wikia article is from 2013, so completely out of date for KSP 1.0. The official KSP wiki\u0027s info on atmospheres on each celestial body\u0027s individual page should now be mostly up to date, I believe, thanks to some extensive work by one of the contributors (although I believe he\u0027s still working on it). Check the revision history on each page, and it should be quite obvious which articles have been heavily worked on over the last month.\u003C/p\u003E\u003Cp\u003E(The \u0022Atmosphere\u0022 article on the KSP wiki is indeed outdated at present, as noted in the prominent notice at the top of the article.)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-03T12:13:04Z\u0022 title=\u002206/03/2015 12:13  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 3, 2015\u003C/time\u003E by Murph\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Chaos_Klaus","CreatedById":140720,"CreatedDateTime":"2015-06-03T12:03:35Z","Content":"\n\u003Cp\u003EThis: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/117069-Great-New-Physics-Thread%21?p=1894742\u0026amp;viewfull=1#post1894742\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/117069-Great-New-Physics-Thread%21?p=1894742\u0026amp;viewfull=1#post1894742\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Eand \u003C/p\u003E\u003Cp\u003Ethis: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/117069-Great-New-Physics-Thread%21?p=1940443\u0026amp;viewfull=1#post1940443\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/117069-Great-New-Physics-Thread%21?p=1940443\u0026amp;viewfull=1#post1940443\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAlso, terminal velocity is no longer important for launching rockets. Terminal velocity is very high now. So high that it makes for impractical ascent trajectories.\u003C/p\u003E\n"},{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-06-03T12:39:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Murph\u0022 data-cite=\u0022Murph\u0022\u003E\u003Cdiv\u003EThe numbers on the wiki for \u0022scale height\u0027 are probably as good as you will get, but are basically a quite rough approximation over the majority of the altitude range, and particularly inaccurate at the upper limit of the atmospheres.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey are pretty much moot for upper atmosphere (concerning terminal velocities) as you\u0027ll never exceed them (for longer than a couple seconds anyway). either escaping the atmosphere or descending into lower layers - if you move at terminal speed through upper atmosphere, you\u0027re probably moving way too fast anyway.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Chaos_Klaus\u0022 data-cite=\u0022Chaos_Klaus\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAlso, terminal velocity is no longer important for launching rockets. Terminal velocity is very high now. So high that it makes for impractical ascent trajectories.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m still getting flames surrounding my rocket and overheating my systems if I\u0027m using my \u0022big asparagus\u0022 subassembly (7 Twin Boars) for a load that really doesn\u0027t require so much much. Generally, exceeding 1000m/s in the 20000-30000m altitude range results in these effects. Are they related to terminal velocity?\u003C/p\u003E\n"},{"CreatedByName":"OhioBob","CreatedById":128005,"CreatedDateTime":"2015-06-03T17:22:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sharpy\u0022 data-cite=\u0022Sharpy\u0022\u003E\u003Cdiv\u003EI\u0027m trying to create a graph of terminal velocities for various planets...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYour premise is wrong right from the start. Under the old aero model, every vehicle, regardless of its size and configuration, had the exact same \u003Ca href=\u0022https://en.wikipedia.org/wiki/Ballistic_coefficient\u0022 rel=\u0022external nofollow\u0022\u003Eballistic coefficient\u003C/a\u003E (it was a universal constant in the game)*. Also, the air density at any given altitude on any given planet was a constant. It was therefore possible to compute an exact and consistent value of the terminal velocity at a given altitude. This is no longer true. Ballistic coefficient is now dependent on the shape, size, \u003Cem\u003Eand speed\u003C/em\u003E of the vehicle - it is highly variable. Furthermore, air density is now a function of temperature, which varies by latitude and time of day. All these variable factors now make it impossible to produce a table or graph of terminal velocity with any reliability.\u003C/p\u003E\u003Cp\u003EAs Murph explained, the scale heights listed in the Wiki article are just a rough approximation, and not even a very close approximation in some cases. Scale height now varies with altitude. It is no longer possible to compute pressure using the old method. If an approximate value of pressure is close enough, I recommend the following: Each planet\u0027s Wiki article now contains a table of altitude (Z) and pressure (P). Create a graph in which you plot LN(P) versus Z. Fit a trendline to the data points so that you now have LN(P) as a function of Z. The pressure is simply the exponential of LN(P), that is, P = EXP(f(Z)).\u003C/p\u003E\u003Cp\u003E(edit)\u003C/p\u003E\u003Cp\u003E* Correction, ballistic coefficient was a constant for a given drag coefficient. However, drag coefficient varied very little from one vehicle to another, with a value of about 0.2. For most computations it was assumed that Cd = 0.2, thus the ballistic coefficient was also assumes to have a constant value of 625 kg/m\u003Csup\u003E2\u003C/sup\u003E.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-03T17:41:00Z\u0022 title=\u002206/03/2015 05:41  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 3, 2015\u003C/time\u003E by OhioBob\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"maccollo","CreatedById":72759,"CreatedDateTime":"2015-06-03T18:24:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sharpy\u0022 data-cite=\u0022Sharpy\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI\u0027m still getting flames surrounding my rocket and overheating my systems if I\u0027m using my \u0022big asparagus\u0022 subassembly (7 Twin Boars) for a load that really doesn\u0027t require so much much. Generally, exceeding 1000m/s in the 20000-30000m altitude range results in these effects. Are they related to terminal velocity?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMach effects is simply a function of atmospheric density and speed. All objects will create the same atmospheric effects at the same speed, while their terminal velocity will vary to a great degree.\u003C/p\u003E\u003Cp\u003EYour typical rocket will be so aerodynamic that it simply can\u0027t catch up with it\u0027s TC. In this example I have a first stage that is 90% powered by solids (low ISP, TWR increases rapidly) with an initial TWR of 2.0. Despite the ludicrous amount of mach effects you can see that the atmospheric efficiency is only 69%, which means the rocket is only at about half TC. Even in the transonic region the atmospheric efficiency only goes up to about 82%.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/22015656/TC1.png\u0022 alt=\u0022TC1.png\u0022\u003E\u003C/p\u003E\n"}]}