{"TopicId":111892,"ForumId":36,"TopicTitle":"[WIP] DEV: Lithobrake Exploration Technologies 0.1 (2015-07-08)","CreatedByName":"NecroBones","CreatedById":105424,"CreatedDateTime":"2015-06-03T20:57:37Z","PageNum":1,"Articles":[{"CreatedByName":"NecroBones","CreatedById":105424,"CreatedDateTime":"2015-06-03T20:57:37Z","Content":"\n\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003EThis thread is no longer needed.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003EPLEASE GO TO THE \u003C/span\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/130517\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003ERELEASE THREAD\u003C/span\u003E\u003C/a\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003E.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E-------\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EOriginal post:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E-------\u003C/p\u003E\u003Cp\u003EI figured I\u0027d do something I don\u0027t usually do, and start a development thread before I have a bunch of parts to release.\u003C/p\u003E\u003Cp\u003EI\u0027m planning on starting another (smallish) parts pack. Something that I\u0027ve noticed is that people are more likely to download and try a mod if it\u0027s fairly specific in what it tries to do, rather than being a huge parts pack that fills every tab in the VAB with loads of new parts. So with that in mind, I thought I\u0027d mention here what this pack will try to do, and why it doesn\u0027t belong in my other existing mods. \u003C/p\u003E\u003Cp\u003EI don\u0027t get as much time to work on modding as I did back in the fall/winter, however the speed at which I was making things back then was partly driven by a desire to get as much as I could done, before having more demands on my time. So this probably will develop a bit more slowly. \u003C/p\u003E\u003Cp\u003ETentatively: \u003Cstrong\u003EKerbal Exploration Technologies\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m still looking around to make sure the name isn\u0027t overlapping too badly with anything else out there. It looks like the \u0022USI Exploration Pack\u0022 may have been called the \u0022Kerbal Exploration Pack\u0022 once upon a time, but it\u0027s different enough now that this might be OK. Nothing else really came up on a quick google search though.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EIntended Purpose\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EI have kept a list of a lot of the requests for parts that were made on my other mod threads. A lot of them are great ideas, and I realized that some of them would fit better in a new pack. Specifically:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EAlternate sizes, and intermediate configurations of command pods (lander cans, and capsules).\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ELong ladders (both fixed, and deployable)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ELarger service bays\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAdditional sizes of lander legs (maybe?) *\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E(and possibly others)\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E* Not happening before Unity 5 KSP is out, if at all, since that will likely break all types of landing gear\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EOriginally I started thinking about a pod-only pack, but realized that service bays and ladders work well with the idea of Munar transportation, and landers. \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EHow it fits in\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ESo, here\u0027s a quick run-down of the focus of my other mods, and where this fits in:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003E\u003Ca href=\u0022https://goo.gl/R0ZETO\u0022 rel=\u0022external nofollow\u0022\u003ESpaceY Heavy Lifters\u003C/a\u003E (Large 5m parts, associated accessories, and a spread of SRBs. Stuff to get you to space.)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Ca href=\u0022https://goo.gl/qmZQ0W\u0022 rel=\u0022external nofollow\u0022\u003EModular Rocket Systems\u003C/a\u003E (Mostly stock-alike parts filling in gaps in stock line-up, and providing a few alternatives to stock items.) \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Ca href=\u0022https://goo.gl/uxZHPx\u0022 rel=\u0022external nofollow\u0022\u003EColor Coded Canisters\u003C/a\u003E (Visual replacement for stock rocket fuel tanks, color coding the end-caps based on diameter, while prettying them up a little.)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Ca href=\u0022https://goo.gl/Xlljrw\u0022 rel=\u0022external nofollow\u0022\u003EFuel Tanks Plus\u003C/a\u003E (Additional sizes and visual styles of fuel tanks, extending the style established in CCC.) \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Ca href=\u0022https://goo.gl/mCJQZ9\u0022 rel=\u0022external nofollow\u0022\u003E0-Point Inline Fairings\u003C/a\u003E (fairings only, and doesn\u0027t currently shield anything in new stock aerodynamics.)\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThe idea is basically that SpaceY is focused on adding 5m parts and enough accessories to make 5m useful, and back-fill those parts that are missing in 3.75m. MRS is already pretty huge and is an eclectic mix of things, usually individual unique ideas that fill specific niches. \u003C/p\u003E\u003Cp\u003ESince pods can be a big task on their own, and ladders and service bays can be logically associated with them, this seemed like a nice grouping that will work nicely alongside the other mods, and also be a manageable size. And some people might want what this offers while having no interest in my other packs, and that\u0027s fine too.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EGetting started\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ESo here\u0027s what I\u0027m thinking so far, at least to start:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003E2.5m 3-man lander can, octagonal, similar in concept to Mk1 Lander Can. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E1.25m 2-man capsule. Gemini-like capsules already exist in other mods, so I was thinking maybe something with the Kerbals seated front-and-rear, but I\u0027m not married to this idea. Still debating it. But it would be nice to have an option between the Mk1 and Mk1-2 capsules in stock. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EFixed ladders, probably 2 or 3 lengths. Maybe 1m, 2m, and 4m.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EA very long deployable ladder, maybe 1.5x or 2x the length of the longer stock ladder.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ELonger service bays, possibly 1.5x to 1.75x the length of the stock models.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E3.75m service bay. \u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m certainly interested in collecting more ideas, but I don\u0027t want the parts list to explode out of control. At least not while I still haven\u0027t made the above yet. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/NgMBaTm.jpg\u0022 alt=\u0022NgMBaTm.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-03T23:00:09Z\u0022 title=\u002208/03/2015 11:00  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 3, 2015\u003C/time\u003E by NecroBones\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MarcAlain","CreatedById":141219,"CreatedDateTime":"2015-06-03T23:10:36Z","Content":"\n\u003Cp\u003EI wouldn\u0027t waste time with a 2 person pod. There\u0027s now a plethora of options: K2 (finally has IVA), the HGR Radish, Corvus, FASA, Novapunch, and NearFuture Spaceships. \u003C/p\u003E\u003Cp\u003EA 5 meter to 3.75 meter pod would be nice, or rather, a 3.75 meter to 2.5/1.25 meter pod with a \u0022big gemini\u0022 style add on cone behind it that lines up really well that goes from 5m to 3.75, so you can haul a lot more kerbals to orbit. The smaller pod could hold 5-7 kerbals easily, then the larger section could hold another 10\u002B. \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.daviddarling.info/images/Big_Gemini_mockup.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.daviddarling.info/images/Big_Gemini_mockup.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://upload.wikimedia.org/wikipedia/commons/0/07/Big_Gemini.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://upload.wikimedia.org/wikipedia/commons/0/07/Big_Gemini.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI like the two part option, because that gives us another pod in the 3.75m range.\u003C/p\u003E\u003Cp\u003EAlso, some extra parts to make building service/command modules would be nice.\u003C/p\u003E\u003Cp\u003E The 3.75 meter service bay will work quite well with this to give it an orion look. Or, a flatter 5meter service bay to give it the CST-100 look. \u003C/p\u003E\u003Cp\u003EA docking port nose cone with built in parachutes could be awesome as well, and actually would look really good with a 3.75 meter base/2.5 meter top pod.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-03T23:13:00Z\u0022 title=\u002206/03/2015 11:13  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 3, 2015\u003C/time\u003E by MarcAlain\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Wahgineer","CreatedById":59292,"CreatedDateTime":"2015-06-04T01:25:43Z","Content":"\n\u003Cp\u003EWould you consider my suggestion I made in the Space Y thread: a self contained 5m biconic spacecraft? (Basically command pod, fuel tank, and engine as it\u0027s specific parts)\u003C/p\u003E\n"},{"CreatedByName":"MarcAlain","CreatedById":141219,"CreatedDateTime":"2015-06-04T01:30:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022awsumindyman\u0022 data-cite=\u0022awsumindyman\u0022\u003E\u003Cdiv\u003EWould you consider my suggestion I made in the Space Y thread: a self contained 5m biconic spacecraft? (Basically command pod, fuel tank, and engine as it\u0027s specific parts)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m going to echo his sentiments as that being a bad idea, in the spirit of the game. A spaceplane? I wish there were more one part spaceplanes * with customizable bays *\u003C/p\u003E\u003Cp\u003EA pod/capsule? Not so much.\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2015-06-04T01:57:46Z","Content":"\n\u003Cp\u003EA few things that would be cool to see (I\u0027m thinking landers here, I don\u0027t care as much about Gemini pods, there are a few mods for that).\u003C/p\u003E\u003Cp\u003EOne, I\u0027d like the possibility of inset parts for a 2-stage lander. Like a lander base stage with hole or something (another mod does this). That or whatever might actually work without have huge, top heavy landers (I\u0027ll admit I\u0027m thinking of scaled up kerbol system mods with stock parts, so not hyper-critical).\u003C/p\u003E\u003Cp\u003ETwo, It would be cool, perhaps for a 3.75m service bay to think of it beneath a lander/hab of some kind, perhaps with rover garage functionality. This would require a similar sized tab/control unit to stack above.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-04T02:02:32Z\u0022 title=\u002206/04/2015 02:02  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 4, 2015\u003C/time\u003E by tater\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nothalogh","CreatedById":139345,"CreatedDateTime":"2015-06-04T02:14:23Z","Content":"\n\u003Cp\u003EOne thing needed for big landers is adjustable landing legs for levelling on uneven ground.\u003C/p\u003E\u003Cp\u003EAlso aeroshells for landing big honkin rovers and base components in atmospheres\u003C/p\u003E\n"},{"CreatedByName":"Drake1500","CreatedById":134696,"CreatedDateTime":"2015-06-04T03:58:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NecroBones\u0022 data-cite=\u0022NecroBones\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ESo here\u0027s what I\u0027m thinking so far, at least to start:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003E2.5m 3-man lander can, octagonal, similar in concept to Mk1 Lander Can.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E1.25m 2-man capsule. Gemini-like capsules already exist in other mods, so I was thinking maybe something with the Kerbals seated front-and-rear, but I\u0027m not married to this idea. Still debating it. But it would be nice to have an option between the Mk1 and Mk1-2 capsules in stock.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EFixed ladders, probably 2 or 3 lengths. Maybe 1m, 2m, and 4m.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EA very long deployable ladder, maybe 1.5x or 2x the length of the longer stock ladder.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ELonger service bays, possibly 1.5x to 1.75x the length of the stock models.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E3.75m service bay.\u003C/li\u003E\u003C/ul\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EFor what it\u0027s worth, here\u0027s my 2 cents:\u003C/p\u003E\u003Cp\u003EI don\u0027t feel any lack of 1.25m or 2.5m pods. On the other hand, as MarcAlain has pointed out, there is a bit of a dearth of 3.75m\u002B pods.\u003C/p\u003E\u003Cp\u003EI have definitely felt the lack of longer ladders, especially longer fixed ladders. If you had a pack that consisted entirely of ladders, it would probably be an insta-download. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI haven\u0027t felt the lack of long service bays, but now that I think about it.... they would be pretty useful. I\u0027ve definitely stacked up the stock service bays to get more space. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI do like the look/functionality of the stock service bays but haven\u0027t seen any replications; is this something that is doable?\u003C/p\u003E\n"},{"CreatedByName":"helaeon","CreatedById":101767,"CreatedDateTime":"2015-06-04T03:58:40Z","Content":"\n\u003Cp\u003EI would welcome more landing leg options and more lander pod options (another 2 man lander pod in a different form, and 3-5 kerbal pods).\u003C/p\u003E\u003Cp\u003ELadders might be cool. Maybe a procedural one, especially now that mass matters.\u003C/p\u003E\u003Cp\u003EHow about a cargo bay that opens downward(upward). For example maybe you\u0027d put your engines around radially, then have that in the center full of all your science experiments but it\u0027s pretty flat so the dome opens up. Kind of like the Multispectral Scanner from DMagic\u0027s parts? Or maybe one that attaches radially? Could be kind of like a blister pack possibly.\u003C/p\u003E\n"},{"CreatedByName":"NecroBones","CreatedById":105424,"CreatedDateTime":"2015-06-04T15:14:13Z","Content":"\n\u003Cp\u003EOK cool, some great discussion going here. It\u0027s definitely giving me things to think about. A few notes though:\u003C/p\u003E\u003Cp\u003EFor 3.75m pods, there are two main options I\u0027m aware of already: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/52042-1-02-Near-Future-Technologies-(NFSolar-NFSpacecraft-NFConstruction-hotfixed)\u0022 rel=\u0022external nofollow\u0022\u003ENear Future Spacecraft\u003C/a\u003E, and \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/75074-1-0-Taurus-HCV-3-75-m-CSM-System-v1-5-1-May-25-2014\u0022 rel=\u0022external nofollow\u0022\u003ETaurus HCV\u003C/a\u003E. Both look pretty robust, so I\u0027d have to think about what I could do differently here.\u003C/p\u003E\u003Cp\u003EI\u0027ll keep going on the 3-man octagonal lander pod, since I think that\u0027s a useful niche with three available professions for Kerbals. I\u0027ll base the mass ratio on the existing lander cans. \u003C/p\u003E\u003Cp\u003EI do want to be careful about overly obsoleting stock parts. Extending, without replacing. So with that in mind, there are probably still some combinations we can come up with. I mainly want to get a good feel for where I should put the development time before getting too deeply into it. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EThat \u0022Big G\u0022-Gemini thing does look pretty cool. I could see maybe doing a capsule with an unusual base diameter, with a few interchangeable \u0022adapter\u0022 sections that bring it up to 2.5m or 3.75m (not sure which is better here), that could include a crew transport or a service bay, etc. At 3.75m for the back end, it would overlap with the Taurus though. I\u0027m still open to ideas here of course.\u003C/p\u003E\u003Cp\u003EHere\u0027s what I wrote down as \u0022wishlist items\u0022 that people suggested in other threads (not necessarily as a \u0022to-do list\u0022):\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003E1.25m 1-man lander can (slim cylinder, as opposed to stock bulky octagon)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E1.25m 2-man lander and/or capsule\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E2.5m 4-man capsule (tall, wide necked \u0022wine bottle\u0022)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E2.5m 3-man lander can (bulky octagon)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E3.75m 5-man capsule (possible collision with Taurus and Near Future)\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EUnfortunately procedural parts are something I can\u0027t do. I still want to aim for very few (if any) dependencies on other mods, and maintain a stock-like functionality as much as I can. I wouldn\u0027t even know where to start on self-balancing (or in-situ adjustable) landing legs. \u003C/p\u003E\u003Cp\u003EFor the service bays, I\u0027m thinking something similar to the stock bays, but with sliding doors. (As an aside, I\u0027m probably going to completely rework the MRS cargo bay doors too, so they don\u0027t get in the way as much).\u003C/p\u003E\u003Cp\u003EEDIT: Would it be worth splitting the ladders out to a separate pack after all?\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2015-06-04T16:33:58Z","Content":"\n\u003Cp\u003EFor 3.75m, there have been a few \u0022Duna Direct\u0022 mods started that have what I tend to think of when I think of needed lander parts at large size that don\u0027t exist.\u003C/p\u003E\u003Cp\u003EKerbal landers tend to either get tall, or they are wide contraptions that are hard to launch with rockets that look like rockets. Some sort of intentional rover delivery system would be kinda neat. It seems like a rover could fit horizontally within a 3.75m part, the trick is getting it out and having room for engines/fuel.\u003C/p\u003E\u003Cp\u003EI\u0027m bad at this, take pity \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i121.photobucket.com/albums/o222/tatersw/KSP/garage.jpg\u0022 alt=\u0022garage.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ERoom for propellant on the sides, and a node under each solid side for an engine. There would either be a floor which might need a ramp for rovers (possible?) or open on the bottom, and doors. Also a node on the center of the inside top to hang the rover. Obviously any scale seen here is entirely imaginary, I have no idea what I am doing.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-04T17:09:50Z\u0022 title=\u002206/04/2015 05:09  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 4, 2015\u003C/time\u003E by tater\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MarcAlain","CreatedById":141219,"CreatedDateTime":"2015-06-04T18:20:41Z","Content":"\n\u003Cp\u003EI don\u0027t think overlapping with Taurus or NF is a problem. \u003C/p\u003E\u003Cp\u003EWhat if those mods aren\u0027t available any longer? \u003C/p\u003E\u003Cp\u003EI also appreciate how your parts look/work together, and a 2 part Big gemini style pod would certainly be useful. \u003C/p\u003E\u003Cp\u003EAs far as the various adapter thing, that sounds pretty rad. \u003C/p\u003E\u003Cp\u003EWe definitely do need something though that can carry more than 6-7 kerbals (other than spaceplanes), wether it\u0027s a singular pod or a 2 part Big Gemini style pod.\u003C/p\u003E\n"},{"CreatedByName":"NecroBones","CreatedById":105424,"CreatedDateTime":"2015-06-04T18:24:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tater\u0022 data-cite=\u0022tater\u0022\u003E\u003Cdiv\u003EFor 3.75m, there have been a few \u0022Duna Direct\u0022 mods started that have what I tend to think of when I think of needed lander parts at large size that don\u0027t exist.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHuh, so a sort of combination tank \u002B storage bay? Finding some reasonable sizes/proportions might be a little tricky, but I could see how a few different configurations could be useful.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MarcAlain\u0022 data-cite=\u0022MarcAlain\u0022\u003E\u003Cdiv\u003EI don\u0027t think overlapping with Taurus or NF is a problem. \u003Cp\u003EWhat if those mods aren\u0027t available any longer? \u003C/p\u003E\u003Cp\u003EI also appreciate how your parts look/work together, and a 2 part Big gemini style pod would certainly be useful. \u003C/p\u003E\u003Cp\u003EAs far as the various adapter thing, that sounds pretty rad. \u003C/p\u003E\u003Cp\u003EWe definitely do need something though that can carry more than 6-7 kerbals (other than spaceplanes), wether it\u0027s a singular pod or a 2 part Big Gemini style pod.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, I can see how some larger capacity parts might be nice. \u003C/p\u003E\u003Cp\u003EThose are some good points, I might have to think some more about overlap. Sometimes a stylistic difference is enough for another part to be worthwhile.\u003C/p\u003E\n"},{"CreatedByName":"Spacepetscompany","CreatedById":119734,"CreatedDateTime":"2015-06-05T03:41:42Z","Content":"\n\u003Cp\u003EWhat we really need, are some rover specific parts.\u003C/p\u003E\n"},{"CreatedByName":"Moon Goddess","CreatedById":57446,"CreatedDateTime":"2015-06-05T15:33:44Z","Content":"\n\u003Cp\u003EI\u0027d love some sort of part or parts to make 2 stage landers (apollo style) easier to build, like some sort of frame I guess.\u003C/p\u003E\u003Cp\u003EEverything I try to build becomes this super tall stack which isn\u0027t right or this ugly ungangly thing with fuel tanks strapped to the outside totallly unnaturally.\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2015-06-05T16:39:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Spacepetscompany\u0022 data-cite=\u0022Spacepetscompany\u0022\u003E\u003Cdiv\u003EWhat we really need, are some rover specific parts.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, hence my sketch above. I\u0027d like to have rovers not require \u0022krazy kontraptions\u0022 as they do now.\u003C/p\u003E\n"},{"CreatedByName":"NecroBones","CreatedById":105424,"CreatedDateTime":"2015-06-05T16:53:34Z","Content":"\n\u003Cp\u003EYeah, I\u0027ll have to think about that. Some sort of lander frame system would be cool, but the trick is to find configurations that are helpful, rather than awkward. Basically, what sort of sizes and shapes would make the most sense.\u003C/p\u003E\n"},{"CreatedByName":"Nertea","CreatedById":83952,"CreatedDateTime":"2015-06-05T17:05:24Z","Content":"\n\u003Cp\u003EOverlap is fine IMO, I like your stuff and it\u0027s great to have more command pod options. Unlike more fuel tanks, they\u0027re rather unique and I tend to build the ship around them.\u003C/p\u003E\n"},{"CreatedByName":"NecroBones","CreatedById":105424,"CreatedDateTime":"2015-06-05T21:14:02Z","Content":"\n\u003Cp\u003EI started work on some simple fixed ladders. I have 1m and 2m lengths working, though I\u0027m trying to decide if I should make them protrude more, since they\u0027re a bit flatter than the stock ladder-rungs. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://ksp.necrobones.com/screenshots/2015-06/KSP%202015-06-05%2017-03-27-44.jpg\u0022 alt=\u0022KSP%202015-06-05%2017-03-27-44.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Randazzo","CreatedById":136468,"CreatedDateTime":"2015-06-05T21:25:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tater\u0022 data-cite=\u0022tater\u0022\u003E\u003Cdiv\u003ESome sort of intentional rover delivery system would be kinda neat. It seems like a rover could fit horizontally within a 3.75m part, the trick is getting it out and having room for engines/fuel.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis! USI Exploration pack has a delivery cage for it\u0027s rover but an actual integrated lander part would be spiffy. It\u0027d be neat not to have to either duct-tape the rover to the bottom of the lander or send it down on a sky-crane contraption. \u003C/p\u003E\u003Cp\u003EThat\u0027s undoubtedly a LOT easier said than done, like most things.\u003C/p\u003E\n"},{"CreatedByName":"NecroBones","CreatedById":105424,"CreatedDateTime":"2015-06-05T21:41:41Z","Content":"\n\u003Cp\u003EActually, I went ahead and extended them a little. I think it\u0027ll work better in the long run, since there\u0027s a lot of variation between mod parts and the like, in terms of how deep the colliders are inside the mesh, which is partly why the stock ladders look like that. They\u0027re still shorter than the stock ladder\u0027s protrusion, but it\u0027s closer now:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://ksp.necrobones.com/screenshots/2015-06/KSP%202015-06-05%2017-35-03-83.jpg\u0022 alt=\u0022KSP%202015-06-05%2017-35-03-83.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Randazzo\u0022 data-cite=\u0022Randazzo\u0022\u003E\u003Cdiv\u003EThis! USI Exploration pack has a delivery cage for it\u0027s rover but an actual integrated lander part would be spiffy. It\u0027d be neat not to have to either duct-tape the rover to the bottom of the lander or send it down on a sky-crane contraption. \u003Cp\u003EThat\u0027s undoubtedly a LOT easier said than done, like most things.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, it\u0027s going to take some thought. A large \u0022box\u0022 with a stack node inside (for undocking the rover) might be doable, in the sense that it would just be a variation on a cargo/service bay, just sized appropriately for rovers. Perhaps something that opens at the front, and also has an attachment node along the back wall? I\u0027m open to ideas. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Randazzo","CreatedById":136468,"CreatedDateTime":"2015-06-06T03:04:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NecroBones\u0022 data-cite=\u0022NecroBones\u0022\u003E\u003Cdiv\u003EYes, it\u0027s going to take some thought. A large \u0022box\u0022 with a stack node inside (for undocking the rover) might be doable, in the sense that it would just be a variation on a cargo/service bay, just sized appropriately for rovers. Perhaps something that opens at the front, and also has an attachment node along the back wall? I\u0027m open to ideas. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s a great idea. Sort of like a rover garage. Maybe even a deployable ramp? I\u0027m full of suggestions for things I don\u0027t know how to do. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe connection of the rover is always problematic, short of magic forcefield nodes connected to nothing for it to click on to, it would need a support pylon or something, which would then get in the way when trying to drive out. Could maybe stick it on the roof instead and attach it that way.\u003C/p\u003E\n"},{"CreatedByName":"NecroBones","CreatedById":105424,"CreatedDateTime":"2015-06-06T03:09:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Randazzo\u0022 data-cite=\u0022Randazzo\u0022\u003E\u003Cdiv\u003EThat\u0027s a great idea. Sort of like a rover garage. Maybe even a deployable ramp? I\u0027m full of suggestions for things I don\u0027t know how to do. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003Cp\u003EThe connection of the rover is always problematic, short of magic forcefield nodes connected to nothing for it to click on to, it would need a support pylon or something, which would then get in the way when trying to drive out. Could maybe stick it on the roof instead and attach it that way.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA ramp is possible, but like any animated part, the ramp either needs to be non-colliding (which would be ridiculous), or it would push the whole lander up if it extends lower than the legs are permitting, or if the legs are long enough, it wouldn\u0027t reach the ground. \u003C/p\u003E\u003Cp\u003EI was thinking maybe an attachment node in the ceiling, and another along the back wall, and probably one on the floor as well. That way it\u0027s like a service bay, but with that rear-wall node, so you\u0027d have lots of choices about where to stick the rover. But it would still need a docking port or decoupler or something, unless the bay acted like a decoupler itself, but that\u0027s probably making too much of an assumption about how people will use it.\u003C/p\u003E\n"},{"CreatedByName":"Spacepetscompany","CreatedById":119734,"CreatedDateTime":"2015-06-08T03:23:00Z","Content":"\n\u003Cp\u003EI\u0027d like to propose a renaming, as previously suggested somewhere deep in one of NecroBones threads: Boing Aerospace. Seems slightly more interresting than \u0022Kerbal Expolration Technologies\u0022 to me anyways.\u003C/p\u003E\n"},{"CreatedByName":"Tyren","CreatedById":76757,"CreatedDateTime":"2015-06-08T07:23:30Z","Content":"\n\u003Cp\u003EWhy not have the rover bay deploy its ramp horizontally, just le it sit down on the surface...or you give it its own landing struts, with the given length you can determine what angle the ramp needs. Bottom node \u002B gear assembly, so to say.\u003C/p\u003E\n"},{"CreatedByName":"NecroBones","CreatedById":105424,"CreatedDateTime":"2015-06-08T13:19:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Spacepetscompany\u0022 data-cite=\u0022Spacepetscompany\u0022\u003E\u003Cdiv\u003EI\u0027d like to propose a renaming, as previously suggested somewhere deep in one of NecroBones threads: Boing Aerospace. Seems slightly more interresting than \u0022Kerbal Expolration Technologies\u0022 to me anyways.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHeh, yeah I haven\u0027t forgotten about that one. I was thinking that would be better saved for an aircraft/spaceplane pack though. I\u0027m still open to more ideas of course. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tyren\u0022 data-cite=\u0022Tyren\u0022\u003E\u003Cdiv\u003EWhy not have the rover bay deploy its ramp horizontally, just le it sit down on the surface...or you give it its own landing struts, with the given length you can determine what angle the ramp needs. Bottom node \u002B gear assembly, so to say.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, I don\u0027t think that\u0027ll work since the landing-leg system is designed to work on compression suspension (pistons) that deploy to a specific angle, rather than something that can rotate from a hinge instead. \u003C/p\u003E\u003Cp\u003EWhat might be the most flexible is to not have a ramp at all, just have retracting doors, and let the player figure out whether the lander needs to sit down on the ground directly, or if they can use a little RCS to get the rover in and out. \u003C/p\u003E\u003Cp\u003ESomething else I keep forgetting to mention, is I think it might be useful to have a 0.625m launch-escape, for use with the Mk.1 capsule (and other similarly sized capsules), especially if I make another capsule in that size class. We\u0027ll see. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}