{"TopicId":111963,"ForumId":16,"TopicTitle":"Spaceplane engine switch between ON and OFF ?","CreatedByName":"Pitbull81","CreatedById":69341,"CreatedDateTime":"2015-06-04T15:37:56Z","PageNum":1,"Articles":[{"CreatedByName":"Pitbull81","CreatedById":69341,"CreatedDateTime":"2015-06-04T15:37:56Z","Content":"Hi everyone.\n\nIm trying to get famillar with spaceplane and Plane.\n\nBut i have a problem. Maybe someone can told me why soon as my spaceplane reach a certain angle, my engine stop then start again ![:confused:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif)?\n\nim sure there is a simple answer and explanation, but cant find it at all.\n\nand after 3 day of crash i start to be kinda ennoyed :mad:hahaha\n\nThx for your answer ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nKArl:cool:"},{"CreatedByName":"A35K","CreatedById":145429,"CreatedDateTime":"2015-06-04T17:56:19Z","Content":"It might be because your intakes are not facing the direction of movement anymore, causing a flameout due to lack of air."},{"CreatedByName":"Gaarst","CreatedById":126740,"CreatedDateTime":"2015-06-04T17:56:28Z","Content":"First, welcome to the forums ![:wink:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)\n\nA few more details about your problem would be helpful. What angle do you mean: angle relative to horizon or prograde ? Are you sure you don\u0027t mean altitude ? Does this happen while in atmosphere or vacuum ? What type of engine are you using ?\n\nIf you are very specific about your problem, it will be easier to solve it. Screenshots also help a lot.\n\nBut anyway, if you\u0027re using a jet engine (in air-breathing more if RAPIER) it could be because of intakes not receiving enough air due to the angle of attack of your plane (air flow is then not directly aimed at the intake and it is less efficient). Jet engines stop if they do not receive enough air; and if you have several jet engines, they may not get all the same amount of air, resulting in some engines switching on and off, and not others.\n\nIf you\u0027re too high, atmosphere gets thinner and engines receive less air, it may be linked to your issue.\n\nHope this helps a little, but please add screenshots, they are really helpful ![:rolleyes:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif)"},{"CreatedByName":"Pitbull81","CreatedById":69341,"CreatedDateTime":"2015-06-04T18:56:03Z","Content":"Ok i will take some screenshot tonight.\n\nI do not use jet engine but these engine : [http://forum.kerbalspaceprogram.com/threads/55985](https://forum.kerbalspaceprogram.com/threads/55985)\n\nIm aware about the lack of air at high altitude. but i will take few screenshot in few minute and post them here."}]}