{"TopicId":111983,"ForumId":21,"TopicTitle":"KSP Research \u0026amp; Development Department","CreatedByName":"R\u0026amp;DD","CreatedById":145662,"CreatedDateTime":"2015-06-04T19:11:38Z","PageNum":1,"Articles":[{"CreatedByName":"R\u0026amp;DD","CreatedById":145662,"CreatedDateTime":"2015-06-04T19:11:38Z","Content":"\n\u003Cp\u003EI am building a website that will be similar to the Spacecraft Exchange, however have added features such as stats (TWR, top speed, mass, etc.), ratings/comments about in-game performance, design features, tech levels, classification (boat, rover, rocket, atmospheric plane, etc.) and more. The biggest thing I need right now are spacecrafts and I was hoping you guys/gals could send me some of your best designs. Just send the .cfg to \u003Ca href=\u0022/cdn-cgi/l/email-protection#dbb0a8aba9bfbf9bbcb6bab2b7f5b8b4b6\u0022\u003E\u003Cspan class=\u0022__cf_email__\u0022 data-cfemail=\u00225a31292a283e3e1a3d373b333674393537\u0022\u003E[email\u0026#160;protected]\u003C/span\u003E\u003C/a\u003E with any comments on what it is/does, mods needed to make it work, and what version of KSP (I have 0.23, 0.23.5, 0.24, 0.25, 0.90, and 1.0(.2)) Thank you! The first version of site should launch sometime around July 23.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-04T20:44:37Z\u0022 title=\u002206/04/2015 08:44  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 4, 2015\u003C/time\u003E by R\u0026amp;DD\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Rath","CreatedById":138223,"CreatedDateTime":"2015-06-04T23:10:03Z","Content":"\n\u003Cp\u003EI belive that you are bad icky describing KerbalX.\u003C/p\u003E\n"},{"CreatedByName":"R\u0026amp;DD","CreatedById":145662,"CreatedDateTime":"2015-06-05T14:22:22Z","Content":"\n\u003Cp\u003EI don\u0027t know what bad icky is, hmm... similar to KerbalX however there they don\u0027t seem to post helpful comment such as \u0022...can easily over-maneuver with...\u0022 etc. Or tech level i.e. this rocket can be built with the General Rocketry and Survivability nodes, etc. for career mode folks.\u003C/p\u003E\n"},{"CreatedByName":"Hobbes Novakoff","CreatedById":129018,"CreatedDateTime":"2015-06-06T01:07:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022R\u0026amp;DD\u0022 data-cite=\u0022R\u0026amp;DD\u0022\u003E\u003Cdiv\u003Ehowever there they don\u0027t seem to post helpful comment such as \u0022...can easily over-maneuver with...\u0022 etc. Or tech level i.e. this rocket can be built with the General Rocketry and Survivability nodes, etc. for career mode folks.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, but that\u0027s the poster\u0027s fault, and it\u0027s hard if not impossible to ascertain the atmospheric flight characteristics just from a craft file, because you\u0027d have to develop a new aero simulation accounting for stock physics, which would most likely require a peek into KSP\u0027s source code. With FAR, ferram4 knows \u003Cem\u003Eexactly\u003C/em\u003E how the physics work-He coded them himself (Mostly). With stock, we can only do testing-there\u0027s no real way to guess exactly how something will fly without taking it into KSP and flying it. Tech level is an interesting idea however, and should be easily readable from the craft file.\u003C/p\u003E\n"}]}