{"TopicId":112027,"ForumId":34,"TopicTitle":"[1.12.x] Heat Control - More radiators! (August 22, 2021)","CreatedByName":"Nertea","CreatedById":83952,"CreatedDateTime":"2015-06-05T04:37:37Z","PageNum":10,"Articles":[{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2015-06-24T20:10:56Z","Content":"Fraz you make a solid point, but I think a) there\u0027s no reasonable way to balance stock radiators and Nertea\u0027s radiators against each other. Also ![B)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png) Nertea\u0027s radiators have several things in their functionality that cannot be achieved with stock radiators and its part of what defines them. To take that away by using the stock module would be a crappy thing to do. and remove all the real advantages Nertea\u0027s radiators currently possess.\n\nTHe way I see it we have two options.\n\n**Option 1:**\n\nF the stock radiators. Fold all the Heat Control components back into NFE and make it one single download. The plugins can be separate for Nertea\u0027s convenience. This has the advantage of ignoring the problem, but has a whole laundry list of downsides, not including the fact that I imagine Nertea wouldn\u0027t be too thrilled about it.\n\n**Option 2:**\n\nMove the conformal radiators over to Heat Control (some model tweaks may be necessary to make them conform to the stack size, not the reactor specifically) and make sure NFE reactors are compatible with stock.\n\nDo not confuse compatibility with balance though, as I see no way to balance Heat Control against stock radiators well (it can be done, but it\u0027d end up being messy as hell). A disclaimer would need to be added to the effect of \u0022These reactors are recommended for use with Heat Control. While they will function with stock radiators, balance will not be great.\u0022\n\nThe reason I say I see no way to balance is that all of Nertea\u0027s radiators are (or at least should be in my understanding) balanced to the same heat rejection/mass ratio. This is so that the radiator mass is the same for a given quantity of heat rejection regardless of the type used. Additionally, this is balanced in tandem with NFE reactors so that every reactor hits a certain Ec/s/mass ratio when loaded with the necessary radiator mass.\n\nStock radiators do not respect the heat rejection/mass ratio, in addition to the largest one being 10x lighter per heat rejection. Heat Control will still need to address this in one of three ways to ensure when it is present, there is still a reason to use it.\n\n**Method A:**\n\nIgnore stock radiators.\n\nIgnoring them makes no balance changes necessary, and gives the player the arbitrary choice to use a highly abstract, less efficient, yet far lighter system, or a heavier, more efficient, high precision (and much better looking) system.\n\n**Method B:**\n\nRebalance stock radiators to respect the heat rejection/mass balancing with slightly better performance by mass than Nertea\u0027s radiators. This is to offset their disadvantages of no refrigeration capability, no undeployed function, poorer heat rejection/area performance comparatively, and (arguable advantage for some) lack of precision. This makes the arbitrary choice of Method A a much more balanced decision from a gameplay perspective.\n\n**Method C:**\n\nHide the stock radiators and force players to use the more precise system. It should be noted, though, that by effectively overriding the stock heat rejection parts, we take this pack very close to becoming a fork. While I do not personally believe this is a bad thing, it should be considered in all its pros and cons."},{"CreatedByName":"Jarin","CreatedById":71395,"CreatedDateTime":"2015-06-24T20:14:58Z","Content":"Would Method C there end up pushing it more towards being a fully optional \u0022heat management\u0022 mechanic mod? Like how RemoteTech is for antennas; creating interesting new restrictions that are solved by the mod?"},{"CreatedByName":"Psycho_zs","CreatedById":137644,"CreatedDateTime":"2015-06-24T20:19:31Z","Content":"In case of going with stock model. You could augment it in some interesting ways.\n\nConsider this: Create a part \u0022Heat pump\u0022. Such part would (globally) pump more heat into radiators, increasing their efficiency. Citing Wikipedia:\n\n\u003E \n\u003E Heat pumps are designed to move thermal energy opposite to the direction of spontaneous heat flow by absorbing heat from a cold space and releasing it to a warmer one.\n\nAdd some wittiness to this description and voilÃƒÂ !\n\nHeat pumps could be of different sizes and power. They would draw electricity, may be even have throttle.\n\nBasically this would give stock radiators a controllable feature of HC radiators.\n\nIt also have some conceptual similarity with stock precoolers."},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2015-06-24T20:31:05Z","Content":"\u003E \n\u003E In case of going with stock model. You could augment it in some interesting ways.\n\u003E Consider this: Create a part \u0022Heat pump\u0022. Such part would (globally) pump more heat into radiators, increasing their efficiency. Citing Wikipedia:\n\u003E \n\u003E Add some wittiness to this description and voilÃƒÂ !\n\u003E \n\u003E Heat pumps could be of different sizes and power. They would draw electricity, may be even have throttle.\n\u003E \n\u003E Basically this would give stock radiators a controllable feature of HC radiators.\n\u003E \n\u003E It also have some conceptual similarity with stock precoolers.\n\nNot without a good bit of code time we can\u0027t.\n\nA similar effect can be achieved with Nertea\u0027s radiators and the heat pipes (pipe the heat from another source to whatever the radiator is attached to). You\u0027d also have to be careful with that, as both HC and stock (HC moreso) radiators operate near critical temp. Pump in too much heat too fast and BANG!\n\n\u003E \n\u003E Would Method C there end up pushing it more towards being a fully optional \u0022heat management\u0022 mechanic mod? Like how RemoteTech is for antennas; creating interesting new restrictions that are solved by the mod?\n\nMore or less. You have the right idea. It pushes this from a supplemental mod to an override mod. Mikegarrison above me talks some about the possible dangers of a fork. The main advantage of it is you can write your own rulebook, stock balance be damned."},{"CreatedByName":"JeffreyCor","CreatedById":93167,"CreatedDateTime":"2015-06-24T21:12:42Z","Content":"I am opposed to anything that essentially removes the stock radiators. Some actually like the stock radiators. Even RemoteTech which completely overrides the communication and data system does not remove the stock antennas. Likewise, any changes here should not remove the stock parts. This effectively removes Option 1 and Option 2 Method C. \n\nIgnoring the stock radiators would seem to lead to confusion, making Option 2 Method A disfavored. \n\nThis leave Option 2 Method B. Not only by process of elimination, but bringing the stock parts into alignment with the intent and improvement provided by the mod gives the greatest gameplay options. This I think is the most favorable as it does not restrict options which are already in the game and gives the greatest effectiveness in operation with the mod\u0027s improved function over stock.\n\nOn a side note, if somehow the heat radiation played well with KSPI so two types of radiators wouldn\u0027t be needed would be awesome. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"Fraz86","CreatedById":90101,"CreatedDateTime":"2015-06-24T21:20:18Z","Content":"\u003E \n\u003E Fraz you make a solid point, but I think a) there\u0027s no reasonable way to balance stock radiators and Nertea\u0027s radiators against each other.\n\nI don\u0027t think that\u0027s true. As I described in my previous post, we could create a trade-off between the higher \u0022heat rejection : mass \u0026 cost\u0022 ratio of stock radiators (with a disadvantage of large surface area), versus higher \u0022heat rejection : surface area\u0022 ratio for Nertea\u0027s radiators (but with higher mass and cost). This could be accomplished using the stock radiator module, by ratcheting up the emissivity of Nertea\u0027s radiators, which basically just compensates for the need to operate the radiators at lower (less emissive) temperatures.\n\n\u003E \n\u003E Also ![B)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png) Nertea\u0027s radiators have several things in their functionality that cannot be achieved with stock radiators and its part of what defines them. To take that away by using the stock module would be a crappy thing to do. and remove all the real advantages Nertea\u0027s radiators currently possess.\n\nLocalized vs vessel-global heat management is the real debate here. Everything else can likely be balanced out. I\u0027m not thrilled with Squad\u0027s decision to use vessel-global behavior for heat dissipation, though there is certainly precedent for it with ElectricCharge and Monoprop. It isn\u0027t crazy to assume that heat pipes are integrated into the ship \u0022behind the scenes\u0022 to move heat from heat-producing parts to radiators. Yes, I agree that it is a bit of a loss from a gameplay perspective, and I too am disappointed. But I believe the cons of boldly striking out in defiance of stock behavior clearly outweigh the pros.\n\n\u003E \n\u003E Mikegarrison above me talks some about the possible dangers of a fork. The main advantage of it is you can write your own rulebook, stock balance be damned.\n\nWriting your own rulebook and \u0022stock balance be damned\u0022 is totally inconsistent with the paradigm that Near Future has always followed. Nothing personal, but I think you have some fundamental misunderstandings regarding the priorities and design values of the Near Future mods, as shown in [your prior post](https://forum.kerbalspaceprogram.com/threads/124391-1-02-Heat-Control-Manage-your-ship-s-heat%21-%2815-06-2015-new-radiators-and-heat-exchangers%29?p=2036436\u0026viewfull=1#post2036436) (with excellent rebuttal from Streetwind). Converting to the stock radiator system is a moderate headache and a bit of a letdown, but it isn\u0027t worth transforming Near Future into a \u0022fork\u0022 to avoid it."},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2015-06-24T21:29:46Z","Content":"\u003E \n\u003E Localized vs vessel-global heat management is the real debate here. Everything else can likely be balanced out.\n\nNot true. Key example: Nertea\u0027s radiators actually do active refrigeration, allowing the radiator to be much hotter than the part its cooling. This is another deficiency of the stock radiator module not shared with Heat Control, and also a key component in how reactors operate (part of the reason I stated that I expect NFE reactors to work with stock radiators, but not well, multiple times).\n\nAlso bear in mind that a global system like stock removes the need for the heat pipe and exchangers, which effectively reduces this to a pack of radiators. That degree of complexity loss is unacceptable. To do that allows the stock module to invalidate this pack as we fear it has rather than giving this pack a reason to continue existing.\n\nI understand Nertea\u0027s position wanting to stay close to stock, but I continue to affirm that may not be the best course of action in this instance."},{"CreatedByName":"mikegarrison","CreatedById":137807,"CreatedDateTime":"2015-06-24T21:33:27Z","Content":"\u003E \n\u003E I am opposed to anything that essentially removes the stock radiators. Some actually like the stock radiators.\n\nSo they shouldn\u0027t install Heat Control. If you like the stock aerodynamics, you shouldn\u0027t install FAR. Seems pretty simple to me.\n\nAt some point people have to decide whether they want a Heat Control type of game mechanic or they don\u0027t. My problem with the way Squad seems to handle this stuff is that they try to add in complications like heat, and then they get worried about people who don\u0027t want to deal with it so they defang it to the point where they shouldn\u0027t have bothered with introducing it at all.\n\nFrankly, the reaction wheels fall into this category. Why do they have this whole RCS infrastructure in the game and then they make reaction wheels so powerful that you don\u0027t need the RCS? Heat management is the same thing, really. They introduce this heat mechanism into the game, and then they make it trivial to ignore it.\n\nI think if people like the stock radiators then that\u0027s just fine. They should use the stock radiators and not install Heat Control. Easy peasy.\n\nThat being said, I\u0027m not Nertea. It\u0027s clear that for solar, for instance, he was willing to introduce a whole bunch of parts that basically did the same thing the stock parts did (but in different form factors). If that\u0027s his vision for radiators, then I guess that\u0027s the way he\u0027ll go. I hope it\u0027s not, but then again I\u0027m not the guy doing the work to build and maintain the mods.\n\n**Edited \u003Ctime datetime=\u00222015-06-24T21:41:13Z\u0022 title=\u002206/24/2015 09:41  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 24, 2015\u003C/time\u003E by mikegarrison**"},{"CreatedByName":"Fraz86","CreatedById":90101,"CreatedDateTime":"2015-06-24T23:02:16Z","Content":"\u003E \n\u003E Not true. Key example: Nertea\u0027s radiators actually do active refrigeration, allowing the radiator to be much hotter than the part its cooling. This is another deficiency of the stock radiator module not shared with Heat Control,\n\nI\u0027m well aware of the differences in radiator behavior, however, as mentioned in my previous two posts, cranking up the emissivity of Nertea\u0027s radiators would effectively compensate for the lower operating temperature necessitated by a lack of active refrigeration.\n\n\u003E \n\u003E and also a key component in how reactors operate (part of the reason I stated that I expect NFE reactors to work with stock radiators, but not well, multiple times).\n\nAs mentioned by RoverDude, the cooling threshold (i.e., the temperature at which radiators will begin sucking heat from a given part) can be set in the part config. Setting the cooling threshold of NFE reactors slightly below their nominal temperatures should work well, assuming the ship has sufficient radiators.\n\n\u003E \n\u003E Also bear in mind that a global system like stock removes the need for the heat pipe and exchangers, which effectively reduces this to a pack of radiators. That degree of complexity loss is unacceptable. To do that allows the stock module to invalidate this pack as we fear it has rather than giving this pack a reason to continue existing.\n\nThis is basically true. Insulators might continue to have some purpose, but heat pipes and exchangers would likely become obsolete. This is obviously unfortunate, given that Nertea already invested time and energy into these parts, however, we ought to avoid the [sunk cost fallacy/escalation of commitment](https://en.wikipedia.org/wiki/Escalation_of_commitment). It is often better to cut one\u0027s losses and start anew, despite the natural human bias toward clinging to what one already has. \u0022We need to give this pack a reason to continue existing\u0022 is not a rational basis for design decisions.\n\n---------------------------------------------------------------\n\nIf Nertea is motivated to transform HeatControl into a full-blown \u0022fork\u0022 (akin to FAR or DRE), more power to him; he has my full support. However, if he does so, I would argue strongly that NFE needs to be fully functional and well balanced *without HeatControl*. Such a version of HeatControl should be intended explicitly for players who want to overhaul the heat management system, and NFE should in no way pressure players to adopt the overhauled system. Thus, I believe we need to figure out how best to balance reactors and their conformal radiators using the stock radiator module, regardless of whether or not Nertea decides to maintain his own radiator behavior as a separate overhaul.\n\n**Edited \u003Ctime datetime=\u00222015-06-24T23:04:58Z\u0022 title=\u002206/24/2015 11:04  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 24, 2015\u003C/time\u003E by Fraz86**"},{"CreatedByName":"mikegarrison","CreatedById":137807,"CreatedDateTime":"2015-06-24T23:12:43Z","Content":"\u003E \n\u003E I\u0027m well aware of the differences in radiator behavior, however, as mentioned in my previous two posts, cranking up the emissivity of Nertea\u0027s radiators would effectively compensate for the lower operating temperature necessitated by a lack of active refrigeration.\n\u003E As mentioned by RoverDude, the cooling threshold (i.e., the temperature at which radiators will begin sucking heat from a given part) can be set in the part config. Setting the cooling threshold of NFE reactors slightly below their nominal temperatures should work well, assuming the ship has sufficient radiators.\n\u003E \n\u003E This is basically true. Insulators might continue to have some purpose, but heat pipes and exchangers would likely become obsolete. This is obviously unfortunate, given that Nertea already invested time and energy into these parts, however, we ought to avoid the [sunk cost fallacy/escalation of commitment](https://en.wikipedia.org/wiki/Escalation_of_commitment). It is often better to cut one\u0027s losses and start anew, despite the natural human bias toward clinging to what one already has. \u0022We need to give this pack a reason to continue existing\u0022 is not a rational basis for design decisions.\n\u003E \n\u003E ---------------------------------------------------------------\n\u003E \n\u003E If Nertea is motivated to transform HeatControl into a full-blown \u0022fork\u0022 (akin to FAR or DRE), more power to him; he has my full support. However, if he does so, I would argue strongly that NFE needs to be fully functional and well balanced *without HeatControl*. Such a version of HeatControl should be intended explicitly for players who want to overhaul the heat management system, and NFE should in no way pressure players to adopt the overhauled system. Thus, I believe we need to figure out how best to balance reactors and their conformal radiators using the stock radiator module, regardless of whether or not Nertea decides to maintain his own radiator behavior as a separate overhaul.\n\nIt\u0027s up to Nertea where he wants to draw the boundaries of his fork. It seems to me that if makes more sense to put NFE inside the fork rather than outside of it. That\u0027s essentially where it was in 1.02, when the Heat Control dll was bundled with NFE.\n\nHe may not need a fork, but he also may not need to make sure the reactors are \u0022well balanced\u0022 without Heat Control. He could just put the reactors out there and let people who don\u0027t take Heat Control try to figure out how to cool them. He already does that with NFP, where he puts these electric engines out there and warns people that they will have trouble running them (understatement!) unless they use the reactors or massive solar panels from NFE or NFS."},{"CreatedByName":"JeffreyCor","CreatedById":93167,"CreatedDateTime":"2015-06-25T00:39:19Z","Content":"\u003E \n\u003E So they shouldn\u0027t install Heat Control. If you like the stock aerodynamics, you shouldn\u0027t install FAR. Seems pretty simple to me.\n\nSo you\u0027re entire logic is \u0022Take it or leave it\u0022 really great community support to start with and liking the PARTS has nothing what so ever to do with liking the FUNCTION! The entire point, which you chose to ignore, it not to hide the PARTS!! \n\nThank goodness you are not Nertea."},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2015-06-25T00:48:33Z","Content":"\u003E \n\u003E So you\u0027re entire logic is \u0022Take it or leave it\u0022 really great community support to start with and liking the PARTS has nothing what so ever to do with liking the FUNCTION! The entire point, which you chose to ignore, it not to hide the PARTS!! \n\u003E Thank goodness you are not Nertea.\n\nThere\u0027s stock radiators. Part of what makes these *parts* unique is the *function* they have. If you don\u0027t need that function, you don\u0027t need these parts. I don\u0027t see a problem here, because function has *everything* to do with it."},{"CreatedByName":"JeffreyCor","CreatedById":93167,"CreatedDateTime":"2015-06-25T00:58:16Z","Content":"The part is the item. If the part itself was specifically tied in to the function there would never even have been an option bough up to bring the stock radiators to balance. Additionally a MM config can change the function of pretty much every part, for example the stock antenna\u0027s don\u0027t do the stock communication function when RemoteTech is installed. Some have even made solar panels into air brakes before, also completely separate from their function. A part and it\u0027s function are NOT directly tied. What makes these parts unique is the MODEL, ie the way they look, open and close, etc. Not what they DO. Once again, there is no reason to remove/hide the stock radiators rather than have them work with HC. The entire argument is removing radiators to add radiators, which really seems ridiculous. Use what is there and add more if more powerful units / diversity is desired. This is like saying \u0022This mod adds solar panels, so it will hide stock solar panels.\u0022 It makes no sense."},{"CreatedByName":"mikegarrison","CreatedById":137807,"CreatedDateTime":"2015-06-25T01:14:35Z","Content":"\u003E \n\u003E This is like saying \u0022This mod adds solar panels, so it will hide stock solar panels.\u0022 It makes no sense.\n\nIt would make sense if the mod solar panels were incompatible with the stock solar panels.\n\nIf I understand you, basically you just think Nertea\u0027s radiators look cool, so you don\u0027t care how (or if) they actually work.\n\nOh well, each to his own, I guess."},{"CreatedByName":"JeffreyCor","CreatedById":93167,"CreatedDateTime":"2015-06-25T02:57:18Z","Content":"Other way around, I like the way the stock radiators look, but I like the function of what Nertea has created. Hence my very strong preference for the posted option to MM the stock radiators for use with HC. If this was impossible as you indicate, why was it ever even listed as an option?!?!\n\nFrom Nertea\u0027s post directly \u0022B1) Instead of hiding, rework stock radiators to work with HC/NFE modules\u0022\n\nAnd, from Captain Sierra \u0022Method B:\n\nRebalance stock radiators to respect the heat rejection/mass balancing with slightly better performance by mass than Nertea\u0027s radiators. This is to offset their disadvantages of no refrigeration capability, no undeployed function, poorer heat rejection/area performance comparatively, and (arguable advantage for some) lack of precision. This makes the arbitrary choice of Method A a much more balanced decision from a gameplay perspective.\u0022\n\nWhy exactly is it impossible and a worthless idea to be in favor of one of the very options what have been put out?! Once again, this makes NO SENSE!\n\n**Edited \u003Ctime datetime=\u00222015-06-25T02:59:46Z\u0022 title=\u002206/25/2015 02:59  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 25, 2015\u003C/time\u003E by JeffreyCor**"},{"CreatedByName":"mikegarrison","CreatedById":137807,"CreatedDateTime":"2015-06-25T03:21:50Z","Content":"\u003E \n\u003E Other way around, I like the way the stock radiators look, but I like the function of what Nertea has created. Hence my very strong preference for the posted option to MM the stock radiators for use with HC. If this was impossible as you indicate, why was it ever even listed as an option?!?!\n\u003E From Nertea\u0027s post directly \u0022B1) Instead of hiding, rework stock radiators to work with HC/NFE modules\u0022\n\u003E \n\u003E And, from Captain Sierra \u0022Method B:\n\u003E \n\u003E Rebalance stock radiators to respect the heat rejection/mass balancing with slightly better performance by mass than Nertea\u0027s radiators. This is to offset their disadvantages of no refrigeration capability, no undeployed function, poorer heat rejection/area performance comparatively, and (arguable advantage for some) lack of precision. This makes the arbitrary choice of Method A a much more balanced decision from a gameplay perspective.\u0022\n\u003E \n\u003E Why exactly is it impossible and a worthless idea to be in favor of one of the very options what have been put out?! Once again, this makes NO SENSE!\n\nWhere did I ever say it was impossible?"},{"CreatedByName":"JeffreyCor","CreatedById":93167,"CreatedDateTime":"2015-06-25T03:24:04Z","Content":"\u0022So they shouldn\u0027t install Heat Control. If you like the stock aerodynamics, you shouldn\u0027t install FAR. Seems pretty simple to me.\u0022\n\nMaybe you should have actually read what was posted before putting your comments.\n\nThis really isn\u0027t worth my time as it\u0027s obvious actual feedback on the represented options wasn\u0027t desired."},{"CreatedByName":"mikegarrison","CreatedById":137807,"CreatedDateTime":"2015-06-25T03:25:49Z","Content":"\u003E \n\u003E \u0022So they shouldn\u0027t install Heat Control. If you like the stock aerodynamics, you shouldn\u0027t install FAR. Seems pretty simple to me.\u0022\n\u003E Maybe you should have actually read what was posted before putting your comments.\n\u003E \n\u003E This really isn\u0027t worth my time as it\u0027s obvious actual feedback on the represented options wasn\u0027t desired.\n\nDo you see the word \u0022impossible\u0022 in there anywhere?"},{"CreatedByName":"Craeshen","CreatedById":128395,"CreatedDateTime":"2015-06-25T04:01:01Z","Content":"I\u0027m for B1 myself rework the stock radiator\u0027s via mm patch as maybe a lower tech cheaper version of the near future ones"},{"CreatedByName":"Fraz86","CreatedById":90101,"CreatedDateTime":"2015-06-25T04:06:35Z","Content":"\u003E \n\u003E It\u0027s up to Nertea where he wants to draw the boundaries of his fork. It seems to me that if makes more sense to put NFE inside the fork rather than outside of it.\n\nOf course it\u0027s up to Nertea, and I don\u0027t claim to speak for him, but as a player who has closely followed his projects since the very beginning, I have observed that Nertea has always been careful to *add to* the stock experience - in as seamless and balanced a manner as possible - rather than fundamentally alter it. Part of the beauty of Nertea\u0027s mods is that it\u0027s easy to imagine them as an extension of the stock game.\n\nSo, yes, if Nertea decides to say \u0022stock be damned\u0022 and make NFE unbalanced without a mod that completely overhauls radiator behavior, that\u0027s his prerogative, but I\u0027ll be quite surprised.\n\n\u003E \n\u003E That\u0027s essentially where it was in 1.02, when the Heat Control dll was bundled with NFE.\n\nBefore 1.03, there was no conflict between HeatControl and stock, because there were no stock radiators. Now that radiators exist in the stock game, it\u0027s a completely different situation.\n\n\u003E \n\u003E He already does that with NFP, where he puts these electric engines out there and warns people that they will have trouble running them (understatement!) unless they use the reactors or massive solar panels from NFE or NFS.\n\nYes, NFP requires NFE if you want the full experience, but NFE has never involved any sort of dramatic overhaul of stock features.\n\nThis chain of implicit dependencies actually makes the \u0022forking\u0022 situation worse. If Nertea draws the boundaries of his \u0022fork\u0022 to include NFE as you suggest, then it would implicitly contain NFP as well (since NFP basically requires NFE). Are you really suggesting that Nertea should effectively require anyone who wants NFP and/or NFE to also install a complete overhaul of heat management mechanics? To me, such a dependency appears clearly unjustified, and inconsistent with the history of Nertea\u0027s design decisions.\n\n**Edited \u003Ctime datetime=\u00222015-06-25T04:37:19Z\u0022 title=\u002206/25/2015 04:37  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 25, 2015\u003C/time\u003E by Fraz86**"},{"CreatedByName":"mikegarrison","CreatedById":137807,"CreatedDateTime":"2015-06-25T04:20:23Z","Content":"\u003E \n\u003E Of course it\u0027s up to Nertea, and I don\u0027t claim to speak for him, but as a player who has closely followed his projects since the very beginning, I have observed that Nertea has always been careful to *add to* the stock experience - in as seamless and balanced a manner as possible - rather than fundamentally alter it. Part of the beauty of Nertea\u0027s mods is that it\u0027s easy to imagine them as an extension of the stock game.\n\u003E So, yes, if Nertea decides to say \u0022stock be damned\u0022 and make NFE unbalanced without a mod that completely overhauls radiator behavior, that\u0027s his prerogative, but I\u0027ll be quite surprised if that is the outcome.\n\u003E \n\u003E Before 1.03, there was no conflict between HeatControl and stock, because there were no stock radiators. Now that radiators exist in the stock game, it\u0027s a completely different situation.\n\u003E \n\u003E Yes, NFP requires NFE if you want the full experience, but NFE has never involved any sort of dramatic overhaul of stock features.\n\u003E \n\u003E This chain of implicit dependencies actually makes the \u0022forking\u0022 situation worse. If Nertea draws the boundaries of his \u0022fork\u0022 to include NFE as you suggest, then it would implicitly contain NFP as well (since NFP basically requires NFE). Are you really suggesting that Nertea should effectively require anyone who wants NFP and/or NFE to also install a complete overhaul of heat management mechanics? To me, such a dependency appears clearly unjustified, and inconsistent with the history of Nertea\u0027s design decisions.\n\nWell, I\u0027m not him. I do understand he doesn\u0027t want to fork the mod. But it would be a shame if he gave up a very interesting and well-thought-out system just because Squad decided to go with something more simplistic. It would be a regression, in many ways. I\u0027m sure it\u0027s going to be a hard choice for him."},{"CreatedByName":"Nertea","CreatedById":83952,"CreatedDateTime":"2015-06-25T05:58:55Z","Content":"I really do prefer to operate as an complement to stock rather than a replacement. It\u0027s my basic design philosophy - everything I\u0027ve ever done for the game I\u0027ve tried to treat as if it were an extension to the game rather than something taken off in a different direction. There are many mods that operate in those spaces already, the most evident of them in reference to my own has always been KSPI. That is really not what I am here to do. I am not a plugin developer by desire, only by necessity. As shown by the existence of SSPX, MkIV and CryoRockets, not to mention the other parts of NFT, I really prefer making models. \n\nWe should really look at things historically - the last large revamp of NFE came about not because of the stock heat system, but because of a pre-0.90 desire to allow players to place radiators anywhere on their ship. To keep structural design constraints around reactors from going out the window, I decided to work on a heat modeling and simulation backend that everyone could use. Squad came along with 1.0 and a base heat system that I went for instead, because it makes things a lot simpler for me to use their work. It was also about 90% of what I wanted with mine. I\u0027m not afraid of throwing 100s of lines of code out the window if something more elegant comes along. So we worked with that to develop HeatControl and its supporting balance, resulting in a new gameplay element. However... what was the original goal here? Radiators wherever the player wants. Now, we have 1.03/4 with what? Radiators wherever the player wants. This is, really, what I wanted all along. We should not struggle and fight over maybe 4 hours of model work on a few things that won\u0027t be as useful, and really HC doesn\u0027t have much code in it. \n\nTherefore, the thing that I will be doing is finding a way to move NFE and the HC radiators into using the stock modules. You will still be able to get HC separately, but it will just be parts. This may require some rejiggering of a few parameters in NFE and I\u0027ll need to think about how to reconcile the balance. There is room in the future for this mod to evolve into something that \u0022restores\u0022 localized heat flow management in a fork type of way a la DRE or FAR or whatever, but really that\u0027s out of scope for me at the moment. I have better things to do.\n\nHope this works for all of ya ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)."},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2015-06-25T07:34:31Z","Content":"\u003E \n\u003E (...) Therefore, the thing that I will be doing is finding a way to move NFE and the HC radiators into using the stock modules. You will still be able to get HC separately, but it will just be parts. This may require some rejiggering of a few parameters in NFE and I\u0027ll need to think about how to reconcile the balance. There is room in the future for this mod to evolve into something that \u0022restores\u0022 localized heat flow management in a fork type of way a la DRE or FAR or whatever, but really that\u0027s out of scope for me at the moment. I have better things to do.\n\u003E Hope this works for all of ya ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif).\n\nYeah, that\u0027s more or less what I expected the response to be when I made my suggestion yesterday... but hey, asking never hurts, right?\n\nNeedless to say I\u0027m not thrilled by this development, or the way it came about. But I understand your reasoning, and since you\u0027re the one who puts by far the most work into Heat Control and NFE, I\u0027ll defer to your decision.\n\nIf you toss me a sensible skin setup for the NFE reactors, I can provide you with a rebalance suggestion using only stock radiators. You can then work from there to position your own radiators as viable alternatives.\n\n*P.S.: Guys, please don\u0027t use \u0022fork\u0022 like this.* ![:confused:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif) *That\u0027s not what the word stands for. A fork is a redistributed copy of an open source software project, not a modification to a not-redistributed piece of closed-source software. That would be called just that, a modification. Shorthand: \u0022mod\u0022. You can also use \u0022conversion\u0022 to underline the fact that it completely replaces a game mechanics system, or \u0022total conversion\u0022 if it goes as far as replacing the game experience in its entirety (like BTSM does), but never \u0022fork\u0022.*"},{"CreatedByName":"mikegarrison","CreatedById":137807,"CreatedDateTime":"2015-06-25T08:27:56Z","Content":"\u003E \n\u003E *P.S.: Guys, please don\u0027t use \u0022fork\u0022 like this.* ![:confused:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif) *That\u0027s not what the word stands for. A fork is a redistributed copy of an open source software project, not a modification to a not-redistributed piece of closed-source software. That would be called just that, a modification. Shorthand: \u0022mod\u0022. You can also use \u0022conversion\u0022 to underline the fact that it completely replaces a game mechanics system, or \u0022total conversion\u0022 if it goes as far as replacing the game experience in its entirety (like BTSM does), but never \u0022fork\u0022.*\n\nIt\u0027s a perfectly reasonable use of the word, and it distinguishes between an add-on mod and one that fundamentally changes part of the game in a way that possibly makes it incompatible to other mods. Thats really the same sense of the word as when a linux distro forks."},{"CreatedByName":"Psycho_zs","CreatedById":137644,"CreatedDateTime":"2015-06-25T09:45:12Z","Content":"\u003E \n\u003E It\u0027s a perfectly reasonable use of the word, and it distinguishes between an add-on mod and one that fundamentally changes part of the game in a way that possibly makes it incompatible to other mods. Thats really the same sense of the word as when a linux distro forks.\n\nThis is not a fork but replacement of a chunk of game mechanics. Well, what Streetwind said. Linux distro forking is a completely different process philosophically and genetically.\n\n\u003E \n\u003E Therefore, the thing that I will be doing is finding a way to move NFE and the HC radiators into using the stock modules. You will still be able to get HC separately, but it will just be parts. This may require some rejiggering of a few parameters in NFE and I\u0027ll need to think about how to reconcile the balance.\n\nSo be it! I hope, insulators will stay, they still look useful. On the other hand, conductors will fade away. Heat pipe... I do not know. Maybe it would be the way to partially localize heat management. Consider global fuel pump as a separate part to beef up radiators.\n\n I\u0027m thrilled to see how reactor core would fit under the skin with low skinInternalConductionMult ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)."}]}