{"TopicId":112058,"ForumId":15,"TopicTitle":"Noob question on collision meshes","CreatedByName":"Fengist","CreatedById":78435,"CreatedDateTime":"2015-06-05T13:31:36Z","PageNum":1,"Articles":[{"CreatedByName":"Fengist","CreatedById":78435,"CreatedDateTime":"2015-06-05T13:31:36Z","Content":"\n\u003Cp\u003EOk, so some while back I read a tutorial on making parts. And thus far, I\u0027ve been able to create some. Now, I\u0027m at a point that my parts are getting a bit more complex and the tutorial has raised questions. In the tutorial it stated that you should always use convex collision meshes. If I understand, it\u0027s because they are simple meshes and they use fewer resources. By accident, I forgot to turn on convex and I found the parts where I had it turned on had \u0027surfaces\u0027 where they shouldn\u0027t be but the one with convex turned off, worked perfect.\u003C/p\u003E\u003Cp\u003ESo, my question is: how important is it to use convex collision meshes in Unity and KSP?\u003C/p\u003E\n"},{"CreatedByName":"Kartoffelkuchen","CreatedById":108501,"CreatedDateTime":"2015-06-05T15:15:19Z","Content":"\n\u003Cp\u003EAs far as I know, when a mesh is \u0027convex\u0027, it can collide with other meshes which are \u0027convex\u0027 too. When one of those two meshes is not convex, it can\u0027t collide with other parts, and will simply go through them. So normally, you want a \u0027convex\u0027 collider for your KSP parts. But there are some exceptions: Parts which should store other parts, like Fairings, shouldn\u0027t be convex, because once they decouple their convex collider will destroy all the other parts in the fairing.\u003C/p\u003E\n"},{"CreatedByName":"Fengist","CreatedById":78435,"CreatedDateTime":"2015-06-05T15:19:47Z","Content":"\n\u003Cp\u003EOk, thanks. That just made magnified my learning curve by a few hundred points. Convex meshes don\u0027t exactly follow the outline of my part and I have no idea at the moment as to how to get a convex to fit the outline.\u003C/p\u003E\n"},{"CreatedByName":"NecroBones","CreatedById":105424,"CreatedDateTime":"2015-06-05T17:33:08Z","Content":"\n\u003Cp\u003EUsually you can use several smaller convex meshes to achieve what you need. If it\u0027s a cargo bay, for instance, you\u0027ll probably want to ring the exterior in a bunch of rectangular colliders to make the walls solid, but leaving open space inside. \u003C/p\u003E\u003Cp\u003EStock fuel tanks use 12-sized cylindrical colliders, so for cases where I\u0027ve needed to mash several colliders together to approximate the shape of the model, I\u0027ve generally still tried to target that number of faces. So as an example, the MRS cargo bays use 3 rectangular colliders for each door, since the doors are quarter-cylinders (90 degrees of arc around the center). \u003C/p\u003E\u003Cp\u003EAnother example of getting pretty much the right shape with just a handful of colliders is what I did in the Joolian Discovery\u0027s command pod. A roughly 12-sided truncated sphere gets most of the pod, but two truncated cones (also 12 sided) cover the \u0022neck\u0022 portion of the pod:\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/aZpzs\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Fengist","CreatedById":78435,"CreatedDateTime":"2015-06-05T18:53:06Z","Content":"\n\u003Cp\u003EOk, well, my learning now extends to how to add more than one collision mesh and to get it lined and sized properly. I\u0027m not using Blender yet, it\u0027s way more than I\u0027m looking to learn all at once. I am using Wings 3D. I\u0027ve just been using the .obj as the collision mesh.\u003C/p\u003E\n"},{"CreatedByName":"Randazzo","CreatedById":136468,"CreatedDateTime":"2015-06-05T18:57:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kartoffelkuchen\u0022 data-cite=\u0022Kartoffelkuchen\u0022\u003E\u003Cdiv\u003EAs far as I know, when a mesh is \u0027convex\u0027, it can collide with other meshes which are \u0027convex\u0027 too. When one of those two meshes is not convex, it can\u0027t collide with other parts, and will simply go through them. So normally, you want a \u0027convex\u0027 collider for your KSP parts. But there are some exceptions: Parts which should store other parts, like Fairings, shouldn\u0027t be convex, because once they decouple their convex collider will destroy all the other parts in the fairing.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI thought KSP could -only- have convex meshes.\u003C/p\u003E\n"},{"CreatedByName":"NecroBones","CreatedById":105424,"CreatedDateTime":"2015-06-05T21:16:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Randazzo\u0022 data-cite=\u0022Randazzo\u0022\u003E\u003Cdiv\u003EI thought KSP could -only- have convex meshes.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHarvestr said something in one of the dev updates that indicated that concave colliders were possible, but the physics system required at least one of the two that are colliding to be convex in Unity 4, and Unity 5 will require ALL of them to be convex.\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2015-06-06T02:04:35Z","Content":"\n\u003Cp\u003EThe part attachment on larger cylinder allows for 2x 12 surface attachment planes oriented vertically. If you use a 12 side collider then some parts may attach below the surface of larger cylinders. This is not a problem on smaller cylinders because the lowest high on the highest cylinder is higher than 1-cosine of the radius. But on the larger cylinders parts like RCS thrusters and strut connectors can disappear below the surface. If your visible surface of your cylinder is smooth its perimeter is going to be circular, but the collider meshes surfaces are flat. \u003C/p\u003E\u003Cp\u003EThere are several solutions, make the collider with more rectangles = two trigs on the surface, or make radius of the virteces of the collider bigger. If one does the second, some parts will attach above the surface of the cylinder. A third solution is to use shade the surfaces flat visible mesh. On my space factort (Factor24 cylinder) I broke the cylinder up into eight side parts, then the change of angle per change in side is small, the number of rectangles per side is reduced and the collider mesh outer surface is easy to make. \u003C/p\u003E\u003Cp\u003EThe convex rule only applies to a collider, it does not apply to multiple colliders on part or concavities creating in crafts. So the convex rule looks problematic until you realize all the ways to get around it, and then its more of a nuisance in construction.\u003C/p\u003E\n"},{"CreatedByName":"Fengist","CreatedById":78435,"CreatedDateTime":"2015-06-06T03:05:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PB666\u0022 data-cite=\u0022PB666\u0022\u003E\u003Cdiv\u003EThe part attachment on larger cylinder allows for 2x 12 surface attachment planes oriented vertically. If you use a 12 side collider then some parts may attach below the surface of larger cylinders. This is not a problem on smaller cylinders because the lowest high on the highest cylinder is higher than 1-cosine of the radius. But on the larger cylinders parts like RCS thrusters and strut connectors can disappear below the surface. If your visible surface of your cylinder is smooth its perimeter is going to be circular, but the collider meshes surfaces are flat. \u003Cp\u003EThere are several solutions, make the collider with more rectangles = two trigs on the surface, or make radius of the virteces of the collider bigger. If one does the second, some parts will attach above the surface of the cylinder. A third solution is to use shade the surfaces flat visible mesh. On my space factort (Factor24 cylinder) I broke the cylinder up into eight side parts, then the change of angle per change in side is small, the number of rectangles per side is reduced and the collider mesh outer surface is easy to make. \u003C/p\u003E\u003Cp\u003EThe convex rule only applies to a collider, it does not apply to multiple colliders on part or concavities creating in crafts. So the convex rule looks problematic until you realize all the ways to get around it, and then its more of a nuisance in construction.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOk, I think I\u0027ll just go back to php programming. Whatever the hell that is you just described sounds way more complex than it should be.\u003C/p\u003E\n"}]}