{"TopicId":112196,"ForumId":32,"TopicTitle":"Sadness. Just found another thing that was broke in 1.0","CreatedByName":"DerpenWolf","CreatedById":83222,"CreatedDateTime":"2015-06-06T19:53:39Z","PageNum":5,"Articles":[{"CreatedByName":"Zucal","CreatedById":139764,"CreatedDateTime":"2015-06-09T08:49:46Z","Content":"\n\u003Cp\u003EI have to agree with NovaSilisko and the others here, ion and other very low-thrust engines are becoming a more mainstream source of propulsion, and KSP owes them a proper, realistic tribute befitting a simulation. Right now ions are just too, too powerful.\u003C/p\u003E\u003Cp\u003EWhat I also think needs to happen is some kind of atmospheric propulsion that doesn\u0027t require oxygen. An electric propeller of some kind would be perfect, as it has shown up in concepts like HAVOC and would be very similar to current or pre 1.0 ions in that it would require a large amount of electricity, and would generate relatively little thrust. Now that I could get behind.\u003C/p\u003E\n"},{"CreatedByName":"Corw","CreatedById":7116,"CreatedDateTime":"2015-06-09T09:02:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Foxster\u0022 data-cite=\u0022Foxster\u0022\u003E\u003Cdiv\u003EYou mean like how entire space rockets, planes and their fuel can be built out of thin air in an instant, with no other infrastructure on the planet? Or how the planets are on rails and the sun has an infinite SOI? Or that the universe\u0027s physics, planets\u0027 characteristics and how engines work changes every few months? Or that infinite ore can be wished out of the ground? Or where magic spinning boxes can right your craft? Or where the crew never eat, drink or defecate? Or where fuel can be magically created from rocks? Or where a claw can make two craft become one with fuel cross feeds?...\u003Cp\u003EIts a game, not a simulation. Whatever is needed to make it interesting or fun is implemented. So, ion engines lifting a 100t rocket from sea level, why not? Who\u0027s to say what is impossible in the Kerbal-verse?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFrom what I\u0027ve seen and read over the years KSP is a balance between fun and realistic, with accent on realistic.\u003C/p\u003E\u003Cp\u003EIt has been using simplifications to improve fun (building out of thin air, fuel mining, fuel transfer), simplifications to avoid simulation problems (on the rails planets, SOI), scaling down to improve fun (smaller system, planets), scaling up to improve fun (high TWR, high ISP, high ion engine trust to improve burn time). But all of those simplifications and scaling are actually based in possible things. Fuel transfer is possible, but hard. RAPIER is possible, but hard, SSTO is possible but hard. Mining fuel on other planets and moons is possible, but you\u0027ve guessed it, it is hard. A lot of systems were added over time as the game was maturing, they were just missing at a time and were added over long period of time.\u003C/p\u003E\u003Cp\u003ESo yes, there are a lot of compromises on realism to have more fun, but realism was always strong in this one. There are no unicorns, warp drives and ion engines lifting 100t from sea level. In future Kerbals might eat, poop and have cities, because that was not high on list of important stuff, but your magic unicorns are nowhere to be found on that list. Your magic unicorn ion engines are not hard, they are impossible, so they are not included.\u003C/p\u003E\n"},{"CreatedByName":"MarvinKitFox","CreatedById":99545,"CreatedDateTime":"2015-06-09T09:38:29Z","Content":"\n\u003Cp\u003E\u0022Sadness. Just found another thing that was broke in 1.0 \u0022\u003C/p\u003E\u003Cp\u003ELet me correct your spelling on that.\u003C/p\u003E\u003Cp\u003E\u0022Joy. Horrid exploit finally fixed in 1.0\u0022\u003C/p\u003E\n"},{"CreatedByName":"Tankman101","CreatedById":144359,"CreatedDateTime":"2015-06-09T09:39:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Zucal\u0022 data-cite=\u0022Zucal\u0022\u003E\u003Cdiv\u003EI have to agree with NovaSilisko and the others here, ion and other very low-thrust engines are becoming a more mainstream source of propulsion, and KSP owes them a proper, realistic tribute befitting a simulation. Right now ions are just too, too powerful.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey still need to be able to complete a burn in a reasonable time.\u003C/p\u003E\u003Cp\u003E20 minutes is not a reasonable time.\u003C/p\u003E\n"},{"CreatedByName":"MarvinKitFox","CreatedById":99545,"CreatedDateTime":"2015-06-09T09:49:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tankman101\u0022 data-cite=\u0022Tankman101\u0022\u003E\u003Cdiv\u003EThey still need to be able to complete a burn in a reasonable time.\u003Cp\u003E20 minutes is not a reasonable time.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you want to match real-world parameters, then your Ion drive should use ten times the power, deliver 20 times the ISP, and deliver one ten-thousandth of the thrust.\u003C/p\u003E\u003Cp\u003ELook to burn times ranging from dozens to hundreds of days.\u003C/p\u003E\n"},{"CreatedByName":"Tankman101","CreatedById":144359,"CreatedDateTime":"2015-06-09T09:51:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MarvinKitFox\u0022 data-cite=\u0022MarvinKitFox\u0022\u003E\u003Cdiv\u003EIf you want to match real-world parameters, then your Ion drive should use ten times the power, deliver 20 times the ISP, and deliver one ten-thousandth of the thrust.\u003Cp\u003ELook to burn times ranging from dozens to hundreds of days.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell we can\u0027t run real-world parameters because KSP is a game, and the vessel needs to be focused in order to thrust.\u003C/p\u003E\u003Cp\u003E20 minutes is what a nerf would be more like. 200 days is just dumb.\u003C/p\u003E\n"},{"CreatedByName":"Jouni","CreatedById":97346,"CreatedDateTime":"2015-06-09T10:09:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tankman101\u0022 data-cite=\u0022Tankman101\u0022\u003E\u003Cdiv\u003EThey still need to be able to complete a burn in a reasonable time.\u003Cp\u003E20 minutes is not a reasonable time.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E20 minutes is a perfectly reasonable burn time, especially if you can use physics warp. It\u0027s the time required for a transfer burn to Jool with a low-TWR nuclear stage. Burns taking more than an hour can be tedious, but 20-30-minute burns are still quite normal.\u003C/p\u003E\u003Cp\u003EKSP is ultimately a game about waiting, because that\u0027s what space travel is. You wait for the right time to launch the rocket. You wait until it\u0027s the time to start the gravity turn. You wait for the lower stage to burn out. You wait for the upper stage to raise the apoapsis high enough. You wait until the rocket reaches the apoapsis. You wait until the circularization burn finishes. You wait until it\u0027s the right time to make a Hohmann transfer to rendezvous with the target. You wait until the right point in the transfer orbit to make course corrections. You wait until you\u0027re close to the target, before killing most of the relative velocity. You wait as the ship slowly drifts closer to the target, before coming to a complete halt. You wait as the target ship slowly rotates, until the correct docking port faces the incoming ship. You wait as the ship aligns itself with the docking port, and then moves slowly closer to dock. You wait for the next launch window, and then wait for the ship to complete the interplanetary transfer burn. At this point, the mission has just only started, and there\u0027s much more waiting ahead.\u003C/p\u003E\n"},{"CreatedByName":"Hotaru","CreatedById":135669,"CreatedDateTime":"2015-06-09T10:15:26Z","Content":"\n\u003Cp\u003EAll of those things are either unrelated to the point of KSP and therefore fair game to be handwaved in the name of gameplay or simplicity, or in need of fixing along with the ion engines. I never said the ions were the \u003Cem\u003Eonly\u003C/em\u003E OP thing that needed fixing, did I?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Foxster\u0022 data-cite=\u0022Foxster\u0022\u003E\u003Cdiv\u003EYou mean like how entire space rockets, planes and their fuel can be built out of thin air in an instant, with no other infrastructure on the planet?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EKSP is about the \u003Cem\u003Eengineering\u003C/em\u003E of space exploration, not ground-based logistics. Same reason the contract system is simplistic and there\u0027s no political wrangling. Those of us who want logistics too (like me!) can install KCT. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EOr how the planets are on rails and the sun has an infinite SOI?\u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s also not about astrophysics. Planets on rails are a pretty good approximation of real life, and why should the sun\u0027s SoI be finite until we have another star system to visit?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EOr that the universe\u0027s physics, planets\u0027 characteristics and how engines work changes every few months?\u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s a computer program in development. This is a concession, not to \u003Cem\u003Ereality\u003C/em\u003E but to \u003Cem\u003Ereal life\u003C/em\u003E. (Be fair, this shouldn\u0027t still be happening now that it\u0027s labeled 1.0, but that\u0027s a different argument.)\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EOr that infinite ore can be wished out of the ground?\u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWe don\u0027t have hardware anywhere near large enough to mine on a scale that would deplete planetary resources. We\u0027ve got single drills, not strip mines! And the one type of body small enough for a single drill to deplete its resources--asteroids--\u003Cem\u003Edoes\u003C/em\u003E have depletable resources. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003E Or where magic spinning boxes can right your craft?\u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree, reaction wheels could do with a nerf. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003E Or where the crew never eat, drink or defecate?\u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have to agree here as well, I would like to see some kind of stock life support. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EOr where fuel can be magically created from rocks?\u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s not the creating fuel from rocks that I disagree with, it\u0027s that \u003Cem\u003Eore and fuel are equivalent weight!\u003C/em\u003E You can refine 100t of ore into 100t of fuel! That doesn\u0027t make any kind of sense at all, and is right up there with OP ion engines on my personal list of things that \u003Cem\u003Eneed\u003C/em\u003E nerfing. Even if we keep it at an unrealisticaly high rate, at least make the ratio more like 2:1 as a token concession to reality!\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EOr where a claw can make two craft become one with fuel cross feeds?\u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAlso agreed, I personally never use the claw that way and don\u0027t think it should be possible. We really could do with something like KIS in stock. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EIts a game, not a simulation. Whatever is needed to make it interesting or fun is implemented. So, ion engines lifting a 100t rocket from sea level, why not? Who\u0027s to say what is impossible in the Kerbal-verse?\u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat logic is correct, for \u003Cem\u003Emods\u003C/em\u003E. Not for the stock game. Giving the Kerbals assault rifles so they can shoot each other would be interesting. Warp drive sounds fun too. Aliens, those would be interesting. Lightsabers are all kinds of fun. Should Squad implement those things too? Or should they be left to modders, because, although interesting, they have nothing to do with what KSP is about: \u003Cem\u003Espace exploration\u003C/em\u003E?\u003C/p\u003E\u003Cp\u003EJust because it would be fun or interesting doesn\u0027t mean it should be in stock KSP. And just because it\u0027s already in stock KSP doesn\u0027t mean it\u0027s not overpowered and in need of a nerf.\u003C/p\u003E\n"},{"CreatedByName":"Zzabur","CreatedById":94190,"CreatedDateTime":"2015-06-09T10:47:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tankman101\u0022 data-cite=\u0022Tankman101\u0022\u003E\u003Cdiv\u003EThey still need to be able to complete a burn in a reasonable time.\u003Cp\u003E20 minutes is not a reasonable time.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou can warp x2-3-4 during burn. If it\u0027s still \u0022not reasonable\u0022, you\u0027re free to use a higher thrust engine.\u003C/p\u003E\n"},{"CreatedByName":"Temeter","CreatedById":58056,"CreatedDateTime":"2015-06-09T11:09:32Z","Content":"\n\u003Cp\u003EEven now hardly anyone uses ion engines, because they are just very impractical to use outside of small satellites.\u003C/p\u003E\u003Cp\u003EAnd btw, KSPs normal engines aren\u0027t realistic either. They weight multiple times what they should in a realistic environment.\u003C/p\u003E\n"},{"CreatedByName":"Albert VDS","CreatedById":74055,"CreatedDateTime":"2015-06-09T11:15:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Foxster\u0022 data-cite=\u0022Foxster\u0022\u003E\u003Cdiv\u003EAnd who knows what little green men from another world might have figured out to get decent power density out of an ion engine?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat a moot point, because KSP isn\u0027t a futuristic space game. It\u0027s portraying current achievable tech.\u003C/p\u003E\u003Cp\u003EIf they did have an ion engine capable for use in landers then it wouldn\u0027t be an ion engine. Think about that.\u003C/p\u003E\u003Cp\u003EBut let\u0027s say they did, then why would they still be using chemical rockets.\u003C/p\u003E\u003Cp\u003EWhy not take it a step further? They could have create something which laughs in the face of the rocket equation.\u003C/p\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2015-06-09T12:06:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MarvinKitFox\u0022 data-cite=\u0022MarvinKitFox\u0022\u003E\u003Cdiv\u003E\u0022Sadness. Just found another thing that was broke in 1.0 \u0022\u003Cp\u003ELet me correct your spelling on that.\u003C/p\u003E\u003Cp\u003E\u0022Joy. Horrid exploit finally fixed in 1.0\u0022\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESeconded. If folks want to play Star Trek: The Kerbal Generation, they have a wide variety of SF mods to choose from.\u003C/p\u003E\u003Cp\u003EThey also have virtually every other space-themed game ever released. But this game, thankfully, is something different.\u003C/p\u003E\n"},{"CreatedByName":"Foxster","CreatedById":113764,"CreatedDateTime":"2015-06-09T15:21:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022r4pt0r\u0022 data-cite=\u0022r4pt0r\u0022\u003E\u003Cdiv\u003EPlease for the love of Jeb be posting this ironically. You can\u0027t really think this right?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUmm, maybe just a tad. Mostly though to keep the thoughts on this flowing. \u003C/p\u003E\u003Cp\u003EMy main issue is that I don\u0027t want KSP to descend completely into a human world simulation with the life sucked out of it i.e. just something for a dozen NASA nerds. It does not need every little chance of making something wacky, interesting or the result of some odd lateral thinking removed just so someone can say, as the lights are turned off, \u0022Well that was a very accurate game at the end just when everyone stopped playing because it got boring\u0022.\u003C/p\u003E\u003Cp\u003E1.0.2 has taken us in that direction. You can\u0027t build mad SSTOs anymore, you can\u0027t go to orbit on ion engines, you can\u0027t get off the ground with a lot of the rocket engines, you can\u0027t build stupid fat rockets for the hell of it, you have to stick fins on everything... I\u0027m sure that\u0027s all lovely in terms of \u0027reality\u0027 but if I want reality I can watch the news! I play computer games to escape reality. \u003C/p\u003E\u003Cp\u003ESo I say lets have flying saucers appearing. Lets have a Kerbal discover anti-matter. How about a wormhole to another solar system? If nothing else it would keep things interesting once we stopped loving having a rocket drop out of the sky to please some realism nut.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-06-09T15:28:51Z","Content":"\n\u003Cp\u003EReasonably realistic flight simulation is one of the key selling points of KSP, I\u0027d expect things to continue moving closer to the realistic end of the scale. You can always mod or mess with settings to make silly things (and some like seeing how silly they can get away with in a realistic model).\u003C/p\u003E\n"},{"CreatedByName":"Hotaru","CreatedById":135669,"CreatedDateTime":"2015-06-09T15:44:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Foxster\u0022 data-cite=\u0022Foxster\u0022\u003E\u003Cdiv\u003EUmm, maybe just a tad. Mostly though to keep the thoughts on this flowing. \u003Cp\u003EMy main issue is that I don\u0027t want KSP to descend completely into a human world simulation with the life sucked out of it i.e. just something for a dozen NASA nerds. It does not need every little chance of making something wacky, interesting or the result of some odd lateral thinking removed just so someone can say, as the lights are turned off, \u0022Well that was a very accurate game at the end just when everyone stopped playing because it got boring\u0022.\u003C/p\u003E\u003Cp\u003E1.0.2 has taken us in that direction. You can\u0027t build mad SSTOs anymore, you can\u0027t go to orbit on ion engines, you can\u0027t get off the ground with a lot of the rocket engines, you can\u0027t build stupid fat rockets for the hell of it, you have to stick fins on everything... I\u0027m sure that\u0027s all lovely in terms of \u0027reality\u0027 but if I want reality I can watch the news! I play computer games to escape reality. \u003C/p\u003E\u003Cp\u003ESo I say lets have flying saucers appearing. Lets have a Kerbal discover anti-matter. How about a wormhole to another solar system? If nothing else it would keep things interesting once we stopped loving having a rocket drop out of the sky to please some realism nut.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAlthough I disagree with you on the sci-fi stuff (we have several great mods for that, some of which I use, but I don\u0027t think it should be stock), I agree absolutely about taking things too far in a \u0022realism-at-all-costs\u0022 direction. I like the scale-model solar system, the simplified mechanics, the crazy engineering. That stuff is why I\u0027ve played Orbiter for about two days and KSP for many months. \u003C/p\u003E\u003Cp\u003EBut creativity and realism aren\u0027t mutually exclusive; we can have all kinds of fun with realistic parts and physics. I think it would be a shame if KSP were reduced to an excercise in stacking the correct combination of payload--\u0026gt;fairing--\u0026gt;tank--\u0026gt;engine--\u0026gt;decoupler--\u0026gt;tank--\u0026gt;engine--\u0026gt;radial decouplers--\u0026gt;boosters--\u0026gt;launch clamps--\u0026gt;done, which it sometimes feels like, especially in career mode. \u003C/p\u003E\u003Cp\u003EI don\u0027t think it is that way though, not in 0.90 and not in 1.0.2. Look through some of the stuff in the Spacecraft Exchange section or the What Did You Do In KSP Today thread, some of it is really clever! Some of the SSTOs in the (recently-unsticked, unfortunately) SSTO showcase thread are seriously \u0022mad\u0022 and still work fine. You yourself built a very nifty Dyna-soar replica and a 50\u0027s-style rocketship in 1.0.2, if I recall. I\u0027ve had some fun with torus stations and mini-shuttles and SSTOs that I never did in 0.90. All this even with the added \u0022realism\u0022 of 1.0.2 aero and balance. \u003C/p\u003E\u003Cp\u003EAnd if that\u0027s not enough, look at some of the stuff that\u0027s gotten built \u003Cem\u003Ein real life! \u003C/em\u003EA lot of it is standard-issue stage-stage-payload stuff, but look at the Space Shuttle or the Apollo spacecraft. Those were creative pieces of engineering. Look at SpaceShips One and Two, even if they didn\u0027t work out in the end they were pretty creative. Look at the stratospheric parachute jumps--all the crazy airbags and skycranes and things we\u0027ve been using to drop stuff onto Mars--the Deep Impact mission, also known as \u0022let\u0027s crash a spaceship into a comet and see what happens!\u0022--SpaceX trying to land its rockets vertically like something out of a Heinlein novel--the list goes on. And those were all done on hard career mode, no reverts, with \u003Cem\u003Eall\u003C/em\u003E the realism mods installed.\u003C/p\u003E\n"},{"CreatedByName":"FleshJeb","CreatedById":111640,"CreatedDateTime":"2015-06-09T15:44:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MarvinKitFox\u0022 data-cite=\u0022MarvinKitFox\u0022\u003E\u003Cdiv\u003EIf you want to match real-world parameters, then your Ion drive should use ten times the power, deliver 20 times the ISP, and deliver one ten-thousandth of the thrust.\u003Cp\u003ELook to burn times ranging from dozens to hundreds of days.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EActually, the ISP is really close now. Current real-life tech is listed at 20-50km/s exhaust velocity. This is range for ISP of 2040-5099.\u003C/p\u003E\u003Cp\u003EThe Quad-Grid tech I posted upthread is higher, of course, but that\u0027s in the bench-test phase.\u003C/p\u003E\n"},{"CreatedByName":"Foxster","CreatedById":113764,"CreatedDateTime":"2015-06-09T15:54:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Hotaru\u0022 data-cite=\u0022Hotaru\u0022\u003E\u003Cdiv\u003EAlthough I disagree with you on the sci-fi stuff (we have several great mods for that, some of which I use, but I don\u0027t think it should be stock), I agree absolutely about taking things too far in a \u0022realism-at-all-costs\u0022 direction. I like the scale-model solar system, the simplified mechanics, the crazy engineering. That stuff is why I\u0027ve played Orbiter for about two days and KSP for many months. \u003Cp\u003EBut creativity and realism aren\u0027t mutually exclusive; we can have all kinds of fun with realistic parts and physics. I think it would be a shame if KSP were reduced to an excercise in stacking the correct combination of payload--\u0026gt;fairing--\u0026gt;tank--\u0026gt;engine--\u0026gt;decoupler--\u0026gt;tank--\u0026gt;engine--\u0026gt;radial decouplers--\u0026gt;boosters--\u0026gt;launch clamps--\u0026gt;done, which it sometimes feels like, especially in career mode. \u003C/p\u003E\u003Cp\u003EI don\u0027t think it is that way though, not in 0.90 and not in 1.0.2. Look through some of the stuff in the Spacecraft Exchange section or the What Did You Do In KSP Today thread, some of it is really clever! Some of the SSTOs in the (recently-unsticked, unfortunately) SSTO showcase thread are seriously \u0022mad\u0022 and still work fine. You yourself built a very nifty Dyna-soar replica and a 50\u0027s-style rocketship in 1.0.2, if I recall. I\u0027ve had some fun with torus stations and mini-shuttles and SSTOs that I never did in 0.90. All this even with the added \u0022realism\u0022 of 1.0.2 aero and balance. \u003C/p\u003E\u003Cp\u003EAnd if that\u0027s not enough, look at some of the stuff that\u0027s gotten built \u003Cem\u003Ein real life! \u003C/em\u003EA lot of it is standard-issue stage-stage-payload stuff, but look at the Space Shuttle or the Apollo spacecraft. Those were creative pieces of engineering. Look at SpaceShips One and Two, even if they didn\u0027t work out in the end they were pretty creative. Look at the stratospheric parachute jumps--all the crazy airbags and skycranes and things we\u0027ve been using to drop stuff onto Mars--the Deep Impact mission, also known as \u0022let\u0027s crash a spaceship into a comet and see what happens!\u0022--SpaceX trying to land its rockets vertically like something out of a Heinlein novel--the list goes on. And those were all done on hard career mode, no reverts, with \u003Cem\u003Eall\u003C/em\u003E the realism mods installed.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003EWise words. \u003Cp\u003EI\u0027m just trying to inject, where I can, a little anti-total-realism so that the devs don\u0027t think that\u0027s all anyone out here wants.\u003C/p\u003E\n"},{"CreatedByName":"Jouni","CreatedById":97346,"CreatedDateTime":"2015-06-09T15:58:30Z","Content":"\n\u003Cp\u003EMy impression is that KSP has always strived for a good balance between realism and casual gameplay Ã¢â‚¬â€œ from the point of view of a long-time Orbiter player. That probably means more realism and less casual gameplay than the average KSP player expects.\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-06-09T16:06:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Foxster\u0022 data-cite=\u0022Foxster\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E1.0.2 has taken us in that direction. You can\u0027t build mad SSTOs anymore, you can\u0027t go to orbit on ion engines, you can\u0027t get off the ground with a lot of the rocket engines, you can\u0027t build stupid fat rockets for the hell of it, you have to stick fins on everything... I\u0027m sure that\u0027s all lovely in terms of \u0027reality\u0027 but if I want reality I can watch the news! I play computer games to escape reality. \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAre you kidding? I\u0027ve flipped rockets in mid air and still made it to orbit.\u003C/p\u003E\u003Cp\u003EYou can do whatever you want, but there\u0027s no guarantee it\u0027ll work.\u003C/p\u003E\n"},{"CreatedByName":"NovaSilisko","CreatedById":3897,"CreatedDateTime":"2015-06-09T16:18:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Foxster\u0022 data-cite=\u0022Foxster\u0022\u003E\u003Cdiv\u003EI\u0027m just trying to inject, where I can, a little anti-total-realism so that the devs don\u0027t think that\u0027s all anyone out here wants.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDo you really read what other people post? The \u0022total realism\u0022 of which you speak is a significant minority opinion. \u0022Partial realism\u0022, however, is the current direction of the game, and what most people seem to want. Hey, while we\u0027re at it, why even have gravity fall off with the inverse square of the distance? Who needs realistic crap like that, anyway?\u003C/p\u003E\u003Cp\u003EA precedent has been set long ago with a preference toward partial realism. The planets are indeed small, but the mathematics that govern their motion is strongly like that of the real world (ie, it follows keplerian dynamics, not general relativity). Rocket engines use real equations for their operation, even if somewhat simplified. Using the fact that rockets are constructed \u0022from thin air\u0022 is quite possibly, no, quite literally, the worst \u0022argument\u0022 against realistic features I have ever seen. I do not say such a thing lightly.\u003C/p\u003E\u003Cp\u003EI think this thread needs a pruning, or a direct hit from a bolide.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-09T16:38:43Z\u0022 title=\u002206/09/2015 04:38  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 9, 2015\u003C/time\u003E by NovaSilisko\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Robotengineer","CreatedById":104525,"CreatedDateTime":"2015-06-09T16:38:42Z","Content":"\n\u003Cp\u003EHow many times do people need to be reminded that KSP is \u003Cem\u003Esupposed\u003C/em\u003E to have some semblance of realism! That is one of the main selling points! There are thousands of space opera shooters, but only a handful of pseudo-realistic space sims (KSP and Orbiter AFAIK). Anti-realists say \u0027go play Orbiter!\u0027, it is time the realist\u0027s say \u0027Go play some space opera shooter!\u0027. /rant\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2015-06-09T16:43:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NovaSilisko\u0022 data-cite=\u0022NovaSilisko\u0022\u003E\u003Cdiv\u003EDo you really read what other people post? The \u0022total realism\u0022 of which you speak is a significant minority opinion. \u0022Partial realism\u0022, however, is the current direction of the game, and what most people seem to want. Hey, while we\u0027re at it, why even have gravity fall off with the inverse square of the distance? Who needs realistic crap like that, anyway?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYep - inverse-cube would be far more entertaining. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"clivman","CreatedById":139191,"CreatedDateTime":"2015-06-09T16:50:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KSK\u0022 data-cite=\u0022KSK\u0022\u003E\u003Cdiv\u003EYep - inverse-cube would be far more entertaining. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMission Control, why did we just lose contact with our ship! Mission Control: Umm. Were pretty sure it was just spagettified as it entered Low Kerbol Orbit.\u003C/p\u003E\n"},{"CreatedByName":"NovaSilisko","CreatedById":3897,"CreatedDateTime":"2015-06-09T16:51:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KSK\u0022 data-cite=\u0022KSK\u0022\u003E\u003Cdiv\u003EYep - inverse-cube would be far more entertaining. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOn the subject, a direct inverse falloff is pretty interesting. You get neat little trefoil shaped orbits, and orbital velocity actually stays the same regardless of altitude, from my experiments.\u003C/p\u003E\n"},{"CreatedByName":"Foxster","CreatedById":113764,"CreatedDateTime":"2015-06-09T17:37:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Robotengineer\u0022 data-cite=\u0022Robotengineer\u0022\u003E\u003Cdiv\u003EHow many times do people need to be reminded that KSP is \u003Cem\u003Esupposed\u003C/em\u003E to have some semblance of realism!\u003C/div\u003E\u003C/blockquote\u003ESays who? Show me the design spec.\n"}]}