{"TopicId":112164,"ForumId":18,"TopicTitle":"June 6th 1944......... 68 years ago today.","CreatedByName":"Hodo","CreatedById":78218,"CreatedDateTime":"2015-06-06T12:45:23Z","PageNum":1,"Articles":[{"CreatedByName":"Hodo","CreatedById":78218,"CreatedDateTime":"2015-06-06T12:45:23Z","Content":"71 years ago today, D-Day happened thousands of brave men lost their lives fighting for their nations. So let us take time today to remember these brave souls who had their lives cut short by this war.\n\nEDITED-- 71 years ago... sorry hadn\u0027t had my coffee yet at that time math fail.\n\n**Edited \u003Ctime datetime=\u00222015-06-07T06:42:49Z\u0022 title=\u002206/07/2015 06:42  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 7, 2015\u003C/time\u003E by Hodo**"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-06-06T13:12:57Z","Content":"Lest we forget..."},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-06-06T13:33:29Z","Content":"Isn\u0027t it 71 years, not 68?\n\nAnyhow...\n\nTo those who gave the ultimate sacrifice, I salute you.\n\n\\*salute"},{"CreatedByName":"Yukon0009","CreatedById":109376,"CreatedDateTime":"2015-06-06T14:02:11Z","Content":"God damn it I should have released something to honor WW2.\n\nI salute all those lost their lives 71 years ago."},{"CreatedByName":"kenbobo","CreatedById":70629,"CreatedDateTime":"2015-06-06T15:52:12Z","Content":"\\*Salute\\*\n\nI really should make a memorial in KSP.\n\nGive me a couple hours."},{"CreatedByName":"TheSaint","CreatedById":70033,"CreatedDateTime":"2015-06-06T16:06:09Z","Content":"My father was a loader in a [DD tank](https://en.wikipedia.org/wiki/DD_tank#D-Day) in the first wave to Utah beach. If you read the history all but one of the DD tanks made it onto the beach, that was his. The flotation screen on his tank got holed by enemy fire and it sank, he barely made it out. He said he was glad that he had to swim to shore, because it washed the crap out of his pants. He picked up a rifle on the beach and fought with the infantry for a week before they got him another tank. \n\nOver the next 10 months in Europe he lost nine tanks and eleven crew members, but was never injured once, and he was promoted all the way up to tank commander. They wanted to give him a field commission to 2nd Lt and make him a platoon commander, but he told them to go to hell because platoon commanders had a habit of dying fast in combat. (The platoon leaders\u0027 tanks had two radios, one for the platoon net and one for the company net, which meant that they also had two antennas on top. So the Germans learned to shoot the tank with two antennas first. Some guy got the idea to weld a rod to all of the tank\u0027s turrets to make them all look like they had two antennas, they told him to go to hell too.) In April of \u002745 he had been shot out of his ninth tank and was once again fighting with the infantry when he caught a mortar fragment in his calf, which was his only injury of the entire war. He was recuperating in the field hospital on VE Day. \n\nCoincidentally, we\u0027re going to go visit the old man\u0027s grave today. I haven\u0027t been in a decade, and my kids have never been. (It is in a completely different state.) He\u0027s been gone for 27 years, and not a day goes by that I don\u0027t miss him."},{"CreatedByName":"LordFerret","CreatedById":111598,"CreatedDateTime":"2015-06-06T17:10:30Z","Content":"My uncle (dad\u0027s eldest brother), landed in Normandy, Omaha Beach, Dog Sector, 3rd wave. He fought from the beach all the way in to Saint-Lo. He was one of the lucky ones which made it back home alive. He\u0027s long gone now (RIP), but I remember the stories ... many of which could well have been fodder for the movie *Saving Private Ryan*.\n\n*Likewise* ***TheSaint****, likewise... not a day that goes by.*"},{"CreatedByName":"Dman979","CreatedById":123837,"CreatedDateTime":"2015-06-06T18:26:56Z","Content":"It\u0027s days like this and threads like this that make me so emotional. I\u0027m a major WWII history buff, so this is a very special day for me, too. My grandfather was in WWII, but he didn\u0027t see combat, or even leave the states. He did reconstructive surgery as an ophthalmologist with the US Army.\n\nI also want to point out that this is also the anniversary of the Liberation of Rome.\n\nHodo, thank you for posting this thread."},{"CreatedByName":"jmiki8","CreatedById":94688,"CreatedDateTime":"2015-06-06T19:09:28Z","Content":"One of my grandfathers also fought in the WWII.\n\n...On the opposite side. He flew a Messerschmitt BF-109 G-1 and G-2 in the Royal Hungarian Air Force. He fought only on the eastern front and destroyed 7 planes, including 3 IL-2s, 2 MiG-3s, one Yak-1 and 3 unknown aircraft. He survived the war, and died in the 80s. I don\u0027t know how this relates to the topic, I just wanted to mention that along the allied soldiers, the enemies (except their leaders) also deserve respect, as many of them haven\u0027t fought for Hitler and the nazis (or their local government), but for their homeland and family just like the allied men. However, I salute all the allied men who fought in WWII, Europe would be a much worse place without their sacrifice.\n\n**Edited \u003Ctime datetime=\u00222015-06-06T19:40:43Z\u0022 title=\u002206/06/2015 07:40  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 6, 2015\u003C/time\u003E by jmiki8**"},{"CreatedByName":"CelticCossack51","CreatedById":127600,"CreatedDateTime":"2015-06-07T01:53:23Z","Content":"I am also a history buff in the World Wars and the Cold War. My great-grandfather and great-great-grandfather fought against the Japanese in China. They were part of the communist militia and both died in Northern China. Also a family friend\u0027s relative was a Chinese pilot for the Korean War. He shot down more than 80 American planes. He died this year. I salute to all those British, American, Canadian, ANZAC, French, Greek, and more soldiers who took part in D-Day and everyone who served and sacrificed themselves in both World Wars.\n\n**Edited \u003Ctime datetime=\u00222015-06-10T02:35:24Z\u0022 title=\u002206/10/2015 02:35  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 10, 2015\u003C/time\u003E by CelticCossack51**"},{"CreatedByName":"SemiaCloud","CreatedById":138816,"CreatedDateTime":"2015-06-07T01:58:53Z","Content":"\\*Salute\\*"},{"CreatedByName":"segaprophet","CreatedById":14087,"CreatedDateTime":"2015-06-07T02:34:29Z","Content":"Respect and remembrance for all the ordinary men of *all* nations who accomplished extraordinary things in the midst of hardship, upheaval, death and cataclysm.\n\n*\u0022We few, we happy few, we band of brothers; For he to-day that sheds his blood with me shall be my brother.\u0022 - Henry V*\n\n**Edited \u003Ctime datetime=\u00222015-06-07T02:36:52Z\u0022 title=\u002206/07/2015 02:36  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 7, 2015\u003C/time\u003E by segaprophet**"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2015-06-07T03:21:28Z","Content":"\u003E \n\u003E men of *all* nations\n\nI agree with this. So often we depict \u0027the other side\u0027 as lesser beings, or people that made obvious mistakes. They are not. They were just ordinary people, men, women, boys, girls, that got swept away by a sea of violence and lawlessness. They just tried to get by. They made no less of a sacrifice than we did, they just happened to be born on another side of a fence."}]}