{"TopicId":112146,"ForumId":25,"TopicTitle":"Solar Limbo: How Low can you Go?","CreatedByName":"MarvinKitFox","CreatedById":99545,"CreatedDateTime":"2015-06-06T09:13:05Z","PageNum":1,"Articles":[{"CreatedByName":"MarvinKitFox","CreatedById":99545,"CreatedDateTime":"2015-06-06T09:13:05Z","Content":"\n\u003Cp\u003EIts party time. Its Limbo time!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.tntisland.com/images/limbo02.jpg\u0022 alt=\u0022limbo02.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESimple challenge:\u003C/p\u003E\u003Cp\u003EUsing stock parts and physics, what is the lowest Kerbol(sun) orbit you can achieve?\u003C/p\u003E\u003Cp\u003ERules:\u003C/p\u003E\u003Cp\u003E*Pick any orbit you want, the winner is the one with the lowest Apogee.\u003C/p\u003E\u003Cp\u003E*ship must contain a thermometer, and antenna. We want to know how hot it gets!\u003C/p\u003E\u003Cp\u003E*no cheats. Debug menu -\u0026gt; physics -\u0026gt; Thermal -\u0026gt; display thermal is allowed, indeed encouraged.\u003C/p\u003E\u003Cp\u003EFeel free to use any visual or piloting mods, but nothing that adds parts, changes parts or changes thermal physics.\u003C/p\u003E\u003Cp\u003EBest so far:\u003C/p\u003E\u003Cp\u003E1: LordCorwin 589,874km.\u003C/p\u003E\u003Cp\u003E2: BurningLegion 755,010Km\u003C/p\u003E\u003Cp\u003E3: Foxster 812,507km\u003C/p\u003E\u003Cp\u003E4: Squiggsy 878,720km \u003C/p\u003E\u003Cp\u003E.\u003C/p\u003E\u003Cp\u003E.\u003C/p\u003E\u003Cp\u003E.\u003C/p\u003E\u003Cp\u003E17: MarvinKitFox 2636.1Mm\u003C/p\u003E\u003Cp\u003ESorry for the long absence, I could not access this post in edit mode. \u003C/p\u003E\u003Cp\u003EAs the challenge was posted under previous version of KSP, it will not be maintained any further.\u003C/p\u003E\u003Cp\u003EBut please do feel free to comment, post or interact as you wish.\u003C/p\u003E\u003Cp\u003EHave fun!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-26T09:36:06Z\u0022 title=\u002207/26/2015 09:36  AM\u0022 data-short=\u00228 yr\u0022\u003EJuly 26, 2015\u003C/time\u003E by MarvinKitFox\u003C/strong\u003E\n\u003Cbr\u003EClosing\n\u003C/span\u003E\n"},{"CreatedByName":"smjjames","CreatedById":134004,"CreatedDateTime":"2015-06-06T18:35:05Z","Content":"\n\u003Cp\u003EIs it okay if I use tempgauge killer? All it does is stop temp gauges from appearing and thus the memory leak from happening.\u003C/p\u003E\n"},{"CreatedByName":"MarvinKitFox","CreatedById":99545,"CreatedDateTime":"2015-06-06T18:46:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022smjjames\u0022 data-cite=\u0022smjjames\u0022\u003E\u003Cdiv\u003EIs it okay if I use tempgauge killer? All it does is stop temp gauges from appearing and thus the memory leak from happening.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EConsidering the first thing i do is whack F10 to manually kill then, this is good. Hmm, might want to go hunt that up myself.\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-06-06T18:49:20Z","Content":"\n\u003Cp\u003EBut you won\u0027t have a warning when parts are about to go boom, but if you turn off PPFX you can have your RAM \u003Cem\u003Eand\u003C/em\u003E temp gauges \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"smjjames","CreatedById":134004,"CreatedDateTime":"2015-06-06T18:58:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sal_vager\u0022 data-cite=\u0022sal_vager\u0022\u003E\u003Cdiv\u003EBut you won\u0027t have a warning when parts are about to go boom, but if you turn off PPFX you can have your RAM \u003Cem\u003Eand\u003C/em\u003E temp gauges \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve heard that the PPFX causes a memory leak, but I thought that was a separate leak from the temp gauges one? PPFX is actually auto disabled for me because the hardware doesn\u0027t support it. It\u0027s a pretty new (like 2 years or something) NVIDIA graphics card, so no idea why it doesn\u0027t.\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2015-06-06T19:18:40Z","Content":"\n\u003Cp\u003EI already have two sundiver probes inbound in prep for assembly of a low solar observation station. Problem is they\u0027re both modded. Using NFP engines to cut down on size for dV, and using radiators on the second to test the viability of that close to the corona. Care to allow a modded leaderboard for those of us using these witchcraft gizmos called radiators?\u003C/p\u003E\u003Cp\u003EEDIT: Also wouldnt the perigee be a better measurement since its lower or are you trying to force people to circularize?\u003C/p\u003E\n"},{"CreatedByName":"smjjames","CreatedById":134004,"CreatedDateTime":"2015-06-06T20:03:20Z","Content":"\n\u003Cp\u003EI hope he meant periapsis because it would take a ....load of deltaV to circularize close to the sun.\u003C/p\u003E\n"},{"CreatedByName":"BurningLegion","CreatedById":142799,"CreatedDateTime":"2015-06-06T20:31:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022smjjames\u0022 data-cite=\u0022smjjames\u0022\u003E\u003Cdiv\u003EI hope he meant periapsis because it would take a ....load of deltaV to circularize close to the sun.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOn the plus side, the sun provides enough power to run high-efficiency ion engines to do that. Were I to do this, I would envision the smallest possible probe, equipped with a set of ion engines, solar panels, and xenon tanks to circularize near the sun. At a guess, I think we\u0027d be looking at the 70k delta-V range. Might explain why this is a challenge, and also explains why I\u0027m not participating \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E Because I\u0027d treat it as \u0022Lowest orbit that can be circularized near the sun\u0022.\u003C/p\u003E\n"},{"CreatedByName":"MarvinKitFox","CreatedById":99545,"CreatedDateTime":"2015-06-07T06:55:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022smjjames\u0022 data-cite=\u0022smjjames\u0022\u003E\u003Cdiv\u003EI hope he meant periapsis because it would take a ....load of deltaV to circularize close to the sun.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EApoapsis.\u003C/p\u003E\u003Cp\u003EThe challenge is to build something that has both the delta-v to get a circular orbit around the sun, AND the thermal ability to survive it.\u003C/p\u003E\u003Cp\u003EOf the two problems, the temperature is the more difficult one!\u003C/p\u003E\u003Cp\u003EIt is easy* to build a light probe with 30000 delta-v.\u003C/p\u003E\u003Cp\u003EMaking it capable of surviving the sun.. not so easy.\u003C/p\u003E\u003Cp\u003E* The word \u0022easy\u0022 is used in this context to mean \u0022quite hard, but doable\u0022\u003C/p\u003E\n"},{"CreatedByName":"The-MathMog","CreatedById":36417,"CreatedDateTime":"2015-06-07T16:31:25Z","Content":"\n\u003Cp\u003EAww, just now realized, after building a probe with a ton of heat resistance, that it was about circularizing a low orbit.. I missed the point, and thought it was a sun-grazing challenge.\u003C/p\u003E\u003Cp\u003EWon\u0027t be participating then, as I can\u0027t stand the tedious waiting time for ion engines to do their work... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Squiggsy","CreatedById":139947,"CreatedDateTime":"2015-06-08T13:17:36Z","Content":"\n\u003Cp\u003EHere is my entry!\u003C/p\u003E\u003Cp\u003EWas fun making a very kerbal rocket, it\u0027s been ages since I\u0027ve made stock rockets haha so I decided to make it a bit interesting.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/AhA1Q\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EMy Apoapsis was 878,720km (so if were doing it in Mm then 878.72Mm)\u003C/p\u003E\u003Cp\u003EThe heat shield was completely pointless! if I had replaced it with a service bay and put the thermometers inside that I probably could have got a lot closer\u003C/p\u003E\n"},{"CreatedByName":"MarvinKitFox","CreatedById":99545,"CreatedDateTime":"2015-06-08T18:38:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Squiggsy\u0022 data-cite=\u0022Squiggsy\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EMy Apoapsis was 878,720km (so if were doing it in Mm then 878.72Mm)\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGreat job Squiggsy!n You take the lead, for now.\u003C/p\u003E\n"},{"CreatedByName":"Foxster","CreatedById":113764,"CreatedDateTime":"2015-06-08T22:20:03Z","Content":"\n\u003Cp\u003EThe SunDiver 1:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/LUOGHFH.png\u0022 alt=\u0022LUOGHFH.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/csYtGoK.jpg\u0022 alt=\u0022csYtGoK.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/WNOlbXX.png\u0022 alt=\u0022WNOlbXX.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/mlKZa5G.png\u0022 alt=\u0022mlKZa5G.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIts comfortable though because it\u0027s a dry heat \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EPS: It has 5555 dV left! So plenty of scope for heat-related shenanigans.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-08T22:38:17Z\u0022 title=\u002206/08/2015 10:38  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 8, 2015\u003C/time\u003E by Foxster\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"BurningLegion","CreatedById":142799,"CreatedDateTime":"2015-06-09T20:50:45Z","Content":"\n\u003Cp\u003E*Idly looks at \u0022Sundiver 1\u0022 design. Does a double take. Takes notes.* Excuse me while I file the concept of that interplanetary stage, what with the nuke separated from a different upper stage by an I-beam, away for future use.\u003C/p\u003E\u003Cp\u003EIt is a glorious day, comrades! For extremely important valid scientific reasons and certainly not because of a bet with capitalist dog space programs located in alternate universes, the glorious Kerbal Space Program has launched a probe to get as close to Kerbol as possible. Obviously, the Kerbal Space Program has succeeded easily with no complications relating to substandard materials and workers whatsoever, with a heatstroke-inducing orbit of 765,000 x 765,000 Km.\u003C/p\u003E\u003Cp\u003EThis is just another victory over the capitalists, but for more victories, we need your support, my comrades.\u003C/p\u003E\u003Cp\u003EGlory to Kerbin.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/veBEJ\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EFlying this thing has restored my faith in my own engineering. By using TAC Fuel balancer, I was able to asparagus-stage Xenon tanks, as well as do damage control when Dang It decided to try and screw me. I have something like 5500 Delta-V left, so more can be done if I wish it. I know the thermometer says it\u0027s 930K, but it was in a service bay. The temperature of actual running parts varied between 1000K for the main body \u0026amp; retracted panel and 1150K for the extended solar panel. Realistically, I can\u0027t bring the Sunskimmer much closer without the panels blowing up and since I suspect they\u0027re what\u0027s radiating heat from the main body of the spacecraft, S-1 will follow after that.\u003C/p\u003E\n"},{"CreatedByName":"Foxster","CreatedById":113764,"CreatedDateTime":"2015-06-09T21:35:13Z","Content":"\n\u003Cp\u003EI think we are at about the same place. Hovering at the edge of the oven, wary to get closer. \u003C/p\u003E\u003Cp\u003EAny idea at what altitude the temperature starts to run away or is it very part dependant? I wonder if I might have the edge as I have no solar panels? Care to see?\u003C/p\u003E\n"},{"CreatedByName":"BurningLegion","CreatedById":142799,"CreatedDateTime":"2015-06-09T22:00:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Foxster\u0022 data-cite=\u0022Foxster\u0022\u003E\u003Cdiv\u003EI think we are at about the same place. Hovering at the edge of the oven, wary to get closer. \u003Cp\u003EAny idea at what altitude the temperature starts to run away or is it very part dependant? I wonder if I might have the edge as I have no solar panels? Care to see?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI know I\u0027ll be bringing my Sunskimmer closer until it blows up, taking shots and quicksaving every 15,000 km. I have no idea when Kerbol gets too hot to handle, so in the process of doing this I was coming a little closer, taking a screenshot, coming a little closer, taking a screenshot, until the result pictured.\u003C/p\u003E\u003Cp\u003EYep. I didn\u0027t want to cook the S-1 until I got an entry \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E. I would have to say that it definitely seems part-dependent in some respects - the highest temperature on my ship is 1150K, and though that\u0027s scary given the part\u0027s tolerance is 1200K, the temperature of the rest of my ship is significantly lower than the temperature you\u0027ve recorded, to the point where my thermometer is giving incorrect readings.\u003C/p\u003E\u003Cp\u003EI honestly think you have the edge. My solar panels mean I can operate at maximum capacity until I run out of Xenon, but because I\u0027m using Gigantor XLs their maximum temperature is only 1200K. They\u0027re conducting heat away from the main body of my probeship (Which would be good if I had some radiotope generators on that body), but if they explode then that\u0027s it for the Sunskimmer. The Z-1K cannot maintain thrust on an ion engine long enough to do anything relevant this close to Kerbol.\u003C/p\u003E\u003Cp\u003EOn the one hand, your ship looks like it\u0027ll have a lot more problems shedding heat than mine, but on the other your power generation components can tolerate a lot more heat than mine. It\u0027d be interesting to see who can get closer.\u003C/p\u003E\u003Cp\u003EEDIT: Took the S-1 in. Made it to 535,335 x 533,347 Km. Both panels exploded, and had to make the final burn on batteries. With this experience, I revise my opinion of Foxster\u0027s ship: You don\u0027t have the advantage. Without a way to rapidly vent heat, you will overheat and explode. I now believe that your Ap will be above 535,335 Km when you do so.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/ldkuG\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-10T01:57:36Z\u0022 title=\u002206/10/2015 01:57  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 10, 2015\u003C/time\u003E by BurningLegion\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Foxster","CreatedById":113764,"CreatedDateTime":"2015-06-10T17:10:33Z","Content":"\n\u003Cp\u003EAh, now, at 700Mm the thermometers, the aerial and the PB-NUK melted. Shame. \u003C/p\u003E\u003Cp\u003EHowever the craft was still quite flyable...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/rvSvFIw.png\u0022 alt=\u0022rvSvFIw.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EOnward and downward...\u003C/p\u003E\u003Cp\u003E~500,000km and even the sunspots are looking cool...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Qh3mSbm.jpg\u0022 alt=\u0022Qh3mSbm.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe temp is running away though. I don\u0027t think she\u0027ll last long enough for another couple of burns. \u003C/p\u003E\u003Cp\u003EAnd, yes, she went poof. \u003C/p\u003E\u003Cp\u003EI dunno what altitude to claim here. The temperature was ramping up as I tried that last burn. F3 says that the Probodyne exploded due to over-heating. I need to just switch out the Probodyne for an RC-001S (same weight) that has a 2000Ã‚Â° limit and try it again.\u003C/p\u003E\u003Cp\u003EShoot me for this but I hyperedited the tweaked craft to 500000km. Looks like the parts (other than the aerial and PB-NUK that quickly blew) are stable. I\u0027ll let it cook for a bit and make sure it stays stable.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/DA5VLcF.png\u0022 alt=\u0022DA5VLcF.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-10T17:46:50Z\u0022 title=\u002206/10/2015 05:46  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 10, 2015\u003C/time\u003E by Foxster\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MarvinKitFox","CreatedById":99545,"CreatedDateTime":"2015-06-10T18:16:35Z","Content":"\n\u003Cp\u003EThe competition is really heating up out there!\u003C/p\u003E\u003Cp\u003EThose are some really hot designs.\u003C/p\u003E\u003Cp\u003EAre you going to fire me for bad heat-related jokes?\u003C/p\u003E\u003Cp\u003EOr just flame a bit? ;-)\u003C/p\u003E\u003Cp\u003EOk, so now we have set the bar. How far can we lower it?\u003C/p\u003E\u003Cp\u003ESo far none of the designs had anything really in the way of special heat-proof design or materials.\u003C/p\u003E\u003Cp\u003EIf you were to take a gigantor solar panel on that ship, and point it *exactly* into its own shade... Would that heat or cool, hmmm?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-10T18:26:15Z\u0022 title=\u002206/10/2015 06:26  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 10, 2015\u003C/time\u003E by MarvinKitFox\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"BurningLegion","CreatedById":142799,"CreatedDateTime":"2015-06-10T19:06:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MarvinKitFox\u0022 data-cite=\u0022MarvinKitFox\u0022\u003E\u003Cdiv\u003EThe competition is really heating up out there!\u003Cp\u003EThose are some really hot designs.\u003C/p\u003E\u003Cp\u003EAre you going to fire me for bad heat-related jokes?\u003C/p\u003E\u003Cp\u003EOr just flame a bit? ;-)\u003C/p\u003E\u003Cp\u003EOk, so now we have set the bar. How far can we lower it?\u003C/p\u003E\u003Cp\u003ESo far none of the designs had anything really in the way of special heat-proof design or materials.\u003C/p\u003E\u003Cp\u003EIf you were to take a gigantor solar panel on that ship, and point it *exactly* into its own shade... Would that heat or cool, hmmm?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI got all the way to 535,335 Km apoapsis with a controlled craft that had a thermometer, and that was due to Gigantor XL panels. If I oriented them so one panel had 2% surface coverage from Kerbol, they radiated heat to keep the ship at a toasty 1100 kelvin and the panels at about 930K. I\u0027ve already planned some modifications to make for the S-2, but I won\u0027t go into detail on them until after I deploy it.\u003C/p\u003E\u003Cp\u003EFunny story - while making the S-1, the game crashed on me after I got it into Kerbol orbit. When I loaded it to bring the S-1 closer until it was done for, I noticed another dot labeled \u0022S-1\u0022 in the tracking center. Turns out it\u0027s the old one - I\u0027m going to rename that the S-X, and since it\u0027s a radically different design from the S-1 I\u0027ll bring it closer along with the new S-2 tweaking.\u003C/p\u003E\n"},{"CreatedByName":"Foxster","CreatedById":113764,"CreatedDateTime":"2015-06-10T20:13:18Z","Content":"\n\u003Cp\u003EWell, that\u0027s about it for this simple design...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/O3NwOtv.png\u0022 alt=\u0022O3NwOtv.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ve run it at high warp at that altitude and the temperature doesn\u0027t hit 2000Ã‚Â°, the failure temp of all the parts. \u003C/p\u003E\u003Cp\u003ESo I\u0027ll call it at 271.063Mm Ap, though it is also OK at the Pe too.\u003C/p\u003E\n"},{"CreatedByName":"MarvinKitFox","CreatedById":99545,"CreatedDateTime":"2015-06-10T20:41:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Foxster\u0022 data-cite=\u0022Foxster\u0022\u003E\u003Cdiv\u003EWell, that\u0027s about it for this simple design...\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/O3NwOtv.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/O3NwOtv.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ve run it at high warp at that altitude and the temperature doesn\u0027t hit 2000Ã‚Â°, the failure temp of all the parts. \u003C/p\u003E\u003Cp\u003ESo I\u0027ll call it at 271.063Mm Ap, though it is also OK at the Pe too.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EVery nice, but where\u0027s the thermometer to measure, and the aerial to transmit?\u003C/p\u003E\u003Cp\u003ERule #2 says \u0022*ship must contain a thermometer, and antenna. We want to know how hot it gets!\u0022\u003C/p\u003E\u003Cp\u003EStill, I didn\u0027t think *anything* could survive that low!\u003C/p\u003E\n"},{"CreatedByName":"Foxster","CreatedById":113764,"CreatedDateTime":"2015-06-10T20:44:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MarvinKitFox\u0022 data-cite=\u0022MarvinKitFox\u0022\u003E\u003Cdiv\u003EVery nice, but where\u0027s the thermometer to measure, and the aerial to transmit?\u003Cp\u003ERule #2 says \u0022*ship must contain a thermometer, and antenna. We want to know how hot it gets!\u0022\u003C/p\u003E\u003Cp\u003EStill, I didn\u0027t think *anything* could survive that low!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003EAs I said, they have a lower thermal tolerance and melted well before this. The ship was still flyable though with all the other parts. I quite understand if the rules are broken though.\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-10T20:48:44Z\u0022 title=\u002206/10/2015 08:48  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 10, 2015\u003C/time\u003E by Foxster\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"LordCorwin","CreatedById":114256,"CreatedDateTime":"2015-06-14T17:15:35Z","Content":"\n\u003Cp\u003EHi, this is my Solar-probe4:\u003C/p\u003E\u003Cp\u003EApoapsis: 649,756,248m\u003C/p\u003E\u003Cp\u003EThe first pic shows that I\u0027ve just made a Temperature transmission via antenna.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s454.photobucket.com/user/Lord_Corwin/media/Sun_probe4_17.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i454.photobucket.com/albums/qq262/Lord_Corwin/Sun_probe4_17.png\u0022 alt=\u0022Sun_probe4_17.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s454.photobucket.com/user/Lord_Corwin/media/Sun_probe4_18.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i454.photobucket.com/albums/qq262/Lord_Corwin/Sun_probe4_18.png\u0022 alt=\u0022Sun_probe4_18.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m trying to beat myself closing to the 625Mm, but not sure if I\u0027ll make it, at least for what it takes for the sensors. The temperature gauge still can hold a bit longer, but the seismic sensor is close to the limit!\u003C/p\u003E\u003Cp\u003ELord\u003C/p\u003E\n"},{"CreatedByName":"LordCorwin","CreatedById":114256,"CreatedDateTime":"2015-06-14T18:15:22Z","Content":"\n\u003Cp\u003EOk, that\u0027s it. Apogee = 589,873,831m.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s454.photobucket.com/user/Lord_Corwin/media/Sun_probe4_99.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i454.photobucket.com/albums/qq262/Lord_Corwin/Sun_probe4_99.png\u0022 alt=\u0022Sun_probe4_99.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s454.photobucket.com/user/Lord_Corwin/media/Sun_probe4_991.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i454.photobucket.com/albums/qq262/Lord_Corwin/Sun_probe4_991.png\u0022 alt=\u0022Sun_probe4_991.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe seismic \u0026amp; gravioli exploded at 625Mm, but still the Temperature sensor remained.\u003C/p\u003E\u003Cp\u003EAfter these images I made a mistake when trying to reach the 585Mm apogee and the entire probe exploded.\u003C/p\u003E\u003Cp\u003ELord\u003C/p\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2015-06-14T21:26:08Z","Content":"\n\u003Cp\u003EWhile experimenting, I found that heat shields radiate everything. I went to 10Mm by Hyperedit; temperatures behind the heatshield reached an equilibrium around 500K. Getting even lower was tricky: it takes only two or three seconds to rotate the vessel, yet that\u0027s enough to explode many parts. The ones that survive that long, however, start to shed heat as soon as they\u0027re behind the shield.\u003C/p\u003E\u003Cp\u003ESolar panels work a treat: rotate the craft so that the panels are exposed, briefly, and you\u0027ll harvest thousands of units in a split-second.\u003C/p\u003E\u003Cp\u003EThere\u0027s only one problem: the heatshield has to face the sun at all times. Timewarp is out of the question.\u003C/p\u003E\n"}]}