{"TopicId":112171,"ForumId":20,"TopicTitle":"Quick Question","CreatedByName":"Dr. Kriger","CreatedById":107995,"CreatedDateTime":"2015-06-06T14:20:02Z","PageNum":1,"Articles":[{"CreatedByName":"Dr. Kriger","CreatedById":107995,"CreatedDateTime":"2015-06-06T14:20:02Z","Content":"\n\u003Cp\u003EFirst off i\u0027d just like to apologize in advance if this is in the wrong part of the forums.\u003C/p\u003E\u003Cp\u003EI\u0027ve been looking for a decent mod that adds a tail with a ramp so I can roll things out of the back of a plane. I know the B9 pack has what I am looking for but it\u0027s a very large mod and I would like to avoid downloading it if possible due to my toaster of a laptop not being able to handle it. I\u0027ve been looking around the forums for a while now but I can\u0027t seem to find anything other than B9 so any help would be appreciated.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-06-06T14:27:39Z","Content":"\n\u003Cp\u003ENertea\u0027s \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/101699\u0022 rel=\u0022external nofollow\u0022\u003EMk4 Spaceplane SYstem\u003C/a\u003E has one, not sure if it\u0027s working in 1.0 yet though.\u003C/p\u003E\u003Cp\u003EMoving this over to General Add On Affiars, the place for mod-related questions.\u003C/p\u003E\n"},{"CreatedByName":"Dr. Kriger","CreatedById":107995,"CreatedDateTime":"2015-06-06T14:35:19Z","Content":"\n\u003Cp\u003EI looked through the posts on the mod you linked and it apparently doesn\u0027t work in 1.0 yet due to the stack nodes being changed. I had the same issue with B9 when I last tried it so I guess i\u0027ll have to wait for them to update. Thanks anyway for the help.\u003C/p\u003E\n"},{"CreatedByName":"hab136","CreatedById":75997,"CreatedDateTime":"2015-06-06T15:22:18Z","Content":"\n\u003Cp\u003EIf you just want an MK3 ramp, get the ramp \u0022mini-pack\u0022 on the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/79542\u0022 rel=\u0022external nofollow\u0022\u003ESXT page\u003C/a\u003E\u003C/p\u003E\n"}]}