{"TopicId":112225,"ForumId":16,"TopicTitle":"How to calculate dv for inclination change?","CreatedByName":"guitarxe","CreatedById":115354,"CreatedDateTime":"2015-06-07T03:02:36Z","PageNum":1,"Articles":[{"CreatedByName":"guitarxe","CreatedById":115354,"CreatedDateTime":"2015-06-07T03:02:36Z","Content":"\n\u003Cp\u003EHow can I find out how much dv is required to do an inclination change from X degrees to Y degrees?\u003C/p\u003E\u003Cp\u003EI\u0027m planning a munar satellite mission and want to know how much dv to pack to put it in munar polar orbit.\u003C/p\u003E\n"},{"CreatedByName":"WOODY01","CreatedById":129358,"CreatedDateTime":"2015-06-07T03:27:45Z","Content":"\n\u003Cp\u003EIt cost a lot less dv to get the inclination you want during the transfer burn or a correction burn on the way to the target. Inclination changes are costly inregards to dv.\u003C/p\u003E\u003Cp\u003EThe formula and what to insert into it can be found with a google search.\u003C/p\u003E\n"},{"CreatedByName":"OhioBob","CreatedById":128005,"CreatedDateTime":"2015-06-07T03:32:35Z","Content":"\n\u003Cp\u003EThe formula for be found here:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.braeunig.us/space/orbmech.htm#maneuver\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.braeunig.us/space/orbmech.htm#maneuver\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EEquation 4.73 for a simple plane change and 4.74 for combined plane change and altitude change.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-07T06:35:46Z\u0022 title=\u002206/07/2015 06:35  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 7, 2015\u003C/time\u003E by OhioBob\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-06-07T03:40:18Z","Content":"\n\u003Cp\u003EThe thing about inclination changes is that the cost completely depends on where you do them. For example, the worst possible way to get into a polar orbit around the Mun (or anywhere else) is to get into an equatorial orbit first, and then wrestle it around by 90 degrees.\u003C/p\u003E\u003Cp\u003EThe most efficient way to set your orbital inclination around a body is to do it as far away as possible from that body.\u003C/p\u003E\u003Cp\u003EFor example, if you\u0027re in equatorial LKO and want to go to a polar orbit around the Mun, the best way to do that is to do a slight inclination change long before you even enter the Mun\u0027s SoI. Then it takes very little dV.\u003C/p\u003E\u003Cp\u003EEven better is to launch directly into a slightly inclined orbit when taking off from Kerbin, much better than launching equatorial and then changing inclination later.\u003C/p\u003E\n"},{"CreatedByName":"guitarxe","CreatedById":115354,"CreatedDateTime":"2015-06-07T04:03:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Snark\u0022 data-cite=\u0022Snark\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EEven better is to launch directly into a slightly inclined orbit when taking off from Kerbin, much better than launching equatorial and then changing inclination later.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow would I get an encounter with the mun if my orbital plane doesn\u0027t match it?\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-06-07T04:27:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022guitarxe\u0022 data-cite=\u0022guitarxe\u0022\u003E\u003Cdiv\u003EHow would I get an encounter with the mun if my orbital plane doesn\u0027t match it?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBy picking the right time to launch, so that the Mun is located at your orbit\u0027s ascending or descending node when you get there.\u003C/p\u003E\u003Cp\u003EFor example, let\u0027s say you decide to forego circularizing to LKO first, and are launching directly to munar intercept. If you were doing that equatorial all the way, how would you do it? You\u0027d sit on the pad and wait until about the time that the Mun rises over the horizon (give or take a few degrees), then launch eastwards to intercept, right?\u003C/p\u003E\u003Cp\u003ESo, suppose you do that same thing, and burn about the same amount, but instead of heading due east when you make your gravity turn, you head northeast (or even due north). You\u0027re launching from the same place, at the same time, with the same periapsis and apoapsis, just with a different inclination. Which means that you\u0027ll reach apoapsis at the same time and place as you would have in the equatorial case, which in turn means you will get a Mun intercept-- just from a different angle.\u003C/p\u003E\n"},{"CreatedByName":"cybersol","CreatedById":81136,"CreatedDateTime":"2015-06-07T04:29:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Snark\u0022 data-cite=\u0022Snark\u0022\u003E\u003Cdiv\u003EEven better is to launch directly into a slightly inclined orbit when taking off from Kerbin, much better than launching equatorial and then changing inclination later.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn the general case this would be tricky to pull off timing wise, and you could easily lose more sidereal rotation boost than the small maneuver at mid-plane would take.\u003C/p\u003E\u003Cp\u003EEDIT: Ninja\u0027d, but still relevant. Generally this is complicated enough to easily mess it up enough to hurt your fuel situation more than you help it. It the kind of thing I might try if I tried the normal way and ran out of fuel. However, if you know you are going to run out of fuel at launch time, you also have easier options to fix low fuel \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-07T04:41:52Z\u0022 title=\u002206/07/2015 04:41  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 7, 2015\u003C/time\u003E by cybersol\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Arkalius","CreatedById":40968,"CreatedDateTime":"2015-06-07T05:21:08Z","Content":"\n\u003Cp\u003E2 * v * sin(i/2)\u003C/p\u003E\u003Cp\u003Ev is your orbital velocity while making the change, and i is the inclination change amount.\u003C/p\u003E\u003Cp\u003EA 60 degree change will require a delta-v that is equal to your orbital velocity at the time you do it. It kind of makes sense. You\u0027re trying to change your velocity vector angle by 60 degrees and maintain the same velocity. Thus, the delta-v vector will form an equilateral triangle with the other two.\u003C/p\u003E\u003Cp\u003EThe slower you are moving, the less delta-v you need to change inclination.\u003C/p\u003E\u003Cp\u003EI\u0027ve done some math on this. If your need to change your inclination by notably more than 45 degrees, and are in a low-eccentricity orbit, it can actually be cheaper to raise your apoapsis of your orbit, then at apoapsis, do your plane change, then lower your apoapsis again than it would be to simply do the plane change on your existing orbit. Of course, this will take a lot longer, but if you have the time you can save up to 40% of your delta-v depending on how much of a plane change you\u0027re doing and how high up you push the apoapsis.\u003C/p\u003E\n"},{"CreatedByName":"cybersol","CreatedById":81136,"CreatedDateTime":"2015-06-07T06:02:07Z","Content":"\n\u003Cp\u003EFor \u0026gt;90* you can save even more by aerobraking some of the retrograde component, which is particularly useful in the case where you do a full 180 around a body with an atmosphere.\u003C/p\u003E\n"},{"CreatedByName":"Coga19000","CreatedById":125394,"CreatedDateTime":"2015-06-07T06:50:52Z","Content":"\n\u003Cp\u003EActually, for the Mun, going equatorial and changing inclination at the highest point during the injection may be a bit cheaper. \u003C/p\u003E\u003Cp\u003EAlso note that any inclination you have at Kerbin orbit is generally going to be accentuated at Munar SOI, so you\u0027ll have to take this into account too.\u003C/p\u003E\n"}]}