{"TopicId":112267,"ForumId":44,"TopicTitle":"Adeline concept for Ariane 6","CreatedByName":"H2O.","CreatedById":92782,"CreatedDateTime":"2015-06-07T15:20:20Z","PageNum":3,"Articles":[{"CreatedByName":"Eric S","CreatedById":57117,"CreatedDateTime":"2015-06-09T21:39:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pipcard\u0022 data-cite=\u0022Pipcard\u0022\u003E\u003Cdiv\u003E\u0022I think there is a world market for maybe \u003Cem\u003Efive\u003C/em\u003E computers.\u0022\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExactly. On a similar note, it was once estimated that there would never be more than one million automobiles in the US. The reasoning was sound at the time. It was based on the fact that a car was complex enough that operating one (including maintenance) was a full time job and they estimated that there would never be more than a million people that would want the job of chauffeur.\u003C/p\u003E\u003Cp\u003EThat said, rockets are going to have to become greatly simpler and cheaper before this kind of expansion would take off. Then again, if we don\u0027t do the work to make it more accessible, the expansion will never happen.\u003C/p\u003E\n"},{"CreatedByName":"Frozen_Heart","CreatedById":118627,"CreatedDateTime":"2015-06-09T23:26:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EIf you throw a party once a year with 100 guests, it makes sense to buy disposable cups and plates. If you open a restaurant with 100 guests every night, it makes sense to invest in reusable glasses and plates.\u003Cp\u003E Reusable rockets only make sense if you have high launch rates, which means increased demand for orbital flights. You don\u0027t increase demand by only cutting prices. There also needs to be a reason for people to want to send stuff to space, which means actual applications and business models built around them. \u003C/p\u003E\u003Cp\u003E The technology isn\u0027t the limiting factor here. The economics are. If demand appears for reusable rockets, then the industry will figure out ways to make rockets reusable. It\u0027s just that until now, the economics of spaceflight are balanced in favor of disposable hardware, just like the fast food market is balanced in favor of disposable cups. This might change in the future if someone finds a business model that requires frequent orbital launches. For the moment, there is no such business model because the only applications for orbital flight are defense, research and comsats.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe trouble is that mass flights to orbit won\u0027t happen until launchers are cheap and reusable, while rockets won\u0027t be cheap and reusable until there are mass flights to orbit. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"B787_300","CreatedById":31055,"CreatedDateTime":"2015-06-10T03:11:21Z","Content":"\n\u003Cp\u003E/me wanders in cough cough\u003C/p\u003E\u003Cp\u003Eokay so as has been mentioned, the main issue is turn around. Remember an airliner can immediately turn around and go back out with a cursory inspection (the pilot\u0027s walkaround). The issue so far is that spacecraft have to deal with much more powerful forces than a plane. When it was originally designed the Space Shuttle was supposed to fly ~50 times a YEAR, about a launch every week. When NASA was promoting it to Congress they said turn around would be like an airplane. The images below show the projected turnaround procedure and then the actual one.\u003C/p\u003E\u003Cp\u003EProjected\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://upload.wikimedia.org/wikipedia/commons/4/42/SpaceShuttleGroundProcessingVision.jpg\u0022 alt=\u0022SpaceShuttleGroundProcessingVision.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EActual\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://upload.wikimedia.org/wikipedia/commons/3/34/SpaceShuttleGroundProcessingActual.jpg\u0022 alt=\u0022SpaceShuttleGroundProcessingActual.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENOW if both SpaceX and Airbus and ULA, manage to get it working the winner will be SpaceX with a reflight stack costing around 45 Million or so. BUT that is only if they dont have to overhaul the craft. \u003C/p\u003E\u003Cp\u003EThe engines are the most expensive part of the craft and are designed to be used many times even if they are only fired 3 times overall. The most overkill are the Russian engines that are designed with a service life of 100\u002B firings even though most are fired 3 times (acceptance testing, Hot Fire, launch). if you dont have to do the engineering tear down that happened to the RS25s (SSMEs) then you are pretty good.\u003C/p\u003E\u003Cp\u003EThe tanks are reasonably inexpensive, they are just hard to make well. this is the main issue with SpaceX\u0027s idea, if the tanks dont hold up well they have to take the time to replace them. Neither airbus nor ULA have that issue as the tanks are a separate component that \u0022snaps\u0022 into place.\u003C/p\u003E\u003Cp\u003EThe biggest issue with ADELINE is that it has WINGS and propellers. both of those ad crazy complexity to a rocket. plus with adeline then you really cant do a whole bunch of strapon boosters. The aerodynamics of the wings at hypersonic speeds when they are designed to produce lift at subsonic speeds is nuts. plus they add a lot of drag to the rocket.\u003C/p\u003E\u003Cp\u003EOverall, if they can get airplane like reusability, spaceX and airbus are the best suited, land near pad on pads or runway, where as ULA is the hardest, catch something that is heavy with a parachute using a helicopter. BUT it all depends on how fast turn around is.\u003C/p\u003E\u003Cp\u003Eon a side note, Glider ADELINE in KSP (Real Drag, Strict Area rule FAR)\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/YUbki\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Pipcard","CreatedById":2541,"CreatedDateTime":"2015-06-10T03:29:45Z","Content":"\n\u003Cp\u003EBut as you should notice, SpaceX, Airbus, and ULA aren\u0027t planning to have a giant winged orbiter that has to experience re-entry from orbital velocities.\u003C/p\u003E\n"},{"CreatedByName":"Iskierka","CreatedById":2116,"CreatedDateTime":"2015-06-10T03:49:51Z","Content":"\n\u003Cp\u003EOne thing about the shuttle is it massively over-promised, as quite late in the program after many conflicting requirements massively cut down anything it could realistically do, they were still using early quotes from simpler, more functional designs that would have had more development funding available, and thus been able to be made much more capable. The final product was one different to what they were advertising.\u003C/p\u003E\u003Cp\u003EBig difference with everyone else, including SABRE and Skylon, as well as all the partial reuse options, is the proposal being offered is the same as the one intended to be provided, since they won\u0027t have massively conflicting requirements placed on them by governments and militaries. They\u0027re simply developing whatever they think is the best option and giving realistic reusability figures for the actual proposed vehicle, instead of one only tangentially related. Effectively, the shuttle\u0027s quotes were lies, but they were forced to lie, because they couldn\u0027t be honest about how bad the conflicts were making the vehicle\u0027s performance. Yes, projects can over-promise and under-deliver, but in the shuttle\u0027s case, you only over-promise and under-deliver that badly when you\u0027re forced to deliver a vehicle that wasn\u0027t what you were promising.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2015-06-10T05:15:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Frozen_Heart\u0022 data-cite=\u0022Frozen_Heart\u0022\u003E\u003Cdiv\u003EThe trouble is that mass flights to orbit won\u0027t happen until launchers are cheap and reusable, while rockets won\u0027t be cheap and reusable until there are mass flights to orbit. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDemand isn\u0027t created only by cost. Just because something becomes cheap doesn\u0027t mean that everybody wants it. \u003C/p\u003E\u003Cp\u003EEven if launch costs were cut by 50% (which isn\u0027t realistic in any of the current reusable launcher proposals), a launch will still cost 30 to 50 million dollars. Payloads will still cost several times that amount and new reasons to go to space are not going to appear out of thin air.\u003C/p\u003E\u003Cp\u003EWhat you need is new applications for spaceflight that make sense economically. Unfortunately, none of the futuristic ones (space manufacturing, asteroid mining, orbital tourism, etc...) are viable or propose an attractive business model, even with a large discount on launch prices.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-10T08:54:23Z\u0022 title=\u002206/10/2015 08:54  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 10, 2015\u003C/time\u003E by Nibb31\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Pipcard","CreatedById":2541,"CreatedDateTime":"2015-06-10T08:08:23Z","Content":"\n\u003Cp\u003EWe will never progress. We will never improve.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-10T08:11:24Z\u0022 title=\u002206/10/2015 08:11  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 10, 2015\u003C/time\u003E by Pipcard\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2015-06-10T08:12:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pipcard\u0022 data-cite=\u0022Pipcard\u0022\u003E\u003Cdiv\u003EWe will never progress. We will never improve.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EProgress and improvement are subjective. Who says that a reusable space shuttle is an improvement?\u003C/p\u003E\u003Cp\u003EIf the goal is economy and efficiency, then there are several ways of reaching it. It doesn\u0027t necessarily have to be through one technological path.\u003C/p\u003E\n"},{"CreatedByName":"H2O.","CreatedById":92782,"CreatedDateTime":"2015-06-10T08:43:14Z","Content":"\n\u003Cp\u003EI am with Nibb31 on this. The problem of high cost for space access is not a technologic one, what we need is a reason to go up there. And frankly, besides a few satellites there are none. Imagine how the cost will drop if there were payloads for 100 Ariane a year.\u003C/p\u003E\u003Cp\u003ETrying to solve this problem with technology will probably fail. We need to figure out something to do up there.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2015-06-10T09:07:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AngelLestat\u0022 data-cite=\u0022AngelLestat\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThis is similar to think that if you reduce the cost of cars 100 years ago it will be pointless because you imagine that the demand will be the same.\u003C/p\u003E\u003Cp\u003EThe same that some people in the past never imagine to have a computer in each house, and maybe they could not even see the utility in that.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere was demand for transportation before airlines or cars existed. Since the Roman Empire, there has always been a necessity to move goods and people from A to B, because there were people that lived at A that needed to meet other people that lived at B or they wanted to sell products from A to people in B. Ships, trains and airplanes didn\u0027t create the demand for transportation. Those technologies were developed and adapted to fulfill a demand that existed. The same is true for rockets.\u003C/p\u003E\u003Cp\u003EThe problem with orbital launches is that LEO isn\u0027t a very appealing destination other that for some very specialized applications. People aren\u0027t queuing up in millions to go to space like they want to go to London, Tokyo, or New York, because there isn\u0027t anything for them to do in space. There are no business meetings, no relatives to visit, no museums or theme parks, no wildlife or landmarks to visit... Going to orbit is nothing more than a joyride, and a joyride doesn\u0027t justify the cost.\u003C/p\u003E\n"},{"CreatedByName":"Albert VDS","CreatedById":74055,"CreatedDateTime":"2015-06-10T09:55:33Z","Content":"\n\u003Cp\u003ELowering the cost through technological means is a way to reach a point where we have a reason to go up there.\u003C/p\u003E\u003Cp\u003ESpace tourism would be one. At the moment it\u0027s restricted to hand full of people who have enough money to buy a ticket.\u003C/p\u003E\u003Cp\u003ELower the launch cost and you increase the number of people who can afford it, more people use it and the cost goes down even more.\u003C/p\u003E\u003Cp\u003EAnother technological way is making space probes/satellites cheaper. \u003C/p\u003E\u003Cp\u003EThis includes making them smaller and modular. A good example of this is cubesats.\u003C/p\u003E\u003Cp\u003EDue to their weight they cost less to launch and can be launched simultaneously.\u003C/p\u003E\u003Cp\u003EThe modular part makes it cheaper to design a probe/satellite while using tested technology.\u003C/p\u003E\u003Cp\u003EOf course lighter payloads wont help heavy lift rockets to increase in number of launches.\u003C/p\u003E\u003Cp\u003ESpace tourism needs to move out of LEO for that.\u003C/p\u003E\u003Cp\u003EThe biggest reason we can have to go up there is Mars. If we settle on Mars we have a reason\u003C/p\u003E\u003Cp\u003Eto travel between planets. A settlement on the Moon would trigger the same thing of course.\u003C/p\u003E\u003Cp\u003EBasically there are enough reasons to go up there; exploration, communication, tourism and settlement.\u003C/p\u003E\u003Cp\u003EThose need to become reality first, making launches cheaper just gets the ball rolling.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2015-06-10T10:15:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Albert VDS\u0022 data-cite=\u0022Albert VDS\u0022\u003E\u003Cdiv\u003ELowering the cost through technological means is a way to reach a point where we have a reason to go up there.\u003Cp\u003ESpace tourism would be one. At the moment it\u0027s restricted to hand full of people who have enough money to buy a ticket.\u003C/p\u003E\u003Cp\u003ELower the launch cost and you increase the number of people who can afford it, more people use it and the cost goes down even more.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETechnology has its limits. If you lower the price of a seat to orbit to $1 million (which is a crazy low price that beats even the most optimistic previsions), it will still be for a handful of rich people. Even at $100000, it would still be a once in a lifetime joyride for rich people, not a mass transport thing because orbit isn\u0027t a destination where people want or need to go.\u003C/p\u003E\u003Cp\u003EAnd by the time we get to those prices, there will probably be high-definition VR that will get you the exact same experience without the price tag and space sickness.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAnother technological way is making space probes/satellites cheaper. \u003C/p\u003E\u003Cp\u003EThis includes making them smaller and modular. A good example of this is cubesats.\u003C/p\u003E\u003Cp\u003EDue to their weight they cost less to launch and can be launched simultaneously.\u003C/p\u003E\u003Cp\u003EThe modular part makes it cheaper to design a probe/satellite while using tested technology.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat actually goes against more frequent flight rates.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThe biggest reason we can have to go up there is Mars. If we settle on Mars we have a reason\u003C/p\u003E\u003Cp\u003Eto travel between planets. A settlement on the Moon would trigger the same thing of course.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhy would the average Joe want to settle on Mars or the Moon with his family? Humans migrate to where the grass is greener, to improve their comfort or safety and those of their children. They don\u0027t choose to spend the rest of their life in a trailer with artificial life support in the middle a barren desert. How would moving to Mars improve their quality of life or provide better prospects for their children?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EBasically there are enough reasons to go up there; exploration, communication, tourism and settlement.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExploration is a very low volume and is limited by the face that it\u0027s a government activity. Commercial exploration isn\u0027t much of a thing.\u003C/p\u003E\u003Cp\u003EComsats provides the bulk of the market, but it\u0027s competing with land lines and wireless and becoming more and more niche. Most people these days are switching from GSO satellite TV to IPTV over DSL or optical fiber. 4G networks are still cheaper to maintain that comsats. \u003C/p\u003E\u003Cp\u003ETourism, well see above.\u003C/p\u003E\u003Cp\u003ESettlement is science fiction with zero basis in reality.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-10T10:19:54Z\u0022 title=\u002206/10/2015 10:19  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 10, 2015\u003C/time\u003E by Nibb31\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Albert VDS","CreatedById":74055,"CreatedDateTime":"2015-06-10T11:19:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003ETechnology has its limits. If you lower the price of a seat to orbit to $1 million (which is a crazy low price that beats even the most optimistic previsions), it will still be for a handful of rich people. Even at $100000, it would still be a once in a lifetime joyride for rich people, not a mass transport thing because orbit isn\u0027t a destination where people want or need to go.\u003Cp\u003EAnd by the time we get to those prices, there will probably be high-definition VR that will get you the exact same experience without the price tag and space sickness.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf it\u0027s only a few orbits around the world then yes, it\u0027s just a joyride. You need something which longer duration than that, to decrease the price per hour.\u003C/p\u003E\u003Cp\u003ESomething like an orbital hotel could work. It would require maintenance and what not, but a week in space for would still be cheaper than a few hours. \u003C/p\u003E\u003Cp\u003EVR would never replace something like being in space, unless it becomes something like Star Trek\u0027s Holodeck.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThat actually goes against more frequent flight rates.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s true, but it gives more possibilities to send something up there.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EWhy would the average Joe want to settle on Mars or the Moon with his family? Humans migrate to where the grass is greener, to improve their comfort or safety and those of their children. They don\u0027t choose to spend the rest of their life in a trailer with artificial life support in the middle a barren desert. How would moving to Mars improve their quality of life or provide better prospects for their children?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe first settlers wont have comfort, total safety or direct better prospect for themselves, but that\u0027s something which increases when a settlement grows and advances in technology.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EExploration is a very low volume and is limited by the face that it\u0027s a government activity. Commercial exploration isn\u0027t much of a thing.\u003Cp\u003EComsats provides the bulk of the market, but it\u0027s competing with land lines and wireless and becoming more and more niche. Most people these days are switching from GSO satellite TV to IPTV over DSL or optical fiber. 4G networks are still cheaper to maintain that comsats. \u003C/p\u003E\u003Cp\u003ETourism, well see above.\u003C/p\u003E\u003Cp\u003ESettlement is science fiction with zero basis in reality.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECommercial exploration could be a thing if the cost of it is set lower and if there is return.\u003C/p\u003E\u003Cp\u003ETourism, see above. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ESettlement might not be in our direct future, but it\u0027s closer than having VR as an equal experience as the real thing.\u003C/p\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2015-06-10T11:33:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003ETechnology has its limits. If you lower the price of a seat to orbit to $1 million (which is a crazy low price that beats even the most optimistic previsions), it will still be for a handful of rich people. Even at $100000, it would still be a once in a lifetime joyride for rich people, not a mass transport thing because orbit isn\u0027t a destination where people want or need to go.\u003Cp\u003EAnd by the time we get to those prices, there will probably be high-definition VR that will get you the exact same experience without the price tag and space sickness.\u003C/p\u003E\u003Cp\u003EThat actually goes against more frequent flight rates.\u003C/p\u003E\u003Cp\u003EWhy would the average Joe want to settle on Mars or the Moon with his family? Humans migrate to where the grass is greener, to improve their comfort or safety and those of their children. They don\u0027t choose to spend the rest of their life in a trailer with artificial life support in the middle a barren desert. How would moving to Mars improve their quality of life or provide better prospects for their children?\u003C/p\u003E\u003Cp\u003EExploration is a very low volume and is limited by the face that it\u0027s a government activity. Commercial exploration isn\u0027t much of a thing.\u003C/p\u003E\u003Cp\u003EComsats provides the bulk of the market, but it\u0027s competing with land lines and wireless and becoming more and more niche. Most people these days are switching from GSO satellite TV to IPTV over DSL or optical fiber. 4G networks are still cheaper to maintain that comsats. \u003C/p\u003E\u003Cp\u003ETourism, well see above.\u003C/p\u003E\u003Cp\u003ESettlement is science fiction with zero basis in reality.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESettlement has never been about economics, except in the minds of megalomaniacs that want to rule the world and happen to wear a crown or something. And once the settlement is given, the artificial market you just created can very well sustain itself. But I digress! I didn\u0027t mean to actually comment on that point.\u003C/p\u003E\u003Cp\u003EWhat I wanted to try (again) to get a response from you about is SSP (Space Solar Power). In that case, the only thing between an unsatiable demand growth, and it remaining science fiction is the cost to orbit of the hardware and the price of energy on the ground. Once those things hit the sweet spot, bam, huge market requiring a huge mass in orbit.\u003C/p\u003E\u003Cp\u003EI bring it up because it is a clear example of what you say doesn\u0027t exist: an economical space-based activity that requires significantly lowering the price to orbit before it becomes viable, but that when the price is right unlocks a huge market. And last I saw the (I know, speculative) numbers weren\u0027t even that far away to close the business case, cost/Kwh turned out within one or two orders of magnitude of current commercial solutions, depending on assumptions of course.\u003C/p\u003E\u003Cp\u003ERune. I am the least convinced person that is going to happen soon, though. But it may if we keep bringing the cost to orbit down and the efficiency of solar panels up.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-10T11:36:00Z\u0022 title=\u002206/10/2015 11:36  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 10, 2015\u003C/time\u003E by Rune\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Iskierka","CreatedById":2116,"CreatedDateTime":"2015-06-10T12:04:44Z","Content":"\n\u003Cp\u003EAlso consider that the biggest reason space costs so much is because it is a high-risk venture. First, you need to trust that the LV won\u0027t fail during launch, and will deliver you to the required altitude, then that your circularisation will work, and then that your own satellite won\u0027t fail. Satellites cost hundreds of millions to billions of dollars because of this last point - any of these failures mean you don\u0027t have what you wanted in orbit, and you don\u0027t want it to be that your own satellite failed being what\u0027s losing you money. Plus, the next launch slot is years away, so even if you had a spare satellite, you might endure dozens of months of lost revenue.\u003C/p\u003E\u003Cp\u003EA rapidly reusably launch vehicle, however, drastically changes this landscape. Suddenly, the next launch slot isn\u0027t years away, it\u0027s weeks away even if they only get a small improvement in flight rate. With a big improvement, you might fail on Tuesday and be trying again on Thursday. This allows companies to take a bigger risk on their satellites, dramatically cutting their cost. If SpaceX considered something like trying to reland the entire stack in emergency, including upper stage and payload, they could have a non-destructive abort method for problems that emerge early in the first stage - a rather limited circumstance, but one that could save the customer significant money if they\u0027re not losing their payload. And a reusable SSTO such as Skylon is unrivalled in this situation - a failure at any point, including satellite activation, is not a permanent one, but one from which you simply re-attach the payload and fly back to base, to allow repairs to be made. To have a catastrophic loss, Skylon would have to suffer either total hydraulics failure or a simultaneous quad-engine-failure, both of which are immensely improbable.\u003C/p\u003E\u003Cp\u003EAny stage of this cost reduction from reusability also reduces cost of satellites, as above. Space is a very limited market because only people who are -absolutely sure- that their billions are worth it are willing to risk it. If you bring that down to hundreds of millions, then that dramatically increases the number of people who will consider risking the money, as there are always more potential uses of space, even if they\u0027re only some variant on Earth observation. I\u0027ll bet the companies that now provide farmers with maps of where their crops need fertiliser the most took a significant risk before it paid off, and lowering the cost allows more similar risks. If you bring the cost down to tens of, or even just millions, by almost totally removing risk from space, then you dramatically widen the market, as more and more potential uses can be seen, and at those prices, even universities may justify the launch cost on occasion, and make use of the opportunity to conduct all kinds of new research.\u003C/p\u003E\u003Cp\u003EIn the end, even if a higher flight rate does not get utilised, the fact it exists dramatically reduces risk, and will in conjunction dramatically reduce the cost of satellites. Two $100 million satellites are, between them, much less likely to fail than one $500 million satellite, and you don\u0027t have to go through years of lost revenue should the first fail.\u003C/p\u003E\n"},{"CreatedByName":"Kibble","CreatedById":131042,"CreatedDateTime":"2015-06-10T12:07:28Z","Content":"\n\u003Cp\u003ESatellites generally only cost a few dozen million dollars, unless they are probes designed specifically for one (usually science) mission.\u003C/p\u003E\n"},{"CreatedByName":"Iskierka","CreatedById":2116,"CreatedDateTime":"2015-06-10T12:25:46Z","Content":"\n\u003Cp\u003EA quick google will immediately reveal that is false - example, $290 million for a hurricane-tracking satellite. $390 million for something that can track missiles, for example, to give warning to people in the various civil war zones around the planet. \u0022Dozen million\u0022 might be the cost of a Soyuz-launched satellite, but hundreds of millions is normal, and not even high-end, for larger satellites with significant jobs. Notably, Soyuz-satellites would already be experiencing a number of the effects I\u0027m referring to, as Soyuz has relatively very low cost and very high flight rate and reliability, significantly reducing risk and allowing more to be taken.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-10T12:29:19Z\u0022 title=\u002206/10/2015 12:29  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 10, 2015\u003C/time\u003E by Iskierka\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2015-06-10T12:56:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Iskierka\u0022 data-cite=\u0022Iskierka\u0022\u003E\u003Cdiv\u003EAlso consider that the biggest reason space costs so much is because it is a high-risk venture. First, you need to trust that the LV won\u0027t fail during launch, and will deliver you to the required altitude, then that your circularisation will work, and then that your own satellite won\u0027t fail. Satellites cost hundreds of millions to billions of dollars because of this last point - any of these failures mean you don\u0027t have what you wanted in orbit, and you don\u0027t want it to be that your own satellite failed being what\u0027s losing you money. Plus, the next launch slot is years away, so even if you had a spare satellite, you might endure dozens of months of lost revenue.\u003Cp\u003EA rapidly reusably launch vehicle, however, drastically changes this landscape. Suddenly, the next launch slot isn\u0027t years away, it\u0027s weeks away even if they only get a small improvement in flight rate. With a big improvement, you might fail on Tuesday and be trying again on Thursday.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis only solves the launch slot issue, which is the slightest of a company\u0027s problems if they have just lost a multi-million dollar payload. You can\u0027t launch on thursday if you haven\u0027t rebuilt a satellite by then, and of course, if the launch cost is based on high flight rates, it\u0027s unlikely that a slot will be available in the manifest.\u003C/p\u003E\u003Cp\u003ELaunch services are only a small part of the operational cost of a satellite operator. The biggest costs are the satellite itself, the insurance, and the cost of operating the satellite (ground stations, personnel, services, etc...)\u003C/p\u003E\u003Cp\u003ELaunch vehicle technology doesn\u0027t change the fact that space hardware is expensive. It only reduces the cost of launch, which is like reducing the cost of packaging on your latest flatscreen TV. It\u0027s a nice bonus, but not a revolution that is going to bring down the prices of flatscreen TVs by a large amount.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThis allows companies to take a bigger risk on their satellites, dramatically cutting their cost.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo it doesn\u0027t. A bigger risk means a higher insurance cost.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EAnd a reusable SSTO such as Skylon is unrivalled in this situation - a failure at any point, including satellite activation, is not a permanent one, but one from which you simply re-attach the payload and fly back to base, to allow repairs to be made. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESkylon doesn\u0027t exist. We have no idea how it will operate if it ever does.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ETo have a catastrophic loss, Skylon would have to suffer either total hydraulics failure or a simultaneous quad-engine-failure, both of which are immensely improbable.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA single engine failure is enough for Skylon to have a catastrophic loss. So is a TPS failure, a structural failure, an RCS failure, a landing gear failure, an avionics failure, and so many other things that are extremely more likely on a vehicle with so many unproven technologies than on a rocket.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAny stage of this cost reduction from reusability also reduces cost of satellites, as above. Space is a very limited market because only people who are -absolutely sure- that their billions are worth it are willing to risk it. If you bring that down to hundreds of millions, then that dramatically increases the number of people who will consider risking the money, as there are always more potential uses of space, even if they\u0027re only some variant on Earth observation. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou fail to demonstrate why payload cost decreases with launch cost. The two are part of the total operational cost of a satellite (which also includes ground equipment, R\u0026amp;D, insurance, and operating the service over the years)\u003C/p\u003E\u003Cp\u003EThe only way for satellites to be cheaper is through economies of scale and standardization, which allow mass production and higher launch rates. Again, what would be the actual business applications for mass produced satellites that could sustain high launch rates over decades? How many Earth observation or comm sats does a company need?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EIn the end, even if a higher flight rate does not get utilised, the fact it exists dramatically reduces risk, and will in conjunction dramatically reduce the cost of satellites. Two $100 million satellites are, between them, much less likely to fail than one $500 million satellite, and you don\u0027t have to go through years of lost revenue should the first fail.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf a higher flight rate does not get utilized, then it\u0027s not a higher flight rate. Launch services are tailored for a market that exists. If you setup your launch service for a market that doesn\u0027t exist, then you are losing money.\u003C/p\u003E\u003Cp\u003EThere is no inherent reason for a higher flight rate to be safer than a lower one. If anything, it is the opposite. \u003C/p\u003E\u003Cp\u003EIf the reason that the satellite costs $500 million is because it\u0027s 5 times more reliable and hardened than a $100 million satellite, then operators will go for one reliable $500 million sat rather than two $100 million sats. Insurance companies will also offer better rates on the more reliable one than on the cheaper ones, which reduces your operational cost.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-10T13:01:56Z\u0022 title=\u002206/10/2015 01:01  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 10, 2015\u003C/time\u003E by Nibb31\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2015-06-10T13:14:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EThe only way for satellites to be cheaper is through economies of scale and standardization, which allow mass production and higher launch rates. Again, what would be the actual business applications for mass produced satellites that could sustain high launch rates over decades? How many Earth observation or comm sats does a company need?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EElon\u0027s 4,000-satellite \u0022Internet in the sky\u0022 would fit the bill, for one. Seems to be an ingenious way to attack the chicken and egg problem, try to get rich out of creating both at the same time.\u003C/p\u003E\u003Cp\u003EFuel depot architectures instead of spending government money on heavier launchers would also feed that money into lowering launch costs adding to the virtuous circle, the upmass is cheap, and the demand for a sustained manned exploration program would be a lot of mass in LEO.\u003C/p\u003E\u003Cp\u003EIn any case, maybe you can address the post I specifically directed to you in this very page? It\u0027s kind of related, too, and I\u0027d like your input given your sceptical position on the matter. And yes, I know, they are all potentials. Otherwise we wouldn\u0027t be talking about increased flight rates and RLVs, they would already be there.\u003C/p\u003E\u003Cp\u003ERune. This \u0022space thing\u0022 is quite new, after all.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2015-06-10T13:17:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Albert VDS\u0022 data-cite=\u0022Albert VDS\u0022\u003E\u003Cdiv\u003EIf it\u0027s only a few orbits around the world then yes, it\u0027s just a joyride. You need something which longer duration than that, to decrease the price per hour.\u003Cp\u003ESomething like an orbital hotel could work. It would require maintenance and what not, but a week in space for would still be cheaper than a few hours. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, but the average Kardashian will get bored after two hours gazing out a porthole, having ... in zero-g and drinking champaign from a straw. Your orbital hotel will have to be something epic to keep them busy, but that\u0027s not going to be cheap. The economics simply don\u0027t work out.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EVR would never replace something like being in space, unless it becomes something like Star Trek\u0027s Holodeck.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E20 or 30 years from now, I think that are more likely to see advances in realistic VR than we are to overcome the tyranny of the rocket equation. It will be easier to relive Apollo 11 in VR or to send telepresence robots to Mars than to put space hotels in orbit.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThe first settlers wont have comfort, total safety or direct better prospect for themselves, but that\u0027s something which increases when a settlement grows and advances in technology.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo why would they go? It\u0027s a hell of a risk to sell your house and take the wife and kids to live on Mars knowing that if your hab module springs a leak, if your generator breaks down, or if the dust gets in your food, you die. The settlement only grows if people are attracted to migrate, and that can only happen if they can hope for a better life there than on Earth.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ECommercial exploration could be a thing if the cost of it is set lower and if there is return.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf there is a return, it\u0027s not exploration, it\u0027s exploitation.\u003C/p\u003E\u003Cp\u003ETourism, see above. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ESettlement might not be in our direct future, but it\u0027s closer than having VR as an equal experience as the real thing.\u003C/p\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2015-06-10T13:33:50Z","Content":"\n\u003Cp\u003EI have just found out that my crappy internet connection ate one of my posts as I left home this morning. Luckily, Firefox is a champ and remembers everything. So, for the sake of continuity of discourse, I\u0027ll put this here, you can guess it comes before my last two comments:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EWhat you need is new applications for spaceflight that make sense economically. Unfortunately, none of the futuristic ones (space manufacturing, asteroid mining, orbital tourism, etc...) are viable or propose an attractive business model, even with cheaper launches.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWow that\u0027s a hasty conclusion. \u003Cem\u003EAll\u003C/em\u003E of them, no matter what the cost of he rocket is? Because SSP is not that far off from terrestrial-based solar power in terms of Kwh cost... in the studies done assuming current costs to orbit and current solar panel efficiencies and lifetimes.\u003C/p\u003E\u003Cp\u003ERune. The fact that no one has closed the business case yet doesn\u0027t mean nobody will, ever.\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2015-06-10T13:36:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rune\u0022 data-cite=\u0022Rune\u0022\u003E\u003Cdiv\u003EElon\u0027s 4,000-satellite \u0022Internet in the sky\u0022 would fit the bill, for one. Seems to be an ingenious way to attack the chicken and egg problem, try to get rich out of creating both at the same time.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E Bear in mind all of those are microsats-somewhere in the 100-500kg range. It\u0027ll get you a year or two of sustained demand to build the constellation, but after that you\u0027re about back where you started-at least with a vehicle like Falcon 9R. Replacing or upgrading sats in such a constellation could provide sustained demand for a small RLV, and that\u0027s where I see such technology gaining a foothold if it ever does.\u003C/p\u003E\n"},{"CreatedByName":"Albert VDS","CreatedById":74055,"CreatedDateTime":"2015-06-10T13:39:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EYeah, but the average Kardashian will get bored after two hours gazing out a porthole, having ... in zero-g and drinking champaign from a straw. Your orbital hotel will have to be something epic to keep them busy, but that\u0027s not going to be cheap. The economics simply don\u0027t work out.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECome on Nibb, be more creative than \u0022looking out a porthole\u0022. How about stargazing, zero-g massages, other activities which utilize zero-g, or anything that makes it luxurious.\u003C/p\u003E\u003Cp\u003EThat\u0027s only a few things I came up with in a minute, there\u0027s bound to be more things to do in orbit which you can\u0027t on the ground.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E20 or 30 years from now, I think that are more likely to see advances in realistic VR than we are to overcome the tyranny of the rocket equation. It will be easier to relive Apollo 11 in VR or to send telepresence robots to Mars than to put space hotels in orbit.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPutting VR goggles on doesn\u0027t make you feel difference in gravity and just watching LCD screens.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ESo why would they go? It\u0027s a hell of a risk to sell your house and take the wife and kids to live on Mars knowing that if your hab module springs a leak, if your generator breaks down, or if the dust gets in your food, you die. The settlement only grows if people are attracted to migrate, and that can only happen if they can hope for a better life there than on Earth.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESending existing families families to Mars in the first decade(s) isn\u0027t a good idea to begin with. It should start with people who build up the settlement, make it into a sustaining community.\u003C/p\u003E\u003Cp\u003EAt that point you start to create on planet building of habs, rovers and anything else to make life easier. After that you can expand and introduce families.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EIf there is a return, it\u0027s not exploration, it\u0027s exploitation.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExactly, which is a good way to make money.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2015-06-10T13:56:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Albert VDS\u0022 data-cite=\u0022Albert VDS\u0022\u003E\u003Cdiv\u003ECome on Nibb, be more creative than \u0022looking out a porthole\u0022. How about stargazing, zero-g massages, other activities which utilize zero-g, or anything that makes it luxurious.\u003Cp\u003EThat\u0027s only a few things I came up with in a minute, there\u0027s bound to be more things to do in orbit which you can\u0027t on the ground.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESure, but we\u0027re talking about a huge investment of which launch costs will only be a tiny part; and it\u0027s still going to be a niche for a small amount of ÃƒÂ¼ber-rich, not for the masses. Most people will still prefer to spend their week on a cruise ship or in a luxury resort on Earth for a fraction of the price. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EPutting VR goggles on doesn\u0027t make you feel difference in gravity and just watching LCD screens.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat about VR goggles in a Zero-G Airbus? Drug-induced auto-suggestion? Neuronal connections? Seriously, we have no idea what kind of VR tech will be around in 20 or 30 years. For all we know, we might be living underground in Matrix-style vats by then, and space exploration will be the least of our worries.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ESending existing families families to Mars in the first decade(s) isn\u0027t a good idea to begin with. It should start with people who build up the settlement, make it into a sustaining community.\u003C/p\u003E\u003Cp\u003EAt that point you start to create on planet building of habs, rovers and anything else to make life easier. After that you can expand and introduce families.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAgain, a massive investment, with or without reusable rockets. And with no identifiable return on investment, it\u0027s simply not gonna happen.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EExactly, which is a good way to make money.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAgreed. All we need is to figure out a way to make money.\u003C/p\u003E\u003Cp\u003EMy suggestion: Maybe one day we\u0027ll figure out a viable use for all the stuff we\u0027ve done to explore space. Until then, let\u0027s just keep on exploring and doing science in order to advance technology and our knowledge of the universe. There is no rush.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-10T13:59:50Z\u0022 title=\u002206/10/2015 01:59  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 10, 2015\u003C/time\u003E by Nibb31\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Iskierka","CreatedById":2116,"CreatedDateTime":"2015-06-10T14:28:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EThis only solves the launch slot issue, which is the slightest of a company\u0027s problems if they have just lost a multi-million dollar payload. You can\u0027t launch on thursday if you haven\u0027t rebuilt a satellite by then, and of course, if the launch cost is based on high flight rates, it\u0027s unlikely that a slot will be available in the manifest.\u003Cp\u003ELaunch services are only a small part of the operational cost of a satellite operator. The biggest costs are the satellite itself, the insurance, and the cost of operating the satellite (ground stations, personnel, services, etc...)\u003C/p\u003E\u003Cp\u003ELaunch vehicle technology doesn\u0027t change the fact that space hardware is expensive. It only reduces the cost of launch, which is like reducing the cost of packaging on your latest flatscreen TV. It\u0027s a nice bonus, but not a revolution that is going to bring down the prices of flatscreen TVs by a large amount.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs mentioned later in the post - instead of building just one $500 million satellite that you lose, build two for $200 million. This makes the satellite itself cheaper, and eliminates most insurance cost - as the insurance would be paying out for lost revenue and replacing the satellite, the former of which is drastically reduced, and the second of which is non-existent, though will re-emerge at much lower value if the second has to be launched.\u003C/p\u003E\u003Cp\u003EAlso, your packaging argument is poor. Even if demand was raised, manufacturing significantly more rockets than currently are would be very difficult. Flatscreen TV production is not limited by your ability to produce cardboard boxes, nor their odds of exploding in-transit. Airlines, as much as you try ignore it, are a much more apt comparison - people, like satellites, are very expensive things to lose, much more so than the vehicle carrying them. Aircraft have many of the same expectations of reliability as rockets - arguably even more so, as a lost passenger is genuinely irreplaceable, and comparable value to a small satellite.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ENo it doesn\u0027t. A bigger risk means a higher insurance cost.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis isn\u0027t a one-way street - dramatically cut down insurance cost, and bigger risks are taken as a failure can be financially endured. I\u0027m talking about precisely the reverse effect, where a smaller insurance, launch, and satellite cost means bigger risks are allowable, which in turn means that satellite costs are cut down further.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EA single engine failure is enough for Skylon to have a catastrophic loss. So is a TPS failure, a structural failure, an RCS failure, a landing gear failure, an avionics failure, and so many other things that are extremely more likely on a vehicle with so many unproven technologies than on a rocket.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECite where an airliner has been taken out by one engine failing, as its dominant flight mode is aerodynamic and thus has the same capabilities? TPS failure is not a launch concern, so would only affect payloads that have already failed in another way, structural is no more likely than any other vehicle, RCS failure is a risk for rockets also and very rare, airliner landing gear is already fail-safe, avionics is reliable, and you\u0027re not specifying anything with high chance of failure. It contains precisely one unproven technology, the engine, which will be proven in ground tests long before a vehicle is ready. As a result, none of these failures are any more likely for a vehicle such as Skylon, which also has more fallback capability, as it is designed to be the first LV with sensible RTLS capability. And given the number of failures that are directly as a result of staging, either by mechanism failure or by one of the multitude of required engines failing, I\u0027d more trust a vehicle that has only 4 rocket motors and one OMS to check over, than any staged vehicle.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EYou fail to demonstrate why payload cost decreases with launch cost. The two are part of the total operational cost of a satellite (which also includes ground equipment, R\u0026amp;D, insurance, and operating the service over the years)\u003C/p\u003E\u003Cp\u003EThe only way for satellites to be cheaper is through economies of scale and standardization, which allow mass production and higher launch rates. Again, what would be the actual business applications for mass produced satellites that could sustain high launch rates over decades? How many Earth observation or comm sats does a company need?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have, as reduced launch cost and more reliability, or ability to be re-launched when reliability fails, allows satellites to be manufactured to lower standards (the high cost is because of the sheer level of quality required, not that the tech is inherently expensive at any quality). Scaled economies and standardisation are not required, though would help - if you read up, another post cited a very clear option for one kind of satellite that would benefit these, though yes, most satellites are specialised enough to not.\u003C/p\u003E\u003Cp\u003EAs for how many are needed - more than current, else the launch slots would not be booked up for at least half a decade. If launch costs were lower, then also more options could be considered, such as using lower altitudes for comms, and thus getting less latency. For this, you need greater coverage, which means more launches. Currently such a market is limited by how many it is sensible/affordable to launch, not what provides the best service.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EIf a higher flight rate does not get utilized, then it\u0027s not a higher flight rate. Launch services are tailored for a market that exists. If you setup your launch service for a market that doesn\u0027t exist, then you are losing money.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELost sale fallacy that we see in piracy arguments so often - if you set up your launch service by dramatically over-specifying and delivering far more LVs than are interesting, sure. Having one LV that achieves 70-80% utilisation is not lost money, however - it will not incur significantly higher maintenance costs by sitting around for a week after each launch. Could earn more money, is not equivalent to losing money, so long as profits are coming in. And having sub-100% utilisation on a reusable vehicle allows, as said, for quick-inserts such as replacement launches when a spare satellite was on hand, or for a payload that was with another service to transfer over should a failure occur and their launch be cancelled. It is a poor way for disposable rockets to operate, as you\u0027re literally making more of a thing than you need, but making one of a thing that can do more than it needs to is not inherently flawed. Airliners are almost always at sub-50% utilisation, yet airlines are functional as a very low-margin business - if it didn\u0027t work profitably, they\u0027re the last business that would be allowing it.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThere is no inherent reason for a higher flight rate to be safer than a lower one. If anything, it is the opposite. \u003C/p\u003E\u003Cp\u003EIf the reason that the satellite costs $500 million is because it\u0027s 5 times more reliable and hardened than a $100 million satellite, then operators will go for one reliable $500 million sat rather than two $100 million sats. Insurance companies will also offer better rates on the more reliable one than on the cheaper ones, which reduces your operational cost.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDepends on mode of operation. The previous flight proves the components on the vehicle work - so long as high-wear components are checked and verified, then low-wear components are not a risk, and this previously-used vehicle is therefore more reliable than a twice-tested-now-launch component seen on a disposable rocket. SpaceX certainly realise this would be the case, allowing them to repeatedly recycle engines, and then dispose of older ones on the upper stage. And this mode certainly works for aircraft, which have a much higher safety requirement than rockets.\u003C/p\u003E\u003Cp\u003EAgain, only reason to go for the $500 million sat is because you only have one shot at the launch. If you can relaunch soon in the case of failure, then making two for less is a better option. And insurance cost will be dramatically less for two $100mil sats, as the insurance doesn\u0027t actually have to pay out any significant money in case of failure, as you already have your spare and aren\u0027t losing revenue. Insurance will only have significant cost if the first fails and they then have to fund the second - and the second launch is going to be more reliable for little extra cost, as the failed components can be checked and verified more thoroughly.\u003C/p\u003E\n"}]}