{"TopicId":112311,"ForumId":44,"TopicTitle":"[Philosophy] Value","CreatedByName":"Xannari Ferrows","CreatedById":125369,"CreatedDateTime":"2015-06-07T22:08:26Z","PageNum":1,"Articles":[{"CreatedByName":"Xannari Ferrows","CreatedById":125369,"CreatedDateTime":"2015-06-07T22:08:26Z","Content":"\n\u003Cp\u003ESo I\u0027ve been selling Alumunium ingots for a while now, with the price at 209 Tynes per Kilogram. That should convert to $1.74 USD.\u003C/p\u003E\u003Cp\u003EI myself have used a few for building small trinkets every now and then, but along the road, I decided to build a makeshift Arc furnace that could melt gold. Since I had some, I decided to use carbon rods from 2 large batteries as electrodes. It worked well, and now my supply is gone. I sold the resulting gold ingots for only 60 Tynes per Kilogram, but after the fact, I decided to look up how they typically sell. Yeah...\u003C/p\u003E\u003Cp\u003EApparently, I could have sold them for 1165870 Tynes per Kilogram on average, but that makes no sense to me, even now. Gold is not strong, therefore not useful for building. It is not common, but rare, so there is no use in even trying to find enough of it to build anything.\u003C/p\u003E\u003Cp\u003EEven if you aren\u0027t looking to build something, it is still next to useless. It is difficult to atomically react with, for example.\u003C/p\u003E\u003Cp\u003E So, why is it valued so high?\u003C/p\u003E\u003Cp\u003EFor that matter, why is anything valued high? Or at all, ultimately? Why invest so much money into something that you can\u0027t do anything with? It is dense, static, soft, and just uninteresting. I value even plastic higher than gold. At least it will keep my sandwich from the harmful atmosphere.\u003C/p\u003E\u003Cp\u003EHow is value defined? Why are abundant, versatile, light, and durable objects valued so low? I have a supply of the perfect example of this: Biosteel.\u003C/p\u003E\u003Cp\u003EUnbelievably strong, lightweight, flexible, and thermal tolerant. It is the perfect material for my organic electrodynamic fluid compound [a fancy way of saying my home power generator].\u003C/p\u003E\u003Cp\u003EBut the question is; why was it practically dirt cheap? Why are other metals, heavier, softer, less malleable, and more static valued more than ones that are useful?\u003C/p\u003E\u003Cp\u003ENow I ask you: How do you define value? What do you see in things that make them worth something to you?\u003C/p\u003E\n"},{"CreatedByName":"SargeRho","CreatedById":25468,"CreatedDateTime":"2015-06-07T22:13:35Z","Content":"\n\u003Cp\u003EValue is based on how rare something is compared to the demand for it. We like shiny things, but gold isn\u0027t exactly the most common element, and it doesn\u0027t tarnish, that\u0027s why it\u0027s expensive. There are ways to \u0022abuse\u0022 that however. A prime example are Diamonds. Diamonds are not at all rare, their rarity is artificially created.\u003C/p\u003E\u003Cp\u003EValue is also based on how hard something is to create. Titanium is so common that we used it as white pigment to paint walls with in the form of Titanium Dioxide. But it\u0027s very hard to machine, requiring special tools. It\u0027s also very hard to actually produce in its elemental form, which makes it expensive as well.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-07T22:15:45Z\u0022 title=\u002206/07/2015 10:15  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 7, 2015\u003C/time\u003E by SargeRho\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2015-06-07T22:16:21Z","Content":"\n\u003Cp\u003EDon\u0027t knock the value of gold too much. It\u0027s used in a lot of electronics and doesn\u0027t just exist as a \u0022pretty thing.\u0022 It\u0027s not as important as silicon, but there\u0027s enough of it in computers that some folks have been known to melt down broken machines to extract and resell it.\u003C/p\u003E\u003Cp\u003EBut yeah, generally, rarity has the most influence on price. \u0022Durability\u0022 and \u0022how it is utilized\u0022 both impact rarity, because the more it is needed, the more rare it is likely to be. There are exceptions to this, such as water. It\u0027s in high demand since we all need it, but our planet has a bajillion tons of it. Even so, the threat of a global water shortage isn\u0027t outside the realm of possibility. Expect the price of water to skyrocket when that happens.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-07T22:20:25Z\u0022 title=\u002206/07/2015 10:20  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 7, 2015\u003C/time\u003E by vger\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Xannari Ferrows","CreatedById":125369,"CreatedDateTime":"2015-06-07T22:19:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022vger\u0022 data-cite=\u0022vger\u0022\u003E\u003Cdiv\u003EDon\u0027t knock the value of gold too much. It\u0027s used in a lot of electronics and doesn\u0027t just exist as a \u0022pretty thing.\u0022 It\u0027s not as important as silicon, but there\u0027s enough of it in computers that some folks have been known to melt down broken machines to extract and resell it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere is? I\u0027ve never used nor seen gold in any electronics before. That\u0027s not to say it\u0027s because I built them myself, but no one I know either. Is that actually true?\u003C/p\u003E\u003Cp\u003EEDIT: It is! ...Well, not a lot, but enough to nab a few hundred Tynes.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-07T22:23:02Z\u0022 title=\u002206/07/2015 10:23  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 7, 2015\u003C/time\u003E by Xannari Ferrows\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2015-06-07T22:21:22Z","Content":"\n\u003Ca href=\u0022http://www.instructables.com/id/Gold-recovery/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.instructables.com/id/Gold-recovery/\u003C/a\u003E\n"},{"CreatedByName":"SargeRho","CreatedById":25468,"CreatedDateTime":"2015-06-07T22:22:50Z","Content":"\n\u003Cp\u003EYes, Gold is often used to plate contacts in computers. For example, for RAM modules and graphics cards, also for the pins of CPUs and CPU Sockets.\u003C/p\u003E\n"},{"CreatedByName":"mardlamock","CreatedById":38972,"CreatedDateTime":"2015-06-07T22:43:19Z","Content":"\n\u003Cp\u003EYou guys need some Subjective theory of value here. \u003Ca href=\u0022https://en.wikipedia.org/wiki/Subjective_theory_of_value\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Subjective_theory_of_value\u003C/a\u003E.\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2015-06-07T22:50:21Z","Content":"\n\u003Cp\u003EThe value of an item is what somebody is willing to pay for it, simple as that. Rarity and utility factor into that somewhat, but demand can come from completely abstract (and potentially bs) factors like \u0027intrinsic value\u0027 or \u0027collectibility\u0027. I\u0027ve done some work in the antique toys business, and I\u0027ve encountered plenty of items that are in good condition, have good build quality, are quite rare and are \u003Cem\u003Eliterally worthless\u003C/em\u003E because nobody collects them. If we get stuff like that in an auction lot, it either goes to a charity shop or is left at a car boot sale with a sign saying \u0027take me\u0027.\u003C/p\u003E\n"},{"CreatedByName":"Xannari Ferrows","CreatedById":125369,"CreatedDateTime":"2015-06-07T23:00:11Z","Content":"\n\u003Cp\u003EI never really purchase anything cosmetic, but when I do get anything decorative, I don\u0027t buy it. I don\u0027t pay someone for the item, but for the work they put into making it, and I say it\u0027s worth more if they made it in full spirit.\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2015-06-08T00:48:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Xannari Ferrows\u0022 data-cite=\u0022Xannari Ferrows\u0022\u003E\u003Cdiv\u003EThere is? I\u0027ve never used nor seen gold in any electronics before. That\u0027s not to say it\u0027s because I built them myself, but no one I know either. Is that actually true?\u003Cp\u003EEDIT: It is! ...Well, not a lot, but enough to nab a few hundred Tynes.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ei think the thing they recover is actually silver. most of the actual gold is really just a thin plating on contacts to keep them from corroding. but some solders have as much as 15% silver by weight. there is also copper as well which is probibly also valuable and is most of the weight. the good news is all the heavy stuff is the valuable stuff. you could mechanically shred the boards, stick the shreds into a vacuum furnace (microwave heating) and accumulate the metals in a mold at the base, extract the ingots and sent them to a metal refinery to separate the valuable metals. the bad news is you can do the same thing with an old oil drum and some coal and a 3rd world workforce.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-08T00:51:53Z\u0022 title=\u002206/08/2015 12:51  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 8, 2015\u003C/time\u003E by Nuke\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"LordFerret","CreatedById":111598,"CreatedDateTime":"2015-06-08T01:08:51Z","Content":"\n\u003Cp\u003EWhat manner of currency are \u0027Tynes\u0027?\u003C/p\u003E\n"},{"CreatedByName":"Shpaget","CreatedById":45577,"CreatedDateTime":"2015-06-08T05:59:44Z","Content":"\n\u003Cp\u003EMost definitely usability.\u003C/p\u003E\u003Cp\u003EOne of my pet peeves is a pen that doesn\u0027t work properly, or needs substantial effort to make it start writing. I am willing to spend 5 or 10 times more than regular pens cost on a pen I know works from the moment you take it in your hand.\u003C/p\u003E\u003Cp\u003EThose promo pens that companies give away are usually unusable for my taste.\u003C/p\u003E\u003Cp\u003EThat being said, another example was a wooden box I made recently. After assuring its usability I tried to make it as pretty as possible. However, prettification shall not interfere with functionality.\u003C/p\u003E\u003Cp\u003EI don\u0027t wear jewelry and don\u0027t want stuff just because they are rare.\u003C/p\u003E\u003Cp\u003EAs an exception to this little rule of mine and one of the items I do very much wish I had is the mechanical calculator Curta. It is quite expensive, due to relative rarity, and is absolutely beautiful machine. In these modern times where you can buy a more powerful digital calculator for less than a McDonalds meal, spending $1000\u002B seems rather stupid, but I am fascinated by the mechanical engineering of the little thing. I most definitely do not need that calculator and the value I put on it is very low compared to price.\u003C/p\u003E\u003Cp\u003EContrasting this low value / high price situation is the oscilloscope I bought which I consider to be high value / (relatively) low price (the low price must be the result of the oscilloscope not looking nearly as beautiful as the Curta:sticktongue:).\u003C/p\u003E\n"},{"CreatedByName":"dharak1","CreatedById":61137,"CreatedDateTime":"2015-06-08T06:32:37Z","Content":"\n\u003Cp\u003EWait you sold a kilo of gold for 50 cents?\u003C/p\u003E\n"},{"CreatedByName":"Xannari Ferrows","CreatedById":125369,"CreatedDateTime":"2015-06-08T06:49:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022dharak1\u0022 data-cite=\u0022dharak1\u0022\u003E\u003Cdiv\u003EWait you sold a kilo of gold for 50 cents?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf that\u0027s what you call it, I guess I did. It\u0027s not worth much to me, and now my supply is gone. This MacGuyver style Arc furnace really does the trick.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Shpaget\u0022 data-cite=\u0022Shpaget\u0022\u003E\u003Cdiv\u003EAs an exception to this little rule of mine and one of the items I do very much wish I had is the mechanical calculator Curta. It is quite expensive, due to relative rarity, and is absolutely beautiful machine. In these modern times where you can buy a more powerful digital calculator for less than a McDonalds meal, spending $1000\u002B seems rather stupid, but I am fascinated by the mechanical engineering of the little thing.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe technologies are not as strong, but engineered with far more sophistication for their time than they are now. I hear ya. \u003C/p\u003E\u003Cp\u003EI remember seeing an analogue console at an old Battleship once. I believe it was the USS North Carolina, I can\u0027t remember. That thing was absolutely beautiful... I still want one, but I have nowhere near the Tynes to purchase it.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2015-06-08T07:45:51Z","Content":"\n\u003Cp\u003EWhat is a Tyne ?\u003C/p\u003E\n"},{"CreatedByName":"Xannari Ferrows","CreatedById":125369,"CreatedDateTime":"2015-06-08T08:05:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EWhat is a Tyne ?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s an arbitrary label I use for something that has value. It is represented as a token, the smallest being 1.2 Tynes, and the largest being 5290. Sometimes I use coins from what I receive as payment to make them.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-08T08:08:19Z\u0022 title=\u002206/08/2015 08:08  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 8, 2015\u003C/time\u003E by Xannari Ferrows\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"randomness5555","CreatedById":53367,"CreatedDateTime":"2015-06-08T08:33:59Z","Content":"\n\u003Cp\u003EFor value, technically the most valuable things are probably food, water, heat, light and good company. After all, gold is no use when you\u0027re dying of de-hydration in a desert somewhere. But they\u0027re so easy to obtain nowadays that they\u0027ve lost the value they hold in other poorer countries, and more complex things that at first don\u0027t seem inherently valuable become more so because people want different things.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-08T08:36:15Z\u0022 title=\u002206/08/2015 08:36  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 8, 2015\u003C/time\u003E by randomness5555\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Lukaszenko","CreatedById":95776,"CreatedDateTime":"2015-06-08T08:47:37Z","Content":"\n\u003Cp\u003EAs has been mentioned, it all comes down to how much somebody will pay for it. That\u0027s what it\u0027s worth. YOU might not care about gold, I don\u0027t much either, but many people do. Maybe it\u0027s for stupid reasons or maybe it\u0027s not, but it doesn\u0027t change the fact that enough people want it and are willing to pay for it, and there\u0027s not much of it. And that\u0027s why it\u0027s expensive. Again, the reasons WHY they want it are beside the point. People like the bling. People like rarity. People like status symbols. Marketing takes advantage of these and more to further add value. \u003C/p\u003E\u003Cp\u003EDon\u0027t underestimate the value people place on looking good (or rich). Again, you might not give two ....s, but with 7 billion people, somebody does. And if that somebody has money, well, sometimes all it takes is one. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://9gauravganatra.files.wordpress.com/2014/04/au-79-gold-lamborghini-aventador.jpg\u0022 alt=\u0022au-79-gold-lamborghini-aventador.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"YNM","CreatedById":98447,"CreatedDateTime":"2015-06-08T09:28:42Z","Content":"\n\u003Cp\u003EValue is arbitrary. Think of land spaces: they mostly costs you for maintenance yet they sold very high. An equal area for a patch of land in the middle of a city and in the outskirt will be valued differently - while in fact, physically, they\u0027re both the same. \u003C/p\u003E\u003Cp\u003ESafe to say, value isn\u0027t just what seen, value is also about what you can do with it, and how many needs it. A patch of land in the middle of a city would have many buyers ; if we built something on it it\u0027s mostly more profitable and attractive (houses, apartments, flats, shops). While a larger land outside might costs the same to buy, but there\u0027s not much need for it.\u003C/p\u003E\u003Cp\u003EValue is arbitrary and depends on the people - if you need it, value it higher than anybody else.\u003C/p\u003E\n"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-06-08T09:41:02Z","Content":"\n\u003Cp\u003ERelevant video: \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/XNu5ppFZbHo?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"Xannari Ferrows","CreatedById":125369,"CreatedDateTime":"2015-06-08T10:08:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022YNM\u0022 data-cite=\u0022YNM\u0022\u003E\u003Cdiv\u003EValue is arbitrary and depends on the people - if you need it, value it higher than anybody else.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf it is needed, it does not cost anything. Every basic biological need can be obtained for free, if just with hard work. I also despise those that increase the value of anything in high demand, to make a note of.\u003C/p\u003E\n"},{"CreatedByName":"YNM","CreatedById":98447,"CreatedDateTime":"2015-06-08T10:23:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022YNM\u0022 data-cite=\u0022YNM\u0022\u003E\u003Cdiv\u003EValue is arbitrary and depends on the people - if you need it, value it higher than anybody else.\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Xannari Ferrows\u0022 data-cite=\u0022Xannari Ferrows\u0022\u003E\u003Cdiv\u003EIf it is needed, it does not cost anything. Every basic biological need can be obtained for free, if just with hard work. I also despise those that increase the value of anything in high demand, to make a note of.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah ! That\u0027s the point. Hard work. If you need more, work harder. Work is cost, you know (makes you tired for one, many others). In the past, it was direct. Today, it\u0027s indirect by the presence of a currency.\u003C/p\u003E\u003Cp\u003EAnd raised values in high demand - why do you blame the seller ? People still buys them, that means they value it as much as the seller values it. Next time, just stop buying things when prices rise, they\u0027ll fall off due to lack of sales. Problem solved.\u003C/p\u003E\n"},{"CreatedByName":"Xannari Ferrows","CreatedById":125369,"CreatedDateTime":"2015-06-08T10:41:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022YNM\u0022 data-cite=\u0022YNM\u0022\u003E\u003Cdiv\u003EAnd raised values in high demand - why do you blame the seller ? People still buys them, that means they value it as much as the seller values it. Next time, just stop buying things when prices rise, they\u0027ll fall off due to lack of sales. Problem solved.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt is an exploit. Increasing the price of something by the same amount, in small increments at a time, makes it so that it goes up in smaller and smaller fractions each time, making people believe that it is only a small increase, and still worth the buy. It\u0027s just another way to pull money from people because of greed.\u003C/p\u003E\n"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-06-08T10:42:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022YNM\u0022 data-cite=\u0022YNM\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAnd raised values in high demand - why do you blame the seller ? People still buys them, that means they value it as much as the seller values it. Next time, just stop buying things when prices rise, they\u0027ll fall off due to lack of sales. Problem solved.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnother relevant video:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/I5ZR0jMlxX0?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"78stonewobble","CreatedById":97559,"CreatedDateTime":"2015-06-08T11:26:52Z","Content":"\n\u003Cp\u003EAll of the options and more... o.O \u003C/p\u003E\u003Cp\u003EWhich presumably explains supply and demant pretty well.\u003C/p\u003E\n"}]}