{"TopicId":112316,"ForumId":51,"TopicTitle":"The little Speeder - atmospheric entry in a seat.","CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-06-07T23:01:57Z","PageNum":1,"Articles":[{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-06-07T23:01:57Z","Content":"So, I thought of a rover for Gergar Kerman, my poor Engineer stuck mining fuel on Minmus. Something fun and with a business excuse, \u0022prospect more ore-rich places\u0022. I sought some rover projects, but they were slow, prone to tip over, and not much fun all around. And with Minmus gravity, they make little sense. The idea struck: let\u0027s make a lightweight craft for traveling the moon. Something small, lean and mean.\n\nFor a long while I looked at the set of parts for something lean and mean, until I spotted the Aerobrakes. These would make cool sides. OKTO2 for the core component, two infamous XM-G50 Radial Air Intakes for a landing gear (80m/s crash tolerance), then all the goodies and essentials. Two Oscar fuel tanks and Spark to give it some good kick, RCS through a bunch of \u0022place-anywhere\u0022 ports (plus a small monopropellant tank), a docking port, a headlight, two solar batteries tucked under the \u0022wings\u0022, and finally a Surface Scanning Module so that it could be used for actual prospecting.\n\nThen tests began. Good 150m/s groundspeed on Kerbin.\n\nSpeeder boat. Hardly, only 26m/s, but still waterborne just fine.\n\n![qkl89bm.jpg](http://i.imgur.com/qkl89bm.jpg)\n\nTime for docking tests. Need to take one and a docking port into orbit... One? Why not three? Tricoupler for the win!\n\nFirst round proved that RCS thrusters can\u0027t be placed squat in the middle of the docking port. Time for second round with necessary corrections...\n\n![Q1cUCQL.jpg](http://i.imgur.com/Q1cUCQL.jpg)\n\nThen I got the idea... would my Engineer be able to return to Kerbin in that thingy? It has more than enough dV for escaping Minmus and probably can escape at an angle good enough to catch the edge of Kerbin atmosphere; several orbits of aerobraking will bring it into LKO. But what about reentry?\n\nThat\u0027s when the idea was born. Dockable heatshields.\n\n![eaa5swS.jpg](http://i.imgur.com/eaa5swS.jpg)\n\nLet us not mention the fate of the third crew member, who drew the short straw and tried the small heat shield. Still, two with the big ones..\n\nThe first of the two survived - barely. He ran out of battery before entering the atmosphere, so no reaction wheel to keep the shield and braking... Did I mention the whole thing was built around two big aerobrakes? Well, they work, but they need stabilizing. First using RCS, then as propellant ran out, switching the main engine from time to time, using its swivel for stabilization. (it still couldn\u0027t overcome the strength of aerobraking.) I was a little too excited to take screenshots; this one is when I knew he was safe. \n\n![hSTwtfY.jpg](http://i.imgur.com/hSTwtfY.jpg)\n\nWell, now for a very good entry.\n\nFirst, let\u0027s not run out of the batteries.\n\n![YJtYmXS.jpg](http://i.imgur.com/YJtYmXS.jpg)\n\nThe idea for the trajectory is to start the aerobrakes after periapsis located some 55000km above Kerbin. That way we have a plenty of time to lose the horizontal speed while still rising instead of dropping down into thick atmosphere at full orbital speed.\n\nAnd the only hitch of the plan: forgot to switch SAS and the headlight off, so the batteries were almost drained near the periapsis again. And since the Sun was directly \u0022prograde\u0022, I had to swing a little to give the panels light under the aerobrakes.\n\n![PS0oBrO.jpg](http://i.imgur.com/PS0oBrO.jpg)\n\n...and this resulted in some small burns.\n\n![UNVtqiP.jpg](http://i.imgur.com/UNVtqiP.jpg)\n\nI decided to leave the panels extended for as long as they would last... they lasted quite a while.\n\nThe orbit rose back into sixties and aerobraking became quite weak. Time to burn off all that remaining fuel. First, that is some more delta-V than from aerobraking there, and then, less mass to slow down.\n\n![Ihfsmwd.jpg](http://i.imgur.com/Ihfsmwd.jpg)\n\nAfter the burn, 59km and 1900m/s. That\u0027s not an orbital speed anymore. Well, at that point any other craft begins falling increasingly fast, to reach some 30km altitude with speed in excess of 2000m/s and go into flames. Not us. Aerobrakes deployed, prograde direction set in SAS. \n\n![2piCCBB.jpg](http://i.imgur.com/2piCCBB.jpg)\n\n42km. At this altitude most crafts start showing flames. But 1700m/s is not enough at this air density. It would be at 30km, but we\u0027re still far from there.\n\n![0daeZ4S.jpg](http://i.imgur.com/0daeZ4S.jpg)\n\n24km. This is usually the area where the craft slows below 1000m/s and the flames go out. And I didn\u0027t even lose the solar panels! 400m/s before the final descent!\n\n![qvfPuNw.jpg](http://i.imgur.com/qvfPuNw.jpg)\n\nSo THIS is when I lose the solar panels? At mere 200m/s? I could have deployed the parachute already and they\u0027d be saved!\n\n![NJEs3th.jpg](http://i.imgur.com/NJEs3th.jpg)\n\nWell, let\u0027s deploy it. It\u0027s way early but better safe than sorry. And, well, one more dead weight to get rid of.\n\n![vvjA2p9.jpg](http://i.imgur.com/vvjA2p9.jpg)\n\n![kr3C0b4.jpg](http://i.imgur.com/kr3C0b4.jpg)\n\nOnly now I realized why my battery was running out so fast.\n\n![D4r08uX.jpg](http://i.imgur.com/D4r08uX.jpg)\n\nAaand - happy landing!![MY3x00c.jpg](http://i.imgur.com/MY3x00c.jpg)\n\nThat thing is really fun to drive!\n\n![BNjxieF.jpg](http://i.imgur.com/BNjxieF.jpg)\n\n...and mean-looking!![AsADRrx.jpg](http://i.imgur.com/AsADRrx.jpg)"},{"CreatedByName":"waterlubber","CreatedById":119333,"CreatedDateTime":"2015-06-08T00:31:46Z","Content":"Where are the wheels? I can\u0027t see any!"},{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-06-08T00:46:36Z","Content":"There are no wheels. First, any wheels with durability comparable to these air intakes would be bigger than the whole speeder. Then, this being meant for Minmus, wheels are really the worst means of transportation. On Kerbin this thing slides on the two XM-G50 Radial Air Intakes. On Minmus it will simply fly everywhere. And as reentry craft it really didn\u0027t need any.\n\nBTW, the radial air intakes are extremely hydrophobic, making this into a decent boat.\n\nps. I tried with the small shield again. The trajectory was not optimal, and I made it barely (overheat bar of the kerbal filled to 80%) but I did make it with the smallest heat shield!\n\n**Edited \u003Ctime datetime=\u00222015-06-08T00:49:43Z\u0022 title=\u002206/08/2015 12:49  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 8, 2015\u003C/time\u003E by Sharpy**"},{"CreatedByName":"GehringGame","CreatedById":145675,"CreatedDateTime":"2015-06-08T13:27:16Z","Content":"I love the look of that thing! Really cool design, thanks for sharing."},{"CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-06-08T13:49:02Z","Content":"Looks like I just gave you a \u002Br on another thread, but this design is certainly worth some. Thanks for posting, will steal ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-06-08T13:51:25Z","Content":"Intakes as skids? That\u0027s a very neat idea ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-06-08T15:18:20Z","Content":"Schweet. I like making itty bitty ships. Thanks for some ideas to steal ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)."},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2015-06-08T15:29:36Z","Content":"This is very cute. ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)"},{"CreatedByName":"stellarator","CreatedById":92423,"CreatedDateTime":"2015-06-08T17:26:11Z","Content":"I love that design... It could be a good exploration boat for laythe or for something else... I will give you the next challenge: send one of these to Laythe and use it to land there... And post images!"},{"CreatedByName":"rdwulfe","CreatedById":107690,"CreatedDateTime":"2015-07-01T13:43:52Z","Content":"Please share this craft file. This is an excellent design, and full of neat ideas. I\u0027d love to take a closer look at it. I also love the dockable heat shields. I\u0027m going to use an idea like that. Thinking of an array of them in low orbit."},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2015-07-01T18:09:50Z","Content":"Microbuilding can be fun."},{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-07-01T18:54:00Z","Content":"[https://www.dropbox.com/s/yhlbk0tgybjobz5/Speeder2.craft?dl=0](https://www.dropbox.com/s/yhlbk0tgybjobz5/Speeder2.craft?dl=0)\n\n[https://www.dropbox.com/s/jou9ne0qaaanbw0/Speeder2a.craft?dl=0](https://www.dropbox.com/s/jou9ne0qaaanbw0/Speeder2a.craft?dl=0)\n\nActually, subassemblies, two versions - attachable by the docking port or by the engine. (I needed both as I was sending a transport of 9 to Minmus, four pairs holding by docking port around a central bar, plus ninth in a garage below, where any of them can refuel.)"},{"CreatedByName":"Rath","CreatedById":138223,"CreatedDateTime":"2015-07-02T11:24:58Z","Content":"Can we see it on minimus?"},{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-07-03T06:00:02Z","Content":"Yep, made [a new thread](https://forum.kerbalspaceprogram.com/threads/127598-Little-Speeder-Just-fixing-broken-wheels?p=2056922#post2056922) for that.\n\n![pUjDZR4.jpg](http://i.imgur.com/pUjDZR4.jpg)"}]}