{"TopicId":112424,"ForumId":20,"TopicTitle":"Mechjeb or KER?","CreatedByName":"Senormeens","CreatedById":145344,"CreatedDateTime":"2015-06-09T02:37:15Z","PageNum":1,"Articles":[{"CreatedByName":"Senormeens","CreatedById":145344,"CreatedDateTime":"2015-06-09T02:37:15Z","Content":"I\u0027ve been installing a lot of mods lately (preferably ones that use the unlock tree in Career) and i have a couple questions.\n\nFirst, mechjeb or Kerbal Engineer redux? Ibe installed KER and i like it except i can\u0027t see any easy way to find out what the orbital period on my satellites are, which is a little important when making a comms relay for remote tech. I think Mechjab has this functionality in it, but i don\u0027t want to tempt myself with being able to autopilot. If anyone has any ideas its appreciated\n\nSecond, contract packs, I\u0027ve tried to install contract packs like 5dim which uses BD armory to create war scenario contracts, but for the life of me (And some kerbals) i can\u0027t get them to show up in the contract center, are they supposed to be installed anywhere specific? I do also has Contracts Configurator\n\nThird, what other mods do you suggest i use, again i would like all of them to be compatible with and use the tech tree in career mod.\n\nThanks!\n\nEdit: I have found the orbital period on KER so that problem is out.\n\n**Edited \u003Ctime datetime=\u00222015-06-19T03:09:44Z\u0022 title=\u002206/19/2015 03:09  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 19, 2015\u003C/time\u003E by Senormeens**"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2015-06-09T02:40:11Z","Content":"Modding question moved to the modding subforum."},{"CreatedByName":"DuoDex","CreatedById":107061,"CreatedDateTime":"2015-06-09T02:51:04Z","Content":"1. I know that MJ does orbital periods, and I think that KER does too, you may wish to look around a bit more. However if you use MJ you will be labeled as a filthy cheater by certain members of the community here ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)\n\n2. Google Contract Configurator - that\u0027s what those things use to create contracts.\n\n3. 99.5% of mods are intercompatible, don\u0027t worry about that.\n\nAlso, welcome to the forums! I know it seems like only moderators have responded thus far, but there are lots of active users that would love to give you help? Right, guys? Guys? ... guys? please don\u0027t leave me."},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-06-09T02:59:31Z","Content":"\u003E \n\u003E However if you use MJ you will be labeled as a filthy cheater by certain members of the community here\n\nMechJeb is more realistic unless you\u0027re running a \u002750\u0027s USAF space program. But DuoDex is correct, using it makes you a filthy cheater.\nMJ and KER share their delta-V solver (or a lot of code therein) and also display pretty much the same information. Both are stylish and eminently configurable."},{"CreatedByName":"MrZayas1","CreatedById":95654,"CreatedDateTime":"2015-06-09T03:10:55Z","Content":"I like using Mechjeb, simply because lots of monotonous things like getting into orbit and plotting hohmann transfers to moons and planets gets kind of old after a while ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif) It\u0027s all about your cup of tea, if you\u0027ve been to orbit 5,000 times then you probably can do it again, just use what you want ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"Crzyrndm","CreatedById":92871,"CreatedDateTime":"2015-06-09T03:17:46Z","Content":"\u003E \n\u003E Ibe installed KER and i like except i can\u0027t see any easy way to find out what the orbital period on my satellites are\n\nOrbital period should be one of the default readouts in the orbital panel for KER. If it\u0027s not there, click the edit button on the orbit panel and select orbital from the preset dropdown, it has period as the second readout from the bottom.\n\nContract packs require [Contract Configurator](https://forum.kerbalspaceprogram.com/threads/101604-1-0-2-Contract-Configurator-v1-2-5-2015-06-03) and can have prerequisite conditions (such as achieving orbit for the first time or having a certain level of prestige)\n\n**Edited \u003Ctime datetime=\u00222015-06-09T03:20:25Z\u0022 title=\u002206/09/2015 03:20  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 9, 2015\u003C/time\u003E by Crzyrndm**"},{"CreatedByName":"redsh","CreatedById":118322,"CreatedDateTime":"2015-06-09T03:34:28Z","Content":"MJ is a great thing and I\u0027m not agree with \u0022autopilot\u0022 definition. It\u0027s a complex toolkit for measurements, calculation, planning. Also it\u0027s made quite professionally."},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2015-06-09T04:44:24Z","Content":"\u003E \n\u003E MechJeb is more realistic unless you\u0027re running a \u002750\u0027s USAF space program. But DuoDex is correct, using it makes you a filthy cheater.\n\u003E MJ and KER share their delta-V solver (or a lot of code therein) and also display pretty much the same information. Both are stylish and eminently configurable.\n\nCheating in a game, is defined as providing one\u0027s self with an unnatural advantage over other players by a means not supported by the rules or the design of the game in general there in. By this definition, MechJeb is NOT a cheat what so ever. How? Simple. This is a SINGLE PLAYER GAME ONLY and you are not getting ANY advantage over say Scott Manley by using MechJeb. Also, I am aware I am feeding a sarcastic or trolling post \u003Cdefinition defined=\u0022\u0022 by=\u0022\u0022 ones=\u0022\u0022 personal=\u0022\u0022 point=\u0022\u0022 of=\u0022\u0022 view=\u0022\u0022\u003E but, by Mjolnir I cannot sit back and NOT comment. that simple.\u003C/definition\u003E\n\n\u003E \n\u003E MJ is a great thing and I\u0027m not agree with \u0022autopilot\u0022 definition. It\u0027s a complex toolkit for measurements, calculation, planning. Also it\u0027s made quite professionally.\n\ndude, id love to know what YOUR definition of an autopilot is, because having flown multiple simulators, a cessna, and an airports worth of model aircraft, I can clearly tell you, that MJ IS by all definitions an auto-pilot. How? Simple. tell it what you want done, and it does it, automatically, so long as you hit the proper settings. So, yes, it IS an autopilot. period. as well as one heck of a flight computer"},{"CreatedByName":"jwenting","CreatedById":57735,"CreatedDateTime":"2015-06-09T04:46:27Z","Content":"I prefer MJ. Not only does it have a lot more functionality (which you may or may not want/use) but the windows it creates are smaller, which is a bit plus ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"redsh","CreatedById":118322,"CreatedDateTime":"2015-06-09T05:25:04Z","Content":"AlamoVampire: Autopilot means sort of robot that directly controls the craft. MJ includes autopilot features of course but it also has plenty of well-designed non-autopilot features for planning, predicting etc. \u0022tell it what you want done, and it does it\u0022 point of view is quite limited.\n\n**Edited \u003Ctime datetime=\u00222015-06-09T06:16:24Z\u0022 title=\u002206/09/2015 06:16  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 9, 2015\u003C/time\u003E by redsh**"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-06-09T05:25:48Z","Content":"\u003E \n\u003E I prefer MJ. Not only does it have a lot more functionality (which you may or may not want/use) **but the windows it creates are smaller**, which is a bit plus ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nNot anymore. KER has HUD layouts, making it the new king of compact designs between the two. EDIT: Also notice the Orbital Period, that is the Orbit preset that comes with the mod, but the default and the default preset are two different things, you have to load the preset.\n\n\u003E ![F67919D765090D66E09F92E2A00A321C8B5BD795](http://images.akamai.steamusercontent.com/ugc/39751186271150669/F67919D765090D66E09F92E2A00A321C8B5BD795/)\n\n**Edited \u003Ctime datetime=\u00222015-06-09T05:27:51Z\u0022 title=\u002206/09/2015 05:27  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 9, 2015\u003C/time\u003E by Alshain**"},{"CreatedByName":"redsh","CreatedById":118322,"CreatedDateTime":"2015-06-09T05:49:17Z","Content":"I really don\u0027t like capsed text in KER GUI. Can it be switched to normal case somehow?"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-06-09T05:56:19Z","Content":"\u003E \n\u003E Cheating in a game, is defined as providing one\u0027s self with an unnatural advantage over other players by a means not supported by the rules or the design of the game in general there in. By this definition, MechJeb is NOT a cheat what so ever. How? Simple. This is a SINGLE PLAYER GAME ONLY and you are not getting ANY advantage over say Scott Manley by using MechJeb.\n\nWho are you to tell me what is and is not cheating in MY game?"},{"CreatedByName":"Nothalogh","CreatedById":139345,"CreatedDateTime":"2015-06-09T06:21:52Z","Content":"\u003E \n\u003E \u002750\u0027s USAF space program\n\n\u002750s USAF was trying to build Project Orion, so I doubt they had an aversion to flight control systems"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-06-09T07:33:35Z","Content":"\u003E \n\u003E \u002750s USAF was trying to build Project Orion, so I doubt they had an aversion to flight control systems\n\nNope, but they always preferred to have a \u0022man in the middle\u0022. They\u0027re about the closest to the way Kerbals do things."},{"CreatedByName":"Harry Rhodan","CreatedById":119953,"CreatedDateTime":"2015-06-09T08:12:27Z","Content":"The answer is obviously VOID."},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2015-06-09T08:58:29Z","Content":"\u003E \n\u003E AlamoVampire: Autopilot means sort of robot that directly controls the craft. MJ includes autopilot features of course but it also has plenty of well-designed non-autopilot features for planning, predicting etc. \u0022tell it what you want done, and it does it\u0022 point of view is quite limited.\n\nThat by default makes it an autopilot. IRL APs require manual input for hdg, alt, spd, much the same as MJ. Thus it is an autopilot.\n\n\u003E \n\u003E Who are you to tell me what is and is not cheating in MY game?\n\nIt seems I have struck a nerve. Unintended. Regex i singled no single player out. I supplied a definition. Nothing more. The long and short is this: squad permits us to mod, so no mod is cheating. Simple enough."},{"CreatedByName":"StarStreak2109","CreatedById":118557,"CreatedDateTime":"2015-06-09T09:53:29Z","Content":"There it is right now! I am a \u0022filthy cheater\u0022! Shame on me! Everybody, come on, let\u0027s jump on me and cry out \u0022Filthy Cheater\u0022! I am using MechJeb with most of it\u0027s autopiloting functions. For me, the fun in the game is the engineering part. Sometimes, I like to take the throttle myself, but mostly, I let MechJeb handle standard manoeuvers. I reason, that most space craft are using some kind of autopilot most of the time as well, so, why not!\n\nBesides that, I believe, KER and MJ have some right to co-exist, because I like the VAB/SPH functions of KER better than those of MJ."},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-06-09T11:12:27Z","Content":"I\u0027ve used KER and MJ on their own and simultaneously, they are both excellent mods. \n\nBoth provide a lot of data, some of which I consider essential to my enjoyment of the game (I\u0027m not really a \u0022from the hip\u0022 designer or pilot). There is more info available in MJ as far as I can tell, but I like the way KER presents it better.\n\nThe utilities and autopilot in MJ is a personal preference thing. I\u0027ve been doing most of my own piloting lately so I haven\u0027t been using the APs, and I always plan my own maneuvers and make nodes by hand (these are part of the fun for me). Some of the utilities are quite handy, though, and SmartASS so outclasses the stock SAS that it might be worth installing for that feature alone.\n\nAs for the whole \u0022cheating\u0022 thing, that\u0027s old and tired. Play the game how you like to play and don\u0027t worry who thinks you\u0027re a cheater. Some people think info mods are cheating, some think \\*all\\* mods are cheating, some even think doing the math by hand is cheating. If you worry or argue about what is and isn\u0027t cheating you are wasting your time, IMO."},{"CreatedByName":"Hotaru","CreatedById":135669,"CreatedDateTime":"2015-06-09T11:25:39Z","Content":"I think *playing Kerbal Space Program* is cheating. When I was your age\\*, I had to actually *light stuff on fire* and build *real rockets* to indulge in my space-related fantasies. \n\nOn topic, personally I use both KER and MJ. I have less than no patience for playing without autopilot so MJ is a must, but I like KER\u0027s HUD functionality slightly better than MJ\u0027s windows. As far as I can tell they give you most of the same information. \n\nRegarding the OP\u0027s second question which I haven\u0027t seen answered yet, contract packs require the [Contract Configurator](https://forum.kerbalspaceprogram.com/threads/101604-1-0-2-Contract-Configurator-v1-2-5-2015-06-03) mod. Install that first and you\u0027ll have a folder called something like \u0022Contract Packs;\u0022 that\u0027s where you install the packs. Hope this helps!\n\n\\*figuratvely speaking"},{"CreatedByName":"sarbian","CreatedById":57146,"CreatedDateTime":"2015-06-09T12:04:59Z","Content":"\u003E \n\u003E MJ is a great thing and I\u0027m not agree with \u0022autopilot\u0022 definition. It\u0027s a complex toolkit for measurements, calculation, planning. Also it\u0027s made quite professionally.\n\nThanks ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\n\u003E \n\u003E The answer is obviously VOID.\n\nClearly. VOID is one of those nice mods that needs more visibility.\n\nI have plans to provide an other part that would provide only the the core elements of MJ by default ( display, SASS, node editor, planner, ...) to provide something void of the AP for those who prefer that. But I am waiting for 1.0.3 to get our first, so I can release a new official release before breaking things again."},{"CreatedByName":"monstah","CreatedById":95210,"CreatedDateTime":"2015-06-09T14:21:22Z","Content":"Honestly, all I think MJ lacks is a semi-transparent configurable HUD like KER.\n\nI love KER and I\u0027m in no rush to get rid of it, but my laptop limits the ammount of mods I can use. I use both MJ and KER, and if MJ had the pretty unobtrusive HUDs I\u0027d sure get rid of the other (with cheers and many thanks to the author ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif) ).\n\nNow, let\u0027s please not go near the childish \u0022cheating\u0022 subject ever, ever, ever again, in any topic, regarding any mod? Ever?"},{"CreatedByName":"smjjames","CreatedById":134004,"CreatedDateTime":"2015-06-09T14:25:02Z","Content":"I would say both, they complement each other nicely actually."},{"CreatedByName":"heng","CreatedById":126869,"CreatedDateTime":"2015-06-09T14:44:51Z","Content":"I grew up with electronic games which did not have individual savegames. You had to start from the very beginning to go all the way to the point you stopped last time again and again. There are probably games I still could walk through the first few levels in my sleep, but haven\u0027t seen the end more than once or twice.\n\nThis is the situation with getting stuff into orbit in stock.\n\nLater, there were savepoints, were either the game actually saved, or you got a code you could write down and type in later. It did mean, that you were able to get there, but could continue venturing out from there.\n\nThis is my personal feeling toward using MJ to get stuff into orbit.\n\nI do use KER instead of MJ, but only because I grew up and grew accustomed to the principle of bottom-up *(here: start from the beginning each time. i know it\u0027s not the correct use of the term. sorry)* building. Not because I think one is better or the other is more \u0022pure\u0022 or one is cheating or something.\n\n/my 2 cents\n\n**Edited \u003Ctime datetime=\u00222015-06-09T15:49:14Z\u0022 title=\u002206/09/2015 03:49  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 9, 2015\u003C/time\u003E by heng**"},{"CreatedByName":"Rocketfeline","CreatedById":137938,"CreatedDateTime":"2015-06-09T16:11:18Z","Content":"I use mechjeb for mostly ascent and burns. Because I cant trust myself to not flip over during ascent or burning too late. I just found KER being very tacky. Especially during VAB. I dont like it giving me descriptions of everything. (I would like to add that I dont wanna end up like a mechjeb debate on stuff. This thread is too young..)"}]}