{"TopicId":112569,"ForumId":36,"TopicTitle":"[WIP - Concept] Contract Pack: The K Files","CreatedByName":"severedsolo","CreatedById":80345,"CreatedDateTime":"2015-06-10T16:36:33Z","PageNum":1,"Articles":[{"CreatedByName":"severedsolo","CreatedById":80345,"CreatedDateTime":"2015-06-10T16:36:33Z","Content":"So I was thinking of what to do with my next contract pack, and I thought, \u0022you know what KSP really needs? some kind of story line\u0022\n\nThis is all very high level at the moment, but I\u0027d like to do something very loosely based on the old \u0022SSTV Aliens\u0022 idea [here](http://pastebin.com/3vvjushy)\n\nBasically, my thinking is that the player would do a series of missions that would take them around the Kerbol system, until they finally come across an alien race (who, for technical reasons, will look surprisingly like Kerbals).\n\nThe actual \u0022story\u0022 will be told through contract descriptions and completion messages, and I\u0027d like to make it quite \u0022Kerbal\u0022 - ie funny. (well, my wife tells me I\u0027m not funny, but what does she know?)\n\nHere is what I have so far:\n\nMission 0: If MM will recognise Contract Packs as a mod for the :NEEDS flag - you\u0027d find the UFO using Anomaly Surveyor (completely optional, hence why this is Mission 0)\n\nMission 1: \u0022Mulder Kerman\u0022 is investigating the crashed UFO near the North Pole - go and pick him up and bring him back to KSC for debriefing. Possibly take \u0022Scully Kerman\u0022 to investigate the one on Mun.\n\nMission 2: The alien craft is emitting some kind of signal, it seems to be coming from Duna - go and investigate (would lead the player to the SSTV signal - or the Face of Duna if the SSTV signal can\u0027t be heard any more).\n\nMissions 3 - ?: Bunch of stuff I haven\u0027t thought of yet.\n\nFinal Mission: You find a colony of \u0022aliens\u0022 living on - well I haven\u0027t decided. I\u0027m thinking it should be Laythe, but I also like the idea of making the player go all the way out to Eeloo.\n\nObviously there is the potential for a lot of overlap with Anomaly Surveyor here, so I\u0027ll have to work out how to keep it different to that pack.\n\nAs I said very high level, I might hash out the first couple of missions tonight, any input/suggestions/thoughts?\n\n**Edited \u003Ctime datetime=\u00222015-06-10T18:06:58Z\u0022 title=\u002206/10/2015 06:06  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 10, 2015\u003C/time\u003E by severedsolo**"},{"CreatedByName":"Astrofox","CreatedById":135785,"CreatedDateTime":"2015-06-10T16:45:48Z","Content":"Looks interesting, however, I am not so sure that Duna\u0027s SSTV signal can be heard now.\n\nHowever, I would like to rove/fly around collecting science for such missions on Duna, but it would probably be more of \u0022you land at specific coordinates and you collect science\u0022 just to complete the mission.\n\nOr, you could simply modify the recover module missions so that you have to go to land on Duna and collect science data within the radius of 40 meters of the part, or something like that."},{"CreatedByName":"severedsolo","CreatedById":80345,"CreatedDateTime":"2015-06-12T18:02:41Z","Content":"\u003E \n\u003E Looks interesting, however, I am not so sure that Duna\u0027s SSTV signal can be heard now.\n\u003E However, I would like to rove/fly around collecting science for such missions on Duna, but it would probably be more of \u0022you land at specific coordinates and you collect science\u0022 just to complete the mission.\n\u003E \n\u003E Or, you could simply modify the recover module missions so that you have to go to land on Duna and collect science data within the radius of 40 meters of the part, or something like that.\n\nThats a shame if SSTV isn\u0027t there any more. Well, I\u0027ve managed to get the first four missions done, they are mainly \u0022go here and do x\u0022 but the story line is coming along well. Hopefully I\u0027ll have a playable beta available soon.\n\nI\u0027m thinking of seeing if I can get the \u0022alien homeworld\u0022 to be a Kopernicus custom planet (optional, I\u0027ll make an alternate ending for those who don\u0027t want the extra memory footprint)."},{"CreatedByName":"severedsolo","CreatedById":80345,"CreatedDateTime":"2015-08-26T20:07:15Z","Content":"Gave up on the planet idea. Too much effort.\n\nThe good news is, CC now has alot more functionality to support this kind of thing!\n\nI have a working prototype of the first four missions if anyone is interested: [https://github.com/severedsolo/ContractPackKFiles/archive/master.zip](https://github.com/severedsolo/ContractPackKFiles/archive/master.zip) (remove the files that start with .git). Now with 100% more snappy dialogue, and pictures!\n\nThe first mission will unlock once you unlock the Turbojet engine. Others will follow in sequence. (Please note the story is not finished, so you\u0027ll only get the first 4 missions). I\u0027m also not sure about sending the player all the way out to Duna/Laythe. I might keep it in the Kerbal system.\n\nThe storyline has also changed alot. The basic alien idea is still there, but they are going to be very... familiar.\n\n**Edited \u003Ctime datetime=\u00222015-08-26T20:17:56Z\u0022 title=\u002208/26/2015 08:17  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 26, 2015\u003C/time\u003E by severedsolo**"},{"CreatedByName":"Nori","CreatedById":41334,"CreatedDateTime":"2015-08-26T21:05:29Z","Content":"\u003E \n\u003E The actual \u0022story\u0022 will be told through contract descriptions and completion messages, and I\u0027d like to make it quite \u0022Kerbal\u0022 - ie funny. (well, my wife tells me I\u0027m not funny, but what does she know?)\n\nMy wife says the same thing. Well actually, she says the opposite. Just very sarcastically..\n\nAnyway, this looks pretty interesting!"},{"CreatedByName":"monstah","CreatedById":95210,"CreatedDateTime":"2015-08-27T11:55:19Z","Content":"I first read \u0022Gave up on the planet idea\u0022 as \u0022Gave up on that idea\u0022, as in, the whole contract pack. Glad I read it again!\n\nAnyway, I like the idea of sending the player all the way to Eeloo eventually, if only because the system is ~tiny~. But, IMO, the very final mission should be somewhere around Jool. 2001 for the win!\n\nMy wife doesn\u0027t get my sense of humour too. She didn\u0027t like Babylon 5 either, but I smile anytime I see that Garibaldi avatar ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)"},{"CreatedByName":"Nori","CreatedById":41334,"CreatedDateTime":"2015-08-27T14:29:59Z","Content":"\u003E \n\u003E My wife doesn\u0027t get my sense of humour too. She didn\u0027t like Babylon 5 either, but I smile anytime I see that Garibaldi avatar ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)\n\nWhat? She didn\u0027t like B5? Shun her! ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif) Strangely enough, my wife liked it. Or at least she said she did (and watched all 5 seasons at least once). And yes, I love Garibaldi. There are soo many great B5 characters but I think he is my favorite (or Vir, or Londo...).\n\nOn topic though. Have you thought about taking a planet pack as a requirement instead? Something that puts a few planets really far away so that you can stretch the story a bit. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"severedsolo","CreatedById":80345,"CreatedDateTime":"2015-11-08T12:14:30Z","Content":"We have a release! [http://forum.kerbalspaceprogram.com/threads/138681-1-0-4-Contract-Pack-The-K-Files-1-0](https://forum.kerbalspaceprogram.com/threads/138681-1-0-4-Contract-Pack-The-K-Files-1-0)\n\nHave I really been working on this for 6 months?!\n\nSorry guys I never saw your replies: Yes, I like the idea of going to Jool too, what I have is just a launching point.\n\nPlanet packs: Maybe when 1.1 comes out, I\u0027m concerned with memory issues at the moment (for myself, as I like playing with my own packs)\n\n**Edited \u003Ctime datetime=\u00222015-11-08T12:56:48Z\u0022 title=\u002211/08/2015 12:56  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 8, 2015\u003C/time\u003E by severedsolo**"}]}