{"TopicId":112536,"ForumId":16,"TopicTitle":"Which place-anywhere parts provide fuel crossfeed?","CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-06-10T08:56:11Z","PageNum":1,"Articles":[{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-06-10T08:56:11Z","Content":"\n\u003Cp\u003EWhich parts that can be attached to arbitrary place of another part provide fuel crossfeed?\u003C/p\u003E\u003Cp\u003EMy goal: multiple smaller engines on a large fuel tank. Say, MK3 fuel tank with several ramjets and NERVs attached to the bottom. I\u0027ve seen a tip where someone placed an octogonal cubic strut between the engine and the tank, but the screenshot dated quite a bit back, so I don\u0027t know if it would still work.\u003C/p\u003E\u003Cp\u003E(if bad comes to worse, I can attach the tiny \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/FL-T100_Fuel_Tank\u0022 rel=\u0022external nofollow\u0022\u003EFL-T100 Fuel Tank\u003C/a\u003E centrally and several more copies of it radially. But I wonder what other parts (or tricks) can I use.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/File:FL-T100.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://wiki.kerbalspaceprogram.com/images/thumb/9/9c/FL-T100.png/60px-FL-T100.png\u0022 alt=\u002260px-FL-T100.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-10T10:54:47Z\u0022 title=\u002206/10/2015 10:54  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 10, 2015\u003C/time\u003E by Sharpy\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"rofltehcat","CreatedById":145224,"CreatedDateTime":"2015-06-10T09:03:45Z","Content":"\n\u003Cp\u003EI used radial attachment points but there is surely a more cost/mass efficient solution. Maybe build a test vessel that is basically a giant fuel tank studded with connecting parts and spark/ant engines. Either way you can also try connecting fuel lines to the engines.\u003C/p\u003E\n"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-06-10T09:08:00Z","Content":"\n\u003Cp\u003EIf I\u0027m not mistaken, jet engines use fuel from the whole plane dispite have fuel conduit or not. I haven\u0027t check if it crosses decoupers though (as planes rarely have decouplers)\u003C/p\u003E\u003Cp\u003EOn the other hand, rocket engines uses fuel in the same stack and they need fuel conduit to get fuel from other stack.\u003C/p\u003E\u003Cp\u003ESo if you put a LVN at the bottom of you tank (rocket engine) and Ramjets around it, all engines woulld consume fuel without lines. I\u0027m not even sure you need your small lateral tanks.\u003C/p\u003E\n"},{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-06-10T09:55:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Warzouz\u0022 data-cite=\u0022Warzouz\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ESo if you put a LVN at the bottom of you tank (rocket engine) and Ramjets around it, all engines woulld consume fuel without lines. I\u0027m not even sure you need your small lateral tanks.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI can\u0027t attach them just to a random location of a tank. They need to be attached to a node (green ball). But I guess making a \u0022flower\u0022 of FL-T100s (one central FL-T100 and six more attached radially to it) at the bottom of a MK3 would do the trick turning one node into seven.\u003C/p\u003E\u003Cp\u003EI want to avoid the mess with fuel lines. I\u0027m planning a really huge craft and I want to keep the part number low - keeping struts, fuel lines, griders and all that space glue to minimum (just for sake of FPS my computer can create; my mission to Eve already draws at some 8 frames per second...)\u003C/p\u003E\u003Cp\u003EI know for a fact radial decouplers conduct fuel. Too bad I don\u0027t plan to use any (my huge project idea is a SSTE craft (Single Stage to Everywhere.)\u003C/p\u003E\n"},{"CreatedByName":"Dilli","CreatedById":142986,"CreatedDateTime":"2015-06-10T10:09:48Z","Content":"\n\u003Cp\u003EI think you will battle without using fuel lines as the fuel wont cross-feed radially (only in line) as far as I know. The Tail Connector A radially attached in symmetry with fuel lines from the main tank, rotated and offset down and into the fuel tank makes a nice looking outer core on a multi-engine set-up; the octogonal cubic strut then is used for the inner core.\u003C/p\u003E\u003Cp\u003EIf you set against fuel lines try looking at mods.\u003C/p\u003E\n"},{"CreatedByName":"cybersol","CreatedById":81136,"CreatedDateTime":"2015-06-10T10:11:22Z","Content":"\n\u003Cp\u003ECubic octagonal struts are still the best ways to do engine clusters like you describe. They are light and you can flip them around 180 to be inside the tank for a very clean appearance. \u003C/p\u003E\u003Cp\u003EFor fuel crossfeed, anything that does not explicitly say no fuel crossfeed in orange text should crossfeed fuel. However some parts like fuel tanks only crossfeed along the axial directions. I find that the deltaV \u0026amp; TWR readouts of Kerbal Engineer Redux or similar are good ways to detect odd fuel flow rule issues (i.e. Why is my deltaV so low with this much fuel? Why is TWR still zero?)\u003C/p\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2015-06-10T10:17:01Z","Content":"\n\u003Cp\u003EAlmost every radially attached part can conduct fuel. The most important prerequisite is that the part may *not* provide the resource itself. See this:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://ksp.schnobs.de/stuff/crossfeed.png\u0022 alt=\u0022crossfeed.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E(picture was taken to file a bug against MJ which didn\u0027t know about this way back when)\u003C/p\u003E\u003Cp\u003EThe small tank does crossfeed not because it is empty, but because it\u0027s own storage has been switched off so it no longer provides fuel and oxidizer. If a part does not hold a resource, it automatically crossfeeds. The precooler or the Big-S wing will crossfeed oxidiser; in order to crossfeed fuel, you have to toggle their own tanks. Other structural pieces that are no tanks at all usually crossfeed without further ado. Except for very,very few parts which don\u0027t.\u003C/p\u003E\u003Cp\u003EIMPORTANT: This is no real \u0022cross\u0022feed. Between radially-attached parts, fuel only flows from parent to child (that usually means \u0022outward\u0022). If you want fuel from an radial tank flowing into the main stack you have to use fuel lines.\u003C/p\u003E\n"},{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-06-10T10:54:30Z","Content":"\n\u003Cp\u003EThank you very much for the comprehensive answer.\u003C/p\u003E\n"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-06-10T11:17:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sharpy\u0022 data-cite=\u0022Sharpy\u0022\u003E\u003Cdiv\u003EI can\u0027t attach them just to a random location of a tank. They need to be attached to a node (green ball). But I guess making a \u0022flower\u0022 of FL-T100s (one central FL-T100 and six more attached radially to it) at the bottom of a MK3 would do the trick turning one node into seven.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAh, OK, my bad... I thought radial outside the central tank. You want to do an engine cluster. I projected my way of doint things : I attach engines radially on interplanetary stage. \u003C/p\u003E\u003Cp\u003EI did that in beta 0.9 for my Tylo lander. I pluged 4 cubic struts with 48-7S under a small rockamax fuel tank. But that\u0027s easy to test. Put you stage on launchpad (with clamps) and check if you engine works.\u003C/p\u003E\u003Cp\u003EThe issue with cluster engines is the way to put it on top of the launch stage. How will you do that ?\u003C/p\u003E\n"},{"CreatedByName":"cybersol","CreatedById":81136,"CreatedDateTime":"2015-06-10T11:26:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Warzouz\u0022 data-cite=\u0022Warzouz\u0022\u003E\u003Cdiv\u003EThe issue with cluster engines is the way to put it on top of the launch stage. How will you do that ?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve typically used something like modular girder(s) on the axial node and put engine cluster around the outside. I then put a decoupler on the axial girder and continue the rocket as normal. Struts and an interstage fairing can make it more stable and professional looking.\u003C/p\u003E\n"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-06-10T11:53:08Z","Content":"\n\u003Cp\u003ESadly hog bi/tri/quadry-coupler aren\u0027t reversible.\u003C/p\u003E\n"},{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-06-10T14:01:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Warzouz\u0022 data-cite=\u0022Warzouz\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThe issue with cluster engines is the way to put it on top of the launch stage. How will you do that ?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI won\u0027t! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe idea is a SSTE craft - Single Stage To Everywhere. (well, currently, before RAPIER, everywhere without a thick non-oxygen atmosphere). \u003C/p\u003E\u003Cp\u003EA mix of excessive number of turbojets, nuclear engines and a portable refinery for refuelling on nearby low-gravity moons (and planet surface between landing and re-launch) should give me that capability. I might support them with a couple Mainsails for the intermediate phase between 20 and 50km when Ramjets flail and NERVs still didn\u0027t reach full performance.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Warzouz\u0022 data-cite=\u0022Warzouz\u0022\u003E\u003Cdiv\u003ESadly hog bi/tri/quadry-coupler aren\u0027t reversible.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUh? Before the \u0022flower\u0022 idea (and researching Ramjets) I successfully tested my Tricoupler Quilt Drive.\u003C/p\u003E\u003Cp\u003EIt was really funny looking, a huge triangular carpet woven of tricouplers in normal and upside down positions, pelted with jets (plain) and NERVs on the bottom, with many small fuel tanks and air intakes on top. It really flew like a carpet, waving, bending, folding. It reached 6km on the jets, then 10km on NERVs, then it ran out of fuel. I suppose with Ramjets and a little more fuel it would reach orbit just fine; NERVs really perform abysmally below 20km and plain jets simply can\u0027t reach that high. I could place multiple moderately heavy tanks and facilities spaced sparsely around a quilt much larger than my test one, and it would fly just fine; it can scale indefinitely as long as the computer can handle it.\u003C/p\u003E\n"}]}