{"TopicId":112562,"ForumId":16,"TopicTitle":"Up and down became left and right. (Wings)","CreatedByName":"envelope91","CreatedById":146026,"CreatedDateTime":"2015-06-10T14:50:28Z","PageNum":1,"Articles":[{"CreatedByName":"envelope91","CreatedById":146026,"CreatedDateTime":"2015-06-10T14:50:28Z","Content":"Hello! I just got a question about this really strange invertion of the controls, they arent so much inverted as they are, well, just plain changed... Up and down just became Left and Right, but only for the wings...\n\nSo i\u0027m just casually working on my space volvo that i use with infinite fuel to just have fun, but somehow i\u0027ve messed it up.\n\nThe first 3 prototypes worked pretty well, pressing S on the keyboard mate it go up, and W down, like it should be.\n\nBut now, pressing S makes the rudder go left... and A and D pitches up and down (But SAS still works pefectly, basically making it unflyable, because SAS makes it go down, but the wings make it go up.\n\nBasically, up and down just turned into Left and right, but only for the wings, not SAS... what\u0027s that all about? no mods installed.\n\npic (WIP): [http://i.imgur.com/5WnuKZw.jpg](http://i.imgur.com/5WnuKZw.jpg)\n\nAny help is appreciated!"},{"CreatedByName":"Brainlord Mesomorph","CreatedById":110905,"CreatedDateTime":"2015-06-10T14:57:26Z","Content":"I don\u0027t see a manned unit in there. Is there a probe core? might you have rotated it?"},{"CreatedByName":"envelope91","CreatedById":146026,"CreatedDateTime":"2015-06-10T14:58:31Z","Content":"There\u0027s an idea! I\u0027ll check that out!"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-06-10T15:01:25Z","Content":"It looks like the lift centers are ahead of the CoM, so the deflection direction would be the opposite of what one might expect. Try moving them rearward and see if it fixes it."},{"CreatedByName":"envelope91","CreatedById":146026,"CreatedDateTime":"2015-06-10T15:07:51Z","Content":"Yeah i think something is off with the centers, the probe core was correctly placed, placing it up side down yielded some strange results, the wings pitched in the correct way, but it still steered incorrectly and is generally unstable.\n\nI think the best thing would be to revert to the latest functioning strage and just add more stuff until i figure out what\u0027s wrong, but thanks for all the help lads, its a really strange craft so i guess KSP is getting a bit confused."}]}