{"TopicId":112515,"ForumId":21,"TopicTitle":"Muon - Heavy Cargo Rocket Plane","CreatedByName":"Red Dwarf","CreatedById":67709,"CreatedDateTime":"2015-06-10T00:32:52Z","PageNum":1,"Articles":[{"CreatedByName":"Red Dwarf","CreatedById":67709,"CreatedDateTime":"2015-06-10T00:32:52Z","Content":"\n\u003Cp\u003EFor a long time, I\u0027ve been searching for the holy grail. I wanted to design a recoverable spaceplane that could lift an Big Red to orbit. However, that grail has always alluded my grasp. An SSTO capable of this is beyond my engineering and piloting skills, and while they \u003Cem\u003Eare\u003C/em\u003E functional, I have an aversion to side-mounted shuttles. They\u0027re challenging to design and frustrating to fly. With that in mind, I started searching around for some more... Kerbal ideas.\u003C/p\u003E\u003Cp\u003EBack in .90, I designed \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/106514-80-Recoverable-Bizarro-verse-Space-Shuttle-%28Orange-tank-to-orbit%29?p=1655770#post1655770\u0022 rel=\u0022external nofollow\u0022\u003Ethe Lepton\u003C/a\u003E, a goofy-looking but basically functional shuttle-alike. It was a novel idea, kind of elegant in its simplicity. Its center of mass remained aligned with its thrust for the entirety of its ascent, giving it an advantage over your standard side-mounted shuttle. Additionally, its added symmetry meant that you could swap out the SRB\u0027s for larger boosters, giving you a lot of freedom in terms of payload weight. However, the fact of the matter was it looked freakin\u0027 dumb, and I never integrated it into my main fleet.\u003C/p\u003E\u003Cp\u003EFlash forward to last week. I had a flash of inspiration, and returned to the long-defunct Lepton. After a few days of design and testing, I finally produced something worthy of display. For your consideration, the Muon.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/EGC5vdR.png\u0022 alt=\u0022EGC5vdR.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ESome nuggets of the Lepton survived the heavy redesign process, but for the most part it\u0027s an entirely separate beast. More versatile, lighter on the parts, easier to fly, and even easier on the eyes. The Muon may well be my crowning achievement.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/lhMNq\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EI think it still needs some tinkering. Control is a big issue. The Muon is super heavy on the RCS. If you use it for station keeping or construction, it\u0027ll be necessary to top up on RCS fuel before you return to Kerbin. Maybe reaction wheels are the solution, or maybe some canards. Power can be an issue too, as its sole source of energy are the tiny solar panels. I almost ran out of juice taking pictures for the album, because my descent had me landing at dusk.\u003C/p\u003E\u003Cp\u003EWhatever the case, I see a bright future for the Muon. I\u0027ve already developed a Munar Ferry which can be deployed by the Muon, and I have some plans for Spacelab-style long term architecture. It\u0027s gonna be a fun ride!\u003C/p\u003E\n"},{"CreatedByName":"Columbia","CreatedById":135031,"CreatedDateTime":"2015-06-10T03:11:03Z","Content":"\n\u003Cp\u003EWow, that\u0027s huge! It\u0027s a lot like a symmetrical Space Shuttle..\u003C/p\u003E\u003Cp\u003ENice work \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Red Dwarf","CreatedById":67709,"CreatedDateTime":"2015-06-10T15:15:55Z","Content":"\n\u003Cp\u003EThanks man. I\u0027m kind of wondering if I can make this more cost efficient than it already is. TWR on the pad is some ludicrously high number, cause she takes off faster than any other rocket in my fleet. I\u0027m thinking I could reduce the size of the boosters and see similar performance...\u003C/p\u003E\n"}]}