{"TopicId":112677,"ForumId":16,"TopicTitle":"How much drag does my craft have?","CreatedByName":"A_name","CreatedById":134040,"CreatedDateTime":"2015-06-11T15:49:01Z","PageNum":1,"Articles":[{"CreatedByName":"A_name","CreatedById":134040,"CreatedDateTime":"2015-06-11T15:49:01Z","Content":"\n\u003Cp\u003EI know the drag for a given craft is not constant but will depend on many variables including attitude, altitude, speed, temperature, etc. However, is there a way to know or estimate how much drag potential (?) a craft has? In other words, for example, by looking at two crafts in the VAB/SPH can one find out which craft will have more drag in general?\u003C/p\u003E\n"},{"CreatedByName":"Feradose","CreatedById":111211,"CreatedDateTime":"2015-06-11T16:03:16Z","Content":"\n\u003Cp\u003EYes. If its a square, it will probably have hella drag. Try and design stuff that doesnt use radial tanks. Keep everything inline. Do not use radials.\u003C/p\u003E\u003Cp\u003EEverything must be stacked. Radials give excess... You get it.\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2015-06-11T17:13:15Z","Content":"\n\u003Cp\u003EA lot of it does have to do with your cross-section; your velocity and atmospheric density play into it as well. One of the things that the FAR mod does is show you what kind of cross-sectional area you\u0027re dealing with for your current design and calculate your critical mach number for you; it\u0027ll also show you where you can expect to experience the greatest amount of drag as well. For the soup, there\u0027s the information available on atmospheric density with altitude on the wiki, and you could calculate various solutions for velocity and density using something like a spreadsheet for a given design. Of course, you\u0027d still need to know what your cross-sectional area was; for that, you\u0027d probably need a detailed analysis of the size and shape of the parts you\u0027re using.\u003C/p\u003E\u003Cp\u003EKweller has given you a pretty good short answer - me, I\u0027ve pretty much just told you to go do a hell of a lot of math. Or install FAR. Either way...that\u0027s probably not a direct answer to your question.\u003C/p\u003E\n"}]}