{"TopicId":112606,"ForumId":20,"TopicTitle":"New Game Mod Selector","CreatedByName":"Th3Cap3","CreatedById":11274,"CreatedDateTime":"2015-06-10T21:53:34Z","PageNum":1,"Articles":[{"CreatedByName":"Th3Cap3","CreatedById":11274,"CreatedDateTime":"2015-06-10T21:53:34Z","Content":"\n\u003Cp\u003EGood Afternoon mod geniuses!\u003C/p\u003E\u003Cp\u003EI had a thought today about a mod that I think would be awesome if possible (I may be crazy).\u003C/p\u003E\u003Cp\u003EI\u0027ve noticed a number of people on reddit and with friends of mine that they sometimes want to install mods and play with them but also have a stock save/career. As it stands right now, if you load up that stock save once you have mods installed, all those mods will be applied to the save that was stock. So I thought, what if there was a plugin or a mod that would pop up and ask you which mods you wanted to play with when you start a new game? It could be a check the box type list that lists all the detected mods in the game data folder, but would allow you to select the ones you wanted to show up in the game, so if you didn\u0027t want to play with mods, just uncheck all of them and go on your way.\u003C/p\u003E\u003Cp\u003EI am not sure what all would be involved, I\u0027m a noob when it comes to programming (otherwise I would attempt to make this plugin myself...I wouldn\u0027t even know where to begin), but I thought I would put it up for the great mod minds in these forums :-) Thanks for your time!\u003C/p\u003E\n"},{"CreatedByName":"sumghai","CreatedById":66272,"CreatedDateTime":"2015-06-10T22:44:47Z","Content":"\n\u003Cp\u003EThe main problem is that many KSP add-ons, particularly plugins, are preloaded when starting up the game, and can\u0027t be dynamically unloaded/reloaded while the game is running. Therefore your suggestion isn\u0027t technically possible.\u003C/p\u003E\n"},{"CreatedByName":"hab136","CreatedById":75997,"CreatedDateTime":"2015-06-11T10:26:02Z","Content":"\n\u003Cp\u003EJust make a copy of the whole Kerbal Space Program directory, and keep one game with mods and one without. Or as many copies with different variations as you like.\u003C/p\u003E\n"}]}