{"TopicId":112635,"ForumId":34,"TopicTitle":"[1.0.4] Maritime Pack - 0.1.4","CreatedByName":"Fengist","CreatedById":78435,"CreatedDateTime":"2015-06-11T04:21:13Z","PageNum":9,"Articles":[{"CreatedByName":"smjjames","CreatedById":134004,"CreatedDateTime":"2015-07-05T22:21:49Z","Content":"\u003E \n\u003E Personally, because of the drag issues with stock water, I think this mod should have as a requirement, [BetterBuoyancy](https://forum.kerbalspaceprogram.com/threads/105094-1-0-3-Better-Buoyancy-v1-3-Simple-Water-Fixes-6-22-15). Unfortunately, I tried using a ship with it, and it was stuck below the surface, and also, when going fast enough, generated some bizarre lift and took off like an uncontrollable rocket/jet thing.\n\u003E Regarding underwater aesthetics and water launches, the plugin from [InfititeDice\u0027s boats mod](https://forum.kerbalspaceprogram.com/threads/24845-Boat-Parts-0-90-R4-65) does add underwater graphical updates.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E \u003E [http://static.wixstatic.com/media/89835a_39ebcf93d9b2422eb298473a4a8a6418.png_srb_p_1484_835_75_22_0.50_1.20_0.00_png_srb](http://static.wixstatic.com/media/89835a_39ebcf93d9b2422eb298473a4a8a6418.png_srb_p_1484_835_75_22_0.50_1.20_0.00_png_srb)\n\u003E \n\u003E \n\u003E Perhaps you could ask permission to use his plugin, and re-distribute it in your mod, or make it an optional requirement. (Once his mod updates!)\n\nAre you using the latest Better Buoyancy?\n\nPersonally though, I use BB because I find the stock water to be too bouncy."},{"CreatedByName":"Corax","CreatedById":11311,"CreatedDateTime":"2015-07-06T03:55:33Z","Content":"\u003E \n\u003E \n\u003E \u003E \n\u003E \u003E They do not consider underwater to be a place where you should go. This is a game about rockets and aviation. Not about aquatics and maritime activities. Oceans are merely a consequence of making realistic planets. They\u0027re not a place for exploration. Therefore [...] I won\u0027t keep spoiling this [...]\n\u003E \u003E Thus far, Squad had shown no real desire to change the seascape. Now that being said... if I DO make submarines work then perhaps Squad would have a reason to fix these issues. I\u0027m afraid it would take a lot of opinions to change that and I don\u0027t think **there are enough submariners in the game** for them to really care.\n\u003E \u003E \n\u003E \u003E I included the bathysphere knowing these things in hope that people like you would want to use it, see these problems, and start making some noise about getting them fixed. And I\u0027m planning the IVA for the bathysphere in the hopes this happens. I\u0027d love to see subs. But Squad would need to make the oceans friendly before they become visually appealing.\n\u003E \u003E \n\u003E \u003E In some ways, making mods sucks. You end up learning all the dirty little secrets.\n\u003E \n\nIf you reply to this post, please use spoilers if discussing the above.\n\nI mostly share your assessment of Squad\u0027s position. I reckon though if economic considerations were no issue, Harv would be more than willing to include submarine gameplay.\n\nI\u0027d so love to see that happen. It could provide an early proving ground for EVAs and docking, without the risk of losing crew to the infinite void. It could provide educational tools about our planet, just as much as the spaceflight portion does - with the possible difference that we humans probably know more about the outer solar system than we do about what\u0027s below the surface of the pool ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)\n\nSpaceflight on Earth is tightly linked to the underwater environment - there\u0027s the NBL (no, none of several basketball leagues named National Basketball League...), most prominently, but also NEEMO with the Aquarius underwater habitat that was originally an asset of NOAA - which again underlines how close the ties are between Ocean and Space.\n\nAnd that\u0027s only pandering to the \u0022National^TM^\u0022 folks - Russia, Europe, and China all have their space-related underwater facilities and research programmes, and I suppose India\u0027s, Brazil\u0027s, and any other space programme do, too.\n\n**Count me in as a submariner, Squad.**\n\n**I want to take mud samples from the floor of Laythe\u0027s deep sea trenches, and watch Eve\u0027s purple ocean waves breaking above my submarine!**"},{"CreatedByName":"Thatdude253","CreatedById":140179,"CreatedDateTime":"2015-07-06T09:41:37Z","Content":"Hey, I think it would be sweet if you could release some parts that were bigger and kind of US Navy grey, styled after US destroyers of cruisers. Something big enough to fit the naval guns from this mod [http://forum.kerbalspaceprogram.com/threads/118824-WIP-Never-Enuff-Dakka-A-BDArmoury-expansion?p=1896201#post1896201](https://forum.kerbalspaceprogram.com/threads/118824-WIP-Never-Enuff-Dakka-A-BDArmoury-expansion?p=1896201#post1896201). Anyhoe, thats just me being a kerbal war monger. Do as you please and have a wonderful day."},{"CreatedByName":"Fengist","CreatedById":78435,"CreatedDateTime":"2015-07-06T23:39:38Z","Content":"\u003E \n\u003E Personally, because of the drag issues with stock water, I think this mod should have as a requirement, [BetterBuoyancy](https://forum.kerbalspaceprogram.com/threads/105094-1-0-3-Better-Buoyancy-v1-3-Simple-Water-Fixes-6-22-15). Unfortunately, I tried using a ship with it, and it was stuck below the surface, and also, when going fast enough, generated some bizarre lift and took off like an uncontrollable rocket/jet thing.\n\u003E Regarding underwater aesthetics and water launches, the plugin from [InfititeDice\u0027s boats mod](https://forum.kerbalspaceprogram.com/threads/24845-Boat-Parts-0-90-R4-65) does add underwater graphical updates.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E \u003E [http://static.wixstatic.com/media/89835a_39ebcf93d9b2422eb298473a4a8a6418.png_srb_p_1484_835_75_22_0.50_1.20_0.00_png_srb](http://static.wixstatic.com/media/89835a_39ebcf93d9b2422eb298473a4a8a6418.png_srb_p_1484_835_75_22_0.50_1.20_0.00_png_srb)\n\u003E \n\u003E \n\u003E Perhaps you could ask permission to use his plugin, and re-distribute it in your mod, or make it an optional requirement. (Once his mod updates!)\n\nAnd I just looked, my dev install of KSP has BB running so, it\u0027s something else causing your sinkage.\n\nAnd wow, Dice fixed it. I haven\u0027t taken a look at his mod in months so that\u0027s nice. I\u0027ll have to talk to him. He actually stopped in several pages back and said if there was anything I needed....\n\n- - - Updated - - -\n\n\u003E \n\u003E **Count me in as a submariner, Squad.**\n\u003E \n\u003E **I want to take mud samples from the floor of Laythe\u0027s deep sea trenches, and watch Eve\u0027s purple ocean waves breaking above my submarine!**\n\nBubbleheads unite!\n\n- - - Updated - - -\n\n\u003E \n\u003E Hey, I think it would be sweet if you could release some parts that were bigger and kind of US Navy grey, styled after US destroyers of cruisers. Something big enough to fit the naval guns from this mod [http://forum.kerbalspaceprogram.com/threads/118824-WIP-Never-Enuff-Dakka-A-BDArmoury-expansion?p=1896201#post1896201](https://forum.kerbalspaceprogram.com/threads/118824-WIP-Never-Enuff-Dakka-A-BDArmoury-expansion?p=1896201#post1896201). Anyhoe, thats just me being a kerbal war monger. Do as you please and have a wonderful day.\n\nSince Maritime is lightly tied to Firespitter, this is entirely possible. One of the things Firespitter allows is multiple textures for the same part and it\u0027s easy enough to code. The problem is... time. I just updated the OP to include some donation buttons. There\u0027s also a spoiler that explains the difficulty I\u0027m having with textures and the time it\u0027s taking (and a sample of things to come). No offense, but if I\u0027m going to retexture the entire pack, first priority will be \u0027civilian\u0027 usage.\n\n**Edited \u003Ctime datetime=\u00222015-07-07T04:13:18Z\u0022 title=\u002207/07/2015 04:13  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 7, 2015\u003C/time\u003E by Fengist**"},{"CreatedByName":"Fengist","CreatedById":78435,"CreatedDateTime":"2015-07-07T05:03:37Z","Content":"\u003E \n\u003E Some very lovely command pods with quite excellent IVA\u0027s popped up on CKAN this morning (But have existed for awhile, I guess), so at the very least there are SOME people out there doing it.\n\u003E \u003E [http://forum.kerbalspaceprogram.com/threads/125114-1-0-2-Super-100-Shooting-Star-Super-67-Little-Star-Command-Pods](https://forum.kerbalspaceprogram.com/threads/125114-1-0-2-Super-100-Shooting-Star-Super-67-Little-Star-Command-Pods)\n\nThere are some out there, without a doubt. Most though seem to be making them for their own mods. Eventually, I\u0027ll get the hang of it and get them online. \n\n\u003E \n\u003E I haven\u0027t used this mod and I\u0027m not sure if I will but it all looks very nice.\n\u003E \n\u003E I also enjoyed your circumnavigation stories, they were quite good.\n\nWell, I wish they had both turned out different. TBH, wanting to actually do a SAIL circumnavigation around Kerbin was one of the reasons I started this whole modding business.\n\n- - - Updated - - -\n\n\u003E \n\u003E I think at this time bigger boats would be an easier option, as iva\u0027s are, in the grand scheme of things not the endgame of everything and placeholder/stock i think would be finne.\n\nI wouldn\u0027t have guessed it but looking at the initial poll results would confirm that most people think like you.\n\n\u003E \n\u003E FYI, i prefer your models/textures over InfiniteDice\u0027s. Yours seem to fit with the game better. \n\u003E P.S maybe make the yacht towers lights texture look more yellow for when turned on, it becomes hard to see the windows.\n\nDice admits he\u0027s not a texture guy nor is he an IVA guy. He seems to be pretty good at code. And that\u0027s the problem with modding. In order to create a great mod, you have to be both right and left brained. You have to be someone who can imagine a concept for a part, design that part with great 3d models, create a logical, working UV layout, paint that layout to artistically acceptable standards, animate parts in both Unity and outside 3D animation programs when Unity isn\u0027t enough, guess at half of what the key/value pairs are in the .cfg files because Squad doesn\u0027t document things for modders AND... comprehend the KSP API and write code in C#.\n\nDunno if you\u0027ve looked closely at nerds, but they paint with crayons. They program well, paint with crayons. And artists, well, we all know they use Apple products to insulate them from nerdy Linux commands. Those lines rarely blur. But to mod? It takes someone really screwed up in the head to be able to do everything a modder needs to do. (I\u0027m lacking the C# only because I chose to program in Pascal and PHP).\n\nSo, to refer back to Dice, his textures may not \u0027fit the game\u0027 but that\u0027s only because he\u0027s... normal.\n\nI\u0027ll have a look at the lights ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)\n\n**Edited \u003Ctime datetime=\u00222015-07-07T05:23:01Z\u0022 title=\u002207/07/2015 05:23  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 7, 2015\u003C/time\u003E by Fengist**"},{"CreatedByName":"minepagan","CreatedById":132643,"CreatedDateTime":"2015-07-07T10:58:30Z","Content":"\u003E \n\u003E ...It takes someone really screwed up in the head to be able to do everything a modder needs to do...\n\nYAY!I have a chance to be a good modder some day!"},{"CreatedByName":"TUKE","CreatedById":119239,"CreatedDateTime":"2015-07-07T11:08:48Z","Content":"I had a look at doing some modding, and sorta pushed the big red shiny **NOPE!** button instead.\n\n- - - Updated - - -\n\nAnother thing, up the heat tolerance a bit on the cargo ship bridge. I use BD Armory, and have a modded gun that fires .303 calibre rounds. Said gun takes out the bridge in a few shots.\n\n- - - Updated - - -\n\nI think the thing that put me off InfiniteDice\u0027s parts is that a lot of them are very dark, where as the games parts are quite stock light. I appreciate that he may not be a top modder in terms of textures, but i am not putting him down just voicing my opinion because he has done some amazing work."},{"CreatedByName":"Mc_Jazza","CreatedById":126171,"CreatedDateTime":"2015-07-07T15:40:58Z","Content":"Just a suggestion, and In keeping with your thoughts on more modular, less needing instruction manuals (Pfft) in ksp boat parts. Perhaps instead of making another line of hulls that are larger, work on a solid bit of tweak scale compatibility, as it allows for many many more possibilities, and allows the kerbal engineer\u0027s little imaginations to run wild!\n\nJust an idea! (Thanks for an awesome, and well thought out mod!) ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"Mad Rocket Scientist","CreatedById":139256,"CreatedDateTime":"2015-07-07T17:37:23Z","Content":"So, I have an idea for a future content pack:\n\nProbe ships. About 1.25 meters wide, with solar panel covered decks and electric engines. Probe bridges, and smaller bitts and blisters. I don\u0027t know how well it would work, but I think it could make an interesting way of exploring planets."},{"CreatedByName":"Jatwaa","CreatedById":59627,"CreatedDateTime":"2015-07-08T21:00:46Z","Content":"Love this mod, fantastic, awesome super job on it. I was playing around with it and Tweakscale and got it to work, albeit my method utilized the Tweakscale wildcard fs\\_\\* and built my own cfg for it. \n\nTweakscale makes the carriers much easier to land on ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)"},{"CreatedByName":"Ruedii","CreatedById":57704,"CreatedDateTime":"2015-07-08T21:30:30Z","Content":"Might I suggest dividing the Yacht superstructure into two halves \n\nThe top one is 3 Kerbal a command module, that can function by itself for a smaller yacht, the second is a 6 Kerbal luxury crew cabin that can be attached underneath to make mega-yachts for wealthy CEOs like Jeb when they aren\u0027t flying rockets. You could even throw in a third bottom 12 kerbal layer for those really big giga-yachts. \n\nAnd of course, we can\u0027t forget the deck chairs (basically a stylized command chair with no control function to attach your extra kerbals in so they aren\u0027t on EVA when they are around the deck) and the hot tubs (same as the deck chairs but with bubbles!)"},{"CreatedByName":"AntiMatter001","CreatedById":100129,"CreatedDateTime":"2015-07-08T21:34:54Z","Content":"just wanted to say even for a 0.0.14 version i love it. i donated aswell and got a personal email back (which creeped me out a bit)\n\nhope you make many mods (or just continue to update this mod) as best you can ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)"},{"CreatedByName":"Fengist","CreatedById":78435,"CreatedDateTime":"2015-07-09T06:22:17Z","Content":"\u003E \n\u003E YAY!I have a chance to be a good modder some day!\n\nSeek therapy, before it\u0027s too late.\n\n- - - Updated - - -\n\n\u003E \n\u003E I had a look at doing some modding, and sorta pushed the big red shiny **NOPE!** button instead.\n\u003E - - - Updated - - -\n\u003E \n\u003E Another thing, up the heat tolerance a bit on the cargo ship bridge. I use BD Armory, and have a modded gun that fires .303 calibre rounds. Said gun takes out the bridge in a few shots.\n\u003E \n\u003E - - - Updated - - -\n\u003E \n\u003E I think the thing that put me off InfiniteDice\u0027s parts is that a lot of them are very dark, where as the games parts are quite stock light. I appreciate that he may not be a top modder in terms of textures, but i am not putting him down just voicing my opinion because he has done some amazing work.\n\nWell, I can up the heat but keep in mind, these are more or less civilian ships. Here\u0027s the difference. I was on a carrier. We pulled into port in France. While out on the town I met a Merchant Marine. He worked the sonar for a mine hunter (as he explained it the mines he hunted typically carried torpedos and had designations like kilo). He said his biggest fear was that a well place .50 cal round would sink the ship he was on. But I\u0027ll look into it.\n\nI started a to-do list at the bottom of the OP, you can check things I\u0027ve been asked to look into.. and I can remind myself to do them.\n\n- - - Updated - - -\n\n\u003E \n\u003E Just a suggestion, and In keeping with your thoughts on more modular, less needing instruction manuals (Pfft) in ksp boat parts. Perhaps instead of making another line of hulls that are larger, work on a solid bit of tweak scale compatibility, as it allows for many many more possibilities, and allows the kerbal engineer\u0027s little imaginations to run wild!\n\u003E Just an idea! (Thanks for an awesome, and well thought out mod!) ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nI have been considering it. One thing I know I\u0027ll have to complete before that is a retexture. I don\u0027t think the current textures blown up by 3x will look all that great. But tweakscale has been on the burner since pretty much day 1. Just haven\u0027t had time to really dig into it yet.\n\nAnd YW.\n\n- - - Updated - - -\n\n\u003E \n\u003E So, I have an idea for a future content pack:\n\u003E Probe ships. About 1.25 meters wide, with solar panel covered decks and electric engines. Probe bridges, and smaller bitts and blisters. I don\u0027t know how well it would work, but I think it could make an interesting way of exploring planets.\n\nI spotted this suggestion not long after you posted it. And I try to answer every post but I try not to answer posts on a daily basis, that way I can kinda get to all of them in one big reply and think before I open my mouth. So I\u0027ve had a couple of days to think on this. So far two ideas have hit, one kinda ho-hum and the other kinda...whut?\n\nThe ho-hum idea would be along the lines of proposals to explore Europa... a probe that would melt ice and hopefully find an ocean below to explore. With that thought, I came up with the idea of 2 parts. \n\n- A flotation device with lights and compressed water tanks.\n- A miniature compressor/decompressor\n\nBasically, you\u0027d land it on Eve, Laythe or Kerbin in the water. Turn on the compressor, turn on the lights and it starts diving.\n\nKinda ho-hum but easy to build.\n\nThe other idea, which would be a good bit more complex, was a small boat that\u0027s launched in a round or square shape and once reaching the destination, it unfolds into a very, very basic boat. Something with a puny electric engine that you could slap some goo containers on. Haven\u0027t worked that all out in my head but I like the idea.\n\n- - - Updated - - -\n\n\u003E \n\u003E Love this mod, fantastic, awesome super job on it. I was playing around with it and Tweakscale and got it to work, albeit my method utilized the Tweakscale wildcard fs\\_\\* and built my own cfg for it. \n\u003E Tweakscale makes the carriers much easier to land on ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\nSweet.\n\nYea, I think I\u0027ve gotten around to naming everything with the fs\\_ so that probably made it easy. Especially since modders aren\u0027t supposed to use underscores in the part names (woops).\n\nSo my question is, how horrid does everything look?\n\nIf you\u0027ve got the .cfg, mind msg\u0027ing me a copy of it. If it works and the parts look eh... acceptable, I\u0027ll put it in the next pack.\n\n- - - Updated - - -\n\n\u003E \n\u003E Might I suggest dividing the Yacht superstructure into two halves \n\u003E The top one is 3 Kerbal a command module, that can function by itself for a smaller yacht, the second is a 6 Kerbal luxury crew cabin that can be attached underneath to make mega-yachts for wealthy CEOs like Jeb when they aren\u0027t flying rockets. You could even throw in a third bottom 12 kerbal layer for those really big giga-yachts. \n\u003E \n\u003E And of course, we can\u0027t forget the deck chairs (basically a stylized command chair with no control function to attach your extra kerbals in so they aren\u0027t on EVA when they are around the deck) and the hot tubs (same as the deck chairs but with bubbles!)\n\nI can\u0027t say you\u0027re reading my mind but, I like the basic front styling of the yacht, I dislike the rear. While doing the texture rework I\u0027ve already been considering a 3rd remodel of the yacht. While in principle, I like the idea of a layered bridge, keep in mind, these are mono-hull designs. There\u0027s a reason many people who make stock boats make pontoons. Mono-hulls flip over easy. And, the taller you make them, the easier they are to flip.\n\nAs for the hot tub... humm... how do you do water like in the astronaut complex? Hummmmm...\n\nLounge chairs. I got it. \n\n![247cbe098a48da55214605d96aeda2b5.jpg](https://s-media-cache-ak0.pinimg.com/736x/24/7c/be/247cbe098a48da55214605d96aeda2b5.jpg)\n\n- - - Updated - - -\n\n\u003E \n\u003E just wanted to say even for a 0.0.14 version i love it. i donated aswell and got a personal email back (which creeped me out a bit)\n\u003E hope you make many mods (or just continue to update this mod) as best you can ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\nThanks Jake! Glad you like me lil boats and as long as the community keeps motivating me, I\u0027ll keep shuffling pixels around. I\u0027m glad to hear that e-mail worked. I didn\u0027t exactly have a way to test it so I wrote the .php script and crossed my fingers. It works off the paypal Instant Payment Notification (IPN).\n\nHope the mail din freak you out too much. I wanted to be sure donors knew that it went to the right place and that I\u0027m very grateful. One advantage of donating, you now know how to contact me outside the forums should you wish.\n\nThanks again.\n\nAnd now.... for the reason I started this post. A quick progress update.\n\nSince it looks like IVA\u0027s are on the bottom of the list (can\u0027t say you guys disappointed me with that one) I\u0027ve decided that before plowing off into a whole new collection of models for larger boats, I need to fix what I have, make it a \u0027final\u0027 product and then, stop fiddling with it. Then I can move on to bigger boats and more fun parts.\n\n\u003Ciframe width=\u0022640\u0022 height=\u0022480\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022\u0022\u003E\u003C/iframe\u003E\n\nSo, here\u0027s the current state of a retexture. These two parts, the clipper bow and hull, represent about 10 hours worth of work and it\u0027s still not right. One of the problems I\u0027m having, are the sculpers. It seems that shading and texturing programs, like Unity, don\u0027t appreciate it when you punch holes in your models. Since creating the sculpers, they\u0027ve had an odd shading around them. It\u0027s due to the way 3D moddeling works. Everything gets turned into triangles. A sculper is a circle inside a square. (In the model above you can open \u0027rendering options\u0027 and click on the wireframe color and it\u0027ll show the model\u0027s wire frame. Note the two forward holes in the bow deck have an extra circle.) It doesn\u0027t make for good triangles. So, when light hits it, reflections get cast in all sorts of strange directions. The process now is to break it all down into smaller and smaller bits by adding more polygons and thus, smaller surfaces for those strange shadows to get cast off of. Well, that\u0027s the theory I\u0027ve been told. I wished it worked that day. They\u0027re still not coming out right.\n\nYou\u0027ll also note, this model is vertical. KSP expects everything to be built vertically. I guess there are no horizontal rockets. So, I\u0027ve had to build my boats vertically. The model above is a direct export from Wings 3D (the 3d modeller I use).\n\nNext problem is curvature and seams. Guys who mod rockets have life pretty easy. Their stuff is mostly tall, round and flat. In order to hide ugly seams between parts, they can put goofy things in there to distract you from the seam (which is why the [orange rockomax tank looks like a soda can](https://forum.kerbalspaceprogram.com/threads/115747-Poster-Making-Challenge-%28Recruitment-Posters%29?p=1845087\u0026viewfull=1#post1845087)). Boats are mostly seamless (except for maybe welds) Boats also curve in all sorts of odd angles. Making a waterline look even from stem to stern is... a bit of a challenge. And adding text to a surface that bends in all 3 directions is another fun bit.\n\nAnd, since the current prop is pretty crude, here\u0027s one I tinkered with. Not sure if it\u0027ll make production but it\u0027s looking better. This one has a lot of polygons though. I try to keep the count a lot lower than this. But, to look good, takes polygons. (btw, this is a horrid jpg, it looked better in my modeller). Why a new prop? The stern will get a minor workover when I get to it for textures. The current prop location was a quick fix. I intend to put it where it belongs, under the boat.\n\n![PropScreenshot.jpg](http://www.datainterlock.com/Kerbaltopia/Maritime%20Pack/PropScreenshot.jpg)\n\n**Edited \u003Ctime datetime=\u00222015-07-09T07:17:25Z\u0022 title=\u002207/09/2015 07:17  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 9, 2015\u003C/time\u003E by Fengist**"},{"CreatedByName":"TUKE","CreatedById":119239,"CreatedDateTime":"2015-07-09T09:58:35Z","Content":"The reason why i brought up the heat tolerance of the bridge is because when used with the RoRo bow it makes quite a convincing landing craft. As such i drove (Mechjeb drove) a tank to the shore and found that it just squeezed through the gap, so i loaded it. I then piloted the ship out a bit and got out my new Westland Lysander (I also landed it on a carrier [here](http://steamcommunity.com/sharedfiles/filedetails/?id=477336745)) and told it to attack the tank(the Lysander only has 2 .303\u0027s). The few first stray shots destroyed the bridge and disabled the ship? Huh, ![;.;](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif)."},{"CreatedByName":"HiAmerica","CreatedById":144813,"CreatedDateTime":"2015-07-09T17:04:49Z","Content":"A message to Fengist\n\n1. The new texturing looks totally awesome\n\n2. If you could make a few new textures, (red and black cargo ship, gray navy ship) that can be swapped out for the default using the firespitter texture switch, just in your spare time or down the road, that would be super awesome. \n\n3. Tweakscale. Tweakscale support is something that I think really should be added.\n\nJust my opinion."},{"CreatedByName":"Mad Rocket Scientist","CreatedById":139256,"CreatedDateTime":"2015-07-09T18:29:53Z","Content":"Your new textures look awesome! You\u0027ve inspired me to start modding, I just installed wings 3D, and am about to start following beale\u0027s instructions."},{"CreatedByName":"Jatwaa","CreatedById":59627,"CreatedDateTime":"2015-07-09T18:56:12Z","Content":"So in my testing with Tweakscale, mind you I have better buoyancy installed, I found that\n\n1. Awesome but eats RAM (Not the mods fault, fully KSP)\n2. Needs a bigger hangar...had to install a mod to increase the size\n3. I suppose that 5m was a bit big but it loads (and it was epic)\n4. Bounce...it bounces when loaded. Must use blisters.\n5. \n\nKeep in mind, I went way too big. \n\nI used a simple method for Tweakscale. No real limits on size either.\n\n@PART[FS\\_\\*]\n\n{\n\n MODULE\n\n {\n\n name = TweakScale\n\n defaultScale = 1\n\n type = stack\n\n }\n\n}\n\n@PART[FS\\_\\*]\n\n{\n\n MODULE\n\n {\n\n name = TweakScale\n\n defaultScale = 1\n\n type = surface\n\n }\n\n}\n\nThe CFG I use is stored here: [https://www.dropbox.com/s/ikd9x6xuafiqvt6/Maritime_TweakScale.cfg?dl=0](https://www.dropbox.com/s/ikd9x6xuafiqvt6/Maritime_TweakScale.cfg?dl=0)\n\nThe call is a bit of a duplicate. KSP will ping it for a duplicate, pretty sure that only one is required, but I never did remove the second. \n\nOnly thing I would like would be higher heat resistance. I created a crazy contraption that works but it is a bit nutty. Perhaps an electric placeable propeller? I tried the FS electric prop, no go. Without the requirement of intake air it could be usable over in Laythe \u0026 Eve. \n\nI saw the pic of the IVA so that is coming. \n\nI tried to make a sub on Laythe but the compressed water didn\u0027t fill. Are they viable for other planet usage?\n\n**Edited \u003Ctime datetime=\u00222015-07-09T19:00:51Z\u0022 title=\u002207/09/2015 07:00  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 9, 2015\u003C/time\u003E by Jatwaa**\n  \nadded link to cfg"},{"CreatedByName":"Wolfox","CreatedById":59958,"CreatedDateTime":"2015-07-09T19:08:27Z","Content":"I would really, really like to use your mod, but unfortunately my RAM limit is overflowing as it is :-( maybe when 1.1 comes out with 64-bit support, until then, I will definitely keep an eye on your mod, cause its so awesome! I wish you alot of patience and keep up the enthusiasm!"},{"CreatedByName":"HiAmerica","CreatedById":144813,"CreatedDateTime":"2015-07-09T23:25:42Z","Content":"\u003E \n\u003E Your new textures look awesome! You\u0027ve inspired me to start modding, I just installed wings 3D, and am about to start following beale\u0027s instructions.\n\nSame here Fengist, pass on my thanks to him."},{"CreatedByName":"Kilmeister","CreatedById":65062,"CreatedDateTime":"2015-07-10T03:59:04Z","Content":"Well I downloaded this pack as a goof when I found it trying to figure out a buoyancy problem with an Eve lander. So I built an aircraft carrier and a boat and messed around for a bit, then I decided to go back to my \u0022Serious\u0022 save and figure out my lander. Only then did I find the part \u0022Inflatable Dinghy\u0022... A few clicks later an my problems were solved...\n\nI present to you: The Eveboat! Soon will be making another run!\n\n![kyixzDO.png](http://i.imgur.com/kyixzDO.png)"},{"CreatedByName":"jojojona","CreatedById":136107,"CreatedDateTime":"2015-07-10T20:04:31Z","Content":"Your mod, is awesome! I wish I was as good at modding as you...\n\nYou should consider making hollow boat parts of some sort, it would be fun! Also an extra wide rocket launching platform would be cool, then you could finally launch your rockets from the water! (Of course it should have a very high heat resistance, otherwise it would explode when you launch the rocket.)\n\nP.S\n\nDid I already say that I really love your mod?\n\nIf not so, I really love your mod!"},{"CreatedByName":"Thatdude253","CreatedById":140179,"CreatedDateTime":"2015-07-11T07:51:18Z","Content":"\u003E \n\u003E Your mod, is awesome! I wish I was as good at modding as you...\n\u003E You should consider making hollow boat parts of some sort, it would be fun! Also an extra wide rocket launching platform would be cool, then you could finally launch your rockets from the water! (Of course it should have a very high heat resistance, otherwise it would explode when you launch the rocket.)\n\u003E \n\u003E P.S\n\u003E \n\u003E Did I already say that I really love your mod?\n\u003E \n\u003E If not so, I really love your mod!\n\nThis is a good idea. Some ship parts with deep cargo capability, make it precisely like 8x4 meters or something so by using 1x1 or 2x2 structural pieces it could be roofed"},{"CreatedByName":"Renousim","CreatedById":92441,"CreatedDateTime":"2015-07-12T01:01:14Z","Content":"Are you able to allow the hulls to use tweakscale for now?"},{"CreatedByName":"minepagan","CreatedById":132643,"CreatedDateTime":"2015-07-12T01:02:59Z","Content":"\u003E \n\u003E Are you able to allow the hulls to use tweakscale for now?\n\nSomeone posted their own CFG for it on the last page...."},{"CreatedByName":"Fengist","CreatedById":78435,"CreatedDateTime":"2015-07-12T02:59:34Z","Content":"\u003E \n\u003E The reason why i brought up the heat tolerance of the bridge is because when used with the RoRo bow it makes quite a convincing landing craft. As such i drove (Mechjeb drove) a tank to the shore and found that it just squeezed through the gap, so i loaded it. I then piloted the ship out a bit and got out my new Westland Lysander (I also landed it on a carrier [here](http://steamcommunity.com/sharedfiles/filedetails/?id=477336745)) and told it to attack the tank(the Lysander only has 2 .303\u0027s). The few first stray shots destroyed the bridge and disabled the ship? Huh, ![;.;](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif).\n\nWhile I do make a lot of explosions in KSP, they\u0027re mostly unintentional. I save combat stuff for PVP games. Soooo, I had no idea. Will look into it."}]}