{"TopicId":112749,"ForumId":16,"TopicTitle":"Control of the one ship cause other ship move","CreatedByName":"Woquit","CreatedById":146137,"CreatedDateTime":"2015-06-12T11:53:03Z","PageNum":1,"Articles":[{"CreatedByName":"Woquit","CreatedById":146137,"CreatedDateTime":"2015-06-12T11:53:03Z","Content":"\n\u003Cp\u003EHello!\u003C/p\u003E\u003Cp\u003EI faced with the problem which I can\u0027t manage, so asking for your help. I have one ship orbiting Kerbin. It has returned from a long journey and I want to land it, but I forgot to put enough parachutes. So I made another ship with a lot of parachutes and a claw, lunch it to orbit and made randezvous. But when I get closer to make docking I realized that the first ship is rotating when I rotate the ship I am currently controlling. It\u0027s like I am controlling both ships simultaneously.\u003C/p\u003E\u003Cp\u003EDid anyone faced with the same problem and maybe has workaround for this?\u003C/p\u003E\n"},{"CreatedByName":"Ferdoni","CreatedById":140765,"CreatedDateTime":"2015-06-12T11:58:40Z","Content":"\n\u003Cp\u003EI got the same problem once. I personally think it\u0027s a bug because when I redid the rendevouz operation, it didn\u0027t happen again.\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2015-06-12T12:46:59Z","Content":"\n\u003Cp\u003EIt is a known but rare bug.\u003C/p\u003E\u003Cp\u003EYou could ask in the support forum about it - I\u0027ve personally never seen it happen.\u003C/p\u003E\n"},{"CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-06-12T13:14:23Z","Content":"\n\u003Cp\u003EYes, it\u0027s happened to me in a similar situation in v90; a lander undocked from its Minmus orbiter, landed and returned, then both ships repsonded to control inputs. \u003C/p\u003E\u003Cp\u003EMy workaround was to get one ship oriented for docking, then disable its reaction wheels and turn off SAS. Then control the second ship and dock to the first.\u003C/p\u003E\n"}]}