{"TopicId":112803,"ForumId":16,"TopicTitle":"Interstage fairing question","CreatedByName":"Kelderek","CreatedById":131312,"CreatedDateTime":"2015-06-12T23:06:08Z","PageNum":1,"Articles":[{"CreatedByName":"Kelderek","CreatedById":131312,"CreatedDateTime":"2015-06-12T23:06:08Z","Content":"\n\u003Cp\u003EIs there any rhyme or reason for which parts can have a fairing close on them? I have a fairing that I tried to close on a whole bunch of different things and it refused to offer up the \u0022close fairing\u0022 option for any of them. They were all 2.5m parts. I tried the ISRU, the large ore storage tank, both the 2.5m decoupler and stack separator, the smallest 2.5m fuel tank, another 2.5m fairing base, a clamp-o-tron sr., and a 3.75m heat shield. None of these would allow a fairing to close on them.\u003C/p\u003E\u003Cp\u003EI didn\u0027t have anything obstructing the fairing for this, I was able to place cross sections all around, but I just couldn\u0027t close the fairing against any of those parts. Am I missing something here?\u003C/p\u003E\n"},{"CreatedByName":"kStrout","CreatedById":116630,"CreatedDateTime":"2015-06-12T23:22:46Z","Content":"\n\u003Cp\u003EI have never had problems with it, sometimes you need to point your mouse above where you want it to close and just experiment until you get the close fairing option. And I don\u0027t know if you know this but when closing interstage fairings they option will be blue, not green.\u003C/p\u003E\n"},{"CreatedByName":"DeMatt","CreatedById":90539,"CreatedDateTime":"2015-06-12T23:32:32Z","Content":"\n\u003Cp\u003EThe ISRU and the heat shield don\u0027t permit for surface attachment, so I\u0027m not surprised they don\u0027t permit a fairing to close on them.\u003C/p\u003E\u003Cp\u003EI was able to get fairings to close on the other parts. Straight fairings, with no angle inwards or outwards, can close on the rims; angled fairings coming inwards can close on the sides or rims; angled fairings opening outwards can\u0027t close at all.\u003C/p\u003E\u003Cp\u003EBeyond that, we\u0027d have to see the fairing you\u0027re trying to build in order to replicate it.\u003C/p\u003E\n"},{"CreatedByName":"xtoro","CreatedById":79015,"CreatedDateTime":"2015-06-13T03:24:39Z","Content":"\n\u003Cp\u003EI\u0027ve had fairings close on heat shields multiple times. I don\u0027t have the ISRU yet so I can\u0027t confirm that. Are you using any modded parts that you\u0027re trying to enclose?\u003C/p\u003E\n"},{"CreatedByName":"cybersol","CreatedById":81136,"CreatedDateTime":"2015-06-13T04:16:44Z","Content":"\n\u003Cp\u003EFairing closing can be annoying to me as well. Some things I noticed are that once it goes orange it tends to stay orange, even when it would have been green if it never went orange first. Another is that sections need to be some minimum size or you can\u0027t seem to close them. Still, I spent 5 minutes once trying to get a fairing to close again at the same place it closed before after I changed something minor. After that is when I decided to test if they were even worth adding for Kerbin ascent (not really).\u003C/p\u003E\n"}]}