{"TopicId":112910,"ForumId":18,"TopicTitle":"Skype Group Chat for KSP?","CreatedByName":"o Atomsk","CreatedById":145909,"CreatedDateTime":"2015-06-14T04:29:07Z","PageNum":1,"Articles":[{"CreatedByName":"o Atomsk","CreatedById":145909,"CreatedDateTime":"2015-06-14T04:29:07Z","Content":"Long time lurker of the forums and finally decided to register to create this thread. \n\nI\u0027ve noticed a lot of like minded people on this forum, enough that I got an idea. I was going to suggest creating a Skype group where a lot of us can talk and get to know one another in real time. I figure since we\u0027re all fans of KSP here we all probably enjoy some kind of space games, physics, science, space, etc. We could make a lot of friends with each other that way. I am in my mid 20s, just graduated from University, and been looking for people who have just the same amount of passion for these kind of games (or programming in general). It\u0027d be nice if there were people of all the same age group (someone could make a Skype chat that\u0027s for high schoolers, college goers, etc). I don\u0027t know if this will have a good reception, but I just wanted to throw that out there for any of you that could be interested.\n\nIf you\u0027re interested, please send me a message of your Skype name, and we can get you added!\n\n**Edited \u003Ctime datetime=\u00222015-06-20T02:39:16Z\u0022 title=\u002206/20/2015 02:39  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 20, 2015\u003C/time\u003E by o Atomsk**"},{"CreatedByName":"ZedNova","CreatedById":57175,"CreatedDateTime":"2015-06-14T18:58:18Z","Content":"That\u0027s a good idea, also, we have a unofficial steam group. People are in the chat usually all the time."},{"CreatedByName":"Pixel of Life","CreatedById":45646,"CreatedDateTime":"2015-06-14T22:15:32Z","Content":"\u003E \n\u003E That\u0027s a good idea, also, we have a unofficial steam group. People are in the chat usually all the time.\n\n\\*The members who actually use the group chat - there\u0027s 85 people in the group but only like 10 of them regularly visit the chat ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)\n\nBut yeah this skype thing is definitely a good idea - I hate not being able to use the group chat when I\u0027m not at home (stupid steam mobile app doesn\u0027t support group chats). Whatsapp could also be an option, but it needs your phone number so some people might not like that.\n\nE: And there\u0027s also the KSP IRC - this would probably be the easiest option since it works great on computers as well as mobile devices.\n\n**Edited \u003Ctime datetime=\u00222015-06-14T22:20:00Z\u0022 title=\u002206/14/2015 10:20  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 14, 2015\u003C/time\u003E by CaptainKorhonen**"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2015-06-14T22:32:46Z","Content":"Dedicated age groups wouldn\u0027t work. I\u0027m saying that from my experience. Official KSP Steam group is a wasteland where rarely anyone speaks anything, and the KSP Forum Steam group is usually little over ten people. I don\u0027t even know why do people join groups if they don\u0027t want to use them."},{"CreatedByName":"o Atomsk","CreatedById":145909,"CreatedDateTime":"2015-06-20T02:35:59Z","Content":"Oh? Where can I find these places? Is there a sticky that I missed to pick these up? If there\u0027s a group, I can extend this offer and create a Skype group where we can all get to know each other, post crazy cool links, and talk about KSP among other things.\n\nI\u0027d air it out, and just make a nice real-time chat for everyone. Anyone can add at will, if they can."},{"CreatedByName":"Kagame","CreatedById":141304,"CreatedDateTime":"2015-06-20T23:58:12Z","Content":"I\u0027d be glad to join. My handle is vashir0."},{"CreatedByName":"Treble Sketch","CreatedById":135941,"CreatedDateTime":"2015-08-22T17:18:17Z","Content":"Just putting it here:\n\nMy Skype is \u0022treblesketch\u0022\n\nSteam is [https://steamcommunity.com/id/ILM126](https://steamcommunity.com/id/ILM126)\n\nAnd I forgot my IRL :|"}]}