{"TopicId":112931,"ForumId":16,"TopicTitle":"SSTO assent","CreatedByName":"mrmcp1","CreatedById":79657,"CreatedDateTime":"2015-06-14T11:26:28Z","PageNum":1,"Articles":[{"CreatedByName":"mrmcp1","CreatedById":79657,"CreatedDateTime":"2015-06-14T11:26:28Z","Content":"\n\u003Cp\u003EI finally managed to get an SSTO into orbit in the 1.02 update but it only had 557m/s of delta V once in orbit and I have seen smaller SSTO\u0027s get similar performance so I was wondering what kind of assent profile I should use.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/b2f3o\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E ssT\u003Cp\u003EMy current assent profile is get up to 10,000m at 25 degrees then pitch down to 10 degrees and gain speed. Once I stop gaining speed I pitch up to 25 degress and go closed cycle on the rapiers, I then get into orbit as normal. My question is how should I change my assent profile to gain more delta V in orbit. \u003C/p\u003E\u003Cp\u003EDownload link for the SSTO: \u003Ca href=\u0022https://www.dropbox.com/s/kawgce8jy3waj5k/1_3.craft?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/kawgce8jy3waj5k/1_3.craft?dl=0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThanks for the help\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-15T15:42:58Z\u0022 title=\u002206/15/2015 03:42  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 15, 2015\u003C/time\u003E by mrmcp1\u003C/strong\u003E\n\u003Cbr\u003EQuestion was answered\n\u003C/span\u003E\n"},{"CreatedByName":"Orbital Vagabond","CreatedById":145561,"CreatedDateTime":"2015-06-14T13:33:56Z","Content":"\n\u003Cp\u003EHow much Vacuum dV does your SSTO start with? It sounds like your profile is already pretty efficient.\u003C/p\u003E\n"},{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2015-06-14T13:55:13Z","Content":"\n\u003Cp\u003EI\u0027m not an SSTO expert and I tend to build SSTO\u0027s that use a combination of TurboJet and regular rocket engines rather than rapiers, but this is my ascent profile;\u003C/p\u003E\u003Cp\u003EPitch to 45 degrees after takeoff and climb to 10km, then pitch down to ~20 degrees. I then stay on that pitch until I\u0027m no longer accelerating and then fire up the rocket engines (leaving the TurboJets running until they flame out). At this point I maintain pitch, sometimes I switch on prograde hold and just let the craft naturally pitch down slowly. This seems to work pretty well for me.\u003C/p\u003E\u003Cp\u003EFairly similar to your ascent, but I climb to 10km faster, and overall maintain a steeper pitch.\u003C/p\u003E\u003Cp\u003EThis is one of the TurboJet SSTOs I use this profile for: \u003Ca href=\u0022http://kerbalx.com/katateochi/TurboJet-CrewSSTO\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalx.com/katateochi/TurboJet-CrewSSTO\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-06-14T14:08:52Z","Content":"\n\u003Cp\u003Emrmcp1,\u003C/p\u003E\u003Cp\u003E Honestly, that\u0027s more than plenty of DV for LKO ops. I\u0027m kinda puzzled as to why you would want more.\u003C/p\u003E\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"},{"CreatedByName":"MarvinKitFox","CreatedById":99545,"CreatedDateTime":"2015-06-14T16:13:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mrmcp1\u0022 data-cite=\u0022mrmcp1\u0022\u003E\u003Cdiv\u003ESSTO assent\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI guess the best way to get an SSTO\u0027s assent is to buy it flowers. Although chocolates may work too.\u003C/p\u003E\u003Cp\u003EIf however you need to improve your SSTO ascent... well, you\u0027re on your own, I\u0027m a rocket man.\u003C/p\u003E\n"},{"CreatedByName":"mrmcp1","CreatedById":79657,"CreatedDateTime":"2015-06-14T16:16:23Z","Content":"\n\u003Cp\u003EThanks, I didn\u0027t realise my profile was already pretty good (still used to 0.90 SSTO\u0027s)\u003C/p\u003E\n"},{"CreatedByName":"Mic_n","CreatedById":27054,"CreatedDateTime":"2015-06-14T20:29:56Z","Content":"\n\u003Cp\u003E\u0022Ascent\u0022\u003C/p\u003E\u003Cp\u003E(\u0022Assent\u0022 is to agree with something.. generally in a formal/official kinda way.)\u003C/p\u003E\u003Cp\u003E...and \u0022it depends.\u0022\u003C/p\u003E\u003Cp\u003EI haven\u0027t messed with rapiers much yet (career mode, not that far up the tree), but with my ramjet/rocket combos I\u0027ve found it varied with thrust:weight at various points. I like to aim for \u0026gt;1km/s at 20km with my prograde at around 20 degrees.. The speed and angle there gives you plenty of time to accelerate with those rockets and build up your orbital speed without needing to waste dV burning too far above your prograde marker to raise your Ap.\u003C/p\u003E\n"},{"CreatedByName":"cybersol","CreatedById":81136,"CreatedDateTime":"2015-06-14T21:13:17Z","Content":"\n\u003Cp\u003EMy lifter spaceplane ascents to LKO go like this:\u003C/p\u003E\u003Cp\u003E- Lift off\u003C/p\u003E\u003Cp\u003E- 10-20* pitch up until speed above 270 m/s\u003C/p\u003E\u003Cp\u003E- Raise pitch to maintain speed below 290 m/s (high drag above this speed)\u003C/p\u003E\u003Cp\u003E- At 10-14km, pitch down to 0-5* and accelerate until 500 m/s\u003C/p\u003E\u003Cp\u003E closer to 10km for only turbojets and to 14km for only rapiers\u003C/p\u003E\u003Cp\u003E- Slowly raise pitch to 15* while building speed\u003C/p\u003E\u003Cp\u003E 5* pitch up per 50 m/s speed increase above 500 m/s seems to work well\u003C/p\u003E\u003Cp\u003E- Grab the last bit of airbreathing speed by pitching back down to 5-10* upslope\u003C/p\u003E\u003Cp\u003E Do this around 17km for turbos and 20km for rapiers\u003C/p\u003E\u003Cp\u003E- As soon as your speed indicator stops going up, punch the rockets and/or switch modes on the rapiers\u003C/p\u003E\u003Cp\u003E- Get out of dodge by aiming at 20* upslope until 32km\u003C/p\u003E\u003Cp\u003E- After 32km follow the top of prograde marker until your at 5-6* pitch\u003C/p\u003E\u003Cp\u003E- Cruise until your desired apoapsis\u003C/p\u003E\u003Cp\u003E- Cruise out of atmospshere to apoapsis and circularize\u003C/p\u003E\u003Cp\u003EYou don\u0027t have to do all that exactly, but its what I do when efficiency is more important than lackadaisical piloting.\u003C/p\u003E\n"},{"CreatedByName":"Mic_n","CreatedById":27054,"CreatedDateTime":"2015-06-15T02:20:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cybersol\u0022 data-cite=\u0022cybersol\u0022\u003E\u003Cdiv\u003EMy lifter spaceplane ascents to LKO go like this:\u003Cp\u003E- Grab the last bit of airbreathing speed by pitching back down to 5-10* upslope\u003C/p\u003E\u003Cp\u003E Do this around 17km for turbos and 20km for rapiers\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have to wonder about this theory...\u003C/p\u003E\u003Cp\u003EBecause you\u0027re diving to gain speed, but that doesn\u0027t necessarily translate into velocity. It\u0027s going the wrong way. Yes you can pull up and climb afterward, but that\u0027s going to bleed off a fair chunk of that speed anyway, plus it\u0027s more time spent down in the drag of the atmosphere, and it\u0027s more dV lost to steering. I\u0027m thinking it\u0027s more efficient to just hold as much of a straight line as is possible.. if you\u0027re not getting enough speed, you don\u0027t have enough engine. Yes you\u0027ll burn fuel quicker, but you\u0027ll get there sooner.\u003C/p\u003E\n"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-06-15T07:57:46Z","Content":"\n\u003Cp\u003E@Cybersol, I would agree with Mic_n : diving may not be very efficient. I did that in my first SSTO designs and I found white hard to pull up without loosing too much speed (or stopping accelerating) or damaging the trajectory.\u003C/p\u003E\u003Cp\u003EI upgraded the engin part and added a turbojet to the 2 rapiers. I could get faster more quicky while pitching from 0 to \u002B5Ã‚Â°. Ascent went much smoother, even the plane is heavier.\u003C/p\u003E\n"},{"CreatedByName":"ajburges","CreatedById":26570,"CreatedDateTime":"2015-06-15T11:11:30Z","Content":"\n\u003Cp\u003EI think dive is a bit of a misnomer here. Maintaining a heading on the horizon (-5Ã‚Â° min) should be enough of a dive. The important bit is to stop wasting thrust fighting both gravity and transonic drag. Even my turbo jet SSTOs flatten out to go super sonic so they can hit the power band sooner.\u003C/p\u003E\u003Cp\u003EThe point of diving is to overcome transonic drag. Once you hit 600 m/s you have completely left the drag wall and can pull up gradually. You must keep speed above 600 m/s while pulling out; if it drops below that number you lost the energy the dive was to generate.\u003C/p\u003E\u003Cp\u003EIf it takes more fuel mass to recover altitude than an extra engine, then you probably needed that engine anyway. The dive and recovery will cost a max of 20 units/engine or .1 t/engine\u003C/p\u003E\u003Cp\u003EOnce you enter anerobic mode, those aerobic engines are just eating away at your payload mass fraction. That\u0027s more payload, vacuum dV, or funds you are tossing away.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-15T11:13:45Z\u0022 title=\u002206/15/2015 11:13  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 15, 2015\u003C/time\u003E by ajburges\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-06-15T11:28:06Z","Content":"\n\u003Cp\u003ETrue, \u0022dive\u0022 is merely folowing prograde to minimise drag. That don\u0027t change the fact that pulling up can be hard. You may loose some of your speed (or al least stop accelerating) and you can wreck your trajectory.\u003C/p\u003E\u003Cp\u003EMy usual ascent path is climbing to 10km at \u002B45Ã‚Â°, then \u002B20Ã‚Â° then follow prograde until (on SAS). I usually acheeve 600m/s when at 0Ã‚Â°. I can pullup to 5 or 10Ã‚Â° to build up until 1000m/s. Then I pull up harder \u002B20Ã‚Â° (to cool down and get higher than I can at 1200m/s). Continuing after close cycle (24km). Finally continuing prograde after 35/38km. \u003C/p\u003E\u003Cp\u003EI may have a higher TWR though.\u003C/p\u003E\n"},{"CreatedByName":"Mic_n","CreatedById":27054,"CreatedDateTime":"2015-06-16T03:08:55Z","Content":"\n\u003Cp\u003EIt\u0027s not transonic drag. It \u003Cem\u003Eseems\u003C/em\u003E like it, but it\u0027s not.\u003C/p\u003E\u003Cp\u003EIt\u0027s the engines. They have envelopes. The turboramjet works very much like an actual ramjet. It needs to be going fast before it can deliver peak thrust. What people see in here as a transonic barrier is really more that their engines aren\u0027t going fast enough to start delivering the power required to make them go faster. The \u0027dive\u0027 adds speed, which adds engine power, which adds more speed. It\u0027s nothing to do with the sound barrier and everything to do with the mechanics of how the engines work. Turbojets power up at lower speeds than turboramjets, which power up at lower speeds than rapiers. That\u0027s why adding a \u0022lesser\u0022 engine to your stack can boost the performance and get you up over the line.\u003C/p\u003E\u003Cp\u003EThe SSTOs I\u0027m using mostly in my career at the moment are both turboram driven with 909s. My lightest one, useful for launching probes of around 1t uses one and a 909. Not as good a TWR as a 45 but lighter and more efficient (at 20km the ISP is very near vac numbers anyway.) The drawback is that with less thrust you need a longer burn with less margin to muck about, especially with heavier payloads onboard. I like to be heading at ~900-1km/sec (more is better) at 20km at an angle of around 20 degrees. That\u0027ll generally give me a time to Ap around a minute.. That gives me time to accelerate with only a minimal deflection from prograde to hold my Ap out in front and keep it rising while I get up to escape velocity.\u003C/p\u003E\u003Cp\u003ESo yeah.. I\u0027ve generally found that having to hang around building speed in atmosphere is ultimately wasteful... For me, anyway. If you\u0027re having to level off or dive to get speed up, you probably need more air TWR.. either lighten your load up a bit (it\u0027s amazing how much difference a little weight can make, especially with that \u0027more speed = more thrust = more speed\u0027 mechanic in the new engines, it\u0027s a really exponential change) or find a way to get a bit more engine in there... but be aware, more engine = more weight and more fuel, which is also more weight.. Sometimes you just have to bite the bullet and accept the limitations of your launch vehicle.\u003C/p\u003E\n"}]}