{"TopicId":113076,"ForumId":16,"TopicTitle":"RemoteTech- Flight Computer Bug","CreatedByName":"NASAHireMe","CreatedById":131205,"CreatedDateTime":"2015-06-16T01:42:00Z","PageNum":1,"Articles":[{"CreatedByName":"NASAHireMe","CreatedById":131205,"CreatedDateTime":"2015-06-16T01:42:00Z","Content":"![0EHJscX.jpg](http://i.imgur.com/0EHJscX.jpg)\n\nI\u0027ve encountered a bug or something with RemoteTech. Pictured here is a mission to Gilly, currently inbound to an Eve aerobrake/aerocapture. My Flight Computer has stopped working. When I issue a command, it is sent to the Flight Computer\u0027s queue. However, the actions are never executed, and my attempts to cancel the commands just pile onto the queue and sit there.\n\nI would just ignore the Flight Computer and play it manually, but the Flight Computer is preventing me from using timewarp. When I try to increase timewarp, it automatically and immediately throttles the timewarp back to 1x in order to execute the next (instantaneous) command from the queue, but the command does nothing. \n\nI suspect it may have something to do with the fact that I recently switched over from playing with time-delay to playing without time delay. \n\nIs there a way to delete the Flight Computer\u0027s queue for this vessel in some config file somewhere? I looked around a bit, but I can\u0027t find where RemoteTech stores current Flight Computer commands. Or is there some other way to clear the queue?\n\n**Edited \u003Ctime datetime=\u00222015-06-16T18:29:01Z\u0022 title=\u002206/16/2015 06:29  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 16, 2015\u003C/time\u003E by NASAHireMe**"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-06-16T13:20:02Z","Content":"Yeah, there\u0027s something odd going on there. The little place on your status display, where it says \u0022Connected\u0022, really ought to have a time indicator instead (showing what the comm delay is for your craft). I\u0027ve never seen the simple \u0022Connected\u0022 message, but then, I\u0027ve always played with the time delay on-- I\u0027m guessing that\u0027s what it says when you have time-delay turned off?\n\nSo the fact that you switched seems like a likely culprit. Perhaps worth bringing up over on the RemoteTech thread:\n\n[http://forum.kerbalspaceprogram.com/threads/83305](https://forum.kerbalspaceprogram.com/threads/83305)"},{"CreatedByName":"DeMatt","CreatedById":90539,"CreatedDateTime":"2015-06-16T15:54:40Z","Content":"\u003E \n\u003E Yeah, there\u0027s something odd going on there. The little place on your status display, where it says \u0022Connected\u0022, really ought to have a time indicator instead (showing what the comm delay is for your craft). I\u0027ve never seen the simple \u0022Connected\u0022 message, but then, I\u0027ve always played with the time delay on-- I\u0027m guessing that\u0027s what it says when you have time-delay turned off?\n\n...it\u0027s worth noting that that\u0027s, apparently, a crewed vessel. I can\u0027t see from this angle whether it actually has a command pod, but crewed vessels merely get \u0022Connected\u0022 because they\u0027re piloted by the kerbals - locally.\nWhy he\u0027s using the Flight Computer, instead of piloting by hand... I don\u0027t know. Precision?"},{"CreatedByName":"Orbital Vagabond","CreatedById":145561,"CreatedDateTime":"2015-06-16T16:38:34Z","Content":"\u003E \n\u003E ...it\u0027s worth noting that that\u0027s, apparently, a crewed vessel. I can\u0027t see from this angle whether it actually has a command pod, but crewed vessels merely get \u0022Connected\u0022 because they\u0027re piloted by the kerbals - locally.\n\u003E Why he\u0027s using the Flight Computer, instead of piloting by hand... I don\u0027t know. Precision?\n\nI don\u0027t think it has a manned control pod. If the vessel had a manned control pod, the indicator should be yellow and read \u0022local control\u0022. A green indicator indicates a probe with a KSC connection is controlling the vessel."},{"CreatedByName":"NASAHireMe","CreatedById":131205,"CreatedDateTime":"2015-06-16T18:28:48Z","Content":"Problem solved. User Matt77 posted a similar problem several months ago, but his had to do with ScanSat. \n\nRT stores flight computer commands in the save file, under Vessel= \u0022Gilly Station\u0022 \\\\ FlightComputer Active Commands { command 1; command 2; etc }. I just deleted the commands in the brackets.\n\nI\u0027ve got a science lab and a hitchhiker storage unit, neither of which counts as a crewed command pod. And yeah, the \u0022Connected\u0022 message is normal when playing without signal delay. \n\nI never found the root cause of the problem. I tried reverting back to Signal Delay = True, but the queue was still frozen. Oh well."}]}