{"TopicId":113169,"ForumId":66,"TopicTitle":"Devnote Tuesday: A big announcement","CreatedByName":"SQUAD","CreatedById":66485,"CreatedDateTime":"2015-06-17T03:02:01Z","PageNum":12,"Articles":[{"CreatedByName":"Javster","CreatedById":74613,"CreatedDateTime":"2015-06-17T16:16:00Z","Content":"\n\u003Cp\u003EI would be fine with this if Squad fixed every known bug in the stock game. Or at least the ones experienced by more than x people\u003C/p\u003E\n"},{"CreatedByName":"basic.syntax","CreatedById":109920,"CreatedDateTime":"2015-06-17T16:19:57Z","Content":"\n\u003Cp\u003EWe want more features in KSP and bug fixing, it\u0027s endless. Squad said in the run-up to 1.0 that they would continue development as long as they can manage it, despite player worries that \u00221.0\u0022 would be The End and see Squad drop KSP for some other shiny thing. KSP was never really going to be \u0022finished,\u0022 and thus, by some player\u0027s standards, there would never be an appropriate time to \u0022port\u0022 KSP to other platforms. But they are doing it, they are throwing their hats over the wall, as a challenge for themselves to find new sources of income, expand KSP, and clearly fix bugs along the way. \u003C/p\u003E\u003Cp\u003ENobody likes bugs, but it\u0027s a constant in software development. The developers are on record with embarrassment, in a couple Squadcasts, that 1.0.2 was needed just 6 hours after 1.0.1. The 1.0.3 patch is getting extra testing time in hopes that it will not repeat that scenario, hopefully it will be the last patch until v1.1 is ready.\u003C/p\u003E\n"},{"CreatedByName":"windows_x_seven","CreatedById":112926,"CreatedDateTime":"2015-06-17T16:21:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TinfoilChef\u0022 data-cite=\u0022TinfoilChef\u0022\u003E\u003Cdiv\u003EMy biggest concern is that they\u0027re talking about UI changes. [...] I don\u0027t even want to imagine trying to do stuff in KSP with anything even remotely resembling a console style UI. [...] The only thing I hope for from a console version is that it not take away from the PC version.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAgreed.\u003C/p\u003E\n"},{"CreatedByName":"Raptor9","CreatedById":67915,"CreatedDateTime":"2015-06-17T16:21:36Z","Content":"\n\u003Cp\u003ESQUAD proudly announcing the PS4 port for KSP...and the KSP PC community:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1356.photobucket.com/albums/q737/raptor_9000/GIFs/Shifty%20Eyes%20GIF_zpsvbnojkz1.gif\u0022 alt=\u0022Shifty%20Eyes%20GIF_zpsvbnojkz1.gif\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Woopert","CreatedById":84274,"CreatedDateTime":"2015-06-17T16:28:40Z","Content":"\n\u003Cp\u003EHorrible, horrible, horrible news. I\u0027m losing faith in Squad. This always happens with early access indie games.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003ESeems like a cool game!\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThis game is amazing! My favourite game of all time!\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EOh, they\u0027re changing some stuff. It\u0027s okay but I\u0027ll deal with it.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EWhy! Why? Why change things that are already perfectly fine?\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EIt\u0027s all lost! The game isn\u0027t good anymore.\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EIt happened to Minecraft. I thought it would never happen to KSP because it seemed so perfect. This is a joke.\u003C/p\u003E\u003Cp\u003E#PCmasterrace\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-17T16:35:38Z\u0022 title=\u002206/17/2015 04:35  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 17, 2015\u003C/time\u003E by Woopert\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Navy2k","CreatedById":95246,"CreatedDateTime":"2015-06-17T16:36:25Z","Content":"\n\u003Cp\u003EI don\u0027t really understand why if you give something for free (like the devnotes) everybody seems to deduce a right to have this free thing and if not is willing to grab the torches and pitchforks to demand it?\u003C/p\u003E\u003Cp\u003ESo from my side (never owned a console after the atari 2600) its not groundbreaking news, but for someone it is.\u003C/p\u003E\u003Cp\u003EAll thats left to say is, thanks Squad for the nearly 1000 hours of fun! (Hm, just realising im also nearing the 2cent / hour mark for pricing, not bad i must say =) )\u003C/p\u003E\u003Cp\u003EGreetings\u003C/p\u003E\u003Cp\u003EBen\u003C/p\u003E\u003Cp\u003EP.S.: Thanks for Mr. Woopert to amplify my point: Only thing to say is PCMasterrace \u0026gt; all wÃƒÂ¤hh wÃƒÂ¤hh 0_O \u003C/p\u003E\u003Cp\u003E Plus the signature is another whine about a problem that is fixed within seconds for anyone by a mod called \u0022Stock Clamshell Fairings\u0022 Jesus!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-17T16:43:12Z\u0022 title=\u002206/17/2015 04:43  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 17, 2015\u003C/time\u003E by Navy2k\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2015-06-17T16:39:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ESQUAD proudly announcing the PS4 port for KSP...and the KSP PC community:\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, that shouldn\u0027t surprise anyone. What\u0027s PS4 to the people on this forum? We\u0027ve been eagerly awaiting news about 1.0.3, though...\u003C/p\u003E\n"},{"CreatedByName":"Raptor9","CreatedById":67915,"CreatedDateTime":"2015-06-17T16:44:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Laie\u0022 data-cite=\u0022Laie\u0022\u003E\u003Cdiv\u003EWell, that shouldn\u0027t surprise anyone. What\u0027s PS4 to the people on this forum? We\u0027ve been eagerly awaiting news about 1.0.3, though...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI know, it was just funny. I have my concerns too, however.\u003C/p\u003E\n"},{"CreatedByName":"Hotaru","CreatedById":135669,"CreatedDateTime":"2015-06-17T16:46:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Navy2k\u0022 data-cite=\u0022Navy2k\u0022\u003E\u003Cdiv\u003EI don\u0027t really understand why if you give something for free (like the devnotes) everybody seems to deduce a right to have this free thing and if not is willing to grab the torches and pitchforks to demand it?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey\u0027re not \u003Cem\u003Eobligated\u003C/em\u003E to share anything, but I think it\u0027s a little impolite to publish devnotes every week, then one week to say \u0022Here are the devnotes\u0022 and then give us something that is the opposite of devnotes. \u0022No devnotes this week, announcement instead\u0022 would\u0027ve been more honest. Not quite torch-and-pitchfork material for me, but I can\u0027t help but be slightly annoyed. \u003C/p\u003E\u003Cp\u003EThat said, I really, really, really hope this works out. I love KSP and I still think Squad is a decent company, I\u0027ve got nothing against consoles and nothing against companies doing what makes the most business sense. \u003C/p\u003E\u003Cp\u003EBut KSP on consoles? KSP with no mods, on weak hardware, \u003Cem\u003Ewithout a mouse\u003C/em\u003E? I just can\u0027t picture it being successful. It seems like a bad business decision. I can\u0027t imagine the additional sales will make up for the time and money invested in the port. And the company doing the port apparently has experience limited to third-rate mobile games, I just can\u0027t see how they\u0027re qualified to undertake a project like porting KSP to the PS4. I hope I\u0027m wrong, because if I am I think it will be for the best, but I just can\u0027t see it.\u003C/p\u003E\n"},{"CreatedByName":"Caelib","CreatedById":59329,"CreatedDateTime":"2015-06-17T16:48:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SmallFatFetus\u0022 data-cite=\u0022SmallFatFetus\u0022\u003E\u003Cdiv\u003EI don\u0027t like where this is going. This is going to split the amazing community of KSP in 2.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EActually, it\u0027s not. It\u0027s going to add a community of players that will probably remain mostly silent. I play a lot of War Thunder and it\u0027s a cross-platform game and you rarely hear anything from the PS4 players, ever. And what is to say that just because they are playing on a console doesn\u0027t mean they will share in the experience and have just as much to contribute to the community as any PC player?\u003C/p\u003E\u003Cp\u003EKeep in mind that KSP is not for everyone and the players who get involved in the community are *typically* a lot more mature than those found on most gaming boards. This isn\u0027t going to change with a PS4 port.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-17T16:53:12Z\u0022 title=\u002206/17/2015 04:53  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 17, 2015\u003C/time\u003E by Caelib\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2015-06-17T16:49:58Z","Content":"\n\u003Cp\u003EIt\u0027s hardly Dev notes, more of a marketing annoncement.\u003C/p\u003E\u003Cp\u003EIt\u0027s quite funny really, we get no announcements in the announcement area and we get announcements instead of the Dev notes...\u003C/p\u003E\n"},{"CreatedByName":"mithkabob","CreatedById":146469,"CreatedDateTime":"2015-06-17T16:54:36Z","Content":"\n\u003Cp\u003EHello, I would like to add my feedback to this discussion as a person who is considering whether or not to purchase your game. I have heard mention of some of the bugs in 1.0 and some people saying that the game was not ready to be called 1.0 at release so I have been checking here occasionally for news on progress regarding updates. I see this post expecting some good news about a patch coming out soon and all I find is something about a PS4 port?\u003C/p\u003E\u003Cp\u003EWhether the negative impact of this on PC development is real or perceived does not matter, because the announcement and the reaction to it can really turn off a potential customer (me), who is now unsure of purchasing the game. I carefully choose what to purchase, watch videos of people playing, and read both positive and negative reviews. Seeing negative reviews on Steam from people with 100s of hours in the game not recommending it once it came out of early access because it didn\u0027t seem ready is a bad sign. Seeing YouTube streamers have to do little workarounds and have problems with glitches and even crashes and sometimes horrible frame rates for no apparent reason is another bad sign. Seeing them having to download several mods just to have a usable interface and decent looking graphics, yet another negative. Having to dig through this entire thread to find more information that should have been part of the main post was also quite frustrating.\u003C/p\u003E\u003Cp\u003EStill, I see so much potential with the game and how much fun people can have playing it, that I am very interested in it and want to see it succeed. I wish you luck, but I think I will wait to purchase this until you have a stable 64-bit Unity 5 client.\u003C/p\u003E\n"},{"CreatedByName":"Shawn28","CreatedById":143994,"CreatedDateTime":"2015-06-17T17:00:41Z","Content":"\n\u003Cp\u003Eawesome ! can\u0027t wait to get PS4... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"ShadowZone","CreatedById":112420,"CreatedDateTime":"2015-06-17T17:03:02Z","Content":"\n\u003Cp\u003EThe entire discussion could have been avoided.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ShadowZone\u0022 data-cite=\u0022ShadowZone\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003EIn perfect world, this would have happened:\u003C/strong\u003E\u003Cp\u003E1) Squad would have released the PS4 announcement in the proper \u0022Announcement\u0022 section of the forums.\u003C/p\u003E\u003Cp\u003E2) The announcement would have had not only a picture, but also the following information: The port will be produced by a different company, control issues will be adressed during the port, the port will be released 2016. It would also mention that additional console sales would help PC development.\u003C/p\u003E\u003Cp\u003E3) There would have been a separate Dev Note (linked to in the announcement), reassuring the community that the PS4 port will not affect PC development. It would also mention that 1.0.3 is still very much in development and everybody is working hard to get it released. It would also mention that Flying Tiger (the company doing the PS4 port) have already supported Squad in doing the Unity 5 revamp. \u003C/p\u003E\u003Cp\u003E4) HarvesteR himself would have assured the community in the Dev Notes that PC development of KSP would always be the main focus and that there will be no dumbing down of the main game to accomodate console input or performance issues.\u003C/p\u003E\u003Cp\u003E5) The community would have congratulated Squad on their efforts, reacted happy to the mention of 1.0.3 and the fact that new money will help the development of their favorite game.\u003C/p\u003E\u003Cp\u003EBesides 4 and 5 all the relevant information was provided, but only in tidbits scatterd across 3 different platforms (Forum, Twitter, Reddit).\u003C/p\u003E\u003Cp\u003EAnd I am still hoping for 4 to happen, so 5 could be possibly reached...\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EThe lesson here is: Communication is key. It\u0027s as simple as that.\u003C/strong\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003C/blockquote\u003E\u003Cp\u003EEdit:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KasperVld\u0022 data-cite=\u0022KasperVld\u0022\u003E\u003Cdiv\u003EAnd finally, please be more respectful towards Squad. Constructive criticism, questions and even some scepticism are all fine, but in the end you\u0027re a guest on our forums and we do expect you to behave as guests.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn this forum every user may be a guest, technically speaking. But in your balance sheets I am your customer. Twice. I bought the game on Steam and then again on the website so I could have two parallel installs - and I didn\u0027t mind paying twice, because no game has given me the amount of satisfaction as KSP did. I have clocked in 2005 hours according to Steam - and I am pretty sure I am not the only one playing it that much.\u003C/p\u003E\u003Cp\u003EYour community are not merely guests. They have actively contributed to the success of your game, by basically financing if through early access, by providing you with feedback to make the game better, by promoting KSP to their friends an family. So please understand if we tend to get emotional about how things are being done regarding this part of our lives (yes, I have said it). And don\u0027t forget, where you are coming from. You have big time success and console deals and I am happy for you. But your backbone is the community. And the more you turn to other shiny opportunities the more you are risking to alienate said community - who are in reality your strongest marketing force. Do not forget this.\u003C/p\u003E\u003Cp\u003EWe get that you use Twitter and Reddit to reach a bigger audience. I myself do it as well to promote my own stuff. But why can\u0027t you show the forums more love? Why aren\u0027t you able to condense all important talking points into one forum post? You already have all the info somewhere. Put it here as well! It\u0027s little things like this that keep customers loyal to a product. Have you noticed how the mood of this thread changed as soon as you started reacting and trying to put our criticism into perspective? People do not \u003Cem\u003Ewant \u003C/em\u003Eto react negatively out of principle. It is neglect for your roots and the people who contributed to your success that creates the increasing backlash. \u003C/p\u003E\u003Cp\u003EThis is me as a former seasoned journalist and communication guy, with IT experience, a degree in business administration, some law education and currently a very challenging job trying to keep customers and developers in our company from starting to hate each other because of wrong expecations and faulty communication. This is not bragging, I am merely trying to make you realize that there are some people here who have had experience in a lot of situations that you have went through in the past and are still going through. And I believe there are a lot of people here that can offer a lot more valuable input than me. \u003C/p\u003E\u003Cp\u003EYes we are guests. As are guests in a restaurant. But guests in a restaurant can still expect to be served what is on the menu and not what the chef suddenly decides he likes to cook. And like guests in a restaurant we pay for your product. Please keep that in mind. And keep listening. Thank you.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-17T17:21:37Z\u0022 title=\u002206/17/2015 05:21  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 17, 2015\u003C/time\u003E by ShadowZone\u003C/strong\u003E\n\u003Cbr\u003EReaction to KasperVld\n\u003C/span\u003E\n"},{"CreatedByName":"luizopiloto","CreatedById":97503,"CreatedDateTime":"2015-06-17T17:06:35Z","Content":"\n\u003Cp\u003EI still have that bad feeling...\u003C/p\u003E\u003Cp\u003ETime will tell..\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-06-17T17:16:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022basic.syntax\u0022 data-cite=\u0022basic.syntax\u0022\u003E\u003Cdiv\u003EThis (a few example links) looks like communication to me. Many of these plans were delivered. Some didn\u0027t make it. I think they have a larger roadmap, in pencil or post-it notes on a whiteboard that get moved around probably monthly, and choose not to share it, partly for that reason.\u003C/div\u003E\u003C/blockquote\u003ESo, in other words, they really never had a long-term plan of how the game should develop. Amazingly that\u0027s exactly what I\u0027ve been saying.\u003Cp\u003EA feature like Career Mode should have been laid out long before work began. As it stands now it plays like a bunch of unrelated features were literally thrown at a velcro wall to see which would stick, and the dev notes indicate that\u0027s pretty much exactly what happened. That\u0027s been a problem with KSP for a very long time, no long-term plans.\u003C/p\u003E\n"},{"CreatedByName":"Zesty","CreatedById":112248,"CreatedDateTime":"2015-06-17T17:22:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DundraL\u0022 data-cite=\u0022DundraL\u0022\u003E\u003Cdiv\u003EWow, what a bunch of ingracious, self-entitled BS i see in this thread.\u003Cp\u003EYou didnt get a devnote? TOO BAD! NOBODY OWES YOUR ONE!\u003C/p\u003E\u003Cp\u003EWhy would somebody be MAD at the fact that a game they like of going to be on another platform? YES! OMG ITS FOR MONEY! BLESPHEMY! Are you mad that squad isn\u0027t spending all their time for you/ your platform specifically? Making THEIR game fit whatever image you happen to have in mind? Are you MAD that they want money to continue coming to squadHQ and spending all day working on KSP? \u003C/p\u003E\u003Cp\u003ESquad is a business that relies on (OM MY GOSH!) money to pay their employees. Without employees, THERE IS NO FURTHER UPDATES TO KSP. Its not a @(\u0026amp;%^@ charity people. Your one time payment of whatever does not buy you slaves that work for the rest of their lives updating, tweaking, supporting, and upgrading KSP. Its money that makes it worth their time. The costs continue month after month and if the income doesnt, IT GETS SHUT DOWN. So dont be so suprised and offended when they do something to secure future funding for KSP. \u003C/p\u003E\u003Cp\u003EITS A BUSINESS! ITS NOT EVIL TO PURSUE MONEY! GET OVER IT!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFinally someone speaks some sense. So much entitled whining. Even a former dev throwing a tantrum.\u003C/p\u003E\n"},{"CreatedByName":"SquaredSpekz","CreatedById":124226,"CreatedDateTime":"2015-06-17T17:23:26Z","Content":"\n\u003Cp\u003EKSP 1.1 (next update) is porting the game to Unity 5.1 , which adds Multi threading so yeah we get Multi threading next update.\u003C/p\u003E\n"},{"CreatedByName":"smjjames","CreatedById":134004,"CreatedDateTime":"2015-06-17T17:23:55Z","Content":"\n\u003Cp\u003EI still hope they do a real devnotes this week though.\u003C/p\u003E\n"},{"CreatedByName":"NovaSilisko","CreatedById":3897,"CreatedDateTime":"2015-06-17T17:28:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Met\u0022 data-cite=\u0022Met\u0022\u003E\u003Cdiv\u003EEven a former dev throwing a tantrum.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYour definition of tantrum perplexes me.\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-06-17T17:30:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Met\u0022 data-cite=\u0022Met\u0022\u003E\u003Cdiv\u003EEven a former dev throwing a tantrum.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWe\u0027ll have no personal attacks guys.\u003C/p\u003E\u003Cp\u003EOh and regex, multiple platforms was a long term goal...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/3G5QKi7.png\u0022 alt=\u00223G5QKi7.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2015-06-17T17:31:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Navy2k\u0022 data-cite=\u0022Navy2k\u0022\u003E\u003Cdiv\u003EPlus the signature is another whine about a problem that is fixed within seconds for anyone by a mod called \u0022Stock Clamshell Fairings\u0022 Jesus!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIronically, something PS4 players won\u0027t be able to have.\u003C/p\u003E\n"},{"CreatedByName":"Mr Shifty","CreatedById":68146,"CreatedDateTime":"2015-06-17T17:33:24Z","Content":"\n\u003Cp\u003EGreat news! I\u0027d love to be able to sit on the sofa and play KSP with my kids.\u003C/p\u003E\n"},{"CreatedByName":"luizopiloto","CreatedById":97503,"CreatedDateTime":"2015-06-17T17:34:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mr Shifty\u0022 data-cite=\u0022Mr Shifty\u0022\u003E\u003Cdiv\u003EGreat news! I\u0027d love to be able to sit on the sofa and play KSP with my kids.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou can do this with a PC... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Zesty","CreatedById":112248,"CreatedDateTime":"2015-06-17T17:36:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ObsessedWithKSP\u0022 data-cite=\u0022ObsessedWithKSP\u0022\u003E\u003Cdiv\u003EIronically, something PS4 players won\u0027t be able to have.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERed herring. It has nothing to do with his point.\u003C/p\u003E\n"}]}