{"TopicId":11321,"ForumId":21,"TopicTitle":"A couple of Biplane designs [0.15 stock]","CreatedByName":"Marshymallow","CreatedById":26154,"CreatedDateTime":"2012-05-24T07:31:22Z","PageNum":1,"Articles":[{"CreatedByName":"Marshymallow","CreatedById":26154,"CreatedDateTime":"2012-05-24T07:31:22Z","Content":"I\\\u0027ve been messing around with designs for a while now, and I decided to try out making biplanes. It turns out that it\\\u0027s actually not too bad of an idea, considering that the extra wings do help force the center of balance towards where the wings are at.\n\nI started off with the Mark 1.\n\n\u003E ![spZ7J.png](http://i.imgur.com/spZ7J.png)\n\nThis thing is clunky, slow, and certainly not able to get far, but it takes a lot of effort to get it to go out of control and it\\\u0027s light enough that the parachutes will allow it to survive a water landing every time.\n\nAfter getting the basic ideas out of the way, I went onto the Mark 2, with four engines and hopefully a bit more maneuverability.\n\n\u003E ![90FMs.png](http://i.imgur.com/90FMs.png)\n\nWell, uh. It has four engines. It\\\u0027s a little easier to take off in, and I\\\u0027d say it\\\u0027s more fun to fly overall. However, both of these planes do not have much in terms of range, and are at most just fun toys for taking off and landing.\n\nHope you guys enjoy them!\n\nBy the way, if anyone has any tips on how to make a more stable design, I\\\u0027d love to hear them as I am quite nooby."},{"CreatedByName":"One01","CreatedById":21745,"CreatedDateTime":"2012-05-24T10:14:18Z","Content":"I like it! I\\\u0027ve also been making a lot of planes, and one of them is a biplane. It\\\u0027s a huge one with six engines and it\\\u0027s highly fragile, and the slightest bump or turn on the ground will make the top wings wobble and shake themselves apart! here\\\u0027s the only successful flight to date, luckily recorded:\n\n\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/QP9PpN2HGwE?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E"},{"CreatedByName":"Marshymallow","CreatedById":26154,"CreatedDateTime":"2012-05-24T15:40:43Z","Content":"\u003E \n\u003E I like it! I\\\u0027ve also been making a lot of planes, and one of them is a biplane. It\\\u0027s a huge one with six engines and it\\\u0027s highly fragile, and the slightest bump or turn on the ground will make the top wings wobble and shake themselves apart! here\\\u0027s the only successful flight to date, luckily recorded:\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E \u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/QP9PpN2HGwE?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\n\nThanks! Your design seems to be Jebediah-approved, mine are more contemporary. Someday, I\\\u0027ll have the lack of sanity to try such crazy concepts.\n\nSpeaking of designs, I decided to make a final biplane. I\\\u0027d done 2 engines, 4 engines, where else was there to go?\n\n\u003E ![mhIR8.png](http://i.imgur.com/mhIR8.png)]\n\nI went with a single engine design. This meant I had to actually think about balance for once, not to mention it being even harder to get it off the ground. But, it\\\u0027s actually probably the best flier and the most fun!\n\n\u003E ![ediXM.png](http://i.imgur.com/ediXM.png)\n\nThis plane is flimsy. I wanted to try and simulate the cloth wing feel of an actual biplane... Instead, it just allows you to jettison your wings. Still, it\\\u0027s a fun ride and the jettisoning serves a purpose!\n\n\u003E ![Db0ly.png](http://i.imgur.com/Db0ly.png)\n\nWater crash safe! Only problem is that like all my other designs, it\\\u0027s really grumpy when it comes to vertical controls. Feel free to try and fix it, I know you guys on here are smarter than me."},{"CreatedByName":"One01","CreatedById":21745,"CreatedDateTime":"2012-05-24T16:21:57Z","Content":"I like it! I\\\u0027ve made one very similar, exept mine is a \u0027Quad-Plane\u0027 with four wings on top of each other, and surprisingly, it worked!\n\nNo video yet, but i\\\u0027ll work on that. I\\\u0027ve attached the file anyway.\n\nEDIT: Also, Here\\\u0027s my X-Wing aircraft:\n\n\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/EVTUPhkDqeA?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E"}]}