{"TopicId":113264,"ForumId":44,"TopicTitle":"Interstellar Teleportation Mechanics","CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-06-17T22:55:54Z","PageNum":1,"Articles":[{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-06-17T22:55:54Z","Content":"\n\u003Cp\u003EAssume a spaceship drive that essentially teleports the ship from one star to another, like the Jump Drive from Battletech. The specifics aren\u0027t entirely important but I\u0027m curious how things would work if, say, the drive didn\u0027t scrub its current universe-relative velocity and instead carried it with the vessel. Let\u0027s say we\u0027re orbiting a planet in System 1 and perform a jump to System 2 into orbit of the primary. What happens in System 2? How about if we jump into orbit of a planet in System 2?\u003C/p\u003E\u003Cp\u003EI imagine this could result in some very awesome hilariousness as well as some devastating kinetic weaponry if a jump was calculated just so...\u003C/p\u003E\n"},{"CreatedByName":"UmbralRaptor","CreatedById":2767,"CreatedDateTime":"2015-06-17T23:17:03Z","Content":"\n\u003Cp\u003ERelative velocities of nearby stars seem to run from \u0026lt;10 to \u0026gt;250 km/s. Not sure what the galaxy\u0027s rotational curve as a whole is, but I assume for a retrograde star or a cross galaxy jump, up to 400-600 km/s would be possible. And in rare cases, one could have silliness from hypervelocity stars or jumping near a double-degenerate binary system to abuse gravitational slingshots.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-06-17T23:20:41Z","Content":"\n\u003Cp\u003EOh man, I totally forgot about star motion... That makes it even more powerful, and potentially more useless.\u003C/p\u003E\u003Cp\u003EE: But then again, if you account for that motion and know what the target system looks like at any given moment, you can plan ahead and enter into the correct orbit for a Hohmann transfer or something, so maybe not so useless. Would probably take a pretty powerful computer, though.\u003C/p\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2015-06-17T23:27:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022UmbralRaptor\u0022 data-cite=\u0022UmbralRaptor\u0022\u003E\u003Cdiv\u003ERelative velocities of nearby stars seem to run from \u0026lt;10 to \u0026gt;250 km/s. Not sure what the galaxy\u0027s rotational curve as a whole is, but I assume for a retrograde star or a cross galaxy jump, up to 400-600 km/s would be possible. And in rare cases, one could have silliness from hypervelocity stars or jumping near a double-degenerate binary system to abuse gravitational slingshots.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you can jump quick enough, you don\u0027t need to bother with slingshots: let yourself drop almost-into a black hole and/or big giant enough times, and you will go relativistic in short order. Then hop to the target planet, drop rocks, hop back to the other side of the black hole to decelerate. Unstoppable fireworks ensue.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EOh man, I totally forgot about star motion... That makes it even more powerful, and potentially more useless.\u003Cp\u003EE: But then again, if you account for that motion and know what the target system looks like at any given moment, you can plan ahead and enter into the correct orbit for a Hohmann transfer or something, so maybe not so useless. Would probably take a pretty powerful computer, though.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs I said, if you can change your position at will, you can accelerate in any direction you desire to any velocity you desire by using any gravity well, then drop yourself where you match orbital parameters. Haven\u0027t you seen people playing with warp drives in KSP?\u003C/p\u003E\u003Cp\u003ERune. That\u0027s a nifty unintended doomsday weapon. Kzinti lesson anyone?\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-06-17T23:32:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rune\u0022 data-cite=\u0022Rune\u0022\u003E\u003Cdiv\u003EAs I said, if you can change your position at will\u003C/div\u003E\u003C/blockquote\u003ESpecifics include a long time between jumps, a maximum distance, and a prohibition against jumps within \u0022significant\u0022 gravity, in true sci-fi fashion, but it\u0027s still far more powerful than I originally thought. Jump near black hole or sufficiently large star, build up decent velocity while recharging, jump to target.\u003Cp\u003EE: Oh, hrm... Well, you\u0027d still have your relative star motion to take into account, even if jumps were prohibited deep in a gravity well....\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-06-18T00:05:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022UmbralRaptor\u0022 data-cite=\u0022UmbralRaptor\u0022\u003E\u003Cdiv\u003ERelative velocities of nearby stars seem to run from \u0026lt;10 to \u0026gt;250 km/s. Not sure what the galaxy\u0027s rotational curve as a whole is, but I assume for a retrograde star or a cross galaxy jump, up to 400-600 km/s would be possible. And in rare cases, one could have silliness from hypervelocity stars or jumping near a double-degenerate binary system to abuse gravitational slingshots.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf it\u0027s truly like BT\u0027s drive, then there\u0027s a max range of 30 light years per jump. There\u0027s not that much relative velocity on average withi that range, right?\u003C/p\u003E\u003Cp\u003EAt least for the most part.\u003C/p\u003E\u003Cp\u003EThere\u0027s also a recharge time, as well as a requirement of low gravity. \u003C/p\u003E\u003Cp\u003EIn effect, all of space is a valid jump point except for the space near celestial bodies.\u003C/p\u003E\u003Cp\u003EHowever, if velocity is kept when you jump, then there is almost no effect if you have the correct velocity relative to the target and choose to jump to the point above the zenith or nadir of the star.\u003C/p\u003E\u003Cp\u003EYou can\u0027t jump at will unless you have the drive charged and are in a valid jump point.\u003C/p\u003E\n"},{"CreatedByName":"UmbralRaptor","CreatedById":2767,"CreatedDateTime":"2015-06-18T00:11:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bill Phil\u0022 data-cite=\u0022Bill Phil\u0022\u003E\u003Cdiv\u003EIf it\u0027s truly like BT\u0027s drive, then there\u0027s a max range of 30 light years per jump. There\u0027s not that much relative velocity on average withi that range, right?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Kapteyn%27s_Star\u0022 rel=\u0022external nofollow\u0022\u003EWell, there are a few halo stars that close, so...\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-06-18T00:26:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bill Phil\u0022 data-cite=\u0022Bill Phil\u0022\u003E\u003Cdiv\u003EIf it\u0027s truly like BT\u0027s drive, then there\u0027s a max range of 30 light years per jump. There\u0027s not that much relative velocity on average withi that range, right?\u003C/div\u003E\u003C/blockquote\u003EI was thinking more like 10 but, still, a lot can be done with that. If the jump has to happen near the orbit of Pluto, or at a similar point in any given gravity well, that limits it a bit further, but you still have the problem of slingshotting around a halo star for added velocity as UmbralRaptor points out. It\u0027s an interesting twist in the device because it makes every poorly-piloted tramp freighter a weapon of mass destruction and if the drive is only operated by a certain group they have a (E: different sort of) monopoly on force.\u003Cp\u003EE: Actually, the more I think about it the more I think that would be a very interesting stardrive.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-18T00:39:04Z\u0022 title=\u002206/18/2015 12:39  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 18, 2015\u003C/time\u003E by regex\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Zucal","CreatedById":139764,"CreatedDateTime":"2015-06-18T00:39:00Z","Content":"\n\u003Cp\u003EMotion within superclusters would be interesting, when you start thinking about what stuff like the Great Attractor would do with this system.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-06-18T02:14:22Z","Content":"\n\u003Cp\u003EOkay, let me lay out some specifics. Let\u0027s say the drive has a maximum range of about 10 ~ 11 light years, can only be operated (jump in/out) around or outside the orbit of Jupiter (or a similar gravitational acceleration), preserves universal velocity vector on jump (aggregate), is expensive in materials, requires a large amount of infrastructure to manufacture, has a payload fraction of around 5% (drive \u002B power system \u002B fuel \u002B radiators, not including crew, facilities, in-system drives, etc...), and generates massive amounts of heat on jump while requiring a lot of stored power to actually perform a jump (recharge, cooling time). Keep in mind to make a useful jump you need good knowledge of the destination and some good computers to calculate when would be the best time to jump. Existing radiator mass and payload fraction encourage in-system drives like a fission-fragment rocket or similar which would mainly be used for orbital correction while the craft is met by in-system craft for off-loading.\u003C/p\u003E\u003Cp\u003EObviously you\u0027re not going to be terribly inclined to use this as a weapon, although the option is very much there. Any other silly holes we can punch in it?\u003C/p\u003E\n"},{"CreatedByName":"TheSaint","CreatedById":70033,"CreatedDateTime":"2015-06-18T03:59:35Z","Content":"\n\u003Cp\u003EThe only question you haven\u0027t answered is: How accurately can you place your arrival in the target system? If you\u0027re travelling over a distance of ten light-years, having a CEP (or in this case I guess it would actually be SEP) measured in AU would not be out of the question. (At lower levels of technology, some might call that \u0022amazingly accurate\u0022.) It would also mean the difference between \u0022I\u0027m going to just drop my ship right into this nice tight little orbit here,\u0022 and, \u0022I\u0027m going to plot my arrival in the Oort cloud to make absolutely sure I don\u0027t run into the red giant.\u0022\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-06-18T04:44:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheSaint\u0022 data-cite=\u0022TheSaint\u0022\u003E\u003Cdiv\u003EThe only question you haven\u0027t answered is: How accurately can you place your arrival in the target system? If you\u0027re travelling over a distance of ten light-years, having a CEP (or in this case I guess it would actually be SEP) measured in AU would not be out of the question. (At lower levels of technology, some might call that \u0022amazingly accurate\u0022.) It would also mean the difference between \u0022I\u0027m going to just drop my ship right into this nice tight little orbit here,\u0022 and, \u0022I\u0027m going to plot my arrival in the Oort cloud to make absolutely sure I don\u0027t run into the red giant.\u0022\u003C/div\u003E\u003C/blockquote\u003EGreat point. I suppose that really depends on computing power. Let\u0027s say that minimum SEP is 150,000km (1/1000 AU), at absolute best, and that a reasonable max SEP that any self-respecting captain would call a limit would be 1,500,000km (1/100 AU), with a good value considered about 200,000 ~ 300,000km (1/750 ~ 1/500 AU). This pretty much mandates that the carrier ship carry a maneuvering engine.\n"},{"CreatedByName":"Zucal","CreatedById":139764,"CreatedDateTime":"2015-06-18T05:28:50Z","Content":"\n\u003Cp\u003EWhatever its purposes, it\u0027ll be terrible for stealth if it generates that much heat on jump and moves at relativistic velocities afterwards as well. Secondly, this makes objects like rogue planets really interesting as an operating base, because they won\u0027t have a nearby gravity well to be attacked with or attack with.\u003C/p\u003E\n"},{"CreatedByName":"Rakaydos","CreatedById":101988,"CreatedDateTime":"2015-06-18T15:29:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Zucal\u0022 data-cite=\u0022Zucal\u0022\u003E\u003Cdiv\u003EWhatever its purposes, it\u0027ll be terrible for stealth if it generates that much heat on jump and moves at relativistic velocities afterwards as well. Secondly, this makes objects like rogue planets really interesting as an operating base, because they won\u0027t have a nearby gravity well to be attacked with or attack with.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you arrive more light minutes out than your drive\u0027s charge time, you dont need stealth. You sit there, watch, and before any of the enemy you can see (who obvously could not know you were coming) can reply even with lightspeed weapons, you tactically jump and go back to watching.\u003C/p\u003E\u003Cp\u003ELarry niven had at least 3 fleets doing this at once in one of his later Ringworld books.\u003C/p\u003E\n"},{"CreatedByName":"Shpaget","CreatedById":45577,"CreatedDateTime":"2015-06-18T15:46:06Z","Content":"\n\u003Cp\u003EFirst you jump near your own star and let the gravity accelerate you to the relative 0 velocity for your destination (or whatever velocity you want to have upon arrival).\u003C/p\u003E\u003Cp\u003EThen you jump to the other system.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-06-18T16:34:47Z","Content":"\n\u003Cp\u003EThat makes the charge time crucial in terms of using it as a weapon, which is fine. I hope it\u0027s sufficiently interesting not only as a means of transportation but also as a plot device. One of my goals of posting here was to see if there were any overt problems with the device in terms of realism (ignoring the fact that you\u0027re teleporting between stars).\u003C/p\u003E\u003Cp\u003EYou really have to know what the target system looks like to use it effectively, which means that probing target systems becomes a big deal if your computers don\u0027t know what to expect. I imagine early exploration was quite an experience and most likely done by automated science probes. Once again, charge time is crucial since you can reasonably expect a safe jump, given the operation parameters, but have no idea what to expect once you\u0027re there. So basically you\u0027d send the probe on a good vector to place it into orbit of the target system, collect as much data as possible on possible jump destinations and anything that might cause problems, and hopefully be able to jump to relative safety before you actually do run into problems.\u003C/p\u003E\u003Cp\u003EShips with this device probably have Brayton generators, enormous radiators, a nuclear reactor of some type for initial spin-up (since you could use the waste heat for helping with recharge at the target), and high-isp maneuvering drives that require as little reaction mass as possible (like a fission fragment rocket).\u003C/p\u003E\u003Cp\u003EI\u0027m curious whether the consensus is that this would be a interesting drive for relatively low-tech space exploration where fusion power is still a pipe-dream.\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2015-06-18T16:46:55Z","Content":"\n\u003Cp\u003EFission fragment rocket indeed has very high ISP, but its thrust is minuscule. Your interstellar behemots would require much...heftier interplanetary propulsion. Maybe MHD plasma drive, or even fusion torch engine to give it half-decent acceleration and maneuverability.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-06-18T16:50:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Scotius\u0022 data-cite=\u0022Scotius\u0022\u003E\u003Cdiv\u003EFission fragment rocket indeed has very high ISP, but its thrust is minuscule. Your interstellar behemots would require much...heftier interplanetary propulsion. Maybe MHD plasma drive, or even fusion torch engine to give it half-decent acceleration and maneuverability.\u003C/div\u003E\u003C/blockquote\u003E:ugh: I wanted to avoid that if at all possible, but you\u0027re probably right. I imagine these carrier ships as pretty much staying where they end up and instead bringing along riders or large cargo pods that would be handled by the more efficient in-system craft since the payload fraction is so small. In that sense they are true starships, rather than spaceships (is that a valid distinction?)\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2015-06-18T18:30:13Z","Content":"\n\u003Cp\u003EI...don\u0027t think it would work. Reloading goods from a carrier to several smaller shuttles would be pretty labour and time consuming. It\u0027s better to bring that freighter down to space elevator station and gradually unload it there. If you really want to keep big ship in deep space, make it modular - a core containing engines, power plant, crew quarters and cargo containers surrounding it. Then you could send a fleet of interplanetary tugs (possibly with empty containers). Tugs would haul away full containers, clip empty to the core and carrier would be ready to go, while fleet of tugs would return to the planet with cargo.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-06-18T18:41:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EOkay, let me lay out some specifics. Let\u0027s say the drive has a maximum range of about 10 ~ 11 light years, can only be operated (jump in/out) around or outside the orbit of Jupiter (or a similar gravitational acceleration), preserves universal velocity vector on jump (aggregate), is expensive in materials, requires a large amount of infrastructure to manufacture, has a payload fraction of around 5% (drive \u002B power system \u002B fuel \u002B radiators, not including crew, facilities, in-system drives, etc...), and generates massive amounts of heat on jump while requiring a lot of stored power to actually perform a jump (recharge, cooling time).\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Scotius\u0022 data-cite=\u0022Scotius\u0022\u003E\u003Cdiv\u003EI...don\u0027t think it would work. Reloading goods from a carrier to several smaller shuttles would be pretty labour and time consuming. It\u0027s better to bring that freighter down to space elevator station and gradually unload it there. If you really want to keep big ship in deep space, make it modular - a core containing engines, power plant, crew quarters and cargo containers surrounding it. Then you could send a fleet of interplanetary tugs (possibly with empty containers). Tugs would haul away full containers, clip empty to the core and carrier would be ready to go, while fleet of tugs would return to the planet with cargo.\u003C/div\u003E\u003C/blockquote\u003EThat\u0027s pretty much what I was suggesting. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E I requoted the drive specifics since they are now important to the discussion. Given a payload mass outside of the interstellar drive of around 5%, I think these ships would end up being fairly massive on their own and would prefer to avoid maneuvering as much as possible since they would have to bring along enough reaction mass to do the job. This is one reason why I think fission-fragment rockets would be preferred for station-keeping/correction engines, especially since they already sport some massive radiators to handle all the heat they\u0027re generating already.\u003Cp\u003EHopefully I\u0027m not digging a huge hole here, lol. If it\u0027s not workable, it\u0027s not workable.\u003C/p\u003E\n"}]}