{"TopicId":113463,"ForumId":32,"TopicTitle":"Can someone ELI5 the concept of diminishing return in the \u0022moar boosters\u0022 idea?","CreatedByName":"SlabGizor117","CreatedById":135987,"CreatedDateTime":"2015-06-19T23:56:36Z","PageNum":1,"Articles":[{"CreatedByName":"SlabGizor117","CreatedById":135987,"CreatedDateTime":"2015-06-19T23:56:36Z","Content":"So, it\u0027s kind of, like I said, a problem of diminishing returns where, when you add more engines to carry your payload, you need more fuel. And to lift that fuel, you need more engines, and you need fuel for those engines. So, my understanding of this names weight as the culprit. \n\nThus, with a lighter fuel and higher thrust, such as an SRB, does that negate the concept of diminishing returns? \n\nI plan on making another post to test this out in KSP, but I want to get the discussion going while I\u0027m working on it. \n\nThanks for your help!\n\n-Slab"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2015-06-20T00:04:40Z","Content":"You have the idea off slightly...\n\nThe Tsiolkovsky rocket equation is: change in velocity potential (aka. dV) = velocity of exhaust \\* ln (wet mass / dry mass). Or to put it another way, the efficiency of your engine\u0027s burn time multiplied by a factor mostly derived from the density of your fuel. The more efficient your engine is at burning the fuel (ie. the more I(sp) it gets), the better your dV. The denser your fuel is, the better your dV. SRB fuel is less dense than liquid fuel or oxidizer, making it inferior in quality and thus generating less dV (as does their lower I(sp)).\n\n**Edited \u003Ctime datetime=\u00222015-06-20T00:07:27Z\u0022 title=\u002206/20/2015 12:07  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 20, 2015\u003C/time\u003E by SkyRender**"},{"CreatedByName":"Ripper2900","CreatedById":146418,"CreatedDateTime":"2015-06-20T00:05:37Z","Content":"Yes, but srb\u0027s aren\u0027t that. They\u0027re lots of thrust but heavier. \n\nUse srb\u0027s to get going, but drop them asap. They\u0027re not worth carrying to higher altitudes."},{"CreatedByName":"SlabGizor117","CreatedById":135987,"CreatedDateTime":"2015-06-20T00:09:42Z","Content":"Ok, cool, so... ELI5? I did notice that SRBs produced much less dV, but the main point is that, as I will elaborate on in the experiment, if I have 1 flea booster with x TWR and x dV, and I slap 2 more, why don\u0027t my TWR and dV triple? Obviously I didn\u0027t think that it would, but I\u0027m curious as to why it didn\u0027t."},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2015-06-20T00:13:26Z","Content":"\u003E \n\u003E Ok, cool, so... ELI5? I did notice that SRBs produced much less dV, but the main point is that, as I will elaborate on in the experiment, if I have 1 flea booster with x TWR and x dV, and I slap 2 more, why don\u0027t my TWR and dV triple? Obviously I didn\u0027t think that it would, but I\u0027m curious as to why it didn\u0027t.\n\n Because of that bit that says ln (wet mass / dry mass). As you add more fuel, the engine has to push that fuel as well as itself. This reduces the return on investment, as does adding extra engines (which only reduce dV by virtue of raising the overall mass of the craft). Basically you had it down when you said that you need more fuel and engines to lift more fuel and engines. That\u0027s why. The only propellant that could possibly add dV equal to the amount of tanks of it added would be a massless one, and that doesn\u0027t seem to be physically possible."},{"CreatedByName":"11of10","CreatedById":90592,"CreatedDateTime":"2015-06-20T00:14:28Z","Content":"It would triple if you were just adding only fuel (no tankage mass) to an engine with 0 mass. Fuel has mass. SRB casing has mass. It eats into your deltaV.\n\nNinja\u0027d! ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\nEdit2: Yes, the mass of fuel itself, forgot that part. Cheers SkyRender"},{"CreatedByName":"TheDarkStar","CreatedById":37056,"CreatedDateTime":"2015-06-20T00:17:32Z","Content":"The TWR and dV stay the same because both the thrust and the mass triple (using the example)."},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-06-20T00:19:02Z","Content":"SlabGizor,\n\n The problem of diminishing returns sets in when you start with a payload and strap moar boosters and fuel on it until it performs as needed. This is an inefficient design approach.\n\nIn vacuum it\u0027s really just a matter of linear scaling once you\u0027ve got your proportions correct. \n\n All the rocket really cares about is 1) how much of your vehicle is fuel and 2) how efficient your engines are. This is all easy to sort out mathematically using the rocket equation.\n\n If you do the math and then build in accordance with the results, your rocket will do what you need it to do.\n\n If you\u0027d like, I can walk you through the process to show you how it works.\n\n Best,\n\n-Slashy"},{"CreatedByName":"SlabGizor117","CreatedById":135987,"CreatedDateTime":"2015-06-20T00:32:26Z","Content":"Ahh, ok I see, so the mass you add is what eats into the dV and TWR. But, how does that give you diminishing returns? Is there any way you could break past that? As in, why is it that the mass of it always wins out(in the end) over thrust? What would it take to add \u0022moar boosters\u0022 without losing the effectiveness of them? \n\nAlso, I still don\u0027t quite understand all of this, so actually Explain Like I\u0027m 5, please... XD\n\nThank you for the help though, I\u0027m starting to understand a little bit better!"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2015-06-20T00:39:33Z","Content":"Imagine you\u0027re pushing a rock, and as you push it, the rock is falling apart. Every time you push it forward, let\u0027s say, one mile, it loses about an eighth of an inch of material off its surface. No matter what you do, the rock is always going to lose that eighth of an inch, but how much that works out to depends on how big the rock is right now. The bigger the rock, the more you\u0027re losing as you roll it along. But, as you roll it along and lose mass, it\u0027s also progressively losing less mass as it goes. That said, it will eventually run out completely, no matter what you do. That\u0027s pretty much the simplest analogy I can think of for how rockets tend to work.\n\nThere are ways to get better efficiency. The easiest way is to drop some of the mass of your rocket at regular intervals (known as staging). The more fuel mass you have versus dry mass, the more dV you get."},{"CreatedByName":"PKing Zombie Spy","CreatedById":144850,"CreatedDateTime":"2015-06-20T01:05:08Z","Content":"Maybe looking at it backwards would help you? Not adding boosters to a rocket, but starting with the boosters themselves?\n\nLet\u0027s imagine you could have a rocket that was just a single SRB. It would have a given TWR, and a given delta-V.\n\nLet\u0027s imagine you have a rocket with two such SRBs, stitched together. Let\u0027s assume for simplicity that your method of stitching them together was \u0022magical,\u0022 that is, massless, generated no drag, and didn\u0027t impact the SRB performance somehow. Obviously such a rocket would have *precisely* the same TWR, and the delta-V, as the one mentioned above, because it would be just like launching two of the original rocket separately.\n\nLet\u0027s imagine, further, you have a rocket with **one million** such SRBs, again stitched together using magical massless/dragless/perfectly rigid twine. This rocket, massive though it may be (being one million times the size of the original), would again have exactly the same TWR, and the same delta-V.\n\nNow let\u0027s imagine instead of just SRBs, you have some payload -- deadweight if you will. If you have a 4 ton payload on top of 2 boosters, this is not dissimilar to having a 2 ton payload on top of 1 booster. If you have a 1 ton payload on top of *one million* boosters, this is again just like having a 1 gram payload on top of one booster. 1 gram payload will be neglible, but still (very slightly) worse than if you had just launched the single SRB, alone.\n\nSo: By switching on \u0022moar boosters,\u0022 you *will* increase your TWR, and your same delta-V, but only be asymptotically approaching \u0022ideal\u0022 TWR of just launching a single booster, but you will never reach it, sort of like Zeno\u0027s paradox.\n\nSo the Hammer SRB by itself has vacuum TWR of 7.71, and 2202 m/s delta-v. If I have a rocket, and all I use are Hammer SRBs in my first stage, that first stage, no matter what I do, can never, ever, *ever* exceed a 7.71 TWR and 2202 m/s delta-v in vacuum. I can approach that ideal, but I can never reach it.\n\nI think this is one thing you could mean by diminishing returns. Possibly more intuitively clear than Tsiolkovsky\u0027s rocket equation."},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-06-20T01:10:35Z","Content":"\u003E \n\u003E Ahh, ok I see, so the mass you add is what eats into the dV and TWR. But, how does that give you diminishing returns? Is there any way you could break past that? As in, why is it that the mass of it always wins out(in the end) over thrust? What would it take to add \u0022moar boosters\u0022 without losing the effectiveness of them? \n\u003E Also, I still don\u0027t quite understand all of this, so actually Explain Like I\u0027m 5, please... XD\n\u003E \n\u003E Thank you for the help though, I\u0027m starting to understand a little bit better!\n\nSorry, I didn\u0027t understand what you meant by \u0022ELI5\u0022. Now I get it ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\n Any mass that you add that is not fuel is going to hurt your performance in terms of DV. Likewise, any mass that you add that is not engine is going to hurt your acceleration. Since engines aren\u0027t fuel and vice-versa, adding mass will always hurt something, which requires adding more mass to fix it. \n\n The only way to avoid the pitfall is with massless engines or infinite fuel.\n\n The trick is to figure out exactly what you need before you build and \\*then\\* build it. Or as the KER guys do it, keep track of what the rocket will do as you build. Trying to add rocket to your payload on a trial/ error basis is a highly frustrating and inefficient way to go about it. By the time you\u0027ve stumbled across something that works, it\u0027ll be a lot bigger than it needed to be.\n\n The idea of \u0022moar boosters\u0022 is a running joke around here. It doesn\u0027t actually give you an effective launch vehicle, but it is a hilariously \u0027kerbal\u0027 way of going about it. What you actually need isn\u0027t \u0022moar\u0022, but rather \u0022enough\u0022. Designing light gets you more results than designing powerful.\n\nBest,\n\n-Slashy\n\n- - - Updated - - -\n\nHmm... simplifying the concept further...\n\n You have a car, a fat guy driving, and a fuel tank.\n\n Adding an engine will make the car accelerate better, but it won\u0027t help fuel economy at all.\n\n Adding a fuel tank will help the car go farther, but it won\u0027t help the car accelerate.\n\n In both cases, the gains won\u0027t quite double due to the added mass of parts.\n\n If you bring along the fat guy\u0027s fat friend, then add another engine and gas tank, you essentially have two cars. You won\u0027t get twice the acceleration or twice the range, just twice the number of fat guys getting to their destination.\n\n**Edited \u003Ctime datetime=\u00222015-06-20T00:59:46Z\u0022 title=\u002206/20/2015 12:59  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 20, 2015\u003C/time\u003E by GoSlash27**"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2015-06-20T01:21:21Z","Content":"PKing Zombie Spy, welcome to the forums, and what a way to introduce yourself. Very well said. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nThere\u0027s indeed two sets of \u0022diminishing returns\u0022 here.\n\nOne is that, for a single stage, you can never do better than the payload-less mass ratio, as PKing Zombie Spy says.\n\nThe other is that, if you use liquid fuel, you can never do better than your fuel tank mass ratio. Even if you ignore payload and engine mass, that means your mass ratio will never be better than 9:1 (since fuel tanks hold 8 tons of fuel for every ton of dry mass). Solids are obviously worse."},{"CreatedByName":"Vaporo","CreatedById":110800,"CreatedDateTime":"2015-06-20T02:13:12Z","Content":"\u003E \n\u003E \\*snip\\*\n\nI think that he explains it pretty much the same way I do, but I\u0027ll post my explanation anyways.\n\nThink of it this way. You have the mass of the fuel tank and engine, and you have the mass of the fuel. Now, if you take an SRB and fire it off alone, it will always have to lift the mass of the tank and engine, even as the mass of your fuel goes to zero (and runs out). Now, if you take two separate SRBs and fire them off simultaneously, they go to about the same height. If you take two SRBs and duct tape them together, they\u0027ll still go only as high as the two separate SRB, because, while the craft has twice as much fuel, it has twice as much mass as well. You can do this with as many SRBs as you want, and they\u0027ll always go the same height. \n\nNow, think about what you said, about putting two SRBs on the side of an SRB capsule with a capsule on top of it. With one SRB under it, the SRB gets bogged down, because now it has to lift 1 capsule, along with its fuel, tank, and engine. However, if you put 2 SRBs on the side, the weight of the capsule is now divided among 3 SRBs. So, now the each only have to lift 1/3 of a capsule, plus one fuel tank and one engine. If you have 4 SRBs, it becomes 1/4 of a capsule. With 5 it becomes 1/5. However, the SRBs always still have to lift their own weight. So, if you have 99999999999999 SRBs and one capsule on a craft, each SRB has to lift their own weight plus 1/99999999999999 of a capsule. As you add more SRBs, you can get infinitely close to the equivalent of just one SRB to the point where you can much ignore that capsule, but you can never quite make it to equal exactly one SRB.\n\nIf you attach a car to boulder, odds are you won\u0027t be able to move it much. If you attach 10000 cars to a boulder, you can move around almost like the boulder isn\u0027t there (except for the fact that you have to avoid the other cars), but you\u0027re not going to go a thousand mph because you attached 10000 cars to the boulder.\n\n**Edited \u003Ctime datetime=\u00222015-06-20T02:15:53Z\u0022 title=\u002206/20/2015 02:15  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 20, 2015\u003C/time\u003E by Vaporo**"},{"CreatedByName":"waterlubber","CreatedById":119333,"CreatedDateTime":"2015-06-20T02:47:44Z","Content":"Imagine it like cookies. If you eat a cookie, you magically accelerate 1 m/s, but you get fatter. The more cookies you eat, the less you accelerate. That\u0027s how fuel works. The evil, evil rocket equation only cares what PERCENT of your rocket is fuel. Doubling the mass of your rocket keeps the ratio the same, so you get nothing more. Adding a fuel tank can improve the ratio, but not by much. SRB\u0027s are useful for adding thrust, but not DV."},{"CreatedByName":"Capt. Hunt","CreatedById":97860,"CreatedDateTime":"2015-06-20T03:26:11Z","Content":"Yeah,\n\nThe thing to remember is TWR is the rocket\u0027s thrust divided by it\u0027s total weight. Lets say I have a booster that has a thrust of 1 ton-force and weighs 1 ton. As TWR is thrust divided by weight, that gives me a TWR of 1 divided by 1, which equals 1. Now if I take a second identical booster and strap it on, I\u0027ve doubled the thrust to 2 tons, but I\u0027ve also doubled the weight to 2 tons, that makes my TWR 2 divided by 2, which also equals 1. We can see the diminishing returns if I strap a payload on top of this rocket (lets say it weights 500 pounds, or a quarter ton) and start adding more boosters. Now my rocket weighs 2.25 tons, but still has 2 tons of thrust. That means that the TWR is now 2/2.25 or .89. If I added another booster to compensate for that, we\u0027ll have a rocket that has a thrust of 3 tons but now weighs 3.25 tons, that brings our TWR up to .92. Another booster gives us 4 tons of thrust, and 4.25 tons of weight, but, when we divide those numbers, the TWR only goes up to .94. Add another booster and the TWR only goes up to .95. My numbers are rounded a bit, but you can see a trend here, right? For every booster I add the TWR goes up half as much as the previous booster. We\u0027ll eventually reach a point where the weight of the boosters added all but negates the added thrust of the new booster. This is why rockets have stages, they can lose the dead weight to increase their TWR more efficiently then adding bigger engines."},{"CreatedByName":"Arkalius","CreatedById":40968,"CreatedDateTime":"2015-06-20T06:14:46Z","Content":"From a mathematical perspective, the diminishing returns comes as a result of the natural logarithm in the rocket equation. Logarithms increase exponentially more slowly as the term you provide to them increases. In fact, if you consider that as you add more fuel mass, you also must add some dry mass for the additional tankage, the ln term in the rocket equation ends up having an asymptote.\n\nWe have dV = Vex \\* ln (m0/m1)\n\nLook at the ratio m0/m1. That\u0027s full mass over dry mass. Let\u0027s assume we have a fixed payload of 10 kg, and that for every 10 kg of fuel we add, we need 1 kg of tankage dry mass. So, dry mass m1 = 10 \u002B x/10, and full mass becomes m0 = m1 \u002B x = 10 \u002B x/10 \u002B x = 10 \u002B 11x/10.\n\nIf you then take the ratio of m0/m1 and simplify, you end up with something like (100 \u002B 11x)/(100 \u002B x). As x grows significantly large, you can begin to ignore the 100\u0027s and just have 11x/x, which simplifies to 11. That means as x grows large, the ratio approaches a value of 11 but never exceeds it. Thus, the natural log of that ratio can never exceed ln(11). The whole equation develops an asymptote - a value it approaches, and to which you can get arbitrarily close, but never reach or exceed.\n\nBasically as you continue to add more fuel, more and more of what you add is being expended to lift what you added instead of the payload.\n\nOf course, this ignores the fact that adding mass to the craft lowers your TWR which has its own problems. Yes, you can add more engines, but that is more dry mass on its own, thus reducing delta-V.\n\n.\n\nThis is what is known as the tyranny of the rocket equation."},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2015-06-20T06:50:21Z","Content":"\u003E \n\u003E Yes, but srb\u0027s aren\u0027t that. They\u0027re lots of thrust but heavier. \n\u003E Use srb\u0027s to get going, but drop them asap. They\u0027re not worth carrying to higher altitudes.\n\nThis, real life rockets uses SRB for TWR, the space shuttle or Ariane could not take off without SRB. Back in 0.90 my standard design was reuseable core with 2 or more large SRB to help me in the start, TWR was below 1 without the SRB.\n\nNote that in 1.02 your trust at sea level is also lower, some km up you are out of the worst atmosphere."},{"CreatedByName":"Juicy","CreatedById":142505,"CreatedDateTime":"2015-06-20T12:46:17Z","Content":"\u003E \n\u003E Ahh, ok I see, so the mass you add is what eats into the dV and TWR. But, how does that give you diminishing returns? Is there any way you could break past that? As in, why is it that the mass of it always wins out(in the end) over thrust? What would it take to add \u0022moar boosters\u0022 without losing the effectiveness of them? \n\u003E Also, I still don\u0027t quite understand all of this, so actually Explain Like I\u0027m 5, please... XD\n\u003E \n\u003E Thank you for the help though, I\u0027m starting to understand a little bit better!\n\nWell, what you could do to *reduce* the effect, is Asparagus.\n\nAsparaus is basically what you do when you have a vessel that DOES have a big enough engine to lift itself, but lacks the fuel to lift itself high enough.\n\nSo, you add a pair of booster rockets (fuel \u0026 engines, that\u0027s all), and make sure to add fuel connectors leading from the boosters to your main rocket. The fuel from the boosters will deplete faster, since your main rocket is also feeding from it (instead of using its own fuel), and the moment the boosters are empty, they\u0027ll shut down and you\u0027ll want to disconnect them from your main rocket. \n\nBut, what you have left after dropping them, is the very rocket you started out with, topped up with fuel, hopefully very high by now above your launch platform, which also already has a high velocity. But, your main rocket has to be powerful enough to sustain itself in the first place. Or, if you really want to go efficient, it\u0027s actually just not strong enough to lift off by itself (by just a fraction!), because at higher altitudes the rocket will suffer less from drag, and might very well be able to even to accelerate.\n\nIf that\u0027s still not enough to get high enough, just add more boosters. Add boosters too your boosters if you want! Just make sure to have those fuel lines running from each booster to the booster or rocket it directly attaches to."},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2015-06-20T14:06:26Z","Content":"\u003E \n\u003E Yes, but srb\u0027s aren\u0027t that. They\u0027re lots of thrust but heavier. \n\u003E Use srb\u0027s to get going, but drop them asap. They\u0027re not worth carrying to higher altitudes.\n\nthey\u0027re space ISP is closer to ground-K-MSL ISP at a fraction of the cost of the aerospikes. \n\nHere is how I rank thruster role.\n\nJob #1. Get the ship off the ground - sounds pedantic but the first few seconds of flight are important, and getting the LF engines up. Sometimes you just need a thruster than can push that load up to 30 or 50 meters per second over a few seconds, then go bye-bye. The first few seconds of flight add more apparent:actual DV to the flight (this means devices that add thrust on the pad do not show up as much vacuum DV, but because they prevent hoovering of the craft on the pad, they can add alot to the actual DV the craft has when it reaches space). So those Sepratrons can come in handy for some loads just to get them moving, then kick them off with a TT38K. \n\nOne thing that needs to be remembered is that momentum is important. if drag(100 m/s at LP alt) = 1g\\*mass then 50 m/s = 1/4th g and 25 m/s = 1/16th g. G-force is falling most quickly (change of g per change of altitude) close to the ground. So the force of drag is trivial at the launch pad, so its best to fight g with as much force as the ship will tolerate. So getting a vessel off the ground can take a vessel that has exactly 1g of acceleration moving and it will stay moving and begin to accelerate, but to do so you have to get it away from the pad and give it a seed momentum. \n\nJob #2. Get the ship to 100 m/s (lower if its a sensitive load) - affords powering down the LF engines and sparing them until their ISP is higher. During this part of the flight drag force and gravity force are roughly equal, gravity is falling and main engines may need to be powered down more to prevent overspeed. \n\nJob #3. Get the ship past 5000 alt at 160 m/s - This separates from 2 because that span from 1000 meters to 5000 meters and from 100 m/s to 160 m/s the booster is carrying as much drag as it is fighting gravity, very little left to accelerate, and the craft accelerates because drag is falling, fuel is falling, and because gravity is falling a few percent. Main engines are still coming down. \n\nJob #4. Pushing fuel, Those inefficient space engines waste fuel, and the booster has a very draggy nose. So I put an aerotank on the nose of the booster and fuel line then I can use that wasty engine to help on the load. Tune the tank to expire when the booster depletes and ditch the booster and the weight of the tank, The main engine now has what it had on the launch pad, plus 100 m/s momentum, plus cleaner space.\n\njob #5. Beyond 5000 meters the role is pretty minor, for single LFOx stages it might be to push an LV-909 or poodle to the point that its ISP is high enough to prevent fall back, otherwise better to switch to LFOx stages. If you are not pushing thrift next stage engines up, its time to switch to LFOx. IN some cases you might want to push the structural limits of the craft to exceed the speed of sound at 15000 alt in order to impart enough momemtum on a lousy atmosphere engine so that gravity and drag are low enough that it can do its job. The problem is that boosters hate to turn, and staging them at an incline can cause crash back (you lose your main engines due to booster collisions). So you don\u0027t often end up better since the boosters cannot make the desired gravity turn and you have an inefficient conversion of forward momemtum to desparately need horizontal momemtum. There are times with specific set ups where you WANT to go higher-up to make that turn, particularly if your craft is lumbering along (sensitive payloads), you may be better off with a asparagas setup."},{"CreatedByName":"Deddly","CreatedById":62955,"CreatedDateTime":"2015-06-20T14:38:54Z","Content":"Since SlabGizor117 asked us to ELI5 (Explain Like I\u0027m 5):\n\nLet\u0027s pretend I want to lift you up as high as I can, but I\u0027m not strong enough to lift you at all, so I get a friend and we lift you together. We aren\u0027t that strong, so we can only lift you, say, 1 metre from the ground.\n\nCan we lift you higher? Yes - someone can lift us as well! But if it takes 2 people to lift you, how many people will it take to lift all 3 of us? If everybody needs 2 people to lift them, now we need 6 people, and we got you 1 metre higher.\n\nCan we go higher? Yes! We can lift everybody up. But now we need lots more people because it\u0027s getting really heavy. Now we need to lift you, the 2 of us holding you up, and the 6 people holding us up. That\u0027s 9 people who need lifting, so we need 18 people, and now you\u0027re 1 metre higher.\n\nCan we go higher? Yes! But it\u0027s going to take an awful lot of people to lift everybody up any further. We need to lift you, the 2 people holding you, the 6 people holding them and the 18 people holding *them!* So we\u0027re already 27 people, and to lift all of that, now we need 54 MORE people. And yet, 54 people could only lift you 1 metre higher.\n\nSo for every metre higher we want to lift you, we need to add many, many more people. \n\nThis is a very basic explanation of diminishing returns when adding boosters to rockets and the so-called Tsiolkovsky rocket equation\n\nEDIT: This is what it looks like:\n\nGround level.......................I\n\n1 metres...........................II\n\n2 metres.........................IIIIII\n\n3 metres...................IIIIIIIIIIIIIIIIII\n\n4 metres..IIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIII\n\n**Edited \u003Ctime datetime=\u00222015-06-20T14:58:42Z\u0022 title=\u002206/20/2015 02:58  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 20, 2015\u003C/time\u003E by Deddly**"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-06-20T15:46:37Z","Content":"Man... I\u0027m starting to feel old, I had to google ELI5.... I\u0027m starting to see more and more acronyms that I have no idea what they are, but people use them as if it was common knowledge...\n\nThankfully there is the google....\n\nFirst point: I don\u0027t think diminishing returns is really thought about in the \u0022moar boosters\u0022 idea. I think its rather a result of this being a game.... (for most of its history, and in sandbox) there are no limits on size or funding. So, don\u0027t bother with efficiency, just make it bigger -MOAR BOOSTERS!\n\nAlso, more fire, thrust, explosions near the launchpad... all good stuff... half the initial fun of ksp is just seeing your rockets destroy themselves on the launchpad or shortly after launch, and moar boosters just makes that more spectacular.\n\nAs a follow on to this point, Asparagus staging used to be pretty much the best way to build rockets. Just keep adding more Liquid fueled boosters to your asparagus pancake, and watch your dV numbers climb.\n\n\u003E \n\u003E Thus, with a lighter fuel and higher thrust, such as an SRB, does that negate the concept of diminishing returns?\n\nThere are two things you must consider:\n\ndV and TWR.\n\nWith a TWR \u003C1 your rocket won\u0027t go up... it will sit on the launchpad spewing flames until its lost enough fuel mass that TWR\u003E1 ... or it just keeps sitting there.\n\nNow, some engines have pretty low TWRs.\n\nFor example... the ion engine... as you add more and more of those to a craft, the kerbin TWR will approach 0.816 (in a vacuum)... so you can\u0027t just keep adding more of those to get a TWR that will let you lift off of tylo, for instance.\n\nHowever, most engines have TWRs far in excess of 1:1, and diminishing returns in TWR doesn\u0027t really come into play in most instances.\n\nNext, is dV, and this is where diminishing returns really comes into play. Its important to note that it mostly comes into play for a single stage.\n\nWhat determines dV, is your mass fraction, and your Isp.\n\nMass fraction should be determined for each stage, and its basically the ratio of the mass of your craft with fuel for the stage, and without.\n\nIsp is a linear multiplier to the natural log of the mass fraction.\n\nA high TWR engine means you can make your craft be lighter (as a %, more of the craft is fuel).\n\nHowever, for lower stages, you don\u0027t care about making the stage light as much... because you already have to lift the dead weight of the stages above it.\n\nSRBs have terrible Isp... which means they need more mass in fuel to do anything. For this reason, they should remain in the lowest stages.\n\nTo maximize dV (all else being equal), you\u0027d burn through the lowest Isp fuel\u002Bengine combos first, and the highest Isp engine combos last.\n\nThis means SRBs stay in the bottom stages. Their fuel is heavy, you don\u0027t want to lift that very much.... keep them at the bottom so they lift themselves, and don\u0027t burder other stages with their weight.\n\nWhat they do have is good thrust. As your rocket gets taller (from adding more stages), it gets harder and harder to keep the TWR high enough above 1....\n\nSo throw some SRBs on... they are cheap(ish) - if you are concerned about funds.\n\nAlso, now that aerodynamics matters, one should really focus on thrust per unit of cross sectional area.... A tall skinny rocket may have trouble lifting itself with so few engines at the bottom (because it is skinny). So you want a rocket engine that gets you a lot of thrust per node... and SRBs do that (but so does the mammoth and the liquid fuel booster, and the mainsail... but for the 1.25m diameter parts, the SRBs are the highest thrust options). Once you are well into your gravity turn, TWR doesn\u0027t matter as much"},{"CreatedByName":"Mic_n","CreatedById":27054,"CreatedDateTime":"2015-06-21T22:49:34Z","Content":"If the five year old in question knows Netwons basic laws of physics, it\u0027s pretty easy.\n\n**\u0022For every action there is an equal and opposite reaction.\u0022**\n\nThat\u0027s the principle of a rocket engine. You take a bunch of very flammable stuff and make it explode. You put a big shield around the explosion so that it all goes in the one direction, which in turn makes the shield go the other way. You attach that shield to something you want to go very fast in that direction. Voila: Rocket.\n\nWith that out of the way...\n\n**Force = mass \\* acceleration** and *(not Newton, just calculus.. five year olds probably shouldn\u0027t be mucking with rocket science, I guess)* **acceleration = change in velocity (dV) / change in time (dt)**\n\nThe explosion you just made exerts a particular force on the shield - the bell housing of a rocket engine, which is attached to fuel tanks and ultimately your payload. \n\ntherefore:\n\nForce = mass \\* dV / dt\n\n**dV = Force \\* dt / mass**\n\n1: To increase dV, you must increase force, the time that force is applied or decrease mass. \n\n2: We can\u0027t decrease mass, which means more force or a longer time to apply that force. In our situation, that means adding more engines and/or more fuel.\n\n3: More engines means you burn your fuel faster, lowering your dt.\n\n4: Since for \u0027lifting\u0027 stages we\u0027re working directly against the acceleration of gravity, we need to be able to maintain a minimum acceleration to overcome that, which means we can\u0027t just increase fuel load indefinitely without also adding engine force... So to increase dV we realistically need to add both fuel and the engines to maintain that thrust to weight ratio... we can\u0027t let dt climb too high.\n\n5: More fuel = more mass\n\n6: More engines = more mass\n\n5: Therefore, more dV = more mass.\n\n6: See 1.\n\n**Edited \u003Ctime datetime=\u00222015-06-21T23:09:31Z\u0022 title=\u002206/21/2015 11:09  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 21, 2015\u003C/time\u003E by Mic\\_n**\n  \nMore Betterer."},{"CreatedByName":"Empiro","CreatedById":112072,"CreatedDateTime":"2015-06-21T23:03:36Z","Content":"To answer the original question, no, SRBs do not help except when used as a first stage. Think about it this way: SRBs are heavy (particularly their fuel), and they burn out quickly. So lets say that after you strap on those SRBs, you still don\u0027t have enough delta-V to get to where you want to go. You solve this by strapping on even more SRBs. You\u0027ll find that you\u0027ll need a ton more of them, because the SRBs from before are really heavy.\n\nThis is why SRBs are great for a first stage -- they provide good TWR, and the fact that they\u0027re heavy doesn\u0027t matter as much because nothing else has to come along and lift them (they only have to lift themselves).\n\nPlus, the diminishing returns (aka tyranny of the rocket equation) doesn\u0027t take into account TWR at all. It applies even if your engines weigh nothing, because just by adding more fuel to a rocket, it becomes harder to accelerate the rocket (meaning you need to add more fuel, and so on)."},{"CreatedByName":"jkool702","CreatedById":146465,"CreatedDateTime":"2015-06-21T23:24:54Z","Content":"Its not about MOAR boosters, its about having a larger % of your craft be boosers. (admittedly this is a little over simplistic but ELI5 appropriate)\n\nIf you launch just a SRB with nothing attached to it, you are already 100% boosters, and thus adding more wont help since (sadly) you cannot be more than 100% booster. 2 boosters would still be 100% boosters, and would have the exact same TWR, DV, etc.\n\nRealistically you want to add a payload though. Lets see how the % boosters of a craft changes.\n\nSTART: 20 tons boosters to 10 ton payload --\u003E 66.66% boosters\n\nADD 20 tons boosters\n\nNEW: 40 tons boosters to 10 tons payload --\u003E 80% boosters --\u003E 13.66% increase\n\nADD 20 tons boosters\n\nNEW: 60 tons boosters to 10 tons payload --\u003E 85.7% boosters --\u003E 5.7% increase\n\nADD 20 tons boosters\n\nNEW: 80 tons boosters to 10 tons payload --\u003E 88.88% boosters --\u003E 3.17% increase\n\netc, etc, etc\n\nEach time you add moar boosters it changes what % of you craft is boosters a little less, hense there being \u0022diminishing returns\u0022"}]}