{"TopicId":11348,"ForumId":25,"TopicTitle":"Mini-Challenges!","CreatedByName":"dogon11","CreatedById":20786,"CreatedDateTime":"2012-05-24T22:46:21Z","PageNum":1,"Articles":[{"CreatedByName":"dogon11","CreatedById":20786,"CreatedDateTime":"2012-05-24T22:46:21Z","Content":"Welcome to Mini-Challenges! It\\\u0027s minigames, but that are challenges within the game.\n\nThere are a few challenges.\n\n#1: Seafaring Vessels!\n\nIn this challenge, the point is to get a boat from the end of the runway, down the shore, into the water, and then see how far it will go. Post screenshots of as much of the flight as possible!\n\nRules: No ejecting any parts, no parts falling off, and no mods that add warp drives or infinite fuel tanks. Packs such as NovaPunch are fine. Post screenshots of your mission report so we can verify distances and missing parts.\n\n#2: Commuter!\n\nIn this challenge, the point is begin on the runway and turn around, driving over the mountains and reaching the west coast of the continent that the KSC sits on. We\\\u0027d love some screenies!\n\nRules: No ejecting parts, no parts falling off, and no mods that add warp drives or infinite fuel tanks. Packs such as NovaPunch are fine. The Cart Mod is not. Post screenshots of your mission report so we can verify distances and missing parts. \n\n#3: Polar Explorer!\n\nIn this challenge, the point is to fly a space plane to the north pole, and then back around to the south pole, before landing at KSC again. You may leave the atmosphere. Screenshots are great!\n\nRules: No ejecting parts, no parts falling off, and no mods that add warp drives or infinite fuel tanks. Packs such as NovaPunch are fine. Post screenshots of your mission report so we can verify distances and missing parts.\n\nVictors for all the challenges will be posted along with their times and distances under each challenge. Again, we love screenshots!"},{"CreatedByName":"TheZoranhero","CreatedById":23650,"CreatedDateTime":"2012-05-25T20:19:53Z","Content":"...CHALLENGE ACCEPTED 8)"},{"CreatedByName":"dogon11","CreatedById":20786,"CreatedDateTime":"2012-05-27T02:17:05Z","Content":"Okay, so maybe they aren\\\u0027t so mini."}]}