{"TopicId":113528,"ForumId":16,"TopicTitle":"SSTO Engine Spool up/Down","CreatedByName":"Kuansenhama","CreatedById":114023,"CreatedDateTime":"2015-06-20T17:51:05Z","PageNum":1,"Articles":[{"CreatedByName":"Kuansenhama","CreatedById":114023,"CreatedDateTime":"2015-06-20T17:51:05Z","Content":"I\u0027ve been trying to build a working SSTO for my career mode game, and after numerous Single-Stage-To-Ocean crashes and a few successful ones, I\u0027ve run into a problem with my new line of designs\n\nGenerally, I fly SSTOs upward at 30-40 degrees pitch until about 8-10km where I flatten out to 5-15 degrees pitch. This allows the air-breathing engines (RAPIERs or Turbojets depending upon design) to spool up. The vessel goes supersonic and the engines get more powerful and therefore produce more thrust, pushing the vessel even faster, getting me up to about 1100m/s by the time I get to 20km, get engine flame-out and have to switch to rocket mode, but at that speed and altitude, I have more than enough power to make orbit.\n\nMy question comes in as why sometimes my SSTOs just sort of sputter out as they climb. Even if I flatten my trajectory out to the horizon or even a little below it, the engines refuse to spool up past 150-250kn of thrust and my speed doesn\u0027t get much faster than 300m/s. It seems to happen with RAPIERs more than turbojets. Does this have to do with the amount of intake air they get? Or is it the number of engines that I use? How can I fix my designs?\n\nOn an unrelated note, RAPIERs seem to generate way too much heat when running on rocket mode.\n\n**Edited \u003Ctime datetime=\u00222015-06-20T21:39:10Z\u0022 title=\u002206/20/2015 09:39  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 20, 2015\u003C/time\u003E by Kuansenhama**"},{"CreatedByName":"KarateF22","CreatedById":143090,"CreatedDateTime":"2015-06-20T18:04:12Z","Content":"The most drag is experienced at the sound barrier, which is between 300 to 400 m/s. This in tandem with RAPIERs having very poor subsonic thrust is why you are experiencing this barrier. This can be fixed by adding turbojets or simply more RAPIERs or perhaps even a booster of sorts; typically once you are past the barrier you are fine."},{"CreatedByName":"kStrout","CreatedById":116630,"CreatedDateTime":"2015-06-20T18:18:45Z","Content":"Yeah Rapier\u0027s are tricky, sometimes when your speed stops or even starts to decrease, what you need to do is dive downwards about 10 degrees until your speed exceeds 400m/s and then slowly pull up not letting your speed drop too low. The only time this hasn\u0027t worked for me is when I made a ~40 ton SSTO powered by only 2 rapiers, and even that got up to 400m/s this way."},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2015-06-20T18:23:46Z","Content":"RAPIERs run into a TWR problem at mach 1. This is due to the trans-sonic drag spike that occurs are you attempt to break the sound barrier, coupled with RAPIERs hitting their power curve starting at about mach 2.7. Turbojets provide more thrust total and hit their power curve earlier, but lose power noticeably before RAPIERs.\n\nYou never specified, is this a plane or a rocket-style SSTO? Both exist and clarification is needed.\n\nIn regards to heat, the RAPIERs are gonna be pretty toasty already from the shock heating during the end of jet mode (where they\u0027re also running the hardest mind you) and the beginning of rocket mode. They\u0027re taking heavy atmospheric heating and being ran at full throttle for a fair bit of time. They\u0027re gonna get pretty toasty. They tend to begin to radiate heat faster than they\u0027re producing it as you pass 32km\u002B so if you make it there and your craft is well designed they\u0027ll begin to cool off as you burn for orbit."},{"CreatedByName":"Kuansenhama","CreatedById":114023,"CreatedDateTime":"2015-06-20T21:38:06Z","Content":"\u003E \n\u003E The most drag is experienced at the sound barrier, which is between 300 to 400 m/s. This in tandem with RAPIERs having very poor subsonic thrust is why you are experiencing this barrier. This can be fixed by adding turbojets or simply more RAPIERs or perhaps even a booster of sorts; typically once you are past the barrier you are fine.\n\nAhh, I see. Thanks.\n\n\u003E \n\u003E You never specified, is this a plane or a rocket-style SSTO? Both exist and clarification is needed.\n\nPlane Style"},{"CreatedByName":"Mic_n","CreatedById":27054,"CreatedDateTime":"2015-06-22T00:28:48Z","Content":"Erm.. I\u0027m yet to be convinced that transonic drag is actually modelled in-game beyond the performance curves of the air breathing engines.. The dive that people perform to \u0022push past the mach barrier\u0022 is generally also into thicker atmosphere and therefore increased drag naturally. Without being able to build speed beyond that sweet spot, you can\u0027t get into that positive feedback loop of increasing speed generating increasing thrust.\n\nThe summary of it is, though:\n\nYou\u0027re too heavy.\n\nIntakeair doesn\u0027t really make the difference it used to.. Airhogging might (*might*) keep your thrust going for a little more altitude, but it\u0027s really not enough to worry about IMO.. there\u0027s still way too much atmospheric drag around at the heights the engines cut out for them to keep you accelerating.\n\nBasically, you need more engine for the weight of your craft. Just as with rockets though, that\u0027s going to exponentially increase things. I\u0027ve managed a very light spaceplane that\u0027ll lift a ton or so to orbit with a single turboram and lv909, and another that\u0027ll take about 12t with 6 turborams and 2 lvt45s (now aerospikes)... I\u0027ve unlocked Mk3 parts now and am still working on a useful heavy lift design, but without the quad adapter or suitable 2.5m engines it\u0027s a little tricky to get the power there. Plus the Mk3 parts seem to build heat like crazy.. is it just me?"},{"CreatedByName":"JTpopcorn","CreatedById":130311,"CreatedDateTime":"2015-06-22T00:33:07Z","Content":"Just put on more turbojets"},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2015-06-22T10:52:02Z","Content":"Getting stuck at mach 0.95 or so is really common in 1.0.2, thanks to rapier power curves being horrible until about mach 1.5. Pretty much everyone\u0027s stock designs gained an engine or two in the effort to shove them through the sound barrier. As others have said, turbojets are magnificent for this job (~50% better at mach 1). Just one can punch a 30-40 ton plane up to speeds where the rapiers take over ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"}]}