{"TopicId":113539,"ForumId":70,"TopicTitle":"Contract Difficulties","CreatedByName":"Ghostline","CreatedById":146644,"CreatedDateTime":"2015-06-20T20:48:04Z","PageNum":1,"Articles":[{"CreatedByName":"Ghostline","CreatedById":146644,"CreatedDateTime":"2015-06-20T20:48:04Z","Content":"I\u0027m trying to complete the contract \u0022Test S1 SRB-KD25k at the launch site\u0022.\n\nAll it says it to test the part through staging at the launch site.\n\nI made a pretty basic rocket, just a standard capsule with a parachute, a decoupler and then the SRB. At the launch site, both conditions \u0022At kerbin\u0022 and \u0022at launch site\u0022 were ticked green so I activated the part in the staging. The contract was not completed and all that happened was the \u0022at launch site\u0022 became unticked.\n\nHas anyone encountered something like this before?\n\nMods I am currently running are:\n\n- KAS\n- KIS\n- Kethane\n- Kerbaltek\n\nAll of which are up to date. Could any of them be causing a problem or am I missing something blindingly obvious?\n\nThank you in advance. If any more information is needed let me know."},{"CreatedByName":"Torih","CreatedById":144304,"CreatedDateTime":"2015-06-20T21:38:43Z","Content":"Remove the fuel and then run it. Its prob moving off the pad before it registers. Also you can just right click and run test most of the time (even when it says activate via staging)."},{"CreatedByName":"Ghostline","CreatedById":146644,"CreatedDateTime":"2015-06-20T21:56:07Z","Content":"\u003E \n\u003E Remove the fuel and then run it. Its prob moving off the pad before it registers. Also you can just right click and run test most of the time (even when it says activate via staging).\n\nThanks for your reply, it sounded like a good solution and I thought that may have been the issue. Unfortunately I tried removing the fuel and the same thing happened. Also when I right click the part there is no option to test it. Not sure exactly what\u0027s happening. Should every part have a test function?"},{"CreatedByName":"Torih","CreatedById":144304,"CreatedDateTime":"2015-06-20T22:50:55Z","Content":"Only time I\u0027ve seen it not have the test option is when it was the wrong part required for the test."},{"CreatedByName":"Ghostline","CreatedById":146644,"CreatedDateTime":"2015-06-20T23:02:53Z","Content":"Ok thanks, really don\u0027t know then. It\u0027s definitely the right part, it\u0027s highlighted blue, is listed as experimental, and matches the contract name. Conditions are definitely both ticked when activated, just no recognition of completion and no ability to test. I might just have to cancel the contract which is annoying.\n\nAnyway, thanks for your help"},{"CreatedByName":"Nookos","CreatedById":144067,"CreatedDateTime":"2015-06-21T07:51:03Z","Content":"According to the wiki that part is only testable via staging so not having the test function is not a bug. Have you tried to have launch clamp keeping it on the pad while you activate it?"},{"CreatedByName":"Ghostline","CreatedById":146644,"CreatedDateTime":"2015-06-21T11:10:49Z","Content":"I have tried it unfortunately. Tried literally everything I could think of, still nothing haha. At least there\u0027s not something wrong with the testing functions though, so thanks."},{"CreatedByName":"OddFunction","CreatedById":143805,"CreatedDateTime":"2015-06-21T19:39:08Z","Content":"If it truly is glitched you can access the debug menu using \u0027Mod \u002B F12\u0027 (mod is the system dependent key). Then you can go to contracts tab and force the contract to be completed.\n\n[Source](http://wiki.kerbalspaceprogram.com/wiki/Debug_Toolbar)"},{"CreatedByName":"Ghostline","CreatedById":146644,"CreatedDateTime":"2015-06-21T21:03:13Z","Content":"The contract expired but thank you, I\u0027ll keep that in mind for the future."}]}