{"TopicId":113521,"ForumId":36,"TopicTitle":"[WIP] Diaspora - interstellar kolonization mod","CreatedByName":"beabop","CreatedById":128715,"CreatedDateTime":"2015-06-20T17:18:19Z","PageNum":1,"Articles":[{"CreatedByName":"beabop","CreatedById":128715,"CreatedDateTime":"2015-06-20T17:18:19Z","Content":"\n\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003Ediaspora\u003C/span\u003E\u003C/span\u003E\u003C/em\u003E (\u003Cem\u003En\u003C/em\u003E): The movement, migration, or scattering of a people away from an established or ancestral home\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Eland\u003C/span\u003E star\u003C/p\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cp\u003EThe mod\u0027s endgoal is to put you in another star system, with a fresh start. A big ship and some workers, something like this:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/LTrNukd.jpg\u0022 alt=\u0022LTrNukd.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EOr really, a bit more like this:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/CFVGxQp.png\u0022 alt=\u0022CFVGxQp.png\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EI think there\u0027s a fundamental problem with realistic starships in KSP, with mods that have multiple stars. They take too long to get anywhere! You time warp through a flight lasting decades or centuries, and what does the Type 1.5 civilization you left behind do? They\u0027re not mining the sun, building megastructures, or kerbin-forming planets. You can go back to the Kerbol system at any time and your satellites are still in their orbits, your Kerbals are still in their hitchiker containers, and your bases haven\u0027t expanded one bit. It breaks my suspension of disbelief.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cspan style=\u0022font-size:24px;\u0022\u003EThe Mod\u003C/span\u003E\u003Cp\u003EThat\u0027s where this mod will come in. The journey to another star is a special voyage. You entire civilization (and your game) has been organized behind a single purpose: build the greatest spacecraft ever built, fill it with tons and tons of the most expensive substances known - Helium-3 or antimatter or Karbondrum - and launch it on the most epic journey in history. Your kerbals wave the starship off, and then...\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EDiaspora focuses the scope of the game on your colonists\u003C/strong\u003E. Decades or centuries later, their ship arrives in a new star system. Kerbin is so very far away - your only interaction is tiny, very expensive email packets that take \u003Cem\u003Eyears\u003C/em\u003E to arrive. The home system is irrelevant, so it\u0027s not even in the game.\u003C/p\u003E\u003Cp\u003EUninhabited worlds await. Launch your construction craft, get mining, and build a new Kerbal Space Program around your new home star. And if you want, build another starship and launch it to another star! Each interstellar trip is a new chapter in the kerbal Diaspora.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:24px;\u0022\u003EPlanned Contents\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EInterstellar Navigation Komputer part. \u0022\u0027Space is big. Really big. You just won\u0027t believe how vastly, hugely, mindbogglingly big it is.\u0027 - Doug-Adams Kerman. But that\u0027s okay, with the latest, greatest flight komputer from Bebop Rocket (and Dance) Collective. Guaranteed to keep your starship on course for decades and your crew alive (sanity not covered by this guarantee). BFR engines and planet-sized fuel tanks not included.\u0022\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EInterstellar Navigation GUI. Select a star from a list of stars you\u0027ve discovered (installed), make sure you\u0027re ready, and the mod will simulate the voyage to your new home!\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAn interstellar voyage. While you\u0027re in interstellar space, I would like your ship to live in another system that only contains stars: Kerbol and the Local Kluster. On the second pass (after the teleporting from a GUI), the trajectory will be set automatically and the screen will be locked to the Planetarium, as the game timewarps through years. Eventually, I would like to add the option for the player to fly the mission themselves, so you can do your crazy powered slingshot past Kerbol.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EKSP without the KSC. KSC is lightyears away. Your new base is your mothership. KSC functions will be tied to specific parts - VAB/launchpad to an Extraplanetary Launchpads part, science to a lab, navigation to a dish (or an epic dish cluster part). Eventually, the main KSC Scene would be replaced with a screenshot, then a Scene of your mothership!\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EMultiplayer support. Considering how huge a starship is and how much exotic fuel you need to mine to cross light years, I think coop is a natural fit. The diaspora could keep repeating, with a new star system every month or so when the players successfully launch.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:24px;\u0022\u003EOther Mods\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003EDependencies\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EKopernicus\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EKerbal Engineer. Used to calculate vessel deltaV through all the stages and trip time.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EBackground processing? Used to deplete consumables over the trip.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ETime warp enhancement? Used to warp years at a time sensibly.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003EVery Strongly Recommend\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EYou don\u0027t have to launch a colony. Building a \u003Ca href=\u0022http://www.bis-space.com/what-we-do/projects/project-daedalus\u0022 rel=\u0022external nofollow\u0022\u003EProject Daedalus\u003C/a\u003E-style probe could be interesting. But if you do...\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EExtraplanetary Launchpads. Without the KSC, you\u0027ll need some way to build things.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EA resource mod compatible with EL. Where do you get the resources to survive and grow?\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003EStrongly Recommended\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EPropulsion mods (Karbonite\u002B, KSP Intersteller). Propulsion is half of why interstellar travel is so hard! Good luck travelling light years on the Isp of the stock nuke. You\u0027ll probably also need a mod for stupendously giant fuel tanks and stupendously giant mining equipment to fill them up in a reasonable time.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ELife support mods (TAC life support, USI Life Support, Snacks!). Long-term life support is the other half of why interstellar travel is so hard! Whether they\u0027re dead on arrival or refuse to work (dooming your expedition to eternal sulking), you won\u0027t want to run out of these supplies. DeepFreeze offers you the solution of kerbal popsicles. Mods like USI MKS/OKS and Biomass let you recycle life support supplies so you don\u0027t have to pack a century\u0027s worth.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EPower systems mod. There\u0027s not enough light for solar panels between stars; you need nuclear energy. Maybe you can power your life support on stock RTGs, but The Kraken frowns on that many parts.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:24px;\u0022\u003EDevelopment Plan\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003EFirst the voyage GUI. Figure out how to load different Kopernicus/Kopernicus Tech configs without having to restart the game and plop your craft in orbit around the new star. Next version would simulate the voyage - calculate delta V and trip time. Next would be resources - check that your craft has enough power, and it arrives low on life support supplies, reactor fuel, machinery, spare parts, etc (or if you didn\u0027t pack enough, the kerbals all die). Either it would be calculated by the mod or some time warp enhancement/background processing would be used.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ENext, the KSC and VAB replacement, bundled as a required but stand-alone mod, Mothership. For the first version, I\u0027d like to find a hack that disables the returning to KSC from flight and replaces the VAB background Scene with a starry skybox. You would now reach the relevant KSC scenes - VAB, science, and astronaut lounge - from part modules.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EWorking around the time limit. I\u0027ve never gotten that far, but apparently after ~60 years the game breaks? It seems simple enough to restart time on arrival.\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EAt this point, I would call the mod feature-complete, and everything else is bonus.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003EExtensions of other mods:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003E Civilian Population. Hire contractors to mine fuel for you, because you\u0027re going to need a lot of it.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ETelescope mods. Launch Kepler-style missions to scout out destinations. You don\u0027t want to end up at a crappy star! Build a solar system-spanning telescope to finally get a good look at the exoplanets.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EContracts pack. Kerbal equivalents of the 100 Year Starship project, Tau Zero Foundation, and the British Interplanetary Society guide you through starship construction (and give you money).\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EExtended tech tree. Another star should have an insane science modifier, so I think it needs to be balanced to feel right. Extending the tech tree with very expensive, overpowered Star Trek style technologies would give you something to spend it on...\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EEnhancements:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ERelativity. Makes the propulsion problem way harder and the life support problem a little easier.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E Procedural generation of systems (incorporate and expand Warp Drive).\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EA way to handle the life cycle of Kerbals over generations. Without the endless supply from Kerbin, how do you get more of the eager green creatures?\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E An extension of Civilian Population/Kerbal Konstructs that lets colonies grow into full-blown cities.\u003Cbr\u003E\u003Cul\u003E\u003Cli\u003EFunds and contracts will reappear.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ECity generation and terraforming for systems left behind means it *would* make sense to return to the home system. Better bring something rare and exotic to make it worth the trip...\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E[*]Laser light sail. Possibly the only peaceful use of a death star.\u003C/p\u003E\u003Cp\u003E[*]Rendezvous with fuel from Kerbin. It\u0027s been a proposed cheat to the rocket equation... build a mass driver on a moon and launch fuel tanks that rendezvous with the starship. Hey, it worked for exploring the north and south pole. With manual mode checked, you\u0027d have to send a tug after them (unless you have a logistics mod and part).\u003C/p\u003E\u003Cp\u003E[*]A Bussard ramjet. Other intakes are only 1.25m? How cute!\u003C/p\u003E\u003Cp\u003E[*]Honorverse-style hyperspace. Hyper limit = star\u0027s SOI. Parts for impeller nodes, inertial dampeners, and Kerhawski sails. Gravity waves are dangerous for craft without Kerhawski sails. With RemoteTech, you have their FTL gravity transmitters.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EDifficulty modes:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003E RoboKerbals. (Lack-of-difficulty mode.) Aka stock. Without a life support mod, Kerbals are assumed to be in cyborg bodies - that need electricity. A little mod for uploading kerbals and downloading them into new bodies could be fun.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E Crappy star. These planets are resource poor and the star\u0027s light is wimpy. Good luck!\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E Star changed since launch. \u0022One of our grad students forgot a decimal point. He had one job!\u0022 The star isn\u0027t what we expected it to be! It\u0027s now a neutron star (radiation, comms interference), dwarf (dim light), or a red supergiant (swallowed the good planets).\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E Planets changed since launch. A moon escaped, or a moon was captured. Two planets collided, or some planet\u0027s atmosphere boiled off, or the pre-radio-when-you-launched inhabitants of the Kerbin-like world nuked themselves to death.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E Lapped by the future. \u0022We were secretly hoping that Kerbin would sit and do nothing like they always do on interplanetary missions. But no.\u0022 A more advanced ship beat us here!\u003Cbr\u003E\u003Cul\u003E\u003Cli\u003EThey are happy to let us use their facilities, if we earn it. You arrive in the system to discover cities and space stations, who give you contracts. Funds becomes a mechanic again.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThey wish we weren\u0027t here. As long as we stay away from [planets with kolonies], they won\u0027t shoot at us. Let\u0027s get enough fuel to keep going.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E[bD Armory installed.] A more advanced ship beat us here! Their technology is superior, but they have forgotten about war... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E[*] Generation degeneration. \u0022Kids these days! They just don\u0027t make kerbonauts like they used to.\u0022 Centuries of confinement and inbreeding later, the generation of Kerbals that arrive have high Stupidity, crappy KerbalStats and have lost parts of the tech tree.\u003C/p\u003E\u003Cp\u003E[*] Life support failure. % of Kerbals die.\u003C/p\u003E\u003Cp\u003E[*] Space debris strike. At relativistic speeds, even single particles can be deadly. Your ship has taken damage. Could be mitigated by debris shield parts (using electromagnetics or oil droplets or whatever).\u003C/p\u003E\u003Cp\u003E[*] Computer glitch. We lost much of our old knowledge. Have to go through (most of) the tech tree again.\u003C/p\u003E\u003Cp\u003E[*] Fuel leak. We don\u0027t have enough fuel to slow down the entire ship! Use KAS to trim weight and make clever use of orbital dynamics.\u003C/p\u003E\u003Cp\u003E[*] AI rebellion! [bD Armory installed.] \u0022Our mechanical servants ran away with most of our equipment! And invented shooty things!\u0022\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EAlien things to discover. For fun, science, and terror! (Seperate mods):\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EAlien ruins. High-science biomes. Part: Xenoarcheology kit.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E A derelict starship/\u003Ca href=\u0022https://en.wikipedia.org/wiki/Big_Dumb_Object\u0022 rel=\u0022external nofollow\u0022\u003EBig Dumb Object\u003C/a\u003E you can restore.\u003Cbr\u003E\u003Cul\u003E\u003Cli\u003E Fetch quests for alien ruins and exotic resources.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E Discworld. Spin it up and stabilize it!\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Ca href=\u0022http://endlessspace.wikia.com/wiki/Wonders\u0022 rel=\u0022external nofollow\u0022\u003E Endless Space-style\u003C/a\u003E wonders\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E Stargates! It still counts as hard science if the space magic was made by aliens. Can be moved with the claw/KAS. Need KAS to connect power. First one has a smashed DHD, so\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/videoseries?list=RDDZRoLHG7zGE\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EInterstellar wormhole. Leads to the Gargantua system from Interstellar.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E[*]The planet where Krakens come from.\u003C/p\u003E\u003Cp\u003E[*] Reapers. Someone built a Kerbal reaper!\u003C/p\u003E\u003Cp\u003E[*] Zerg/tyranids/xenomorphs. KSP tower defense. Destroy their hives to colonize the planet. Make sure your settlements are fortified!\u003C/p\u003E\u003Cp\u003E[*] Zombie/pod kerbal apocalypse. Something alien is infecting your kerbals - and they\u0027ve already been found on the Mothership! You need to send science expedition to the plant of origin to find a cure. The expeditions will be very dangerous, but not sending them would be even more so.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-23T13:37:15Z\u0022 title=\u002206/23/2015 01:37  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 23, 2015\u003C/time\u003E by beabop\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Beale","CreatedById":70533,"CreatedDateTime":"2015-06-20T17:49:56Z","Content":"\n\u003Cp\u003EThere\u0027s something similar to this posted at least once a month.\u003C/p\u003E\u003Cp\u003EI wish you the best of luck, but nobody is going to want to collaborate unless you have something, \u003Cem\u003Eanything\u003C/em\u003E, to show beyond ideas.\u003C/p\u003E\u003Cp\u003E I\u0027d advise toying around with a few smaller and simpler plugins first! Before upping the scope and scale. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"daniel l.","CreatedById":57763,"CreatedDateTime":"2015-06-21T07:29:56Z","Content":"\n\u003Cp\u003ESo what i see here is a set of kopernicus based presets for the solar system that remove the existing planets and load in a new set then spawns in a starter ship with Extraplanetary launchpads capability to use for building new ships in absence of a proper ksc, And when you discover a new system what you really doing is shuffling the universe around to transform it into a new system then placing the starter ship on the edge of it.\u003C/p\u003E\n"},{"CreatedByName":"ChrisSpace","CreatedById":140622,"CreatedDateTime":"2015-06-21T08:01:51Z","Content":"\n\u003Cp\u003EI am confused. What exactly does this mod do?\u003C/p\u003E\n"},{"CreatedByName":"daniel l.","CreatedById":57763,"CreatedDateTime":"2015-06-21T10:38:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ChrisSpace\u0022 data-cite=\u0022ChrisSpace\u0022\u003E\u003Cdiv\u003EI am confused. What exactly does this mod do?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EReplaces the kerbol system with a new unknown system, Then removes the ksp and spawns in a starter ship with extraplanetary launchpads, So you can try to with limited resources conquer and explore (Or vice versa) the new system, All the while gather resources to move on to the next.\u003C/p\u003E\n"},{"CreatedByName":"beabop","CreatedById":128715,"CreatedDateTime":"2015-06-22T13:18:28Z","Content":"\n\u003Cp\u003EYes, though the idea is that you can launch a starship from Kerbol in career mode. I guess starting with a starship (from a list that comes with the mod) could be a new New Game option. I could post such a save this week. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EMy main worry is memory. Kopernicus planets must all be loaded at the monkey load screen and even only a few star systems worth of planets will probably max out a 32 bit install, when you\u0027re only ever going to use one system at a time. I have a functioning UI, part module, and multi-\u0022star\u0022 mini galaxy. I spent Sunday pretty much just reading Kopernicus\u0027s source and the KSP API. I hope there\u0027s some native way to unload planets or Kopernicus comes up eve with something. Otherwise, I would try to write a serializer for planetary bodies (which means finding EVERY field needed and cleaning up every single reference to them), cache the unused ones to a binary file, then reload them when needed.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-22T14:01:34Z\u0022 title=\u002206/22/2015 02:01  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 22, 2015\u003C/time\u003E by beabop\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Windspren","CreatedById":134441,"CreatedDateTime":"2015-06-22T16:08:57Z","Content":"\n\u003Cp\u003ESeems more like a brand new game than a mod.\u003C/p\u003E\n"},{"CreatedByName":"Tyren","CreatedById":76757,"CreatedDateTime":"2015-06-22T16:29:52Z","Content":"\n\u003Cp\u003EA conversion mod for KSP? Cant see it coming, yet. Maybe after some more detailed information. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"weeble","CreatedById":117348,"CreatedDateTime":"2015-06-22T17:17:06Z","Content":"\n\u003Cp\u003EI haven\u0027t played with EPL before so I could easily be wrong. But doesn\u0027t it just build rockets that were designed in the VAB? You\u0027d have to add in the ability of designing into EPL.\u003C/p\u003E\u003Cp\u003EBut yeah, I agree with Laythe and Tyren this sounds more like a totally different game. It sounds like a really cool concept but it\u0027s pretty ambitious since the game is constantly changing so much with every major update. Will definitely keep tabs on this though.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-06-22T17:34:12Z","Content":"\n\u003Cp\u003EIn order to work with EPL in the manner that your OP seems to indicate you would need a VAB/SPH. So the first order of business should be to find a way to launch the VAB/SPH without KSC existing within the game. In theory this really shouldn\u0027t be that hard to do but you\u0027ll need to override/remove the launch button. Most everything else you want to do should be possible.\u003C/p\u003E\u003Cp\u003EMy other suggestion RE: Kopernicus is to only generate, say, 5 more stars or something that your Kerbals can reach, but don\u0027t put any bodies in orbit. Let the player actually travel to one and then have a button that says something like \u0022Survey\u0022, which generates the new star system and dumps them out of the game (with appropriate warning) so that the system can be built properly. Maybe Kopernicus can rebuild all the planets while in game, I don\u0027t know, but that would probably be the easiest way to do things. Of course that immediately wrecks any other save they load once the new solar system is loaded, but that\u0027s something that\u0027s pretty well understood when playing with Kopernicus.\u003C/p\u003E\n"},{"CreatedByName":"daniel l.","CreatedById":57763,"CreatedDateTime":"2015-06-22T20:52:33Z","Content":"\n\u003Cp\u003ETo test the idea you should replace the system with a mix of kopernicus planet packs then hyperedit a starter ship into space and see how you do.\u003C/p\u003E\n"},{"CreatedByName":"beabop","CreatedById":128715,"CreatedDateTime":"2015-06-23T12:35:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022daniel l.\u0022 data-cite=\u0022daniel l.\u0022\u003E\u003Cdiv\u003ETo test the idea you should replace the system with a mix of kopernicus planet packs then hyperedit a starter ship into space and see how you do.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat was the first thing I did when I got the mod idea. I had a blast! I was just like early hard career, except instead of never having enough funds, you never had enough propellant or RocketParts. I think interstellar delta-vs naturally make you cut weight until you have the bare minimum to start with.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022weeble\u0022 data-cite=\u0022weeble\u0022\u003E\u003Cdiv\u003EI haven\u0027t played with EPL before so I could easily be wrong. But doesn\u0027t it just build rockets that were designed in the VAB? You\u0027d have to add in the ability of designing into EPL.\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EIn order to work with EPL in the manner that your OP seems to indicate you would need a VAB/SPH. So the first order of business should be to find a way to launch the VAB/SPH without KSC existing within the game. In theory this really shouldn\u0027t be that hard to do but you\u0027ll need to override/remove the launch button. Most everything else you want to do should be possible.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, that\u0027s what Extraplanetary Launchpads does. Since it\u0027s technically cosmetic, it\u0027s my second order of business. The build I have of DevHelper actually does this by accident - when I check the VAB, I end up in a blue skybox where I can edit craft but can\u0027t save, load, or launch. I just have to figure out how to do it on purpose.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EMy other suggestion RE: Kopernicus is to only generate, say, 5 more stars or something that your Kerbals can reach, but don\u0027t put any bodies in orbit. Let the player actually travel to one and then have a button that says something like \u0022Survey\u0022, which generates the new star system and dumps them out of the game (with appropriate warning) so that the system can be built properly. Maybe Kopernicus can rebuild all the planets while in game, I don\u0027t know, but that would probably be the easiest way to do things. Of course that immediately wrecks any other save they load once the new solar system is loaded, but that\u0027s something that\u0027s pretty well understood when playing with Kopernicus.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, I think you\u0027d want to know what you\u0027re getting into before leaving - interstellar flight is *hard*. An exoplant-finding PartModule would be cool to add to all the telescope mods we have.\u003C/p\u003E\u003Cp\u003EWays to do this I\u0027ve thought of, ranked in ascending jankiness:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003E\u003Cstrong\u003EUnload planets\u003C/strong\u003E, reload them from config.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cstrong\u003ESerialize planets\u003C/strong\u003E into temporary binary file, unload them, reload from binary file.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cstrong\u003EMove planets to \u003C/strong\u003E\u003Cspan style=\u0022font-family:Consolas;\u0022\u003E\u003Cspan style=\u0022color:#2B91AF;\u0022\u003E\u003Cstrong\u003Efloat\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\u003Cspan style=\u0022font-family:Consolas;\u0022\u003E\u003Cspan style=\u0022color:#000000;\u0022\u003E\u003Cstrong\u003E.\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\u003Cspan style=\u0022font-family:Consolas;\u0022\u003E\u003Cspan style=\u0022color:#2B91AF;\u0022\u003E\u003Cstrong\u003EMaxValue\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E, limit camera zoom, and hope nobody launches from Kerbin. (This is the first thing I\u0027m trying.)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cstrong\u003ERestart KSP with different Kopernicus config\u003C/strong\u003E. I really hope I don\u0027t have to do this. Games with custom planets and mods (which this game mode would need) take forever to load.\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EIf you understand Kopernicus really well, please tell me what you think!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-23T12:43:47Z\u0022 title=\u002206/23/2015 12:43  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 23, 2015\u003C/time\u003E by beabop\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tyren","CreatedById":76757,"CreatedDateTime":"2015-06-23T12:56:25Z","Content":"\n\u003Cp\u003ELoading issues could be worked around with a load on demand. Somewhere should be a mod for it. Just to tell KSP it has to refer to the EPL and its surroundings could be a tricky part.\u003C/p\u003E\n"},{"CreatedByName":"daniel l.","CreatedById":57763,"CreatedDateTime":"2015-06-24T07:38:33Z","Content":"\n\u003Cp\u003EHeres an example of what your doin\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/N14vZUSnPrU?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"}]}