{"TopicId":113568,"ForumId":69,"TopicTitle":"[BUG] asymmetrical yaw in SAS","CreatedByName":"jkool702","CreatedById":146465,"CreatedDateTime":"2015-06-21T04:39:31Z","PageNum":1,"Articles":[{"CreatedByName":"jkool702","CreatedById":146465,"CreatedDateTime":"2015-06-21T04:39:31Z","Content":"\n\u003Cp\u003EKSP 1.0.2\u003C/p\u003E\u003Cp\u003Ewindows 7 64 bit\u003C/p\u003E\u003Cp\u003EI\u0027m not sure exactly how to replicate it, but sometimes the yaw control in SAS stops working properly. It will only go left at 1/4 of maximum (you can see this on the bottom left yaw indicator as well as by how the craft moves), however it will yaw to the right as full speed (possibly even higher than full speed). Its almost as though instead of yaw varying between -1 and 1 it varies between -0.25 and 1.75. \u003C/p\u003E\u003Cp\u003EThis often results in SAS producing uncontrollable spinning to the right, since it will go to the right very quickly, overshoot the target orientation, the left yaw will kick in but not do much, it will spin 180 degrees, the right yaw will kick in again, it will speed up going right, etc.\u003C/p\u003E\u003Cp\u003EDuring this manual yaw control still seems to be working correctly.\u003C/p\u003E\u003Cp\u003EI have found this problem will sometimes fix itself, but I\u0027m not sure how / when. It has persisted when shutting down / re-opening KSP. It has happened to me on multiple ships / landers.\u003C/p\u003E\n"},{"CreatedByName":"jkool702","CreatedById":146465,"CreatedDateTime":"2015-06-21T16:37:34Z","Content":"\n\u003Cp\u003EHere is an image showing what I am talking about. Here the SAS is set to go to maneuver, and the maneuver is directly to the left of my current location. Despite this, SAS will only go left yaw about 1/4 of the way (can be seen in bottom right of the picture).\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/fjDyze8.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/fjDyze8.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EHas anyone else had this problem? and/or have an idea of how to fix it? Having a buggy SAS is annoying...\u003C/p\u003E\n"}]}