{"TopicId":113668,"ForumId":16,"TopicTitle":"KIS Help .... Lost in space...","CreatedByName":"cwalrus","CreatedById":146367,"CreatedDateTime":"2015-06-22T03:40:20Z","PageNum":1,"Articles":[{"CreatedByName":"cwalrus","CreatedById":146367,"CreatedDateTime":"2015-06-22T03:40:20Z","Content":"\n\u003Cp\u003EHi - for the life of me i can\u0027t find the answer to this anywhere.\u003C/p\u003E\u003Cp\u003EI have KIS and KAS installed- all I need to do is move an RCS port from one end of my ship to the other. However, I can\u0027t seem to drop the detached part into my inventory to carry it with me... \u003C/p\u003E\u003Cp\u003EAny help hugely appreciated. I\u0027m on a Mac.. maybe it\u0027s a bug?\u003C/p\u003E\u003Cp\u003Ethanks!\u003C/p\u003E\n"},{"CreatedByName":"Xannari Ferrows","CreatedById":125369,"CreatedDateTime":"2015-06-22T03:51:16Z","Content":"\n\u003Cp\u003EYou can\u0027t drop it into a bin? Is that what you meant by inventory?\u003C/p\u003E\u003Cp\u003EBe sure you have enough space, as each available part has it\u0027s own storage variable.\u003C/p\u003E\n"},{"CreatedByName":"MaverickSawyer","CreatedById":11952,"CreatedDateTime":"2015-06-22T04:02:23Z","Content":"\n\u003Cp\u003EI think he means the Kerbal\u0027s personal inventory. In that case, yeah... it may not fit. Two hacks around this:\u003C/p\u003E\u003Cp\u003E1. start moving at a VERY slow speed down the ship and drop the part. It\u0027ll coast alongside you until you grab it and place it on the ship again.\u003C/p\u003E\u003Cp\u003E2. Hopscotch your way down the ship, repeatedly moving and placing the part. It\u0027ll take longer... but there\u0027s no risk of loosing the part to the abyss.\u003C/p\u003E\n"},{"CreatedByName":"rofltehcat","CreatedById":145224,"CreatedDateTime":"2015-06-22T04:07:52Z","Content":"\n\u003Cp\u003EYou are probably just clicking, not holding down the buttons.\u003C/p\u003E\u003Cp\u003EEquip a wrench on your Engineer. Then hold down the G button, move your mouse over the part you want to move to your inventory, hold down the left mouse button (maybe can now release G, not 100% sure), while holding it still down, drag it into your inventory, then release left mouse and G.\u003C/p\u003E\n"},{"CreatedByName":"cwalrus","CreatedById":146367,"CreatedDateTime":"2015-06-22T05:20:02Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/members/148858-rofltehcat\u0022 rel=\u0022external nofollow\u0022\u003Erofltehcat\u003C/a\u003E\u003Cspan style=\u0022color:#3E3E3E;\u0022\u003E you are a ROCKSTAR\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#3E3E3E;\u0022\u003Estupid key sequence! Now it works.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#3E3E3E;\u0022\u003EBasically I made it all the way to one of Jool\u0027s moons, and my RCS dried up. So i need to move the Vernol engines from the booster stage up to my lander... it\u0027s gonna work now! YOU HAVE SAVED MANY KERBALS! \u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#3E3E3E;\u0022\u003Ewell... three....\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"rofltehcat","CreatedById":145224,"CreatedDateTime":"2015-06-22T05:39:26Z","Content":"\n\u003Cp\u003EOne. Two. Many. You got that counting still right \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EHappy to be of help!\u003C/p\u003E\n"}]}