{"TopicId":113925,"ForumId":16,"TopicTitle":"Mun Contracts","CreatedByName":"locustgate","CreatedById":81277,"CreatedDateTime":"2015-06-23T23:17:52Z","PageNum":1,"Articles":[{"CreatedByName":"locustgate","CreatedById":81277,"CreatedDateTime":"2015-06-23T23:17:52Z","Content":"\n\u003Cp\u003EI haven\u0027t received any contracts to land on the Mun (put a station in orbit is the only one), in my recent playthrough, did they remove them or is it bound to a certain rep lvl? Wondering whether or not to post support.\u003C/p\u003E\n"},{"CreatedByName":"Trexation","CreatedById":146846,"CreatedDateTime":"2015-06-24T03:22:08Z","Content":"\n\u003Cp\u003EI remember reading somewhere that doing a flyby helps to make it a valid target to land on. In my KSP career game I remember not having many moon missions until I sent a lander, then I got missions to land bases take temp scans, and rescue kerbals out of orbit. \u003C/p\u003E\u003Cp\u003EHere is a rocket I would recommend, costing only 12,615 and weighing in at 27.1 tons.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.gyazo.com/83e53de359598dd03979555d5414d00a.jpg\u0022 alt=\u002283e53de359598dd03979555d5414d00a.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Clockwork13","CreatedById":100102,"CreatedDateTime":"2015-06-24T03:46:56Z","Content":"\n\u003Cp\u003EPretty sure you are supposed to get them once you get in orbit around kerbin.\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2015-06-24T08:01:29Z","Content":"\n\u003Cp\u003EContracts are assigned to you with a certain randomness factor. You simply may have been unlucky.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-06-24T08:45:34Z","Content":"\n\u003Cp\u003EAlso, I think if you go there before the contract comes up, you\u0027ll never get the contract.\u003C/p\u003E\u003Cp\u003EYou should still get the \u0022plant a flag\u0022 and survey contracts and all those, just not the \u0022explore mun\u0022 contract.\u003C/p\u003E\n"},{"CreatedByName":"Janos1986","CreatedById":132068,"CreatedDateTime":"2015-06-24T08:47:23Z","Content":"\n\u003Cp\u003EIn my current save I have contracts for temperature scans and flag planting on the Mun, but I never had the \u0022Explore the Mun\u0022 contract. Go figure.\u003C/p\u003E\n"}]}