{"TopicId":113921,"ForumId":16,"TopicTitle":"Aerocapture in 1.0.4?","CreatedByName":"Casper139","CreatedById":146849,"CreatedDateTime":"2015-06-23T22:15:56Z","PageNum":1,"Articles":[{"CreatedByName":"Casper139","CreatedById":146849,"CreatedDateTime":"2015-06-23T22:15:56Z","Content":"\n\u003Cp\u003ENeed help here. \u003C/p\u003E\u003Cp\u003EBefore 1.0.3/1.0.4 patches, I used Jool to aerocapture with a mining craft I\u0027ve been working on. The goal was to land on Tylo. My first attempts at aerocapture got me into Jool orbit and I easily transfered to Tylo. I came up short of fuel to land however, but that\u0027s beside the point. I built a new lander and was trying again today after the recent patches. My Periapsis entering Jool atmosphere was always between 185000 to 190000. Now, as soon as I hit the atltitude of about 198000m, My craft explodes. Ironically, I placed heat shields on the craft before the patch was released. I enter the atmosphere prograde leading with sheilds. How do we Aerocapture now? Does my design suck? \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://images.akamai.steamusercontent.com/ugc/523889851078057898/F891E9EC06E88C5930D6DE569825C1AFC8C1B406/\u0022 alt=\u0022F891E9EC06E88C5930D6DE569825C1AFC8C1B406\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"maccollo","CreatedById":72759,"CreatedDateTime":"2015-06-23T22:25:57Z","Content":"\n\u003Cp\u003EIt explodes doesn\u0027t say very much? Are your decouplers getting fried? Does it flip around?\u003C/p\u003E\u003Cp\u003EAnyway, you don\u0027t need to do aerocapture at Jool. You can just swing by Tylo. It\u0027s fairly easy to set the right encounter during one of the course corrections half way from Kerbin to Jool.\u003C/p\u003E\n"},{"CreatedByName":"One-Way Films","CreatedById":90926,"CreatedDateTime":"2015-06-23T22:26:25Z","Content":"\n\u003Cp\u003Eyou might wanna bring the design back to kerbin or make as much use out of that craft as you can. You\u0027ll need some radiators to take some of the heat away from the fuel tanks. The design has all the fuel tanks bunched together and a heatshield is merging into one of those tanks. Convection will bring heat across to the already heated fuel tank (just behind the 3m heatshield) and cause your explosion. You could alter your course and get a gravity assist around Tylo into the Joolian system. From the Tylo assist, aerobrake around Laythe. It\u0027s atmosphere is much thinner and that craft has a much larger chance of surviving Laythe entry. From Laythe, go on with your normal plan. Depending on how the moons are aligned, you can save or lose fuel. good luck!\u003C/p\u003E\n"},{"CreatedByName":"Xannari Ferrows","CreatedById":125369,"CreatedDateTime":"2015-06-23T22:28:36Z","Content":"\n\u003Cp\u003EAre you sure all of you\u0027re craft is protected from the airstream? Heat can transfer between parts through convection, so that could also be it...\u003C/p\u003E\n"},{"CreatedByName":"Vaporo","CreatedById":110800,"CreatedDateTime":"2015-06-23T22:28:46Z","Content":"\n\u003Cp\u003EMy recommendation for anyone who tries aerocapture around Jool: Just use a Tylo gravity assist. Aerobraking is sometimes the best way to go, but recently I\u0027ve found that it\u0027s just much, much easier to use gravity assists. Though... that thing looks likes it should work. Maybe try for a higher periapsis? I can never remember the atmosphere height on Jool. I think reentry heating is supposed to be more severe in 1.0.3. I\u0027m not sure.\u003C/p\u003E\n"},{"CreatedByName":"Casper139","CreatedById":146849,"CreatedDateTime":"2015-06-23T22:34:12Z","Content":"\n\u003Cp\u003EThe Craft just explodes. Thermometers blink for a half second and boom. No flips or anything. The shield appears to merge in the picture, but they do clear. I will try a new approach rather than a Jool AC. Gravity assist will be a new thing for me. Thanks for the suggestions.\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2015-06-23T22:54:17Z","Content":"\n\u003Cp\u003EHeating is proportional to v^3.\u003C/p\u003E\u003Cp\u003EEntry at 10km/sec is much, much, much deadlier than Munar reentry on Kerbin (3km/sec).\u003C/p\u003E\n"},{"CreatedByName":"Pixel of Life","CreatedById":45646,"CreatedDateTime":"2015-06-23T22:57:58Z","Content":"\n\u003Cp\u003ECheck the heatshields - running your engines near max temp for extended periods of time actually eats up all the ablator unless you have some sort of insulator between the shield and all the other stuff.\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2015-06-24T00:40:07Z","Content":"\n\u003Cp\u003EDid anyone check the F3. This could just be a 1.0.4 Kraken. If so I got the name \u0027Don\u0027t tread on Jool, Kraken\u0027.\u003C/p\u003E\u003Cp\u003EIf is a real DOT then F3 will show some temporal progression.\u003C/p\u003E\n"},{"CreatedByName":"franklinreinoza","CreatedById":146877,"CreatedDateTime":"2015-06-24T05:56:08Z","Content":"\n\u003Cp\u003EI have the same problem. My craft explote as soon as touch the atmosphere and it dosent care wich planetplanet ist, Jool, tylo, laythe etc. In all explode, after one mili second in the atmosphere. \u003C/p\u003E\u003Cp\u003EThe speed of my craft, it\u0027s around 8km/s\u003C/p\u003E\n"},{"CreatedByName":"Reactordrone","CreatedById":110060,"CreatedDateTime":"2015-06-24T08:56:07Z","Content":"\n\u003Cp\u003EIt\u0027s possible to overheat the heatshields now if the heating is too rapid. No idea if this is a feature or a bug.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://img.photobucket.com/albums/v499/swampmonster/Kerbal%20space%20program/heatshield%20destruction_zps5ucdbxhh.jpg\u0022 alt=\u0022heatshield%20destruction_zps5ucdbxhh.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"selfish_meme","CreatedById":125899,"CreatedDateTime":"2015-06-24T09:25:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Reactordrone\u0022 data-cite=\u0022Reactordrone\u0022\u003E\u003Cdiv\u003EIt\u0027s possible to overheat the heatshields now if the heating is too rapid. No idea if this is a feature or a bug.\u003Cp\u003E\u003Ca href=\u0022http://img.photobucket.com/albums/v499/swampmonster/Kerbal%20space%20program/heatshield%20destruction_zps5ucdbxhh.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://img.photobucket.com/albums/v499/swampmonster/Kerbal%20space%20program/heatshield%20destruction_zps5ucdbxhh.jpg\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFeature\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2015-06-24T09:32:53Z","Content":"\n\u003Cp\u003EYou have to use much shallower approach angles now. If your craft explodes, check the flight log. If it exploded from overheating you need to raise your periapsis for aero capture.\u003C/p\u003E\n"},{"CreatedByName":"Alewx","CreatedById":102791,"CreatedDateTime":"2015-06-24T09:57:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MailletC\u0022 data-cite=\u0022MailletC\u0022\u003E\u003Cdiv\u003EYou have to use much shallower approach angles now. If your craft explodes, check the flight log. If it exploded from overheating you need to raise your periapsis for aero capture.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut where can we find the correct angle for an reentry or aero capture maneuver?\u003C/p\u003E\u003Cp\u003EDoes MechJeb provide this angle; Engineer does not.\u003C/p\u003E\n"},{"CreatedByName":"Richy teh space man","CreatedById":12511,"CreatedDateTime":"2015-06-24T10:03:12Z","Content":"\n\u003Cp\u003EI\u0027m finding these new heat effect mechanics to be a pain, most of the craft I had built for 1.02 now explode on re entry, even with shallower descent angles.\u003C/p\u003E\u003Cp\u003EI\u0027m finding it off putting all these changes to the atmosphere that keep happening, just wish Squad would pick one model and stick with it rather than changing it every other update..\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-06-24T10:27:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Richy teh space man\u0022 data-cite=\u0022Richy teh space man\u0022\u003E\u003Cdiv\u003EI\u0027m finding these new heat effect mechanics to be a pain, most of the craft I had built for 1.02 now explode on re entry, even with shallower descent angles.\u003Cp\u003EI\u0027m finding it off putting all these changes to the atmosphere that keep happening, just wish Squad would pick one model and stick with it rather than changing it every other update..\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI haven\u0027t tried it yet (stupid work getting in the way of my play time) but I hope that if re-entry is as bad as everybody is making it out to be, that the model they settle on is this current one \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"miceliux","CreatedById":72239,"CreatedDateTime":"2015-06-24T15:11:51Z","Content":"\n\u003Cp\u003EI was experiencing this same issue in 1.0.2 while aerobreaking on Jool at 10km/s.\u003C/p\u003E\u003Cp\u003EI tried different apoapsis, and I was able to do it at a height of about 195 km. Even 1 km of difference could make my ship explode.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2015-06-24T15:35:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022miceliux\u0022 data-cite=\u0022miceliux\u0022\u003E\u003Cdiv\u003EI was experiencing this same issue in 1.0.2 while aerobreaking on Jool at 10km/s.\u003Cp\u003EI tried different apoapsis, and I was able to do it at a height of about 195 km. Even 1 km of difference could make my ship explode.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWeirdly I did the same with this ship \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/Pt2NWEP\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/Pt2NWEP.png\u0022 alt=\u0022Pt2NWEP.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt had this tug \u003Ca href=\u0022http://imgur.com/famdnBZ\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/famdnBZ.png\u0022 alt=\u0022famdnBZ.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Eon the back, it went almost well, did 195 km came in with nose and heatshields first. first time the atmospheric messurment instrumets blew up so I moved them inside containers with KIS and tried again, \u003C/p\u003E\u003Cp\u003Emuch better except that the ship started to tumble shortly after Pe, and ended up going engines first, a couple of ladders blew up else ship was unhurt.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2015-06-24T15:50:46Z","Content":"\n\u003Cp\u003ESo, it now seems that roverdude\u0027s radiators are standard equipment if you plan on aerobraking or reentry, even if it\u0027s just from the Mun. Because, forgive me, but I just do not find it fun to go round and round and round and round just so I can land my Mun lander back on Kerbin.I realize that there are other ways of dealing with the reentry heat, like heat shields or even changing the difficulty settings. But, the heat shields are heavier than radiators, and I like at least trying to play the game as intended for a while before making major changes to .cfgs or difficulty. \u003C/p\u003E\u003Cp\u003ESo is this what was intended? Pushing us towards using radiators for reentry? And for those of you that carry over saves from version to version, this must suck big time, especially since one would think that a 1.0 release would mean no more save breaking. I think it\u0027s safe to assume now that the 1.0 label meant absolutely nothing.\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2015-06-24T16:15:26Z","Content":"\n\u003Cp\u003EIf you don\u0027t have a heatshield, \u0026gt;3km/sec is not terribly survivable.\u003C/p\u003E\n"},{"CreatedByName":"Nich","CreatedById":145678,"CreatedDateTime":"2015-06-24T16:25:10Z","Content":"\n\u003Cp\u003EI hate to say it but all of my old craft will simply require 3-4 passes at 40k. The big problem is that ships that used to barely survive with 2 chutes now need 3. If your like me with trouist in said craft be prepaired for lots of orbit lowing before entry and aiming for a water landing. At least the delta-v savings from easier launches offsets the fact just about every craft will need a heat shield.\u003C/p\u003E\n"},{"CreatedByName":"Magniff","CreatedById":97424,"CreatedDateTime":"2015-06-24T18:13:48Z","Content":"\n\u003Cp\u003EFirst of all, what this new feature is intended to do:\u003C/p\u003E\u003Cp\u003E(Unfortunately I don\u0027t know how to properly quote an article, therefore I used this little dirty trick \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E)\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022HarvesteR\u0022 data-cite=\u0022HarvesteR\u0022\u003E\u003Cdiv\u003E* Added a factor to simulate the switch from laminar to turbulent flow (in layman\u0027s terms, if you\u0027re going too fast too low, you get a massive boost to heating). That corrects so steep reentries are in fact deadlier than shallow ones.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESince reentry on Kerbin is currently rather harmless, I fundamentally agree with the new \u0022to fast, to low\u0022 feature (introduced by patch 1.0.3).\u003C/p\u003E\u003Cp\u003EThere should definitely be at least some basic threat to burn-up during reentry.\u003C/p\u003E\u003Cp\u003EIn addition, you\u0027ll probably only encountered this new feature if you intentionally try to destroy your vessel.\u003C/p\u003E\u003Cp\u003EBut, I dislike the way this new feature is implemented:\u003C/p\u003E\u003Cp\u003EAny part that exceeds a particular velocity on a given atmospheric density, will be instantly destroyed by overwhelming amounts of heat.\u003C/p\u003E\u003Cp\u003EFuthermore there seems to be no consistentl heat progression towards the burn-up. \u003C/p\u003E\u003Cp\u003EInstead the maximum skin-temperatures will tend to drop for some seconds, until the final burn-up occurs.\u003C/p\u003E\u003Cp\u003EThere\u0027s also no recognisable burn-up order of the involved parts.\u003C/p\u003E\u003Cp\u003EIt\u0027s not like: Your heatshield goes first, afterwards (almost simultaneously) your batterys overheat and finally (with a small delay) your fuel-tanks explode.\u003C/p\u003E\u003Cp\u003EInstead the entire burn-up feels much more like crashing into a wall!\u003C/p\u003E\u003Cp\u003ETo illustrate this behaviour, I\u0027ve prepared some pictures from my previous reentry testing in 1.0.4.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022%5Bimg%5Dhttp%3A//i.imgur.com/vQKDamS.png\u0022 alt=\u0022vQKDamS.png\u0022\u003E\u003Cp\u003EThe test-vehicle\u0027s apoapsis is slightly above Minimus orbit, it\u0027s periapsis is close to the center of Kerbin.\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/5ofGxE4.png\u0022 alt=\u00225ofGxE4.png\u0022\u003E\u003Cp\u003EInital reentry velocity at 3.3 km/s.\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/FyAyS0t.png\u0022 alt=\u0022FyAyS0t.png\u0022\u003E\u003Cp\u003EMax. recorded skin-temperature is at roughly 2900 Ã‚Â°K (all my other screenshots showed a lower skin-temp.).\u003C/p\u003E\u003Cp\u003EYou can also see the vessel\u0027s propulsion-stage, falling in front of it at 600 m distance.\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/S1ItoHx.png\u0022 alt=\u0022S1ItoHx.png\u0022\u003E\u003Cp\u003ESkin-temp. has allready droped by almost 200 Ã‚Â°K, less then one second away from final burn-up.\u003C/p\u003E\u003Cp\u003EIn front, you see the propulsion-stage hitting the \u0022to fast, to low\u0022 wall.\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/SSP8rfY.png\u0022 alt=\u0022SSP8rfY.png\u0022\u003E\u003Cp\u003EMore than 2 km/s below 19 km altitude? - KSP says: Nay!\u003C/p\u003E\u003Cp\u003EIn this screenshot, you can also see the temperature gauges of some parts inside the explosion. \u003C/p\u003E\u003Cp\u003EBut you probably won\u0027t be able to recognise them during normal gameplay\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003EMaybe the feature is intended to simulate g-forces instead of heating, you might say.\u003C/p\u003E\u003Cp\u003EIn this case, I\u0027d at least expect to see a recognisable order of structural failures.\u003C/p\u003E\u003Cp\u003EAccording to the individual part\u0027s impact tollerance.\u003C/p\u003E\u003Cp\u003EWhat do you think about the new \u0022to fast, to low\u0022 feature?\u003C/p\u003E\u003Cp\u003EShould it be rebalanced or is it fine as it is?\u003C/p\u003E\u003Cp\u003E(Please excuse any scribal errors or flawed grammar in my posts!)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-24T19:36:07Z\u0022 title=\u002206/24/2015 07:36  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 24, 2015\u003C/time\u003E by Magniff\u003C/strong\u003E\n\u003Cbr\u003Eclarification\n\u003C/span\u003E\n"},{"CreatedByName":"NovaSilisko","CreatedById":3897,"CreatedDateTime":"2015-06-24T18:16:55Z","Content":"\n\u003Cp\u003EThis is basically what happens to meteors in real life, see Chelyabinsk \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-06-24T18:19:35Z","Content":"\n\u003Cp\u003EYou\u0027re going 2km/s and hitting the thicker atmosphere of Kerbin, I don\u0027t see a problem here.\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-06-24T18:27:17Z","Content":"\n\u003Cp\u003EMoved to gameplay questions, also, you have to take aerodynamic heating into account now, this is a long requested feature.\u003C/p\u003E\n"}]}