{"TopicId":114080,"ForumId":16,"TopicTitle":"New Thermal control system not working correctly when stowed?","CreatedByName":"jkool702","CreatedById":146465,"CreatedDateTime":"2015-06-25T04:22:36Z","PageNum":1,"Articles":[{"CreatedByName":"jkool702","CreatedById":146465,"CreatedDateTime":"2015-06-25T04:22:36Z","Content":"I decided to try out the new thermal control systems (large)on a test ship. When they are deployed they work very well, however when they are stowed they do something rather peculiar - despite being right next to the nukes which are generating the heat they are literally the coolest part on the ship! The part it is attached to is 1200 degrees, where as the radiator (when stowed) is 700 degrees (and still dropping as I type this). Is this a bug?\n\n![7YRFZ7m.jpg](http://i.imgur.com/7YRFZ7m.jpg)\n\n![TFbjsaW.jpg](http://i.imgur.com/TFbjsaW.jpg)"},{"CreatedByName":"Randazzo","CreatedById":136468,"CreatedDateTime":"2015-06-25T04:35:23Z","Content":"Notice the \u0022status\u0022 indicator on the radiator panels. Deployed radiators will say \u0022Cooling\u0022. Since the status says retracted, I imagine they aren\u0027t doing anything.\n\nEdit: And I don\u0027t think that\u0027s a bug. They shouldn\u0027t be able to radiate away heat when the panels are all jammed together."},{"CreatedByName":"Troubletcat","CreatedById":130757,"CreatedDateTime":"2015-06-25T04:44:09Z","Content":"Yeah, I\u0027m pretty sure they\u0027re not SUPPOSED to do anything while retracted. Why would they? Or is this thread a joke that I\u0027m not getting..."},{"CreatedByName":"Thiagobs","CreatedById":76021,"CreatedDateTime":"2015-06-25T05:02:34Z","Content":"I assume what the OP meant is that, while the radiators shouldn\u0027t cool down while stowed, they should pick up some heat themselves, as if they were any other non-radiator part..."},{"CreatedByName":"Randazzo","CreatedById":136468,"CreatedDateTime":"2015-06-25T05:15:04Z","Content":"\u003E \n\u003E I assume what the OP meant is that, while the radiators shouldn\u0027t cool down while stowed, they should pick up some heat themselves, as if they were any other non-radiator part...\n\nStock radiators have almost zero heat conductivity due to \u0022insulation\u0022, according to the config file. They won\u0027t pick up or pass heat like most parts."},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-06-25T12:18:04Z","Content":"Not a bug, stowed radiators don\u0027t cool anything but themselves, you can imagine that the coolant pumps are offline to prevent damaging them by drawing in any extra heat, the stowed radiators will radiate their own heat in the same way that any other non-radiator part will."},{"CreatedByName":"jkool702","CreatedById":146465,"CreatedDateTime":"2015-06-25T14:39:08Z","Content":"\u003E \n\u003E I assume what the OP meant is that, while the radiators shouldn\u0027t cool down while stowed, they should pick up some heat themselves, as if they were any other non-radiator part...\n\nYes, this is what I was asking (I thought the text in my OP made that pretty clear...). It seemed very strange for a stowed radiator to be several hundred degrees cooler than the part it was attached to, as I would expect it to act just like any other part. Being extremely cool when attached to an extremely hot part is not how most parts behave.\n\n\u003E \n\u003E Stock radiators have almost zero heat conductivity due to \u0022insulation\u0022, according to the config file. They won\u0027t pick up or pass heat like most parts.\n\nThis seems to answer the question. Still find the behavior strange, but I guess its intended.\n\n**Edited \u003Ctime datetime=\u00222015-06-25T15:08:45Z\u0022 title=\u002206/25/2015 03:08  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 25, 2015\u003C/time\u003E by jkool702**"}]}