{"TopicId":114062,"ForumId":20,"TopicTitle":"KIS/KAS picking up an object during EVA and moving it around a space station exterior","CreatedByName":"Ledg","CreatedById":146927,"CreatedDateTime":"2015-06-24T23:06:49Z","PageNum":1,"Articles":[{"CreatedByName":"Ledg","CreatedById":146927,"CreatedDateTime":"2015-06-24T23:06:49Z","Content":"\n\u003Cp\u003EI\u0027m unable to move parts around on my space station because I cannot RCS while holding a part. I\u0027ve seen tutorials galore where the part is stored on the Kerbal\u0027s back but I cannot find the answer on how to do this.\u003C/p\u003E\u003Cp\u003EPlease advise. \u003C/p\u003E\u003Cp\u003EThanks.\u003C/p\u003E\u003Cp\u003E---Ledg\u003C/p\u003E\n"},{"CreatedByName":"Perry Apsis","CreatedById":97519,"CreatedDateTime":"2015-06-24T23:41:45Z","Content":"\n\u003Cp\u003EHey, Ledg. Open your inventory. Then when you \u0026lt;G\u0026gt;rab a part, hold the mouse down and slide it right into your inventory. Not everything will go, but a surprising amount will. Otherwise, if you want to move a part from point A to point B, go float midway between them. Grab the part and then X-click to attach it at point B. If they\u0027re too far apart, attach it as far toward B as you can, then repeat the process. It\u0027s kind of painful, especially at first. One thing you can do is attach a bit of ladder where you want to be hovering, then grab onto it and move your part.\u003C/p\u003E\u003Cp\u003ETo be honest, I don\u0027t think the system is as well optimized for orbital work as it is for ground operations, but I\u0027ve had endless fun with it in orbit, nonetheless. For example: \u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/icjDs\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Ledg","CreatedById":146927,"CreatedDateTime":"2015-06-25T02:57:31Z","Content":"\n\u003Cp\u003EThanks very much. I had tried this with parts already on the station such as batteries, a mechjeb and illuminators but these would not go into the inventory. When I tried it with a small strut it worked. I suppose I have to modify some config file to move those other parts around.\u003C/p\u003E\n"},{"CreatedByName":"Torih","CreatedById":144304,"CreatedDateTime":"2015-06-28T21:22:38Z","Content":"\n\u003Cp\u003EYou can put the SC-62 container on your back and use it to carry far larger parts.\u003C/p\u003E\n"},{"CreatedByName":"ss8913","CreatedById":94747,"CreatedDateTime":"2016-01-03T07:23:49Z","Content":"\n\u003Cp\u003E\napparently you can now put the larger parts, like an inflatable greenhouse from MKS, into say an ILC-18 container, and then grab it into a kerbal\u0027s inventory - it\u0027ll show up as \u0022carried\u0022 instead of like.. in the backpack.\n\u003C/p\u003E\n"},{"CreatedByName":"ctbram","CreatedById":99635,"CreatedDateTime":"2016-01-17T18:46:50Z","Content":"\n\u003Cp\u003E\nI am running into the same problem and I am getting really upset.  I took a part out of my inventory and accidentally dropped.  Now it\u0027s floating away in space and I am chasing it.  \n\u003C/p\u003E\n\u003Cp\u003E\nWhen I grab it and try to put it back in my inv I get a message there is something already in that slot!!!  But there is nothing in the slot!  It\u0027s the same slot I took the thing out of? \n\u003C/p\u003E\n\u003Cp\u003E\nSo I cannot put the thing on my back, and I cannot use my jet pack while holding the part!!!!!!  I am really getting so mad I am ready to take a bat to the computer!!!  \n\u003C/p\u003E\n\u003Cp\u003E\nWhy the heck is it so much to ask to be able to pick up a part in space and either get it back into your inv or jut carry the darn thing to get back to your ship!!  I have now lost a kerbal AND the part!\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-01-17T18:48:57Z\u0022 title=\u002201/17/2016 06:48  PM\u0022 data-short=\u00228 yr\u0022\u003EJanuary 17, 2016\u003C/time\u003E by ctbram\u003C/strong\u003E\n\u003C/span\u003E\n"}]}