{"TopicId":114183,"ForumId":32,"TopicTitle":"The Batman PC port situation has me worried about KSP for the PS4","CreatedByName":"CynicalVision","CreatedById":26445,"CreatedDateTime":"2015-06-25T23:42:37Z","PageNum":1,"Articles":[{"CreatedByName":"CynicalVision","CreatedById":26445,"CreatedDateTime":"2015-06-25T23:42:37Z","Content":"\n\u003Cp\u003EIf any of you aren\u0027t up to speed, the developers of Batman Arkham Knight (Rocksteady Studios) outsourced the PC port to another company (Iron Galaxy Studios), and surprise surprise they did a terrible job resulting in numerous problems with the PC version ranging from crashes, major FPS issues and other problems. So much so that the PC version has been suspended. \u003C/p\u003E\u003Cp\u003ENow, Squad are doing the exact same with the PS4 version of their game, outsourcing the job over to Flying Tiger Entertainment. This has a potential to end up the same way, this thread doesn\u0027t really have a point other than for the love of god Squad, for the sake of your repuation and your customers just make sure you personally do some quality assurance before signing your names to it.\u003C/p\u003E\n"},{"CreatedByName":"r4pt0r","CreatedById":90471,"CreatedDateTime":"2015-06-25T23:47:14Z","Content":"\n\u003Cp\u003EAre you honestly telling me you don\u0027t implicitly trust the mighty creators of \u003Ca href=\u0022http://www.ftmobile.com/Products/Toy-Raid-Elite-Forces.aspx\u0022 rel=\u0022external nofollow\u0022\u003EToy Raid: Elite Forces\u003C/a\u003E?\u003C/p\u003E\u003Cp\u003EI want the PS4 version to be great, and if it is I\u0027ll happily get it on my Sonybox, but I agree with OP about the dubious nature of these flying tiger guys.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-25T23:55:56Z\u0022 title=\u002206/25/2015 11:55  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 25, 2015\u003C/time\u003E by r4pt0r\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tankman101","CreatedById":144359,"CreatedDateTime":"2015-06-25T23:54:20Z","Content":"\n\u003Cp\u003EOh boy, one of these topics again!\u003C/p\u003E\n"},{"CreatedByName":"Eric S","CreatedById":57117,"CreatedDateTime":"2015-06-26T00:09:25Z","Content":"\n\u003Cp\u003EThings like that make me glad that squad is outsourcing the PS4 port rather than the PC port. I hope that the PS4 port is wonderful and all, but since the last console I owned was the 2600, it\u0027s really more a matter wanting it to be good for other people than for my own needs.\u003C/p\u003E\n"},{"CreatedByName":"Torih","CreatedById":144304,"CreatedDateTime":"2015-06-26T00:47:11Z","Content":"\n\u003Cp\u003EMany games are ported and a lot of the time its by another company, and most turn out fine. Batman is and extreme example of things going very wrong. I wouldn\u0027t worry about it.\u003C/p\u003E\n"},{"CreatedByName":"Megan","CreatedById":145770,"CreatedDateTime":"2015-06-26T01:14:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022r4pt0r\u0022 data-cite=\u0022r4pt0r\u0022\u003E\u003Cdiv\u003EAre you honestly telling me you don\u0027t implicitly trust the mighty creators of \u003Ca href=\u0022http://www.ftmobile.com/Products/Toy-Raid-Elite-Forces.aspx\u0022 rel=\u0022external nofollow\u0022\u003EToy Raid: Elite Forces\u003C/a\u003E?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis sarcasm is uncalled for. They totally redeemed themselves with Hookups Wallpaper.\u003C/p\u003E\n"},{"CreatedByName":"klgraham1013","CreatedById":105132,"CreatedDateTime":"2015-06-26T01:31:50Z","Content":"\n\u003Cp\u003EI think it\u0027s more of an issue with Warner Bros. considering both Arkham Knight and Mortal Kombat X were unplayable at launch on PC.\u003C/p\u003E\n"},{"CreatedByName":"smjjames","CreatedById":134004,"CreatedDateTime":"2015-06-26T01:34:41Z","Content":"\n\u003Cp\u003EAnybody know how good Iron Galaxy studios are? If they are bad at doing console to PC ports, then that\u0027s just a poor business choice, by bioth SQUAD and Rocksteady.\u003C/p\u003E\n"},{"CreatedByName":"klgraham1013","CreatedById":105132,"CreatedDateTime":"2015-06-26T01:45:54Z","Content":"\n\u003Cp\u003EIron Galaxy isn\u0027t a horrible company. They\u0027ve done great work porting older fighting games to consoles, such as Street Fighter 3 and Darkstalkers. I believe they did both of those. They also just completed the second season for Killer Instinct on XBox One. My guess is there\u0027s more to the story with Arkham Knight.\u003C/p\u003E\u003Cp\u003EAs far as MKX goes, High Voltage has done the past 3 PC ports for NetherRealm and they\u0027ve all been bad.\u003C/p\u003E\n"},{"CreatedByName":"annallia","CreatedById":75681,"CreatedDateTime":"2015-06-26T04:12:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Torih\u0022 data-cite=\u0022Torih\u0022\u003E\u003Cdiv\u003EMany games are ported and a lot of the time its by another company, and most turn out fine. Batman is and extreme example of things going very wrong. I wouldn\u0027t worry about it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis. \u003C/p\u003E\u003Cp\u003EYeah there are a few mishaps here and there, but as a whole it is usually fine. Worrying about it does no good.\u003C/p\u003E\n"},{"CreatedByName":"goldenpsp","CreatedById":113874,"CreatedDateTime":"2015-06-26T04:32:53Z","Content":"\n\u003Cp\u003EApples and oranges comparison.\u003C/p\u003E\n"},{"CreatedByName":"Mako","CreatedById":69375,"CreatedDateTime":"2015-06-26T05:22:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022goldenpsp\u0022 data-cite=\u0022goldenpsp\u0022\u003E\u003Cdiv\u003EApples and oranges comparison.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAbsolutely. Porting from PC to a single console all but eliminates the worry of getting software working on multiple hardware configurations and operating systems. I say \u0022all but\u0022 because I\u0027m sure a hardware revision over the life of a console could potentially mean you have another hardware config to worry about.\u003C/p\u003E\u003Cp\u003EThis is extremely different from porting a console game to PC. Even if you\u0027re only targeting Windows operating systems there are at the very least 3 different versions you need to focus on (7, 8.1, 10, and you could potentially count Vista and XP to make it 5 versions). That\u0027s not even considering Mac or Linux playability. Then you need to attempt to make the thing work on a theoretical infinite number of hardware configurations ranging from several years old to bleeding edge parts.\u003C/p\u003E\u003Cp\u003EApples to oranges. Now that\u0027s not to say things go perfect, but from my point of view (based on extremely limited programming experience) it must reduce a ton of the variables that can make developing and testing software difficult.\u003C/p\u003E\n"},{"CreatedByName":"Temeter","CreatedById":58056,"CreatedDateTime":"2015-06-26T06:45:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mako\u0022 data-cite=\u0022Mako\u0022\u003E\u003Cdiv\u003EAbsolutely. Porting from PC to a single console all but eliminates the worry of getting software working on multiple hardware configurations and operating systems. I say \u0022all but\u0022 because I\u0027m sure a hardware revision over the life of a console could potentially mean you have another hardware config to worry about.\u003Cp\u003EThis is extremely different from porting a console game to PC. Even if you\u0027re only targeting Windows operating systems there are at the very least 3 different versions you need to focus on (7, 8.1, 10, and you could potentially count Vista and XP to make it 5 versions). That\u0027s not even considering Mac or Linux playability. Then you need to attempt to make the thing work on a theoretical infinite number of hardware configurations ranging from several years old to bleeding edge parts.\u003C/p\u003E\u003Cp\u003EApples to oranges. Now that\u0027s not to say things go perfect, but from my point of view (based on extremely limited programming experience) it must reduce a ton of the variables that can make developing and testing software difficult.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027re making it sound like having a game run fine on PC is some near-impossible to achieve task. That\u0027s nonsense, PC games usually manage to best most possible hardware configurations. Porting cost isn\u0027t much of a factor, considering how many very traditional console games are coming to PC. Most current ports are even very good, the period of bad console ports during PS360 is gone, just compare the jump from borderlands 1 to borderlands 2.\u003C/p\u003E\u003Cp\u003ENo, the issue of Arkham Knight wasn\u0027t technical difficulty, it was something between WB, Rocksteady and Iron Galaxy. Incompetence, neglience, greed, time constraints, production issues, whatever might be the reason. Most probably a main factor is WB just trying to save money on Batman\u0027s least important (though still substantial) platform, earlier games also had issues (including Iron Galaxy\u0027s work). Which backfired wonderfully, considering how fast the game dropped from the topsellers and was suspended.\u003C/p\u003E\u003Cp\u003EMost bad ports can be tracked back to lack of time and money. That said, there are a bunch of cases where the hard to control nature of external ports caused issues. I\u0027m convinced Squad will wait until its ready, but I also hope they made the right choice with Flying Tiger.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-26T06:48:24Z\u0022 title=\u002206/26/2015 06:48  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 26, 2015\u003C/time\u003E by Temeter\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Two","CreatedById":144535,"CreatedDateTime":"2015-06-26T10:06:48Z","Content":"\n\u003Cp\u003EThe only reason Batman made it to the news is because people can now return games on Steam. Otherwise it would just have been like SimCity, Witcher 3, GTA V, and all the other incomplete games that take another 3-6 month patching till the customers can actually play it.\u003C/p\u003E\n"},{"CreatedByName":"Pinchy","CreatedById":143038,"CreatedDateTime":"2015-06-26T10:54:39Z","Content":"\n\u003Cp\u003EPro Cycling Manager (small Studio - cyanide) was a great PC game - ported from PC to Console a couple of years ago and it was truly shocking - rhetorical question this - but no idea how this would work on console unless it was dumbed down considerably and it was just all \u0022stock\u0022 ships.\u003C/p\u003E\n"},{"CreatedByName":"Wallace","CreatedById":77574,"CreatedDateTime":"2015-06-26T12:13:13Z","Content":"\n\u003Cp\u003EThe problem with Arkham Knight are because they ignored the problems and rushed it through. They clearly wanted to have it release on all platforms at once, and so they went ahead and released it horribly broken. The previous Arkham games ported fine, Arkham Origins was done by the same company and there were a few bugs, but they were on all platforms and were not game breaking for 68% of players. This time it seems the publisher putting pressure on to meet the release date was the likely cause of the problems. There have been adverts for Arkham Knight everywhere, they\u0027ve really been pushing it and obviously they wanted all the releases to be the same time so they could make the most of that advertising. \u003C/p\u003E\u003Cp\u003EIf you look at GTA 5 on the other hand, they left the PC version to have it\u0027s own release when it was done, and it turned out great, everyone was whining about waiting for it, but when it got here it was glorious, not just a port but an improvement on the console versions. \u003C/p\u003E\u003Cp\u003ESquad don\u0027t have some big publisher on their back demanding they pump out games on schedule, so I don\u0027t see them rushing through an unfinished game.\u003C/p\u003E\n"},{"CreatedByName":"ComradeWolfe","CreatedById":142254,"CreatedDateTime":"2015-06-26T12:55:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Temeter\u0022 data-cite=\u0022Temeter\u0022\u003E\u003Cdiv\u003EYou\u0027re making it sound like having a game run fine on PC is some near-impossible to achieve task. That\u0027s nonsense, PC games usually manage to best most possible hardware configurations. Porting cost isn\u0027t much of a factor, considering how many very traditional console games are coming to PC. Most current ports are even very good, the period of bad console ports during PS360 is gone, just compare the jump from borderlands 1 to borderlands 2.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI disagree. If you look at games from the Original Xbox / Windows XP (both X86 Win NT 5.x machines with DirectX) era most games found on both platforms were reasonably well done because the hardware and software were both so similar. Basically you could make a game for PC (or Xbox) and tweak it slightly to release on Xbox (or PC). PS2 ports were a bit more work, but the software was a lot simpler so it was still relatively easy to keep things stable.\u003C/p\u003E\u003Cp\u003E Once they jumped to the Xbox 360 with its Power PC-based (non X86, non-Windows related codebase) architecture and the PS3\u0027s RISC \u0022cell\u0022 architecture, issues became a lot more common. A broad-release title now requires three completely different versions instead of two similar and one different. Add that to the growing complexity of games, and suddenly you have a problem.\u003C/p\u003E\u003Cp\u003ENow we have the current generation of consoles: All X86, all with DirectX-like or OpenGL-like graphics. The Xbone even runs a windows-like OS. In theory this means ports will be cheaper/easier/less buggy (time will tell)... But then we reach the other problem which you brought up (and which I do agree with):\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Temeter\u0022 data-cite=\u0022Temeter\u0022\u003E\u003Cdiv\u003EMost bad ports can be tracked back to lack of time and money.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDuring the last console generation most dev love went to console games, PC ports were shoddy attempts at milking out a few more bucks. Once it ran and was \u0022feature complete\u0022 things like a PC-friendly UI were just extra money which defeated the purpose of pimping out a PC port. It also didn\u0027t help that bigger studios didn\u0027t seem to consider PC gaming very important any more.\u003C/p\u003E\u003Cp\u003E \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Temeter\u0022 data-cite=\u0022Temeter\u0022\u003E\u003Cdiv\u003EI\u0027m convinced Squad will wait until its ready, but I also hope they made the right choice with Flying Tiger.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree. I think they probably learned a bit from the 1.0 PC launch and subsequent rushes to patch. Console players are less forgiving too, so QC should be a bit higher.\u003C/p\u003E\n"},{"CreatedByName":"klgraham1013","CreatedById":105132,"CreatedDateTime":"2015-06-26T14:00:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Two\u0022 data-cite=\u0022Two\u0022\u003E\u003Cdiv\u003EThe only reason Batman made it to the news is because people can now return games on Steam. Otherwise it would just have been like SimCity, Witcher 3, GTA V, and all the other incomplete games that take another 3-6 month patching till the customers can actually play it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWitcher 3 was unplayable at launch? I must have been one of the lucky ones.\u003C/p\u003E\n"},{"CreatedByName":"Mako","CreatedById":69375,"CreatedDateTime":"2015-06-26T15:21:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Temeter\u0022 data-cite=\u0022Temeter\u0022\u003E\u003Cdiv\u003EYou\u0027re making it sound like having a game run fine on PC is some near-impossible to achieve task. That\u0027s nonsense, PC games usually manage to best most possible hardware configurations. Porting cost isn\u0027t much of a factor, considering how many very traditional console games are coming to PC. Most current ports are even very good, the period of bad console ports during PS360 is gone, just compare the jump from borderlands 1 to borderlands 2.\u003Cp\u003ENo, the issue of Arkham Knight wasn\u0027t technical difficulty, it was something between WB, Rocksteady and Iron Galaxy. Incompetence, neglience, greed, time constraints, production issues, whatever might be the reason. Most probably a main factor is WB just trying to save money on Batman\u0027s least important (though still substantial) platform, earlier games also had issues (including Iron Galaxy\u0027s work). Which backfired wonderfully, considering how fast the game dropped from the topsellers and was suspended.\u003C/p\u003E\u003Cp\u003EMost bad ports can be tracked back to lack of time and money. That said, there are a bunch of cases where the hard to control nature of external ports caused issues. I\u0027m convinced Squad will wait until its ready, but I also hope they made the right choice with Flying Tiger.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree with what you\u0027re saying. Good Console-to-PC ports aren\u0027t impossible. I was only attempting to highlight the apples to oranges comparison of developing Console-to-PC ports versus PC-to-Console ports.\u003C/p\u003E\u003Cp\u003EMy post is from a worst case scenario point of view, and yet it doesn\u0027t even begin to reflect the gameplay issues (such as control schemes) one encounters when porting either direction. On the technical side only, my post reflects the difference in work, time, and money involved in the porting process. I am not claiming it is cost prohibitive or unachievable to produce a Console-to-PC port, but rather discussing where the incompetence, negligence, greed, and time constraints you mention are bound to hinder a good port job. It can happen when porting either way, but one way is technically simpler and less expensive to get near perfect at launch.\u003C/p\u003E\n"},{"CreatedByName":"rofltehcat","CreatedById":145224,"CreatedDateTime":"2015-06-26T16:12:39Z","Content":"\n\u003Cp\u003EThis can happen when you want to spend only the minimum amount of money (rumor: 14 people team, 8 weeks or so time?) on something this important. However, I do not think this will happen to KSC simply because porting something to console is probably easier than porting something to PC: All of the consoles are the same (well, I guess there are slight variations in chip quality etc. but all of them fulfill the bottom standard spec).\u003C/p\u003E\u003Cp\u003ESo they have to optimize the game for just one configuration isntead of a nearly infinite number of possible system combinations.\u003C/p\u003E\n"},{"CreatedByName":"Nich","CreatedById":145678,"CreatedDateTime":"2015-06-26T16:33:49Z","Content":"\n\u003Cp\u003EThat and I think porting from PC to console is a lot easier. It forces you to think \u0022ok how am i going to simply everything so that it works on console with limited buttons and processing power\u0022 The problem is going from console to PC is done with no thought too often they just move this button to this key, menus work with arrow keys, and a mouse? no one on a PC uses a mouse so we don\u0027t need to support that in menus only used for targeting.\u003C/p\u003E\n"},{"CreatedByName":"boxman","CreatedById":61559,"CreatedDateTime":"2015-06-26T16:43:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Wallace\u0022 data-cite=\u0022Wallace\u0022\u003E\u003Cdiv\u003EThe problem with Arkham Knight are because they ignored the problems and rushed it through. They clearly wanted to have it release on all platforms at once, and so they went ahead and released it horribly broken. The previous Arkham games ported fine, Arkham Origins was done by the same company and there were a few bugs, but they were on all platforms and were not game breaking for 68% of players. This time it seems the publisher putting pressure on to meet the release date was the likely cause of the problems. There have been adverts for Arkham Knight everywhere, they\u0027ve really been pushing it and obviously they wanted all the releases to be the same time so they could make the most of that advertising. \u003Cp\u003EIf you look at GTA 5 on the other hand, they left the PC version to have it\u0027s own release when it was done, and it turned out great, everyone was whining about waiting for it, but when it got here it was glorious, not just a port but an improvement on the console versions. \u003C/p\u003E\u003Cp\u003ESquad don\u0027t have some big publisher on their back demanding they pump out games on schedule, so I don\u0027t see them rushing through an unfinished game.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESounds kinda similar to what happened to 1.0 to me ;\\\u003C/p\u003E\n"},{"CreatedByName":"RW-1","CreatedById":107278,"CreatedDateTime":"2015-06-26T18:12:42Z","Content":"\n\u003Cp\u003EI\u0027m not concerned, as I\u0027m not using a port. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}