{"TopicId":114137,"ForumId":44,"TopicTitle":"CO2 Content of Atmosphere","CreatedByName":"arkie87","CreatedById":103434,"CreatedDateTime":"2015-06-25T15:54:43Z","PageNum":3,"Articles":[{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2015-06-26T18:34:53Z","Content":"\u003E \n\u003E And to return to those levels would mean a mass extinction ... like what happened at the end of the Permian, when those levels shot up really high.\n\u003E Permian extinction: biggest in the fossil record.\n\u003E \n\u003E The analogy may not be very good, and CO2 levels may have been higher in the past - but that doesn\u0027t mean dumping huge amounts of CO2 into the atmosphere is a good idea.\n\nNote that the permian co2 spike might be caused partial of the extinction of most life and the largest volcano event we know about. \n\nIn short, volcano emits lots of smoke who blanket earth it also release lots of co2 but this is not the main problem, the problem is the smoke who blocks sunlight and the other effects. \n\nmass extinction causes more co2 and reduces uptake until life come back."},{"CreatedByName":"RuBisCO","CreatedById":59540,"CreatedDateTime":"2015-06-26T18:42:31Z","Content":"The total energy output and carbon sequestering power of Earth\u0027s photosynthetic biosphere is not something to ignore, just look at how CO2 levels fluctuate over the year as crops grow and die. \n\nIf we could create green algea blooms in the deep ocean and that algae sinks to the bottom and IF its carbon remains traped there for centuries then we could control our planets CO2 levels with only a few billion dollars a year: easy Geoforming."},{"CreatedByName":"arkie87","CreatedById":103434,"CreatedDateTime":"2015-06-26T18:46:20Z","Content":"\u003E \n\u003E Note that the permian co2 spike might be caused partial of the extinction of most life and the largest volcano event we know about. \n\u003E In short, volcano emits lots of smoke who blanket earth it also release lots of co2 but this is not the main problem, the problem is the smoke who blocks sunlight and the other effects. \n\u003E \n\u003E mass extinction causes more co2 and reduces uptake until life come back.\n\nQuestion, if the smoke blocks the sunlight, and CO2 blocks the earth\u0027s heat from being released via infrared radiation, how are scientists sure if the earth should get colder or warmer?"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2015-06-26T18:46:52Z","Content":"\u003E \n\u003E not sure what you mean. I dint understand the sentence.\n\nThe global warming because of co2 emissions is an short term problem. An 100 year solution is more than good enough. \n\nBoth new energy sources and limited quantity of fossil fuel ensures this.\n\nThat is an 100 year solution who don\u0027t release all the deposited co2 at once but over time. \n\n\u003E \n\u003E **Yeah, that is a good point that I dint mention. Let me further clarify this to others:**\n\u003E \n\u003E **Now atmosphere contains 800 Gt of co2, but 200 years back was like 550 Gt, that increase of 250 gt extra in the atmosphere only contribute to 2 gt of extra co2 captured by year on the oceans. So is clear that nature by it self cant compesate the extra co2 emissions.** \n\u003E \n\u003E [http://www.climatecentral.org/news/the-last-time-co2-was-this-high-humans-didnt-exist-15938](http://www.climatecentral.org/news/the-last-time-co2-was-this-high-humans-didnt-exist-15938)\n\u003E \n\u003E Yeah it may be similar as use water irrigation and fertilizers on land. It may help, we just need to control it.\n\u003E \n\u003E Where is the 50 millions years value come from? In my example I said that 50 years (strong time lapse of human activity) is nothing compared with climate change times. So nature can not balance this."},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-06-26T18:50:15Z","Content":"\u003E \n\u003E Nice. Now we\u0027ve got examples of both Godwin\u0027s law and Poe\u0027s law in the same thread!\n\nJust doing my part... but I dare not rule 34 it...\n\n\u003E \n\u003E Note that the permian co2 spike might be caused partial of the extinction of most life and the largest volcano event we know about. \n\u003E In short, volcano emits lots of smoke who blanket earth it also release lots of co2 but this is not the main problem, the problem is the smoke who blocks sunlight and the other effects. \n\u003E \n\u003E mass extinction causes more co2 and reduces uptake until life come back.\n\nThe extinction seems to have occured in phases, with millions of years in between... aerosolls wouldn\u0027t have stayed around that long.\n\n\u003E \n\u003E We need to create a strain of genetically modified bovines that are able to absorb more CO2 than they expend.\n\nYea... and then we have our engineers invent a perpetual motion machine that creates more energy than it uses, and we can stop emitting CO2, and bring the concentration down. Then all of our problems are solved!"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2015-06-26T18:53:58Z","Content":"\u003E \n\u003E Question, if the smoke blocks the sunlight, and CO2 blocks the earth\u0027s heat from being released via infrared radiation, how are scientists sure if the earth should get colder or warmer?\n\nBecause we have detailed models of this, we aren\u0027t just working off vague assertions."},{"CreatedByName":"arkie87","CreatedById":103434,"CreatedDateTime":"2015-06-26T19:00:41Z","Content":"\u003E \n\u003E Because we have detailed models of this, we aren\u0027t just working off vague assertions.\n\nModels rely on assumptions and simplifications. Models can be made to show whatever result you want. Without knowing the assumptions and equations the model uses, it is impossible to know how detailed it is...\n\nIt doesnt matter THAT models show this to be true, what matters is WHY models show this to be true... any comment on that?\n\nI say this as someone who has spent the first three years of my PhD doing modeling work and simulations.\n\nThere is the age-old adage that goes:\n\nNo one trusts modeling work except for the person who made it; everyone trusts experimental work except for the person who did it.\n\n**Edited \u003Ctime datetime=\u00222015-06-26T19:08:12Z\u0022 title=\u002206/26/2015 07:08  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 26, 2015\u003C/time\u003E by arkie87**"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2015-06-26T19:06:22Z","Content":"\u003E \n\u003E Because we have detailed models of this, we aren\u0027t just working off vague assertions.\n\nHowever we don\u0027t have that much data about the permian extinction event. We know about the Siberian trap \u0022super volcano\u0022 and the co2 spike, however some indications on the traps being created by an major impact on the other side of earth. \n\nMy guess would be cooling first, think an very strong nuclear winter, however this only last a few years, then the co2 get to work, yes it would generate extra effects, the organisms who survived the winter would not be very suitable in the heat who followed it, you would still have lots of other populations from the volcano left who would make things worse."},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2015-06-26T19:10:55Z","Content":"\u003E \n\u003E It doesnt matter THAT models show this to be true, what matters is WHY models show this to be true... any comment on that?\n\nAgain, this would only make sense in the past. We *know* there\u0027s net warming now, we\u0027ve measured it."},{"CreatedByName":"arkie87","CreatedById":103434,"CreatedDateTime":"2015-06-26T19:22:59Z","Content":"\u003E \n\u003E Again, this would only make sense in the past. We *know* there\u0027s net warming now, we\u0027ve measured it.\n\nNet warming has amounted to something like 0.5-0.6Ã‚Â°C.\n\nStandard accuracy of thermocouples is 0.5Ã‚Â°C.\n\nIf i take my 3000$ DAQ system and measure Ice water temperature, it reads 0.6Ã‚Â°C, and not 0Ã‚Â°C.... and these measurements are performed indoors at room temperature. Outdoor measurements are much more complicated and require careful cold junction compensation to get accurate measurements with such a small deltaT.\n\nAnyway, i dont want to discuss global warming here; i wanted to focus on CO2, since that is the topic of this thread..."},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2015-06-26T19:38:58Z","Content":"\u003E \n\u003E I am confused by your calculations. You said now 800Gton CO2 but 200 years ago it was 550Gt, which is (800-550)/200 0.75 Gt/yr, right?\n\u003E You said the ocean now captures 2Gt/yr more, which is 3x the average rate we have been adding it, correct?\n\nBut you can not take the average, because 200 years ago we release almost nothing of co2 to the atmosphere compared to now. And even if we reduce the amount of co2 emissions by year, the overall emission will keep rising, because the current earth temperature rise, more water vapor, more methane and co2 due permafrost melting, less ice --\u003E lower sun refraction, etc.\n\nThat is why everbody said that if we reach to the 2 degress celcius increase then we reach the point of no return, because it does not matter if we dont emmit more co2 at that point, the earth will intensify a chain of events which will release by it self a lot more greenhouse gasses which cannot be stoped, and in case we can, it will cost a LOT more than do it now.\n\nThis is like dodge an asteroid, if you do it 10 years before, you dont need much energy, if you do it the last year, it will be 1000 times harded.\n\nTake into account that the last time earth had these co2 values, humans did not exist.\n\n\u003E \n\u003E That is very true. Natural climate change appears to be slow (hundreds, thousands or millions of years). However, the fact that 30-40% of human CO2 emissions are presently absorbed by the oceans indicate that the time constant/response time of the oceans are much faster than those of natural climate change, no? Otherwise, all of the CO2 we release would stay in the atmosphere until the earth could react. This clearly isnt the case since sources say 30-40% of the CO2 is absorbed by the ocean alone and contributes to ocean acidification.\n\nYeah, again not total sure what you mean by 30% to 40%, the problem here is that not because co2 levels rise we would have always a constant % that will be absorbed, global warming may change local weather, wet places may become dry, and dry places wet. But forest, towns and crops places can not be relocated from one day to the other, which end up dying --\u003E higher levels of co2, seas acidification may also become a problem for life, if we dont increase the amount of life we can not absorb much co2.\n\n\u003E \n\u003E The fact that it takes much longer for natural climate change to occur might indicate it is driven by slow periodic processes, and not that the earth takes soo long to react.\n\nBut we already understand which are the process that contributes to co2 capture, but all evidence point that all those process will weaken with the time rather than strengthened.\n\n\u003E \n\u003E Note that the permian co2 spike might be caused partial of the extinction of most life and the largest volcano event we know about. \n\u003E In short, volcano emits lots of smoke who blanket earth it also release lots of co2 but this is not the main problem, the problem is the smoke who blocks sunlight and the other effects. \n\u003E \n\u003E mass extinction causes more co2 and reduces uptake until life come back.\n\nYeah but just to clarify, there was some strong volcano events which burn huge forest and started an chain of events which end up with mass extintions, but those are not common, are event that happens once every hundred of millons of years.\n\nIn fact, if we take into account all the earth eruptions or volcano activities in the last 100 years, that total co2 is equal to the co2 released by human activity this last year."},{"CreatedByName":"arkie87","CreatedById":103434,"CreatedDateTime":"2015-06-26T19:49:06Z","Content":"\u003E \n\u003E But you can not take the average, because 200 years ago we release almost nothing of co2 to the atmosphere compared to now.\n\nYes, co2 release has not been linear, but rather exponential, which is definitely the reason why the current rate of CO2 capture appears to exceed the rate we have been releasing it. That said, i\u0027m not sure why you bothered to even mention those statistics, because, as stated, they appear to eliminate your argument, rather than bolster it. \n\n\u003E \n\u003E Yeah, again not total sure what you mean by 30% to 40%, the problem here is that not because co2 levels rise we would have always a constant % that will be absorbed, global warming may change local weather, wet places may become dry, and dry places wet. But forest, towns and crops places can not be relocated from one day to the other, which end up dying --\u003E higher levels of co2, seas acidification may also become a problem for life, if we dont increase the amount of life we can not absorb much co2.\n\nthe 30-40% is quoted everywhere, even on wikipedia\u0027s carbon-dioxide webpage. I have quoted the relevant text: \n\n\u003E \n\u003E Most of the CO2 taken up by the ocean, which is about 30% of the total released into the atmosphere,[62] forms carbonic acid in equilibrium with bicarbonate. Some of these chemical species are consumed by photosynthetic organisms that remove carbon from the cycle. Increased CO2 in the atmosphere has led to decreasing alkalinity of seawater...\n\u003E \n\u003E NOAA states in their May 2008 \u0022State of the science fact sheet for ocean acidification\u0022 that:\n\u003E \n\u003E \u0022The oceans have absorbed about 50% of the carbon dioxide (CO2) released from the burning of fossil fuels, resulting in chemical reactions that lower ocean pH. This has caused an increase in hydrogen ion (acidity) of about 30% since the start of the industrial age through a process known as \u0022ocean acidification.\u0022\n\n**Edited \u003Ctime datetime=\u00222015-06-26T19:51:21Z\u0022 title=\u002206/26/2015 07:51  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 26, 2015\u003C/time\u003E by arkie87**"},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2015-06-26T20:55:15Z","Content":"\u003E \n\u003E Yes, co2 release has not been linear, but rather exponential, which is definitely the reason why the current rate of CO2 capture appears to exceed the rate we have been releasing it. That said, i\u0027m not sure why you bothered to even mention those statistics, because, as stated, they appear to eliminate your argument, rather than bolster it.\n\nWhat? the co2 capture by seas and trees is always lower than the amount released!\n\nTake a good look to the graph, you are mistaken the cycle values with the real co2 capture.\n\nSeas and trees capture 5 gt by year, humans release 9 gt by year, that equal to 4 gt extra co2 by year, in 50 year (even with constant emission and ignoring emissions due global warming) we would have 200 gt extra co2 in the atmosphere, which 800 \u002B 200 = 1000 gt. (of course it will be higher than that due many effect that I already explain)\n\nIf we do the cold water pump technique to increase plants and plakton, only a small porcentage of all that added co2 cycle will be captured by oceans.\n\n\u003E \n\u003E the 30-40% is quoted everywhere, even on wikipedia\u0027s carbon-dioxide webpage. I have quoted the relevant text\n\nThen is how I said it, but you dint confirm it, you are talking of the overall cycle, but you can not take the amount of co2 captured by the cycle, because it release it again in the next season."},{"CreatedByName":"arkie87","CreatedById":103434,"CreatedDateTime":"2015-06-26T21:08:00Z","Content":"\u003E \n\u003E What? the co2 capture by seas and trees is always lower than the amount released!\n\u003E Take a good look to the graph, you are mistaken the cycle values with the real co2 capture.\n\u003E \n\u003E Seas and trees capture 5 gt by year, humans release 9 gt by year, that equal to 4 gt extra co2 by year, in 50 year (even with constant emission and ignoring emissions due global warming) we would have 200 gt extra co2 in the atmosphere, which 800 \u002B 200 = 1000 gt. (of course it will be higher than that due many effect that I already explain)\n\u003E \n\u003E If we do the cold water pump technique to increase plants and plakton, only a small porcentage of all that added co2 cycle will be captured by oceans.\n\nYou seem to be misinterpreting everything i am saying... I wasnt claiming more CO2 is absorbed than is released. That would be crazy talk. I was referring to this statement YOU made:\n\n\u003E \n\u003E \u003E \n\u003E \u003E **Yeah, that is a good point that I dint mention. Let me further clarify this to others:**\n\u003E \u003E \n\u003E \u003E **Now atmosphere contains 800 Gt of co2, but 200 years back was like 550 Gt, that increase of 250 gt extra in the atmosphere only contribute to 2 gt of extra co2 captured by year on the oceans. So is clear that nature by it self cant compesate the extra co2 emissions.**\n\u003E \n\u003E \n\u003E I am confused by your calculations. You said now 800Gton CO2 but 200 years ago it was 550Gt, which is (800-550)/200 0.75 Gt/yr, right?\n\u003E \n\u003E You said the ocean now captures 2Gt/yr more, which is 3x the average rate we have been adding it, correct?\n\nThe reason it seems we are absorbing CO2 into the oceans 3x faster than we have been releasing it on average since 200 years ago is because we have not been releasing it at a steady rate, but rather, exponentially.\n\nCapeesh?\n\n\u003E Then is how I said it, but you dint confirm it, you are talking of the overall cycle, but you can not take the amount of co2 captured by the cycle, because it release it again in the next season.\n\nno idea what you are trying to say here.\n\n**Edited \u003Ctime datetime=\u00222015-06-26T21:11:06Z\u0022 title=\u002206/26/2015 09:11  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 26, 2015\u003C/time\u003E by arkie87**"},{"CreatedByName":"peadar1987","CreatedById":81207,"CreatedDateTime":"2015-06-26T21:30:28Z","Content":"\u003E \n\u003E Net warming has amounted to something like 0.5-0.6Ã‚Â°C.\n\u003E Standard accuracy of thermocouples is 0.5Ã‚Â°C.\n\nWhich would indeed pose a problem if we only had one thermocouple with which to measure things."},{"CreatedByName":"arkie87","CreatedById":103434,"CreatedDateTime":"2015-06-26T21:45:06Z","Content":"\u003E \n\u003E Which would indeed pose a problem if we only had one thermocouple with which to measure things.\n\nMany independent measurements or repeated measurements can fix random error. Systematic error, which is the kind of error i find when trying to measure ice-water, is not eliminated by repetitions. \n\nMaking accurate **absolute** temperature measurements is NOT an easy task, especially when cold-junction temperature varies wildly. Plus, i\u0027m sure you have heard about the global warming hiatus since ~2000, which scientists recently explained by systematically shifting temperatures one way, due to assumed systematic errors in their measurements... I do not think i need to explain why that is bad science...\n\n**Edited \u003Ctime datetime=\u00222015-06-26T21:47:59Z\u0022 title=\u002206/26/2015 09:47  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 26, 2015\u003C/time\u003E by arkie87**"},{"CreatedByName":"Albert VDS","CreatedById":74055,"CreatedDateTime":"2015-06-26T21:55:49Z","Content":"\u003E \n\u003E Plus, i\u0027m sure you have heard about the global warming hiatus since ~2000, which scientists recently explained by systematically shifting temperatures one way, due to assumed systematic errors in their measurements... I do not think i need to explain why that is bad science...\n\nhttp://newsroom.unsw.edu.au/news/science/no-warming-hiatus-extreme-hot-temperatures\n\nNo warming hiatus for extreme hot temperatures"},{"CreatedByName":"peadar1987","CreatedById":81207,"CreatedDateTime":"2015-06-26T22:03:28Z","Content":"\u003E \n\u003E Many independent measurements or repeated measurements can fix random error. Systematic error, which is the kind of error i find when trying to measure ice-water, is not eliminated by repetitions.\n\nWith your one thermocouple. Thermocouple error is random, get a large enough number of thermocouples with a randomly distributed error, and they will give you the true temperature.\n\n\u003E Making accurate **absolute** temperature measurements is NOT an easy task, especially when cold-junction temperature varies wildly. Plus, i\u0027m sure you have heard about the global warming hiatus since ~2000, which scientists recently explained by systematically shifting temperatures one way, due to assumed systematic errors in their measurements... I do not think i need to explain why that is bad science...\n\nSuch a hiatus does not exist. 1998 and 2000 were anomalously warm years. If you selectively choose to start your graph from either of them, as many deniers do, the trend looks flat. If you start in 2001, or any year prior to 1996, you see the same upward trend, with the individual results scattered above and below the travelling mean, exactly as you would expect from a noisy signal. Cherry picking 1998 as your base point is about as good a case against anthropogenic climate change as using December is for the opposing case."},{"CreatedByName":"arkie87","CreatedById":103434,"CreatedDateTime":"2015-06-26T22:20:13Z","Content":"\u003E \n\u003E With your one thermocouple. Thermocouple error is random, get a large enough number of thermocouples with a randomly distributed error, and they will give you the true temperature.\n\nThe thermocouples i am using have been selected to be accurate to within 0.1Ã‚Â°C. The error is from the DAQ itself, not from the thermocouple i am using. I have verified the offset with more than one thermocouple. All report 0.6Ã‚Â°C instead of 0Ã‚Â°C.\n\n\u003E Such a hiatus does not exist. 1998 and 2000 were anomalously warm years. If you selectively choose to start your graph from either of them, as many deniers do, the trend looks flat. If you start in 2001, or any year prior to 1996, you see the same upward trend, with the individual results scattered above and below the travelling mean, exactly as you would expect from a noisy signal. Cherry picking 1998 as your base point is about as good a case against anthropogenic climate change as using December is for the opposing case.\n\nThe data I have seen does not cherry pick anything, but uses the raw data to show that global average temperatures have decreases since 1998. Here is a figure from the NOAA:\n\n![201301-201312.png](https://www2.ucar.edu/sites/default/files/news/2014/201301-201312.png)\n\nIf such a hiatus doesnt exist, then why have i seen article after article trying to explain why it actually doesnt exist (despite the obvious change in slope of the data)?\n\nAlso, why are the uncertainty bars so large if thousands of thermocouples are being used?\n\nIf we are **accurately** measuring **average** temperature, the trend should also be less noisy, no?\n\n**Edited \u003Ctime datetime=\u00222015-06-26T22:25:01Z\u0022 title=\u002206/26/2015 10:25  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 26, 2015\u003C/time\u003E by arkie87**"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2015-06-26T22:32:59Z","Content":"It honestly makes me sad that somebody on a forum about space exploration thinks we get all our climate information from ground-based thermocouples.\n\n**Edited \u003Ctime datetime=\u00222015-06-26T22:41:56Z\u0022 title=\u002206/26/2015 10:41  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 26, 2015\u003C/time\u003E by Kryten**"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2015-06-26T22:40:18Z","Content":"\u003E \n\u003E Yeah but just to clarify, there was some strong volcano events which burn huge forest and started an chain of events which end up with mass extintions, but those are not common, are event that happens once every hundred of millons of years.\n\u003E \n\u003E In fact, if we take into account all the earth eruptions or volcano activities in the last 100 years, that total co2 is equal to the co2 released by human activity this last year.\n\nSiberian traps was not an normal volcano, neither something like normal super volcano but something far larger. \n\nIt might also go on for an long time unlike an asteroid impact who is an one time event. \n\nWe have not had serious amount of volcanic activity for a long time, think its 60k years since last super volcano. They are rare and does not cause global extinction events. \n\nThe real problem with super volcanoes is the local destruction and the clouds not the co2, Siberian trap was again of another magnitude. \n\nAverage emissions of co2 from volcanoes has to be absorbed again or co2 level would rise until an new balance was established as seen on the diagram posted earlier.\n\nMight be an bit different for volcanoes as its not an 100 year peak but overall level."},{"CreatedByName":"arkie87","CreatedById":103434,"CreatedDateTime":"2015-06-26T22:41:11Z","Content":"\u003E \n\u003E It honestly makes me bad that somebody on a forum about space exploration thinks we get all our climate information from ground-based thermocouples.\n\nOf course not. They measure in the ocean too. But they do not cover the entire pacific or atlantic for obvious reasons, so they have to extrapolate large swaths of ocean temperature.\n\nThey also use satellites, but IR temperature measurements are 100x more difficult than land based measurements (since IR measurements measure heat flux, and not temperature directly, one has to compensate for emissivity of the target)\n\nAm i missing anything?\n\nI\u0027m not sure why it makes you bad? Perhaps you are a naughty boy?\n\n**Edited \u003Ctime datetime=\u00222015-06-26T22:44:05Z\u0022 title=\u002206/26/2015 10:44  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 26, 2015\u003C/time\u003E by arkie87**"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2015-06-26T22:43:49Z","Content":"Eumetsat, among others can directly measure solar influx and reflected radiation, rendering direct temperature results pretty much irrelevant."},{"CreatedByName":"arkie87","CreatedById":103434,"CreatedDateTime":"2015-06-26T22:50:56Z","Content":"\u003E \n\u003E It honestly makes me sad that somebody on a forum about space exploration thinks we get all our climate information from ground-based thermocouples.\n\nOh, i see what you meant now, after your edit. Now i get the irony. Hehehe.\n\n- - - Updated - - -\n\n\u003E \n\u003E Eumetsat, among others can directly measure solar influx and reflected radiation, rendering direct temperature results pretty much irrelevant.\n\nHow do satellites compensate for emitted vs. reflected radiation, especially since emissivity and reflectivity vary based on what you are looking at (clouds, snow, land, water, desert, even the atmosphere itself... each have their own values)-- how does the satellite compensate for this? \n\nIt\u0027s hard enough to make accurate IR measurements in the lab with infrared paint and a calibrated 100,000$ IR camera..."},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2015-06-26T22:55:02Z","Content":"\u003E \n\u003E Oh, i see what you meant now, after your edit. Now i get the irony. Hehehe.\n\u003E - - - Updated - - -\n\u003E \n\u003E How do satellites compensate for emitted vs. reflected radiation, especially since emissivity and reflectivity vary based on what you are looking at (clouds, snow, land, water, desert, even the atmosphere itself... each have their own values)-- how does the satellite compensate for this?\n\nIt doesn\u0027t have to, it can measure solar influx directly (being, y\u0027know, in space). Obviously emissivity and reflectivity will render this pretty useless for predicting e.g. temperature at a local level, but gives a nice whole-globe model of radiative forcing."}]}