{"TopicId":114365,"ForumId":55,"TopicTitle":"Car Wheels - High performance wheels for use on Kerbin.","CreatedByName":"BlueCanary","CreatedById":131301,"CreatedDateTime":"2015-06-27T15:56:19Z","PageNum":1,"Articles":[{"CreatedByName":"BlueCanary","CreatedById":131301,"CreatedDateTime":"2015-06-27T15:56:19Z","Content":"\n\u003Cp\u003EIn KSP the limit for rover speed seems to be about 22m/s. I realise that in real life this would be stupidly fast for a rover, and for craft on other planets I think it\u0027s about right for KSP, but when driving cars and trucks on Kerbin being limited to about 40mph can get really frustrating, especially on long journeys.\u003C/p\u003E\u003Cp\u003ESo, my suggestion is, in addition to the current rover wheels, a set of car wheels that can run at much higher speeds, say 70m/s on a light craft. To stop these being overused and to stop them being used so much on rovers (as opposed to cars), they could be heavier and have much higher energy requirements than rover wheels, or maybe use liquid fuel and intake air (as a real internal combustion powered car would), limiting them to use on Kerbin or Laythe.\u003C/p\u003E\u003Cp\u003EThis would allow for much more practical transit around the surface of kerbin, and would only require the addition of one part to the game. Also, I\u0027d imagine (although I have next to no programming experience) now would be a good time for such an addition to be added, since Unity 5 is meaning Squad have to redo wheels anyway.\u003C/p\u003E\n"},{"CreatedByName":"waterlubber","CreatedById":119333,"CreatedDateTime":"2015-06-29T02:15:41Z","Content":"\n\u003Cp\u003E70 m/s is...*drumroll* \u003Cstrong\u003E156\u003C/strong\u003E\u003Cstrong\u003E mph.\u003C/strong\u003EWow. Maybe a more suitable speed would be a maximum of \u003Cstrong\u003E30\u003C/strong\u003E m/s, because that\u0027s about 70 mph. You won\u0027t get 50 in a car going off-road, so I don\u0027t see much of a purpose.\u003C/p\u003E\n"},{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2015-06-29T09:28:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022waterlubber\u0022 data-cite=\u0022waterlubber\u0022\u003E\u003Cdiv\u003E70 m/s is...*drumroll* \u003Cstrong\u003E156\u003C/strong\u003E\u003Cstrong\u003E mph.\u003C/strong\u003EWow. Maybe a more suitable speed would be a maximum of \u003Cstrong\u003E30\u003C/strong\u003E m/s, because that\u0027s about 70 mph. You won\u0027t get 50 in a car going off-road, so I don\u0027t see much of a purpose.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eyes 156 mph is fast, on Earth.....It\u0027s not so fast on Kerbin. Well obviously its the same speed, but what I mean is that our perception of that speed is very different because the terrain detail in KSP is so much less than on Earth. So I don\u0027t think talking about realistic Earth speeds has the same meaning on Kerbin. On Earth there is so much more detail and points of interest are frequent, on Kerbin (or any KSP planet) the terrain is sparse and points of interest are few and far between. In the interests of fun I think land based vehicles need to be able to go fast. \u003C/p\u003E\u003Cp\u003EI\u0027d also don\u0027t think 50mph for RL off-road is that outrageous, maybe for a \u003Cem\u003Ecar\u003C/em\u003E, but I\u0027ve hit 76kmph (47mph) driving a quad across open grass-lands before. And 30m/s (67mph) for a game vehicle!? In RL a car can go much faster than that and it\u0027s not like there are any cops around on Kerbin \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI think that the current max speed of 60m/s for wheels is ok, the problem is that at those speeds (or a bit below) even the slightest bump breaks the wheel. So I don\u0027t think wheels need a faster top speed, I think they need to be a bit more durable so you can sustain driving at those speeds without constantly having to stop to repair the wheels.\u003C/p\u003E\u003Cp\u003EOP, the way I get fast rovers on Kerbin is to use RCS boosters, that lets you get up to ~50m/s quite happily. I\u0027ve also been tweaking the impactTolerance of the ruggedized wheel (increasing it from 300 to 400-450) so it\u0027s less prone to breaking when going over terrain glitches, bumps and small jumps.\u003C/p\u003E\u003Cp\u003EObviously rover wheels are not like regular tyres, and so OP\u0027s suggestion of having a higher speed capable regular tyre is an idea I\u0027d support for derping around on Kerbin (and the idea of having a combustion engine is nice too, but maybe better suited for a mod than core game). But would you need the combustion engine requirement to prevent the wheel from being used in off-world rovers? Wouldn\u0027t a conventional car tyre just explode if you took it into space?\u003C/p\u003E\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2015-06-29T10:00:49Z","Content":"\n\u003Cp\u003EMy opinion is that it would be nice to either have wheels that can withstand faster speeds or (my preferred option) procedurally generated \u0027stuff\u0027 which can be examined for SCIENCE! Which would mean either way less time travelling until you got to something interesting.\u003C/p\u003E\n"},{"CreatedByName":"BlueCanary","CreatedById":131301,"CreatedDateTime":"2015-07-04T08:41:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022waterlubber\u0022 data-cite=\u0022waterlubber\u0022\u003E\u003Cdiv\u003E70 m/s is...*drumroll* \u003Cstrong\u003E156\u003C/strong\u003E\u003Cstrong\u003E mph.\u003C/strong\u003EWow. Maybe a more suitable speed would be a maximum of \u003Cstrong\u003E30\u003C/strong\u003E m/s, because that\u0027s about 70 mph. You won\u0027t get 50 in a car going off-road, so I don\u0027t see much of a purpose.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, but you would get 156mph in a racecar or high performance sports car. So to get to 70m/s you\u0027d need a really light, low drag car, and use tonnes of fuel/electricity, but, say, a heavy pick-up truck thing would get 30m/s.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EWhat about a rover wheel, running on liquid fuel and intake air to approximate an internal combustion engine, which could have a tweakable (in editors only) that lets it be boosted for higher speed and power at the expense of higher fuel usage and maybe weight. The fuel efficiency would go down too, so a wheel producing twice the power would need more than twice the fuel, so it would be more balanced.\u003C/p\u003E\u003Cp\u003EThis would only need one part added but would open up pretty much every type of non-space-related ground based vehicle I can think of, from high performance racing cars and big trucks to light, efficient kerbal carriers.\u003C/p\u003E\u003Cp\u003EI know you can put RCS and rockets on to get speeds higher, but these, especially since 1.0, will run out quickly and it just feels a bit silly to put rockets on a car to get over 40 miles an hour.\u003C/p\u003E\n"},{"CreatedByName":"Xannari Ferrows","CreatedById":125369,"CreatedDateTime":"2015-07-04T08:57:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BlueCanary\u0022 data-cite=\u0022BlueCanary\u0022\u003E\u003Cdiv\u003E...or maybe use liquid fuel and intake air (as a real internal combustion powered car would), limiting them to use on Kerbin or Laythe.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s not directly true. The Ethanol mixture is for the alternator, which charges the battery, which powers the wheels. The air intake at the front is to cool the combustion chamber and keep everything running smoothly.\u003C/p\u003E\n"},{"CreatedByName":"Merandix","CreatedById":135352,"CreatedDateTime":"2015-07-04T11:18:35Z","Content":"\n\u003Cp\u003E22 m/s is 79,2 km/h or, if you insist, 49,2 mph (use 2,2 for quick and imprecise conversion). How did you end up with 40?\u003C/p\u003E\u003Cp\u003EI\u0027d like it much better if we could give probe cores (and thus rovers) instructions, so they\u0027d drive wherever the heck we want them autonomously.\u003C/p\u003E\n"},{"CreatedByName":"clivman","CreatedById":139191,"CreatedDateTime":"2015-07-04T16:11:20Z","Content":"\n\u003Cp\u003EKSP is not about exploring Kerbin anyways, and even the best rovers in RL only drive about 25 miles in the years they are active\u003C/p\u003E\n"},{"CreatedByName":"KrazyKrl","CreatedById":65849,"CreatedDateTime":"2015-07-04T22:10:13Z","Content":"\n\u003Cp\u003EI\u0027d say make it an even 39.3395 m/sec. Because anything above that is kind of absurd for a ground vehicle on another planet. If you want to do short hops quickly, go suborbital in my opinion.\u003C/p\u003E\n"},{"CreatedByName":"11of10","CreatedById":90592,"CreatedDateTime":"2015-07-04T22:39:44Z","Content":"\n\u003Cp\u003EYou forgot the Flux capacitor \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnyway, I\u0027d really be a lot happier if at least some pitiful kind of \u0022rover\u0022 wheels were available at lower tech levels. It\u0027s really killing me to have to go higher than NERVA to get wheels for my mining rig! (I\u0027m cheap, sue me, I don\u0027t want to pay premium rates for Xenon!)\u003C/p\u003E\n"},{"CreatedByName":"BlueCanary","CreatedById":131301,"CreatedDateTime":"2015-07-05T06:44:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KrazyKrl\u0022 data-cite=\u0022KrazyKrl\u0022\u003E\u003Cdiv\u003EI\u0027d say make it an even 39.3395 m/sec. Because anything above that is kind of absurd for a ground vehicle on another planet. If you want to do short hops quickly, go suborbital in my opinion.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m not talking about other planets though. This would be effectively kerbin only by requiring intake air, and would make the ground support vehicles very important to space programs more practical.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022clivman\u0022 data-cite=\u0022clivman\u0022\u003E\u003Cdiv\u003EKSP is not about exploring Kerbin anyways, and even the best rovers in RL only drive about 25 miles in the years they are active\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERovers are a completely different thing though. For cars and trucks, which are very important to aerospace programs- recovery trucks, pilot transport, fire/rescue, rocket transporters - none of which are neccessary in ksp, but are fun\u003C/p\u003E\n"},{"CreatedByName":"clivman","CreatedById":139191,"CreatedDateTime":"2015-07-05T07:03:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BlueCanary\u0022 data-cite=\u0022BlueCanary\u0022\u003E\u003Cdiv\u003EI\u0027m not talking about other planets though. This would be effectively kerbin only by requiring intake air, and would make the ground support vehicles very important to space programs more practical.\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003ERovers are a completely different thing though. For cars and trucks, which are very important to aerospace programs- recovery trucks, pilot transport, fire/rescue, rocket transporters - none of which are neccessary in ksp, but are fun\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf so they should add trains and aircraft carriers and recovery helicopters. KSP is about the space program not messing around with Nascar replicas- that is what mods are for.\u003C/p\u003E\n"},{"CreatedByName":"BlueCanary","CreatedById":131301,"CreatedDateTime":"2015-07-05T08:10:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022clivman\u0022 data-cite=\u0022clivman\u0022\u003E\u003Cdiv\u003EIf so they should add trains and aircraft carriers and recovery helicopters. KSP is about the space program not messing around with Nascar replicas- that is what mods are for.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn what way are recovery and support operations not part of a space program? I find KSP is much more fun if I try and play the non-spaceflight sections too, and some more powerful, kerbin only wheels would make this much more practical.\u003C/p\u003E\n"},{"CreatedByName":"Kuu Lightwing","CreatedById":142724,"CreatedDateTime":"2015-07-05T09:07:38Z","Content":"\n\u003Cp\u003EWho needs cars when you can FLY?! Flying is infinite times cooler than driving, duh! Or if you reeeally want NOT to fly, build a jetcar!\u003C/p\u003E\u003Cp\u003EMore seriously, really, what are the uses for that? I mean... why on Kerbin would you need a car?\u003C/p\u003E\n"},{"CreatedByName":"clivman","CreatedById":139191,"CreatedDateTime":"2015-07-05T16:04:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BlueCanary\u0022 data-cite=\u0022BlueCanary\u0022\u003E\u003Cdiv\u003EIn what way are recovery and support operations not part of a space program? I find KSP is much more fun if I try and play the non-spaceflight sections too, and some more powerful, kerbin only wheels would make this much more practical.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI guess that it would be cool to do recovery, but then single-part ships and helicopter engines need to be added first along with winches before wheels are added. And they need to add more rocket parts before they focus on this.\u003C/p\u003E\n"},{"CreatedByName":"BlueCanary","CreatedById":131301,"CreatedDateTime":"2015-07-05T20:42:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kuu Lightwing\u0022 data-cite=\u0022Kuu Lightwing\u0022\u003E\u003Cdiv\u003EWho needs cars when you can FLY?! Flying is infinite times cooler than driving, duh! Or if you reeeally want NOT to fly, build a jetcar!\u003Cp\u003EMore seriously, really, what are the uses for that? I mean... why on Kerbin would you need a car?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot so much need, as want, for non-essential but (for me at least, and by the amount of these kind of crafts in the spacecraft exchange a lot of others) fun craft/crew recovery missions, and ground support of flying vehicles.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022clivman\u0022 data-cite=\u0022clivman\u0022\u003E\u003Cdiv\u003EI guess that it would be cool to do recovery, but then single-part ships and helicopter engines need to be added first along with winches before wheels are added. And they need to add more rocket parts before they focus on this.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m only suggesting this before helicopter parts/winches etc. because I think in comparison this would be a really simple addition that would add a lot of options to the game - just one part, barely more than a tweaked version of the already present wheels, whereas helicopters and things would require (I think) vast amounts of work.\u003C/p\u003E\n"}]}