{"TopicId":114329,"ForumId":55,"TopicTitle":"procedural motor parts","CreatedByName":"m3m3lja","CreatedById":147064,"CreatedDateTime":"2015-06-27T06:33:35Z","PageNum":1,"Articles":[{"CreatedByName":"m3m3lja","CreatedById":147064,"CreatedDateTime":"2015-06-27T06:33:35Z","Content":"I played KSP today like everyday, then I thought \u0022it\u0027s so hard to build multi-purposal rover, but if I have motor or something it will way better than now\u0022.\n\nSo what if squad adds motor to KSP? Don\u0027t you think it\u0027s good and cool?\n\nSo, what I and some of my friends want is the motor. This is the full list of the motors I want.\n\n-stack motor in various radii (radius)\n\n-stack servo-motor in various radii\n\n-radial motor in various sizes\n\n-radial servo-motor in various sizes\n\n-pistons,springs in various sizes"},{"CreatedByName":"Windspren","CreatedById":134441,"CreatedDateTime":"2015-06-27T15:38:36Z","Content":"So you\u0027re trying to turn it into Kerbal Car Program? We already have rover wheels, we don\u0027t need every part in a combustion engine."},{"CreatedByName":"m3m3lja","CreatedById":147064,"CreatedDateTime":"2015-06-28T11:57:02Z","Content":"oh really? we have wheels so don\u0027t need motors? I didn\u0027t say about that motor.if you know what servo motor is, you would not say like that."},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-06-28T12:16:19Z","Content":"I\u0027m not 100% clear what you mean either, and in fairness you did mention a rover in your first post. Do you mean to make moving parts other than wheels, like hinges and such?"},{"CreatedByName":"Kaos","CreatedById":110849,"CreatedDateTime":"2015-06-28T13:54:35Z","Content":"I would indeed like more mechanical parts to be included. Not mainly for rovers, but for example for ground base construction. Then one could adapt the height of a docking port. This works at the moment a bit with the claw, as it can be used as flexible joint, but the claw is kraken bait and inferior to active moving parts for this purpose."},{"CreatedByName":"Windspren","CreatedById":134441,"CreatedDateTime":"2015-06-28T19:16:33Z","Content":"\u003E \n\u003E oh really? we have wheels so don\u0027t need motors? I didn\u0027t say about that motor.if you know what servo motor is, you would not say like that.\n\nWell, you *did* mention pistons and springs, and those are parts in combustion engines. Combustion engines would not make a very good part for KSP. Hint: Combustion engines need oxygen. There\u0027s no oxygen anywhere but Kerbin and Laythe"}]}