{"TopicId":114398,"ForumId":16,"TopicTitle":"Disappearing ships?","CreatedByName":"Xwingace","CreatedById":133896,"CreatedDateTime":"2015-06-27T21:38:49Z","PageNum":1,"Articles":[{"CreatedByName":"Xwingace","CreatedById":133896,"CreatedDateTime":"2015-06-27T21:38:49Z","Content":"\n\u003Cp\u003ESo I had a probe on its way to Duna for a flyby, and I go to the tracking center and it\u0027s just... Gone...\u003C/p\u003E\u003Cp\u003EWhat\u0027s the deal with that? It had plenty of power and fuel, and the engine wasn\u0027t even running it was just coasting. Very frustrating as it had been in flight for nearly a year already. Anyone else have this happen?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-27T23:09:50Z\u0022 title=\u002206/27/2015 11:09  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 27, 2015\u003C/time\u003E by Xwingace\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"bigcalm","CreatedById":143587,"CreatedDateTime":"2015-06-27T21:47:29Z","Content":"\n\u003Cp\u003EIt might be that it\u0027s still there (though KSP will occasionally remove bugged ships I believe - I\u0027ve not had it happen to me though).\u003C/p\u003E\u003Cp\u003EIn the tracking station at the top, is everything selected here?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/U8n9yri.png\u0022 alt=\u0022U8n9yri.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Xwingace","CreatedById":133896,"CreatedDateTime":"2015-06-27T22:01:01Z","Content":"\n\u003Cp\u003EEverything\u0027s on in the tracking station, it\u0027s gone for sure.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-06-27T22:38:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Xwingace\u0022 data-cite=\u0022Xwingace\u0022\u003E\u003Cdiv\u003EEverything\u0027s on in the tracking station, it\u0027s gone for sure.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, this unfortunately happens sometimes. The Kraken just grabs ships when you\u0027re not looking. I\u0027ve had this happen quite a few times. Sometimes, however, the ship is just in a WAY different orbit that where you left it, instead of being just vanished. So look around, zoom way out and make sure it\u0027s not in some huge solar orbit. But it\u0027s probably just gone \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Windspren","CreatedById":134441,"CreatedDateTime":"2015-06-27T22:52:41Z","Content":"\n\u003Cp\u003EHyperedit in a new one\u003C/p\u003E\n"},{"CreatedByName":"Xwingace","CreatedById":133896,"CreatedDateTime":"2015-06-27T23:01:39Z","Content":"\n\u003Cp\u003EOh well, now I know how NASA feels when one their probes goes dark.\u003C/p\u003E\u003Cp\u003ELaythe thank you, I\u0027ve never done that but how hard could it be?\u003C/p\u003E\n"},{"CreatedByName":"Evanitis","CreatedById":145424,"CreatedDateTime":"2015-06-28T08:31:41Z","Content":"\n\u003Cp\u003EThe Kraken brought my mining-mission home from Duna transfer in my current career. Tried to switch to it for some science, got black screen, freezing. After restarting the game, I found it\u0027s crew down in KSC and I\u0027d swear my credit balance was suspiciously high, like if I recovered it. Everything I did since it\u0027s launch was untouched, so it wasn\u0027t an unintentional loading on my part.\u003C/p\u003E\u003Cp\u003ESince the ship was a bit mis-designed, I\u0027m glad for that Kraken. Or was it a wormhole? Bill even considered sacrificing a pilot or tourist to show his gratitude for the instant rescue, but the suggestion was dismissed by the KSC administration.\u003C/p\u003E\n"},{"CreatedByName":"Old Foxboy","CreatedById":141736,"CreatedDateTime":"2015-06-28T08:41:34Z","Content":"\n\u003Cp\u003EHad one ship returning from Duna with a juggernaut truck load of science. Loaded my game the next day - gone. Loaded a quicksave BEFORE - gone. Loaded a save with the ship in direct focus - gone. Like KSP hyperedited all of my savegames. It was totally like i never launched it. Even the Kerbals were back in the center.\u003C/p\u003E\u003Cp\u003EThis really sucks.\u003C/p\u003E\n"},{"CreatedByName":"Evanitis","CreatedById":145424,"CreatedDateTime":"2015-06-28T09:01:24Z","Content":"\n\u003Cp\u003EStrange... The stories above all involve Duna. Maybe there\u0027s the nest of a certain creature somewhere there...\u003C/p\u003E\n"},{"CreatedByName":"Old Foxboy","CreatedById":141736,"CreatedDateTime":"2015-06-28T15:35:05Z","Content":"\n\u003Cp\u003EHere\u0027s another Duna story. Unfortunately, i couldn\u0027t reproduce it, but it really happened:\u003C/p\u003E\u003Cp\u003EI directed a craft to intercept Duna and had a valid intercept. However, i wanted to change the orbit a little bit to establish a more Delta-V friendly insertion burn. Suddenly, the intercept was way off. I immediately pressed X, thinking i burned into the wrong direction and checked my attitude. But it was perfectly right. I planned another maneuver, and no matter what i did, the closest encounter was getting further and further from Duna.\u003C/p\u003E\u003Cp\u003EUntil i realized: The planet had stopped moving! Everything was moving except Duna. I loaded a previously saved game, and everything was fine.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-06-28T15:56:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Evanitis\u0022 data-cite=\u0022Evanitis\u0022\u003E\u003Cdiv\u003EStrange... The stories above all involve Duna. Maybe there\u0027s the nest of a certain creature somewhere there...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETo me, it appears that there are several \u0022pot holes\u0022 in the space highways that fairly regularly eat ships. IOW, at certain times in the game (so specific planetary positions), moving through certain points in space is rather dangerous. These are all duly noted on my star charts as \u0022Here there be Krakens\u0022.\u003C/p\u003E\u003Cp\u003EThe most ruinous for me is the place that routinely eats ships returning to Kerbin from Eve if you make the round trip at the earliest available windows from the start of the game. If I exit the game when the returning ship is within about 1 week (of 24-hr days) of reaching Kerbin, it\u0027s about 75% likely not to be there when I start the game again. And if it is still there, it\u0027s still quite likely to be dragged into the Void by the Hell Kraken as soon as I try to continue its flight. To avoid this, I either don\u0027t use the 1st Kerbin-Eve / Eve-Kerbin windows or fly the ship all the way back from Eve without stopping.\u003C/p\u003E\u003Cp\u003EThe most aggravating and most commonly encountered pot holes for me, however, are spots along Mun\u0027s orbit about 1.5x times its SOI diameter both ahead and behind. Satellites placed in these positions to simulate being at Lagrange Points quite frequently jump between game sessions into very different orbits, either around Kerbin or even Mun, and not infrequently just vanish. In addition, outbound interplanetary ships passing through these regions have about a 25% chance of vanishing even during the same game session while you\u0027re messing with another ship in the flotilla. Passing closer to or further from Mun as you cross its orbit is no problem.\u003C/p\u003E\n"}]}