{"TopicId":114333,"ForumId":16,"TopicTitle":"Bug (?) with navball and orbit trajectory","CreatedByName":"Siriusalpha2","CreatedById":147066,"CreatedDateTime":"2015-06-27T07:49:27Z","PageNum":1,"Articles":[{"CreatedByName":"Siriusalpha2","CreatedById":147066,"CreatedDateTime":"2015-06-27T07:49:27Z","Content":"\n\u003Cp\u003EHello everybody,\u003C/p\u003E\u003Cp\u003EI have been playing KSP for a few months now and I am facing a really disturbing issue, I can\u0027t get to know if that\u0027s a bug or a twisted game mechanic : \u003C/p\u003E\u003Cp\u003EMy ship is orbiting the Mun (pic related), and should i try to change my orbit, the outcome would always be the same : death.\u003C/p\u003E\u003Cp\u003EEach time i try a manoeuver, with or without mechJeb (which is as lost as i am, hence my suspicion for a bug), with or without a node, the ship is never doing as I want him to do.\u003C/p\u003E\u003Cp\u003EIf I try to land (maybe it would cancel this mess), i can\u0027t reduce my horizontal speed to zero and crash (I\u0027ve already made some landing before and there IS something wrong with the navball).\u003C/p\u003E\u003Cp\u003EIf I try to get back to kerbin, i get lost in space after having used all of my fuel.\u003C/p\u003E\u003Cp\u003EFrankly, this is getting annoying. For now I am not too worried, there is a mobile lab processing lots of data, but there are 3 people in there and they are expensive to replace (that\u0027s what the board said:))\u003C/p\u003E\u003Cp\u003EIs it because I refuelled it once with a rendez vous manoeuver? Is it because it is somewhat on a polar orbit? Is it a bug?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ue28aaq.png\u0022 alt=\u0022ue28aaq.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI am taking any advice ; please tell me it\u0027s not a bug.\u003C/p\u003E\n"},{"CreatedByName":"sjwt","CreatedById":9268,"CreatedDateTime":"2015-06-27T08:08:20Z","Content":"\n\u003Cp\u003EFor reducing your velocity for landing are you switching from Orbital velocity to surface after reducing your orbital velocity, by clicking on the nav ball where it says orbit? \u003C/p\u003E\u003Cp\u003EOnce you have reduced your orbital velocity you need to kill the surface relative moment, you wont get that perfect, but you can get it very close.\u003C/p\u003E\n"},{"CreatedByName":"Woquit","CreatedById":146137,"CreatedDateTime":"2015-06-27T08:22:19Z","Content":"\n\u003Cp\u003EMaybe you are controlling your ship from docking port? Try to right click on main cabin and select \u0022control from here\u0022\u003C/p\u003E\n"},{"CreatedByName":"Harry Rhodan","CreatedById":119953,"CreatedDateTime":"2015-06-27T08:41:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Siriusalpha2\u0022 data-cite=\u0022Siriusalpha2\u0022\u003E\u003Cdiv\u003EIs it because I refuelled it once with a rendez vous manoeuver?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDepends. Do you have a docking port on the side of your ship or a command pod that is not pointing in the same direction as your main engines and clicked \u0022control from here\u0022? Then you will always burn in the wrong direction.\u003C/p\u003E\n"},{"CreatedByName":"Ripper2900","CreatedById":146418,"CreatedDateTime":"2015-06-27T08:45:25Z","Content":"\n\u003Cp\u003EI think that\u0027s the thing too. Right click your command pod and click \u0022control from here\u0022 then try again. \u003C/p\u003E\u003Cp\u003EAlso, make sure you have the nav ball in surface mode when attempting a landing.\u003C/p\u003E\n"},{"CreatedByName":"ColKlonk","CreatedById":137078,"CreatedDateTime":"2015-06-27T08:49:13Z","Content":"\n\u003Cp\u003EI think Harry has nailed it...\u003C/p\u003E\u003Cp\u003EThere are a lot of these \u0027annoying\u0027 little things you eventually get to know.\u003C/p\u003E\u003Cp\u003EFrom a pod use your visual reference to check the navball, if it doesn\u0027t look right, select \u0027control from here\u0027 on the pod.\u003C/p\u003E\u003Cp\u003EIf you have no visual references, and it\u0027s doing the odd thing.. as Harry says \u0027control from here\u0027.\u003C/p\u003E\u003Cp\u003EIn a way, this programs you to go through a \u0027checklist\u0027.. which is good.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Siriusalpha2","CreatedById":147066,"CreatedDateTime":"2015-06-27T09:07:06Z","Content":"\n\u003Cp\u003EThanks, I confirm it was the docking port. I had left it in charge after \u0022control from here\u0022. But the curious thing is : I have the same problem with another ship, this one has no docking port but a rover on top of it. This is probably the same problem, but it is very disturbing ; mechjebs is lost and this \u0022angle to prograde\u0022 is not helping at all. And this time i can\u0027t change it with the \u0022control from here\u0022 action...\u003C/p\u003E\u003Cp\u003ESo i am going to try landing a rover without my ship. How could this not end well?\u003C/p\u003E\u003Cp\u003EThank you for your answers!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/KDBcQpt.png\u0022 alt=\u0022KDBcQpt.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SAI Peregrinus","CreatedById":125558,"CreatedDateTime":"2015-06-27T12:36:36Z","Content":"\n\u003Cp\u003EYour rover\u0027s probe core probably isn\u0027t oriented in the right direction compared to the ship.\u003C/p\u003E\n"}]}