{"TopicId":114388,"ForumId":50,"TopicTitle":"Paydirt -- Finding Good Ore Deposits","CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-06-27T20:43:35Z","PageNum":1,"Articles":[{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-06-27T20:43:35Z","Content":"Yet another tutorial on how to use the various scanners...\n\n**INTRO**:\n\nThis tutorial is only about finding the \u0022best\u0022 spot to drill for Ore. It is not about how to set up the whole system you need to refine and transport it where needed. This is because the refining and distribution infrastructure depends OT1H on the location on the mine, and OTOH on the player\u0027s needs and goals Every situation is different, every game is different, but they all have to start by finding the best place to get Ore.\n\n**I. DEFINE WHAT YOU\u0027RE LOOKING FOR**\n\nThe whole Ore thing, no matter how complex you make it, is just a support function for something else. IOW, it ultimately just provides fuel to ships that are actually doing the real mission. The real mission can range from a simple one-time science-grab to a major colonization effort with multiple ground bases scattered around a planet. The simpler and shorter the real mission, the less finding the \u0022best\u0022 Ore matters, and vice versa. So this tutorial will assume your real mission is to make a full-blown, permanent colony system self-sufficient for fuel; otherwise, you don\u0027t have to be so picky about locations.\n\nNOTE: I put \u0022best\u0022 in quotes because in the context of long-term, high-usage Ore consumption, the \u0022best\u0022 location to extract Ore will probably NOT be the place with the highest concentration on the planet. It is instead a compromise between Ore values, local terrain flatness, proximity to the planet\u0027s equator, and the capabilities of the vehicles based on the planet. Each player must balance these variables to suit the needs of his own unique situation.\n\nAnyway, in the context of a major colonial enterprise, you can divide Ore consumption into 2 categories: spaceport (for ships going to and from space) and planetside (for ships moving around the planet\u0027s surface). Usually the 1st step in building a large colony will be establishing the spaceport, the link to the rest of the empire. Unless the world\u0027s gravity is insignificant, spaceports should be on or very near the equator to avoid ships wasting a lot of fuel changing inclination. This is a significant constraint on spaceport location because Ore (or even land) in the equatorial zone might be scant (as on Laythe). Often, everything else, both the \u0022real mission\u0022 and the Ore operation, must be designed around this one issue. Planetside refueling bases, OTOH, can be anywhere terrain permits, always remembering they also always need a flat area nearby for the landing zone (LZ).\n\nSo, for the purposes of this tutorial, we\u0027ll assume that your real mission is to set up the spaceport on a world with significant gravity. You are therefore looking to mine on or near the equator. The location must have a reasonably large, flat area conveniently located on or near a reasonably good Ore deposit. This tutorial is about finding such a place.\n\n**II. ORE DISTRIBUTION**\n\nTo make sense of the various scanners in the game, you have to understand how the game places Ore on planets. The major rules and imperical observations are as follows:\n\n\\* Ore is defined by biome. Each biome on a given world has certain average level of Ore in it, which is constant across the whole planet. Thus, the 1st objective is to determine the Ore values for each biome. Then you can find places in that biome that are on or near the equator and have terrain suitable for the LZ.\n\n\\* \\* The same biome can be distributed in numerous patches all over the world. Each patch will have the same average value but might contain local hotspots and/or coldspots that differ a little or a lot from the average. Discontiguous patches of the same biome might have slightly different Ore concentrations.\n\n\\* \\* The variability of Ore in the same patch of a biome seems to depend on the amount of elevation change within the patch, and discontiguous patches of the same biome at different elevations can have different concentrations. If there are no significant elevation differences within a biome, then the Ore value will be constant throughout.\n\n\\* All ocean biomes on Eve, Kerbin, and Laythe are hard-coded to have zero Ore.\n\n\\* In other biomes, Ore has a strong tendency to concentrate in the highest and lowest elevations, and at the poles. Biomes at middle elevations tend to have only trace amounts.\n\n\\* \\* The gradient of Ore variability by elevation within a patch of biome follows this tendency. For example, if a Lowlands biome has one of the world\u0027s highest average concentrations, then hotspots within the Lowlands biome will be found at the lowest elevations within it.\n\n\\* The highest concentrations on a world are usually in the least-accessible biomes: poles and mountains. Therefore, you usually have to settle for the 2nd or 3rd best overall concentration, which is usually the biome with the lowest elevation on or near the equator. \n\n\\* Other than Kerbin, Mun, and Minmus, most worlds have only a handful of biomes. This is a good thing because it really helps narrow down your search area.\n\n**III. THE SCANNERS**\n\nNow that we know the habits of our quarry, we must learn how to use our various weapons. The stock games comes with 3 scanners, the M700 Survey (or \u0022Orbital\u0022) Scanner (SS), the Surface Scanning Module (SSM), and the M4435 Narrow-Band Scanner (NBS). All of these are reputedly able to handle the resources of mods, provided the modder lets that happen; otherwise, you\u0027ll have to use the scanners included in the mods. In addition, there\u0027s the SCANsat mod that alters the behavior of the SS. Because SCANsat is so useful by itself, and also has beneficial effects on the SS, I highly recommend using it. It will save you LOTs of time and grief than hunting Ore pure stock.\n\n**M700 Survey Scanner aka SS (stock only)**\n\nThis thing just does a very preliminary, rough-estimate, semi-instant scan. It\u0027s best thought of as what you should already know before you left from centuries of ground-based observations. The key thing to understand about the SS is that what it displays has NOTHING really to do with actual Ore concentrations in the ground. Instead, it shows a \u0022heat map\u0022 that displays regions of the surface the size of Texas within which most of the surface area is covered by 1 or more biomes that have relatively high Ore concentrations for that world. It does not tell you the names of those biomes, it doesn\u0027t show you the boundaries of the biomes, and it certainly doesn\u0027t tell you the actual Ore values found in those biomes.\n\nWhat it actually tells you is, \u0022if you come to this \u0027hot\u0027 region with one of the other scanners, you\u0027ll learn which biomes have the best Ore\u0022. Then, once you have that knowledge, you can find other patches of the good biomes in more convenient locations. Problem is, this info does you little good unless you have access to a biome map. If you don\u0027t have SCANsat, you can\u0027t make your own so your olny recourses are to use the debug menu to display the biome maps, or download a biome map from the web.\n\nYou get the \u0022heat map\u0022 by right-clicking on the SS and selecting deploy, then \u0022Perform survey\u0022. Once this is up, go to the map view, click on the planet to focus there, and click the 3rd info button that appears on the right edge of the screen. This will show the \u0022heat map\u0022 on the planet and let you change the way it\u0027s displayed. I HIGHLY recommend changing this to display in multiple, solid colors instead of the default purple lines. When you have the colors showing, red is good, orange is medium, green is low. Increasing the \u0022cut-off\u0022 value removes the displayed colors starting with green.\n\nThe \u0022heat map\u0022 is deliberately misleading. Because the SS samples very large regions, small patchs of good biomes will be swamped amidst large surrounding areas of bad biomes. Likewise, large areas of middling biomes will show hotter than smaller areas of the best biomes. Kerbin is a good example. Usually its Shores have one of the highest concentrations but because that\u0027s a very narrow biome, the survey \u0022heat map\u0022 usually doesn\u0027t show it at all except for a few islands isolated far away from major land masses. Also, once you send down other scanners to actually have a look, those regions disappear from the \u0022heat map\u0022. So use the SS and with caution, always remembering that you\u0027re looking for BIOMES with it. And use SCANsat with it---it makes your life a lot easier.\n\nHere\u0027s an example of how misleading the \u0022Heat Map\u0022 can be:\n\n[![19192048785_bee89f7f7b_z.jpg](https://c1.staticflickr.com/1/385/19192048785_bee89f7f7b_z.jpg)](https://flic.kr/p/veWgsR)\n\nThis is Vall in my current game with the cut-off at about 50%. From this, it\u0027s possible to guess that the north pole, at least, probably is a good biome but sadly useless for a spaceport. Othewise, the mountains look good but again, not really useful for landing on. It doesn\u0027t look good for the smoother, lower spots where I really want to build my spaceport.\n\nHowever, upon further examination, it turned out that the \u0022mountains\u0022 (Highalnds) were the best and Poles and basins (Lowlands) are about equal--the Pole just looks all red because its all 1 big uniform area of the same, relatively high-value biome, while the Highlands are diluted by the small basins and intervening Midlands. Between the Lowlands and the Highlands were narrow bands of Midlands which had next to nothing. Because no Lowland basin is very big compared to the contiguous spaghetti of the Highlands, and are surrounded by the pathetic Midlands, they don\u0027t show up at all at this cut-off level. At lower cut-offs, they look green or stil show nothing.\n\nSome key points about the SS:\n\n\\* Requires the ship to be in a highly inclined orbit (about \u002B/- 80^). Any altitude up to its listed max is fine.\n\n\\* Ship must have an antenna and a significant battery capacity for the transmission. Might also require a communications network if you\u0027re into RT or Antenna Range.\n\n\\* MUST BE DONE for the NBS to work at all (whether or not you use SCANsat).\n\n**M700 Survey Scanner aka SS (with SCANsat)**\n\nThe primary advantages of using SCANsat are that 1) it can give a biome map, 2) it can give you a radar map of the terrain, and 3) it will draw a resource overlay on either of these maps so you know right off which biomes have how much Ore and where they are on the planet. Yay! SCANsat also has an option for non-instant resource scanning if that\u0027s your thing. However, there are a few things you need to know to make this useful.\n\nHere\u0027s an example of why to use SCANsat:\n\n[![18600708838_7b118537ec_z.jpg](https://c1.staticflickr.com/1/467/18600708838_7b118537ec_z.jpg)](https://flic.kr/p/ukFuGw)\n\nThis is the SCANsat biome map of Vall from the same game as above, with the Ore overlay turned on. In the game, I could move the cursor over the whole map and read both the biome name and the ore level their. This allowed me not to be deceived by the heat map and concentrate on the good Lowlands basins, which have terrain amenable for LZs.\n\nSome important notes about using SCANsat with the SS:\n\n\\* To create the Ore overlay, you have to fully scan the planet just as with other SCANsat sensors, which means a nonsynchronous polar orbit. Optimum orbits for each planet can be found from a link on the 1st SCANsat thread page. Doing this will take several game days, but will run in the background same as other SCANsat instruments.\n\n\\* To scan for Ore, you have to right-click on the (previously deployed) SS and select \u0022Start Resoure Scan\u0022. This is a new action added to the menu by SCANsat.\n\n\\* Scanning for Ore this way is done in the same altitude band as the SCANsat biome and low-res radar scanners. It will not work at the higher altitude needed for the high-res radar.\n\n\\* To actually see the Ore overlay, you have to turn it on in the SCANsat \u0022big map\u0022 display. Probem is, it draws on top of the biomes and terrain features so it\u0027s a bit difficult to get really detailed info from this, even when zoomed way in. Thus, you will still need to prospect in more detail with the SSM and NBS.\n\n\\* YOU MUST STILL USE THE STOCK \u0022PERFORM SURVEY\u0022 action (IOW, the heat map) to make the NBS work.\n\n**The Surface Scanning Module (SSM)**\n\n**EDIT: Rewritten to include an important point I missed previously**\n\nThe SSM is both very useful and very limited. Right-clicking on it gives you a text display with some very useful information: the exact lat/lon of your ship, the name of the biome you\u0027re in, and the exact Ore concentration at that spot. And as long as you have this window open, it updates continuously as your vehicle moves.\n\nThe SSM will function up to an altitude of about 1000m above the local terrain elevation but when not on the ground, it displays an average value for the Ore below. However, this average value does change as the ship moves so does take the local variation of Ore into account, but it\u0027s not entirely accurate.\n\nWhen the SSM is on the surface, its GUI has a \u0022Run Analysis\u0022 button. Doing this gathers data from the surrounding terrain out about as far as the NBS\u0027 map displays (see below). Once you do this, the SSM\u0027s display will show the exact value of the Ore at its position, as long as it remains on the surface. As the vehicle moves along the surface, periodically the \u0022Run Analysis\u0022 button will reappear as the SSM moves beyond the area it scanned previously.\n\nThe SSM, like the SS, is also a precursor for making the NBS function. Until you do the SSM\u0027s \u0022Run Analysis\u0022, using the NBS in that area will not give an accurate display of the actual Ore variation across its map (see below). If there is sufficient elevation change, the NBS map will show some variation but not the full extent, and won\u0027t show the exact values. If there\u0027s little elevation change, the NBS won\u0027t show any variation at all.\n\nUsed by itself, therefore, the SSM can tell you what you\u0027re standing on and approximately what you\u0027re flying over. But because it\u0027s just text without a map, finding hotspots is difficult. You have to continually watch how the displayed Ore value changes as you move along the ground to determine whether the Ore gets better or worse in the current biome as you move uphill or downhill. Once you determine this, you can eyeball the surrounding terrain to find the highest or lowest points in the vicinity and move to them to see if your deduction about Ore gradients was correct. Also, the SSM does not tell you where biome boundaries are---that\u0027s something you\u0027ll have to infer from the lay of the land or determine from the debug menu, a downloaded map, or a SCANsat biome map.\n\nWhere the SSM really shines is when combined in the same vehicle with the NBS. The SSM can thus keep the NBS updated, the NBS can actually see hotspots and biome boundaries for you to move to, and the SSM will verify when you\u0027ve arrived there.\n\n**NARROW-BAND SCANNER (NBS)**\n\nRight-clicking on the NBS and selecting its GUI will bring up a small map (roughly \u002B/-2^ of lat/lon) around the position your ship was in at the moment you activated the map. The map is a snapshot, not a video, so if your ship is moving, you\u0027ll have to hit the REFRESH button periodically to take a new pic of your surroundings. However, the map is interactive. Moving your cursor over the map will display the lat/lon, biome name, and Ore value at the spot under the cursor, as well as the average ore value for that biome. This enables you to locate hotspots within biomes and rate the to the biome\u0027s average value. All very nice. There are a few things to keep in mind, however.\n\n\\* NBS ONLY WORKS IF YOU \u0022PERFORM SURVEY\u0022 FROM THE SS. This is true whether you use SCANsat or not.\n\n\\* As mentioned above, the NBS map is static and must be refreshed periodically if your ship is moving. Because the map picture is static, this makes it tricky to move to a specific spot on it. Thus, it\u0027s a good idea for the ship to have an SSM as well.\n\n\\* There is no way to save the NBS map except by taking screenshots.\n\n\\* The NBS only shows places with some non-zero value of Ore in them. Areas with zero Ore are black. Thus, in coastal areas, land that is counted as part of the ocean biome (defined to have zero Ore) will not appeaer black as the sea on the NBS map, which can be confusing.\n\n\\* The NBS will work from its stated max altitude down to the surface.\n\n**IV. USING THIS KNOWLEDGE**\n\nThe system I\u0027ve evolved to best use the tools and knowledge of Ore behavior to find the Ore I want in a good place uses all 3 of the stock scanners plus SCANsat. SCANsat is a great time-saver because it keeps you from having to go into inhospitable terrain to find the good biomes, and cuts through much of the confusion caused by the SS. And until you get the NBS, SCANsat zoomed way in can be a fairly good, but rather clunky, substitute. Still, it\u0027s better than relying on the SSM alone.\n\nThe procedure is as follows:\n\n1. Build a probe with the SCANsat biome and low-res radar scanners, plus the M700 SS. Put this in a polar, non-synchronous mapping orbit and immediately \u0022Perform Survey\u0022 with the SS so that the NBS will work in the future. Now map the whole planet for Ore, biomes, and low-res radar. Once this is done, you can move the probe up higher for the high-res radar scan if available/desired, but for our Ore purposes, you\u0027re done with this probe for now.\n\n2. Open the SCANsat \u0022big map\u0022, set it for biomes of the planet in question, and enable the resource overlay. Run the cursor along the equator taking note of the biome names and their Ore values. Select likely landing site candidates and note their locations. Now switch to the radar map, turn off the overlay, zoom in as necessary, and see if there are any good places to land on or very near the ore you want., and that the Ore itself isn\u0027t in too steep a place. In this way, narrow your list of candidates down to 2 or 3.\n\n3. Build 1 or more ships that can land, move on or just over the ground indefinitely, and have the SSM and (if available) the NBS. Use these to thoroughly investigate each of your candidate sites up close. Use NBS or zoomed-in SCANsat to find local hotspots, the mobility to move to them, and the SSM to tell you when you\u0027ve arrived. Use your eyes to scope out the levelness of the terrain. If it happens that the Ore isn\u0027t in under the best LZ terrain in the area, you\u0027ll have to truck Ore or refined fuel from the mine to the spaceport. So judge whether you\u0027ve got a good truck route or not. If not, you need a different candidate.\n\n4. Keep checking candidates until you find one that meets your requirements: decent Ore readily accessible under or near a decent stretch of reasonably flat ground on or near the equator. If you can\u0027t find such a place, lower your standards and look again, or just give up on the whole project. In the end, you\u0027ll find the \u0022best\u0022 Ore, if not necessarily the highest value. Then land your prospecting ship there to mark the spot for future expeditions.\n\n[![19004388170_225ecd041e_z.jpg](https://c1.staticflickr.com/1/326/19004388170_225ecd041e_z.jpg)](https://flic.kr/p/uXmsv1)\n\n**Edited \u003Ctime datetime=\u00222015-06-28T15:35:25Z\u0022 title=\u002206/28/2015 03:35  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 28, 2015\u003C/time\u003E by Geschosskopf**\n  \nForgot an important point about the SSM"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2015-06-27T20:50:52Z","Content":"I\u0027ll have to give this a more thorough once-over once my Internet connection situation stabilizes, but this is looking like it might be an excellent candidate for the Drawing Board ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-06-27T21:10:16Z","Content":"\u003E \n\u003E I\u0027ll have to give this a more thorough once-over once my Internet connection situation stabilizes, but this is looking like it might be an excellent candidate for the Drawing Board ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nThanks ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif).\n\nAnd speaking of the Drawing Board, please remove my entries for RemoteTech2 and Science. Both are obsolete under the current systems. My flotilla tutorial is still good, however."},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2015-06-27T21:17:48Z","Content":"Duly noted. I\u0027ll make the necessary adjustments."},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-06-28T15:38:40Z","Content":"Edited to include an important point about the SSM I\u0027d forgotten the 1st time."},{"CreatedByName":"kaptain_kavern","CreatedById":157035,"CreatedDateTime":"2016-01-31T01:17:44Z","Content":"Thx a lot for this excellent tuto mate."},{"CreatedByName":"pertrep","CreatedById":136947,"CreatedDateTime":"2016-02-02T04:26:09Z","Content":"Erudite and thorough explanation.  Still a lot of work by the look of things so no spoiler there."},{"CreatedByName":"cyberpunkdreams","CreatedById":161836,"CreatedDateTime":"2016-06-03T22:08:29Z","Content":"I found this incredibly useful -- thank you. I\u0027ve been playing for a while now (with SCANsat), but the whole ore system was confusing me when it got to the point of using the SSM and beyond."}]}