{"TopicId":114469,"ForumId":44,"TopicTitle":"Rocket patents: \u0026quot;Coming in hot!\u0026quot; edition - reentry stuff!","CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-06-28T18:46:03Z","PageNum":1,"Articles":[{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-06-28T18:46:03Z","Content":"\n\u003Cp\u003EHello everyone~\u003C/p\u003E\u003Cp\u003EI am back here with some interesting patents I found on google. These patents are just what I found interesting personally, and although some of them are silly, I think it is rather fun to see what we do with our technology based on the things people think up. Lets start with this solution to return our tiny satellites to earth safely:\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E1.Deployable decelerator for small satellites:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.google.com/patents/US8292232\u0022 rel=\u0022external nofollow\u0022\u003EPatent US 8292232 B1 - Deployable decelerator based microsatellite recovery \u003C/a\u003E (published 2012)\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022https://patentimages.storage.googleapis.com/US8292232B1/US08292232-20121023-D00000.png\u0022 alt=\u0022US08292232-20121023-D00000.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EA very interesting idea of attaching a small heat shield to a microsatellite, possibly a cubesat, and equip it with a decelerator in the form of an inflatable torus ring with high drag to intentionally decay the satellite\u0027s orbit down without having to use an engine, which will add significant mass to a small satellite, including its propellent. Probably only works on near earth satellites, otherwise the ring won\u0027t help that much. Although I wonder how long this would take...\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E2. Methods of communicating to a vehicle during reentry\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ESo we all know that during reentry, the spacecraft entering the atmosphere will be enveloped in plasma, preventing communication for a short time. Usually this short blackout is inconsequential. That doesn\u0027t stop people from finding ways to prevent that blackout however, and they have came up with 2 solutions:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.google.com/patents/US3277375\u0022 rel=\u0022external nofollow\u0022\u003EPatent US 3277375 A - Reentry communication by material addition (published 1966)\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022https://patentimages.storage.googleapis.com/pages/US3277375-0.png\u0022 alt=\u0022US3277375-0.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u0022Material addition\u0022, a fancy way of saying they are going to throw things at stuff. In this case, the whole idea is really simple. They spray water into the plasma sheath. Yeah. Water. The idea is to punch a hole through the plasma using nozzles spraying water, allowing radio signal to reach the craft. The specific details on how this supposed to work is in the link, but I will quote (with some slight fix) a small part here:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u0022\u003Cspan style=\u0022font-family:Arial;\u0022\u003EThe present invention is concerned with injecting a material into the flow field of the plasma to open a hole in the plasma layer through which radio-frequency signals can be transmitted. This hole is produced by reducing the electron concentration of the plasma; The possible ways in which the material reduces the electron concentration is by cooling the plasma; by increasing the recombination rate of electrons and ions in the plasma; and by the attachment of electrons in the plasma to the injected material.\u003C/span\u003E\u003Cspan style=\u0022font-family:Arial;\u0022\u003EWhen a material such as gas is ejected at the surface of a space vehicle, the gas causes a great disturbance to the plasma flow field and instead of mixing tends to cause the flow field to bulge around the ejection site. Because of this bulging, a hole is not opened through the plasma and the surface of the layer of plasma is made larger.\u003C/span\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:Arial;\u0022\u003E...\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:Arial;\u0022\u003EIt has been found that liquid dr are good materials for this use. Also, in the use droplets evaporation and heat transfer can occur in short residence time of the coolant in the vehicle vicinity. Water is a good liquid to use because it has a high heat capacity both as a liquid and a vapor and it also increases combination rate, and has an affinity for electrons.\u0022\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe second patent sounds more sophisticated, however:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.google.com/patents/US5434583\u0022 rel=\u0022external nofollow\u0022\u003EPatent US 5434583 A - Communication with reentry vehicle through modulated plasma\u003C/a\u003E (published 1995)\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022https://patentimages.storage.googleapis.com/pages/US5434583-2.png\u0022 alt=\u0022US5434583-2.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EUsing electromagnetic energy, this invention attempt to modulate the plasma sheath itself to transmit and receive signals, however, this require the vehicle to enter through a relatively steep trajectory in order to establish a radiation conducting sheath very close to the vehicle. Yeah, it sounds like all technobabble to me, someone should look at it and tell me.\u003C/p\u003E\u003Cp\u003ENow we look at how to get back from space without a space craft:\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E3. Personal reentry shield:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EWe have 2 patents for this thing, with slight differences:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.google.com/patents/US3229936\u0022 rel=\u0022external nofollow\u0022\u003EPatent US 3229936 A - Forming a shield on a re-entry body in space\u003C/a\u003E (published in 1966)\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022https://patentimages.storage.googleapis.com/pages/US3229936-1.png\u0022 alt=\u0022US3229936-1.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EMost of you might have already seen this one, or a variation of it. This is the patent for the idea of a plastic foam that can be used to envelop an object or person to protect them as they enter the atmosphere. And for a person, the procedure is this:\u003C/p\u003E\u003Cp\u003E1. Get inside a bag made from possibly polyethylene film with your spacesuit\u003C/p\u003E\u003Cp\u003E2. Tie yourself to the inside of the bag\u003C/p\u003E\u003Cp\u003E3. (optional) fire a retro rocket to deorbit yourself if not already on deorbiting path\u003C/p\u003E\u003Cp\u003E4. Start filling the bag with foam until it encase you \u003Cem\u003Ecompletely\u003C/em\u003E. Some variation of the bag may have some segments to fill with different kind of foam of different density, forming leading and trailing edge and provide better protection.\u003C/p\u003E\u003Cp\u003E5. Pray you are not going to die.\u003C/p\u003E\u003Cp\u003EApparently it is noted that you can break free from the foam when you land on the sea. What would happen if the astronaut does that in mid air and compromise the aerodynamic shape of the shield, I wonder... or even if the astronaut shift weight slightly and the thing tumbles? Oh and did I forget to mention that it is not an ablative shield? It is going to be real hot in there.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.google.com/patents/US3330510\u0022 rel=\u0022external nofollow\u0022\u003EPatent US 3330510 A - Orbital Escape Device\u003C/a\u003E (published in 1967)\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E \u003C/p\u003E\u003Cimg src=\u0022https://patentimages.storage.googleapis.com/pages/US3330510-3.png\u0022 alt=\u0022US3330510-3.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EA variation of the above, with almost the same idea: get in a bag, inflate it, fire retro rocket, go through the atmosphere and pray you don\u0027t burn up. However, there is no foam in this one. It is a spherical zipper bag made from a \u0022subtrate of heavy nylon\u0022 and has a small window where you can look out to aim and fire your retro rocket, and using your own breath as RCS to orient yourself (yeah, the air you breath out will be exhausted through air nozzle on the retro rocket assembly, which you can aim through the small window). It will be inflated with nitrogen, and has its own oxygen supply, as you are to abandon your own oxygen packs on the spacesuit prior to coming inside the bag, and instead put on a parachute with survival tools for landing. Apparently there will be ablative material on the outside of the bag, and it will have insulation to keep the heat at \u0022acceptable level for survival\u0022 (note, it is not saying \u0027comfortable\u0027). Then when you slow down enough to pass the heating zone, the bag will slowly \u003Cem\u003Edeflate\u003C/em\u003E, signalling that it is time to zip out \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Ein mid air\u003C/span\u003E and start skydiving and open up your parachute and hopefully land in safety.\u003C/p\u003E\u003Cp\u003EDamn, why haven\u0027t I seen this in a james bond movie? The action and badassery that is required to use this thing is enough to be a movie on its own.\u003C/p\u003E\u003Cp\u003EWell, on the bright side, at least if things go wrong, these people won\u0027t have to use the following service:\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E4. Cremation using reentry heat:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.google.com/patents/US6550114\u0022 rel=\u0022external nofollow\u0022\u003EPatent US 6550114 B1 - Cremation on atmospheric reentry\u003C/a\u003E (published 2003)\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022https://patentimages.storage.googleapis.com/US6550114B1/US06550114-20030422-D00000.png\u0022 alt=\u0022US06550114-20030422-D00000.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you ever want to go out in style, this is the way to go. They stuff your body inside a cardboard tube, then place that tube in a reentry capsule that may be decorated however you or your loved ones wanted. And then it is launched to space and set on re-entry course. Now, there are many ways to get your body up there, ranging from conventional launch using rockets (the patent mentioned \u0022Titan, Delta, Athena, Arianne[sic], Taurus\u0022 as suitable launch vehicles. for dead bodies.) or you can ride on the more fancy Pegasus launch off from an airplane, soaring through the sky. Either way, at one point the payload containing your body will be released and it will burn through the atmosphere spectacularly.\u003C/p\u003E\u003Cp\u003ENote: this is not a scientific patent, there are some inaccuracies in this patent, such as saying reentry heat are generated from friction. But it is funny. Another related patent,but not space-related, is \u003Ca href=\u0022https://www.google.com/patents/US8739374\u0022 rel=\u0022external nofollow\u0022\u003Ethis\u003C/a\u003E. They load your ash into a cannister, put it inside a mortar tube, and shoot it. Going out with a bang, literally.\u003C/p\u003E\u003Cp\u003EThat is it for today peeps, hope you enjoy it!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-30T18:45:21Z\u0022 title=\u002206/30/2015 06:45  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 30, 2015\u003C/time\u003E by RainDreamer\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"LordFerret","CreatedById":111598,"CreatedDateTime":"2015-06-28T19:05:43Z","Content":"\n\u003Cp\u003EI think those two reentry devices should fall under the reentry cremation category lol.\u003C/p\u003E\u003Cp\u003EReminds me of a fire-escape device someone invented, which was a bag/tube which ran down the side of the building... you jump into it and slide down. As I recall, the first test didn\u0027t go so well.\u003C/p\u003E\n"},{"CreatedByName":"Rickenbacker","CreatedById":2349,"CreatedDateTime":"2015-06-30T11:30:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LordFerret\u0022 data-cite=\u0022LordFerret\u0022\u003E\u003Cdiv\u003EI think those two reentry devices should fall under the reentry cremation category lol.\u003Cp\u003EReminds me of a fire-escape device someone invented, which was a bag/tube which ran down the side of the building... you jump into it and slide down. As I recall, the first test didn\u0027t go so well.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMaybe not, but now they work quite well!\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/ZQUyetqmrrU?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2015-06-30T12:55:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rickenbacker\u0022 data-cite=\u0022Rickenbacker\u0022\u003E\u003Cdiv\u003EMaybe not, but now they work quite well!\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/ZQUyetqmrrU?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELooks good. Scary, but functional. Needs asbestos around it. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt has fiberglass outer layer, but I\u0027d add asbestos. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s also good if you ever wanted to know how a turd feels like. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-06-30T12:57:51Z\u0022 title=\u002206/30/2015 12:57  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 30, 2015\u003C/time\u003E by lajoswinkler\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-06-30T14:03:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lajoswinkler\u0022 data-cite=\u0022lajoswinkler\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EIt\u0027s also good if you ever wanted to know how a turd feels like. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOr being eaten by godzilla....\u003C/p\u003E\u003Cp\u003EOn topic though, I wonder why people inventing the second personal reentry uhh....body bag thought that an astronaut going down at orbital speed while possibly spinning like crazy due to its spherical shape is in any condition to unzip the damn thing to do sky diving. It is almost like a conspiracy to just make collection of dead astronauts easier with a bag.\u003C/p\u003E\n"},{"CreatedByName":"Silver_Swift","CreatedById":123500,"CreatedDateTime":"2015-06-30T15:24:42Z","Content":"\n\u003Cp\u003EI know its not exactly the biggest problem facing that suggestion, but it looks like the astronauts in the first reentry non-craft are supposed to manually aim the retrorockets. If so, that seems.... challenging when you are zipped up inside a bag without any indication of which way is retrograde and without any way of controlling your rotation other than flailing about.\u003C/p\u003E\n"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-06-30T18:32:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Silver_Swift\u0022 data-cite=\u0022Silver_Swift\u0022\u003E\u003Cdiv\u003EI know its not exactly the biggest problem facing that suggestion, but it looks like the astronauts in the first reentry non-craft are supposed to manually aim the retrorockets. If so, that seems.... challenging when you are zipped up inside a bag without any indication of which way is retrograde and without any way of controlling your rotation other than flailing about.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI assume the bag itself is transparent, because apparently it can also be worn continuously:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022font-family:Arial;\u0022\u003EEnvelope 42 may be donned by man 40 when the satellite becomes disabled or be worn continuously and is so constructed that when inflated it will have a predetermined size and shape. Before inflation envelope 42 is flexible enough to permit man 40 to perform necessary tasks\u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah...I think operating a spacecraft when being covered in a flappy bag is precisely the reason why someone need to jump ship.\u003C/p\u003E\n"},{"CreatedByName":"micr0wave","CreatedById":136352,"CreatedDateTime":"2015-06-30T19:14:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RainDreamer\u0022 data-cite=\u0022RainDreamer\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E(...)\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E4. Cremation using reentry heat:\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E(...)\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EIf you ever want to go out in style, this is the way to go.\u003C/strong\u003E \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E(...)\u003C/span\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Emade my day \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"}]}