{"TopicId":114752,"ForumId":25,"TopicTitle":"Land and take off and go back from Minmus with just gimbal as control","CreatedByName":"322997am","CreatedById":146422,"CreatedDateTime":"2015-07-01T11:55:16Z","PageNum":1,"Articles":[{"CreatedByName":"322997am","CreatedById":146422,"CreatedDateTime":"2015-07-01T11:55:16Z","Content":"\n\u003Cp\u003EJust go to Minmus orbit however you want use hyper edit I don\u0027t care . Then turn rcs sas and reaction wheels off. Then land and return to kerbin safely without cheats. Still no reaction wheels rcs or sas. Who can do it?\u003C/p\u003E\n"},{"CreatedByName":"Foxster","CreatedById":113764,"CreatedDateTime":"2015-07-01T16:16:01Z","Content":"\n\u003Cp\u003EYou need to look at the guide for setting challenges.\u003C/p\u003E\n"},{"CreatedByName":"rocx","CreatedById":140968,"CreatedDateTime":"2015-07-01T17:33:07Z","Content":"\n\u003Cp\u003ETranslated:\u003C/p\u003E\u003Cp\u003EThis challenge is about piloting skills: land a craft (stock or mod parts, doesn\u0027t matter) from Minmus orbit to the surface and take off again. You may not use SAS during any point. All reaction wheels must be switched off. All rcs thrusters must be switched off. Your only attitude control can come from the gimballing of your main engines (all of which must be pointed in the same direction). Piloting aids such as Mechjeb are also obviously not allowed.\u003C/p\u003E\u003Cp\u003EEntrants should preferably show their skills through an uploaded video, but an image album with plenty of pictures can also work.\u003C/p\u003E\u003Cp\u003EIf there are multiple entries and people feel the need to be ranked and outdo each other, I suggest using fewer engines, more complicated craft, or a lower TWR. Maybe someone can even show us a landing without any gimballed engines!\u003C/p\u003E\n"},{"CreatedByName":"smjjames","CreatedById":134004,"CreatedDateTime":"2015-07-01T17:34:43Z","Content":"\n\u003Cp\u003EWould also be good if the OP showed an example of their attempt.\u003C/p\u003E\n"},{"CreatedByName":"Hotblack Desiato","CreatedById":93895,"CreatedDateTime":"2015-07-01T18:09:11Z","Content":"\n\u003Cp\u003Eare engines pointing in different directions allowed? if so, a player could set up a manual action-group controlled RCS-system.\u003C/p\u003E\n"},{"CreatedByName":"322997am","CreatedById":146422,"CreatedDateTime":"2015-07-01T19:02:51Z","Content":"\n\u003Cp\u003EI did this challenge but I did it in career first and then I came up with the challenge.\u003C/p\u003E\n"},{"CreatedByName":"mattssheep4","CreatedById":146984,"CreatedDateTime":"2015-07-01T19:08:30Z","Content":"\n\u003Cp\u003EDid this in career mode 1.0.2. Had Bob as pilot, didn\u0027t have probe cores yet or RCS. I got over 1500 science from that mission. Don\u0027t have pics, I guess I could go do it again...\u003C/p\u003E\n"},{"CreatedByName":"Hotblack Desiato","CreatedById":93895,"CreatedDateTime":"2015-07-02T22:08:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mattssheep4\u0022 data-cite=\u0022mattssheep4\u0022\u003E\u003Cdiv\u003EDid this in career mode 1.0.2. Had Bob as pilot, didn\u0027t have probe cores yet or RCS. I got over 1500 science from that mission. Don\u0027t have pics, I guess I could go do it again...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ethe problem is, that the capsule has torque on its own, bob is just not a pilot and can\u0027t use SAS.\u003C/p\u003E\u003Cp\u003Ebut in this challenge, the player is basically not able to turn the ship around without aid of the gimbal-function of the rocket engines. (which makes the MK55 a very interesting choice because of its high gimbal value).\u003C/p\u003E\u003Cp\u003Eone more quite important thing: timewarp stops rotation. I\u0027d suggest the mod persistent rotation. the spacecraft remembers its own rotation-speed during timewarp \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"}]}