{"TopicId":114738,"ForumId":15,"TopicTitle":"Need advice on not making colors seem \u0026quot;flat\u0026quot;","CreatedByName":"Pipcard","CreatedById":2541,"CreatedDateTime":"2015-07-01T06:38:22Z","PageNum":1,"Articles":[{"CreatedByName":"Pipcard","CreatedById":2541,"CreatedDateTime":"2015-07-01T06:38:22Z","Content":"\n\u003Cp\u003EI\u0027m not a KSP add-on dev; I\u0027m more of an Orbiter simulator add-on dev, but if I were ever to become one, I would like some advice on doing textures like this, in which the white and grey don\u0027t look like they were just flatly shaded materials.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/HwZttvs.png\u0022 alt=\u0022HwZttvs.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis was my attempt at not making colors seem flat, it used (GIMP\u0027s) Noise generation and motion blur to produce the white you see here. The seams are also \u0022flat\u0022-looking compared to the image above.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/9Se5UFy.png\u0022 alt=\u00229Se5UFy.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo, what\u0027s a good method for doing something like the Mk 3 cockpit?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-01T06:49:04Z\u0022 title=\u002207/01/2015 06:49  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 1, 2015\u003C/time\u003E by Pipcard\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"landeTLS","CreatedById":97925,"CreatedDateTime":"2015-07-01T08:12:12Z","Content":"\n\u003Cp\u003EThe quick and dirty way is to bake out an ambient occlusion map and multiply that ontop of your color layer. But just doing that wont give you the result you see on for example the mk3 cockpit there. That result is made with a more hand painted approach. i would think it was made by segementing/paneling in ps/gimp then manually \u0022bleeding\u0022 the colors. I think i saw some tutorials by cpcipard somewhere here on that process.\u003C/p\u003E\n"},{"CreatedByName":"Porkjet","CreatedById":92433,"CreatedDateTime":"2015-07-01T12:47:44Z","Content":"\n\u003Cp\u003EFirstly, noise and blur is a good idea, and can be especially helpful with lossy formats like .dds in \u0027dithering\u0027 the compression artifacts to make em less apparent.\u003C/p\u003E\u003Cp\u003EFor Mk3 cockpit I basically handpainted it all. I\u0027m still experimenting to find the quickest workflow and have recently used more and more filter combinations instead of handpainting, but basicly I use these steps to create spaceplane textures:\u003C/p\u003E\u003Cp\u003E1. First, with a fairly hard low opacity brush draw black along the panel lines to \u0027soften\u0027 them, dont paint too cleanly here, we want it too look dirty. Then lower opacity of the layer till its just a subtle effect. Another easier way to do this would be to copy the panel lines into one layer and apply a blur filter, but that gives IMO too uniform results, I prefer the slight dirtiness of a hard brush and sloppy hand-painting. \u003C/p\u003E\u003Cp\u003E2. Then on a new layer paint in white, similar brush, slightly higher opacity (cos of bright grey background). With this paint more in the center of the panels, still somewhat following along the outlines tho, fairly sloppy and randomly because uniformity is the enemy \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E. Adjust this layers opacity till its just a subtle effect. The combination of this white and the black layer is supposed to give a cheap and simplified impression of manufacturing marks and some material wear. Dirt and erosion usually manipulate the look of a material based on convexity of surface features like small grooves between panels, protruding bits and so on. By painting fairly randomly along the panels like I described it, a very basic impression of that can be \u0027faked\u0027 quick and easy without going into any detail about material properties and different kinds of wear.\u003C/p\u003E\u003Cp\u003E3. Now its time to add some detail on another layer. With a small bruish, fairly low opacity paint the intersections of the panel lines, imagine the panels arent sharp rectangles, but have very subtle radius on their corners, when joining them together it leaves a tiny dark gap on the corners of the panels. Try to very subtly \u0027round\u0027 the corners of the panels with the brush. It adds some depths to the panels and we\u0027re used to seeing this from seams between panel sheets on cars and other machines.\u003C/p\u003E\u003Cp\u003E4. Take a fine brush, 1-3px medium or high opacity, white, new layer. This will be the scratch layer. Paint bright scratches on panel edges, fairly randomly. You can experiment with how uniformly you paint those, it can be non-uniform lines along the entire edges or seperate bright specs randomly distributed along the seams. Paint them especially obviously at the corners of each panel, corners usually wear out quickly. \u003C/p\u003E\u003Cp\u003EOptionally: \u003C/p\u003E\u003Cp\u003E- paint thin scratches randomly over entire panels, concentrate them especially in areas that are convex on your model.\u003C/p\u003E\u003Cp\u003E- give underlaying color, underneeth the outline layer randomly different brightness for different panels. E.G. make some panels darker or brighter than others, to imply some have been on the vehicle longer than others, that some have been recently replaced and are less dirty. If you look closely at the spaceshuttles white panels and tiles, its actually a really messy patchwork.\u003C/p\u003E\u003Cp\u003ENote that its not a very realistic approach tho, it\u0027s only supposed to add a basic and toyish material authenticity to the textures.\u003C/p\u003E\u003Cp\u003EIf you want more realism I recommend look closely at some photos of the space shuttle, what color and texture the different materials have, how they wear out, and how worn dirty pieces differ from newly replaced panels and ceramic tiles, what kind of material is exposed if upper layers are damaged and so on, and try to replicate that.\u003C/p\u003E\u003Cp\u003ELoving that Spaceplane by the way, awesome job so far! If I may nitpick one thing tho, never use true black on large areas of game textures. Leave some room for shadows. So, use a dark grey for the black tiles instead of actual black, something around 10% - 20% brightness.\u003C/p\u003E\u003Cp\u003EHope this was of any help, have a good time texturing!\u003C/p\u003E\u003Cp\u003Eedit: landeTLS mentioned it already; your model may benefit from some shadowing along concave areas, e.g. where the fins join the main body, can be a baked ambient occlusion multiplied on top or you can try to hand paint it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-01T20:06:02Z\u0022 title=\u002207/01/2015 08:06  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 1, 2015\u003C/time\u003E by Porkjet\u003C/strong\u003E\n\u003Cbr\u003Eoops\n\u003C/span\u003E\n"},{"CreatedByName":"Pipcard","CreatedById":2541,"CreatedDateTime":"2015-07-01T15:10:27Z","Content":"\n\u003Cp\u003EThank you so much for your thorough response and letting me know that it\u0027s all handpainted, but you seem to have double posted before the edit.\u003C/p\u003E\u003Cp\u003EAlso, the parts in the Orbiter screenshot that look too black are that way because I adjusted the contrast to make it look more vivid, and it is actually more of a dark grey.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-01T15:18:09Z\u0022 title=\u002207/01/2015 03:18  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 1, 2015\u003C/time\u003E by Pipcard\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Wolf Baginski","CreatedById":138549,"CreatedDateTime":"2015-07-18T09:32:15Z","Content":"\n\u003Cp\u003ESome of this is definitely made easier with layers.\u003C/p\u003E\u003Cp\u003EThis example isn\u0027t a spaceship, but I think shows the point. It was the collar of a jacket...\u003C/p\u003E\u003Cp\u003EBottom layer: the basic jacket fabric\u003C/p\u003E\u003Cp\u003EMiddle Layer: shadowing\u003C/p\u003E\u003Cp\u003ETop Layer: the collar\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/T8K9s8M.jpg\u0022 alt=\u0022T8K9s8M.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe shadowing was made by showing the top and middle layers while editing the middle layer, using the airbrush tool, darkest along the collar edge. widening slightly where it needed to look to have a larger gap between collar and base. What\u0027s under the collar in the middle layer doesn\u0027t matter.\u003C/p\u003E\u003Cp\u003EThe middle layer was then used as a modifier on the bottom layer.\u003C/p\u003E\u003Cp\u003EThere\u0027s a couple of other things that make the illusion more effective. The Camo pattern of the different pieces of fabric doesn\u0027t match along the seams. You could also use very slightly different tones for each piece. This would be good for multiple panels on a model for KSP. Something like a maintenance or access panel could be very slightly different. A lot of this can be derived from a more-detailed mesh model. However it\u0027s done, the shadows in the texture will not always match the lighting.\u003C/p\u003E\u003Cp\u003EThere could be more detail but, for a game environment, you soon hit resolution limits. I made this at a large size, and scaled it down. Some specific detail was lost, but it\u0027s a sort of anti-aliasing effect.\u003C/p\u003E\u003Cp\u003E(In the gaming environment I made this for, some people started complaining that camouflage was cheating: they couldn\u0027t see my avatar at a distance. I just kept on shooting them.)\u003C/p\u003E\n"}]}