{"TopicId":114813,"ForumId":69,"TopicTitle":"Water effect bug found","CreatedByName":"Tricky14","CreatedById":145768,"CreatedDateTime":"2015-07-01T23:03:34Z","PageNum":1,"Articles":[{"CreatedByName":"Tricky14","CreatedById":145768,"CreatedDateTime":"2015-07-01T23:03:34Z","Content":"I created a little jet boat and slowly put it to water with the engine running. Right away, a couple dozen feet ahead of me, an \u0027invisible vertical rocket\u0027 started creating lots of steam effects right above the water:\n\n![n6QtdBR.jpg](http://i.imgur.com/n6QtdBR.jpg)\n\n![:confused:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif)\n\n- - - Updated - - -\n\nA better close-up. The effect looks great, but it doesn\u0027t look quite right considering the angle of thrust and the fact that it\u0027s way ahead of me.\n\n![vNFmIRg.jpg](http://i.imgur.com/vNFmIRg.jpg)"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2015-07-02T02:11:12Z","Content":"Are you using any add-ons? Also, a craft file, or picture of the craft, might help out to see what\u0027s going on.\n\nCheers,\n\n-Claw"},{"CreatedByName":"Tricky14","CreatedById":145768,"CreatedDateTime":"2015-07-02T09:47:03Z","Content":"No addons. I no longer have the craft, but I\u0027ll see if I can rebuild it from the picture.\n\n- - - Updated - - -\n\nWell I recreated it, but for some reason the phantom exhaust effect is no longer way ahead of the craft. It\u0027s still there though, wiggling around instead of staying in one location. It\u0027s still.. wrong, but not nearly as much so. It must be a minor detail in one of the parts that makes it appear so far ahead of the craft itself. \n\nthe craft file: [http://s000.tinyupload.com/index.php?file_id=09553919563668557943](http://s000.tinyupload.com/index.php?file_id=09553919563668557943)"},{"CreatedByName":"Yukon0009","CreatedById":109376,"CreatedDateTime":"2015-07-02T09:49:20Z","Content":"It\u0027s a small oversight by Squad, when you activate an engine horizontal on water the effects appear."},{"CreatedByName":"Tricky14","CreatedById":145768,"CreatedDateTime":"2015-07-03T16:14:27Z","Content":"Well, it\u0027s not just that it is horizontal, it\u0027s that the centerpoint was way off to where my ship even was. At least in the earlier version of that ship. I\u0027m still not sure which part made it shift so."},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-07-03T16:16:59Z","Content":"This is really likely to be a bug, I guess no one thought to add an \u0022if (over water);\u0022 condition, I\u0027m surprised more people have not seen this though, boats are quite popular in KSP."},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2015-07-03T22:13:05Z","Content":"I have seen this with my boats. Although the first time I read this post I didn\u0027t notice the boat in the second picture (or rather, I didn\u0027t see the second picture at all). I just haven\u0027t seen it that far away from the boat. You must have it at just the right angle that it\u0027s placed so far back. Although it does surprise me that the plume is so far behind the craft. I wouldn\u0027t have expected the exhaust to impact so far away.\n\nCheers,\n\n~Claw"}]}