{"TopicId":114842,"ForumId":55,"TopicTitle":"Heat Calculation - How much lag does thermal heat calculation create?","CreatedByName":"HafCoJoe","CreatedById":80363,"CreatedDateTime":"2015-07-02T05:27:40Z","PageNum":1,"Articles":[{"CreatedByName":"HafCoJoe","CreatedById":80363,"CreatedDateTime":"2015-07-02T05:27:40Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003ETake into note before replying or answering the poll that this is unrelated to how you \u003C/strong\u003E\u003Cem\u003E\u003Cstrong\u003Ethink\u003C/strong\u003E\u003C/em\u003E\u003Cstrong\u003E the lag in KSP should be, and please only answer if you are using the same graphical settings for comparing pre-release and post-release lag. I want accurate and opinionated data. Again, please leave all of your post release opinions out.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EI have been noticing considerably more lag after the 1.0 release and I am curious as to what features it is tied to and more specifically, if it is related to heat calculations. Is anyone else noticing lag or speculating that it may be related to heat generation? Please discuss below. And I would be very much grateful if a dev graced us with his presence. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Rep to he who does!\u003C/p\u003E\n"},{"CreatedByName":"Majorjim!","CreatedById":61954,"CreatedDateTime":"2015-07-02T11:53:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Avera9eJoe\u0022 data-cite=\u0022Avera9eJoe\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003ETake into note before replying or answering the poll that this is unrelated to how you \u003C/strong\u003E\u003Cem\u003E\u003Cstrong\u003Ethink\u003C/strong\u003E\u003C/em\u003E\u003Cstrong\u003E the lag in KSP should be, and please only answer if you are using the same graphical settings for comparing pre-release and post-release lag. I want accurate and opinionated data. Again, please leave all of your post release opinions out.\u003C/strong\u003E\u003Cp\u003EI have been noticing considerably more lag after the 1.0 release and I am curious as to what features it is tied to and more specifically, if it is related to heat calculations. Is anyone else noticing lag or speculating that it may be related to heat generation? Please discuss below. And I would be very much grateful if a dev graced us with his presence. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Rep to he who does!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E100% yes. I noticed it the very first time I launched after the update. A significant drop in performance associated with moving fast in the upper atmosphere. It could be tied to the heat system or too the atmospheric calculations I am not sure which. All I know is even a 250 part rocket will half the FPS on ascent..\u003C/p\u003E\u003Cp\u003E This issue really needs to be acknowledged and dealt with. Remember a lot of the new players wont know what KSP was like before the recent patches.\u003C/p\u003E\u003Cp\u003E Also I dont think there is any reason for a poll. It wont be accurate. The performance is lower in this version and it is a FACT.\u003C/p\u003E\u003Cp\u003E I have verified it with another KSP player. Anyone who replies, no in this poll will be doing so because either they are new players or they dont fly rockets or those that they do fly are low part count, or they simply don\u0027t notice it for what ever reason. It is there though.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-02T11:56:05Z\u0022 title=\u002207/02/2015 11:56  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 2, 2015\u003C/time\u003E by Majorjim\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Gaarst","CreatedById":126740,"CreatedDateTime":"2015-07-02T12:13:27Z","Content":"\n\u003Cp\u003EI do also have noticed more lag since 1.0, but I don\u0027t think it is linked to heat calculations, at least for me.\u003C/p\u003E\u003Cp\u003EMy PC is quite slow and I struggle having solid fps with most game. So, basically, I will notice anything using more CPU/creating lag.\u003C/p\u003E\u003Cp\u003EI don\u0027t see any difference when hanging around in interplanetary space, even when burning (when heat calculations are more important) as long as I do not look directly at a planet too close. Also, during reentry, even with convection/radiation/conduction calculations, I do not notice more lag than pre-1.0.\u003C/p\u003E\u003Cp\u003EOn the other hand, looking (eg) at Kerbin or the ground while in LKO or flying at any altitude will give me lag, same goes for smoke effects at launch (the latter just kills my fps down to 5 even for smaller rockets), and this happens keeping the same graphic settings as Beta and even Alpha.\u003C/p\u003E\u003Cp\u003EI did had similar lag spikes in Beta, but not as strong as in 1.0.x; so, IMO, yes 1.0 is more laggy than Beta, but no it is not due to heat calculations.\u003C/p\u003E\n"},{"CreatedByName":"LABHOUSE","CreatedById":107761,"CreatedDateTime":"2015-07-02T20:33:26Z","Content":"\n\u003Cp\u003EFairings cause more lag than heat.\u003C/p\u003E\u003Cp\u003ELag genorators from most to least\u003C/p\u003E\u003Cp\u003EFairings\u003C/p\u003E\u003Cp\u003EHeat\u003C/p\u003E\u003Cp\u003EDebris\u003C/p\u003E\u003Cp\u003EPart count\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2015-07-02T20:53:57Z","Content":"\n\u003Cp\u003EI didn\u0027t notice much of an effect from PF, do you know how PF compares to stock fairings?\u003C/p\u003E\n"},{"CreatedByName":"HafCoJoe","CreatedById":80363,"CreatedDateTime":"2015-07-02T20:58:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LABHOUSE\u0022 data-cite=\u0022LABHOUSE\u0022\u003E\u003Cdiv\u003EFairings cause more lag than heat.\u003Cp\u003ELag genorators from most to least\u003C/p\u003E\u003Cp\u003EFairings\u003C/p\u003E\u003Cp\u003EHeat\u003C/p\u003E\u003Cp\u003EDebris\u003C/p\u003E\u003Cp\u003EPart count\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHmm... Just curious, could it possibly be because of drag occlusion checking? I\u0027m wondering if the cargo bays and fuselages have the same lag issues. All hypothetical thinking though.\u003C/p\u003E\u003Cp\u003EAlso, if it isn\u0027t because of occlusion checking (it probably isn\u0027t), I wonder what else could be causing the fairings to lag.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-02T21:00:39Z\u0022 title=\u002207/02/2015 09:00  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 2, 2015\u003C/time\u003E by Avera9eJoe\u003C/strong\u003E\n\u003C/span\u003E\n"}]}