{"TopicId":114810,"ForumId":44,"TopicTitle":"The International Geophysical Year, 1957-1958","CreatedByName":"LitaAlto","CreatedById":110917,"CreatedDateTime":"2015-07-01T22:31:12Z","PageNum":1,"Articles":[{"CreatedByName":"LitaAlto","CreatedById":110917,"CreatedDateTime":"2015-07-01T22:31:12Z","Content":"\n\u003Cp\u003EToday marks the 58th anniversary of the International Geophysical Year, an 18-month period from July 1957 to December 1958, where scientists from 67 countries collaborated and shared data about the world and the space it occupies.\u003C/p\u003E\u003Cp\u003EAmong the space-oriented aspects of the IGY:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EThe launch of Sputnik 1, demonstrating the viability of artificial satellites;\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe launch of Explorer 1, which gathered the first evidence of the Van Allen radiation belts; and\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EMajor advances in our understanding of space weather--how solar activity ties into auroras and radio disruptions.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EOther noteworthy but not-necessarily-space-oriented achievements:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EThe mapping of the sea floor, revealing mid-oceanic trenches and confirming the reality of plate tectonics;\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe establishment of a permanent, non-military human presence in Antarctica, with multiple research stations providing a treasure trove of meteorological information;\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cem\u003EThe cooperation of the US and USSR in a joint endeavor, in the middle of Cold War tensions. \u003C/em\u003E(That last one is so huge in my mind that it deserves the italics.)\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EIt was the largest and most comprehensive scientific project of its time, and it had a profound impact on how the modern world evolved. Both NASA and NOAA, for example, owe a massive debt to the IGY.\u003C/p\u003E\u003Cp\u003EThere were numerous books and films created to document and analyze the IGY\u0027s results. Here\u0027s an archive of films, created by the US National Academy of Science, covering the gamut of research done--and in Flash format for your easy consumption!\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://lasp.colorado.edu/igy_nas/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://lasp.colorado.edu/igy_nas/\u003C/a\u003E\u003C/p\u003E\n"}]}