{"TopicId":114968,"ForumId":25,"TopicTitle":"BSC Redux - Stearwing D45 - We have a winner!","CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2015-07-03T17:07:53Z","PageNum":1,"Articles":[{"CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2015-07-03T17:07:53Z","Content":"The primary vote is done, you can check the result \n[over here.](http://civs.cs.cornell.edu/cgi-bin/results.pl?id=E_95f908df5cd1cc80)\nThe three winners will now compete in the final vote! The vote will run for three days.\n\n![qwo8AOZ.png?1](http://i.imgur.com/qwo8AOZ.png?1)\n\nPlease note, that the final vote is **not** anonymous!\n\n[**\u003E\u003EGet all .craft files in one .zip!\u003C\u003C**](http://www./download/efughus3qdz9vm4/BSC-Stearwing.rar)\n\n* * *\n\nConstruction phase is over - time to vote! The primary vote will run for 4 days. If you want to vote, pm me your email adress and you will get a link sent to you.\n\n(The email will be in german - I can\u0027t help it. Just click the long link and from then on everything should be english)\n\n![g4eKA1z.png](http://i.imgur.com/g4eKA1z.png)\n\n[**\u003E\u003EGet all .craft files in one .zip!\u003C\u003C**](http://www./download/efughus3qdz9vm4/BSC-Stearwing.rar)\n\n* * *\n\n![vmOu86Z.png](http://i.imgur.com/vmOu86Z.png)\n\n**Introduction**\n\nHey! I know...it has been some time. But maybe some of you still remember the [BSC-Challenges](https://forum.kerbalspaceprogram.com/threads/71015-BSC-Aeris-4a-AND-THE-WINNER-IS?p=994346#post994346). They were all the rage in this forum....like one and a half years ago. With the new aerodynamics I think the time has come for a Better Strock Craft Challenge Redux. \n\nLike last time you guys will have one week to build and one week to vote. I will probably split the voting-procedure in a 4-days primary vote, using a condorcet vote, followed by a 3 days final vote here in the forums. Other people will be able to see what you have voted for in the final vote. \n\n**If you want to vote in the primaries - you have to pm me your email-adress.**\n\n**I repeat: I need a pm with you email-adress if you want to vote in the primaries**\n\n**The Challenge**\n\nSo, what is the challenge? Well the veterans might remember: Since the quality of the stock craft that get delivered with KSP is often questionable, I challenge you to come up with something similar but better. Your craft is supposed to be a good craft for noobs that just bought KSP. \n\n**Please check the BSC:** [**Challenge Guidelines Mk.II**](https://forum.kerbalspaceprogram.com/entries/1086-BSC-Challenge-Guidelines-Mk-II)**- even if you just want to vote!** This is where I\u0027ve outsourced all the rules, legal stuff and design-goals.\n\n**How is this going to work?**\n\nYou will have 168 hours (7 days) to build you craft and post your entry here with at least one screenshot and its .craft file (only one .craft file is allowed). Also be so kind to drop us a few lines about your craft. What are your thoughts on the design? Why is it a good stock craft? Remember: A good sales pitch will often get you more votes. \n\nOnce submissions are closed, everyone who sent me their mail adresses via pm will receive a email with a personal link to the vote. Yes, it\u0027s annoying but this method has proved itself. Depending on the number of entries, we will probably first hold primary election, followed a final one. I would like to encourage you to write a few lines why you voted you that craft, as it keeps the thread fresh and we all have something to read while we wait for the votes.\n\n**What are we doing this time?**\n\nAs you allready know, we are doing the Stearwing D45 - the other spaceplane.\n\n![zyIv70N.png](http://i.imgur.com/zyIv70N.png)\n\nThe Stearwing D45 is a rather stange plane. While beeing a fun concept, it is rather hard to get it into space - you will need every drop of fuel. However, it carries several passengers and has a formidable set of science equipment. So basically I am looking for a spaceplane with a twist, that can show a noob was stange vehicles are possible in KSP: \n\n**Inspiration**\n\nWell, there are obviously no real life counterparts to the Stearwing. But there are \u0022one-and-a-half stage to orbit\u0022 spaceplanes like [SpaceShipOne](https://en.wikipedia.org/wiki/SpaceShipOne) and [Two](https://en.wikipedia.org/wiki/SpaceShipTwo). Well, they are only suborbital, we want a real space plane. Once again the Kerbals are ahead of us. The [Pegasus rocket](https://en.wikipedia.org/wiki/Pegasus_%28rocket%29) on the other hand is unmanned but is airlaunched and can get a small payload into LEO.\n\n![il6Fud8.png](http://i.imgur.com/il6Fud8.png)![XmhLYx1.png](http://i.imgur.com/XmhLYx1.png)![81vyPcx.png](http://i.imgur.com/81vyPcx.png)\n\n**Contenders**\n\n[Batz_10K - Stearwing D50](https://forum.kerbalspaceprogram.com/threads/127657-BSC-Redux-Stearwing-D45-Building-Phase?p=2070040\u0026viewfull=1#post2070040)\n\n[Jodo42 - Stearwing D45 v2](https://forum.kerbalspaceprogram.com/threads/127657-BSC-Redux-Stearwing-D45-Building-Phase?p=2064078\u0026viewfull=1#post2064078)\n\n[Kweller - GniwRaets](https://forum.kerbalspaceprogram.com/threads/127657-BSC-Redux-Stearwing-D45-Building-Phase?p=2069006\u0026viewfull=1#post2069006)\n\n[mrmcp1 - Stearwig D48](https://forum.kerbalspaceprogram.com/threads/127657-BSC-Redux-Stearwing-D45-Building-Phase?p=2069292\u0026viewfull=1#post2069292)\n\n[Rhomphaia - Stearwing D47b](https://forum.kerbalspaceprogram.com/threads/127657-BSC-Redux-Stearwing-D45-Building-Phase?p=2064474\u0026viewfull=1#post2064474)\n\n[t3hJimmer - Stearwing XL](https://forum.kerbalspaceprogram.com/threads/127657-BSC-Redux-Stearwing-D45-Building-Phase?p=2066256\u0026viewfull=1#post2066256)\n\n[Xeldrak - CRoBAR](https://forum.kerbalspaceprogram.com/threads/127657-BSC-Redux-Stearwing-D45-Building-Phase?p=2067400\u0026viewfull=1#post2067400)\n\nRegistered voters:\n\nRhomphaia, Jodo42, Xeldrak, Batz\\_10K, mrmcp1, vosechu\n\n**Edited \u003Ctime datetime=\u00222015-07-14T19:37:43Z\u0022 title=\u002207/14/2015 07:37  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 14, 2015\u003C/time\u003E by Xeldrak**"},{"CreatedByName":"Rhomphaia","CreatedById":2440,"CreatedDateTime":"2015-07-03T17:46:05Z","Content":"Good to see BSC back on."},{"CreatedByName":"JPmAn","CreatedById":121564,"CreatedDateTime":"2015-07-06T23:04:51Z","Content":"I like that this is coming back"},{"CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2015-07-06T23:35:50Z","Content":"Well, up till now the response is....reluctant ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)\n\nWe\u0027ll see if there will be a Vote. Otherwise I\u0027ll pronounce myself winner by default."},{"CreatedByName":"Jodo42","CreatedById":68895,"CreatedDateTime":"2015-07-07T03:22:44Z","Content":"Hey Xeldrak, glad to see these challenges are back! Here\u0027s my entry, the Stearwing D45 v2, or just \u0022V2\u0022 for short.\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/7li6W)\n\nCheck out the album in a new tab on imgur for full descriptions and full HD 1920\\*1080 screenshots!\n\nNote that the inclusion of KER data is purely to inform the reader more accurately of the ship\u0027s capabilities. The ship does not have a KER module on it, and is completely stock. The information provided by KER is in no way necessary to pilot the V2 to the fullest extent of its capabilities.\n\nI wanted to create a ship with the same basic appearance and function as the stock craft but with improved performance. To do this, I removed some frivolous bits from the original ship (ie RCS and the cargo bay\u0027s passenger seats) and stretched the fuselage. The wings were also reworked and canards were added to improve pitch authority in the stretched design. A vertical rudder was added, along with a materials lab and an atmospheric fluid experiment in the cargo bay.\n\nAdvantages over the stock ship include a simpler, less stressful ascent path, better in-orbit capabilities, more scientific equipment, constant power generation, and better control authority in atmospheric flight.\n\nDisadvantages are small: the ship lost its RCS system, docking port, and extra crew storage. Power output is slightly less than when the solar panels of the D45 are functioning as well. The V2 is not as compact as the original. \n\nThe craft is available for download [here](http://kerbalx.com/Jodo42/Stearwing-D45-v2). Thanks for considering my submission, everyone!\n\n**Edited \u003Ctime datetime=\u00222015-07-07T03:30:37Z\u0022 title=\u002207/07/2015 03:30  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 7, 2015\u003C/time\u003E by Jodo42**"},{"CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2015-07-07T04:12:25Z","Content":"Well, we have our first entry ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)"},{"CreatedByName":"Rhomphaia","CreatedById":2440,"CreatedDateTime":"2015-07-07T09:47:57Z","Content":"**Stearwing D47b**\n\nThe Stearwing D47 features a unique three-stage design: The first stage takes it up to the edge of the Stratoshphere at incredible speed. The second stage kicks in just after the turbines flame out, And provides a thrilling ride to near orbital speeds. The LV 909 rocket takes it from there out to space, with plenty of fuel for maneuvers.\n\nThe D47 carries a crew of 2 plus 4 passengers in a pressurized cabin, and comes complete with a belly mounted 1m docking port and monopropellant Reaction Control Systems\n\nAction Groups:\n\n1.Toggle Solar Panels\n\n2.Toggle Docking port shield\n\n3.Toggle Antenna\n\n4.Toggle Ladder\n\n![EckC3KL.png](http://i.imgur.com/EckC3KL.png)\n\n[Download](http://www./download/im4a82h74iaha0n/Stearwing_D47b.craft)\n\nMore pics and ascent profile coming soon."},{"CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2015-07-07T16:23:32Z","Content":"Well, at last enough participants for a vote ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif) Now we need more voters....\n\nInterestingly I worked on something very similar to the Stearwing D47b; using SRBs to get into orbit. It it didn\u0027t work as I intended"},{"CreatedByName":"Rhomphaia","CreatedById":2440,"CreatedDateTime":"2015-07-07T19:39:44Z","Content":"\u003E \n\u003E Well, at last enough participants for a vote ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif) Now we need more voters....\n\u003E Interestingly I worked on something very similar to the Stearwing D47b; using SRBs to get into orbit. It it didn\u0027t work as I intended\n\nI made the decision for SRB\u0027s early on, but I went through quite a few D46\u0027s before I got anything workable. Really have not spent much time with spaceplanes since 1.0 dropped. It took quite a bit of figuring out.\n\nThey are just too heavy, so unless you mount them forward (the 47a had the SRB exhausts just forward of the passenger cabin windows, would have been a spectacular sight for any BadS tourists flying), you need more wing to balance them, too much wing and the Airbreathers struggle with the increased drag. \n\nI was working on a more elegant solution without such an overpowered turbojet stage, but this was more spectacular and I was hoping another entry might encourage more participation."},{"CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2015-07-07T21:23:30Z","Content":"I\u0027m still working on my entry and I\u0027ve returned to the SRBs. I\u0027ve spend the last three hours balancing lift/drag/fuel and while I\u0027m not satisfied yet, I think I\u0027m getting somewhere."},{"CreatedByName":"Batz_10K","CreatedById":4992,"CreatedDateTime":"2015-07-07T23:01:46Z","Content":"I\u0027m trying the large carrier plane/recoverable booster approach...\n\n![26CcOEy.png](http://i.imgur.com/26CcOEy.png)"},{"CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2015-07-07T23:08:02Z","Content":"Well, that looks...insane o.O Can\u0027t wait to see the final product ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)"},{"CreatedByName":"t3hJimmer","CreatedById":145943,"CreatedDateTime":"2015-07-07T23:54:49Z","Content":"Can the stock Stearwing even make orbit in 1.0.4?\n\nI cant even get to space with it. maybe i\u0027m just bad at flying."},{"CreatedByName":"t3hJimmer","CreatedById":145943,"CreatedDateTime":"2015-07-08T03:11:22Z","Content":"Here\u0027s my submission: the **Stearwing XL** It\u0027s a little tame looking, but it\u0027s very noob friendly to fly. It has lots of fuel, big wings and control surfaces, and RAPIER engines.\n\n\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/hDO3prlnqoc?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\n\nThe Stearwing XL is a single stage to orbit (SSTO) space plane that carries a deployable satellite. It is powered by RAPIER engines that can operate as both jets and rockets. Getting to orbit is as easy as pointing the nose 25Ã‚Â° above the horizon (pull back until the orange marker on the navball is lined up with the 25 line) and firing the engines at 100% thrust. Once you achieve an apoapsis of 75km (The AP on the map view), power down and wait until you reach apoapsis. Burn prograde at apoapsis until your orbit is circularized.\n\nThe cargo bay can be operated using a right click or taping the 1-key.\n\nThe RAPIER engines will toggle to rocket mode automatically, and can be manually toggled between rocket and air mode using the 2-key.\n\n\\*\\*note\\*\\* the fuel on the satellite is locked, in order to fly the satellite, you have to right click on it\u0027s fuel tank and enable fuel and oxidizer use. Do this after the satellite is deployed.\n\nCraft File available here: [http://pastebin.com/EFhjLud2](http://pastebin.com/EFhjLud2)\n\n![WwEdJjS.png](http://i.imgur.com/WwEdJjS.png)\n\n**Edited \u003Ctime datetime=\u00222015-07-08T03:14:20Z\u0022 title=\u002207/08/2015 03:14  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 8, 2015\u003C/time\u003E by t3hJimmer**"},{"CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2015-07-08T18:59:45Z","Content":"I present my own entry, the **C**hem**R**ock S**o**lid **B**ooster **A**ssisted **R**ocket Plane, or:\n\n**CRoBAR**\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/ml8ye)\n\nI ditched the whole forward-swept wing idea and built the plane completely around the SRBs that are used to boost the plane into space once the jet engines flame out.\n\nThe CRoBAR has a cargo bay, a docking port, RCS system and solar panels, so it\u0027s quite versatile. \n\nDo not extend the solar panels while the bays are closed!\n\n\u003E \n\u003E ChemRock sOlid Booster Assisted Rocket Plane\n\u003E Action Groups:\n\u003E \n\u003E 1: Toggle Bays\n\u003E \n\u003E 2: Toggle Solar Panels\n\u003E \n\u003E 3: Toggle Mobility Enhancer\n\u003E \n\u003E Datasheet:\n\u003E \n\u003E Crew Capability: 6 Kerbals\n\u003E \n\u003E Mass: 41.12t\n\u003E \n\u003E Delta-V 4,761/5,699 m/s\n\nhttp://www./download/4ntf11f55ssa0pa/BSC\u002B-\u002BXeldrak\u002B-\u002BCRoBAR.craft\n\n**\u003E\u003EGet your CRoBAR here!\u003C\u003C**"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2015-07-08T19:11:42Z","Content":"Woah, okay. BSC is back at it. I got what, 48 hours to get something together? I have an idea."},{"CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2015-07-08T19:25:21Z","Content":"Yeah, you have about 48h left. Also don\u0027t forget to register for voting ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)"},{"CreatedByName":"burnoutforzai","CreatedById":93344,"CreatedDateTime":"2015-07-09T10:22:36Z","Content":"48hours! whoa. Started work on it."},{"CreatedByName":"JPmAn","CreatedById":121564,"CreatedDateTime":"2015-07-09T13:44:05Z","Content":"Will be a voter"},{"CreatedByName":"Feradose","CreatedById":111211,"CreatedDateTime":"2015-07-09T13:51:41Z","Content":"\u003E [Javascript is disabled. View full album](//imgur.com/a/B7CqB)\n\nWith this, I tried a weird, very draggy wing design unlike the original.\n\nAround 6 minutes to orbit, this thing has excess oxidiser, and I also forgot to remove the unused monopropellant.\n\nI am not the best pilot and someone could get better flights than me.\n\nNo electrical parts because its only meant to go to orbit with a small satellite and (return? without the satellite?)\n\nWhoops!\n\n[Craft file](https://mega.co.nz/#!c5VizKBK!R6kkLSRqMiQO6pL0ngJorYcmEPLOTeTL3KZoRfkFiKg)\n\n**Edited \u003Ctime datetime=\u00222015-07-09T16:19:12Z\u0022 title=\u002207/09/2015 04:19  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 9, 2015\u003C/time\u003E by Feradose**\n  \nForgot the link"},{"CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2015-07-09T15:19:24Z","Content":"If you want to take part in the competition Kweller, you need to make the .craft file available."},{"CreatedByName":"mrmcp1","CreatedById":79657,"CreatedDateTime":"2015-07-09T16:13:07Z","Content":"Here is my entry the Stearwig D48\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/4UDsD)\n\nIt is a small two stage science space plane capable of an 80x80km orbit. It has a full science complement and a disposable air engine stage. \n\nDownload link: [https://www.dropbox.com/s/skq7km67yf2vu6n/STEARWIG%20D48.craft?dl=0](https://www.dropbox.com/s/skq7km67yf2vu6n/STEARWIG%20D48.craft?dl=0)\n\nWarning do try not to use physics warp as it seems to overheat what ever is in the cargo bay."},{"CreatedByName":"Batz_10K","CreatedById":4992,"CreatedDateTime":"2015-07-09T22:31:48Z","Content":"After careful consideration of all of the guidelines in the Challenge guidelines Mk II, I have decided to ... Crumple them up, light them on fire and then throw them away completely.\n\nThis, then is the Stearwing D50, with fully recoverable booster stage. [craft](http://1drv.ms/1J6Re6A) [OneDrive]\n\n![M3Tt0i7.png](http://i.imgur.com/M3Tt0i7.png)\n\nThe orbiter component contains all of the wacky features of the original, including a deluxe economy-class sauna for 5 Kerbals (\\*re-entry only), not one, but two goo pods, way more RCS fuel and thrusters than you will ever need, a tiny amount of fuel, funky forward-swept wings, and business-class seating for 4\n\nThe transport component is just enough to get the orbiter into a 75x75km orbit, and land somewhere downrange.\n\n**Instructions**\n\nYou should probably read these, or there will be many explosions...\n\n**Takeoff**\n\n- Full throttle, then pull back (gently!) at 70m/s. Pitch up to 25 degrees. \n\n**Climb**\n\n- You can pretty much fly hands-off once you\u0027re at 25 degrees pitch. the ship will pitch up to 30 degrees or so as it climbs all the way to space. \n\n- At 15km, enable RCS\n\n- Once the speed starts to drop as the jets lose thrust, stage to activate the rhino. Then press 2 to shut down the jets, and 1 to close intakes (don\u0027t try to fly too long on jets at high altitude, that\u0027s asking for a spin...)\n\n- Note that you don\u0027t need to pitch up further\n\n- Once the Apoapsis reaches 75km, throttle down the Rhino. Set the SAS mode to \u0027Prograde\u0027 to reduce drag, and coast to the edge of the atmosphere.\n\n- About 10s from Apoapsis, throttle up the Rhino until you get to 2100m/sec\n\n**Separation**\n\n- At 2100ms, stage to separate the orbiter. \n\n- Unlock the fuel tank on the orbiter, and stage to eject the engine fairings (note: ensure that you have cleared the transport before ejecting the fairings, unless you want fireworks. well, they \\_usually\\_ don\u0027t do any damage to the transport....)\n\n- Throttle up and circularize the orbit.\n\n- Press \u0022[\u0022 or \u0022]\u0022 to switch back to the transport, and get ready for re-entry\n\n**Transport re-entry**\n\n- Transfer all remaining fuel from the rear-most tank (the one attached to the Rhino) to the front tank (the one attached to the shuttle cockpit)\n\n- Press 3 to deactivate the Rhino\n\n- Press 9 to activate 2 Jet engines for landing\n\n- Keep the nose between 10-20 degrees above prograde (ideally about 15) - note you\u0027ll glide for quite some time at about 30km. (it\u0027s actually possible to climb a bit too)\n\n- Deactivate RCS around 10km. \n\n- You should be somewhere over the large continent to the east of the KSC. Pick a reasonably smooth place for landing. Minimum flying speed is about 60-70ms. Careful on the manoeuvres, it\u0027s quite easy to spin when the fuel gets low. Flaps are on action group 5.\n\n**Stearwing re-entry**\n\n- This is a pretty normal spaceplane re-entry. Make sure it\u0027s not too steep, as there\u0027s lots of melty-explodey stuff on the Stearwing.\n\n- Use up the rest of that RCS fuel to maintain attitude during re-entry. 15 degrees seemed to work reasonably well.\n\n- This version has heavy-duty landing gear fitted, so it can tolerate some reasonably hard landings.\n\n**Action Groups**\n\n1 - Toggle intakes\n\n2 - Toggle jet engines\n\n3 - Toggle rhino\n\n5 - Toggle flaps\n\n9 - Toggle two jets only (enough to fly after re-entry, saves fuel)"},{"CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2015-07-10T10:47:15Z","Content":"Only ~6h left. If you want to participate - hurry up ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)"},{"CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2015-07-10T17:54:59Z","Content":"Construction phase is over - time to vote! The primary vote will run for 4 days. If you want to vote, pm me your email adress and you will get a link sent to you.\n\n(The email will be in german - I can\u0027t help it. Just click the long link and from then on everything should be english)\n\n![g4eKA1z.png](http://i.imgur.com/g4eKA1z.png)\n\n[**\u003E\u003EGet all .craft files in one .zip!\u003C\u003C**](http://www./download/efughus3qdz9vm4/BSC-Stearwing.rar)\n\n* * *"}]}