{"TopicId":115062,"ForumId":44,"TopicTitle":"How long can our infrastructure (water, electricity, etc) last in a zombie apocalypse?","CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-07-04T20:44:12Z","PageNum":1,"Articles":[{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-07-04T20:44:12Z","Content":"In the unlikely case of a zombie apocalypse, how long can we realistically expect things like water and electricity and perhaps even the internet to last without people around to take care of them? I mean, we have been able to automate certain functions to keep things running without a human to watch them all the time. Further more, some green technology like wind energy might be able to run on itself for a long time, right? \n\nSo can we have a realistic estimate of the time scale it takes for everything modern human society depend on to cease functioning?\n\nHours? Days? Weeks? Months? Years?\n\n**Edited \u003Ctime datetime=\u00222015-07-04T21:25:12Z\u0022 title=\u002207/04/2015 09:25  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 4, 2015\u003C/time\u003E by RainDreamer**"},{"CreatedByName":"victory143","CreatedById":80787,"CreatedDateTime":"2015-07-04T20:53:28Z","Content":"Power? Depends on where you live. If you live in France, you would have up to about 2 weeks of power, as their nuclear reactors run autonomously for a certain amount of time. The internet would die in the first few hours, as the amount of new posts and other stuff in the first hours would overload it."},{"CreatedByName":"HoloYolo","CreatedById":138353,"CreatedDateTime":"2015-07-04T22:07:30Z","Content":"Power depending on the population could last from a day to a week most likely. Water will last a LONG time. The internet will crash very fast do to everyone trying to tell everyone else that there\u0027s zombies. I can see a few days before mass panic. A few weeks and everyone will either be a zombie, dead from supply shortages or latching on to their armies and governments."},{"CreatedByName":"kiwi1960","CreatedById":81697,"CreatedDateTime":"2015-07-04T22:23:20Z","Content":"That depends what you mean by \u0022Zombie\u0022... Homeland Security in the US uses it as a \u0022cover all\u0022 for any disaster...\n\nSo... Asteroids crashing in the ocean causing Tsunamis is different from Asteroids crashing into land causing massive earthquakes.\n\nSo, its not an easy thing to answer.\n\nHowever, should Aliens ever invade, like in FALLING SKIES, then the first thing they would want to do is neutralise our technology. They would probably detonate thousands of EMP bombs in the upper atmosphere to kill ALL our tech, internet, cellphone, cars, power stations... anything with a silicon chip in it would be wiped clean.\n\nSo... the answer must be... it depends... anywhere from 1 second to ....depends on where you live."},{"CreatedByName":"Stargate525","CreatedById":53585,"CreatedDateTime":"2015-07-05T05:29:50Z","Content":"If we all just vanish? (By this I mean that there\u0027s no deliberate destruction of our infrastructure) For power, we\u0027ll last as long as the main supplier in your area stays online. It\u0027s most likely coal, and will most likely have a few days of fuel at most. After that, the demand placed on the grid being met by the paltry supply of wind and solar will probably bork the system completely.\n\nWater and sewer is most gravity-fed, so you\u0027ll have that for a good long while, and sewer even longer.\n\nInternet and television depends on power. Radio will go longer, as many of them have generators in case of emergency."},{"CreatedByName":"linkxsc","CreatedById":67350,"CreatedDateTime":"2015-07-05T05:36:55Z","Content":"My thoughts. Some areas your power would probably be dated for a few days (oil coal) or if you run off a dam primarily or wind orsuch, could last for years. Nuclear could be all over the place, though I doubt thered be any major rosk of meltdoqn (since most systems probably shut themselves off without some form of constant input)\n\nUtility water would probably be fine up until the backup generators at the water pumping stations run out of fuel, or if you\u0027re like me with a well, however long I can get the power to run my pump.\n\nAnd the internet... it might flame up for a while, but assuming everyone died off in the course of a week, the internet would probably keep running in chunks as long as the various servers you are connecting to can keep getting power to run. Beyond that though, its probably useless after the first week. Just start some mass torrents of some books and videos about survival, building things, and skills, during the time that you can."},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-07-05T09:07:20Z","Content":"Hmm, since there will be a massive population drop following something like a zombie apocalypse, wouldn\u0027t that reduce the consumption as well? In that case, perhaps even the paltry amount that green energy gives might be able to sustain people for much longer?"},{"CreatedByName":"Ralathon","CreatedById":71537,"CreatedDateTime":"2015-07-05T09:55:31Z","Content":"\u003E \n\u003E Hmm, since there will be a massive population drop following something like a zombie apocalypse, wouldn\u0027t that reduce the consumption as well? In that case, perhaps even the paltry amount that green energy gives might be able to sustain people for much longer?\n\nDead people usually aren\u0027t polite enough to switch off their electrical appliances before keeling over. So consumption wouldn\u0027t drop by much."},{"CreatedByName":"randomness5555","CreatedById":53367,"CreatedDateTime":"2015-07-05T10:03:38Z","Content":"Maybe... but it depends on how much stuff is still trying to use power, because if all the high drain machines and such in factories and the like are still trying to run they would drain all the power pretty quick"},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2015-07-05T14:29:08Z","Content":"only days, depending how fast the zombie apocalypse spread.\n\nIf there is nobody to balance charges of all different energy sources plus the lack of power needed by the people who is dead and all factories or works that are not active, then your power lines overload and burn.\n\nSo to resume, in any caos situation, cities fall pretty fast."},{"CreatedByName":"-Velocity-","CreatedById":74097,"CreatedDateTime":"2015-07-05T16:34:16Z","Content":"Whoever thought up the whole zombie apocalypse scenario has obviously never seen an animal decay. Especially in a hot (humidity may help too) environment, nature aggressively attacks an animal body once its defenses drop, it only takes a few days to a week or so before structural integrity starts to completely fail, depending on the size of the animal. I am baffled that you would even consider a zombie apocalypse an \u0022unlikely\u0022 possibility. It does not rate that high.\n\n**Edited \u003Ctime datetime=\u00222015-07-05T16:37:02Z\u0022 title=\u002207/05/2015 04:37  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 5, 2015\u003C/time\u003E by |Velocity|**"},{"CreatedByName":"SomeGuy12","CreatedById":103022,"CreatedDateTime":"2015-07-05T18:10:47Z","Content":"\u003E \n\u003E Whoever thought up the whole zombie apocalypse scenario has obviously never seen an animal decay. Especially in a hot (humidity may help too) environment, nature aggressively attacks an animal body once its defenses drop, it only takes a few days to a week or so before structural integrity starts to completely fail, depending on the size of the animal. I am baffled that you would even consider a zombie apocalypse an \u0022unlikely\u0022 possibility. It does not rate that high.\n\nMost Zombie fiction, including The Walking Dead and World War Z, require \u0022magical\u0022 zombies. These zombies are animated by literal magic - some type of unknown, malevolent force animates them and allows them to violate laws of biology.\n\nNow, one might ask, if some malevolent force - you could theoretically posit \u0022hostile nanotechnology\u0022, aka tiny robots that are preventing the \u0022undead\u0022 tissue from decaying too far and allowing it to move - can animate the dead, why does it need to kill people slowly via bites? Pretty much the same technology could - through magic or tiny robots - kill everyone on the entire earth simultaneously by synthesizing a small amount of botulinum toxin in their body. Everyone would just fall over, unable to breathe, at the same time, and 5 minutes or so later, everyone on earth would be dead."},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-07-05T18:11:20Z","Content":"\u003E \n\u003E Whoever thought up the whole zombie apocalypse scenario has obviously never seen an animal decay. Especially in a hot (humidity may help too) environment, nature aggressively attacks an animal body once its defenses drop, it only takes a few days to a week or so before structural integrity starts to completely fail, depending on the size of the animal. I am baffled that you would even consider a zombie apocalypse an \u0022unlikely\u0022 possibility. It does not rate that high.\n\nDepending on the lore, zombies can simply be rabid human infected by a parasite/virus/something attacking their brains, causing them to lose higher control, pain response, and just want to bite others. So not necessarily dead people, just crazy ones, and that might be possible. But we are here to discuss what might happen to our infrastructure in a scenario where only humans are affected by some disruptive event that does not harm the infrastructure. Any kind of biological attack and such also counts where lots of people die, but everything else is unharmed."},{"CreatedByName":"Brethern","CreatedById":15602,"CreatedDateTime":"2015-07-05T20:11:58Z","Content":"\u003E \n\u003E Whoever thought up the whole zombie apocalypse scenario has obviously never seen an animal decay. Especially in a hot (humidity may help too) environment, nature aggressively attacks an animal body once its defenses drop, it only takes a few days to a week or so before structural integrity starts to completely fail, depending on the size of the animal. I am baffled that you would even consider a zombie apocalypse an \u0022unlikely\u0022 possibility. It does not rate that high.\n\nThe zombie survival guide does cover this by the way. The virus that creates the zombies is 100% lethal to all species, so animals, insects and bacterial responsible for decomposing all die. So only elements are left to decompose them."},{"CreatedByName":"kiwi1960","CreatedById":81697,"CreatedDateTime":"2015-07-05T20:58:41Z","Content":"A \u0022real\u0022 Zombie might happen though, call them the living dead, they are alive, but their brains are rotting, with a desire to eat, but not intelligent enough to cook a meal. \n\nThey would then seen humans as food ... \n\nA few cases of autopsies, or even living beings on operating tables, have had their insides cut open and a sickening smell causing an evacuation of the said room. This smell has never been identified but smells so bad, doctors have vomited in their masks.\n\nHow could such a creature be made? Simple answer, take a look at the crap Monsanto is making...."},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-07-05T22:13:46Z","Content":"Lets stop here about zombie before we go even more off the track on discussing about what makes a zombie . I know some people will have something to say about the posts that has been made, but that is perhaps better being a seperate post for in depth discussion. I am only interested in what happens to the infrastructure at the moment since I just found a game called project zomboid and was wondering how long should I set water and electricity to last in the game."},{"CreatedByName":"kiwi1960","CreatedById":81697,"CreatedDateTime":"2015-07-06T09:12:58Z","Content":"Hmmm.... That would depend on where you are located in the game, I mean, if India, then 1 day for everything to stop... USA.... power, maybe a week, water, 6 weeks, internet 2 days... cellphone coverage.. that would depend on how reliable the towers are... phones... overhead phone lines or underground? \n\nIn fact, it would depend on many random factors, where you are EXACTLY in the game ... a car could have crashed into a substation and knocked out power for your entire district (County I think you call them) or not.... there is no set way to work this out, except two... an IDEAL situation, or WORST CASE SCENARIO..... (or even a combination of both. You may not have power from day one which means unless you have a laptop or a phone charger, the internet will be of very little help to you)"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-07-06T10:34:14Z","Content":"If you really want the specifics, the game is set in [Knox County](http://pzwiki.net/wiki/Knox_County), Kentucky, USA. And I would prefer an ideal scenario where no major damage happened to the infrastructure during the chaos.\n\nThough I still think like, a general estimation of a developed country infrastructure is better for this purpose, because they depend more on these modern conveniences."},{"CreatedByName":"AndyMt","CreatedById":123144,"CreatedDateTime":"2015-07-06T11:01:32Z","Content":"There was a (fictional) documentary a few years ago about this topic (\u0022Life after people\u0022):\n\n[http://topdocumentaryfilms.com/life-after-people/](https://topdocumentaryfilms.com/life-after-people/)\n\nVery interesting. Although after 2 or 3 episodes I got kind of depressed... \n\nSo basically according to their research most (electrical) power infrastructure won\u0027t last longer than days or weeks. Water the longest, but even that only months."},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2015-07-06T13:17:50Z","Content":"Is like I said.. there is not way to balance loads (energy production and consumption) in a place with chaos.\n\nAlso my brother works on this, he is an electrical engineer.\n\n**Edited \u003Ctime datetime=\u00222015-07-06T13:28:54Z\u0022 title=\u002207/06/2015 01:28  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 6, 2015\u003C/time\u003E by AngelLestat**"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-07-06T14:14:55Z","Content":"\u003E \n\u003E The virus that creates the zombies is 100% lethal to all species, so animals, insects and bacterial responsible for decomposing all die. So only elements are left to decompose them.\n\nWhich is also completely impossible due to genetic code differences, transcription factor differences, surface receptor differences, etc...\n\nSo.... back to magic that violate the \u0022laws\u0022 of biology."},{"CreatedByName":"peadar1987","CreatedById":81207,"CreatedDateTime":"2015-07-06T15:23:37Z","Content":"Water system would last for decades, as it is generally gravity fed from a huge number of reservoirs, although many places would start to run into trouble as pipes eventually corrode and burst with nobody to replace them. The power grid would fail as soon as it wasn\u0027t being actively controlled by people.\n\nThat said, one of the best places to be during a zombie apocalypse would probably be a power plant, especially a nuclear one. Multiple redundant sources of power, access to water, food on site, usually far from civilisation, and those places are fortresses. You\u0027re not getting anywhere near one if the people inside don\u0027t want you there.\n\nTo be honest, if there was a zombie outbreak, all I\u0027d do is stockpile as much food as I could, fill every container in my flat, and the bath, with water, and wait it out. It\u0027s a top floor flat with security doors into the close, so all I have to do is hope the zombies starve before I do."},{"CreatedByName":"Wesreidau","CreatedById":75430,"CreatedDateTime":"2015-07-06T16:16:19Z","Content":"The water system in a large part of the United States, and I would imagine most areas away from steep elevation changes, is electrically-driven. Water is pumped from the aquifer or lake through whatever treatment measures are in place, then elevated into a water tower. That tower then provides constant pressure for the lines out of it. If you take away electrical power, the system will fail when the tower empties.\n\nIn case of a zombie apocalypse I\u0027m getting my gun, putting the wife and kids in the SUV, and taking country roads until I\u0027m in Hoosier National Forest. It would be like a vacation. Good luck, flatlanders."},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-07-06T16:23:19Z","Content":"Soo the concensus is about days for electricity, but months for water?"},{"CreatedByName":"peadar1987","CreatedById":81207,"CreatedDateTime":"2015-07-06T16:43:48Z","Content":"\u003E \n\u003E Soo the concensus is about days for electricity, but months for water?\n\nDepends where you are, and how you get your water. If water is supplied by electrical pumps, you lose supply soon after the power goes out.\n\nOf course, if only a few people are infected, and the infection is spread by biting, secure areas like power stations and network control hubs are going to be among the last places to fall. They are usually specifically designed to defend against terrorists and other undesirables bursting in and wrecking the place."}]}