{"TopicId":115071,"ForumId":46,"TopicTitle":"On The Subject Of Reputation.","CreatedByName":"BagelRabbit","CreatedById":95028,"CreatedDateTime":"2015-07-04T22:31:19Z","PageNum":1,"Articles":[{"CreatedByName":"BagelRabbit","CreatedById":95028,"CreatedDateTime":"2015-07-04T22:31:19Z","Content":"\n\u003Cp\u003EHello, ladies and gentlekerbs! I\u0027m UpsilonAeropace.\u003C/p\u003E\u003Cp\u003EAs you\u0027ve probably seen, the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/127476-Say-Hello-to-the-White-Bar-Group%21\u0022 rel=\u0022external nofollow\u0022\u003EWhite Bar Group\u003C/a\u003E has recently been approaching two dozen members, including many that were previously in the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/95623-Say-Hello-to-the-Light-Green-Group%21\u0022 rel=\u0022external nofollow\u0022\u003ELight-Green Group\u003C/a\u003E. Personally, I\u0027m not a fan of the White Bar Group: it seems like it will be no more than a silly passing fad for most. It does, however, bring up an interesting question:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:24px;\u0022\u003E\u003Cspan style=\u0022font-family:Georgia;\u0022\u003E\u003Cspan style=\u0022color:#008000;\u0022\u003EShould the Reputation System Exist At All?\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E~~~\u003C/p\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThis is actually quite a complicated issue, and one that merits some further attention. So please excuse the following ramblings \u003Cspan style=\u0022font-size:8px;\u0022\u003E(I\u0027m very tired)\u003C/span\u003E as I discuss what the Reputation system is and how it affects the community.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cp\u003E~~~\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Georgia;\u0022\u003EWhat is Reputation?\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EAccording to the official Forum page on Reputation:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KasperVld\u0022 data-cite=\u0022KasperVld\u0022\u003E\u003Cdiv\u003EThe reputation allows you to give a compliment to other users who have made a quality post or have helped you. Giving a reputation point is generally considered a nice gesture.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt seems that Reputation is what you get when a person enjoys a post you made enough to click the little black star-shaped button. People with a lot of Reputation have made plenty of posts that many people enjoy (or helped lots of people). The posts may be in the Fanworks, in the modding subforum, on the Spacecraft Exchange, or on General Discussions, but the premise remains the same. \u003Cem\u003EIt\u0027s really as simple as that.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cp\u003E~~~\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Georgia;\u0022\u003ESo, what benefits does Reputation have?\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EI can think of two. One, however, is a double-edged sword.\u003C/p\u003E\u003Cp\u003EOne of the benefits of Reputation is that it does provide new Forum-goers with a general sense of who is respected within the community. The only other basic statistics gleaned from someone\u0027s post is their join date and their number of posts. Neither of these do quite as good a job of indicating a person\u0027s status as Reputation does, in my opinion. I don\u0027t think you would disagree.\u003C/p\u003E\u003Cp\u003EWhen I first started the Light-Green Group in October of last year, it seems as if there was a strong correlation between respectability and Reputation. Over the course of the last year, this correlation has weakened. Perhaps this is because of reasons I\u0027ll discuss in a bit.\u003C/p\u003E\u003Cp\u003EThe other reason is that it\u0027s nice to receive Reputation. It makes everyone smile a bit. This reason, however, actually may have negative consequences for our Forum.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cp\u003E~~~\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Georgia;\u0022\u003EWhy would Reputation be a bad thing?\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ll start off with the other edge of the double-edged sword that I mentioned earlier. People really enjoy getting Reputation... but sometimes, this positive feedback can lead to negative consequences! Some people have gained Reputation by posting acerbic criticism of SQUAD or (shudder) other Forum-goers. The latter doesn\u0027t happen very often, but I\u0027ve seen it happen to others and had it happen to myself; the former has run increasingly rampant over the past several months. Giving positive feedback for doing negative* things really isn\u0027t great.\u003C/p\u003E\u003Cp\u003ETo clarify: \u003Cstrong\u003EI know that the reputation system isn\u0027t causing people to bash SQUAD or anyone else.\u003C/strong\u003E SQUAD has made mistakes and trolls exist, and there\u0027s nothing anyone can do about that. I am, however, saying that giving a \u0027reward\u0027 for being scathingly critical encourages the process to continue. It also makes highly critical people seem more reputable in the minds of some Forum-goers. In short, while Reputation isn\u0027t the cause of such behavior, it does play a role in allowing it to flourish.\u003C/p\u003E\u003Cp\u003EThere are other negative consequences to the Reputation system as well: people can, for example, try to speak with authority on matters that they don\u0027t know enough about and be lent a bit of false credibility by their Reputation levels. \u003Cspan style=\u0022font-size:8px;\u0022\u003E(Perhaps that\u0027s what I\u0027m doing right now!)\u003C/span\u003E There\u0027s also some people out there who want Reputation enough to post their good ideas and craft in far too many places on the Forum, practically spamming the system. Finally, there are threads that exist for the sole purpose of asking for Reputation; I fear the Light-Green Group may fall into this category, and I can\u0027t say that I\u0027ve been above asking for Reputation myself. All of these problems are threats to idea of Reputation as it stands, though the first one certainly has the biggest potential to negatively affect the Forum.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E*I\u0027m just going to put this out there: some people have crossed the line between \u0027constructive criticism\u0027 of SQUAD and \u0027bullying.\u0027 The former is \u003C/span\u003E\u003Cem\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003Eabsolutely\u003C/span\u003E\u003C/em\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E needed in this Forum, but the latter is both intolerable and frequently rewarded by the Reputation system. Different people draw the lines in different places, but some of the snark and bile I\u0027ve seen on the Forum is inexcusable... and it is often rewarded with some handsome Reputation as well.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cp\u003E~~~\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Georgia;\u0022\u003EIs there a way to circumvent this problem?\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ESure! It\u0027s quite simple.\u003C/p\u003E\u003Cp\u003EOne thing to do is stop giving Reputation to people who are being scathingly critical of SQUAD, instead diverting it to people who post constructive criticism or who are otherwise being helpful. I want to link here to Deddly\u0027s \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/111773-The-Positive-Forum-movement\u0022 rel=\u0022external nofollow\u0022\u003EPositive Forum Movement\u003C/a\u003E; it does a pretty good job recommending the same general plan laid out here. \u003C/p\u003E\u003Cp\u003EThe problem is, while many people posted on Deddly\u0027s thread saying that they would try to be nicer, the balance of the Forum \u003Cem\u003Estill\u003C/em\u003E shifted strongly into the negative after the release of 1.0, and a great many chunks of Reputation still went to people claiming that the game was broken and that SQUAD had done an awful job with the new update. Even today, the Forum is still not as cheerful a place as it was a scant six months ago... could this be due, in part, to the distribution of Reputation? Maybe.\u003C/p\u003E\u003Cp\u003EOh, and it would also be nice to only give Reputation to people who have made a worthy post in general. Sadly, I\u0027ve created a thread or two that asked people to deliver Reputation just for the heck of it. I really regret doing that - it\u0027s further eroded the Reputation system - but hindsight is 20/20, unfortunately.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cp\u003E~~~\u003C/p\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ESo, addressing the original question:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:Georgia;\u0022\u003EShould the Reputation System exist at all?\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EI personally like the Reputation system. Maybe that\u0027s because I have more Reputation than most people on the Forum, or maybe it\u0027s because I know it\u0027s great to get rewarded for the cool stuff people create. \u003Cstrong\u003EBut I feel as if people should know that Reputation is not as important as some may think.\u003C/strong\u003E There are many reasons for this, and perhaps if people did not place this system in such high regard, they would be a tiny bit less critical. It\u0027s funny to be saying that a system originally designed to be spreading niceness and encouraging positive, constructive ideas now seems to be doing the exact opposite...\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ESo, in short, I would make it clear somehow that Reputation is a very worthy thing to give and receive, but that it\u0027s not worth the emphasis that some place on it.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m sure you have some good ideas of how to change the current Reputation situation.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cp\u003E~~~\u003C/p\u003E\u003C/div\u003E\u003Cp\u003E \u003C/p\u003E\u003Cp\u003EPardon my rambling. I just realized that this was a \u003Cem\u003Ereally\u003C/em\u003E long post! I think I\u0027m done now. Thanks for reading this thread. I look forward to your discussion (please keep it rational and civil, as always).\u003C/p\u003E\u003Cp\u003E-Upsilon\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-08T12:50:46Z\u0022 title=\u002207/08/2015 12:50  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 8, 2015\u003C/time\u003E by UpsilonAerospace\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"HoloYolo","CreatedById":138353,"CreatedDateTime":"2015-07-04T22:41:48Z","Content":"\n\u003Cp\u003ERep should only be for the nice and helpful people IMO.\u003C/p\u003E\n"},{"CreatedByName":"AlphaAsh","CreatedById":105348,"CreatedDateTime":"2015-07-04T22:43:18Z","Content":"\n\u003Cp\u003EHonestly chap, you\u0027re worrying too much about something that really doesn\u0027t matter. Step back, step away. There\u0027s more important things.\u003C/p\u003E\u003Cp\u003EI pretty much disagree with most of your concerns and observations.\u003C/p\u003E\n"},{"CreatedByName":"Robotengineer","CreatedById":104525,"CreatedDateTime":"2015-07-04T22:51:21Z","Content":"\n\u003Cp\u003EGuilty as charged. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003Cem\u003EI think...\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EExhibit A.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Robotengineer\u0022 data-cite=\u0022Robotengineer\u0022\u003E\u003Cdiv\u003ESomething new that they can\u0027t talk about. Brace yourselves... ...to be disappointed.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe above is from the 6/26/15 Squadcast summary thread, in response to news that KasperVld had something he couldn\u0027t talk about. I received 5 reputation comments from that one post. Sure, the above post is sarcastic, but it is not baseless or excruciatingly mean. (Atleast, IMSBO (In My Somewhat Biased Opinion)) Is the above acerbic criticism?\u003C/p\u003E\u003Cp\u003EExhibit B.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Robotengineer\u0022 data-cite=\u0022Robotengineer\u0022\u003E\u003Cdiv\u003EMajority of the Kommunity: We want clouds!\u003Cp\u003E1 or 2 dudes: We want a PS4 port!\u003C/p\u003E\u003Cp\u003EFewer people need to ask for clouds. Or ask for them where those one or two dudes asked for a PS4 port.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFrom the \u00221.0 and Beyond... Where are the clouds?\u0022 thread. Like exhibit A, this comment is critical, snarky and not entirely baseless*. Is \u003Cem\u003Eit\u003C/em\u003E acerbic criticism?\u003C/p\u003E\u003Cp\u003EIs this the sort of acerbic criticism that can be harmful? \u003C/p\u003E\u003Cp\u003EAm I too snarky at times? Yes. Do I do it for the rep? Maybe... \u003C/p\u003E\u003Cp\u003E*When KSP4PS4 was announced, I googled around a moment and could only find one request for a PS4 port, on a (or the) PS4 forum.\u003C/p\u003E\n"},{"CreatedByName":"11of10","CreatedById":90592,"CreatedDateTime":"2015-07-04T23:21:39Z","Content":"\n\u003Cp\u003EHow about having different types of reputation? Green for people who help newbies get their rockets into space, blue for people who help with technical issues (windows/mac/linux/hardware stuff), red for people who post constructive criticism to the game, gold for modders, purple for folks who design cool stuff (all stock submarine? Oh my!).\u003C/p\u003E\u003Cp\u003ESo when you want to add rep to someone, forum asks you what is the reputation for? \u003C/p\u003E\u003Cp\u003ECan this even be implemented, or would it just complicate things too much?\u003C/p\u003E\u003Cp\u003EAlso, give semi custom titles to folks, to go with the rep. I imagine more than a few folks would warrant \u0022The Chief designer\u0022, for instance \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Mad Rocket Scientist","CreatedById":139256,"CreatedDateTime":"2015-07-04T23:34:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u002211of10\u0022 data-cite=\u002211of10\u0022\u003E\u003Cdiv\u003EHow about having different types of reputation? Green for people who help newbies get their rockets into space, blue for people who help with technical issues (windows/mac/linux/hardware stuff), red for people who post constructive criticism to the game, gold for modders, purple for folks who design cool stuff (all stock submarine? Oh my!).\u003Cp\u003ESo when you want to add rep to someone, forum asks you what is the reputation for? \u003C/p\u003E\u003Cp\u003ECan this even be implemented, or would it just complicate things too much?\u003C/p\u003E\u003Cp\u003EAlso, give semi custom titles to folks, to go with the rep. I imagine more than a few folks would warrant \u0022The Chief designer\u0022, for instance \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOr, if a different bar of reputation showed up in different forums! So, since I barely got any rep in general, and none in say, add-on releases, in those places, people would only see the reputation garnered in those places! So rep fishing threads, which are mostly in kerbal network, would only give kerbal network rep, which would only show up there! It would be hard to switch over to this new mode, though.\u003C/p\u003E\n"},{"CreatedByName":"Zucal","CreatedById":139764,"CreatedDateTime":"2015-07-04T23:41:26Z","Content":"\n\u003Cp\u003EI suppose I should start this off by saying that reputation has evolved from an objective \u0022This is a good post\u0022 to \u0022I agree with this.\u0022 You may want people to only give reputation to those who are unceasingly nice and helpful, but reputation is really just a more restricted form of, say, an upvote on Reddit. If someone makes something cool, I\u0027ll give them rep. If someone says something helpful, I\u0027ll give them rep. But what if they say something snarky and sarcastic? if I find it funny, I\u0027ll give them rep.\u003C/p\u003E\u003Cp\u003EYou\u0027re asking for reputation to become an objective rating that is handed out according to specific criteria. In a forum with thousands of members, that\u0027s not really going to work \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Now thread ratings, that\u0027s something we should talk about getting rid of.\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2015-07-05T00:37:47Z","Content":"\n\u003Cp\u003EI think we should only give reputation to people who are owned by cats. They\u0027re the real victims here, living under the oppressive regime of the common housecat, and are the most likely to need to boost provided by seeing little green blips next to their names. If anything we should just give them rep every time their overlords force them to change the kitty litter.\u003C/p\u003E\u003Cp\u003E(This is a fairly common online-psychological issue, one that many communities have tried to fix and never found an adequate solution. Here, where rep buys nothing extra it\u0027s fairly meaningless. On sites where rep counts towards participation or voting power it\u0027s something to actually be concerned about.)\u003C/p\u003E\n"},{"CreatedByName":"basic.syntax","CreatedById":109920,"CreatedDateTime":"2015-07-05T01:17:43Z","Content":"\n\u003Cp\u003EThe EVE: Online forums studied this issue and decided on a pure \u0022like\u0022-only system - for individual posts. Anyone can see your total \u0022like\u0022 counter, similar to this forum\u0027s Rep count - but it\u0027s default-hidden. In that system, your name, post, and its total \u0022like\u0022 count, takes center stage. The white bar group is saying something similar: judge me based on the words in this post, not my green bars.\u003C/p\u003E\n"},{"CreatedByName":"windows_x_seven","CreatedById":112926,"CreatedDateTime":"2015-07-05T01:23:23Z","Content":"\n\u003Cp\u003ERep has both upsides and downsides, it can be used as a way of thanking someone but also as a way of discrimination (users with low amount of rep).\u003C/p\u003E\u003Cp\u003EBut, you can do what I did, just hide your rep. Nobody can tell if you have lots or none.\u003C/p\u003E\n"},{"CreatedByName":"DuoDex","CreatedById":107061,"CreatedDateTime":"2015-07-05T01:43:34Z","Content":"\n\u003Cp\u003EAre we supposed to take all of the recent rep nonsense seriously?\u003C/p\u003E\u003Cp\u003EIt\u0027s \u003Cem\u003Elittle green internet points\u003C/em\u003E. Get over yourselves.\u003C/p\u003E\u003Cp\u003E*continues frantically trying to gain rep*\u003C/p\u003E\u003Cp\u003EBut seriously, I\u0027m surprised people a) care enough to post about it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E can find more than a short sentence to say about it.\u003C/p\u003E\n"},{"CreatedByName":"BagelRabbit","CreatedById":95028,"CreatedDateTime":"2015-07-05T02:04:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kaboom!\u0022 data-cite=\u0022Kaboom!\u0022\u003E\u003Cdiv\u003ERep should only be for the nice and helpful people IMO.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, that\u0027s apparently what it was originally for... but that sentiment has changed.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AlphaAsh\u0022 data-cite=\u0022AlphaAsh\u0022\u003E\u003Cdiv\u003EHonestly chap, you\u0027re worrying too much about something that really doesn\u0027t matter. Step back, step away. There\u0027s more important things.\u003Cp\u003EI pretty much disagree with most of your concerns and observations.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMy point of this thread was \u0022It might be nice to care less about Reputation!\u0022 You\u0027re stating, \u0022It might be nice for you to care less about caring about Reputation!\u0022 If I stated that your beliefs don\u0027t change my perspective on this particular issue, I would be stating, \u0022It might be nice for you to care less about caring less about caring about Reputation!\u0022\u003C/p\u003E\u003Cp\u003EThat didn\u0027t really address your concerns, but I personally thought it was quite amusing.\u003C/p\u003E\u003Cp\u003EDisagreeing with my concerns, incidentally, is perfectly reasonable: looking back at this, I seem to have been quite irritable for some reason. I still think that all of the observations I made stand though.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Robotengineer\u0022 data-cite=\u0022Robotengineer\u0022\u003E\u003Cdiv\u003E*Shnip Shnap*\u003Cp\u003EAm I too snarky at times? Yes. Do I do it for the rep? Maybe...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAcerbic criticism is in the eye of the beholder*. Personally, I would state that your first statement doesn\u0027t strike me as constructive, only as criticism. Your second statement, however, does make a reasonable point. Neither of the statements, though, are quite as acerbic as some of the stuff I\u0027ve seen around here...\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E*This is a beautiful quote, looking back at it! Maybe regex could use it for something? /sarcasm\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u002211of10\u0022 data-cite=\u002211of10\u0022\u003E\u003Cdiv\u003EHow about having different types of reputation? Green for people who help newbies get their rockets into space, blue for people who help with technical issues (windows/mac/linux/hardware stuff), red for people who post constructive criticism to the game, gold for modders, purple for folks who design cool stuff (all stock submarine? Oh my!).\u003Cp\u003ESo when you want to add rep to someone, forum asks you what is the reputation for? \u003C/p\u003E\u003Cp\u003ECan this even be implemented, or would it just complicate things too much?\u003C/p\u003E\u003Cp\u003EAlso, give semi custom titles to folks, to go with the rep. I imagine more than a few folks would warrant \u0022The Chief designer\u0022, for instance \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mad Rocket Scientist\u0022 data-cite=\u0022Mad Rocket Scientist\u0022\u003E\u003Cdiv\u003EOr, if a different bar of reputation showed up in different forums! So, since I barely got any rep in general, and none in say, add-on releases, in those places, people would only see the reputation garnered in those places! So rep fishing threads, which are mostly in kerbal network, would only give kerbal network rep, which would only show up there! It would be hard to switch over to this new mode, though.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis would be really very neat. I don\u0027t know whether it would be possible to implement though, and it still wouldn\u0027t solve the entire \u0022People getting Reputation for bashing SQUAD\u0022 issue...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Zucal\u0022 data-cite=\u0022Zucal\u0022\u003E\u003Cdiv\u003EI suppose I should start this off by saying that reputation has evolved from an objective \u0022This is a good post\u0022 to \u0022I agree with this.\u0022 You may want people to only give reputation to those who are unceasingly nice and helpful, but reputation is really just a more restricted form of, say, an upvote on Reddit. If someone makes something cool, I\u0027ll give them rep. If someone says something helpful, I\u0027ll give them rep. But what if they say something snarky and sarcastic? if I find it funny, I\u0027ll give them rep.\u003Cp\u003EYou\u0027re asking for reputation to become an objective rating that is handed out according to specific criteria. In a forum with thousands of members, that\u0027s not really going to work \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Now thread ratings, that\u0027s something we should talk about getting rid of.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI suppose I don\u0027t see my plea as an objective rating. I could, for example, have stated that people should only \u002BRep posts with good grammar or something. Rather, I see my plea as attempting to reduce negativity in the community. That\u0027s a common goal that I\u0027m pretty sure everyone wants to work toward; I\u0027m providing a possible solution, and while it probably will be the equivalent of herding cats, it is worth a thought or two.\u003C/p\u003E\u003Cp\u003EI do agree that thread ratings are a little annoying though. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EOh, and speaking of cats!\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cydonian Monk\u0022 data-cite=\u0022Cydonian Monk\u0022\u003E\u003Cdiv\u003EI think we should only give reputation to people who are owned by cats. They\u0027re the real victims here, living under the oppressive regime of the common housecat, and are the most likely to need to boost provided by seeing little green blips next to their names. If anything we should just give them rep every time their overlords force them to change the kitty litter.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAmen.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E(This is a fairly common online-psychological issue, one that many communities have tried to fix and never found an adequate solution. Here, where rep buys nothing extra it\u0027s fairly meaningless. On sites where rep counts towards participation or voting power it\u0027s something to actually be concerned about.)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI would agree that if reputation actually counted for anything tangible, the situation would be a lot worse than it is right now... but that still doesn\u0027t mean we can\u0027t try to figure out a better way to do this entire Reputation system.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022basic.syntax\u0022 data-cite=\u0022basic.syntax\u0022\u003E\u003Cdiv\u003EThe EVE: Online forums studied this issue and decided on a pure \u0022like\u0022-only system - for individual posts. Anyone can see your total \u0022like\u0022 counter, similar to this forum\u0027s Rep count - but it\u0027s default-hidden. In that system, your name, post, and its total \u0022like\u0022 count, takes center stage. The white bar group is saying something similar: judge me based on the words in this post, not my green bars.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI know, but the White Bar Group is \u003Cem\u003Eruining\u003C/em\u003E the premise of the Light-Green Group! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EWith all due seriousness, I\u0027ve warmed considerably to the prospect of the White-Bar Group. I don\u0027t know if I\u0027ll join it though.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022windows_x_seven\u0022 data-cite=\u0022windows_x_seven\u0022\u003E\u003Cdiv\u003ERep has both upsides and downsides, it can be used as a way of thanking someone but also as a way of discrimination (users with low amount of rep).\u003Cp\u003EBut, you can do what I did, just hide your rep. Nobody can tell if you have lots or none.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOnce again, the White-Bar Group is certainly something to think about. I still know that there are definitely some people who enjoy the conventional Reputation system, which means that any changes would be difficult to make...\u003C/p\u003E\u003Cp\u003EOh, and a last-minute edit: DuoDex, to be fair, I am arguably the person who has spent the most time dealing with Reputation-related matters in the Kommunity, which means that I have agglomerated waaay too much to say! You don\u0027t have to read it if you don\u0027t want to though. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003E-Upsilon\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-05T02:06:47Z\u0022 title=\u002207/05/2015 02:06  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 5, 2015\u003C/time\u003E by UpsilonAerospace\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DuoDex","CreatedById":107061,"CreatedDateTime":"2015-07-05T02:14:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022UpsilonAerospace\u0022 data-cite=\u0022UpsilonAerospace\u0022\u003E\u003Cdiv\u003E-snip-\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd yet we have people who care about it enough to deal with it \u0027the most in the Kommunity\u0027. Silly green Internet points. \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FFFFFF;\u0022\u003E*drooling intensify*\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"Flymetothemun","CreatedById":17689,"CreatedDateTime":"2015-07-05T02:25:05Z","Content":"\n\u003Cp\u003EI could care less about reputation. I don\u0027t give two *****. In fact, if you gave me a vast quantity of *****, I wouldn\u0027t give any of them to the Rep system. I care more about the quality of the posts and writing in a person\u0027s piece rather than their reputation. I (at least) try to write posts that will accomplish the goal of being written well and with a clear, concise voice rather than posts that will accrue reputation points. If I see a post that I think is excellent, I\u0027ll remember the person\u0027s name, and when I see their name as the author of a post or comment I\u0027ll be more likely to read it than if I don\u0027t recognize their name. If I really like it I might give them a reputation point, but usually I\u0027ll give one to thank them without replying in the thread and thus cluttering it with something off-topic. If I canvass a thread and just look at the reputation bar, It\u0027s a crapshoot whether or not I\u0027ll like the post or comment.\u003C/p\u003E\u003Cp\u003EMy view is rep on \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Eany\u003C/span\u003E forum is just like Facebook friends. Some make a big game out of seeing who can accumulate the greatest amount, some don\u0027t ever want to accumulate any at all. Some think it\u0027s a great feature, Some think it\u0027s a horrible feature. Some have a little, some have a lot. Some use it usefully, some use it outrageously. But ultimately, it means absolutely nothing and is probably a waste of time.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-05T02:57:06Z\u0022 title=\u002207/05/2015 02:57  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 5, 2015\u003C/time\u003E by DuoDex\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"mythbusters844","CreatedById":72313,"CreatedDateTime":"2015-07-05T02:51:30Z","Content":"\n\u003Cp\u003EDisclaimer: My debate and criticism skills are mind-numbingly bad\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022UpsilonAerospace\u0022 data-cite=\u0022UpsilonAerospace\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EWhen I first started the Light-Green Group in October of last year, it seems as if there was a strong correlation between respectability and Reputation. Over the course of the last year, this correlation has weakened.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI wonder why... Sure, it might seem quite absurd at first to suggest your thread as one of the main causes of the what you described (rep inflation), but it makes sense if you realize that your it\u0027s the most viewed thread in the Kerbal Network subforum. It\u0027s plausible that the reason why rep has been devauled is because of your thread, along with the Green Iron Crown crap and the \u0022How Close are YOU to Your Next Reputation Rank?\u0022 thread. \u003C/p\u003E\u003Cp\u003EOr maybe because the forum\u0027s just aging and more and more people are getting rep and you\u0027re feeling jealous.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EBut I feel as if people should know that Reputation is not as important as some may think.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027re saying this as you\u0027re prominently advertising a thread you created specifically for the praise of those with high amounts of rep.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E...a great many chunks of Reputation still went to people claiming that the game was broken and that SQUAD had done an awful job with the new update....\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI know it\u0027s tough to realize other people have different opinions, but maybe it was because they agreed with their criticism?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ESQUAD has made mistakes and trolls exist\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou just implied that people who criticize Squad are trolls.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E*I\u0027m just going to put this out there: some people have crossed the line between \u0027constructive criticism\u0027 of SQUAD and \u0027bullying.\u0027 The former is absolutely needed in this Forum, but the latter is both intolerable and frequently rewarded by the Reputation system. Different people draw the lines in different places, but some of the snark and bile I\u0027ve seen on the Forum is inexcusable... and it is often rewarded with some handsome Reputation as well.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s only you that thinks harsh criticism of Squad is \u0022bullying\u0022. This harsh criticism is only because Squad hasn\u0027t listened to our criticism in the past, so we\u0027re resorting to harsher means in the hopes that they\u0027ll listen to us (which they aren\u0027t). It\u0027s also because of the fact that people warned Squad about the dangers of going to 1.0 and predicted what the finished product would be like, and when Squad pushed ahead and the product was indeed half-glassed and alpha-quality it resulted in this harsh criticism. Also, your last sentence suggests you\u0027re feeling less special with your high amount of rep and hints at the underlying reasons of why you made this thread.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EPerhaps that\u0027s what I\u0027m doing right now!)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EShould the Reputation System exist at all?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo\u003C/p\u003E\u003Cp\u003EI think you\u0027re just envious that a bunch of people are nearing you amount of rep, so you want the entire system removed or devauled to a miniscule point so that you don\u0027t have to worry about it anymore.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022basic.syntax\u0022 data-cite=\u0022basic.syntax\u0022\u003E\u003Cdiv\u003EThe EVE: Online forums studied this issue and decided on a pure \u0022like\u0022-only system - for individual posts. Anyone can see your total \u0022like\u0022 counter, similar to this forum\u0027s Rep count - but it\u0027s default-hidden. In that system, your name, post, and its total \u0022like\u0022 count, takes center stage. The white bar group is saying something similar: judge me based on the words in this post, not my green bars.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESeems like a better system.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Flymetothemun\u0022 data-cite=\u0022Flymetothemun\u0022\u003E\u003Cdiv\u003EI could care less about reputation. I don\u0027t give two *****. In fact, if you gave me a vast quantity of *****, I wouldn\u0027t give any of them to the Rep system. I care more about the quality of the posts and writing in a person\u0027s piece rather than their reputation. I (at least) try to write posts that will accomplish the goal of being written well and with a clear, concise voice rather than posts that will accrue reputation points. If I see a post that I think is excellent, I\u0027ll remember the person\u0027s name, and when I see their name as the author of a post or comment I\u0027ll be more likely to read it than if I don\u0027t recognize their name. If I really like it I might give them a reputation point, but usually I\u0027ll give one to thank them without replying in the thread and thus cluttering it with something off-topic. If I canvass a thread and just look at the reputation bar, It\u0027s a crapshoot whether or not I\u0027ll like the post or comment.\u003Cp\u003EMy view is rep on \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Eany\u003C/span\u003E forum is just like Facebook friends. Some make a big game out of seeing who can accumulate the greatest amount, some don\u0027t ever want to accumulate any at all. Some think it\u0027s a great feature, Some think it\u0027s a horrible feature. Some have a little, some have a lot. Some use it usefully, some use it outrageously. But ultimately, it means absolutely nothing and is probably a waste of time.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAgreed.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-06T16:49:51Z\u0022 title=\u002207/06/2015 04:49  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 6, 2015\u003C/time\u003E by Master Tao\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Robotengineer","CreatedById":104525,"CreatedDateTime":"2015-07-05T04:18:15Z","Content":"\n\u003Cp\u003EI would like to say I am on another forum that uses a like based system, and it works well. IMO, in the new version of the forum, the only change should be that posts should show who repped said post.\u003C/p\u003E\n"},{"CreatedByName":"technicalfool","CreatedById":70430,"CreatedDateTime":"2015-07-05T08:38:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Robotengineer\u0022 data-cite=\u0022Robotengineer\u0022\u003E\u003Cdiv\u003E the only change should be that posts should show who repped said post.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m sorry, but I consider this to be a profoundly bad idea. Inasmuch as a rep system exists, having it be anonymous is important in the same way as having an anonymous voting system is important.\u003C/p\u003E\u003Cp\u003EIf you know that by repping someone up, the fact you repped them becomes public knowledge, you may be discouraged from repping any post that goes \u0022against the herd\u0022, or may result in you being ostracised or harassed by your peers. It\u0027s this same thing that I don\u0027t doubt discourages people from voting in forum polls where the voters\u0027 names will be known.\u003C/p\u003E\u003Cp\u003EOf course, under the current system, people who are repped know who repped them; but, unless they tell the world about it, it doesn\u0027t become general knowledge.\u003C/p\u003E\n"},{"CreatedByName":"11of10","CreatedById":90592,"CreatedDateTime":"2015-07-05T18:49:53Z","Content":"\n\u003Cp\u003EWait, are you saying I shouldn\u0027t be able to see who gave you reputation?\u003C/p\u003E\n"},{"CreatedByName":"basic.syntax","CreatedById":109920,"CreatedDateTime":"2015-07-05T19:11:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u002211of10\u0022 data-cite=\u002211of10\u0022\u003E\u003Cdiv\u003EWait, are you saying I shouldn\u0027t be able to see who gave you reputation?\u003C/div\u003E\u003C/blockquote\u003EOther way around. Clicking to see names giving rep to a specific post, could lead to bad things.\n"},{"CreatedByName":"RAINCRAFTER","CreatedById":127524,"CreatedDateTime":"2015-07-05T19:14:56Z","Content":"\n\u003Cp\u003EHow about instead of rep, the mods can set a meter of how helpful you are?\u003C/p\u003E\u003Cp\u003E(Yeah, Constructive Criticism!)\u003C/p\u003E\n"},{"CreatedByName":"basic.syntax","CreatedById":109920,"CreatedDateTime":"2015-07-05T19:39:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RAINCRAFTER\u0022 data-cite=\u0022RAINCRAFTER\u0022\u003E\u003Cdiv\u003EHow about instead of rep, the mods can set a meter of how helpful you are?\u003Cp\u003E(Yeah, Constructive Criticism!)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003EI don\u0027t like the idea that Mods alone might be responsible for this meter (if that\u0027s your idea.) Could lead to accusations of favoritism. But, I think rep you get for helping someone in the Support categories - especially from the OP asking for help - would be very close to that goal.\n"},{"CreatedByName":"AlphaAsh","CreatedById":105348,"CreatedDateTime":"2015-07-05T20:45:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022UpsilonAerospace\u0022 data-cite=\u0022UpsilonAerospace\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EDisagreeing with my concerns, incidentally, is perfectly reasonable: looking back at this, I seem to have been quite irritable for some reason. I still think that all of the observations I made stand though.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAllow me to re-phrase since I was misunderstood. My observations on this matter\u003Cstrong\u003E differ \u003C/strong\u003Efrom yours. So \u0027disagree\u0027 wasn\u0027t the right word in this case.\u003C/p\u003E\u003Cp\u003EI am perfectly capable of assessing the value of a post without the poster\u0027s rep influencing that assessment. I like to believe that other readers are capable of the same. It doesn\u0027t take long frequenting forums like this to quickly learn that high rep can often mean \u0022spams alot\u0022 or \u0022actually posts insightfully and constructively.\u0022\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-07-06T02:48:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022technicalfool\u0022 data-cite=\u0022technicalfool\u0022\u003E\u003Cdiv\u003EOf course, under the current system, people who are repped know who repped them; but, unless they tell the world about it, it doesn\u0027t become general knowledge.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s not 100% correct, anyone can see the last 15 people to rep someone by viewing their profile (if they haven\u0027t disabled reputation display). Which can be fun when the person hasn\u0027t posted in years but still gets repped now and then. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Xacktar","CreatedById":88876,"CreatedDateTime":"2015-07-06T03:31:44Z","Content":"\n\u003Cp\u003EI like the rep system.\u003C/p\u003E\u003Cp\u003EI use them like thank you cards. I send you a little note saying \u003Cem\u003E\u0027Hey, you don\u0027t suck. Keep that up.\u0022\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EI will admit that I sometimes wish for \u003Ca href=\u0022http://i111.photobucket.com/albums/n146/yng_joe/Misc/HappyBunny/YouSuckAndThatsSad.gif\u0022 rel=\u0022external nofollow\u0022\u003Ethe opposite card\u003C/a\u003E to hand out on occasion, but I\u0027m well aware of \u003Ca href=\u0022http://www.reactiongifs.com/r/flmt1.gif\u0022 rel=\u0022external nofollow\u0022\u003Ewhy that doesn\u0027t exist\u003C/a\u003E. XD\u003C/p\u003E\u003Cp\u003EIn all honesty, I do like that we have a way to give someone a little boost for being helpful and funny. You don\u0027t always want to be the fifty-third person to say \u0027LOL\u0027 as a post response, the rep system gives us a way to say thanks without clogging the internet tubes.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-06T03:36:40Z\u0022 title=\u002207/06/2015 03:36  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 6, 2015\u003C/time\u003E by Xacktar\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-07-06T03:45:29Z","Content":"\n\u003Cp\u003EI hid my rep because I could. IIRC I was second or third on the forums when I did it. Really doesn\u0027t matter, it\u0027s just internet points and I still get repped and still give rep. Besides, the general trend is moving towards the upper bound and people just hand it out like candy. vOv\u003C/p\u003E\u003Cp\u003EE: BTW I actually liked EVE-O\u0027s scheme for post and total likes, worked really well. This forum\u0027s rep is pretty useless because you can\u0027t see what posts were repped. And no, Reddit\u0027s system is utter junk that merely reinforces the popular sentiment; far better to leave posts where they are so that a reader can make their own decision of worth while the conversation flows normally, in turn.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-06T03:51:02Z\u0022 title=\u002207/06/2015 03:51  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 6, 2015\u003C/time\u003E by regex\u003C/strong\u003E\n\u003C/span\u003E\n"}]}