{"TopicId":115118,"ForumId":32,"TopicTitle":"Question about save file modification","CreatedByName":"322997am","CreatedById":146422,"CreatedDateTime":"2015-07-05T16:26:21Z","PageNum":1,"Articles":[{"CreatedByName":"322997am","CreatedById":146422,"CreatedDateTime":"2015-07-05T16:26:21Z","Content":"\n\u003Cp\u003EI didn\u0027t put this in the mods section because this not really about mods. Save file modification is tacking an existing part and copying the file and pimping out the copied file. (Example: making a faster rover wheel with the same texture just cranking up the values.) do these parts break with updates like mods do?\u003C/p\u003E\n"},{"CreatedByName":"maltesh","CreatedById":17144,"CreatedDateTime":"2015-07-05T16:40:09Z","Content":"\n\u003Cp\u003EThat\u0027s really more part file modification than save file modification, which generally refers to editing the persistence.sfs or quicksave.sfs files. And typically, modifications to part files do not break with updates, unless the update changes the way the part works, or you\u0027ve changed the part to implement a feature of a mod that was broken by the update.\u003C/p\u003E\u003Cp\u003EThe Modulemanager mod is kind of made to allow you to make modifications to parts (and really, anything else that uses a .cfg file, such as agencies, strategies, etc.) without having to edit the original, if you are so inclined.\u003C/p\u003E\n"},{"CreatedByName":"SAI Peregrinus","CreatedById":125558,"CreatedDateTime":"2015-07-05T17:00:41Z","Content":"\n\u003Cp\u003EIf you modify the original part file, it will be overwritten when the game updates. (Unless you\u0027re smart and copied your game directory and modified the copy...)\u003C/p\u003E\u003Cp\u003EModuleManager makes it even easier, since it\u0027s designed to modify part files easily, and can let multiple mods change part files more easily.\u003C/p\u003E\n"},{"CreatedByName":"MLWostal","CreatedById":134330,"CreatedDateTime":"2015-07-06T02:16:57Z","Content":"\n\u003Cp\u003ESimpler yet and needing no additional installs:\u003C/p\u003E\u003Cp\u003EFind the part you want to mod, copy the folder for the part and paste it with a new name.\u003C/p\u003E\u003Cp\u003Eedit the .cfg file, changing the Name= line to be different from the original and modify the values you want.\u003C/p\u003E\u003Cp\u003EStart the game and you now have a second (wheel?) in your parts list with the modded values for use whenever/where ever you want and an update to the game does not overwrite your modded folder.\u003C/p\u003E\u003Cp\u003EThis works great for changing rocket motors to produce only smoke and no thrust. Fun for ground vehicles. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Xannari Ferrows","CreatedById":125369,"CreatedDateTime":"2015-07-06T02:35:12Z","Content":"\n\u003Cp\u003EIf you give it it\u0027s own storage sector, it will not be overwritten. Since the updates only pull and modify data from folders with target names, then anything extra will not be affected.\u003C/p\u003E\n"}]}