{"TopicId":115187,"ForumId":16,"TopicTitle":"What is the lightest part you can attach parts to?","CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-07-06T10:21:52Z","PageNum":1,"Articles":[{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-07-06T10:21:52Z","Content":"\n\u003Cp\u003EWhich part has the least weight, that is not physicless - you can attach other parts to it?\u003C/p\u003E\u003Cp\u003ECubic octagonal strut seems to be it but maybe I\u0027m missing something - is there another part, even lighter, that can act as a base for stuff to be dropped on drogue chutes, after detaching it from a separator?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-06T13:14:09Z\u0022 title=\u002207/06/2015 01:14  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 6, 2015\u003C/time\u003E by Sharpy\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Vagani","CreatedById":112067,"CreatedDateTime":"2015-07-06T10:24:20Z","Content":"\n\u003Cp\u003Eyou can sort parts by mass in the editor \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E I don\u0027t think there are any physicless parts anymore \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-07-06T10:32:38Z","Content":"\n\u003Cp\u003EThere\u0027s a plenty of parts you can\u0027t attach other parts to. For example, lights or anything science, or the solar panels - anything you try to attach to them just clips through to whatever is under them.\u003C/p\u003E\u003Cp\u003EThey may be \u0022physicful\u0022 once the craft is launched, but they are non-substantial in VAB/SPH.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-07-06T10:59:12Z","Content":"\n\u003Cp\u003EThe cubic octagonal strut is physicsless, but is probably the best for what you are describing.\u003C/p\u003E\n"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-07-06T11:07:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vagani\u0022 data-cite=\u0022Vagani\u0022\u003E\u003Cdiv\u003Eyou can sort parts by mass in the editor \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E I don\u0027t think there are any physicless parts anymore \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey are still in the game but that doesn\u0027t mean the same as in 0.9.\u003C/p\u003E\u003Cp\u003EIn 0.9, physicless parts had no mass and no drag, even if notified. The real mass of the ship wasn\u0027t the displayed mass in the VAB. So you should use radial batteries instead of inline ones because they were weight free.\u003C/p\u003E\u003Cp\u003EIn 1.0\u002B, physicless parts have no mass and no drag \u003Cstrong\u003Eon their own\u003C/strong\u003E. But they add them to their parent part. Mass and drag does add up, but to the parent part. Beware that they can heat and blow on their own.\u003C/p\u003E\u003Cp\u003EThe only advantage of using massless parts is that you don\u0027t have to apply symetry on them. Useful for landers. On that matter, more light weighted parts could be set to physicless.\u003C/p\u003E\n"},{"CreatedByName":"rofltehcat","CreatedById":145224,"CreatedDateTime":"2015-07-06T12:44:09Z","Content":"\n\u003Cp\u003EI\u0027m not entirely sure what you want to do with them but I like using small and 1.5 m nose cones to attach stuff. They even conduct fuel, so you can e.g. mount two engines radially or mount three Ant engines to a 1.5 m fuel tank. They are light, you can stick them everywhere, and they don\u0027t cause a lot of drag.\u003C/p\u003E\u003Cp\u003EOf course they weight more than cubic octo struts but you don\u0027t get those until pretty late in the stock tech tree (plut having struts everywhere looks even uglier than having cones everywhere).\u003C/p\u003E\n"},{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-07-06T12:49:09Z","Content":"\n\u003Cp\u003EThanks.\u003C/p\u003E\u003Cp\u003EThe KSC will have some celebration going tonight, after successful (mostly) Eve miniprobes landing. Multiple colorful lights in the sky. (Flea, okto, separator and a lot of the tiny struts with batteries, drogue chutes and multi-colored lights pointing both down and lighting up the parachutes.)\u003C/p\u003E\n"}]}