{"TopicId":115193,"ForumId":16,"TopicTitle":"Lab Data Question: Does Data capacity stack?","CreatedByName":"Duke Leto","CreatedById":142852,"CreatedDateTime":"2015-07-06T12:10:36Z","PageNum":1,"Articles":[{"CreatedByName":"Duke Leto","CreatedById":142852,"CreatedDateTime":"2015-07-06T12:10:36Z","Content":"\n\u003Cp\u003EI have a Science Lab with 500 data and a dozen Level 1 Kerbal Scientists processing it.\u003C/p\u003E\u003Cp\u003EThe speed at which they process this data into science is a daily percentage of the total data.\u003C/p\u003E\u003Cp\u003ESo is it capped at 500 or will sending up another lab to attach to the station raise the cap to 1000 data?\u003C/p\u003E\n"},{"CreatedByName":"Signo","CreatedById":103766,"CreatedDateTime":"2015-07-06T12:15:16Z","Content":"\n\u003Cp\u003EAs far as I know the 500 data storage limit is about a single lab. I never tried a double config tough.\u003C/p\u003E\n"},{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-07-06T12:27:36Z","Content":"\n\u003Cp\u003EI\u0027m almost sure you\u0027d be better off parking the other lab three kilometers away.\u003C/p\u003E\n"},{"CreatedByName":"Foxster","CreatedById":113764,"CreatedDateTime":"2015-07-06T16:08:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sharpy\u0022 data-cite=\u0022Sharpy\u0022\u003E\u003Cdiv\u003EI\u0027m almost sure you\u0027d be better off parking the other lab three kilometers away.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhy 3km?\u003C/p\u003E\n"},{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-07-06T16:23:34Z","Content":"\n\u003Cp\u003EMore than 2.2 at which they load together, which in connection with rest of the base and arriving of more complex crafts creates FPS issues. Close enough than a kerbal on EVA can transfer experiments from one to the other. Plus less Kraken-prone; leaving two crafts together in the same \u0022load zone\u0022 but not docked to each other may lead to unpleasant surprises. And benefits of having two labs instead of one.\u003C/p\u003E\u003Cp\u003EIf you leave them on the same orbit (identical altitude of periapsis and apoapsis) just one trailing the other by 3km, they will remain at that distance for a long, long time.\u003C/p\u003E\n"},{"CreatedByName":"Duke Leto","CreatedById":142852,"CreatedDateTime":"2015-07-06T21:43:23Z","Content":"\n\u003Cp\u003EInteresting idea, although that sounds even more exploity than what I was proposing. You probably should not be able to process the same data in two labs in different locations.\u003C/p\u003E\n"}]}