{"TopicId":115243,"ForumId":32,"TopicTitle":"MechJeb vs non MechJeb","CreatedByName":"322997am","CreatedById":146422,"CreatedDateTime":"2015-07-06T23:14:56Z","PageNum":9,"Articles":[{"CreatedByName":"Kagame","CreatedById":141304,"CreatedDateTime":"2015-07-09T14:50:33Z","Content":"\n\u003Cp\u003EMechJeb, even though I can do most of the stuff it does, save interplanetary transfers and Minmussing.\u003C/p\u003E\n"},{"CreatedByName":"Randazzo","CreatedById":136468,"CreatedDateTime":"2015-07-09T14:55:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lajoswinkler\u0022 data-cite=\u0022lajoswinkler\u0022\u003E\u003Cdiv\u003E...\u003Cstrong\u003E\u003Cem\u003EFor me...\u003C/em\u003E\u003C/strong\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is the only relevant thing in this entire thread.\u003C/p\u003E\u003Cp\u003EP.S. - I\u0027m not suggesting Mechjeb controls the coasting, I\u0027m simply saying it\u0027s a more accurate analogy of the game.\u003C/p\u003E\n"},{"CreatedByName":"WeirdCulture","CreatedById":76591,"CreatedDateTime":"2015-07-09T14:58:46Z","Content":"\n\u003Cp\u003EOhh this thread again... and again and again... when we merge all these threads together, will this summons a new kraken? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Canopus","CreatedById":57774,"CreatedDateTime":"2015-07-09T14:59:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lajoswinkler\u0022 data-cite=\u0022lajoswinkler\u0022\u003E\u003Cdiv\u003EMechjeb does not control coasting. It controls adjustments, and that robs you of fun and learning. There\u0027s tons of things one could learn about orbital mechanics in an awesome way if one fiddles with maneuver nodes. Not to mention when it comes to landing. So much fun is taken away if you just \u0022press key to adjust\u0022 or \u0022press key to land there\u0022. For me, that\u0027s not \u003Cem\u003Eplaying\u003C/em\u003E KSP. That\u0027s \u003Cem\u003Ewitnessing the simulation doing its thing\u003C/em\u003E.\u003C/div\u003E\u003C/blockquote\u003EMechJeb 2 does use maneuver nodes though. If you tell it to circularize at periapsis for example, it creates a node and then executes it.\n"},{"CreatedByName":"Requia","CreatedById":112924,"CreatedDateTime":"2015-07-09T15:03:13Z","Content":"\n\u003Cp\u003EMechjeb is totally cheating. If you need an autopilot there\u0027s kOS \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"jkool702","CreatedById":146465,"CreatedDateTime":"2015-07-09T15:11:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lajoswinkler\u0022 data-cite=\u0022lajoswinkler\u0022\u003E\u003Cdiv\u003EMechjeb does not control coasting. It controls adjustments, and that robs you of fun and learning. There\u0027s tons of things one could learn about orbital mechanics in an awesome way if one fiddles with maneuver nodes. Not to mention when it comes to landing. So much fun is taken away if you just \u0022press key to adjust\u0022 or \u0022press key to land there\u0022. For me, that\u0027s not \u003Cem\u003Eplaying\u003C/em\u003E KSP. That\u0027s \u003Cem\u003Ewitnessing the simulation doing its thing\u003C/em\u003E.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs many people (including myself) have indicated - we learned how to do this without using mechjeb first, and only used mechjeb to do it after this part of the game was second nature. Once you can do this in your sleep its becomes tedious, not fun, to continue to do over and over again. At this point the part of the game where you \u0022learn something new\u0022 is (for me) heavily based on designing ships that can do difficult tasks. \u003C/p\u003E\u003Cp\u003ETake launching from Eve for example: the challenging part isnt actually piloting the take off, but rather designing a ship that CAN take off from Eve and getting that ship to Eve\u0027s surface is what is challenging and fun.\u003C/p\u003E\u003Cp\u003ESo, without telling anyone how they should play the game, id recommend that you should learn how to do stuff without mechjeb, and once you completely understand it and dont get enjoyment from adjusting an orbit or taking off or landing for the 1000th time let mechjeb automate it and switch your focus to other aspects of the game.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-09T15:14:25Z\u0022 title=\u002207/09/2015 03:14  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 9, 2015\u003C/time\u003E by jkool702\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"winged","CreatedById":143617,"CreatedDateTime":"2015-07-09T15:16:05Z","Content":"\n\u003Cp\u003EMechjeb is very helpful when you\u0027re doing gravity assists. Stock game and manuever node doesnt provide you such level of accuracy. I can\u0027t imagine than someone can make Galileo style trajectory using only stock maneuver node. It would be pure masochism.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/fFLVv7r.jpg\u0022 alt=\u0022fFLVv7r.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlso MechJeb is must have for RSS\u002BRO. Especially when you\u0027re doing (like me) replicas of real life rockets so you need (almost) the same dimensions, burn times for every stage, same launch mass, payload to specific orbit, escape trajectories etc. So as you can see MJ is definitely usable tool for pro players.\u003C/p\u003E\u003Cp\u003ERegarding autopilot: I\u0027m using it to make cinematics. It\u0027s really hard to controling rocket without GUI and making scenes simultaneously, especially with FAR installed.\u003C/p\u003E\u003Cp\u003ELanding? Yeah that\u0027s one thing I\u0027m always doing without MJ.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lajoswinkler\u0022 data-cite=\u0022lajoswinkler\u0022\u003E\u003Cdiv\u003EIf you let Mechjeb do all the things for you, you aren\u0027t really playing the game, are you? It\u0027s being played in front of your eyes. It\u0027s like playing a car racing game with an autopilot. Why would you bother even playing it? You might as well watch \u0022let\u0027s play\u0022 on YouTube.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t see any comparision between M. Schumacher in F1 car during Nurburgring GP and little green guy in a spaceship waiting 60 days for Duna encounter.\u003C/p\u003E\n"},{"CreatedByName":"Demon_82","CreatedById":81626,"CreatedDateTime":"2015-07-09T15:24:10Z","Content":"\n\u003Cp\u003EI learnt most manuevers but launch and circularization by watching MechJeb do them. Now, i can perform them manually, but less efficiently than it does. I enjoy moredesigning the ships and payloads than doing my 500th launch by hand. It\u0027s my game and I play it like i want to. And I\u0027m addicted to it\u0027s delta V readings anyways xD\u003C/p\u003E\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2015-07-09T18:40:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022llanthas\u0022 data-cite=\u0022llanthas\u0022\u003E\u003Cdiv\u003ERight on. I\u0027m aware that this game doesn\u0027t prepare me for actual space flight. I\u0027m referring more to the game balance, and the reward vs effort balance. I happen to enjoy KSP much more as a challenging game, than a mobile app. \u0022Push button for space station\u0022 is not appealing to me.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd having to control all my craft by hand is not appealing to me. If you truly care that others have long term enjoyment of the game then you must accept that for some, myself being one, the most enjoyment comes from design and construction and if forced to fly by hand then enjoyment would wane and cease.\u003C/p\u003E\u003Cp\u003EYou are not everyone and whilst I am happy you get so much enjoyment from your playing style please remember that others enjoy the game for different reasons.\u003C/p\u003E\n"},{"CreatedByName":"Miravlix","CreatedById":142351,"CreatedDateTime":"2015-07-09T20:51:44Z","Content":"\n\u003Cp\u003EStock KSP is just too unrealistic for me to enjoy.\u003C/p\u003E\u003Cp\u003EKER, Trajectories, Kerbal Alarm Clock and a ton of other addons is required to make KSP even remotely feel like I\u0027m pretending to be involved in a space program and not some messed up space sim.\u003C/p\u003E\u003Cp\u003EFlying by the seat of your pants, is movie stuff, way unrealistic.\u003C/p\u003E\n"},{"CreatedByName":"BDelacroix","CreatedById":121050,"CreatedDateTime":"2015-07-09T22:00:19Z","Content":"\n\u003Cp\u003EAs if a real space program would be all manual.\u003C/p\u003E\u003Cp\u003EBring on the gaming elitists.\u003C/p\u003E\u003Cp\u003EThis won\u0027t end well.\u003C/p\u003E\n"},{"CreatedByName":"Canopus","CreatedById":57774,"CreatedDateTime":"2015-07-09T22:54:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022llanthas\u0022 data-cite=\u0022llanthas\u0022\u003E\u003Cdiv\u003EIt\u0027s much more rewarding to achieve a difficult task, like building and flying an SSTO, without assistance, trust me. You get more out of the game, and the devs don\u0027t feel the need to dumb it down to \u0022press button for space station\u0022 to attract more casuals. Every time you post about how bored you are with \u0027repetitive\u0027 trips to Eeloo, without mentioning that the game just moved your ship there while you had coffee, that\u0027s another vote for more Stupid to be introduced, and less challenge. \u003C/div\u003E\u003C/blockquote\u003EYeah thats not really how MechJeb works though. Still i agree that it wouldn\u0027t be a good idea to have an autopilot in the game, not because the game would become to easy but because using Mechjeb is little bit to technical i think. What should be in the game though is the ability for five star Kerbal pilots and the most advanced probe cores to complete maneuvers automatically.\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-09T22:56:41Z\u0022 title=\u002207/09/2015 10:56  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 9, 2015\u003C/time\u003E by Canopus\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"moogoob","CreatedById":118251,"CreatedDateTime":"2015-07-09T22:55:55Z","Content":"\n\u003Cp\u003EI use Mechjeb, and don\u0027t care if you don\u0027t. I like having an autopilot to automate things. Often, I pilot probes EXCLUSIVELY through Mechjeb as they\u0027re supposed to be automated. If MJ can\u0027t do it, neither can the probe.\u003C/p\u003E\u003Cp\u003EBut it\u0027s not all about autopilot. I also like Delta-V readouts. Landing estimates. Suicide burn countdowns. \u0022Current Biome\u0022 readouts. Porkchop plots for interplanetary transfer. SmartASS attitude control. Mechjeb is a Swiss Army Knife of a mod and if you don\u0027t want a Swiss Army Knife, by all means don\u0027t use it but please don\u0027t lambast us fans for doing being fans of this amazing and useful tool.\u003C/p\u003E\n"},{"CreatedByName":"winged","CreatedById":143617,"CreatedDateTime":"2015-07-09T23:10:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022llanthas\u0022 data-cite=\u0022llanthas\u0022\u003E\u003Cdiv\u003E A game without challenge is just a crummy movie about nothing.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou can use MechJeb to make game more challenging. \u003C/p\u003E\u003Cp\u003EExample? Gravity assists.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-10T01:40:05Z\u0022 title=\u002207/10/2015 01:40  AM\u0022 data-short=\u00228 yr\u0022\u003EJuly 10, 2015\u003C/time\u003E by Red Iron Crown\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Madrias","CreatedById":89995,"CreatedDateTime":"2015-07-09T23:44:43Z","Content":"\n\u003Cp\u003ECount me also in the Mechjeb camp. I use it to eliminate the tedium of yet another launch from Kerbin with the same identical launching stack that carries the same payload into the same orbit. I use it to plot the most efficient course between point-A and point-B, because I can\u0027t call up the Kerbals in the tracking station and ask them, \u0022Hey, could you help me get to Eve?\u0022 I let it fly probes entirely because probes are supposed to be autonomous, no human (or Kerbal) intervention, flying with mechanical precision.\u003C/p\u003E\u003Cp\u003EI use the Current Biome readout when flying aircraft or driving rovers, so that I\u0027m not constantly wasting my time trying to check if I\u0027m in a new biome when gathering batches of science, rather than breaking my mouse checking the Crew Report until something finally says it\u0027s not Kerbin\u0027s Grasslands.\u003C/p\u003E\u003Cp\u003EI even admit to using Docking Autopilot. Why would a society that can go interplanetary still be bashing ships together under full manual control? Why not make the highly-tuned piece of precision equipment, the probe core, do the hard stuff? Sure, I can dock ships together, and until I\u0027ve done a few in Kerbin Orbit and a couple around the Mun, I don\u0027t use Docking Autopilot. After I\u0027ve done it a few times, then the autopilot turns on. And believe me, it\u0027s far from a cheaty \u0022press button and make space station\u0022 routine with that. You need to be so over-engineered in your monopropellant budget that it\u0027s barely funny. Why? Because Mechjeb, last time I used it, determines that the best way to not move is to spray monopropellant from all nozzles at once, depleting your supply of RCS fuel.\u003C/p\u003E\u003Cp\u003EAs for those who bash on Mechjeb being \u0027easy mode\u0027, well, yes, it does make things easier. Think of it this way, though: if we, as Humans, didn\u0027t have the equivalent of Mechjeb, we wouldn\u0027t have a space station in orbit nor a flag on the moon. Yes, some of it was flown manually, I\u0027m sure.\u003C/p\u003E\u003Cp\u003EAlso consider this: NASA has a huge ground-support crew communicating to our astronauts during each phase of their mission. KSP players have themselves and their trusty keyboards, the dead silence over the radio, and the whirr of fans in their computer case.\u003C/p\u003E\u003Cp\u003EMechjeb is my Ground Control. Mechjeb is the silent voice over my radio, telling my probe which way to go, telling my Kerbals where to point the ship, guiding my Kerbonauts across the infinite darkness. Mechjeb is the Kerbal Pilot\u0027s intuition saying, \u0022Maybe I should turn the engine on \u003Cstrong\u003Eright now\u003C/strong\u003E so that I don\u0027t crash and die horribly out here.\u0022\u003C/p\u003E\u003Cp\u003EAnd I don\u0027t mind seeing people fly solo. I have nothing against them, even when they have something against me. I have respect for those who wish to fly every launch on manual, to dock every ship on their own. To do their own landings with their own probes, or to plot their own course.\u003C/p\u003E\u003Cp\u003EThere are even moments when I\u0027m forced to fly manual because something happened and suddenly Mechjeb can\u0027t handle flying the ship, and it makes me respect the solo pilots even more. Making that decision whether to stage early, or try to make it, despite being down one engine and a fuel can. Whether to shut down the other side or to ride out the lean. Whether to jettison the remains of both the destroyed side and the companion engine across from it. Whether to abort the launch or continue anyway. Or whether I can make it, despite being 300 delta-V short of what I initially planned.\u003C/p\u003E\u003Cp\u003EMechjeb isn\u0027t just a \u0022push button for orbit\u0022 tool. Sure, it can be used as such, but all the computers in the world won\u0027t make a poorly-designed rocket make orbit. I enjoy KSP for the engineering challenge it presents, like playing with a box of virtual LEGO\u0027s without stepping on the pieces four hours later. Sure, I enjoy flying some of my missions, but flying the same design to orbit just gets dull after a while. And I know Squad made the decision to not have random failures for a reason. So that your mistakes are the only reason you don\u0027t make orbit. But there are times I really wish something, anything, would happen on launch number 37, or launch number 5 of the MK14 Super Shuttle. Things that aren\u0027t planned ahead of time. Things not related to \u0022oh, crap, I just opened my chute under full acceleration.\u0022 or \u0022I pulled up too hard and ripped the wings off.\u0022\u003C/p\u003E\u003Cp\u003EThe end result, though, is that I do use Mechjeb, and a good number of its features, because they add in my co-pilot, my Ground Control, my Navigator. It gives me probe cores that are more than just remote-controlled spacecraft with an infinite range. It gives me the remaining 50% of my space program, the parts that would be so much more difficult to add in game smoothly. And so it gives me an ability to go interplanetary with ease. After all, I still do many of my own landings, many of my own launches, and a good chunk of my own docking. But sometimes I let my co-pilot do it for me.\u003C/p\u003E\n"},{"CreatedByName":"Bev7787","CreatedById":136501,"CreatedDateTime":"2015-07-10T00:57:01Z","Content":"\n\u003Cp\u003EI use mechjeb. Not often for autopilots but for things like trajectories and delta v info. Its more convenient than downloading two separate mods.\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-07-10T01:10:52Z","Content":"\n\u003Cp\u003EI never use any mods, including MechJeb. I don\u0027t consider it \u0022cheating\u0022, but the game is definitely more challenging without it and I enjoy the challenge.\u003C/p\u003E\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"},{"CreatedByName":"TheSaint","CreatedById":70033,"CreatedDateTime":"2015-07-10T01:39:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022llanthas\u0022 data-cite=\u0022llanthas\u0022\u003E\u003Cdiv\u003EYou could make the same arguments about any video game - it\u0027s not realistic / it\u0027s too simple / it\u0027s too complex / it doesn\u0027t smell right. \u003Cp\u003EStop comparing the gameplay balance to actual NASA operations. \u003C/p\u003E\u003Cp\u003E\u003Cem\u003E As a video game \u003C/em\u003E, KSP is pretty well-balanced in difficulty without adding \u0027autopilot\u0027 features. It\u0027s much more rewarding to achieve a difficult task, like building and flying an SSTO, without assistance, trust me. You get more out of the game, and the devs don\u0027t feel the need to dumb it down to \u0022press button for space station\u0022 to attract more casuals. That\u0027s the real issue here, and the only reason that anyone should care how you play. \u003C/p\u003E\u003Cp\u003EEvery time you post about how bored you are with \u0027repetitive\u0027 trips to Eeloo, without mentioning that the game just moved your ship there while you had coffee, that\u0027s another vote for more Stupid to be introduced, and less challenge. A game without challenge is just a movie about nothing.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut even if all your worst nightmares come true and Squad caves to massive community pressure and puts an autopilot into the game (which they\u0027ve said over and over again for years they aren\u0027t going to do), it still doesn\u0027t affect you. All you have to do is not press the autopilot button. \u003C/p\u003E\u003Cp\u003EThe real issue is that you can\u0027t wrap your head around the idea that people who play KSP differently than you do can have just as much fun.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-10T02:33:30Z\u0022 title=\u002207/10/2015 02:33  AM\u0022 data-short=\u00228 yr\u0022\u003EJuly 10, 2015\u003C/time\u003E by TheSaint\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tourist","CreatedById":143403,"CreatedDateTime":"2015-07-10T01:54:00Z","Content":"\n\u003Cp\u003EI haven\u0027t used it yet, but not only do I think its not cheating, but it should eventually be added to stock.... but way way up the tech tree. It should not be available straight away (except in sandbox of course).\u003C/p\u003E\u003Cp\u003EI think it would allay many players and Squads fears about it becoming too easy if you have to earn your way to Mechjeb. The best way I can think to do this is have it as a part near where the high science cost probe cores are, and needs a fully upgraded tracking station to for it to work. Also costs weight and doesn\u0027t work if not powered. My thought is that it should not be available until you have at least landed on both mun and minmus and one interplanetary transfer. After that you have passed your rocket launch and navigation tests.\u003C/p\u003E\u003Cp\u003EIn this way, Mechjeb is not a first level tool for avoiding learning the necessary skills, rather becomes, as it should be, a tool for experienced players move onto more complex endeavours without needing to worry about those mundane parts of the process they have done a million times before.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-10T02:02:23Z\u0022 title=\u002207/10/2015 02:02  AM\u0022 data-short=\u00228 yr\u0022\u003EJuly 10, 2015\u003C/time\u003E by Tourist\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TheSaint","CreatedById":70033,"CreatedDateTime":"2015-07-10T02:54:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tourist\u0022 data-cite=\u0022Tourist\u0022\u003E\u003Cdiv\u003EI haven\u0027t used it yet, but not only do I think its not cheating, but it should eventually be added to stock.... but way way up the tech tree. It should not be available straight away (except in sandbox of course).\u003Cp\u003EI think it would allay many players and Squads fears about it becoming too easy if you have to earn your way to Mechjeb. The best way I can think to do this is have it as a part near where the high science cost probe cores are, and needs a fully upgraded tracking station to for it to work. Also costs weight and doesn\u0027t work if not powered. My thought is that it should not be available until you have at least landed on both mun and minmus and one interplanetary transfer. After that you have passed your rocket launch and navigation tests.\u003C/p\u003E\u003Cp\u003EIn this way, Mechjeb is not a first level tool for avoiding learning the necessary skills, rather becomes, as it should be, a tool for experienced players move onto more complex endeavours without needing to worry about those mundane parts of the process they have done a million times before.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI actually disagree. I think that one of the great strengths of this game is the fact that people can use mods to add and remove things to customize the game to their liking. So while I find it annoying and frustrating when people run around calling other people \u0022cheaters\u0022 for using an autopilot mod in a single-player game, I would find it equally annoying and frustrating if the developers took away those same people\u0027s ability to choose to play the game without an autopilot. What can I say, except, \u0022Hooray for diversity!\u0022 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Tourist","CreatedById":143403,"CreatedDateTime":"2015-07-10T05:40:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheSaint\u0022 data-cite=\u0022TheSaint\u0022\u003E\u003Cdiv\u003EI actually disagree. I think that one of the great strengths of this game is the fact that people can use mods to add and remove things to customize the game to their liking. So while I find it annoying and frustrating when people run around calling other people \u0022cheaters\u0022 for using an autopilot mod in a single-player game, I would find it equally annoying and frustrating if the developers took away those same people\u0027s ability to choose to play the game without an autopilot. What can I say, except, \u0022Hooray for diversity!\u0022 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree with everything you said, except the last bit.\u003C/p\u003E\u003Cp\u003EIf it exists, but just as a part you can unlock and attach (I imagine it being like the batteries), players can choose not you use it. I can\u0027t see how that affects the \u0022hands-on\u0022 pilot\u0027s enjoyment. I\u0027m sure we all have parts we don\u0027t use. I for one have never used the Ion engine. Nor have I ever used the Round 8... and I know how much people swear by those. I\u0027ve just never found a use for it. \u003C/p\u003E\u003Cp\u003EBut I suppose, as you say, mech-jebbers can always mod it in. Its just I can see great potential for adding bonus depth career mode. For instance, Mech-jebs capabilities could be tied to certain experiments. Such as, it can\u0027t reach orbit automatically until you have done various barometer and accelerometer tests at various points of a manual ascent. If people want to use auto landing on celestial bodies, perhaps a probe with a beacon needs to be landed first to provide telemetry. \u003C/p\u003E\u003Cp\u003ETotally with you on letting people play they way they want, and no name calling though. As Abraham Lincoln once said \u0022Be excellent to each other... and.... PARTY ON, DUDES!\u0022\u003C/p\u003E\n"},{"CreatedByName":"maceemiller","CreatedById":130574,"CreatedDateTime":"2015-07-10T05:43:54Z","Content":"\n\u003Cp\u003EMechjeb. I only use it for delta v stats.\u003C/p\u003E\n"},{"CreatedByName":"irichey25","CreatedById":66851,"CreatedDateTime":"2015-07-10T07:11:17Z","Content":"\n\u003Cp\u003EI use Mechjeb for a decent amount of things. Generally, in my opinion, if you\u0027re having fun do what you please. \u003C/p\u003E\u003Cp\u003EI usually use Smart ASS, Translation, and the Maneuver Node Planner for making perfect circle orbits.\u003C/p\u003E\n"},{"CreatedByName":"T.A.P.O.R.","CreatedById":137748,"CreatedDateTime":"2015-07-10T07:28:06Z","Content":"\n\u003Cp\u003EAccidentally skewed the poll by voting non mj\u003C/p\u003E\u003Cp\u003EI use it for launches that require my attention to be elsewhere.\u003C/p\u003E\u003Cp\u003EI\u0027ve rarely managed to get it to land exactly where I want, so I let it get me in range, then try to land myself\u003C/p\u003E\n"},{"CreatedByName":"mhoram","CreatedById":78756,"CreatedDateTime":"2015-07-10T08:07:46Z","Content":"\n\u003Cp\u003EI had until now three Mech-Jeb phases:\u003C/p\u003E\u003Cp\u003E1. I started playing KSP without MJ: Basic maneuvering within Kerbins SOI was easy enough to not use it. But landing on Mun/Minmus was hard.\u003C/p\u003E\u003Cp\u003E2. I used MJ for DV\u0026amp;TWR-Stats and for convenience for recurring things like Hohmann Transfers, Launching \u0026amp; Landing and Rendezvous\u003C/p\u003E\u003Cp\u003E3. Currently I don\u0027t use MJ. For setting up maneuvers I use PreciseNode; Pinpoint landings on the Mun I can do by hand; for DV\u0026amp;TWR-stats there is KER.\u003C/p\u003E\u003Cp\u003ESince #2 was the longest phase, I am still a bit undecided how to vote.\u003C/p\u003E\n"}]}