{"TopicId":115284,"ForumId":32,"TopicTitle":"My persistence file got munted!","CreatedByName":"kiwi1960","CreatedById":81697,"CreatedDateTime":"2015-07-07T11:41:00Z","PageNum":1,"Articles":[{"CreatedByName":"kiwi1960","CreatedById":81697,"CreatedDateTime":"2015-07-07T11:41:00Z","Content":"Oh dear....how sad...never mind.\n\nYes, I did have a back up, but there is a problem. The last one didn\u0027t have a critical flight I wanted to work in it. So there is no going back from that, I couldn\u0027t stand it...\n\nSo, I\u0027m starting again. Jeb gets a second chance at life. The lessons I have learnt will mean a lot less disasters and one fewer deaths (Jeb was the only one I lost!)\n\nMaybe Squad should incorporate an automatic backup system for your saves, ships and gamedata folder... whenever you exit the game, it backs it up. You could specify the maximum number of backups, say, 5, then when it save number six, it deletes number one. I\u0027d think for a complicated game like KSP, that should be a critical part to add to the game.\n\nStill, its not all bad. I can have a clean out of the gamedata folder and delete all the mods I never use or just plain annoy me... I may even add a few more.\n\nBUT: I am not complaining, it could be worse, it could have been my computer that got munted...."},{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2015-07-07T13:07:24Z","Content":"Sorry for your loss ![:(](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif)\n\nI wrote [this tool](https://forum.kerbalspaceprogram.com/threads/72212-Jebretary-Automatic-Version-Control-%28backups%29-for-craft-and-saves-v0-4-0) to automatically track quicksaves and autosaves and versions of craft as you change them in a version control system (git). \n\nIt\u0027s a bit of a crazy tool, needs updating, but it still works in the current version and with it you can be sure that every single quicksave and autosave is tracked and you can go back to any point in your career or a previous version of a craft/subassembly. \n\nBecause it uses git it only tracks the individual lines that change between save/craft file versions, rather than just taking full copies of the files, so it\u0027s very space efficient and can track 1000\u0027s of save versions in the same space that taking a few full copies would take."},{"CreatedByName":"micr0wave","CreatedById":136352,"CreatedDateTime":"2015-07-07T13:08:52Z","Content":"There\u0027s this mod [http://forum.kerbalspaceprogram.com/threads/105399-0-90-S-A-V-E-automatic-backup-system-0-9-9-281](https://forum.kerbalspaceprogram.com/threads/105399-0-90-S-A-V-E-automatic-backup-system-0-9-9-281) which might be something you were asking for.\n\nedit: ninja\u0027ed by katateochi, his mod sounds good too"},{"CreatedByName":"smjjames","CreatedById":134004,"CreatedDateTime":"2015-07-07T13:20:24Z","Content":"\u0027munted\u0027?"},{"CreatedByName":"Jaeleth","CreatedById":136435,"CreatedDateTime":"2015-07-07T13:29:54Z","Content":"Always allow for quicksaves in your settings, and save a lot. That\u0027s not cheating, in the real world there are no saves, but then again, in the real world the whole universe doesn\u0027t crash because of a computer bug...\n\nIf you are in career mode remember that ANY flight can be translated into cash (unless it has kerbals on board and you care for the, like me) so, if you want to correct some issue and cannot revert a flight you can always edit the game file (make a copy first) and add the money you lost for that flight. And then, terminate the flight. Since time is, usually, not an issue in the game, returning the cash back returns you to the conditions prior to the flight."},{"CreatedByName":"NecroBones","CreatedById":105424,"CreatedDateTime":"2015-07-07T13:36:01Z","Content":"When I was playing a large on-going campaign, I was paranoid about my saves. I quicksaved before and after every major maneuver. I made almost-daily, numbered backups. And I often made copies of quicksaves as restore-points before planetary insertions, so that I could at least go back to that point even if my later quicksaves were in unrecoverable situations. \n\nThis was all before the in-game UI for creating named saves existed. I just kept the folder open in another window. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\n(since then I\u0027ve played with more disposable saves)"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-07-07T14:02:48Z","Content":"I just point my usual online backup program at my KSP folder. I have it set to check for changes every 30 minutes and it keeps all the old versions."},{"CreatedByName":"LordFerret","CreatedById":111598,"CreatedDateTime":"2015-07-07T14:22:25Z","Content":"\u003E \n\u003E \u0027munted\u0027?\n\nNinja\u0027d. lol"},{"CreatedByName":"kiwi1960","CreatedById":81697,"CreatedDateTime":"2015-07-07T19:37:31Z","Content":"Yep, here, \u0022munted\u0022 means broken, ruined, kaput, no good....\n\nI think Bill and Bob invented the word a short time after they started working with Jeb.\n\nValentina just bites her kerbal tongue.\n\nThe problem wasn\u0027t with any ship, as such. the last time I played it, the game crashed. Now, I cannot go to the Mun Base to get landing corrdinates as the game always locks up.\n\nI need a mod to save the persistence file, as well as ships.... Mods would be nice, but probably not essential to what happened in this case.\n\n- - - Updated - - -\n\nFYI, I have downloaded both of the suggested mods and will install whichever one is better, IMHO, so when I decide, I won;t say which one for obvious reasons.\n\nThanks for both suggestions."},{"CreatedByName":"keeper","CreatedById":124530,"CreatedDateTime":"2015-07-07T20:06:44Z","Content":"munted lmao\n\nI got my jeb, bill and bob to a minmus orbit station, sent bob out to collect some science, he got out but my view stayed on the ship - to which bob was still accounted for inside. \n\nBob was out, but bob was in! \n\nWe went back to the KSC to check the roster, we forgot to check the roster and reloaded the ship immidiatly, bob was indeed still outside, and inside the ship, and there was no room for bob to get back in the ship. At the time we put escape hatch on lockdown, Bob broke the rule and got out, there were now 3 Bobs. I was horrified at the idea. I thought my entire game was broke. I\u0027m playing career here. \n\nAs much as I respect Bob, I hated the new Bobs with a passion, I have a thing I shouldn\u0027t kill the kerbals and I felt a drudging \u0026 grueling sense of responsibility to save the new Bobs. \n\nNo rescue mission was even planned, or would be a long time off at the very least, but the thought that i\u0027d have to start again, again came to mind first. - oh no. \n\nI didn\u0027t want it happening to all my kerbals but google found a fix, just making room in the same cabin get them all in together and they all mould (munt?) back into one. \n\nUnlocked the hatch, evactuated the cabin, and got all the first and second Bob inside. There were two Bobs inside.The third Bob got in together with them \u0026 it showed only one Bob inside, with that done and everyone back inside I was left to reflect on how that could even be possible. What is wrong with that \n\nBit of a faff, but the space program goes on! \n\nWith just one Bob, thankfully."},{"CreatedByName":"kiwi1960","CreatedById":81697,"CreatedDateTime":"2015-07-07T21:17:54Z","Content":"Probably confirmed my once held belief that kerbals were all clones. Glad you got it sorted, Bob is OK, but if I\u0027d ended up with three jeb\u0027s, I\u0027d have killed myself...\n\nOr more likely... taking great delight in killing the imposters.\n\nI\u0027d tried everything in getting the game unstuck, sadly, I think...rather, i know its a game killer."}]}