{"TopicId":115231,"ForumId":38,"TopicTitle":"War Of Insanity!","CreatedByName":"Dark Junior","CreatedById":102999,"CreatedDateTime":"2015-07-06T20:45:44Z","PageNum":11,"Articles":[{"CreatedByName":"Sampa","CreatedById":130079,"CreatedDateTime":"2015-07-12T17:20:14Z","Content":"beginning containment procedures...activating all quantum shields on all equipped planets... \\*error buzzer\\* drat, long range coms are down... Let\u0027s try something closer... We still have direct control of the shields surrounding the attractor... Activating Attractor Quantum shields on full power! Containment holding! Success! Crisis averted!"},{"CreatedByName":"Dark Junior","CreatedById":102999,"CreatedDateTime":"2015-07-12T18:25:00Z","Content":"My fleet returns from dealing with xannari."},{"CreatedByName":"Sampa","CreatedById":130079,"CreatedDateTime":"2015-07-12T19:50:37Z","Content":"\\*sigh\\* Glad that\u0027s over...\n\n- - - Updated - - -\n\nJunior, I have an idea to help prevent future crises like what just occurred. We need to have a central council from which those who have something against another or even another member of said council may come forward to state the problem. If the problem is serious enough, we would go and investigate the issue and then lay down a judgement. This council should also be placed at a central position, say, the main control hub of ALL of my Mass Relays in my Mass Relay network."},{"CreatedByName":"Dark Junior","CreatedById":102999,"CreatedDateTime":"2015-07-12T20:04:25Z","Content":"Maybe so. Maybe that should be made a city of some kind. something something unification city. How does that sound? Also, let\u0027s let everyone except Xannari in the council. Each faction gets 2 reps."},{"CreatedByName":"Sampa","CreatedById":130079,"CreatedDateTime":"2015-07-12T20:18:00Z","Content":"I agree, though not a city...a station. I refuse to place it on any one faction\u0027s planet as that would give them more power than others. With a space station, particularly one where each one of the factions can play a role in its construction, it would give them equal rights to be there. After the construction is complete, just its being there as the center of galactic government is enough to provide equality. Also, I have a high suggestion that we quarentine the area of the Great Attractor off from the rest of the galaxy. NO ONE may go in or out without express permission of the council and area be patroled by the council military at all times"},{"CreatedByName":"Dark Junior","CreatedById":102999,"CreatedDateTime":"2015-07-12T20:26:39Z","Content":"Me and my 2 representatives vote yes to quarantine The Attractor. The governments should be allowed to build their own modules on the station. Just as a kind of home away from home."},{"CreatedByName":"Sampa","CreatedById":130079,"CreatedDateTime":"2015-07-12T20:30:10Z","Content":"Agreed\u0027d Also, my people are nomadic at this time. We lost our homeworld when the first galactic core went critical. We are seeking a new homeworld and have found a suitable one on the planet Rannoch. Also the size of the station should be truly massive, city-like in stature in order to truly accomodate the number of people and factions involved. My people will provide for the defenses and the access and control of the Mass Relays."},{"CreatedByName":"Dark Junior","CreatedById":102999,"CreatedDateTime":"2015-07-12T20:35:12Z","Content":"I share my new nearly invincible particle shield with you to defend the station. I\u0027ll handle the Science, comm, blueprints, etc. My people are very skilled at architecture and science. We created an armor shell and covered our planet with cities. We\u0027re qualified."},{"CreatedByName":"Sampa","CreatedById":130079,"CreatedDateTime":"2015-07-12T21:09:07Z","Content":"Agreed.\n\nYou know what, we need to give this new station a proper name with which we will furthermore make reference to it... Any ideas?\n\nFinally, Cerberus herby declares an end to hostilities with the Tau Ceti Empire and seeks a truce. We no longer wish to fight with them and instead formally invites them to the council."},{"CreatedByName":"Xannari Ferrows","CreatedById":125369,"CreatedDateTime":"2015-07-13T00:16:43Z","Content":"You think you have won!? The Great Attractor\u0027s power knows no bounds. You puny little primitive shielding will be useless, for as you sit here idling, it exponentially gathers strength.\n\nWhen I return, and I WILL, I will walk over your cold, dead corpses, laughing at you all for ever thinking you could stand up to my lord.\n\nYou were right, Sampa; This is NOT over!"},{"CreatedByName":"Sampa","CreatedById":130079,"CreatedDateTime":"2015-07-13T00:24:59Z","Content":"\u003E \n\u003E You think you have won!? The Great Attractor\u0027s power knows no bounds. You puny little primitive shielding will be useless, for as you sit here idling, it exponentially gathers strength.\n\u003E When I return, and I WILL, I will walk over your cold, dead corpses, laughing at you all for ever thinking you could stand up to my lord.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E You were right, Sampa; This is NOT over!\n\nWe are not idling at all! As you have quoted me as saying, it is not over, only has begun. We are beginning to gather the strength of the galaxy while actively working to contain you. You may be able to steal the minds of some, but you will not be able to destroy the will for freedom."},{"CreatedByName":"Xannari Ferrows","CreatedById":125369,"CreatedDateTime":"2015-07-13T00:29:24Z","Content":"Big words for a small being. You talk about freedom, yet you encourage containment of me, and you promote restriction of publicity?\n\nCompared to what\u0027s happening right now, you ARE idling. There is no stopping this, so I can\u0027t blame you. It\u0027s all you can do."},{"CreatedByName":"Sampa","CreatedById":130079,"CreatedDateTime":"2015-07-13T01:32:50Z","Content":"\u003E \n\u003E Big words for a small being. You talk about freedom, yet you encourage containment of me, and you promote restriction of publicity?\n\u003E Compared to what\u0027s happening right now, you ARE idling. There is no stopping this, so I can\u0027t blame you. It\u0027s all you can do.\n\nWe shall see...\n\nClose transmission...\n\nPlay music\n\n[https://youtu.be/agfzSFzbiD4](https://youtu.be/agfzSFzbiD4)\n\n**Edited \u003Ctime datetime=\u00222015-07-13T01:43:30Z\u0022 title=\u002207/13/2015 01:43  AM\u0022 data-short=\u00228 yr\u0022\u003EJuly 13, 2015\u003C/time\u003E by Sampa**"},{"CreatedByName":"DestinyPlayer","CreatedById":143980,"CreatedDateTime":"2015-07-13T01:52:40Z","Content":"A small spark ignites in a random place in the universe... And then, suddenly, a whole galaxy appears from nowhere, enclosed within some kinda ring, made of an undetermined metal-ish material. Then, another ring appears, perpendicular to the main ring, ten times smaller. A colossal beam erupts from it, not targeting anything in particular, but making the galaxy speed away closer to the action.\n\nWhile on earth, some random person suddenly discovers a new method of gaining energy by using spinning corpses of dead scientists."},{"CreatedByName":"Dark Junior","CreatedById":102999,"CreatedDateTime":"2015-07-13T02:14:11Z","Content":"I think we should name it the United Galactic Alliance Central Station (UGACS)\n\nAnd maybe we should form a Galactic Alliance of some kind. (GA)\n\n**Edited \u003Ctime datetime=\u00222015-07-13T02:18:33Z\u0022 title=\u002207/13/2015 02:18  AM\u0022 data-short=\u00228 yr\u0022\u003EJuly 13, 2015\u003C/time\u003E by Dark Junior**"},{"CreatedByName":"Sampa","CreatedById":130079,"CreatedDateTime":"2015-07-13T04:21:45Z","Content":"\u003E \n\u003E I think we should name it the United Galactic Alliance Central Station (UGACS)\n\u003E And maybe we should form a Galactic Alliance of some kind. (GA)\n\nWhat about...Citadel?, and yes, a full galactic alliance should be formed."},{"CreatedByName":"Sampa","CreatedById":130079,"CreatedDateTime":"2015-07-13T05:08:03Z","Content":"United Galactic Alliance Central Station is pretty difficult to remember and its acronym would more than likely have its meaning forgotten. Just my thoughts...but, yes, a full galactic alliance would be the best thing we CAN do. Especially given the recent exchange between Xannari and I seen above."},{"CreatedByName":"Windspren","CreatedById":134441,"CreatedDateTime":"2015-07-13T05:20:30Z","Content":"\u003E \n\u003E United Galactic Alliance Central Station is pretty difficult to remember and its acronym would more than likely have its meaning forgotten. Just my thoughts...but, yes, a full galactic alliance would be the best thing we CAN do. Especially given the recent exchange between Xannari and I seen above.\n\nWe should name it The United Worlds of the Universe! With each star system acting as a state!\n\nI quickly build up a fleet of ships, with each one containing the latest in Kraken Drive technology! Who needs Alcubierre Drives?\n\nI am now developing K-Warheads that summon the Kraken on the enemy ship! Shields are useless!\n\n- - - Updated - - -\n\nWe should have positions. Can I be Fleet Admiral?"},{"CreatedByName":"Xannari Ferrows","CreatedById":125369,"CreatedDateTime":"2015-07-13T11:08:54Z","Content":"In time off, I have gathered planetary resources to experiment with new armour. Taking advantage of what I have now, I was able to invent a new alloy; Quadllneutronium. It is approximately 140% stronger than Polyneutronium. What have you all been doing? ...\n\nAh, so you\u0027ve expanded the range of your observation and found a new galaxy as a result? I suggest you hurry there, or someone might get there first...\n\nI\u0027m working currently on a new project: Exahelix 1. New drive system, and weaponization of the technology it uses. Testing looks promising, so beware. I could very well be onto Zettahelix, or Yottahelix by the time you get there! Lets hope your new propulsion can at least move some kind of fast.\n\n**Edited \u003Ctime datetime=\u00222015-07-13T11:16:40Z\u0022 title=\u002207/13/2015 11:16  AM\u0022 data-short=\u00228 yr\u0022\u003EJuly 13, 2015\u003C/time\u003E by Xannari Ferrows**"},{"CreatedByName":"Sampa","CreatedById":130079,"CreatedDateTime":"2015-07-13T13:20:40Z","Content":"Junior, I leave you to set up Project:Citadel (the project to build the space station to be the seat of all power in the galaxy). In the meantime, and will be going to oversee that the quarentine of the Attractor system is being followed."},{"CreatedByName":"Xannari Ferrows","CreatedById":125369,"CreatedDateTime":"2015-07-13T13:28:36Z","Content":"Lay a single neutrino on it, and I will end you right where you stand.\n\n**Charges maximum yield Gigahelix capable warhead**\n\nYou\u0027re really starting to get on my nerves.\n\n**Powers down.**\n\nActually no, I\u0027ve a better plan. Computer, shut off all comms! \n\nYou mentioned \u0022wave motion\u0022, a concept I am unfamiliar with. Let me see about hacking these computers...\n\nWow, this is some pretty tight security, but thanks to that episode from earlier... Computer, play back voice authorization section 3, code breaker: Sampa\n\n\u002255286FV778.\u0022\n\nOkay, forget the tight security stuff, that was easy! Let\u0027s check that database...\n\nOnly 266 Megahertz resonance? I was expecting a ton more.\n\nIndependent of spatial bias? That\u0027s something I need to work around. Maybe a few \u0022stray\u0022 Verterons can fix that.\n\nSmart dissolution of energy stream upon interference... So changing ambient resonance to match for any shield would stop this.\n\nI suspect you may have avoided the brute force route and went for versatility. Smart thinking, but sometimes brute force is the way to go!\n\nComputer, display 011 defense perimeter characteristics. ...Okay, that looks good... Remodulate ambient energy resonance by 6.109 Gigahertz.\n\nOh, and while you\u0027re at it, set all data on suspension so it can\u0027t be accessed, access code V35771\u002B. Begin a random modulation of this command code, and passively transmit each new code to my ocular implant.\n\nOne last thing, dear. Prepare a transfer shuttle armed with 3 units. Fit it with photo-morphic projectors. I\u0027m going undercover for a while...\n\n**Edited \u003Ctime datetime=\u00222015-07-13T14:01:49Z\u0022 title=\u002207/13/2015 02:01  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 13, 2015\u003C/time\u003E by Xannari Ferrows**"},{"CreatedByName":"Dark Junior","CreatedById":102999,"CreatedDateTime":"2015-07-13T14:48:30Z","Content":"Sampa, I send you a fleet of my warships to help with Xannari\u0027s threat.\n\nMeanwhile, my engineers construct the Citadel and create the frame of it. The station has propulsion in the case of a galactic apocalypse and enough hangar space to hold hundreds of frigates. The living quarters are underway and the Council Chamber will be built last. The Council Chamber will be the most grand romm you\u0027ve ever seen.\n\n**Edited \u003Ctime datetime=\u00222015-07-13T14:56:33Z\u0022 title=\u002207/13/2015 02:56  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 13, 2015\u003C/time\u003E by Dark Junior**"},{"CreatedByName":"Windspren","CreatedById":134441,"CreatedDateTime":"2015-07-13T15:47:06Z","Content":"I attach a Kraken Drive to a large planetoid in a small nebula and point it at Xannari. Bwa ha ha ha!\n\n- - - Updated - - -\n\n\u003E \n\u003E Sampa, I send you a fleet of my warships to help with Xannari\u0027s threat.\n\u003E Meanwhile, my engineers construct the Citadel and create the frame of it. The station has propulsion in the case of a galactic apocalypse and enough hangar space to hold hundreds of frigates. The living quarters are underway and the Council Chamber will be built last. The Council Chamber will be the most grand romm you\u0027ve ever seen.\n\nYou should make it Kraken propelled to eliminate need of fuel."},{"CreatedByName":"Sampa","CreatedById":130079,"CreatedDateTime":"2015-07-13T16:09:31Z","Content":"\u003E \n\u003E Lay a single neutrino on it, and I will end you right where you stand.\n\u003E **Charges maximum yield Gigahelix capable warhead**\n\u003E \n\u003E You\u0027re really starting to get on my nerves.\n\u003E \n\u003E **Powers down.**\n\u003E \n\u003E Actually no, I\u0027ve a better plan. Computer, shut off all comms! \n\u003E \n\u003E You mentioned \u0022wave motion\u0022, a concept I am unfamiliar with. Let me see about hacking these computers...\n\u003E \n\u003E Wow, this is some pretty tight security, but thanks to that episode from earlier... Computer, play back voice authorization section 3, code breaker: Sampa\n\u003E \n\u003E \u002255286FV778.\u0022\n\u003E \n\u003E Okay, forget the tight security stuff, that was easy! Let\u0027s check that database...\n\u003E \n\u003E Only 266 Megahertz resonance? I was expecting a ton more.\n\u003E \n\u003E Independent of spatial bias? That\u0027s something I need to work around. Maybe a few \u0022stray\u0022 Verterons can fix that.\n\u003E \n\u003E Smart dissolution of energy stream upon interference... So changing ambient resonance to match for any shield would stop this.\n\u003E \n\u003E I suspect you may have avoided the brute force route and went for versatility. Smart thinking, but sometimes brute force is the way to go!\n\u003E \n\u003E Computer, display 011 defense perimeter characteristics. ...Okay, that looks good... Remodulate ambient energy resonance by 6.109 Gigahertz.\n\u003E \n\u003E Oh, and while you\u0027re at it, set all data on suspension so it can\u0027t be accessed, access code V35771\u002B. Begin a random modulation of this command code, and passively transmit each new code to my ocular implant.\n\u003E \n\u003E One last thing, dear. Prepare a transfer shuttle armed with 3 units. Fit it with photo-morphic projectors. I\u0027m going undercover for a while...\n\nDid, you get the data? Congratulations, you successfully hacked into an empty computer! I had all sensitive data removed from ALL ships and the computers that controlled such data replaced with empty ones! In fact, the ship you are currently attacking is actually a stealth frigate as my ship is in drydock undergoing repairs and retrofit.\n\nHelmsman-Sir, I think the enemy has detected us!\n\nXO-Impossible! This is the best stealth system available! Do we even have the system on?\n\nHelmsman- Yes sir!\n\nMe- EVASIVE MANEUVERS! Try and shake her...\n\nRadar Operator- SIR! She\u0027s hacking into the systems!\n\nXO- Cut all server hard-lines now!"},{"CreatedByName":"Windspren","CreatedById":134441,"CreatedDateTime":"2015-07-13T16:21:46Z","Content":"I am building a base on Laythe, where I cloud harvest Jool.\n\n- - - Updated - - -\n\nI claim the entire Kerbol System for the United Worlds of the Universe"}]}