{"TopicId":115372,"ForumId":69,"TopicTitle":"Kerbalnaut turned into debris, now inert and unresponsive","CreatedByName":"RedKosmos","CreatedById":72690,"CreatedDateTime":"2015-07-08T06:16:39Z","PageNum":1,"Articles":[{"CreatedByName":"RedKosmos","CreatedById":72690,"CreatedDateTime":"2015-07-08T06:16:39Z","Content":"**KSP Version**: v 1.0.4.861 (not sure if 64 or 32, don\u0027t know how to find out) Windows OS\n\n**Mods/add-ons**: All stock\n\n**What Happens**: In career mode, I landed a \u0027base\u0027 on Minimus with a pilot and a scientist. The scientist EVA\u0027d out to the rover, which I sent with the base. After driving for a bit, the rover accidentally flipped and the ground clipped the kerbalnaut enough to make him go ragdoll, but still stuck in the external chair.\n\nAfter I corrected the rover upright, I switched to the kerbalnaut to rest his posture from ragdoll to standing (still kinda partially in the seat). When this happened, the screen shook a little (like a 2 parts in a rapid collision) and he was free\u0027d from the seat/rover and stood up next to the rover.\n\n*I switched to the kerbalnaut to get him back into the seat, but noticed that he was unresponsive to any controls and when I moused over him (as shown in picture) He was deemed a piece of debris from the rover. So I tried to bump him over with the rover, but he now weighs a ton and cannot be budged.* \n\nThis is pretty detrimental to my career mode, because the mission was expensive and so was hiring the scientist for the mission. \n\n**Fixes/Workarounds**: none\n\n![Dvs9HtP.png?1](http://i.imgur.com/Dvs9HtP.png?1)\n\n**Edited \u003Ctime datetime=\u00222015-07-08T08:46:55Z\u0022 title=\u002207/08/2015 08:46  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 8, 2015\u003C/time\u003E by RedKosmos**\n  \nFormat"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-07-08T10:32:28Z","Content":"[**Please see here.**](https://forum.kerbalspaceprogram.com/threads/127580-1-0-X-Cross-Platform-Issues-Thread)"},{"CreatedByName":"RedKosmos","CreatedById":72690,"CreatedDateTime":"2015-07-08T20:45:01Z","Content":"Thank you! Fixed the issue"}]}