{"TopicId":115341,"ForumId":32,"TopicTitle":"Helping Squad to make KSP more awesome #Crowdfunding","CreatedByName":"Lubo","CreatedById":136723,"CreatedDateTime":"2015-07-07T21:27:01Z","PageNum":1,"Articles":[{"CreatedByName":"Lubo","CreatedById":136723,"CreatedDateTime":"2015-07-07T21:27:01Z","Content":"Hi Kerbanouts,\n\nI was just thing about that idea. Here is the deal.\n\nIm almost sure we all agree that KSP is one if not the best Computer game ever made. At least for people like me, a numbers/science/space geek.\n\nIm loving it, but this love gets very much distracted by some annoying stock Bugs(SB), plus many more Mods induced bugs(MB) and crashes. These Mod related bugs sure SQUAD is not to blame for. If they r indeed mod related. Im not a coder, just a casual gamer.(think about streaming resently)\n\nI feel besides the SB and MB, KSP has so much more potential in terms of maybe Coloniazlisation, and reality related activities like warpdrive and other awesome and Engines/science experiments. And maybe add some Science to find Other life forms on other planets, solarsystems. I personal would be amazed if they implement some kind of minigames to different Science experiments, to maybe maxamize the science on the first go and/or playing around with the informations provided by the given science experiments. \n\nI know there are lots of mods for this, but then we have MB.\n\nTo the Point:\n\nI personally think if we as a community support SQUAD with something like Crowdfunding or mabye give ideas to make the twitchstream more exciting, or whatever.\n\nWe maybe can accelerate the process of fixing bugs, adding new cool stuff or maybe get more Mods to offical status. \n\nJust curious if u guys would toss in some coins to help making this amazing game even more amazing. - Just imagine if every KSP-Player chips in 1 Dollar, what could happen?\n\nWhat is Squad point of view to this idea?\n\ngreetings\n\nLukas Kerman"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-07-07T21:28:58Z","Content":"Squad already has plenty of cabbage if their Steam sales are any indication. If anything, they should have already hired a new dev or two without needing more."},{"CreatedByName":"Lubo","CreatedById":136723,"CreatedDateTime":"2015-07-07T21:37:18Z","Content":"I would support KSP with some additional coins, even thou i dont have much money, its just the fun i get out of this game is more then worth for me.\n\nObviously Green little thing aint that realistic, but u know thats arguable. i feel gameplay over realisim is legit to a certain degree. But why not having like stock mods which are able to switch on/off for a starting new carrer/sandbox run. This way everyone gets what they want - i guess."},{"CreatedByName":"metl","CreatedById":82406,"CreatedDateTime":"2015-07-07T22:34:22Z","Content":"I\u0027m actually rather done with support for KSP at the moment. After 650\u002B hours, it was an excellent investment, but the underlying issues of the game have finally drove me away. The last time I started it up to play, I looked at Val floating in space and just quit and played something else. Once 64 bit is a reality, then hopefully I will come back, but as it is now, I can\u0027t add any more mods to make it more pretty or it crashes, I can\u0027t build much of a space station at all or it slows to abysmal framerates (compounded by visual mods) and I still have no barn. Add in the tier balance issues and artificial grind due to the tier system and tech tree not being fleshed out well and the game has turned into a chore to play. Here\u0027s hoping 1.1 is better."},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2015-07-07T22:37:38Z","Content":"They\u0027ll have that console money soon enough."},{"CreatedByName":"Robotengineer","CreatedById":104525,"CreatedDateTime":"2015-07-07T22:39:15Z","Content":"\u003E \n\u003E Squad already has plenty of cabbage if their Steam sales are any indication. If anything, they should have already hired a new dev or two without needing more.\n\nIt seems as though Arsonide, RoverDude, and Porkjet are becoming \u0027part-time\u0027 devs, nothing official of course."},{"CreatedByName":"micr0wave","CreatedById":136352,"CreatedDateTime":"2015-07-07T22:41:08Z","Content":"Why crowdfunding ?\n\nYou could just buy some more copies."},{"CreatedByName":"uglyduckling81","CreatedById":129740,"CreatedDateTime":"2015-07-08T02:24:30Z","Content":"They have sold over a million copies. Probably at an average of $20 per copy. $20M income from game sales lets say.\n\n10 full time devs at $100k/yr each (this is a huge figure for your average dev, and more devs than I believe squad is actually employing. $1M/yr expenses.\n\n5yrs of development x $1M/yr = $5M out of $20M. Someone has made a lot of money already. I see no reason to give them any more to improve this game. I would see it as fair if they supported and added content for another 5 years and kept $10M in profits or funding for their next project so they don\u0027t need to stuff around with crowd funding. KSP 2 done with a larger budget from the outset for example.\n\nObviously this is a dumbed down version and doesn\u0027t factor is many expenses (Steam\u0027s cut etc) but it also doesn\u0027t factor in ongoing income from future sales of game copies and merchandise."},{"CreatedByName":"samstarman5","CreatedById":12469,"CreatedDateTime":"2015-07-08T02:24:44Z","Content":"Squad does not need any crowdfunding assistance or the like. If you really love the game, then encourage more people to buy it. You say you are a streamer, so use that as an avenue to reach out to people to get a copy.\n\nYou also say you are not a coder, so you should understand that Squad is not responsible whatsoever for bugs with mods. That rests entirely on the modders. It is the modders\u0027 responsibility to keep their own mod up to date with new versions of KSP, and not Squad\u0027s. Bringing that up infers a lot of ignorance on your part, and is unfair to Squad. You should really take the time to learn the difference between what a developer produces and what a modder creates. Another thing to keep in mind is that, without a license, a modder can not gain monetary compensation(short of donation) for their work. Squad has the ability to at any time to seize control of any mod made for KSP and use it at their discretion, or not use it at all. I figure this is information you should know before coming up with more funding ideas.\n\nI love KSP, myself, but there can be too much enthusiasm, especially if you go into it blindly. Squad is doing a-ok, and while some people may have a differing opinion on the direction that the game is taking or whether or not it should have been released as a v1.0, the game is actually quite solid and doesn\u0027t need any other financial support other than to have more copies sold.\n\nIf you do ever get people who feel hesitant about plunking money down for it right away, remind them there is a demo version that is getting a huge update soon, but as it is now still gives a new player a good feel for the mechanics of the game. It won\u0027t hurt to even give that a showing in your streams, if you have the time to."},{"CreatedByName":"mrclucks","CreatedById":139561,"CreatedDateTime":"2015-07-08T02:25:15Z","Content":"\u003E \n\u003E I\u0027m actually rather done with support for KSP at the moment. After 650\u002B hours, it was an excellent investment, but the underlying issues of the game have finally drove me away. The last time I started it up to play, I looked at Val floating in space and just quit and played something else. Once 64 bit is a reality, then hopefully I will come back, but as it is now, I can\u0027t add any more mods to make it more pretty or it crashes, I can\u0027t build much of a space station at all or it slows to abysmal framerates (compounded by visual mods) and I still have no barn. Add in the tier balance issues and artificial grind due to the tier system and tech tree not being fleshed out well and the game has turned into a chore to play. Here\u0027s hoping 1.1 is better.\n\nI\u0027m not sure if anyone else has noticed but .04 has a x64 folder(not sure exactly the name) in its main folder that .0 and .02 didn\u0027t have. Maybe squad has a more stable version of 64bit that they\u0027re putting out secretly"},{"CreatedByName":"LordFerret","CreatedById":111598,"CreatedDateTime":"2015-07-08T02:46:30Z","Content":"*Clearly* this game is *not* out of beta."},{"CreatedByName":"basic.syntax","CreatedById":109920,"CreatedDateTime":"2015-07-08T03:21:40Z","Content":"Console availability is no guarantee of easy money. \n\nOngoing development funding is through current game sales, they aren\u0027t going to run a kickstarter unless they have a big expansion in mind, and maybe not even then. So if you have deep pockets, as others are suggesting, just buy lots of KSP."},{"CreatedByName":"pxi","CreatedById":78711,"CreatedDateTime":"2015-07-08T04:21:42Z","Content":"There\u0027s also umpteen different types of merchandise available as well.\n\nGiven Squad\u0027s reluctance to be pinned down on specific features, I\u0027d doubt they\u0027d be fond of crowdfunding specific features or even bugfixing, given that some bugs lie in the Unity engine itself, it isn\u0027t a problem that necessarily can be solved by throwing money at the problem.\n\nNow if you\u0027ll excuse me, I\u0027m going to engage in a small bit of hyperbole:\n\nThe other issue I see with crowdfunding would be the potential for wealthy fans to dictate to Squad what direction the game goes in. Like it or not, there would be that one guy who drops $500 into the pot with the expectation of getting their pet feature fast-tracked. It would sow seeds of discontent in the community the likes of which we have never seen.\n\n/hyperbole\n\nAs it stands now, we\u0027ve all paid the asking price for KSP, for the game Harvester and Squad want to make. We all have slightly different ideas about what we want from the game, but at the end of the day, we all have a relatively equal investment in the project. I am strongly in favour of keeping this arrangement as it stands. It\u0027s worked pretty well so far."},{"CreatedByName":"Monger","CreatedById":4143,"CreatedDateTime":"2015-07-08T07:05:03Z","Content":"\u0022Perfection is not achieved if there is nothing left to add, but if there is nothing left to take away\u0022 (Antoine de St. ExupÃƒÂ©ry)\n\nGame development, like any software development, cannot be hurried just by throwing more money at it. Also, adding big features this late into the project is almost guaranteed to be a bad idea. SQUAD may take my money via crowd funding once they start their next game, especially if it should be KSP 2."},{"CreatedByName":"Lubo","CreatedById":136723,"CreatedDateTime":"2015-07-08T07:27:23Z","Content":"@samstarman5 - did u read my initial text? im very well aware of the difference between mod related bugs and stock bugs, just read the thread text.\n\nWhy i would prefer crowdfunding over just buying ksp copys:\n\ni dont have the money to like 40 dollars instant. but i would have lets say 1-5 dollar to spare.\n\nIm persoanly a big fan of crowdfunding, in simple words just to see what we as an awesome community can make happen.\n\nAlthough Im not a Ksp player from hour zero, i started ksp with 0.9. Maybe i missed the crowdfunding in the earlydays.\n\nj have played about 500\u002B hours of KSP and there is still so much more to do.\n\nFor me KSP without the mods, i maybe would have played like 10-20h and never even set flag on the mun, and then forgot about this game, but i didnt thx to the all the awesome moders.\n\nIts only just for now, that KSP is in fullversion, but due to 32bit ram problems and modder bugs(what is not SQUADS fault, again) My passion and patience is continuesly dropping, i just dont want that to happen"},{"CreatedByName":"JellyCubes","CreatedById":11002,"CreatedDateTime":"2015-07-08T07:56:20Z","Content":"\u003E \n\u003E Just imagine if every KSP-Player chips in 1 Dollar, what could happen?\n\nLiterally every KSP player in existence (not including pirates and devs) has chipped in 10-40 times that amount when they bought the game.\n\n\u003E \n\u003E For me KSP without the mods, i maybe would have played like 10-20h and never even set flag on the mun, and then forgot about this game, but i didnt thx to the all the awesome moders.\n\nMaybe we should be crowdfunding the awesome modders, instead."},{"CreatedByName":"Linear","CreatedById":26619,"CreatedDateTime":"2015-07-08T08:43:18Z","Content":"Squad don\u0027t need more money, they need to employ some of the fantastic modders with working imagination and balls."},{"CreatedByName":"xiombargdei","CreatedById":125757,"CreatedDateTime":"2015-07-08T09:47:40Z","Content":"i wanted to support Squad by buying some stuff from the shops, but everything is so ugly ![:(](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif) (I might get a mug though)"},{"CreatedByName":"Commander Jebidiah","CreatedById":78685,"CreatedDateTime":"2015-07-08T09:56:17Z","Content":"Why crowd funding, the game costs Ã‚Â£30.00 already.\n\nSquad dont listen to us, as evidenced by bugs that are more than 2 years old.\n\nAlthough if they hear money will they listen?"},{"CreatedByName":"322997am","CreatedById":146422,"CreatedDateTime":"2015-07-08T09:57:12Z","Content":"\u003E \n\u003E I\u0027m not sure if anyone else has noticed but .04 has a x64 folder(not sure exactly the name) in its main folder that .0 and .02 didn\u0027t have. Maybe squad has a more stable version of 64bit that they\u0027re putting out secretly\n\nHighly unlikely"},{"CreatedByName":"selfish_meme","CreatedById":125899,"CreatedDateTime":"2015-07-08T09:59:08Z","Content":"\u003E \n\u003E I\u0027m not sure if anyone else has noticed but .04 has a x64 folder(not sure exactly the name) in its main folder that .0 and .02 didn\u0027t have. Maybe squad has a more stable version of 64bit that they\u0027re putting out secretly\n\nIt\u0027s probably for the Linux version which has had stable 64bit forever."},{"CreatedByName":"r4pt0r","CreatedById":90471,"CreatedDateTime":"2015-07-08T10:19:48Z","Content":"They have have over a million on steam alone. They have sold so many copies they are uncomfortable with people knowing how much money they are making.\n\n[https://www.reddit.com/r/KerbalSpaceProgram/comments/330vsi/squad_removes_steam_spy_data_from_public_view/cqgix7f](https://www.reddit.com/r/KerbalSpaceProgram/comments/330vsi/squad_removes_steam_spy_data_from_public_view/cqgix7f)\n\nSo they dont exactly need charity.\n\n**Edited \u003Ctime datetime=\u00222015-07-08T10:22:01Z\u0022 title=\u002207/08/2015 10:22  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 8, 2015\u003C/time\u003E by r4pt0r**"},{"CreatedByName":"Majorjim!","CreatedById":61954,"CreatedDateTime":"2015-07-08T13:22:41Z","Content":"\u003E \n\u003E Hi Kerbanouts,\n\u003E I was just thing about that idea. Here is the deal.\n\u003E \n\u003E Im almost sure we all agree that KSP is one if not the best Computer game ever made. At least for people like me, a numbers/science/space geek.\n\u003E \n\u003E Im loving it, but this love gets very much distracted by some annoying stock Bugs(SB), plus many more Mods induced bugs(MB) and crashes. These Mod related bugs sure SQUAD is not to blame for. If they r indeed mod related. Im not a coder, just a casual gamer.(think about streaming resently)\n\u003E \n\u003E I feel besides the SB and MB, KSP has so much more potential in terms of maybe Coloniazlisation, and reality related activities like warpdrive and other awesome and Engines/science experiments. And maybe add some Science to find Other life forms on other planets, solarsystems. I personal would be amazed if they implement some kind of minigames to different Science experiments, to maybe maxamize the science on the first go and/or playing around with the informations provided by the given science experiments. \n\u003E \n\u003E I know there are lots of mods for this, but then we have MB.\n\u003E \n\u003E To the Point:\n\u003E \n\u003E I personally think if we as a community support SQUAD with something like Crowdfunding or mabye give ideas to make the twitchstream more exciting, or whatever.\n\u003E \n\u003E We maybe can accelerate the process of fixing bugs, adding new cool stuff or maybe get more Mods to offical status. \n\u003E \n\u003E Just curious if u guys would toss in some coins to help making this amazing game even more amazing. - Just imagine if every KSP-Player chips in 1 Dollar, what could happen?\n\u003E \n\u003E What is Squad point of view to this idea?\n\u003E \n\u003E greetings\n\u003E \n\u003E Lukas Kerman\n\nNo, no, no.\n\n Squad have had plenty of our money. They are still charging full price for a broken, unfinished game. They wont get a penny more from me until the game is actually finished and working properly."},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-07-08T14:23:32Z","Content":"\u003C-- Business school guy here.\n\nThe money they have already made is irrelevant to continued development; that money is already made and they keep it even if they stop development right this moment. Development of KSP will likely only continue for as long as **new** revenue exceeds the operating costs (by whatever margin the backers consider acceptable), or while they are developing towards another revenue peak (like release of a paid-for expansion, or release on another platform, etc).\n\n(Speaking very much unofficially, I have no inside knowledge of Squad\u0027s financial or product planning.)\n\n**Edited \u003Ctime datetime=\u00222015-07-08T14:28:27Z\u0022 title=\u002207/08/2015 02:28  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 8, 2015\u003C/time\u003E by Red Iron Crown**"},{"CreatedByName":"Rickenbacker","CreatedById":2349,"CreatedDateTime":"2015-07-08T16:35:59Z","Content":"\u003E \n\u003E I personally think if we as a community support SQUAD with something like Crowdfunding or mabye give ideas to make the twitchstream more exciting, or whatever.\n\u003E \n\u003E We maybe can accelerate the process of fixing bugs, adding new cool stuff or maybe get more Mods to offical status.\n\nNo. They don\u0027t need the money, and even if they did, it\u0027d make them feel obliged to listen to what the players wanted instead of sticking with their own plan. Which is almost always a huge mistake in game development."}]}