{"TopicId":115462,"ForumId":20,"TopicTitle":"just a thanks to all mod creators out there","CreatedByName":"hawk_za","CreatedById":59433,"CreatedDateTime":"2015-07-09T07:00:41Z","PageNum":1,"Articles":[{"CreatedByName":"hawk_za","CreatedById":59433,"CreatedDateTime":"2015-07-09T07:00:41Z","Content":"\n\u003Cp\u003Ehi all I just recently learned about the ckan project and got stuck in\u003C/p\u003E\u003Cp\u003Eand well that got my mods list up to about 27 form the 6 I had to manually install previously and man what a game changer.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\u003Cp\u003EI am finally able to play the game I want when this was fist released....and that got me thinking. \u003C/p\u003E\u003Cp\u003EOver 45 versions and 5 years in the running and well mods have always been there they have been a crucial part of this game making it a bigger success than it could have been on its own but that aside I suddenly realized that for 5 years and over 45 versions some mods just kept getting updated and THAT is a GARGANTUAN task \u003C/p\u003E\u003Cp\u003Eone that I feel I need to say thank you, for if it was not for the mods I play with I would have quit playing some time ago so \u003C/p\u003E\u003Cp\u003ETHANK YOU \u003C/p\u003E\u003Cp\u003ESeriously for all the hard work for all the updates for enduring all the criticisms and the disappointments and for sticking it through.\u003C/p\u003E\u003Cp\u003EI not only commend you but thank you from the bottom of my heart for helping me create the ksp experience I needed and wanted. \u003C/p\u003E\u003Cp\u003EMore so for doing it for free I used to be a volunteer so I know what a sacrifice you guys make.\u003C/p\u003E\n"},{"CreatedByName":"Unheld","CreatedById":74707,"CreatedDateTime":"2015-07-09T07:16:41Z","Content":"\n\u003Cp\u003EI can only join in.\u003C/p\u003E\u003Cp\u003EAll the modders do great work and enable us, the players and beneficiaries, to piece together the game we like to have.\u003C/p\u003E\u003Cp\u003EAlthough KSP is a great game, I don\u0027t think I will ever play it again without mods.\u003C/p\u003E\u003Cp\u003ESo from me too a big shoutout: THANK YOU\u003C/p\u003E\n"},{"CreatedByName":"LitaAlto","CreatedById":110917,"CreatedDateTime":"2015-07-09T21:32:33Z","Content":"\n\u003Cp\u003EGratitude is awesome. And KSP modders are awesome and deserve all the gratitude.\u003C/p\u003E\u003Cp\u003EEspecially the poor devils who have to maintain MechJeb.\u003C/p\u003E\n"},{"CreatedByName":"micha","CreatedById":113840,"CreatedDateTime":"2015-07-10T08:53:12Z","Content":"\n\u003Cp\u003E\u002B1 thanks to all the hard-working modders! The game wouldn\u0027t be what it is without you guys and girls!\u003C/p\u003E\n"},{"CreatedByName":"Godot","CreatedById":16902,"CreatedDateTime":"2015-07-10T09:17:48Z","Content":"\n\u003Cp\u003EI absolutely agree ... several mods have greatly contributed to keeping my interest up in KSP ... thanks\u003C/p\u003E\n"},{"CreatedByName":"Rithaniel","CreatedById":146402,"CreatedDateTime":"2015-07-10T09:37:08Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-family:UICTFontTextStyleBody;\u0022\u003EI\u0027m on the same page. Seeing some of the incredible mods people have made, it\u0027s kind of inspirational. Kudos to all modders who checked out this forum today, saw this thread, and read this post!\u003C/span\u003E\u003C/p\u003E\n"}]}