{"TopicId":115544,"ForumId":20,"TopicTitle":"Anyone handy with Unity engine? Disable Doppler","CreatedByName":"GorillaZilla","CreatedById":100625,"CreatedDateTime":"2015-07-10T11:59:42Z","PageNum":1,"Articles":[{"CreatedByName":"GorillaZilla","CreatedById":100625,"CreatedDateTime":"2015-07-10T11:59:42Z","Content":"\n\u003Cp\u003EDoes anyone know how to disable the Doppler audio effect (things coming towards you sound higher in pitch) in Unity while playing Kerbal space program?\u003C/p\u003E\u003Cp\u003EI think it is the cause of the sound being broken and choppy when things explode at high speed (Which is destroying the sound for me)\u003C/p\u003E\u003Cp\u003EHeres the video of someone else having the same issue, I\u0027m having exactly the same problem.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/TWuDqRYtCDk?start=83\u0026amp;feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EI\u0027d like to just turn off the doppler effect just as a temporary fix untill squad gets around to working on the sound overhaul.\u003C/p\u003E\u003Cp\u003EI can\u0027t find any .CFG or .ini files or similar I can just edit a value in to turn off the doppler in Kerbal\u0027s unity engine..... I\u0027ve opened and searched every file in the entire of KSP for \u0022Dop\u0022 and only found the lines:\u003C/p\u003E\u003Cp\u003Eget_dopplerlevel\u003C/p\u003E\u003Cp\u003Eset_dopplerlevel\u003C/p\u003E\u003Cp\u003EIn the unityengine.dll and Assembly-CSharp.dll files, but they have no values next to them to change and just seem to be lines detailing recognisable commands....\u003C/p\u003E\u003Cp\u003EIs there any way to open a command console and input something like set_dopplerlevel 0 or put a cfg or something in gamedata that would achieve the same thing?\u003C/p\u003E\u003Cp\u003EWould anyone by kind enough to help or advise please?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-10T13:45:59Z\u0022 title=\u002207/10/2015 01:45  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 10, 2015\u003C/time\u003E by GorillaZilla\u003C/strong\u003E\n\u003C/span\u003E\n"}]}