{"TopicId":115579,"ForumId":25,"TopicTitle":"The Asteroid Challenge (Reworked - for all your asteroid needs!)","CreatedByName":"TJPrime","CreatedById":101641,"CreatedDateTime":"2015-07-10T19:29:19Z","PageNum":1,"Articles":[{"CreatedByName":"TJPrime","CreatedById":101641,"CreatedDateTime":"2015-07-10T19:29:19Z","Content":"A couple days ago, User Ilovespiders01 posted a challenge to land a C-class asteroid on kerbin. However, the thread closed due to not having any structure. So, along with his ideas, I have some challenges for you involving asteroids. I\u0027ll be working on all challenges over the next few days, so post suggestions!\n\nYou can use any mods you want (unless otherwise stated) that aren\u0027t too over-powered (I.E: No hyperedit; No engines with super-high thrust and/or ISP. The Interstellar mod is allowed, however)\n\n\u003E \n\u003E **GOAL:** Land an asteroid of any size on any celestial body. \n\u003E \n\u003E **Details:** This is a slightly built-on version of the original challenge. Instead of being limited to having just a C-class asteroid and landing it on kerbin, you can land any asteroid anywhere. \n\u003E \n\u003E If you have any planet packs, please say and I\u0027ll give you a specific multiplier.\n\u003E \n\u003E Using the Sentinel Telescope provided by the Asteroid Day mod voids all multipliers and all bodies except in the kerbin system have 1.25x for atmospheric bodies, and 1.5x for everything else.\n\u003E \n\u003E Any information mod other than mechjeb is recommended for this part of the challenge.\n\u003E \n\u003E **Leaderboard:**\n\u003E \n\u003E 1st:\n\u003E \n\u003E 2nd:\n\u003E \n\u003E 3rd:\n\u003E \n\u003E **Special Mentions:**\n\u003E \n\u003E \n\n\u003E \n\u003E **GOAL:** Construct a space station in orbit around any planet, with at least one asteroid attached\n\u003E \n\u003E **Details:** Have a space station that can support at least 5 kerbals, with power, communication with kerbin and emergency return craft that can return to kerbin or another station with 10 active kerbals on board\n\u003E \n\u003E **Leaderboard:**\n\u003E \n\u003E 1st:\n\u003E \n\u003E 2nd:\n\u003E \n\u003E 3rd:\n\u003E \n\u003E **Special Mentions:**\n\u003E \n\u003E \n\n**Multipliers:**\n\n![KaDDdyS.png](http://i.imgur.com/KaDDdyS.png)\n\n**Scoring:**\n\nScores are calculated with the following formula:\n\nAsteroid mass (in tonnes) \\* Multiplier \\* (relative inclination to planet system (if inclination is equal to or greater than 10 degrees) / 10)\n\nGood luck! I\u0027ll post my entries soon!"},{"CreatedByName":"Phafor","CreatedById":98756,"CreatedDateTime":"2015-07-22T08:16:39Z","Content":"This is going to be a challenge!"},{"CreatedByName":"Phafor","CreatedById":98756,"CreatedDateTime":"2015-07-22T11:21:35Z","Content":"Well here is my entry!\n\n[http://imgur.com/a/66BhL](http://imgur.com/a/66BhL)\n\nI was going to land it on Laythe but after some quick calculations I came to the conclusion I would need 2.01 times the mass of my dry mass as wet mass with Isp = 800s\n\nWhich would mean about 75 Tanks I used in my upperstage\n\nI also calculated it with Xenon tanks and I would need 500 of the 1,25m kind.\n\nMaybe I\u0027ll get some mod with those nice engines of 20000s Isp in vacuum!\n\n\u003E \n\u003E  \n\u003E ![zYZkvGN.png](http://i.imgur.com/zYZkvGN.png)\n\nPoints I\u0027d get: 1639.38281\\*1\\*128.83682=211213 Points.\n\n**Edited \u003Ctime datetime=\u00222015-07-22T11:27:48Z\u0022 title=\u002207/22/2015 11:27  AM\u0022 data-short=\u00228 yr\u0022\u003EJuly 22, 2015\u003C/time\u003E by Phafor**\n  \nPoints calculated"},{"CreatedByName":"Phafor","CreatedById":98756,"CreatedDateTime":"2015-07-25T13:00:50Z","Content":"It seems like I\u0027m not going to get added to the leaderboard ![:(](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif)"},{"CreatedByName":"purpleivan","CreatedById":120081,"CreatedDateTime":"2015-07-31T16:40:07Z","Content":"I started on a mission to land a 1500\u002B ton asteroid on Kerbin, but I think I might call it a day if the leaderboard isn\u0027t going to be maintained."}]}