{"TopicId":115633,"ForumId":70,"TopicTitle":"space station disappeared after game error","CreatedByName":"sinpro","CreatedById":119813,"CreatedDateTime":"2015-07-11T13:13:43Z","PageNum":1,"Articles":[{"CreatedByName":"sinpro","CreatedById":119813,"CreatedDateTime":"2015-07-11T13:13:43Z","Content":"\n\u003Cp\u003EHi all. It\u0027s the 2nd time that I suffer for this error\u003C/p\u003E\u003Cp\u003EI had a space station which was near to change SOI between kerbol and jool, so I selected it in the tracking station. Game was like bugged, showing NaaN in the navball and nothing was working, so I restarted the game. After this space station just disappeared, like if it has never existed (mission to build space station still remains)\u003C/p\u003E\u003Cp\u003EMy question is, how could I know what is causing this failure?? The first time happened in an unmanned space station to orbit around kerbol, so it didnt hurt? Now I have to spend the time and money to launch it again, and one kerbal is now missed\u003C/p\u003E\u003Cp\u003EMods installed:\u003C/p\u003E\u003Cp\u003Etoolbar\u003C/p\u003E\u003Cp\u003Eambientlightadjustment\u003C/p\u003E\u003Cp\u003Eeditor extensions JSI\u003C/p\u003E\u003Cp\u003EkerbalEngineer\u003C/p\u003E\u003Cp\u003EKSP-AVC\u003C/p\u003E\u003Cp\u003EMavyFish\u003C/p\u003E\u003Cp\u003EShipManifest\u003C/p\u003E\u003Cp\u003ETextureReplacer\u003C/p\u003E\u003Cp\u003ETrajectories\u003C/p\u003E\u003Cp\u003EAlarmClock\u003C/p\u003E\n"},{"CreatedByName":"HoloYolo","CreatedById":138353,"CreatedDateTime":"2015-07-11T13:17:08Z","Content":"\n\u003Cp\u003EDid you delete one of the mods that had a part on the space station? If so then the game can\u0027t render the station and it deletes it.\u003C/p\u003E\n"},{"CreatedByName":"sinpro","CreatedById":119813,"CreatedDateTime":"2015-07-11T13:25:07Z","Content":"\n\u003Cp\u003EI updated some mods, which means delete and replace them with new versions, but I think that none of the mods that I use have parts, because all are info/visuals mods like KER etc etc\u003C/p\u003E\n"},{"CreatedByName":"HoloYolo","CreatedById":138353,"CreatedDateTime":"2015-07-11T13:27:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sinpro\u0022 data-cite=\u0022sinpro\u0022\u003E\u003Cdiv\u003EI updated some mods, which means delete and replace them with new versions, but I think that none of the mods that I use have parts, because all are info/visuals mods like KER etc etc\u003C/div\u003E\u003C/blockquote\u003EDo you have Steam KSP?\n"},{"CreatedByName":"sinpro","CreatedById":119813,"CreatedDateTime":"2015-07-11T13:28:18Z","Content":"\n\u003Cp\u003Eyes, steam version\u003C/p\u003E\n"},{"CreatedByName":"HoloYolo","CreatedById":138353,"CreatedDateTime":"2015-07-11T13:31:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sinpro\u0022 data-cite=\u0022sinpro\u0022\u003E\u003Cdiv\u003Eyes, steam version\u003C/div\u003E\u003C/blockquote\u003EAlright, verify cache, and reinstall if you have to.\n"},{"CreatedByName":"Korizan","CreatedById":142032,"CreatedDateTime":"2015-07-11T14:25:09Z","Content":"\n\u003Cp\u003EAnd this is why when I start a new career I selected Hard then went and put the save game and quick save options back in.\u003C/p\u003E\u003Cp\u003EI save the game A LOT, start with 2000 and work my way down and eventually wipe out old saves and start the count down again.\u003C/p\u003E\u003Cp\u003EEspecially if you are like me and have 6 different flights going at the same time.\u003C/p\u003E\u003Cp\u003EIt isn\u0027t cheating it is protection again bugs in KSP and bugs injected from mods.\u003C/p\u003E\n"},{"CreatedByName":"jdcr","CreatedById":117829,"CreatedDateTime":"2015-07-11T15:28:47Z","Content":"\n\u003Cp\u003EI\u0027ve had this error a lot since 1.0. It occurs when switching to or from certain ships. It only happens with two or three of my ships, but for those it\u0027s really frequent, often taking 2-4 reloads to make the switch. I\u0027m not quite sure what\u0027s particular about these ships. They\u0027re large(-ish), but so are others that don\u0027t cause this kind of crash. I thought it might be a clipping issue, although I don\u0027t clip excessively in the editor (just lights and such stuff). \u003C/p\u003E\u003Cp\u003EWin7 32, Steam version, no mods except KER and KAC.\u003C/p\u003E\n"},{"CreatedByName":"Evanitis","CreatedById":145424,"CreatedDateTime":"2015-07-11T15:42:27Z","Content":"\n\u003Cp\u003EHad that disappearence too - I associate it with ram filling up (I play KSP on a potato). Since you use texture replacer, I suspect you probably not playing it on a nuclear rig either.\u003C/p\u003E\u003Cp\u003EI usually experience that loading difficulty when I want to switch to a big constuction during long playing sessions. Screen goes mostly black besides some UI elements. Closing the program these times usually corrupted my save, more precisely destroyed or reverted the craft in question. My pre-emptive solution (besides using multiple saves by alt-f5) is restarting KSP before loading up a bigger craft.\u003C/p\u003E\u003Cp\u003EBTW, those buggy loadings finish sooner or later if you are patient (in case you forgot to make multiple saves).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-11T15:44:52Z\u0022 title=\u002207/11/2015 03:44  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 11, 2015\u003C/time\u003E by Evanitis\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"mrclucks","CreatedById":139561,"CreatedDateTime":"2015-07-11T15:47:05Z","Content":"\n\u003Cp\u003ELike it has been said, back up your saves after you have something big or significant. In my non os drive I have a folder for ksp with all the stock versions, all mods I downloaded separated by version, and all saves(which I should really seperate by version and mods they rely on). I also back it up every so often to my external hard drive so I can always resume whatever I have been playing. \u003C/p\u003E\u003Cp\u003EIt\u0027s precautions like this that only takes ten or so minutes to go back to, rather than an hour for having to rebuild and relaunch everything. \u003C/p\u003E\u003Cp\u003EYou can always just back up your saves to your desktop since saves are just a few megabytes\u003C/p\u003E\n"},{"CreatedByName":"Vegetal","CreatedById":147251,"CreatedDateTime":"2015-07-11T16:16:14Z","Content":"\n\u003Cp\u003EOne thing I\u0027ve learned: I always save the game before going into the tracking station and flying a ship.\u003C/p\u003E\u003Cp\u003EOne time I had 3 ships on the same course to duna, and the game always crashed on the last one I selected. I kept loading the game and selecting a different ship for last, and it always crashed, no matter which ship I chose (they were all different designs).\u003C/p\u003E\u003Cp\u003EThe conclusion I took from this is that this kind of crash isn\u0027t related to the ship you are selecting, it\u0027s some internal game engine issue that arises on certain situations. I also noticed it always happened on interplanetary space, never on a planet\u0027s SOI.\u003C/p\u003E\n"},{"CreatedByName":"Tourist","CreatedById":143403,"CreatedDateTime":"2015-07-12T23:31:26Z","Content":"\n\u003Cp\u003ESame thing happened to me. In one instance I had four ships, heading to different destinations, Moho, Dres, Jool and Eve. Changed back to the Moho ship preparing for course adjustment, got the not a number error, reloaded and the ship was gone. This error replicated every time I quick reloaded. Happened in another instance where I had a ship going to Jool and Eve. The Jool ship to disappeared after the not a number error occurred. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E The only mod I use is Kerbal Alarm Clock. \u003C/p\u003E\u003Cp\u003EI\u0027m not sure if this got around the problem, or I was just lucky, but I found it did not occur if I changed to the ship once it changed SOI at the destination... this of course means nailing your encounter at launch or soon after.... at the very least performing all adjustments before launching the second ship. Also save often.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2015-07-13T00:03:22Z","Content":"\n\u003Cp\u003EMoved to modded support.\u003C/p\u003E\n"},{"CreatedByName":"sinpro","CreatedById":119813,"CreatedDateTime":"2015-07-13T20:12:52Z","Content":"\n\u003Cp\u003E3rd ship lost \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E I can restore backup, but it\u0027ll mean loosing my last 3 hours\u003C/p\u003E\u003Cp\u003ESeriously, not sure if reinstall, start new career or just quit ksp for a while \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E(\u003C/p\u003E\n"}]}