{"TopicId":115619,"ForumId":32,"TopicTitle":"\u0026quot;Bottoms Up\u0026quot; Rocket Construction - Anyone else do this?","CreatedByName":"Goddess Bhavani","CreatedById":14001,"CreatedDateTime":"2015-07-11T05:50:59Z","PageNum":1,"Articles":[{"CreatedByName":"Goddess Bhavani","CreatedById":14001,"CreatedDateTime":"2015-07-11T05:50:59Z","Content":"\n\u003Cp\u003EHere I am with my slowly-progressing, fresh 1.0.4 Career game finally progressing out from flying Micro Shuttles and moving on to 2.5m stages and Munar missions. This round I would like to use SRB-derived launchers inspired from the NASA Ares I and its proposed heavy-lift configurations.\u003C/p\u003E\u003Cp\u003EI had big fun with launching primitive orbital stations on SRB-derived launchers in 1.0.2.\u003C/p\u003E\u003Cp\u003EPartway through constructing a crew transfer vehicle and a prototype munar lander, I realized assembly of multiple ships could be done much easier if the rocket stayed put and I simply swapped the payload on top of the rocket. To facilitate this I set the root part as the SRB, and manufactured a ship on top of it. Each time I finished a ship, I would simply set the root part to be the command module, save it, then place it on the ground.\u003C/p\u003E\u003Cp\u003ESoon, I had a mini-museum of my future Munar expedition vehicles laid out on the VAB floor!\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/0DN18\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003ENormally, what I\u0027d do is save a rocket as a sub-assembly and name it by core configuration and tonnage (capability to LKO or LMO) but I felt building the ships \u0027bottoms up\u0027 allowed me to have a better visualization of how the completed stack would look like, and how much tonnage I can safely launch using the Triple Kickback configuration before I needed moar boosters.\u003C/p\u003E\n"},{"CreatedByName":"Xyphos","CreatedById":139010,"CreatedDateTime":"2015-07-11T06:38:18Z","Content":"\n\u003Cp\u003EDifferent strokes for different folks.\u003C/p\u003E\u003Cp\u003EI always build top-down because I was taught to solve complex problems backwards.\u003C/p\u003E\u003Cp\u003Eyou seem to solve forwards, and props to you.\u003C/p\u003E\n"},{"CreatedByName":"Camaron","CreatedById":100218,"CreatedDateTime":"2015-07-11T07:30:41Z","Content":"\n\u003Cp\u003EI could never do this. Everything I build is different, and is almost never built in a mono-column design.\u003C/p\u003E\n"},{"CreatedByName":"tg626","CreatedById":112361,"CreatedDateTime":"2015-07-11T07:35:11Z","Content":"\n\u003Cp\u003EI often refine and reuse a single design lifter for multiple missions, but I use pick off the rocket from the payload and save it as a sub assembly.\u003C/p\u003E\n"},{"CreatedByName":"Foxster","CreatedById":113764,"CreatedDateTime":"2015-07-11T08:28:46Z","Content":"\n\u003Cp\u003EMy lifter/transfer design changes depending on the payload. I suppose I could build one over-powered lifter and use it for all payloads but that\u0027s just a waste of everything.\u003C/p\u003E\n"},{"CreatedByName":"Goddess Bhavani","CreatedById":14001,"CreatedDateTime":"2015-07-11T14:20:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tg626\u0022 data-cite=\u0022tg626\u0022\u003E\u003Cdiv\u003EI often refine and reuse a single design lifter for multiple missions, but I use pick off the rocket from the payload and save it as a sub assembly.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think for early game at least, several classes of rockets will all look the same, improving gradually as the better tech trees are unlocked. I typically save the launcher as a subassembly and class it by \u0027generation\u0027 and lift capacity. \u003C/p\u003E\u003Cp\u003EAs the game goes on I may have yet more generic stacks of general purpose launchers - right now its either Giant SRBs or Skipper / 2.5m cores so I thought to reverse the build procedure and make standard bottom ends first \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Brofessional","CreatedById":2080,"CreatedDateTime":"2015-07-11T15:29:12Z","Content":"\n\u003Cp\u003EI build a series of efficient lifters for different payload weights, then design my upper stages to be within those weight limits.\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-07-11T15:50:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Brofessional\u0022 data-cite=\u0022Brofessional\u0022\u003E\u003Cdiv\u003EI build a series of efficient lifters for different payload weights, then design my upper stages to be within those weight limits.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI do the exact opposite; I design efficient upper stages and then design efficient lifters for their weight \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003ETEHO, but I would be lost if I tried to design that way.\u003C/p\u003E\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"},{"CreatedByName":"tranenturm","CreatedById":143304,"CreatedDateTime":"2015-07-11T15:55:38Z","Content":"\n\u003Cp\u003EI was just starting down this line of thinking. I don\u0027t compute my dv ahead of time, but do things by trial and error. So knowing which systems get which payloads where is handy to me.\u003C/p\u003E\n"},{"CreatedByName":"klgraham1013","CreatedById":105132,"CreatedDateTime":"2015-07-11T16:54:56Z","Content":"\n\u003Cp\u003EI typically have around 4 or 5 general lifter rockets I use for everything. When starting a new save, I always build these rockets first. I choose which rocket to use depending on the payload mass.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-07-11T19:34:37Z","Content":"\n\u003Cp\u003EAlthough I do all my designing top-down, thinking of the mission from end-to-beginning, it turns out that most of my payloads fall into about 4 general weight classes. This means I have about 4 broad classes of standard lifters for them. But I\u0027ve never bothered to make these lifters into subassemblies to stick on payloads, I just have them memorized and build whichever one is needed nearly as fast as I could slap on a subassembly. Besides, the payload weight classes are broad as mentioned so to save money in career games, each needs a custom lifter anyway. So what always happens is, I slap together the main parts of a generic lifter of the needed oomph, then go with a bigger or smaller tank here and there, maybe a different engine, tweak fuel and thrust,. fiddle with any SRBs needed, etc. Thus, while I could probably give a name to my lifters of different diameters, I don\u0027t. None of them are designed as things unto themselves and them payloads made to fit them. It\u0027s always the lifter being made to fit the payload, even though looking at my rockets on the pad you might not realize this.\u003C/p\u003E\u003Cp\u003EBut seriously, because KSP is based on Lego-like tanks of various sizes, if you want to be realistic, there are no \u0022standard lifters\u0022 in KSP in the same sense we have on Earth. No parts supplier has a factory that builds entire rockets, so there\u0027s no assembly line that makes a lifter of a given size. Instead, the assembly lines are ginning out tanks in a variety of sizes and different types of engines, and it\u0027s up to the Boffins at KSC to assemble various parts into a coherent whole. If KSC does make a \u0022standard lifter\u0022 design and says \u0022we\u0027re only buying these parts\u0022, then all the subcontractors will only make those parts, and then Kraken help you if you really need a part that\u0027s not in the \u0022standard lifter\u0022.\u003C/p\u003E\n"},{"CreatedByName":"Dispatcher","CreatedById":78707,"CreatedDateTime":"2015-07-11T19:37:55Z","Content":"\n\u003Cp\u003ETop down for me.\u003C/p\u003E\n"},{"CreatedByName":"Skorpychan","CreatedById":72052,"CreatedDateTime":"2015-07-11T20:04:19Z","Content":"\n\u003Cp\u003ESort of. I design the payload top-down, because that\u0027s how the staging works. Pod, chutes, science, upper stage, etc. Then the standard lifter is picked out and stuck on from a subassembly. I tend to use one of two standard designs (Large and Extra Large), with the possibility of adding an Absurd size as well.\u003C/p\u003E\n"},{"CreatedByName":"Goddess Bhavani","CreatedById":14001,"CreatedDateTime":"2015-07-12T01:06:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022 data-cite=\u0022Geschosskopf\u0022\u003E\u003Cdiv\u003E (partial quote)\u003Cp\u003EBut seriously, because KSP is based on Lego-like tanks of various sizes, if you want to be realistic, there are no \u0022standard lifters\u0022 in KSP in the same sense we have on Earth. No parts supplier has a factory that builds entire rockets, so there\u0027s no assembly line that makes a lifter of a given size. Instead, the assembly lines are ginning out tanks in a variety of sizes and different types of engines, and it\u0027s up to the Boffins at KSC to assemble various parts into a coherent whole. If KSC does make a \u0022standard lifter\u0022 design and says \u0022we\u0027re only buying these parts\u0022, then all the subcontractors will only make those parts, and then Kraken help you if you really need a part that\u0027s not in the \u0022standard lifter\u0022.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHaha indeed! If a payload falls out of margin then the moar booster strategy needs to be applied, or in the case of the Delta or conceptual Ares (SRB derived) rockets, use a configuration with moar boosters. I usually have boosters pre-assembled on the A, B, C or whatever configuration I have for the launcher class.\u003C/p\u003E\u003Cp\u003EI thought as well that the idea of assembling the rocket and setting it aside makes for some interesting decision making akin to deciding on a launch vehicle in real life - I guess early in the project mission planners would be deciding if they are going to order up a Delta or something else, and what configuration / boosters they want way in advance. Of course I think things are simpler for the Roscosmos - they just have Protons for medium/heavy lift, and Soyuz in various upper stage configurations for smaller ones.\u003C/p\u003E\n"},{"CreatedByName":"Xyphos","CreatedById":139010,"CreatedDateTime":"2015-07-12T02:31:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022klgraham1013\u0022 data-cite=\u0022klgraham1013\u0022\u003E\u003Cdiv\u003EI typically have around 4 or 5 general lifter rockets I use for everything. When starting a new save, I always build these rockets first. I choose which rocket to use depending on the payload mass.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Enow that\u0027s something I do also; first subassembly made each time is a 4-2-1 Kickback SRB lifter for small probes and stuff.\u003C/p\u003E\n"},{"CreatedByName":"Cairol","CreatedById":145279,"CreatedDateTime":"2015-07-12T08:56:31Z","Content":"\n\u003Cp\u003EI\u0027m doing basicly the same as klgraham.\u003C/p\u003E\u003Cp\u003EI save my payloads as sub-assemnlies and put them on top of my well-proven lifter stages.\u003C/p\u003E\u003Cp\u003EThere are a couple of different lifter stages for certain purposes.\u003C/p\u003E\u003Cp\u003ESo I know immediately what to pick to get my payload to LKO or to Duna or whatever with only slight modifications.\u003C/p\u003E\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2015-07-12T09:24:18Z","Content":"\n\u003Cp\u003EI mostly design lower stages to get the upper stages to the point they need to be by the time they need to fire.\u003C/p\u003E\u003Cp\u003EThat said, I also have to set lifters that will get set weights to LKO\u003C/p\u003E\n"},{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-07-12T09:27:16Z","Content":"\n\u003Cp\u003EKSP automatically adds new stages below the current one, so it saves a lot of work with rearranging the whole staging sequence in reverse order if you build top-down. Other than that, I keep a couple of launch stage subassemblies for various payloads.\u003C/p\u003E\n"},{"CreatedByName":"*Aqua*","CreatedById":103926,"CreatedDateTime":"2015-07-12T10:09:03Z","Content":"\n\u003Cp\u003EPutting the payload top-down? What about the whole rocket?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/CENrhhXqjg0?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-12T10:11:39Z\u0022 title=\u002207/12/2015 10:11  AM\u0022 data-short=\u00228 yr\u0022\u003EJuly 12, 2015\u003C/time\u003E by *Aqua*\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Bev7787","CreatedById":136501,"CreatedDateTime":"2015-07-12T10:27:37Z","Content":"\n\u003Cp\u003EI like to standardise not only rockets, but contract satellites basic designs and manned capsule standard designs. Standardisation ftw\u003C/p\u003E\n"},{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-07-12T10:38:16Z","Content":"\n\u003Cp\u003EOh, the whole transfer stage \u002B payload upside down is common enough for me. Especially if it ends with a docking port.\u003C/p\u003E\u003Cp\u003EYesterday the middle section of a large expedition was launched. Sr. docking ports on both ends. One port attached to the launch stage. Slapped a Poodle on the other. Looked funny once jettisoned, a lone engine floating in space.\u003C/p\u003E\u003Cp\u003EAnd my Minmus Jumping Lab doesn\u0027t even have a front or back. It has engines on both ends, lands with either end (diagonally) and then rests on a side.\u003C/p\u003E\n"},{"CreatedByName":"SemiaCloud","CreatedById":138816,"CreatedDateTime":"2015-07-12T15:42:00Z","Content":"\n\u003Cp\u003EI do that sometimes.\u003C/p\u003E\n"},{"CreatedByName":"SAI Peregrinus","CreatedById":125558,"CreatedDateTime":"2015-07-12T16:42:03Z","Content":"\n\u003Cp\u003EI use Procedural Parts.\u003C/p\u003E\u003Cp\u003ESo I\u0027ve got a few broad lifter classes, and to fine-tune in between them I just make the appropriate tank shorter.\u003C/p\u003E\n"},{"CreatedByName":"sdj64","CreatedById":100819,"CreatedDateTime":"2015-07-12T19:09:05Z","Content":"\n\u003Cp\u003EI use Kerbal Engineer and it gets very confused when you build bottom-up. Only the first stage shows up on the delta-V calculation. Often I will start building from a probe core at the top of the lift rocket and right below the payload decoupler if I\u0027m testing a lift rocket with a payload that has its own engines and fuel, so that KER calculates only for the rocket.\u003C/p\u003E\u003Cp\u003EFor the OP: Have you tried saving your lifters as sub-assemblies? That\u0027s an easy way to use the same lifter for different payloads.\u003C/p\u003E\n"},{"CreatedByName":"leops1984","CreatedById":78510,"CreatedDateTime":"2015-07-13T00:46:36Z","Content":"\n\u003Cp\u003EI build my lifters and payloads independently. I have lifters of various sizes and capabilities saved as separate .craft files. I build the payload, then figure out which lifter I need. I transfer the payload over as a subassembly.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sdj64\u0022 data-cite=\u0022sdj64\u0022\u003E\u003Cdiv\u003EI use Kerbal Engineer and it gets very confused when you build bottom-up. Only the first stage shows up on the delta-V calculation. Often I will start building from a probe core at the top of the lift rocket and right below the payload decoupler if I\u0027m testing a lift rocket with a payload that has its own engines and fuel, so that KER calculates only for the rocket.\u003Cp\u003EFor the OP: Have you tried saving your lifters as sub-assemblies? That\u0027s an easy way to use the same lifter for different payloads.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETry changing the root part to something in your payload - when I have similar issues that\u0027s usually it.\u003C/p\u003E\n"}]}