{"TopicId":115799,"ForumId":44,"TopicTitle":"What is the definition of life?","CreatedByName":"RAINCRAFTER","CreatedById":127524,"CreatedDateTime":"2015-07-13T17:33:02Z","PageNum":1,"Articles":[{"CreatedByName":"RAINCRAFTER","CreatedById":127524,"CreatedDateTime":"2015-07-13T17:33:02Z","Content":"\n\u003Cp\u003EWe all know by instinct what is \u0022lively\u0022 here on Earth and what isn\u0027t.\u003C/p\u003E\u003Cp\u003EHumans? Alive. Fire? No.\u003C/p\u003E\u003Cp\u003EHowever, we need to discover the best definition for life if we want to go anywhere with the hunt for ET. Wikipedia and the \u003Cstrong\u003Emajority\u003C/strong\u003E of the world says it\u0027s 7 processes called \u0022biological processes\u0022.\u003C/p\u003E\u003Cp\u003EHowever (again \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E), NASA thought this would get in the way of searching for aliens (one example is that one process is re-production. Mules don\u0027t re-produce, so they would be dead even though our instincts would say otherwise.), so they made their definition anything that metabolizes. This includes mules, fire, hurricanes, etc. (This is flawed because \u003Cstrong\u003EFIRE IS ALIVE!?!?!?\u003C/strong\u003Ecaps), so yeah. Writing a definition for life is sadly extremely hard. (You have to put a gut felling into words and have it be scientifically accurate.)\u003C/p\u003E\u003Cp\u003ESo good luck to anyone here or anywhere else trying to define life; this is RAINCRAFTER, signing out.\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-07-13T17:45:19Z","Content":"\n\u003Cp\u003EActually, the individual cells in a mule reproduce, thus the mule is alive.\u003C/p\u003E\u003Cp\u003EThe 7 biological processes work, although they may need some editing.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EAlso, NASA isn\u0027t actively searching for ET life.\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-07-13T17:56:13Z","Content":"\n\u003Cp\u003EWell, it was with the viking probes.\u003C/p\u003E\u003Cp\u003ELike many things... there is no clear-cut line.\u003C/p\u003E\u003Cp\u003EIts a spectrum.\u003C/p\u003E\u003Cp\u003EWhen you get down to biology, its just chemistry, chemistry is just physics...\u003C/p\u003E\u003Cp\u003EEven in biology... the study of life... we don\u0027t define life.\u003C/p\u003E\u003Cp\u003EPeople may debate whether or not viruses are alive.\u003C/p\u003E\u003Cp\u003EMolecular biologists/biologists that study viruses or host responses to viruses... don\u0027t even address the issue.\u003C/p\u003E\u003Cp\u003EWe can characterize what the virus does, how it acts, what its properties are... and so on.\u003C/p\u003E\u003Cp\u003EIf you want to call that life, then do so.\u003C/p\u003E\u003Cp\u003EIf you don\u0027t, then don\u0027t.\u003C/p\u003E\u003Cp\u003EThere are a number of virus-like bacteria, and cell-like viruses.\u003C/p\u003E\u003Cp\u003EThen there are virus like RNAs and DNAs....\u003C/p\u003E\u003Cp\u003EThen there are life like RNAs.... and the RNA world hypothesis.\u003C/p\u003E\u003Cp\u003ERNA can copy RNA sequences.... it can catalyze reactions... it can store hereditary information.\u003C/p\u003E\u003Cp\u003EWe\u0027ve made self replicating RNA sequences\u003C/p\u003E\u003Cp\u003ECould the right sequence of RNA, by itself, be alive? A lot of evidence points to that being how life started, after all...\u003C/p\u003E\u003Cp\u003EAt what point during abiogenesis, did the stuff stop being a complex chemical system, and start being \u0022alive\u0022?\u003C/p\u003E\u003Cp\u003EThis discussion is sort of pointless... its a completely arbitrary distinction that lacks any consensus\u003C/p\u003E\n"},{"CreatedByName":"Technical Ben","CreatedById":10512,"CreatedDateTime":"2015-07-13T18:10:16Z","Content":"\n\u003Cp\u003EWhat is the definition of blue.\u003C/p\u003E\u003Cp\u003EPoint to something blue, and point to something else the same. We have our requirement to match and communicate, without actually needing to provide a definition.\u003C/p\u003E\u003Cp\u003EIf we find something like life somewhere else (in space), we can then check to see if it matches life. In the instance of a Virus, does it match a Cat or a bacteria? No it does not. So we can say it\u0027s not \u0022alive\u0022, though it does match parts of a cat or bacteria, so we can say \u0022it\u0027s a part of a living thing\u0022 (possibly bacteria or other cellular machinery as it\u0027s originator). Or we look at the whole system, a lone \u0022virus\u0022 is not alive, but in it\u0027s environment is. Likewise a cell may only be able to reproduce in the body of a living creature, so we define the whole as alive, and the singular as a part.\u003C/p\u003E\u003Cp\u003EThere is little to zero chance of finding a virus alone in space or on Mars. As it does not have everything it needs to be \u0022alive\u0022. However, we could find a tree anywhere, of any type or construction, and know it\u0027s \u0022alive\u0022 just by looking at it. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"xenomorph555","CreatedById":103080,"CreatedDateTime":"2015-07-13T18:28:48Z","Content":"\n\u003Cp\u003EI guess you could just sum it up as anything with movement, respiration, sensitivity, growth, reproduction, excretion and nutrition although that is the simplest definition.\u003C/p\u003E\n"},{"CreatedByName":"Shpaget","CreatedById":45577,"CreatedDateTime":"2015-07-13T18:31:31Z","Content":"\n\u003Cp\u003ELife is just an arbitrarily complex chemical process.\u003C/p\u003E\u003Cp\u003EYou say fire is not alive. I say it meets some important the criteria. It comes into existence, it lives, multiples and eventually dies. It\u0027s a chemical process and depending on what is burning and in what kind of environment can be rather complex.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022xenomorph555\u0022 data-cite=\u0022xenomorph555\u0022\u003E\u003Cdiv\u003EI guess you could just sum it up as anything with movement, respiration, sensitivity, growth, reproduction, excretion and nutrition although that is the simplest definition.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo... fire.\u003C/p\u003E\n"},{"CreatedByName":"Technical Ben","CreatedById":10512,"CreatedDateTime":"2015-07-13T18:43:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Shpaget\u0022 data-cite=\u0022Shpaget\u0022\u003E\u003Cdiv\u003ELife is just an arbitrarily complex chemical process.\u003Cp\u003EYou say fire is not alive. I say it meets some important the criteria. It comes into existence, it lives, multiples and eventually dies. It\u0027s a chemical process and depending on what is burning and in what kind of environment can be rather complex.\u003C/p\u003E\u003Cp\u003ESo... fire.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENope. Sorry. Look into the details. Life can exist with zero chemical processes. In fact, current life is not a chemical process, it\u0027s a mechanical one. Proteins do not fold via chemical interactions, but mechanical (atomic scale mind) ones.\u003C/p\u003E\u003Cp\u003EMixing the chemicals, providing the chemicals and adding energy is not enough. We have to, or life has to, physically put the building blocks into the specific place/chain/order. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EFire does not carry any information, or \u0022multiply\u0022 (copy it\u0027s self). It spreads, but that is not a copy of it\u0027s self. Fire is like running water. Life is like a car or a house.\u003C/p\u003E\n"},{"CreatedByName":"LordFerret","CreatedById":111598,"CreatedDateTime":"2015-07-13T18:44:07Z","Content":"\n\u003Cp\u003E42 ... \u003Cem\u003Eof course.\u003C/em\u003E\u003C/p\u003E\n"},{"CreatedByName":"spudman2","CreatedById":84199,"CreatedDateTime":"2015-07-13T18:44:29Z","Content":"\n\u003Cp\u003EThe seven currently accepted criteria for something to be considered \u0022alive\u0022 are:\u003C/p\u003E\u003Cp\u003E-Boundary between \u0022inside\u0022 and \u0022outside\u0022\u003C/p\u003E\u003Cp\u003E-An ordered structure\u003C/p\u003E\u003Cp\u003E-Utilizes an energy gradient\u003C/p\u003E\u003Cp\u003E-Reproduces\u003C/p\u003E\u003Cp\u003E-Change in population traits over time (it can evolve)\u003C/p\u003E\u003Cp\u003E-Reacts to stimuli\u003C/p\u003E\u003Cp\u003E-Grows. And not just one part of it, either. All parts of it.\u003C/p\u003E\u003Cp\u003ESo I suppose that, yes, a mule is not alive, as it cannot reproduce. This definition of life is fuzzy, though, and user discretion is a part of it as well. Also, the mule is composed of cells that \u003Cem\u003Edo\u003C/em\u003E meet the criteria for life.\u003C/p\u003E\n"},{"CreatedByName":"Technical Ben","CreatedById":10512,"CreatedDateTime":"2015-07-13T18:56:11Z","Content":"\n\u003Cp\u003EThe set \u0022mules\u0022 reproduces though. As in, they are born. They then stop reproducing. Perhaps \u0022is part of a reproduction cycle\u0022 would be more fitting. As many organisms continue to live past their reproductive cycles.\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2015-07-13T19:01:13Z","Content":"\n\u003Cp\u003EThe worlds most renowned scientists and philosophers have been trying to answer this question for decades and have not come up with a solid answer. Don\u0027t expect a group of random gamer nerds to solve it over night.\u003C/p\u003E\n"},{"CreatedByName":"Shpaget","CreatedById":45577,"CreatedDateTime":"2015-07-13T19:02:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Technical Ben\u0022 data-cite=\u0022Technical Ben\u0022\u003E\u003Cdiv\u003ELife can exist with zero chemical processes.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhere does it get energy to multiply from if not a chemical process?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Technical Ben\u0022 data-cite=\u0022Technical Ben\u0022\u003E\u003Cdiv\u003EFire does not carry any information, or \u0022multiply\u0022 (copy it\u0027s self). It spreads, but that is not a copy of it\u0027s self.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESure it does. The smoke from the fire carries the traces of the material burning and not all fires are the same.\u003C/p\u003E\u003Cp\u003EYou\u0027re not a copy of your parents, are you not alive?\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-07-13T19:06:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Technical Ben\u0022 data-cite=\u0022Technical Ben\u0022\u003E\u003Cdiv\u003EThere is little to zero chance of finding a virus alone in space or on Mars. As it does not have everything it needs to be \u0022alive\u0022. However, we could find a tree anywhere, of any type or construction, and know it\u0027s \u0022alive\u0022 just by looking at it. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat about most mycobacterium? What about other parasites?\u003C/p\u003E\u003Cp\u003EWhat about humans? we can\u0027t even make 8 of the amino acids, or various vitamins.\u003C/p\u003E\u003Cp\u003EWe can\u0027t capture naturally occuring energy on our own (not autotrophs)... a human... or group of humans... without other life nearby (ie, plants and bacteria).. cannot survive or reproduce.\u003C/p\u003E\u003Cp\u003ESo we need some complex chemical/molecular compounds... viruses need some even more complex ones (ribosomes for instance)\u003C/p\u003E\u003Cp\u003EWe can\u0027t exactly used the \u0022has ribosome Yes/No\u0022 condition for life.... because odds are that any alien life won\u0027t have any.\u003C/p\u003E\n"},{"CreatedByName":"spudman2","CreatedById":84199,"CreatedDateTime":"2015-07-13T19:12:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Technical Ben\u0022 data-cite=\u0022Technical Ben\u0022\u003E\u003Cdiv\u003E Perhaps \u0022is part of a reproduction cycle\u0022 would be more fitting.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPerhaps, yes. Like I said, it\u0027s fuzzy.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2015-07-13T19:21:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Shpaget\u0022 data-cite=\u0022Shpaget\u0022\u003E\u003Cdiv\u003ELife is just an arbitrarily complex chemical process.\u003Cp\u003EYou say fire is not alive. I say it meets some important the criteria. It comes into existence, it lives, multiples and eventually dies. It\u0027s a chemical process and depending on what is burning and in what kind of environment can be rather complex.\u003C/p\u003E\u003Cp\u003ESo... fire.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFire does not apply, neither do saturated solutions which evaporate and deposit crystals. The only people I\u0027ve ever heard considering such things living are philosophers and people studying the humanities. When one doesn\u0027t know natural science, one can not present explanations pertaining to the universe. It\u0027s like those monks debating about the number of teeth in horse\u0027s mouth. One needs to open the horse\u0027s mouth and count the bastards.\u003C/p\u003E\u003Cp\u003EThe most important property of a living organism is that it\u0027s an \u003Cstrong\u003Eordered pile of matter that is resisting dispersion into disorder\u003C/strong\u003E by creating localized order at the expense of increasing much more environmental disorder. Fire does not do that, and neither do crystalizing solutions.\u003C/p\u003E\u003Cp\u003EWatch this and things will be a lot more clear.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/ce0Msxf3AhM?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EViruses don\u0027t do it, either. They\u0027re not alive by the basic definition.\u003C/p\u003E\u003Cp\u003EAlso, life and living organism are not synonims. Life is a much broader term.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-13T19:23:45Z\u0022 title=\u002207/13/2015 07:23  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 13, 2015\u003C/time\u003E by lajoswinkler\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Technical Ben","CreatedById":10512,"CreatedDateTime":"2015-07-13T19:22:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Shpaget\u0022 data-cite=\u0022Shpaget\u0022\u003E\u003Cdiv\u003EWhere does it get energy to multiply from if not a chemical process?\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETheoretically I could build a form of life out of robots. I could power those robots in any way. Though, most energy methods would be defined as \u0022chemical\u0022. Point still stands. Life is more than just \u0022chemicals\u0022. Much much more.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ESure it does. The smoke from the fire carries the traces of the material burning and not all fires are the same.\u003Cp\u003EYou\u0027re not a copy of your parents, are you not alive? \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFire the process is copied. Fire the data is not. Is there any data within fire? Yes. Is there any information? Yes. Is there any data holding a record of specific mechanical operation for copying the previous action and \u0022thing\u0022 we call life? No. Where as DNA does have this, and life as we know it, observe it and define it has DNA. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EA printing press copies data. It copies books. However, it does not have the ability to build it\u0027s self. A river grows, but does not \u0022copy\u0022 it\u0027s self or it\u0027s data.\u003C/p\u003E\u003Cp\u003EWhich does fire match? A printing press, a river or life?\u003C/p\u003E\u003Cp\u003EWhy should my parents need to be the same? We do not. Fire follows the natural forces in physics. Life specifically can decide differently, and is neutral to the physical interactions, but instead applies logical or computational interaction. An example of this is your PC. The game KSP is specifically neutral to (does not care about) the chemical processes on you PC. It decides on your vessel velocity based on logical processes, and decides if you reach orbit. Make the HDD out of copper or plastic (DVD), magnetic or optical, it still functions. DNA likewise is a chemically neutral ordering, that gives a specific function.\u003C/p\u003E\u003Cp\u003EFire is specific chemical interactions, life is the logical operation of a set of any mechanical interaction fitting the similarity with what we currently know to be life. Chemical or not. Life is not limited by it\u0027s chemicals, nor is it limited to any specific chemicals (as far as we know, it just performs best with the current set).\u003C/p\u003E\u003Cp\u003EThanks KerikBalm. A Virus performs no function without a cell. Humans continue to live despite not being able to provide all the vitamins all the time. But we can if you wish define a person as only \u0022living\u0022 when in the ecosystem. As in reality, we would quickly die anyhow without it. Thus \u0022A person in space with no vitamins\u0022 is, as far as factually correct, sadly dead (mainly due to the lack of oxygen, not vitamins. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E ).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-13T19:37:20Z\u0022 title=\u002207/13/2015 07:37  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 13, 2015\u003C/time\u003E by Technical Ben\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-07-13T19:30:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EViruses don\u0027t do it, either. They\u0027re not alive by the basic definition.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey do it once they\u0027ve infected a cell...\u003C/p\u003E\u003Cp\u003EA dormant bacterial spore doesn\u0027t do it... is it alive?\u003C/p\u003E\u003Cp\u003EIs a tardigrade not alive because it doesn\u0027t do it during dessication?\u003C/p\u003E\u003Cp\u003EIs cryptobiosis life? is a tardigrade still alive when it is dessicated. Is a seed alive before it germinates?\u003C/p\u003E\u003Cp\u003EIs a virus alive when it is infecting a host?\u003C/p\u003E\u003Cp\u003EIs a mitochondria alive?\u003C/p\u003E\u003Cp\u003EIs a chloroplast alive?\u003C/p\u003E\u003Cp\u003EIts not so simple\u003C/p\u003E\n"},{"CreatedByName":"Technical Ben","CreatedById":10512,"CreatedDateTime":"2015-07-13T19:43:24Z","Content":"\n\u003Cp\u003EIs a frozen man or kerbal \u0022alive\u0022 while frozen? Answer? Yes or No.\u003C/p\u003E\u003Cp\u003ELikewise, is a Virus \u0022alive\u0022 while dormant? Same answer as above.\u003C/p\u003E\u003Cp\u003EIs it \u0022living\u0022 over it\u0027s entire lifespan? Both answer Yes. If we wish to be pedantic, we can define any sense and understanding away from every topic and conversation. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe difference between my arm, and me is only in description. I am alive, so is my arm. If I kept my arm on life support in a box, it\u0027s still alive. If I froze it, it is no longer \u0022alive\u0022, but has the ability to live (be thawed out and put back I hope!).\u003C/p\u003E\u003Cp\u003ELikewise, a Virus while dormant, is by definition dormant. Why try to say that 4 apples is anything other than 4 apples? Dormant being the opposite definition to \u0022alive\u0022. Don\u0027t ask \u0022is this thing I decided is dormant and not alive.... Alive?\u0022 well no, you said it\u0027s not already. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EIs it alive while infecting? Yes. It\u0027s now doing something. Is it doing those things we call \u0022living\u0022? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EWe do learn something amazing from it though. If applying science, and observation. We can conclude, a thing we defined as living, then as dead, we then observed to be living again. Now that\u0027s something amazing! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2015-07-13T19:55:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerikBalm\u0022 data-cite=\u0022KerikBalm\u0022\u003E\u003Cdiv\u003EThey do it once they\u0027ve infected a cell...\u003Cp\u003EA dormant bacterial spore doesn\u0027t do it... is it alive?\u003C/p\u003E\u003Cp\u003EIs a tardigrade not alive because it doesn\u0027t do it during dessication?\u003C/p\u003E\u003Cp\u003EIs cryptobiosis life? is a tardigrade still alive when it is dessicated. Is a seed alive before it germinates?\u003C/p\u003E\u003Cp\u003EIs a virus alive when it is infecting a host?\u003C/p\u003E\u003Cp\u003EIs a mitochondria alive?\u003C/p\u003E\u003Cp\u003EIs a chloroplast alive?\u003C/p\u003E\u003Cp\u003EIts not so simple\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, it\u0027s not simple and certainly not yes or no, but by the basic definition of a system resisting dispersal, viruses are not. The only thing that resists (total) dispersion is the data they carry. That\u0027s completely different thing and can\u0027t be lumped into the same category.\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-07-13T20:30:30Z","Content":"\n\u003Cp\u003Ebut viruses do do it at one point in their replication cycle.\u003C/p\u003E\u003Cp\u003EThey cause simple molecules like ATP and amino acids to form complex ordered structures, at the expense of order in the cell.\u003C/p\u003E\u003Cp\u003EBacteria do this in an environment that consists of most of the surface of the Earth... outside this environment, they are (mostly) dormant.\u003C/p\u003E\u003Cp\u003EViruses do this in an environment that consists of the interior of cells... outside of this environment, they are (mostly) dormant.\u003C/p\u003E\u003Cp\u003EThen we have the bacteria that only really do it in an environment that consists of the interior of Eukaryotic cells... are obligate intracellular parasites alive? they can plausibly evolve even further to become what one would truly consider a virus... would you then say they evolved into non-life?\u003C/p\u003E\u003Cp\u003EWhat about mitochondria? they have a genome, synthesize proteins, make a whole lot of ordered molecules (ATP) and release a whole lot of disordered molecules as well (CO2).\u003C/p\u003E\u003Cp\u003Eyet, outside of a cell, they quickly lose the ability to do this, and they can\u0027t replicate.... but they evolved from something that could...\u003C/p\u003E\u003Cp\u003EAre they alive? can something alive evolve into non-life without becoming extinct?\u003C/p\u003E\u003Cp\u003EOf course, if you look at the complexity of the molecules that a human needs to survive... compared to the very complex cellular machinery that a virus needs to reproduce... you\u0027ll see orders of magntitude in differences.\u003C/p\u003E\u003Cp\u003EThus you could draw an arbitrary line to exclude them... similar to how one can draw an arbitrary line to say Mars and Mercury are planets, whereas Pluto and Ceres are not...\u003C/p\u003E\u003Cp\u003EHypothetically, we could have bodies with a stern levison parameter everywhere inbetween that of mercury and pluto...\u003C/p\u003E\u003Cp\u003Eor you could apply the parameter to moons, and the only difference is the body it orbits... the only difference between viruses and life are the environments they inhabit.\u003C/p\u003E\u003Cp\u003EIf: orbit star -\u0026gt; Then planet --- excet If: orbit planet -\u0026gt; Then Moon. If: (life parameter in any environment) -\u0026gt; Then life --- except If: (life parameter in environment that is itself living) -\u0026gt; then Virus.\u003C/p\u003E\u003Cp\u003EBut when does a Moon stop being a moon, and star being part of a binary planet?\u003C/p\u003E\u003Cp\u003EWhen does a parasite become a symbiote?\u003C/p\u003E\u003Cp\u003EIf a non-living virus has a beneficial effect on its host (there are rare examples of viruses that are beneficial in certain circumstances)... when does it become a symbiote/part of a living system?\u003C/p\u003E\u003Cp\u003EYou could say for practical purposes, its easy to draw a line to exclude viruses...\u003C/p\u003E\u003Cp\u003EBut how practical? From a molecular biology standpoint... its not so practical... the things we study... gene regulation, phylogentic trees, evolution, protein function, signaling pathways (some overlap with gene regulation here), etc... its just like the stuff people call living... so for practical purposes in my field... why exclude them?\u003C/p\u003E\n"},{"CreatedByName":"Shpaget","CreatedById":45577,"CreatedDateTime":"2015-07-13T20:31:16Z","Content":"\n\u003Cp\u003EI\u0027ve never heard of this dispersal definition.\u003C/p\u003E\u003Cp\u003EDoes a rock not resist dispersal?\u003C/p\u003E\n"},{"CreatedByName":"Technical Ben","CreatedById":10512,"CreatedDateTime":"2015-07-13T20:48:48Z","Content":"\n\u003Cp\u003EThat\u0027s like saying some life is green, some rocks are green, thus a rock is alive. Just because a rock does one or two things, does not mean it does them all. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EFor those stuck on a virus. I ask. If I cut off a branch to a tree. Is it alive? If I freeze some peas, are they alive?\u003C/p\u003E\n"},{"CreatedByName":"sndrtj","CreatedById":110589,"CreatedDateTime":"2015-07-13T22:33:31Z","Content":"\n\u003Cp\u003EActual biologist here.\u003C/p\u003E\u003Cp\u003EThose seven items we\u0027ve all been taught in high school could better be named hallmarks in stead of defining properties. Yes, they are common to life, and if an entity has all seven, we would very likely all call it \u0022alive\u0022, but it\u0027s not all that is to life. Especially at smaller scales, it tends to break down. \u003C/p\u003E\u003Cp\u003EThere are three key items that, to me, define life for a given entity:\u003C/p\u003E\u003Cp\u003E1. It contains genetic information, which is passed from generation to generation\u003C/p\u003E\u003Cp\u003E2. A body of highly-similar (genetically) entities evolves its genetic information and behaviours over time (this naturally follows from point 1) \u003C/p\u003E\u003Cp\u003E3. It actively maintains homeostasis. The end of this homeostasis means the death of said entity.\u003C/p\u003E\u003Cp\u003EEntities that have merely points 1 and 2 is what I would call not alive but nevertheless biological.\u003C/p\u003E\u003Cp\u003EEspecially that third item is what I have been missing in this thread. And it is oh-so important. I have seen someone mention \u0022boundary between inside and outside\u0022 as a defining property. This forms the basis of homeostasis, but it is not the end of it. Homeostasis means that the entity keeps its internal properties (hence it needs outside/inside border) relatively stable by some means, \u003Cem\u003Eregardless of its surroundings\u003C/em\u003E. There are many forms of homeostasis, and higher forms of live have ever more complex ones. The most simple is osmotic pressure. The concentration of salts and organic compounds (nucleic acids, proteins, metabolites, etc) inside a cell tends to be widely different from that outside, and the cell actively maintains this. More complex forms of homeostasis include such things as blood pressure, blood oxygenation levels, heart rate and structural integrity. Life must spend an arduous amount of energy on maintaining this homeostasis. When it ceases to do so, it will die. E.g. a human dies if blood pressure isn\u0027t maintained, blood oxygenation levels drop, heart rate drops, salt balance (i.e. kidneys) is disrupted, you name it. \u003C/p\u003E\u003Cp\u003EAn interesting property also arises from this homeostasis: living things seem to have locally lower entropy than their surroundings. The necessarily contain and produce higher-order structures. Ironically, these same higher order structures allow for extremely efficient energy transfer (e.g. photosynthesis is much more efficient at converting light into chemical energy than the simple radiative heating of the sun on bare rocks), which in effect increases the entropy of the total system. \u003C/p\u003E\u003Cp\u003ESo some practical examples:\u003C/p\u003E\u003Cp\u003EIs fire alive? No. It doesn\u0027t convey genetic information from generation to generation (it doesn\u0027t have generations at all), and therefore also doesn\u0027t evolve. Very temporary homeostasis \u003Cem\u003Emight \u003C/em\u003Eexist for fire, but this is self-limiting, so not truly there. \u003C/p\u003E\u003Cp\u003EIs a rock alive? No. It has none of the three properties.\u003C/p\u003E\u003Cp\u003EIs a virus alive? In \u003Cem\u003Emost\u003C/em\u003E cases no. It however is quite obviously a biological entity, in the sense that it most definitely carries genetic information and evolves. There are some viruses that skim the border, and seem to have some form of sustained homeostasis. \u003C/p\u003E\u003Cp\u003EIs a bacterium alive? In the vast majority of cases, yes. However, just as with larger-than-usual viri, there are bacteria which are so small as to entirely depend on host species to survive, so they skim the border between alive and not. \u003C/p\u003E\u003Cp\u003EAre mitochondria and chloroplasts alive? Interesting question! They do have genetic information, which they pass on from generation to the next, and also evolve. Furthermore, it is generally assumed both evolved from endosymbionts. But, AFAIK they cannot survive outside of the host cell, i.e. the host cell provides for most homeostasis purposes.\u003C/p\u003E\u003Cp\u003EAre humans alive? Most definitely \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E.\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-07-14T06:48:57Z","Content":"\n\u003Cp\u003E\u0026lt; also an actual biologist.\u003C/p\u003E\u003Cp\u003EFor the certainty that post started with. note how it broke down at the end.\u003C/p\u003E\u003Cp\u003E\u0022Is a virus alive? In \u003Cem\u003Emost\u003C/em\u003E cases no.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Is a bacterium alive? In the vast majority of cases, yes.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Are mitochondria and chloroplasts alive? Interesting question!\u0022\u003C/p\u003E\u003Cp\u003EYou also didn\u0027t address if something is alive when it is dormant, and how dormant it can be.... because there are various levels of dormancy... like a hibernating bear on one hand... and dessicated tardigrades on the other.\u003C/p\u003E\u003Cp\u003EA virus outside of a cell vs a virus inside a cell?\u003C/p\u003E\u003Cp\u003EThere are many cases of life cycles at which at some point, the life form ceases to actively maintain homeostasis, but instead relies on a durable form such as a spore.\u003C/p\u003E\u003Cp\u003EWe don\u0027t call that alive or not alive... but instead invent a new term: cryptobiosis.\u003C/p\u003E\u003Cp\u003EFWIW, I never see anyone debate what is alive or not alive in the lab or in scientific journals. These are biological entities with known properties.\u003C/p\u003E\u003Cp\u003EBeyond describing those properties, you\u0027re just talking semantics.\u003C/p\u003E\u003Cp\u003EFYI, responding to this:\u003C/p\u003E\u003Cp\u003E\u0022But, AFAIK they cannot survive outside of the host cell, i.e. the host cell provides for most homeostasis purposes.\u0022\u003C/p\u003E\u003Cp\u003EThey can remain viable for a time outside the host cell, long enough to be transplanted... but they certainly can\u0027t reproduce or be cultured.\u003C/p\u003E\u003Cp\u003ETake the human mitochondria for example... its genome encodes just 13 mRNAs, 22 tRNAs, and 2 rRNAs.\u003C/p\u003E\u003Cp\u003EIts proteome has \u0026gt;1000 proteins.\u003C/p\u003E\u003Cp\u003EIt must import a lot of nuclear encoded proteins.... yet the RNA components for a protein translation system are fully encoded by its genome.\u003C/p\u003E\u003Cp\u003EThe neccessary ribosomal proteins, DNA and RNA polymerases, many many many other enzymes, are not.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-14T06:52:13Z\u0022 title=\u002207/14/2015 06:52  AM\u0022 data-short=\u00228 yr\u0022\u003EJuly 14, 2015\u003C/time\u003E by KerikBalm\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Technical Ben","CreatedById":10512,"CreatedDateTime":"2015-07-14T07:10:55Z","Content":"\n\u003Cp\u003E\u0022You also didn\u0027t address if something is alive when it is dormant, and how dormant it can be....\u0022\u003C/p\u003E\u003Cp\u003ESleep = alive. Frozen = not alive. By definition.\u003C/p\u003E\u003Cp\u003EBut is the better biological definition: \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u00224. Being in a condition of biological rest or inactivity characterized by cessation of growth or development and the suspension of many metabolic processes: a dormant bud; a dormant bacterium.\u0022\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo we need to ask instead: \u0022Is an animal \u003Cem\u003Efrozen\u003C/em\u003E still classed as alive\u0022 or \u0022is an animal dried out/while it\u0027s stopped it\u0027s metabolism classed as alive\u0022? That is a better question that does not suppose our answer, one that we can test/decide scientifically. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis will also help you find the answer to \u0022is Mitochondria alive\u0022 (by our definition of alive). \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-14T07:22:06Z\u0022 title=\u002207/14/2015 07:22  AM\u0022 data-short=\u00228 yr\u0022\u003EJuly 14, 2015\u003C/time\u003E by Technical Ben\u003C/strong\u003E\n\u003C/span\u003E\n"}]}