{"TopicId":115734,"ForumId":34,"TopicTitle":"Heat Pumps v1.3.0 for Real Fuels - May 1, 2017","CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2015-07-12T18:48:07Z","PageNum":4,"Articles":[{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2017-04-30T03:55:32Z","Content":"New update for Heat Pumps\n\n**Heat Pumps version 1.3.1**\n\n- Numerous fixes and improvements. Most notable is that I discovered a stock bug in which results in added internal and skin flux being cut in half, so I was only removing half of the heat I thought I was.\n\nThere\u0027s also been some work done towards improved analytic support when used with Real Fuels but since then I\u0027ve discovered things about how KSP\u0027s analytic mode works that are making things difficult, so I\u0027m not really sure how well this will work with analytic. So that\u0027s a work in progress.\n\n[https://github.com/Starwaster/HeatPump/releases/tag/v1.3.1](https://github.com/Starwaster/HeatPump/releases/tag/v1.3.1)"},{"CreatedByName":"Bornholio","CreatedById":173101,"CreatedDateTime":"2017-05-03T18:27:42Z","Content":"Looking good, I now demand frozen monoatomic hydrogen tanks.  /smirk\n\nThat aside, I design scientific instrumentation and found that the oil and gas industry has a lower grade aerogel insulation for keeping  liquefaction gasses cooled in pipes.  Its relatively cheap (Compared to Aerogel) and has fiber reinforcement.  Can imagine that tank insulation values will dramatically improve in the near future.  The material I used replaced low density polyethylene in a test tube sample  with R/K values about 2.5 times better.  The peltier cooling used a lot of power. I can imagine anything done to prevent adding heat is many times more efficient than removing it."},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2017-05-03T18:50:14Z","Content":"\u003E \n\u003E \n\u003E 21 minutes ago, Bornholio said:\n\u003E \n\u003E \n\u003E Looking good, I now demand frozen monoatomic hydrogen tanks.  /smirk\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E That aside, I design scientific instrumentation and found that the oil and gas industry has a lower grade aerogel insulation for keeping  liquefaction gasses cooled in pipes.  Its relatively cheap (Compared to Aerogel) and has fiber reinforcement.  Can imagine that tank insulation values will dramatically improve in the near future.  The material I used replaced low density polyethylene in a test tube sample  with R/K values about 2.5 times better.  The peltier cooling used a lot of power. I can imagine anything done to prevent adding heat is many times more efficient than removing it.\n\u003E \n\nDefinitely, that\u0027s why all ZBO schemes involve both passive and active measures.\n\nHow much power does the peltier cooler use? Can you give a value per watt removed? How does it compare with Brayton cryocoolers?"},{"CreatedByName":"Bornholio","CreatedById":173101,"CreatedDateTime":"2017-05-03T19:17:17Z","Content":"\u003E \n\u003E \n\u003E 12 minutes ago, Starwaster said:\n\u003E \n\u003E \n\u003E Definitely, that\u0027s why all ZBO schemes involve both passive and active measures.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E How much power does the peltier cooler use? Can you give a value per watt removed? How does it compare with Brayton cryocoolers?\n\u003E \n\nCompared to refrigeration cycles they are about \u003E30%.  I calculated that I needed to reject about 35w of input load on an aluminum block with test tubes in it (60 10mm tubes).  used ~100% power on 6 100w Cooler chips at -12C and about ~50% power at 0C in 25C Lab air.  So they ranged from 10-30% efficient.  That\u0027s using a heat sink and forced convection to cool the chip hot side.  The reduced efficiency is mostly due to maxing the heat rejection of the heat sink.\n\nI couldn\u0027t go any lower than -20C without it sounding like a jet turbine.  Well at least any more like a jet as it had some pretty big fans.  Would not consider them for bulk cooling. I used them for many other reason.  I have 6 different temperature zones in one of the units at temps from 0C to 55C and the other unit is 100C 65C and 0C.  I would cry tears of blood for better insulation.\n\n[https://www.bruker.com/fileadmin/user_upload/8-PDF-Docs/MagneticResonance/TD-NMR/Brochure_minispec_Automation.pdf](https://www.bruker.com/fileadmin/user_upload/8-PDF-Docs/MagneticResonance/TD-NMR/Brochure_minispec_Automation.pdf)\n\nI\u0027m not the blonde in the pdf."},{"CreatedByName":"wb99999999","CreatedById":169898,"CreatedDateTime":"2017-05-12T23:33:11Z","Content":"Yes! The cooling is much better after the 1.3.1 patch! Now the boil-off literally doesn\u0027t happen if I turn the cooling on and give it a little time! Thank you!"},{"CreatedByName":"Gordon Dry","CreatedById":163177,"CreatedDateTime":"2017-05-13T12:55:02Z","Content":"Huh?\n\nApril 30 is was 1.3.1 and today it is 1.3.0 - the same files compared bitwise?"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2017-05-13T20:35:13Z","Content":"\u003E \n\u003E \n\u003E 7 hours ago, Gordon Dry said:\n\u003E \n\u003E \n\u003E Huh?\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E April 30 is was 1.3.1 and today it is 1.3.0 - the same files compared bitwise?\n\u003E \n\n Not every file is going to change in every release. The release page on the Github repository has the changes enumerated in a fair amount of detail."},{"CreatedByName":"Bornholio","CreatedById":173101,"CreatedDateTime":"2017-05-24T00:55:40Z","Content":"Finally got to test some. \u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E/RP-0 Dev build (DRE etc.)\n\nFeedback.  Built a fuel tug and sent it to orbit.  First note is (Can they list power consumption?)\n\nMultiple radiators only waste power unless in array.  Very counter intuitive. They sink heat faster but once at equilibrium they are only a penalty.\n\nCan regular radiators help out?\n\n![wHBfxAr.png](http://i.imgur.com/wHBfxAr.png)\n\nUp to x50 timewarp everything is good (including x4 Physics warp)\n\n![yQorflL.png](http://i.imgur.com/yQorflL.png)\n\nAt x100 time warp or higher the heat is not removed and core temps elevated. Note the hydrogen has started to bleed off. This was a short time at max timewarp in orbit\n\n![j2DRmnY.png](http://i.imgur.com/j2DRmnY.png)\n\nThey work great aside from that. Not sure if a good fix for the x100 time warp is available. \n\n**Edited \u003Ctime datetime=\u00222017-05-24T01:07:13Z\u0022 title=\u002205/24/2017 01:07  AM\u0022 data-short=\u00227 yr\u0022\u003EMay 24, 2017\u003C/time\u003E by Bornholio**"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2017-05-24T02:20:16Z","Content":"[@Bornholio](https://forum.kerbalspaceprogram.com/index.php?/profile/173101-bornholio/) 100x timewarp isn\u0027t treated any differently in stock. GREATER than 100x is where analytic starts, unless you or a mod has changed that. If it\u0027s stopped working during time warp then I have to assume that analytic mode has kicked in.\n\nI DID have hopes that I would be able to get both Real Fuels and Heat Pumps working with analytic mode properly but I didn\u0027t properly understand the nature of the problem, even though NathanKell and I had some discussion about analytic mode and the interfaces that would go into place to allow us to interact with it. He even asked me for input about what those interfaces should do, but I don\u0027t think we really understood the problem, not even Nathan even though he coded much of it.\n\nThe problems are: \n\n1. Analytic mode assigns a temperature for the entire vehicle, not on a part by part basis.\n2. Heat flux goes out the window. You can still add/remove flux but it is treated differently. Temperature contribution is based on the square of the square of the flux. Specific heat of a part is ignored. Conductivity is also ignored; temperature is assigned directly though you can change how quickly or slowly it lerps to the designated temperature.\n\nSo, in analytic mode, I have no idea how much \u0027flux\u0027 is leaking into the tank because there is no flux. I could figure out an arbitrary value based on how much Analytic wants to increase the tank temperature, but any flux I remove is being done to the entire vehicle and it doesn\u0027t really have the result needed. \n\nOh, and the analytic interfaces ONLY affect the parts that the code is running on. So, if analytic mode runs on the heat pump... it\u0027s for the PUMP part (radiator) and not tank, which is what really needs to be affected. So... I CAN change what the analytic temperature is, on a part by part basis, I can\u0027t do that from the pump part.\n\nIf Heat Pump were still part of Real Fuels, it might be a little easier to interface with but it\u0027s not. And I don\u0027t feel like fighting to put it back in again. (yeah, it got taken out once, put back in at my behest and then removed again, so I split it off into its own project)\n\nSo right now I\u0027m not sure what to do about analytic mode. Maybe the answer is to send event messages to and from the tank part... so I can tell it... yeah, you\u0027re refrigerated so ignore the heat and don\u0027t boil off. Or maybe I\u0027ll have to do it by reflection. I don\u0027t know yet.\n\nEDIT\n\nAnd, re: stock radiators: No, they\u0027re not going to be any better in analytic mode. In fact, probably even less helpful since the stock code doesn\u0027t even TRY to deal with the analytic problem.\n\nOh, and finally: About the power usage separately vs in symmetry mode, I can\u0027t do much about that without a vehicle module to coordinate between multiple radiators. I do have plans to do something like that so they behave more like stock radiators, but that\u0027s in the future.\n\n**Edited \u003Ctime datetime=\u00222017-05-24T02:23:17Z\u0022 title=\u002205/24/2017 02:23  AM\u0022 data-short=\u00227 yr\u0022\u003EMay 24, 2017\u003C/time\u003E by Starwaster**"},{"CreatedByName":"Bornholio","CreatedById":173101,"CreatedDateTime":"2017-05-24T03:21:43Z","Content":"\u003E \n\u003E \n\u003E 2 minutes ago, Starwaster said:\n\u003E \n\u003E \n\u003E [@Bornholio](https://forum.kerbalspaceprogram.com/index.php?/profile/173101-bornholio/) 100x timewarp isn\u0027t treated any differently in stock. GREATER than 100x is where analytic starts, unless you or a mod has changed that. If it\u0027s stopped working during time warp then I have to assume that analytic mode has kicked in.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E I DID have hopes that I would be able to get both Real Fuels and Heat Pumps working with analytic mode properly but I didn\u0027t properly understand the nature of the problem, even though NathanKell and I had some discussion about analytic mode and the interfaces that would go into place to allow us to interact with it. He even asked me for input about what those interfaces should do, but I don\u0027t think we really understood the problem, not even Nathan even though he coded much of it.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E The problems are: \n\u003E \n\u003E \n\u003E \n\u003E 1. Analytic mode assigns a temperature for the entire vehicle, not on a part by part basis.\n\u003E 2. Heat flux goes out the window. You can still add/remove flux but it is treated differently. Temperature contribution is based on the square of the square of the flux. Specific heat of a part is ignored. Conductivity is also ignored; temperature is assigned directly though you can change how quickly or slowly it lerps to the designated temperature.\n\u003E \n\u003E \n\u003E \n\u003E So, in analytic mode, I have no idea how much \u0027flux\u0027 is leaking into the tank because there is no flux. I could figure out an arbitrary value based on how much Analytic wants to increase the tank temperature, but any flux I remove is being done to the entire vehicle and it doesn\u0027t really have the result needed. \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Oh, and the analytic interfaces ONLY affect the parts that the code is running on. So, if analytic mode runs on the heat pump... it\u0027s for the PUMP part (radiator) and not tank, which is what really needs to be affected. So... I CAN change what the analytic temperature is, on a part by part basis, I can\u0027t do that from the pump part.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E If Heat Pump were still part of Real Fuels, it might be a little easier to interface with but it\u0027s not. And I don\u0027t feel like fighting to put it back in again. (yeah, it got taken out once, put back in at my behest and then removed again, so I split it off into its own project)\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E So right now I\u0027m not sure what to do about analytic mode. Maybe the answer is to send event messages to and from the tank part... so I can tell it... yeah, you\u0027re refrigerated so ignore the heat and don\u0027t boil off. Or maybe I\u0027ll have to do it by reflection. I don\u0027t know yet.\n\u003E \n\nIs it possible to do the FMRS/Stage recovery trick of saving the value as it changes state to analytic and then set it back to that value on resumption of normal time? Assuming that the system is correct it will equilibrium at a reasonable value otherwise it will reach one of two other states. First state is power runs out and shutdown, second it oscillates at a non-useful arbitrary higher temp.  The state of being in a useful but oscillatory condition is likely rare given the calculations involved.\n\nYour description actually makes it seem that as it works currently we should use a large whole craft heat sink to lower the overall craft heat so when it goes to Analytic mode it will average out to a lower value.\n\nRegardless I\u0027ll dig some more and give some more feedback. (like I had a set blow up when coming out of high warp..just like I lost a Jupiter probe to overheating fuel tanks that blew up for some reason../sigh)"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2017-05-24T03:42:49Z","Content":"\u003E \n\u003E \n\u003E 5 minutes ago, Bornholio said:\n\u003E \n\u003E \n\u003E Is it possible to do the FMRS/Stage recovery trick of saving the value as it changes state to analytic and then set it back to that value on resumption of normal time? Assuming that the system is correct it will equilibrium at a reasonable value otherwise it will reach one of two other states. First state is power runs out and shutdown, second it oscillates at a non-useful arbitrary higher temp.  The state of being in a useful but oscillatory condition is likely rare given the calculations involved.\n\u003E \n\nThe current build doesn\u0027t consume any resources during analytic mode. A future build will look at net power generation/drain to determine if it should request resources or not. As far as storing the pre-analytic value, I\u0027m not really clear on what you\u0027re suggesting, and where you\u0027re suggesting it be done? (Heat Pump? Real Fuels? Remember that there is lowered capacity to do anything to another part in analytic mode.)"},{"CreatedByName":"Bornholio","CreatedById":173101,"CreatedDateTime":"2017-05-24T04:09:33Z","Content":"Stage recovery has a system that grabs the values of parts being unloaded.  My thought is that you could grab those values that matter (fuel value, internal temp) and reinject them assuming they pass a nominal temp\u003Cx test.=\u0022\u0022\u003E\u003C/x\u003E\n\nThis does sound like it should be in real fuels end. since its obviously a problem that exists regardless of the cryo coolers. Hmmm  maybe i have that wrong.  I\u0027ll look closer at what order things happen tomorrow.\n\nMaybe its just temp that needs to be passed back. just reloaded my tug after sitting in the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E screen on x1 speed for while Core temp was 4K when i left the tug now its 157K. Cryo\u0027s are on and slowly cooling again.\n\nSo just watching cooling rate, deg/sec kind, time warp x1-x10 seem to function normal, x50 seemed like it was x1 speed, then it seemed normal, same with x100, temp shot up then came down to a lower but oscillating value.\n\nI can get the oscillation values lower with more .... Just looked at my mod list again.  Cryo tanks, has dll. I\u0027ll drop it next just in case its modified anything"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2017-05-24T06:17:33Z","Content":"\u003E \n\u003E \n\u003E 2 hours ago, Bornholio said:\n\u003E \n\u003E \n\u003E I can get the oscillation values lower with more .... Just looked at my mod list again.  Cryo tanks, has dll. I\u0027ll drop it next just in case its modified anything\n\u003E \n\nIf you\u0027re talking about the cryotanks with the simpleboiloff plugin, you should only use one or the other. Neither stock radiators nor this mod will prevent Cryotanks boiloff because they use a static method which is independent of heat. They don\u0027t have increased boiloff rates as they get hotter and don\u0027t stop boiling if you cool them down. The reverse would also be true in that any mitigating system they have for preventing their tanks from boiling off wouldn\u0027t work for Real Fuels. \n\nAlso, I know NOTHING about their tank parts and I have no idea if they are properly configured for passive insulation. (i.e. they would have to have RF MFT modules with the Cryogenic type)\n\n**Edited \u003Ctime datetime=\u00222017-05-24T06:18:46Z\u0022 title=\u002205/24/2017 06:18  AM\u0022 data-short=\u00227 yr\u0022\u003EMay 24, 2017\u003C/time\u003E by Starwaster**"},{"CreatedByName":"Bornholio","CreatedById":173101,"CreatedDateTime":"2017-05-24T18:36:19Z","Content":"My testing from early morning.\n\nRemoved Cryo tanks mod to make sure it had no impact. Note that i\u0027m using \u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E so my time slide hover is not right.  x50 tool tip is actually x1000 since each increment in \u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E/RP-0 time warp is log10 except the highest.\n\nAt x1, x10 and x100 result are pretty good.  Coolers work as expected. Not sure if size has any function. temperature would rapidly head to 20k and then approach 4k as multiple passes into darkness happened.\n\nAt x1000 the temps actually stopped showing the variation from going into the sun side\n\nat x10000 the system stopped being able to compensate and starts to oscillate above any reasonable chill temps, start loosing hydrogen.\n\nat x100000 the temps jump way up, hydrogen loss is very fast.\n\nat x600000 the hydrogen evaporates entirely except for the cygnus tankage which starts to go slowly. (Cygnus only has radiators not cryo coolers mounted)\n\nleaving for space center and returning next morning reset the temps to near 170K and chillers have to work to bring it down again.\n\n![oejCbWv.png](http://i.imgur.com/oejCbWv.png)\n\n![ypul2EN.png](http://i.imgur.com/ypul2EN.png)\n\n[Cryocooler Testing Imgur Album](https://imgur.com/a/a14rF)\n\nSorry imgur and image sorting are borked.  Comment # is real order.\n\n**Edited \u003Ctime datetime=\u00222017-05-24T18:44:09Z\u0022 title=\u002205/24/2017 06:44  PM\u0022 data-short=\u00227 yr\u0022\u003EMay 24, 2017\u003C/time\u003E by Bornholio**"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2017-05-24T19:19:08Z","Content":"[@Bornholio](https://forum.kerbalspaceprogram.com/index.php?/profile/173101-bornholio/)\n\nYour Cygnus is probably using the ServiceModule type, which assumes vacuum bottles and/or vapor cooled shielding. I used Apollo service module data to determine leakage. Heat leakage was low enough that they had to use heaters to keep tank pressure up to feed the fuel cells and ensure that enough O2 was available for human consumption\n\nAnd, something else you might or might not be aware of is that if your vessel is unloaded for more than a few minutes: Analytic mode kicks in and yeah, that does tend to raise your temps up obnoxiously. Obviously that\u0027s another area that needs addressing.\n\nMy current modding priorities are \n\n1. Finish the current new update for DRE before KSP 1.3 if possible\n2. get Ioncross Crew Support back up and running\n3. Go back to Real Fuels \u002B Heat Pumps to further address analytic mode boiloff and cryocooling. (which will be done concurrently to ensure they work properly together)\n\n**Edited \u003Ctime datetime=\u00222017-05-24T19:20:01Z\u0022 title=\u002205/24/2017 07:20  PM\u0022 data-short=\u00227 yr\u0022\u003EMay 24, 2017\u003C/time\u003E by Starwaster**"},{"CreatedByName":"Bornholio","CreatedById":173101,"CreatedDateTime":"2017-05-24T19:31:18Z","Content":"[@Starwaster](https://forum.kerbalspaceprogram.com/index.php?/profile/71262-starwaster/)  Sounds like fun.  If you push a new dev build of this /poke me and i\u0027ll try and test it more."},{"CreatedByName":"Gordon Dry","CreatedById":163177,"CreatedDateTime":"2017-07-31T11:42:29Z","Content":"Just a reminder, no demand:\n\n\u003Ciframe data-embedcontent=\u0022\u0022 frameborder=\u00220\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/58236-13-real-fuels-v1223-july-30/\u0026do=embed\u0026comment=3135859\u0026embedComment=3135859\u0026embedDo=findComment\u0022\u003E\u003C/iframe\u003E"},{"CreatedByName":"wb99999999","CreatedById":169898,"CreatedDateTime":"2017-08-11T06:47:54Z","Content":"[@Starwaster](https://forum.kerbalspaceprogram.com/index.php?/profile/71262-starwaster/) About boil-off temperature, is it internal temp or skin temp it is related to? I had a tank full of LH2 and cooled (gladly) with your Heat Pump down to 19.9K internal and around 24~28K skin; my LH2 wouldn\u0027t stop boiling off slowly. Also, an uncooled service module I used for control is hitting around 25K internal and 29K skin, and is not losing any LH2. I am confused."},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2017-08-12T00:58:04Z","Content":"\u003E \n\u003E \n\u003E 17 hours ago, wb99999999 said:\n\u003E \n\u003E \n\u003E [@Starwaster](https://forum.kerbalspaceprogram.com/index.php?/profile/71262-starwaster/) About boil-off temperature, is it internal temp or skin temp it is related to? I had a tank full of LH2 and cooled (gladly) with your Heat Pump down to 19.9K internal and around 24~28K skin; my LH2 wouldn\u0027t stop boiling off slowly. Also, an uncooled service module I used for control is hitting around 25K internal and 29K skin, and is not losing any LH2. I am confused.\n\u003E \n\nIt can use either depending on whether the RF tank is a cryogenic type or not. Default tanks use the skin and Cryogenic tanks use the internal. Using the internal temperature allows for the simulation of multiple conduction zones, with the skin then becoming the MLI layers and the internal being the tank or spray on insulation layers. Cooling then gets applied in between those layers. The actual deciding factor is whether or not the tank part has a different skin-internal conduction factor from the default values with the boiloff equations and cooling equations using either skin or internal as appropriate.\n\nIf you\u0027re still getting boiloff then you probably have some third party mod applying its own boiloff. There are at least two other mods that have their own proprietary boiloff schemes and neither of them look at the actual temperature of the part so neither of them would benefit from Heat Pump (or even stock radiator) and have their own \u0027cooling\u0027 scheme to negate boiloff. If you have RF installed then you should disable any third party boiloff since there\u0027s nothing I can do to mitigate that.\n\nI will leave open the possibility that Heat Pump isn\u0027t properly compensating for parts using the skin temperature and investigate that to make sure it\u0027s working as it should. AFAIK though that part does work properly on HP side"},{"CreatedByName":"wb99999999","CreatedById":169898,"CreatedDateTime":"2017-08-12T01:14:35Z","Content":"\u003E \n\u003E \n\u003E 6 minutes ago, Starwaster said:\n\u003E \n\u003E \n\u003E It can use either depending on whether the RF tank is a cryogenic type or not. Default tanks use the skin and Cryogenic tanks use the internal. Using the internal temperature allows for the simulation of multiple conduction zones, with the skin then becoming the MLI layers and the internal being the tank or spray on insulation layers. Cooling then gets applied in between those layers. The actual deciding factor is whether or not the tank part has a different skin-internal conduction factor from the default values with the boiloff equations and cooling equations using either skin or internal as appropriate.\n\u003E \n\nI am pretty sure it has something to do with RF. I am playing a \u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E install so it is unlikely that other mod has applied their boil-off after the \u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E configs; I did, however, notice a difference between cryogenic and non-cryogenic tanks. However, the difference is confusing: for Cryogenic types, having a higher skin temp does result a very slow but clearly noticeable loss; for BalloonCryo types the loss is very apparent. Notice in both case I do have my internal temp down to 19K because the Heat Pump is doing its job properly. I also tried Default tanks, and the result is not too dissimilar to the Cryogenic type tanks, and has a less loss when compared to a BalloonCryo. This seems to imply that a BalloonCryo actually have worse insulation than a Default.\n\nI do remember just a few months ago when cooling down a Cryogenic tank means it really isn\u0027t losing anything at least in a few weeks, and when done properly it would almost hold LH2 indefinitely. I strongly believe that there\u0027s something to do with \u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E and/or RF changes."},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2017-08-12T01:33:17Z","Content":"\u003E \n\u003E \n\u003E 13 minutes ago, wb99999999 said:\n\u003E \n\u003E \n\u003E I am pretty sure it has something to do with RF. I am playing a \u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E install so it is unlikely that other mod has applied their boil-off after the \u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E configs; I did, however, notice a difference between cryogenic and non-cryogenic tanks. However, the difference is confusing: for Cryogenic types, having a higher skin temp does result a very slow but clearly noticeable loss; for BalloonCryo types the loss is very apparent. Notice in both case I do have my internal temp down to 19K because the Heat Pump is doing its job properly. I also tried Default tanks, and the result is not too dissimilar to the Cryogenic type tanks, and has a less loss when compared to a BalloonCryo. This seems to imply that a BalloonCryo actually have worse insulation than a Default.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E I do remember just a few months ago when cooling down a Cryogenic tank means it really isn\u0027t losing anything at least in a few weeks, and when done properly it would almost hold LH2 indefinitely. I strongly believe that there\u0027s something to do with \u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E and/or RF changes.\n\u003E \n\nIf internal temp is at 19K then it\u0027s not possible that RF is applying boiloff. I had to go refresh my memory as to how things were working and basically, mounting a Heat Pump part on a tank part forces it to use the internal temp if it wasn\u0027t already doing so before.\n\nThe only other way that I can see this happening is through analytic mode (high time warp, i.e. over 100x) which you didn\u0027t say was when this was happening, but it would still only be possible for RF to apply boiloff if internal temp were higher than 20.15K. So, analytic mode or not, if it\u0027s at 19K then RF can\u0027t apply boiloff. (or in the case of LOX, 90K)"},{"CreatedByName":"wb99999999","CreatedById":169898,"CreatedDateTime":"2017-08-12T01:38:57Z","Content":"\u003E \n\u003E \n\u003E Just now, Starwaster said:\n\u003E \n\u003E \n\u003E The only other way that I can see this happening is through analytic mode (high time warp, i.e. over 100x) which you didn\u0027t say was when this was happening, but it would still only be possible for RF to apply boiloff if internal temp were higher than 20.15K. So, analytic mode or not, if it\u0027s at 19K then RF can\u0027t apply boiloff. (or in the case of LOX, 90K)\n\u003E \n\nI am pretty sure it has nothing to do with being in time warp or not. At 1x speed it loses 0.00 liter of LH2 every second, but as soon as I speed it up to 10x speed, it is losing 0.03 liter per second. Usually when something is not being consumed it just say 0 on the meter, the two zeros after the decimal just give away the fact that it is just too little to fit in the significant digits.\n\nIn the mean time I\u0027ll try to remove any mod which can mess with this in any remote possible ways and see if anything changes"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2017-08-12T01:45:54Z","Content":"\u003E \n\u003E \n\u003E Just now, wb99999999 said:\n\u003E \n\u003E \n\u003E I am pretty sure it has nothing to do with being in time warp or not. At 1x speed it loses 0.00 liter of LH2 every second, but as soon as I speed it up to 10x speed, it is losing 0.03 liter per second. Usually when something is not being consumed it just say 0 on the meter, the two zeros after the decimal just give away the fact that it is just too little to fit in the significant digits.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E In the mean time I\u0027ll try to remove any mod which can mess with this in any remote possible ways and see if anything changes\n\u003E \n\nYou need to enable boiloff debugging too.\n\nMake a patch file (cfg file, name it something like enableboiloffdebugging.cfg) and paste the following into it:\n\n    @RFSETTINGS\n    {%debugBoilOff = True\n    }\n\nThat will give you some additional information on boiloff in the tank\u0027s action menu: \n\n- wall temperature (THIS is temperature being used in the boiloff equation. It has to be higher than the resource being boiled)\n- heat penetration (how much heat flux actually being applied to the resource by RF boiloff code)\n- boiloff loss (how much mass is being lost as a result of RF boiloff code)\n\nFor RF to be responsible for boiloff then all of the following have to be true\n\n1. The wall temperature has to be higher than the resources boiling temperature\n2. A value representing heat penetration has to be present. If condition 1 is false then heat penetration will be BLANK\n3. boiloff loss has to have a value. If condition 1 is false then this value will be BLANK"},{"CreatedByName":"wb99999999","CreatedById":169898,"CreatedDateTime":"2017-08-12T03:27:09Z","Content":"[@Starwaster](https://forum.kerbalspaceprogram.com/index.php?/profile/71262-starwaster/) Finding 1: The wall temperature the boil-off code is using seems to be ONLY related to skin temperature in my case. Here\u0027s the situation:\n\n![D6FFdX6.png](http://i.imgur.com/D6FFdX6.png)"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2017-08-12T03:32:06Z","Content":"[@wb99999999](https://forum.kerbalspaceprogram.com/index.php?/profile/169898-wb99999999/) Ok let\u0027s take a look at your ModuleManager.ConfigCache file. Please put that somewhere I can download it\n\nAnd where is all that other thermal data coming from? I don\u0027t recognize that\n\n**Edited \u003Ctime datetime=\u00222017-08-12T03:33:04Z\u0022 title=\u002208/12/2017 03:33  AM\u0022 data-short=\u00226 yr\u0022\u003EAugust 12, 2017\u003C/time\u003E by Starwaster**"}]}