{"TopicId":115734,"ForumId":34,"TopicTitle":"Heat Pumps v1.3.0 for Real Fuels - May 1, 2017","CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2015-07-12T18:48:07Z","PageNum":1,"Articles":[{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2015-07-12T18:48:07Z","Content":"**Heat Pump version 1.3.1!**\n\nHeat Pump is derived from the heat pump code that originated in Modular Fuel Tanks / Real Fuels, originally created by ialdabaoth (who is awesome!)\n\nHeatPump from RealFuels\n\nVersion 1.3.1 updated for Real Fuels (any version of RF that works with KSP 1.2.2)\n\nThe purpose of Heat Pump is to intercept heat and cool down cryogenic tanks to prevent boiloff.\n\nPumps can be configured with the following features.\n\n- An amount of heat is removed from protected parts (active refrigeration) equal to a flat rate multiplied by a temperature delta.\n- The flat rate is capped at ten times the flat rate value by default.\n- The heat pumps also attempt to remove any heat that leaked into the part\u0027s interior (from the skin and adjacent parts)\n- Resource cost per kilowatt of heat removed.\n- The amount of heat moved into the radiator is split up among any symmetrically added radiators.\n- This mod comes with a radiator part created by zzz (licensed by GingerCorp) and Heat Pump versions of all stock radiators are also included.\n\nAnother feature is that the conductivity of protected parts is lowered. This represents the addition of multi layered insulation to the outside of the part. (generally cryogenic fuel tanks). In real life applications, this would be an important part of thermal management. This feature will require balancing against the loss rates of Real Fuels tanks which assume that insulation was builtin but don\u0027t take into consideration ZBO applications.\n\nThe radiator will drain heat from whatever it is connected to. It drains a flat rate of 50kw  \u002B a amount equal to whatever heat is leaking through the insulation. (this because the goal is zero boiloff)\n\n***KNOWN ISSUES***\n\nTime warp faster than 100x (technically this starts at 1000x which is one step up from 100 in stock) will cause problems because KSP\u0027s thermodynamics switches into analytical mode which doesn\u0027t simulate heat transfer in a time based manner. If you must warp faster I recommend doing it from the space center until a solution can be found.\n\n[Download Latest](https://github.com/Starwaster/HeatPump/releases/latest)\n\n[Github (source)](https://github.com/Starwaster/HeatPump)\n\nIf you find this mod helpful and want to throw some money away, feel free to click the donate button below!\n\n[![btn_donate_LG.gif](https://www.paypalobjects.com/en_US/i/btn/btn_donate_LG.gif)](http://paypal.me/Starwaster)\n\nLicense for the plugin is CC-SA-BY as it was in Real Fuels. (with the provision that derivative works must proclaim that ialdabaoth is awesome)\n\nLicense for the zzz radiator is public domain as all of zzz\u0027s released parts are public domain. (the part is renamed to avoid conflict with any other mods that may be using it)\n\n[https://creativecommons.org/licenses/by-sa/3.0/us/](https://creativecommons.org/licenses/by-sa/3.0/us/)\n\n**Edited \u003Ctime datetime=\u00222017-05-01T19:21:01Z\u0022 title=\u002205/01/2017 07:21  PM\u0022 data-short=\u00227 yr\u0022\u003EMay 1, 2017\u003C/time\u003E by Starwaster**\n  \nUpdate for KSP 1.2.2"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2015-07-12T18:49:25Z","Content":"Reserved for changelogs"},{"CreatedByName":"Temeter","CreatedById":58056,"CreatedDateTime":"2015-07-12T19:02:31Z","Content":"Awesome, can\u0027t wait to try some fun long range stuff outside of the allmighty Aestus II! ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\nBtw, isn\u0027t it possible to set the mod into some kind of cheat mode during high timewarps? I know, it\u0027s not really \u0027balance\u0027 per se, but we\u0027re able to customize our experience anyway and decide how realistic we want to make it for ourselfs.\n\nIMO would be better that loosing to much fuel on long range missions.\n\n\u003E \n\u003E Squueeee!!!\n\u003E Will this work in RO? If so I recommend it be added to the recommended list!\n\nBoiloff is part of RO/RF, so I assume so! ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)\n\n**Edited \u003Ctime datetime=\u00222015-07-12T19:05:24Z\u0022 title=\u002207/12/2015 07:05  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 12, 2015\u003C/time\u003E by Temeter**"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2015-07-12T19:23:37Z","Content":"RO would require some rebalancing of resource consumption. NASA/GRC say cryo coolers require about 114 watts of electrical power per watt of heat removed. Obviously if I set power consumption that high it would be a problem in stock so I configured for stock first. But power consumption is even higher regardless of stock or RO right now because nobody has really designed their parts to account for insulation that I know of...."},{"CreatedByName":"basic.syntax","CreatedById":109920,"CreatedDateTime":"2015-07-12T19:36:20Z","Content":"About the Known Issues statement: I had thought all calculations for all events were performed in the same ways once in timewarp / on rails. Is this \u0027analytic mode\u0027 above 100x exclusive to Thermal, or is it also used by other systems?"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2015-07-12T20:14:50Z","Content":"\u003E \n\u003E About the Known Issues statement: I had thought all calculations for all events were performed in the same ways once in timewarp / on rails. Is this \u0027analytic mode\u0027 above 100x exclusive to Thermal, or is it also used by other systems?\n\nIt\u0027s really from 1000x up which is the next time step after 100x\n\nand AFAIK only thermal does it. Aero doesn\u0027t of course because that\u0027s on rails. \n\nI dont know of any other systems that behave that way on rails at high speeds vs lower speeds"},{"CreatedByName":"basic.syntax","CreatedById":109920,"CreatedDateTime":"2015-07-12T21:00:06Z","Content":"Thanks for info!"},{"CreatedByName":"Temeter","CreatedById":58056,"CreatedDateTime":"2015-07-13T00:14:34Z","Content":"I can\u0027t get it to work after 2 ships: From what i\u0027m understanding, the radiator will draw out heat and therefor actively cool the tank, keeping it at low temperatures, while actively counteracting boil-off?\n\nMade a very simple ship for testing purposes and put it into orbit: Basically a pod, behind it a tank with an engine on it (and the usual doodads, reentry stuff, RCS, etc). BallonCryo tank is filled with ~12 to 20T of LH/LOX and surrounded by 6 radiators. Now the issue is the tanks temperature (in orbit) is constantly rising, and there is a bit of boiloff going on. Activating or deactivating the radiators doesn\u0027t seem to do anything (got a high skin temp which doesn\u0027t seem to change depending on state).\n\n**Edit:** I would of course never suspect such a talented modder, who has done so much for the community, but I can\u0027t help but notice a strange emptiness inside of the plugin folder...\n\n**Edited \u003Ctime datetime=\u00222015-07-13T00:50:08Z\u0022 title=\u002207/13/2015 12:50  AM\u0022 data-short=\u00228 yr\u0022\u003EJuly 13, 2015\u003C/time\u003E by Temeter**"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2015-07-13T01:51:11Z","Content":"\u003E \n\u003E I can\u0027t get it to work after 2 ships: From what i\u0027m understanding, the radiator will draw out heat and therefor actively cool the tank, keeping it at low temperatures, while actively counteracting boil-off?\n\u003E Made a very simple ship for testing purposes and put it into orbit: Basically a pod, behind it a tank with an engine on it (and the usual doodads, reentry stuff, RCS, etc). BallonCryo tank is filled with ~12 to 20T of LH/LOX and surrounded by 6 radiators. Now the issue is the tanks temperature (in orbit) is constantly rising, and there is a bit of boiloff going on. Activating or deactivating the radiators doesn\u0027t seem to do anything (got a high skin temp which doesn\u0027t seem to change depending on state).\n\u003E \n\u003E **Edit:** I would of course never suspect such a talented modder, who has done so much for the community, but I can\u0027t help but notice a strange emptiness inside of the plugin folder...\n\nomg.... seriously...?\n\nI forgot to copy the freakin plugin to the plugin folder?\n\nBut... then... what do you mean you\u0027re getting a high skin temperature........ ok whatever let me go fix this.... (but also seriously, nobody else noticed this and came to chastise me? For 9 hours?)\n\nEdit: Fixed. I feel like such a.... a... I don\u0027t even know right now.\n\n**Edited \u003Ctime datetime=\u00222015-07-13T01:53:40Z\u0022 title=\u002207/13/2015 01:53  AM\u0022 data-short=\u00228 yr\u0022\u003EJuly 13, 2015\u003C/time\u003E by Starwaster**"},{"CreatedByName":"Temeter","CreatedById":58056,"CreatedDateTime":"2015-07-13T02:58:20Z","Content":"That\u0027s unacceptable. I\u0027m afraid I need to ask for a refund. :\u003C\n\nJokes aside: LOL, don\u0027t sweat it! I\u0027m surprised you guys don\u0027t make more terminal mistakes, throwing around so many numbers, dependencies and configs. As for the 9 hours, i\u0027ve spend much longer times failing to design a mars lander than that (newest variation has the advantage of looking like one of these japanese throwing daggers, tho!). This kind of thing is generally easy to miss, especially considering how long it can take to understand systems in RSS/RO.\n\nbtw: As for the high skin temperature, radiator temp was ~130 like the other parts of my craft (including stock radiators), but their external temp was ~260.\n\n**Edited \u003Ctime datetime=\u00222015-07-13T03:09:44Z\u0022 title=\u002207/13/2015 03:09  AM\u0022 data-short=\u00228 yr\u0022\u003EJuly 13, 2015\u003C/time\u003E by Temeter**"},{"CreatedByName":"Temeter","CreatedById":58056,"CreatedDateTime":"2015-07-14T20:28:09Z","Content":"So, I\u0027ve played around a bit, and it works splendid! Might indeed need some balancing, tho. The high electricity requirements are good (finally a reason to use those large solar panels!), but the radiators are a bit strong, or at least don\u0027t scale enough. Had a small ship around kerbin, and the heat influx from the sun was around ~3 (whatever unit KSP uses), while a single radiator removed ~9. Which of course resulted over time in the tank getting down to 4 Kelvin. It\u0027s of course the aim of having next to zero boiloff, but it should maybe scale with the temperature. E.g. so keeping a tank at 40K is easy, but 20K does take a bit more proportional effort.\n\nI didn\u0027t test heat development or solar panel capacity nearer or further away from the sun, tho. That might make things a lot harder than they are around kerbin."},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2015-07-14T23:48:36Z","Content":"\u003E \n\u003E So, I\u0027ve played around a bit, and it works splendid! Might indeed need some balancing, tho. The high electricity requirements are good (finally a reason to use those large solar panels!), but the radiators are a bit strong, or at least don\u0027t scale enough. Had a small ship around kerbin, and the heat influx from the sun was around ~3 (whatever unit KSP uses), while a single radiator removed ~9. Which of course resulted over time in the tank getting down to 4 Kelvin. It\u0027s of course the aim of having next to zero boiloff, but it should maybe scale with the temperature. E.g. so keeping a tank at 40K is easy, but 20K does take a bit more proportional effort.\n\u003E I didn\u0027t test heat development or solar panel capacity nearer or further away from the sun, tho. That might make things a lot harder than they are around kerbin.\n\nThere\u0027s a bit of a formula in there that governs that but it dates back to the early days of the heat pump code so it clearly needs some work.... \n\nOr maybe there should be a more automated setting where the base rate is calculated on a tank by tank basis.... but yeah, still needs some balancing work\n\nAll heat units are in kilowatts btw.\n\nAnother possible option is just to do away with the base rate as it will always try to remove conductive heat no matter what. Anything above that is like you\u0027re trying to refrigerate the tank contents themselves and in reading about ZBO it seems like they\u0027re only aiming for (and needing to) stop incoming heat. You don\u0027t need to chill the contents further. (and might not be able to... I mean, 4K is FROZEN hydrogen. You\u0027re having to THAW that stuff before you can use it ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif))"},{"CreatedByName":"Temeter","CreatedById":58056,"CreatedDateTime":"2015-07-15T02:54:33Z","Content":"Well, everything solid can be cut into pieces and thrown out of the airlock. Propulsion is propulsion, i\u0027m not gonna judge. ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\nBut it is possible to \u0027refrigerate\u0027 in space? Should be possible, if you move warmth to the radiator? I mean, that\u0027s what a normal radiator does, isn\u0027t it. Thing is, I\u0027m not completely trusting KSPs Thermal system to reliable work with a part loosing warmth on an incredibly slow rate on very high timewarps, even if current issues are fixed. Or think about operations in hot places (low solar orbit, certain planets/moons).\n\nMaybe a good way would be to do both things at once: One part for added insulation and stopping heat influx, another one for extremly slowly removing heat (as a single part radiator, similar to the current part). So you could decide if you just want insulation, or take the weight for an additional system (\u002Bpanels) to slowly cool it down. Latter could of course be made so weak it is basically useless without said insulation and maybe detoriating efficiency on ultra low temperatures. I like ice, but i\u0027m not convinced hydrogen tastes very well.\n\n**Edited \u003Ctime datetime=\u00222015-07-15T02:57:18Z\u0022 title=\u002207/15/2015 02:57  AM\u0022 data-short=\u00228 yr\u0022\u003EJuly 15, 2015\u003C/time\u003E by Temeter**"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2015-07-15T04:36:01Z","Content":"\u003E \n\u003E Well, everything solid can be cut into pieces and thrown out of the airlock. Propulsion is propulsion, i\u0027m not gonna judge. ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\u003E But it is possible to \u0027refrigerate\u0027 in space? Should be possible, if you move warmth to the radiator? I mean, that\u0027s what a normal radiator does, isn\u0027t it. Thing is, I\u0027m not completely trusting KSPs Thermal system to reliable work with a part loosing warmth on an incredibly slow rate on very high timewarps, even if current issues are fixed. Or think about operations in hot places (low solar orbit, certain planets/moons).\n\u003E \n\u003E Maybe a good way would be to do both things at once: One part for added insulation and stopping heat influx, another one for extremly slowly removing heat (as a single part radiator, similar to the current part). So you could decide if you just want insulation, or take the weight for an additional system (\u002Bpanels) to slowly cool it down. Latter could of course be made so weak it is basically useless without said insulation and maybe detoriating efficiency on ultra low temperatures. I like ice, but i\u0027m not convinced hydrogen tastes very well.\n\nOf course it\u0027s possible to refrigerate in space. You have heat; you move it from one place to another. You can even move it somewhere that\u0027s hotter than where you\u0027re moving it from. That\u0027s what refrigerators do. Work has to be performed to make that happen and that\u0027s where the electrical cost comes in.\n\nInsulation is important so that you don\u0027t have to deal with as much heat, but insulation has mass and one criteria in choosing insulation is you don\u0027t want your insulation to have more mass than what you stand to lose in boiloff.\n\nObviously that\u0027s not a criteria in KSP right now... maybe that\u0027s something for Real Fuels in the future. \\*shrug\\*"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2015-10-31T19:56:25Z","Content":"Updated Heat Pump for Real Fuels 10.7.0\n\n[https://github.com/Starwaster/HeatPump/releases/latest](https://github.com/Starwaster/HeatPump/releases/latest)"},{"CreatedByName":"Svm420","CreatedById":136047,"CreatedDateTime":"2015-11-02T17:21:56Z","Content":"I see the line legacy = true was removed from the part and the EC rate was put to zero what was the reasoning behind that."},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2015-11-02T18:33:52Z","Content":"\u003E \n\u003E I see the line legacy = true was removed from the part and the EC rate was put to zero what was the reasoning behind that.\n\nThe code that would have used legacy is deprecated; it made less sense now that Real Fuels\u0027s boil-off is KSP 1.0 compatible\n\nRemoving the EC rate was done accidentally while trying to calibrate it with the new system. (merged the wrong set of changes locally) It\u0027ll be put back."},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2016-05-31T10:13:18Z","Content":"Heat Pump v1.2 update for KSP 1.1.2 (for any version of Real Fuels that works with KSP 1.1.2\n\n\\* Compiled for KSP 1.1.2  \n\n\\* Flat cooling rate revamped: Scaled by temperature delta and capped at twice its value times the number of radiators placed symmetrically\n\n*Download!*\n\n[https://github.com/Starwaster/HeatPump/releases/tag/v1.2](https://github.com/Starwaster/HeatPump/releases/tag/v1.2)"},{"CreatedByName":"smartdummies","CreatedById":112718,"CreatedDateTime":"2016-06-10T16:18:54Z","Content":"Starwaster, I can work on configs for RO/RP-0 if you can point in a general direction for finding data. I only use RF in RO so those configs are important to me."},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2016-06-10T17:17:04Z","Content":"\u003E \n\u003E \n\u003E 5 minutes ago, smartdummies said:\n\u003E \n\u003E \n\u003E Starwaster, I can work on configs for RO/RP-0 if you can point in a general direction for finding data. I only use RF in RO so those configs are important to me.\n\u003E \n\nHere\u0027s a config with comments as to what each thing does. Note that heatTransfer is technically optional and is only 0.1 by default. Heat Pump works by intercepting conducted heat and providing just enough cooling to neutralize the heat that is in danger of penetrating the tank wall into the tank contents. A non-zero heatTransfer is basically actual refrigeration beyond insulation cooling. This really should not be set very high unless the application is some sort of ISRU making cryogenic fuels. Default is 0.1\n\nSo basically the way HP works is that it just intercepts incoming heat and provides just enough cooling to prevent that. For ZBO purposes a cryo tank really should have a lot of MLI installed but no existing tank parts are actually configured this way. Even the RF Cryogenic and BalloonCry tank types don\u0027t provide the type of insulation required for long term Earth-Mars voyages. That\u0027s what skinInternalConductionMult is for. Basically that needs to be set low enough to reduce heat penetration to watts instead of kilowatts if the objective is actual ZBO. (so in other words passive AND active heat management). In the example below it\u0027s set to 0.00005 which should be enough to reduce heating from solar/planetary flux to a few tens of watts down from several kilowatts\n\n    \tMODULE{\tname = ModuleHeatPump// Active tank refrigeration. Set this if you want cooling BEYOND heat penetration removal\theatTransfer = 50// Part\u0027s heatConductivity. Only gets set if provided value is lower than the part\u0027s current values during HP initialization\theatConductivity = 0.12// Part\u0027s skin-internal conduction factor. Only gets set if provided value is lower than the part\u0027s current values during HP initialization\t\t// This is meant to represent any multi layered insulation present\tskinInternalConductionMult = 0.00005// Percentage of max temp (skin and internal) at which throttling occurs\tradiatorMaxTempCap = 0.8// One RESOURCE node for each resource you want consumed (or gained!) for each watt of heat removed.\t// NASA documents state that 114 We are required for each Wt removed\tRESOURCE\t{\t\tname = ElectricCharge\t\trate = 0.114\t}// Need one of these for each attach node that you want heat to be removed through\t// name is either attach or the name of the stack node (i.e. top, bottom or other stack name)\tHEATPUMP_NODE\t{\t\tname = attach\t}}"},{"CreatedByName":"smartdummies","CreatedById":112718,"CreatedDateTime":"2016-06-10T22:29:13Z","Content":"I do believe I can work with this. Thanks a bunch."},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2016-07-08T17:14:58Z","Content":"Recompiled for KSP 1.1.3. Update pushed to[https://github.com/Starwaster/HeatPump/releases/latest](https://github.com/Starwaster/HeatPump/releases/latest)\n\nFuture plans are to allow power generation by converting heat to electricity. That can sort of already be done by setting the resource rate negative but I have the feeling that it would stop providing cooling if it couldn\u0027t find somewhere to store generated power since it scales cooling by how successful the resource request is. (basically this would be a Closed Brayton Cycle generator).\n\nOn the other hand it would probably a waste of time considering the current levels of download activity ![:(](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif \u0022:(\u0022)\n\nThere were a  grand total of 23 downloads of the prior update over slightly more than a 1 month period\n\nAnd 90 downloads of the version before that over a ~7 month period.\n\nNot to mention that taking advantage of a feature like that would probably require it to be picked up by other modders. Oh well."},{"CreatedByName":"smartdummies","CreatedById":112718,"CreatedDateTime":"2016-08-17T22:06:32Z","Content":"Hey Starwaster, I have been progressing on the configs for \u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E and while I can get the radiators to work correctly, the resetting of the conduction multiplier really bothers me as it is adding MLI to the tanks without adding in the mass needed to accomplish this. I have been looking for some details about how much weight this would add (preferable as comparable to the insulation levels on the Cyro tanks in Real Fuels but I can try and get the calculations based on Default and Balloon as a base if I need to) but have not found anything that I can understand enough to work with.  If you could provide some guidance here I should be able to create the MLI variants of the thank types and would not need to override the conduction multipliers. This would be preferable as the free insulation does not belong in \u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E, IMHO."},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2016-08-17T23:28:08Z","Content":"\u003E \n\u003E \n\u003E 16 minutes ago, smartdummies said:\n\u003E \n\u003E \n\u003E Hey Starwaster, I have been progressing on the configs for \u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003E\u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E\u003C/abbr\u003E and while I can get the radiators to work correctly, the resetting of the conduction multiplier really bothers me as it is adding MLI to the tanks without adding in the mass needed to accomplish this. I have been looking for some details about how much weight this would add (preferable as comparable to the insulation levels on the Cyro tanks in Real Fuels but I can try and get the calculations based on Default and Balloon as a base if I need to) but have not found anything that I can understand enough to work with.  If you could provide some guidance here I should be able to create the MLI variants of the thank types and would not need to override the conduction multipliers. This would be preferable as the free insulation does not belong in \u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003E\u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E\u003C/abbr\u003E, IMHO.\n\u003E \n\nFrom  \u003Cu\u003ENuclear Thermal Propulsion (NTP): A Proven Growth Technology for Human NEO / Mars Exploration Missions\u003C/u\u003E\n\n[http://ntrs.nasa.gov/archive/nasa/casi.ntrs.nasa.gov/20120003776.pdf](http://ntrs.nasa.gov/archive/nasa/casi.ntrs.nasa.gov/20120003776.pdf)\n\npage 9\n\n- Material: Aluminum-Lithium (Al/Li)\n- Tank ID/OD: ~9.8 m/10.0 m\n- Tank L: ~19.7 m (propulsion stage) – 22.7 m (“in-line” drop tank)\n- Geometry: cylindrical with root 2/2 ellipsoidal domes\n- Insulation: 1” SOFI (~0.78 kg/m2 ) \u002B 60 layers of MLI (~0.90 kg/m2 )\n\nIn LEO that resulted in ~78 W of heat flux penetrating the tank. (heatConductivity = 0.0039 would work I think...)\n\nIf you need more or less insulation it gets more complicated than I have time to type out right now, so more later as needed"},{"CreatedByName":"smartdummies","CreatedById":112718,"CreatedDateTime":"2016-08-21T11:56:13Z","Content":"Exactly what I\u0027m looking for. Many thanks."}]}