{"TopicId":115934,"ForumId":50,"TopicTitle":"Radial Separators in stock","CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-07-14T21:57:16Z","PageNum":1,"Articles":[{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-07-14T21:57:16Z","Content":"If you want to separate two vessels cleanly, without leaving any struts (including the Cubic, Octagonal Strut, which is a trivial solution... except it stays after separation), nodes etc, and you don\u0027t have a free node to attach a stack separator, here\u0027s how to construct a functional Radial Separator. It acts quite a bit like Radial Decoupler - except it detaches on both sides, staying as a space junk instead of sticking to either or both vessels.\n\nDisadvantages:\n\n - it\u0027s significantly thicker than the Radial Decoupler. About as big as the TT-70, the radial decoupler on long extensions.\n\n- It appears as two decouplers in the staging sequence. Either of them detaches one end.\n\n- It can\u0027t be saved as a subassembly to be brought readily. It must be constructed each time from scratch. (although using symmetry is perfectly possible, and copying it, etc).\n\n- Parts utilizing it may be saved as subassemblies, but it can\u0027t be the root part (the part you attach the subassembly by). This obstacle is circumvented through a trivial trick though.\n\nPart list:\n\n[![33px-Structural_Pylon.png](http://wiki.kerbalspaceprogram.com/images/thumb/0/0e/Structural_Pylon.png/33px-Structural_Pylon.png)](http://wiki.kerbalspaceprogram.com/wiki/File:Structural_Pylon.png)\n\n [- Structural Pylon](http://wiki.kerbalspaceprogram.com/wiki/Structural_Pylon) 2 pcs.\n\n[![55px-Cubic_Octagonal_Strut.png](http://wiki.kerbalspaceprogram.com/images/thumb/3/30/Cubic_Octagonal_Strut.png/55px-Cubic_Octagonal_Strut.png)](http://wiki.kerbalspaceprogram.com/wiki/File:Cubic_Octagonal_Strut.png)\n\n- [Cubic Octagonal Strut](http://wiki.kerbalspaceprogram.com/wiki/Cubic_Octagonal_Strut) 1pc.\n\n- Some dummy parts to attach these to. These will be deleted later.\n\n- whatever you want attached - a probe, a missile, a second craft. Must be \u0022visible\u0022, not \u0022ghosted\u0022 so if it\u0027s a subassembly, attach it to any dummy part.\n\nLet\u0027s start with the part you want cleanly separated. I\u0027ve made a \u0022lite\u0022 version of my SavingKlaw for deorbiting parts and kerbals from LKO. It\u0027s a little too thick for MK2 bay, and needs to be brought to orbit in bulk. I want it attachable under wings of an SSTO plane.\n\n![hrl7zoI.jpg](http://i.imgur.com/hrl7zoI.jpg)\n\nWe need a little bit of empty surface so I detached one of the parachutes. Attach one Structural Pylon there.\n\n![YdRqktm.jpg](http://i.imgur.com/YdRqktm.jpg)\n\nNow attach a cubic octagonal strut to the pylon, and rotate it inwards. (W, W)\n\n![PSYZX4Q.jpg](http://i.imgur.com/PSYZX4Q.jpg)\n\nAttach an arbitrary dummy part to the strut. Note its node points inwards. (don\u0027t attach it to the outer node. Chances are better than high that you\u0027ll attach it to the Pylon instead, and the whole thing won\u0027t work.) Use \u0022Mod key\u0022 to make sure it snaps to a node and not the pylon surface.\n\n![aOkk27D.jpg](http://i.imgur.com/aOkk27D.jpg)\n\nSelect \u0022Root\u0022, then click the cubic octagonal strut, then click the dummy part.\n\n![sj2w8S9.jpg](http://i.imgur.com/sj2w8S9.jpg)\n\nOpen \u0022Advanced\u0022 (the **\u003C||||** arrow in upper left corner), \u0022Subassemblies\u0022. Click the octagonal strut and drag the whole craft except the dummy \u0022root\u0022 to the Subassembly drop zone. Save. I always save these as \u0022Unnamed\u0022 as it\u0027s only temporary.\n\n![ntcksfY.jpg](http://i.imgur.com/ntcksfY.jpg)\n\nNow you can either load (or build) the main craft) or go the \u0022radially attachable subassembly\u0022 route. Let\u0027s pick the first one first.\n\nLoad your craft and attach structural pylons where you want the payload.\n\n![zNnPUnp.jpg](http://i.imgur.com/zNnPUnp.jpg)\n\nLoad the subassembly \u0022Unnamed\u0022 and attach it to these pylons. There. Don\u0027t forget to set the staging sequence!\n\n![PSkrpQY.jpg](http://i.imgur.com/PSkrpQY.jpg)\n\n![u0Z6Glu.jpg](http://i.imgur.com/u0Z6Glu.jpg)\n\nNow a slightly more elegant path of turning these temporary subassemblies into proper ones... well, almost.\n\nInstead of loading/creating a new craft, click \u0022New\u0022 and build something like this:\n\n![afSNyMD.jpg](http://i.imgur.com/afSNyMD.jpg)\n\nThe fuselage is the root part. It can be anything, any dummy part to stick the little strut on. Now load the subassembly and attach it.\n\n![DbvkeoA.jpg](http://i.imgur.com/DbvkeoA.jpg)\n\nGrab the whole thing by the one strut attached to the root part and save as a proper subassembly.\n\n![KX9qYh9.jpg](http://i.imgur.com/KX9qYh9.jpg)\n\nNow... what with the strut? Will it not remain attached to whatever we want this attached to? Nope. The aforementioned trivial trick is to load the subassembly, attach it anywhere, detach the pylon from the strut, attach it where it should go, then delete the strut. If you save with the pylon as a root part, it will insist on attaching by the narrower end, which doesn\u0027t decouple. By loading it with extra root part which you remove later, you can attach the active surface of the pylon to anything.\n\n![HiQL5dJ.jpg](http://i.imgur.com/HiQL5dJ.jpg)\n\n![AneE5dH.jpg](http://i.imgur.com/AneE5dH.jpg)\n\nAnd how do they work?\n\n![8hG4dyu.jpg](http://i.imgur.com/8hG4dyu.jpg)\n\n![IqLfZbx.jpg](http://i.imgur.com/IqLfZbx.jpg)\n\nWell, they work fine.\n\nPROTIP: By abuse of the Offset tool for clipping you can make these far more compact by moving them closer together... even to a negative values ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\n![J7vtxeA.jpg](http://i.imgur.com/J7vtxeA.jpg)"}]}