{"TopicId":115922,"ForumId":32,"TopicTitle":"Money problem","CreatedByName":"matiimakaka","CreatedById":148062,"CreatedDateTime":"2015-07-14T19:19:52Z","PageNum":1,"Articles":[{"CreatedByName":"matiimakaka","CreatedById":148062,"CreatedDateTime":"2015-07-14T19:19:52Z","Content":"\n\u003Cp\u003EHello. Sorry for my lenguage - I\u0027m from Poland \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E.\u003C/p\u003E\u003Cp\u003EOne week ago i start career, I did some contracts, and i got little Sience Points, but i don\u0027t look for my money and now i have 3500 credits \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI have 2 contract, but this contracts are difficutl (my bad). So, I must start new career or can You know how get little money? \u003C/p\u003E\u003Cp\u003EI\u0027m sorry if someone asked this question before me.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2015-07-14T19:41:39Z","Content":"\n\u003Cp\u003EContracts are currently the only way to bring in money. However, you should have a choice of contracts being offered to you. Are there any easier ones in that list? Can you cancel one you\u0027ve agreed to and do another instead? If not, then yes, it looks like you\u0027ll need to start over. \u003C/p\u003E\u003Cp\u003EMeanwhile, I understood your question and you are welcome to post here, but if you feel more comfortable in your native language, we do have a \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/forums/61-Polish\u0022 rel=\u0022external nofollow\u0022\u003Esub-forum for Polish\u003C/a\u003E. \u003C/p\u003E\u003Cp\u003EAnd welcome to the forum. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-07-14T19:47:42Z","Content":"\n\u003Cp\u003EIf you\u0027ve only got $3500 and 2 contracts taking up both contract slots in Mission Control, the only choice (other than restarting, which is fine really as you seem to be just starting out anyway) is to cancel them, take the hit, and start anew.\u003C/p\u003E\u003Cp\u003ENote: You won\u0027t go under $0 for canceling the contracts, so you\u0027ll only lose the $3500. And you can build a $3500 ship and put it on the launch pad, then cancel the contracts, and then recover the vessel to get your money back. So, all you\u0027ll lose is a little rep.\u003C/p\u003E\u003Cp\u003EThen you can take 2 new contracts that will give you some seed money to build a ship that can complete them. You could also just take a few \u0022test this part on the launch pad\u0022 type stuff to build up a bankroll so you can tackle harder missions (and get your rep back you lost earlier).\u003C/p\u003E\n"},{"CreatedByName":"Tylerd","CreatedById":147949,"CreatedDateTime":"2015-07-14T19:52:21Z","Content":"\n\u003Cp\u003Ewith career mode ive found its much more fun if you set your starting money to 500,000, and set starting science to like 300 or so. Starting out in career mode is the most boring part of the game, by customizing the settings this way it skips that initial boring part.\u003C/p\u003E\n"},{"CreatedByName":"monstah","CreatedById":95210,"CreatedDateTime":"2015-07-14T19:53:50Z","Content":"\n\u003Cp\u003EDon\u0027t forget there\u0027s a new policy to be used in the Administration Building which lets you sell off your rep for money in a one-shot (it\u0027s called \u0022Bail-out\u0022, if i\u0027m not mistaken)\u003C/p\u003E\u003Cp\u003EI don\u0027t know if it\u0027s enough money to be worth the trouble, tho, but it\u0027s better than nothing \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"oglommi","CreatedById":127214,"CreatedDateTime":"2015-07-14T20:45:18Z","Content":"\n\u003Cp\u003EHolding Alt F12 for a while also brings up a cheat panel where you can add money\u003C/p\u003E\n"},{"CreatedByName":"matiimakaka","CreatedById":148062,"CreatedDateTime":"2015-07-15T14:35:15Z","Content":"\n\u003Cp\u003EOk. Now i have 15k dollars. Thank you \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-15T15:20:14Z\u0022 title=\u002207/15/2015 03:20  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 15, 2015\u003C/time\u003E by matiimakaka\u003C/strong\u003E\n\u003C/span\u003E\n"}]}