{"TopicId":116087,"ForumId":32,"TopicTitle":"Finally back to KSP!.. but I need help :(","CreatedByName":"Dewm","CreatedById":76148,"CreatedDateTime":"2015-07-16T18:29:49Z","PageNum":1,"Articles":[{"CreatedByName":"Dewm","CreatedById":76148,"CreatedDateTime":"2015-07-16T18:29:49Z","Content":"\n\u003Cp\u003ESo I put a few hundred hours on KSP back in the day (almost 2 years ago now?) and I finally came back, been having a blast with the career mode. BUT I\u0027m having trouble orbiting efficiently, I\u0027m burning way to much fuel for what I\u0027m doing.. So assuming physics have changed a little and/or aerodynamics, what is the efficient launch trajectory? Thanks!\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003ESide note: haha looking at my forum join date it was almost 2 years ago :S\u003C/p\u003E\n"},{"CreatedByName":"HoloYolo","CreatedById":138353,"CreatedDateTime":"2015-07-16T18:31:02Z","Content":"\n\u003Cp\u003EYou have to fly like you would\u0027ve with FAR in 0.90 and below.\u003C/p\u003E\n"},{"CreatedByName":"klesh","CreatedById":110814,"CreatedDateTime":"2015-07-16T18:33:46Z","Content":"\n\u003Cp\u003EThe atmosphere changed with 1.0, and then changed a few more times with subsequent panic patches.\u003C/p\u003E\u003Cp\u003EWhat to do now is to pitch 10 degrees after about 1km off the launchpad (sometimes less) to initiate a gravity turn into orbit. By 10-15km I am at 45 degrees, I burn out of the atmosphere and circularize. Atmo still stops at 70km. Its a little different than the ol straight up to 10k and turn, you have to watch your speed as heating can become a factor if you\u0027re too fast.\u003C/p\u003E\n"},{"CreatedByName":"Dewm","CreatedById":76148,"CreatedDateTime":"2015-07-16T18:40:19Z","Content":"\n\u003Cp\u003EYeah I remember the 10K and turn, that\u0027s what I\u0027ve been doing, and like I said..its bad. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EI appreciate the info, I\u0027ve been running into heat issues on the way up, and getting completely fried on the way down, I think I need more shallow re-entry trajectories. So things have definitely changed. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E but like I said, been having a blast.\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2015-07-16T18:49:56Z","Content":"\n\u003Cp\u003EYup - shallow re-entries are the way forward now and Klesh has you covered for the new launch profile.\u003C/p\u003E\u003Cp\u003EThe new aerodynamics are great though - you can do proper gravity turns now, as in \u0027switch off SAS and let the rocket fly itself.\u0027 Well sort of - I tend to chicken out at about 45 degrees and fly the rest of the ascent manually. But it\u0027s still pretty cool to watch the first half of the launch!\u003C/p\u003E\n"},{"CreatedByName":"klesh","CreatedById":110814,"CreatedDateTime":"2015-07-16T18:51:55Z","Content":"\n\u003Cp\u003EIndeed. Play with your thrust levels on boosters stages and such, so you don\u0027t go screaming up, you want to stay around 250m/sec or so for the first while, then you can get faster once you\u0027re through some of the thicker air. Also, I find I dont use SAS on the initial stages or you get too much wobble. Potentially limit engine gimbal as well. I\u0027ll turn it on when I am just about to go to my upper stage, higher up where there is less air for the gimbaling to fight against causing wobble. Re-entry can be tough too with the heat, and aerocapturing is vastly different now.\u003C/p\u003E\n"},{"CreatedByName":"Dewm","CreatedById":76148,"CreatedDateTime":"2015-07-16T18:57:00Z","Content":"\n\u003Cp\u003EThanks for the info everyone!\u003C/p\u003E\u003Cp\u003EKlesh, I was looking at your pictures in your sig, you have one \u0022preparing a flyby of Vall on the way to Jool\u0022, are those stock graphics? I turned mine all the way up (I thought) but those look really good, is there a nice texture/shadow mod or something?\u003C/p\u003E\u003Cp\u003EThanks!\u003C/p\u003E\n"},{"CreatedByName":"klesh","CreatedById":110814,"CreatedDateTime":"2015-07-16T20:39:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dewm\u0022 data-cite=\u0022Dewm\u0022\u003E\u003Cdiv\u003EThanks for the info everyone!\u003Cp\u003EKlesh, I was looking at your pictures in your sig, you have one \u0022preparing a flyby of Vall on the way to Jool\u0022, are those stock graphics? I turned mine all the way up (I thought) but those look really good, is there a nice texture/shadow mod or something?\u003C/p\u003E\u003Cp\u003EThanks!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHoly moly, someone actually looked at those!?! Thank you \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E None of my friends are into KSP, so they never appreciate my accomplishments, lol.\u003C/p\u003E\u003Cp\u003EThe only change in graphics I have that might be modifying that scene is \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/55905-0-24-7-4-Sep-9-2014-EnvironmentalVisualEnhancements\u0022 rel=\u0022external nofollow\u0022\u003EEnvironmental Visual Enhancements\u003C/a\u003E, which probably puts clouds around Jool. I use \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/69907-0-24-Distant-Object-Enhancement-1-3-1-Planets-satellites-in-the-night-sky!-%287-29%29\u0022 rel=\u0022external nofollow\u0022\u003EDistant Object Enhancement\u003C/a\u003E too, but everything you\u0027re seeing there is loaded and probably not altered by it. I don\u0027t have any shadows mod, but I do think I have them cranked up in the settings maybe?\u003C/p\u003E\n"}]}