{"TopicId":116180,"ForumId":32,"TopicTitle":"This new atmosphere sucks!","CreatedByName":"HoloYolo","CreatedById":138353,"CreatedDateTime":"2015-07-17T15:13:02Z","PageNum":1,"Articles":[{"CreatedByName":"HoloYolo","CreatedById":138353,"CreatedDateTime":"2015-07-17T15:13:02Z","Content":"I\u0027ll go and say it! IT SUCKS! I know it wasn\u0027t realistic, but deploying parachutes at any speed was WAY better then not being able to deploy them at 250 m/s or less. Duna landings now require way more delta-v then necessary due to the fact that you go too fast for parachutes to deploy. No more upwards launches! When you come back down, you usually die of lithobraking because of the 1 inch sheet we now call an atmosphere on Kerbin. Atmospheres go so much higher that reentry takes like an hour. Thanks."},{"CreatedByName":"smjjames","CreatedById":134004,"CreatedDateTime":"2015-07-17T15:17:54Z","Content":"TBH, I prefer it over the old soupisphere.\n\nAlso, you\u0027re not supposed to go upwards to 10km or whatever and then 45degrees, do a normal gravity turn.\n\nAtmospheric height never changed, aside from Jool, come on......"},{"CreatedByName":"moogoob","CreatedById":118251,"CreatedDateTime":"2015-07-17T15:17:59Z","Content":"[lebowski]That\u0027s like, your opinion, man.[/lebowski]\n\nOr it means we need more and varied options for things like drogue chutes - maybe some even Duna specific (made for low pressure\u002Bhigh speed). Or you need to make your re-entry craft draggier. Or, indeed, include \\*gasp\\* engines on your landers...\n\nEDIT: What about using a ring of Separatrons or a Flea to decelerate for Duna landing? Just fire to slow down, then drop it and pop chutes. Have you tried airbrakes? Wings?\n\n**Edited \u003Ctime datetime=\u00222015-07-17T15:20:29Z\u0022 title=\u002207/17/2015 03:20  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 17, 2015\u003C/time\u003E by moogoob**"},{"CreatedByName":"Feradose","CreatedById":111211,"CreatedDateTime":"2015-07-17T15:18:40Z","Content":"Is this really a problem? It makes the game a lot more fun in my opinion.\n\nBut then again, it is only my opinion."},{"CreatedByName":"smjjames","CreatedById":134004,"CreatedDateTime":"2015-07-17T15:22:16Z","Content":"Also, not being able to deploy chutes while going at 1km/s\u002B while diving through reentry plasma is actually realistic. Try it in real life and your chutes will both shred and burn.\n\nFor Duna, you can also spam chutes, that\u0027s how RoverDude does it, and like MooGoob said, add engines to the landers."},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2015-07-17T15:24:00Z","Content":"Yep, it sucks. So I use FAR - it\u0027s a lot more realistic then stock. ![:sticktongue:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif)\n\nP.S.\n\nDamn, whole thread grown before I managed to replay to the first post when it was alone. Talk about ninjas. ![:sticktongue:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif)"},{"CreatedByName":"Feradose","CreatedById":111211,"CreatedDateTime":"2015-07-17T15:28:42Z","Content":"\u003E \n\u003E Yep, it sucks. So I use FAR - it\u0027s a lot more realistic then stock. ![:sticktongue:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif)\n\u003E P.S.\n\u003E \n\u003E Damn, whole thread grown before I managed to replay to the first post when it was alone. Talk about ninjas. ![:sticktongue:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif)\n\nThis gets many true points. I use FAR too, but the stock atmosphere isnt nowhere as bad as 0.90\u0027s, the overhaul did a pretty damn good job.\n\nI dont understand \u0022I hate X because I cant do Y anymore, and I refuse to do little, logical workarounds to do it again.\u0022"},{"CreatedByName":"SAI Peregrinus","CreatedById":125558,"CreatedDateTime":"2015-07-17T15:32:21Z","Content":"FAR \u002B RealChute. You get different chute materials, usable for different purposes."},{"CreatedByName":"Xannari Ferrows","CreatedById":125369,"CreatedDateTime":"2015-07-17T15:32:42Z","Content":"Duna landings require no more Delta-V for landing. You just have to be strategic on how you enter the atmosphere, like it should\u0027ve been.\n\nUpward launches are inefficient anyway. Not to mention, I think you have it backwards. Upward launches are BETTER now. \n\n\u003E \n\u003E Since the center of mass [rotation] tends to be farther back near the engines, the cross section of your rocket above the center of mass is tilted slightly below the airstream. This becomes apparent when you start moving quickly, as the applied lift forces will start dragging your nose down, and eventually start spinning you around. Wait until you\u0027re up high enough so that the air is light enough to safely turn\n\nYou aren\u0027t supposed to be a rock dropping straight down into the atmosphere. You need to enter at an angle so that you spend more time killing velocity. The shallower the angle, the less vertical speed you need to worry about."},{"CreatedByName":"smjjames","CreatedById":134004,"CreatedDateTime":"2015-07-17T15:33:26Z","Content":"\u003E \n\u003E This gets many true points. I use FAR too, but the stock atmosphere isnt nowhere as bad as 0.90\u0027s, the overhaul did a pretty damn good job.\n\u003E I dont understand \u0022I hate X because I cant do Y anymore, and I refuse to do little, logical workarounds to do it again.\u0022\n\nEspecially those people who still do the old \u0027vertical to 10km or 20km and then 45degree tilt\u0027 thing from the soupisphere instead of a normal gravity turn."},{"CreatedByName":"imaspacestation","CreatedById":145609,"CreatedDateTime":"2015-07-17T15:35:23Z","Content":"I thought the entire point of the game was to learn new things and solve challenging problems in this simulated space environment. So then why whine when something you\u0027re used to do one way gets changed and you have to learn a new thing to solve a new challenge? I\u0027d understand if you were playing some MMO or something and your favourite class got nerfed and you can no longer roflpwn your face on the keyboard with it, but for this game? I just don\u0027t get it."},{"CreatedByName":"HoloYolo","CreatedById":138353,"CreatedDateTime":"2015-07-17T15:37:15Z","Content":"\u003E \n\u003E Especially those people who still do the old \u0027vertical to 10km or 20km and then 45degree tilt\u0027 thing from the soupisphere instead of a normal gravity turn.\n\nLittle do you guys know, I do a turn like your supposed to. I angle my launches. I use engines on Duna landings. The 1 inch atmosphere kills me, not my piloting."},{"CreatedByName":"Nich","CreatedById":145678,"CreatedDateTime":"2015-07-17T15:39:55Z","Content":"I am sorry but parachutes should be able to open at 2500 m/s all the air behind the shock cone is subsonic i.e. less then 343 m/s. Force at low density would be minimal and heating would be limited to the shock cone. Only way a chute would break is if you get to low in the atmosphere while still carrying significant velocity."},{"CreatedByName":"Feradose","CreatedById":111211,"CreatedDateTime":"2015-07-17T15:43:12Z","Content":"\u003E \n\u003E Little do you guys know, I do a turn like your supposed to. I angle my launches. I use engines on Duna landings. The 1 inch atmosphere kills me, not my piloting.\n\nHow come the rest of us survive? Is your install bugged?"},{"CreatedByName":"HoloYolo","CreatedById":138353,"CreatedDateTime":"2015-07-17T15:43:50Z","Content":"\u003E \n\u003E How come the rest of us survive? Is your install bugged?\n\nNope."},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-07-17T15:47:54Z","Content":"\u003E \n\u003E The 1 inch atmosphere kills me, not my piloting.\n\n\u003E \n\u003E How come the rest of us survive? Is your install bugged?\n\n\u003E \n\u003E Nope.\n\nSo then why do we all launch and land without dying?"},{"CreatedByName":"HoloYolo","CreatedById":138353,"CreatedDateTime":"2015-07-17T15:48:43Z","Content":"\u003E \n\u003E So then why do we all launch and land without dying?\n\nI really don\u0027t know at this point."},{"CreatedByName":"Goddess Bhavani","CreatedById":14001,"CreatedDateTime":"2015-07-17T15:50:09Z","Content":"I absolutely love the new atmosphere. Rocket launches require realistic-like roll and pitch programs, and re-entry vehicle design plays a huge part to survivability of manned missions returning home in one piece. I even developed a \u0027product line\u0027 of MARVs (maneuverable re-entry vehicles) specifically to make sharper re-entry angles survivable.... by actively flying out of the descent and landing precisely on the KSC runway! \n\nIf I had the old souposphere I would have given no thought to just crashing down vertically on planets, which, as everyone knows, totally wrong. There is a reason why the Space Shuttle spends such a long time on a shallow re-entry trajectory. It needs a lot of atmosphere to slow down from Mach 25 and down to a safe landing.\n\nThe Shuttle cannot and will not ever do a straight in dive to the ocean and expect anything to slow it down in time (vertical re-entry is fatal unless you have some sort of ballistic re-entry capsule, and even then a ballistic entry like that done by Soyuz in emergency mode, is definitely NOT pleasant to the occupants!)\n\nKSP gameplay is and should never be about \u0022beating the game\u0022. Whenever \u0022realism\u0022 is added to the stock game code, it is our duty as spacemen and women to adapt, overcome and continue reaching for the final frontier. We will be an even better community if we all adopted a unified strategy of continued learning and adaptation."},{"CreatedByName":"Rosco P. Coltrane","CreatedById":61065,"CreatedDateTime":"2015-07-17T15:50:10Z","Content":"I don\u0027t know how chutes work in real life. Do we have high-speed high-temperature drogue chutes IRL? I haven\u0027t tested the little chutes added recently to see if they help, but in any case my Duna landings are pretty much the same as they always have been, albeit a more shallow re-entry, but that\u0027s all."},{"CreatedByName":"Majorjim!","CreatedById":61954,"CreatedDateTime":"2015-07-17T15:53:17Z","Content":"I agree that the chutes are mostly useless now."},{"CreatedByName":"Goddess Bhavani","CreatedById":14001,"CreatedDateTime":"2015-07-17T15:53:29Z","Content":"\u003E \n\u003E I don\u0027t know how chutes work in real life. Do we have high-speed high-temperature drogue chutes IRL? I haven\u0027t tested the little chutes added recently to see if they help, but in any case my Duna landings are pretty much the same as they always have been, albeit a more shallow re-entry, but that\u0027s all.\n\nNASA actually recently sent aloft a \u0022Low Density Supersonic Decelerator\u0022 which appears to have two systems in one - an absolutely enormous supersonic parachute plus an inflatable \u0022disk sail\u0022 that adds immense drag to the re-entry vehicle. So far the LDSD\u0027s main parachute just rips to shreds in the supersonic airflow and more work needs to be done in this project.\n\nThis issue of parachutes being useless for thin atmospheres is a valid concern, but there are ways to work around the issue - skycranes do a good job for soft landing payloads after deploying out from a capsule, and the capsule\u0027s high drag shape both serves as thermal protection (higher the drag, the lower the thermal heating!) and do slow the payload down enough for the next stage of the landing sequence."},{"CreatedByName":"Xannari Ferrows","CreatedById":125369,"CreatedDateTime":"2015-07-17T15:55:03Z","Content":"You can always take advantage of the super overpowered airbrakes. Those things can actually make you land safely under the right circumstances."},{"CreatedByName":"imaspacestation","CreatedById":145609,"CreatedDateTime":"2015-07-17T15:55:49Z","Content":"Will people stop posting such melodramatic poasts if someone makes some new parachute parts that can survive at higher speeds and temperatures?"},{"CreatedByName":"smjjames","CreatedById":134004,"CreatedDateTime":"2015-07-17T15:56:46Z","Content":"\u003E \n\u003E Little do you guys know, I do a turn like your supposed to. I angle my launches. I use engines on Duna landings. The 1 inch atmosphere kills me, not my piloting.\n\nThe comment wasn\u0027t aimed at you, just people in general who DO do that. Sorry if it seemed like it was at you, didn\u0027t intend to mean that."},{"CreatedByName":"Goddess Bhavani","CreatedById":14001,"CreatedDateTime":"2015-07-17T15:58:18Z","Content":"In addition to airbrakes, sticking fins on capsules also allows them to actively or passively maneuver in the air depending on mass balance or design. Done right the difference in position between center of mass and pressure can make the craft \u0027fly\u0027 at an angle of attack (thanks NASA!) and perhaps convert its ballistic trajectory into a flatter or even upwards-coasting flight path, giving more time to slow down aerodynamically. \n\nSpace programs as early as Gemini actually do make use of this technique to manage descent rate and flight path."}]}