{"TopicId":116395,"ForumId":16,"TopicTitle":"Strategies for landing at KSP with rocket","CreatedByName":"Red Shirt","CreatedById":147465,"CreatedDateTime":"2015-07-20T11:39:38Z","PageNum":1,"Articles":[{"CreatedByName":"Red Shirt","CreatedById":147465,"CreatedDateTime":"2015-07-20T11:39:38Z","Content":"In days past I used MJ to land at KSP with rockets. Doing so with the new heat will result in a near certain fiery death in 1.04. MJ doesn\u0027t seem to grasp the near aero/heat on reentry. Yesterday, I returned from Mun and manually lowered Pe to 40k. Skipped back out a couple times. When the speed look OK for landing, I used MJ to locate KSP - can\u0027t usually see it through my cloud layers - and thought yeah, I can hit that mark. Fired the engines to slow for landing. Ended up in the middle of the ocean between KSP and the continent to the East. So, kind of close. \n\nTips for improving the accuracy?\n\n**Edited \u003Ctime datetime=\u00222015-07-20T16:07:26Z\u0022 title=\u002207/20/2015 04:07  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 20, 2015\u003C/time\u003E by Red Shirt**"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-07-20T12:16:41Z","Content":"Well.... nobody said a rocket couldn\u0027t have wings..."},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-07-20T12:32:30Z","Content":"I use some SSTO rocket. Recovery price depends a lot of landing distance. \n\nI usually come from a 75km orbit and do a deorbit burn of 60m/s on the western ridge of the big crater 90Ã‚Â° west of KSC. I usually overshoot KSC by 60km (recovering 97% of the rocket stage dry cost), thus splashing in water.\n\nTweaking landing point is very hard : the new aero make it very sensitive to vehicle shape. Airbrakes help a lot to tweak the landing zone."},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-07-20T14:11:20Z","Content":"1. Put a little rover or something at the end of the runway, makes it much easier to find KSC (and you can target it).\n\n2. Consistency. Get into a standard circular orbit every time you wish to reenter precisely. (I use 75x75km, but any circular orbit will do as long as you use the same one.)\n\n3. Practice and experiment. Use the quicksave functionality to determine when and how much your deorbit burn should be.\n\n4. Add airbrakes, if you are overshooting you can deploy them to slow down."},{"CreatedByName":"Red Shirt","CreatedById":147465,"CreatedDateTime":"2015-07-20T16:06:23Z","Content":"Today I sent my Mun Lander to Minmus. Since it takes almost nothing to reorbit and return, I still had plenty of fuel to play at Kerbin. Circularized at 100 x 80 (a little sloppy, more like oblongulized!) I could have used aero capture but I\u0027m impatient. Turned MJ on and let it land at KSP. Except it didn\u0027t. 15k SW of KSP. Still better than I did on my own, even if it was confused and trying to go the wrong way. Point is, with a heatshield a MJ type return will get you close from orbit - without the heatshield it fries the crew every time for me. Now that I have seen a close to KSP landing, I have something to work at on my own. There really should be a homing beacon to mark KSP location from map view. Until then I will need MJ to find it."},{"CreatedByName":"EBAO","CreatedById":140732,"CreatedDateTime":"2015-07-20T16:06:47Z","Content":"Trajectories mod works well except for very shallow reentry. Does not model aero drag 100%, but I usually over shoot KSC, then use air brakes to adjust on reentry. I can hit the KSC plain almost 100% of the time."},{"CreatedByName":"Red Shirt","CreatedById":147465,"CreatedDateTime":"2015-07-20T16:10:45Z","Content":"\u003E \n\u003E Trajectories mod works well except for very shallow reentry. Does not model aero drag 100%, but I usually over shoot KSC, then use air brakes to adjust on reentry. I can hit the KSC plain almost 100% of the time.\n\nI need to add another chute anyway, so I\u0027ll slap some air brakes on it as well and see how it goes. thnx\n\nI play sandbox so I really don\u0027t care about recovery fees. I just like the idea of returning to base and setting down on solid ground."},{"CreatedByName":"Kryxal","CreatedById":102688,"CreatedDateTime":"2015-07-20T22:52:39Z","Content":"I use MJ\u0027s landing guidance to show the trajectory, then adjust things on the fly using braking thrust (because MJ seems to overestimate aerobraking constantly unless you lose alignment). It usually works pretty well."}]}