{"TopicId":116496,"ForumId":39,"TopicTitle":"My KSP Gizmo (Arduino, Serial_IO)","CreatedByName":"-ctn-","CreatedById":130898,"CreatedDateTime":"2015-07-21T16:00:16Z","PageNum":1,"Articles":[{"CreatedByName":"-ctn-","CreatedById":130898,"CreatedDateTime":"2015-07-21T16:00:16Z","Content":"Hey everyone! I\u0027ve seen tons of awesome hardware projects floating around here, and since I have a couple of Arduino Uno boards and some components sitting around (from the [A.A.T.L.A.S. Short Film](https://forum.kerbalspaceprogram.com/threads/110270-A-A-T-L-A-S-Short-Film), which is in hiatus...) I thought I would try my hand at doing some type of hardware gizmo for KSP.\n\nI\u0027m very much a newbie at all of this - Arduino programming, wiring ect - however, I have in the past built an electric guitar, several effects pedals and even refurbished a big ol\u0027 tube amplifier - so electronics aren\u0027t TOO unfamiliar to me; however this *is* my first Arduino project.\n\nSo the original idea was to make a tiny display box - that is, **without any inputs or switches**. It is meant to display information that is helpful at a glance - and as such, I\u0027ve tried to incorporate things that would have helped me *not* fail previous missions... \n\nHere is the preliminary design:\n\n![ksp%20companion.jpg](http://img.photobucket.com/albums/v68/MoviesColin/ksp%20companion.jpg)\n\nSo on the left side is the classic annunciator panel, or warning lights. To the bottom right are LED bar-graphs that will display current fuel levels and electric charge, and above them is a 7-segment LED digit display that will show altitude to surface (Radar altimeter).\n\nWhile none of those components are set in stone (particularly the digit display... might change that), that is the basic outline for my little gizmo - small, simple, informative, and neat to look at. Some of the control boards I\u0027ve seen on here are mighty impressive, but may be way beyond my skill level (so far.)\n\nAnyway, with the help of **zitronen**\u0027s [Serial IO code for Arduino,](https://forum.kerbalspaceprogram.com/threads/66393-Hardware-Plugin-Arduino-based-physical-display-serial-port-io-tutorial-%2806-Jun%29) I was able to get the main control LEDs working pretty quickly.\n\nWith the help of **Sputnix,** the alarm system was figured out - when a craft is low on any type of fuel or electrical charge, the ALARM light will turn on. When you refuel (or lose the stage that\u0027s low on fuel... such as spent boosters) the light will turn off, unless you are still low on fuel. This combined with the LED graphs will make for a quick way to find out what\u0027s wrong. Big red LED turns on? Check your levels!\n\nLater tonight or tomorrow I will probably order the components for the bar graphs and see if I can get those working.\n\nHere\u0027s a video of it\u0027s functionality so far - (warning, it\u0027s a cell phone video!)\n\n[https://youtube.com/on4kvQHF-O4](https://youtube.com/on4kvQHF-O4)\n\nThanks for looking! When I\u0027m all done I plan to upload the code for anybody who wants to try it or dissect the coding.\n\nAlso, thanks to zitronen and Sputnix, without their help I would probably not even have it working yet (or even attempted it.)\n\nAnd of course, comments/suggestions/criticism is welcome."},{"CreatedByName":"stibbons","CreatedById":57865,"CreatedDateTime":"2015-07-22T01:20:36Z","Content":"Hey, nice work! That first LED turning on is as much a thrill as the first orbit. ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)"},{"CreatedByName":"-ctn-","CreatedById":130898,"CreatedDateTime":"2015-07-22T04:27:49Z","Content":"Absolutely! It was so exciting! I can\u0027t wait to get an enclosure set up for it."},{"CreatedByName":"richfiles","CreatedById":129946,"CreatedDateTime":"2015-07-23T04:57:16Z","Content":"All I can recommend, is use the Thread Display Options at the bottom of the page and search by the [Hardware] prefix. See what others are doing, get ideas, and all around build up a list of all the different features you want to add. Add each one in as you go, and figure out what kind of enclosure you want. This is a GREAT project! I know you\u0027ll love it when it\u0027s done! ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\nAs for being a readout display, if you have the funds for some more LED readouts... Consider Ap, Pe, Time to Ap/Pe/SoI/Landing (you can always use one display for this one, as only one can be \u0022next\u0022 at a time. The arduino can toggle mode based on the which item has the shortest \u0022time to event\u0022 data, and indicate which mode you\u0027re in with an LED readout, or a text abbreviation on the display (Ap, Pe, SI, Ld).\n\nOther useful data can include Velocity, Altitude (sea), and Inclination. If you did all the suggested displays, you\u0027d be looking at 7 LED display readouts.\n\nAnother cool option is to buy some transparency film compatible with your printer. Print out labels (Ap, Pe, Radar Alt, etc) You can get VERY CHEAPLY at many dollar stores or office supply stores, VERY cheap colored plastic folder and binder inserts. If you get some red green and yellow ones, you can print your text labels, cut them out into little squares, and then cut the color panels for them too. Behind your panel, you can use them as indicators, and light them from behind using LEDs. I have found that to be one of the most ridiculously cheap ways to to the annunciator lamps. That can cover not only your Master Alarm, RCS, SAS, etc... but it can also serve as permanent labels or even mode labels for your LED display readouts. Or, if you want to spend the money, you can add an extra LED digits and hard wire them to light up Ap, Pe, etc.\n\nif you want displays that can change modes, you can control them one of two ways. You can drive them just like the regular displays, or you can drive them like single indicator LEDs, by connecting diodes to the individual segments you want lit, and having a different set of diodes per each indication mode. This is probably cheaper than an LED driver chip of you only have 2-4 modes to display.\n\nJust a few ideas for potential upgrades, if you find them useful! Always keep your options open!"},{"CreatedByName":"stibbons","CreatedById":57865,"CreatedDateTime":"2015-07-23T06:28:43Z","Content":"For my annunciator panel I\u0027m planning on printing the labels on plain white paper, and laying that over the top of a grid of LEDs with a sheet of clear transparency film on top."}]}