{"TopicId":116465,"ForumId":18,"TopicTitle":"What do you think of this comic?","CreatedByName":"CelticCossack51","CreatedById":127600,"CreatedDateTime":"2015-07-21T05:09:55Z","PageNum":1,"Articles":[{"CreatedByName":"CelticCossack51","CreatedById":127600,"CreatedDateTime":"2015-07-21T05:09:55Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:72px;\u0022\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003ERead the red text below\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:36px;\u0022\u003E\u003Cfont color=\u0022#b22222\u0022\u003E\u003Cspan style=\u0022line-height:76.8px;\u0022\u003ESorry for this mess, \u003C/span\u003E\u003C/font\u003E\u003Cspan style=\u0022color:#B22222;\u0022\u003EI instantly realized what I have done and regretted it.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI was browsing for some good NASA memes and then I found this. Personally it does not anger me.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022c_12172006_520.gif\u0022 src=\u0022http://www.washingtonpost.com/wp-srv/opinion/ssi/images/Toles/c_12172006_520.gif\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003EEdit: Sorry for this. Whenever I\u0027m tired I become a hyper sensitive little emperor.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-08-20T20:03:39Z\u0022 title=\u002208/20/2016 08:03  PM\u0022 data-short=\u00227 yr\u0022\u003EAugust 20, 2016\u003C/time\u003E by CelticCossack51\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2015-07-21T05:23:17Z","Content":"\n\u003Cp\u003EThe guy is a whackjob, so what would you expect?\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2015-07-21T05:38:13Z","Content":"\n\u003Cp\u003EIts in the Washington Post. You expect it to be reasonable, informed, and not pushing a political agenda? You expect too much of journalism.\u003C/p\u003E\n"},{"CreatedByName":"UmbralRaptor","CreatedById":2767,"CreatedDateTime":"2015-07-21T05:50:34Z","Content":"\n\u003Cp\u003EIt\u0027s painfully close to accurate. Substantially less so than 9 years ago, given that the ISS has now generated scientific results (eg: AMS\u0027s dark matter limits), and is acting as infrastructure for commercial cargo/crew systems. That the station\u0027s lifespan has been extended, and Constellation is gone also help.\u003C/p\u003E\n"},{"CreatedByName":"Shpaget","CreatedById":45577,"CreatedDateTime":"2015-07-21T05:59:06Z","Content":"\n\u003Cp\u003ECartoons don\u0027t anger me. Anybody should have the ability to say they mind, no matter how ill informed they are on the subject they speak of. It is the listener that has the responsibility to judge what he sees and hears and reject or accept the claims made.\u003C/p\u003E\u003Cp\u003EI understand that some people don\u0027t appreciate the stuff done on and around ISS. It\u0027s not necessarily their fault they are not informed well about it (although one could argue that they should inform themselves on the matter they publicly talk about). Some are not interested in space or technology in general and as such didn\u0027t have the chance to absorb the knowledge of subtle, yet important changes that humanity in general received as a direct or indirect result of space exploration.\u003C/p\u003E\u003Cp\u003EJust like most of us (I would imagine) know pretty much nothing about the advancements made in the nail polish industry.\u003C/p\u003E\u003Cp\u003EThe combined volume of modern knowledge is so vast that no single human could ever hope to master it in its entirety. We are very limited in our capacity and have to pick and choose the topics we want to learn about. If someone doesn\u0027t pick space exploration and physics it should be perfectly understandable.\u003C/p\u003E\n"},{"CreatedByName":"Flymetothemun","CreatedById":17689,"CreatedDateTime":"2015-07-21T06:21:03Z","Content":"\n\u003Cp\u003EI\u0027m not mad about it. It\u0027s about human nature in a way. We dream about even a small town, village, hamlet even on the Moon or Mars but in a few thousand years, if we don\u0027t destroy ourselves by then or a natural disaster destroys our civilization, It\u0027ll probably be ancient history and we\u0027ll have expanded to the stars. But, the nutty thing is, is that we\u0027ll still want to expand more. We could find the theoretical edge of the universe and we\u0027d still want to break through to get more.\u003C/p\u003E\u003Cp\u003EI also agree with Shpaget. If you don\u0027t like a radio station or book, you don\u0027t get mad at the author or host, you simply don\u0027t read that author or tune that station. And sometimes people that are \u0022on the outside\u0022 of discussions or interests can bring a unique, sometimes controversial element to the discussion within. Just because someone isn\u0027t interested in a topic doesn\u0027t mean that their views towards it are completely false. One could be totally disinterested in, say, politics, but when asked about it they could say that politics brings unnecessary conflict to the world. There is, as observed by Shpaget, too much information in the world for any one person to know it all, and that you must pick and choose what you want to know about. This cartoonist obviously knows more about cartooning, being a cartoonist, and current events, being a newspaper cartoonist. And, in the fast-paced industry of news, there probably isn\u0027t much time in a day to pick a current or near-current event, conceive an idea for a cartoon it, draw it, and send it off to the paper to be approved and publicated.\u003C/p\u003E\u003Cp\u003EPlus, isn\u0027t it a bit silly and a waste of ones\u0027 time and energy getting angry at a cartoon in a newspaper when you could use that time and energy helping people or learning about whatever it is you wish to know more about? Life is too short to worry yourself with a cartoon.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-21T06:23:19Z\u0022 title=\u002207/21/2015 06:23  AM\u0022 data-short=\u00228 yr\u0022\u003EJuly 21, 2015\u003C/time\u003E by Flymetothemun\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"r4pt0r","CreatedById":90471,"CreatedDateTime":"2015-07-21T07:09:59Z","Content":"\n\u003Cp\u003EThere are people who get upset by cartoon drawings. They happen to be the enemy.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-07-21T07:13:53Z","Content":"\n\u003Cp\u003ESatirical cartooning is an art. Part of that art is to get the point across without a whole paragraph of text.\u003C/p\u003E\u003Cp\u003EThat he failed to do that makes me more mad than his \u0022message.\u0022\u003C/p\u003E\u003Cp\u003EThough if I\u0027m reading it correctly, that cartoon was drawn 9 years ago. Which makes me far happier than anything else made me mad.\u003C/p\u003E\n"},{"CreatedByName":"heng","CreatedById":126869,"CreatedDateTime":"2015-07-21T13:17:03Z","Content":"\n\u003Cp\u003Eevery idiot has its own cartoonist outlets. every viewpoint its mockers... who the idiots are gets decided by history, and even that may be only temporary.\u003C/p\u003E\u003Cp\u003Ewe mock them, they mock us.\u003C/p\u003E\u003Cp\u003Ethat\u0027s the way it should be.\u003C/p\u003E\u003Cp\u003EI couldn\u0027t disagree more with the cartoons message, but i appreciate its existence.\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-07-21T13:18:57Z","Content":"\n\u003Cp\u003EI don\u0027t let stuff like that bother me, uninformed biased opinions are as valuable as the proof behind them.\u003C/p\u003E\n"},{"CreatedByName":"WinkAllKerb\u0026#039;\u0026#039;","CreatedById":78047,"CreatedDateTime":"2015-07-21T13:20:24Z","Content":"\n\u003Cp\u003E; ) ; ) ; )\u003C/p\u003E\n"},{"CreatedByName":"RAINCRAFTER","CreatedById":127524,"CreatedDateTime":"2015-07-21T13:27:07Z","Content":"\n\u003Cp\u003EI voted \u003Cem\u003E\u0022Meh.\u0022 \u003C/em\u003EThis is because we are constantly expanding, although I don\u0027t think it\u0027s fair to have the budget of a twinkie (NASA) and be a division of something that has a lot of money and pretends they don\u0027t. (The American Government. I\u0027m not trying to sound offensive, but Hitler had a brain. An evil one indeed, but a brain.)\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2015-07-21T13:32:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022UmbralRaptor\u0022 data-cite=\u0022UmbralRaptor\u0022\u003E\u003Cdiv\u003EIt\u0027s painfully close to accurate. Substantially less so than 9 years ago, given that the ISS has now generated scientific results (eg: AMS\u0027s dark matter limits), and is acting as infrastructure for commercial cargo/crew systems. That the station\u0027s lifespan has been extended, and Constellation is gone also help.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhile I agree that ISS is a waste of time for real science for the most part, and agree ASM is \u0022it\u0022 for actual science done there, it\u0027s important to realize that the artist likely thinks all such money should have been spent on direct payments to deadbeats given his politics. I doubt his concern is that the money would have been better spent on robotic space probes \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E that\u0027s why I voted meh.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-07-21T14:26:37Z","Content":"\n\u003Cp\u003EOoooh, \u003Cem\u003EZing!\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EWide of the mark though IMHO. There\u0027s science that can only be done on a crewed space station, though the ISS we got might not have been the most cost-effective way to build such a station.\u003C/p\u003E\n"},{"CreatedByName":"LordFerret","CreatedById":111598,"CreatedDateTime":"2015-07-21T14:39:39Z","Content":"\n\u003Cp\u003EIt\u0027s the Washington Post, what more needs to be said? Any further comment would be totally political (although anything and everything having to do with a \u0027space program\u0027 is political, including the science behind it), and politics here ruffles too many feathers ... can\u0027t have that.\u003C/p\u003E\n"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2015-07-21T14:54:06Z","Content":"\n\u003Cp\u003EI find this comic to be one of the many that only displays half the truth. Yes, the station is now complete, and yes, it will now be abandoned (in another five years. Or was it fifteen?) but the facility was never \u0022useless\u0022. Bountiful scientific knowledge was gained on the ISS, not to mention that it was a way for many countries to collaborate on a peaceful task for the betterment of our species.\u003C/p\u003E\n"},{"CreatedByName":"HoloYolo","CreatedById":138353,"CreatedDateTime":"2015-07-21T15:06:01Z","Content":"\n\u003Cp\u003ESorry, I don\u0027t get mad at pictures.\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2015-07-21T15:34:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Starwhip\u0022 data-cite=\u0022Starwhip\u0022\u003E\u003Cdiv\u003EI find this comic to be one of the many that only displays half the truth. Yes, the station is now complete, and yes, it will now be abandoned (in another five years. Or was it fifteen?) but the facility was never \u0022useless\u0022. Bountiful scientific knowledge was gained on the ISS, not to mention that it was a way for many countries to collaborate on a peaceful task for the betterment of our species.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe science done is actually pretty marginal. The only real value is human physiology in a microgravity environment, which we already knew was troublesome for long-duration flights (not that it is bad to characterize it). The principle function of ISS was never to do science, it was to occupy people who might otherwise end up employed making ballistic missiles for people we don\u0027t like after the fall of the CCCP.\u003C/p\u003E\n"},{"CreatedByName":"pxi","CreatedById":78711,"CreatedDateTime":"2015-07-21T15:58:16Z","Content":"\n\u003Cp\u003EIt doesn\u0027t annoy me, but it doesn\u0027t surprise me either.\u003C/p\u003E\n"},{"CreatedByName":"Layereddiagram","CreatedById":148146,"CreatedDateTime":"2015-07-21T18:30:24Z","Content":"\n\u003Cp\u003EThis doesn\u0027t anger me. What does is that people give NASA a minuscule budget, yet complain when they get nothing done.\u003C/p\u003E\u003Cp\u003E...And also that that looks nothing like the ISS.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 alt=\u0022:rolleyes:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SemiaCloud","CreatedById":138816,"CreatedDateTime":"2015-07-21T19:34:31Z","Content":"\n\u003Cp\u003EThis is horrible! I hate how the masses are so apathetic about spaceflight. Otherwise the think it is a waste! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"LABHOUSE","CreatedById":107761,"CreatedDateTime":"2015-07-21T20:49:36Z","Content":"\n\u003Cp\u003EAn equally useless moon base? That\u0027s great! A very useful base on the moon!\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Layereddiagram\u0022 data-cite=\u0022Layereddiagram\u0022\u003E\u003Cdiv\u003EThis doesn\u0027t anger me. What does is that people give NASA a minuscule budget, yet complain when they get nothing done.\u003Cp\u003E...And also that that looks nothing like the ISS.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 alt=\u0022:rolleyes:\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah... and people say NASA gets 80% of the budget and wastes it all, and not enough is spent on wars \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_sleep.png\u0022 alt=\u0022-_-\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Beowolf","CreatedById":48927,"CreatedDateTime":"2015-07-21T21:58:14Z","Content":"\n\u003Cp\u003EI don\u0027t mind. My beloved America\u0027s an empire in decline, and short-sighted anti-intellectualism comes as a free bonus\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Layereddiagram\u0022 data-cite=\u0022Layereddiagram\u0022\u003E\u003Cdiv\u003E...And also that that looks nothing like the ISS.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 alt=\u0022:rolleyes:\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESeems like a pretty trivial complaint at first...but just imagine the uproar if the cartoonist had screwed up one pixel of an Apple logo.\u003C/p\u003E\n"},{"CreatedByName":"Robotengineer","CreatedById":104525,"CreatedDateTime":"2015-07-21T22:10:27Z","Content":"\n\u003Cp\u003EMeh. It\u0027s from 2006. There will always be luddites opposed to progress I suppose.\u003C/p\u003E\n"},{"CreatedByName":"LordFerret","CreatedById":111598,"CreatedDateTime":"2015-07-21T23:32:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Robotengineer\u0022 data-cite=\u0022Robotengineer\u0022\u003E\u003Cdiv\u003EMeh. It\u0027s from 2006. There will always be luddites opposed to progress I suppose.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECareful, you\u0027ll have union reps crawling all over you before you know it.\u003C/p\u003E\n"}]}