{"TopicId":116554,"ForumId":16,"TopicTitle":"Getting a circular orbit on Kerbin","CreatedByName":"h1978n","CreatedById":148444,"CreatedDateTime":"2015-07-22T10:50:15Z","PageNum":1,"Articles":[{"CreatedByName":"h1978n","CreatedById":148444,"CreatedDateTime":"2015-07-22T10:50:15Z","Content":"Hi\n\nI have been playing this for some months now and been traveling around the solar system a bit. But I have one problem that pops up every now and again. \n\nWhen I leave Kerbin for orbit I usually go straight up until about 20 000 m , turn the rocket east and dip the nose to about 45 degrees and go until my apoapsisis about 70 000 m, then I turn the engine of and wait for apoapsisthen I dip the nose until 90 degrees and burn until orbit.\n\nThis works well most times I think with a reasonably elliptical orbit, but sometimes, when I feel the ride until 70 000 m has gone ok, the orbit is very un-circular. Could someone give my some insight into what I\u0027m likely doing wrong?\n\nAny help is appreciated\n\n//Henrik \n\n**Edited \u003Ctime datetime=\u00222015-07-22T17:36:35Z\u0022 title=\u002207/22/2015 05:36  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 22, 2015\u003C/time\u003E by h1978n**"},{"CreatedByName":"Jens Lyn IV","CreatedById":107963,"CreatedDateTime":"2015-07-22T11:43:53Z","Content":"The ascent you described is very inefficient for any kind of intended trajectory, even Kerbin escape.\n\nIf you want a low, circular Kerbin orbit, start turning as soon as you leave the launch pad. 5-15 degrees off vertical is a good start. Ideally, you will continue turning throughout the ascent, but stepwise turns might be easier until you get the hang of it. I suggest 15 degrees after launch, 30 degrees at 5 km, 45 degrees at 10 km, and 60 degrees at 15 or 20 km. Once your speed is above 1000 m/s, switch to the map view and keep an eye on your apoapsis. Once it reaches 75-100 km, shut down the engine and coast the rest of the way up. Then burn prograde until you periapsis is above 70 km. If timed correctly, you can get a near-perfect circular orbit at this point, if not, you can raise your periapsis after orbiting once.\n\nYour rocket may not have the aerodynamic stability required for this trajectory; if it flips on the way up, add fins to the bottom. If things get too hot, add a little more altitude before each turn (or throttle down if your rocket is overpowered).\n\nLet me know if this advice was actually any good. ![:sticktongue:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif)"},{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-07-22T11:58:54Z","Content":"The farther you burn from the apoapsis the more you\u0027re pushing the apoapsis away, and the tolerance for precise results is really like 10s (and with low-thrust engines you won\u0027t fit under 10s with circularizing...)\n\nThe best you can do for pretty circular orbits (not that they are really needed, all they do is make transfer burns easier to plan) is to get Kerbal Engineer Report, and during your approach to apoapsis observe \u0022Time to Apoapsis\u0022 entry on the HUD it provides. Start some 30s before and as you start the burn, keep the engine power such that the time keeps dropping, albeit slowly - at such a speed that you\u0027ll be finishing the burn when the counter reaches zero. (you can push it back by burning full throttle or speed it up by decreasing the throttle; also the closer to apoapsis the stronger the burn needs to be to keep the timer stopped.)\n\nAlternatively, there are always partially radial/antiradial burns. Just plan a maneuver with such radial and prograde components (somewhere roughly halfway between periapsis and apoapsis) so that they are equal as result.\n\nedit: as for optimal ascent... don\u0027t worry about that too much. Yes, it\u0027s inefficient but it\u0027s fairly \\*easy\\*. Gravity Turn ascent profile is optimal and in the right rocket it requires a little nudge to get you right into a pretty circular orbit. The problem is the rockets you launch will hardly ever be \u0022right\u0022 and in that case the ascent requires excessive amounts of tweaking and maintenance so that your rocket won\u0027t flip over.\n\n**Edited \u003Ctime datetime=\u00222015-07-22T12:01:54Z\u0022 title=\u002207/22/2015 12:01  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 22, 2015\u003C/time\u003E by Sharpy**"},{"CreatedByName":"Kurld","CreatedById":79950,"CreatedDateTime":"2015-07-22T12:01:38Z","Content":"Like Jens said, it will be very hard to get a circular orbit this way. The thing at play here is that your new delta-v is not instantaneous. You will have to burn for some amount of time near your ap in order to arrive at orbital velocity. The lower you can get this time number, the easier it will be for you to circularize. You can do this by either having ridiculous TWR or by arriving at the ap already at close to the desired velocity. The way you do that is by an efficient ascent as Jens described.\n\nOne thing that will help in any case is to start the circularization burn before you get to the ap. For instance if your burn is to be for 12 seconds, you might start your burn at T-6 seconds. This will help \u0022average out\u0022 the thrust so that the entire burn is close to the ap."},{"CreatedByName":"Kryxal","CreatedById":102688,"CreatedDateTime":"2015-07-22T12:47:27Z","Content":"I try to turn the rocket about 5 degrees at about 50 m/s, then just ride the prograde vector to orbit, but this depends on your TWR (and having mass at the front, drag at the back). If the rocket\u0027s turning too much too soon, I\u0027ll try and hold my vector for a bit, but getting too far off prograde is dangerous."},{"CreatedByName":"tomf","CreatedById":57809,"CreatedDateTime":"2015-07-22T14:48:27Z","Content":"I do a moderately efficient gravity turn then use KER to tell me when my AP gets to about 73km and is about a minute and a half away. I then go to map view and create a maneouvre node at my AP and tweak it to get an orbit withing about 1 km of circular. Normally I still have 45 seconds or so to get me lined up with the node marker before KER tells me that it is time so start teh burn.\n\nIf I wanted an orbit that was more circular than that I would create further nodes at AP or PE and tweak them until it\u0027s perfect."},{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-07-22T15:06:42Z","Content":"By the way, the only reasons to get a perfectly circular orbit are:\n\n- your own OCD about having something in a perfectly circular orbit\n\n- a contract\n\n- a transfer window calculator gave you measurements for a specific orbit\n\n- you want to go to Mun or Minmus and are too lazy to tweak the node more than absolutely necessary.\n\nExtra reasons to have a \\*mostly\\* circular orbit:\n\n- your craft is to be a target of an encounter. Calculating encounters with very elongated ellipses sucks.\n\n- you have some sensors that work at a specific altitude range.\n\nOh, and the most common reason:\n\n- it\u0027s one mouse click in MechJeb."},{"CreatedByName":"X-SR71","CreatedById":108775,"CreatedDateTime":"2015-07-22T17:18:12Z","Content":"\u003E \n\u003E By the way, the only reasons to get a perfectly circular orbit are:\n\u003E - your own OCD about having something in a perfectly circular orbit\n\u003E \n\u003E - a contract\n\u003E \n\u003E - a transfer window calculator gave you measurements for a specific orbit\n\u003E \n\u003E - you want to go to Mun or Minmus and are too lazy to tweak the node more than absolutely necessary.\n\u003E \n\u003E Extra reasons to have a \\*mostly\\* circular orbit:\n\u003E \n\u003E - your craft is to be a target of an encounter. Calculating encounters with very elongated ellipses sucks.\n\u003E \n\u003E - you have some sensors that work at a specific altitude range.\n\u003E \n\u003E Oh, and the most common reason:\n\u003E \n\u003E - it\u0027s one mouse click in MechJeb.\n\nWell, I do have OCD about having perfect circular and 0 inclination orbits.. no matter if its less efficient that way!"},{"CreatedByName":"h1978n","CreatedById":148444,"CreatedDateTime":"2015-07-22T17:37:51Z","Content":"Hi\n\nThanks for all the great answers. I see I still have lots to learn, but that\u0027s why I love this game. I have been trying some of suggestions and find I\u0027m in much better control of my orbits. \n\n//Henrik"}]}