{"TopicId":116679,"ForumId":21,"TopicTitle":"Low-ish tech SSTO, great for contracts. (probably the best craft I\u0026#039;ve made)","CreatedByName":"nestor_d","CreatedById":138673,"CreatedDateTime":"2015-07-23T18:41:13Z","PageNum":1,"Articles":[{"CreatedByName":"nestor_d","CreatedById":138673,"CreatedDateTime":"2015-07-23T18:41:13Z","Content":"\n\u003Cp\u003EHiya all! Here\u0027s a little craft that might prove very useful for your early career needs. I originally built it to test my career space program SSTO capabilities and maybe put satellites into Kerbin orbit and rescue kerbals for contracts. It was designed to use the lowest tech available, so the highest tech needed is high altitude flight (which is practically a must for SSTOs) but it goes to orbit with Swivels, so no high tech rocketry is required. It also uses the lowest tech solar panels and batteries and the attitude controls are fully driven by reaction wheels, so you don\u0027t need to pack extra weight for RCS fuel. It packs enough dV for orbital rendezvous even when loaded with payload if flown correctly, and the 3 ton satellites that fit inside con go into practically any orbit around the Mun and Minmus. It has since, however, proven to be my most useful craft. After retrofitting it with hypersonic tech (Aerospikes and shock cones), it\u0027s able to do Mun fly-bys and even putting satellites into Duna or Ike by putting the satellite into a Mun oberth-assist trajectory (haven\u0027t tried Eve or Gilly yet). Easy to fly and land (Even Bill and Bob managed to do it!)\u003C/p\u003E\u003Cp\u003ETL;DR get this craft to complete most contracts up to Duna/Ike exploration.\u003C/p\u003E\u003Cp\u003EDownload: \u003Ca href=\u0022http://kerbalx.com/nestor_d/OSP-Mk11-Swallow--Early-mid-career-cargo-SSTO\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalx.com/nestor_d/OSP-Mk11-Swallow--Early-mid-career-cargo-SSTO\u003C/a\u003E (Requires OPT Spaceplane parts for the cockpit, but a stock version is also available)\u003C/p\u003E\u003Cp\u003EHere are some pics \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/BQvqrdy.jpg\u0022 alt=\u0022BQvqrdy.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWehrner makes some final inspections\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Rb22MwJ.png\u0022 alt=\u0022Rb22MwJ.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ELanding after a successful mission\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/hYPqJgC.png\u0022 alt=\u0022hYPqJgC.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EOrbital rendezvous for docking contract\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/tuSDuUj.png\u0022 alt=\u0022tuSDuUj.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ETake-off\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/xvsypiQ.png\u0022 alt=\u0022xvsypiQ.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ERetrofitted version landing on the new-improved runway.\u003C/p\u003E\n"},{"CreatedByName":"Wolf Baginski","CreatedById":138549,"CreatedDateTime":"2015-07-24T07:28:12Z","Content":"\n\u003Cp\u003EI have your other OSP class craft. That looped tail structure is distinctive. I\u0027m still trying to get the flight profile right, and I\u0027d appreciate a good summary here.\u003C/p\u003E\u003Cp\u003EAs near as I can figure, there\u0027s a very-specific fuel-efficient climb with the jets needed to get the airspeed/altitude needed for the switch to rockets. I keep finishing with surplus oxidiser.\u003C/p\u003E\n"},{"CreatedByName":"FungusForge","CreatedById":148313,"CreatedDateTime":"2015-07-24T07:38:14Z","Content":"\n\u003Cp\u003EThat is a beautiful aircraft. Rep for making it work \u003Cem\u003Eand\u003C/em\u003E making it pretty.\u003C/p\u003E\n"},{"CreatedByName":"nestor_d","CreatedById":138673,"CreatedDateTime":"2015-07-24T15:45:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Wolf Baginski\u0022 data-cite=\u0022Wolf Baginski\u0022\u003E\u003Cdiv\u003EI have your other OSP class craft. That looped tail structure is distinctive. I\u0027m still trying to get the flight profile right, and I\u0027d appreciate a good summary here.\u003Cp\u003EAs near as I can figure, there\u0027s a very-specific fuel-efficient climb with the jets needed to get the airspeed/altitude needed for the switch to rockets. I keep finishing with surplus oxidiser.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI use this flight profile: Climb to 8000m going at around 30Ã‚Â°, then at 8000m I start slowly pitching down to around 10Ã‚Â°, the idea is to reach 1000m/s and 18000m of altitude at around the same time. Then you switch the rockets on and climb again at 30Ã‚Â°, but again piching down slowly, the idea is that when your Apoapsis is at around 60km you are flying level, and then just wait for it to reach about 72 km and turn of your rocket engines. Then you just do the final circularisation burn at apoapsis.\u003C/p\u003E\u003Cp\u003EWell that\u0027s the flight profile, I actually never got the oxidizer exacty right, but the other thing you can do, which I do sometimes is edit the .craft file in notepad to change the amount of fuel and oxidizer you have. So For example instead of having 360 LF 440 Ox on the large Mk2 fuselage you can change it to something like 500 LF 300 Ox, I do that with most of my SSTOs when replacing whole tanks doesn\u0027t quite cut it.\u003C/p\u003E\n"}]}