{"TopicId":116696,"ForumId":18,"TopicTitle":"Any model rocket builders?","CreatedByName":"Hagen von Tronje","CreatedById":148278,"CreatedDateTime":"2015-07-24T01:06:55Z","PageNum":1,"Articles":[{"CreatedByName":"Hagen von Tronje","CreatedById":148278,"CreatedDateTime":"2015-07-24T01:06:55Z","Content":"\n\u003Cp\u003EWasn\u0027t sure if this would go under science or lounge. It\u0027s not all that science-y so I chose here.\u003C/p\u003E\u003Cp\u003EAnyone else build model rockets, currently or in the past?\u003C/p\u003E\u003Cp\u003EI haven\u0027t in years, but as a kid my brother and I would build Estes rockets and launch them. I even still remember the names of several we built - the Alpha II (I think it was II) starter rocket, a Mosquito (no parachute, tiny rocket), Bullpup, and I actually built but never had the guts to launch a Trident II, which looked amazing but I could never bring myself to tempt breaking it in half or losing it to a bad wind. I also built but never launched one whose name I forget, but used something like 5-6 huge engines and supposedly required FCC permission to launch with all engines - mostly I didn\u0027t launch it because I couldn\u0027t find the heavy-duty launchpad required, and this was pre-internet. Also notable was one with a clear payload tube, which opened up an awful lot of possibilities that we never fully took advantage of, but was nevertheless a stone-age version of what drone enthusiasts seem to go for nowadays.\u003C/p\u003E\u003Cp\u003ESadly like a lot of kids\u0027 hobbies this one ended when I came home from school one day to find all my rockets gone, my mom saying I don\u0027t really need toys like that anymore.\u003C/p\u003E\u003Cp\u003EBesides teaching me a lot about the importance of symmetry and aerodynamics (and the basics of staging!), this was also my first introduction to trig - you could buy an altitude finder that used a pendulum gauge and crosshairs at a fixed distance to measure apogee (assuming you measured distance right and the rocket didn\u0027t deviate heading too much, of course...it was more of a ballpark estimate).\u003C/p\u003E\u003Cp\u003EMaybe more importantly, it really sealed my love of crafting things. Launching was great, but just as enjoyable to me was sanding each balsa fin to be smooth and even, lining my attachments up perfectly, all that. The launch was still important though - without practical application, it\u0027s just a pretty wall hanger, and even then I liked something with application.\u003C/p\u003E\u003Cp\u003ESo, anyone else have fond memories or still build these?\u003C/p\u003E\n"},{"CreatedByName":"Elthy","CreatedById":63317,"CreatedDateTime":"2015-07-24T03:46:16Z","Content":"\n\u003Cp\u003EFunny how your mither considered them toys for children, in germany even the smallest rockets are only allowed for adults...\u003C/p\u003E\n"},{"CreatedByName":"JetJaguar","CreatedById":146965,"CreatedDateTime":"2015-07-24T04:03:06Z","Content":"\n\u003Cp\u003EI built model rockets back in middle and high school, too. Fortunately, about half of my collection has survived and they are currently all hanging from the ceiling of my son\u0027s bedroom:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://flic.kr/p/w8ejdV\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022https://farm4.staticflickr.com/3683/19772516269_c7aa42877b_c.jpg\u0022 alt=\u002219772516269_c7aa42877b_c.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EMy first rocket is there, an Alpha III (the red and white one at the back, peaking out from behind the ceiling fan blade). It was launched 8 times. I know this because I made small tally marks on the body tube near the nosecone. My Mosquito is there, it\u0027s the little orange one. That\u0027s the second Mosquito I made because I lost the first one on it\u0027s first flight. Oh yeah, I always launched all of my rockets at least once. Even the elaborate ones meant for display, like the X-Wing fighter back there. My friends all thought I was crazy, they had their launching rockets and the rockets just for looks.\u003C/p\u003E\u003Cp\u003EThe big black one is the Mean Machine - 6 feet long. I understand it\u0027s since been redesigned to come apart in two section for storage, but this is the original one-piece model. That was fun to launch. Almost impossible to lose because it was so big it was easy to see, and too heavy to go very high to begin with.\u003C/p\u003E\u003Cp\u003EOf the rockets I no longer have, the one I miss was a replica of the Space Shuttle. The motor was mounted inside the ET, and at the top of the flight the orbiter came off glided down separately. It was accidentally crushed in the bottom of a box during a move. I also had an Estes Saturn V kit that I started but never got around to finishing. I\u0027m not sure whatever happened to that.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-24T04:12:06Z\u0022 title=\u002207/24/2015 04:12  AM\u0022 data-short=\u00228 yr\u0022\u003EJuly 24, 2015\u003C/time\u003E by JetJaguar\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Rath","CreatedById":138223,"CreatedDateTime":"2015-07-24T04:43:56Z","Content":"\n\u003Cp\u003EI would but Hong Kong is psyco about it. A club at my school is trying to get legal permission though.\u003C/p\u003E\n"},{"CreatedByName":"Hobbes Novakoff","CreatedById":129018,"CreatedDateTime":"2015-07-24T16:06:27Z","Content":"\n\u003Cp\u003EI just started getting back into rockets. (not the KSP kind, I\u0027ve been into that for over a year). Luckily my city doesn\u0027t prohibit it (Or if they do, they don\u0027t enforce it; I\u0027ve never been told to stop launching rockets with the exception of two counselors from a day camp over the hill from where I was launching, who probably didn\u0027t have the authority to kick me out of the park anyway). Really, I got back into them when the supermarket 3 blocks down the road started stocking rockets that you can assemble in seconds-slide in the fins, tie the shock cord, pack the parachute, done. Portland is a pretty green city, and there are plenty of places to launch B-class engines, even two-stage rockets, within the city.\u003C/p\u003E\n"},{"CreatedByName":"ZentroCatson","CreatedById":143939,"CreatedDateTime":"2015-07-24T16:09:51Z","Content":"\n\u003Cp\u003EToys?\u003Cem\u003E Toys? TOYS? \u003C/em\u003EWhat do mothers don\u0027t count as \u0022toys\u0022? You surely put a lot of hard work into these, Hagen, seeing them thrown away and lost must be as sad as loosing a 3 months old career save in KSP due to a glitch \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E. I don\u0027t know if launching model rockets is allowed in switzerland, but I\u0027ll definitely try my hand at a bottle rocket powered with a h2o/o2 overpressure chamber. (A.K.A water bottle being pumped up with a bicycle pump)\u003C/p\u003E\n"},{"CreatedByName":"Budgie","CreatedById":13840,"CreatedDateTime":"2015-07-24T16:19:26Z","Content":"\n\u003Cp\u003EThere\u0027s already a semi-established, semi-regularly updated thread on Science about model and High Power rocketry \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E. See my signature for a rendering of my most recent rocket, at 6 ft\u003C/p\u003E\n"},{"CreatedByName":"DennyTX","CreatedById":92389,"CreatedDateTime":"2015-09-02T05:43:10Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/OpcRrq8h.jpg\u0022 alt=\u0022OpcRrq8h.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003Ebuild by one man (age about 60) from Tallinn, ES\u003C/p\u003E\n"}]}