{"TopicId":11674,"ForumId":21,"TopicTitle":"Megastar Heavy-lifter Series","CreatedByName":"KleptoKat","CreatedById":16515,"CreatedDateTime":"2012-05-30T05:21:04Z","PageNum":1,"Articles":[{"CreatedByName":"KleptoKat","CreatedById":16515,"CreatedDateTime":"2012-05-30T05:21:04Z","Content":"\n\u003Cp\u003EThis rocket series is for those who want to take the world with them. If you want to launch a giant space station, we want to help you launch a giant space station. Just simply refit the indicated base with what you want to put up in the sky, and voila, it\\\u0027s in the sky. We strive to maintain the balance between overpowered and not too many parts, for most computers can barely handle KSP as it is, never mind these heavy lifters. Therefore, most of these heavy lifters will require at LEAST 3 gigs of ram and a 1.5 gig graphics card. (That\\\u0027s a little under what I have.) Okay, got it? Go. Let me help you help me help you put your station up with the stars. duuuh duh duuh, duh duh duh duh duh, duh duh duh duh. (Star Trek)\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan\u003EMEGASTAR I\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EDownload: \u003Ca href=\u0022https://dl.dropbox.com/u/33825217/Megastar%20I.craft\u0022 rel=\u0022external nofollow\u0022\u003EDropbox\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003EHave you ever wanted to take your rocket up, but with the rest of Kerbin with you? Then this rocket is for you. Suited with 37 initial engines, 75 fuel tanks, advanced fuel system performance, which makes for very simple launching/orbiting. But be careful! This rocket has been reported to \u003Cem\u003Epush Kerbin away from the actual rocket\u003C/em\u003E! That\\\u0027s right, folks. This rocket is so powerful, that a Kerbin year will become 80 minutes longer just by launching it! (It also produces the same amount of heat to burn down Kerbalhatton, but you don\\\u0027t have to know that.)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropbox.com/u/33825217/Hosting/megastarI2.PNG\u0022 alt=\u0022megastarI2.PNG\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropbox.com/u/33825217/Hosting/megastarI1.PNG\u0022 alt=\u0022megastarI1.PNG\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropbox.com/u/33825217/Hosting/megastarI3.PNG\u0022 alt=\u0022megastarI3.PNG\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan\u003EHow to fly - Step by step:\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E[list type=decimal]\u003C/p\u003E\u003Cp\u003E[li]Set SAS on and throttle to full.[/li]\u003C/p\u003E\u003Cp\u003E[li]Launch first stage of rocket[/li]\u003C/p\u003E\u003Cp\u003E[li]Wait until 150m/s - launch next stage[/li]\u003C/p\u003E\u003Cp\u003E[li]To turn into orbit, wait for your Ap to be 50 kilometers before your goal, disengage throttle[/li]\u003C/p\u003E\u003Cp\u003E[li]Launch next stage, set throttle to full[/li]\u003C/p\u003E\u003Cp\u003E[li]Unset SAS, turn ship to 0 pitch and wanted heading. Reset SAS[/li]\u003C/p\u003E\u003Cp\u003E[li]Once periapsis appears, disengage throttle[/li]\u003C/p\u003E\u003Cp\u003E[li]USE COMMON SENSE \u0026gt;.\u0026lt;[/li]\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan\u003EAdding your load:\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EIt\\\u0027s simple. Just un-attach the SRS, and put whatever you want to put under the command module.\u003C/p\u003E\u003Cp\u003EHere you go:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropbox.com/u/33825217/Hosting/megastarIbase.png\u0022 alt=\u0022megastarIbase.png\u0022\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan\u003EMEGASTAR II\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EDownload: Unavailable\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003EHave you ever just looked up, an wondered, \u0027WHY AM I NOT THERE LIKE OMG GET ME THERE NOAWWW FATHER PWEASE\u0027\u003C/p\u003E\u003Cp\u003Eand then you father said \u0027NO I DON\\\u0027T KNOW HAOAOAWO\u0027\u003C/p\u003E\u003Cp\u003Ebut then you saw this advertisement, and thought \u0027FAThER Wil TOTALY BAI ME THAT LIEK WOWWAEEE\u0027\u003C/p\u003E\u003Cp\u003Ebut it\\\u0027s not out yet and so you can\\\u0027t bring your even bigger stations up into the stars and out and away. SOWWY!\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan\u003EStationizer\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EDownload: Unavailable\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003EThis rocket will be the greatest heavy lifter of all time like omg wow. It will bring stations the size of Minmuz to orbit a couple meters away from the sun man.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cem\u003E\u003Cstrong\u003ECHALLENGE ACCEPTED.\u003C/strong\u003E\u003C/em\u003E\u003C/span\u003E 8)\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ETotal rockets: 3\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ETotal available rockets: 1\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ETotal angry people: All of them D :\u0026lt;\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EOkay, thanks for checking out my rockets. If you have any suggestions, please do!\u003C/p\u003E\n"},{"CreatedByName":"KleptoKat","CreatedById":16515,"CreatedDateTime":"2012-06-04T01:07:14Z","Content":"\n\u003Cp\u003EWorking on Stationizer. Better than I expected. Wowwee.\u003C/p\u003E\n"}]}