{"TopicId":116963,"ForumId":32,"TopicTitle":"Fan Theory - Kerbals not Native to Kerbin","CreatedByName":"oliv897","CreatedById":112082,"CreatedDateTime":"2015-07-27T10:50:41Z","PageNum":1,"Articles":[{"CreatedByName":"oliv897","CreatedById":112082,"CreatedDateTime":"2015-07-27T10:50:41Z","Content":"So this has been on my mind for awhile now and the more i play the more it becomes at least to me more credible.\n\nMy theory is that Kerbal\u0027s do **not** come from Kerbin, if we take a look at the Space Agency we can clearly see that it is the only sign of civilization on the entire planet, now I have noticed other things such as we NEVER see any Kerbal outside (does this mean the air is toxic?) the few we do see (ship crew) always wear a space suit even on the surface with no option(yet) to remove it (another tip that the atmosphere is Toxic?) \n\nMy theory states that not only do they not originate from Kerbin but that they and the premise of the game is to research enough on space travel in order to find a way home, now if we think for a moment that these are abandoned/lost colonists that would explain their stupidity and also their lack of understanding but also allow for the closeness they show to me and you.. everyday people.\n\nI think they\u0027re Colonists that have lost contact from their home planet and are now doing all they can to find a way back home and they need our help! \n\nThere is much more evidence to support this as well such as we only know them as Kerbals that would be the correct way to label a person or being from the planet Kerbin, now what if they are cut off? an example we are Human, not Earthlings(we are but officially we\u0027re human) now if we sent colonists to Mars and then cut contact, surely in ooh a few generations they\u0027d simply refer to themselves as Martian? not Human? \n\nThis is what\u0027s been on my mind and I thought I\u0027d post it here to get some more feedback on it and see if any other players have noticed anything that would support this?"},{"CreatedByName":"EladDv","CreatedById":118368,"CreatedDateTime":"2015-07-27T11:24:37Z","Content":"well it sounds good but the fact that you cant detect a different solar system (in stock) dosnt support your theory. while kerbals have not built any cities on kerbin you can recruit unlimited amount of them so there is a population existing on kerbin somewhere. but honestly i dont think the devs have such a complicated origin story for the kerbals but a good theory nonetheless"},{"CreatedByName":"Overland","CreatedById":119812,"CreatedDateTime":"2015-07-27T11:37:38Z","Content":"Shhhhhhhhhhhhh!! ![:(](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif)\n\nyour not ment to know that.. you\u0027ll start things in motion that must not be...certain things are forbidden.. its all well and good flying little bottle rockets off the surface of kerbin.. puttering around the Kerbol system.. \n\nOnce you develop hyperdrive.. you\u0027ll come back to kerbin to see it consumed by a firestorm.. with a significant debris ring in lower kerbin orbin\n\nNO KSC, NO KSC2.. no land-trains...simply..... no one left.. not even beacons\n\n![Screen%20shot%202013-05-22%20at%207.11.17%20PM.png](http://bugs.kerbalspaceprogram.com/attachments/740/Screen%20shot%202013-05-22%20at%207.11.17%20PM.png)\n\n**Edited \u003Ctime datetime=\u00222015-07-27T11:45:18Z\u0022 title=\u002207/27/2015 11:45  AM\u0022 data-short=\u00228 yr\u0022\u003EJuly 27, 2015\u003C/time\u003E by Overland**"},{"CreatedByName":"heng","CreatedById":126869,"CreatedDateTime":"2015-07-27T11:48:34Z","Content":"This would be consistent with the tech tree mechanics...\n\n\u0027New\u0027 technologies and parts being rediscovered from leftovers of the original settlers. \n\n- \u0022Hmm, I wonder what this part actually does... Hey, Jeb! Could you try this button-majingy-thing during flight? I\u0027ll pay you...\u0022\n\nThe original settlements could have been underground. Hence the lack of visible cities."},{"CreatedByName":"LethalShade","CreatedById":139111,"CreatedDateTime":"2015-07-27T12:23:50Z","Content":"Toxic atmosphere, uh ?\n\n![15dbf24584.jpg](http://puu.sh/jeFh2/15dbf24584.jpg)"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-07-27T12:29:10Z","Content":"\u003E \n\u003E My theory is that Kerbal\u0027s do **not** come from Kerbin, if we take a look at the Space Agency we can clearly see that it is the only sign of civilization on the entire planet, now I have noticed other things such as we NEVER see any Kerbal outside (does this mean the air is toxic?) the few we do see (ship crew) always wear a space suit even on the surface with no option(yet) to remove it (another tip that the atmosphere is Toxic?) \n\u003E ......\n\u003E \n\u003E I think they\u0027re Colonists that have lost contact from their home planet and are now doing all they can to find a way back home and they need our help!\n\nI, too, for similar reasons, have conjectured that Kerbals are stranded colonists from elsewhere. And given their obvious lack of knowledge of science, they might have been analogous to the [Golgafrinchian telephone sanitizers](http://hitchhikers.wikia.com/wiki/Golgafrincham) of the *Hitchhiker\u0027s Guide to the Galaxy*, a non-productive segment of the population misled into leaving the home planet and deliberately marooned elsewhere ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif).\n\nHowever, there is a big problem with this theory: the Pyramids. The Pyramids, containing as they do a huge statue of a Kerbal, indicate that Kerbals have been on Kerbin a long time, since at least the dawn of civilization when the invention of the mud brick was big news. This seems a bit too low-tech for stranded extra-Kerbin colonists. Also, the statue doesn\u0027t have a helmet, which indicates that Kerbin\u0027s atmosphere back in those days wasn\u0027t harmful to Kerbals. I have, therefore, had to come up with another theory. In fact, I have 2 competing theories:\n\n1. Kerbals Are Artificial\n\nThere are monoliths all over Kerbin, especially at KSC, and also on Mun. These demand an explanation. And Kerbals die, they disappear in a puff of what looks exactly like Mundust. So it could be that the monoliths create Kerbals from materials gathered on Mun and spawn them at KSC as needed. This is all the experiment or idle diversion of some hyper-intelligent, pan-dimensional beings, who watch their creations evolve and struggle to develope technology for reasons of their own. In this theory, the other monoliths on Kerbin and the Pyramids and other ruins, mark former locations where Kerbals used to spawn in the past. There has never been more than a handful of Kerbals at any one time, hence no other ruins, and new Kerbals are created as needed. Kerbals wear helmets outside just because they were created wearing them so feel incomplete without them.\n\n2. Kerbals are Troglodytes\n\nKerbals are naturally biological, native to Kerbin, and exist in huge numbers, but all underground in vast subterranean cities. Most of them are quite happy there and only the few nutjobs among them ever venture up on the surface, let alone want to go to space. They are a type of fungus similar to puffballs and the dust released when they die is actually a cloud of spores. Those on the surface wear helmets out of a delusional vanity (they are nutjobs, after all).\n\nRegardless of Kerbal origins, the whole helmet I think has to be more costume than necessity. Kerbals lack noses and keep their mouths shut most of the time, so it\u0027s really open to argument as to whether they breathe at all. Maybe they absorb something through their skin, but I suspect the main practical purpose of the helmet is merely to maintain pressure while in space."},{"CreatedByName":"steve_v","CreatedById":69272,"CreatedDateTime":"2015-07-27T12:40:21Z","Content":"We will probably have to ask the mice about the true purpose of kerbin..."},{"CreatedByName":"Evanitis","CreatedById":145424,"CreatedDateTime":"2015-07-27T12:43:27Z","Content":"\u003E \n\u003E we NEVER see any Kerbal outside (does this mean the air is toxic?) the few we do see (ship crew) always wear a space suit even on the surface with no option(yet) to remove it (another tip that the atmosphere is Toxic?)\n\nI see Kerbals walking around in the SPH and the VAB in civilian clothes, with open doors. It\u0027s more likely that it\u0027s only the kerbonauts that have a strict regulation to always wear protective equipment on missions. Even if the mission is to take a soil-sample of the launchpad. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\n\u003E \n\u003E the fact that you cant detect a different solar system (in stock) dosnt support your theory.\n\nI can detect many many solar systems in stock. What else are those dots you see in space all around?\n\n**Edited \u003Ctime datetime=\u00222015-07-27T12:46:24Z\u0022 title=\u002207/27/2015 12:46  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 27, 2015\u003C/time\u003E by Evanitis**"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-07-27T13:04:59Z","Content":"\u003E \n\u003E I see Kerbals walking around in the SPH and the VAB in civilian clothes, with open doors.\n\nActually, they\u0027re inside a controlled environment just like IVA Kerbals.\n\nObserve that when you\u0027re in the VAB and SPH, you can see \u0022clouds\u0022 through the \u0022open\u0022 doors. However, when you\u0027re outside, there are no clouds. The reaons is because the doors are actually blocked by force fields that seal the interior atmosphere, and the \u0022clouds\u0022 are just moire patterns as the field ripples."},{"CreatedByName":"Overfloater","CreatedById":94031,"CreatedDateTime":"2015-07-27T13:07:27Z","Content":"\u003E \n\u003E Toxic atmosphere, uh ?\n\u003E [http://puu.sh/jeFh2/15dbf24584.jpg](http://puu.sh/jeFh2/15dbf24584.jpg)\n\n[/thread]\n\n....."},{"CreatedByName":"Kaos","CreatedById":110849,"CreatedDateTime":"2015-07-27T13:25:08Z","Content":"I like this theory.\n\nAnother explanation for the ground crew despite toxic atmosphere is that the atmosphere is only slightly toxic. The kerbals live there for say five generations and a small fraction of the population managed to get adapted to the toxic air. These Kerbals are too valuable to use in exploding rockets, so they work as ground crew."},{"CreatedByName":"HoloYolo","CreatedById":138353,"CreatedDateTime":"2015-07-27T13:45:20Z","Content":"I had a theory on the Steam forums that kerbals were humans that evolved in the Kerbol system. The radiation from a space mission caused the female pilot to have the first kerbals, and after a few hundred years, humans were extinct and kerbals ruled Kerbin. The story was a lot more elaborate, but I can\u0027t type all of it here. I see where you\u0027re coming from though. Very cool idea!"},{"CreatedByName":"Evanitis","CreatedById":145424,"CreatedDateTime":"2015-07-27T14:43:01Z","Content":"\u003E \n\u003E Observe that when you\u0027re in the VAB and SPH, you can see \u0022clouds\u0022 through the \u0022open\u0022 doors. However, when you\u0027re outside, there are no clouds. The reaons is because the doors are actually blocked by force fields that seal the interior atmosphere, and the \u0022clouds\u0022 are just moire patterns as the field ripples.\n\nInitially I wanted to express how revolting is what you are implying here. I started to think about a reasonable reasoning centered around why the clouds are more visible in semi-closed environments... but than I had to notice some other irregularities concerning the view from the hangar... namely that the sun never sets there. There\u0027s always sunshine, even at the middle of the night. Just like in the movie Dark City, just backwards.\n\nPoor kerbal engineers - I believe something really fishy is going on with them. I believe there is a lot more serious hidden secret there than toxic air. We\u0027ll need to investigate further."},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-07-27T15:41:00Z","Content":"Hmm... except for one thing:\n\n\u003E ![Screen-Shot-2014-05-12-at-20.30.04.png](http://mvinetwork.co.uk/kspblog/wp-content/uploads/2014/05/Screen-Shot-2014-05-12-at-20.30.04.png)\n\nBest,\n\n-Slashy"},{"CreatedByName":"EdusacconBR","CreatedById":135047,"CreatedDateTime":"2015-07-27T15:47:29Z","Content":"and the ksp wiki say they live underground, also, theres KSC 2 and island runway on kerbin"},{"CreatedByName":"LordFerret","CreatedById":111598,"CreatedDateTime":"2015-07-27T15:49:28Z","Content":"\u003E \n\u003E Hmm... except for one thing:\n\u003E \n\u003E \n\u003E \n\u003E \u003E [http://mvinetwork.co.uk/kspblog/wp-content/uploads/2014/05/Screen-Shot-2014-05-12-at-20.30.04.png](http://mvinetwork.co.uk/kspblog/wp-content/uploads/2014/05/Screen-Shot-2014-05-12-at-20.30.04.png)\n\u003E \n\u003E \n\u003E Best,\n\u003E \n\u003E -Slashy\n\nGood point. I forgot about that lol.\n\nOn the other hand, Kerbals are green ... Jool is green ... Kerbals come from Jool. ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)"},{"CreatedByName":"Xacktar","CreatedById":88876,"CreatedDateTime":"2015-07-27T15:49:28Z","Content":"I\u0027m still sticking with the theory that a maniacal dictator rained fire and destruction over the entire planet and is now using the remaining population to search for a new planet to ruin.\n\nAll the kerbals wear space suits because the atmosphere is highly radioactive.\n\nThe only plant life left is the one type of grass and tree that was resistant to radiation.\n\nAll the rocket tech comes from disassembled munitions of various size and complexity.\n\nThere is not enough food to feed all of the Kerbals, so those that speak out against the dictator are recruited, drugged, and sent to space."},{"CreatedByName":"justidutch","CreatedById":99185,"CreatedDateTime":"2015-07-27T15:52:56Z","Content":"I don\u0027t see how the presence of the pyramids and other artifacts found on various bodies debunks this theory. We don\u0027t know that, for instance, these pyramids weren\u0027t built two days before the beginning of KSC (and our introduction to the story). And/or, perhaps these pyramids and other artifacts were overseen by the master Kerbal race (originating from another solar system as the theory goes), and the Kerbals we see here, now, were the slaves that were forced to build these artifacts, and upon completion were abandoned here; their masters not expecting the slaves to survive, let alone develop the anti-stupidity necessary to begin their own space exploration program."},{"CreatedByName":"Zephram Kerman","CreatedById":15270,"CreatedDateTime":"2015-07-27T16:15:59Z","Content":"\u003E \n\u003E if we sent colonists to Mars and then cut contact, surely in ooh a few generations they\u0027d simply refer to themselves as Martian?\n\nPeople from any place refer to themselves by that place, sometimes within just a few weeks. For example, people from Oregon call themselves Oregonians. So your theory makes sense to me.\n\n\u003E \n\u003E Once you develop hyperdrive.. you\u0027ll come back to kerbin to see it consumed by a firestorm.. with a significant debris ring in lower kerbin orbin\n\u003E NO KSC, NO KSC2.. no land-trains...simply..... no one left.. not even beacons\n\nThat scene at Kharak was so sad, and motivational. Beautiful story.\n\n\u003E \n\u003E ]...the monoliths create Kerbals from materials gathered on Mun and spawn them at KSC as needed. This is all the experiment or idle diversion of some hyper-intelligent\u0027 date=\u0027 pan-dimensional beings, who watch their creations evolve and struggle to develope technology for reasons of their own...[/quote\u0027]Those hyper-intelligent, pan-dimensional beings are... *US!* Not so sure about the hyper-intelligent part, but at least compared to Jeb, we are.\n\u003E \n\u003E \u003E \n\u003E \u003E ...the view from the hangar... namely that the sun never sets there...\n\u003E \n\u003E Maybe not so sinister; it may just a back-lit mural of outside that helps them feel more relaxed, like the mirrored back wall of a fish tank. The VAB/SPH don\u0027t even have actual doors; the vehicles are actually \u0027beamed\u0027 to their launch sites by a hyperedit device.\n\u003E \n\u003E \u003E \n\u003E \u003E Hmm... except for one thing:\n\u003E \n\u003E That one\u0027s wearing a foil hat. The space suit helmets are just high-tech versions of the same thing, to prevent us from reading their silly little minds."},{"CreatedByName":"LethalShade","CreatedById":139111,"CreatedDateTime":"2015-07-27T16:37:24Z","Content":"\u003E \n\u003E Hmm... except for one thing:\n\u003E \n\u003E \n\u003E \n\u003E \u003E [http://mvinetwork.co.uk/kspblog/wp-content/uploads/2014/05/Screen-Shot-2014-05-12-at-20.30.04.png](http://mvinetwork.co.uk/kspblog/wp-content/uploads/2014/05/Screen-Shot-2014-05-12-at-20.30.04.png)\n\u003E \n\u003E \n\u003E Best,\n\u003E \n\u003E -Slashy\n\nWhat is this mod ?"},{"CreatedByName":"Evanitis","CreatedById":145424,"CreatedDateTime":"2015-07-27T16:55:20Z","Content":"\u003E \n\u003E What is this mod ?\n\nIt\u0027s stock. Anomaly Surveyor or ScanSat can help you find those if you are interested."},{"CreatedByName":"Planetfall","CreatedById":154594,"CreatedDateTime":"2015-07-27T17:14:48Z","Content":"I think you would like the Kerbal Kronicals. its a fan writing about how the first three and some others survive on kerbin after their mother ship explodes. I think its rather good though the pictures are vary photo-shopped"},{"CreatedByName":"pxi","CreatedById":78711,"CreatedDateTime":"2015-07-27T17:47:43Z","Content":"My personal theory is they actually live in tree-shaped houses."},{"CreatedByName":"Xyphos","CreatedById":139010,"CreatedDateTime":"2015-07-27T18:55:17Z","Content":"\u003E \n\u003E It\u0027s stock. Anomaly Surveyor or ScanSat can help you find those if you are interested.\n\nI think ScanSat is a mod, not stock. \n\nI don\u0027t have said mod and I don\u0027t have said part(s).\n\n\u003E \n\u003E I have noticed other things such as we NEVER see any Kerbal outside (does this mean the air is toxic?) the few we do see (ship crew) always wear a space suit even on the surface with no option(yet) to remove it (another tip that the atmosphere is Toxic?)\n\nDefinitely NOT toxic, he\u0027s just over-dressed for the occasion.\n\n![f6y4TDJ.jpg](http://i.imgur.com/f6y4TDJ.jpg)\n\nPerhaps when/if life-support mod becomes stock, spacesuits will become optional removable equipment?\n\n**Edited \u003Ctime datetime=\u00222015-07-27T19:16:52Z\u0022 title=\u002207/27/2015 07:16  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 27, 2015\u003C/time\u003E by Xyphos**"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2015-07-27T21:09:58Z","Content":"Kerbals originally came from Laythe. Their entire civilization was wiped out as their cities sank beneath the waves following some unknown catastrophe. Kerbin, a planet they had once visited and attempted to colonize (as evidenced by the desert ruins) became their only point of refuge."}]}