{"TopicId":116950,"ForumId":16,"TopicTitle":"Why is this mission not being marked as complete?","CreatedByName":"Proe24","CreatedById":148853,"CreatedDateTime":"2015-07-27T05:10:34Z","PageNum":1,"Articles":[{"CreatedByName":"Proe24","CreatedById":148853,"CreatedDateTime":"2015-07-27T05:10:34Z","Content":"\n\u003Cp\u003EAs you can see, I have reached all of the goals of this mission (after much trial and error and constant reworking of my orbit), however, the mission will not mark as complete. \u003C/p\u003E\u003Cp\u003EI can\u0027t seem to figure out what it is that I am doing wrong, I have looked over my orbit info and compared it with the required orbit info and I can\u0027t find where I\u0027ve fallen short. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/TaNHU9c.jpg\u0022 alt=\u0022TaNHU9c.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAny help would be appreciated! I just want to finish this damn mission and move on!\u003C/p\u003E\n"},{"CreatedByName":"technicalfool","CreatedById":70430,"CreatedDateTime":"2015-07-27T05:20:31Z","Content":"\n\u003Cp\u003EJust an idea, but is your craft travelling the right way around? You wouldn\u0027t be the first person to get confused by having an orbit that has an inclination of exactly 180 degrees away from the required inclination. Check the map view to see what way around the little moving points on the orbit are travelling.\u003C/p\u003E\n"},{"CreatedByName":"FancyMouse","CreatedById":142946,"CreatedDateTime":"2015-07-27T05:26:50Z","Content":"\n\u003Cp\u003ENo the orbit info shows 0.003 inclination so the direction should be correct, unless the display mod has a bug.\u003C/p\u003E\u003Cp\u003EHow does the orbit look like in orbit view?\u003C/p\u003E\n"},{"CreatedByName":"Kryxal","CreatedById":102688,"CreatedDateTime":"2015-07-27T06:01:16Z","Content":"\n\u003Cp\u003EThat\u0027s the only thing I can think of, too ... that the argument of periapsis is wrong in some way. If the orbits match well in map view (and they ARE the same way around, so the numbers say) you may have to just use the cheat menu (and I checked that the celestial body was right too ... it is).\u003C/p\u003E\n"},{"CreatedByName":"stibbons","CreatedById":57865,"CreatedDateTime":"2015-07-27T06:06:23Z","Content":"\n\u003Cp\u003ESometimes it can be worth switching to the tracking station and back again to unstick contracts like that (I\u0027ve only had this happen once, but that helped). Failing that, you\u0027re justified bringing up the debug menu and cheating the contract to completion.\u003C/p\u003E\n"},{"CreatedByName":"Proe24","CreatedById":148853,"CreatedDateTime":"2015-07-28T03:38:50Z","Content":"\n\u003Cp\u003EThanks for all of the replies! \u003C/p\u003E\u003Cp\u003EI checked in map mode and here is what it looks like. I can\u0027t seem to find anything wrong with it, but I\u0027m not sure what difference I would be looking for, I suppose I\u0027m kind of a noob in that aspect. If it is a correctable human error then I definitely want to try to fix it without cheating, but I\u0027m thinking that it might be something else. \u003C/p\u003E\u003Cp\u003EHere are the two images from map mode, one from close up and one with Kerbin in view. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/S6Dmk6w.jpg\u0022 alt=\u0022S6Dmk6w.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/37L1oc0.jpg\u0022 alt=\u002237L1oc0.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"FancyMouse","CreatedById":142946,"CreatedDateTime":"2015-07-28T05:37:17Z","Content":"\n\u003Cp\u003EIt\u0027s definitely a different algorithm for computing argument of periapsis (game is counting toward one direction while MJ is counting the other way).\u003C/p\u003E\u003Cp\u003EJust eyeball your orbit, as we all do.\u003C/p\u003E\n"},{"CreatedByName":"DeMatt","CreatedById":90539,"CreatedDateTime":"2015-07-28T05:41:49Z","Content":"\n\u003Cp\u003EAs FancyMouse said, MechJeb is apparently computing \u0022argument of periapsis\u0022 differently from how the game is. Which is why your #2 screenshot, from just above the Mun, quite clearly shows that your orbit does not match the purple \u0022target\u0022 orbit.\u003C/p\u003E\u003Cp\u003EJust eyeball it. Make your orbit circular at the target apoapsis height, then burn at the target apoapsis to adjust the periapsis down. I think there\u0027s a 7% margin of error on the \u0022marginal deviation\u0022, so it doesn\u0027t have to be super-precise.\u003C/p\u003E\n"},{"CreatedByName":"Rhomphaia","CreatedById":2440,"CreatedDateTime":"2015-07-28T06:59:33Z","Content":"\n\u003Cp\u003EMechJeb calculates AoP the same way as the game\u003C/p\u003E\u003Cp\u003EArgument of periapsis is the angle between the Ascending node and the periapsis.\u003C/p\u003E\u003Cp\u003EI suspect that while the contract says Longitude of Ascending Node is \u0022undefined\u0022 (since an equatorial orbit should have no Acending node) it does not mean it is irrelevant and expects you to match its LAN as well. (probably 0)\u003C/p\u003E\n"},{"CreatedByName":"FancyMouse","CreatedById":142946,"CreatedDateTime":"2015-07-28T07:38:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rhomphaia\u0022 data-cite=\u0022Rhomphaia\u0022\u003E\u003Cdiv\u003EMechJeb calculates AoP the same way as the game\u003Cp\u003EArgument of periapsis is the angle between the Ascending node and the periapsis.\u003C/p\u003E\u003Cp\u003EI suspect that while the contract says Longitude of Ascending Node is \u0022undefined\u0022 (since an equatorial orbit should have no Acending node) it does not mean it is irrelevant and expects you to match its LAN as well. (probably 0)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s undefined because inclination is 0, in which case AN doesn\u0027t make sense (there\u0027s no AN node at all). Has nothing to do contract criteria - I believe all of us completed countless zero-inclination contracts.\u003C/p\u003E\u003Cp\u003EIt\u0027s definitely argument of periapsis problem - see the orbits are perfectly vertically mirrored. That\u0027s exactly you count 300 degress in different directions from 12 o\u0027clock. It is different, whether it\u0027s MJ different from game, or game internal different from contract display, one of them.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-07-28T08:20:31Z","Content":"\n\u003Cp\u003EAs others have said, turn MechJeb off for this one and just get your orbit moderately close to the target. Once you\u0027ve done one or two of these by eye they\u0027re the easiest money in the game.\u003C/p\u003E\n"},{"CreatedByName":"maltesh","CreatedById":17144,"CreatedDateTime":"2015-07-28T11:50:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rhomphaia\u0022 data-cite=\u0022Rhomphaia\u0022\u003E\u003Cdiv\u003EMechJeb calculates AoP the same way as the game\u003Cp\u003EArgument of periapsis is the angle between the Ascending node and the periapsis.\u003C/p\u003E\u003Cp\u003EI suspect that while the contract says Longitude of Ascending Node is \u0022undefined\u0022 (since an equatorial orbit should have no Acending node) it does not mean it is irrelevant and expects you to match its LAN as well. (probably 0)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYep, when the orbit is in the reference plane, the convention is to use the reference direction as the location of the ascending node, which would be a Longitude of the Ascending Node of 0Ã‚Â°. The game does this as well when storing and restoring orbits in the persistence file. For whatever reason, it\u0027s the contract display code that\u0027s decided that\u0027s an Undefined LAN.\u003C/p\u003E\n"},{"CreatedByName":"Proe24","CreatedById":148853,"CreatedDateTime":"2015-07-29T01:20:49Z","Content":"\n\u003Cp\u003EThanks again for all of the replies, the problem was just as was said above, so I matched with the other orbit by eyeballing it and completed the contract, finally!\u003C/p\u003E\n"}]}