{"TopicId":117090,"ForumId":36,"TopicTitle":"[WIP][1.8.x] SSTULabs - Low Part Count Solutions (Orbiters, Landers, Lifters) - Dev Thread [11-18-18]","CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2015-07-28T18:13:57Z","PageNum":167,"Articles":[{"CreatedByName":"blowfish","CreatedById":119688,"CreatedDateTime":"2016-08-23T19:29:50Z","Content":"\u003E \n\u003E \n\u003E 50 minutes ago, Shadowmage said:\n\u003E \n\u003E \n\u003E Indeed; I\u0027ve been contemplating how to best handle this for awhile, and sadly the only thing I can come up with is a separate texture sheet (or lose the AO bake on the existing tank textures).  Lets wait and see if 1.2 really does bring PBR shaders; as it allows for different textures to be used for AO, and would solve this problem quite readily.  I haven\u0027t heard much/anything on the subject recently, so I\u0027m not getting my hopes up, but there is a chance.\n\u003E \n\nFor what it\u0027s worth, I think it would be pretty easy to modify the existing shaders to do this.  The shader source is already available through PartTools, and while I don\u0027t entirely understand the shading language, it looks straightforward enough to modify it to subtract another texture from the diffuse texture.  I think the bulk of the work would be in reconfiguring the models to use this.  But its probably worth waiting to see if 1.2 has a built-in solution for this."},{"CreatedByName":"JoseEduardo","CreatedById":127759,"CreatedDateTime":"2016-08-23T20:33:45Z","Content":"I\u0027m just going to post this here and also ping [@CobaltWolf](https://forum.kerbalspaceprogram.com/index.php?/profile/105588-cobaltwolf/) since this also uses his mod...  \n  \n[http://imgur.com/a/cYHX8](http://imgur.com/a/cYHX8)  \n\nRealScaleBoosters for the IU, tanks and interstages (I extended the S-II interstage for J-2X but in this case I was using a regular J-2), DECQ Saturn V for the Apollo payload adapter, SSTU for the Apollo CM and Engines, and BDB for the docking port\u002BLEM  \n\non my first test it went very well until the point where I was going to decouple the LEM, due to some collider weirdness with DECQ\u0027s LEM decoupler it blew the descent stage up, and now I need to test without that decoupler and use a stock one instead...  \n\nthe docking worked flawlessly btw, as shown in the pics I kept the animation and it allowed me to soft-dock with the LEM, and then hard-dock after I retracted it  \n\n(oh, and yeah, BDB\u0027s DP is part of the CM, not a separate part... I had to make a new BPC for that...)  \n\nEDIT: here\u0027s a patch to add BDB\u0027s docking port to SSTU Apollo if anyone is interested (could be used as basis to add other docking ports through patches as well):\n\n    \u002BPART[SSTU-SC-B-CM]:NEEDS[Bluedog_DB]:FINAL\n    {@name = SSTU-SC-B-CM-Apollo@title = SSTU - SC-B - CM - Re-Entry Module - Apollo!MODEL,1{}MODEL{\tmodel = Bluedog_DB/Parts/Apollo/bluedog_Apollo_Block2_ActiveDockingMechanism\tposition = 0, 0.86468, 0}@node_stack_top = 0,0.90071977,0,0,1,0,1!MODULE[ModuleDockingNode]{}MODULE{\tname = ModuleDockingNode\treferenceAttachNode = top\tnodeType = apollo\tacquireForce = 3\tacquireTorque = 2\tstagingEnabled = False\tgendered = true\tgenderFemale = false}MODULE{\tname = ModuleAnimateGeneric\tanimationName = retract\t//isOneShot = true\tstartEventGUIName = Retract Ring\tendEventGUIName = Extend Ring\tactionGUIName = Toggle Ring\tallowAnimationWhileShielded = False}\n    }\n    \u002BPART[SSTU-SC-B-CMX]:NEEDS[Bluedog_DB]:FINAL\n    {@name = SSTU-SC-B-CMX-Apollo@title = SSTU - SC-B-CMX - Orbital Module Apollo!MODEL,1{}MODEL{\tmodel = Bluedog_DB/Parts/Apollo/bluedog_Apollo_Block2_ActiveDockingMechanism\tposition = 0, 0.86468, 0}@node_stack_top = 0,0.90071977,0,0,1,0,1!MODULE[ModuleDockingNode]{}MODULE{\tname = ModuleDockingNode\treferenceAttachNode = top\tnodeType = apollo\tacquireForce = 3\tacquireTorque = 2\tstagingEnabled = False\tgendered = true\tgenderFemale = false}MODULE{\tname = ModuleAnimateGeneric\tanimationName = retract\t//isOneShot = true\tstartEventGUIName = Retract Ring\tendEventGUIName = Extend Ring\tactionGUIName = Toggle Ring\tallowAnimationWhileShielded = False}\n    }\n    \u002BPART[SSTU-SC-B-BPC]:NEEDS[Bluedog_DB]:FINAL\n    {@name = SSTU-SC-B-BPC-Apollo@title = SSTU - SC-B - BPC - Launch Abort System - Apollo@node_stack_bottom = 0,-3.58187023,0,0,-1,0,2\n    }\n\nuse at your own, neither me or Shadowmage or even CobaltWolf (since this is for his docking port) is responsible for bugs or anyone getting stuck on a fan because of this patch\n\n**Edited \u003Ctime datetime=\u00222016-08-23T20:42:06Z\u0022 title=\u002208/23/2016 08:42  PM\u0022 data-short=\u00227 yr\u0022\u003EAugust 23, 2016\u003C/time\u003E by JoseEduardo**"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-08-23T21:16:32Z","Content":"The huge torus (H) is large enough to have 2 levels, and is about 2100 m^2^of floor space, and that\u0027s not taking kerbal scale into account, which makes it more like 3300 m^2^ compared to people. Manhattan has a population density such that each resident has ~36m^2^ of space (a small apartment worth of space, but that includes all outside spaces as well for NYC). At that density, the station could hold 93."},{"CreatedByName":"CobaltWolf","CreatedById":105588,"CreatedDateTime":"2016-08-23T21:18:03Z","Content":"\u003E \n\u003E \n\u003E 43 minutes ago, JoseEduardo said:\n\u003E \n\u003E \n\u003E I\u0027m just going to post this here and also ping [@CobaltWolf](https://forum.kerbalspaceprogram.com/index.php?/profile/105588-cobaltwolf/) since this also uses his mod...  \n\u003E   \n\u003E [http://imgur.com/a/cYHX8](http://imgur.com/a/cYHX8)  \n\u003E   \n\u003E \n\u003E RealScaleBoosters for the IU, tanks and interstages (I extended the S-II interstage for J-2X but in this case I was using a regular J-2), DECQ Saturn V for the Apollo payload adapter, SSTU for the Apollo CM and Engines, and BDB for the docking port\u002BLEM  \n\u003E   \n\u003E \n\u003E on my first test it went very well until the point where I was going to decouple the LEM, due to some collider weirdness with DECQ\u0027s LEM decoupler it blew the descent stage up, and now I need to test without that decoupler and use a stock one instead...  \n\u003E   \n\u003E \n\u003E the docking worked flawlessly btw, as shown in the pics I kept the animation and it allowed me to soft-dock with the LEM, and then hard-dock after I retracted it  \n\u003E   \n\u003E \n\u003E (oh, and yeah, BDB\u0027s DP is part of the CM, not a separate part... I had to make a new BPC for that...)  \n\u003E   \n\u003E \n\u003E EDIT: here\u0027s a patch to add BDB\u0027s docking port to SSTU Apollo if anyone is interested (could be used as basis to add other docking ports through patches as well):\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E use at your own, neither me or Shadowmage or even CobaltWolf (since this is for his docking port) is responsible for bugs or anyone getting stuck on a fan because of this patch\n\u003E \n\nThat\u0027s awesome! [@Jso](https://forum.kerbalspaceprogram.com/index.php?/profile/154231-jso/) said he encountered structural failures when a LEM was integrated into a launch stage. We are looking into it."},{"CreatedByName":"JoseEduardo","CreatedById":127759,"CreatedDateTime":"2016-08-23T21:30:21Z","Content":"\u003E \n\u003E \n\u003E 13 minutes ago, CobaltWolf said:\n\u003E \n\u003E \n\u003E That\u0027s awesome! [@Jso](https://forum.kerbalspaceprogram.com/index.php?/profile/154231-jso/) said he encountered structural failures when a LEM was integrated into a launch stage. We are looking into it.\n\u003E \n\nwith launch stage you mean like inside a fairing Apollo-style? if so I\u0027ll upload some logs that can be helpful to you and send you the link (should include 3 failures, 1 with DECQ\u0027s adapter, 1 with DECQ\u0027s adapter but with a stock decoupler for the LEM and 1 with Mage\u0027s Petal Adapter, but I suspect the last one was caused because I left the colliders option on)\n\n**Edited \u003Ctime datetime=\u00222016-08-23T21:32:06Z\u0022 title=\u002208/23/2016 09:32  PM\u0022 data-short=\u00227 yr\u0022\u003EAugust 23, 2016\u003C/time\u003E by JoseEduardo**"},{"CreatedByName":"CobaltWolf","CreatedById":105588,"CreatedDateTime":"2016-08-23T21:32:02Z","Content":"\u003E \n\u003E \n\u003E Just now, JoseEduardo said:\n\u003E \n\u003E \n\u003E with launch stage you mean like inside a fairing Apollo-style? I\u0027ll upload some logs that can be helpful to you and send you the link (should include 3 failures, 1 with DECQ\u0027s adapter, 1 with DECQ\u0027s adapter but with a stock decoupler for the LEM and 1 with Mage\u0027s Petal Adapter, but I suspect the last one was caused because I left the colliders option on)\n\u003E \n\nI meant to say stack, sorry. Like, integrated structurally into a rocket with the CSM on top. Were all 3 failures at one of the LEM attach nodes? Were you using any struts - moreover, does adding them prevent the failures?\n\n[@Shadowmage](https://forum.kerbalspaceprogram.com/index.php?/profile/138730-shadowmage/) sorry to hijack your thread. ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif \u0022:P\u0022)"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-08-23T23:48:02Z","Content":"Let me preface this by saying that I have no idea what I\u0027m talking about in this case, and it should be treated with all the care of any other harebrained idea... \n\nI was thinking about the large torus, and the image of orbital assembly. EPL-like behavior means launching some sort of parts (or delivering ore, etc for ISRU), then, poof, it appears.\n\nI was wondering if there could be something akin to welding where a single unit, say Hab-H, is made, and some other parts are made that are considered sub assemblies. Hab-Ha, Hab-Hb, etc., since that you touch them together, and when the last one is in place (4 parts, 6 parts, whatever it is), Poof! those models are destroyed, and replaced with Hab-H. Ideally they\u0027d snap together in a profoundly easy way, like they get within some decent distance and have super-magnet \u0022docking.\u0022\n\nThe subassemblies need not be Hab-H quarters, they can be chunks that make sense, and that are reasonable cargos to lift, it\u0027s just a stand in for lifting X hundred tons in small packages. For an EPL standpoint, consider them purpose-build part canisters that happen to look like parts of a station."},{"CreatedByName":"StickyScissors","CreatedById":144204,"CreatedDateTime":"2016-08-24T08:29:38Z","Content":"Finally got my GPU issue sorted out, here\u0027s some testing screenshots. They have to do with beautification mods more than anything, but who cares, they -do- at least have one part from SSTU.\n\n![TXDDcOk.png](http://i.imgur.com/TXDDcOk.png)\n\n![Tr4DQu7.png](http://i.imgur.com/Tr4DQu7.png)\n\n![Y64MixN.jpg](http://i.imgur.com/Y64MixN.jpg)"},{"CreatedByName":"Domfluff","CreatedById":64903,"CreatedDateTime":"2016-08-24T11:46:01Z","Content":"\u003E \n\u003E \n\u003E 11 hours ago, tater said:\n\u003E \n\u003E \n\u003E I was wondering if there could be something akin to welding where a single unit, say Hab-H, is made, and some other parts are made that are considered sub assemblies. Hab-Ha, Hab-Hb, etc., since that you touch them together, and when the last one is in place (4 parts, 6 parts, whatever it is), Poof! those models are destroyed, and replaced with Hab-H. Ideally they\u0027d snap together in a profoundly easy way, like they get within some decent distance and have super-magnet \u0022docking.\u0022\n\u003E \n\nI don\u0027t believe that\u0027s possible, but the way I think you\u0027d actually do that (in terms of a functional \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E-LS part at least) is to have each section have a part of the eventual hab values - e.g., if the ring had six elements, and each had two crew slots, \u002B5 Kerbalmonths and a hab multiplier of 0.5 (so, 1.5 in effect), then the effective \u0022final\u0022 station would have \u002B30 kerbalmonths, a hab multiplier of 1 \u002B (6\\*0.5) = 4 and 12 crew spaces in total.  \n\n(Actually, tempted to teach myself how to mod to do this, since I think this could be useful)  \n\nNow, as previously stated, I think I\u0027d prefer a rigid station to be built this way, but if Shadowmage is deciding between a single rigid part or a single inflatable part (which perfectly sensible), then I think I\u0027d much rather go for a massive inflatable, since it should be launchable, for varying degrees of apocalyptic rocket (but still plausible - anything up to a 200 ton payload is probably \u0022fine\u0022 from a launchpad.  \n\nObviously, Sea Dragon, Project Orion, etc. etc. are exceptions to this, but then there are good reasons for that."},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-08-24T15:04:03Z","Content":"\u003E \n\u003E \n\u003E 3 hours ago, Domfluff said:\n\u003E \n\u003E \n\u003E I don\u0027t believe that\u0027s possible, but the way I think you\u0027d actually do that (in terms of a functional \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E-LS part at least) is to have each section have a part of the eventual hab values - e.g., if the ring had six elements, and each had two crew slots, \u002B5 Kerbalmonths and a hab multiplier of 0.5 (so, 1.5 in effect), then the effective \u0022final\u0022 station would have \u002B30 kerbalmonths, a hab multiplier of 1 \u002B (6\\*0.5) = 4 and 12 crew spaces in total.  \n\u003E   \n\u003E \n\u003E (Actually, tempted to teach myself how to mod to do this, since I think this could be useful)  \n\u003E   \n\u003E \n\u003E Now, as previously stated, I think I\u0027d prefer a rigid station to be built this way, but if Shadowmage is deciding between a single rigid part or a single inflatable part (which perfectly sensible), then I think I\u0027d much rather go for a massive inflatable, since it should be launchable, for varying degrees of apocalyptic rocket (but still plausible - anything up to a 200 ton payload is probably \u0022fine\u0022 from a launchpad.  \n\u003E   \n\u003E \n\u003E Obviously, Sea Dragon, Project Orion, etc. etc. are exceptions to this, but then there are good reasons for that.\n\u003E \n\nAgain this is a harebrained idea, to be taken with a shaker full of salt, not a realistic, crazy request ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022) .\n\nI wasn;t thinking of the parts even being usable at all during construction. It was more like a \u0022no parts\u0022 version of EPL. Meaning no special construction facility parts, but that certain, huge constructions might be transported as sub assemblies, then considered assembled once they are all put together (and totally non functional before. You have a 5 part ring on orbit, and when the 6^th^ and final part is mated, poof, the model is replaced with our 1 part hab ring.The radial parts might be represented by partial construction (like the 2001 image) on the sub assemblies to keep the part narrow enough to put under a fairing the long way.\n\nAlternately, There is a huge \u0022supply pod\u0022 that is a sort of generic part container. In this case it might be 5m or even 6m in diameter. It might be textured to match the rigid hab, but again, it\u0027s just a cylinder. It masses some fraction of the total hab, and you put X of them together, then the hab appears, instead (same deal, the X containers explode and are replaced with the hab model). EPL is effectively just that, minus the explosion. You\u0027d have to dock the supplies, then when you have enough you build the hab. Dunno which is easier, probably just a minimal parts EPL implementation (the suggested orbital assemble facility).\n\nThe only issue with an orbital assemble facility and our rigid torus, is that I worry about having enough room for it to appear.\n\nEDIT: If you imagine the Hab-H forming with the same orientation as the inflatable, then whatever the assembly part is for EPL needs to be at the end of the station such that no other parts are at the same level, or farther so that when it appears, it is effectively docked to the hub."},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2016-08-24T19:04:02Z","Content":"Let me start this post by saying that it has always been my intent to have some parts that are needed to be constructed in-orbit (or in-situ on the ground) through EPL.  To me, that is the \u0027late game\u0027 of KSP; start with a small shipyard/station, build a larger shipyard/station, and with that build your super-massive interplanetary craft.  I have no desire to change that; it is how I play, and intend on continuing to do so.  Expect to see other super-large non-launchable (or at least not intended to be launched) parts when I start getting into the BaseCore series of parts.\n\nI have never had a problem using EPL in that fashion.  Its quite simple; you ship up RocketParts to your orbital station (in lieu of modules / parts of parts), and it abstracts away all of the fiddly bits of orbital construction (docking, launching strange-shaped stuff, wonky physics/joints in atmo; not that I mind docking, but we lack the tools for precise alignment).  EPL requires an amount of rocket-parts equal to the dry mass of the vessel being constructed, so its not making it any easier from a total-mass-to-orbit perspective; merely allowing you to split the \u0027launch\u0027 up into however many smaller launches you need, and allowing for a more compact and easier-to-launch form-factor.  You could still put 150t of rocketparts onto a single rocket if you -wanted- to do it in a single launch.  You don\u0027t even need to mess with any of the processing or ISRU stuff to use it in this manner; just ship up the RocketParts and build your craft.  It even includes construction time and encourages the use of engineers on the station (requires at least one);  I consider all of those points to be a \u0027win\u0027 from both gameplay and realism points of view, at least for me (and also gives a use to stations after you\u0027ve unlocked the tech tree and labs become cosmetic).  (This is aside to EPL being used with ISRU; that part I do find to be a -bit- unrealistic, but an acceptable abstraction from a gameplay standpoint.  UKS also helps solve that a bit by requiring a percentage of construction mass come from a \u0027specialized parts\u0027 resource that cannot be constructed through ISRU, so even far-flung shipyards need resupply of the \u0027technical\u0027 bits from Kerbin (think turbopumps, computers, the stuff that would be hard to manufacture without substantial infrastructure))\n\nIn regards to the vessel-spawning with shipyards -- I\u0027ve never had a problem with that with EPL either.  What it does is examine the to-be-spawned vessel\u0027s colliders and places the vessel such that it is positioned in a non-colliding manner with the shipyard part (based on a reference transform / direction from the shipyard part).  This does require that the shipyard be at one end of the station so that there is adequate clearance, but I\u0027ve never found that to be an issue (one of those engineering / craft-design bits, not really a challenge, but part of the game that I enjoy).\n\nYes I have mostly settled on the largest torus (H) being a rigid/metallic part.  Probably the next largest one as well (G).  With that said... I will -try- to include a \u0027deflate\u0027 option so that you guys can still launch them on rockets; but no guarantees, and even if I do it may be very ugly when deflated (the model for the rigid part might not work well with the scaling/deflating/retracting animation, but should look much better when inflated/deployed than the inflatables could; yes, the need for an animation can constrain how the geometry is done).\n\nIn regards to \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E-LS:  Sorry, I haven\u0027t really begun to look into that aspect of the parts very much.  I need to figure out the stock balancing before much/any work can be done towards the LS balance; mass, crew capacity, and intended functionality for the parts all need to be mostly finalized before I can work on LS balance.  However I am trying to keep the LS stuff in perspective when working on the stock balancing.  But, this does not mean that I will be putting 100 seats on something just because \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E-LS uses that for extra hab time -- its just as easy to increase the base hab time when I do the patches and keep the crew-counts at reasonable levels (actually easier from a few different points).\n\nOn that note I\u0027m fairly certain I\u0027ll be going with a \u0027lower-crew-count but fully-equipped\u0027 perspective for most of these parts.  The crew counts I posted in the table yesterday are likely fairly close with what I\u0027ll go with;  ~30 crew max for the largest parts, and work down from there.  This means that in a stock game the parts will be a bit heavy from a mass-per-seat perspective compared to some of the other stock parts... but they are also more than just some seats in a can (e.g. the hitchiker and mk3 passenger section), and intended to represent the actual habitation space (sleeping areas, hygiene facilities, recreation areas, meeting/common areas, life-support machinery and storage).\n\nIn regards to science labs:  Sadly I do not think that any of the larger HAB parts will include science labs.  The stock science-lab module is an all-or-nothing setup; it uses all of the crew in the part, period -- there is no way to specify \u0027this lab should only use the 4 highest-level scientists in the part\u0027.  I really would like to include labs in these parts, but don\u0027t think I can work out a reasonable way from a balance perspective.  Open to suggestions on this point though... perhaps there is some balance mechanism I\u0027ve overlooked.\n\nUpdated render of the HAB-A inflatable, with end-caps, \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E, and prototype solar panel (undecided on the integrated solar panels; might be optional stand-alone parts) (switchable end-caps and adapters for these are still in place, they merely sit on top of the built-in end cap):\n\n![oaJPyVA.png](http://i.imgur.com/oaJPyVA.png)\n\nTesting out if I want to do discrete external tanks on the DOS modules, or have them \u0027cloth-covered\u0027 as they are IRL.  Quite undecided on this still; will need to do a bit more modeling work on the \u0027cloth-covered\u0027 to see if I like the finished look.  (Also of note are the mostly finished DOS solar panels in these renders, though only shown in their retracted state)\n\n![f5jlt8Q.png](http://i.imgur.com/f5jlt8Q.png)"},{"CreatedByName":"JoseEduardo","CreatedById":127759,"CreatedDateTime":"2016-08-24T19:11:55Z","Content":"there\u0027s no such thing as \u0022super-large non-launchable\u0022, you only need a bigger launcher that can launch the thing  \n  \n![gLNo4xW.png](http://i.imgur.com/gLNo4xW.png)  \n\nand I can do far worse, that\u0027s just 61 NK-33 engines, I can get 61 F-1B ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif \u0022:P\u0022)"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2016-08-24T19:18:44Z","Content":"\u003E \n\u003E \n\u003E 23 hours ago, blowfish said:\n\u003E \n\u003E \n\u003E For what it\u0027s worth, I think it would be pretty easy to modify the existing shaders to do this.  The shader source is already available through PartTools, and while I don\u0027t entirely understand the shading language, it looks straightforward enough to modify it to subtract another texture from the diffuse texture.  I think the bulk of the work would be in reconfiguring the models to use this.  But its probably worth waiting to see if 1.2 has a built-in solution for this.\n\u003E \n\nYeah, it may well come to that if PBR is not a thing in 1.2.  I\u0027m decently familiar with GLSL from my stints doing Android game development (its basically a trimmed down C variant).  Shouldn\u0027t be too hard to add another texture slot and mix it with the diffuse texture.\n\nMostly I would be concerned if PartTools can export custom shaders to .mu files, whether KSP can read/load the custom shaders properly, and how much stuff in-game is hard-coded around the KSP shaders (as you\u0027ve found out regarding the transparency and highlighting bits; they rely specifically on the shader and texture-slot names from the KSP shaders)."},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-08-24T19:24:17Z","Content":"[@Shadowmage](https://forum.kerbalspaceprogram.com/index.php?/profile/138730-shadowmage/), parts are looking awesome. I totally get the EPL thing, it is a simplification that I really like, I just never liked the actual parts in that mod... I didn\u0027t know about the check for how it spawns the craft, either, which avoids what I thought was a problem (which isn\u0027t).\n\nRegarding the science labs, that\u0027s too bad, as the large stations would obviously have room. I suppose that there could be small lab parts designed with attachment to the hub in mind. \n\nHere\u0027s an idea. Imagine you make a new adapter shape for the hubs. Call it \u0022Lab-like.\u0022 It\u0027s a cylinder, of the torus hub\u0027s base diameter, and a couple meters high. It is not a lab, it does nothing, it\u0027s an adapter. Make a copy of the adapter as a stand alone part, it\u0027s an actual lab. Give it 2 seats, and lab functionality. The larger the torus, the larger the lab adapter. You slap that on one side, and if you want symmetry, you use the adapter part on the other side. Maybe the -H torus could have a larger hub than even it would with an inflatable, so the lab is even bigger in diameter. The idea is the smallest way to add lab functionality, and larger tori (meaning larger diameter matching lab parts) could have more capability (science storage, etc)."},{"CreatedByName":"blowfish","CreatedById":119688,"CreatedDateTime":"2016-08-24T20:59:39Z","Content":"\u003E \n\u003E \n\u003E 1 hour ago, Shadowmage said:\n\u003E \n\u003E \n\u003E Yeah, it may well come to that if PBR is not a thing in 1.2.  I\u0027m decently familiar with GLSL from my stints doing Android game development (its basically a trimmed down C variant).  Shouldn\u0027t be too hard to add another texture slot and mix it with the diffuse texture.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Mostly I would be concerned if PartTools can export custom shaders to .mu files, whether KSP can read/load the custom shaders properly, and how much stuff in-game is hard-coded around the KSP shaders (as you\u0027ve found out regarding the transparency and highlighting bits; they rely specifically on the shader and texture-slot names from the KSP shaders).\n\u003E \n\nExporting the models should work according to my limited understanding (I don\u0027t think PartTools treats the KSP shaders differently than any of the other ones).  Loading into KSP ... I guess I sort of assumed it could be done with asset bundles, but I could definitely be wrong there."},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2016-08-24T21:34:51Z","Content":"\u003E \n\u003E \n\u003E 22 minutes ago, blowfish said:\n\u003E \n\u003E \n\u003E Exporting the models should work according to my limited understanding (I don\u0027t think PartTools treats the KSP shaders differently than any of the other ones).  Loading into KSP ... I guess I sort of assumed it could be done with asset bundles, but I could definitely be wrong there.\n\u003E \n\nYes, would be doable with asset bundles.  I believe those use the Unity based serialization which should work fine for exporting the shader name and material(s) setup (it is intended to work with user-created shaders as far as I know).\n\nHowever the workflow for using AssetBundles is a bit... inconvenient from my experience (have to keep a separate .prefab file of each model up-to-date (separate from its actual exported bundle file), and it takes custom loaders to get them in-game).  I would much rather stay away from AssetBundles if at all possible for those reasons.\n\nOn that note I\u0027ve been deliberating on making a custom part-model exporter and loader that supports arbitrary shaders, materials, and animation types.  Not that I really want to put that much work into it (and it would be a fair bit of work), but I really dislike the AssetBundle workflow that much, and am getting sick of the incompatibilities and lack of updates for the .mu exporter."},{"CreatedByName":"theJesuit","CreatedById":122369,"CreatedDateTime":"2016-08-24T22:36:11Z","Content":"\u003E \n\u003E \n\u003E 3 hours ago, Shadowmage said:\n\u003E \n\u003E \n\u003E Let me start this post by saying that it has always been my intent to have some parts that are needed to be constructed in-orbit (or in-situ on the ground) through EPL.  To me, that is the \u0027late game\u0027 of KSP; start with a small shipyard/station, build a larger shipyard/station, and with that build your super-massive interplanetary craft.  I have no desire to change that; it is how I play, and intend on continuing to do so.  Expect to see other super-large non-launchable (or at least not intended to be launched) parts when I start getting into the BaseCore series of parts.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Yes I have mostly settled on the largest torus (H) being a rigid/metallic part.  Probably the next largest one as well (G).  With that said... I will -try- to include a \u0027deflate\u0027 option so that you guys can still launch them on rockets; but no guarantees, and even if I do it may be very ugly when deflated (the model for the rigid part might not work well with the scaling/deflating/retracting animation, but should look much better when inflated/deployed than the inflatables could; yes, the need for an animation can constrain how the geometry is done).\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E On that note I\u0027m fairly certain I\u0027ll be going with a \u0027lower-crew-count but fully-equipped\u0027 perspective for most of these parts.  The crew counts I posted in the table yesterday are likely fairly close with what I\u0027ll go with;  ~30 crew max for the largest parts, and work down from there.  This means that in a stock game the parts will be a bit heavy from a mass-per-seat perspective compared to some of the other stock parts... but they are also more than just some seats in a can (e.g. the hitchiker and mk3 passenger section), and intended to represent the actual habitation space (sleeping areas, hygiene facilities, recreation areas, meeting/common areas, life-support machinery and storage).\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E In regards to science labs:  Sadly I do not think that any of the larger HAB parts will include science labs.  The stock science-lab module is an all-or-nothing setup; it uses all of the crew in the part, period -- there is no way to specify \u0027this lab should only use the 4 highest-level scientists in the part\u0027.  I really would like to include labs in these parts, but don\u0027t think I can work out a reasonable way from a balance perspective.  Open to suggestions on this point though... perhaps there is some balance mechanism I\u0027ve overlooked.\n\u003E \n\nYou are getting me excited and interested in finally using EPL.  I\u0027ve only just started using KCT together with Kerbalism in all its own glory.\n\nGlad you\u0027ve settled on the torus G and H.  If your intention is to build insitu or on an airless body then I would worry about \u0027deflate\u0027 too much.  Deflating might be to rearrange to fit inside a fairing, or to balance on a rocket.\n\nI\u0027m also glad for the lower crew count version.  Hopefully IVA\u0027s will spawn the Kerbals sitting on treadmills or gazing at pictures of Kerbin or rockets:)\n\nThe science lab balance could be a suggestion as a stock module?\n\nGreat work!  Peace."},{"CreatedByName":"Domfluff","CreatedById":64903,"CreatedDateTime":"2016-08-24T22:41:00Z","Content":"Roverdude\u0027s Akademy part (UKS) has 12 crew, of which two can be scientists in the lab (and the lab has larger data/science storage, but that\u0027s neither here nor there)  \n\nNo idea how it decides which crew use, mind you.  \n\nPart .cfg:  \n\nSpoiler\n\nPART  \n\n{  \n\n    name = MK3\\_Akademy  \n\n    module = Part  \n\n    author = RoverDude   \n\n    MODEL  \n\n    {  \n\n        model = UmbraSpaceIndustries/UKS/Assets/MKS\\_Module\\_III  \n\n        texture = Decal\\_375\\_00 , UmbraSpaceIndustries/UKS/Assets/Decal\\_375\\_99  \n\n    }  \n\n    rescaleFactor = 1  \n\n    scale = 1  \n\n    node\\_stack\\_Left = -2.35, -2.08, 0.0, -1, 0, 0.0,1  \n\n    node\\_stack\\_right = 2.35, -2.08, 0.0, 1, 0, 0.0,1  \n\n    node\\_stack\\_top = 0.0, 3.4, 0.0, 0.0, 1.0, 0.0,3  \n\n    node\\_stack\\_bottom = 0.0, -3.4, 0.0, 0.0, -1.0, 0.0,3  \n\n    TechRequired = advExploration  \n\n    entryCost = 8000  \n\n    cost = 35000  \n\n    category = none  \n\n    subcategory = 0  \n\n    title = UKS Training Akademy  \n\n    manufacturer = \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E - Kolonization Division  \n\n    description = A field training center for training your Kerbonauts.  When training is conducted, attendees will gain experience based on the instructors present, and in their chosen field.  Up to one star when used on Kerbin, two stars while in orbit, and three stars if training takes place landed on another planet or moon.  \n\n    attachRules =1,0,1,1,0  \n\n    mass = 6.50  \n\n    dragModelType = default  \n\n    maximum\\_drag = 0.25  \n\n    minimum\\_drag = 0.25  \n\n    angularDrag = .5  \n\n    crashTolerance = 45  \n\n    breakingForce = 2800  \n\n    breakingTorque = 2800  \n\n    maxTemp = 1700  \n\n    bulkheadProfiles = size3\n\n    vesselType = Base  \n\n    CrewCapacity = 12\n\nMODULE  \n\n    {  \n\n        name = ModuleScienceContainer  \n\n        reviewActionName = Review Data  \n\n        storeActionName = Store Experiments  \n\n        collectActionName = Take Data  \n\n        evaOnlyStorage = True  \n\n        storageRange = 3.5  \n\n        allowRepeatedSubjects = True  \n\n    }  \n\n    MODULE  \n\n    {  \n\n        name = ModuleScienceLab  \n\n        containerModuleIndex = 0  \n\n        dataStorage = 1500  \n\n        crewsRequired = 2  \n\n        canResetConnectedModules = True  \n\n        canResetNearbyModules = True  \n\n        interactionRange = 5  \n\n        SurfaceBonus = 0.1  \n\n        ContextBonus = 0.25  \n\n        homeworldMultiplier = 0.1  \n\n        RESOURCE\\_PROCESS  \n\n        {  \n\n            name = ElectricCharge  \n\n            amount = 10  \n\n        }  \n\n    }\n\n    MODULE  \n\n    {  \n\n        name = ModuleScienceConverter  \n\n        scientistBonus = 0.25    //Bonus per scientist star - need at least one! So 0.25x - 2.5x   \n\n        researchTime = 7        //Larger = slower.  Exponential!  \n\n        scienceMultiplier = 5    //How much science does data turn into?  \n\n        scienceCap = 1500        //How much science can we store before having to transmit?          \n\n        powerRequirement = 5    //EC/Sec to research  \n\n        ConverterName = Research  \n\n        StartActionName = Start Research  \n\n        StopActionName = Stop Research  \n\n    }      \n\n    MODULE  \n\n    {  \n\n        name = MKSModule  \n\n        workSpace = 5  \n\n        livingSpace = 0  \n\n    }\n\n    MODULE  \n\n    {  \n\n        name = ModuleConnectedLivingSpace  \n\n        passable = true  \n\n    }\n\n    MODULE  \n\n    {  \n\n        name = ExWorkshop  \n\n        ProductivityFactor  = 5  \n\n    }\n\n    MODULE  \n\n    {  \n\n        name = SpaceAcademy  \n\n    }  \n\n    MODULE  \n\n    {  \n\n        name = FSanimateGeneric  \n\n        animationName = Lights  \n\n        startEventGUIName = Lights On  \n\n        endEventGUIName = Lights Off  \n\n        availableInEVA = True  \n\n        availableInVessel = True  \n\n        EVArange = 5  \n\n        layer=3  \n\n        moduleID=0  \n\n        playAnimationOnEditorSpawn = False  \n\n    }\n\n  MODULE  \n\n  {  \n\n      name = ModuleCommand  \n\n      minimumCrew = 0  \n\n      RESOURCE  \n\n      {  \n\n          name=ElectricCharge  \n\n          rate = 0.02777778  \n\n      }  \n\n  }  \n\n    MODULE  \n\n    {  \n\n        name = ModulePowerCoupler  \n\n    }          \n\n}"},{"CreatedByName":"blowfish","CreatedById":119688,"CreatedDateTime":"2016-08-24T22:44:56Z","Content":"\u003E \n\u003E \n\u003E 1 hour ago, Shadowmage said:\n\u003E \n\u003E \n\u003E Yes, would be doable with asset bundles.  I believe those use the Unity based serialization which should work fine for exporting the shader name and material(s) setup (it is intended to work with user-created shaders as far as I know).\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E However the workflow for using AssetBundles is a bit... inconvenient from my experience (have to keep a separate .prefab file of each model up-to-date (separate from its actual exported bundle file), and it takes custom loaders to get them in-game).  I would much rather stay away from AssetBundles if at all possible for those reasons.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E On that note I\u0027ve been deliberating on making a custom part-model exporter and loader that supports arbitrary shaders, materials, and animation types.  Not that I really want to put that much work into it (and it would be a fair bit of work), but I really dislike the AssetBundle workflow that much, and am getting sick of the incompatibilities and lack of updates for the .mu exporter.\n\u003E \n\nHuh.  I meant I thought that the standard .mu export would work with custom shaders on the model but that asset bundles would be necessary to load the shaders themselves ... is this not the case?\n\n**Edited \u003Ctime datetime=\u00222016-08-24T22:45:22Z\u0022 title=\u002208/24/2016 10:45  PM\u0022 data-short=\u00227 yr\u0022\u003EAugust 24, 2016\u003C/time\u003E by blowfish**"},{"CreatedByName":"SpaceBadger007","CreatedById":150547,"CreatedDateTime":"2016-08-24T22:54:00Z","Content":"[@Shadowmage](https://forum.kerbalspaceprogram.com/index.php?/profile/138730-shadowmage/) was there a change to make everything have a max diameter value of 3.125m in the latest update? this is in sandbox mode."},{"CreatedByName":"RedParadize","CreatedById":129285,"CreatedDateTime":"2016-08-24T23:46:46Z","Content":"\u003E \n\u003E \n\u003E On 22/08/2016 at 11:34 AM, Shadowmage said:\n\u003E \n\u003E \n\u003E **Balance and design on the HAB parts (inflatables, standard and torus).**  \n\u003E   \n\u003E \n\u003E 1.) Should the two largest torus be inflatable or rigid/metallic? (different answers for each is okay)  \n\u003E \n\u003E 2.) How heavy should the inflatable tori be? (I\u0027ll be basing the other inflatable hab masses off of the bigelow module masses).  The smallest one will likely be ~4 tons (HAB-E), with the next largest one being 6-8 tons (HAB-F).  The G and H models will highly depend on if they are inflatable or rigid.  Other input/suggestions are welcome though.  \n\u003E \n\u003E 3.) Any desire for inflatable greenhouse/aerponics versions of the HAB-A/B/C (or even torus?).  These would share external dimensions with the others but include some windows and shrubbery, would still include some habitation space so that they were not useless in a stock game... but in a \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E-LS game they would be enabled with converters (fertilizer\u002Bmulch-\u003Esupplies).  \n\u003E \n\u003E 4.) Crew capacities of the inflatables.  Should they be usable as space-hotels (\u003E10 capacity), or intended as long-term habitation for smaller crews (e.g. perhaps 10 crew for even the largest torus)?  I\u0027m leaning towards smaller crew capacities per-part.  I rarely use more then 4-6 crew on a mission, and even if I did, I could/would include multiple different habs and other parts with more seats.  \n\u003E \n\u003E 5.) Usable storage volume.  Even at \u003C10% storage volume, some of those inflatables will end up with several hundred thousand EC in a stock setup (~500,000 on the largest torus at current balance).  How much of the volume of these modules should be dedicated to storage?\n\u003E \n\nI have been trying to answer this for two days but I am been quite busy lately. I hope i didn\u0027t miss the bus.\n\n1: I like the idea of largest centrifuge being rigid/metallic. I would have like small rigid deployable centrifuge that are not torus but its all good. Can I suggest non torus for the large part? Cylinder would do, but fancy centrifuge like the 2010 Leonov would be intresting as well. Inflatable habitat might be innovative, but they are not magic, there is plenty of scenario where rigid part are preferable. As a exemple I suspect that your centrifuge will end up on interplanetry ship more often then on station, so there\u0027s that.\n\n2: Torus should be relatively heavy compare to their capacity regardless of rigid/inflatable. There is much more surface on a torus than on a balloon like bigalow. If you decide to go for non-torus like cylinder for larger part, then there would be some opportunity to have a lesser mass/volume ratio. So they might still be heavy but give a nice bonus compared to a larger number of smaller part.\n\n3: Yes for greenhouse, but no window please! It doesn\u0027t make any sence to have windows on anything in space anyway. About habitat and greenhouse sharing the same part, see the next point.\n\n4: A station/Interplanetary Starship will never have the crew dencity of airliner or luxurious room of a ocean liners, regardless if its a space hotel. they will more likely have a compact barrack or pack of small room and the rest will be fonctionality/labs/storage space. A ratio of space dedicated to bedsroom of about 20% seem resonable, Having said that, Kerbalism use the number of empty seats to calculate confort. I have a suggestion regarding this. If you design a habitat with 6 beds, put extra seats around a table and other utility location. The stock limit would be 6, but it would allow user to tweak capacity and go for a high dencity crew rotation setup if they wish. It would also allow you to design a single IVA that fit multiple custom fonction without looking too weird. \n\n5: I think small one should have almost none outside of their fonction. Large one should have allot of free space.\n\nThanks for your nice work!\n\n**Edited \u003Ctime datetime=\u00222016-08-24T23:48:55Z\u0022 title=\u002208/24/2016 11:48  PM\u0022 data-short=\u00227 yr\u0022\u003EAugust 24, 2016\u003C/time\u003E by RedParadize**"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2016-08-24T23:49:32Z","Content":"\u003E \n\u003E \n\u003E 48 minutes ago, blowfish said:\n\u003E \n\u003E \n\u003E Huh.  I meant I thought that the standard .mu export would work with custom shaders on the model but that asset bundles would be necessary to load the shaders themselves ... is this not the case?\n\u003E \n\nOhh, yes, I believe you are correct there.  The shaders should be able to be loaded through AssetBundles, or alternatively you used to be able to compile them at run-time through plugin code (and whatever file reading you wanted to use), but I\u0027m unsure if that is still the case.  I\u0027ve honestly never tried loading a custom shader in KSP and only know the bits of info I\u0027ve encountered browsing the forums/development threads.\n\nI thought you were talking about needing to load the models-using-custom-shaders through AssetBundles, which is what I was a bit hesitant towards.\n\n\u003E \n\u003E \n\u003E 42 minutes ago, SpaceBadger007 said:\n\u003E \n\u003E \n\u003E [@Shadowmage](https://forum.kerbalspaceprogram.com/index.php?/profile/138730-shadowmage/) was there a change to make everything have a max diameter value of 3.125m in the latest update? this is in sandbox mode.\n\u003E \n\nNo, but apparently there is a bug where if you load a career game and then go into sandbox mode, the tech-limits from the career game will still be enforced even in sandbox mode.\n\nTry a clean start of KSP and then directly into sandbox mode (if you weren\u0027t already).  If the tech-limits are still in-place under those conditions, please let me know as that would be an additional bug that has not yet been reported/encountered.\n\n\u003E \n\u003E \n\u003E 58 minutes ago, Domfluff said:\n\u003E \n\u003E \n\u003E Roverdude\u0027s Akademy part (UKS) has 12 crew, of which two can be scientists in the lab (and the lab has larger data/science storage, but that\u0027s neither here nor there)  \n\u003E   \n\u003E \n\u003E No idea how it decides which crew use, mind you.  \n\u003E   \n\u003E \n\u003E Part .cfg:\n\u003E \n\nInteresting... I\u0027ll have to play around with that a bit.  I always thought that the \u0027crewRequired\u0027 specified the -minimum- number in order to press the \u0027start processing\u0027 button... but could be wrong on that. (the stock lab has zero listed in that field / default for the field is zero).\n\nThanks for the find... if that works out it may solve a couple of the compromises that I was going to have to put in place.\n\n\u003E \n\u003E \n\u003E 4 hours ago, tater said:\n\u003E \n\u003E \n\u003E [@Shadowmage](https://forum.kerbalspaceprogram.com/index.php?/profile/138730-shadowmage/), parts are looking awesome. I totally get the EPL thing, it is a simplification that I really like, I just never liked the actual parts in that mod... I didn\u0027t know about the check for how it spawns the craft, either, which avoids what I thought was a problem (which isn\u0027t).\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Regarding the science labs, that\u0027s too bad, as the large stations would obviously have room. I suppose that there could be small lab parts designed with attachment to the hub in mind. \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Here\u0027s an idea. Imagine you make a new adapter shape for the hubs. Call it \u0022Lab-like.\u0022 It\u0027s a cylinder, of the torus hub\u0027s base diameter, and a couple meters high. It is not a lab, it does nothing, it\u0027s an adapter. Make a copy of the adapter as a stand alone part, it\u0027s an actual lab. Give it 2 seats, and lab functionality. The larger the torus, the larger the lab adapter. You slap that on one side, and if you want symmetry, you use the adapter part on the other side. Maybe the -H torus could have a larger hub than even it would with an inflatable, so the lab is even bigger in diameter. The idea is the smallest way to add lab functionality, and larger tori (meaning larger diameter matching lab parts) could have more capability (science storage, etc).\n\u003E \n\nAye, I\u0027ve never personally liked the \\_models\\_ in EPL either -- I\u0027ve always used the MKS/OKS/UKS replacements.   The code and plugin however are pure awesome; well polished with good and continued support, more stable between updates than many other mods, but still with active development and improved features being added.  \n\nRe: science labs -- might be a workable idea; a small selection of add-on lab parts using existing models, configs files are easy enough to put together.  Hopefully the bit of info above ^^^ will make all of that uneccessary though ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022)\n\n\u003E \n\u003E \n\u003E 15 hours ago, StickyScissors said:\n\u003E \n\u003E \n\u003E Finally got my GPU issue sorted out, here\u0027s some testing screenshots. They have to do with beautification mods more than anything, but who cares, they -do- at least have one part from SSTU.\n\u003E \n\nNice pics ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022)\n\nGlad you got it sorted out and hopefully it was just the faulty GPU.  Its never fun having to guess which component needs replaced/fixed or if there some other incompatibility in play, and wait for days/weeks for parts to get there, -hoping- the whole time that it was the right bit you ordered."},{"CreatedByName":"RedParadize","CreatedById":129285,"CreatedDateTime":"2016-08-25T00:00:56Z","Content":"\u003E \n\u003E \n\u003E 4 minutes ago, Shadowmage said:\n\u003E \n\u003E \n\u003E Aye, I\u0027ve never personally liked the \\_models\\_ in EPL either -- I\u0027ve always used the MKS/OKS/UKS replacements.   The code and plugin however are pure awesome; well polished with good and continued support, more stable between updates than many other mods, but still with active development and improved features being added.  \n\u003E   \n\u003E \n\u003E Re: science labs -- might be a workable idea; a small selection of add-on lab parts using existing models, configs files are easy enough to put together.  Hopefully the bit of info above ^^^ will make all of that uneccessary though ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022)\n\u003E \n\nI forgot about the EPL thing. Its just that I think EPL is a tad \u003Cabbr title=\u0022Original Post(er). The first post in a thread, or the person who posted it.\u0022\u003EOP\u003C/abbr\u003E... I would have enjoyed if another option would have been available. Like carrying a core part, then transfering X amount of rocket part resource and BAM, you have a huge centrifuge.  Again its all good, at worst it will be a verry challenging lunch! That will be fun."},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-08-25T00:09:16Z","Content":"Given the numerous issues with career mode, a good deal of role play is required anyway. Heck, minus EPL (which I will certainly give a new look to), I\u0027d launch the right tonnage, then hyperedit the torus there, and delete the deadweight tonnage. \n\nI saw a mod that uses the EPL stuff, but is a parts free version, maybe I\u0027ll try that.\n\n**Edited \u003Ctime datetime=\u00222016-08-25T01:23:27Z\u0022 title=\u002208/25/2016 01:23  AM\u0022 data-short=\u00227 yr\u0022\u003EAugust 25, 2016\u003C/time\u003E by tater**"},{"CreatedByName":"JoseEduardo","CreatedById":127759,"CreatedDateTime":"2016-08-25T00:51:44Z","Content":"had some fun today trying to make a one part SM, and thanks to [@Shadowmage](https://forum.kerbalspaceprogram.com/index.php?/profile/138730-shadowmage/) it has integrated working solar panels ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif \u0022:D\u0022)  \n  \n[http://imgur.com/a/CY6Q4](http://imgur.com/a/CY6Q4)  \n\nI mixed the SDHI service module, BDB\u0027s Docking light, NearFutureSolar circular panels and SSTU fairing (not shown in the pics), HGA and \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E together, left the engine to be a separate part and added a toggleable interstage node to it just so I could use any engine with it and have the petal adapter attach to the right position, I also arranged the parts so it would resemble the ETS Apollo ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif \u0022:P\u0022)  \n\nhad way more fun doing this than my last 20 hours of No Man\u0027s Sky ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022)  \n\nEDIT: here\u0027s the part file just in case anyone wants to use it or use it as basis for their own creation: [https://dl.dropboxusercontent.com/u/58212317/SSTU-SC-B-SM2.cfg](https://dl.dropboxusercontent.com/u/58212317/SSTU-SC-B-SM2.cfg)  \n\n(I used ubiozur welding at first, but then I had to fix it myself, so this was made importing the .mu files in blender, getting their positioning from there and adjusting manually... in the end there\u0027s just the first five lines of the file remaining from the original welding)\n\n**Edited \u003Ctime datetime=\u00222016-08-25T01:57:08Z\u0022 title=\u002208/25/2016 01:57  AM\u0022 data-short=\u00227 yr\u0022\u003EAugust 25, 2016\u003C/time\u003E by JoseEduardo**"}]}