{"TopicId":117090,"ForumId":36,"TopicTitle":"[WIP][1.8.x] SSTULabs - Low Part Count Solutions (Orbiters, Landers, Lifters) - Dev Thread [11-18-18]","CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2015-07-28T18:13:57Z","PageNum":280,"Articles":[{"CreatedByName":"Jimbodiah","CreatedById":152759,"CreatedDateTime":"2017-10-15T15:35:49Z","Content":"\n\u003Cp\u003E\n\u003Cimg alt=\u0022:o\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/ZNGIcon2.png\u0022 title=\u0022:o\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Temeter","CreatedById":58056,"CreatedDateTime":"2017-10-16T02:46:04Z","Content":"\n\u003Cp\u003E\nHeh, is shadowmage pushing boundaries again?\n\u003C/p\u003E\n\u003Cp\u003E\nI wonder what the performance impact is, though.\n\u003C/p\u003E\n"},{"CreatedByName":"vossiewulf","CreatedById":179033,"CreatedDateTime":"2017-10-16T03:51:46Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223196164\u0022 data-ipsquote-contentid=\u0022117090\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221508121964\u0022 data-ipsquote-userid=\u002258056\u0022 data-ipsquote-username=\u0022Temeter\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Temeter said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHeh, is shadowmage pushing boundaries again?\n\u003C/p\u003E\n\u003Cp\u003E\nI wonder what the performance impact is, though.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nPossibly a bit on the memory front but otherwise it shouldn\u0027t slow down rendering. Considering the insanely low number of polys being rendered at their highest LOD in any KSP scene, the rendering pipeline has to be a minority fraction of the time being taken to render frames.\n\u003C/p\u003E\n"},{"CreatedByName":"vossiewulf","CreatedById":179033,"CreatedDateTime":"2017-10-16T07:27:56Z","Content":"\n\u003Cp\u003E\nHere ya go, logo for the new release. Some people will get it \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://imgur.com/CyLPXd9\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/CyLPXd9l.jpg\u0022 class=\u0022ipsImage\u0022 alt=\u0022CyLPXd9l.jpg\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2017-10-16T13:04:01Z","Content":"\n\u003Cp\u003E\nLol. Does that make us space hipsters?\n\u003C/p\u003E\n"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2017-10-16T15:17:29Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223196164\u0022 data-ipsquote-contentid=\u0022117090\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221508121964\u0022 data-ipsquote-userid=\u002258056\u0022 data-ipsquote-username=\u0022Temeter\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 hours ago, Temeter said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHeh, is shadowmage pushing boundaries again?\n\u003C/p\u003E\n\u003Cp\u003E\nI wonder what the performance impact is, though.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWho, me?  I would never....\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223196187\u0022 data-ipsquote-contentid=\u0022117090\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221508125906\u0022 data-ipsquote-userid=\u0022179033\u0022 data-ipsquote-username=\u0022vossiewulf\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 hours ago, vossiewulf said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nPossibly a bit on the memory front but otherwise it shouldn\u0027t slow down rendering. Considering the insanely low number of polys being rendered at their highest LOD in any KSP scene, the rendering pipeline has to be a minority fraction of the time being taken to render frames.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIndeed, performance impact should be minimal / negligible.  This is the Unity \u0027Standard\u0027 shader after all -- it is intended to work even on mobile (though with fewer features/simpler rendering); even now the models used in KSP are relatively simple, and the textures fairly low resolution.  The only bit that is being done...outside..the normal Unity graphics pipeline is the reflection probe updates, and those have to be updated one way or another. \n\u003C/p\u003E\n\u003Cp\u003E\nHowever one thing that I will be doing before I officially change over to the new shader is some mass-testing / performance limit testing.  Find out exactly how it compares to the recoloring shader, and how they both compare vs. the simple KSP shaders;  both with and without Scatterer/etc.  Another thing that I\u0027ll likely implement is some in-game settings to control the quality of the reflections / frequency of updates, including an option for \u0027static\u0027 (so there should be no run-time impact for reflection updates).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nOn the Scatterer note -- still not quite working well with it yet.  Scatterer does some... strange... things regarding rendering of its special features;  it renders them in screen-space as a post-processing effect.  Which is all good and fine... until you change the camera you are rendering from (for updating reflections), without updating the camera-basis transform for the screen-space translation.  So my reflection camera ends up rendering the ocean/sky effects in the position they would be if the refl camera was the main KSP camera.  Except the skybox/atmosphere... that is rendered traditionally.\n\u003C/p\u003E\n\u003Cp\u003E\nBit of a mess... but I\u0027m pretty sure I\u0027ll be able to sort it out to at least disable the extra renders during reflection updating.  -Ideally- I would be able to link into scatterer and update its screen-space transforms/matrix on a per-reflection-cube face basis, and render the scatterer ocean and etc directly into the reflections.  If I was a bit more familiar with the low-level rendering hacks that are in use it would be done already.  Will be taking it up in the Scatterer thread to see if anyone there has any ideas / see if the author has a minute to chat (last I checked though he was \u003Cabbr title=\u0022Missing in action\u0022\u003EMIA\u003C/abbr\u003E from the forums).\n\u003C/p\u003E\n\u003Cp\u003E\nHmm... looks like there is some hard-coded support for fixing reflections for TextureReplacer.  (\u003Ca href=\u0022https://github.com/LGhassen/Scatterer/commit/dea51546c8fb58e97ddc2d10860a0301cb5a5110\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/LGhassen/Scatterer/commit/dea51546c8fb58e97ddc2d10860a0301cb5a5110\u003C/a\u003E) I can probably hook into those and make it all work simply by naming my camera \u0027TRReflectionCamera\u0027.   (WTB proper inter-mod API capability)  Will have to talk to blackrack about getting a proper API-based/mod-agnostic setup for that function.  Seems like there should be a very simple toggle to turn the post-processing on/off via external code (well... technically... scatterrer should check what camera is being rendered before applying post-processing; and this whole issue would be a non-issue).  And ideally, there would be the option to include the ocean and other effects into the reflections (though I can see that being expensive; as it is done as a post-processing effect, the entire setup would have to be redone for each face of the reflection cube).  Perhaps that can be a long-term integration goal.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nUp next will be looking at \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E clouds.  Really not sure where to begin on that one.  As with scatterer, I\u0027ll have to do a bit of digging into the code to see how best to handle it.  I\u0027m really hoping that it is done in a bit of a more traditional rendering setup (e.g. using meshes/particles/objects/whatever), as I\u0027m already familiar with how to handle those types of setups.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Temeter","CreatedById":58056,"CreatedDateTime":"2017-10-16T16:41:31Z","Content":"\n\u003Cp\u003E\nNeat to hear! Idk about performance, so I was wondering about draw calls \u0027n trash \u0027n stuff...\n\u003C/p\u003E\n\u003Cp\u003E\nBut crazy to think about it. With Unreal 2 I was shocked how round those rooms were, now I\u0027m getting told those neat, physics based shaders are cheap mobile stuff \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWhen you got an UI and wanna performance testing, you could also give us a test git-fork version so we\u0027d report back issues if that\u0027s helpful^^\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-10-16T17:51:22Z\u0022 title=\u002210/16/2017 05:51  PM\u0022 data-short=\u00226 yr\u0022\u003EOctober 16, 2017\u003C/time\u003E by Temeter\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Jimbodiah","CreatedById":152759,"CreatedDateTime":"2017-10-17T01:57:56Z","Content":"\n\u003Cp\u003E\nGiving a new meaning to \u0022crash test dummies\u0022  :)))\n\u003C/p\u003E\n"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2017-10-17T02:01:03Z","Content":"\n\u003Cp\u003E\nScatterer works with the bit of a hack I posted above.  Only works from in-atmo; while in-orbit the atmosphere scatter is not rendered.  Due to how scatterer works, it would require support on the scatterer end of things (re-setup and re-render the scene from the 6 directions, adjusting the screen-space setup accordingly).  Will look into it further after more research on if the system itself will be viable and something that I\u0027m going to use.  The important part is that it is generally artifact-free -- most things will not be very reflective or have rougher reflections where minor imperfections in the environment map will not be visible.\n\u003C/p\u003E\n\u003Cp\u003E\nScatterer sunrise, in reflection (also with some eve clouds...):\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022AlCZ846.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/AlCZ846.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAlso got the local-space \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E cloud reflections all figured out (removed the ugly terrain \u0027shadows\u0027).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Jq1RN6h.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/Jq1RN6h.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSo in-atmo effects are working quite well.  Apparently scaled-space / on-orbit views are going to be a bit more difficult, but what is already working is quite nice.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nStill a bit more work to determine if all of this will even be viable in the long term.  Need to do some code cleanup/optimization, try out more textures/materials, and lots and lots of testing (performance, edge-case, etc).\n\u003C/p\u003E\n"},{"CreatedByName":"Jimbodiah","CreatedById":152759,"CreatedDateTime":"2017-10-17T02:08:18Z","Content":"\n\u003Cp\u003E\nI tend not to use scatterer anymore as it borks up more than it enhances. Misty skies would be nice if half the sky was not glitching as hell, or the ocean disappearing etc. And I\u0027ve not seen any hints at fixing this stuff for ages, a real shame as together with \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E this was the most awesome visual enhancement in the game.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-10-17T02:18:58Z\u0022 title=\u002210/17/2017 02:18  AM\u0022 data-short=\u00226 yr\u0022\u003EOctober 17, 2017\u003C/time\u003E by Jimbodiah\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kuldaralagh","CreatedById":168858,"CreatedDateTime":"2017-10-17T02:34:13Z","Content":"\n\u003Cp\u003E\nHey guys, I was building a space station and I realized the docking ports are not cls compatible. I can put one of those hub endings, but the docking ports I attach to it are not compatible. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nMy quick fix, I just went to the general structure parts cfgs, found port 1 and added the cls module making it passable and attachable too, I guess. \n\u003C/p\u003E\n\u003Cp\u003E\nAnyway,  it worked perfectly after that, so I thought i would leave you a heads up. And maybe you might want to add that to that part at least on the next update.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you need any more details on what I did, (but I doubt that cause you guys are clearly more in the know than I am) i could post the config file I changed somewhere for your appreciation. \n\u003C/p\u003E\n\u003Cp\u003E\nCheers. And this mod is great btw.\n\u003C/p\u003E\n\u003Cp\u003E\nAllows me to do great things in ksp and keep my part count ridiculously low.\n\u003C/p\u003E\n\u003Cp\u003E\nThanks a lot.\n\u003C/p\u003E\n"},{"CreatedByName":"Jimbodiah","CreatedById":152759,"CreatedDateTime":"2017-10-17T14:47:53Z","Content":"\n\u003Cp\u003E\nMaybe you can do a PR on github for the CLS patch?\n\u003C/p\u003E\n"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2017-10-17T16:15:28Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223196898\u0022 data-ipsquote-contentid=\u0022117090\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221508206098\u0022 data-ipsquote-userid=\u0022152759\u0022 data-ipsquote-username=\u0022Jimbodiah\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n19 hours ago, Jimbodiah said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI tend not to use scatterer anymore as it borks up more than it enhances. Misty skies would be nice if half the sky was not glitching as hell, or the ocean disappearing etc. And I\u0027ve not seen any hints at fixing this stuff for ages, a real shame as together with \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E this was the most awesome visual enhancement in the game.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIf I had a bit more time on my hands I would highly consider it.  The fundamentals of both mods are pretty simple; the implementations a bit of a mess though.  The atmo bit of Scatterer is pretty much screen-space fog, using some special functions to calculate the color and depth (the ocean stuff is a bit more complex).  Eve clouds are essentially just a textured sphere overlaid onto the planet (more to it than that, but that is the base of it).  Those two bits I could probably replicate and get working without too much difficulty.  The other functions though would require a bit more effort to get functional.\n\u003C/p\u003E\n\u003Cp\u003E\nEven as it stands I\u0027ll likely be putting in some PRs to both in order to accomplish better (higher performance, better looking) integration with the reflection rendering.  Nothing major, just a few accessibility changes, but should make everything run smoother.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nToday I\u0027m starting work on setting up the \u0027optimized\u0027 reflection handling code.  This will be a single central class that is responsible for updating the reflection textures for all parts/vessels on a scene, handling changes in functionality due to config options (update frequency, texture size), and managing the camera update functions.  Once this is in place and working, I\u0027ll look into doing some performance testing to see how it all lines up compared to existing KSP and SSTU shaders.  Will be doing testing on both my desktop for high-spec test (GTX970, 24g ram, \u003Ca href=\u0022/cdn-cgi/l/email-protection\u0022 class=\u0022__cf_email__\u0022 data-cfemail=\u0022036a3643372d36646b79\u0022\u003E[email\u0026#160;protected]\u003C/a\u003E), and on my laptop for a low-spec test (GTX940MX, 8g ram, dual core \u003Ca href=\u0022/cdn-cgi/l/email-protection\u0022 class=\u0022__cf_email__\u0022 data-cfemail=\u00228ae3bfcab9a4b8ede2f0\u0022\u003E[email\u0026#160;protected]\u003C/a\u003E).  If this all goes well, I will see about putting together a performance testing pack to make available for download, and try to get some performance data from whomever is interested in helping to test it.\n\u003C/p\u003E\n\u003Cp\u003E\nInitially I\u0027m going to set the reflections up to be on a \u0027per-vessel\u0027 basis, and reflect only the surrounding scenery (no other vessels / parts).  Updating of the reflection texture will likely be done once per-second (~60 frames); when used as an environment map, that will be plenty for most materials (mirror-like materials could benefit from up-to real-time updating, if the system is capable of it). \n\u003C/p\u003E\n\u003Cp\u003E\nCurrently I have the reflections updating in real-time (every frame), and there is no noticeable performance drop on my desktop from updating of the reflection cubemap when testing on very simple craft at low/medium cube resolution (256x) (even with Eve/Scatterer in place, steady 60fps).  I would imagine that the performance hit will be minor, and that performance will still be far more limited by part-count and collider-complexity than it is by the rendering pipeline (even if you double the rendering time, it will still be minor compared to the physics update time).\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nGeneral development news:\n\u003C/p\u003E\n\u003Cp\u003E\nNot much.  Have been playing with shaders too much the last week to accomplish much else.  There were a couple new issues opened on GitHub this week though, and I\u0027m going to try to find time to get those fixed up.  Continuing deliberations on how to clean up the career mode progression and might have a few more tech-tree updates coming as well.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223196907\u0022 data-ipsquote-contentid=\u0022117090\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221508207653\u0022 data-ipsquote-userid=\u0022168858\u0022 data-ipsquote-username=\u0022Kuldaralagh\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n19 hours ago, Kuldaralagh said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHey guys, I was building a space station and I realized the docking ports are not cls compatible. I can put one of those hub endings, but the docking ports I attach to it are not compatible. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nMy quick fix, I just went to the general structure parts cfgs, found port 1 and added the cls module making it passable and attachable too, I guess. \n\u003C/p\u003E\n\u003Cp\u003E\nAnyway,  it worked perfectly after that, so I thought i would leave you a heads up. And maybe you might want to add that to that part at least on the next update.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you need any more details on what I did, (but I doubt that cause you guys are clearly more in the know than I am) i could post the config file I changed somewhere for your appreciation. \n\u003C/p\u003E\n\u003Cp\u003E\nCheers. And this mod is great btw.\n\u003C/p\u003E\n\u003Cp\u003E\nAllows me to do great things in ksp and keep my part count ridiculously low.\n\u003C/p\u003E\n\u003Cp\u003E\nThanks a lot.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nPlease open up an issue ticket on the subject, or preferably a PR with the necessary changes in place.\n\u003C/p\u003E\n\u003Cp\u003E\nAs I don\u0027t personally use CLS it is not going to be a very high priority, so if you would like a fix sooner-rather-than-later, a PR would be the way to go.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-10-17T21:45:56Z\u0022 title=\u002210/17/2017 09:45  PM\u0022 data-short=\u00226 yr\u0022\u003EOctober 17, 2017\u003C/time\u003E by Shadowmage\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2017-10-17T21:47:31Z","Content":"\n\u003Cp\u003E\nSketchfab embed testing....\n\u003C/p\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022480\u0022 width=\u0022640\u0022\u003E\u003C/iframe\u003E\n\u003Cp style=\u0022font-size:13px;font-weight:normal;margin:5px;color:#4A4A4A;\u0022\u003E\n\u003Ca href=\u0022https://sketchfab.com?utm_medium=embed\u0026amp;utm_source=website\u0026amp;utm_campain=share-popup\u0022 rel=\u0022\u0022 style=\u0022font-weight:bold;color:#1CAAD9;\u0022\u003ESketchfab\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022font-size:13px;font-weight:normal;margin:5px;color:#4A4A4A;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022font-size:13px;font-weight:normal;margin:5px;color:#4A4A4A;\u0022\u003E\nShows up in the text-box fine....\n\u003C/p\u003E\n\u003Cp style=\u0022font-size:13px;font-weight:normal;margin:5px;color:#4A4A4A;\u0022\u003E\nBut disappears after I hit \u0027post\u0027\n\u003C/p\u003E\n\u003C/div\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-10-17T21:47:45Z\u0022 title=\u002210/17/2017 09:47  PM\u0022 data-short=\u00226 yr\u0022\u003EOctober 17, 2017\u003C/time\u003E by Shadowmage\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Temeter","CreatedById":58056,"CreatedDateTime":"2017-10-17T22:14:48Z","Content":"\n\u003Cp\u003E\nYou gotta love when linked stuff does that.\n\u003C/p\u003E\n\u003Cp\u003E\nThe link below doesn\u0027t work, though. Looks like a generic popup thing:\n\u003C/p\u003E\n\u003Cpre class=\u0022ipsCode prettyprint lang-html prettyprinted\u0022\u003E\n\u003Cspan class=\u0022pln\u0022\u003Ehttps://sketchfab.com/?utm_medium=embed\u0026amp;utm_source=website\u0026amp;utm_campain=share-popup\u003C/span\u003E\u003C/pre\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2017-10-17T22:16:52Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223197446\u0022 data-ipsquote-contentid=\u0022117090\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221508278488\u0022 data-ipsquote-userid=\u002258056\u0022 data-ipsquote-username=\u0022Temeter\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nJust now, Temeter said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYou gotta love when linked stuff does that.\n\u003C/p\u003E\n\u003Cp\u003E\nThe link below doesn\u0027t work, though. Looks like a generic popup thing:\n\u003C/p\u003E\n\u003Cpre class=\u0022ipsCode prettyprint lang-html prettyprinted\u0022\u003E\n\n\u003Cspan class=\u0022pln\u0022\u003Ehttps://sketchfab.com/?utm_medium=embed\u0026amp;utm_source=website\u0026amp;utm_campain=share-popup\u003C/span\u003E\u003C/pre\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah, that is some link added by the forum software; not sure what it is supposed to be.\n\u003C/p\u003E\n\u003Cp\u003E\nSadly, looks like I\u0027ll have to take this problem back to the devs to see if they have any input on it.  Was supposedly fixed up late last week, but I haven\u0027t had a chance to test it until just now.\n\u003C/p\u003E\n"},{"CreatedByName":"Bottle Rocketeer 500","CreatedById":178766,"CreatedDateTime":"2017-10-17T22:50:19Z","Content":"\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022480\u0022 width=\u0022640\u0022\u003E\u003C/iframe\u003E\n\u003Cp style=\u0022font-size:13px;font-weight:normal;margin:5px;color:#4A4A4A;\u0022\u003E\n\u003Ca href=\u0022https://sketchfab.com?utm_medium=embed\u0026amp;utm_source=website\u0026amp;utm_campain=share-popup\u0022 rel=\u0022\u0022 style=\u0022font-weight:bold;color:#1CAAD9;\u0022\u003ESketchfab\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022font-size:13px;font-weight:normal;margin:5px;color:#4A4A4A;\u0022\u003E\n\u003Cs\u003EWorking just fine for me, \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/138730-shadowmage/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022138730\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/138730-shadowmage/\u0022 rel=\u0022\u0022\u003E@Shadowmage\u003C/a\u003E\u003C/s\u003E Never mind, also having the same problem.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-10-17T22:51:03Z\u0022 title=\u002210/17/2017 10:51  PM\u0022 data-short=\u00226 yr\u0022\u003EOctober 17, 2017\u003C/time\u003E by Bottle Rocketeer 500\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2017-10-17T22:51:34Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223197474\u0022 data-ipsquote-contentid=\u0022117090\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221508280619\u0022 data-ipsquote-userid=\u0022178766\u0022 data-ipsquote-username=\u0022Bottle Rocketeer 500\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 minutes ago, Bottle Rocketeer 500 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cdiv\u003E\n \n\u003Cp style=\u0022font-size:13px;font-weight:normal;margin:5px;color:#4A4A4A;\u0022\u003E\n\u003Ca href=\u0022https://sketchfab.com?utm_medium=embed\u0026amp;utm_source=website\u0026amp;utm_campain=share-popup\u0022 rel=\u0022\u0022 style=\u0022font-weight:bold;color:#1CAAD9;\u0022\u003ESketchfab\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022font-size:13px;font-weight:normal;margin:5px;color:#4A4A4A;\u0022\u003E\nWorking just fine for me, \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/138730-shadowmage/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022138730\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/138730-shadowmage/\u0022 rel=\u0022\u0022\u003E@Shadowmage\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nStrange, not showing up for me in the browser at all.  Note, my post showed up for me fine while in the post-editor, but disappears after I hit \u0027submit\u0027.\n\u003C/p\u003E\n\u003Cp\u003E\nHmm... trying a different browser now....\n\u003C/p\u003E\n\u003Cp\u003E\nEdit:  No difference when trying IE (normally use Firefox).  Have already tagged a dev on it to see if they have any ideas.  The dev who got the feature working successfully added his to a post, so I\u0027m not sure what is going on.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-10-17T22:55:26Z\u0022 title=\u002210/17/2017 10:55  PM\u0022 data-short=\u00226 yr\u0022\u003EOctober 17, 2017\u003C/time\u003E by Shadowmage\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Bottle Rocketeer 500","CreatedById":178766,"CreatedDateTime":"2017-10-17T22:55:08Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/138730-shadowmage/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022138730\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/138730-shadowmage/\u0022 rel=\u0022\u0022\u003E@Shadowmage\u003C/a\u003E I edited the post shortly after, and it doesn\u0027t work in another browser (Edge)\n\u003C/p\u003E\n"},{"CreatedByName":"Kuldaralagh","CreatedById":168858,"CreatedDateTime":"2017-10-18T00:27:26Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223197229\u0022 data-ipsquote-contentid=\u0022117090\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221508256928\u0022 data-ipsquote-userid=\u0022138730\u0022 data-ipsquote-username=\u0022Shadowmage\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, Shadowmage said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nPlease open up an issue ticket on the subject, or preferably a PR with the necessary changes in place.\n\u003C/p\u003E\n\u003Cp\u003E\nAs I don\u0027t personally use CLS it is not going to be a very high priority, so if you would like a fix sooner-rather-than-later, a PR would be the way to go.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI will try, though I have to say I am a bit of a noob when it comes to these things internety.\n\u003C/p\u003E\n\u003Cp\u003E\nI do have a github account though, but i don\u0027t use it at all except for downloading mod files.\n\u003C/p\u003E\n\u003Cp\u003E\nwell, this seems like a good time to learn it. \n\u003C/p\u003E\n\u003Cp\u003E\nEDIT: I\u0027ve just realized my level is Bottle Rocketeer, and I happen to actually be a bottle rocketeer.  spot on.\n\u003C/p\u003E\n\u003Cp\u003E\nEDIT 2: btw, about that noob thing. Is a PR a Pull Request?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-10-18T00:32:23Z\u0022 title=\u002210/18/2017 12:32  AM\u0022 data-short=\u00226 yr\u0022\u003EOctober 18, 2017\u003C/time\u003E by Kuldaralagh\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2017-10-18T00:36:39Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223197536\u0022 data-ipsquote-contentid=\u0022117090\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221508286446\u0022 data-ipsquote-userid=\u0022168858\u0022 data-ipsquote-username=\u0022Kuldaralagh\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 minutes ago, Kuldaralagh said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI will try, though I have to say I am a bit of a noob when it comes to these things internety.\n\u003C/p\u003E\n\u003Cp\u003E\nI do have a github account though, but i don\u0027t use it at all except for downloading mod files.\n\u003C/p\u003E\n\u003Cp\u003E\nwell, this seems like a good time to learn it. \n\u003C/p\u003E\n\u003Cp\u003E\nEDIT: I\u0027ve just realized my level is Bottle Rocketeer, and I happen to actually be a bottle rocketeer.  spot on.\n\u003C/p\u003E\n\u003Cp\u003E\nEDIT 2: btw, about that noob thing. Is a PR a Pull Request?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSorry, yes, PR = Pull Request.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you aren\u0027t already familiar with the PR process, I would suggest simply filing an issue ticket.  Simple issues like that I tend to knock out during downtime at work, so chances are it will be done for the next release.\n\u003C/p\u003E\n"},{"CreatedByName":"Kuldaralagh","CreatedById":168858,"CreatedDateTime":"2017-10-18T00:38:39Z","Content":"\n\u003Cp\u003E\nRoger wilco.\n\u003C/p\u003E\n\u003Cp\u003E\nI guess the feeling I had when looking at that could be called Overwhelmed.\n\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2017-10-18T02:34:00Z","Content":"\n\u003Cp\u003E\nTried the other link solution which is to paste as plain text. No dice.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://sketchfab.com/models/bfe608d9aecf44eb9f790b0984263fc5/embed\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://sketchfab.com/models/bfe608d9aecf44eb9f790b0984263fc5/embed\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-10-18T02:35:27Z\u0022 title=\u002210/18/2017 02:35  AM\u0022 data-short=\u00226 yr\u0022\u003EOctober 18, 2017\u003C/time\u003E by tater\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kalidor","CreatedById":151719,"CreatedDateTime":"2017-10-18T11:46:41Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/138730-shadowmage/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022138730\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/138730-shadowmage/\u0022 rel=\u0022\u0022\u003E@Shadowmage\u003C/a\u003E Having a few problems with the LR81 engine. No sounds and seems to be ignited throughout the flight (see pic)\n\u003C/p\u003E\n\u003Cp\u003E\nRunning SSTU and Jimbodiah\u0027s Patches.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/hVP5S06.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://i.imgur.com/hVP5S06.png\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEdit: \u003Cimg alt=\u0022:/\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/ZNGIcon1.png\u0022 title=\u0022:/\u0022\u003E Reinstalled RealPlume again and everything seems fine. Very strange.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nLove the mod \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-10-18T12:45:57Z\u0022 title=\u002210/18/2017 12:45  PM\u0022 data-short=\u00226 yr\u0022\u003EOctober 18, 2017\u003C/time\u003E by Kalidor\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Jimbodiah","CreatedById":152759,"CreatedDateTime":"2017-10-18T14:41:10Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/151719-kalidor/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022151719\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/151719-kalidor/\u0022 rel=\u0022\u0022\u003E@Kalidor\u003C/a\u003E   As a wise poet once said \u0022It wasn\u0027t me!!!\u0022   \u003Cimg alt=\u0022:sticktongue:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 title=\u0022:sticktongue:\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/168858-kuldaralagh/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022168858\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/168858-kuldaralagh/\u0022 rel=\u0022\u0022\u003E@Kuldaralagh\u003C/a\u003E  CLS issue fixed on github.\n\u003C/p\u003E\n"}]}