{"TopicId":117002,"ForumId":70,"TopicTitle":"KSP seems a little more janky since the latest Patch...","CreatedByName":"Crowdpleaser","CreatedById":79992,"CreatedDateTime":"2015-07-27T19:25:52Z","PageNum":1,"Articles":[{"CreatedByName":"Crowdpleaser","CreatedById":79992,"CreatedDateTime":"2015-07-27T19:25:52Z","Content":"\n\u003Cp\u003EI have to say i have Mechjeb installed and it \u003Cstrong\u003Emight\u003C/strong\u003E be responsible for the following Problems:\u003C/p\u003E\u003Cp\u003EI noticed that my Rockets have a increased tendency to break more randomly. Most of the time i can see why my Rocket explodes. But most annoyingly they \u0022deconstruct\u0022 right before the destination, say while decending on the Mun or some such. Everything is going fine, but suddenly the rocket falls apart. But no explosion. The Parts just... fly apart. At first i thought maybe the Reaction Wheels build up some sort of oscillation wich shake the Rocket apart. But even when i deactivate them all it still happens. As it happens while landing on Duna i had enough and i had to walk away from the Game again. I don\u0027t really know what to do...\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-07-27T19:26:43Z","Content":"\n\u003Cp\u003EF3 menu say anything about it?\u003C/p\u003E\n"},{"CreatedByName":"HoloYolo","CreatedById":138353,"CreatedDateTime":"2015-07-27T19:28:14Z","Content":"\n\u003Cp\u003EThat isn\u0027t Mechjeb. Those are bugs.\u003C/p\u003E\n"},{"CreatedByName":"Crowdpleaser","CreatedById":79992,"CreatedDateTime":"2015-07-27T19:43:22Z","Content":"\n\u003Cp\u003EI\u0027m trying again right now and will post the Results. Maybe I\u0027ll upload a Video with the phenomenon on YouTube and post it here.\u003C/p\u003E\n"},{"CreatedByName":"I_Killed_Jeb","CreatedById":84817,"CreatedDateTime":"2015-07-27T19:53:22Z","Content":"\n\u003Cp\u003EI\u0027ve had some RUD of wings, particularly on final approach to the runway at low altitude/speeds\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-07-27T20:06:20Z","Content":"\n\u003Cp\u003EMoved to modded support, it really shouldn\u0027t be doing that though, as well as the F3 report you might want to check out your output_log in KSPData, it\u0027ll have a lot more info.\u003C/p\u003E\n"}]}