{"TopicId":117020,"ForumId":16,"TopicTitle":"Spaceplane issues in the transsonic region...","CreatedByName":"MaverickSawyer","CreatedById":11952,"CreatedDateTime":"2015-07-27T23:35:54Z","PageNum":1,"Articles":[{"CreatedByName":"MaverickSawyer","CreatedById":11952,"CreatedDateTime":"2015-07-27T23:35:54Z","Content":"\n\u003Cp\u003EI\u0027ve been trying to build a successful SSTO spaceplane in 1.0\u002B, and EVERY. SINGLE. DESIGN. has had issues around the Mach 0.95-1.45 region. I just seem to hit a wall, and I need to use rocket boosters to get through it. I\u0027ve been trying to climb and accelerate at the same time, and I\u0027m usually in the 3-7 km altitude region when I hit the wall.\u003C/p\u003E\u003Cp\u003EThe only thing that\u0027s come remotely close to making it was this:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/eRLhuZX.png\u0022 alt=\u0022eRLhuZX.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EWith this a close second:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/gsn5DW3.png\u0022 alt=\u0022gsn5DW3.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ve done every practical engine combination, without success, so I\u0027m pretty certain it\u0027s an aerodynamics issue I\u0027m not familiar with. Is wing shape a contributing factor? Or am I trying to use wings that are too large?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-28T02:26:36Z\u0022 title=\u002207/28/2015 02:26  AM\u0022 data-short=\u00228 yr\u0022\u003EJuly 28, 2015\u003C/time\u003E by MaverickSawyer\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"I_Killed_Jeb","CreatedById":84817,"CreatedDateTime":"2015-07-27T23:54:22Z","Content":"\n\u003Cp\u003EHere are two really helpful answers from my own recent thread on this\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/129775-SSTO-build-flight-tips-for-0-9-vet?p=2102219\u0026amp;viewfull=1#post2102219\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/129775-SSTO-build-flight-tips-for-0-9-vet?p=2102219\u0026amp;viewfull=1#post2102219\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/129775-SSTO-build-flight-tips-for-0-9-vet?p=2102518\u0026amp;viewfull=1#post2102518\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/129775-SSTO-build-flight-tips-for-0-9-vet?p=2102518\u0026amp;viewfull=1#post2102518\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EUsing those tips I\u0027m back to my old form of designing \u0026amp; flying SSTOs with ease\u003C/p\u003E\n"},{"CreatedByName":"Lighthawk","CreatedById":93927,"CreatedDateTime":"2015-07-28T00:11:51Z","Content":"\n\u003Cp\u003EFirst hunch, you\u0027re starving your engines by climbing too aggressively, so you\u0027re not moving fast enough to shove enough air into your intakes to offset the decreased pressure as you climb. Try right clicking on one of your jet engines after take off and check the thrust level. If it\u0027s steadily dropping, you\u0027re climbing too fast. Pull your nose down and get it to a point where your thrust is slowly climbing as you ascend, and keep nudging the nose down as needed to keep your thrust increasing for as long as you can.\u003C/p\u003E\n"},{"CreatedByName":"Feradose","CreatedById":111211,"CreatedDateTime":"2015-07-28T00:23:29Z","Content":"\n\u003Cp\u003ECool Blackbird lookalike. \u003C/p\u003E\u003Cp\u003ETry leveling out and going faster for a few secons before pulling up at 7-10kms\u003C/p\u003E\n"},{"CreatedByName":"satnet","CreatedById":147366,"CreatedDateTime":"2015-07-28T01:17:04Z","Content":"\n\u003Cp\u003EThe thrust from jet engines now depends on airspeed. If you right click on your engine you\u0027ll see that as you pitch up and down the thrust will vary a little and that as you lose speed it will fall and as you speed up it increases. It also varies with altitude, but you aren\u0027t high enough yet for that to be a major factor. Both of your planes look like they use RAPIERs which have a peak thrust much higher on the velocity curve than other engines. This makes them great high altitude, high speed engines, which is why I use them in most of my post-1.0 planes, but means that if you aren\u0027t careful you can get stuck at an apparent wall when you lose too much speed and you no longer have the thrust to go faster. You need to either pick up speed before climbing or add an engine that peaks at a lower velocity to give you a boost. Don\u0027t climb too aggressively unless you have a lot of excess velocity/thrust (too aggressive depends on your plane, but usually 5-10 degrees above prograde is my rule of thumb below 10 km). If you start to lose thrust and airspeed you can point prograde and build it back up. This works even if you lose altitude as long as you don\u0027t fall too far and you pull up slowly because you\u0027ll maintain most of the speed you gained which will give you the thrust to push through. Alternatively adding a Turbo RamJet is a very easy way to get plenty of thrust in the low altitude, low speed portion of your flight, but means extra weight and air intake requirements.\u003C/p\u003E\u003Cp\u003EAlso drag and weight are extremely important factors. Yours look reasonably aerodynamic. They look like they might be a little heavy, particularly with just two RAPIERs, but I tend to try to design my SSTOs as light as possible which may give me a bias. You can probably get away with less wing area, but your designs are still fairly reasonable.\u003C/p\u003E\u003Cp\u003EThe posts pointed out by I_Killed_Jeb are good specific examples how to design planes and ascent profiles that work. SSTOs are so varied it is good to know why things like this are necessary so you can accommodate them in your design or ascent profile when they don\u0027t quite match up with specific examples.\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-07-28T01:26:13Z","Content":"\n\u003Cp\u003EMaverickSawyer,\u003C/p\u003E\u003Cp\u003E Both of those spaceplanes look underpowered to me.\u003C/p\u003E\u003Cp\u003EYou should keep your takeoff weight under 20t per turbojet and under 17t per rapier.\u003C/p\u003E\u003Cp\u003EYour wing loading looks fine, but I\u0027d recommend not using deltas as your primary lifting surface. their parasitic drag is higher than average. Try the swept wing type b. If you have them unlocked, the shuttle wings are excellent. Plus you can store LF in them, which kills 2 birds with 1 stone.\u003C/p\u003E\u003Cp\u003E Best,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-28T01:31:04Z\u0022 title=\u002207/28/2015 01:31  AM\u0022 data-short=\u00228 yr\u0022\u003EJuly 28, 2015\u003C/time\u003E by GoSlash27\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MaverickSawyer","CreatedById":11952,"CreatedDateTime":"2015-07-28T02:26:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Lighthawk\u0022 data-cite=\u0022Lighthawk\u0022\u003E\u003Cdiv\u003EFirst hunch, you\u0027re starving your engines by climbing too aggressively, so you\u0027re not moving fast enough to shove enough air into your intakes to offset the decreased pressure as you climb. Try right clicking on one of your jet engines after take off and check the thrust level. If it\u0027s steadily dropping, you\u0027re climbing too fast. Pull your nose down and get it to a point where your thrust is slowly climbing as you ascend, and keep nudging the nose down as needed to keep your thrust increasing for as long as you can.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve been running a solid 10-15 degrees pitch hold the entire way. I guess I need to hold the nose down a little more.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kweller\u0022 data-cite=\u0022Kweller\u0022\u003E\u003Cdiv\u003ECool Blackbird lookalike. \u003Cp\u003ETry leveling out and going faster for a few secons before pulling up at 7-10kms\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks. It\u0027s using parts from SuicidalInsanity\u0027s Mk2 expansion pack.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022satnet\u0022 data-cite=\u0022satnet\u0022\u003E\u003Cdiv\u003EThe thrust from jet engines now depends on airspeed. If you right click on your engine you\u0027ll see that as you pitch up and down the thrust will vary a little and that as you lose speed it will fall and as you speed up it increases. It also varies with altitude, but you aren\u0027t high enough yet for that to be a major factor. Both of your planes look like they use RAPIERs which have a peak thrust much higher on the velocity curve than other engines. This makes them great high altitude, high speed engines, which is why I use them in most of my post-1.0 planes, but means that if you aren\u0027t careful you can get stuck at an apparent wall when you lose too much speed and you no longer have the thrust to go faster. You need to either pick up speed before climbing or add an engine that peaks at a lower velocity to give you a boost. Don\u0027t climb too aggressively unless you have a lot of excess velocity/thrust (too aggressive depends on your plane, but usually 5-10 degrees above prograde is my rule of thumb below 10 km). If you start to lose thrust and airspeed you can point prograde and build it back up. This works even if you lose altitude as long as you don\u0027t fall too far and you pull up slowly because you\u0027ll maintain most of the speed you gained which will give you the thrust to push through. Alternatively adding a Turbo RamJet is a very easy way to get plenty of thrust in the low altitude, low speed portion of your flight, but means extra weight and air intake requirements.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI knew about the airspeed and altitude causing thrust changes, but the bit about the thrust curve was a new one for me. And the \u0022wall\u0022 description is spot on. Once I clear Mach 1.45ish, I would shut off whatever booster I was using and would be able to accelerate on jets alone.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022satnet\u0022 data-cite=\u0022satnet\u0022\u003E\u003Cdiv\u003EThey look like they might be a little heavy, particularly with just two RAPIERs, but I tend to try to design my SSTOs as light as possible which may give me a bias.\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GoSlash27\u0022 data-cite=\u0022GoSlash27\u0022\u003E\u003Cdiv\u003EMaverickSawyer,\u003Cp\u003E Both of those spaceplanes look underpowered to me.\u003C/p\u003E\u003Cp\u003EYou should keep your takeoff weight under 20t per turbojet and under 17t per rapier.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGuess I should have added a second pic of the big Mk 4 bird when viewed from in front... It\u0027s got a matching set of engines below the wing for added thrust and to minimize the offset between the center of thrust and the center of mass. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GoSlash27\u0022 data-cite=\u0022GoSlash27\u0022\u003E\u003Cdiv\u003EYour wing loading looks fine, but I\u0027d recommend not using deltas as your primary lifting surface. their parasitic drag is higher than average. Try the swept wing type b. If you have them unlocked, the shuttle wings are excellent. Plus you can store LF in them, which kills 2 birds with 1 stone.\u003Cp\u003E Best,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThose are the B9 procedural wings, actually. and they can be made wet wings, as those ones are. I tend to use the LF/O ones, though, to provide more rocket burn time once it\u0027s been refueled on-orbit.\u003C/p\u003E\u003Cp\u003EAs for the deltas... didn\u0027t know about that. That would certainly explain why the upper craft was having so much trouble. Looks like I\u0027m going to have to go the route of the lower one, then.\u003C/p\u003E\u003Cp\u003EThank you for the tips and ideas, folks. I\u0027m going to go back to the Hangar and see what I can shake out with the new information.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EOkay, going to mark this one as \u0022ANSWERED\u0022 now... Turns out I was underpowered on all my designs. Woefully underpowered. I switched to some MUCH bigger engines and she was supersonic in no time at all.\u003C/p\u003E\n"},{"CreatedByName":"gilflo","CreatedById":62881,"CreatedDateTime":"2015-08-11T07:37:55Z","Content":"\n\u003Cp\u003ETo get more thrust to pass over M 1.45 just add afterburner on your jet engines by using the Kerbokatz small utilities: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/116034-1-0-X-KerboKatz-SmallUtilities-V1-2-2-07-08-2015-Now-with-AutoBalancingLandingLeg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/116034-1-0-X-KerboKatz-SmallUtilities-V1-2-2-07-08-2015-Now-with-AutoBalancingLandingLeg\u003C/a\u003E!\u003C/p\u003E\u003Cp\u003EIf your engines are not in the config file, look at the file, it\u0027s very easy to add an engine.\u003C/p\u003E\n"},{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-08-11T08:42:47Z","Content":"\n\u003Cp\u003EYep, way underpowered for their bulk.\u003C/p\u003E\u003Cp\u003EAlso, Rapiers have a poor performance curve early on. You might add a pair of turbojets - or just push through transsonic to some 400m/s using rockets. Still, I don\u0027t see your Speedbird Heavy reaching orbit with less than 6 engines, more likely 8. Speedbird 1 might do it in 4, but to me it seems it has too much wing area anyway - with so much lifting MK2 surface it really needs token amount of wings - ones so big introduce some serious drag.\u003C/p\u003E\n"}]}