{"TopicId":117090,"ForumId":36,"TopicTitle":"[WIP][1.8.x] SSTULabs - Low Part Count Solutions (Orbiters, Landers, Lifters) - Dev Thread [11-18-18]","CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2015-07-28T18:13:57Z","PageNum":15,"Articles":[{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2015-10-16T17:38:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022davidy12\u0022 data-cite=\u0022davidy12\u0022\u003E\u003Cdiv\u003ESo are you going to make an Ares rocket from Constellation?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot directly, no. But most of the part should already be available for you to build Kerbalized analogues (such as the 5-segment SRB for the Ares I first stage... which is actually my current preferred method for launching the CSM stack; much cheaper than the full liquid-fueled setup). Think I\u0027ve got a pic somewhere....\u003C/p\u003E\u003Cp\u003EAhh, yes, there it is:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/WrGC3S6.png\u0022 alt=\u0022WrGC3S6.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"blowfish","CreatedById":119688,"CreatedDateTime":"2015-10-16T17:54:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Shadowmage\u0022 data-cite=\u0022Shadowmage\u0022\u003E\u003Cdiv\u003EThe ICPS though, has been balanced towards being a dedicated range-extender for the CSM stack to enable Mun/Minmus operation (and is likely useless for any other purpose).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI get that, but I think it\u0027s underpowered even for that purpose. In my testing I recall getting ~700 m/s out of it with the CSM on top, which isn\u0027t even enough for a trans-munar injection. I\u0027d recommend at least increasing the fuel amount to put the delta v at 1200-1500 m/s, which is enough for final circularization around Kerbin (assuming a shallow ascent path) and then a trans-munar or trans-Minimus injection.\u003C/p\u003E\n"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2015-10-16T18:05:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022blowfish\u0022 data-cite=\u0022blowfish\u0022\u003E\u003Cdiv\u003EI get that, but I think it\u0027s underpowered even for that purpose. In my testing I recall getting ~700 m/s out of it with the CSM on top, which isn\u0027t even enough for a trans-munar injection. I\u0027d recommend at least increasing the fuel amount to put the delta v at 1200-1500 m/s, which is enough for final circularization around Kerbin (assuming a shallow ascent path) and then a trans-munar or trans-Minimus injection.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHmm.. something must be off between my balance sheet and the in-game numbers then, as my sheet says it should have ~1050 dV with the CSM mounted. Still probably a bit lower than I would like; however when I had it set higher I would constantly find myself -returning- from the Mun with the ICPS still attached (and full fuel in the SM), or finding myself with the choice to jettison a half-full ICPS or attempt to land it on Minmus (bad idea btw, its too tall and likes to wobble, landing just the CSM is much easier).\u003C/p\u003E\u003Cp\u003EWill take a look at the #s to find out why the balance is off from what is supposed to be. Will also consider increasing its capability slightly, though it likely won\u0027t be in the 1500 m/s range... probably closer to the 1200 range.\u003C/p\u003E\u003Cp\u003EHonestly I should probably just apply stock balancing to it, and up the base dV on the CSM to allow it to perform its own Kerbin-SOI (Mun/Minmus) missions unassisted (Mun/Minmus dV requirements are so laughably low, my 2nd stage usually does most of the insertion burn anyway). As really the ICPS is barely needed as-is, and always will be for any reasonable balance on the CSM. Using stock balance I could repurpose the ICPS as a true upper stage, one that could be used to send the CSM (and possibly small lander) to some of the lower-dV interplanetary destinations.\u003C/p\u003E\u003Cp\u003ETough call....\u003C/p\u003E\n"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2015-10-16T19:02:01Z","Content":"\n\u003Cp\u003ERL-10A-4-2N\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imgur.com/145GzqL.png\u0022 alt=\u0022145GzqL.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ERL-10B-2-1\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imgur.com/5CCtxnO.png\u0022 alt=\u00225CCtxnO.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"_Augustus_","CreatedById":115084,"CreatedDateTime":"2015-10-17T11:07:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Shadowmage\u0022 data-cite=\u0022Shadowmage\u0022\u003E\u003Cdiv\u003ENot directly, no. But most of the part should already be available for you to build Kerbalized analogues (such as the 5-segment SRB for the Ares I first stage... which is actually my current preferred method for launching the CSM stack; much cheaper than the full liquid-fueled setup). Think I\u0027ve got a pic somewhere....\u003Cp\u003EAhh, yes, there it is:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/WrGC3S6.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/WrGC3S6.png\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E Yes, but your J2-X will make it actually possible to make an Ares I.\n"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2015-10-17T15:30:41Z","Content":"\n\u003Cp\u003EHave been working with JoseEduardo over the past couple of days to get RO/RSS/RF/MFT compatibility sorted out, and it looks like things are off to a good start. Jose and StratoChief et. al. have put together a set of MM patches for RO that apply realistic scales, masses, and performance values to most of the Series-B upper stage parts and engine clusters. \u003C/p\u003E\u003Cp\u003EAnd Jose and I spent a good deal of time yesterday getting RealFuels/ModularFuelTank support for the Ship Core customizable fuel tanks (works independent of RO, but was needed for RO compat). So, now you have multiple options for fuel-switching in the tanks depending on how you want to go about it and what mods you have installed.\u003C/p\u003E\u003Cp\u003EThe Real-Fuels compatibility will be available with today\u0027s update. I\u0027m not sure on the timeline on the RO config set, but I believe there was a link posted a few posts back if anyone were interested in trying out the WIP stuff.\u003C/p\u003E\u003Cp\u003EAlso looking into a couple other small bug-fixes and balance changes for this update, but overall it will be a fairly small update (none of the engine stuff is even close to ready for initial testing).\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022_Augustus_\u0022 data-cite=\u0022_Augustus_\u0022\u003E\u003Cdiv\u003EYes, but your J2-X will make it actually possible to make an Ares I.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAhh, yah, point taken. I suppose I should work on getting a few more of these engines finished off then?\u003C/p\u003E\u003Cp\u003EThat is actually my plan for the rest of the weekend I think (after I pack up the release); I think I have a decent enough selection of basic engine geometry that I can begin working on the basics of the next stage (fuel routing, mounting, and gimbals). Hopefully I can pull this off as I am intending to, will be quite the fun little set of parts.\u003C/p\u003E\n"},{"CreatedByName":"davidy12","CreatedById":143411,"CreatedDateTime":"2015-10-17T15:59:22Z","Content":"\n\u003Cp\u003EAbout RO... Are you guys going to add real plume soon?\u003C/p\u003E\n"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2015-10-17T16:04:40Z","Content":"\n\u003Cp\u003EOn the note of balance;\u003C/p\u003E\u003Cp\u003EI\u0027m personally very torn on how to balance the CSM/ICPS stack. It is a hard bit to figure out satisfactorily. On one hand, I want to maintain consistent balance across parts. On the other, I want to custom tailor the parts for their intended purpose, but the differences in mechanics between real life and the KSP world make it difficult.\u003C/p\u003E\u003Cp\u003EI have a few intended routes to investigate (in no particular order):\u003C/p\u003E\u003Cp\u003EOption 1: CSM as Mun/Minmus capable craft, with ICPS for interplanetary\u003C/p\u003E\u003Cp\u003ECSM dV: ~1800\u003C/p\u003E\u003Cp\u003EICPS (with CSM) dV: \u0026gt;3000\u003C/p\u003E\u003Cp\u003ETotal dV: ~4800\u003C/p\u003E\u003Cp\u003EShould allow for CSM to be lifted alone, and perform Mun/Minmus operations unaided. ICPS is balanced for stock, and should be usable as a generic upper stage.\u003C/p\u003E\u003Cp\u003EOption 2: Uhh...no clue what to call this one\u003C/p\u003E\u003Cp\u003ECSM dV: ~900- quite capable on its own, though not quite mun/minmus capable (maybe just barely...)\u003C/p\u003E\u003Cp\u003EICPS dV: ~2400 - semi-balanced for stock, intended to be used heavily for circularization burn, possibly usable as generic upper stage for small payloads\u003C/p\u003E\u003Cp\u003ETotal dV: ~3300\u003C/p\u003E\u003Cp\u003EOption 3: Overpowered for Mun/Minmus, but not quite enough for real interplanetary missions. Basically gives loads of margin for sloppy burns or rescuing lots of kerbals. This is close to how I had it balanced several weeks back. Was very \u0027usable\u0027, but I personally found it a bit OP (but probably should have left it, as it worked fine...).\u003C/p\u003E\u003Cp\u003ECSM dV: ~1050 - not quite enough for an unaided Mun/Minmus mission, but plenty for return-to-kerbin burns \u002B orbital adjustment on the way back (e.g. can return to visit a station on the way home before de-orbit).\u003C/p\u003E\u003Cp\u003EICPS dV: ~1400 - plenty for mun/minmus burn and injection, though perhaps a bit short for allowing it to be used for circularization as well.\u003C/p\u003E\u003Cp\u003ETotal dV: ~2450\u003C/p\u003E\u003Cp\u003EOption 4: Mimic real-life performance, scaled for KSP; ICPS needed for...everything, but ICPS not very capable as its own upper stage.\u003C/p\u003E\u003Cp\u003ECSM dV: ~ 500 (enough for rendezsvous, or return from mun/minmus burn)\u003C/p\u003E\u003Cp\u003EICPS dV: ~1500 (possible small circularization burn, trans-munar insertion, munar orbit insertion)\u003C/p\u003E\u003Cp\u003ETotal dV: ~2000\u003C/p\u003E\u003Cp\u003ECM has mass increased, propellant decreased. ICPS propellant increased; neither is really balanced in regards to stock.\u003C/p\u003E\u003Cp\u003EAny preferences as to the performance of the CM/SM/ICPS parts? Any balance#\u0027s you would like to see in place? I\u0027m pretty open to all of the options I posted, and would even consider examining a few more if anyone has ideas / specific #s they would like to see. I might even see about doing some MM patches for each, and let people choose which balance they want (eventually... still need to decide the standard balance).\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022davidy12\u0022 data-cite=\u0022davidy12\u0022\u003E\u003Cdiv\u003EAbout RO... Are you guys going to add real plume soon?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI believe StratoChief said he would look into it after they finished the initial set of RO configs. So, yes, it sounds likely, but no, I have no idea when.\u003C/p\u003E\n"},{"CreatedByName":"davidy12","CreatedById":143411,"CreatedDateTime":"2015-10-17T16:34:25Z","Content":"\n\u003Cp\u003EGreat to hear!!! Can\u0027t wait to see the plumes hope they come soon \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EOn a side note, the CSM of the Orion is about 1100 m/s. So I\u0027d go with that.\u003C/p\u003E\u003Cp\u003EPS: Another thing that has been bothering me, the bottom engines (4 thrusters around the SPS) are supposed to be high powered RCS thrusters not actual engines.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EAlso the core stage for RO has only 220 m/s of DV when stretched to realistic length.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EAlso, you need to look at the nodes for RO. (Decoupler)\u003C/p\u003E\n"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2015-10-17T16:46:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022davidy12\u0022 data-cite=\u0022davidy12\u0022\u003E\u003Cdiv\u003EGreat to hear!!! Can\u0027t wait to see the plumes hope they come soon \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003Cp\u003EOn a side note, the CSM of the Orion is about 1100 m/s. So I\u0027d go with that.\u003C/p\u003E\u003Cp\u003EPS: Another thing that has been bothering me, the bottom engines (4 thrusters around the SPS) are supposed to be high powered RCS thrusters not actual engines.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EAlso the core stage for RO has only 220 m/s of DV when stretched to realistic length.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EAlso, you need to look at the nodes for RO. (Decoupler)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI do not offer RO support, not really my deal (unless its low-level plugin compatibility stuff). Though JoseEduardo or StratoChief might be able to help you out if you ask nicely. \u003C/p\u003E\u003Cp\u003EOne big thing though, the RF support for the fuel tanks is not publicly available yet (needs plugin update on my end, and MM patches to enable it with the RO stuff), so it likely will not work properly at the moment. \u003C/p\u003E\u003Cp\u003EShould have the compatibility in place on my end with the release later today, and the set of patch configs are still being worked on and finished up.\u003C/p\u003E\n"},{"CreatedByName":"JoseEduardo","CreatedById":127759,"CreatedDateTime":"2015-10-17T18:22:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022davidy12\u0022 data-cite=\u0022davidy12\u0022\u003E\u003Cdiv\u003EGreat to hear!!! Can\u0027t wait to see the plumes hope they come soon \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003Cp\u003EOn a side note, the CSM of the Orion is about 1100 m/s. So I\u0027d go with that.\u003C/p\u003E\u003Cp\u003EPS: Another thing that has been bothering me, the bottom engines (4 thrusters around the SPS) are supposed to be high powered RCS thrusters not actual engines.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EAlso the core stage for RO has only 220 m/s of DV when stretched to realistic length.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EAlso, you need to look at the nodes for RO. (Decoupler)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat will be fixed once the next update comes out, the tanks in the repo aren\u0027t working with the current release, I already submitted a Pull Request with the updated one (which won\u0027t work with the current SSTU version), and we\u0027re just waiting for the SSTU update to have it merged to the repo\u003C/p\u003E\u003Cp\u003EAnd I believe we didn\u0027t look at the decouplers yet in the configs, as Shadowmage said it is a WIP config\u003C/p\u003E\n"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2015-10-17T18:59:53Z","Content":"\n\u003Cp\u003ESweet, that is good news.\u003C/p\u003E\u003Cp\u003EWorking on SRB FX at the moment; have them nearly in line with KW rocketry stuff. The only bit I haven\u0027t figured out is the scaling... apparently stock effects don\u0027t have any support for scaling; and as KW rocketry uses a rescaled model, its effects are scaled in an odd manner without any way to duplicate it on an unscaled model. They are still much improved though, both the sound and visual fx. Might just see about whipping up a custom particle that allows scaling, but I\u0027ll likely save that for another time.\u003C/p\u003E\u003Cp\u003EQuite a few other balance changes, tweaks, and improvements coming for this update as well (if I can get them all done...). Will have a full list later on with the release.\u003C/p\u003E\u003Cp\u003EShould have everything ready here in a couple of hours, maybe less if I quit playing with the FX stuff.\u003C/p\u003E\n"},{"CreatedByName":"JoseEduardo","CreatedById":127759,"CreatedDateTime":"2015-10-17T19:42:13Z","Content":"\n\u003Cp\u003EShadowmage, would it be possible to add in a future update the forward skirt of the SRBs?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://mix.msfc.nasa.gov/IMAGES/HIGH/7776231.jpg\u0022 alt=\u00227776231.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt seems that the 5-segment SRB will also use them\u003C/p\u003E\n"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2015-10-17T20:37:24Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EUpdated test release is available:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://github.com/shadowmage45/SSTULabs/releases/tag/0.2.14-beta\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003Ehttps://github.com/shadowmage45/SSTULabs/releases/tag/0.2.14-beta\u003C/span\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003ESee the link for downloads and full change-log.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EHighlights include:\u003C/p\u003E\u003Cp\u003E RealFuels support for custom fuel tanks (optional, no configs included, see the RO patch set for configs, or ask for instructions)\u003C/p\u003E\u003Cp\u003EBetter FX for the SRBs\u003C/p\u003E\u003Cp\u003ERebalanced SRB thrust (heat/emissives not done yet)\u003C/p\u003E\u003Cp\u003ERebalanced ICPS and CSM stack\u003C/p\u003E\u003Cp\u003EProcedural decoupler now has stats!\u003C/p\u003E\u003Cp\u003EFew other bugfixes\u003C/p\u003E\n"},{"CreatedByName":"blowfish","CreatedById":119688,"CreatedDateTime":"2015-10-19T00:05:34Z","Content":"\n\u003Cp\u003EI had a thought about the SLS upper stages: Rather than attempting to tailor them to specific use cases, why not make them semi-adjustable? The flat ribbed sections look like they could be tiled pretty easily. It might not work perfectly with your stretchable tanks module (particularly since the fairing would have to be adjusted too), but I don\u0027t believe it would require too many changes and most of them would be on the code side rather than the assets side. Just a thought \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlso, is there a usage guide for the lander parts? What\u0027s the midpoint node on all of the fuel tanks for? Both nodes on the decouplers appear to face the same direction - is that intentional? How would I stack things in order to set up multiple stages?\u003C/p\u003E\n"},{"CreatedByName":"Sudragon","CreatedById":53192,"CreatedDateTime":"2015-10-19T11:43:08Z","Content":"\n\u003Cp\u003EWould it also be possible to implement a \u003Cem\u003Edisarm\u003C/em\u003E function on the DPM docking port/parachute module?\u003C/p\u003E\n"},{"CreatedByName":"Monsterlunch","CreatedById":135085,"CreatedDateTime":"2015-10-19T12:19:44Z","Content":"\n\u003Cp\u003EHoly cow. Im stoked. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis is art! Can\u0027t wait to test this as soon as I get home.\u003C/p\u003E\n"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2015-10-19T14:48:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JoseEduardo\u0022 data-cite=\u0022JoseEduardo\u0022\u003E\u003Cdiv\u003EShadowmage, would it be possible to add in a future update the forward skirt of the SRBs?\u003Cp\u003E\u003Ca href=\u0022https://mix.msfc.nasa.gov/IMAGES/HIGH/7776231.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://mix.msfc.nasa.gov/IMAGES/HIGH/7776231.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt seems that the 5-segment SRB will also use them\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESeems like I could add them as nose-cone variants; though I\u0027m a bit unsure as to the purpose? Seems like (for KSP) they would just add some height/mass, but nothing useful?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022blowfish\u0022 data-cite=\u0022blowfish\u0022\u003E\u003Cdiv\u003EI had a thought about the SLS upper stages: Rather than attempting to tailor them to specific use cases, why not make them semi-adjustable? The flat ribbed sections look like they could be tiled pretty easily. It might not work perfectly with your stretchable tanks module (particularly since the fairing would have to be adjusted too), but I don\u0027t believe it would require too many changes and most of them would be on the code side rather than the assets side. Just a thought \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003Cp\u003EAlso, is there a usage guide for the lander parts? What\u0027s the midpoint node on all of the fuel tanks for? Both nodes on the decouplers appear to face the same direction - is that intentional? How would I stack things in order to set up multiple stages?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMy intention on the upper stages is to have them quite configurable, similar to the fuel tanks (may even use the same plugin... undecided). Will know more once I finish up the engine stuff; still a bit too early to start digging into details on these.\u003C/p\u003E\u003Cp\u003ELander Parts - no guide as of yet. Midpoint on tanks is for the decoupler. Yes, they are both suppose to point the same direction, else you could not use them on the tanks properly. Staging for those parts, using the LC decouplers, is an inner-stage/outer-stage affair rather than top/bottom.\u003C/p\u003E\u003Cp\u003EIn order to use the decouplers, take a LC fuel tank and set it to a hollow variant. Add the decoupler to the part on the center node. Add a second (smaller) LC Fuel tank to the node that is on the decoupler (might need to add stuff to the top/bottom nodes of the original fuel tank before it will let you snap stuff). They are omni-decouplers, so it does not matter which stage stays attached to the ship. You can (kind of) see these in use on my Tylo lander example (in the LanderCore Imgur album on the main post).\u003C/p\u003E\u003Cp\u003EHonestly, those things worked out to be a bit more tricky to use than I would have liked, and I\u0027m considering a simplification of the lander core parts to only include the standard solid fuel tanks. Though some of the opportunities they provide are interesting, and I\u0027m not sure I could do some designs without them.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sudragon\u0022 data-cite=\u0022Sudragon\u0022\u003E\u003Cdiv\u003EWould it also be possible to implement a \u003Cem\u003Edisarm\u003C/em\u003E function on the DPM docking port/parachute module?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot sure what you are referring to? Disarm what?\u003C/p\u003E\u003Cp\u003EIt is using stock modules; so if the option is available on the stock docking port or parachute, then yes; otherwise no.\u003C/p\u003E\n"},{"CreatedByName":"JoseEduardo","CreatedById":127759,"CreatedDateTime":"2015-10-19T15:04:37Z","Content":"\n\u003Cp\u003EIDK how this could be done in one single part, but they could be used for parachutes and the nose cone for srb separation, this way if you pick just the nose cone you get srb separation, if you pick both, you get parachutes (useful for career) and srb separation \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2015-10-19T15:38:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JoseEduardo\u0022 data-cite=\u0022JoseEduardo\u0022\u003E\u003Cdiv\u003EIDK how this could be done in one single part, but they could be used for parachutes and the nose cone for srb separation, this way if you pick just the nose cone you get srb separation, if you pick both, you get parachutes (useful for career) and srb separation \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENone of that is doable within a single SRB part. The staging action is already used by the main motor; so you cannot have either parachutes or separators. This is a very low-level stock KSP limitation that I can do nothing to solve.\u003C/p\u003E\n"},{"CreatedByName":"riocrokite","CreatedById":129319,"CreatedDateTime":"2015-10-19T18:51:48Z","Content":"\n\u003Cp\u003Ehey Shadowmage, \u003C/p\u003E\u003Cp\u003EMinor (avoidable) bug occurs when you set your switchable tank as a vessel root part. Upon reload (or relaunch) tank reverts to its original texture and other vessel parts disappear. This doesn\u0027t seem to happen when the part is not a root.\u003C/p\u003E\n"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2015-10-19T19:20:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022riocrokite\u0022 data-cite=\u0022riocrokite\u0022\u003E\u003Cdiv\u003Ehey Shadowmage, \u003Cp\u003EMinor (avoidable) bug occurs when you set your switchable tank as a vessel root part. Upon reload (or relaunch) tank reverts to its original texture and other vessel parts disappear. This doesn\u0027t seem to happen when the part is not a root.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHmm.. that sounds bad. Will add it to the issue tracker and begin investigating for a solution for the next update. Seems there is a different processing/loading order for root parts compared to others, which has caused problems with numerous other mods as well (e.g. tweakscale, procedural parts). Will see what I can do though.\u003C/p\u003E\n"},{"CreatedByName":"riocrokite","CreatedById":129319,"CreatedDateTime":"2015-10-19T20:24:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Shadowmage\u0022 data-cite=\u0022Shadowmage\u0022\u003E\u003Cdiv\u003EHmm.. that sounds bad. Will add it to the issue tracker and begin investigating for a solution for the next update. Seems there is a different processing/loading order for root parts compared to others, which has caused problems with numerous other mods as well (e.g. tweakscale, procedural parts). Will see what I can do though.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYah, it seems to affect only big fuel tanks (which have multiple mesh switches \u002B texture switch). Cabins / lander tanks seem to work ok as a root part.\u003C/p\u003E\n"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2015-10-20T01:25:33Z","Content":"\n\u003Cp\u003EGetting the geometry (initial/basic/rough) for all of these engines in place; nearly done with all that I had listed for the initial set. Going to finish the rough geometry pass for the engines, and then figure out the mounting bit. Hope to move onto the mount geometry perhaps tomorrow, and then onto initial plugin stuff wed/thurs/fri. Aiming to have a decent set of parts(all untextured) to test this weekend for concept development and make sure things are going to work out appropriately.\u003C/p\u003E\u003Cp\u003EHere are the J2 and J2X engines (WIP):\u003C/p\u003E\u003Cp\u003EJ2\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imgur.com/KSLWzLb.png\u0022 alt=\u0022KSLWzLb.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EJ2-X\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imgur.com/1VF7Hci.png\u0022 alt=\u00221VF7Hci.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd first pass at an initial mount setup (will not be keeping this exact geometry, was just playing around seeing how to do them / what they would look like)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imgur.com/Zea3oJT.png\u0022 alt=\u0022Zea3oJT.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"JoseEduardo","CreatedById":127759,"CreatedDateTime":"2015-10-20T01:35:57Z","Content":"\n\u003Cp\u003Ean customizable engine mount like the S-II and S-IVB would be awesome for heavy upper stages \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"}]}