{"TopicId":117090,"ForumId":36,"TopicTitle":"[WIP][1.8.x] SSTULabs - Low Part Count Solutions (Orbiters, Landers, Lifters) - Dev Thread [11-18-18]","CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2015-07-28T18:13:57Z","PageNum":221,"Articles":[{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-11-30T16:54:51Z","Content":"Well, the ports on the DOS-LAB are both occupied by fully docked modules (a lander, and a science experiment module). The DOS only has the 2 ports, top, and bottom. I have an SSTU port on the lander as well (I used the stock lander car in this case because career limited me, but it has an SSTU port on top)."},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2016-11-30T18:31:40Z","Content":"Have created a thread specifically for discussion of the KSPWheel mod/system:\n\n\u003Ciframe data-embedcontent=\u0022\u0022 frameborder=\u00220\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/152782-121-kspwheel-physics-based-alternate-wheel-collider-in-final-beta-testing/\u0026do=embed\u0022\u003E\u003C/iframe\u003E\n\nPlease bring any conversation regarding the wheels over to that thread, to help keep things organized and cleaned up.  It is the proper place to discuss features, balance, or other general discussion about the mod."},{"CreatedByName":"blowfish","CreatedById":119688,"CreatedDateTime":"2016-11-30T18:44:24Z","Content":"\u003E \n\u003E \n\u003E 2 hours ago, Shadowmage said:\n\u003E \n\u003E \n\u003E I don\u0027t think that would really allow for the combination of control surfaces.  As the control surface modules use drag-cubes and interpolate between them, the two control modules would interfere with each other and you would get an indeterminate drag state.  (I think they use physics addForce to apply their control forces, but also lerp between drag cubes for deployed and neutral states).\n\u003E \n\nHuh, looks like you\u0027re right.  I hadn\u0027t noticed that before.  I guess they use the coefficients for induced drag, but regular drag cubes for regular parasitic drag.  Oh well."},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-12-01T15:46:19Z","Content":"![Tech-Space.png?1469778902](http://m.aviationweek.com/site-files/aviationweek.com/files/imagecache/galleryformatter_slide_penton/gallery_images/Tech-Space.png?1469778902)\n\nFrom aviation week... thought it relevant."},{"CreatedByName":"Jimbodiah","CreatedById":152759,"CreatedDateTime":"2016-12-01T15:51:34Z","Content":"How do you counterbalance for a person moving inside the smaller tori in the real world?"},{"CreatedByName":"APlayer","CreatedById":171406,"CreatedDateTime":"2016-12-01T15:58:31Z","Content":"\u003E \n\u003E \n\u003E 6 minutes ago, Jimbodiah said:\n\u003E \n\u003E \n\u003E How do you counterbalance for a person moving inside the smaller tori in the real world?\n\u003E \n\nI am quite sure they have shifting weights installed, like pumping water between compartments. At least it would be be a viable solution.\n\nAlso, reaction wheels help with it.\n\n**Edited \u003Ctime datetime=\u00222016-12-01T15:58:47Z\u0022 title=\u002212/01/2016 03:58  PM\u0022 data-short=\u00227 yr\u0022\u003EDecember 1, 2016\u003C/time\u003E by APlayer**\n  \nTypo"},{"CreatedByName":"mechanicH","CreatedById":167929,"CreatedDateTime":"2016-12-01T16:00:33Z","Content":"\u003E \n\u003E \n\u003E 9 minutes ago, Jimbodiah said:\n\u003E \n\u003E \n\u003E How do you counterbalance for a person moving inside the smaller tori in the real world?\n\u003E \n\nI would assume reaction wheels, or some kind of Gyroscope system would be in place for such a thing\n\nmaybe even a smaller weight wheel spinning at variable speeds to counter such effect. \n\n**Edited \u003Ctime datetime=\u00222016-12-01T16:02:30Z\u0022 title=\u002212/01/2016 04:02  PM\u0022 data-short=\u00227 yr\u0022\u003EDecember 1, 2016\u003C/time\u003E by mechanicH**"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-12-01T16:00:37Z","Content":"\u003E \n\u003E \n\u003E 6 minutes ago, Jimbodiah said:\n\u003E \n\u003E \n\u003E How do you counterbalance for a person moving inside the smaller tori in the real world?\n\u003E \n\nI would imagine the mass of the occupants is fairly trivial compared to the mass of the structure.I supposed you could run a continuous water tank around it that has ullage in it roughly equal to the mass (same as volume for water) of the crew. If all the crew are on one side, the water will naturally pool at the other."},{"CreatedByName":"JoseEduardo","CreatedById":127759,"CreatedDateTime":"2016-12-01T17:21:11Z","Content":"for those interested in the extra textures, I made a github repo of SSTU Expansion, it contains all the previous extra SSTU textures and a few new ones, just download the repo and you\u0027re good to try them: [https://github.com/FFCJoseEduardo/SSTU-Expansion](https://github.com/FFCJoseEduardo/SSTU-Expansion)  \n\nkeep in mind though, that not only the textures are still in development, but some patches as well, hence why this isn\u0027t a release yet  \n\nfeedback is also appreciated ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022)\n\n**Edited \u003Ctime datetime=\u00222016-12-01T17:21:33Z\u0022 title=\u002212/01/2016 05:21  PM\u0022 data-short=\u00227 yr\u0022\u003EDecember 1, 2016\u003C/time\u003E by JoseEduardo**"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2016-12-01T20:19:24Z","Content":"Current plans are to continue working on the wheels for the next couple of days.  Things there are in a fairly good state.  Few more things to clean up, finish up, or fix up, but most everything is working as intended (as far as the physics integration will allow anyhow..).\n\nHoping to get the wheels mostly finished and be able to start work on the SSTU bugfix and balance pass over this weekend.  May or not be an updated release depending on how far I make it (on both the wheels and the balance updates).  Have a bit of work to do on cleaning up the SC-E GUI -- apparently some of the recent stock code changes completely broke the module I was using to hide the GUI fields, so the SC-E-FS GUI is about two screens tall (mostly the \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E toggles =\\).\n\nSemi-long-term plans are to have the majority of the balancing and bugfixing done on SSTU by the end of December, and move into a bit of a maintenance mode for a few months while I do a couple things; 1.) Actually play some KSP, and 2.) Figure out what other series of parts I want to make (tied closely with playing...).  I\u0027m sure there will be some ongoing balance changes during the play period, but I don\u0027t anticipate adding any new major features or creating any more parts/models for a few months.  (May or may not finish up the SC-D parts in the short term; will probably remove them from distribution from upcoming releases either way)"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-12-01T20:44:18Z","Content":"Last night I was doing tons of experimentation with docking... I have yet to replicate my mun station issue. Very frustrating.\n\nRegarding the GUI... is there any way to do something similar to \u0022Configure Containers,\u0022 but ideally smaller (thin like standard right click), and perhaps not transparent---like a daughter version of the current right click? Then certain rarely used stuff gets chucked in there, leaving the right click to the normal stuff, with all the other in a daughter pane. So deploying solar panels, extending antennas, disabling crossfeed, reaction wheels, etc only show in this daughter menu. Maybe for mod integration, much of the LS stuff goes in there as well, or perhaps a single button for LS, the brings up a LS sub-pane? If that is possible, perhaps another called Control\u0022 or something, and the \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E, \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E, etc all goes in there (stuff I rarely touch in flight, though maybe I\u0027m just clueless).\n\n**Edited \u003Ctime datetime=\u00222016-12-01T20:45:22Z\u0022 title=\u002212/01/2016 08:45  PM\u0022 data-short=\u00227 yr\u0022\u003EDecember 1, 2016\u003C/time\u003E by tater**"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2016-12-01T20:51:29Z","Content":"\u003E \n\u003E \n\u003E 3 minutes ago, tater said:\n\u003E \n\u003E \n\u003E Last night I was doing tons of experimentation with docking... I have yet to replicate my mun station issue. Very frustrating.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Regarding the GUI... is there any way to do something similar to \u0022Configure Containers,\u0022 but ideally smaller (thin like standard right click), and perhaps not transparent---like a daughter version of the current right click? Then certain rarely used stuff gets chucked in there, leaving the right click to the normal stuff, with all the other in a daughter pane. So deploying solar panels, extending antennas, disabling crossfeed, reaction wheels, etc only show in this daughter menu. Maybe for mod integration, much of the LS stuff goes in there as well, or perhaps a single button for LS, the brings up a LS sub-pane? If that is possible, perhaps another called Control\u0022 or something, and the \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E, \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E, etc all goes in there (stuff I rarely touch in flight, though maybe I\u0027m just clueless).\n\u003E \n\nYea, I spent a few hours trying to replicate the docking bugs, and only managed to a few times... and inconsistent at that.  Not easy to debug, and no way to even know what needs to be fixed (or if it can be fixed).  I\u0027ll hopefully make some headway eventually.\n\nGUIs -- I like your idea, sadly it won\u0027t work with KSP.  All of the GUI controls are hard-coded to function how they do, down to the code that controls them is compiled into the plugins they are from, and the stock right-click menu GUI is not extensible in any meaningful fashion.  The most I can do is hide some of the existing buttons, there is no way to move them to a different window that I\u0027m aware of.  (Might be some very hacky methods that involve moving around the GUI objects into different containers; but I have a feeling it would cause the rest of the KSP code to explode, as it expects the GUI controls to be in specific places)"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-12-01T21:20:02Z","Content":"Yeah, at first with the updates I was playing with a clean SSTU, and had not seen the issue. The station in question contains almost entirely SSTU parts, however (a few stock parts, and some dmagic science parts). It also happened after adding USILS, but there were no USILS parts on the station, just the LS module I was delivering to make up for that fact, lol.\n\nClaw\u0027s stock bug fixes are stuck on 1.1.3 (possibly forever), otherwise I\u0027d throw that in there. If it\u0027s infrequent enough, I can always cheat---warp replacement craft to rendezvous using the new F12 capability, then EVA the crew across, and deorbit the broken craft (always fun!).\n\nBTW, one of the container options is a structural container... is that one that might b someday configured as a pressurized container? Ie: has a high dry mad compared to other tank forms, and the contents are limited to \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E/LS/Rocketparts/etc?"},{"CreatedByName":"Jimbodiah","CreatedById":152759,"CreatedDateTime":"2016-12-01T21:24:35Z","Content":"Mage, any chance of wheels/tracks making it into a RoverCore expansion? I noticed you used the Foundries parts... would be cool to have some parts started for that parts core, and seeing as you are working on it already, might indirectly be a bonus for SSTU?"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2016-12-02T17:22:58Z","Content":"\u003E \n\u003E \n\u003E 19 hours ago, tater said:\n\u003E \n\u003E \n\u003E Yeah, at first with the updates I was playing with a clean SSTU, and had not seen the issue. The station in question contains almost entirely SSTU parts, however (a few stock parts, and some dmagic science parts). It also happened after adding USILS, but there were no USILS parts on the station, just the LS module I was delivering to make up for that fact, lol.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Claw\u0027s stock bug fixes are stuck on 1.1.3 (possibly forever), otherwise I\u0027d throw that in there. If it\u0027s infrequent enough, I can always cheat---warp replacement craft to rendezvous using the new F12 capability, then EVA the crew across, and deorbit the broken craft (always fun!).\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E BTW, one of the container options is a structural container... is that one that might b someday configured as a pressurized container? Ie: has a high dry mad compared to other tank forms, and the contents are limited to \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E/LS/Rocketparts/etc?\n\u003E \n\nLooking into the docking ports is one of the first things I\u0027ll be doing during the upcoming bugfix pass.  If nothing else I\u0027ll be adding a \u0027force undock\u0027 option that would function as a decoupler \u002B custom code to clear the docking port states.\n\nStructural container -- was intended to allow for use of the fuel tanks (and more NF-trusses) as pure structural elements, bypassing all of the mass and cost calculations based on resources and instead using a flat specified volume-\u003Emass ratio.  It also increases the impact tolerance and max heat of the part to represent its use as a structural element.  Generally should cost less, weigh less, and have better stats for use as structural elements.\n\n\u003E \n\u003E \n\u003E 19 hours ago, Jimbodiah said:\n\u003E \n\u003E \n\u003E Mage, any chance of wheels/tracks making it into a RoverCore expansion? I noticed you used the Foundries parts... would be cool to have some parts started for that parts core, and seeing as you are working on it already, might indirectly be a bonus for SSTU?\n\u003E \n\nYes!  But not for awhile I\u0027m afraid.  Getting the wheel stuff working was obviously the first step.  Next will be fixing/reworking the LanderCore stuff so that it can once again have some fuel tanks with integrated landing legs.  This is all -after- the balance/bugfix/stability work that I\u0027ll be doing over the next month or so.  You might see the LanderCore stuff return sometime in the early spring, and initial work on the ProbeCore and RoverCore series of parts might begin late spring / early summer.\n\nHowever I likely won\u0027t be using the KF models/parts, but will be making my own set of models for wheels.  I may use some of the tracks if I find I have use for them, but the KF parts still belong to KF, and I have no intention to supersede that use;  I only created patches for testing of the KF parts with KSPWheel to make sure that the models would in fact work with the new wheel collider; as soon as the KF plugin is working, I\u0027ll be removing those patches."},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-12-02T17:56:19Z","Content":"\u003E \n\u003E \n\u003E 31 minutes ago, Shadowmage said:\n\u003E \n\u003E \n\u003E Structural container -- was intended to allow for use of the fuel tanks (and more NF-trusses) as pure structural elements, bypassing all of the mass and cost calculations based on resources and instead using a flat specified volume-\u003Emass ratio.  It also increases the impact tolerance and max heat of the part to represent its use as a structural element.  Generally should cost less, weigh less, and have better stats for use as structural elements.\n\u003E \n\nGotcha. I\u0027ve used them as pressurized segments, which is what got me thinking about them."},{"CreatedByName":"Jimbodiah","CreatedById":152759,"CreatedDateTime":"2016-12-03T14:36:53Z","Content":"\u003E \n\u003E \n\u003E 21 hours ago, Shadowmage said:\n\u003E \n\u003E \n\u003E However I likely won\u0027t be using the KF models/parts, but will be making my own set of models for wheels.  I may use some of the tracks if I find I have use for them, but the KF parts still belong to KF, and I have no intention to supersede that use;\n\u003E \n\nI would really love to see some tracks. Only KF had these for some reason, no one else made any to my knowledge. Wheels are so 1970s ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022)\n\nYou have lots of work planned by the sound of it."},{"CreatedByName":"AlphaKerman","CreatedById":166470,"CreatedDateTime":"2016-12-04T02:27:14Z","Content":"~~Please also add TAC LS in the hab module ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022). Or is there any way manually adding it?~~\n\nSorry, I forgot that i had ask the question before. My fault ![:blush:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif \u0022:blush:\u0022)\n\n**Edited \u003Ctime datetime=\u00222016-12-04T02:36:44Z\u0022 title=\u002212/04/2016 02:36  AM\u0022 data-short=\u00227 yr\u0022\u003EDecember 4, 2016\u003C/time\u003E by AlphaKerman**"},{"CreatedByName":"Pappystein","CreatedById":85755,"CreatedDateTime":"2016-12-04T22:07:33Z","Content":"So, a few delayed posts here... Busiest work year for me by far... ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022)\n\n1) Semi Truck, I know that was for wheels but wasn\u0027t there a early 1990s TV show that featured a Semi-Truck that turned into a 7 passenger \u0022Attack\u0022 Helicopter?    Future path of SSTU?! ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif \u0022:P\u0022)\n\n2) [@tater](https://forum.kerbalspaceprogram.com/index.php?/profile/119411-tater/) et-al.  Centrifugal Stations have such a huge mass that the mass of a person on the \u0022ring\u0022 is so minuscule in comparison to the overall mass and inertia of the station itself that they are not an issue balance wise.   Get all 200 kerbals at the same side however.... and you might get a small bump.    This is part of the reason I don\u0027t think large inflatable Centrifuge stations are viable in Real-world or should be in KSP.   The Sheer loss of mass from the inflatable to the solid \u0022tinker-toy\u0022 style station makes them (the inflatables) un-weildly at best.  Because sure, your HAB is light weight, but you have to launch literally tons of counter weights and Gryoscopic balance devices just to get it to rotate safely.  A \u0022Tinker-Toy\u0022 style would be more massive, and thus overcome the key issue.   On top of that, have you ever seen an inflated Baloon that was a MOVING part in a device, A) stay the same shape, and more importantly B) survive?\n\n3) [@Shadowmage](https://forum.kerbalspaceprogram.com/index.php?/profile/138730-shadowmage/) and Tater,  I too am having issues with the docking ports again.   I really wish someone could/would fork and update [@Claw](https://forum.kerbalspaceprogram.com/index.php?/profile/100668-claw/)\u0027s work around.  Shadowmage, I don\u0027t think this is something you are going to be able to fix inside SSTU without replicating Claw\u0027s work in your DLLs.\n\n* * *\n\nUPDATED!   An Idea, I was floating around in space and realized that the \u0022Universal\u0022 Docking ports from [@CaptainKipard](https://forum.kerbalspaceprogram.com/index.php?/profile/70516-captainkipard/) seemed to not have issues in my game.  The only real difference that I can see is they use a different way to delineate the Nodes.   Might be worth looking at?\n\nAs in Universal Docking ports:\n\nNODE  \n\n{  \n\n    name = top  \n\n    transform = n\\_top  \n\n    size = 3  \n\n    method = FIXED\\_JOINT  \n\n}  \n\nNODE  \n\n{  \n\n    name = bottom  \n\n    transform = n\\_bottom  \n\n    size = 3  \n\n    method = FIXED\\_JOINT  \n\n}\n\nVS\n\nSSTU:\n\nnode\\_stack\\_top =    0,  0.08796, 0, 0,  1, 0, 2  \n\nnode\\_stack\\_bottom = 0, -0.05,    0, 0, -1, 0, 2  \n\nnode\\_attach =       0, -0.05,    0, 0, -1, 0\n\n* * *\n\n4) a Question,  in the CFG files what are the other Defaults can I set a Fuel tank to?  I did not see a list of them in this thread.  Maybe this info could be add it to the Wiki for people implementing SSTU tank process to non SSTU tanks?   I am attempting to make a bunch of older mods parts work with the SSTU configurable tanks.  The two I am most concerned with are H2/O2 and NTO/AZ50.   THANKS!\n\n**Edited \u003Ctime datetime=\u00222016-12-04T22:24:23Z\u0022 title=\u002212/04/2016 10:24  PM\u0022 data-short=\u00227 yr\u0022\u003EDecember 4, 2016\u003C/time\u003E by Pappystein**\n  \nIdea on Docking ports"},{"CreatedByName":"APlayer","CreatedById":171406,"CreatedDateTime":"2016-12-05T15:46:29Z","Content":"\u003E \n\u003E \n\u003E 17 hours ago, Pappystein said:\n\u003E \n\u003E \n\u003E On top of that, have you ever seen an inflated Baloon that was a MOVING part in a device, A) stay the same shape, and more importantly B) survive?\n\u003E \n\nI did not, but neither it is an inflated baloon. Look at the BEAM, it does not inflate like \u0022inflate\u0022 and it does not have the same properties a baloon has.\n\nIt is not moving, but making a similar thing rotate wouldn\u0027t be too big a deal, I guess..."},{"CreatedByName":"Pappystein","CreatedById":85755,"CreatedDateTime":"2016-12-05T15:55:23Z","Content":"\u003E \n\u003E \n\u003E 2 minutes ago, APlayer said:\n\u003E \n\u003E \n\u003E I did not, but neither it is an inflated baloon. Look at the BEAM, it does not inflate like \u0022inflate\u0022 and it does not have the same properties a baloon has.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E It is not moving, but making a similar thing rotate wouldn\u0027t be too big a deal, I guess...\n\u003E \n\n[@APlayer](https://forum.kerbalspaceprogram.com/index.php?/profile/171406-aplayer/) you are correct in that this is more than just a balloon.  There is some structure underneath, I was speaking in hyperbole to point out the fact that this is a skin that will contain atmosphere.  The more you move it the more likely it is to fail.  \n\nThe Whole point of Inflatables is so NASA won\u0027t have to \u0022design\u0022 a Saturn V class rocket....   NASA already has one designed.  It is called Saturn V ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022)"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2016-12-05T16:12:18Z","Content":"\u003E \n\u003E \n\u003E 17 hours ago, Pappystein said:\n\u003E \n\u003E \n\u003E So, a few delayed posts here... Busiest work year for me by far... ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022)\n\u003E \n\u003E \n\u003E \n\u003E [...]\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E 3) [@Shadowmage](https://forum.kerbalspaceprogram.com/index.php?/profile/138730-shadowmage/) and Tater,  I too am having issues with the docking ports again.   I really wish someone could/would fork and update [@Claw](https://forum.kerbalspaceprogram.com/index.php?/profile/100668-claw/)\u0027s work around.  Shadowmage, I don\u0027t think this is something you are going to be able to fix inside SSTU without replicating Claw\u0027s work in your DLLs.\n\u003E \n\u003E \n\u003E \n\u003E * * *\n\u003E \n\u003E \n\u003E \n\u003E UPDATED!   An Idea, I was floating around in space and realized that the \u0022Universal\u0022 Docking ports from [@CaptainKipard](https://forum.kerbalspaceprogram.com/index.php?/profile/70516-captainkipard/) seemed to not have issues in my game.  The only real difference that I can see is they use a different way to delineate the Nodes.   Might be worth looking at?\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E  \n\u003E \n\u003E \n\u003E \n\u003E * * *\n\u003E \n\u003E \n\u003E \n\u003E 4) a Question,  in the CFG files what are the other Defaults can I set a Fuel tank to?  I did not see a list of them in this thread.  Maybe this info could be add it to the Wiki for people implementing SSTU tank process to non SSTU tanks?   I am attempting to make a bunch of older mods parts work with the SSTU configurable tanks.  The two I am most concerned with are H2/O2 and NTO/AZ50.   THANKS!\n\u003E \n\n3.)  Hmm.. I\u0027ll work on putting something generic together for inclusion in the next release(s).  Since Claw\u0027s fixes no longer work, I\u0027ll look into making it a truly generic solution/replacement.  Will likely be a simple Module that can be added to any/all docking port enabled parts that will add a \u0027force-undock\u0027 button to that part for the port specified in the config.  Will be interesting figuring out how to incude it on the StationCore parts, as there is no docking-port module in the config....  (may be making two solutions; a generic replacement for Claw\u0027s fix, and one specially setup for the station-core parts with swappable ports).\n\n3a) -- Sadly that would make no difference to how the ports work.  That merely is a different way for it to load the node data, and should have zero effect on their use after the data is loaded.  I\u0027m pretty sure the differences are caused by my parts having multiple docking ports in a single part, which I\u0027ve not seen anywhere else (other than a single one of PJ\u0027s inflatables).\n\n4.)  Which \u0027defaults\u0027?  There are... lots.. of different things in there that have defaults.  Default resources available?  Default resources assigned to the tank?  Default modifier types?  Default fuel type?  Default tankage volume?  Default tankage mass?  (I\u0027m guessing you are referring to resources;  but which parts are you having problems setting up?  The available resources, the ones the part starts with, or other?"},{"CreatedByName":"Pappystein","CreatedById":85755,"CreatedDateTime":"2016-12-05T16:15:11Z","Content":"\u003E \n\u003E \n\u003E 3 minutes ago, Shadowmage said:\n\u003E \n\u003E \n\u003E 4.)  Which \u0027defaults\u0027?  There are... lots.. of different things in there that have defaults.  Default resources available?  Default resources assigned to the tank?  Default modifier types?  Default fuel type?  Default tankage volume?  Default tankage mass?  (I\u0027m guessing you are referring to resources;  but which parts are you having problems setting up?  The available resources, the ones the part starts with, or other?\n\u003E \n\nSorry the Default Fuel on tank placement.   Your tank is Default Fuel Type \u003Cabbr title=\u0022Liquid Fuel and Oxidizer\u0022\u003ELFO\u003C/abbr\u003E.  Was wondering the abbreviations or names for the other fuel types So I can place say, an Agena tank from FASA and have it already filled with NTO and AZ50 instead of \u003Cabbr title=\u0022Liquid Fuel and Oxidizer\u0022\u003ELFO\u003C/abbr\u003E.\n\n**Edited \u003Ctime datetime=\u00222016-12-05T16:16:34Z\u0022 title=\u002212/05/2016 04:16  PM\u0022 data-short=\u00227 yr\u0022\u003EDecember 5, 2016\u003C/time\u003E by Pappystein**"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2016-12-05T16:25:26Z","Content":"\u003E \n\u003E \n\u003E 5 minutes ago, Pappystein said:\n\u003E \n\u003E \n\u003E Sorry the Default Fuel on tank placement.   Your tank is Default Fuel Type \u003Cabbr title=\u0022Liquid Fuel and Oxidizer\u0022\u003ELFO\u003C/abbr\u003E.  Was wondering the abbreviations or names for the other fuel types So I can place say, an Agena tank from FASA and have it already filled with NTO and AZ50 instead of \u003Cabbr title=\u0022Liquid Fuel and Oxidizer\u0022\u003ELFO\u003C/abbr\u003E.\n\u003E \n\nAhh; I\u0027ve referred to those as \u0027FuelTypes\u0027, and the available list can be found in the file \u0027GameData/SSTU/Data/FuelTypes.cfg\u0027.\n\nThe currently available types are \u003Cabbr title=\u0022Liquid Fuel and Oxidizer\u0022\u003ELFO\u003C/abbr\u003E, \u003Cabbr title=\u0022Liquid Fuel\u0022\u003ELF\u003C/abbr\u003E, MP, EC, Hydrolox, LiquidHydrogen, and Hypergolic. \n\nYou should be able to set the \u0027defaultFuelPreset\u0027 in the CONTAINER node to one of those values -- IF those resources are valid for the container, it will set that \u0027fueltype\u0027 as the default selection.   \n\nThe total available \u0027fuel presets\u0027 are calculated based on the resources that are available in the part; if it has \u003Cabbr title=\u0022Liquid Fuel\u0022\u003ELF\u003C/abbr\u003E\u002BO in it, then \u003Cabbr title=\u0022Liquid Fuel and Oxidizer\u0022\u003ELFO\u003C/abbr\u003E will be available as a preset; if it has LqdHydrogen but no Oxidizer, then LiquidHydrogen will be available, but not Hydrolox; -- you must make sure that the resources are available before the fuel type will show up; this is done with the \u0027resource=XXX\u0027 in the CONTAINER definitions."},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2016-12-05T21:44:45Z","Content":"Did a little bit of calculation / math work over the weekend on figuring out the balance for the StationCore parts, mostly as it relates to crew capacity.  I\u0027m fairly happy with the general mass balancing of the inflatables -- they use a consistent phsyics based balance for their mass and end up within the range that I would expect for a part of their size and capabilities, so it is mostly the crew capacity that needs balancing\n\nIf I try and maintain a relatively constant mass-per-kerbal across the parts, I end up with some pretty insane values for crew capacity (CFG-D would have ~180 crew capacity, based on 0.6t/kerbal from hitch-hiker module).  If I try and use constant volume-per-kerbal its even worse.  Now, one of the main problems I had with such large crew capacities is that I did not want so see four-page-long blank lists of crew slots in the editor.  Since none of these parts have crew slots in the editor, it is not as large of a concern.\n\n|  | rad | h or r2 | usable volume | crew | mass per crew | m3 per crew | mass (t) |\n| --- | --- | --- | --- | --- | --- | --- | --- |\n| cos-hab-xs | 1.25 | 1.25 | 4.970097753 | 1 | 1400 | 4.970097753 | 1.4 |\n| --- | --- | --- | --- | --- | --- | --- | --- |\n| cos-hab-s | 1.25 | 2.5 | 9.940195505 | 2 | 1400 | 4.970097753 | 2.8 |\n| --- | --- | --- | --- | --- | --- | --- | --- |\n| cos-hab-m | 1.25 | 3.5 | 13.91627371 | 3 | 1033.333333 | 4.638757903 | 3.1 |\n| --- | --- | --- | --- | --- | --- | --- | --- |\n| cos-hab-l | 1.25 | 5 | 19.88039101 | 5 | 680 | 3.976078202 | 3.4 |\n| --- | --- | --- | --- | --- | --- | --- | --- |\n| cos-lab-s | 1.25 | 2.5 | 9.940195505 | 1 | 2800 | 9.940195505 | 2.8 |\n| --- | --- | --- | --- | --- | --- | --- | --- |\n| cos-lab-m | 1.25 | 3.5 | 13.91627371 | 2 | 1550 | 6.958136854 | 3.1 |\n| --- | --- | --- | --- | --- | --- | --- | --- |\n| cos-lab-l | 1.25 | 5 | 19.88039101 | 3 | 1133.333333 | 6.626797004 | 3.4 |\n| --- | --- | --- | --- | --- | --- | --- | --- |\n| a1 | 1.25 | 2.5 | 7.853981634 | 2 | 662.6797004 | 3.926990817 | 1.325359401 |\n| --- | --- | --- | --- | --- | --- | --- | --- |\n| a2 | 1.25 | 3.75 | 11.78097245 | 3 | 662.6797004 | 3.926990817 | 1.988039101 |\n| --- | --- | --- | --- | --- | --- | --- | --- |\n| b1 | 2.5 | 5 | 79.52156404 | 10 | 559.5961914 | 7.952156404 | 5.595961914 |\n| --- | --- | --- | --- | --- | --- | --- | --- |\n| b2 | 2.5 | 7.5 | 119.2823461 | 15 | 559.5961914 | 7.952156404 | 8.393942871 |\n| --- | --- | --- | --- | --- | --- | --- | --- |\n| c1 | 3.75 | 7.5 | 288.633825 | 24 | 533.8253142 | 12.02640938 | 12.81180754 |\n| --- | --- | --- | --- | --- | --- | --- | --- |\n| c2 | 3.75 | 11.25 | 432.9507376 | 36 | 533.8253142 | 12.02640938 | 19.21771131 |\n| --- | --- | --- | --- | --- | --- | --- | --- |\n| cfg-a | 3.75 | 1.25 | 74.02203301 | 12 | 1040.934839 | 6.168502751 | 12.49121807 |\n| --- | --- | --- | --- | --- | --- | --- | --- |\n| cfg-b | 8.4375 | 1.5625 | 286.907665 | 36 | 997.5625542 | 7.969657362 | 35.91225195 |\n| --- | --- | --- | --- | --- | --- | --- | --- |\n| cfg-c | 15.625 | 1.875 | 814.4351288 | 85 | 952.4893953 | 9.581589751 | 80.9615986 |\n| --- | --- | --- | --- | --- | --- | --- | --- |\n| cfg-d | 22.5 | 2.5 | 2248.419253 | 175 | 904.1262603 | 12.84811001 | 158.2220956 |\n| --- | --- | --- | --- | --- | --- | --- | --- |\n\nYes, it is intentional that the CFG parts have higher mass-per-kerbal; all that rotational hardware and internal structure comes at a cost.  They also have slightly less m^3 per kerbal, as a torus is a less efficient use of volume compared to a cylinder (more of the raw volume is used up by the skin and supporting structure, thus a higher average density across the part if taken as a whole).\n\nDoing a bit more thought on it; still don\u0027t like having such absurdly large crew capacities, but it does give a mostly unified balance scheme across the parts, and allows for freedom-of-use of the part however the user would like (long term hab vs. space-hotel/airliner style transport). \n\nHowever even if I went with these large raw crew capacities I would likely still tailor the included life-support to a much smaller / more reasonable value (such as 20 crew max).  Further LS facilities can be added by using the stand-alone parts if needed; I don\u0027t think it is reasonable to expect 170 crew to fit into the same torus as all of their life-support equipment, at least not without vastly upping the mass of the part, or reducing the number of crew.  Anyone have an idea on the m^3 (and mass) per crew needed for life-support equipment on the ISS (storage, recyclers, scrubbers, etc)?"}]}