{"TopicId":117090,"ForumId":36,"TopicTitle":"[WIP][1.8.x] SSTULabs - Low Part Count Solutions (Orbiters, Landers, Lifters) - Dev Thread [11-18-18]","CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2015-07-28T18:13:57Z","PageNum":110,"Articles":[{"CreatedByName":"Jimbodiah","CreatedById":152759,"CreatedDateTime":"2016-04-03T22:29:24Z","Content":"Ooooh, SR71, I smell an SSTU plane-core ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif \u0022;)\u0022)"},{"CreatedByName":"Jimbodiah","CreatedById":152759,"CreatedDateTime":"2016-04-03T22:53:29Z","Content":"Here\u0027s a link to the craft topic in Craft Exchange\n\n\u003Ciframe data-embedcontent=\u0022\u0022 frameborder=\u00220\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/135990-sstu-craft-repository/\u0026do=embed\u0022\u003E\u003C/iframe\u003E\n\nContained so far:  \n\nDelta II  \n\nDelta IV Heavy (Orion)  \n\nAres I  \n\nAres V  \n\nSaturn V  \n\nSLS  \n\nSpace Shuttle  \n\nSoyuz / R7  \n\nLC2 lander  \n\nLC3 lander  \n\nLC5 lander  \n\n**Edited \u003Ctime datetime=\u00222016-04-04T14:33:42Z\u0022 title=\u002204/04/2016 02:33  PM\u0022 data-short=\u00228 yr\u0022\u003EApril 4, 2016\u003C/time\u003E by Jimbodiah**"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2016-04-04T15:06:31Z","Content":"General development update:\n\nStill awaiting a bug-fix for the fairing bug (that breaks nearly all parts due to drag-cube updating).  Issue had some updates to it today.. so hopefully will be sorted out this week.\n\nFound new bug in gimbal module that breaks all multi-engine engine-cluster setups.  Bug report submitted ([http://bugs.kerbalspaceprogram.com/issues/8345](http://bugs.kerbalspaceprogram.com/issues/8345)).  Awaiting fix; as with the drag-cubes, I cannot work around this one... it completely breaks the mod in functional use.\n\nWorked around the IMassModifier bug by defaulting to a non-zero \u0027modified mass\u0027 in the module, caching the calculated mass, and returning either the default or cached calculation as appropriate (is the same field... just starts with default and is updated to cached value when it is calced/recalced).  Stock also \u0027improved\u0027 this functionality by polling for mass for all parts on-tick rather than only on-editor-changes; displayed mass for parts should now be much more consistent across various mods, screens, and scenes.\n\nGot all but ModularFuelTanks converted over to use the new UI controls; went alot faster (and cleaner, eaiser) after they added in the UI callback setups.  In general the editor UI will be much more responsive while using SSTU parts, as I\u0027ve eliminated all of the uneccessary OnEditorShipModified events being fired (now they only get fired when cost/mass/geometry are actually updated).  Also cleaned up drag cube recalculation code to only update a drag cube for a part at most once per tick, which eliminates 70% of the drag-cube recalculation (previously the engine cluster would cause recalculation, and so would the node-fairing; often also triggering a third or fourth recalc from the event cycles).\n\nSo... -if- the above bugs get fixed... SSTU should have even better performance in general ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022)\n\nAside from those two bugs most everything appears to be working properly.  Still quite a large list of things on my \u00271.1. update TODO\u0027 list, but many of those can be done in short order after the initial updating is finished.\n\nWill start publishing 1.1 test releases as soon as those two stock bugs listed above are solved.  Both of those render the mod functionally unusable (can\u0027t use map mode with many parts as root; can\u0027t use engine clusters in actual clusters...), and would be pointless to post releases as long as they exist."},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2016-04-04T20:01:43Z","Content":"If anyone could do some testing and confirm the bug report regarding the gimbal modules, it will greatly increase its chance of being fixed in a timely manner:\n\n[http://bugs.kerbalspaceprogram.com/issues/8345](http://bugs.kerbalspaceprogram.com/issues/8345)\n\nBasically to confirm the bug you\u0027ll need to edit one of the stock engine part config files;  remove the mesh=XXX, replace that with a properly setup MODEL node (e.g model=URL to model), and add a rotation to that model node (rotation = 0, 90, 0) for that model; use the patched engine in a craft; launch it, examine gimbal response to various inputs (notably, check that it responds to roll input improperly, and/or does not respond to pitch/yaw inputs properly).\n\nHere is an example of how to edit/update the stock mammoth engine to test the bug:  \n\nComment out the mesh= line, and add the MODEL node to the config file.  Save the file and launch KSP.  Alternatively you can copy the part config and change the name=to a new name if you don\u0027t want to alter the stock configs.\n\n    \t// mesh = Size3EngineCluster.muMODEL{\tmodel = Squad/Parts/Engine/Size3EngineCluster/Size3EngineCluster\trotation = 0, 90, 0}\n\nEdit:  That might not be the best test-case due to its multi-nozzle setups;  will update with a better example as soon as I am home from work (likely using the other 3.75m engine)\n\nThanks ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022)\n\nEdit: More info can be found at:\n\n\u003Ciframe data-embedcontent=\u0022\u0022 frameborder=\u00220\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/135769-11-new-moduleengines-features-examples-and-discussion/\u0026do=embed\u0022\u003E\u003C/iframe\u003E\n\n**Edited \u003Ctime datetime=\u00222016-04-04T20:24:25Z\u0022 title=\u002204/04/2016 08:24  PM\u0022 data-short=\u00228 yr\u0022\u003EApril 4, 2016\u003C/time\u003E by Shadowmage**"},{"CreatedByName":"_Augustus_","CreatedById":115084,"CreatedDateTime":"2016-04-04T22:52:38Z","Content":"Does the new test version work in 1.1?"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2016-04-04T22:54:47Z","Content":"\u003E \n\u003E \n\u003E 1 minute ago, \\_Augustus\\_ said:\n\u003E \n\u003E \n\u003E Does the new test version work in 1.1?\n\u003E \n\nNo; I have not released a 1.1 compatible version, and will not be until the stock bugs mentioned this morning are fixed (drag-cube updating on root parts, engine gimbals on rotated engine models).  Those two bugs break nearly every single part in the mod to one degree or another."},{"CreatedByName":"RedParadize","CreatedById":129285,"CreatedDateTime":"2016-04-04T22:56:48Z","Content":"\u003E \n\u003E \n\u003E 2 minutes ago, \\_Augustus\\_ said:\n\u003E \n\u003E \n\u003E Does the new test version work in 1.1?\n\u003E \n\nlol. I don\u0027t want to be rude but reading last few comment could have answer that!"},{"CreatedByName":"VenomousRequiem","CreatedById":137373,"CreatedDateTime":"2016-04-05T03:26:08Z","Content":"\u003E \n\u003E \n\u003E 4 hours ago, \\_Augustus\\_ said:\n\u003E \n\u003E \n\u003E Does the new test version work in 1.1?\n\u003E \n\nIf it was 1.1 compatible he would have said something. :^)\n\n-A friendly PSA for *everyone on this website.*"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2016-04-05T14:43:35Z","Content":"General status update:\n\nMore things working and/or fixed up last night.  The functionality of most parts appears to be working at the moment (minus the aforementioned stock issues).  Still left to do is re-export all of the ShipCore engine-containing parts (service modules, shuttle fuselage) to fix up their gimbal orientations.  Still more on the 1.1. TODO list, but finally the list is growing shorter rather than longer.\n\nGot the A\u002BB tank type swapped around yesterday, and re-exported all their models minus the top and bottom cap;  this is so that I can introduce an inset mount type (or two/three) for use as inset-engine mounts for landers/etc (those will be coming later...).\n\nStarted working last night on enabling -optional- colliders for node-fairings, petal adapters, isdc, and pdc parts.  This will end up with a toggle in the editor that determines if colliders are enabled or disabled;  for isdc this will enable surface attach, for the rest though I will be disabling surface attach for those colliders (as they either move, or get attached to other parts.... anything surfaced attached would look strange after activation or jettison as it would be floating in its previous position and/or destroyed by collision upon detach/jettison).  So far I have these setup to create 1 collider-per-face, but will have an option to adjust the # of faces per collider when it is all done (not sure if it will be config or UI based).\n\nOn the stock issues front; NathanKell has kindly begun looking into the gimbal problems, so hopefully a resolution will be found and available soon.  Haven\u0027t seen any updates on the drag-cube related issue, but as it effects several stock parts I expect it will be looked into and fixed before pre-release is over."},{"CreatedByName":"StickyScissors","CreatedById":144204,"CreatedDateTime":"2016-04-06T04:05:15Z","Content":"Is anybody else having issues with engines ignoring the gimbal limit? Testing out a launcher, and noticed it was over correcting roll, so i went back to the VAB and dropped the gimbal down to 1\\* from the original 5\\*, but it doesn\u0027t seem to actually be limiting, because they still visually gimbal the original 5\\*, and they still roll the vehicle as if it were set to 5\\* (rapidly). The only way i have found to get around this is just locking the gimbal, something that isn\u0027t exactly a great idea during ascent."},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2016-04-06T14:57:13Z","Content":"\u003E \n\u003E \n\u003E 10 hours ago, StickyScissors said:\n\u003E \n\u003E \n\u003E Is anybody else having issues with engines ignoring the gimbal limit? Testing out a launcher, and noticed it was over correcting roll, so i went back to the VAB and dropped the gimbal down to 1\\* from the original 5\\*, but it doesn\u0027t seem to actually be limiting, because they still visually gimbal the original 5\\*, and they still roll the vehicle as if it were set to 5\\* (rapidly). The only way i have found to get around this is just locking the gimbal, something that isn\u0027t exactly a great idea during ascent.\n\u003E \n\nCould be related to how I force-reload the gimbal module; its likely overwriting any custom limitation settings.  Will have to pull the current limitation out, re-load the module, and re-seat the user-set limitation.\n\nWill investigate this for a fix in 1.1 versions."},{"CreatedByName":"acolangelo","CreatedById":105343,"CreatedDateTime":"2016-04-06T23:34:32Z","Content":"I’ve searched this thread and the GitHub issues list, but haven’t found any mention of the bug I’ve been seeing. The \u003Cfont color=\u0022#252525\u0022 face=\u0022sans-serif\u0022\u003Enozzle extensions of the RL10 variants are collapsed up into the engine itself. This is seen even on an entirely stock KSP install (OS X). As you can see in the attached screenshots, the nozzle extensions are displayed appropriately in the parts list, just not in the editor or in flight.\u003C/font\u003E\n\n\u003Cfont color=\u0022#252525\u0022 face=\u0022sans-serif\u0022\u003EScreenshots and craft file attached—\u003C/font\u003Elet me know if you need anything else, or want me to try anything specifically!\n\nPS: Absolutely *fantastic* work. This mod quickly became an absolute essential to me.\n\n\u003Ciframe class=\u0022imgur-album\u0022 frameborder=\u00220\u0022 height=\u0022550\u0022 src=\u0022//imgur.com/a/FGei4/embed?background=ffffff\u0026text=1a1a1a\u0026link=4e76c9\u0022 width=\u0022100%\u0022\u003E\u003C/iframe\u003E\n\nCraft file: [https://www.dropbox.com/s/elkg2vc1wwe5w3o/RL10-Test.craft?dl=0](https://www.dropbox.com/s/elkg2vc1wwe5w3o/RL10-Test.craft?dl=0)\n\nEDIT: GitHub issue opened here: [https://github.com/shadowmage45/SSTULabs/issues/278](https://github.com/shadowmage45/SSTULabs/issues/278)\n\n**Edited \u003Ctime datetime=\u00222016-04-06T23:42:26Z\u0022 title=\u002204/06/2016 11:42  PM\u0022 data-short=\u00228 yr\u0022\u003EApril 6, 2016\u003C/time\u003E by acolangelo**"},{"CreatedByName":"Jimbodiah","CreatedById":152759,"CreatedDateTime":"2016-04-07T00:01:39Z","Content":"They normally extend when you activate them (not in the VAB)."},{"CreatedByName":"blowfish","CreatedById":119688,"CreatedDateTime":"2016-04-07T00:13:15Z","Content":"\u003E \n\u003E \n\u003E 36 minutes ago, acolangelo said:\n\u003E \n\u003E \n\u003E I’ve searched this thread and the GitHub issues list, but haven’t found any mention of the bug I’ve been seeing. The \u003Cfont color=\u0022#252525\u0022 face=\u0022sans-serif\u0022\u003Enozzle extensions of the RL10 variants are collapsed up into the engine itself. This is seen even on an entirely stock KSP install (OS X). As you can see in the attached screenshots, the nozzle extensions are displayed appropriately in the parts list, just not in the editor or in flight.\u003C/font\u003E\n\u003E \n\nAs Jimbodiah mentioned, that\u0027s just how the RL10 works ([IRL picture](http://spaceflightnow.com/news/n1406/04rl10c/04rl10c_400340.jpg)).  It extends when you activate it."},{"CreatedByName":"acolangelo","CreatedById":105343,"CreatedDateTime":"2016-04-07T00:19:57Z","Content":"\u003E \n\u003E \n\u003E 17 minutes ago, Jimbodiah said:\n\u003E \n\u003E \n\u003E They normally extend when you activate them (not in the VAB).\n\u003E \n\n\u003E \n\u003E \n\u003E 5 minutes ago, blowfish said:\n\u003E \n\u003E \n\u003E As Jimbodiah mentioned, that\u0027s just how the RL10 works ([IRL picture](http://spaceflightnow.com/news/n1406/04rl10c/04rl10c_400340.jpg)).  It extends when you activate it.\n\u003E \n\nFiled under: TIL\n\nUseful to know—issue closed!"},{"CreatedByName":"Jimbodiah","CreatedById":152759,"CreatedDateTime":"2016-04-07T01:09:40Z","Content":"![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif \u0022;)\u0022)  Also nice to know if you stick them on very light rockets as a second stage, that it takes around 3 seconds for the engine to fire up after activating. These engines are also on the HUS/ICPS\n\n**Edited \u003Ctime datetime=\u00222016-04-07T01:16:49Z\u0022 title=\u002204/07/2016 01:16  AM\u0022 data-short=\u00228 yr\u0022\u003EApril 7, 2016\u003C/time\u003E by Jimbodiah**"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2016-04-07T15:01:38Z","Content":"General update:\n\nBeen a bit slow the past few days as I\u0027ve not been feeling the best, making it hard to concentrate on things.  But...things have still been getting done/checked off ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022), just a bit slower, and nothing too complex.\n\nNodeFairings, Petal Adapter, and Interstage Decoupler have all had a \u0027transparency\u0027 toggle added to their in-editor GUI, allowing for manually turning on and off their transparency.  This lets you see the texture-swap options better, and gives a better idea of what the finished rocket will look like (ideally this will allow the fairings to show up in the thumbnails...).  Most will also have a toggle to enable/disable colliders while in the editor.\n\nTracked down the source of the gimbal bug I was seeing last night, and it sounds like it will be fixed in the next pre-release.  Also added in a hacky work-around for the root-part-drag-cube-updating problems.  So the two major bugs that were keeping me from doing a release have been (or will shortly be) squashed.\n\nI\u0027ll likely spend tonight and tomorrow doing extended testing and a bit more cleanup, and would like to have a 1.1 **testing** version available on Saturday.  Will still be a week or 3 before I\u0027ll have \u0027stable\u0027 versions ready.  Notably, I haven\u0027t even begun to work on wheels or legs, which are likely to take a few weeks to get sorted out.  So for now the SC-E parts do not work (or at least will not have integrated landing gear=\\).\n\nAnd on a more far-reaching note:  \n\nIn general performance on 1.1 is way up; I have not noticed any lag from part count yet, even when I launched a ~200 part testing rig I was still sitting at \u003E60fps on the pad (until aero effects kick in... but thats another discussion).  So I might not be as... stingy... with part count in the future.  I will still be designing modular parts with switchable geometry/etc, but this gives a bit more breathing room for designs and allows me to not pack -everything- into a single part.  So, might see a few more stand alone or limited use parts; mostly stuff that I run across and find a need for in my own game ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022)"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2016-04-07T16:27:29Z","Content":"And on a general discussion point:\n\nWhat are the thoughts about adding two more rocketry / engine related nodes to the Tech-Tree?\n\nThe first would fill the gap between XXX and VeryHeavyRocketry.  This would be a ~300 science node, and would give an excellent place for some of the more advanced but not-quite state-of-the-art engines (RS-25, ??).\n\nAm also considering adding a 1000 science node -after- veryheavyrocketry for the most advanced / future-tech engines; F1B, J-2X, higher-end Merlins; all the stuff that never was or almost is.  \u0027Experimental Rocketry\u0027 would likely be its name, or similar (most others have a \u0027hidden\u0027 1000 science node that mods can use... rocketry does not for some reason).\n\n(Just going through my 1.1 TODO list and this is one of the bigger changes that is on there to investigate)"},{"CreatedByName":"Jimbodiah","CreatedById":152759,"CreatedDateTime":"2016-04-07T16:41:38Z","Content":"Take it easy Mage, take care of your health."},{"CreatedByName":"ComatoseJedi","CreatedById":91567,"CreatedDateTime":"2016-04-07T16:53:24Z","Content":"Since you asked a question, whenever I think of \u0022Experimental Rocketry\u0022, I think of theoretical/concept engines. Electric engines (using Argon and Xenon), Nuclear rockets (which you\u0027ve already started on). Pretty much the things that have already been done by Nertea and the KPSI-E branch by FreeThinker. Even the original Orion nuclear pulse engine comes to mind. Even going through CTT to Colossal Rocketry (the proposed Nova that never got built), but if you want to stick to stock, that\u0027s fine. Whatever you do is okay with me, because I don\u0027t plan on doing anything 1.1 until this mod is compatible with an official release of 1.1. So, you have time to sort all of that out. In the meantime, take care of yourself. Take a nap (or 12). Drink some fine, top shelf whiskey and relax. \n\nNo one is going to bug you about \u0022when is this thing going to be updated\u0022 since they changed the forum rules to prohibit such activity. And if they do, you can bet someone will notify the Mods about it. We got your back brother. \n\nBut, switching gears to other aspects of this mod. I\u0027d like to see the beginnings of station parts. Which are ***way*** easier to come up with than engines. And you don\u0027t have to worry about IVA\u0027s because the stock ones work just fine for these. While the ISS has been probably the most duplicated station part mod out there, you have plenty of material to work with. I\u0027m rambling... let me go back to my corner and talk to the plants ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022)\n\n**Edited \u003Ctime datetime=\u00222016-04-07T17:06:28Z\u0022 title=\u002204/07/2016 05:06  PM\u0022 data-short=\u00228 yr\u0022\u003EApril 7, 2016\u003C/time\u003E by ComatoseJedi**"},{"CreatedByName":"Jimbodiah","CreatedById":152759,"CreatedDateTime":"2016-04-07T17:04:59Z","Content":"\u003E \n\u003E \n\u003E 11 minutes ago, ComatoseJedi said:\n\u003E \n\u003E \n\u003E \u0022when is this thing going to be updated\u0022 since they changed the forum rules to prohibit such activity.\n\u003E \n\nYou\u0027re kidding, right?"},{"CreatedByName":"ComatoseJedi","CreatedById":91567,"CreatedDateTime":"2016-04-07T17:14:19Z","Content":"\u003E \n\u003E \n\u003E 10 minutes ago, Jimbodiah said:\n\u003E \n\u003E \n\u003E You\u0027re kidding, right?\n\u003E \n\nNope. not kidding. \n\n\u003Ciframe data-embedcontent=\u0022\u0022 frameborder=\u00220\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/136207-new-rule-repeated-requests-for-add-on-updates-are-now-forbidden/\u0026do=embed\u0026embedComment=2498713\u0026embedDo=findComment#comment-2498713\u0022\u003E\u003C/iframe\u003E\n\n\u003E \n\u003E \n\u003E Quote\n\u003E \n\u003E \n\u003E **2.3 Forbidden messages**  \n\u003E \n\u003E  f.  Messages that repeat inquiries about updates or content from modders.\n\u003E \n\nThis is a more explicit expansion on our rule against harassment, 2.2d. **Requests in an add-on thread for updates when there has already been such a request will be moderated.** The onus is on the poster to check the thread to see if an update has already been requested.\u0022\n\nNot exactly \u0022prohibit\u0022, but stop from constantly asking about updating a mod that\u0027s already been addressed to be updated by the OP. They will be moderated.\n\n**Edited \u003Ctime datetime=\u00222016-04-07T17:16:35Z\u0022 title=\u002204/07/2016 05:16  PM\u0022 data-short=\u00228 yr\u0022\u003EApril 7, 2016\u003C/time\u003E by ComatoseJedi**\n  \na DOH moment"},{"CreatedByName":"JoseEduardo","CreatedById":127759,"CreatedDateTime":"2016-04-07T17:15:32Z","Content":"IIRC Experimental Rocketry is there, hidden and unused by stock but it is there, I don\u0027t remember exactly which mods use that node though... I guess USI warp drive does?  \n\nbtw, I like Jedi\u0027s (you rebel scum) idea of using a Colossal Rocketry node, M-1 engine could be used there... and if engine layouts could be locked to tech tree nodes (please don\u0027t, I beg ya, leave all until 9 unlocked from start if you ever go with this idea), 14 and 18 Nova MM-1B and 1C engine layouts could be unlocked there and maybe other monstrosities in between based around the Nova MM-1B/C"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2016-04-07T17:16:56Z","Content":"Thanks for the support guys ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022)\n\nIts nothing life-threatening, or even that serious; just enough to keep me distracted for a few days.  Thankfully I had the amazing foresight last week to request some vacation time for tomorrow and Monday, so I\u0027ve got a nice long weekend to finish recovering.  Originally I had taken the time off just for some time off (and to finish the updating...); but spending it for recovery is also a good cause.  Doc says all should be well in another 2-3 days... so.. yah... will be taking it easy for a few more days.\n\nAnd before I forget, and surprise everyone by it;  I will (most likely) be changing most of the engines and parts that currently use \u0027MonoPropellant\u0027 to use a true hypergolic bi-propellant from CRP.  Have not decided which one, or at what ratio... but will likely get that all sorted out in the next day or two.  This is so that there is a separate pool of fuel for RCS and engines, and so that the fuel obeys stack-flow rules.  The few exceptions to this might be those specialty parts that are intended to burn the same fuel in their RCS and service engines... where I will likely just make the RCS use the bi-propellant fuel as well.  Still a bit to figure out on it... but as my mod is mostly a \u0027realism-light\u0027 type setup, I think this fits a bit better than just slapping MonoProp on everything."},{"CreatedByName":"ComatoseJedi","CreatedById":91567,"CreatedDateTime":"2016-04-07T17:24:11Z","Content":"\u003E \n\u003E \n\u003E 2 minutes ago, Shadowmage said:\n\u003E \n\u003E \n\u003E Thanks for the support guys ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022)\n\u003E \n\u003E \n\u003E \n\u003E Its nothing life-threatening, or even that serious; just enough to keep me distracted for a few days.  Thankfully I had the amazing foresight last week to request some vacation time for tomorrow and Monday, so I\u0027ve got a nice long weekend to finish recovering.  Originally I had taken the time off just for some time off (and to finish the updating...); but spending it for recovery is also a good cause.  Doc says all should be well in another 2-3 days... so.. yah... will be taking it easy for a few more days.\n\u003E \n\nI\u0027m telling you, top shelf whiskey works wonders for just about anything that ails you. Trust me. I been drinking whiskey for medicinal purposes since I was a little boy and was common practice when your parents come from a generation when there was no such thing as a doctor visit. I\u0027m not an alcoholic by a long shot, I haven\u0027t touched alcohol in years, but I will when I get sick/down and out and it fixes me right up. Not to mention, you see donkeys for a little while, which is a nice side effect."}]}