{"TopicId":117013,"ForumId":16,"TopicTitle":"Experience Points","CreatedByName":"THobson","CreatedById":97709,"CreatedDateTime":"2015-07-27T22:07:07Z","PageNum":1,"Articles":[{"CreatedByName":"THobson","CreatedById":97709,"CreatedDateTime":"2015-07-27T22:07:07Z","Content":"\n\u003Cp\u003EIs there a list somewhere that shows what activities give them and how the skills of the Kerbals increase with them?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-31T09:16:24Z\u0022 title=\u002207/31/2015 09:16  AM\u0022 data-short=\u00228 yr\u0022\u003EJuly 31, 2015\u003C/time\u003E by THobson\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Glaran K\u0026#039;erman","CreatedById":146334,"CreatedDateTime":"2015-07-27T22:08:56Z","Content":"\n\u003Cp\u003EFound this for ya, \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/104239-Leveling-Up-Kerbals-The-Training-Program\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/104239-Leveling-Up-Kerbals-The-Training-Program\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EUpdate: Wiki is sometimes outdated but here\u0027s the link to that as well, \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Experience\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.kerbalspaceprogram.com/wiki/Experience\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-27T22:12:09Z\u0022 title=\u002207/27/2015 10:12  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 27, 2015\u003C/time\u003E by Glaran K\u0026#39;erman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Crown","CreatedById":18262,"CreatedDateTime":"2015-07-28T08:50:00Z","Content":"\n\u003Cp\u003EPerfect. Very useful information. I\u0027m going to use this some day. Thanks for posting\u003C/p\u003E\n"},{"CreatedByName":"THobson","CreatedById":97709,"CreatedDateTime":"2015-07-28T14:52:33Z","Content":"\n\u003Cp\u003EThat\u0027s really helpful. Thanks. So no experience points for planting a flag on Kerbol I see.\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2015-07-28T15:06:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022THobson\u0022 data-cite=\u0022THobson\u0022\u003E\u003Cdiv\u003EThat\u0027s really helpful. Thanks. So no experience points for planting a flag on Kerbol I see.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027re welcome to try it if you wish. Just don\u0027t expect great results...\u003C/p\u003E\u003Cp\u003EOne thing to note about the experience system is that the points aren\u0027t cumulative for a given body; each Kerbal is simply awarded for the highest scoring activity they performed. For example - let\u0027s say you\u0027re headed to Mun with Jeb, Bob and Bill. You flyby the Mun (2 pts) when you enter its SOI, and then later orbit the Mun (3 pts). Jeb and Bob land on the Mun (4.6 pts) and Jeb plants a flag (5 pts) before you head back to Kerbin. Jeb will have 5 points of Mun experience (even though he did all those activities). Bob will have 4.6 points of Mun experience (since he landed on the Mun), and Bill will have 3 (since all he did was orbit the Mun).\u003C/p\u003E\u003Cp\u003EThen each level is based on total accumulated experience points: You reach one star at 2 points, two-stars at 8 points, three stars at 16 points, four stars at 32 points and five stars at 64 points.\u003C/p\u003E\n"},{"CreatedByName":"THobson","CreatedById":97709,"CreatedDateTime":"2015-07-28T17:13:47Z","Content":"\n\u003Cp\u003EIn the above example if Jeb, Bill and Bob return to the Min on another trip and let\u0027s say Jeb does not land but Bill and Bob do and they both plant a flag each, do they all get points to add to what they have (i.e. Jeb gets \u002B3 for orbiting and Bill and Bob get \u002B5 each for planting the flag) or does Jeb get 0 pts, Bob get 0.4 pts and Bill get \u002B2 puts to bring them both up to the points for planing a flag each (so they all end up at 5 pts each)? In other words does the non-cumulation of points for a given body apply to multiple trips to that body or does it only apply for a single trip?\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2015-07-28T20:20:29Z","Content":"\n\u003Cp\u003EThe non-accumulation applies over every trip you make to that body. So after the second trip, all three of them are at 5 points for Mun - in fact, if you look at it from the standpoint of just trying to gain experience, Jeb really had no reason to go back to Mun...\u003C/p\u003E\u003Cp\u003EAssuming each of the guys orbited Kerbin prior to heading out to the Mun, and assuming they\u0027ve made no trips out to Minmus at all, they\u0027d be sitting at seven points total - two for orbiting Kerbin (the most you can ever get from Kerbin) and then five for planting flags on Mun (the most you can get from Mun). And they\u0027d all three be on the cusp of the two-star rating (one point short - still just one-star). \u003C/p\u003E\u003Cp\u003EThat of course, assumes that you return them to Kerbin after each trip; points aren\u0027t awarded until Kerbals return to KSC. So you could in theory launch them to orbit, have them plant flags on Mun, then go plant flags on Minmus, and then shoot them into a brief Kerbolar orbit having done nothing else prior; they\u0027d have zero experience points prior to the flight, but immediately upon return they\u0027d all rocket straight to three-star status with a total of nineteen XP (two for orbiting Kerbin, five for planting flags on Mun, six points for planting flags on Minmus and then another six for orbiting Kerbol).\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-07-28T22:10:31Z","Content":"\n\u003Cp\u003EThanks for the props about my training program post \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"}]}