{"TopicId":117091,"ForumId":25,"TopicTitle":"WW2 BAD-T - World War 2 BDArmory AI Dogfight Tournament [FINISHED]","CreatedByName":"tetryds","CreatedById":50204,"CreatedDateTime":"2015-07-28T18:37:28Z","PageNum":31,"Articles":[{"CreatedByName":"TheSpaceManiac","CreatedById":152329,"CreatedDateTime":"2016-01-31T03:14:57Z","Content":"\n\u003Cp\u003E\nI\u0027m not quite sure this is the right place to post this, but I created a flow chart for how I think Ai should behave.\u003Cimg class=\u0022ipsImage\u0022 src=\u0022http://imgur.com/jlib7bW.jpg\u0022 alt=\u0022jlib7bW.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"tetryds","CreatedById":50204,"CreatedDateTime":"2016-02-12T07:50:05Z","Content":"\n\u003Cp\u003E\n\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/121316-104\u0022\u003EAviator Arsenal\u003C/a\u003E just updated!\u003Cbr\u003E\nAnd we all know what that means, don\u0027t we?\u003Cbr\u003E\nHave fun trying out the new features while I finish setting up the next version of this challenge!\u003Cbr\u003E\nYet unsure if we continue using this thread or make another, but I think we can just stick around here, it will not take this long for new tournaments to happen after the next one now that AA is set up and everything.\n\u003C/p\u003E\n"},{"CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2016-02-15T02:39:55Z","Content":"\n\u003Cp\u003E\nDid you think about specific areas being \u0022captured\u0022? Like when there\u0027s some outpost and when one team wins over it it becomes theirs. And the whole Kerbin could be split into some areas with landmarks and such. When one team captures it the other has to recapture. If the \u0022home team\u0022 loses they no longer take part in the challenge and the landmark is taken by the \u0022away team\u0022 (AKA the attackers).\n\u003C/p\u003E\n\u003Cp\u003E\nAlso two teams only. Like Allies and the Axis. People choose their side (Team A or B \u002B colour of the wings/other parts?). I guess that would make it less of a tournament and more like a competition between two teams. Might be interesting to watch tho.\n\u003C/p\u003E\n"},{"CreatedByName":"tetryds","CreatedById":50204,"CreatedDateTime":"2016-02-15T02:48:09Z","Content":"\n\u003Cp\u003E\nYes I have thought about that, and about ways to implement that.\u003Cbr\u003E\nThe main problem is, how would I set up such teams, and which rules for conquering would I have.\u003Cbr\u003E\nThere are already many locations on Kerbin with airfields where battles will happen.\u003Cbr\u003E\nBut going further on the idea, it would be better to have two teams, people would choose a side to join, with limited spots.\u003Cbr\u003E\nThen, the team would decide where to place their defenses, that means each airfield would contain certain airplanes, as long as everyone participating has at least one.\u003Cbr\u003E\nIn turns people would choose to attack, and would only be allowed to attack the nearest targets.\n\u003C/p\u003E\n\u003Cp\u003E\nBut that requires too much organization, team-wise, could turn into roleplay and people could end up fighting each other because the other guy\u0027s plane was bad and lost because of it, that kind of stuff...\u003Cbr\u003E\nIt would work better if we had predefined \u0022leaders\u0022 for each team, me and a friend, or two friends of mine for instance.\u003Cbr\u003E\nWe/I would choose who gets on which team and only those leaders decide where to attack, using the airplanes provided by the community.\u003Cbr\u003E\nThe community feedback would be taken into account for making such decisions, so you would participate indirectly, through airplanes and opinions.\u003Cbr\u003E\nBut I am not sure if that would be fun for the airplane creators, what do you guys think?\n\u003C/p\u003E\n"},{"CreatedByName":"SuicidalInsanity","CreatedById":143878,"CreatedDateTime":"2016-02-15T05:52:41Z","Content":"\n\u003Cp\u003E\nOn one hand, plane creators might simply want to see an elimination tournament - see who\u0027s design is better, etc. On the other hand, this might allow more screen time for contestants\u0027 designs, since it sounds like  craft aren\u0027t removed from the roster following a loss?\n\u003C/p\u003E\n\u003Cp\u003E\nOne issue I can see would be the increased bookkeeping over a standard tournament ladder, From a plane creator perspective, there would be the risk of some peoples planes never appearing in combat if they don\u0027t get chosen/are located to a site away from the current front. Perhaps you could do something like simply assigning planes to A or B teams as planes are submitted until team rosters are full, and then having matches of 2 random A team planes vs 2 random B team planes? Perhaps record how many times a design got shot down/ scored kills over the course of n matches, if rankings are desired.\n\u003C/p\u003E\n"},{"CreatedByName":"tetryds","CreatedById":50204,"CreatedDateTime":"2016-02-15T05:54:22Z","Content":"\n\u003Cp\u003E\nI guess I will stick to the standard tournament ladder though.\n\u003C/p\u003E\n"},{"CreatedByName":"MightyDarkStar","CreatedById":115126,"CreatedDateTime":"2016-02-18T16:50:43Z","Content":"\n\u003Cp\u003E\nTo enter the next tournament will you have to have applied for the previous one? I have a pretty decent jet aircraft I\u0027d like to submit for the next one...\n\u003C/p\u003E\n"},{"CreatedByName":"tetryds","CreatedById":50204,"CreatedDateTime":"2016-02-18T17:40:32Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/115126-mightydarkstar/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022115126\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/115126-mightydarkstar/\u0022\u003E@MightyDarkStar\u003C/a\u003E of course not, anyone will be able to enter the next tournament.\n\u003C/p\u003E\n\u003Cp\u003E\nUnfortunatelly it\u0027s physically impossible for me to handle more than one tournament at once.\n\u003C/p\u003E\n\u003Cp\u003E\nThis means that if there are more types of airplane they will all fight on the same grouop.\n\u003C/p\u003E\n\u003Cp\u003E\nBut jets won\u0027t happen unless someone else compromises on hosting their battles and uploading the videos to youtube, in which case I would gladly set up rules for it and everything.\n\u003C/p\u003E\n"},{"CreatedByName":"tetryds","CreatedById":50204,"CreatedDateTime":"2016-02-20T18:00:21Z","Content":"\n\u003Cp\u003E\nBAD-T moved to a new thread!\n\u003C/p\u003E\n\u003Ciframe data-embedcontent=\u0022\u0022 frameborder=\u00220\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/132564-ww2-bad-t-2-ww2-bda-ai-dogfight-tournament-open/\u0026amp;do=embed\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}