{"TopicId":117090,"ForumId":36,"TopicTitle":"[WIP][1.8.x] SSTULabs - Low Part Count Solutions (Orbiters, Landers, Lifters) - Dev Thread [11-18-18]","CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2015-07-28T18:13:57Z","PageNum":214,"Articles":[{"CreatedByName":"gunt3rgam3r","CreatedById":151335,"CreatedDateTime":"2016-11-15T21:37:42Z","Content":"Hello team,\n\nThis is a great mod I love your parts...quick bug report, I was experiencing crashes in my modded game, so I installed sstu on a clean version of 1.2.1.  In the game every time I use the built-in parachutes on the Apollo and Orion reentries pods It creates a null reference...in almost all cases it leads to a full game crash right around touchdown.  If I use attached parachutes and not the internal ones there is no issue.\n\nNot sure exactly what is the problem, but this should point you in the right direction...FYI it sends a null reference to the log with both the drogue chutes and the main chutes.  Using the latest version 0.5.33.128 from github.\n\nthx"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-11-15T21:42:59Z","Content":"I would suggest zipping up the log, and posting a link to it."},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2016-11-15T23:43:28Z","Content":"\u003E \n\u003E \n\u003E 2 hours ago, gunt3rgam3r said:\n\u003E \n\u003E \n\u003E Hello team,\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E  \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E This is a great mod I love your parts...quick bug report, I was experiencing crashes in my modded game, so I installed sstu on a clean version of 1.2.1.  In the game every time I use the built-in parachutes on the Apollo and Orion reentries pods It creates a null reference...in almost all cases it leads to a full game crash right around touchdown.  If I use attached parachutes and not the internal ones there is no issue.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E  \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Not sure exactly what is the problem, but this should point you in the right direction...FYI it sends a null reference to the log with both the drogue chutes and the main chutes.  Using the latest version 0.5.33.128 from github.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E  \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E thx\n\u003E \n\nIn the future please include logs with bug reports; saves considerable time in having to ask for them, and often can point out exactly what the problem is.\n\nHowever you are in luck today as I was able to duplicate this bug with a simple craft. Have fixed the problem, and it will be available with the next update (likely this weekend).  Note, this fixes the nulref.  No clue what is causing your crashing, as I did not experience any crashes during testing.\n\nThe problem in this case was some back-end changes to the KSP code in regards to the setup of temporary debris objects; in this case they require that the rigidbody be manually assigned to the \u0027physicalObject.rb\u0027 field (in prior versions this field did not exist, or at least had an intelligent get method and would pull and cache the value automatically).  So now during creation of debris I manually assign the pO.rb field, and all is well.\n\nEdit:  As far as crashing goes, apparently there is a pretty severe bug in vanilla KSP related to part highlighting, aero-fx, and aero-debug displays that can cause crashes after a few minutes of gameplay.\n\n**Edited \u003Ctime datetime=\u00222016-11-15T23:44:37Z\u0022 title=\u002211/15/2016 11:44  PM\u0022 data-short=\u00227 yr\u0022\u003ENovember 15, 2016\u003C/time\u003E by Shadowmage**"},{"CreatedByName":"mechanicH","CreatedById":167929,"CreatedDateTime":"2016-11-16T00:00:03Z","Content":"i actually get that bug myself, but its not all the time. when i reload the game back to my save it works as intended."},{"CreatedByName":"StickyScissors","CreatedById":144204,"CreatedDateTime":"2016-11-16T02:11:27Z","Content":"This new stuff looks amazing! Now, to re-discover my will to play this game. Don\u0027t ya just love slow internet, broken patches and essential mods never getting updated? ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif \u0022:P\u0022)"},{"CreatedByName":"AlphaKerman","CreatedById":166470,"CreatedDateTime":"2016-11-16T14:26:44Z","Content":"Is there any ways to somehow edit the ablator heat shield durability? (.cfg file?) Because recently i started using Kerbol 64K, and their reentry speed is close to 5.4 km/s and it makes my kerbals toasted within few seconds of reentry ![:confused:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif \u0022:confused:\u0022)"},{"CreatedByName":"Jimbodiah","CreatedById":152759,"CreatedDateTime":"2016-11-16T15:17:36Z","Content":"Yes, but you can adjust heat production in the ksp settings which might be easier. Else use this (change to reflect the mod you are using or just remove).\n\n    @PART[*]:HAS[@MODULE[SSTUModularHeatShield]]:NEEDS[RealSolarSystem]:AFTER[SSTU]\n    {\n        @RESOURCE[Ablator]\n        {    @amount *= 3    @maxAmount *= 3\n        }\n    }"},{"CreatedByName":"FrancoisH","CreatedById":124888,"CreatedDateTime":"2016-11-16T16:40:35Z","Content":"Hello there,\n\nBefore submitting a bug as I did yesterday for something not related to SSTU, I would like to ask here for a clue ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022)\n\nI do like a lot Action Groups Extended as it improve greatly your capacity to create actions, even in flight.\n\nBut, with the SSTU fairing bases, it generates a flow in my log file, enough to make the game freezing every second.\n\n    LOG 17:27:09.317] AGX Flight Update Error 7i System.NullReferenceException: Object reference not set to an instance of an object\n      at ActionGroupsExtended.AGXFlight.LoadVesselDataFromPM (ActionGroupsExtended.ModuleAGX rootAGX) [0x00000] in  unknown\u003E:0 \n      at ActionGroupsExtended.AGXFlight.Update () [0x00000] in  unknown\u003E:0 \n\nIt\u0027s the only parts (the fairing bases) that generate this error yet... I will have to check with others.\n\nDo you think it\u0027s an AGX issue or SSTU, or both? That\u0027s really curious.\n\nThanks\n\n**Edited \u003Ctime datetime=\u00222016-11-16T16:41:15Z\u0022 title=\u002211/16/2016 04:41  PM\u0022 data-short=\u00227 yr\u0022\u003ENovember 16, 2016\u003C/time\u003E by FrancoisH**"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2016-11-16T16:42:13Z","Content":"\u003E \n\u003E \n\u003E 1 hour ago, AlphaKerman said:\n\u003E \n\u003E \n\u003E Is there any ways to somehow edit the ablator heat shield durability? (.cfg file?) Because recently i started using Kerbol 64K, and their reentry speed is close to 5.4 km/s and it makes my kerbals toasted within few seconds of reentry ![:confused:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif \u0022:confused:\u0022)\n\u003E \n\nThe proper way is to increase the \u0027fluxMult\u0027 value in the parts \u0027SSTUModularHeatShield\u0027 module.\n\n    @PART[*]:HAS[@MODULE[SSTUModularHeatShield]]:AFTER[SSTU]\n    {@fluxMult *= 1.5\n    }\n\nCan up that multiplier further if 1.5 is not enough.\n\nWhat this does is make each unit of ablator carry away even more heat.  As the ablator use is determined by a curve keyed to heat values, this effectively increases the heat rejection at all given points along the curve, while keeping the ablator use constant (same heat input with more heat rejection = slower heat rise / less heat making it into the part / faster cooldown once past peak heating).\n\nAlthough, as Jimbodiah points out, I believe the correct way to get proper heating in rescaled systems is to down-scale **-all-** stock re-entry heating;  the stock heating is setup to generate earth-level re-entry heating at about 1/4 of the velocity; so it is not at all cheating to reduce this value proportionately to your rescale (otherwise you will end up with heating -far- worse than what is experienced on real re-entries).\n\n\u003E \n\u003E \n\u003E 20 minutes ago, Jimbodiah said:\n\u003E \n\u003E \n\u003E Yes, but you can adjust heat production in the ksp settings which might be easier. Else use this (change to reflect the mod you are using or just remove).\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E     \n\u003E     \n\u003E     @PART[*]:HAS[@MODULE[SSTUModularHeatShield]]:NEEDS[RealSolarSystem]:AFTER[SSTU]\n\u003E     {\n\u003E         @RESOURCE[Ablator]\n\u003E         {    @amount *= 3    @maxAmount *= 3\n\u003E         }\n\u003E     }\n\u003E \n\nThat patch might work to increase ablator resource (not sure, as it gets manipulated by the heat-shield module when changing types, so the patch might not stick), but increases overall mass of the part.  Also would not do anything about the increased heat load on the heat shield from the faster temps -- as my module is designed to allow the part to overheat even when there is still ablator on it (peak heat), merely upping the ablator might not fix the problem.\n\nI haven\u0027t tested the heat shields outside of stock though... so they may work with merely increased ablator (but shouldn\u0027t... the increased peak heat should overload the shield, and things should still explode...).  You probably know better than I do on that, so if I am wrong (and increasing ablator does allow them to function in rescales), please let me know so that I can fix the plugin code to work as it should.\n\nAlso a bit more playing around with texturing the torus parts...\n\n![T4LQZd3.png](http://i.imgur.com/T4LQZd3.png)\n\nMore fun with normal maps; have pushed them about as far as they can go, there is not much more effect that a normal map could do.  For reference, that is a standard torus mesh, all of the beveling and bulging is part of the normal map.\n\n\u003E \n\u003E \n\u003E 1 minute ago, FrancoisH said:\n\u003E \n\u003E \n\u003E Hello there,\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Before submitting a bug as I did yesterday for something not related to SSTU, I would like to ask here for a clue ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022)\n\u003E \n\u003E \n\u003E \n\u003E I do like a lot Action Groups Extended as it improve greatly your capacity to create actions, even in flight.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E But, with the SSTU fairing bases, it generates a flow in my log file, enough to make the game freezing every second.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E     \n\u003E     \n\u003E     LOG 17:27:09.317] AGX Flight Update Error 7i System.NullReferenceException: Object reference not set to an instance of an object\n\u003E       at ActionGroupsExtended.AGXFlight.LoadVesselDataFromPM (ActionGroupsExtended.ModuleAGX rootAGX) [0x00000] in  unknown\u003E:0 \n\u003E       at ActionGroupsExtended.AGXFlight.Update () [0x00000] in  unknown\u003E:0 \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E It\u0027s the only parts (the fairing bases) that generate this error yet... I will have to check with others.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Do you think it\u0027s an AGX issue or SSTU, or both? That\u0027s really curious.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Thanks\n\u003E \n\nMore than likely is an issue in AGX -- I don\u0027t do anything strange with action groups in my plugins."},{"CreatedByName":"FrancoisH","CreatedById":124888,"CreatedDateTime":"2016-11-16T16:47:48Z","Content":"\u003E \n\u003E \n\u003E 3 minutes ago, Shadowmage said:\n\u003E \n\u003E \n\u003E More than likely is an issue in AGX -- I don\u0027t do anything strange with action groups in my plugins.\n\u003E \n\nEven with my really low skills in parts development, I think you\u0027re right, but as I don\u0027t like things not working, I prefer to ask and get all info I can ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022)\n\nAGX is widely used and it would be a shame if I couldn\u0027t use it with my beloved SSTU parts ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022)\n\nThanks for your answer."},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2016-11-16T16:51:22Z","Content":"\u003E \n\u003E \n\u003E Just now, FrancoisH said:\n\u003E \n\u003E \n\u003E Even with my really low skills in parts development, I think you\u0027re right, but as I don\u0027t like things not working, I prefer to ask and get all info I can ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022)\n\u003E \n\u003E \n\u003E \n\u003E AGX is widely used and it would be a shame if I couldn\u0027t use it with my beloved SSTU parts ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022)\n\u003E \n\u003E \n\u003E \n\u003E Thanks for your answer.\n\u003E \n\nChances are you just need to report it to Diazo; he\u0027s a pretty good modder and can probably fix whatever the problem is, or at least he can tell you (or me) what my code is doing wrong if it turns out to be SSTU related (I don\u0027t think it is, but is still a possibility).\n\nSo, you might not be able to use them together -right now- and may need to merely wait for an updated release of one mod or the other -- don\u0027t lose hope ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022)"},{"CreatedByName":"FrancoisH","CreatedById":124888,"CreatedDateTime":"2016-11-16T16:53:13Z","Content":"\u003E \n\u003E \n\u003E Just now, Shadowmage said:\n\u003E \n\u003E \n\u003E So, you might not be able to use them together -right now- and may need to merely wait for an updated release of one mod or the other -- don\u0027t lose hope ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022)\n\u003E \n\nMy kerbal adventure is a on-off story. I come back after major releases... Now that I can load (almost) what I want without worrying with multiple tools (to unlock x64, to reduce texture sizes, etc...) I\u0027m quite happy and will try to stick a bit longer.\n\nSo I never lose hope. I love this game."},{"CreatedByName":"FrancoisH","CreatedById":124888,"CreatedDateTime":"2016-11-16T17:55:11Z","Content":"\u003E \n\u003E \n\u003E 1 hour ago, Shadowmage said:\n\u003E \n\u003E \n\u003E Chances are you just need to report it to Diazo; he\u0027s a pretty good modder and can probably fix whatever the problem is, or at least he can tell you (or me) what my code is doing wrong if it turns out to be SSTU related (I don\u0027t think it is, but is still a possibility).\n\u003E \n\nHe\u0027ll have nothing to update... I just had to get rid of Procedural Fairings and it\u0027s done... The lastest updates all fairings including yours and is the cause of th bug. I had it before your fairings were available. Thanks."},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2016-11-16T19:37:13Z","Content":"You guys probably are sick of seeing the technical images... but some of this stuff is just so neat that I have to share ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022)  (I also find it neat that I\u0027m still learning new techniques for modeling \u002B texturing, things that I just didn\u0027t know were possible, or had no idea how to implement)\n\nThis is some of what a properly setup normal map can do for an otherwise low-poly mesh;  contrast the top two torus with the bottom two, all four are using simple flat geometry for the torus mesh.  This render is done with normal map only, diffuse\u002Bspecular textures have been disabled.  The effect wont\u0027 be as pronounced on the finished models as most of what is seen below comes from the specular highlights, where these models will have very little specular highlighting on the inflatable portions.\n\n![E0Rfyy3.png](http://i.imgur.com/E0Rfyy3.png)\n\nThey can bring such smooth details and shading to otherwise simple models that most models just don\u0027t look correct to me without some sort of normal mapping.  Whether it be just a simple noise pattern of bumps, striations, etc, most models could be improved through a bit of normal mapping.\n\nGranted, on these models I could have accomplished the same thing through adding more edge loops and carefully setting the vertex/edge/face shading, but it would have more than doubled the poly count of the torus meshes and increased the complexity of the UV and animation processes unnecessarily.\n\nSame geometry as above, but with the diffuse and specular textures enabled (textures nowhere near finished, but the general layout is probably staying mostly as shown):\n\n![QqDuLHJ.png](http://i.imgur.com/QqDuLHJ.png)\n\nI\u0027m not entirely happy with the segmenting (think it is a bit too much), but I\u0027m not sure I\u0027ll be able to do it any differently due to how it is unwrapped/laid out (without adding a bunch more unique UV islands / increasing texture size / reducing texture resolution).  Got a few ideas I\u0027m going to try out though, might be able to reduce the segmenting on the lower two torus by half."},{"CreatedByName":"RedParadize","CreatedById":129285,"CreatedDateTime":"2016-11-16T20:09:40Z","Content":"Segmenting is fine, however the line is a bit thick, if you would make it thinner it would look better. Look at the size of the structure around the connecting tube, that should be your benchmark for size of details. On the same subject, if you subdivide the segmenting, the torus will look bigger. Think about Star wars destroyers: Smaller details = Looking bigger.\n\nHaving said that, it look awesome!\n\n**Edited \u003Ctime datetime=\u00222016-11-16T20:10:30Z\u0022 title=\u002211/16/2016 08:10  PM\u0022 data-short=\u00227 yr\u0022\u003ENovember 16, 2016\u003C/time\u003E by RedParadize**"},{"CreatedByName":"FrancoisH","CreatedById":124888,"CreatedDateTime":"2016-11-17T12:34:54Z","Content":"Just a question about textures : Is there any \u0022gold\u0022 texture like those on satellite? I thought there was a texture pack available for SSTU but probably am I wrong ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022)"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2016-11-17T17:03:49Z","Content":"\u003E \n\u003E \n\u003E 3 hours ago, FrancoisH said:\n\u003E \n\u003E \n\u003E Just a question about textures : Is there any \u0022gold\u0022 texture like those on satellite? I thought there was a texture pack available for SSTU but probably am I wrong ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022)\n\u003E \n\nYes, but probably not exactly what you are looking for.  The MFT tanks should all have a \u0027gold\u0027 texture option, which with the shaders in use by KSP results in more of a \u0027shiny yellow\u0027 look to it.  Sadly I could not get any acceptable \u0027gold foil\u0027 looks without proper reflective shader support (they are possible to \u0027fake\u0027 through the diffuse channels, but look terrible on a moving object or non-fixed camera as the reflection does not change with perspective, environment, or lighting).\n\nThere was a texture pack for \u003C=1.1 versions but it has not been updated after the changes to shaders on the fuel tanks.  I think [@JoseEduardo](https://forum.kerbalspaceprogram.com/index.php?/profile/127759-joseeduardo/) was going to add it into one of his SSTU expansion packs, but unsure on the status of it at the moment."},{"CreatedByName":"JoseEduardo","CreatedById":127759,"CreatedDateTime":"2016-11-17T17:07:00Z","Content":"\u003E \n\u003E \n\u003E 7 minutes ago, Shadowmage said:\n\u003E \n\u003E \n\u003E There was a texture pack for \u003C=1.1 versions but it has not been updated after the changes to shaders on the fuel tanks.  I think [@JoseEduardo](https://forum.kerbalspaceprogram.com/index.php?/profile/127759-joseeduardo/) was going to add it into one of his SSTU expansion packs, **\u003Cu\u003Ebut unsure on the status of it at the moment.\u003C/u\u003E**\n\u003E \n\nin between GTA V, Elite Dangerous, and pending finishing this: [http://imgur.com/a/HprcB](http://imgur.com/a/HprcB) and the stock engines conversion into clustered engines  \n\nI might also wait to include ABLaunchers and DIRECT tanks to it too...  \n\nEDIT: forgot to mention, it has improved already since this album was made\n\n**Edited \u003Ctime datetime=\u00222016-11-17T17:11:42Z\u0022 title=\u002211/17/2016 05:11  PM\u0022 data-short=\u00227 yr\u0022\u003ENovember 17, 2016\u003C/time\u003E by JoseEduardo**"},{"CreatedByName":"Jimbodiah","CreatedById":152759,"CreatedDateTime":"2016-11-17T18:11:56Z","Content":"\u003E \n\u003E \n\u003E 1 hour ago, JoseEduardo said:\n\u003E \n\u003E \n\u003E in between GTA V, Elite Dangerous\n\u003E \n\nSpoiler\n\npew pew\n\n![jimbodiah_161117.jpg](http://kerbal.nl/jimbodiah_161117.jpg)"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2016-11-17T22:33:01Z","Content":"Updated deploy animation sequences, with current texturing.  This is the \u0027final\u0027 rigging and animation that will be used for the parts, and the geometry at this point is complete (any further changes will require complete re-rigging of the models, due to the blendshape animations in use which do not tolerate mesh changes very well).  Notable changes from previous renders include making the segment lines a bit thinner, updated normal mapping on segments, and rotated the cloth noise texture 90\u0027 (helps with distortion in retracted state, and generally looks a bit better).\n\n10m:  \n![yHcFMJb.gif](http://i.imgur.com/yHcFMJb.gif)\n\n20m:  (noticed some z-fighting in the animation on the crew tubes that has been fixed up...)  \n![u7xw7zP.gif](http://i.imgur.com/u7xw7zP.gif)\n\n35m:  \n![MU9gn30.gif](http://i.imgur.com/MU9gn30.gif)\n\n50m:  \n![7WzdOgP.gif](http://i.imgur.com/7WzdOgP.gif)\n\nTexturing is still only about 50% done; the torus meshes are the most complete and probably won\u0027t have too much more done to them, but the rest of the structure has not yet been touched aside from playing around with coloring and noise.  Will be adding a bit more detail to the central pillars / rotating sections, clean up the details on the counterweights, and possibly changing the external bracing to look less metallic.\n\nShould be able to release all of these over this weekend.  Will include an initial balance pass on the configs so that they should be at least usable, and will try to do an initial \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E-LS config as well (no idea how well it will be balanced).  Going to try and sneak in some time to clean up the solar panel shader as it has some...odd... issues that I noticed recently; going to require some additional dev tools to debug shaders, which apparently is still some sort of arcane voodoo requiring jumping through more than a couple hoops to get it set up.\n\nNext week will be working on finishing up the force-based wheel implementation and at least getting it usable for the shuttle landing gear (SC-E) -- already was working last I used it, so probably won\u0027t take too much work to get it usable; far more effort will be put into cleaning up the edge cases and some of the less-desirable side effects (sliding on hills, multi-frame force smoothing, reducing/eliminating jitters when used in KSP).  Have most of next week and part of the week after off from work so should be able to make very substantial progress and hopefully even get it finished up to surprise Lo-fi when he returns (would make a lot of people in the KF thread very happy)."},{"CreatedByName":"mechanicH","CreatedById":167929,"CreatedDateTime":"2016-11-18T00:38:38Z","Content":"\u003E \n\u003E \n\u003E 2 hours ago, Shadowmage said:\n\u003E \n\u003E \n\u003E SC-E\n\u003E \n\n@shadowmage that word  alone makes me  extremely happy. Thank you so much for working on it.\n\nForgot to ask, are you going to put in the option to inflate the HABs without rocket parts? \n\n**Edited \u003Ctime datetime=\u00222016-11-18T00:40:10Z\u0022 title=\u002211/18/2016 12:40  AM\u0022 data-short=\u00227 yr\u0022\u003ENovember 18, 2016\u003C/time\u003E by mechanicH**"},{"CreatedByName":"JoseEduardo","CreatedById":127759,"CreatedDateTime":"2016-11-18T03:52:24Z","Content":"\u003E \n\u003E \n\u003E On 11/15/2016 at 9:43 PM, Shadowmage said:\n\u003E \n\u003E \n\u003E In the future please include logs with bug reports; saves considerable time in having to ask for them, and often can point out exactly what the problem is.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E However you are in luck today as I was able to duplicate this bug with a simple craft. Have fixed the problem, and it will be available with the next update (likely this weekend).  Note, this fixes the nulref.  No clue what is causing your crashing, as I did not experience any crashes during testing.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E The problem in this case was some back-end changes to the KSP code in regards to the setup of temporary debris objects; in this case they require that the rigidbody be manually assigned to the \u0027physicalObject.rb\u0027 field (in prior versions this field did not exist, or at least had an intelligent get method and would pull and cache the value automatically).  So now during creation of debris I manually assign the pO.rb field, and all is well.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E  \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Edit:  As far as crashing goes, apparently there is a pretty severe bug in vanilla KSP related to part highlighting, aero-fx, and aero-debug displays that can cause crashes after a few minutes of gameplay.\n\u003E \n\nsame issue, crashed twice shortly after deploying Orion\u0027s drogue chutes, here\u0027s the log: [https://dl.dropboxusercontent.com/u/58212317/KSP (9).log](https://dl.dropboxusercontent.com/u/58212317/KSP%20%289%29.log)  \n\ntell me if you need the crash logs as well"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-11-18T04:40:13Z","Content":"I just had an LR81 engine firing (visual effects alone, not using fuel, or doing damage) as soon as the craft spawned to the launch site. Was \u0022on\u0022 the whole flight. Functioned normally, but visual effect was always on. Might be other mods. Need to test clean.\n\n**Edited \u003Ctime datetime=\u00222016-11-18T04:49:10Z\u0022 title=\u002211/18/2016 04:49  AM\u0022 data-short=\u00227 yr\u0022\u003ENovember 18, 2016\u003C/time\u003E by tater**"},{"CreatedByName":"Jimbodiah","CreatedById":152759,"CreatedDateTime":"2016-11-18T05:40:09Z","Content":"Another mod that uses a RealPlumes patch the wrong way?"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-11-18T06:01:17Z","Content":"I don\u0027t have real plumes installed, but I suppose it could still conflict. I have TRAILS on now (a Gemini capsule), that\u0027s the only new parts mod I think.\n\nTrails had a real plume cfg installed, which I yanked, and the problem went away.\n\n**Edited \u003Ctime datetime=\u00222016-11-18T07:12:23Z\u0022 title=\u002211/18/2016 07:12  AM\u0022 data-short=\u00227 yr\u0022\u003ENovember 18, 2016\u003C/time\u003E by tater**"}]}