{"TopicId":117243,"ForumId":39,"TopicTitle":"When boredom leads to writing...","CreatedByName":"Fred Cop","CreatedById":146298,"CreatedDateTime":"2015-07-30T06:30:57Z","PageNum":1,"Articles":[{"CreatedByName":"Fred Cop","CreatedById":146298,"CreatedDateTime":"2015-07-30T06:30:57Z","Content":"\n\u003Cp\u003E...20,000 meters...\u003C/p\u003E\u003Cp\u003ESlowly rising from the depths of Kerbins atmosphere came a Mk.1 rocket fit for orbit. The layers of blue sky disappeared and space revealed it\u0027s face to Hadson Kerman. Hadson was the paranoid type, he had his mouth open in fear for the whole trip but he seemed to be calming down, only in 4 minutes he would be in orbit and he wouldn\u0027t have to worry about anything.\u003C/p\u003E\u003Cp\u003E...30,000 meters...\u003C/p\u003E\u003Cp\u003E*Beep* \u0022Hadson Kerman? This is KSC, Prepare for decoupling Stage 04 in T-... ...23 seconds.\u0022\u003C/p\u003E\u003Cp\u003E\u0022KSC, should I Jettison the Fuel along with the thrusters?\u0022\u003C/p\u003E\u003Cp\u003ESilence, with Hadson\u0027s breath resounding through the Mk.1 capsule.\u003C/p\u003E\u003Cp\u003E*Beep* \u0022Go ahead, Hadson, just remember; do it in the next 12 seconds\u0022\u003C/p\u003E\u003Cp\u003E...40,000 meters...\u003C/p\u003E\u003Cp\u003EHadson brought the Throttle to zero and readied his hand over the Staging button, counting from 10 in his head. Upon reaching \u0022one...\u0022 he pushed the Staging button firmly. Hadson expected a sudden explosion, he was used to that on land (and in sub-orbital flight is another thing), but none came.\u003C/p\u003E\u003Cp\u003E...50,000 meters...\u003C/p\u003E\u003Cp\u003E*Beep* \u0022Hadson Kerman, you are approaching your Apoapsis in T-1 minute. Thrust at full for 32 seconds and you should raise your Periapsis, then decrease your thrust to 30% and continue for 6 seconds to level out both ends of your orbit.\u0022\u003C/p\u003E\u003Cp\u003E...60,000 meters...\u003C/p\u003E\u003Cp\u003EA Blue mark appeared on the NavBall, marking the direction for the orbital manoeuvre. Using Monopropelant and disabling the SAS modules, Hadson slowly spun towards the Blue mark and no matter how delicately he did, he was too fast to slow down directly on or before the mark. He then moved the vessel in the other direction but more slowly, and as soon as he aimed towards the point, he activated SAS and sat back.\u003C/p\u003E\u003Cp\u003E*Beep* \u0022Hadson, you will approach your Apoapsis in 30 seconds, prepare for thrusting\u0022\u003C/p\u003E\u003Cp\u003E...70,000 meters...\u003C/p\u003E\u003Cp\u003E\u0022Roger, I\u0027m pointed towards the Manoeuvre.\u0022\u003C/p\u003E\u003Cp\u003E*Beep* \u0022Good work, but its not over yet... ...15 seconds.\u0022\u003C/p\u003E\u003Cp\u003EHadson slowly grasped the Throttle.\u003C/p\u003E\u003Cp\u003E*Beep* \u002210 seconds\u0022\u003C/p\u003E\u003Cp\u003EHadson looked out the window, looking towards the beautiful sight of Kerbin below.\u003C/p\u003E\u003Cp\u003E*Beep* \u00225 seconds, 3...\u0022\u003C/p\u003E\u003Cp\u003ESomething suddenly blocked the view of the Mk.1 window.\u003C/p\u003E\u003Cp\u003E\u0022...seconds, 2, 1...\u0022\u003C/p\u003E\u003Cp\u003E...74,748 meters...\u003C/p\u003E\u003Cp\u003EHadson, gripping the Throttle, thrust it forward. The object blocking the view seemingly zoomed towards the craft before...\u003C/p\u003E\u003Cp\u003E**CRASH**\u003C/p\u003E\u003Cp\u003EHadson gripped to his controls as much as possible when the craft slowly but suddenly rolled. Anything outside the window randomly switched between Kerbin and Space. Shaking himself out of shock, Hadson shut off the engines.\u003C/p\u003E\u003Cp\u003E*Beep* \u0022Hadson!? HADSON!?...\u0022\u003C/p\u003E\u003Cp\u003EThe sound of Gene Kerman shouting Hadson\u0027s name seemed to ricochet around the Mk.1 capsule.\u003C/p\u003E\u003Cp\u003E\u0022...What happened!?!\u0022\u003C/p\u003E\u003Cp\u003EHadson attempted to up-right the craft, or at least he did the best he could according to the NavBall.\u003C/p\u003E\u003Cp\u003E\u0022KSC, Something happened...\u0022\u003C/p\u003E\u003Cp\u003E...70,000 meters...\u003C/p\u003E\u003Cp\u003E\u0022...I think the debris from Stage 04 collided with the craft. Although I can\u0027t tell what\u0027s been damaged, could you tell me, KSC?\u0022\u003C/p\u003E\u003Cp\u003E*Beep* \u0022We can\u0027t, sorry, but your better prepare yourself Hadson; your Apoapsis, including you, is dropping towards Kerbin.\u0022\u003C/p\u003E\u003Cp\u003E\u0022I\u0027ll deploy the parachut--\u0022\u003C/p\u003E\u003Cp\u003E*Beep* \u0022NO! We don\u0027t want what happened to Jeb to happen to you.\u0022\u003C/p\u003E\u003Cp\u003E...60,000 meters...\u003C/p\u003E\u003Cp\u003E\u0022KSC, shall I skip to Stage 02?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Go ahead, Hadson Kerman\u0022\u003C/p\u003E\u003Cp\u003EHadson gave the Staging button two presses to reach the re-entry Stage, where all his rocket consisted of at this point was a Mk.1 capsule, a parachute and a Heat shield. Slowly the re-entry effects faded into view, and the capsule began to slowly sway as Kerbin\u0027s atmosphere tried to slow down the rocket\u0027s descent.\u003C/p\u003E\u003Cp\u003E...50,000 meters...\u003C/p\u003E\u003Cp\u003EHaving not noticed it until now, Hadson turned the capsule around till the Heat shield faced towards Kerbin, hence receiving all the heat. Hadson stared towards both the instruments on the dashboard for Distance and Speed.\u003C/p\u003E\u003Cp\u003EThe rocket began to move from swaying to shuddering.\u003C/p\u003E\u003Cp\u003E...40,000 meters...\u003C/p\u003E\u003Cp\u003E\u0022KSC, can I do anything else to slow my descent?\u0022\u003C/p\u003E\u003Cp\u003E*Beep* \u0022Do-- --ry a--ut --\u0022\u003C/p\u003E\u003Cp\u003EThe radio feed from KSC was beginning to increase with the sound of static.\u003C/p\u003E\u003Cp\u003E...30,000 meters...\u003C/p\u003E\u003Cp\u003E\u0022KSC, can I deploy my parachutes!?\u0022 Hadson\u0027s voice trembled as much as the capsule did.\u003C/p\u003E\u003Cp\u003E*Beep* \u0022----------------------------\u0022\u003C/p\u003E\u003Cp\u003E...20,000 meters...\u003C/p\u003E\u003Cp\u003EHadson reached for the Staging Button...\u003C/p\u003E\u003Cp\u003E...10,000 meters...\u003C/p\u003E\u003Cp\u003E...and pressed it...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-31T08:21:59Z\u0022 title=\u002207/31/2015 08:21  AM\u0022 data-short=\u00228 yr\u0022\u003EJuly 31, 2015\u003C/time\u003E by Fred Cop\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-07-30T18:22:21Z","Content":"\n\u003Cp\u003EApoapsis and Periapsis.\u003C/p\u003E\u003Cp\u003EOrbit takes about 8 minutes at most in KSP, 5 minutes usually. Nowhere near 26 minutes.\u003C/p\u003E\u003Cp\u003EAnd of course, we all know what happened to poor Hadson and his parachute when he deployed early.\u003C/p\u003E\n"},{"CreatedByName":"Fred Cop","CreatedById":146298,"CreatedDateTime":"2015-07-31T08:23:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GregroxMun\u0022 data-cite=\u0022GregroxMun\u0022\u003E\u003Cdiv\u003EApoapsis and Periapsis.\u003Cp\u003EOrbit takes about 8 minutes at most in KSP, 5 minutes usually. Nowhere near 26 minutes.\u003C/p\u003E\u003Cp\u003EAnd of course, we all know what happened to poor Hadson and his parachute when he deployed early.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENoted, I\u0027ve edited the story to fix the mentioned mistakes. I will admit, the \u002226 minutes\u0022 part was an attempt to be somewhat realistic, but rather \u0022non-Kerbal\u0022.\u003C/p\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-07-31T16:18:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fred Cop\u0022 data-cite=\u0022Fred Cop\u0022\u003E\u003Cdiv\u003ENoted, I\u0027ve edited the story to fix the mentioned mistakes. I will admit, the \u002226 minutes\u0022 part was an attempt to be somewhat realistic, but rather \u0022non-Kerbal\u0022.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn real life, launches take 7-9 minutes IIRC.\u003C/p\u003E\n"}]}