{"TopicId":117201,"ForumId":16,"TopicTitle":"Position probe in orbit of planet 170* off?","CreatedByName":"xtoro","CreatedById":79015,"CreatedDateTime":"2015-07-29T20:14:16Z","PageNum":1,"Articles":[{"CreatedByName":"xtoro","CreatedById":79015,"CreatedDateTime":"2015-07-29T20:14:16Z","Content":"\n\u003Cp\u003ESo I have outer planets installed. I\u0027d like to use Jool\u0027s orbit as a relay network using RemoteTech. One probe will orbit Jool on a polar orbit, and I want the other to be on the same orbital path as Jool, but 170 degrees off, almost directly opposite from it, behind the sun. The reason I want it 170 degrees and not 180 is so that the sun doesn\u0027t block the signal between the 2 probes. \u003C/p\u003E\u003Cp\u003EWhat\u0027s the best way of doing this while using as little dV as possible? \u003C/p\u003E\u003Cp\u003EOption A) Launch ~180* off of the normal launch window, but use lots of dV to raise the PE when I get to the AP.\u003C/p\u003E\u003Cp\u003EOption \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E Launch to Jool, capture, then leave Jool SOI to have similar orbit. Then lower PE or raise AP to get a different orbital period, and wait years for them to be opposite from each other.\u003C/p\u003E\u003Cp\u003EOption C?) Is there maybe some gravity assist that might help land me close to where I want to be?\u003C/p\u003E\n"},{"CreatedByName":"CalculusWarrior","CreatedById":58313,"CreatedDateTime":"2015-07-29T20:25:12Z","Content":"\n\u003Cp\u003EOption A will be the fastest one, but yes as you noted, it will use quite a bit of delta-v (as it\u0027s essentially a Hohmann Transfer in solar orbit). B will take as much delta-v as a Jool transfer (plus the amount spent maneuvering), but will take many, many years to work. As for C, I\u0027m not an expert on gravity assists; it may be possible to use Jool to edit your orbit so that it\u0027s close to what you want, but that will likely take a long time as well.\u003C/p\u003E\u003Cp\u003EThus, in my opinion, Option B is your best shot.\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-07-29T20:34:22Z","Content":"\n\u003Cp\u003EYou might save some dV with option B, but it seems like a lot of hassle-- most of the dV in going to Jool is with Kerbin departure, not Jool arrival. I\u0027d go with option A. It\u0027s just a relay satellite, right? Not like it\u0027s going to be a monster huge craft, the only heavy components will be a couple of 0.5 ton antennas and a gaggle of RTGs.\u003C/p\u003E\u003Cp\u003EIn principle, you could save a little dV by getting a gravity assist off Duna, but the amount would likely be so small that it\u0027s really not worth the bother.\u003C/p\u003E\u003Cp\u003EA suggestion, when launching your anti-Jool relay, give it some solar inclination so that its orbit is \u0022tilted\u0022 from the plane of Jool\u0027s orbit. Doesn\u0027t have to be a lot, just a couple of degrees. That will be enough that you don\u0027t have to worry about the sun blocking the signal-- the sun is pretty tiny when seen from Jool\u0027s distance.\u003C/p\u003E\n"},{"CreatedByName":"FancyMouse","CreatedById":142946,"CreatedDateTime":"2015-07-29T22:31:17Z","Content":"\n\u003Cp\u003EI wouldn\u0027t bother to actually place the satellites in Jool SoI. For relay all it matters is the orbital altitude, not its exact location in that orbit. So if I were you I would just do identical Hohmann transfers (relative to Sun) with two satellites launched 170/360 Kerbin year apart.\u003C/p\u003E\n"},{"CreatedByName":"xtoro","CreatedById":79015,"CreatedDateTime":"2015-07-29T22:33:53Z","Content":"\n\u003Cp\u003EBut the reason I went with 170 degrees is so that the sun will never be between them. If I place it 180 across and inclined, wont there still be 2 points where the sun is between them at the ascending and descending nodes?\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FancyMouse\u0022 data-cite=\u0022FancyMouse\u0022\u003E\u003Cdiv\u003EI wouldn\u0027t bother to actually place the satellites in Jool SoI. For relay all it matters is the orbital altitude, not its exact location in that orbit. So if I were you I would just do identical Hohmann transfers (relative to Sun) with two satellites launched 170/360 Kerbin year apart.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI thought of this as well, but it\u0027s as much dV as option A. The reason I want Jool to have one is because of probes and rovers in the Jool system of moons.\u003C/p\u003E\n"},{"CreatedByName":"FancyMouse","CreatedById":142946,"CreatedDateTime":"2015-07-29T22:44:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022xtoro\u0022 data-cite=\u0022xtoro\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI thought of this as well, but it\u0027s as much dV as option A. The reason I want Jool to have one is because of probes and rovers in the Jool system of moons.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou need another network for within Jool system anyway. I wouldn\u0027t overlap the responsibility for communication within Jool system and interplanetary relay, as it will simplify the design, at least to me. e.g. if I don\u0027t put the relay satellite around Jool I don\u0027t need to worry about blackout time by Jool etc.\u003C/p\u003E\u003Cp\u003EdV is not important actually - just spam Ions. Using this approach you don\u0027t care your orbit shape, as long as period matches Jool\u0027s.\u003C/p\u003E\n"}]}