{"TopicId":117242,"ForumId":16,"TopicTitle":"What are some good strategies to most quickly get through the \u0026quot;grindy\u0026quot; part of career mode?","CreatedByName":"MerlinsMaster","CreatedById":112079,"CreatedDateTime":"2015-07-30T06:07:10Z","PageNum":1,"Articles":[{"CreatedByName":"MerlinsMaster","CreatedById":112079,"CreatedDateTime":"2015-07-30T06:07:10Z","Content":"\n\u003Cp\u003EHey guys,\u003C/p\u003E\u003Cp\u003EI started career games a couple of times recently, and I\u0027m realizing that the beginning part of career mode is this really unsatisfying period in which you have to grind your way through some really silly contracts to unlock the upgrades and technologies to do anything interesting. I don\u0027t have a problem with the idea that you have to build up your space program, but I want to get to the point when I can upgrade the VAB, launchpad, and tracking station up one level and have two meter parts as quickly as possible.\u003C/p\u003E\u003Cp\u003ESo my question is, which things do I want to do first, and in what order, to get the farthest in the shortest amount of time, to get through that grindy phase of career mode, or as I\u0027ve heard it refered to by some: the \u0022potato phase\u0022.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-04T21:26:54Z\u0022 title=\u002208/04/2015 09:26  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 4, 2015\u003C/time\u003E by MerlinsMaster\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Grumman","CreatedById":76014,"CreatedDateTime":"2015-07-30T06:23:46Z","Content":"\n\u003Cp\u003EOpen \u0022Persistent.sfs\u0022 in Notepad.\u003C/p\u003E\u003Cp\u003EFind \u0022funds = \u0022 and add an extra few zeros.\u003C/p\u003E\u003Cp\u003EFind \u0022sci = \u0022 and add a few extra zeros.\u003C/p\u003E\u003Cp\u003ESquad should never have nerfed science gains into tediousness.\u003C/p\u003E\n"},{"CreatedByName":"Phil deCube","CreatedById":120897,"CreatedDateTime":"2015-07-30T06:55:04Z","Content":"\n\u003Cp\u003ECheck out my \u003Ca href=\u0022http://imgur.com/a/85cpa\u0022 rel=\u0022external nofollow\u0022\u003Etutorial\u003C/a\u003E.\u003C/p\u003E\n"},{"CreatedByName":"FancyMouse","CreatedById":142946,"CreatedDateTime":"2015-07-30T07:03:31Z","Content":"\n\u003Cp\u003E(\u0026lt;=moderate difficulty. I play in moderate)\u003C/p\u003E\u003Cp\u003EScience:\u003C/p\u003E\u003Cp\u003EMaterial study. Make sure bring two, visit as many places near KSC as possible, and do some flying, and one low orbit one high orbit. Unlock node that enables you to do Mun/Minmus landing. Shouldn\u0027t be too far away if it\u0027s still not enough.\u003C/p\u003E\u003Cp\u003EThen do Mun/Minmus landing. Make sure you take 2 surface samples and material studies, these are the biggest contributors. A single trip that landed multiple biomes on Minmus with all science instruments available at the time can easily give 2~3k science.\u003C/p\u003E\u003Cp\u003EFund: rescue missions. Free money and free kerbals.\u003C/p\u003E\u003Cp\u003EOther advice: try as much as you can to batch contracts - meaning a single launch satisfying more than one contract. That\u0027s the most efficient way of doing contracts. Also leave some some satellites for free contracts like \u0022Science data from space around xxx\u0022\u003C/p\u003E\u003Cp\u003EThis is about stock - there are also many mods that gives you more science parts and they can also give you science while having a different experience of gathering that science, making it not that dull. Also some contract mods are also fun which also gives some decent rewards (I suggest the anomaly pack to explore easter eggs)\u003C/p\u003E\n"},{"CreatedByName":"MerlinsMaster","CreatedById":112079,"CreatedDateTime":"2015-07-30T07:07:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Grumman\u0022 data-cite=\u0022Grumman\u0022\u003E\u003Cdiv\u003EOpen \u0022Persistent.sfs\u0022 in Notepad.\u003Cp\u003EFind \u0022funds = \u0022 and add an extra few zeros.\u003C/p\u003E\u003Cp\u003EFind \u0022sci = \u0022 and add a few extra zeros.\u003C/p\u003E\u003Cp\u003ESquad should never have nerfed science gains into tediousness.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s tempting. \u003C/p\u003E\u003Cp\u003EBut I like the challenge. I just want to figure out how to do it more efficiently.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-07-30T07:19:53Z","Content":"\n\u003Cp\u003EWithout knowing your skill level this is really hard to answer, but essentially what you need to do is satisfy as many contracts as possible with every launch, yet also concentrate on getting as much science as possible in that same launch. You should - in a single flight - test a part, reach a destination, and/or bring something along to satisfy as many contracts as you an, as well as take every single bit of science you can along the way.\u003C/p\u003E\u003Cp\u003EThis means bringing a goo pod AND a Science Jr along, as well as a thermometer and any other science doodads you have. You should take readings EVERYWHERE and your scientist (yes, bring one) should be doing more EVAs than Mark Watney to take the science and reset the goo and jr. The moment you can, you should send him to both Mun and Minmus to land and hopefully land several times on Minmus, in different biomes. He should plant flags to complete contracts anywhere he lands, and every time you complete a contract mid-mission you should hop back to mission control to find another one.\u003C/p\u003E\u003Cp\u003EIt\u0027s a pain, sure, but that one mission will be far less of a pain than 20 individual mission, and be far more profitable. And the grind will pretty much be over. I personally tend to do 4 launches in the early career: One suborbital, one orbital, one to Mun, and one to Minmus. Then I\u0027m ready to go anywhere.\u003C/p\u003E\n"},{"CreatedByName":"Evanitis","CreatedById":145424,"CreatedDateTime":"2015-07-30T07:23:12Z","Content":"\n\u003Cp\u003EMy present solution: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/125694-Ups-and-Downs-Elevating-tales-from-Recreational-Deaeronautics?p=2106350\u0026amp;viewfull=1#post2106350\u0022 rel=\u0022external nofollow\u0022\u003EA serious self-imposed limitation\u003C/a\u003E made the routine parts like geting to space or orbit challenging, thus not grindy. Some starting science eliminated the need of rolling around KSC in a pod. 50% science gain ensures that I\u0027m not unlocking the tree in the Kerbin SoI or with the first interplanetary mission.\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2015-07-30T08:38:44Z","Content":"\n\u003Cp\u003EA lot of it comes down to knowing where to find science. You\u0027ll discover that with default settings (Normal difficulty), it\u0027s actually quite quick and easy to get through the early game.\u003C/p\u003E\u003Cp\u003EAlso, focus on the world-first record contracts. They throw absurd amounts of free money after you for basically doing what you would be doing anyway (accelerating to orbital speeds etc). You can make half a million funds in a few simple launches with only one or two tech nodes unlocked.\u003C/p\u003E\u003Cp\u003EI usually take my time with early career mode, since I quite enjoy it. But if I wanted to hurry up, I would do it the following way:\u003C/p\u003E\u003Cp\u003E1.) Accept the contract to generate a crew report from the launchpad. Put a pod with two goo canisters on the launchpad. Generate a crew report and activate both goo canisters. Go on EVA. Generate an EVA report while hanging on the ladder (\u0022Flying above Kerbin\u0027s shores\u0022), put report into the pod, drop down to the launchpad, get another EVA report, get back into the pod, recover\u003C/p\u003E\u003Cp\u003E2.) Unlock Basic Rocketry. Unlock Engineering 101. Accept the contract to launch a vessel.\u003C/p\u003E\u003Cp\u003E3.) Build rocket with a pod, a parachute, three goo canisters, a decoupler, a Hammer solid booster (throttle to 2/3rds thrust), and a quartett of basic fins. Launch. Get goo from flying low. Transmit crew report from flying low. Get crew report and goo from flying high. Land somewhere. Go EVA. Get EVA report on the ladder. Take all data from pod, store all data in pod (resets the crew report). Get EVA report from the ground. Get back in pod. Get goo and crew report while landed. Recover. (I forget if a single Hammer is enough to get above 18 km. If it isn\u0027t, take a Flea for a second stage.)\u003C/p\u003E\u003Cp\u003E4.) Unlock Survivability.\u003C/p\u003E\u003Cp\u003E5.) Repeat the mission in 3.), except this time you remove the 3 goo canisters and pack 4 (yes, 4) Science Bays instead. Make liberal use of radial parachutes to ensure you land without wrecking your materials bays. Don\u0027t be afraid to build so you land sideways, since your tall stack of science bays will tip over anyway. Get material science from launchpad, flying low, flying high, and wherever you land.\u003C/p\u003E\u003Cp\u003E6.) Unlock General Rocketry. Upgrade astronaut complex to unlock EVAs. Accept mission to escape the atmosphere. Accept mission to orbit Kerbin. If you happen to have 45 science left, also unlock Basic Science.\u003C/p\u003E\u003Cp\u003E7.) Build rocket with a pod, a parachute, two materials bays, and a service bay containing two goo canisters. If you managed to unlock thermometers, take a bevvy of them to the pod (not into the service bay, you don\u0027t have action groups yet). I recommend 6. Then a decoupler, and below that, a two-stage liquid fuel rocket capable of getting you into orbit. Yes, it\u0027s possible with 18 tons and 30 parts... easily.\u003C/p\u003E\u003Cp\u003E8.) Depending on how much dV you managed to pack, get yourself into a polar orbit (more costly but preferrable) or an equatorial orbit (less costly). Get goo, crew report and material science from low orbit. If you brought thermometers, remember to get data for launchpad, flying low, flying high and low orbit. Do EVA reports from all biomes you pass over - if your orbit is polar, you can get all biomes on Kerbin in one flight.\u003C/p\u003E\u003Cp\u003E9.) Lift your apoapsis above 250,000m. Get crew report, EVA report, goo and material science (and thermometer data) for high in space over Kerbin. At apoapsis, burn to drop your periapsis to 0 km, touching the surface exactly. Counterintuitively, \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/130036-Re-entry-without-heatshield-Stuck-in-Space?p=2108508\u0026amp;viewfull=1#post2108508\u0022 rel=\u0022external nofollow\u0022\u003Ethis reentry is gentler than a 35km periapsis from 70x70 km\u003C/a\u003E; the service bay will easily take the heat and also has a great impact tolerance for landing on. Try aiming at KSC. The earlier you start practicing, the more funds you will recover from each mission. But wherever you land, remember to check if there\u0027s science left to do.\u003C/p\u003E\u003Cp\u003E10.) You have now completed the starter World-First record contracts and should be a rich Kerbal. Upgrade buildings in this order, as funds allow: Mission Control, Tracking Station, Launchpad, VAB. You may not have enough funds for all of them, but you can now have up to 7 contracts at once, which lets you farm money efficiently. Also unlock Basic Science (if you haven\u0027t already), Advanced Rocketry, Stability and Flight Control. You are now able to go to Mun and Minmus, as well as get science from solar orbit. This took you just four flights, and zero dumb rolling around KSC for dumb science.\u003C/p\u003E\u003Cp\u003EYou can get by with even less flights, but that starts to get to unwieldly for my tastes, and saves little actual time (in fact you\u0027ll probably end up spending more time due to having to build large, wobbly vessels than you save by not flying a quick suborbital hop).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-12T11:24:31Z\u0022 title=\u002208/12/2015 11:24  AM\u0022 data-short=\u00228 yr\u0022\u003EAugust 12, 2015\u003C/time\u003E by Streetwind\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"X-SR71","CreatedById":108775,"CreatedDateTime":"2015-07-30T11:57:31Z","Content":"\n\u003Cp\u003EThis \u0027Potato phase\u0027 is the one before unlocking the 90 science points nodes, right? \u003C/p\u003E\u003Cp\u003EI found it to be the most grindy part of career. After a couple of those 90 nodes, it gets way more fun. \u003C/p\u003E\u003Cp\u003ESorry I don\u0027t have very good advices for you. It just IS grindy. What I did though, was trying to rush the super simple contracts - like the \u0027test part in launchpad\u0027 contracts for easy pocket cash and couple science points. I didn\u0027t take harder contracts until I had some good parts unlocked.\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-07-30T12:27:27Z","Content":"\n\u003Cp\u003E*edit* \u003C/p\u003E\u003Cp\u003E Do yourself a favor and check out the \u0022Caveman Challenge\u0022 thread. Watch how they do it.\u003C/p\u003E\u003Cp\u003E Getting started needn\u0027t be grindy.\u003C/p\u003E\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-07-30T12:37:59Z","Content":"\n\u003Cp\u003EThe one good thing science-wise in 1.x is that now a 0-level rookie scientist can reset the Goo and Material experiments by himself, in the field. Used to be, only the Mobile Processing Lab could do that. Shamelessly exploiting this is the key to getting through the grind.\u003C/p\u003E\u003Cp\u003EDo what you need to do in the very early going to unlock the following stuff:\u003C/p\u003E\u003Cp\u003E* Goo, Materials, and whatever other science instruments are within easy reach. NOTE: using the DMagic Orbital Science mod really helps here as it provides many new instruments (so your ship can get more science per biome) and also lucrative contracts (in both cash and science) to use them.\u003C/p\u003E\u003Cp\u003E* The OKTO probe core, which can do SAS. Once you have this, you no longer need pilots at all.\u003C/p\u003E\u003Cp\u003E* Enough 1.25m, maybe a few 2.5m rocket parts to build a lander with about 3000m/s dV, enough TWR to land on Minmus with full tanks (this doesn\u0027t require much), and a rocket capable of getting this lander to Minmus. This needs the OKTO core as well.\u003C/p\u003E\u003Cp\u003EOnce you have this, put your 0-level scientist in it and send him to Minmus. Just before you touch the ground, run all the experiments that will work in \u0022space just above\u0022. Land. EVA, collect all the data and put it in the pod, resetting the Goo and Materials. Then run all the experiments on the ground, plus get EVA reports and a surface sample. Store all this in the pod, reset the Goo and Materials again. Then hop to the next biome and repeat the process. You should be able to hit 3, maybe 4 biomes this way and still have enough fuel to get home no problem. You\u0027ll come home with a couple thousand science points. Spend them, upgrade the ship (especially with more instruments) and then go get the remaining Minmus biomes. Again, you\u0027ll get a few thousand science. By now you\u0027ll have all the 2.5m rocket parts, maybe even some of the 3.75m. Use these to repeat the whole process on Mun, which takes a bigger lander due to its higher gravity.\u003C/p\u003E\u003Cp\u003EDoing things this way, you can pretty much clear out the tech tree in 4-5 relatively simple, not-all-that-repetitive missions.\u003C/p\u003E\n"},{"CreatedByName":"Mystique","CreatedById":95628,"CreatedDateTime":"2015-07-30T12:58:36Z","Content":"\n\u003Cp\u003EGrindy phase won\u0027t bother you much, even if you don\u0027t use difficulty option to give yourself some extra funds, if you choose your contract wisely. I usually pick 5-7 contract that I can perform in 1 mission, for example: explore Mun (stock landing mission) \u002B orbital observations of Mun \u002B put sat or two in Mun orbit \u002B rescue few guys (usually I send unmanned crafts and pick them by the way), etc. Also don\u0027t waste your time on stupid contracts with low cash output like testing parts on launchpads, unless you just want to do it. Fishy (cash efficient) contracts are mostly regarding building orbital and ground bases, they don\u0027t require too expensive crafts and usually produces good profit. Again, combine those building contracts with sat deployment, sats are small and you can attached them to almost any mission to deploy during transit.\u003C/p\u003E\u003Cp\u003EAnd consider using stage recovery mod to be able to salvage expensive lifter stages (it\u0027s usually not worth to waste time and delta-v to recover each SRB, but if you\u0027re hauling a ready-to-use orbital dock up there, lifter itself will surely cost more than a regular manned mission).\u003C/p\u003E\u003Cp\u003EGenerally, good choice of contract will save you lot of time on grind - I usually do several science\u002Bcash grind mission in beginning of career, upgrade most important buildings and then start exploring other planets - it\u0027s much more interesting than those Mun and Minmus (which i can\u0027t look at for a year already \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E ) and also can generate considerable profit, especially when your exploration missions can count as orbital bases for some contracts \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI also suggest to use policy to convert 50-70% of reputation into funds. Who cares what they think about your cute little space program business if you have cash, blackjack and Valentinas?\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-07-30T21:17:45Z","Content":"\n\u003Cp\u003EIn my own career games, I find that the money grind is more of an issue than the science grind: that is, I find myself doing missions over and over to add money so that I can upgrade my buildings. The science seems to take care of itself.\u003C/p\u003E\u003Cp\u003EThe sweet spot I\u0027ve found for \u0022make lots of money fast\u0022 is the \u0022Launch a new station on a solar orbit\u0022 contract. Those are worth tons of funds, anywhere from half a million to more than a million. They\u0027re quick to slap together, and they require minimal time \u0026amp; effort on my part: basically, just put together a craft that meets the requirements, make sure it has enough dV to escape Kerbin, point its nose at the sky, and floor the accelerator. Pow, boatloads of cash. Two or three such missions are generally enough to upgrade the science facility, tracking station, and VAB, which are the major big-ticket items.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-07-30T22:26:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Snark\u0022 data-cite=\u0022Snark\u0022\u003E\u003Cdiv\u003EThe sweet spot I\u0027ve found for \u0022make lots of money fast\u0022 is the \u0022Launch a new station on a solar orbit\u0022 contract.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI prefer to take a trio of contracts to put a station in orbit of Kerbin, then another in orbit of the Sun, and a third in orbit of a planet. Launch a single station that satisfies all 3, and just getting to the other planet will satisfy the Kerbin and Sun contracts. A little more work but - in my opinion - less than 3x the work, for 3x (ish) the payoff, and 1/3 (again -ish) the cost to build.\u003C/p\u003E\n"},{"CreatedByName":"MerlinsMaster","CreatedById":112079,"CreatedDateTime":"2015-07-30T22:56:35Z","Content":"\n\u003Cp\u003EA lot of really great advice from everyone so far! This gives me a bunch of great strategies to use. I think I\u0027ll leave this as \u0022unanswered\u0022 a little longer, because I\u0027m loving everything that\u0027s coming in and don\u0027t want to stop the momentum.\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2015-07-31T13:07:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Streetwind\u0022 data-cite=\u0022Streetwind\u0022\u003E\u003Cdiv\u003E3.) Build rocket with a pod, a parachute, three goo canisters, a decoupler, a Hammer solid booster (throttle to 2/3rds thrust), and a quartett of basic fins. Launch. Get goo from flying low. Transmit crew report from flying low. Get crew report and goo from flying high. Land somewhere. Go EVA. Get EVA report on the ladder. Take all data from pod, store all data in pod (resets the crew report). Get EVA report from the ground. Get back in pod. Get goo and crew report while landed. Recover. (I forget if a single Hammer is enough to get above 18 km. If it isn\u0027t, take a Flea for a second stage.)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJust a quick note here - I started a new career last night specifically to work through your list of things to do in a new save; during this flight I did need a Flea to get up to 18,000. On the other hand, I use FAR so that might\u0027ve had something to do with it. Might need to mention a thrust setting for the Flea; I left it on full myself and Val pulled some pretty serious gees as a result...\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2015-07-31T13:15:59Z","Content":"\n\u003Cp\u003EHey, it\u0027s Val! She probably grinned all the broader for it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"More Boosters","CreatedById":147303,"CreatedDateTime":"2015-07-31T13:29:12Z","Content":"\n\u003Cp\u003EI suffer the same problems but the SoundingRockets mod I just downloaded helped quite a bit.\u003C/p\u003E\u003Cp\u003EIf you insist on going stock only, well, I have this help to offer:\u003C/p\u003E\u003Cp\u003EYou\u0027ll get a lot of easy money from science from space around Kerbin contracts, so you should try my Recoverable Sounding Rocket design if you don\u0027t already have one. It\u0027s exactly as it sounds, it survives reentry and gives you some funds back while doing the mission.\u003C/p\u003E\u003Cp\u003Ex6 Basic Fins on the bottom\u003C/p\u003E\u003Cp\u003Ex1 Hammer Booster \u003C/p\u003E\u003Cp\u003Ex1 Stayputnik\u003C/p\u003E\u003Cp\u003Ex1 Z-100 Battery Pack **\u003C/p\u003E\u003Cp\u003Ex1 Communotron 16 **\u003C/p\u003E\u003Cp\u003Ex1 2 HOT Thermometer **\u003C/p\u003E\u003Cp\u003Ex2 Radial Chutes\u003C/p\u003E\u003Cp\u003E** : Place on the Stayputnik\u003C/p\u003E\u003Cp\u003EGets to around 90 km apoapsis and falls fairly close to KSC. I did not try it with other science equipment yet, however.\u003C/p\u003E\u003Cp\u003ESet the Hammer to 46 thrust, this gives you a TWR of 2.39 on take-off, fairly appropriate for a rocket of this size. A bit lower thrust may be more efficient but pushing yourself against the air faster is better for stability and no setup will get this to space high over Kerbin, and I\u0027d be surprised if there existed an early game single stage design that could get to that kind of altitude and survive the re-entry.\u003C/p\u003E\u003Cp\u003EI usually get around 96% return on the vehicle so the operating cost is about 300-400. Saving 2.400 may not seem like much but it matters in the long run with how many of these things I launch.\u003C/p\u003E\u003Cp\u003EEdit: Also try to do the tourist contracts at Kerbin as those give a lot of reputation to unlock the bigger missions earlier.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-31T13:32:58Z\u0022 title=\u002207/31/2015 01:32  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 31, 2015\u003C/time\u003E by More Boosters\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"jkool702","CreatedById":146465,"CreatedDateTime":"2015-07-31T14:32:08Z","Content":"\n\u003Cp\u003ETo help with science grind, i reccomend installing [X]science mod. This lets you know what science is available in your current biome, and makes the \u0022collect data everywhere\u0022 part much more efficient.\u003C/p\u003E\u003Cp\u003EFor funds, if you get tired of repeating the same contracs over and over (in particular the \u0022take tourists to kerbin orbit\u0022 and \u0022launch a satellite to kerbin orbit\u0022 ones) download mechjeb and let it automate it. I\u0027m a big believer that you should try to do stuff first without mechjeb\u0027s help, but once youve repeated something 20 times and could do it in your sleep mechjeb helps reduce the grindyness of doing it again.\u003C/p\u003E\n"},{"CreatedByName":"Nich","CreatedById":145678,"CreatedDateTime":"2015-07-31T15:07:22Z","Content":"\n\u003Cp\u003EI just give my self a good chunk of science in the beginning I am not rolling to every dam biome at KSP so I can spend 2 hours to get dumb science 100m from the launch pad IMO. All those biomes need to be removed and the Kerbin desert, poles, and mountains and possibly badlands(I have never been) need to be buffed up. Apparently I just learned you can do splashed and landed in most the biomes\u003C/p\u003E\n"},{"CreatedByName":"Mic_n","CreatedById":27054,"CreatedDateTime":"2015-07-31T15:44:35Z","Content":"\n\u003Cp\u003Edon\u0027t forget all the different biomes right in the KSC.. Most things there have their own biome (some have multiple, depending on tech level), so you can do a bunch of experiments in and around without going far at all and rack up some quick science.\u003C/p\u003E\n"},{"CreatedByName":"ghpstage","CreatedById":129622,"CreatedDateTime":"2015-07-31T16:25:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022 data-cite=\u0022Geschosskopf\u0022\u003E\u003Cdiv\u003EThe one good thing science-wise in 1.x is that now a 0-level rookie scientist can reset the Goo and Material experiments by himself, in the field. Used to be, only the Mobile Processing Lab could do that. Shamelessly exploiting this is the key to getting through the grind.\u003C/div\u003E\u003C/blockquote\u003E This was certainly true in 1.03, and I doubt it has changed much in 1.04.\u003Cp\u003EI used to aim to get a scientist into orbit on my second launch, with enough fuel to just get over the 250k high-low orbit boundary with both goo and a mat lab onboard. Used to come back with a total of around 140 science, with 60 coming from high altitude, low space and high space material labs alone.....\u003C/p\u003E\u003Cp\u003EYou do have to make sure you upgrade the astro complex before anything else, and while your scientist is up there however.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-31T16:32:26Z\u0022 title=\u002207/31/2015 04:32  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 31, 2015\u003C/time\u003E by ghpstage\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-07-31T16:40:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ghpstage\u0022 data-cite=\u0022ghpstage\u0022\u003E\u003Cdiv\u003EThis was certainly true in 1.03, and I doubt it has changed much in 1.04.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EStill true in 1.0.4.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EYou do have to make sure you upgrade the astro complex before anything else, and while your scientist is up there however.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYup, you have to have the ability to EVA in space for this to work. That should always be one of the 1st building upgrades you get.\u003C/p\u003E\n"},{"CreatedByName":"More Boosters","CreatedById":147303,"CreatedDateTime":"2015-07-31T18:34:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nich\u0022 data-cite=\u0022Nich\u0022\u003E\u003Cdiv\u003EI just give my self a good chunk of science in the beginning I am not rolling to every dam biome at KSP so I can spend 2 hours to get dumb science 100m from the launch pad IMO. All those biomes need to be removed and the Kerbin desert, poles, and mountains and possibly badlands(I have never been) need to be buffed up. Apparently I just learned you can do splashed and landed in most the biomes\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree completely. The novelty of EVA\u0027ing on the ground and hanging onto the ladder to get a \u0022flying over wherever\u0022 bonus got old long ago. Now it\u0027s just a hacky way of going through a kind of grind that should not be there. Just for reference, how much science do you start with? One time I started with science I felt dirty so I deleted that save and started again. After all, a single Hammer can get you above 70k and that feels a bit cheaty.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-07-31T18:57:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022More Boosters\u0022 data-cite=\u0022More Boosters\u0022\u003E\u003Cdiv\u003EI agree completely. The novelty of EVA\u0027ing on the ground and hanging onto the ladder to get a \u0022flying over wherever\u0022 bonus got old long ago. Now it\u0027s just a hacky way of going through a kind of grind that should not be there. Just for reference, how much science do you start with? One time I started with science I felt dirty so I deleted that save and started again. After all, a single Hammer can get you above 70k and that feels a bit cheaty.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs an alternative to having some science to start with, you can also increase the amount of science rewards, like say to 200%. This by itself reduces the amount of effort required to unlock the tech tree by 1/2. And why not give yourself 150% money as well?\u003C/p\u003E\u003Cp\u003EAs to the \u0022cheatiness\u0022 of such things, it depends on what you\u0027re trying to do with the game. Do you see the end of the tech tree as the end of the game, or the real beginning of it? I\u0027m in the latter camp. I mean, what\u0027s the point of unlocking all the high-tech stuff at the end of the tree if you\u0027re not ever going to use it? But there are those who quit at that point. Those folks therefore want to stretch things out, making it harder on themselves, so they reduce rewards, use entry costs, etc. Me, OTOH, I start with nothing but go with 200% science, 150% funds, and blaze through the tech tree so I can get on with building massive colonies while still needing to pay for them. And I use Custom Barn Kit so that the price of upgrading buildings is higher, but I can hire tons of Kerbals for a low, flat fee (they have no skills, after all). Plus I use DMagic Orbital Science so I can get more science per mission.\u003C/p\u003E\u003Cp\u003EWith my settings, I can complete the tech tree just by thoroughly pillaging Minmus. So with that out of the way in a small number of missions, the game morphs into an empire-building game. Building colonies is EXPENSIVE, so I\u0027m always having to do contracts for income. And because by this point all the good contracts involve interplanetary trips, they take a long time to pay off. This requires a lot of planning looking years into the future, figuring out how I can work contracts in my favor to build the colonies I want. All the station and base construction contracts at this point actually start having a purpose, and I end up using most of them myself instead of just leaving them sitting there idle. But it might take a decade or 2 before it\u0027s fully operational because I can\u0027t afford to do it all at once, the unalterable schedule of transfer windows, and the randomness of getting the right type of contract going to the right place. But figuring all this out is why they pay me the big bucks \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\n"}]}