{"TopicId":117322,"ForumId":70,"TopicTitle":"mechjeb landing guidence","CreatedByName":"gmcr70","CreatedById":106717,"CreatedDateTime":"2015-07-31T15:06:10Z","PageNum":1,"Articles":[{"CreatedByName":"gmcr70","CreatedById":106717,"CreatedDateTime":"2015-07-31T15:06:10Z","Content":"Hi,\n\nUsing landing guidance causes ships to crash into ground, they never slow to specified 0.5m/s.\n\nLanding Interface says \u0022Debug Info: PowerCoastDecentSpeedPolicy\u0022\n\nOpened debug log window and found this:\n\n\u0022[Exception]: NullReferenceException: Object reference not set to an instance of an object\u0022, and no reference to a \u0022Policy\u0022 option.\n\nIs there some way to have mechjeb **gradually** descend, rather then wait till the last second to fire engines?\n\nand what does the exception mean? \n\nthanks,\n\nG, brooklyn"},{"CreatedByName":"smjjames","CreatedById":134004,"CreatedDateTime":"2015-07-31T16:53:21Z","Content":"Probably better to ask on the [main thread itself](https://forum.kerbalspaceprogram.com/threads/124336-PART-1-0-4-Anatid-Robotics-MuMech-MechJeb-Autopilot-v2-5-3-%28July-6th%29)\n\nWhich landing mode are you using? I\u0027ve found \u0027land somewhere\u0027 to be overeager with the time warp. If it\u0027s the targeted landing, you\u0027re going to need to supply more info.\n\nas for the exception, I don\u0027t know what it means."},{"CreatedByName":"Targa","CreatedById":116596,"CreatedDateTime":"2015-07-31T17:14:10Z","Content":"I\u0027ve used MechJeb since last year and the only time I\u0027ve ever encountered this behavior is when I started the landing procedure myself and was descending too rapidly. Turning Landing Guidance on at that point usually ended up with MechJeb slamming the ship into the planet surface. You need to enable Landing Guidance from a stable orbit for best results. I\u0027ve used \u0022land somewhere\u0022 as low as 20 meters off the ground and never had an issue. It\u0027s great for those \u0022uh oh\u0022 moments when you\u0027ve botched a manual landing, or are moving a ship short distances across the planet surface. The main thing to remember is that MechJeb can\u0027t perform miracles. If your descent speed is greater than your available thrust, nothing can save your ship. Lastly - always, *always* F5 before deorbiting. Use \u0022pick a spot to land\u0022, \u0022enter coordinates\u0022, or \u0022land somewhere\u0022 from a stable orbit and report back the results."},{"CreatedByName":"gmcr70","CreatedById":106717,"CreatedDateTime":"2015-07-31T19:19:34Z","Content":"thanks.. I will repost there.\n\nI am using it from all sorts of altitudes, from orbit to ~1600m, perhaps I should try lower.."}]}