{"TopicId":117567,"ForumId":16,"TopicTitle":"Rescue contract mostly pilots now?","CreatedByName":"McKermack","CreatedById":143137,"CreatedDateTime":"2015-08-03T23:44:23Z","PageNum":1,"Articles":[{"CreatedByName":"McKermack","CreatedById":143137,"CreatedDateTime":"2015-08-03T23:44:23Z","Content":"New career started. Out of 7 rescue contracts 6 were pilots and 1 was a scientist. Is rescue pool skewed now or is this just bad luck?"},{"CreatedByName":"Mastikator","CreatedById":135309,"CreatedDateTime":"2015-08-04T00:07:31Z","Content":"Seems like it for me too. Had to dismiss a bunch of pilots just to make room for... guess what, more pilots."},{"CreatedByName":"Kryxal","CreatedById":102688,"CreatedDateTime":"2015-08-04T00:59:09Z","Content":"It\u0027s pretty annoying, but if you think about it, it makes sense ... who else is going to pull the crazy stunts that would get them stuck up there?"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-08-04T04:29:37Z","Content":"I think it\u0027s luck of the draw. I\u0027ve got ~30 kerbals in my program right now, and they break down roughly in thirds by profession."},{"CreatedByName":"ajburges","CreatedById":26570,"CreatedDateTime":"2015-08-04T05:47:46Z","Content":"Soon the cult of the RNG will have numbers near the cult of the Kraken.\n\nVery soon..."},{"CreatedByName":"Aristarchus","CreatedById":127970,"CreatedDateTime":"2015-08-04T06:25:53Z","Content":"It is different for me every save. At one point it seemed I was only getting pilots, other times I will feel I am only drawing scientists (more than 8 in a row if I remember right). Sometimes I will get a run of all male or all female kerbals. The moral of the story is that just because something is random doesn\u0027t imply that it will be well-distributed, in fact clumps in random data is perfectly reasonable to expect. Imagine if a coin perfectly alternated heads and tails when flipped a hundred times; that would be just as suspicious as one that always came up heads.\n\nDon\u0027t worry, you\u0027ll eventually get your egghead kerbals."},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2015-08-04T06:41:20Z","Content":"Kerbal profession is determined by their name. Names are procedurally generated. So yes, it\u0027s random - but if you rescue a Kerbal of the same name in two different saves, he or she will have the same profession!"},{"CreatedByName":"Mastikator","CreatedById":135309,"CreatedDateTime":"2015-08-04T07:50:22Z","Content":"\u003E \n\u003E Kerbal profession is determined by their name. Names are procedurally generated. So yes, it\u0027s random - but if you rescue a Kerbal of the same name in two different saves, he or she will have the same profession!\n\nIs there an easy way to figure out the profession from name in advance?"},{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-08-04T08:12:32Z","Content":"No ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif) There was a guy who spent a long time trying to reverse-engineer the algorithm. He found the solution for names 5 characters long or shorter, but since \u0022Kerman\u0022 is a part of the name, as effect all names in game are longer than five characters (\u0022Bob Kerman\u0022 is 10) - and the algorithm changes (to something more complex) for all longer names."},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-08-04T08:19:15Z","Content":"Yep, I noticed that. I had a lot of engineer at start (when I needed pilots), now I have a lot of pilots (when I need scientists and engineers)...\n\nBut I think it\u0027s 1/3 chance each. We can\u0027t find a rule with only 20-30 rescued Kerbals."},{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-08-04T08:24:42Z","Content":"\u003E \n\u003E But I think it\u0027s 1/3 chance each. We can\u0027t find a rule with only 20-30 rescued Kerbals.\n\nThe names can be edited in the save file so you\u0027re not limited to your rescuees in trying to determine the rule, and you can set the name to pretty much anything when trying to figure it out."}]}