{"TopicId":117509,"ForumId":38,"TopicTitle":"Kerbal History Reborn","CreatedByName":"megatiger78","CreatedById":114940,"CreatedDateTime":"2015-08-03T08:44:03Z","PageNum":2,"Articles":[{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2015-08-25T20:29:57Z","Content":"\n\u003Cp\u003E183: Rob Kerman, ancestor of Bob Kerman, is having a peaceful evening when he suddenly observes his neighbor\u0027s house spinning around wildly. After consulting Vernor about what had happened, he decides to write everything down and then devise a way to test his conclusions in a controlled fashion, thereby inventing Science.\u003C/p\u003E\u003Cp\u003E184: For his invention of Science, Rob Kerman is chased out of town by an angry mob. He settles down in the next town over and begins to collaborate with the brilliant Victor Frankerman on a new secret project: creating an artificial mechanical Kerbal he dubs the \u0022Rob-bot\u0022.\u003C/p\u003E\n"},{"CreatedByName":"NeatCrown","CreatedById":101431,"CreatedDateTime":"2015-08-26T04:48:42Z","Content":"\n\u003Cp\u003E185: During the development of the Rob-bot, they accidentally created the first landing legs while creating bionic walking legs. The development of the bot was also the origin of the earliest version of the CLAW.\u003C/p\u003E\u003Cp\u003E186: The properties of the CLAW weren\u0027t looked in to further too much, and was sold as a knick-knack/toy for children, and became a huge success. Corporations soon took notice and it soon became an essential product in construction. The Rob-Bot was the first prototype for the soon-to-be probes (and MechJeb).\u003C/p\u003E\u003Cp\u003E186: After more Kerbals got their hands on the CLAW, the odd properties were found. After kerbals attatched to two CLAWs, they oddly disappeared. Only one survivor was recorded that survived the odd experience. S/he described falling into a Kerbin that wasn\u0027t there and then blacking out. This was not heard of for years afterwards.\u003C/p\u003E\u003Cp\u003E187: Rob-bot sparked the beginning of debate of whether AI should be considered as \u0022life\u0022 and if they should be treated as kerbals. This debate still continues to this day.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-26T04:51:53Z\u0022 title=\u002208/26/2015 04:51  AM\u0022 data-short=\u00228 yr\u0022\u003EAugust 26, 2015\u003C/time\u003E by NeatCrown\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"megatiger78","CreatedById":114940,"CreatedDateTime":"2015-08-26T14:43:24Z","Content":"\n\u003Cp\u003E188: 2 KLAWS colliding is revealed to ahev the same affect as doing so with a kerbal\u003C/p\u003E\u003Cp\u003E189: gill kerman, ancestor of bill kerman, creates a new profession. it involves being near engines. they call it engine-nearing (ok so this is a old thing, but kerbals making the actual names based on a description was fun)\u003C/p\u003E\n"},{"CreatedByName":"UnionPacific1983WP","CreatedById":140982,"CreatedDateTime":"2015-08-26T22:00:14Z","Content":"\n\u003Cp\u003E199: Two RORW trains collide at a combined speed of 500 m/s. Only debris at the crash site? The metal plates at the back of each train, right next to eachother. The fronts of the other trains on the system are reinforced to prevent obliteration.\u003C/p\u003E\u003Cp\u003E200: Another RORW collision, the reinforcing of 199 seems to have worked, where only 99% of the kerbals were thrown out of their seats, as opposed to 100% of them back in 199.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-26T22:22:04Z\u0022 title=\u002208/26/2015 10:22  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 26, 2015\u003C/time\u003E by UnionPacific1983WP\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"megatiger78","CreatedById":114940,"CreatedDateTime":"2015-08-27T15:55:47Z","Content":"\n\u003Cp\u003E201: in the wake of this second accident, trains are banned. the techs used are also dumped. kerbals wonder what m/s is. (can we have some non-space history before year 500? they are developing tech too fast.\u003C/p\u003E\n"},{"CreatedByName":"Alphasus","CreatedById":147173,"CreatedDateTime":"2015-08-27T16:10:42Z","Content":"\n\u003Cp\u003E202: The train market returns because of a lack of fast travel. But all trains are now encased in metal to increase safety.\u003C/p\u003E\n"},{"CreatedByName":"megatiger78","CreatedById":114940,"CreatedDateTime":"2015-08-28T15:18:15Z","Content":"\n\u003Cp\u003E203: the trains, however, are now using a method of going fast that uses steam. this is deemed to be safer. old fast going methods banned\u003C/p\u003E\n"},{"CreatedByName":"UnionPacific1983WP","CreatedById":140982,"CreatedDateTime":"2015-08-28T21:51:56Z","Content":"\n\u003Cp\u003E204: The old methods are unbanned for testing purposes only.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-29T02:40:37Z\u0022 title=\u002208/29/2015 02:40  AM\u0022 data-short=\u00228 yr\u0022\u003EAugust 29, 2015\u003C/time\u003E by UnionPacific1983WP\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"megatiger78","CreatedById":114940,"CreatedDateTime":"2015-08-29T07:22:14Z","Content":"\n\u003Cp\u003E205: the old methods are locked away in a box for 295 years, until they will be rediscovered\u003C/p\u003E\n"},{"CreatedByName":"Provisional Name 41","CreatedById":147669,"CreatedDateTime":"2015-08-29T12:38:43Z","Content":"\n\u003Cp\u003E206: Kalileo Kerman is stargazing Jool when he notices 4 blue, cyan, grey, brown and green specks, He confirms they are moons and names them \u0022Laythe\u0022 \u0022Vall\u0022 \u0022Tylo\u0022 \u0022Bop\u0022 and \u0022Pol\u0022\u003C/p\u003E\n"},{"CreatedByName":"megatiger78","CreatedById":114940,"CreatedDateTime":"2015-08-29T16:38:35Z","Content":"\n\u003Cp\u003E207: kalileo kerman is deemed insane. (this is uncannnon, in the game, it tells you exactly how jool\u0027s moons where found. anything else in this thread that is not mentioned in the game or the thread rules seems to be ok.)\u003C/p\u003E\n"},{"CreatedByName":"TrainEngie","CreatedById":138031,"CreatedDateTime":"2015-08-29T19:18:39Z","Content":"\n\u003Cp\u003E(RESETTING TRAIN HISTORY HERE)\u003C/p\u003E\u003Cp\u003E208: Steamboat engines are used to pull minecarts out of mines safely, thus reducing injury from pushing minecarts up and making mining a successful business.\u003C/p\u003E\u003Cp\u003E220: A steam-powered minecart is engineered. The first train is born, and its first cargo was 3 metric tons of iron ore.\u003C/p\u003E\u003Cp\u003E224: Long fireworks are launched off of a navy steamboat, and one accidentally sinks an infidel pirate ship. The missile is born.\u003C/p\u003E\n"},{"CreatedByName":"Sharkman Briton","CreatedById":148040,"CreatedDateTime":"2015-08-29T19:33:31Z","Content":"\n\u003Cp\u003E227: World War K 1 started, missiles being the prominent weapon. With driving minecarts full of hydrazine into the enemy a close second.\u003C/p\u003E\n"},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2015-08-29T20:08:45Z","Content":"\n\u003Cp\u003EI probably shouldn\u0027t have brought in trains... o_O\u003C/p\u003E\u003Cp\u003EI\u0027m entirely in favor of importing engine-nears though. That was hilarious if I may say so myself.\u003C/p\u003E\u003Cp\u003E228: As World War K rages on, two corporations rise to fame and begin their own fledgling space exploration programs: Hanland and SpiritWolf. Their tales are told in the form of a series of video recordings, and thus need not be recorded here.\u003C/p\u003E\u003Cp\u003E230: World War K finally comes to a close after an amazing covert operation led by the valiant secret agent Kirrim Kerman the First.\u003C/p\u003E\u003Cp\u003ELater that same year, Jool is discovered.\u003C/p\u003E\n"},{"CreatedByName":"Thomassino","CreatedById":137899,"CreatedDateTime":"2015-08-29T20:17:07Z","Content":"\n\u003Cp\u003E232: First experiments with gunpowder-powered \u0022rockets\u0022. Kerbals have set new max height record - 5000m.\u003C/p\u003E\u003Cp\u003E233: A wheel has been remastered - round shape appeared to be better than square...\u003C/p\u003E\n"},{"CreatedByName":"TrainEngie","CreatedById":138031,"CreatedDateTime":"2015-08-29T20:26:46Z","Content":"\n\u003Cp\u003E231: Werner Von Kerman graduates from the University of Kermich.\u003C/p\u003E\u003Cp\u003E234: A mistake in refining krude fuel to RP-1 kerosene results in the invention of \u003Cem\u003Esunscreen ointment\u003C/em\u003E and the invention of kerodiesel fuel. \u003C/p\u003E\u003Cp\u003ENo one knows what to do with kerodiesel yet, since it is not as flammable as RP-1 kerosene.\u003C/p\u003E\u003Cp\u003E245: Kiesel Kerman invents the piston engine for use with kerodiesel and RP-1.\u003C/p\u003E\u003Cp\u003E246: The steam-powered minecarts become full-fledged railway steam engines. Also, the first air-breathing prop plane is invented.\u003C/p\u003E\n"},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2015-08-30T21:10:24Z","Content":"\n\u003Cp\u003E247: The Kerprinting Press is invented, allowing Kerbals to easily distribute information en masse.\u003C/p\u003E\u003Cp\u003E248: Kesla Kerman is born and shows promise as an engine-near.\u003C/p\u003E\u003Cp\u003E249: Edison Kerman is born and also shows promise as an engine-near. A bitter rivalry is sure to ensue.\u003C/p\u003E\n"},{"CreatedByName":"DMSP","CreatedById":124853,"CreatedDateTime":"2015-08-30T21:45:56Z","Content":"\n\u003Cp\u003Elol, how did I miss this?\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E250: Kerbals celebrate this year and build a Laythe mission using trash cans.\u003C/p\u003E\u003Cp\u003E251: The Laythe Mission blows up on the pad (also made of trash cans)\u003C/p\u003E\u003Cp\u003E252: Kerbals realize that they need to put fuel in transcans for them to work.\u003C/p\u003E\n"},{"CreatedByName":"megatiger78","CreatedById":114940,"CreatedDateTime":"2015-08-31T07:46:09Z","Content":"\n\u003Cp\u003E253: all kerbals involved in the accident go to a psychiatrist and are revealed to be insane, like kallilleo kerman. (laythe has not yet been found, and space travel is due in 500.\u003C/p\u003E\n"},{"CreatedByName":"Thomassino","CreatedById":137899,"CreatedDateTime":"2015-08-31T09:16:25Z","Content":"\n\u003Cp\u003E254: Kerbals have invented a slingshot.\u003C/p\u003E\u003Cp\u003E255: First theories about space slingshot appeared.\u003C/p\u003E\u003Cp\u003E256: Construction of Giant Space Slingshot (GSS) begins.\u003C/p\u003E\u003Cp\u003E259: GSS is completed. Jebiah, son of Obadiah has volunteered as a test pilot. After extensive testing and hard training consisted mainly of his body reaction to various snacks and slingshot shooting, Jebiah climbed into GSS. All systems were nominal, and when the countdown reached 0, slingshot fired. Nobody has seen Jebiah since. This was the day when Kerbals discovered ram heating.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-31T12:29:16Z\u0022 title=\u002208/31/2015 12:29  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 31, 2015\u003C/time\u003E by Thomassino\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"megatiger78","CreatedById":114940,"CreatedDateTime":"2015-09-01T05:39:24Z","Content":"\n\u003Cp\u003E(does anyone even read the OP? kerbals go to space in \u003Cstrong\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E500\u003C/span\u003E\u003C/strong\u003E)\u003C/p\u003E\u003Cp\u003E300: jebediah the first is found on the other side of the planet. the GSS idea is regarded as dumb. kerbals wonder what a slingshot is anyway.\u003C/p\u003E\n"},{"CreatedByName":"UnionPacific1983WP","CreatedById":140982,"CreatedDateTime":"2015-09-01T13:41:05Z","Content":"\n\u003Cp\u003E310: The Great Rift happens, and the Mun splits in half.\u003C/p\u003E\n"},{"CreatedByName":"megatiger78","CreatedById":114940,"CreatedDateTime":"2015-09-01T15:31:13Z","Content":"\n\u003Cp\u003E311: the nice building the kerbals had know as the Mun is honoured by them naming a large round thing in the sky after it\u003C/p\u003E\n"},{"CreatedByName":"Provisional Name 41","CreatedById":147669,"CreatedDateTime":"2015-09-01T15:36:15Z","Content":"\n\u003Cp\u003E(OP can you please write a rule such as \u0022No crazy events happening before 7000 i.e celestial bodies being destroyed\u0022?)\u003C/p\u003E\n"},{"CreatedByName":"megatiger78","CreatedById":114940,"CreatedDateTime":"2015-09-01T18:18:11Z","Content":"\n\u003Cp\u003E(on it)\u003C/p\u003E\n"}]}