{"TopicId":117509,"ForumId":38,"TopicTitle":"Kerbal History Reborn","CreatedByName":"megatiger78","CreatedById":114940,"CreatedDateTime":"2015-08-03T08:44:03Z","PageNum":4,"Articles":[{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2015-09-10T19:00:11Z","Content":"(You may be taking the train a little too far. Perhaps more Kerbal stuff and less historical parallels.)\n\n402: Wright Kerman, an engine-near who dreams of being a pie-let, develops a contraption he calls the \u0022Air Pie-Let Train\u0022 or \u0022Air-PL-ain\u0022 for short. It\u0027s a bizarre vehicle resembling a train that he claims is capable of leaving the ground and flying through the air without a need for rails.\n\n403: Leonardo Kerman opens a lawsuit against Wright Kerman for stealing his idea. As proof he brings a crude pencil sketch of a Kerbal sitting in a chair with a ring of whirling blades above its head. Meanwhile, Bernoulli Kerman, a sigh-and-test who dreams of being a pie-let, builds a much simpler flying machine using a swarm of birthday balloons.\n\n404: Error. Historical record not found.\n\n405: KYDRA, an underground group of mad sigh-and-tests, steals Leonardo Kerman\u0027s sketch and uses it to build the first prototype of the Kerbal Unreconstitutionator."},{"CreatedByName":"TrainEngie","CreatedById":138031,"CreatedDateTime":"2015-09-11T04:40:31Z","Content":"Trains, then discovery of the mun, then tribal stuff, then spaceflight? whaaaat?\n\n406-410: Jules Kervernes (Kurvern) theorizes about sending oxidised fireworks into space, and asparagus staging, as he writes in his best-selling book, *To the Mun and Back on Firework Clusters: the inspirations from Kei Hu Wan.* After the book is published, **war is stopped** and **the Kerbin\u0027s Guard Navy (commonly called** ***Squad*****) is created on the sole job of defeating the elusive Krakens,** and kerbals wonder if they really can (go) into space, thus leading Sigh-And-Tests to do Science! on blimps.\n\n412-430: The Committee of Navigation [(SCAN) led by Kirk D. Magic](https://forum.kerbalspaceprogram.com/threads/96859-1-0-4-SCANsat-v13-4-Dev-version-July-4) is created, and they find many anomalies on Kerbin, such as the smiley face in the ocean."},{"CreatedByName":"megatiger78","CreatedById":114940,"CreatedDateTime":"2015-09-11T05:36:31Z","Content":"431: kerbals decide to not go to space until 500"},{"CreatedByName":"mythbusters844","CreatedById":72313,"CreatedDateTime":"2015-09-11T05:43:33Z","Content":"432: A gunpowder factory storing almost 200 tons of product explodes, leveling the city of Kskekaera and killing thousands. As this was one of the few gunpowder factories on Kerbin, cheap sounding rockets fueled by it can no longer be made, and the space program takes a huge blow.\n\n**Edited \u003Ctime datetime=\u00222015-09-11T05:46:52Z\u0022 title=\u002209/11/2015 05:46  AM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 11, 2015\u003C/time\u003E by mythbusters844**"},{"CreatedByName":"UnionPacific1983WP","CreatedById":140982,"CreatedDateTime":"2015-09-11T13:20:19Z","Content":"455: Research begins on the Kerbal I.\n\n475: Kerbal I research complete, construction begins.\n\n495: Kerbal I construction complete, set for launch 00:01, 1/1/500.\n\n500: Kerbal 1 launches, set to be orbiting for 10 years before flying into the sun.\n\n501: Rocket trains rediscovered.\n\n**Edited \u003Ctime datetime=\u00222015-09-11T13:24:36Z\u0022 title=\u002209/11/2015 01:24  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 11, 2015\u003C/time\u003E by UnionPacific1983WP**"},{"CreatedByName":"megatiger78","CreatedById":114940,"CreatedDateTime":"2015-09-11T15:58:58Z","Content":"502: rocket trains turned on their side. new method of spacing realised. decup kerman creates the decup-lor, used to separate train components"},{"CreatedByName":"Provisional Name 41","CreatedById":147669,"CreatedDateTime":"2015-09-11T17:23:50Z","Content":"353: Probe is destroyed by Kerbal police.\n\n354: E-Class Asteroid hits Antartic railroad, Railroad reconstruction put on hold until 374.\n\n355: Massive protest begins to call for legalization of SRBs.\n\n356: Pro-SRB protests turn violent after SRBs are shot into railroads everywhere.\n\n357: Rocket revolution begins.\n\n- - - Updated - - -\n\n(Moderators don\u0027t approve that last post, I was on the wrong page)\n\n503: Jebediah Kerman Junkyard and Spacecraft Parts Co. is founded by Jebediah Kerman The II, Being the first private space company.\n\n504: Kerman I Rocket is launched by Jebediah Kerman II and carries TV satellite to Geostationary Kerbin orbit.\n\n504.1: Satellite TV is invented, with JebTV broadcasting an astonishing 6 channels."},{"CreatedByName":"Provisional Name 41","CreatedById":147669,"CreatedDateTime":"2015-09-11T17:26:36Z","Content":"503: Jebediah Kerman Junkyard and Spacecraft Parts Co. is founded by Jebediah Kerman II being the first private space company.\n\n504: Satellite TV is first conceived by Wernher Von Kerman\u0027s ancestor.\n\n505: Kerman \u0022The Rocket\u0022 I is first launched and carries JebTV satellite to Geostationary orbit, JebTV has an astonishing 6 channels and will stop signaling after 1 drop of water is dropped."},{"CreatedByName":"otblock","CreatedById":137181,"CreatedDateTime":"2015-09-11T19:52:51Z","Content":"507: After 1 drop of water is dropped, the newest Rocket, Kerman II is rolled up to the launch pad. Mission Status: Catastrophic Failure. Explosion on launchpad. \n\n508: 6 tries later, A new and improved JebTV satellite, which broadcasts an unheard of 7 channels, and stops signaling after two drops of water."},{"CreatedByName":"megatiger78","CreatedById":114940,"CreatedDateTime":"2015-09-12T07:17:10Z","Content":"510: miss-and-control discovers that there might be a way to send a pie-let into space on a SRB"},{"CreatedByName":"TheRag","CreatedById":144674,"CreatedDateTime":"2015-09-12T23:10:25Z","Content":"511: SRBs is scrapped, Jeb\u0027s Junkyard is taken over by Rockomax. New LFO only rocket is developed, performs marginally well."},{"CreatedByName":"Alphasus","CreatedById":147173,"CreatedDateTime":"2015-09-12T23:13:15Z","Content":"512: Because Rockomax doesn\u0027t exist, the LFO rocket is sold by jeb\u0027s Junkyard."},{"CreatedByName":"windows_x_seven","CreatedById":112926,"CreatedDateTime":"2015-09-12T23:41:58Z","Content":"513: Jeb\u0027s Junkyard sells itself and becomes Rockomax."},{"CreatedByName":"UnionPacific1983WP","CreatedById":140982,"CreatedDateTime":"2015-09-12T23:42:57Z","Content":"525: Rockomax discovers ion propulsion. The first ion ship crashes into a radar dish."},{"CreatedByName":"EdusacconBR","CreatedById":135047,"CreatedDateTime":"2015-09-12T23:48:54Z","Content":"526: kerbals try to land on mun with a ion ship"},{"CreatedByName":"mythbusters844","CreatedById":72313,"CreatedDateTime":"2015-09-13T00:12:37Z","Content":"526.000000000000000000000000000001: The ion ship refuses to get off the surface of Kerbin.\n\n527: The first launch of an all-solid launch vehicle is attempted, but at ignition it simply explodes, destroying the pad and severely damaging the surrounding space center."},{"CreatedByName":"megatiger78","CreatedById":114940,"CreatedDateTime":"2015-09-13T10:04:08Z","Content":"528: miss-and-control\u0027s SRB with a pie-let on it sets the Kerbin altitude record of 5000 Meters. science gained indicates that liquid fuel and liquated oxidiser might work. rockomax conglomerate founded as second space parts company, along with jeb\u0027s junkyard and spaceship parts co, which invents an SRB twice the size of the existing ones."},{"CreatedByName":"Provisional Name 41","CreatedById":147669,"CreatedDateTime":"2015-09-13T13:18:43Z","Content":"529: Using the improved \u0022Hammer\u0022 SRBs and LOX/LH2 rockets, The Kerman II is launched and sends JebTV satellite up to Geostationary Orbit\n\n530: The KSP is founded.\n\n531: Jebediah Kerman, Bob Kerman, Bill Kerman and Valentina Kerman become the first kerbonauts.\n\n532: KSP sends Jebediah Kerman on suborbital trajectory and back safely\n\n533: KSP attempts to send probe to the Mun to determine whether it\u0027s made of cheese or rock."},{"CreatedByName":"Yukon0009","CreatedById":109376,"CreatedDateTime":"2015-09-13T14:56:50Z","Content":"534: A lunatic named Frank Kerman steals an experimental Mun rocket and lands it, hoever he dies when he takes off his helmet to taste the rocks. He is slowly forgotten from history and becomes a popular children\u0027s bed-time story tale."},{"CreatedByName":"TheRag","CreatedById":144674,"CreatedDateTime":"2015-09-13T17:21:54Z","Content":"535: Frank Kerman\u0027s Brother, Werner von Kerman is fired from an unknown research group, he applies to the KSC as a junior scientist, he accidentently developed a radial liquid engine, nicknames it the Thud.\n\n536: The KSC is built and finally gets a dedicated launchpad.\n\n537: The \u0022Thud\u0022 is plagrized by a kerbal named Eumon Kerman, the patent wars start."},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2015-09-15T20:54:38Z","Content":"538: The KSC burns down in a \u0027freak accident\u0027 while experimenting with foreign engines\n\n539: The snack famine begins. \n\n540: The KSC opens up the first government sponsored snack factory.\n\n- - - Updated - - -\n\n545: The Kraken Drive is invented\n\n546: The Kraken Drive is outlawed, as it pulled ships apart."},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2015-09-16T16:37:33Z","Content":"Well now it\u0027s my turn to go \u0022WUT\u0022: First, why is it that despite knowing that the current year is supposed to be 5000, people are posting stories about Jeb and the gang in the 500s? Am I the only one around who thinks it\u0027s fishy to have them be 4500 years old? Not to mention nobody announced any of their births yet.\n\nAnd apparently the Squad was convened and Kraken drives invented before the Kraken was discovered (srsly - check the thread).\n\nAhem.\n\n547: For the first time in Kerbal history, a desperate group of sigh-and-tests and engine-nears decide to forgo anything overly ambitious and just send a simple, unmanned rocket into low Kerbin orbit. The mission is a resounding success, and Kerbalkind now considers itself a spacefaring civilization.\n\n548: After about a year in orbit, the unmanned craft, known as Stayputnik 1, begins transmitting anomalous readings. Analysis of its signals reveal a faint \u0022echo\u0022 as if radio waves were bouncing off an unknown object lurking in space. To make things weirder, the object does not appear to be maintaining a stable orbit, but rather moving around as if under its own power. A week later, all signs of it have disappeared and the probe mysteriously goes offline. Historians will later theorize that this was the first record of the Kraken."},{"CreatedByName":"megatiger78","CreatedById":114940,"CreatedDateTime":"2015-09-18T15:33:38Z","Content":"549: kerbalkind discovers that they had been in a period of temporary race-wide madness between 289 and 547"},{"CreatedByName":"Goodle...","CreatedById":93658,"CreatedDateTime":"2015-09-21T11:16:06Z","Content":"\u003E \n\u003E 131: Takua \u0022The Khronikler\u0022 Kerman decides to begin a recording of Kerbal History for posterity. Unfortunately he slips on a toad-like creature and the pages of his first draft scatter in the wind, where they would later be reconstructed by at least four different historians into at least four different far-fetched and wildly inaccurate retellings of the story of Kerbalkind.\n\u003E 132: Looking up in wonder at the night sky, Wen Hrer Kerman (far removed ancient ancestor of the future Wernher Von Kerman) makes note of a circular region that is significantly lighter than the background and which has a greyish color. He scrawls a description of it on a piece of kapyrus, but then trips on a small pebble. The kapyrus falls into a peat bog, where it miraculously is preserved for millenia, sealing for all history that Wen Hrer was the first to discover and document the Mun (although he called it \u0022The Grey Part of the Sky That\u0027s Sort of Roundish\u0022).\n\u003E \n\u003E Okay I went over three sentences by a smidgen, but only two things happened xP\n\nIs that \u0022Takua\u0022 by any chance Me in disguise? (i created Kerbal history...)"},{"CreatedByName":"megatiger78","CreatedById":114940,"CreatedDateTime":"2015-09-22T15:29:28Z","Content":"600: nothing happens, except a kerbal kult called the \u0022Bumpers\u0022 reaches popularity. another kult called the \u0022Mods\u0022 shuts them down."}]}