{"TopicId":117572,"ForumId":16,"TopicTitle":"Matching orbit to Minmus, just outside SOI?","CreatedByName":"Cooper42","CreatedById":145304,"CreatedDateTime":"2015-08-04T00:20:08Z","PageNum":1,"Articles":[{"CreatedByName":"Cooper42","CreatedById":145304,"CreatedDateTime":"2015-08-04T00:20:08Z","Content":"I want to put a satellite in an orbit that matches Minmus, and is just outside it\u0027s SOI. Two, in fact, on in front and one behind.\n\nI\u0027m trying to set up a Kerbin system comms network (using RemoteTech). After working throgh various options on paper, the most efficient, it seemed to me, would be to place two satellites each for Mun and Minmus, matching orbits, outside of their SOI, one just in front, one just behind, with dishes pointed at the moons and back at Kerbin (where I already have a 4-satellite network setup.)\n\nI\u0027ve managed to do this for the Mun. But with a bit of difficulty. I started by entering an eliptical orbit where the Ap matched the Mun and where the closest to target position was at the Ap, and that distance was just beyond the Mun\u0027s SOI. With the plan to simply circularise the orbit at the Ap.\n\nHowever, despite the patched conics not showing as such, this managed to trap me in the Mun\u0027s SOI during the approach to the Ap (clearly the closest positions marker was wrong...). Thankfully I\u0027d budgeted about 2km/s more Dv than I needed and managed to salvage the mission and have the satellites for the Mun setup now.\n\nThe same thing has happened with my Minmus approach, but I do not have enough Dv to correct the course. So have simply sent it to crash on Kerbin and am planning to try it again.\n\nIs there a better wayto match orbits with Minmus (but not be captured by it) than the method I gave above? Or do I simply need to use that method but give more distance at the Ap to avoid being captured by the SOI in advance of the Ap?"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2015-08-04T00:28:21Z","Content":"A) first off, beware SOI inflation. Many of my vessels had unexpected encounters -- to the best of my knowledge, this happens during timewarp. \u0022Just outside some body\u0027s SOI\u0022 may be quite unstable in practice.\n\n![B)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png) how to: either approach the point from behind (coming from a higher orbit) or accept that you will pass through the moon\u0027s SOI (and try to leave it in just the right place)."},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-08-04T00:54:55Z","Content":"KSP\u0027s orbit calculations aren\u0027t precise enough to get something like this working. You can\u0027t even really expect to get 3 satellites orbiting in tandem, without them wandering a bit over time. Only with that situation, it\u0027s usually not an instant catastrophe when they wander.\n\nNo matter what you do, eventually this will fail and more likely than not, you won\u0027t notice it until you need that satellite, find out it\u0027s gone, and are surprised to learn it\u0027s now orbiting the Sun."},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-08-04T04:45:04Z","Content":"I love RemoteTech and play it all the time. What I generally do for Mun or Minmus is to just put a couple of satellites in polar orbits, at right angles to each other, at as high a circular orbit as they can be while sticking inside the SoI. I give them each a DTS-M1 pointed at Kerbin, and a 5000km omni antenna.\n\nIn practice, this does the trick. They give pretty good coverage over the body\u0027s surface, they almost always can see each other, and at least one of them (usually both) see Kerbin. It works out pretty well."}]}