{"TopicId":117562,"ForumId":69,"TopicTitle":"[BUG] Problem with ResourceHarvester atmospheric rate (proposed solution attached)","CreatedByName":"seanth","CreatedById":79989,"CreatedDateTime":"2015-08-03T21:54:30Z","PageNum":1,"Articles":[{"CreatedByName":"seanth","CreatedById":79989,"CreatedDateTime":"2015-08-03T21:54:30Z","Content":"\n\u003Cp\u003EThis is a weird bug to report because it\u0027s for an existing module, but there is no stock part that makes use of harvesting resources from the atmosphere. Is this a report for stock or for modded? \u003C/p\u003E\u003Cp\u003ERegardless, I put this up over on github, but am placing it here just in the hopes of getting more eyes on this and having people sanity check what I\u0027m doing. I model how plants grow for my day job; I don\u0027t usually mess around with things involving the ideal gas law and how it applies to to atmospheres on other planets.\u003C/p\u003E\u003Cp\u003E----------------------------------------------\u003C/p\u003E\u003Cp\u003EI think the code for HarvesterType == 2 in REGO_ModuleResourceHarvester.cs is incorrectly calculating the rate. Even though Regolith is rolled into stock KSP, now, I hope this makes sense and it helps fix things. Sorry for the length, but it\u0027s hard to explain. Example calcs at \u003Ca href=\u0022https://www.dropbox.com/s/ulgrl91vkm63s4i/REGO_ModuleResourceHarvester.xlsx?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/ulgrl91vkm63s4i/REGO_ModuleResourceHarvester.xlsx?dl=0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ERight now, the rate units atmospheric collection are incorrect given how a planetary resource is configured. I\u0027m not a unity guy, I mainly use python, but instead of \u003C/p\u003E\u003Cp\u003Evar rate = abundance * Efficiency;\u003C/p\u003E\u003Cp\u003EI think you need something like the following:\u003C/p\u003E\u003Cp\u003E**Step 1**: either calculate the L/mol of a gas at STP for Kerbin or just hard code it.\u003C/p\u003E\u003Cp\u003EThe calculate is (n*R*T)/P=V; where n=1, P=101.325kPa, R=8.314, and K=273.16. V is in L\u003C/p\u003E\u003Cp\u003EV=22.4135 L/mol, but it\u0027s easier to just say 22.4 L/mol\u003C/p\u003E\u003Cp\u003E**Step 2**: use the harvested resource\u0027s density to estimate it\u0027s molecular weight\u003C/p\u003E\u003Cp\u003EFor example\u0027s sake, let\u0027s use CO2 from the community resource pack.\u003C/p\u003E\u003Cp\u003EDensityCO2=0.000001951tonne/L at STP. It\u0027s easier to work with in g/L, so: 1.951 g/L\u003C/p\u003E\u003Cp\u003EThe density of the gas multplied by the ideal gas L/mol will give an approximation of the gas\u0027 molecular weight at STP:\u003C/p\u003E\u003Cp\u003E1.951g/L * 22.4 L/mol = 43.7024 g/mol (the real-world value is 44.01 g/mol, so we\u0027re in the ballpark)\u003C/p\u003E\u003Cp\u003E**Step 3**: calculate the number of moles in a given sample of atmosphere.\u003C/p\u003E\u003Cp\u003ELet\u0027s assume a part is sucking in 1L of atmosphere, so V=1. Let\u0027s also assume the percent CO2 in the atmosphere is 1.5% by volume (value coming from community resource pack).\u003C/p\u003E\u003Cp\u003EThat means 1.5% of the 1L atmosphere is CO2, so 0.015L\u003C/p\u003E\u003Cp\u003E(P*V)/(R*T)=n; (101.325*0.015)/(8.314*273.16)=n; n=0.000669 mol CO2 in 1 L of atmosphere.\u003C/p\u003E\u003Cp\u003E**Step 4**: calculate the g CO2.\u003C/p\u003E\u003Cp\u003EUse the moles calculated in step 3 and the g/mol estimated in step 2\u003C/p\u003E\u003Cp\u003E0.000669 mol CO2 * 43.7024 g/mol CO2= 0.02924 g CO2\u003C/p\u003E\u003Cp\u003E**Step 5**: calculate the L of CO2 at STP in the sample of atmosphere.\u003C/p\u003E\u003Cp\u003EDoing this calculation using the density of the resource at STP of Kerbin is critical because of the gas law.\u003C/p\u003E\u003Cp\u003EDensityCO2 at STP=1.951g/L\u003C/p\u003E\u003Cp\u003E0.02924g CO2/(1.951g/L)=0.01499 L CO2 in the sample.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EEdit: yes, the value 0.01499L is the same (with rounding errors) to the 0.015L of CO2 in the percentage calculation. Which is excellent, because this calculation was done at STP, so it should be the same value. As you change the atmospheric pressure or the temp, the value will change\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m sure you can see the volume of the sample would be the rate that a part like a ATMIntake is taking in atmosphere, and it can be adjusted by the part\u0027s efficiency.\u003C/p\u003E\u003Cp\u003EI\u0027m not really used to explaining something like this without a whiteboard or something, so I\u0027m sorry fror the wordiness. I put an excel sheet showing example calculations of the steps above at \u003Ca href=\u0022https://www.dropbox.com/s/ulgrl91vkm63s4i/REGO_ModuleResourceHarvester.xlsx?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/ulgrl91vkm63s4i/REGO_ModuleResourceHarvester.xlsx?dl=0\u003C/a\u003E \u003C/p\u003E\u003Cp\u003EDoing the above calculations allows you to get the amount of gas in liters as the pressure and/or temp changes. So as a ship\u0027s altitude changes, or the temp of the atmosphere changes over the course of the day, it should result in reasonable changes in the amount of gas harvested.\u003C/p\u003E\u003Cp\u003EI just threw this together quickly, so I happily admit I might have missed something critical.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-03T22:45:52Z\u0022 title=\u002208/03/2015 10:45  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 3, 2015\u003C/time\u003E by seanth\u003C/strong\u003E\n\u003C/span\u003E\n"}]}