{"TopicId":117590,"ForumId":18,"TopicTitle":"What\u0026#039;s the glitchiest that game you ever played?","CreatedByName":"Ethanadams","CreatedById":136913,"CreatedDateTime":"2015-08-04T05:15:04Z","PageNum":1,"Articles":[{"CreatedByName":"Ethanadams","CreatedById":136913,"CreatedDateTime":"2015-08-04T05:15:04Z","Content":"\n\u003Cp\u003EExactly as the title states what is the most broken game that you have ever played\u003C/p\u003E\u003Cp\u003Eby glitch I mean anything that is not meant to happen in the game like flying guards or getting 839284838x errors\u003C/p\u003E\u003Cp\u003Eedit crap messed the title up Kent to be glitchiest game \u003C/p\u003E\u003Cp\u003Eplease don\u0027t say stereotypes like sonic 06 KSP (it\u0027s really glitchy but that can\u0027t be helped)\u003C/p\u003E\u003Cp\u003Emine would have have to be assassins creed II or 2\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-04T16:35:08Z\u0022 title=\u002208/04/2015 04:35  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 4, 2015\u003C/time\u003E by Ethanadams\u003C/strong\u003E\n\u003Cbr\u003EFixed the title for you.\n\u003C/span\u003E\n"},{"CreatedByName":"PatPL","CreatedById":115556,"CreatedDateTime":"2015-08-04T08:19:11Z","Content":"\n\u003Cp\u003ECrashday, very buggy damage system, and skipping through walls (Not to mention there\u0027s no maximum speed, so you can accelerate to even few thousands kph)\u003C/p\u003E\u003Cp\u003EAlthough I still like it, because it has nice map editor and gamemodes.\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-08-04T08:47:07Z","Content":"\n\u003Cp\u003EStar Wolves 2, I had high hopes because the first game was so good, and while there might be a good game there it\u0027s unfinished and unplayable, even with the patch (and no English patch at all).\u003C/p\u003E\u003Cp\u003ELeaving title as it is as it\u0027s more appropriate and funny.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-08-04T08:49:53Z","Content":"\n\u003Cp\u003EI honestly think KSP is the glitchiest game I\u0027ve ever played. Or maybe Minecraft. They both didn\u0027t get better after \u0022release\u0022 either.\u003C/p\u003E\n"},{"CreatedByName":"steve_v","CreatedById":69272,"CreatedDateTime":"2015-08-04T11:14:28Z","Content":"\n\u003Cp\u003ESorry to say it, but KSP is most definitely the buggiest released game I have \u003Cem\u003Eplayed\u003C/em\u003E. A testament to the awesome concept though as anything comparable, bugs wise, never got past 5 minutes game time.\u003C/p\u003E\n"},{"CreatedByName":"mordin86","CreatedById":29223,"CreatedDateTime":"2015-08-04T11:15:02Z","Content":"\n\u003Cp\u003ETime Rammeside aka the A New Reckoning - one of the most broken indie game ever created. \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://store.steampowered.com/agecheck/app/290650/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://store.steampowered.com/agecheck/app/290650/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/tivh3YZ.jpg\u0022 alt=\u0022tivh3YZ.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Y9B4C9U.jpg\u0022 alt=\u0022Y9B4C9U.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/qlwh3hE.jpg\u0022 alt=\u0022qlwh3hE.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/2dekRKk.jpg\u0022 alt=\u00222dekRKk.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENo no, it is not early access or anything, this is how done, finished product looks like. And it not the Unity game - its on brand new Unreal 4.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-08-04T12:29:37Z","Content":"\n\u003Cp\u003EHmmmm. Probably GTA: San Andreas on the PS2. Considfering the scale and scope of the game I don\u0027t think it was unduly glitchy but there were certainly plenty of issues, and more than in GTA3 or Vice City. Especially in fast driving or flying when things wouldn\u0027t load up in time, possibly made worse by a worn out drive or disc - on many occasions I collided with an invisible object and \u003Cem\u003Ethen\u003C/em\u003E the game got round to drawing it.\u003C/p\u003E\n"},{"CreatedByName":"DestinyPlayer","CreatedById":143980,"CreatedDateTime":"2015-08-04T12:43:15Z","Content":"\n\u003Cp\u003EChampions online. Thankfully, all of it\u0027s glitches are ridiculous and hilarious, like with people in cutscenes sliding instead of walking/running. No game-breaking glitches.\u003C/p\u003E\n"},{"CreatedByName":"Thomas988","CreatedById":92699,"CreatedDateTime":"2015-08-04T13:13:28Z","Content":"\n\u003Cp\u003EGonna admit, KSP is probably the worst. I flew to Jool today with only a few mods installed, and I still had to restart the game several times due to me being unable to interact with the UI. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"DestinyPlayer","CreatedById":143980,"CreatedDateTime":"2015-08-04T13:45:33Z","Content":"\n\u003Cp\u003EI\u0027ve always wondered, how come I\u0027m one of the only people for whom KSP\u0027s bugginess limits to running out of memory due to a huge amount of mods and a limited amount of RAM? Which fixed itself when I got some more RAM, so that the 4 RAM available to 32bit KSP wouldn\u0027t be taken up by the OS and other stuff.\u003C/p\u003E\u003Cp\u003EThat said, I seem to never run into any sufficently dangerous bugs in any game I play, outside of heavy modding, and even then it\u0027s my fault most of the time for forgetting something.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-04T13:51:26Z\u0022 title=\u002208/04/2015 01:51  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 4, 2015\u003C/time\u003E by DestinyPlayer\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Sampa","CreatedById":130079,"CreatedDateTime":"2015-08-04T13:59:41Z","Content":"\n\u003Cp\u003EDoes microsoft flight simulator x,count?\u003C/p\u003E\n"},{"CreatedByName":"Alphasus","CreatedById":147173,"CreatedDateTime":"2015-08-04T14:00:29Z","Content":"\n\u003Cp\u003Ex plane 10, when trying to do multiplayer over LAN.\u003C/p\u003E\n"},{"CreatedByName":"Camaron","CreatedById":100218,"CreatedDateTime":"2015-08-04T14:08:13Z","Content":"\n\u003Cp\u003EGlitchiest game I\u0027ve played is Need For Speed Pro Street. Followed by Need For Speed Shift. Then an old PS2 title called Hypersonic Xtreme. Starhawk and Warhawk were both great games that bugged out more than KSP does. Hell, SPORE gives it a run for its money. (Funny how there are three EA games on my list).\u003C/p\u003E\u003Cp\u003EAnd who could forget Grand Theft Auto 5? In crashouts from Online alone it beats KSP in bugginess easily. Then you have all the other bugs too.\u003C/p\u003E\u003Cp\u003EThe people calling KSP their glitchiest game haven\u0027t played much. Its rocksolid compared to some of the crap I\u0027ve had the misfortune of dealing with.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-04T14:32:06Z\u0022 title=\u002208/04/2015 02:32  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 4, 2015\u003C/time\u003E by Camaron\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RAINCRAFTER","CreatedById":127524,"CreatedDateTime":"2015-08-04T14:09:51Z","Content":"\n\u003Cp\u003ESuper Mario Bros, the original for the NES.\u003C/p\u003E\u003Cp\u003EThe Minus World is game breaking, and I rarely get glitches in KSP.\u003C/p\u003E\n"},{"CreatedByName":"PatPL","CreatedById":115556,"CreatedDateTime":"2015-08-04T15:04:13Z","Content":"\n\u003Cp\u003EAlso Watchdogs. And all other Ubisoft games. Kraken\u0027s nest.\u003C/p\u003E\n"},{"CreatedByName":"cziken20","CreatedById":95907,"CreatedDateTime":"2015-08-04T15:21:31Z","Content":"\n\u003Cp\u003ESkyrim. The only game i ever played that had glitches (i didnt play many games).\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2015-08-04T16:13:25Z","Content":"\n\u003Cp\u003EFallout: New Vegas takes the cake. EVERY SINGLE THING was glitched out when that game first shipped, and it hasn\u0027t gotten much better afterwards. Quest items glitching through the ground? Check. Main story quests that were impossible to complete because the player would glitch through the ground in front of the quest point? Check. Or a bomb that wasn\u0027t there yet blew up anyway? Check. Or every deathclaw in the game suddenly teleporting to the top of Black Mountain just after the player finished an epic fight with a bunch of super mutants? Double Check. \u003C/p\u003E\u003Cp\u003ESkyrim comes a close second, but only because of the first patch. Orbital dragons? Check. Dragons flying backwards and breathing fire out of their arse? Check. Quests that (are still today, four years later) glitched out and impossible to complete because you picked up the quest item before you had the quest? Check.\u003C/p\u003E\u003Cp\u003EI\u0027m sure I\u0027m forgetting something from my youth, but the code quality of shipped games from twenty years ago was generally far better. In part because games were considerably less complex, but also because distributors were quicker to reject horridly broken games. (I do recall some pretty badly broken fan imports/subs of japanese games, but I can\u0027t blame the devs for that.)\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2015-08-04T16:22:37Z","Content":"\n\u003Cp\u003ERome: Total War. Even the gold box edition had a list of serious bugs as long as your arm. Stuff like units moving to the wrong places, archers shooting the wrong targets and killing your own men in the process, cavalry would run right up to a fleeing enemy unit, hit them once, and then stand still and watch them run away, etc.\u003C/p\u003E\n"},{"CreatedByName":"Plume \u0026amp; Akakak","CreatedById":142955,"CreatedDateTime":"2015-08-04T16:30:48Z","Content":"\n\u003Cp\u003EHow about defining the difference between a \u003Cem\u003Eglitch\u003C/em\u003E and a \u003Cem\u003Ebug\u003C/em\u003E ?\u003C/p\u003E\u003Cp\u003EOk. I\u0027m out.\u003C/p\u003E\n"},{"CreatedByName":"GDJ","CreatedById":58462,"CreatedDateTime":"2015-08-04T16:41:06Z","Content":"\n\u003Cp\u003ELets see.....\u003C/p\u003E\u003Cp\u003ELock \u0027n\u0027 Chase (Intellivision): A knock off of Pacman. You\u0027re the Robber, the opponents are Cops. At the right place at the right level, you could slip into the borders, the cops go snake, and your points earned go thru the roof (this only affected the early cartridges and 1st gen consoles).\u003C/p\u003E\u003Cp\u003EAstrosmash (Intellivision): At one point the screen would go into different colours, then I die. Did get a replacement cartridge that worked flawless afterwards (might have been a hardware issue)\u003C/p\u003E\u003Cp\u003ELoderunner (Apple IIe): Pretty bad, even for it\u0027s simple 8 bit processing. After some of us found the bugs in the BASIC lines of program, it got better.\u003C/p\u003E\u003Cp\u003ENeed for speed 1 (PS1): Horrid frame rate, cars went thru obstacles, would crash at random. Did get a replacement disc that was significantly better (an update of sorts)\u003C/p\u003E\u003Cp\u003EHalf Life (PSII): Didn\u0027t even load. Got a replacement.\u003C/p\u003E\u003Cp\u003EGrand Turismo II (PS1): Arcade disc had a crash when you went into the test track. Got a free replacement that worked great.\u003C/p\u003E\u003Cp\u003EMinecraft (iOS): First versions were less buggy, then they got worse. Latest one isn\u0027t too bad.\u003C/p\u003E\u003Cp\u003EKerbal Space Program (Mac OS X): I do hate to say this, but there is some issues. Not many with a stock unmodded game, but mods do make it unstable rather quickly. I do love the game, and my Dad uses it to test out Video Cards and CPU performance when he builds a computer.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-04T16:44:16Z\u0022 title=\u002208/04/2015 04:44  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 4, 2015\u003C/time\u003E by GDJ\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ricovandijk","CreatedById":71535,"CreatedDateTime":"2015-08-04T17:40:57Z","Content":"\n\u003Cp\u003ETerminal Velocity (1995). Waited months before my parents finally bought a computer with an optical drive (CD-ROM). then it would play until level 10 or so and crash always at the same place. Very disappointing.\u003C/p\u003E\u003Cp\u003EHowever it got me hooked up to space simulations/games. so it kinda gives me a good feeling when I think back of playing it for the first time.\u003C/p\u003E\n"},{"CreatedByName":"Dman979","CreatedById":123837,"CreatedDateTime":"2015-08-04T19:01:34Z","Content":"\n\u003Cp\u003EHaven\u0027t played it, yet, but Goat Simulator seems pretty buggy. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Endersmens","CreatedById":80723,"CreatedDateTime":"2015-08-04T20:21:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dman979\u0022 data-cite=\u0022Dman979\u0022\u003E\u003Cdiv\u003EHaven\u0027t played it, yet, but Goat Simulator seems pretty buggy. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGoat Simulator doesn\u0027t count, because the bugs are codes on purpose. \u003C/p\u003E\u003Cp\u003EIt can\u0027t be considered glitchy if it\u0027s intended purpose was to be glitchy XD\u003C/p\u003E\n"},{"CreatedByName":"mythbusters844","CreatedById":72313,"CreatedDateTime":"2015-08-05T00:26:55Z","Content":"\n\u003Cp\u003EProbably minecraft. This is what happened when I tried to play the game after not playing it for a full year:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/RwzFogO.png\u0022 alt=\u0022RwzFogO.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI deleted it after about ten seconds.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ethanadams\u0022 data-cite=\u0022Ethanadams\u0022\u003E\u003Cdiv\u003EKSP (it\u0027s really glitchy but that can\u0027t be helped)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, I totally hate when people say that KSP has bugs. They should stop being entitled and learn that Squad can\u0027t do anything about it and it\u0027s problems with unity, not them. :^)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-05T05:04:38Z\u0022 title=\u002208/05/2015 05:04  AM\u0022 data-short=\u00228 yr\u0022\u003EAugust 5, 2015\u003C/time\u003E by mythbusters844\u003C/strong\u003E\n\u003Cbr\u003Emade colon caret parentheses more clear\n\u003C/span\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-08-05T00:38:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cydonian Monk\u0022 data-cite=\u0022Cydonian Monk\u0022\u003E\u003Cdiv\u003EI\u0027m sure I\u0027m forgetting something from my youth, but the code quality of shipped games from twenty years ago was generally far better. In part because games were considerably less complex, but also because distributors were quicker to reject horridly broken games. (I do recall some pretty badly broken fan imports/subs of japanese games, but I can\u0027t blame the devs for that.)\u003C/div\u003E\u003C/blockquote\u003EI credit/blame the change with that in the past patches were basically impossible on consoles and not easy to distribute on PCs. Developers \u003Cem\u003Ehad\u003C/em\u003E to get the game right first time, or free of serious bugs at the very least, even if that meant adding a lot to the development schedule.\u003Cp\u003ENowadays developers know they can patch any issues after the fact, so it\u0027s a lot easier for them to cut short the testing if they want to rush the release out so they can start getting revenue sooner. And then once they have the money in the bank they might feel that it\u0027s less profitable to make bugfixes than to get on with the next game.\u003C/p\u003E\n"}]}