{"TopicId":117600,"ForumId":16,"TopicTitle":"Why this ship collapsed in space?","CreatedByName":"Moonk","CreatedById":148856,"CreatedDateTime":"2015-08-04T08:55:13Z","PageNum":1,"Articles":[{"CreatedByName":"Moonk","CreatedById":148856,"CreatedDateTime":"2015-08-04T08:55:13Z","Content":"Hello, i would like to ask expirienced players. \n\nI have a ship with such composition in cargo bay \n\n![xAe1nR4TGvzBAy.jpg](http://joxi.ru/xAe1nR4TGvzBAy.jpg)\n\nShe went to Mun orbit, made docking, took crew and left Mun SOI. After few maneuvers heading to Minmus, she falls on 3 parts. I didnt saw blow up, just find that now i have few ships after timewarp and manuvering other ship.\n\nCabin with some staff missing in cargo \n\n![bmoWq8ltY1pXmy.jpg](http://joxi.ru/bmoWq8ltY1pXmy.jpg)\n\nEngine and Fuel bank\n\n![a2X3qJwtB9n6mg.jpg](http://joxi.ru/a2X3qJwtB9n6mg.jpg)\n\nStaff from cargo bay \n\n![ZrJXaZwsPyVa2j.jpg](http://joxi.ru/ZrJXaZwsPyVa2j.jpg)\n\nI havnt found Monop-t tanks, but i have debris=0 \n\nSo what goes wrong? \n\nFull size ship \n\n![DmBNQM9Fap9MmP.jpg](http://joxi.ru/DmBNQM9Fap9MmP.jpg)\n\nand closer look at Mono-tanks, as u see they are somewhat inside Reaction Wheel\n\n![v29WxkgtaD7KrG.jpg](http://joxi.ru/v29WxkgtaD7KrG.jpg)\n\nSo the problen is with mono tanks disposition ? Or it was just kraken? \n\nMaybe it was some kind of overheating from the Sun? or radiation from the Atomic Engine?\n\n- - - Updated - - -\n\nI made such changes and going to dock crewcabin to save it and went to my business on Minmus. \n\n![KAg8xOwfWDgyrl.jpg](http://joxi.ru/KAg8xOwfWDgyrl.jpg)\n\n**Edited \u003Ctime datetime=\u00222015-08-04T09:12:24Z\u0022 title=\u002208/04/2015 09:12  AM\u0022 data-short=\u00228 yr\u0022\u003EAugust 4, 2015\u003C/time\u003E by Moonk**"},{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-08-04T08:58:57Z","Content":"The problem is the godawful cargo bay. It has 4 attachment nodes - 2 on the outside, 2 inside. Except the inner and outer are so close together, and without orientation enforcing rules, that most cargo will happily clip to the outer node and the bay will attach by the inner node, making the cargo, the bay and whatever it\u0027s attached to to be clipped and struggle for explosive disasembly when deployed.\n\nUse a short MK3 bay instead. It\u0027s far less trouble."},{"CreatedByName":"Moonk","CreatedById":148856,"CreatedDateTime":"2015-08-04T09:12:00Z","Content":"i prefer mk2, it weights less. thanks u )"},{"CreatedByName":"Higgs","CreatedById":121852,"CreatedDateTime":"2015-08-04T09:22:32Z","Content":"Sharpy is absolutely right. Those round bays are known ship killers. Its your copy of the game use what you like but expect problems if you use those god awful bugged round bays Moonk.\n\n**Edited \u003Ctime datetime=\u00222015-08-04T09:25:48Z\u0022 title=\u002208/04/2015 09:25  AM\u0022 data-short=\u00228 yr\u0022\u003EAugust 4, 2015\u003C/time\u003E by Higgs**"},{"CreatedByName":"Moonk","CreatedById":148856,"CreatedDateTime":"2015-08-04T09:25:50Z","Content":"Thanks u guys, mk2 looks cool, gives more space and weights 50 ks less. Going to use only them instead of round."},{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-08-04T10:07:38Z","Content":"Just watch out for one teeny tiny caveat: All MK2 parts have lift - act as (very weak, small) wings. It may cause some trouble with gravity turn if not given enough control authority (a good reaction wheel?) to counteract it. And watch out for parts clipping through its walls/doors. They will cause the same kind of trouble.\n\nOTOH: You can store an MK1 fuel fuselage/tank inside a MK2 bay and it will provide the same amount of fuel as MK2 fuselage in about the same or lower weight and with room to attach \u0022tiny\u0022 sized parts to it radially. If you attach the fuselage to the node, and the parts to the fuselage and not to the bay, they will be occluded from drag just fine. [More on this.](https://forum.kerbalspaceprogram.com/threads/129019-Mk2-Fuel-Trick-Double-the-fuel-amount-in-half-of-the-space?p=2087435\u0026viewfull=1#post2087435)\n\n![t5a8qO6.jpg](http://i.imgur.com/t5a8qO6.jpg)"},{"CreatedByName":"Skorpychan","CreatedById":72052,"CreatedDateTime":"2015-08-04T10:43:02Z","Content":"I\u0027d say it\u0027s that you\u0027re pushing two wide things connected by a regular docking port. That can cause a LOT of flex. Reinforce it with struts, or use Sr ports."},{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-08-04T10:48:01Z","Content":"\u003E \n\u003E I\u0027d say it\u0027s that you\u0027re pushing two wide things connected by a regular docking port. That can cause a LOT of flex. Reinforce it with struts, or use Sr ports.\n\nIf you look at the debris screenshot (\u0022after disassembly\u0022) there are leftover strut stubs."},{"CreatedByName":"Skorpychan","CreatedById":72052,"CreatedDateTime":"2015-08-04T11:00:28Z","Content":"The screenshots also don\u0027t show any struts in the relevant area. You need to strut past any narrowings of the ship, or it just folds."}]}