{"TopicId":117683,"ForumId":16,"TopicTitle":"If a Kerbonaut dies science is lost?","CreatedByName":"Pirx","CreatedById":149331,"CreatedDateTime":"2015-08-05T08:27:13Z","PageNum":1,"Articles":[{"CreatedByName":"Pirx","CreatedById":149331,"CreatedDateTime":"2015-08-05T08:27:13Z","Content":"\n\u003Cp\u003EGood Morning!\u003C/p\u003E\u003Cp\u003EThis is my first time writing in the KSP forums ^^\u003C/p\u003E\u003Cp\u003EIm writing because I have a question regarding gatherinng science, yesterday I managed for the first time to make a succesful landing on the Mun in science mode, after more than 5 flights and 3 unssucesful landings (I didn\u0027t know you could reload autosaves so all in all it took me more than 3 hours of gameplay). \u003C/p\u003E\u003Cp\u003EAfter making all the experiments, launching the spaceship from the moon and managing to have a reentry orbit while on the smoke of my engines (I finished with 0.3 of fuel remaining in my tanks xDDD) my command pod (equipped with a heat shield and everything) exploded on the reentry thus vaporizing the poor Valentina Kerman and all the experiments she had performed (more than 300 science in all).\u003C/p\u003E\u003Cp\u003EI would like to know if all the science I gathered and that was stored on the command pod was lost or I will be able to perform the experiments again without the reduction for making them a second time.\u003C/p\u003E\u003Cp\u003EÃ‚Â¡Thanks in advance for the help!\u003C/p\u003E\u003Cp\u003EHere you have an image of the brave and deceased Valentina\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://postimg.org/image/x239o0wrv/full/\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://s9.postimg.org/5rhyg3tv3/220200_screenshots_2015_08_04_00007.jpg\u0022 alt=\u0022220200_screenshots_2015_08_04_00007.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://postimage.org/index.php?lang=spanish\u0022 rel=\u0022external nofollow\u0022\u003Esubir foto\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-07T07:15:41Z\u0022 title=\u002208/07/2015 07:15  AM\u0022 data-short=\u00228 yr\u0022\u003EAugust 7, 2015\u003C/time\u003E by Pirx\u003C/strong\u003E\n\u003Cbr\u003EAnswered\n\u003C/span\u003E\n"},{"CreatedByName":"Champ","CreatedById":96425,"CreatedDateTime":"2015-08-05T12:26:33Z","Content":"\n\u003Cp\u003E\u0026gt; This is my first time writing in the KSP forums ^^\u003C/p\u003E\u003Cp\u003EWelcome !\u003C/p\u003E\u003Cp\u003E\u0026gt; I would like to know if all the science I gathered and that was stored on the command pod was lost or I will be able to perform the experiments again without the reduction for making them a second time.\u003C/p\u003E\u003Cp\u003EYou will be able to perform them again, no reduction.\u003C/p\u003E\u003Cp\u003E\u0026gt; Im writing because I have a question regarding gatherinng science, yesterday I managed for the first time to make a succesful landing on the Mun in science mode, after more than 5 flights and 3 unssucesful landings\u003C/p\u003E\u003Cp\u003ECongratulations ! Great emotion on the first successfull landing ! First docking is great, too !\u003C/p\u003E\u003Cp\u003E\u0026gt; After making all the experiments, launching the spaceship from the moon and managing to have a reentry orbit while on the smoke of my engines (I finished with 0.3 of fuel remaining in my tanks xDDD) my command pod (equipped with a heat shield and everything) exploded on the reentry \u003C/p\u003E\u003Cp\u003EStrange. What was your periapsis altitude when you entered kerbin\u0027s atmosphere ?\u003C/p\u003E\n"},{"CreatedByName":"Glaran K\u0026#039;erman","CreatedById":146334,"CreatedDateTime":"2015-08-05T14:17:35Z","Content":"\n\u003Cp\u003EWelcome to the boards and congratulation on landing on the Mun! When I began I too did not know about qucksaving/quickloading and did the exact same thing you did just fyi.\u003C/p\u003E\u003Cp\u003EBut just to echo the above statement, yes, you can do them again no probelm with no reduction. Also as for you\u0027re reentry attempt, I am too interested in what your AP/PE was. But just a general rule I have found helpful is that 30-50km is your target PE but this depends on your AP, so 30 if your AP is lower, 50 if its in the higher range.\u003C/p\u003E\n"},{"CreatedByName":"Pirx","CreatedById":149331,"CreatedDateTime":"2015-08-07T07:14:46Z","Content":"\n\u003Cp\u003EGood Morning Champ, Glaran K\u0027erman:\u003C/p\u003E\u003Cp\u003EThanks a lot for your replies, I finally managed to make succesul landings and reentries into kerbin (yesterday I managed 3 succesful missions without any new cassualties YAY!) and with the science I won I\u0027ve been able to substantially improve my rockets.\u003C/p\u003E\u003Cp\u003EIn relation to the question I opneed my post with I must say that as you told me, I was able to perform the experiments again with no science reduction.\u003C/p\u003E\u003Cp\u003ERegarding the reentry I think that I was coming in in a really acute angle, the heat shield overheated and exploded, as per the missions I performed yesterday I tried to reenter really shallow thus staying in the atmosphere more time but having less friction and also aerobreaking more (the heat shield life when I finally touched earth was 175/190 more or less)\u003C/p\u003E\u003Cp\u003EI have other question (this time regarding ressurrected kerbonauts) but ill open another thread.\u003C/p\u003E\u003Cp\u003EThanks a lot for the help and the welcome \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Glaran K\u0026#039;erman","CreatedById":146334,"CreatedDateTime":"2015-08-07T18:24:25Z","Content":"\n\u003Cp\u003EGlad to be of assistance!\u003C/p\u003E\n"}]}