{"TopicId":117639,"ForumId":16,"TopicTitle":"Aerobraking with Sledgehammer-shaped crafts","CreatedByName":"Commissioner Tadpole","CreatedById":91993,"CreatedDateTime":"2015-08-04T19:59:53Z","PageNum":1,"Articles":[{"CreatedByName":"Commissioner Tadpole","CreatedById":91993,"CreatedDateTime":"2015-08-04T19:59:53Z","Content":"I have a craft made in 0.90(the souposphere era) which is currently en-route to Duna and is inserted into a prograde aerocapture trajectory, periapsis at 14,400-something. Unfortunately, due to it being made prior to the atmospheric upgrade, its shape is aerobrake-unfriendly, and I found that my aerobraking trajectory failed by a wide margin, the craft instead plummeting into Duna\u0027s surface.\n\nI\u0027m using the Trajectories mod to determine my aerocapture route, and before plunging into the atmosphere it says it\u0027ll sucessfully slow me down enough for the apoapsis to be above Duna\u0027s atmosphere but not too far. After doing so, though, it updates to say I\u0027ll crash. I am utterly confused... and just when I decided to get back into KSP. ![:sealed:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_lipssealed.gif)\n\nThe craft in question is a rover meant to transport fuel from storages into crafts which need them, attached to the top of a booster stage which is essentially a Rockomax X32 tank with a Poodle engine. I would upload a screenshot if my internet weren\u0027t trying to see if it can be slower than dial-up.\n\n**Edited \u003Ctime datetime=\u00222015-08-05T22:54:29Z\u0022 title=\u002208/05/2015 10:54  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 5, 2015\u003C/time\u003E by Commissioner Tadpole**"},{"CreatedByName":"Eric S","CreatedById":57117,"CreatedDateTime":"2015-08-04T21:13:55Z","Content":"Duna\u0027s got a bit more atmosphere in 1.0 than it did in 0.9, try a higher altitude. I can think of a few reasons Trajectories might make the wrong projection. You\u0027ve updated Trajectories, right? The other thing that\u0027s possible is that Trajectories assumes a certain angle of attack, and if you didn\u0027t aerobrake the way it expected you to, the atmospheric drag would be different."},{"CreatedByName":"CalculusWarrior","CreatedById":58313,"CreatedDateTime":"2015-08-04T21:37:31Z","Content":"Make sure you\u0027ve correctly set the angle of attack (prograde/retrograde, or more exotic angles) in Trajectories; that has a huge impact on the atmosphere\u0027s effect on you due to the game calculating lift now."},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-08-04T22:09:18Z","Content":"Yeah, trajectories needs to be told the direction you\u0027ll come in at. And even then I don\u0027t think it can handle everything.\n\nWhat I usually do for caution when aerobraking is to put a manoeuvre node at my periapsis, find out how much delta-V it takes to *just* capture, how much it takes to capture into a low orbit, and then take the midpoint delta-V wise. The resulting orbit, which will have an apoapsis somewhat lower than half the height of the SOI, is what I try and capture into. I believe this gives me the maximum margin for error both ways. I can then make subsequent cautious aerobraking passes to lower my apoapsis.\n\nIf you have the delta-V spare you could instead make a powered capture into an initial just-captured orbit, then make as many aerobraking passes as you like. Watch out for Ike though, you might want an inclined orbit to help stay clear of it."},{"CreatedByName":"Commissioner Tadpole","CreatedById":91993,"CreatedDateTime":"2015-08-05T01:04:35Z","Content":"\u003E \n\u003E Duna\u0027s got a bit more atmosphere in 1.0 than it did in 0.9, try a higher altitude. I can think of a few reasons Trajectories might make the wrong projection. You\u0027ve updated Trajectories, right? The other thing that\u0027s possible is that Trajectories assumes a certain angle of attack, and if you didn\u0027t aerobrake the way it expected you to, the atmospheric drag would be different.\n\n\u003E \n\u003E Make sure you\u0027ve correctly set the angle of attack (prograde/retrograde, or more exotic angles) in Trajectories; that has a huge impact on the atmosphere\u0027s effect on you due to the game calculating lift now.\n\nAh, alright. I plan for the craft to come in retrograde(not that I have much of a choice; the craft\u0027s shape makes it want to fly butt-first), so I\u0027ll have to inform Trajectories of that.\n\nHow do I tell it which angle of attack I\u0027ll use, though?"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-08-05T01:12:57Z","Content":"Retrograde means a 180 degree AoA as far as Trajectories is concerned."},{"CreatedByName":"CalculusWarrior","CreatedById":58313,"CreatedDateTime":"2015-08-05T02:15:05Z","Content":"\u003E \n\u003E Ah, alright. I plan for the craft to come in retrograde(not that I have much of a choice; the craft\u0027s shape makes it want to fly butt-first), so I\u0027ll have to inform Trajectories of that.\n\u003E How do I tell it which angle of attack I\u0027ll use, though?\n\nIn map view, click the Trajectories button on the toolbar. This will bring up the settings menu for the mod, where you can set the entry options."},{"CreatedByName":"Reactordrone","CreatedById":110060,"CreatedDateTime":"2015-08-05T02:27:43Z","Content":"The denser atmospheres introduced after 1.0.0 mean you want to aim for about 20-25km at Duna. The fairly low entry speeds shouldn\u0027t give you any heating problems, I\u0027ve done an 18km aerocapture with a pre 1.0.0 craft that didn\u0027t even break off the non-retractable solar panels."},{"CreatedByName":"Commissioner Tadpole","CreatedById":91993,"CreatedDateTime":"2015-08-05T22:55:02Z","Content":"Thanks for the help, everyone! I\u0027ll post the results of the aerocapture re-attempt once it\u0027s done.\n\n**EDIT:** Nope, no dice. Trajectories still gets the predictions wrong. What\u0027s really egregious, however, is how, after doing the 20km suggestion above, I thought I was into a safe orbit around Duna, and quicksaved... then realized Trajectories was COMPLETELY wrong and I was actually in an escape trajectory out of Duna(with a small Ike flyby). I got so angry I just HyperEdited my craft into a Duna orbit as revenge against the game. (though I could\u0027ve used an Ike gravity assist to stay wtihin the Duna system)\n\nThe only thing keeping me from uninstalling it is because it is still useful for landing. But enough of this, it\u0027s quickly becomming a Trajectories-related thread which doesn\u0027t belong in this forum.\n\n**Edited \u003Ctime datetime=\u00222015-08-06T00:51:25Z\u0022 title=\u002208/06/2015 12:51  AM\u0022 data-short=\u00228 yr\u0022\u003EAugust 6, 2015\u003C/time\u003E by Commissioner Tadpole**"}]}