{"TopicId":117755,"ForumId":16,"TopicTitle":"Docking Trouble","CreatedByName":"CaptainApollo","CreatedById":145000,"CreatedDateTime":"2015-08-06T01:11:30Z","PageNum":1,"Articles":[{"CreatedByName":"CaptainApollo","CreatedById":145000,"CreatedDateTime":"2015-08-06T01:11:30Z","Content":"Hello everyone! It\u0027s been a while since I made a post in this section, but it seems that I am in need of help once again. I have tried the docking tutorial in-game dozens of times, and I can never seem to get it right, especially at the end when the target craft is in view and you have to dock to it. It is quite difficult, and I was wondering if I could have some help with docking. Thank you!"},{"CreatedByName":"Wolfox","CreatedById":59958,"CreatedDateTime":"2015-08-06T01:15:21Z","Content":"\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/AHkY3FusJIQ?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E"},{"CreatedByName":"CaptainApollo","CreatedById":145000,"CreatedDateTime":"2015-08-06T01:21:39Z","Content":"Very nice, I will try it out later today on KSP. It seems to be quite old, but I\u0027m sure it\u0027ll do the trick. Still open to tips though! ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"Weywot8","CreatedById":146603,"CreatedDateTime":"2015-08-06T02:30:17Z","Content":"Any specific pain points?\n\nOne thing I\u0027ve noticed is that it\u0027s harder to dock in really low orbits because the relative orientation of the docking port tends to change rapidly. Never did the tutorial ![:wink:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif), but two ways to combat this in game:\n\n- higher orbits, only useful if you put the object into space yourself like LKO refueling missions\n- \u0022normal\u0022 orbit orientation of the target docking port - relative orientation of target dock doesn\u0027t change while approaching and from an orbital view, the approaching vessel is making an inclination change with very small apo/periapsis changes so there is little drift in the direction of your velocity relative to target docking port. Simply point and approach.\n\nI also don\u0027t bother much with aligning ports with RCS although it does help - after getting them sort of lined up, I make the final approach, bump docking ports and very, very gently push against the target so the attraction between ports closes the angle between them.\n\nWith MechJeb, the parrallel-anti-parrallel orientations help alot.\n\n**Edited \u003Ctime datetime=\u00222015-08-06T03:13:36Z\u0022 title=\u002208/06/2015 03:13  AM\u0022 data-short=\u00228 yr\u0022\u003EAugust 6, 2015\u003C/time\u003E by Weywot8**"},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2015-08-06T09:21:16Z","Content":"If the docking port is on the front of the approaching ship then you can try this:\n\n- get close to your target (~50m is good)\n\n- zero out your relative velocity. Limit your engine thrust if the main throttle is still too aggressive\n\n- switch to target, control from docking port, and point the port at the approaching ship\n\n- now your ship only has to move in a straight line towards the target port. 0.5m/s is more than enough. Angle doesn\u0027t have to be perfect, the magnets will snap you into place at the moment of contact.\n\nCuts out the need for monoprop and fiddly translations ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"lugge","CreatedById":143343,"CreatedDateTime":"2015-08-06T09:30:24Z","Content":"I don\u0027t want to ninja this thread, however, I also have some problems when docking, and maybe the TO can also learn from the answers.\n\nRendezvous are easy, I rescued dozens of Kerbals from orbits.\n\nDocking is OK for me too, but I feel it could be better.\n\nWhen I have a target-relativ velocity of 0 m/s and I\u0027m only a few meters away from my target, I start the docking approach.\n\nThus, I activate RCS and switch to docking mode, instead of staging.\n\nNow I can control my vessel like an EVA-Kerbal, using WASD,Shift, Ctrl.\n\nHowever, the axis are somewhat messed up, due to the dockingports orientation.\n\nWhen only up and down (Shift and Ctrl) are inverted, no problem. I can deal with it.\n\nBut the other axis are somewhat more difficult. When I hit \u0022A\u0022 I\u0027d like to go to the left.\n\nBut due to the vessels orientation and inclination I get some strang directions.\n\nIn fact, the last few meters are just try\u0026error with the keys.\n\npress a key, check where the vessel is going, undo,....\n\nI guess the navball is the solution. At the moment, I only eyeball the whole process in the vessel view. But I have no clue how I have to use the navball in this scenario.\n\nAny suggestions?"},{"CreatedByName":"sebbemann","CreatedById":141208,"CreatedDateTime":"2015-08-06T12:06:37Z","Content":".....\n\n**Edited \u003Ctime datetime=\u00222015-08-06T22:46:43Z\u0022 title=\u002208/06/2015 10:46  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 6, 2015\u003C/time\u003E by sebbemann**\n  \nDouble post"},{"CreatedByName":"Reactordrone","CreatedById":110060,"CreatedDateTime":"2015-08-06T12:31:40Z","Content":"If you use the navball the alignment is always the same so when you try to align the yellow prograde and retrograde markers to the purple target markers you know what the RCS will do. If you eyeball it, the orientation of the ship to the camera will always be different and you\u0027ll first have to fire the RCS and roll the ship to get it into the correct orientation. I usually find the IJKLHN keys of more use than the docking mode since you can do rotations with your left hand and translations with your right."},{"CreatedByName":"sebbemann","CreatedById":141208,"CreatedDateTime":"2015-08-06T13:19:49Z","Content":"I\u0027ve struggled with docking too, but recently I cracked the code and haven\u0027t had any trouble doing it since. What worked for me is to use zero out your relative velocity to the target about 100 meters out. Select the docking port you wish to use and press \u0022control from here\u0022. Check the navball and use SAS or RCS to roll, using Q or E key, so one of the lines on the navball lines up with your level marker. Adjust your camera so you look directly behing your ship. Tilt your ship so you point directly towards your target. With your camera behind your ship, you should be able to see if your ship moves away from your target in any direvtion. From there it\u0027s simply a matter of using RCS transfer keys (h,n,j,l,k and i keys) to move your ship closer to the target. I usually don\u0027t move any faster than 1.5 m/s relative to the target. This makes it easy to correct any movement, and you also have time to move your camera around to see if you move away from the target in any direction. \n\nTo tilt your vessel, use WASD keys. Use transfer keys for anything else. If your RCS placement is of, you will tilt and roll your vessel when using the transfers keys, making thing a whole lot more difficult. RCS placement is very important. Very few RCS thrusters are needed, even for a big ship. They should be placed at the center of mass, but the farthest away equatorial. I don\u0027t know how to explain it. If the earth was your vessel, and the center of earth is your vessels center of mass, you should put your RCS thrusters around the equator. This way your ship will act to RCS imput, the same you your kerbal moves when EVA."},{"CreatedByName":"Weywot8","CreatedById":146603,"CreatedDateTime":"2015-08-06T13:48:13Z","Content":"NavHUD mod and/or Docking Port Alignment indicator helps a great deal too until you get good enough to eyeball it."},{"CreatedByName":"CaptainApollo","CreatedById":145000,"CreatedDateTime":"2015-08-06T17:35:46Z","Content":"Thank you all, I will use all this advice today later on when I try to do my first docking, I will use the higher orbit idea and try it on my own instead of on the tutorial. Thanks again!"},{"CreatedByName":"Fearless Son","CreatedById":133397,"CreatedDateTime":"2015-08-07T00:22:03Z","Content":"Someone mentioned earlier that you should click your local docking port and select \u0022Control From Here\u0022 to use that as your \u0022forward\u0022 point on your navball. This is useful, but what is also useful is that when you get near the craft you are trying to rendezvous with, you can right-click the docking port on **that** craft and select \u0022Set As Target\u0022, which will change from the target being the craft in general to that specific docking port in particular. Controlling from your local docking port and targeting the specific docking port part on the other craft can make it a lot easier to line up the targets for a gentle meeting. \n\nAlso using the translation keys was mentioned, and I cannot recommend them enough. Docking mode always felt clumsy to me because it restricts the ability to change orientation, which is something I am never quite sure I have right until I am close to the target. But using the translation keys I can avoid locking myself out of orientation controls. The ability to change both orientation and velocity at the same time is a great help. \n\nFinally, if you are ever having trouble getting the ships to actually link once contact between the ports is made, be sure to disable SAS just as they are about to make contact. The relatively weak magnetism of the ports needs to pull the respective craft about so their orientations match up with where the docking ports need to be to form a tight seal, and if you have SAS on it is going to want to fight that change in orientation, and mess up the connection. SAS is valuable for keeping you from spinning out of control while adjusting your orientation, but it can also mess you up at the moment of contact, so be prepared to briefly turn it off when you are confident that docking will be immediate."},{"CreatedByName":"Wolfox","CreatedById":59958,"CreatedDateTime":"2015-08-07T01:07:34Z","Content":"\u003E \n\u003E However, the axis are somewhat messed up, due to the dockingports orientation.\n\u003E \n\u003E When only up and down (Shift and Ctrl) are inverted, no problem. I can deal with it.\n\u003E \n\u003E But the other axis are somewhat more difficult. When I hit \u0022A\u0022 I\u0027d like to go to the left.\n\u003E \n\u003E But due to the vessels orientation and inclination I get some strang directions.\n\u003E \n\u003E In fact, the last few meters are just try\u0026error with the keys.\n\u003E \n\u003E press a key, check where the vessel is going, undo,....\n\u003E \n\u003E I guess the navball is the solution. At the moment, I only eyeball the whole process in the vessel view. But I have no clue how I have to use the navball in this scenario.\n\u003E \n\u003E Any suggestions?\n\nHit \u0022V\u0022 several times until on-display text reads \u0022Chase\u0022, that will lock the camera the same way as the navball shows it."},{"CreatedByName":"CaptainApollo","CreatedById":145000,"CreatedDateTime":"2015-08-07T17:09:12Z","Content":"Very interesting, I will learn from this as well."}]}