{"TopicId":117726,"ForumId":70,"TopicTitle":"Pitch controls suddenly reversed for no reason.","CreatedByName":"LethalShade","CreatedById":139111,"CreatedDateTime":"2015-08-05T18:54:43Z","PageNum":1,"Articles":[{"CreatedByName":"LethalShade","CreatedById":139111,"CreatedDateTime":"2015-08-05T18:54:43Z","Content":"\n\u003Cp\u003EThis is my plane. It worked fine one hour ago, and since then I made an insignificant modification to it (adding a ladder).\u003C/p\u003E\u003Cp\u003EWhen on the runway, the pitch controls are normal (Z to go down, S to lift up, I\u0027m using an AZERTY keyboard layout)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://puu.sh/jqycd/3406b3924b.jpg\u0022 alt=\u00223406b3924b.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E(Here I\u0027m pressing S)\u003C/p\u003E\u003Cp\u003EAnd suddenly, for no reason at all, the controls got reversed (Z to go up, S to go down). I tried to remove the ladder, the controls are still inverted. Switching to a stock plane fixes the issues (However, switching back to my plane reverse the controls again), rebooting the game too (Albeit temporarily).\u003C/p\u003E\u003Cp\u003EIt\u0027s pretty annoying and probably has nothing to do with the CG, as the plane worked fine one hour ago when first tested. Please, help.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EEDIT : I think I know what\u0027s causing this. I previously controlled the ship from a Mk2 probe core. My issues happened after I decided to control my ship from the reversed Mk2 cockpit. Please ignore all of this. It would be nice to have this bug fixed, though.\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-05T19:13:56Z\u0022 title=\u002208/05/2015 07:13  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 5, 2015\u003C/time\u003E by LethalShade\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"danfarnsy","CreatedById":67183,"CreatedDateTime":"2015-08-05T19:24:13Z","Content":"\n\u003Cp\u003EI\u0027m glad you figured it out! I use FAR, and I spent a good few days trying to figure out why all my spacecraft were oscillating in bizarre ways, until I realized I had turned on FAR\u0027s roll-assistance for a spaceplane much earlier. It wasn\u0027t so much a bug as the computer remembering what I told it to do, even if I didn\u0027t. It sounds like that is the case here as well.\u003C/p\u003E\u003Cp\u003EAnd your plane looks awesome, by the way.\u003C/p\u003E\n"},{"CreatedByName":"ExplorerKlatt","CreatedById":107424,"CreatedDateTime":"2015-08-06T13:45:03Z","Content":"\n\u003Cp\u003Ewhat bug are you talking about? \u003C/p\u003E\u003Cp\u003EThe game assumes standard controls for an aircraft, pull back or S to raise the nose and push forward or W (Z in your case) to lower the nose.\u003C/p\u003E\u003Cp\u003ENormally raising the nose also raises AoA thereby increasing lift. In your case, with cockpit upside down, raising the nose lowers the AoA, decreasing lift. \u003C/p\u003E\u003Cp\u003ETL;DR\u003C/p\u003E\u003Cp\u003EIt\u0027s not a bug, it\u0027s a common aviation standard. Everything is done from the pilot\u0027s point of view. (Sitting in the cockpit)\u003C/p\u003E\n"},{"CreatedByName":"Wolf Baginski","CreatedById":138549,"CreatedDateTime":"2015-08-07T08:23:01Z","Content":"\n\u003Cp\u003EThere is an option to reverse the action of control surfaces, on the right-click menu.\u003C/p\u003E\u003Cp\u003EI suppose that would be awkward if the same surface was controlling pitch and roll. The default in the SPH is for a control to be active in pitch, roll, and yaw. The reversal option affects all three, and that situation is a rotation about the roll-axis. It wouldn\u0027t affect the polarity of roll direction\u003C/p\u003E\n"}]}