{"TopicId":118078,"ForumId":51,"TopicTitle":"Elcano challenge - Katrid Kermans diary - solar powered rover to the poles and back.","CreatedByName":"Esme","CreatedById":107436,"CreatedDateTime":"2015-08-09T22:45:01Z","PageNum":1,"Articles":[{"CreatedByName":"Esme","CreatedById":107436,"CreatedDateTime":"2015-08-09T22:45:01Z","Content":"\\*\\*\\* Thread discontinued \\*\\*\\*\n\nRegrettably, something has caused my savefile to become unreadable, and stupidly, I didn\u0027t have a backup. Lesson learnt. This won\u0027t put a stop to my attempt to circumnavigate Kerbin, but I am going to take the opportunity of this enforced halt to work on improving the rover design and also see if I can get to the bottom of what was causing some peculiar problems with the game (notably Katrid walking on a surface somewhat below the visible one, making ingress and egress more difficult even with the ladder welded onto her cab, plus both Val and Katrid being strangely more likely to behave bizarrely and then vanish in a puff of smoke when rag-dolled.) \n\nThanks to all who\u0027ve read this and been supportive of my effort, it\u0027s a shame it has ended this way. But I\u0027ll be back, in a few weeks or a few months!\n\n\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\n\nBackground: \n\n Reading Overland\u0027s awesome efforts to take on the Elcano challenge with road trains inspired me to have a go at the Elcano challenge myself. However, not being one for modifying config files and suchlike, my attempt would have to be more \u0027traditional\u0027, yet I still wanted to set myself constraints that would make the task even more of a challenge than just the driving itself. And so I decided that my rover would be solar-powered, and I would use TAC life support. I tried a few designs but rapidly settled on a double-ended 6-wheeled rover using cabins from the USI Exploration mod, and so the number of crew was fixed at two. \n\n For weeks I tried to find a way to get my vehicle across open water, first by mounting the electric propeller from the Firespitter mod, which didn\u0027t work so well, as I couldn\u0027t get the propeller angled so as to keep its line of thrust behind the centre of mass, so it tended to make the nose of the rover dig in in water, and the torque tended to make the rover list, plus the rate at which it ate through battery charge made it effectively unusable. Overland suggested a mod that has small but powerful electric ducted fans, and these did indeed enable a much more usable performance on water - one of my prototypes reached 18 knots - but again, the power drain was just too large. So I decided that my attempt at the challenge would be via land only. \n\n Expecting that things might get damaged and need replacing during the drive, and expecting to need the use of anchors and winches, I installed Kerbal Attachment System and Kerbal Inventory System for the instance of KSP I am using especially for this challenge. To try to make things visually a little more interesting, I have also installed mods to add clouds, and possibly (if my PC will actually support it - at the time of writing I am still not entirely sure!) dust storms and snow etc. Mechjeb is used for its autopilot facility, although not all of the driving is done using it, particularly on the tricky and slow bits. All mods were installed using CKAN. \n\n I would like to extend my thanks to all mod makers for their efforts to make this already wonderful game even more wonderful and interesting, but in particular, here, to the authors of the mods and utilities noted above, even the ones that I have not ended up using. Thank you all, and thank you SQUAD. And thank you, Overland, for inspiring me to have a go at this challenge. Without further ado, I present to you the tale of my Elcano challenge, a solar-powered rover crewed by Valentina and Katrid Kerman, as told by Katrid\u0027s diary entries.\n\n *Diary of Katrid Kerman, Engineer/Navigator of the Elcano team along with Valentina Kerman, Pilot.* \n\n Day 1 \n\n At lunchtime, Valentina and I stood by our vehicle near the VAB for a photo prior to setting off on our adventure. \n\n [Pre-departure photo pic](https://imgur.com/QTRE1SA) \n\n The PR shots done, we climbed in, did a quick systems check, and then off we went! Valentina steered us a course of 315 degrees initially, to take us west around Conch Bay. \n\n [Off we go!](https://imgur.com/EfgYFQt) \n\n Our course took us onto some of the dunes near the bay - this was deliberate, to test both the hill-climbing ability of our rover and test its stability. Both checked out fine, although our top speed on just the front and rear motors wasn\u0027t quite as high a expected, and Valenina had to cut in the middle pair of motors more often than expected on the hills. We left the stability gyros on initially, and later turned them off to check the change in power drain. \n\n As we turned north, onto a bearing of 330 and then 015, I could see lightning flashes dancing around the peaks of the Kergid range to our west. The sky was generally clear directly above us, but I guess the wind shear in the mountains tends to generate plenty of charge. No wonder the ancients thought the gods lived there! \n\n As the afternoon wore on and we entered the coastal plain north of Conch Bay, things calmed down over the mountains to the west, but picked up in the direction of the massif north of us. I couldn\u0027t see so well in that direction, having to rely on Valentinas cockpit cam, but it looked to be a right humdinger of a storm over that way. \n\n We started getting low on power about an hour before dusk, so we halted, and we deployed the steerable solar panel array on the roof. Unfortunately, it snagged on the back of the nearby winch, so I had to get up there and manually tinker with it until it was fully deployed. Batteries were fully charged just as sunset started, so we packed away the steerable solar panels. I told Val I\u0027d see if I could relocate them in the morning. Whilst the batteries were charging though, I inspected the vehicle for wear and tear and any signs of damage, and found none. Excellent! \n\n Val tells me we\u0027re currently just over 19km from KSC, having driven more like 30km. Not bad considering we started at midday, took it slow at first, then had to tackle dunes and hills around Conch Bay. Tomorrow we\u0027ve nothing but plains ahead of us until we hit the areq where the Kergids get closest to the sea. We should cover much more ground tomorrow. We picnic\u0027d on the grass and watched the stars come out, before climbing back into our cabins and reclining our seats for the night. I saw a meteorite flash across the sky, then fell asleep.\n\n**Edited \u003Ctime datetime=\u00222015-08-25T14:29:40Z\u0022 title=\u002208/25/2015 02:29  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 25, 2015\u003C/time\u003E by Esme**\n  \ntypos and HTML links"},{"CreatedByName":"Esme","CreatedById":107436,"CreatedDateTime":"2015-08-10T07:09:34Z","Content":"Apologies for any formatting problems with the above., and for the images being on links rather than displaying directly on the forum. This is the first time I\u0027ve ever posted pictures on the internet, and so I\u0027m not (yet) familiar with doing so. Any advice with how to get the pictures to appear as pictures instead of just links to Imgur pages displaying the pics welcomed.\n\nI should add that anyone who looked at this thread prior to this post from me will have seen a third image link showing a rover at dusk, which I have now removed. This is because I got this thread going late at night whilst very tired, and got my pictures mixed up - the image was of a different marque of the same rover, distinguishable by having two steerable solar panels rather than one. Unfortunately, on careful checking, I find I have no pictures of Val and Katrids first evening halt."},{"CreatedByName":"Esme","CreatedById":107436,"CreatedDateTime":"2015-08-11T18:21:20Z","Content":"Day 2 \n\nWe set off just before dawn, Val taking it slow at first, as she didn\u0027t want to use the headlights to conserve power. Slowly the sky above turned a gorgeous deep royal blue trimmed around the edges with lighter shades and fading to white at the horizon and utterly cloudless except for a small group of clouds huddling around the sun as if for warmth. We made a little under 8km over undulating terrain before having to stop to recharge. I climbed onto the roof and tried to detach the steearable solar panel pack with the electric drill, but all that happened as that smoke started to pour out of the drill. Well, that\u0027s not a very good start! Now I\u0027m reduced to purely manual tools if we have any problems, and we\u0027re less than a day out from KSC! Ah well, press on. \n\nClouds started to gather overhead whilst we recharged the batteries, but we moved off again still in bright sunshine. I noted that we\u0027d left the area of high ore concentration near KSC, but having little else to do, and the plains outside holding little of interest, I sat back and read a book as the Southern Kergids started to fall behind us west of our track.\n\nVal reports that over the terrain of the coastal plateau, a speed of 30kph keeps the power drain and the power gain from the solar panels are just about equal, so we\u0027ll stick to that for now. We\u0027re now past Beren head, at the north side of Conch Bay, it\u0027s a little short of midday, and there\u0027s a lightning storm out over the bay by the looks of it. We\u0027ve made 16km so far today. Val decides to pick the speed up a bit then drops back to about 20kph when power levels get low.\n\nI can just make out the tops of the southern Kergids, wreathed once again in lightning flashes behind and to the right as I look out of my rear-facing cabin, Other than that, we\u0027re on a gently undulating plain about half a kilometre above sea level, squashed between a green sea of grass and the wide blue sky above, scurrying north-eastwards as fast as we can. I feel small and insignificant out here.\n\nThis is scary, Val took us into the Amberton Bowl at speed, and then found that she couldn\u0027t keep the speed down. We\u0027re now bouncing down the south side of the bowl at about 140kph. I keep a close eye on the suspension, tire and engine monitors. The engines are a little hot, but not dangerously so. To my surprise, both the tires and suspension seem to be coping with the pounding admirably. \n\nMade it! We tore across the bottom of the bowl at over 100kph then slowed to about 50kph as we climbed the more gently sloping north side. Phew! Now we\u0027re amongst the Kilvern hills, prettily dotted with flower meadows in sheltered dips.\n\nMidday, and we\u0027ve covered 40km. Woah! What was THAT? I heard what sounded like a small explosion. Val doesn\u0027t know what it was either, but we seem to be roilling along OK. We slow to a halt to check the vehicle out. We both checked our instruments, did a walk around the outside then Val held a torch whilst I checked the underside. Nothing. No solar panels missing. What on earth went bang? We deploy the steerable solar panel whilst we eat lunch, then pack it down and set off at about 20kph to let the batteries continue charging slowly whilst we carry on.\n\nAfternoon, and the top of Blue Mountain has peeked above the horizon ahead of us! It is obscured again as we go over the ridge and make our way across a wide shallow valley, but it\u0027s a good sign that we\u0027re right on our planned course. Our batteries are getting low on charge, so we stop to recharge and take a break. We\u0027ve made almost 50km so far today, and are hoping to make another ten before sunset.\n\nEarly evening - we\u0027re skirting the edge of Molon Crater along the ridge that runs along the eastern side of both Molon and Teryn Craters. I\u0027m a bit nervous about this - the slopes either side are steep, and I\u0027m not sure we\u0027d survive a slip down either side.\n\nCalamity!. the ridge wasn\u0027t as continuous as it looked, and Val tried to slam on the brakes as the nose went over the lip of a steep little valley within the ridge. Too late. The vehicle shot down the incline, then bounced hard with a great bang as it hit the rise of the facing slope up to the north side of the ridge, and tumbled. I don\u0027t know how many times we rolled, but we quickly came to a stop, still in the saddle in the ridge, but almost upside down. Only the storage container on the top prevented us from being entirely upside down. The gyros won\u0027t right her, and I think it\u0027s the weight of the storage container that\u0027s stopping it, as the early prototypes of this vehicle were capable of self-righting, but hadn\u0027t the container on top. \n\n[https://imgur.com/dWFUhHs](https://imgur.com/dWFUhHs)\n\nThe sun is getting low in the sky. What to do? The winches! We fired one of the anchors, to ensure the vehicle doesn\u0027t slide or roll down the slope. I then hauled a base unit, solar panel, light and battery up to the nearby local peak 250 metres above us, but the panel was dead and I dropped the light trying to affix it, breaking it. This after I\u0027d firmly affixed the battery to the base. Ah well, at least the base unit is white and will stand out to anyone searching for us. I returned to the rover shaking from effort. Val had tried again to roll the rover over, but still no luck. Unfortunately, she forgot to turn the gyros off when she finished,so the batteries were run down. So she flipped the gyros off, and I took the remaining small solar panel and slapped it on the underside of the rover, which was facing toward sunset. Valentina made camp sheltered between the slope and the bulk of the rover and the container, in the green glow of the emergency lights near the drivers cab. In the morning we\u0027ll see if we can detach the storage box. We chatted a while before I fell asleep, battered, bruised and exhausted from the events of the day. I wonder if we\u0027ll be able to sort things out and get going without help from base was my last thought. \n\nDay 3. We managed to get the rover upright, but it broke away and ran down the slope across the valley and partly up the far side, bouncing all the way. It came to a halt a kilometre and a half away, and I trudged over to see what state it was in. Sadly, it was too damaged for us to continue, We called for pickup. and were flown home within a few hours. \n\n(apologies for the lack of pictures today, but I mislaid all bar that one).\n\n**Edited \u003Ctime datetime=\u00222015-08-11T18:25:00Z\u0022 title=\u002208/11/2015 06:25  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 11, 2015\u003C/time\u003E by Esme**\n  \ntypo correction"},{"CreatedByName":"Overland","CreatedById":119812,"CreatedDateTime":"2015-08-16T10:54:50Z","Content":"Thats a very detailed, emotional and well thought out read my good friend ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif) Appologies for not having the time to reply before now.. Managing a land train and even losing one.. battling the kraken and suchlike can all take is toll horribly on other tasks.. ones even as important as this.. Finally able to once again sit down and reply.. im glad I did.. You present a world of your own making with upmost detail and clarity.. You shouldnt worry so much about not posting pictures directly to the post..as if anyone is like myself.. reading your journel of the adventure presents its own pictures in the imagination.. \n\nThe actual included pictures in the imgur links provide reinforcement to seal the world in its own way.. its a very nice experience. Thankyou\n\nThe elcano challenge isnt for the faint hearted or those wanting a new badge in their signature in a matter of minutes or hours..\n\nthis is entirely different.. like ive said before.. people who undertake it are of a dedicated caste of people.. writing history as we progress in KSP canon but also show what can be done within KSP as a program.. simulation.. and a game where many have failed before it..\n\nYou do very well in that respect.. upholding the tradition greatly.. Having chosen kerbin rather than the smaller planets.. you join the ranks of few to undertake the challenge.. and my dearest hope... like with myself and land trains.. your rover and her crew will be ones to finish the challenge.. leaving a trail of stories and achievements in her wake..\n\nI wish you the very best in your adventure.. your rover is a fine capable machine.. almost train-like with her double ended cabs\n\nAlso regarding the KIS/KAS container on your flipped machine.. if you empty it.. you might have a better chance of righting your rover back on her wheels.. I discovered this while carrying the cement block base in the packs of each kerbal\u0027s inventory.. they couldnt jump.. the issue was weight.. a simple thing in the realworld but something we oftern forget is actually simulated in KSP and the mods we use ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nLooking forward to the next installment.. dont lose hope if the replies are low.. many are.. your efforts are never in vein and irrespective of whether its seen by your own eyes only or a thousand others... its an experience in its own to be proud of ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"Sharkman Briton","CreatedById":148040,"CreatedDateTime":"2015-08-16T15:23:53Z","Content":"God damnit Overland, now I need to try the Elcano challenge again, I tried it the other day, well, part of it, the plan was to drive to the deserts on the same continent as KSC to test my vehicle, but I got so bored so fast I ended up breaking the rover out of pure carelessness before saying \u0022thank squad for that!\u0022"},{"CreatedByName":"Overland","CreatedById":119812,"CreatedDateTime":"2015-08-17T02:15:54Z","Content":"The elcano challenge is not just a challenge in KSP operations, its also a mental and emotional challenge.. see my elcano challenge log for details..\n\nbut all simplified you need 2 things above all else.. \n\nDedication and resolve\n\nbut more importantly.. love and care for your craft and her crew.. it might seem strange at first but once you feel it.. the former mentioned dedication comes naturally.\n\ntheres a reason ive payed respects to any fallen train and her crew when they meet an untimely end..its not just fiction and a story to fill the time\n\nits actually quite real from my point of view..\n\nthe connection is very enjoyable and quite unique ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\n44 class 4408 started life passing through a wreck of former sistertrain 4404..\n\n40 class 4004 followed that sad tradition..\n\nboth trains have collectively 250km between them..\n\nit helps greatly\n\n**Edited \u003Ctime datetime=\u00222015-08-17T02:18:54Z\u0022 title=\u002208/17/2015 02:18  AM\u0022 data-short=\u00228 yr\u0022\u003EAugust 17, 2015\u003C/time\u003E by Overland**"},{"CreatedByName":"Sharkman Briton","CreatedById":148040,"CreatedDateTime":"2015-08-17T13:36:29Z","Content":"Okay, if I DO do an Elcano challenge, I will make the path as inconvinient as possible if it means I get to see some cool sights, such as the River, the pyramids, any cool sights."},{"CreatedByName":"Esme","CreatedById":107436,"CreatedDateTime":"2015-08-18T14:29:30Z","Content":"Apologies for the delay with updates - it\u0027s merely due to Real Life stealing time from my KSP-related activities :-}\n\nThere will be further updates shortly - I\u0027m actually posting a few in-game days behind where I\u0027ve actually reached, so that I can keep updates coming for a while even if I don\u0027t have time to play for a wee while... Also, I\u0027m minded to add a bit of a background story into Katrid\u0027s tale of the expedition, as in places the terrain is rather monotonous for long periods, and, well, my little 2-person rover isn\u0027t photogenic enough to sustain too many pictures of her against a grassy plain. :-} Watch this space. \n\nThanks for the kind words, Overland. Frankly, I\u0027m not too concerned with comments, they come or not as they do. I wouldn\u0027t be attempting this if I wasn\u0027t enjoying the challenge, and if anyone else enjoys reading about it, all well and good; if not, well (shrugs) it\u0027s not the end of the world, no?\n\nShould be another update within 24 hours.\n\nEsme"},{"CreatedByName":"Sharkman Briton","CreatedById":148040,"CreatedDateTime":"2015-08-18T15:25:35Z","Content":"I\u0027m waiting... Lol, no pressure though."},{"CreatedByName":"Esme","CreatedById":107436,"CreatedDateTime":"2015-08-18T18:59:31Z","Content":"Over the next few days, the rover was rebuilt and mofifed based on lessons learnt in our first attempt. No equipment was hung off the cargo box, as this obstructed access to its contents somewhat, and had prevented us from detaching the box when we were trying to right the rover. The small panel solar panels were re-arranged a little to allow for twin steerable panel arrays to be mounted near the crew cabs, and the top midhsips array replaced by two single flat panels. Room was found to boost battery capacity by about 10 per cent and I decided I\u0027d store a spare toolkit in my cab, as well as the set stored in the cargo box. \n\n---------\n\nSECOND ATTEMPT\n\nDay 1. \n\nOff we go again, this time starting not long after dawn.. Our first target is the marker we left at the end of day 1. Val drives more conservatively and takes a slightly longer route, plus she makes more use of the gyro-stabilisation system, so we reach our first goal well before midday with batteries down to aout 25%. After a halt to recharge the batteries, we press on. \n\n[https://imgur.com/1vLtbTw](https://imgur.com/1vLtbTw)\n\nVal\u0027s driving more conservatively, yet somehow managing to make excellent progress We\u0027re now on a route east of our original one, and taking a longer route through the sink holes and craters around here but staying to broader flatter areas and so able to travel faster. The weather stayed fine for us all day, and we ended the day level with where we got to at the end of our second day on our first attempt, but 3.8km further east. However, the ladder to Vals cab got torn off when the nose unexpectedly grounded. I\u0027ll fix it in the morning. \n\n[https://imgur.com/peZnoFz](https://imgur.com/peZnoFz)\n\n------------------------\n\nDay 2. \n\nVal wakes me with a call over the intercom, then pulls away before I have a chance to replace the ladder. I ask her if she remembered to stow the solar panels - the rover slows right down. Wups she says. A talented pilot she may be, but by the Kraken, she\u0027s a ditz when it comes to the hardware! Panels stowed, we pick up speed. More conservative but rapid driving gets us out of the limestone hills and sinkholes and onto a high plain. I log a few readings from the scientific instruments, then return to my book. We make a brief halt at midday to recharge, then continue NE to ENE at flank speed, and make just over 60km by the end of the day. \n\n[https://imgur.com/J3wq12D](https://imgur.com/J3wq12D)\n\nBlue Mountain has gone from a distant giant poking over the horizon ahead made blue by atmospheric haze to a somewhat closer giant rising from the plain to our left (my right, but I\u0027m facing backwards, remember). Blue Mountaion looks flat-topped from some angles, and it looks to me as if there might be a drivable route up the eastern side. Maybe another time - for now we\u0027re trying to get around the east side of the Northern Kirgids, then it\u0027s north to the Pole!\n\n[https://imgur.com/CvGpvA](https://imgur.com/CvGpvA)\n\n[https://imgur.com/BwdHSBT](https://imgur.com/BwdHSBT)\n\n I attempted to replace the ladder to Val\u0027s cab, but was all fingers and thumbs, and nicked myself with the drill from no result.\n\nVal decided to see how far we could push on before sunset. We took it careully, Val using lights where appropriate, and we made another 6km!\n\n[https://imgur.com/a4rbEwr](https://imgur.com/a4rbEwr)\n\n**Edited \u003Ctime datetime=\u00222015-08-18T19:07:21Z\u0022 title=\u002208/18/2015 07:07  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 18, 2015\u003C/time\u003E by Esme**\n  \ntrying to get durned formatting right"},{"CreatedByName":"Slam_Jones","CreatedById":125101,"CreatedDateTime":"2015-08-18T19:06:39Z","Content":"Hey man, awesome rover ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\nFYI, to post pics on forums, you\u0027ll need to use BBCode instead of HTML. Usually the best thing to do is wrap the link in the img tags: \n\n    [img=...]\n\nImgur usually gives you the needed codes in the sidebar. Click on the pic in Imgur, and the box should pop up, with a list on the right side. Copy the one below BBCode, and paste that. If you don\u0027t see the sidebar, look for something that says \u0022get embed codes\u0022 or something along those lines. Clicking that usually causes the sidebar to appear.\n\nSimply copy and paste the code, and your pics will appear as so:\n\n![1vLtbTw.jpg](http://i.imgur.com/1vLtbTw.jpg)\n\nHope that helps ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\n**Edited \u003Ctime datetime=\u00222015-08-18T19:14:40Z\u0022 title=\u002208/18/2015 07:14  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 18, 2015\u003C/time\u003E by Slam\\_Jones**"},{"CreatedByName":"Esme","CreatedById":107436,"CreatedDateTime":"2015-08-18T21:33:36Z","Content":"Thank you very much, Slam! Although I\u0027ve ended up working with computers for most of my working life, I\u0027ve never had cause to do anything remotely like this before - this is the first time I\u0027ve ever put pictures online, and the first time that I\u0027ve tried posting pictures to a forum, and I\u0027ve been finding it a bit of a frustrating experience thus far. I just could not work out how to get the pictures from Imgur to display the way that you\u0027ve kindly described, and it seemed that if I didn\u0027t include HTML code amidst the text, it would display unformatted, but if I did include HTML code, it magically wouldn\u0027t need it and would display the HTML tags. Grrr! (chuckle). I\u0027ll learn, although I confess there\u0027s been a couple of times I almost gave into the grumpy old biddy side of my nature telling me to give it up as a bad job. Trying to work out Imgur and the forums has been more effort than doing the Elcano challenge itself so far, so I\u0027m really glad for your help in explaining how to do it properly!"},{"CreatedByName":"Slam_Jones","CreatedById":125101,"CreatedDateTime":"2015-08-18T21:44:59Z","Content":"Heh, no problem. I ran into the same issue when I started here at the forums... I didn\u0027t even know what Imgur was xD\n\nIf you\u0027re still having trouble, I can try to put together a little walk-thru for posting Imgur stuff to the forum when I get home. Once you figure it out, it\u0027s pretty easy ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"Slam_Jones","CreatedById":125101,"CreatedDateTime":"2015-08-18T22:39:53Z","Content":"Here, I went ahead and made 3 pics that should explain how to find the codes for your images.\n\n\u003E \n\u003E ***Step 1: Log into Imgur, mouse over top-right where you name is shown (a list box will drop down), click \u0022Images\u0022***\n\u003E \n\u003E ![t2DehaQ.png](http://i.imgur.com/t2DehaQ.png)\n\u003E \n\u003E \n\u003E \n\u003E ***Step 2: Click whichever picture you wish to share***\n\u003E \n\u003E ![z2PqjXm.png](http://i.imgur.com/z2PqjXm.png)\n\u003E \n\u003E \n\u003E \n\u003E ***Step 3: Copy and paste the code on the right side***\n\u003E \n\u003E ![Vgzf5W3.png](http://i.imgur.com/Vgzf5W3.png)\n\u003E \n\u003E ***Step 4: Profit!*** ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\u003E \n\u003E ![roTpBYs.jpg](http://i.imgur.com/roTpBYs.jpg)"},{"CreatedByName":"Esme","CreatedById":107436,"CreatedDateTime":"2015-08-20T20:35:09Z","Content":"Day 3. \n\nUp before dawn, and we set off slowly with the sun only halfway above the horizon, having found that with the sun that low, we\u0027re not gathering enough power from the solar panels to make up running losses, even stationery. We\u0027re on the flank of a large broad ridge running down from the Kergids to the sea, so we\u0027re tipped over between 10 and 20 degrees to one side, and nose high 5-10 degrees as well. Val thinks we should be able to make the crest of the ridge on the three-quarters power that we\u0027ve got, then we can stop and recharge. \n\n![P5jTk5w.jpg](http://i.imgur.com/P5jTk5w.jpg)\n\nWell, it was a near-run thing, but we found a flattish spot short of the top of the ridge just as the battery low warning lights came on. Whilst we\u0027re stopped, I think I\u0027ll have another look at that ladder on Vals cab. Maybe with direct sunlight on it, I\u0027ll be able to see what was stopping the replacement one from attaching. Problem - it\u0027s not working, even with both panels up, we\u0027re still burning more charge than we\u0027re making. We have to get off this slope, and fast. I tell Val to take us onto a bearing of 90 or 95 degrees dead slow, no more than 7kph, and retract one of the solar panels so that if anything happens we don\u0027t lose both of them. Rate of charge loss is slowing, slowing - break even! I tell Val to keep that heading and stay at 3kph or less. I risk the second steerable solar array, and once it deploys, the charge indicators start heading upwards slowly but visibly. It\u0027ll take a long while at this rate before we get even one quarter full charge.\n\nI call a halt. The navball looks like we\u0027re on a nice stable patch, just a little slope sideways, and the sun is higher. As we stop, I watch the charge levels start to climb faster. Yes! our crawl east along the ridge got us out of the immediate danger of running out of charge, and away from the steeper part of the ridge. Once we\u0027re up to full charge, we\u0027ll turn due north directly up the slope to the top of th ridge and see what awaits us on the other side. I idly watch bunnies frollicking in the sun for a while before deciding to watch a film until we\u0027re fully charged. \n\nWe\u0027re off again, and climbing the ridge! At the top, we slow down and check the terrain ahead from sattelite imagery. I tell Val to turn to 20 degrees and carry on at best speed. West of us, the mountains look like a massive wall, kilometres distant, and I know that\u0027s only a samll outlying massif from the main body. The main body of the mountains must be awesomely big!\n\n![J4RzJId.jpg](http://i.imgur.com/J4RzJId.jpg)\n\n![ow7itVV.jpg](http://i.imgur.com/ow7itVV.jpg)\n\nNow I can see that the mountains further north are topped with snow! They look rather more jagged than their southern siblings. We\u0027re charging northwards as fast as we can, to try to make up time lost whilst we had to crawl east along the ridge. We raced across a plain at just under a kilometre altitude for some time, then slowly descended to about 700m. At first the decline was quite rapid, and our speed crept up to something over 90kph for a while, before things flattened out and we resumed our steady 50kph. When we halted to recharge, we decided to start crawling forward, once the panels were deployed, to gain a little extra distance whilst charging. With the sun now overhead, recharging is happening rapidly. A thought strikes me - what will happen once we\u0027re up in polar regions, with the sun so low in the sky all of the time? I discuss with Val how we\u0027ll have to be careful to check the recharge rates as we get further and further north. It might be that we won\u0027t be able to reach the actual poles, but if not, we\u0027re determined to get as close as we sensibly can. We\u0027ll see.\n\nDamn! We hit a bump, and started sliding down a steepish slope sideways. I immediately hit the switch to retract our solar panels, but one of them shredded anyway. I\u0027ll have to replace it when next we stop to recharge. For now, we\u0027re going to push ahead at best spoeed for as long as we can, even though we only managed to get up to about 90% charge. \n\nWell, we halted about 54km from yesterday\u0027s second marker, and 58 from the first. Val deployed the portside ladder and I claimed up onto the roof, climbed over the cargo box, then down onto the roof of my cab. The broken panel array box came out easily enough, but the new one took a couple of tries to get it locked into place before I could screw it down. \n\n![6GD69AG.jpg](http://i.imgur.com/6GD69AG.jpg)\n\n![Em5NXIM.png](http://i.imgur.com/Em5NXIM.png)\n\nI then went to have another attempt to replace the ladder to Vals cab. Yet again I was defeated by a combination of the slight slope and the poor lighting, Val\u0027s cab being in shadow. My helmet lights weren\u0027t any help - too harsh, and I need side lighting, if anything. Val says she\u0027s fine with staying in the cab for now. Maybe if we manage to stop somewhere perfectly flat this side of the arctic, we\u0027ll turn the rover into the sun, so I can have a better go at the job.\n\nVal and I decide that there\u0027s to be no more moving with the panels up at all unless we have no other choice, as was the situation first thing this morning. Otherwise we risk running out of spare deployable panels before we\u0027re halfway through our mission. Whilst we could press on with just the static panels, recharging would take much longer, and could cause us to run out of supplies. We decide to celebrate overcoming the days problems with lasagna and a bottle of grape juice, with Kustav Holst\u0027s Planets Suite for a little light background music. We watch as a large flock of small birds swirls around, then later a v-shaped formation of birds, probably geese, flew overhead. I wonder where they\u0027re going? As I settle down to sleep later, a shooting star crosses the sky above. I make a wish - no more breakages for a few days, please!\n\nMiddle of the night, and we\u0027re woken by a thunderstorm. We both count seconds as we see the flashes of light and estimate how far away they were when we hear the thunder. Val starts snoring again within a few minutes, so I cut the intercom and carrying on watching nature\u0027s own light show until I too fall asleep again."},{"CreatedByName":"Esme","CreatedById":107436,"CreatedDateTime":"2015-08-25T14:32:00Z","Content":"As per my suitably edited first post, I\u0027m having to halt here as my savefile has become corrupted and I didn\u0027t have a backup. I\u0027ll be trying again in a few weeks to a few months time, and meanwhile will look at improving the rover and seeing if a few bugs I experienced can be addressed. Thanks to all who read this far and offered support and advice!\n\nEsme"},{"CreatedByName":"Slam_Jones","CreatedById":125101,"CreatedDateTime":"2015-08-25T19:02:47Z","Content":"Aw, bummer ![:(](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif) Looking forward to your next attempt though! ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)"}]}