{"TopicId":118077,"ForumId":20,"TopicTitle":"incompability of parts","CreatedByName":"DennyTX","CreatedById":92389,"CreatedDateTime":"2015-08-09T22:01:10Z","PageNum":1,"Articles":[{"CreatedByName":"DennyTX","CreatedById":92389,"CreatedDateTime":"2015-08-09T22:01:10Z","Content":"\n\u003Cp\u003EWell, i think enough people likes \u0022close to realism\u0022 games style.\u003C/p\u003E\u003Cp\u003EBut here we faced some problems.\u003C/p\u003E\u003Cp\u003Efor example, there was no solar panels onboard during Gemini and Apollo flights, but currently we can attach solar panels to Gemini\u0027s style vessel during game.\u003C/p\u003E\u003Cp\u003ESo, the idea is following, can anybody do a partmodule that will work on following algoritm:\u003C/p\u003E\u003Cp\u003EPart can have something like following in its cfg\u003C/p\u003E\u003Cp\u003EMODULE \u003C/p\u003E\u003Cp\u003E{\u003C/p\u003E\u003Cp\u003Ename = moduleIncompability\u003C/p\u003E\u003Cp\u003Elist = partname1, partname2, etc (list of parts that incompatible with current one) \u003C/p\u003E\u003Cp\u003E}\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ELOGIC \u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cem\u003Eif\u003C/em\u003E\u003C/strong\u003E (vessel) has onboard (Part with moduleIncompability) \u003Cstrong\u003E\u003Cem\u003Ethen\u003C/em\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E impossible to attach (anything from list string) to such vessel \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cem\u003Eelse\u003C/em\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E (stock rules)\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cem\u003Eendif\u003C/em\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003Eimho, this will do game more hard and interesting and will add more challenges for gamers.\u003C/p\u003E\n"},{"CreatedByName":"Drew Kerman","CreatedById":103177,"CreatedDateTime":"2015-08-09T22:13:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DennyTX\u0022 data-cite=\u0022DennyTX\u0022\u003E\u003Cdiv\u003Eimho, this will do game more hard and interesting and will add more challenges for gamers.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIMHO anyone who would find this kind of restriction challenging and enjoyable would just as easily choose not to attach certain parts to certain types of vessels\u003C/p\u003E\n"},{"CreatedByName":"PringleMan","CreatedById":1396,"CreatedDateTime":"2015-08-09T22:16:59Z","Content":"\n\u003Cp\u003EIt is an interesting idea, but I am not sure why we would do this rather than just not put the parts on...\u003C/p\u003E\u003Cp\u003EOne problem is that there are no stock fuel cells. Mercury and early Gemini were battery powered, but later Gemini missions and Apollo were powered by fuel cells that slowly combined hydrogen and oxygen to produce power and water. As well, the lunar lander starting with Apollo 12 and later actually carried an RTG.\u003C/p\u003E\u003Cp\u003EIndeed, fuel cells and RTGs are somewhat easier than solar cells in terms of power generation.\u003C/p\u003E\u003Cp\u003EAnyways, an easy way to make it more difficult would be to just move the parts to a higher tech node, to sort of force you not to use them until later on. Probably easier than making a module manager hook for incompatibility.\u003C/p\u003E\n"},{"CreatedByName":"DennyTX","CreatedById":92389,"CreatedDateTime":"2015-08-10T00:36:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Gaiiden\u0022 data-cite=\u0022Gaiiden\u0022\u003E\u003Cdiv\u003EIMHO anyone who would find this kind of restriction challenging and enjoyable would just as easily choose not to attach certain parts to certain types of vessels\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eindeed....\u003C/p\u003E\u003Cp\u003Ebut there are a great difference between \u0022be able, but force yourself not to use it\u0022 and \u0022do not be able\u0022...\u003C/p\u003E\n"},{"CreatedByName":"maltesh","CreatedById":17144,"CreatedDateTime":"2015-08-10T01:08:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PringleMan\u0022 data-cite=\u0022PringleMan\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EOne problem is that there are no stock fuel cells.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere are, actually. The game\u0027s included the \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Fuel_Cell\u0022 rel=\u0022external nofollow\u0022\u003EFuel Cell\u003C/a\u003E and the \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Fuel_Cell_Array\u0022 rel=\u0022external nofollow\u0022\u003EFuel Cell Array\u003C/a\u003E since 1.0.\u003C/p\u003E\n"},{"CreatedByName":"PringleMan","CreatedById":1396,"CreatedDateTime":"2015-08-10T01:25:22Z","Content":"\n\u003Cp\u003EDoh. I have used so many mods for so long I forgot about that.\u003C/p\u003E\u003Cp\u003EAh well point still stands.\u003C/p\u003E\n"},{"CreatedByName":"DennyTX","CreatedById":92389,"CreatedDateTime":"2015-08-10T01:49:15Z","Content":"\n\u003Cp\u003Ebtw, we have to speak not only about solar panels and RTGs, but others things too\u003C/p\u003E\u003Cp\u003Efor example in current game i can create \u0022Wunderwaffe\u0022 interplanetary station, carrying onboard all available science devices... but there are not such machines in real life. With incompability we could restrict carry all science onboard simultaneously\u003C/p\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2015-08-10T01:55:04Z","Content":"\n\u003Cp\u003EOf course over time these components *would* be available. So maybe, instead of exluding part x for part y, why not make certain parts only available after a while? They\u0027d be in some kind of \u0022tech\u0022 tree, that you\u0027d then have to unlock over time with points, earned, for instance, with science. Now \u003Cem\u003Ethat\u003C/em\u003E might be an elegant solution for these kind of restrictions!\u003C/p\u003E\n"},{"CreatedByName":"DECQ","CreatedById":113001,"CreatedDateTime":"2015-08-10T10:37:47Z","Content":"\n\u003Cp\u003EMaybe just? attachRules = 1,0,1,0,1\u003C/p\u003E\u003Cp\u003EAs far as I remember so you can attach the details only after the point of attachment.\u003C/p\u003E\n"},{"CreatedByName":"PringleMan","CreatedById":1396,"CreatedDateTime":"2015-08-10T16:21:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DennyTX\u0022 data-cite=\u0022DennyTX\u0022\u003E\u003Cdiv\u003Ebtw, we have to speak not only about solar panels and RTGs, but others things too\u003Cp\u003Efor example in current game i can create \u0022Wunderwaffe\u0022 interplanetary station, carrying onboard all available science devices... but there are not such machines in real life. With incompability we could restrict carry all science onboard simultaneously\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAgain, just don\u0027t put them all on the craft. In the case of kerbal, really there are only a handful of science experiments in the first place, several of them about as complex as a tube filled with stuff stuck on the side of the craft. If we had so few experiments that were so light, we probably would cram all of them on to a ship and send them off.\u003C/p\u003E\u003Cp\u003EWe don\u0027t do that in real life because science experiments don\u0027t work like that in real life. In the real world, science experiments can weigh almost a full ton to investigate a single idea, and trying to quantify the number of science experiments that could be run in real life is like trying to throw a dart at a dart board with the accurate number of grains of sand on the beach while blindfolded. Just...not possible. So many variables, ways to test, and things we don\u0027t even know you can test for yet.\u003C/p\u003E\u003Cp\u003EWhat I WOULD like to see is a progression on the tech tree that improves the transmit value of science as you get higher. Perhaps increasing the transmit multiplier conditional on if you have processed it in a lab. A trained scientist in space can write a report and include photos of an experiment just as well as a trained scientist on the ground can. And while early on I would justify not having good SSTV or digital signals for data transmission, thus denying the ability to really send files and requiring a verbal description of the samples, later on in the tech tree it just doesn\u0027t make sense.\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-08-10T16:25:28Z","Content":"\n\u003Cp\u003EI don\u0027t know, this sort of restriction is what the tech tree is for.\u003C/p\u003E\n"}]}