{"TopicId":118156,"ForumId":16,"TopicTitle":"no more science","CreatedByName":"Cannon","CreatedById":109645,"CreatedDateTime":"2015-08-10T22:30:29Z","PageNum":1,"Articles":[{"CreatedByName":"Cannon","CreatedById":109645,"CreatedDateTime":"2015-08-10T22:30:29Z","Content":"\n\u003Cp\u003Eis it normal that on my second duna landing (and returning) i got almost no science compared to the first landing.\u003C/p\u003E\u003Cp\u003EIt took me i think 5 landings on the mun to start getting little or no science and on minmus too.\u003C/p\u003E\u003Cp\u003Ewhat\u0027s wrong with duna?\u003C/p\u003E\u003Cp\u003Eand btw i didn\u0027t land on the same area, first landing was near the south pole, second landing was near the north pole\u003C/p\u003E\n"},{"CreatedByName":"Phil deCube","CreatedById":120897,"CreatedDateTime":"2015-08-10T22:46:31Z","Content":"\n\u003Cp\u003EAh! But it\u0027s still a pole. I don\u0027t think the biomes are split into north and south poles. It\u0027s just poles. That\u0027s probably why you got zero. You already did science at the poles biome.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Biome#Duna\u0022 rel=\u0022external nofollow\u0022\u003EDuna biome\u003C/a\u003E list.\u003C/p\u003E\n"},{"CreatedByName":"Fearless Son","CreatedById":133397,"CreatedDateTime":"2015-08-10T22:46:55Z","Content":"\n\u003Cp\u003EThat is actually expected in this case. Duna counts both the north and south pole as being the same biome for science gathering purposes.\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-08-10T22:53:34Z","Content":"\n\u003Cp\u003EYes, it\u0027s normal, if you\u0027re landed in the same biome (which it sounds like you were).\u003C/p\u003E\u003Cp\u003EA good overview of how science works in KSP:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Science\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.kerbalspaceprogram.com/wiki/Science\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EA summary:\u003C/p\u003E\u003Cp\u003E- Science results are per \u0022situation\u0022, where the \u0022situation\u0022 is the combination of 1. which body you\u0027re on/around, 2. biome, 3. instrument, and 4. situation (landed, flying, etc.)\u003C/p\u003E\u003Cp\u003E- For example, \u0022Duna, poles, goo canister, landed\u0022 is a situation.\u003C/p\u003E\u003Cp\u003E- Any given \u0022situation\u0022 gives a certain amount of science. Once you\u0027ve gotten that science, you have milked that situation dry, and you can\u0027t get any more (other than a tiny dribble).\u003C/p\u003E\u003Cp\u003ESo I\u0027ll bet what happened on the Mun was that you landed in different locations, which happened to be in different biomes (e.g. Highlands, Midlands, Lowlands, Farside Crater, etc.) Since they were different biomes, each one gave you a full load of fresh science.\u003C/p\u003E\u003Cp\u003EHowever, when you landed on Duna, it was your bad luck that you landed in the same biome twice. (Duna doesn\u0027t have a \u0022north pole\u0022 and a \u0022south pole\u0022 biome, just a single \u0022poles\u0022 biome that applies to both). Therefore, your first landing milked the poles dry, so a second landing on the poles didn\u0027t provide any added value.\u003C/p\u003E\u003Cp\u003ENote that Duna has a lot fewer biomes than the Mun does-- only 5, compared with the Mun\u0027s 15. Therefore, if you just plop down at random on the Mun a few times, you\u0027ll likely end up in different biomes, but on Duna you\u0027re more likely to hit the same biome again unless you pay attention to where the boundaries are.\u003C/p\u003E\u003Cp\u003EThe Kerbal wiki has a pretty good map of Duna biomes:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Duna\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.kerbalspaceprogram.com/wiki/Duna\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIncidentally, Duna\u0027s moon Ike has a more biomes than Duna itself does (8, compared with Duna\u0027s 5):\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Ike\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.kerbalspaceprogram.com/wiki/Ike\u003C/a\u003E\u003C/p\u003E\n"}]}