{"TopicId":118263,"ForumId":21,"TopicTitle":"Vehicle Assembly Lawn","CreatedByName":"Moesly_Armlis","CreatedById":112247,"CreatedDateTime":"2015-08-12T03:45:24Z","PageNum":1,"Articles":[{"CreatedByName":"Moesly_Armlis","CreatedById":112247,"CreatedDateTime":"2015-08-12T03:45:24Z","Content":"If you have never built a rocket on the lawn give it a try.\n\nBuild something simple or build something complicated. \n\nAir/space planes, trains, rockets or anything.\n\nJust assemble it on the lawn and launch it.\n\nThen post your creations here.\n\nBill has tried assembling space planes on the lawn but disbanded the idea when rockets started to soar.\n\nBill made a booster train and truck to haul them too the launch pad\n\n![vcYOpHo.gif](http://i.imgur.com/vcYOpHo.gif)\n\nHere a rocket built by Bill that reached orbit. \n\nBill:) has learned plenty about mechanical devices down at the ranch and still has much to learn about building rockets.\n\nFor the first time he built a multi stage rocket that sent a probe into orbit.\n\n![EJl99Rz.png](http://i.imgur.com/EJl99Rz.png)\n\n![MR2XuC1.png](http://i.imgur.com/MR2XuC1.png)\n\n![SfTxkwz.png](http://i.imgur.com/SfTxkwz.png)\n\nMore details\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/6rdQL)\n\nKeep in mind this type of rocket assembly is full of dangers. When the Kraken strikes you had better be in the bunker.\n\n[I have a video that can illustrate](https://vimeo.com/136123672).\n\n\u003Ciframe src=\u0022https://player.vimeo.com/video/136123672\u0022 width=\u0022874\u0022 height=\u0022482\u0022 frameborder=\u00220\u0022 title=\u0022Bill Has Nightmares\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\n\n**Edited \u003Ctime datetime=\u00222015-08-12T22:13:20Z\u0022 title=\u002208/12/2015 10:13  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 12, 2015\u003C/time\u003E by MoeslyArmlis**"},{"CreatedByName":"Moesly_Armlis","CreatedById":112247,"CreatedDateTime":"2015-08-13T03:45:06Z","Content":"Here is my first craft submission. Let me know if it works.\n\nThis is the basic tools to start exploring the idea of building rockets on the lawn.\n\n[Image](http://i.imgur.com/VEsPujR.png)\n\n![VEsPujR.png](http://i.imgur.com/VEsPujR.png)\n\nCraft File\n\n[Bob Tow Booster Kit](https://www.dropbox.com/s/cwufe5oycpok4ny/Bob%20Tow%20Booster%20Kit.craft?dl=0)\n\nJust stick these Fleas on whatever using another docking port. Very light weight a kerbal can easily move them.\n\nEasy to line up and can be completed within IVA mode.\n\nThis is designed to be two separate launches for a tier zero facility.\n\nJust separate the craft at the truck\u0027s docking port then create a subassembly for the boosters.\n\nTo launch the boosters reattach the boosters. Rename the vessel and use the root tool on the boosters and separate the truck. \n\nSave.\n\nFirst launch Bob Tow truck, then park it off the runway/launchpad and then launch the boosters and dock with them. \n\nThe vessel has RCS for those minor adjustments.\n\nReverse use the twin Sparks by activating the oxidizer on the centre tank.\n\nWhile in IVA I use the sparks to reverse and then the RCS to move forward.\n\nForward cruising use the Wheesley by activating the intake.\n\nTo cruise in IVA get to cruising speed and shut down intake. Turn on oxidizer and go IVA. \n\nUse the reverse thrusters to slow down when there is a heavy payload.\n\nKeep both option panels for the oxidizer and intake on screen for rapid forward/reverse selection.\n\nThe wheels have been set up for maximum turning radius.\n\nIt drives similar to a fork lift pallet truck.\n\n**Edited \u003Ctime datetime=\u00222015-08-13T04:26:40Z\u0022 title=\u002208/13/2015 04:26  AM\u0022 data-short=\u00228 yr\u0022\u003EAugust 13, 2015\u003C/time\u003E by MoeslyArmlis**"},{"CreatedByName":"Moesly_Armlis","CreatedById":112247,"CreatedDateTime":"2015-08-14T03:32:58Z","Content":"**You too can build a rocket that goes to space!**\n\n![Hu2Uewj.png](http://i.imgur.com/Hu2Uewj.png)\n\n**As pictured on the box.**\n\n![4u9LXai.png](http://i.imgur.com/4u9LXai.png)\n\nSome assembly required.\n\n![YtBmBns.png](http://i.imgur.com/YtBmBns.png)\n\nThis kit is for the advanced engineer who does not mind getting their hands a little dirty. This means that there is some rocket wrangling required.\n\n This design flaw has been referred to as a feature that allows an engineer to experience the entire environment.\n\n[**Bob Bill Tow Boosters Kit**](https://www.dropbox.com/s/zw9fdwh60xzz65a/Bob%20Bill%20Tow%20Boosters%20Kit.craft?dl=0)\n\nThis kit is in three pieces for tier zero facilities.\n\nThe rocket carts have probe cores attached to allow control of the parking brake and steering of a Hammer and Flea booster pair.\n\nFor stubborn connections separate the booster pair.\n\n Warranty void if booster pairs are separated.\n\nThese are updated tow truck and boosters and incompatible with previous designs.\n\n[**Bob Bill Rocket**](https://www.dropbox.com/s/avxd1r0otm3jlvh/Bob%20Bill%20Rocket.craft?dl=0)\n\nThe booster thrust limit is set for a TWR of 1.40 at liftoff.\n\nThe Terrier stage is used to steady the vessel when separating spent boosters.\n\nUse additional throttle to increase control.\n\nReduce throttle until upper atmosphere.\n\nGo for altitude above 50 km before releasing the fairing.\n\nThe probe core vessel achieves orbit with around 2500 m/s of delta V left over.\n\nRemember to recharge the probe core batteries using the tow truck.\n\n**Get them while supplies are** **stock****!**\n\nMore Details\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/jhd9x)"},{"CreatedByName":"smjjames","CreatedById":134004,"CreatedDateTime":"2015-08-14T03:39:01Z","Content":"Whats the wierd black thing in the third image of the first post?"},{"CreatedByName":"Red Dwarf","CreatedById":67709,"CreatedDateTime":"2015-08-14T04:08:13Z","Content":"\u003E \n\u003E Whats the wierd black thing in the third image of the first post?\n\nThe kerbal is sitting in the tier 1 bunker, which doesn\u0027t have a texture for the inside ceiling, or it\u0027s bugged or something. What we\u0027re seeing there is the scorch marks on the roof of the bunker from below."},{"CreatedByName":"Moesly_Armlis","CreatedById":112247,"CreatedDateTime":"2015-08-14T04:32:24Z","Content":"\u003E \n\u003E The kerbal is sitting in the tier 1 bunker....What we\u0027re seeing there is the scorch marks...\n\nBill is afraid of spiders and always sends Bob to check and see if it is still dead."},{"CreatedByName":"ttnarg","CreatedById":91776,"CreatedDateTime":"2015-08-14T10:21:37Z","Content":"You might be interested in some of the rockets in this thread. [http://forum.kerbalspaceprogram.com/threads/66293-Today-I-build-a-Rocket?p=1019396\u0026viewfull=1#post1019396](https://forum.kerbalspaceprogram.com/threads/66293-Today-I-build-a-Rocket?p=1019396\u0026viewfull=1#post1019396)\n\nIt\u0027s old and very much not for cavemen but has some good ideas. (I am not new to this rocket building thing.)"},{"CreatedByName":"Majorjim!","CreatedById":61954,"CreatedDateTime":"2015-08-14T14:44:20Z","Content":"This is admirable and really fun looking! That pic of the Kerbal in the bunker! ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)"},{"CreatedByName":"Moesly_Armlis","CreatedById":112247,"CreatedDateTime":"2015-08-16T07:06:08Z","Content":"**Build A Topper Taller Rocket**\n\n**As pictured on the box.**\n\n![EfYKpSr.png](http://i.imgur.com/EfYKpSr.png)\n\n**Team work Required and a crane.**\n\n![8jvYzEv.png](http://i.imgur.com/8jvYzEv.png)\n\n**Yes a Crane. Light loads of 5 tonne can be lifted 40 cm.**\n\n![julNJY9.png](http://i.imgur.com/julNJY9.png)\n\n **** **The bunker is extra roomy.**\n\n![B78mZUE.png](http://i.imgur.com/B78mZUE.png)\n\n **Booster Separation is clean and trouble free.**\n\n![eiIjdY5.png](http://i.imgur.com/eiIjdY5.png)\n\n**Build A rocket.** \n\n**Top a rocket.**\n\n**Go to space.**\n\n![gOVMFZN.png](http://i.imgur.com/gOVMFZN.png)\n\nThis advanced kit is a four step procedure.\n\nAttach three booster pairs to rocket core then top with upper probe core. Simple. \n\nThis kit is not recommended to be used with other kits.\n\nIllustrated guide included.\n\n**Rocket Topper Taller Kit**\n\n[Bob Bill Tow Booster Kit Rev3](https://www.dropbox.com/s/4kplv40443gwzo2/Bob%20Bill%20Tow%20Boosters%20Kit%20Rev3.craft?dl=0)\n\n[Topper Crane](https://www.dropbox.com/s/o2srfaeg9ulfb2t/Topper%20Crane.craft?dl=0)\n\n[Topper Probe](https://www.dropbox.com/s/i0gyamhw0wkxkfe/Topper%20Probe.craft?dl=0)\n\n[Rocket Booster Core](https://www.dropbox.com/s/rjq6rkc6i6ktqe1/Bob%20Bill%20Rocket%20II%20Booster%20Core.craft?dl=0)\n\nThis build took quite a few hours to get everything just right. The final assembly was two hours.\n\n[Illustrated Guide](https://vimeo.com/136450917)\n\n\u003Ciframe src=\u0022https://player.vimeo.com/video/136450917\u0022 width=\u00221280\u0022 height=\u0022720\u0022 frameborder=\u00220\u0022 title=\u0022TeamTopsRocket\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\n\nThe [**inaugural launch of the Topper Taller Rocket**](https://vimeo.com/136440966) was better than most VAL built rockets.\n\n\u003Ciframe src=\u0022https://player.vimeo.com/video/136440966\u0022 width=\u0022874\u0022 height=\u0022482\u0022 frameborder=\u00220\u0022 title=\u0022TopperTallerLaunch\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\n\nEven though it takes hours to build a toy model rocket and it is over in a flash I am still enthusiastic to do it all over.\n\n**Edited \u003Ctime datetime=\u00222015-08-16T21:53:37Z\u0022 title=\u002208/16/2015 09:53  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 16, 2015\u003C/time\u003E by MoeslyArmlis**"},{"CreatedByName":"ttnarg","CreatedById":91776,"CreatedDateTime":"2015-08-24T08:55:24Z","Content":"I\u0027ve started what I\u0027m calling Caveman level 2 and have upgraded my R\u0026D building. (but I\u0027m not using the fuel transfer on Kerbin)\n\nI wanted to do some manned missions to Mimmus and Mun. Here my craft Which I call the Crow.\n\n[![fuI6Re1.png](http://i.imgur.com/fuI6Re1.png)](http://imgur.com/fuI6Re1)\n\nI could of done this caveman, but I have upgraded some parts with the new tech. The Cart (now names Fox 4) now uses 4 Vernor Engines so I can use RCS controls to go forwards and back, (before I was just using RCS to go back with 6ish Linear RCS Port) and all docking ports now small size (instead of tiny).\n\nThe idea is a easy and quick build craft for light payloads. Just 2 modules (3 counting the cart). Jeb has taken this to Mimmus. Now its Val turn to do the harder Mun mission. Would be a good craft for anyone doing caveman missions.\n\nEdit: looks like I don\u0027t have the flying skills to do a Mun landing and return with this craft.\n\n**Edited \u003Ctime datetime=\u00222015-08-24T13:33:07Z\u0022 title=\u002208/24/2015 01:33  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 24, 2015\u003C/time\u003E by ttnarg**"},{"CreatedByName":"ttnarg","CreatedById":91776,"CreatedDateTime":"2015-08-24T09:41:09Z","Content":"In other news, I was trying to get cross feed working on my Raven Craft I set up cross feed out of one booster to it\u0027s docking port, across the docking ports on the core, and from the docking port on the other booster into it\u0027s fuel tank. See Pic.\n\n[![gB2l9MW.png](http://i.imgur.com/gB2l9MW.png)](http://imgur.com/gB2l9MW)\n\nBut it\u0027s not working. I spent a lot of time trying different thing some times I can get cross feeding into or out of the core but never from one booster to another and even cross feeding into and out of the core (which I don\u0027t want) seem random all my fuel ducts are behind decouples so there should be no interaction with the cores fuel tank. I wasted a lot of time trying to get this working, It world be nice to get more payload to orbit with my Raven but it dose not look like it\u0027s worth it."},{"CreatedByName":"Moesly_Armlis","CreatedById":112247,"CreatedDateTime":"2015-08-26T17:17:00Z","Content":"Cross feeding fuel seems to have a lot of issues.\n\n![BiNfQ6P.png](http://i.imgur.com/BiNfQ6P.png)\n\nHere I had three fuel boosters attached and was to supply the inner core booster with fuel.\n\nThe problem is that fuel for the core booster was only pulling fuel from one of the attached tanks.\n\nIf I can remember correctly, closing fuel valves did reroute the fuel flow and the inner core booster would pull fuel from another tank.\n\n![Yk7LN1o.png](http://i.imgur.com/Yk7LN1o.png)\n\nThe fuel from the outer tank atop the Flea feeds fuel to the adjacent booster without any issues. The only issue was that the fuel for the core booster was being drawn from only one of the attached tanks.\n\nIt could be a coding issue with fuel flow. I have seen issues with fuel flow with vessel that were assembled in the VAB and am hopeful that these will be fixed.\n\nNow when I am investigating a new design I use the Oscar-B fuel tanks and make a small model rocket that can be assembled quickly.\n\nThis is from an earlier experiment.\n\n![tmTHvu0.png](http://i.imgur.com/tmTHvu0.png)\n\nToo bad I did not try this with two or more fuel inlets.\n\n**Edited \u003Ctime datetime=\u00222015-08-26T17:26:57Z\u0022 title=\u002208/26/2015 05:26  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 26, 2015\u003C/time\u003E by MoeslyArmlis**"},{"CreatedByName":"Majorjim!","CreatedById":61954,"CreatedDateTime":"2015-08-26T17:53:36Z","Content":"\u003E \n\u003E Cross feeding fuel seems to have a lot of issues.\n\u003E [http://i.imgur.com/BiNfQ6P.png](http://i.imgur.com/BiNfQ6P.png)\n\u003E \n\u003E Here I had three fuel boosters attached and was to supply the inner core booster with fuel.\n\u003E \n\u003E The problem is that fuel for the core booster was only pulling fuel from one of the attached tanks.\n\u003E \n\u003E If I can remember correctly, closing fuel valves did reroute the fuel flow and the inner core booster would pull fuel from another tank.\n\u003E \n\u003E [http://i.imgur.com/Yk7LN1o.png](http://i.imgur.com/Yk7LN1o.png)\n\u003E \n\u003E The fuel from the outer tank atop the Flea feeds fuel to the adjacent booster without any issues. The only issue was that the fuel for the core booster was being drawn from only one of the attached tanks.\n\u003E \n\u003E It could be a coding issue with fuel flow. I have seen issues with fuel flow with vessel that were assembled in the VAB and am hopeful that these will be fixed.\n\u003E \n\u003E Now when I am investigating a new design I use the Oscar-B fuel tanks and make a small model rocket that can be assembled quickly.\n\u003E \n\u003E This is from an earlier experiment.\n\u003E \n\u003E [http://i.imgur.com/tmTHvu0.png](http://i.imgur.com/tmTHvu0.png)\n\u003E \n\u003E Too bad I did not try this with two or more fuel inlets.\n\nHey man. I\u0027m not sure why you would use docking ports for that. Separators work much better. And I think they are causing your fuel flow issues. If you send me the craft file and instructions of exactly how you want the fuel to flow (any way you like) and I can make it work for you. You can PM it to me if you like."},{"CreatedByName":"LABHOUSE","CreatedById":107761,"CreatedDateTime":"2015-08-26T21:46:46Z","Content":"My idea was stolen!"},{"CreatedByName":"FleshJeb","CreatedById":111640,"CreatedDateTime":"2015-08-27T01:31:26Z","Content":"I refer you to Cupcake Landers (NOT me):\n\n\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/SyUpLwbWbvU?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E"},{"CreatedByName":"Moesly_Armlis","CreatedById":112247,"CreatedDateTime":"2015-08-27T05:51:12Z","Content":"@ Majorjim The docking ports are being used to attach rocket assemblies. I am designing tier zero facility vessels.\n\n Each vessel when completed break the weight and part count limits of the tier zero VAB/SPH and launch pad/runway.\n\n@ LABHOUSE what idea and who stoled it?\n\n@ FleshJeb that is an awesome job that Cupcake completed.\n\nFrom Cupcake youtube video:\n\n\u003E \n\u003E In order to make things a little easier on myself I drained most of the fuel from the rocket stages and used Hyperedit to fill the tanks once the thing was assembled on the launch pad.\n\nI like the idea of filling the tanks once completed but in a tier zero facility there is no fuel transfer until the R\u0026D is upgraded.\n\nWhat does this vessel resemble?\n\n![857bolg.png](http://i.imgur.com/857bolg.png)\n\nP\\_ \\_ \\_ \\_ \\_ \\_ M\\_ \\_ \\_ \\_ \\_\n\nHere is a sample of the next rocket assembly kit to be released. It is being tested and should be ready soon.\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/CYzcJ)\n\n**Edited \u003Ctime datetime=\u00222015-08-27T06:02:11Z\u0022 title=\u002208/27/2015 06:02  AM\u0022 data-short=\u00228 yr\u0022\u003EAugust 27, 2015\u003C/time\u003E by MoeslyArmlis**"},{"CreatedByName":"Moesly_Armlis","CreatedById":112247,"CreatedDateTime":"2015-12-21T06:30:45Z","Content":"The new 1.0.5 update gave a very important feature to the docking ports   **Docking ports have the ability to be staged.**  This means that after a rocket is built it can be easily launched, staged correctly and with predictable logical results.  I plan on updating these designs in the upcoming days.\n\nLoads of thanks goes to the dev team for this bit of magic.\n\nEdit: after fabricating a complex staged vessel I figured all was going to be fine because of the staging function.  Care still must be taken on the order  of assembly otherwise failure will ensue.\n\n![HAIEhLH.png](http://i.imgur.com/HAIEhLH.png)\n\nThe update is still alright because now the need for right click on the docking port is reduced.\n\nThe persistence setting for disable/enable crossfeed is also a benefit, before the update the taxi would drain fuel from the boosters if I forgot to reset the crossfeed.\n\nAlways remember to take cover in the bunker!\n\n![JCkPyZi.png](http://i.imgur.com/JCkPyZi.png)![Q20LMrr.png](http://i.imgur.com/Q20LMrr.png)\n\n![gnecwzv.png](http://i.imgur.com/gnecwzv.png)\n\n**Edited \u003Ctime datetime=\u00222015-12-21T08:15:47Z\u0022 title=\u002212/21/2015 08:15  AM\u0022 data-short=\u00228 yr\u0022\u003EDecember 21, 2015\u003C/time\u003E by MoeslyArmlis**"},{"CreatedByName":"Foxster","CreatedById":113764,"CreatedDateTime":"2015-12-21T08:35:14Z","Content":"You should make this a Challenge. Something like: Build an orbit-capable craft with at least three stages. Each stage to be gathered and assembled outside the VAB."},{"CreatedByName":"Moesly_Armlis","CreatedById":112247,"CreatedDateTime":"2015-12-27T03:55:21Z","Content":"\u003E \n\u003E \n\u003E On 12/21/2015 at 3:35 AM, Foxster said:\n\u003E \n\u003E \n\u003E You should make this a Challenge. Something like: Build an orbit-capable craft with at least three stages. Each stage to be gathered and assembled outside the VAB.\n\u003E \n\nApologies for not responding sooner as I got bitten by the rocket building bug and I am loving every minute of it.\n\nRocket assembly would make a decent challenge.  I am administrating the caveman challenge and with these new ideas Bill has for assembling rockets the time is so scarce.  I did post about this challenge in the cave and maybe someone will respond.  Otherwise feel free to create it.  You can be certain I will be a participant.\n\n**\u003Cu\u003EVehicle \u003C/u\u003E** **\u003Cu\u003EAssembly Lawn: The First Rule\u003C/u\u003E**\n\nThe first rule about VAL is: You do not talk about VAL.  Wait that\u0027s not right!\n\nThe first rule about VAL and building rockets using docking ports is: **The last part docked must be the last part to undock.** \n\nOtherwise deal with unpredictable results. \n\nSo to comply with this rocket assemblies are topped with a probe core. \n\nThe probe core is the last part docked and last to undock.\n\n![GAuXVLt.png](http://i.imgur.com/GAuXVLt.png)![1yeGHWq.png](http://i.imgur.com/1yeGHWq.png)![5ct7ElG.png](http://i.imgur.com/5ct7ElG.png)\n\n![ios6YP3.png](http://i.imgur.com/ios6YP3.png)\n\nThis completed vessel launched successfully and ascended into the upper atmosphere.\n\n![3edg2eP.png](http://i.imgur.com/3edg2eP.png)![0aE6fgx.png](http://i.imgur.com/0aE6fgx.png)\n\nWhen the staging was activated using the new docking port feature.\n\n![1j29D7P.png](http://i.imgur.com/1j29D7P.png)\n\nThe vessel separated and continued without interruption.\n\n![FxOMQbz.png](http://i.imgur.com/FxOMQbz.png)\n\nDelivering the payload into orbit.\n\n.![7ffJR5w.png](http://i.imgur.com/7ffJR5w.png)\n\nAnd remember Safety first!\n\n![okeZ76L.png](http://i.imgur.com/okeZ76L.png)\n\nAlways use the bunker!\n\n**\u003Cu\u003EBeyond Level Twenty\u003C/u\u003E**\n\nCurrently the scope of Bill\u0027s imagination has expanded beyond the 20 metre level.  The height restriction of 20 metres has been always been mocking Bill\u0027s building attempts.  The idea for using a skycrane for assembly above 20 metres is something I pursued but seemed, during my attempts, to fail in a big time way. \n\nLifting from horizontal to vertical is what I am pursuing now.  Here is an animated gif of some of Bill\u0027s research.\n\n**Going Vertical**\n\n![D6SRlvm.gif](http://i.imgur.com/D6SRlvm.gif)\n\nSo my latest creation will reach above the twenty metre level.  This vessel has an upper stage with an LV-909 and the payload that will assembled horizontal and then lifted vertical using a Horizontal to Vertical crane or H2Vcrane.  Then the H2Vcrane will transport the upper stage and place it on top of the lower booster stage.  The lower booster uses nine assemblies of around eighteen.tonnes each.  After a test fitting to make certain the docking ports are all aligned the craft takes about an hour to assemble.\n\n\u003Ciframe class=\u0022imgur-album\u0022 frameborder=\u00220\u0022 height=\u0022550\u0022 src=\u0022//imgur.com/a/EFWQo/embed?background=ffffff\u0026text=1a1a1a\u0026link=4e76c9\u0022 width=\u0022100%\u0022\u003E\u003C/iframe\u003E\n\nP.S.\n\nAfter building these rocket assemblies I came to a realization.  All of the frustration/fun during the early experience with KSP with the simple problems and failures of building my first rocket capable of achieving orbit are once again being enjoyed on the Vehicle Assembly Lawn.\n\n**Edited \u003Ctime datetime=\u00222015-12-27T04:33:21Z\u0022 title=\u002212/27/2015 04:33  AM\u0022 data-short=\u00228 yr\u0022\u003EDecember 27, 2015\u003C/time\u003E by MoeslyArmlis**"}]}