{"TopicId":118240,"ForumId":32,"TopicTitle":"Challenge Badges","CreatedByName":"jondugger123","CreatedById":149541,"CreatedDateTime":"2015-08-11T23:05:08Z","PageNum":1,"Articles":[{"CreatedByName":"jondugger123","CreatedById":149541,"CreatedDateTime":"2015-08-11T23:05:08Z","Content":"\n\u003Cp\u003EThis might be a dumb question, and I know I\u0027ve seen it asked here before and I found the answer to not really explain much, however I\u0027m curious as to how you go about officially accepting challenges and receiving the badges afterwards, or if all challenges even have badges, and how you go about displaying them. I\u0027ve seen a few that I can easily accomplish and would like to do so, I\u0027m just lost on the acceptance/reward aspect of them. Any help would be appreciated. Fly safe. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-08-11T23:22:01Z","Content":"\n\u003Cp\u003EJust make an entry and post it to the challenge thread, the OP will hopefully tell you if your entry is accepted or not. It\u0027s not really all that formal.\u003C/p\u003E\n"},{"CreatedByName":"Terwin","CreatedById":139655,"CreatedDateTime":"2015-08-12T13:26:12Z","Content":"\n\u003Cp\u003ELinks to Badges(if there is one) are sent via private message so you can put them in your sig (at least that is how it happened with me)\u003C/p\u003E\n"},{"CreatedByName":"SAI Peregrinus","CreatedById":125558,"CreatedDateTime":"2015-08-12T13:56:45Z","Content":"\n\u003Cp\u003EYep, it\u0027s totally on the honor system. You can always just link the badge image. But everyone who cares and tries to find your entry would know, and would probably follow you around the forums and mock you relentlessly, so faking it isn\u0027t worth it.\u003C/p\u003E\u003Cp\u003Eeg:\u003Cimg src=\u0022http://i52.photobucket.com/albums/g13/GoSlash27/cavemanbadge_zpsjkijz0wr.jpg\u0022 alt=\u0022cavemanbadge_zpsjkijz0wr.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Nich","CreatedById":145678,"CreatedDateTime":"2015-08-12T14:57:54Z","Content":"\n\u003Cp\u003EFor displaying them go to settings (top right) and on the left side you can edit your signature. I have just copied and pasted my badges using chrome.\u003C/p\u003E\n"}]}