{"TopicId":118253,"ForumId":44,"TopicTitle":"Official KSP Community Cubesat Project Recruitment Thread","CreatedByName":"Nicholander","CreatedById":108347,"CreatedDateTime":"2015-08-12T01:02:28Z","PageNum":1,"Articles":[{"CreatedByName":"Nicholander","CreatedById":108347,"CreatedDateTime":"2015-08-12T01:02:28Z","Content":"Hello people!\n\nAbout a year ago we started the KSP Community CubeSat Project, which you dear readers may remember, in which we, as a community, attempted to work together to build and operate a fully functional cubesat. We got some significant progress done, however, the project more or less fell apart after 6 or so months, with little work being completed after that.\n\nBut, a month ago, 4 people who had worked on this project before but were still active, cdugas4, NERVAfan, Newt and me, decided to reboot this project, adding organized leadership, and more importantly, new life and new hope to it. So, today we are looking for new members for our cubesat project, to launch a small, cubical satellite into orbit, to use a centrifuge to test how moss grows in Lunar and Martian gravity, hopefully paving the way for space colony farms in the future.\n\nAnd without further ado, these are our open positions:\n\n- Power Production/Management (Covers generation and distribution of electricity to all of the other parts. What sort of solar panels do we need, what sort of batteries? How much power will be available at different times, and how does that power get to the motor, the radio, et cetera? )\n\n- Instruments (Generally, probably looking at tools that mostly can tell us about the Moss, we were discussing the possibility of air sampling and need to look into that, but also cameras and other means to learn about the state of the moss. This also covers radio communication and probably orbit tracking.)\n\n- Structural/Layout (Importantly, how do we fit everything inside the box, and how do we hold it together? Looking at the frame, and overall organization of the different components, so we end up with enough space and no strange conflicts. Also probably looking at how to assemble the airtight box. Having access to CAD programs and maybe even access to a machine shop to construct parts would help too.)\n\n- System Coordination (Oversight for all of the components as they develop, to ensure that there are not any conflicts or issues where incompatable plans are made, and to weigh in on decsisions that impact the entire design. )\n\n- Biology (Understand the moss, support the moss and related experiment. Probably will work somewhat close with members of the instruments team to design the experiment and define what will be monitored and how it will be set up, as well as with the layout team to work out some ideas of life support.)\n\n- Controls (Controls is how we control the spacecraft. They include the electronics (pi computer or something similar), software writing and testing, gathering, storing, transmitting, and receiving data from all on board instruments as well as to and from the ground.)\n\nHowever, our command structure is dynamic, so what positions we will need will change over time, so It\u0027s a good idea to check back on this thread once in while.\n\nSo, in short, we can into space, but we need your help to do it!\n\nMore information can be found on our forum: [http://forums.mossat.org/index.php](http://forums.mossat.org/index.php)\n\nAnd here\u0027s a description of our flexible project command structure: [http://forums.mossat.org/showthread.php?tid=516](http://forums.mossat.org/showthread.php?tid=516)"},{"CreatedByName":"ChrisSpace","CreatedById":140622,"CreatedDateTime":"2015-08-12T08:26:08Z","Content":"Do we all have to actually meet up, or is there an option to plan over the internet?"},{"CreatedByName":"Nicholander","CreatedById":108347,"CreatedDateTime":"2015-08-12T10:41:12Z","Content":"We aren\u0027t supposed to meet up IRL, we\u0027ll do it over the internet."},{"CreatedByName":"ChrisSpace","CreatedById":140622,"CreatedDateTime":"2015-08-12T11:35:15Z","Content":"Okay, i\u0027m in!"},{"CreatedByName":"Mazon Del","CreatedById":32991,"CreatedDateTime":"2015-08-12T16:50:59Z","Content":"Unfortunately various duties in real life resulted in less time than anticipated to work on the original project, but I am still willing to act as a liaison between the team and the WPI professor on the moss. Depending on what is going on, I might be able to occasionally take up other small duties as well."},{"CreatedByName":"Endersmens","CreatedById":80723,"CreatedDateTime":"2015-08-12T16:53:16Z","Content":"Hello!\n\nI was the last person to post in the other thread, and I believe the last to post in mossat.org. \n\nI am still willing to make the website, and help in any other way possible.\n\nPM me if you want me to do more, because I\u0027m totally willing. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"Kerbal01","CreatedById":57322,"CreatedDateTime":"2015-08-13T01:57:24Z","Content":"I told some people about this project over on NSF, they were looking for people with cubesat ideas, they said they might be able to help with projects. Link to thread: [http://forum.nasaspaceflight.com/index.php?topic=38235.msg1415759](http://forum.nasaspaceflight.com/index.php?topic=38235.msg1415759) . \n\nSomeone should make an account and be a representative over there, not me as I know nothing about this project, just saw the NSF thread and on a whim posted about the KSP Kommunity Cubesat."},{"CreatedByName":"Newt","CreatedById":131025,"CreatedDateTime":"2015-08-14T04:20:05Z","Content":"Just to clarify, we are not intending to go to Phobos, rather simply to LEO. This should be adequate to run the experiment, which would be unduly complicated by going so far away. Nevertheless, the goal of the project remains something that is unique, and potentially shall be valuble in understanding plant growth at different G levels."},{"CreatedByName":"Shpaget","CreatedById":45577,"CreatedDateTime":"2015-08-14T04:30:33Z","Content":"Any news on the registration issue?"},{"CreatedByName":"Nicholander","CreatedById":108347,"CreatedDateTime":"2015-08-14T20:16:02Z","Content":"Okay okay, I think we got registration under control now, so, join us people so we can GO TO SPAAAAAAAAAAACE!"},{"CreatedByName":"EnderKid2","CreatedById":145622,"CreatedDateTime":"2015-08-15T06:23:30Z","Content":"Yay! Spaaaace!"},{"CreatedByName":"Fred Cop","CreatedById":146298,"CreatedDateTime":"2015-08-15T07:07:14Z","Content":"\u0022Cubical satellite\u0022?\n\nI have a special cube-shaped craft which could help with re-entry, should the satellite ever be brought down (my design is a 2x2x2 Metal Panel cube which stages into a 1x1x1 Metal Panel cube surrounded in detachable Heat Shields and parachutes, but it could be possible to configure for use as a satellite).\n\nI can post pictures of the craft if anyone wants a look."},{"CreatedByName":"Shpaget","CreatedById":45577,"CreatedDateTime":"2015-08-15T07:08:52Z","Content":"Post away."},{"CreatedByName":"NERVAfan","CreatedById":72817,"CreatedDateTime":"2015-08-15T20:30:02Z","Content":"\u003E \n\u003E \u0022Cubical satellite\u0022?\n\nCubeSats have a set of standard dimensions/specs. 1U = 10x10x10 cm, \u003C1.33 kg. And then the larger ones are built up from that (2U is 20x10x10cm, 2 1U cubes stuck together; 3U is 30x10x10 cm)."},{"CreatedByName":"Mazon Del","CreatedById":32991,"CreatedDateTime":"2015-08-17T18:18:54Z","Content":"\u003E \n\u003E \u0022Cubical satellite\u0022?\n\u003E I have a special cube-shaped craft which could help with re-entry, should the satellite ever be brought down (my design is a 2x2x2 Metal Panel cube which stages into a 1x1x1 Metal Panel cube surrounded in detachable Heat Shields and parachutes, but it could be possible to configure for use as a satellite).\n\u003E \n\u003E I can post pictures of the craft if anyone wants a look.\n\nIncidentally, NASA has never given the OK to a cubesat designed for successful re-entry. Mostly this is because any cubesat that tends to be designed for that capability doesn\u0027t have enough of itself left over to devote to ensuring that the re-entry is controlled (landing somewhere of your choice instead of just where-ever). They are fine with the sats burning up anywhere, but that\u0027s because it\u0027s no threat to anyone/anything. All satellites are required to either be able to have a controlled re-entry (assuming no technical fault stops it later), or to be able to be pushed to a parking orbit where it will not come down for thousands of years (or be a threat to anything already up there)."},{"CreatedByName":"legoclone09","CreatedById":142607,"CreatedDateTime":"2015-09-02T05:59:38Z","Content":"I said this on the main thread, but when we get a basic idea I could make this in Autodesk."}]}