{"TopicId":118229,"ForumId":25,"TopicTitle":"The \u0026quot;Get Out and Push\u0026quot; Challenge","CreatedByName":"The Crusher 862","CreatedById":142908,"CreatedDateTime":"2015-08-11T19:43:29Z","PageNum":1,"Articles":[{"CreatedByName":"The Crusher 862","CreatedById":142908,"CreatedDateTime":"2015-08-11T19:43:29Z","Content":"\n\u003Cp\u003EThe title says it all: get out of your command pod and use your EVA jet-pack to \u0022push\u0022 your stranded pod into an orbit that will land it on Kerbin in one piece.\u003C/p\u003E\u003Cp\u003EThis is less of a skill based challenge and more a patience based one, as pushing a command pod takes time, and you could get from anywhere seeing as the pack doesn\u0027t actually drain your mono-propellant in your capsule as of 1.0, but I have saved many a Kerbal by pushing half the way home, and i find it relaxing if not fun to WÃŒÂ¶aÃŒÂ¶tÃŒÂ¶cÃŒÂ¶hÃŒÂ¶ ÃŒÂ¶KÃŒÂ¶eÃŒÂ¶rÃŒÂ¶bÃŒÂ¶aÃŒÂ¶lÃŒÂ¶sÃŒÂ¶ ÃŒÂ¶dÃŒÂ¶oÃŒÂ¶ ÃŒÂ¶sÃŒÂ¶eÃŒÂ¶mÃŒÂ¶iÃŒÂ¶-ÃŒÂ¶mÃŒÂ¶aÃŒÂ¶nÃŒÂ¶uÃŒÂ¶aÃŒÂ¶lÃŒÂ¶ ÃŒÂ¶lÃŒÂ¶aÃŒÂ¶bÃŒÂ¶oÃŒÂ¶uÃŒÂ¶rÃŒÂ¶ Save kerbals from the depths of space slowly but surely.\u003C/p\u003E\u003Cp\u003ERules/notes: \u003C/p\u003E\u003Cp\u003EThe pod to be used should be a Mk 1 command pod with a Mk 16 Parachute and a 1.25 metre heat-shield on it.\u003C/p\u003E\u003Cp\u003Eit is recommended to use hyper-edit-like mods to get your pod into the right orbit, but obviously don\u0027t use it to edit your spacecraft back into the atmosphere \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/p\u003E\u003Cp\u003ESet heating effects to whatever you feel comfortable with, I use 100% to live on the edge \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\u003Cp\u003EFeel Free to quick-save/load if you run out of fuel and jeb floats off into space or you burn up in the atmosphere.\u003C/p\u003E\u003Cp\u003ETo \u0022participate\u0022 post on this thread with a screenshot of the pod starting in the designated Mode orbit from the orbital view, one of your ship in it\u0027s \u0022pushed home\u0022 orbit with a recommended periapsis of about 25,000 metres, and one of it landed or about to land, this time in ship view.\u003C/p\u003E\u003Cp\u003Ewarning: Mode names partially reflect starting distance from Kerbin and may not accurately describe difficulty. hey, it\u0027s my first time doing this, don\u0027t look at me like that!\u003C/p\u003E\u003Cp\u003E\u0022Modes\u0022:\u003C/p\u003E\u003Cp\u003ESimple Mode - 5,000,000 metre apoapsis, 400,000 metre periapsis around Kerbin\u003C/p\u003E\u003Cp\u003EEasy Mode - 4,000,000 metre apoapsis, 2,000,000 metre periapsis around Kerbin\u003C/p\u003E\u003Cp\u003Emedium Mode - 4,000,000 metre circular orbit\u003C/p\u003E\u003Cp\u003EDifficult Mode -2,000,000 metre circular orbit around The Mun\u003C/p\u003E\u003Cp\u003EHard Mode - 50,000,000 metre apoapsis, 10,000,000 metre periapsis around Kerbin\u003C/p\u003E\u003Cp\u003EEven Harder Mode - 14,000,000,000 metre circular orbit around The Sun/Kerbol\u003C/p\u003E\u003Cp\u003EManley mode - 20,000,000 metre circular orbit around Duna! *gasp*\u003C/p\u003E\u003Cp\u003EBonus points (there\u0027s not actually a point system) if you land on top of the VAB\u003C/p\u003E\u003Cp\u003EThanks anyone who read this far, if you give it a try but give up, show us all how you did anyway!\u003C/p\u003E\n"}]}