{"TopicId":118327,"ForumId":16,"TopicTitle":"Parachutes - how do they work?","CreatedByName":"Free Trader Beowulf","CreatedById":62689,"CreatedDateTime":"2015-08-12T21:50:29Z","PageNum":1,"Articles":[{"CreatedByName":"Free Trader Beowulf","CreatedById":62689,"CreatedDateTime":"2015-08-12T21:50:29Z","Content":"Hi,\n\nSo, I\u0027m trying to create a spreadsheet to calculate terminal velocity for pods and stuff coming in to land using just parachutes.\n\nMy calculations aren\u0027t working and I need some help from anyone who knows this stuff.\n\nI\u0027m starting with the drag equation:\n\nF{D}=0.5 ÃÂ v^2 C A\n\nAssuming drag equals the force from gravity and rearranging appropriately, I get:\n\nV{term} = sqrt( 2 M g / ÃÂ C A)\n\nwhere\n\nV{term} is terminal velocity\n\nM is vehicle mass in kg\n\ng is local gravity\n\nÃÂ is local air density\n\nC is surface area\n\nA is drag coefficient\n\nThe drag of a given craft is potentially quite complex, given tip, surface and tail drag and small motions of the craft changing their relationship.\n\nHowever, I\u0027m only really interested in touchdown speed, with parachutes fully deployed. So I assume the only relevant drag is from the chutes and I further assume that it\u0027s all tip drag, in KSP terms.\n\nSo, to get that I\u0027ve looked at the drag cubes for the parachutes and taken the fourth triplet, which is the drag data for the Y- axis.\n\nMy assumptions should mean any errors are in the direction that would make my calculations of terminal velocity too high, as I\u0027m ignoring some sources of drag.\n\nBut I can live with that, I want to know if a given payload can be safely parachuted to the ground with a given set of parachutes.\n\nSo, I take a simple case, a Mk 1-2 pod is 4.12 tons, and a mk-16xl parachute is .3 tons. From the drag cube I get a fully deployed area of 114.9 m^2 and a drag coefficient of 11.6.\n\ng is 9.81 m/s^2 and air density is 1.22 kg/m^3 I calculate:\n\nV{term} = sqrt( 2 \\* 4.42 \\* 1000 \\* 9.81 / 1.22 \\* 114.9 \\* 11.6 )\n\nV{term} = sqrt ( 86720.4 / 1626.0648 )\n\nV{term} = sqrt ( 53.331453 )\n\nV{term} = 7.303 m/s to three decimal places\n\nHowever, when I actually launch a capsule like that on an SRB and let it parachute back down to Kerbin, the terminal velocity never drops below 8 m/s.\n\nIt never stabilises entirely, but it\u0027s in the region of 8.5 m/s. It\u0027s definitely higher than my prediction.\n\nI\u0027ve tried a couple of different tests and my calculations are never accurate. Oddly the mk1 pod I tested under a small parachute fell more slowly than I predicted, I guess its drag isn\u0027t negligible when compared to a small parachute.\n\nbut the Mk1-2 tests always touch down at a higher velocity than I predict.\n\nNot a big deal on Kerbin, where I can test things, but a big problem for my Duna and Laythe missions, potentially. If I get an error of 1 or 2 m/s for Kerbin, I might get a much higher error for descents in Duna\u0027s thinner atmosphere.\n\nSo, er, anyone know what I\u0027ve missed?\n\nThanks\n\n**Edited \u003Ctime datetime=\u00222015-08-13T23:30:01Z\u0022 title=\u002208/13/2015 11:30  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 13, 2015\u003C/time\u003E by Free Trader Beowulf**"},{"CreatedByName":"rofltehcat","CreatedById":145224,"CreatedDateTime":"2015-08-12T22:03:09Z","Content":"How do you get the data using the \u0022drag cube\u0022? Maybe take a look in the .cfg files of the parts. They have many different drag modifiers but I don\u0027t really know how to use them in calculations. \n\nmk16 XL:\n\nstowedDrag = 0.22\n\nsemiDeployedDrag = 1\n\nfullyDeployedDrag = 500\n\n...\n\nname = ModuleDragModifier\n\ndragCubeName = DEPLOYED\n\ndragModifier = 25"},{"CreatedByName":"Free Trader Beowulf","CreatedById":62689,"CreatedDateTime":"2015-08-12T23:21:17Z","Content":"\u003E \n\u003E How do you get the data using the \u0022drag cube\u0022? Maybe take a look in the .cfg files of the parts. They have many different drag modifiers but I don\u0027t really know how to use them in calculations. \n\u003E mk16 XL:\n\u003E \n\u003E stowedDrag = 0.22\n\u003E \n\u003E semiDeployedDrag = 1\n\u003E \n\u003E fullyDeployedDrag = 500\n\u003E \n\u003E ...\n\u003E \n\u003E name = ModuleDragModifier\n\u003E \n\u003E dragCubeName = DEPLOYED\n\u003E \n\u003E dragModifier = 25\n\nThe drag cube data is in physics.cfg - they look like this:\n\nPART\n\n{\n\n url = Squad/Parts/Utility/parachuteMk16-XL/parachuteMk16-XL/parachuteLarge\n\n DRAG\\_CUBE\n\n {\n\n cube = PACKED, \n\n0.6278962,0.6383756,0.7139156, \n\n0.6278962,0.6383814,0.7139156, \n\n1.108058,0.7323978,0.6995487, \n\n1.108058,0.9454046,0.1663975, \n\n0.6278962,0.639505,0.7139157, \n\n0.6278962,0.6373008,0.7139157, \n\n0,0.2645478,0, \n\n1.233453,0.6659461,1.233453\n\n cube = SEMIDEPLOYED, \n\n16.39305,0.5255063,1.822568, \n\n16.39305,0.5255054,1.822568, \n\n9.336478,0.1339835,18.06131, \n\n9.336478,0.1646374,18.50363, \n\n16.39305,0.5256646,1.822569, \n\n16.39305,0.5253168,1.822569, \n\n0,9.230829,-1.072884E-06, \n\n3.459486,18.59851,3.459489\n\n cube = DEPLOYED, \n\n53.47527,18.69657,6.152891, \n\n53.47527,18.69662,6.152891, \n\n114.9405,12.06728,18.4375, \n\n114.9405,11.60791,18.7325, \n\n53.47527,18.71372,6.152892, \n\n53.47527,18.67829,6.152892, \n\n0,9.2347,-9.536743E-07, \n\n12.15423,18.60625,12.15423\n\n }\n\n}\n\nBuried in all that is the data I quoted. Piecing it together from previous discussions of aerodynamics, it seems the drag cube consists of six sets of three values, plus some other stuff. One set is for each face, with the three values being area, drag coefficient and \u0022depth\u0022.\n\nI just can\u0027t quite close the loop to turn that into an accurate prediction of terminal velocity.\n\nIt also seems that the drag cubes are generated automatically by KSP.\n\nI think the values you\u0027ve listed are left over from previous versions of KSP, certainly I used to use them and they used to work well, but I don\u0027t think they are current anymore."},{"CreatedByName":"FancyMouse","CreatedById":142946,"CreatedDateTime":"2015-08-12T23:35:33Z","Content":"My guess is, the pod below the chute may occlude some area of the chute, causing your drag to be overestimated (hence a higher terminal velocity than expected). Can you try to make the chute farther from the pod bottom (like pod-girder-chute) and does that make the number closer to your computation?"},{"CreatedByName":"Free Trader Beowulf","CreatedById":62689,"CreatedDateTime":"2015-08-13T23:28:20Z","Content":"\u003E \n\u003E My guess is, the pod below the chute may occlude some area of the chute, causing your drag to be overestimated (hence a higher terminal velocity than expected). Can you try to make the chute farther from the pod bottom (like pod-girder-chute) and does that make the number closer to your computation?\n\nI did some more science and it looks like your guess is right. \n\nI launched a 3 man pod with two radial parachutes and two girders sticking out on either side. \n\nIf the parachutes were on the ends of the girders, it fell at the predicted 7.7 m/s. In that position they were clear of each other and only partially overlapped the pod.\n\nIf they were on the pod terminal velocity was 9 m/s.\n\nSo the pod is occluding the parachutes, and they might be occluding each other.\n\nSo my calculation isn\u0027t too far wrong - I could even calculate the correct value for a simple pod under a single parachute, maybe, as I know the drag cubes for the pods.\n\nBut even without doing that, I know that I need to spread parachutes out, try to mount them where they won\u0027t be occluded by their payload and my predictions shouldn\u0027t be too far off.\n\nNice one, FancyMouse."}]}