{"TopicId":118435,"ForumId":16,"TopicTitle":"Orbital Survey Scanner drastically different results from Surface Scanner","CreatedByName":"I_Killed_Jeb","CreatedById":84817,"CreatedDateTime":"2015-08-14T03:37:51Z","PageNum":1,"Articles":[{"CreatedByName":"I_Killed_Jeb","CreatedById":84817,"CreatedDateTime":"2015-08-14T03:37:51Z","Content":"Hey all, trying my hand at mining for the first time. To get my juices flowing I decided to test things out on the Mun. I threw up a polar orbit satellite with the regular scanner on-board, and found a couple 70% candidate sites. I landed a small lander in each with the surface scanner, and both show ores of \u003C5%!! And when I go back to the overlay they no longer show the high concentration. =( Is this common? Is the orbital scanner worthless without a narrow band?"},{"CreatedByName":"Ripper2900","CreatedById":146418,"CreatedDateTime":"2015-08-14T05:59:49Z","Content":"The survey scan pretty much says only \\*where\\* there\u0027s ore, and where there\u0027s more ore then other places. Exactly how much, you can\u0027t tell. \n\nThe percentages are only relative, although I\u0027m not really sure what they are relative to... \n\nThe actual ore concentrations can\u0027t be determined without a narrow band scan."},{"CreatedByName":"DeMatt","CreatedById":90539,"CreatedDateTime":"2015-08-14T06:07:22Z","Content":"As I understand it:\n\n- The M700 Survey Scanner only gives you a rough idea of the ore at a spot. It gives a percentage based on the maximum ore for the planet - so 5% ore on a 5%-maximum planet would show up at any filter level, while 5% on a 15%-maximum would show up at 30% filter or below.\n- The Surface Scanning Module is necessary to sample the ground, and when it does, it reveals the exact ore concentration for the entire biome. You can only read this information with the Surface Module or...\n- The M4435 Narrow-Band Scanner does no scanning of its own. It merely provides a convenient way to review the results from the Survey and Surface scanners."},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2015-08-15T04:15:39Z","Content":"A few things are worth keeping in mind about the stock overlay.\n\n- The overlay isn\u0027t very useful; it tells you if ore is present or not, but doesn\u0027t really help in finding a good spot beyond that.\n- Biome surface scans don\u0027t make much of a difference in how accurate the overlay is.\n- For some reason, the horizontal line and blob overlays use a lower quality map than the dot overlay; the difference can be significant.\n- As DeMatt said, the cutoff percentage isn\u0027t the same as the actual ore concentration, it\u0027s a percentage of the maximum ore concentration on that planet (which I think comes from the resource config file).\n\nFortunately, someone made what I think is a better version which can be found a few lines down."},{"CreatedByName":"Glaran K\u0026#039;erman","CreatedById":146334,"CreatedDateTime":"2015-08-15T04:35:17Z","Content":"Use DMagic\u0027s SCANsat.....Oh! Didn\u0027t see you there DMagic!"},{"CreatedByName":"I_Killed_Jeb","CreatedById":84817,"CreatedDateTime":"2015-08-16T01:08:15Z","Content":"\u003E \n\u003E As I understand it:\n\u003E - The M700 Survey Scanner only gives you a rough idea of the ore at a spot. It gives a percentage based on the maximum ore for the planet - so 5% ore on a 5%-maximum planet would show up at any filter level, while 5% on a 15%-maximum would show up at 30% filter or below.\n\u003E - The Surface Scanning Module is necessary to sample the ground, and when it does, it reveals the exact ore concentration for the entire biome. You can only read this information with the Surface Module or...\n\u003E - The M4435 Narrow-Band Scanner does no scanning of its own. It merely provides a convenient way to review the results from the Survey and Surface scanners.\n\nThe weird thing is that it was 70% filter on 3.6% body (Mun), and the surface scanner reads as 5%. Relatively, that\u0027s over 100% so that seems wrong."},{"CreatedByName":"FancyMouse","CreatedById":142946,"CreatedDateTime":"2015-08-16T01:13:11Z","Content":"3.6% is average, while the (implied) max seems 5%/70% ~= 7.1%. Not saying it must be the case, but nothing inconsistent to me."},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2015-08-16T02:29:12Z","Content":"\u003E \n\u003E The weird thing is that it was 70% filter on 3.6% body (Mun), and the surface scanner reads as 5%. Relatively, that\u0027s over 100% so that seems wrong.\n\nThe max values for all of the planets from the configs is 15%. I\u0027m not entirely sure if that\u0027s the value used by the cutoff, but the average value definitely isn\u0027t."},{"CreatedByName":"I_Killed_Jeb","CreatedById":84817,"CreatedDateTime":"2015-08-16T02:39:54Z","Content":"\u003E \n\u003E 3.6% is average, while the (implied) max seems 5%/70% ~= 7.1%. Not saying it must be the case, but nothing inconsistent to me.\n\nThen why does the map filter post surface scan no longer show that biome as 70%, but rather at 5%?\n\n\u003E \n\u003E The max values for all of the planets from the configs is 15%. I\u0027m not entirely sure if that\u0027s the value used by the cutoff, but the average value definitely isn\u0027t.\n\nYea there\u0027s clearly some funny business here...\n\n**Edited \u003Ctime datetime=\u00222015-08-16T02:42:19Z\u0022 title=\u002208/16/2015 02:42  AM\u0022 data-short=\u00228 yr\u0022\u003EAugust 16, 2015\u003C/time\u003E by I\\_Killed\\_Jeb**"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2015-08-16T02:58:34Z","Content":"Maybe you should add some screenshots, it could clear things up.\n\nAs far as I know the cutoff just takes anything below (cutoff% \\* maxAbundance%) and sets it to 0. Whether that max value is directly from the config, or is taken by looking through the save-specific value for each biome of that planet, I\u0027m not sure. So the map overlay will show only values above the cutoff. \n\nThe problem here is that the map overlay is not accurate. It uses interpolation to fill in most of the map, you can see or change these settings in one of the config files in the Squad/Resources folder. Only a handful of locations are actually checked for their resource abundance. This means that what you see on the map overlay may not reflect the actual resource abundance at all. This can be easily seen on Kerbin; all of Kerbin\u0027s ocean have their ore abundance forced to 0%, which can easily be confirmed with the narrow-band scanner or from the surface. But the map overlay can show a lot of ore present even fairly far away from the shore or isolated islands, this is worse with the line or blob maps."},{"CreatedByName":"I_Killed_Jeb","CreatedById":84817,"CreatedDateTime":"2015-08-16T22:02:14Z","Content":"Here you go -\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/cCLwO)\n\nPre-landing, the Twin Craters biome lights up under the 70% filter.\n\nLanded, the surface scan reveals a 6.13% concentration\n\nNow, back in map view, the filter no longer lights up the biome under the same settings!"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2015-08-17T00:06:09Z","Content":"The pictures clear things up. \n\nWhat\u0027s happening is that before scanning the biome the overlay just takes the average ore concentration for that biome, which seems to be above whatever 70% of the max value is.\n\nAfter scanning the biome, the overlay calculates the exact ore concentration for a certain point, which is apparently below the cutoff.\n\nThe problem arises because of the interpolation I was talking about before. Actually calculating the resource value for each position on the planet would be prohibitively slow. So the overlay makes a texture, calculates resource values for certain pixels, then interpolates in between. So the pixel within the crater that is being used for the resource calculation is below the cutoff, but it only appears this way after scanning the surface, because the average value for that biome is above the cutoff. \n\nYou can actually see the interpolation at work if you look carefully. Close to the center of the blob in the crater there is a slightly brighter spot. That is the actual location that the overlay is using to calculate the resource abundance. So at that exact location (which might be very difficult to land at, each pixel on the global map represents probably several kilometers) the concentration is below the cutoff, and nothing appears at all in the crater.\n\nYou can try editing the MapResolution and InterpolationLevel fields in the GameData/Squad/Resources/Overlay.cfg file (the current overlay type you have on is listed as SOLID, the others being LINES and DOTS) . Reducing the interpolation level and/or increasing the map resolution (use 512 or 1024) will probably allow you to see resources on the overlay in the crater. It will also probably be slower to generate, causing a bit of a hiccup when you push the overlay button."},{"CreatedByName":"AaronLS","CreatedById":142846,"CreatedDateTime":"2015-08-17T05:44:56Z","Content":"\u003E \n\u003E The problem here is that the map overlay is not accurate. It uses interpolation to fill in most of the map, you can see or change these settings in one of the config files in the Squad/Resources folder. Only a handful of locations are actually checked for their resource abundance. This means that what you see on the map overlay may not reflect the actual resource abundance at all. This can be easily seen on Kerbin; all of Kerbin\u0027s ocean have their ore abundance forced to 0%, which can easily be confirmed with the narrow-band scanner or from the surface. But the map overlay can show a lot of ore present even fairly far away from the shore or isolated islands, this is worse with the line or blob maps.\n\nYep, and inaccuracies get worse closer to poles due to pinching effects in the way it\u0027s interpolated."},{"CreatedByName":"Ripper2900","CreatedById":146418,"CreatedDateTime":"2015-08-17T06:32:05Z","Content":"This thread answers a lot of my unknowns, one thing though: does the overlay in fact improve (visually) after a surface- or narrow-band scan."}]}