{"TopicId":118434,"ForumId":69,"TopicTitle":"Asteroids mined instantly","CreatedByName":"fireblade274","CreatedById":134571,"CreatedDateTime":"2015-08-14T03:04:54Z","PageNum":1,"Articles":[{"CreatedByName":"fireblade274","CreatedById":134571,"CreatedDateTime":"2015-08-14T03:04:54Z","Content":"\n\u003Cp\u003EThere is another thread about this here \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/119989-Ore-resources-instantly-disappearing?highlight=asteroid\u002Bmined\u002Binstantly\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/119989-Ore-resources-instantly-disappearing?highlight=asteroid\u002Bmined\u002Binstantly\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt is in the Modded section, and although I have Claws stock bug fixes and Kerbal Engineer, everything else is stock, and I feel this should also be in the un-modded section as I have a feeling mods are not the issue with it. I don\u0027t even attach the parts you get with Kerbal Engineer to my vessels. \u003C/p\u003E\u003Cp\u003EI first noticed this while trying to move a Class C to Gilly with a ship that I hadn\u0027t used in awhile and was floating around space. It was docked with a module that gave the ship more fuel, so it was put together in two parts in space previously. Once I got to the asteroid, lowered my drill, and clicked \u0022harvest\u0022, everything was mined and it almost completely filled my ore tanks (see post in thread hyperlink above). I was still able to get to Pol and got lots of money:).\u003C/p\u003E\u003Cp\u003EMy next mission (Class C to Eve) I did the same thing but with a slightly improved ship, and this time did not dock it with anything in space to make it larger; I used the same craft from launch till I drilled, and this time it mined the asteroid correctly and did not take everything away instantly. I got more money:).\u003C/p\u003E\u003Cp\u003ESO I thought maybe it was a fluke and decided to take up my first ever Class E mission. I decided to use the SAME craft my previous mission since it still had fuel, so I brought it from Gilly to the Class E I had chosen. I got to it, lowered the drill, clicked harvest, and all 1400 tons are instantly vanished, yet mockingly filled 1500 ore in my tank. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_angry.gif\u0022 alt=\u0022:mad:\u0022\u003E\u003C/p\u003E\u003Cp\u003ENOT COOL. So I think that this is triggered when you attempt to drill using a craft that you previously where attached to an asteroid with (\u002Bdid trips with it?), or maybe when you dock your ore mining ship with another ship before mining an asteroid. Could someone else test this out? If anyone wants my craft file/save file let me know and I\u0027ll drop box it here; I just restarted my game to see if that will fix it; I quick saved before harvesting just in case.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-14T03:07:44Z\u0022 title=\u002208/14/2015 03:07  AM\u0022 data-short=\u00228 yr\u0022\u003EAugust 14, 2015\u003C/time\u003E by fireblade274\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"fireblade274","CreatedById":134571,"CreatedDateTime":"2015-08-14T03:37:26Z","Content":"\n\u003Cp\u003EAlright so restarting the game worked!! Happy \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis is a thing however\u003C/p\u003E\n"}]}