{"TopicId":118520,"ForumId":16,"TopicTitle":"what does \u0026quot;science part return\u0026quot; mean?","CreatedByName":"fommil","CreatedById":112495,"CreatedDateTime":"2015-08-15T12:50:06Z","PageNum":1,"Articles":[{"CreatedByName":"fommil","CreatedById":112495,"CreatedDateTime":"2015-08-15T12:50:06Z","Content":"\n\u003Cp\u003EHi all,\u003C/p\u003E\u003Cp\u003EI\u0027ve read this (outdated) description of science points\u003C/p\u003E\u003Cp\u003E \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/62657-Understanding-Science-Points\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/62657-Understanding-Science-Points\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Eand the description of the Scientist\u003C/p\u003E\u003Cp\u003E \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Scientist\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.kerbalspaceprogram.com/wiki/Scientist\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Ebut neither explains what is meant by the description beside Bob Kerbal at the start of the game \u0022Science Part Return: 100%\u0022.\u003C/p\u003E\u003Cp\u003EDoes that mean Bob gives a bonus of doubling (i.e. \u002B100%) of the science return from science experiments? Or is this redundant (100% being no change) or will it increase with experience?\u003C/p\u003E\n"},{"CreatedByName":"Caelib","CreatedById":59329,"CreatedDateTime":"2015-08-15T12:56:37Z","Content":"\n\u003Cp\u003EIt is the multiplier. So if science part gives 20 points and his bonus is 100%, you will get 20 points. When Bob (or any scientist) is level 1, this value is 100% ... but each level, this value increases so it does help quite a bit in the long run to use scientists and level them up.\u003C/p\u003E\n"},{"CreatedByName":"fommil","CreatedById":112495,"CreatedDateTime":"2015-08-15T13:07:16Z","Content":"\n\u003Cp\u003Eawesome, that\u0027s what I\u0027d hoped. It would be good if the wiki had this documented, if somebody knows the rules and career progression there\u0027s an ideal opportunity to update the docs here :-)\u003C/p\u003E\n"},{"CreatedByName":"Nich","CreatedById":145678,"CreatedDateTime":"2015-08-15T13:32:15Z","Content":"\n\u003Cp\u003EI have never seen it work like this. The only thing I have seen is science jrs and goo pods return about 20% more science first time and less science the second time.\u003C/p\u003E\n"},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2015-08-15T15:15:17Z","Content":"\n\u003Cp\u003E^ The Science value will decrease for repeated experiments.\u003C/p\u003E\u003Cp\u003EIf, however, you were to run a test by recovering a ship with a goo unit and a Level 1 Scientist, and then revert the mission and redo it with a Level 2 Scientist, you\u0027d see an increase in the Science gained relative to the other mission. Presumably, repeated experiments will also include a bonus, although it will naturally shrink as the Science value decays.\u003C/p\u003E\n"}]}