{"TopicId":118613,"ForumId":16,"TopicTitle":"Long burn to orbit","CreatedByName":"Scarredclown","CreatedById":110611,"CreatedDateTime":"2015-08-16T15:45:35Z","PageNum":1,"Articles":[{"CreatedByName":"Scarredclown","CreatedById":110611,"CreatedDateTime":"2015-08-16T15:45:35Z","Content":"\n\u003Cp\u003EI manage to climb my rocket at about 80 k, and when i made my maneuver node to orbit, i always get a 47 seconds burn... i would like to shorten that. What can i do ? Its not a big rocket.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-08-16T15:49:37Z","Content":"\n\u003Cp\u003E47 seconds to circularise isn\u0027t bad, but if you want quicker pack more thrust. Of course that means your upper stage will be heavier so you then need a bigger lower stage for it.\u003C/p\u003E\n"},{"CreatedByName":"Scarredclown","CreatedById":110611,"CreatedDateTime":"2015-08-16T16:49:12Z","Content":"\n\u003Cp\u003EI\u0027m always short by a few seconds... and none left for reentry., if i add mor tank, heavier rocket...less altitude... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"ForScience6686","CreatedById":144187,"CreatedDateTime":"2015-08-16T17:13:05Z","Content":"\n\u003Cp\u003EI would look at your accent profile to see if you can do it more efficiently before adding anything. Try and gain more horizontal speed over altitude. I try and keep my ap at orbital insertion closer to 70-75k. I also use my main lifter stage to almost complete the orbit leaving as much as possible for space adventures, while also dropping the main stage out of orbit.\u003C/p\u003E\n"},{"CreatedByName":"Fearless Son","CreatedById":133397,"CreatedDateTime":"2015-08-16T17:48:52Z","Content":"\n\u003Cp\u003EYeah, what ForScience said, ascent profile has a lot to do with it. How are you launching these days? I know it took me a while before I got the hang of the new atmospheric modeling. \u003C/p\u003E\u003Cp\u003EFor my part, once I launch I immediately start a very slight gravity turn, tapping to the side just enough get the prograde vector to incline a few degrees. Then I set the SAS to point straight prograde. After that, the rocket (assuming it is well balanced) should turn itself into a full gravity turns with a nice, gradual incline. When I start to see a shockwave of air start forming over the bow of the rocket, I throttle down; no sense fighting atmospheric friction. When the inclination of the prograde vector gets to about 45 degrees from the vertical, I switch the SAS back from prograde-fixed to general stability support and let it power up at that fixed angle. Then I watch the map, and wait until the apex of the trajectory is above fifty kilometers above the surface, then incline my rocket perpendicular to the surface and continue to thrust that way. It builds horizontal velocity and continues to raise the apex until it is at above seventy kilometers. Then cut the engines, drop a maneuver node at the apex, and wait to do a prograde burn. \u003C/p\u003E\u003Cp\u003EUsually I have maybe a twenty to forty second burn, depending on my thrust-to-weight ratio.\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2015-08-16T18:41:53Z","Content":"\n\u003Cp\u003EThe rate at which you can pitch-over through the gravity turn is fairly constant (bear with me) and so is the dV needed to get to orbit. Your ascent path is therefore primarily dictated by a vehicle\u0027s TWR:\u003C/p\u003E\u003Cp\u003E1. With low TWR (1.1 - 1.3, say) you climb relatively slowly, can be pitched-over almost to the horizon quite low and will put a lot of thrust into building horizontal speed at the same time as building Ap. By the time you, eventually, get to Ap this leaves little extra speed required for circularistation, and a short burn. The trick is, of course, not to get too horizontal too soon and waste too much time in thick, draggy atmosphere.\u003C/p\u003E\u003Cp\u003E2. With hight TWR (1.8\u002B) you will climb quickly, with little time to pitch-over without flipping completely. Your Ap is therefore developed early, but you\u0027re left having to build a large amount of horizontal velocity and a big circularisation burn. The trick is, not to \u0022go straight up and turn right\u0022.\u003C/p\u003E\u003Cp\u003ESomewhere between the two is the optimal gravity turn for any particular vehicle. Significant proportions of this forum, other KSP information and the time we all spend, is dedicated to trying to find it. Rocket science ^^.\u003C/p\u003E\n"},{"CreatedByName":"ForScience6686","CreatedById":144187,"CreatedDateTime":"2015-08-16T19:11:32Z","Content":"\n\u003Cp\u003EMy current ascent is not quite the best, but heres the basis:\u003C/p\u003E\u003Cp\u003E- immediately upon launch tilt over 10 degrees, line up with 90 Markand set to prograde\u003C/p\u003E\u003Cp\u003E- hands off until approx 30-35, ap usually around 50k, adjust aoa to horizon or lower depending on twr.\u003C/p\u003E\u003Cp\u003E- end burn once ap reaches 75k. Burn at apex to complete orbit.\u003C/p\u003E\u003Cp\u003EThis is not the most efficient, but easy to fly and I almost always pack excessive dv in main stage. I also primarily use srb to get my rocket up before using engines as the efficiency improves quite rapidly with altitude.\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-08-16T20:23:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Scarredclown\u0022 data-cite=\u0022Scarredclown\u0022\u003E\u003Cdiv\u003EI\u0027m always short by a few seconds... and none left for reentry., if i add mor tank, heavier rocket...less altitude... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt sounds like the basic problem is that your rocket doesn\u0027t really have enough dV. Yes, as the other posters have said, ascent profile can make a big difference too (i.e. a suboptimal ascent profile can eat up more dV than it has to). However, in my experience, as long as the rocket \u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cem\u003Edesign\u003C/em\u003E\u003C/span\u003E is reasonable, there\u0027s plenty of dV to reach Kerbin orbit with lots to spare-- ascent profile doesn\u0027t make a huge difference unless you\u0027re doing something egregious.\u003C/p\u003E\u003Cp\u003ECan you describe what your rocket is like? In particular, how many stages do you have? And for each stage,\u003C/p\u003E\u003Cp\u003E1. what\u0027s the starting mass\u003C/p\u003E\u003Cp\u003E2. how much fuel mass for that stage\u003C/p\u003E\u003Cp\u003E3. what sort of engine(s) on that stage\u003C/p\u003E\u003Cp\u003EKSP packs plenty of challenges, but the most fundamental one is \u0022how do I get lots of dV on the rocket\u0022. There are lots of ways to cause problems (e.g. poor aerodynamics, poor ascent profile, etc.), but if I had to guess based on the comment above, it may just be a simple issue of your rocket design. Specifically, making sure that you have the appropriate amount of fuel and thrust at each stage.\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-08-16T20:36:34Z","Content":"\n\u003Cp\u003EI design all of my lifters the same, so they tend to follow the same flight profile.\u003C/p\u003E\u003Cp\u003E Stage 1 has 1.4G acceleration off the pad and 1,800 m/sec DV computed with 50% atmospheric Isp\u003C/p\u003E\u003Cp\u003E Stage 2 has .5G acceleration and 1,800 m/sec DV computed with vacuum Isp.\u003C/p\u003E\u003Cp\u003EI launch vertically to 100 m/sec, then kick 10Ã‚Â° prograde and follow the marker. Acceleration is held to 2sin(pitch). \u003C/p\u003E\u003Cp\u003E This gives me a uniform launch profile regardless of the size/ composition of the rocket.\u003C/p\u003E\u003Cp\u003EUsually when I\u0027ve established my apoapsis I have less than 100 m/sec to full circularization. If I\u0027m doing another stage from there, I\u0027ll kick off the second stage while periapsis is still in atmosphere (so as not to leave debris) and use the next stage to circularize.\u003C/p\u003E\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2015-08-16T21:33:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Scarredclown\u0022 data-cite=\u0022Scarredclown\u0022\u003E\u003Cdiv\u003EI manage to climb my rocket at about 80 k, and when i made my maneuver node to orbit, i always get a 47 seconds burn... i would like to shorten that. What can i do ? Its not a big rocket.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECommon reasons why this is so:\u003C/p\u003E\u003Cp\u003Ea) you\u0027re ascending too steeply. At first you been going mostly up, then you have a lengthy burn to get you going sideways. You may want to experiment with tipping your rocket earlier or more quickly.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E too much thrust too early. Your rocket accelerates so quickly that by the time you cross the 10km mark, you\u0027ve already got enough momentum to take you out of the atmosphere. This also amounts to ascending too steeply.\u003C/p\u003E\u003Cp\u003EExercise: try to build a rocket that will go to space without any control input except staging. Use the rotate tool to launch at an angle and then let nature have it\u0027s way. This is easier than it sounds, at least if you don\u0027t insist on a circular orbit (which requires a lot of rinse-repeat finetuning). This silly exercise will take you an hour or less and teach you a lot that will come in handy in ordinary gameplay.\u003C/p\u003E\n"},{"CreatedByName":"Reactordrone","CreatedById":110060,"CreatedDateTime":"2015-08-17T03:32:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ForScience6686\u0022 data-cite=\u0022ForScience6686\u0022\u003E\u003Cdiv\u003EMy current ascent is not quite the best, but heres the basis:\u003Cp\u003E- immediately upon launch tilt over 10 degrees, line up with 90 Markand set to prograde\u003C/p\u003E\u003Cp\u003E- hands off until approx 30-35, ap usually around 50k, adjust aoa to horizon or lower depending on twr.\u003C/p\u003E\u003Cp\u003E- end burn once ap reaches 75k. Burn at apex to complete orbit.\u003C/p\u003E\u003Cp\u003EThis is not the most efficient, but easy to fly and I almost always pack excessive dv in main stage. I also primarily use srb to get my rocket up before using engines as the efficiency improves quite rapidly with altitude.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou probably want to be horizontal at around 30-35km rather than waiting for 50km.\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2015-08-17T08:21:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Reactordrone\u0022 data-cite=\u0022Reactordrone\u0022\u003E\u003Cdiv\u003EYou probably want to be horizontal at around 30-35km rather than waiting for 50km.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EReally? With my rockets, if I go horizontal that early I spend ages inside the atmosphere, and generally the only way I get my apoapsis above 70km is if I accelerate to orbital velocity as low as 55-60 km and get an apoapsis halfway around the planet, which usually decays to atmospheric drag by the time I get there.\u003C/p\u003E\u003Cp\u003EI\u0027ve made it a habit to always remain pointed 5Ã‚Â° above the horizon until my AP approaches the edge of the atmosphere, so I keep my vertical speed up. I still only need 100-200 m/s to circularize in the end, so I\u0027m fairly satisfied with that approach. (Can\u0027t really comment on total dV costs because my latest savegame used a system rescale mod.)\u003C/p\u003E\n"},{"CreatedByName":"ajburges","CreatedById":26570,"CreatedDateTime":"2015-08-17T18:43:54Z","Content":"\n\u003Cp\u003EOnce my Ap hits 50 km I ease off the throttle. Drag is negligable that high (at most -12 m/s dV) so you can really drag out your gravity turn to really minimize gravity and/or cosine losses. Most my craft need 20-40 dV circularization burns. If you need a long circularization burn, you either are short on TWR or you need to revisit your ascent profile.\u003C/p\u003E\n"},{"CreatedByName":"Fearless Son","CreatedById":133397,"CreatedDateTime":"2015-08-17T20:00:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Reactordrone\u0022 data-cite=\u0022Reactordrone\u0022\u003E\u003Cdiv\u003EYou probably want to be horizontal at around 30-35km rather than waiting for 50km.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn my case, my \u003Cem\u003Erocket\u003C/em\u003E is usually horizontal at around 30-35km, but that is also the point at which my \u003Cem\u003Eapoapsis\u003C/em\u003E is around 50km.\u003C/p\u003E\n"},{"CreatedByName":"ForScience6686","CreatedById":144187,"CreatedDateTime":"2015-08-17T21:49:45Z","Content":"\n\u003Cp\u003EPlease re read the post. Ap is at 50k not vessel. And I would not recommend horizontal flight with an ap of 30-35, you won\u0027t be going to space today, well not very efficiently at least. Can\u0027t say never in this game, someone will take it as a challenge.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-17T21:56:28Z\u0022 title=\u002208/17/2015 09:56  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 17, 2015\u003C/time\u003E by ForScience6686\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Stoney3K","CreatedById":139954,"CreatedDateTime":"2015-08-17T22:22:47Z","Content":"\n\u003Cp\u003EWhen in the lower atmosphere, I try to keep my time until apoapsis between 60 and 90 seconds. Any more and it means you\u0027re getting way ahead of your Ap which could be miles out leading to a steep ascent, and any less means you don\u0027t have enough time to set up your orbital insertion burn. Too early means I need to accelerate, and having my Ap too late means I can back off the throttle and save fuel.\u003C/p\u003E\u003Cp\u003EI usuallty keep my TWR at around 1,5 and back off the throttle if it gets a lot higher, and start my turn at about 5km or 100m/s. Under 15km, try to keep your speed below 200m/s to avoid flipping, further up, it\u0027s easier to punch through Mach 1 and turn over further.\u003C/p\u003E\n"},{"CreatedByName":"almagnus1","CreatedById":78068,"CreatedDateTime":"2015-08-17T23:33:03Z","Content":"\n\u003Cp\u003EOne thing that hasn\u0027t been mentioned yet is trying to burn half the maneuver before the node, and half after it - you don\u0027t want to start your burn when you hit the node, but want the node time to occur in about the middle of the burn.\u003C/p\u003E\u003Cp\u003EAlternatively, you can burn at half power and then your start time is equal to the predicted maneuver time, but the burn takes twice as long.\u003C/p\u003E\n"}]}