{"TopicId":118664,"ForumId":44,"TopicTitle":"How much (if any) crewed spaceflight should there be?","CreatedByName":"UmbralRaptor","CreatedById":2767,"CreatedDateTime":"2015-08-17T03:42:00Z","PageNum":3,"Articles":[{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2015-08-17T20:16:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Camacha\u0022 data-cite=\u0022Camacha\u0022\u003E\u003Cdiv\u003EIs that not the point? You have to start out somewhere to get to the good bits. If you never start out, you never get there.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPlease show me where I said that we shouldn\u0027t start out? To be clear, my issue isn\u0027t whether we should start out or not. My issue is with people\u0027s (what I consider to be) unreasonable expectations. Almost nobody wants to live in places like Nanasivik even though we\u0027ve had the technology to do so for thousands of years... What makes people think that living in an orders of magnitude less hospitable place like Mars would be any more appealing (once the initial \u0022gee whiz\u0022 factor wears off).\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2015-08-17T20:29:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PakledHostage\u0022 data-cite=\u0022PakledHostage\u0022\u003E\u003Cdiv\u003EMy issue is with people\u0027s (what I consider to be) unreasonable expectations. Almost nobody wants to live in places like Nanasivik even though we\u0027ve had the technology to do so for thousands of years... What makes people think that living in an orders of magnitude less hospitable place like Mars would be any more appealing (once the initial \u0022gee whiz\u0022 factor wears off).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI expect that living in space is more interesting than just ferrying to another planet. Every planet is different, making it hard to adapt, while space is mostly the same everywhere. Living there is needed for any real type of journey anyway. We might even become proper space people, since bodies tend to adapt to things they deal with for long stretches of time. That is obviously a very long and slow process, though modern science might help it along.\u003C/p\u003E\u003Cp\u003EIt is true, it is a long path, though compared to where we came from, cultivating fire and agriculture, learning to wield language and electrons, it is not even \u003Cem\u003Ethat\u003C/em\u003E far.\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2015-08-17T21:01:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kryten\u0022 data-cite=\u0022Kryten\u0022\u003E\u003Cdiv\u003EOnly Asia has crewed spaceflight capability, if we\u0027re arbitrarily dividing by continent. Europe, South America and Oceania have never had it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHas \u003Cem\u003Eever\u003C/em\u003E had it. Stupid of us to kill Shuttle without a replacement already operable.\u003C/p\u003E\u003Cp\u003EIn the context of the \u0022all eggs in one basket\u0022 conversation, the ability to make habitats in extremely harsh environments is the real issue, which the US/Russia, China, and parts of the EU are totally capable of doing.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Camacha\u0022 data-cite=\u0022Camacha\u0022\u003E\u003Cdiv\u003ECalm down, everyone, the tone of this conversation is needlessly fierce. Let us have fun \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve been liberally sprinkling in the \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E for just this reason \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PakledHostage\u0022 data-cite=\u0022PakledHostage\u0022\u003E\u003Cdiv\u003EPlease show me where I said that we shouldn\u0027t start out? To be clear, my issue isn\u0027t whether we should start out or not. My issue is with people\u0027s (what I consider to be) unreasonable expectations. Almost nobody wants to live in places like Nanasivik even though we\u0027ve had the technology to do so for thousands of years... What makes people think that living in an orders of magnitude less hospitable place like Mars would be any more appealing (once the initial \u0022gee whiz\u0022 factor wears off).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EVery true.\u003C/p\u003E\u003Cp\u003EMan in space is a cool thing for purely \u0022gut\u0022 reasons to me, honestly. Like I said, robots \u0026gt; humans for any non-circular scientific research (circular, meaning the study of people in space, which only matters in order to put people in space). There is something inspiring about people walking on other words, though.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2015-08-17T21:07:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tater\u0022 data-cite=\u0022tater\u0022\u003E\u003Cdiv\u003EIn the context of the \u0022all eggs in one basket\u0022 conversation, the ability to make habitats in extremely harsh environments is the real issue, which the US/Russia, China, and parts of the EU are totally capable of doing.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, if you want to protect something, you have a couple of strategies. Basically, those are copying, hardening or maintaining. Maintaining will do little good in a catastrophic scenario. Both copying and hardening are viable strategies, but will alone only go so far. You cannot build a super ultra mega safe vault, there is always something that will crack it. Just look at nuclear plants that are supposed to be everything-proof, but still fail every now and then. Just copying leaves lots of soft targets, so it looks like we will have to employ a combination of the two.\u003C/p\u003E\n"},{"CreatedByName":"Randazzo","CreatedById":136468,"CreatedDateTime":"2015-08-17T21:16:14Z","Content":"\n\u003Cp\u003EProbably been pointed out sufficiently, but there really is no point to manned space exploration. Even travel within our own Solar system takes significant amounts of time. Assuming something on the short end of ~150 days to reach Mars, that\u0027s a minimum of almost a year in space, and that\u0027s only if they got there and turned right back around. \u003C/p\u003E\u003Cp\u003EHaving an active crew in tiny confined spaces for that long, in SPACE, would be exceedingly dangerous. Aside from the potential mechanical failures of the craft, the crew itself would likely be the component most at risk for critical failure of some sort. The closest comparison would be submarine crews, but they can surface in cases of extreme emergency. Granted, the more people there are on that crew and the more diverse it is, the less psychologically taxing it would be, but then you\u0027ve got life support issues arising.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2015-08-17T21:19:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Randazzo\u0022 data-cite=\u0022Randazzo\u0022\u003E\u003Cdiv\u003EProbably been pointed out sufficiently, but there really is no point to manned space exploration.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think the point was that there is. Not in the pure scientific data kind of way, but it seems there is rather more to it.\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2015-08-17T21:24:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tater\u0022 data-cite=\u0022tater\u0022\u003E\u003Cdiv\u003EHas \u003Cem\u003Eever\u003C/em\u003E had it. Stupid of us to kill Shuttle without a replacement already operable.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E The shuttle replacement flew in 2002. Shuttle was supposed to primarily be as a heavy launch vehicle, just one that happened to be crewed; EELV filled that role handily. Most of the functions shuttle served as a crewed vehicle (exposure experiments, hosted payloads, microgravity experiments with Spacehab) were taken over by the ISS itself, which again was obviously ready well before the shuttle retirement.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2015-08-17T21:30:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kryten\u0022 data-cite=\u0022Kryten\u0022\u003E\u003Cdiv\u003EThe shuttle replacement flew in 2002. Shuttle was supposed to primarily be as a heavy launch vehicle, just one that happened to be crewed; EELV filled that role handily. Most of the functions shuttle served as a crewed vehicle (exposure experiments, hosted payloads, microgravity experiments with Spacehab) were taken over by the ISS itself, which again was obviously ready well before the shuttle retirement.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo crew launch capacity is or was ready, so no full replacement is or was operable.\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2015-08-17T21:36:16Z","Content":"\n\u003Cp\u003EBut the \u0027crew launch capacity\u0027 you\u0027re trying to get isn\u0027t the reusable space lab capability shuttle did have, it\u0027s the space station ferry capability it never did.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2015-08-17T21:45:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kryten\u0022 data-cite=\u0022Kryten\u0022\u003E\u003Cdiv\u003EBut the \u0027crew launch capacity\u0027 you\u0027re trying to get isn\u0027t the reusable space lab capability shuttle did have, it\u0027s the space station ferry capability it never did.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think you explained rather well why that is not needed: the Space Shuttle was its own space station. Ferry and station all in one.\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2015-08-17T22:17:16Z","Content":"\n\u003Cp\u003EYou won\u0027t see me defending Shuttle here, lol. I merely meant the raw ability at any moment to put humans into orbit. If we HAD to, at short notice, the US could certainly do so, with no less risk than Gemini flights (we have some flight-article hardware that could be mated to a rocket). The current certification is aimed at incredible reliability. CST-100, et al are another thread, though.\u003C/p\u003E\u003Cp\u003EMy point was that colonization is a legitimate goal as a safeguard against a planetary catastrophe (really talking planet-killer asteroids here). That scenario has mitigation (deflecting the threat) as one possibility, and having a sustainable colony out of the Earth-Moon system as another (any huge body hitting either would result in a lot of dangerous ejecta into space). Both are entirely legitimate, long-term goals, and in the grand scheme of human expenditure, not impossible (orbital stations like O\u0027Neil colonies might make more sense, dunno).\u003C/p\u003E\u003Cp\u003ERemember, I\u0027m a robot guy when it comes to science, it\u0027s better, period. No exceptions. \u003C/p\u003E\u003Cp\u003EManned flight is like climbing mountains with the sole exception of colonization, I agree. Still, as the costs show, spaceflight is cheap. The NYC school system spends about as much money as all the space programs on earth, \u003Cem\u003Ecombined\u003C/em\u003E. My little school system probably spends as much \u003Cem\u003Eon school lunches\u003C/em\u003E as France contributes to ESA (around 700 M USD). I really don\u0027t have a problem spending a few billion on what are in effect stunts (manned flight). Even just as an international pissing-match. Beats fighting each other \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-17T22:19:25Z\u0022 title=\u002208/17/2015 10:19  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 17, 2015\u003C/time\u003E by tater\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2015-08-17T22:28:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tater\u0022 data-cite=\u0022tater\u0022\u003E\u003Cdiv\u003ERemember, I\u0027m a robot guy when it comes to science, it\u0027s better, period. No exceptions.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHumans can build robots, robots do not build humans. Robots might build robots, but that is a long way off, and another thread.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EJust an observation, by the way. Not sure what I mean to say with that.\u003C/span\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-17T22:31:16Z\u0022 title=\u002208/17/2015 10:31  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 17, 2015\u003C/time\u003E by Camacha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2015-08-18T00:39:44Z","Content":"\n\u003Cp\u003EHehe, remember to welcome your robot masters!\u003C/p\u003E\u003Cp\u003EI suppose for certain missions (until intelligent systems are better) that humans nearby might have a place. For example in martian orbit, controlling rovers in real time (vs the more difficult landing of humans on Mars). Pretty limited improvement, except that the human researchers also have time limits, so faster data collection is of benefit if you are a PI on a probe (lobby for probe for 10 years,get money, build and launch in another 10 years, transit X years, take data for Y years, reduce data for Z years, die.).\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2015-08-18T02:22:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EThe only justification for sending humans into space is to study how to send humans into space, which is circular reasoning.\u003Cp\u003EAny other rational goal, such as science or exploration, can be done much more efficiently through telepresence. And the irrational goals, such as \u0022inspiration\u0022 or \u0022prestige\u0022 are just excuses for a certain entertainment value for a minority of geeks.\u003C/p\u003E\u003Cp\u003EI love the inspiration and the prestige just as much as everyone here, but I struggle to find a justification for the cost and risk of it all. I really wish we could.\u003C/p\u003E\u003Cp\u003EThe Hubble servicing missions were justified by the fact that it was designed to be serviced by the Shuttle. Another circular justification. The high cost of Hubble was mostly due to the extra complexity of designing it to be serviceable in space. If they had made Hubble non-serviceable, it would have been much cheaper to just launch a few new ones instead of fixing it.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s not fair. There are lots of things in which having a brain attached to a pair of hands gives faster innovation. The hubble was the best most advanced and productive science mission ever, so I really don\u0027t see a comparator for you to justify your logic. The Hubble would have been dead before it started had it not been jury-rigged during its optics \u0027upgrade\u0027. The telescope has been upgraded several times and this has given it a much longer life, can you imagine how long it would take to get funding for a new launch of a new telescope for every piddly upgrade. Shuttle program expensive, people died, but it was still worth and it showed a committment to space and science. This contract/soviet minimalist ISS supply and crew rotation is cheepy attitude toward space science.\u003C/p\u003E\u003Cp\u003EThe first thing people will start asking when the Hubbles batteries die is why we could not come up with another repair/upgrade mission. You guys are going to miss it when its gone.\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2015-08-18T02:29:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PB666\u0022 data-cite=\u0022PB666\u0022\u003E\u003Cdiv\u003EThat\u0027s not fair. There are lots of things in which having a brain attached to a pair of hands gives faster innovation. The hubble was the best most advanced and productive science mission ever, so I really don\u0027t see a comparator for you to justify your logic. The Hubble would have been dead before it started had it not been jury-rigged during its optics \u0027upgrade\u0027. The telescope has been upgraded several times and this has given it a much longer life, can you imagine how long it would take to get funding for a new launch of a new telescope for every piddly upgrade. Shuttle program expensive, people died, but it was still worth and it showed a committment to space and science. This contract/soviet minimalist ISS supply and crew rotation is cheepy attitude toward space science.\u003Cp\u003EThe first thing people will start asking when the Hubbles batteries die is why we could not come up with another repair/upgrade mission. You guys are going to miss it when its gone.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey could have launched a replacement with an expendable. Without the excessive costs of Shuttle, they\u0027d have had money to burn on replacement telescopes. If we were not wasting billions on the Senate Launch System, we could simply throw a new telescope up there.\u003C/p\u003E\u003Cp\u003ERobots are always better at doing real science in space, with the exception of experiments involving actual people---which \u003Cem\u003Eonly\u003C/em\u003E need to be done to see how people can deal with space.\u003C/p\u003E\u003Cp\u003EISS was a largely jobs program to keep post CCCP russian rocket guys from contracting themselves out to countries that dearly want ballistic missiles.\u003C/p\u003E\u003Cp\u003EI\u0027m for manned flight, but I never try and pretend it\u0027s for science, probes are vastly more cost effective, which means \u0022better\u0022 since budgets are limited.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2015-08-18T08:16:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheSaint\u0022 data-cite=\u0022TheSaint\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI think that eventually, as technology progresses, population pressure will push the issue even harder and you\u0027ll start to see terraforming lead the way to a major emigration to Mars. Some people just want to be free, no matter what the cost. And as this planet becomes more and more crowded, there will be less and less opportunity for that here. So they will go somewhere else. And, as has been demonstrated many times in the past, these people don\u0027t care if the place they are going to is life-threateningly dangerous.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat makes you think that living in space is freedom? If anything, you spend the rest of your life stuck inside a tin can, hoping that the thin wall that keeps you alive doesn\u0027t corrode or get punctured. The problem with the planet getting crowded won\u0027t be solved by sending a few thousand people into space. In fact, consuming the ressources to accelerate all those people from 0 to 26000km/h will only make things worse.\u003C/p\u003E\u003Cp\u003EAnd no, people don\u0027t typically migrate to places that are life-threateningly dangerous. A minority of people like to explore extreme places because of the thrill that it gives them, but that\u0027s a minority, and it\u0027s usually for short visits. Most humans only usually migrate to places that are likely to provide safety, comfort, wealth, and a better life for their children. Space is none of that.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jwenting\u0022 data-cite=\u0022jwenting\u0022\u003E\u003Cdiv\u003Eso you claim that we should just sit back and wait for the ELE to wipe us out? Just like the dinosaurs did...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EProbably not, but if we detected an ELE (which isn\u0027t very likely because the Earth has pretty much cleared its orbit and we have a pretty good count of the biggest asteroids in the solar system), there are much easier ways of dealing with it than to colonize other planets. The most likely today would probably be to brace for the impact. In the future, we might be able to deflect it.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003Emankind is curious, we\u0027re explorers. Space is among the last places left to explore. That alone is enough reason to go there.\u003C/p\u003E\u003Cp\u003EThe moment we lose that curiosity we\u0027re dead as a species, will have lost the will to live and will decline into obscurity and eventual extinction.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGeneralizing a certain trait to all mankind is a bit of a leap. Some cultures admire explorers, adventurers and thrill seekers. Others not so much. It\u0027s more of a cultural trait than a universal trend. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EExpanding to other planets, eventually other stars, building permanent settlements in space, is the only way for mankind to survive, to not atrophy and go the way of the dinosaurs and dodos, becoming extinct from either an external event or internal lack of a will to survive (which is already hitting Europe and north America, as well as parts of Asia, all of which see a negative population growth when not taking immigration from developing nations into account).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENegative population growth is pretty much the only way for us to survive at this point. It\u0027s much more that crossing our fingers and hoping that someone invents an interstellar warp drive soon.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tater\u0022 data-cite=\u0022tater\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAssuming the remaining people happen to be the ones capable of spacefaring and doing this. If we do not figure out how to build such habitats, then the probability of building them \u003Cem\u003Eafter\u003C/em\u003E a planetary apocalypse is zero. If the only continent to survive is Africa, for example. Game over. This is as circular as your first statement.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDerogatory remarks about Africa notwithstanding, colonizing the solar system \u003Cem\u003Ein advance\u003C/em\u003E with the motivation of preserving the human genome from an asteroid impact on Earth would take decades of preparation, whatever the country that initiates it. If that is your motivation, and you are willing to spend resources to prepare for such an event, then it\u0027s much easier to just build and maintain underground vaults\u003Cem\u003E in advance\u003C/em\u003E or to design a deflection strategy\u003Cem\u003E in advance\u003C/em\u003E. Both strategies would save orders of magnitude more lives than a colony on Mars.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThis is simply nonsense at multiple levels, even if strictly speaking true ( \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E ). Your own life doesn\u0027t matter in the grand scheme, either, why not just end it?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBecause as an individual, I enjoy being alive. That\u0027s a good enough reason I think.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PB666\u0022 data-cite=\u0022PB666\u0022\u003E\u003Cdiv\u003EThat\u0027s not fair. There are lots of things in which having a brain attached to a pair of hands gives faster innovation. The hubble was the best most advanced and productive science mission ever, so I really don\u0027t see a comparator for you to justify your logic. The Hubble would have been dead before it started had it not been jury-rigged during its optics \u0027upgrade\u0027. The telescope has been upgraded several times and this has given it a much longer life, can you imagine how long it would take to get funding for a new launch of a new telescope for every piddly upgrade. Shuttle program expensive, people died, but it was still worth and it showed a committment to space and science. This contract/soviet minimalist ISS supply and crew rotation is cheepy attitude toward space science.\u003Cp\u003EThe first thing people will start asking when the Hubbles batteries die is why we could not come up with another repair/upgrade mission. You guys are going to miss it when its gone.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHubble was worth repairing because it was super-expensive. It was super-expensive because it was designed to be repairable. It was designed to be repairable because NASA needed to give the Shuttle something to do. \u003C/p\u003E\u003Cp\u003EThe whole program proved one thing: it would have been safer, cheaper, and more efficient, to launch a series of redundant disposable telescopes on EELVs. Which is basically what the NRO did with their own version of Hubble (KH-11).\u003C/p\u003E\n"},{"CreatedByName":"Aanker","CreatedById":70274,"CreatedDateTime":"2015-08-18T08:47:43Z","Content":"\n\u003Cp\u003EAgain, discussing the scientifically calculated drawbacks of putting humans somewhere is a convenient detraction from the whole point of putting humans somewhere. It\u0027s an emotionally motivated wish to explore and accomplish great things in person or through someone else. We\u0027re not robots and shouldn\u0027t attempt to reason as such, besides, being a robot is boring.\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2015-08-18T12:23:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tater\u0022 data-cite=\u0022tater\u0022\u003E\u003Cdiv\u003EThey could have launched a replacement with an expendable. Without the excessive costs of Shuttle, they\u0027d have had money to burn on replacement telescopes. If we were not wasting billions on the Senate Launch System, we could simply throw a new telescope up there.\u003Cp\u003ERobots are always better at doing real science in space, with the exception of experiments involving actual people---which \u003Cem\u003Eonly\u003C/em\u003E need to be done to see how people can deal with space.\u003C/p\u003E\u003Cp\u003EISS was a largely jobs program to keep post CCCP russian rocket guys from contracting themselves out to countries that dearly want ballistic missiles.\u003C/p\u003E\u003Cp\u003EI\u0027m for manned flight, but I never try and pretend it\u0027s for science, probes are vastly more cost effective, which means \u0022better\u0022 since budgets are limited.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECould\u0027ve would\u0027ve should\u0027ve, but what country has launched another hubble like telescope. NASA is not alone, there\u0027s ESA.\u003C/p\u003E\u003Cp\u003EOur planet hunter telescope lost attitude control (2 of 4) after a couple years of life, another scope lost it helium. If these had be part of an advanced shuttle mission we could have dispatched the shuttle and repaired them and returned. I hear all the arm-chair rocket experts thinking that a deep space robotics program is the equivalent to a near space science and astronomy program. They are not, these are apples and oranges. Yes, the robotics are great, but geeze if we had a manned geological lab on mars just think about what else could be accomplished (and I am not a proponent of a mars mission because of the risk). But in the cases we can utilize manned space flight, definitely we should take advantage of its benefits.\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2015-08-18T12:59:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PB666\u0022 data-cite=\u0022PB666\u0022\u003E\u003Cdiv\u003EYes, the robotics are great, but geeze if we had a manned geological lab on mars just think about what else could be accomplished (and I am not a proponent of a mars mission because of the risk). But in the cases we can utilize manned space flight, definitely we should take advantage of its benefits.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat benefits? They are relative. For the cost (on the order of 100 billion USD) of your manned geology lab on Mars where we would learn about some Mars rocks, we could send robotic missions to learn about every major planet and moon in the Solar System (including about Mars rocks). Robotic missions drive technological progress and pump the aerospace economy just as much as manned missions do, and the scientific ROI of past robotic missions has been nothing short of spectacular.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2015-08-18T13:01:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PB666\u0022 data-cite=\u0022PB666\u0022\u003E\u003Cdiv\u003ECould\u0027ve would\u0027ve should\u0027ve, but what country has launched another hubble like telescope. NASA is not alone, there\u0027s ESA.\u003Cp\u003EOur planet hunter telescope lost attitude control (2 of 4) after a couple years of life, another scope lost it helium. If these had be part of an advanced shuttle mission we could have dispatched the shuttle and repaired them and returned.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, not unless those satellites were designed with docking rings, hand rails, removable covers, secure edges, safing systems, replaceable parts, and so on. All of that adds to the complexity, weight, and cost of the satellite. \u003C/p\u003E\u003Cp\u003EIn addition, the satellite also needs to be put in an orbit that is accessible to a manned vehicle, but might not be optimal for the mission. HST would have provided better results if it was at a Lagrange point like most other astronomy satellites, but they had to compromise by putting it in LEO so that the Shuttle could reach it.\u003C/p\u003E\u003Cp\u003EIn addition to the cost of the launch, a servicing mission requires that you actually design, build and test those replaceable parts, that you charter and plan a mission, immobilizing expensive astronauts for months of training, and risking their lives on EVA, using manned spaceflight resources that could be used for more valuable tasks than swapping a stupid component.\u003C/p\u003E\u003Cp\u003EHubble cost around $2 billion. Each of its 5 servicing missions cost around $1 billion. For the cost of the whole program, you could have launched at least 4 non serviceable HSTs.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E I hear all the arm-chair rocket experts thinking that a deep space robotics program is the equivalent to a near space science and astronomy program. They are not, these are apples and oranges. Yes, the robotics are great, but geeze if we had a manned geological lab on mars just think about what else could be accomplished (and I am not a proponent of a mars mission because of the risk). But in the cases we can utilize manned space flight, definitely we should take advantage of its benefits.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGive us one single experiment that a manned geology lab could perform that could not be done automatically by a robotic science mission.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-18T13:05:47Z\u0022 title=\u002208/18/2015 01:05  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 18, 2015\u003C/time\u003E by Nibb31\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2015-08-18T13:28:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EWhat makes you think that living in space is freedom? If anything, you spend the rest of your life stuck inside a tin can, hoping that the thin wall that keeps you alive doesn\u0027t corrode or get punctured. The problem with the planet getting crowded won\u0027t be solved by sending a few thousand people into space. In fact, consuming the ressources to accelerate all those people from 0 to 26000km/h will only make things worse.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo one is pretending sending people away will do anything to mitigate crowding directly. 200.000 to 300.000 people are added each day, so even if you manage to build huge ships and send those away every single day, you solve nothing. Colonies are not about population reduction or culling.\u003C/p\u003E\u003Cp\u003EThough one might imagine more indirect benefits. What if Mars might become a production planet, or even that the blank slate inspires people to redo their own home? I am not advocating either of these suggestions, but it does give food for thought, as plenty more could be imagined.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EGive us one single experiment that a manned geology lab could perform that could not be done automatically by a robotic science mission.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt cannot tell is what it is like to set food on another planet, which is pretty much the point which has been made a couple of times now. Spirit and Opportunity have camera\u0027s at human eye level for this reason, and Curiosity has roughly the same.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-18T13:33:19Z\u0022 title=\u002208/18/2015 01:33  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 18, 2015\u003C/time\u003E by Camacha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2015-08-18T13:35:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EHubble was worth repairing because it was super-expensive. It was super-expensive because it was designed to be repairable. It was designed to be repairable because NASA needed to give the Shuttle something to do. \u003Cp\u003EThe whole program proved one thing: it would have been safer, cheaper, and more efficient, to launch a series of redundant disposable telescopes on EELVs. Which is basically what the NRO did with their own version of Hubble (KH-11).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMore fluff, the KH-11 cost 3.16 billion dollars, points down less than 100km and does a small fraction of what the hubble does in terms of its spectronomy. The whole point of the failed mirror was it was a prototype mirror that was designed to look into the deepest of space (14 billion light years), not in some politicians bedroom window. \u003C/p\u003E\u003Cp\u003EIn addition to this, the fact that hubble is continually operating, it has actually increased the need for manned science, because everytime it finds something unique you have ground telescopes point themselves and the combined power of the hubble and ground telescopes that have really given us some detailed spectrographic information about alot of stuff that happened very long ago and very far away. The unrepairable telescopes have given us alot of down time.\u003C/p\u003E\u003Cp\u003EI would actually like to see a manned observatory at L2, complete with a hexagon reflector array 10s of meter across in which the whole assembly was built in space, initially manually focused with electronic, and with a small crew of scientist and technicians that are capable of constantly upgrading the optics. Based on the science we are seeing and the level of red-shifting I think it would be really cool to give high resolution data from each part of the spectrum. \u003C/p\u003E\u003Cp\u003EEverything in this world can be replaced by robots except 3 things, the scientist that discover new robotic technologies, the engineers that build the prototypes, and the technicians that perfect the first prototype (and of course the partens of these three individuals). In a manned science program you replace the robots with the three people who could have made them, and put their hands and brains to work on solving the problem at hand and not solving the problem that solves the problem at hand. When you want to characterize the universe to every last star in the visible field, you can have robots build hubbles and launch them into space. When you want to go out and test to see if something might exist, or probe really new questions and you have repeats of different questions to be asked every time, then you really want the human hand involved. If you have an observatory station and a shuttle program and you want to look at something in a new way, then the next delivery mission you include the newest detector, filter, whatever. If you want a one time rocket to do the same, then you are 5 to 10 years away from having your equipment go up, and if its a russian, ESA or SpaceX rocket, good chance you loose the payload. Only once ever did shuttle lose its payload before it could be launched. Imagine if hubble had been on a SpaceX rocket.\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2015-08-18T14:07:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EDerogatory remarks about Africa notwithstanding, colonizing the solar system \u003Cem\u003Ein advance\u003C/em\u003E with the motivation of preserving the human genome from an asteroid impact on Earth would take decades of preparation, whatever the country that initiates it. If that is your motivation, and you are willing to spend resources to prepare for such an event, then it\u0027s much easier to just build and maintain underground vaults\u003Cem\u003E in advance\u003C/em\u003E or to design a deflection strategy\u003Cem\u003E in advance\u003C/em\u003E. Both strategies would save orders of magnitude more lives than a colony on Mars.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERead what I said. Africa doesn\u0027t have a space program, there are no countries capable of that right now there. I could have said South America just as well, Brazil only has sounding rockets I think. It was about continents with space programs, I\u0027m fine with being derogatory towards places without space programs, it shows a level of development.\u003C/p\u003E\u003Cp\u003EBuilding bunkers for a contingency that might never happen is not nearly as interesting as building similar structures for actual habitation somewhere else, and likely even harder to secure funding for (no flash). I\u0027m willing to spend resources on space exploration (100% robots for science, people are a detriment to that---as much as I enjoyed my lunar geology prof\u0027s slideshows of him on the moon). I\u0027m willing to spend on manned exploration, too, \u003Cem\u003Ejust because I enjoy it\u003C/em\u003E. I\u0027d rather spend on that than many, perhaps most, other government programs.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EBecause as an individual, I enjoy being alive. That\u0027s a good enough reason I think.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is the answer anyone would give. As would anyone working towards manned space travel---they enjoy working on that. Which is good enough reason.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EHubble was worth repairing because it was super-expensive. It was super-expensive because it was designed to be repairable. It was designed to be repairable because NASA needed to give the Shuttle something to do. \u003Cp\u003EThe whole program proved one thing: it would have been safer, cheaper, and more efficient, to launch a series of redundant disposable telescopes on EELVs. Which is basically what the NRO did with their own version of Hubble (KH-11).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAll 100% true. \u003C/p\u003E\u003Cp\u003EAnyone who trots out Hubble repair needs to find all such missions, then divide the entire cost of the Shuttle program by those few missions, and add that to the cost of the science. 2-3 Hubble repairs? That adds many billions to the cost of the HST, they could have launched several of them for less as disposables.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2015-08-18T14:11:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tater\u0022 data-cite=\u0022tater\u0022\u003E\u003Cdiv\u003EThis is the answer anyone would give. As would anyone working towards manned space travel---they enjoy working on that. Which is good enough reason.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs a species, we want to be alive. As a species, we have always been curious and inquisitive. Those are two reasons that are every bit as good as the personal reason of wanting to be alive (or rather better, I would argue).\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EHubble was worth repairing because it was super-expensive. It was super-expensive because it was designed to be repairable. It was designed to be repairable because NASA needed to give the Shuttle something to do. \u003Cp\u003EThe whole program proved one thing: it would have been safer, cheaper, and more efficient, to launch a series of redundant disposable telescopes on EELVs. Which is basically what the NRO did with their own version of Hubble (KH-11).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe billion dollar question is: would four Hubble telescopes have been funded in lieu of one much more expensive one? I am pretty sure I can give you the answer: no. One cheaper one would have been funded, maybe two, and those would have been defunct a long time ago, with a lower total science yield.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-18T14:13:39Z\u0022 title=\u002208/18/2015 02:13  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 18, 2015\u003C/time\u003E by Camacha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2015-08-18T14:27:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PB666\u0022 data-cite=\u0022PB666\u0022\u003E\u003Cdiv\u003EMore fluff, the KH-11 cost 3.16 billion dollars, points down less than 100km and does a small fraction of what the hubble does in terms of its spectronomy. The whole point of the failed mirror was it was a prototype mirror that was designed to look into the deepest of space (14 billion light years), not in some politicians bedroom window. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAdding a spectrometer is not a big deal, as is changing the geometry (in terms of cost).\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EIn addition to this, the fact that hubble is continually operating, it has actually increased the need for manned science, because everytime it finds something unique you have ground telescopes point themselves and the combined power of the hubble and ground telescopes that have really given us some detailed spectrographic information about alot of stuff that happened very long ago and very far away. The unrepairable telescopes have given us alot of down time.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWe\u0027d have more of them.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI would actually like to see a manned observatory at L2, complete with a hexagon reflector array 10s of meter across in which the whole assembly was built in space, initially manually focused with electronic, and with a small crew of scientist and technicians that are capable of constantly upgrading the optics. Based on the science we are seeing and the level of red-shifting I think it would be really cool to give high resolution data from each part of the spectrum. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is just kooky.\u003C/p\u003E\u003Cp\u003EManned? PIs don\u0027t even need to go to \u003Cem\u003Eearthbound\u003C/em\u003E observatories anymore. You can do a run from your desk. Back in the day, we\u0027d go down to the VLA all the time from Albuquerque since the best radio astronomers were doing runs there all the time, and they\u0027d have colloquia there. We\u0027d pile in the prof\u0027s cars, and drive down. The VLA has a lunchroom, and even what amounts to a built-in \u0022motel\u0022 for visiting astronomers. Rarely gets used anymore, as no one needs to actually come to NM to do a run.\u003C/p\u003E\u003Cp\u003EWhy would you possibly add to the expense of a telescope by adding PEOPLE to it in space? Aside from that, for optical astronomy, adding people would ruin it, as the vibration alone would kill you (anyone moving, \u003Cem\u003Eat all\u003C/em\u003E, would defeat part of the reason for putting a telescope in space in the first place).\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EEverything in this world can be replaced by robots except 3 things, the scientist that discover new robotic technologies, the engineers that build the prototypes, and the technicians that perfect the first prototype (and of course the partens of these three individuals). In a manned science program you replace the robots with the three people who could have made them, and put their hands and brains to work on solving the problem at hand and not solving the problem that solves the problem at hand. When you want to characterize the universe to every last star in the visible field, you can have robots build hubbles and launch them into space. When you want to go out and test to see if something might exist, or probe really new questions and you have repeats of different questions to be asked every time, then you really want the human hand involved. If you have an observatory station and a shuttle program and you want to look at something in a new way, then the next delivery mission you include the newest detector, filter, whatever. If you want a one time rocket to do the same, then you are 5 to 10 years away from having your equipment go up, and if its a russian, ESA or SpaceX rocket, good chance you loose the payload. Only once ever did shuttle lose its payload before it could be launched. Imagine if hubble had been on a SpaceX rocket.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is all untrue on multiple levels, soon even the first 3 people you mention, into the bargain, sadly.\u003C/p\u003E\u003Cp\u003ENASA has lost plenty of payloads. As a result, they improved reliability over time with the contractors who made vehicles that flew many missions. SpaceX or any other contractor will get to the same place with enough launches. NASA doesn\u0027t actually make stuff, they buy stuff.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Camacha\u0022 data-cite=\u0022Camacha\u0022\u003E\u003Cdiv\u003EThe billion dollar question is: would four Hubble telescopes have been funded in lieu of one much more expensive one? I am pretty sure I can give you the answer: no. One cheaper one would have been funded, maybe two, and those would have been defunct a long time ago, with a lower total science yield.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is pretty circular. Shuttle has a bloated budget, and NASA, stuck with it, looks for stuff for it to do and spends tons on HST. Eliminate the bloated Shuttle requirement, and no HST. Sure.\u003C/p\u003E\u003Cp\u003EBut a rational policy, assuming the mission was \u0022science,\u0022 and not \u0022the manned program that Congress wants because it is spread in the right districts\u0022 then they\u0027d have the same ~17-18 B$ (constant 2015 dollars) to spend on whatever they actually wanted. You\u0027d get good instruments.\u003C/p\u003E\u003Cp\u003EGovernment spending has never been, and will never be rational, however. Public money is ALWAYS spent politically in a democracy, by definition.\u003C/p\u003E\n"}]}