{"TopicId":118807,"ForumId":16,"TopicTitle":"redirecting class E asteroid","CreatedByName":"Cannon","CreatedById":109645,"CreatedDateTime":"2015-08-19T01:41:32Z","PageNum":1,"Articles":[{"CreatedByName":"Cannon","CreatedById":109645,"CreatedDateTime":"2015-08-19T01:41:32Z","Content":"\n\u003Cp\u003Ei have to redirect class e and dock it on my orbital station (which is at 120km height).\u003C/p\u003E\u003Cp\u003Eit\u0027s nearly impossible to control the giant asteroid but my station is huge too, what should i do?\u003C/p\u003E\u003Cp\u003Eplease help, what\u0027s the best and easiest way to do this?\u003C/p\u003E\n"},{"CreatedByName":"AlanP","CreatedById":148656,"CreatedDateTime":"2015-08-19T03:31:20Z","Content":"\n\u003Cp\u003EEasy does not come into it! I did an ejection from the solar system on a class D.\u003C/p\u003E\u003Cp\u003EUse a lot of SAS but turn it off for burns. Use a Rhino engine, unless you like really long burns(they\u0027ll still be long but better). \u003C/p\u003E\u003Cp\u003Esetup a drilling and refinery operation on the asteroid to fuel it. You need to watch it though, as your drills will deplete the ore of the asteroid even when the tanks are filled(I made this mistake)\u003C/p\u003E\u003Cp\u003Emake sure you claw and ship are aligned with the center of mass. make orientation changes far in advance of your burn( they take time to do. You could use vernor engine for changes too(more powerful rcs). I haven\u0027t done this, but you could try undocking the clap and re positioning the ship for direction changes and redock from that direction.\u003C/p\u003E\u003Cp\u003EMy other question is why are 120k? I would be easier to circularize the asteroid at what ever height it is at and bring the station to it or build the station on it.\u003C/p\u003E\u003Cp\u003EHope any of this helped. Good Luck.\u003C/p\u003E\n"},{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-08-19T05:01:48Z","Content":"\n\u003Cp\u003EFirst bring the asteroid into a roughly similar orbit. For class E you either need a lot of patience or the \u003Ca href=\u0022http://kerbalx.com/sharpy/Claymore-Asteroid-Wrangler\u0022 rel=\u0022external nofollow\u0022\u003Eright craft\u003C/a\u003E. Even then it\u0027s a plenty of careful work.\u003C/p\u003E\u003Cp\u003EThen the docking. The station may be big, but is still several orders smaller than the asteroid, and it has the RCS (if it doesn\u0027\u0027t, add it!). It\u0027s best to assemble the station from pieces on the surface of the asteroid, but if you can\u0027t, you\u0027re still better off driving the station carefully.\u003C/p\u003E\u003Cp\u003EFor AlanP: Sure it would be easier to bring the station to a higher orbit but if it\u0027s to be a fuel station, it should be just a short hop from LKO so that you wouldn\u0027t need to launch extra fuel to reach the station.\u003C/p\u003E\n"},{"CreatedByName":"AmpsterMan","CreatedById":32671,"CreatedDateTime":"2015-08-19T05:20:15Z","Content":"\n\u003Cp\u003EI\u0027m having a similar issue, but with a more modest payload. Class C. Do you guys recommend trying to get it to aerobrake? I cheated (infinite fuel) my first time just to get the feel, and my probe and the rock exploded.\u003C/p\u003E\u003Cp\u003ECheers\u003C/p\u003E\n"},{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-08-19T05:27:50Z","Content":"\n\u003Cp\u003EAerobraking the asteroids nowadays is a terrible chore. They are quite aerodynamic and quite heavy and they overheat. The one Class E I tried to aerobrake through 42km periapsis (IIRC), lost a whooping 1.3m/s in its braking pass (out of some 3200). \u003C/p\u003E\u003Cp\u003EAlthough with class C \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/130404-Airbrakes-on-an-asteroid\u0022 rel=\u0022external nofollow\u0022\u003Eairbrakes\u003C/a\u003E could be much more efficient than with class E (they improved the above result by a whole 0.7m/s!).\u003C/p\u003E\n"},{"CreatedByName":"Cannon","CreatedById":109645,"CreatedDateTime":"2015-08-19T17:14:56Z","Content":"\n\u003Cp\u003Ealright this is how it looks right now:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.igreklik.com/slike/\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/ihdyD2S.png\u0022 alt=\u0022ihdyD2S.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Eand this is my rocket:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.igreklik.com/slike/\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/8eS190Q.png\u0022 alt=\u00228eS190Q.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Ewhat do i do?\u003C/p\u003E\n"},{"CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-08-19T17:28:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cannon\u0022 data-cite=\u0022Cannon\u0022\u003E\u003Cdiv\u003Ewhat do i do?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFrankly, I would get a new rocket \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E It is MUCh easier to pull than push. Here\u0027s mine:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Yp6kB5P.png\u0022 alt=\u0022Yp6kB5P.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThat\u0027s the Kranefly, adjusting the orbit of a Class-E for future use as an LKO station mount. Key design elements are:\u003C/p\u003E\u003Cp\u003E--nuclear motors for high dV\u003C/p\u003E\u003Cp\u003E--lots of liquid fuel storage. Over 14,000 units LF on this ship, and still the max dV towing a class E is about 300 m/s.\u003C/p\u003E\u003Cp\u003E--radiators to get rid of the heat from said motors\u003C/p\u003E\u003Cp\u003E--motors placed far, far away from the asteroid so that thrust does not impinge\u003C/p\u003E\u003Cp\u003E--sufficient RCS to maneuver around the asteroid\u003C/p\u003E\u003Cp\u003E--lots of solar for drilling and refining\u003C/p\u003E\u003Cp\u003EWhen I want to pull the rock somewhere, I orient the ship for the maneuver node, fly it around the asteroid until it\u0027s targeting asteroid COM and aimed at the node, back up and capture, then \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Eset the Klaw to \u0022Free Pivot\u0022\u003C/span\u003E and thrust.\u003C/p\u003E\u003Cp\u003EDoing this is NOT easy. Good luck!\u003C/p\u003E\n"},{"CreatedByName":"Hotblack Desiato","CreatedById":93895,"CreatedDateTime":"2015-08-19T20:28:44Z","Content":"\n\u003Cp\u003Ehow about adding a drill (or several drills) and a highly skilled engineer?\u003C/p\u003E\u003Cp\u003Ethis way you can suck ore out of the asteroid, making it lighter AND giving you extra fuel.\u003C/p\u003E\u003Cp\u003EI\u0027m just not sure how much fuel a class E asteroid gives.\u003C/p\u003E\n"},{"CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-08-19T20:31:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Hotblack Desiato\u0022 data-cite=\u0022Hotblack Desiato\u0022\u003E\u003Cdiv\u003EI\u0027m just not sure how much fuel a class E asteroid gives.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey\u0027re pretty much made of fuel; typically ~90% of the mass is convertable to ore, and that ore can be converted to LFO on a 1:1 basis. So yeah, you can mine it and throw the fuel away and drag a much smaller rock where you want it--or try to preserve as much as possible for practical use later.\u003C/p\u003E\n"},{"CreatedByName":"pellinor","CreatedById":85299,"CreatedDateTime":"2015-08-19T20:52:59Z","Content":"\n\u003Cp\u003EMy most fuel-efficient solution is to \u003C/p\u003E\u003Cp\u003E* aerocapture into an orbit that crosses the mun\u0027s\u003C/p\u003E\u003Cp\u003E* gravity-assist my way into the desired inclination (may take multiple encounters)\u003C/p\u003E\u003Cp\u003E* aerobrake to the desired height\u003C/p\u003E\u003Cp\u003EI once pulled this off using around 100-150m/s of deltaV, most of which was needed to lift the periapsis out of the atmosphere at the end. Saves lots of fuel but you pay in playing time instead, tinkering with manouver nodes.\u003C/p\u003E\n"},{"CreatedByName":"Cannon","CreatedById":109645,"CreatedDateTime":"2015-08-19T21:38:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Hotblack Desiato\u0022 data-cite=\u0022Hotblack Desiato\u0022\u003E\u003Cdiv\u003Ehow about adding a drill (or several drills) and a highly skilled engineer?\u003Cp\u003Ethis way you can suck ore out of the asteroid, making it lighter AND giving you extra fuel.\u003C/p\u003E\u003Cp\u003EI\u0027m just not sure how much fuel a class E asteroid gives.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ethe thing is, i need it full, docked on my station so i can drill it from my station \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"AlanP","CreatedById":148656,"CreatedDateTime":"2015-08-21T00:36:39Z","Content":"\n\u003Cp\u003EYour best bet is to encounter the asteroid as much before Pe as possible, to give yourself as much time as possible to burn. you may want to capture a smaller asteroid to fuel the mission. Keep trying.\u003C/p\u003E\u003Cp\u003EI agree sharpy. At the time I didn\u0027t explicitly know his intent.\u003C/p\u003E\n"},{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-08-21T05:35:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cannon\u0022 data-cite=\u0022Cannon\u0022\u003E\u003Cdiv\u003Ethe thing is, i need it full, docked on my station so i can drill it from my station \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eif you burn half the ore contained to get it into LKO, you\u0027ll still have a plenty for refuelling other crafts. Just think: 1000m/s of delta-V applied to 2000t asteroid, being half the ore - converts to how much dV applied to 100t craft?\u003C/p\u003E\n"},{"CreatedByName":"Axelord FTW","CreatedById":1896,"CreatedDateTime":"2015-08-21T10:29:36Z","Content":"\n\u003Cp\u003EI\u0027ve done ONE such mission once and it was a real pain in the ass.\u003C/p\u003E\u003Cp\u003EThankfully, I already had an E class on an impact trajectory with kerbin (rather glancey too) so the amount of dv required to have the damn thing just pass through the upper atmosphere for aerocapture and aerobraking some more on two more passes (had to raise the AP a bit at the PE each time, minimal dv consumption).\u003C/p\u003E\u003Cp\u003EThough getting it to reach a specific station might be problematic. In my case, the orbit came in at a high angle. I would have transferred the station to the right plane (even at PE, the dv for plane change would have been prohibitive).\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003EIt was pretty neat to see the exact procedure I went through to get that mission done applied in the book to get Greg\u0027s Skeleton to meet with Izzy.\u003C/p\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-08-21T12:17:45Z","Content":"\n\u003Cp\u003EIf you capture the asteroid, leaving apoapsis quite high (beyond Minmus), the delta-V to change the plane is quite reasonable. And if it\u0027s to serve as fuel station before transfers, it \u003Cem\u003Eneeds\u003C/em\u003E to be in equatorial LKO or close to it.\u003C/p\u003E\n"}]}