{"TopicId":118989,"ForumId":44,"TopicTitle":"Will length of season vary depending on earth\u0026#039;s orbit?","CreatedByName":"heng","CreatedById":126869,"CreatedDateTime":"2015-08-21T13:43:53Z","PageNum":1,"Articles":[{"CreatedByName":"heng","CreatedById":126869,"CreatedDateTime":"2015-08-21T13:43:53Z","Content":"\n\u003Cp\u003Elazy-sun-burn-fueled lunchbreak discussion:\u003C/p\u003E\u003Cp\u003EAssume we are able to move the Earth further away from the sun, still in (more or less) circular orbit, to counter global warming.\u003C/p\u003E\u003Cp\u003EIgnore whether it would have the desired effect, ignore how it is done (lots of swing-by maneuvers, for example), ignore the turbulence effects on other planet\u0027s orbit.\u003C/p\u003E\u003Cp\u003EThe year will be longer. Clearly. \u003C/p\u003E\u003Cp\u003EQuestion:\u003C/p\u003E\u003Cp\u003EWill the seasons change in length or stay the same, instead move around on the calender?\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-08-21T13:49:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022heng\u0022 data-cite=\u0022heng\u0022\u003E\u003Cdiv\u003Elazy-sun-burn-fueled lunchbreak discussion:\u003Cp\u003EAssume we are able to move the Earth further away from the sun, still in (more or less) circular orbit, to counter global warming.\u003C/p\u003E\u003Cp\u003EIgnore whether it would have the desired effect, ignore how it is done (lots of swing-by maneuvers, for example), ignore the turbulence effects on other planet\u0027s orbit.\u003C/p\u003E\u003Cp\u003EThe year will be longer. Clearly. \u003C/p\u003E\u003Cp\u003EQuestion:\u003C/p\u003E\u003Cp\u003EWill the seasons change in length or stay the same, instead move around on the calender?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe \u0022seasons\u0022 will stay 1/4 of the year, so will grow as the year grows. Who knows if they\u0027ll resemble the seasons we have now but probably. Mars has visible Summer/Winter seasons, after all.\u003C/p\u003E\u003Cp\u003EThey\u0027ll still generally stay where they are. What we call \u0022Summer\u0022 in the Northern Hemisphere starts on the longest day of the year, and ends halfway down to the shortest day of the year. Winter is the same only it starts on the shortest and goes up to halfway to the longest. Lag in how the hemisphere heats and cools causes the hottest and coldest days to start after the longest and shortest days of the year, and that shouldn\u0027t change all that much within reason, especially if we\u0027re magically moving the Earth to cool it down.\u003C/p\u003E\u003Cp\u003EAnd yes, I\u0027m ignoring that it wouldn\u0027t work, we couldn\u0027t do it, and if we figured out a way to do this thing that wouldn\u0027t work, it\u0027d likely kill us \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"andrewas","CreatedById":24662,"CreatedDateTime":"2015-08-21T13:51:26Z","Content":"\n\u003Cp\u003EThe seasons are primarily caused by the Earth\u0027s tilt. Earth\u0027s orientation does not change throughout the year, only its position relative to the sun. On one side of the orbit, the north pole is tilted away from the sun. Six months later, the north pole is tilted towards the sun. The formed gives us northern winter, the latter gives us northern summer. \u003C/p\u003E\u003Cp\u003ESo, yes, the length of seasons will change with Earth\u0027s orbit.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2015-08-21T14:01:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022heng\u0022 data-cite=\u0022heng\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EWill the seasons change in length or stay the same, instead move around on the calender?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESeasons are not related to the Earth\u0027s orbit but to its tilt, which explains why the southern and northern hemisphere seasons are inverted.\u003C/p\u003E\u003Cp\u003EDistance from the sun has a much smaller effect than the angle at which solar rays hit the atmosphere.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-21T14:03:39Z\u0022 title=\u002208/21/2015 02:03  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 21, 2015\u003C/time\u003E by Nibb31\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"peadar1987","CreatedById":81207,"CreatedDateTime":"2015-08-21T14:08:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00225thHorseman\u0022 data-cite=\u00225thHorseman\u0022\u003E\u003Cdiv\u003EThe \u0022seasons\u0022 will stay 1/4 of the year, so will grow as the year grows. Who knows if they\u0027ll resemble the seasons we have now but probably. Mars has visible Summer/Winter seasons, after all.\u003Cp\u003EThey\u0027ll still generally stay where they are. What we call \u0022Summer\u0022 in the Northern Hemisphere starts on the longest day of the year, and ends halfway down to the shortest day of the year. Winter is the same only it starts on the shortest and goes up to halfway to the longest. Lag in how the hemisphere heats and cools causes the hottest and coldest days to start after the longest and shortest days of the year, and that shouldn\u0027t change all that much within reason, especially if we\u0027re magically moving the Earth to cool it down.\u003C/p\u003E\u003Cp\u003EAnd yes, I\u0027m ignoring that it wouldn\u0027t work, we couldn\u0027t do it, and if we figured out a way to do this thing that wouldn\u0027t work, it\u0027d likely kill us \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t know what part of the world you\u0027re from, but if winter doesn\u0027t start until the 21st of December, I think I might have to move there!\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-08-21T14:11:35Z","Content":"\n\u003Cp\u003EIf the orbit stays circular the seasons will still be quarters of the new, longer year.\u003C/p\u003E\u003Cp\u003EIf on the other hand the orbit is elliptical things get interesting. When the axial tilt dominates you get seasons that are no longer equal length because of the planet\u0027s varying speed in its orbit, and the seasons in the northern and southern hemispheres cease being mirror images. That is the case on Mars.\u003C/p\u003E\u003Cp\u003EIf the orbit is elliptical enough that that dominates the seasons you get summer and winter and the same time everywhere. The planet spends most of its orbit far from the Sun and is only close for a short portion, again due to varying orbital speeds. That means if summer is normalish winter will be very long and cold, whereas if winter is normalish summer will be scorching hot but brief. Either way it\u0027s likely the ecosystems of Earth could not survive, though life in general could.\u003C/p\u003E\u003Cp\u003EAnd if the axial tilt and orbital eccentricity were balanced just right you could get one hemisphere having strong seasons and the other having virtually none. Now that would be an interesting world. The high latitudes in the season-free hemisphere would have ecosystems combining the cool temperature adaptations of Earth\u0027s high latitudes with the non-seasonal features we only see in our tropics.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-21T14:14:00Z\u0022 title=\u002208/21/2015 02:14  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 21, 2015\u003C/time\u003E by cantab\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2015-08-21T14:15:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022peadar1987\u0022 data-cite=\u0022peadar1987\u0022\u003E\u003Cdiv\u003EI don\u0027t know what part of the world you\u0027re from, but if winter doesn\u0027t start until the 21st of December, I think I might have to move there!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJust because the weather can be winterly - winterly as in story books from our childhood - does not mean winter starts with the first snow.\u003C/p\u003E\n"},{"CreatedByName":"peadar1987","CreatedById":81207,"CreatedDateTime":"2015-08-21T14:48:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerbMav\u0022 data-cite=\u0022KerbMav\u0022\u003E\u003Cdiv\u003EJust because the weather can be winterly - winterly as in story books from our childhood - does not mean winter starts with the first snow.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESeasons aren\u0027t rigidly defined. In Ireland, as a result of the Celtic influence, the seasons are:\u003C/p\u003E\u003Cp\u003E-Winter: 1 November to 31 January\u003C/p\u003E\u003Cp\u003E-Spring: 1 February to 31 April\u003C/p\u003E\u003Cp\u003E-Summer: 1 May to 31 August\u003C/p\u003E\u003Cp\u003E-Autumn: 1 September to 31 October\u003C/p\u003E\u003Cp\u003EEach season is based on having an equinox or a solstice as its midpoint. I\u0027m sure it differs elsewhere because of varying cultural factors, but a \u0022season\u0022 isn\u0027t something that has a precise, universal scientific definition.\u003C/p\u003E\n"},{"CreatedByName":"MinimumSky5","CreatedById":115138,"CreatedDateTime":"2015-08-21T16:03:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022peadar1987\u0022 data-cite=\u0022peadar1987\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EEach season is based on having an equinox or a solstice as its midpoint. I\u0027m sure it differs elsewhere because of varying cultural factors, but a \u0022season\u0022 isn\u0027t something that has a precise, universal scientific definition.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs an Englishman, I know how odd it is to think that winter starts on the 21st December, but it is that rigidly defined in astronomy, the only difference being that that is the start of summer in the southern hemisphere.\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-08-21T16:42:36Z","Content":"\n\u003Cp\u003EFWIW, I think it makes more sense to have the solstices and equinoxes as the middle of seasons, rather than endpoints...\u003C/p\u003E\u003Cp\u003Ebut to the OP...\u003C/p\u003E\u003Cp\u003EIt should be obvious to anyone who really understands the cause of the seasons, that their length scales with the length of the year, and the beginning of a season will be at the same proportional time during the year.\u003C/p\u003E\u003Cp\u003EThis is assuming that the eccentricity doesn\u0027t change.\u003C/p\u003E\u003Cp\u003EIn a highly eliptical orbit, things change a lot\u003C/p\u003E\n"},{"CreatedByName":"peadar1987","CreatedById":81207,"CreatedDateTime":"2015-08-21T16:47:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MinimumSky5\u0022 data-cite=\u0022MinimumSky5\u0022\u003E\u003Cdiv\u003EAs an Englishman, I know how odd it is to think that winter starts on the 21st December, but it is that rigidly defined in astronomy, the only difference being that that is the start of summer in the southern hemisphere.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWHAT?! This is just plain wrong. Forget that silly Pluto debate, we should be on to the IAU about their stupid, stupid definition of seasons immediately!\u003C/p\u003E\n"},{"CreatedByName":"Trann","CreatedById":83801,"CreatedDateTime":"2015-08-21T18:30:18Z","Content":"\n\u003Cp\u003EI do like the solstice/equinox markers to define an \u0022official\u0022 start of the \u0022astronomical season\u0022 because it\u0027s based on the ecliptic crossing the celestial equator and the peak day and night periods. It has nothing to do with local weather and nor should it: weather is far too dynamic. An exceptionally warm or cold spell could push back a season by weeks or longer, making the mid-point definition moot.\u003C/p\u003E\u003Cp\u003EAs an amateur astronomer, it\u0027s a nice universal (sorry, Sol-based) constant to have.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-08-22T02:01:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022peadar1987\u0022 data-cite=\u0022peadar1987\u0022\u003E\u003Cdiv\u003EI don\u0027t know what part of the world you\u0027re from, but if winter doesn\u0027t start until the 21st of December, I think I might have to move there!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFTR, it starts getting cold enough for jackets here in late September, and while there is usually one nice weekend in November (nice = can walk outside for indefinite periods of time without your face freezing) it\u0027s cold from October through March, and usually even into April but by then we don\u0027t care and go out anyway. October snows are by no means common but neither are they rare.\u003C/p\u003E\u003Cp\u003EHowever that all said, January and February are easily the 2 coldest months, and February is always the worst. March is usually pretty bad too, but like November can sometimes have a nice weekend just stuck in between blistering cold weeks.\u003C/p\u003E\u003Cp\u003EBut I wasn\u0027t talking about any of that. I was talking about the officially unofficial designation of seasons that others have already specified and that of all the definitions, I personally prefer: having them start at the appropriate equinox or solstice.\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2015-08-22T21:19:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003EIf on the other hand the orbit is elliptical things get interesting.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFor what it is worth, our Earth\u0027s slightly elliptical orbit already does affect the length of the seasons a bit. In the northern hemisphere they are as follows (number of days between solstices and equinoxes):\u003C/p\u003E\u003Cp\u003EWinter: 88.99 days\u003C/p\u003E\u003Cp\u003ESpring: 92.75 days\u003C/p\u003E\u003Cp\u003ESummer: 93.65 days\u003C/p\u003E\u003Cp\u003EAutumn: 89.85 days\u003C/p\u003E\u003Cp\u003ESo the southern hemisphere\u0027s summer is about 5 days shorter than the Northern hemisphere\u0027s summer because the Earth reaches perihelion (highest orbital angular velocity) on about January 3rd and aphelion (lowest orbital angular velocity) on about July 4th. And because the length of time between the equinoxes and solstices has noting to do with how we record time on our calendars, the length of the seasons is not affected by leap years.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2015-08-22T21:30:18Z","Content":"\n\u003Cp\u003EThe definition question really does not interest me, because it will invariably mean lots of scientists, laymen and institutions that have a reasonable say or nothing to do with the matter altogether fielding their opinions in ever less graceful ways. It will be a mess. A more practical and, to me, more interesting question is how nature will cope. Will different animals and plants adapt seamlessly, will some cope because they happen to have the right mechanisms in place and will some perish, or will it mean general upheaval and a huge realignment of all things growing.\u003C/p\u003E\u003Cp\u003EIf I were to guess I would say it is the second option, since different organisms employ different ways of detecting or predicting seasonal changes. Some seem more time based, while others are just triggered by the circumstances. Trees, for examples, shed their leaves mostly cued by the temperature and light. Both will change with the longer seasons, so it seems the trees will adjust just fine. Gestations periods, on the other hand, are often timed with the seasons and availability of resources, so that might cause some minor or major problems, depending on the species and exact mechanism in each organism.\u003C/p\u003E\n"},{"CreatedByName":"YNM","CreatedById":98447,"CreatedDateTime":"2015-08-22T22:10:33Z","Content":"\n\u003Cp\u003EI\u0027ll define seasons out of changes in absolute insolation (no cloud and average albedo), out of how much the Sun gives a tangent flux (or some number equal to the tangent flux) to a certain part of the planet in a day.\u003C/p\u003E\u003Cp\u003EThis certainly brings four things in :\u003C/p\u003E\u003Cp\u003E- Latitude of said place on Earth\u0027s surface\u003C/p\u003E\u003Cp\u003E- Axial tilt wrt orbital plane\u003C/p\u003E\u003Cp\u003E- Location of nodes between orbital plane and rotational plane\u003C/p\u003E\u003Cp\u003E- Eccentricity of orbital plane (I\u0027ll only consider extreme cases, Earth\u0027s 0.0167 is way too small to fare with 23.5 tilt)\u003C/p\u003E\u003Cp\u003ESo, I\u0027ll try to answer :\u003C/p\u003E\u003Cp\u003EPerfectly circular orbit w/o tilt: no season.\u003C/p\u003E\u003Cp\u003EPerfectly circular orbit with axial tilt: equal length four season at high latitude, two season at equator.\u003C/p\u003E\u003Cp\u003EEccentric orbit w/o tilt: planetwide season. Possibility of freezing atmosphere at extreme limits. Also correct for a highly inclined orbit (e \u0026gt; 0.2)\u003C/p\u003E\u003Cp\u003EEccentric orbit with tilt, nodes at Ap\u0026amp;Pe: equal length four season, though the different direction will certainly produce some difference. Two season still at equator, possibly an arid and wet side (east-west fashion) unless it induces winds instead.\u003C/p\u003E\u003Cp\u003EEccentric orbit with tilt, nodes halfway between Pe/Ap: distinct season between hemisphere, one get a hot summer while the other get cold winter and vice versa. Two season at equator, arid areas probably concentrated in one hemisphere.\u003C/p\u003E\n"},{"CreatedByName":"AcidSludge","CreatedById":95709,"CreatedDateTime":"2015-08-23T00:00:09Z","Content":"\n\u003Cp\u003EDo we add new months with cool names, or do we just add days to the months? Isn\u0027t it awful to wait longer between two christmas or birthday presents?\u003C/p\u003E\u003Cp\u003EAnd oh the bureaucracy!\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-08-23T02:32:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AcidSludge\u0022 data-cite=\u0022AcidSludge\u0022\u003E\u003Cdiv\u003EDo we add new months with cool names, or do we just add days to the months? Isn\u0027t it awful to wait longer between two christmas or birthday presents?\u003Cp\u003EAnd oh the bureaucracy!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEasy solution, make the year 2x as long and just repeat everything twice a year. One Christmas will be all cold, and one will be all warm. In BOTH hemispheres!\u003C/p\u003E\u003Cp\u003EYou\u0027re WELCOME, Australia.\u003C/p\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2015-08-23T02:49:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022peadar1987\u0022 data-cite=\u0022peadar1987\u0022\u003E\u003Cdiv\u003EEach season is based on having an equinox or a solstice as its midpoint. I\u0027m sure it differs elsewhere because of varying cultural factors, but a \u0022season\u0022 isn\u0027t something that has a precise, universal scientific definition.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe logic of putting an equinox or solstice in the middle of a season has merit, but (and I hope this doesn\u0027t cause the wrath of the moderators, but if it does, I\u0027m sorry) the downside of that is that the beginning/end of each season is a lot harder to measure.\u003C/p\u003E\u003Cp\u003EIn ancient times (again mods, sorry if this is considered rude or polarizing) the only only calendar was the position of the sun and the moon and druids, priests (this might be considered politically incorrect, my apologies) and other wise people would declare the time for harvest, planting, etc based on events that were easy to measure: equinoxes and soltices. Hence, seasons tend to start/finish with those, instead of having them as midpoint, as much sense it makes.\u003C/p\u003E\n"},{"CreatedByName":"jwenting","CreatedById":57735,"CreatedDateTime":"2015-08-23T14:08:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00225thHorseman\u0022 data-cite=\u00225thHorseman\u0022\u003E\u003Cdiv\u003EEasy solution, make the year 2x as long and just repeat everything twice a year. One Christmas will be all cold, and one will be all warm. In BOTH hemispheres!\u003Cp\u003EYou\u0027re WELCOME, Australia.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n"}]}