{"TopicId":118901,"ForumId":20,"TopicTitle":"Hitpoints for Parts and Kerbals","CreatedByName":"mysteriosmind","CreatedById":128626,"CreatedDateTime":"2015-08-20T12:33:56Z","PageNum":1,"Articles":[{"CreatedByName":"mysteriosmind","CreatedById":128626,"CreatedDateTime":"2015-08-20T12:33:56Z","Content":"\n\u003Cp\u003ERight now parts (or Kerbals) are either completely intact ot completely destroyed, with nothing in between. There are some part failure mods out there that improve on that, but they all feel too arbituary in the way that the failures are detached from what is happening to the part (them being random). So I have been thinking for some time now, that a Hitpoint system for both Parts and Kerbals could be an interesting gameplay element and would also give engineers something more to do. It would work like this:\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E The idea:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EEvery part and Kerbal would have 100 HP to start with and everytime a force within a certain Percentage of the crash tolerance hits it, it loses some. Same when it is within a certain Percentage of its max Temperature for a certain time. When it reaches 0 HP it is destroyed obviously. \u003C/p\u003E\u003Cp\u003EBut the interesting stuff would happen between 100 und 0. So evertime you lose HP there is a chance (based on remaining HP) that the part stops functioning; maybe with the chance being 0 % until you are below a certain amount of HP. If a part is below a certain critical HP amount it will have a chance of stopping to function every time you use it. If that happens, Engineers can use a resource (spare parts?) to restore function and aswell use the spare parts to restore HP (Their level decides what part classes they can repair, up to what number of HP they can restore a part and how many spare parts are needed for both of those). They could also salvage parts (destroy them or maybe just take off a certain amount of HP) to gain a certain amount of spare parts. The yield would depend on the part (part class and part mass) and on their level. Another thing that is dependant on the engineers level would be how long they take for doing repairs/salvaging. \u003C/p\u003E\u003Cp\u003EParts would also have a half-life. So that in maybe 2 (5/10/?) years parts lose half their HP through decay. That time could depend on the level of your Assembly buildings and if there is an engineer on board. Unmanned (Unkerbaled?) crafts could get a bonus to half-life to account for manned crafts having a lot more systems that could break.\u003C/p\u003E\u003Cp\u003EKerbals on the other hand would slowly regenerate HP (maybe more while they are inside a craft). As for what it would mean when a Kerbal \u0022stops functioning\u0022 would be up for discussion, but it could be kind of cool if they would stop being controlable and other Kerbals having to carry them back to a craft.\u003C/p\u003E\u003Cp\u003ESo as I am pretty sure that there is no mod like this yet so I really hope that a) somebody who took the time to read those lines is now thinking \u0022Hey, this is a cool idea\u0022 and \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E is able to pull something like this off, as I sure ain\u0027t.\u003C/p\u003E\n"}]}