{"TopicId":119147,"ForumId":29,"TopicTitle":"Kerbal Professions","CreatedByName":"Reiver","CreatedById":148134,"CreatedDateTime":"2015-08-23T12:08:31Z","PageNum":1,"Articles":[{"CreatedByName":"Reiver","CreatedById":148134,"CreatedDateTime":"2015-08-23T12:08:31Z","Content":"\n\u003Cp\u003ESo, I\u0027ve been thinking of making a new Kerbal profession, namely, \u0027Colonists\u0027. They\u0027d be cheap to obtain (Presumably via a mission structure if I can\u0027t rig the KSC recruitment page to do it), but all but useless until they\u0027d earned experience enough to be minimally competent. You know, something like\u003C/p\u003E\u003Cp\u003E0-star: Tourist\u003C/p\u003E\u003Cp\u003E1-star: Functional (able to count as \u0027doing work\u0027 for various parts)\u003C/p\u003E\u003Cp\u003E2-star: EVA capable (No flags or surface samples, of course)\u003C/p\u003E\u003Cp\u003E3-star: Vehicle command (No SAS or anything, but scientist/engineer level steering)\u003C/p\u003E\u003Cp\u003E4-star: Repair wheels (Because a rugged frontiersman is going to eventually learn how to do the odd repair, y\u0027xnow? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E)\u003C/p\u003E\u003Cp\u003E...and potentially a science/engineering style multiplier available to be plugged into life support Greenhouses and the like, to represent improved productivity in such administrative tasks.\u003C/p\u003E\u003Cp\u003EThe idea being that these are the dudes you send to \u0027fill the ranks\u0027 of any hypothetical space station or colony base, leaving your specialised (and exponentially expensive!) Engineers, Pilots, and Scientists do do the \u003Cem\u003Etricky\u003C/em\u003E stuff. You know, like engineering, piloting, and running science labs. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EMy problem: I\u0027ve no idea where to start. I\u0027d thought it\u0027d involve creating a new line in Experience.cfg and then adding lines to the relevant parts via ModuleManager or the like, but it seems such lines simply don\u0027t exist. Where does the game track the capabilities of what specialised Kerbals can do? Is it strictly inside the engine? I\u0027m a little lost where to even look. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-23T12:11:03Z\u0022 title=\u002208/23/2015 12:11  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 23, 2015\u003C/time\u003E by Reiver\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Stoney3K","CreatedById":139954,"CreatedDateTime":"2015-08-28T20:13:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Reiver\u0022 data-cite=\u0022Reiver\u0022\u003E\u003Cdiv\u003EMy problem: I\u0027ve no idea where to start.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETexture them to have red shirts. That\u0027ll get you halfway through the problems you describe. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EIn all seriousness, though, you could try to use the Tourist as a template and see what its properties are.\u003C/p\u003E\u003Cp\u003EAll Kerbals except Tourists are able to interact with parts while flying a ship, I doubt there\u0027s any way you could inhibit that.\u003C/p\u003E\u003Cp\u003EBlocking \u0022vessel control\u0022 on a low level could be done on a per-part flight control basis, I can envision a PartModule that is attached to all parts and which tells every part \u0022You are not part of the vessel being flown\u0022 when only a level 2 colonist is on board.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-28T20:17:13Z\u0022 title=\u002208/28/2015 08:17  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 28, 2015\u003C/time\u003E by Stoney3K\u003C/strong\u003E\n\u003C/span\u003E\n"}]}