{"TopicId":119215,"ForumId":16,"TopicTitle":"So, are there any spots with 0 resources?","CreatedByName":"panzer1b","CreatedById":95108,"CreatedDateTime":"2015-08-24T02:52:22Z","PageNum":1,"Articles":[{"CreatedByName":"panzer1b","CreatedById":95108,"CreatedDateTime":"2015-08-24T02:52:22Z","Content":"\n\u003Cp\u003EWell, ive been messing with IRSU rather alot recently as i was setting up a base on Mun (its kinda destroyed now due to like 4 rather accurate bomber raids that crippled the power station and both drilling platforms). Anyways, I was too lazy to bother setting up a satelite to scan it, so i just randomly drop it nearby the main RnD complex and it seems that the IRSu worked fine, maybee a little slower then on other spots but it still got resources out of the ground.\u003C/p\u003E\u003Cp\u003EIve since then set up at least 10 different IRSU sites and all of them seem to have resources in them (albeit some were very slow to get them).\u003C/p\u003E\u003Cp\u003ESo, do stock resources one: ever actually run out, and two: do they ever exist in 0 quantity anywhere or is it just a matter of certain spots being practical and others just taking ages to get any ore out of? I know asteroids have a finite amount, but can u ever run out of them such as with kethane mod?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-24T04:51:03Z\u0022 title=\u002208/24/2015 04:51  AM\u0022 data-short=\u00228 yr\u0022\u003EAugust 24, 2015\u003C/time\u003E by panzer1b\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-08-24T03:52:27Z","Content":"\n\u003Cp\u003EResources in stock KSP are inexhaustible: they never run out, it\u0027s not like Kethane. It\u0027s more like Karbonite (which is hardly surprising, since RoverDude, the author of Karbonite, was responsible for the design for stock 1.0 resources).\u003C/p\u003E\u003Cp\u003ENot sure about actual zero resources, have never bothered to check that, since I\u0027m generally searching for the opposite. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"panzer1b","CreatedById":95108,"CreatedDateTime":"2015-08-24T04:50:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Snark\u0022 data-cite=\u0022Snark\u0022\u003E\u003Cdiv\u003EResources in stock KSP are inexhaustible: they never run out, it\u0027s not like Kethane. It\u0027s more like Karbonite (which is hardly surprising, since RoverDude, the author of Karbonite, was responsible for the design for stock 1.0 resources).\u003Cp\u003ENot sure about actual zero resources, have never bothered to check that, since I\u0027m generally searching for the opposite. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ethats actually good, as much as i know itd be realistic, exhausteable resources would just add too much complexity. I already shift my fuel drills habitually (since i tend to play alot of campaigns in singleplayer, set up multiple factions that fight over resources, ect). if a enemy proibe passes over a fuel depo its time to leave as that means bombers are en route quickly, which will waste a refinery really quickly.\u003C/p\u003E\u003Cp\u003ENow if only i could figure a way to make a ultra-compact miner system. The way mining is done right now, you either use a lander with a ore tank, that fills up, and u fly it to orbit, or you use a massive refinery scale vessel that comes down, fills itsel;f, and gets back to orbit. I know a smaller and lighter converter would be OP as all that itd do is slow the resource conversion process, something that is more or less bypassable via time warp (or you go do other missions and return to it later if you prefer immersion), but itd still be nice to find some sort of compact solution to mining resources that can say fit into a Mk2 bay, and be deployeable by near anything thgat can carry ~5 tons or so.\u003C/p\u003E\n"},{"CreatedByName":"STARKEngineer","CreatedById":148713,"CreatedDateTime":"2015-08-24T10:02:45Z","Content":"\n\u003Cp\u003EYou could also have separate Miner Base and Tanker ships. Which then leaves you the question of having your ISRU converter on the Base and tankering fuel or putting your ISRU converter on a space station and tankering up ore. Ore tanks have the best wet/dry fraction of all tanks IIRC, so the theoretically the most efficient system would be a fixed, engineer manned miner base in a high concentration spot, a Tanker lander carrying Ore with just enough Dv to land empty of ore, fill with ore from the miner (via KIS/KAS pipes or EVA Transfer or a rover with a klaw etc etc.) Then to ascend and rendevous with the converter/fuel depot space station to deposit ore and refuel. This would get you:\u003C/p\u003E\u003Cp\u003E1. Constant mining of ore with high efficiency (the higher experience the engineer the better\u003C/p\u003E\u003Cp\u003E2. Best payload fraction Tanker\u003C/p\u003E\u003Cp\u003E3. ISRU converter with reliable Solar power and easy access for passing ships to refuel.\u003C/p\u003E\u003Cp\u003EIn terms of Zero amounts, I am not sure. With Karbonite (Roverdude\u0027s original ISRU mod which was the basis for the current Ore system) it was possible to have areas of Zero concentration. Each biome had an average concentration with a variation either side of that e.g. on my 0.90 Minmus had an average of 5% concentration in its highlands biome with variation down to 3.7ish and up to 7.2. However this was right next door to slopes biome, which has 0% concentration. I would have to check the Ore default generation aettings to see if its possible for a 0% ore to be generated.\u003C/p\u003E\u003Cp\u003EP.S. if you want an ISRU option with smaller converter/drilling options or want to be able to find resources in space, in oceans, or in atmosphere as well as on land then I can recommend Karbonite as an option, although a few of the included parts could be considered OP by some.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-24T10:05:54Z\u0022 title=\u002208/24/2015 10:05  AM\u0022 data-short=\u00228 yr\u0022\u003EAugust 24, 2015\u003C/time\u003E by STARKEngineer\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Vegetal","CreatedById":147251,"CreatedDateTime":"2015-08-24T17:35:25Z","Content":"\n\u003Cp\u003EDepends on the resource abundance setting you use. I reduced mine a little on the last career game, and there were many spots without anything (KSC in particular).\u003C/p\u003E\n"}]}