{"TopicId":119356,"ForumId":39,"TopicTitle":"A Thread for Writers to talk about Writing","CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-08-25T21:17:52Z","PageNum":4,"Articles":[{"CreatedByName":"SaturnianBlue","CreatedById":141267,"CreatedDateTime":"2015-08-31T22:43:53Z","Content":"\n\u003Cp\u003EKuzzter, can you give me a bit of a critique to try to improve on The Asteroid Sentinels? I\u0027ve been doing it for quite a while now, but I\u0027m pretty sure I still have ways to improvise.\u003C/p\u003E\n"},{"CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-08-31T22:53:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SaturnianBlue\u0022 data-cite=\u0022SaturnianBlue\u0022\u003E\u003Cdiv\u003EKuzzter, can you give me a bit of a critique to try to improve on The Asteroid Sentinels? I\u0027ve been doing it for quite a while now, but I\u0027m pretty sure I still have ways to improvise.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOf course--can\u0027t get to it right away but I\u0027ll post something as soon as I can \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EETA: OK, I\u0027ve re-read the series now \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EMany of the projects we all have are part mission report and part story. I see Asteroid Sentinels right now as about 90% mission report. You are using graphic novel elements such as speech balloons and are laying out panels in ways other than a standard screenshot. However, your characters (mainly Wernher, Gene, Linus and the rest of the KSC staff) don\u0027t say much other than comment on the ongoing launches and intercepts. If you want to make this more story and less straight mission report (which you don\u0027t have to--mission reports are always interesting on their own merits, especially with good pictures!) then those characters will have to have some depth, and experience some \u003Cem\u003Egrowth\u003C/em\u003E. What does Gene think about the ships he\u0027s launching? What are his \u003Cem\u003Epersonal \u003C/em\u003Egoals, besides the immediate goals of the mission? Also, where is this whole story going? Is Kerbin really in danger of obliteration? Is Gene going to get fired if he doesn\u0027t get a whole bunch of asteroids? Other than character, that\u0027s the main thing that makes a story a story--the reward if the characters do accomplish their goals, and the consequences if they don\u0027t.\u003C/p\u003E\u003Cp\u003EAs to the graphic elements, you\u0027re using them well to add humor and personality. Your panels and layout were confusing sometimes at first, but I think you\u0027re really getting the knack of it around post #32. If you do decide to ramp up the character focus and storytelling, you have a good framework to build on!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-01T02:59:17Z\u0022 title=\u002209/01/2015 02:59  AM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 1, 2015\u003C/time\u003E by Kuzzter\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Mad Rocket Scientist","CreatedById":139256,"CreatedDateTime":"2015-08-31T23:53:46Z","Content":"\n\u003Cp\u003EI\u0027m really a writer, but I might try a short fan-fic. \u003C/p\u003E\u003Cp\u003ESo far, all I\u0027ve written I\u0027ve is these \u0022what\u0027s the worst that could happen posts:\u0022\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003EDue to a complicated series of unfortunate events, your child suffers from low self esteem, depression, and addiction to a game called \u0022Kerbal Space Program\u0022, of the three the last is the most serious as it causes your child to create a forum account, whereupon he begins to post in a forum games thread called \u0022What\u0027s the worst that could happen?\u0022.\u003C/p\u003E\u003Cp\u003E I am Attila. I am revenge. I will hunt you down to the ends of space. You will never be able to relax again, for fear that I\u0027m just around every corner. I will be. You cannot escape. I am coming.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003EAs you lean down to pour kibble into the bowl, a sudden pain hits your back, and as you go over to the couch to lie down, you slip on a cleverly placed banana peel which Attila has placed for you slip on, as you get up, Attila jumps out from behind the couch, wielding his bayonet and shouting \u0022revenge\u0022, you run to the secret bunker you built very recently, and as you run in, screaming the auto-lock code for the blast proof door, you slip on the wet paint, and fall in the wet cement.\u003C/p\u003E\u003Cp\u003E Behind you, the blast proof door falls off of it\u0027s hinges, as it was placed in wet cement. Attila runs in, furiously typing this forum post, he then slides into the wet cement.\u003C/p\u003E\u003Cp\u003E Meanwhile, you run towards you secret escape rocket, which will take you to your private space station where you will be able to finally escape Attila.\u003C/p\u003E\u003Cp\u003E You run into the rocket, locking the airlock and strapping yourself in. You activate the launch sequence and blastoff, but when you look at the external camera, you see Attila hanging on to a fin on your rocket, which mechjeb doesn\u0027t correct for, and you have to abort the launch.\u003C/p\u003E\u003Cp\u003E As you parachute away from the exploding rocket, you think nothing could have survived the blast. You don\u0027t see Attila parachuting down.\u003C/p\u003E\u003Cp\u003E When you capsule lands, get out and look around. You\u0027ve hardly come 1/2 of a mile from you house, and now you have to walk back with a hurting back, to finally finish feeding the dog.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003EYou swim around for a while, and then you decide to jump in to the pool. As you jump in the pool, you see that your thunderbird style pool has retracted without warning, revealing TB1. You land on a pile of canvases which break your fall.\u003C/p\u003E\u003Cp\u003E When you wake up you realize this is a another plot of Attila\u0027s to seek revenge, for you are his \u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003Emother\u003C/span\u003E\u003C/em\u003E and you had a part in naming him. Suddenly Attila appears with a spear, luckily, because he is figuring out some insane plot for this post, you have time to roll away from the spear and run towards TB4, where you jump in and jet off under the water. Suddenly, a torpedo zooms by your port bow, and you look behind you, where you see another submarine right you, about to launch another torpedo. You take evasive action and dive. The other submarine dives too, and you keep on diving, hoping to go deeper than the other submarine. You continue to dive, and when you reach the max depth of your submarine, the other submarine is still right behind you. In a risky gamble, you continue to dive. The other submarine is still right behind you, when your submarine implodes.\u003C/p\u003E\u003Cp\u003E Luckily, you were able to escape in the escape pod, mere moments before you would have been crushed. You escape pod floats to the surface, where you are picked up by a passing ship. Unfortunately, the ship is a pirate ship, and they force you to walk the plank. Seconds before you would have had to jump to the sharks below, the ship explodes, due to a torpedo from Attila\u0027s submarine.\u003C/p\u003E\u003Cp\u003E You are thrown clear by the blast, and land in the water, where you are invisible to radar and sonar because that the sharks mask you to the submarine. Just when it appears that you will eaten, you see that the sharks have cockpits, because they are shark shaped submarines.\u003C/p\u003E\u003Cp\u003E you are picked up in a shark submarine, where you discover that the submarines are driven by strange beings called \u0022Kerbals\u0022 you say that they are aliens from a planet called \u0022Kerbin\u0022 you explain your plight to them, and they agree to help you escape to Kerbin. You are transported back to the shore, where they put you, along with a crew of Kerbals, on a LEO shuttle, where you will get on a mothership back to Kerbin. As you lift off, you discover the reliability of kerbal rockets. Luckily, the LES worked, and you and the kerbals were blasted to safety.\u003C/p\u003E\u003Cp\u003E You realize that maybe escaping on a kerbal rocket isn\u0027t the way to evade Attila, so you bid the kerbals farewell, and stow aboard a oil tanker to get back to your house.\u003C/p\u003E\u003Cp\u003E When you get back, you discover a sign saying: I know you\u0027re still alive, Attila.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003ECriticism?\u003C/p\u003E\n"},{"CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-09-01T03:08:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mad Rocket Scientist\u0022 data-cite=\u0022Mad Rocket Scientist\u0022\u003E\u003Cdiv\u003ECriticism?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, these are fun \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E So you have two characters here, Atilla and \u0022you\u0022, which I suppose means me, Kuzzter. Atilla\u0027s early characterization shows promise: \u0022\u003Cspan style=\u0022color:#333333;\u0022\u003EI am Attila. I am revenge. I will hunt you down to the ends of space. You will never be able to relax again, for fear that I\u0027m just around every corner. I will be. You cannot escape. I am coming.\u0022 And then we have A Series Of Unfortunate Events, which is of course you asking again and again, \u0022from this point I\u0027ve gotten us to in the story, what is the most interesting/worst thing that could happen next?\u0022 That\u0027s actually not a bad way to go, a lot of great adventure stories come from putting the heroes in an inescapable situation and making them find a way out of it. Of course if you really are Mad enough to get into fanfic, you\u0027ll have to put a lot of thought into characters, their goals, and find an overarching narrative with a Beginning, Middle and End to make your readers care about your characters and their success.\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"Mad Rocket Scientist","CreatedById":139256,"CreatedDateTime":"2015-09-01T20:00:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kuzzter\u0022 data-cite=\u0022Kuzzter\u0022\u003E\u003Cdiv\u003EWell, these are fun \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E So you have two characters here, Atilla and \u0022you\u0022, which I suppose means me, Kuzzter. Atilla\u0027s early characterization shows promise: \u0022\u003Cspan style=\u0022color:#333333;\u0022\u003EI am Attila. I am revenge. I will hunt you down to the ends of space. You will never be able to relax again, for fear that I\u0027m just around every corner. I will be. You cannot escape. I am coming.\u0022 And then we have A Series Of Unfortunate Events, which is of course you asking again and again, \u0022from this point I\u0027ve gotten us to in the story, what is the most interesting/worst thing that could happen next?\u0022 That\u0027s actually not a bad way to go, a lot of great adventure stories come from putting the heroes in an inescapable situation and making them find a way out of it. Of course if you really are Mad enough to get into fanfic, you\u0027ll have to put a lot of thought into characters, their goals, and find an overarching narrative with a Beginning, Middle and End to make your readers care about your characters and their success.\u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks for the criticism! I think my favorite was the first one, but I kind of like the second too. These characters seem a bit too 2d to continue into a full fanfic, but there may be bits of them if I start a larger project.\u003C/p\u003E\n"},{"CreatedByName":"Sharkman Briton","CreatedById":148040,"CreatedDateTime":"2015-09-02T12:23:34Z","Content":"\n\u003Cp\u003EI did what you all told me, moar panel things, bigger text, and Part 3 of Genesis Uno is out!\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/132845-Project-Genesis-Uno-My-first-interplanetary-mission-!?p=2165967#post2165967\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/132845-Project-Genesis-Uno-My-first-interplanetary-mission-!?p=2165967#post2165967\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EWhat do you all think? Critique or not. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"0111narwhalz","CreatedById":110660,"CreatedDateTime":"2015-09-05T06:06:47Z","Content":"\n\u003Cp\u003EIn a \u0027short\u0027 story of a modest 16000 characters (and counting) I\u0027m writing on my phone, I\u0027ve gone for a \u003Cem\u003Every\u003C/em\u003E loose interpretation of the Core Four\u0027s archetypes. A quick-n-dirty ref sheet I made (mostly to keep Bill \u0026amp; Bob separate in my head) follows:\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EJeb\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EImpulsive, a wannabe comedian. Best damn pilot ever to fly.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EBill\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ELevelheaded, focused on the task at hand. Clever engineer.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EBob\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EA bit eccentric. Needs his coffee. Seriously. Once he\u0027s had his coffee, the official ambassador of the group. Also, an eminent xenobiologist.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EVal\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EMidway between Jeb and Bill. Tolerates a bit of humor, but not too much. Decent pilot and a startlingly brilliant linguist.\u003C/p\u003E\u003Cp\u003ECriticism and feedback are greatly encouraged. I\u0027ll probably be flooding the forums with it in the near future (read: tomorrow).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-05T06:09:04Z\u0022 title=\u002209/05/2015 06:09  AM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 5, 2015\u003C/time\u003E by 0111narwhalz\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Sharkman Briton","CreatedById":148040,"CreatedDateTime":"2015-09-05T07:53:21Z","Content":"\n\u003Cp\u003EThat seems spot on! Especially with Jeb. I usually go for Val = humorous, but some things really tick her off. Bill: Bit eccentric, completely concentrated one moment crazy the other. Bob: SCIENCE!\u003C/p\u003E\n"},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2015-09-06T02:37:16Z","Content":"\n\u003Cp\u003EOk my turn \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EI posted a couple of \u003Ca href=\u0022http://tvtropes.org/pmwiki/pmwiki.php/Main/BreatherEpisode\u0022 rel=\u0022external nofollow\u0022\u003Ebreather chapters\u003C/a\u003E before things go dark, and for some reason they\u0027re kinda rubbing \u003Cem\u003Eme\u003C/em\u003E the wrong way. Feedback would be appreciated.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/126545-Whispers-of-the-Kraken-%28Chapter-11-Kermangrad%29?p=2176043\u0026amp;viewfull=1#post2176043\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/126545-Whispers-of-the-Kraken-%28Chapter-11-Kermangrad%29?p=2176043\u0026amp;viewfull=1#post2176043\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Ten Key","CreatedById":123319,"CreatedDateTime":"2015-09-06T23:33:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CatastrophicFailure\u0022 data-cite=\u0022CatastrophicFailure\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EFeedback would be appreciated.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere \u003Cem\u003Eis\u003C/em\u003E a sudden shift in the pacing with the last two chapters. You have a very dense, rapid fire writing style and these chapters kind of wander away from that a bit. We slow down, and the reader gets to see some things that may not tie directly back into the story. But it\u0027s still good writing, even if the bit about the bridges never comes up again. I laughed. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EForgive me a metaphor, but if Whispers of the Kraken was a roller coaster, then these breather chapters are that flat stretch in the middle where the cars tap on the brakes before launching into the next section of track. You \u003Cem\u003Efeel\u003C/em\u003E the deceleration. You can \u003Cem\u003Efeel\u003C/em\u003E the transition in the writing. But the rest of the story is so fast I\u0027m not sure it can be helped. And honestly? I think it works. If it\u0027s a little jarring, so much the better-- it fits with what Valentina herself is experiencing. It\u0027s happy and warm and slow and \u003Cem\u003Esomething is wrong\u003C/em\u003E. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Sharkman Briton","CreatedById":148040,"CreatedDateTime":"2015-09-07T08:34:12Z","Content":"\n\u003Cp\u003EWhat can I say? I loved shadows, nobody ever suspects the \u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E seemingly nice guy! \u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003E though I will admit that one part in shadows that really confused me was the Buford T Kerman part, I had no clue what was going on as you never explained who it actually was. The beginning of whispers kind of set me off a bit, I read the first part of the intro after I finished shadows and I just didn\u0027t want to read it, because I had no clue what was going on, though a while later I started reading it.\u003C/p\u003E\n"},{"CreatedByName":"SaturnianBlue","CreatedById":141267,"CreatedDateTime":"2015-09-07T17:06:27Z","Content":"\n\u003Cp\u003ESo Kuzzter, I managed to implement a lot of your suggestions, what do you think of my Graphic Novel for now?\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2015-09-07T17:30:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sharkman Briton\u0022 data-cite=\u0022Sharkman Briton\u0022\u003E\u003Cdiv\u003EWhat can I say? I loved shadows, nobody ever suspects the \u003C/div\u003E\u003Cblockquote\u003E\u003Cdiv\u003E seemingly nice guy! \u003C/div\u003E\u003C/blockquote\u003E\u003Cdiv\u003E though I will admit that one part in shadows that really confused me was the Buford T Kerman part, I had no clue what was going on as you never explained who it actually was. The beginning of whispers kind of set me off a bit, I read the first part of the intro after I finished shadows and I just didn\u0027t want to read it, because I had no clue what was going on, though a while later I started reading it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGoing off-topic a wee bit, so happy to take this to PMs but:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CatastrophicFailure\u0022 data-cite=\u0022CatastrophicFailure\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EBuford T. Kerman looked an awful lot like Edgas Kerman (also no middle initial) with a truly awesome but fake mustache. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESure, that could be a red herring \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E but if I remember correctly, Edgas removes his moustache at one point.\u003C/p\u003E\n"},{"CreatedByName":"0111narwhalz","CreatedById":110660,"CreatedDateTime":"2015-09-08T05:59:22Z","Content":"\n\u003Cp\u003EShameless self-promotion, but some feedback on my \u003Cem\u003Eother\u003C/em\u003E fanfiction, \u003Ca href=\u0022forum.kerbalspaceprogram.com/threads/110553\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cem\u003EKerbal Future\u003C/em\u003E\u003C/a\u003E, would also be lovely. The Core Four are nowhere to be found in \u003Cem\u003EFuture\u003C/em\u003E, and I figure that\u0027s a nice change from the bulk of KSP fanfiction. It\u0027s also far future, not a \u0022from the beginning\u0022 story.\u003C/p\u003E\n"},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2015-09-08T06:18:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KSK\u0022 data-cite=\u0022KSK\u0022\u003E\u003Cdiv\u003ESure, that could be a red herring \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E but if I remember correctly, Edgas removes his moustache at one point.\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Chadvey Kerman\u0022 data-cite=\u0022Chadvey Kerman\u0022\u003E\u003Cdiv\u003E...yes! And take that ridiculous thing off!\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sharkman Briton\u0022 data-cite=\u0022Sharkman Briton\u0022\u003E\u003Cdiv\u003EWhat can I say? I loved shadows, nobody ever suspects the \u003C/div\u003E\u003Cblockquote\u003E\u003Cdiv\u003E seemingly nice guy! \u003C/div\u003E\u003C/blockquote\u003E\u003Cdiv\u003E though I will admit that one part in shadows that really confused me was the Buford T Kerman part, I had no clue what was going on as you never explained who it actually was. The beginning of whispers kind of set me off a bit, I read the first part of the intro after I finished shadows and I just didn\u0027t want to read it, because I had no clue what was going on, though a while later I started reading it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESeems there\u0027s always some bit that gets a little confused, probably due to the mass of typos I\u0027ve discovered going back thru \u003Cem\u003EShadows\u003C/em\u003E. The into to \u003Cem\u003EWhispers\u003C/em\u003E was pretty experimental I admit. I had the same reaction to the intro to the Wheel of Time, no idea what the heck was going on. Hopefully, like that story, in the fullness of time it\u0027ll be a case of \u0022so THATS what that nut was writing about!\u0022\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ten Key\u0022 data-cite=\u0022Ten Key\u0022\u003E\u003Cdiv\u003EThere \u003Cem\u003Eis\u003C/em\u003E a sudden shift in the pacing with the last two chapters. You have a very dense, rapid fire writing style and these chapters kind of wander away from that a bit. We slow down, and the reader gets to see some things that may not tie directly back into the story. But it\u0027s still good writing, even if the bit about the bridges never comes up again. I laughed. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003Cp\u003EForgive me a metaphor, but if Whispers of the Kraken was a roller coaster, then these breather chapters are that flat stretch in the middle where the cars tap on the brakes before launching into the next section of track. You \u003Cem\u003Efeel\u003C/em\u003E the deceleration. You can \u003Cem\u003Efeel\u003C/em\u003E the transition in the writing. But the rest of the story is so fast I\u0027m not sure it can be helped. And honestly? I think it works. If it\u0027s a little jarring, so much the better-- it fits with what Valentina herself is experiencing. It\u0027s happy and warm and slow and \u003Cem\u003Esomething is wrong\u003C/em\u003E. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks for the input, that\u0027s most helpful. You seem to have the bearing of an English teacher at times with your thoughtful analysis \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Sharkman Briton","CreatedById":148040,"CreatedDateTime":"2015-09-08T14:22:55Z","Content":"\n\u003Cp\u003EGood luck with Whispers!\u003C/p\u003E\u003Cp\u003EShadows actually freaked me out a little, the first time that \u0022HIS EYES!\u0022 happened I was like \u0022Umm, what the heck?... 0_0\u0022 and alot of other bits freaked me out especially the \u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E Edgas murdered that guy \u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003E and every time \u0022HIS EYES!\u0022 happened.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E So he did the only logical thing at the time, \u003Cstrong\u003Ehe punched the Kraken in the face.\u003C/strong\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003E \u0026lt;- Loved that part.\u003C/p\u003E\n"},{"CreatedByName":"Sharkman Briton","CreatedById":148040,"CreatedDateTime":"2015-09-08T17:45:48Z","Content":"\n\u003Cp\u003EAnyone here know how to get people to actually read my stuff?\u003C/p\u003E\u003Cp\u003EIt really annoys me when I look at my stuff and see the only comment other than me being Kuzz, then at another comic made about the same time as mine with buttloads of comments from different people. \u0026gt;.\u0026lt;\u003C/p\u003E\n"},{"CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-09-08T18:01:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sharkman Briton\u0022 data-cite=\u0022Sharkman Briton\u0022\u003E\u003Cdiv\u003EAnyone here know how to get people to actually read my stuff?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, it\u0027s tough. We are all competing for a limited store of readers\u0027 attention spans, not just with one another but with the rest of the Forum, real life, and oh yeah the game itself. What I try to do, and I think what works well in both graphic and text stories, is to make your work very easy for the reader to consume. If it\u0027s hard to read for ANY reason--graphics/font, confusing storyline, unfamiliar characters--then the reader will focus on the nearest shiny object and not your work.\u003C/p\u003E\u003Cp\u003EI think the works that capture reader attention best are the ones that start out with the familiar game setting and characters and add an interesting twist to the canon. That\u0027s a \u0022hook\u0022. And once readers are hooked, you can start to add in the unique bits of your world more and more. I think that if I\u0027d started out with the Eve story, for instance, and tried to introduce readers to the world of Kerbfleet along with five no-name whitesuits all at once, it never would have caught on. I started with a very familiar setting in the opening of D:OB, added Lisa to the roster... developed the characters further and further, then introduced some of the new whitesuits bit by bit once readers were sufficiently hooked that they would pay attention to the new stuff. Otherwise I think there never would have been a \u003Cspan style=\u0022font-size:8px;\u0022\u003E\u0022liek if u cri evry time\u0022 \u003C/span\u003Efor Tedus, no one would have cared who the heck he was \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Sharkman Briton","CreatedById":148040,"CreatedDateTime":"2015-09-08T18:10:08Z","Content":"\n\u003Cp\u003EOkay, that\u0027s rather hard for me as I honestly don\u0027t care about Jeb *gasp* as he has been lost since the beginning of my save due to the Kraken, and I don\u0027t care enough to persistence edit to get him back, and Aldvis and Gemet are my favourites, Val, Bob and Bill are more or less the almost-protagonists, whilst Ald and Gem are more the protagonists, though all of them are protagonists, just three are a bit less than the other two.\u003C/p\u003E\u003Cp\u003EAnother thing I wanted to ask you was if I should focus on story or action, I prefer story but that may cut back on the action, if I do too much action then the story might get cut back or I\u0027ll get a bit sick of the subject.\u003C/p\u003E\u003Cp\u003EAlso: since I know you know a *tiny* bit atleast about PGU then I wish for your opinion: Should I focus less on the Munar Station and more on the Duna ship itself? The reason I\u0027m not doing much with the ship is because I\u0027m a bit stuck on arguably the most crucial part of the ship - the lander - and I want to get that out the way before I add anything else on.\u003C/p\u003E\u003Cp\u003EThanks in advance for any answers/opinions! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-09-08T19:07:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SaturnianBlue\u0022 data-cite=\u0022SaturnianBlue\u0022\u003E\u003Cdiv\u003ESo Kuzzter, I managed to implement a lot of your suggestions, what do you think of my Graphic Novel for now?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHave not forgotten you Blue--I loved the new artwork and mustache/no mustache Wernher! I\u0027d continue to work on panel and speech balloon layout--make the reader\u0027s eye flow easily across the page. Parkaboy is a better graphic designer than I am so look to his stuff for examples of good technique. As for storyline, you\u0027ve given us a reason to worry about your kerbals and the plot is developing. I think the portal stuff is still a bit confusing--for me, it\u0027s lot of words back and forth and I\u0027m still not sure what the portals mean and how much I should be thinking about them in relation to other things like the inbound asteroids. Part of this could be because the characters are confused, themselves; if so, you just have to make it clear that the reader hasn\u0027t missed anything. Similar to my comments to Sharkman, everything you write must be easily digestible by the reader. We\u0027re not writing \u003Cem\u003EFinnegan\u0027s Wake\u003C/em\u003E here--if anything needs to be designed for a short attention span, it\u0027s a webcomic \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E I think a good pair of questions for a writer to always ask are, (1) what single really important thing am I trying to convey to the reader, and (2) how many of these words can I take out and still get that point across?\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2015-09-09T08:09:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kuzzter\u0022 data-cite=\u0022Kuzzter\u0022\u003E\u003Cdiv\u003EWell, it\u0027s tough. We are all competing for a limited store of readers\u0027 attention spans, not just with one another but with the rest of the Forum, real life, and oh yeah the game itself.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDefinitely. Don\u0027t get disheartened by the lack of comments. Over time, I\u0027ve noticed that the ratio of page views to comments tends to be roughly the same for any given KSP fan work. Take Czokletmuss\u0027s \u003Cem\u003EGrand Tour\u003C/em\u003E for example. Epic story, over 470,000 page views and \u0027only\u0027 2,490 comments in the thread including story updates and replies from the author.\u003C/p\u003E\u003Cp\u003EWriting anything KSP related is tough and I\u0027m not saying that in a \u0027woe is me, the poor writer\u0027 sense.\u003C/p\u003E\u003Cp\u003EIt sounds like it should be fairly easy - after all we have some awesome material to work with. The danger of early spaceflight, getting cutting edge technology to work, the mystery and wonder of leaving one\u0027s home planet for the first time, all the hard rocket science you could wish for, not to mention the interesting twist of viewing the whole thing through the eyes of an alien species. Lots of classic sci-fi stuff right there.\u003C/p\u003E\u003Cp\u003EThe problem is... that\u0027s just KSP. Most of that awesome material will be \u0027just another career game\u0027 for our readers. So like Kuzzter said, you need a good hook, or rather \u003Cem\u003Eanother\u003C/em\u003E hook because the obvious ones have all been used. From personal experience, comments can also come straight out of left field. Major story events will get completely ignored in the comments and then some throwaway detail will spark off a page of them. It\u0027s a funny old world sometimes. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-09T08:14:01Z\u0022 title=\u002209/09/2015 08:14  AM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 9, 2015\u003C/time\u003E by KSK\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-09-09T12:08:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KSK\u0022 data-cite=\u0022KSK\u0022\u003E\u003Cdiv\u003EFrom personal experience, comments can also come straight out of left field. Major story events will get completely ignored in the comments and then some throwaway detail will spark off a page of them. It\u0027s a funny old world sometimes. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOMG yes--and it can be a really exciting experience to tell a story \u0022live\u0022 with reader comments coming in, for that reason. I can indeed be influenced by the comments, not so much for story direction but I will definitely pull focus where the readers seem to want to go. \u003C/p\u003E\u003Cp\u003EKSK and others, can you be influenced by the comments in any way?\u003C/p\u003E\n"},{"CreatedByName":"Sharkman Briton","CreatedById":148040,"CreatedDateTime":"2015-09-09T12:18:36Z","Content":"\n\u003Cp\u003EYeah, every time I get a comment I feel motivated to do stuff on the story.\u003C/p\u003E\n"},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2015-09-09T12:40:45Z","Content":"\n\u003Cp\u003EEvery time I get a comment reply notification email I squeal like a little girl. Which can be awkward in public.\u003C/p\u003E\n"},{"CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-09-09T14:04:48Z","Content":"\n\u003Cp\u003ECase in point--I expected a few pages of \u0022What? Fired? Booo! Hiss! Down with Mort!\u0022 after the last E:O0 update but all I\u0027m getting is \u0022Yeah he would totally survive that fall, big deal\u0022. Which is itself pretty darn funny, and I will probably now use it in some way in the comic.\u003C/p\u003E\u003Cp\u003EETA: \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Deddly\u0022 data-cite=\u0022Deddly\u0022\u003E\u003Cdiv\u003EBoooooooooooo!\u003Cp\u003EHissssssssss!\u003C/p\u003E\u003Cp\u003EDown with evil Mort!\u003C/p\u003E\u003Cp\u003EBoooooooooooooooo\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI knew I could count on you Deddly!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-09T14:17:49Z\u0022 title=\u002209/09/2015 02:17  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 9, 2015\u003C/time\u003E by Kuzzter\u003C/strong\u003E\n\u003C/span\u003E\n"}]}