{"TopicId":119353,"ForumId":44,"TopicTitle":"Nemesis: Sol\u0026#039;s evil twin?","CreatedByName":"Sampa","CreatedById":130079,"CreatedDateTime":"2015-08-25T20:50:48Z","PageNum":1,"Articles":[{"CreatedByName":"Sampa","CreatedById":130079,"CreatedDateTime":"2015-08-25T20:50:48Z","Content":"\n\u003Cp\u003EOk, astronomers have discovered that at least two thirds of the stars in the milky way are binary, meaning the stars,come in pairs. Some astronomers theorise that Sol, our sun, is no different, and that its twin is responsible for Earth\u0027s mass extinctions. What do you think? Does Nemesis exist?\u003C/p\u003E\u003Cp\u003EHere\u0027s a video to start the discussion:\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/j1UE-8MkAIQ?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"_Augustus_","CreatedById":115084,"CreatedDateTime":"2015-08-25T20:54:18Z","Content":"\n\u003Cp\u003EYes, I think it\u0027s there. \u003C/p\u003E\u003Cp\u003ENeil Degrasse Tyson found a red dwarf in a star catalog that\u0027s 25 light-years away that no one else had heard of, and said DC Comics could have it become Superman\u0027s home star Rao.\u003C/p\u003E\u003Cp\u003EThere are many of those red dwarfs, but some don\u0027t even have their parallax/distance measured, and one of those is probably Nemesis.\u003C/p\u003E\u003Cp\u003ENemesis can not be a brown dwarf or gas giant because WISE was looking for those, whereas it wouldn\u0027t have cared about a red dwarf.\u003C/p\u003E\n"},{"CreatedByName":"Xannari Ferrows","CreatedById":125369,"CreatedDateTime":"2015-08-25T20:59:05Z","Content":"\n\u003Cp\u003EIt makes sense to me that it\u0027s there. With enough debris surrounding it, it could be nearly indistinguishable from the spatial environment around it. The only way to know it\u0027s there is to get fairly close, and stare it in the face.\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2015-08-25T21:00:01Z","Content":"\n\u003Cp\u003ENot that close to the Sun. Proxima Centauri, Barnard Star and other near red dwarfs are well known for many years. There is no way we missed a red dwarf at one light year or less. Give some credit to our astronomers and observatories \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ECloud of debris still would be heated by a star in its centre, well above the normal temperature of space - and so it would be clearly visible to any IR telescope.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-25T21:03:15Z\u0022 title=\u002208/25/2015 09:03  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 25, 2015\u003C/time\u003E by Scotius\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Sampa","CreatedById":130079,"CreatedDateTime":"2015-08-25T21:01:01Z","Content":"\n\u003Cp\u003EYeah, for distance, astronomers theorize that Nemesis is only 1 LY from Sol\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2015-08-25T21:05:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sampa\u0022 data-cite=\u0022Sampa\u0022\u003E\u003Cdiv\u003EYeah, for distance, astronomers theorize that Nemesis is only 1 LY from Sol\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhich astronomers and based on what?\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2015-08-25T21:07:06Z","Content":"\n\u003Cp\u003E- A star would be visible because it would be undergoing fusion. Even extremely dim brown dwarfs are still fairly easy to detect if they\u0027re literally right next to us.\u003C/p\u003E\u003Cp\u003E- If it\u0027s not undergoing fusion, it\u0027s not a star, it\u0027s a planet (a gas giant like Jupiter). In that case, our solar system would not be a binary system.\u003C/p\u003E\u003Cp\u003E- An object of the mass of a star or near-star would significantly perturb the orbits of the objects in the solar system, and would cause the Sun to wobble significantly. Case in point: the entire Kuiper Belt and the Scattered Disc are what they are because of Neptune\u0027s gravity, and Jupiter has such a large influence that the Sun and Jupiter actually revolve around a common barycenter that lies above the Sun\u0027s surface. And Jupiter is still far away from being massive enough to approach fusion ignition.\u003C/p\u003E\u003Cp\u003EBecause orbital perturbations are very precisely measurable, scientists have already ruled out with confidence that an object massive enough to be a gas giant or greater exists anywhere within 2 lightyears of our Sun.\u003C/p\u003E\u003Cp\u003ETL;DR: Nemesis does not exist today. If it existed in the past, it was so long ago that we cannot trace its existence.\u003C/p\u003E\u003Cp\u003EWe have, however, found a red dwarf star on a trajectory around the galactic center that, if traced back, makes it likely that \u003Ca href=\u0022http://www.space.com/28611-star-flew-through-solar-system.html\u0022 rel=\u0022external nofollow\u0022\u003Eit passed within 0.8 light years of our Sun a mere 70,000 years ago\u003C/a\u003E. It would have plowed straight through the Oort cloud and probably sent a lot of long period comets inwards. However, that event would be too recent to be involved in any mass extinctions. IIRC, no such event happened since the Yucatan meteor impact 65 million years ago.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-25T21:11:36Z\u0022 title=\u002208/25/2015 09:11  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 25, 2015\u003C/time\u003E by Streetwind\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"_Augustus_","CreatedById":115084,"CreatedDateTime":"2015-08-25T21:07:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sampa\u0022 data-cite=\u0022Sampa\u0022\u003E\u003Cdiv\u003EYeah, for distance, astronomers theorize that Nemesis is only 1 LY from Sol\u003C/div\u003E\u003C/blockquote\u003E That is because they are correct.\u003Cp\u003EAssuming that Nemesis is .09 solar masses and it\u0027s orbital period is 26 million years, it\u0027s semi major axis is 1.4283 light-years.\u003C/p\u003E\u003Cp\u003EIt\u0027s apparent magnitude at that distance is 6, which means it has to have an eccentric orbit!\u003C/p\u003E\u003Cp\u003EAt a distance of 2.6 light-years, it has an apparent magnitude of 7.3. That means that if you were Chuck Yeager, were at the best dark sky park, and knew where it is in the sky, you would hypothetically be able to see it.\u003C/p\u003E\u003Cp\u003EPlausible, as no one knows where it is in the sky, and no one who goes to a dark sky park looks for it anyway.\u003C/p\u003E\u003Cp\u003EThis means that it has an orbital eccentricity above 0.8, which brings it as close as 0.2 light-years to the Sun, which is also perfectly plausible!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-25T21:22:00Z\u0022 title=\u002208/25/2015 09:22  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 25, 2015\u003C/time\u003E by _Augustus_\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2015-08-25T21:21:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sampa\u0022 data-cite=\u0022Sampa\u0022\u003E\u003Cdiv\u003EOk, astronomers have discovered that at least two thirds of the stars in the milky way are binary, meaning the stars,come in pairs. Some astronomers theorise that Sol, our sun, is no different, and that its twin is responsible for Earth\u0027s mass extinctions.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think that many stars pass within close enough proximity, including red-dwarfs and neutron stars that are no longer visible and these can ending up cause comets to be tossed. The question however, was the dinosaur killing asteroid a mush ball or a metalloid asteroid from the asteroid belt, there are lots of earth crossing asteroids that can do similar damage, but asteroids, as big as they may be, for example 67p would get torn into two pieces if it passed close enough to earth, or any planet, and over a few rotations around the sun it begins to disappear into gas and dust. Even on top of that, planetoids in the belt, a growing list of objects, can also toss the smaller roids from their orbits and once they get close to the giant planets they can be tossed in or out of the solar system. \u003C/p\u003E\u003Cp\u003ESo the problem with their hypothesis is\u003C/p\u003E\u003Cp\u003E1. Is oort cloud objects a K/T impactor or is it the asteroid belt.\u003C/p\u003E\u003Cp\u003E2. Are extra-systemic flybys the major creator of cometary orbits or are they generated by intra-orbital interactions\u003C/p\u003E\u003Cp\u003E3. Are such orbital periods even competitive with other more frequent celestial flybys, there is one due every 10,000s of years at about 1 mly. Occasionally one will get even closer. \u003C/p\u003E\u003Cp\u003E4. Just because other systems have 2 celestials capable of light producing fission, does not mean that our sun had to have had such a system, \u003C/p\u003E\u003Cp\u003EThis is a just so hypothesis, the odds of it being correct are very small.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2015-08-25T21:21:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022_Augustus_\u0022 data-cite=\u0022_Augustus_\u0022\u003E\u003Cdiv\u003EThat is because they are correct.\u003Cp\u003EAssuming that Nemesis is .09 solar masses and it\u0027s orbital period is 26 million years, it\u0027s semi major axis is 1.4283 light-years.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EProblem is that its an orbital telescope who scanned the entire sky and would found an Jupiter sized object out to 1 light-year away because of the IR radiation. \u003C/p\u003E\u003Cp\u003EWas another tread about this, now at distances like an light-year or longer you will probably get other stars disrupting the orbit by getting to close from time to time during the 5 billion years.\u003C/p\u003E\n"},{"CreatedByName":"_Augustus_","CreatedById":115084,"CreatedDateTime":"2015-08-25T21:22:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022magnemoe\u0022 data-cite=\u0022magnemoe\u0022\u003E\u003Cdiv\u003EProblem is that its an orbital telescope who scanned the entire sky and would found an Jupiter sized object out to 1 light-year away because of the IR radiation. \u003Cp\u003EWas another tread about this, now at distances like an light-year or longer you will probably get other stars disrupting the orbit by getting to close from time to time during the 5 billion years.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E Yes, but it wasn\u0027t looking for M8-class red dwarfs that were already cataloged. That will escape notice.\u003Cp\u003EHowever, the Gaia telescope should find it soon if it exists.\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-08-25T21:30:34Z","Content":"\n\u003Cp\u003ESo to summarize:\u003C/p\u003E\u003Cp\u003EThere is Zero evidence for this\u003C/p\u003E\u003Cp\u003EThe end\u003C/p\u003E\n"},{"CreatedByName":"MinimumSky5","CreatedById":115138,"CreatedDateTime":"2015-08-25T21:34:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022_Augustus_\u0022 data-cite=\u0022_Augustus_\u0022\u003E\u003Cdiv\u003EYes, but it wasn\u0027t looking for M8-class red dwarfs that were already cataloged. That will escape notice.\u003Cp\u003EHowever, the Gaia telescope should find it soon if it exists.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think you are seriously underestimating how bright a red dwarf is. As has already been mentioned in the thread, a red dwarf would be visible to the naked eye at 1LY, and gravitational effects mean that we would defiantly know about it from the Suns motion. Also, infrared observatories find all sorts of things that they weren\u0027t meant to, like comets and asteroids. If nemesis existed, we would know about it.\u003C/p\u003E\n"},{"CreatedByName":"Sampa","CreatedById":130079,"CreatedDateTime":"2015-08-25T21:36:22Z","Content":"\n\u003Cp\u003EWhat about relative motion making it stationary and thereby unnoticable?\u003C/p\u003E\n"},{"CreatedByName":"MinimumSky5","CreatedById":115138,"CreatedDateTime":"2015-08-25T21:41:28Z","Content":"\n\u003Cp\u003EBetelgeuse doesn\u0027t have much apparent motion, and is very visible. Stars move so slowly, that apparent and relative motion have no effect on their visibility.\u003C/p\u003E\n"},{"CreatedByName":"Albert VDS","CreatedById":74055,"CreatedDateTime":"2015-08-25T22:10:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sampa\u0022 data-cite=\u0022Sampa\u0022\u003E\u003Cdiv\u003EOk, astronomers have discovered that at least two thirds of the stars in the milky way are binary, meaning the stars,come in pairs. Some astronomers theorise that Sol, our sun, is no different, and that its twin is responsible for Earth\u0027s mass extinctions. What do you think? Does Nemesis exist?\u003Cp\u003EHere\u0027s a video to start the discussion:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://youtu.be/j1UE-8MkAIQ\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://youtu.be/j1UE-8MkAIQ\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou lost me at Sol...\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Sol\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Sol\u003C/a\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ESol is the Latin name for the Sun.\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"tkw","CreatedById":142638,"CreatedDateTime":"2015-08-25T22:28:39Z","Content":"\n\u003Cp\u003Eoh gawd\u003C/p\u003E\n"},{"CreatedByName":"Sampa","CreatedById":130079,"CreatedDateTime":"2015-08-25T23:26:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Albert VDS\u0022 data-cite=\u0022Albert VDS\u0022\u003E\u003Cdiv\u003EYou lost me at Sol...\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Sol\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Sol\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd i chose to use that name on purpose.\u003C/p\u003E\n"},{"CreatedByName":"Hagen von Tronje","CreatedById":148278,"CreatedDateTime":"2015-08-25T23:33:56Z","Content":"\n\u003Cp\u003EIt\u0027s one of the more interesting and less implausible theories to have no particularly good evidence. It would certainly be neater than a pocket on a shirt if it were true.\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-08-25T23:40:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Albert VDS\u0022 data-cite=\u0022Albert VDS\u0022\u003E\u003Cdiv\u003EYou lost me at Sol...\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Sol\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Sol\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPeople can call it what they want. As long you understand it, it\u0027s correct.\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2015-08-26T00:06:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MinimumSky5\u0022 data-cite=\u0022MinimumSky5\u0022\u003E\u003Cdiv\u003EI think you are seriously underestimating how bright a red dwarf is. As has already been mentioned in the thread, a red dwarf would be visible to the naked eye at 1LY, and gravitational effects mean that we would defiantly know about it from the Suns motion. Also, infrared observatories find all sorts of things that they weren\u0027t meant to, like comets and asteroids. If nemesis existed, we would know about it.\u003C/div\u003E\u003C/blockquote\u003E.\u003Cp\u003ELuminosity would be much less, a small red dwarf has a lifespan many fold that of our sun, the intensity would be much less, but still at one light year a red dwarf would be as visible as mars. In the IR spectrum it would be one of the brightest objects that is not otherwise designated. The problem here is that if its close enough for the sun to hold it then we would see it, and its so far you couldn\u0027t see it then there is nothing to stop a passing star from ripping it from its orbit and tossing it into a galactic orbit that we never see again. So then you have to make the object smaller and give it an eccentric orbit, but even. IR object of jupiters size would be detected far out in the system. Eventually the object is squeezed out of the binary range into a big oort cloud object. \u003C/p\u003E\u003Cp\u003EA big oort cloud object does what any other big object would do, it will clean the space in its orbit even an eccentric orbit. \u003C/p\u003E\u003Cp\u003EI have to agree this argument is far fetched.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2015-08-26T01:10:28Z","Content":"\n\u003Cp\u003EYes, in infrared it would be 100% impossible to avoid. There is literally zero evidence to back this idea up.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2015-08-26T02:58:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lajoswinkler\u0022 data-cite=\u0022lajoswinkler\u0022\u003E\u003Cdiv\u003EYes, in infrared it would be 100% impossible to avoid. There is literally zero evidence to back this idea up.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIts an old idea dating back before we had so good telescopes.\u003C/p\u003E\n"},{"CreatedByName":"Jovus","CreatedById":117163,"CreatedDateTime":"2015-08-26T03:38:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022_Augustus_\u0022 data-cite=\u0022_Augustus_\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ENemesis can not be a brown dwarf or gas giant because WISE was looking for those, whereas it wouldn\u0027t have cared about a red dwarf.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs someone who regularly uses that WISE survey, I can assure you that this is incorrect. There are plenty of red dwarfs in the data.\u003C/p\u003E\u003Cp\u003EThat said, I\u0027m not weighing in on this topic by pointing that out. Nemesis could still be a red dwarf that WISE simply missed, just like it could also be a brown dwarf or superjovian that WISE simply missed. (Or mis-cataloged. Or glitched out on. Or is indistinguishable from data artifacts. Or or or.)\u003C/p\u003E\n"},{"CreatedByName":"Xannari Ferrows","CreatedById":125369,"CreatedDateTime":"2015-08-26T04:36:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jovus\u0022 data-cite=\u0022Jovus\u0022\u003E\u003Cdiv\u003ENemesis could still be a red dwarf that WISE simply missed, ...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s easy to miss what is right in front of you sometimes.\u003C/p\u003E\n"}]}