{"TopicId":119341,"ForumId":16,"TopicTitle":"Megastructures, tips, tricks, traps, kraken repellent?","CreatedByName":"steuben","CreatedById":77368,"CreatedDateTime":"2015-08-25T18:21:24Z","PageNum":1,"Articles":[{"CreatedByName":"steuben","CreatedById":77368,"CreatedDateTime":"2015-08-25T18:21:24Z","Content":"\n\u003Cp\u003EOn the back of an envelope I have a sketch for a ship. My quick calculations put it at a dry mass in double digit megaton range, length is in the km range, crew one to two thousand kerbals and kerbalinas. \u003C/p\u003E\u003Cp\u003EI\u0027m looking for suggestions/recommendations on the following:\u003C/p\u003E\u003Cp\u003E1. how to design it out. I\u0027m thinking of a keel and spar design. Four or six modules hanging off each spar, in two rows in line with the keel.\u003C/p\u003E\u003Cp\u003E2. my module movers. LfO or Mono?\u003C/p\u003E\u003Cp\u003E3. fueling the construction. farm d and e asteroids or Minmus for the fuel? The ship itself will be fueled from Minmus.\u003C/p\u003E\u003Cp\u003E4. how to reduce encounters with the kraken and it\u0027s slightly more benign cousin the lag monster.\u003C/p\u003E\u003Cp\u003E5. anything else that I should be aware of\u003C/p\u003E\u003Cp\u003Econstraints and notes:\u003C/p\u003E\u003Cp\u003E1. I\u0027m working with stock parts. But, I\u0027m not modless, I\u0027m working with KER, RCS Build Aid, and Hyperedit in the design.\u003C/p\u003E\u003Cp\u003E2. I know I\u0027m going to have to do this in multiple launches. modules will probably be in the hundred ton range. which points to thousands of launches, or kilo-ton lifters, or both.\u003C/p\u003E\u003Cp\u003E3. I am well aware that I will be melting silicon supported by a liquid cryogen cooler. with the projected part count.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-26T13:08:45Z\u0022 title=\u002208/26/2015 01:08  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 26, 2015\u003C/time\u003E by steuben\u003C/strong\u003E\n\u003Cbr\u003Eadded adiitional note\n\u003C/span\u003E\n"},{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-08-25T18:32:12Z","Content":"\n\u003Cp\u003EHow many parts is it?\u003C/p\u003E\u003Cp\u003EI don\u0027t think any contemporary computer can handle anything above 500 parts at any reasonable framerate. Trying to operate near a 1000\u002B parts monstrosity will drop your framerate below 1FPS making every operation so hard to perform, you\u0027ll really wish to drop the whole design.\u003C/p\u003E\u003Cp\u003EMaybe, just maybe, if you create huge modules of 400 or so parts each in their own physics bubbles and then painstakingly bring them together you\u0027d be able to assemble it, though I wouldn\u0027t hold my breath, and even then it will be about useless as both it and any craft within range will run at \u0026lt;1FPS.\u003C/p\u003E\u003Cp\u003Emy final advice would be: don\u0027t do it. Or at least wait until 1.1; I\u0027m not sure if it can fix that problem but I\u0027m completely sure 1.0.4 is not up to the task.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-25T18:38:19Z\u0022 title=\u002208/25/2015 06:38  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 25, 2015\u003C/time\u003E by Sharpy\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Xannari Ferrows","CreatedById":125369,"CreatedDateTime":"2015-08-25T18:40:09Z","Content":"\n\u003Cp\u003EFirstly: Good lord, whose channel did you watch this time? You should know that there will be plenty of bugs with this kind of plan, and maybe even Mr. NaN.\u003C/p\u003E\u003Cp\u003E4 modules hanging off each spar would make the whole thing likely more accessible, so if you are going to make regular trips up to it, god help your computer, and you probably want to have as much elbow room as possible.\u003C/p\u003E\u003Cp\u003EI\u0027d personally go monopropellant, but it can depend on the module you\u0027re bringing up as well. Monopropellant if you want fine movement, and LFO of you want to not take a day.\u003C/p\u003E\u003Cp\u003EYou could design a module made to hold the asteroids, if you haven\u0027t already thought of that. Just be warned though: Mr. NaN loves asteroids.\u003C/p\u003E\u003Cp\u003ETo avoid encounters with the trio, use as little docking as possible, and try to clip as little parts as possible. Also, time warp is not your friend here.\u003C/p\u003E\u003Cp\u003EYou\u0027re crazy.\u003C/p\u003E\u003Cp\u003ECan I break the mold for a minute? I know you said you were only using stock parts, but KW would allow you to build heavier, slightly more efficient lifters, and cut down on your launch counter.\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-08-25T22:06:57Z","Content":"\n\u003Cp\u003E\u002B1 to what previous posters have said about trying to work with huge numbers of parts. 1.0.4 is really not up to it.\u003C/p\u003E\u003Cp\u003ENow, if you\u0027re willing to think slightly more modestly (i.e. a few hundred parts, ship mass of a few thousand tons, etc.), and you\u0027re simply looking for \u0022how can I assemble this thing in orbit\u0022 and want tips for large structures (especially if they have to have engines on them and withstand acceleration):\u003C/p\u003E\u003Cp\u003EBig structures that are connected via docking ports tend to be very \u0022floppy\u0022; docking ports aren\u0027t very stiff connections. One way to solve that (which I also find fun, since it gives kerbals a reason to EVA) is with deployable struts from the Kerbal Attachment System mod. There\u0027s a part included with that mod which is basically a \u0022strut socket\u0022. So you put those sockets around your docking ports on each section of your ship. You launch it, dock it to the main structure, and then send out a Kerbal on EVA to place a strut by first clicking on a socket from part A and then on a socket from part B.\u003C/p\u003E\u003Cp\u003EThis allows setting up struts between the two sections, which results in a nice, stiff design.\u003C/p\u003E\u003Cp\u003EI\u0027ve used this technique successfully (and it was fun!) to put together a deep-space exploration ship. I\u0027m running TAC-LS (so ships need to bring along food/water/oxygen), and Outer Planets (so missions take many years), and UKS (so it\u0027s possible to make a ship that\u0027s fully self-sufficient with greenhouses and such, but it takes a large crew and many different types of modules). Assembled a 2000-ton ship in three sections, works like a charm, no floppiness at all.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-25T23:37:47Z\u0022 title=\u002208/25/2015 11:37  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 25, 2015\u003C/time\u003E by Snark\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"steuben","CreatedById":77368,"CreatedDateTime":"2015-08-26T00:40:19Z","Content":"\n\u003Cp\u003Eto answer in sequence\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sharpy\u0022 data-cite=\u0022Sharpy\u0022\u003E\u003Cdiv\u003EHow many parts is it?\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Efirst order approximation... 2400... no sorry. i dropped a decimal point. 240,000. dry mass maybe not in the megaton range... 72 kilotons which doesn\u0027t feel right. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Xannari Ferrows\u0022 data-cite=\u0022Xannari Ferrows\u0022\u003E\u003Cdiv\u003EFirstly: Good lord, whose channel did you watch this time?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECBC about 25, 26 years ago on a Sunday evening, 7:00 PM, 7:30 in Newfoundland. But that might be a good idea, a video series on getting this thing built. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Xannari Ferrows\u0022 data-cite=\u0022Xannari Ferrows\u0022\u003E\u003Cdiv\u003EYou\u0027re crazy.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes. Yes I am.\u003C/p\u003E\u003Cp\u003EYeah the docking ports are floppy. If I recall correctly you can minimize it by using multiple ports. However, that was back in the 0.2x\u0027s. I think things got redone for either .9x or 1.0x. But i\u0027m not sure.\u003C/p\u003E\u003Cp\u003EAs for the 1.04 will melt if I try. \u003C/p\u003E\u003Cp\u003EBy the time i\u0027m ready to build it, 1.5 will probably be out.\u003C/p\u003E\n"},{"CreatedByName":"Asharad","CreatedById":107448,"CreatedDateTime":"2015-08-26T00:44:29Z","Content":"\n\u003Cp\u003EMy current built is at 400 parts and growing. I did experience spontaneous implosion once, but a quick save fixed that.\u003C/p\u003E\n"},{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-08-26T05:20:09Z","Content":"\n\u003Cp\u003E2,400 might be vaguely possible on a very strong computer, although already useless. Maybe 10,000 if you tweak physics and graphics for performance (although it will behave wonky and look crap). 240,000 - nope, not a shade of a chance. Especially that even if you got some magical computer that could run it, the structure would behave like jelly.\u003C/p\u003E\u003Cp\u003EOne way to really big ships is Tweakscale. Thanks to it you can reduce the part count by making already big parts much bigger. But it you want the huge number of details, your plan is simply not realistic for KSP.\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2015-08-26T08:11:37Z","Content":"\n\u003Cp\u003EStanford Torus mod looks like what you describe.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/84106-0-90-Stanford-Torus-0-6\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/84106-0-90-Stanford-Torus-0-6\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAs you can see, it consists of just several complicated parts, so part count is very low, which allows FPS to be more or less appropriate.\u003C/p\u003E\u003Cp\u003EA funny problem with it.\u003C/p\u003E\u003Cp\u003EAs any craft gets loaded only when it is inside the physical range from you (usually, ~2 km),\u003C/p\u003E\u003Cp\u003Ethis huge torus appears at lightning speed right before your face when you approach to it.\u003C/p\u003E\u003Cp\u003EAnother sample of super-structure is Katlantis Hotel from an old movie.\u003C/p\u003E\u003Cp\u003EAlso with low part count as I can see.\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/2Z8TGJH4hrI?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EWayland has several beautiful samples.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/24677-%280-23%29-Wayland-Corp-Development-and-released-download-Thread-%28new-parts%29\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/24677-%280-23%29-Wayland-Corp-Development-and-released-download-Thread-%28new-parts%29\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESo, maybe if you use Ubiozur Welding Continued mod to pack many parts together, the Kraken will be indulgent to you.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/107273-0-90-UbioZur-Welding-Ltd-Continued-2-1-1-%282015-01-14%29?p=2113214\u0026amp;viewfull=1#post2113214\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/107273-0-90-UbioZur-Welding-Ltd-Continued-2-1-1-%282015-01-14%29?p=2113214\u0026amp;viewfull=1#post2113214\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EOf course, TweakScale can be useful to increase your creation.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-26T08:16:25Z\u0022 title=\u002208/26/2015 08:16  AM\u0022 data-short=\u00228 yr\u0022\u003EAugust 26, 2015\u003C/time\u003E by kerbiloid\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Mikki","CreatedById":137508,"CreatedDateTime":"2015-08-26T08:13:27Z","Content":"\n\u003Cp\u003EHi steuben\u003C/p\u003E\u003Cp\u003EThis is something that makes my \u003Cstrong\u003E\u003Cem\u003Eliquid cooled\u003C/em\u003E\u003C/strong\u003E i7 4770 4-core CPU slightly boil:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/0gNv6w1.png\u0022 alt=\u00220gNv6w1.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EMy system can handle about 450 parts without lag, 550 still good playable, 700\u002B parts start attracting various krakenattacks, namely out-of-warp insta-whobble/ unplanned disassembly/ random explosions/ bending/ non responsive UI.\u003C/p\u003E\u003Cp\u003EI keep limiting myself to \u0022reasonable\u0022 500 parts for a interplanetary assembly, no way around in 32-bit. I wait for a 64-bit release, however.\u003C/p\u003E\u003Cp\u003EIn my system launching a 1000\u002B part 3000\u002B tonne vessel results in immediate CTD...\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E... (Windows 10)\u003C/p\u003E\n"},{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-08-26T09:23:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mikki\u0022 data-cite=\u0022Mikki\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EIn my system launching a 1000\u002B part 3000\u002B tonne vessel results in immediate CTD...\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E... (Windows 10)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn all fairness, vessels behave a little better in vacuum - keyword \u0022a little\u0022. You can get away with roughly twice the part limit of Kerbin (if you count the launch stages). So if you can get three 500-part modules into orbit (on top of dispsable 200-part launch stages) you should be able to assemble a 1500 part orbital station.\u003C/p\u003E\u003Cp\u003EStill a far cry from 240,000.\u003C/p\u003E\u003Cp\u003Ealso keyword: station. Don\u0027t try to move it.\u003C/p\u003E\n"},{"CreatedByName":"eonmoon","CreatedById":137279,"CreatedDateTime":"2015-08-26T14:49:08Z","Content":"\n\u003Cp\u003Ethe only way I see if you want a really huge ship like that, will require mks/oks of the UKS systems by roverdude, extraplanetary launchpads to have a orbital spacedock, and ubio? weld to make your parts fused to cut down your part count for a mega vessel\u003C/p\u003E\u003Cp\u003E edit make sure crew modules aren\u0027t part of the weld, cause welding welds the doors shut\u003C/p\u003E\n"},{"CreatedByName":"GluttonyReaper","CreatedById":59429,"CreatedDateTime":"2015-08-26T14:55:21Z","Content":"\n\u003Cp\u003EYou might want to check this guy\u0027s stuff out:\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/gd-V_26ROV4?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EHe\u0027s kind of known for building massive ships. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"xtoro","CreatedById":79015,"CreatedDateTime":"2015-08-26T15:48:54Z","Content":"\n\u003Cp\u003EUse procedural tanks and structures. This might reduce your part count below 100k \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Norcalplanner","CreatedById":112223,"CreatedDateTime":"2015-08-26T17:14:43Z","Content":"\n\u003Cp\u003EI\u0027m going to put in a plug for Kerbal Joint Reinforcement and SpaceY. KJR strengthens all the connections, including docking ports, reducing the need for struts. SpaceY includes 3.75m and 5m docking ports which are much stronger than anything in stock. The largest station I ever built, with room for over a thousand Kerbals, was launched in three big sections, with the only connection between sections being a 5m docking port.\u003C/p\u003E\u003Cp\u003EP.s. Think really hard about whether you want to do this. A two minute docking maneuver will take 30 minutes or more due to lag.\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-08-26T17:41:07Z","Content":"\n\u003Cp\u003EJust to bring things back to the original poster\u0027s question-- 240K parts is utterly, mathematically insane. Complexity of physical simulations goes up with the square of the number of parts. It\u0027s not just that \u00221.04 can\u0027t handle it,\u0022 but rather \u0022no version of the game can handle it until computers are thousands of times more powerful than they are now.\u0022 Going to 1.1 with multithreading, etc. might (I say \u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cem\u003Emight\u003C/em\u003E\u003C/span\u003E) raise the number-of-parts ceiling by a small factor, on the order of \u0022how many cores do you have in your machine\u0022. So maybe, for example, you\u0027ll be able to get away with a 2000-part craft where now you can only do 500, that sort of thing. (Again, just rough speculation.)\u003C/p\u003E\u003Cp\u003EBut there\u0027s no way it\u0027s even \u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cem\u003Evaguely\u003C/em\u003E\u003C/span\u003E going to allow super-complex systems like you\u0027re describing.\u003C/p\u003E\u003Cp\u003ESo, as far as this thread is concerned: Does that mean that your question is answered (i.e. \u0022No, I can\u0027t do this, and will never be able to for the foreseeable future, so further discussion is pointless\u0022)?\u003C/p\u003E\u003Cp\u003EOr are you interested in big-ships-in-general, and you\u0027re still interested in techniques for (say) a 1000-part ship, or things of that general order of magnitude?\u003C/p\u003E\n"},{"CreatedByName":"steuben","CreatedById":77368,"CreatedDateTime":"2015-08-26T19:50:49Z","Content":"\n\u003Cp\u003EIf I wasn\u0027t aware about the issue of the part count before starting the project, I am now. It no longer needs to be communicated, reiterated or discussed. I am aware of just how hard I will be pushing ksp and my machine.\u003C/p\u003E\u003Cp\u003EThe OP question set still remains open.\u003C/p\u003E\u003Cp\u003ETechniques for the kilo-part range will be entertained.\u003C/p\u003E\n"},{"CreatedByName":"Admac","CreatedById":126280,"CreatedDateTime":"2015-08-26T22:34:36Z","Content":"\n\u003Cp\u003ELol @ a 240000 parts\u003C/p\u003E\u003Cp\u003EStep 1) get mech jeb for that auto docking\u003C/p\u003E\u003Cp\u003EStep 2) Read good series of books\u003C/p\u003E\u003Cp\u003EStep 3) Maybe clean the house a bit?\u003C/p\u003E\u003Cp\u003EStep 4) Pick up an interesting hobby, like wood working or bonsai.\u003C/p\u003E\u003Cp\u003EStep 5) launch next part...\u003C/p\u003E\u003Cp\u003EI went crazy and did a 2000 part vessel early early 1.02ish and it was like an hour ish to dock an agile light lander to it. I honestly hove no idea how long it would take if the scene parts were much higher than that. I mean with the right packs you can build awesome 100ish kerbal stations that fully loaded are 4000ish tons with centuries of life support and deployable shipyards and a lander and still be under 100 parts. In my opinion that\u0027s closer to where the fun lives. Not to dis on bonsai or anything. And having a clean house is pretty sweet, so there are perks to each way.\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-08-27T03:27:41Z","Content":"\n\u003Cp\u003EAside from using Kerbal Attachment System to add deployable struts around docked sections (to add stiffness), another tactic is to use mods that allow you to keep part count down. Tweakscale has already been mentioned. Another handy one is RoverDude\u0027s UKS/MKS mod-- it has some parts that can help keep part count down, including:\u003C/p\u003E\u003Cp\u003E- A variety of spherical fuel tanks in many sizes, up to a monster that weighs \u0026gt;2000 tons when full. (And can be configured to be either LFO or liquid-fuel only, in case you\u0027re looking to power it with nukes.) All the fuel you need, just one part.\u003C/p\u003E\u003Cp\u003E- A nuclear reactor that generates oodles of electricity. Again, one big part.\u003C/p\u003E\u003Cp\u003EPorkjet\u0027s mod \u003Ca href=\u0022https://kerbalstuff.com/mod/744/Atomic%20Age\u0022 rel=\u0022external nofollow\u0022\u003EAtomic Age\u003C/a\u003E includes a large nuclear-powered engine that gives 450 kN thrust, so does the work of 7.5 LV-N\u0027s in one part.\u003C/p\u003E\n"},{"CreatedByName":"Mikki","CreatedById":137508,"CreatedDateTime":"2015-08-27T10:07:26Z","Content":"\n\u003Cp\u003EHi steuben\u003C/p\u003E\u003Cp\u003EHowever, to reduce partcount i suggest \u0022STOCK FUEL SWITCH\u0022 Mod, make any tank LF only (for the nuke engines...), gives you more freedom in your interplanetary vessel designs.\u003C/p\u003E\u003Cp\u003EActually i use KJR too, no way around it with large assemblys. The amount of struts (draggy) can also be massively improved with KJR.\u003C/p\u003E\u003Cp\u003EGood luck with going AWESOME! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"tbarcello","CreatedById":147952,"CreatedDateTime":"2015-08-27T12:10:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Snark\u0022 data-cite=\u0022Snark\u0022\u003E\u003Cdiv\u003E\u002B1 to what previous posters have said about trying to work with huge numbers of parts. 1.0.4 is really not up to it.\u003Cp\u003ENow, if you\u0027re willing to think slightly more modestly (i.e. a few hundred parts, ship mass of a few thousand tons, etc.), and you\u0027re simply looking for \u0022how can I assemble this thing in orbit\u0022 and want tips for large structures (especially if they have to have engines on them and withstand acceleration):\u003C/p\u003E\u003Cp\u003EBig structures that are connected via docking ports tend to be very \u0022floppy\u0022; docking ports aren\u0027t very stiff connections. One way to solve that (which I also find fun, since it gives kerbals a reason to EVA) is with deployable struts from the Kerbal Attachment System mod. There\u0027s a part included with that mod which is basically a \u0022strut socket\u0022. So you put those sockets around your docking ports on each section of your ship. You launch it, dock it to the main structure, and then send out a Kerbal on EVA to place a strut by first clicking on a socket from part A and then on a socket from part B.\u003C/p\u003E\u003Cp\u003EThis allows setting up struts between the two sections, which results in a nice, stiff design.\u003C/p\u003E\u003Cp\u003EI\u0027ve used this technique successfully (and it was fun!) to put together a deep-space exploration ship. I\u0027m running TAC-LS (so ships need to bring along food/water/oxygen), and Outer Planets (so missions take many years), and UKS (so it\u0027s possible to make a ship that\u0027s fully self-sufficient with greenhouses and such, but it takes a large crew and many different types of modules). Assembled a 2000-ton ship in three sections, works like a charm, no floppiness at all.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh, i really wanna show you what happened to me yesterday when i was reinforcing with struts. And I can, because i got it ON VIDEO! I\u0027ll still have to upload it to my youTube channel. Same nickname, check it out on weekend, it will be in my fails playlist. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"}]}