{"TopicId":119455,"ForumId":16,"TopicTitle":"Take off help!","CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2015-08-27T00:20:15Z","PageNum":1,"Articles":[{"CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2015-08-27T00:20:15Z","Content":"\n\u003Cp\u003EI stopped playing when 1.0 came out. I\u0027m trying to relearn this and having issues.\u003C/p\u003E\u003Cp\u003EMy main issue is how to take off now. Every time I try I get the wobbles and lean to the sie and crash. It\u0027s like it\u0027s impossible to takeoff without every micro inch of your plane trying to destroy you.. And I see now way to look into this or deal with it in designe. I\u0027m not sure what I am doing wrong atm. Is it possible to have too much thrust now or something. It\u0027s like all of those old problems with landingear are alive and kicking. \u003C/p\u003E\u003Cp\u003EI\u0027m currently flying a 25-50t aircraft with 4 turbojets 1 rapier up and running on takeoff... I have tricycle setup. Every time I hit near takeoff speeds it dives to one side. I\u0027m using the large landing gear. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1262.photobucket.com/albums/ii613/PicsMe101/KSP/Screenshot%20from%202015-08-26%2020-15-36_zpscn3zgqzx.png\u0022 alt=\u0022Screenshot%20from%202015-08-26%2020-15-36_zpscn3zgqzx.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Okie Rocket","CreatedById":103418,"CreatedDateTime":"2015-08-27T00:27:29Z","Content":"\n\u003Cp\u003EAt a guess, I\u0027d say your rear landing gear are too far back from the CoL. It might need some extra control surfaces, too.\u003C/p\u003E\n"},{"CreatedByName":"peachoftree","CreatedById":110108,"CreatedDateTime":"2015-08-27T00:34:33Z","Content":"\n\u003Cp\u003EThe large landing gear is probably overkill for a plane that small, I would go with the medium or even the small so that the center of mass is closer to the ground\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-08-27T00:36:31Z","Content":"\n\u003Cp\u003EShow us a screenshot of the CoM/CoL markers. In addition to the gear being too far back, that seems like a really heavy plane. You do have a massive amount of trust for a plane that size, one of those engines should be enough, and once you lose the weight from the gear and the engines, go to smaller wings and lose some more.\u003C/p\u003E\n"},{"CreatedByName":"JTpopcorn","CreatedById":130311,"CreatedDateTime":"2015-08-27T02:18:54Z","Content":"\n\u003Cp\u003EA few things wrong with that plane,\u003C/p\u003E\u003Cp\u003Etoo much thrust,\u003C/p\u003E\u003Cp\u003Etoo much gear,\u003C/p\u003E\u003Cp\u003Eand too little length,\u003C/p\u003E\u003Cp\u003EWith the update drag is calculated differenntly, so making planes aerodynamic helps.\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-08-27T02:56:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JTpopcorn\u0022 data-cite=\u0022JTpopcorn\u0022\u003E\u003Cdiv\u003EA few things wrong with that plane,\u003Cp\u003Etoo much thrust,\u003C/p\u003E\u003Cp\u003Etoo much gear,\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003Eand too little length,\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EWith the update drag is calculated differenntly, so making planes aerodynamic helps.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELength has nothing to do with it. (That is stock, it\u0027s using Ven\u0027s Stock Revamp, and it\u0027s thrust limited to ensure it is a plane, not a rocket. Flies beautifully)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/TZ79lMY.png\u0022 alt=\u0022TZ79lMY.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"tbarcello","CreatedById":147952,"CreatedDateTime":"2015-08-27T03:27:54Z","Content":"\n\u003Cp\u003EDifficult to say, but imho the center of lift is in front of center of mass on this thing. With such a power, it should be way behind. Then make sure you disable yaw and roll on those wings, enable just yaw on the tail and roll with reactive wheels if u got those. Also, be gentle with controls, press Caps Lock for that.\u003C/p\u003E\n"},{"CreatedByName":"Belphegor","CreatedById":118918,"CreatedDateTime":"2015-08-27T05:45:45Z","Content":"\n\u003Cp\u003Emy experience with these things is limited but i would try sticking some control surfaces to the tail fin. i recently had a similar problem with an MK3 plane veering off the runway no matter what i did and a bigger tailfin with added control surfaces kept it stable until the end of the runway (before violently dissintegrating into many pieces because MK3 parts seem to be held together with glue)\u003C/p\u003E\n"}]}