{"TopicId":119504,"ForumId":70,"TopicTitle":"(Solved)Bug: Annoying LF crossfeed (unused Oxidizer)","CreatedByName":"csadens","CreatedById":150313,"CreatedDateTime":"2015-08-27T16:32:35Z","PageNum":1,"Articles":[{"CreatedByName":"csadens","CreatedById":150313,"CreatedDateTime":"2015-08-27T16:32:35Z","Content":"\n\u003Cp\u003EI\u0027ve been reading about the intended feature of air breathing engines using up all liquid fuel in the SAME STAGE, but I believe I have a bug here where I moved my LF\u002BO rockets into a different stage than my air breathing engines, however the air breathing engines are STILL pulling liquid fuel out of the LF\u002BO tanks. This is extremely annoying because the spaceplane uses Whiplash and Nerv and is full of liquid fuel only tanks, however there are 3 radially attached solid fuel boosters with radially attached LF\u002BO boosters attached to the SRB\u0027s (so the liquid fuel would have to travel through 2 raised radial decouplers AND solid rocket fuel ??? what ???). The staging is supposed to go:\u003C/p\u003E\u003Cp\u003EIgnite air breathing engines (while still connected to the support towers, waiting until thrust rises), disconnect support towers and ignite SRB\u0027s as well as the liquid fuel boosters simultaneously, liquid boosters drain and release, SRB\u0027s drain and release, Whiplash engines flame out, Nerv rockets ignite. Simple, right?\u003C/p\u003E\u003Cp\u003EWell, no matter what configuration I have tried (attaching via decouplers, stack separators, nosecones, docking ports, structural pylons, switching the stages of the engines, etc) I am still left over with unused Oxidizer in my LF\u002BO tank. Yes, I know air breathing engines ignore crossfeed. This is a bug, hate to break it to you. It\u0027s a game breaking bug, making this game unplayable for me without a complete redesign of the spacecraft, and inability to use the air breathing engines concurrently with solid and liquid fuel boosters. I have literally tried every imaginable configuration, even connecting a radial decoupler to a stack decoupler and it still drains the LF from the LF\u002BO tank. It\u0027s really quite simply a waste of oxidizer, and mass.\u003C/p\u003E\u003Cp\u003EIn the mean time while devs work to fix it, are there any mods that are available for version 1.0.4 that will allow me to use normal fuel flow ? Or am I stuck having to deal with the inefficiency? Thanks for your time.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-27T20:37:55Z\u0022 title=\u002208/27/2015 08:37  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 27, 2015\u003C/time\u003E by csadens\u003C/strong\u003E\n\u003Cbr\u003Esolved\n\u003C/span\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-08-27T17:09:12Z","Content":"\n\u003Cp\u003EIt\u0027s not a bug, it\u0027s supposed to work that way, for better or worse. I have mixed feelings on it, sometimes it makes a craft work better, sometimes worse.\u003C/p\u003E\u003Cp\u003EIf you want to revert jets to honoring crossfeed rules, just remove the lines that say \u0022resourceFlowMode = STAGE_PRIORITY_FLOW\u0022 from each airbreathing engine\u0027s cfg file. Not sure if there is a mod or MM cfg that does this automagically for you, but it is only three cfgs to edit.\u003C/p\u003E\n"},{"CreatedByName":"csadens","CreatedById":150313,"CreatedDateTime":"2015-08-27T20:34:58Z","Content":"\n\u003Cp\u003EEditing the CFG file did the trick, thanks a lot! Now I can route my fuel lines (like the game was intended to do) not have to worry about my LF\u002BO being drained. IMO, liquid fuel should HAVE to run through fuel lines, otherwise the game makes no sense \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Again thank you! Worked a charm.\u003C/p\u003E\n"}]}