{"TopicId":119663,"ForumId":34,"TopicTitle":"[1.0.4] Contract Pack: Maritime Missions and Boat Navigation Plugin [V1.3.2] 14/09/2015","CreatedByName":"Whitecat106","CreatedById":140086,"CreatedDateTime":"2015-08-29T15:32:40Z","PageNum":1,"Articles":[{"CreatedByName":"Whitecat106","CreatedById":140086,"CreatedDateTime":"2015-08-29T15:32:40Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EMaritime Missions Pack \u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nA series of missions set at sea for a better use of Kerbin\u0027s vast oceans!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003EDescription:\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThis contract pack currently adds 28 missions (8 repeatable), which range from SOS investigations to Deep Sea Diving, this pack is intended for use alongside \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/125063-Maritime-Pack-Alpha-Release\u0022 rel=\u0022external nofollow\u0022\u003EFengist\u0027s Maritime Pack\u003C/a\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00226hwYB4i.png\u0022 src=\u0022http://i.imgur.com/6hwYB4i.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003EContents:\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n- 5x S.O.S missions where the objective is to rendezvous with a sinking ship and recover its crew. (More to come)\n\u003C/p\u003E\n\u003Cp\u003E\n- 5x Space Hardware Recovery missions where the objective is to return spent boosters/ splashed crewed pods to the KSC.\n\u003C/p\u003E\n\u003Cp\u003E\n- 2x Repeatable Scuttle missions, destroy a vessel in a location to build an artificial reef.\n\u003C/p\u003E\n\u003Cp\u003E\n- 2x Wreck Investigation missions, visit the site of a wrecked ship. (More to come)\n\u003C/p\u003E\n\u003Cp\u003E\n- 3x Diving missions to reach various depths at specific locations (More to come)\n\u003C/p\u003E\n\u003Cp\u003E\n- 3x Buoy deployment missions to deploy buoys at specific locations (More to come)\n\u003C/p\u003E\n\u003Cp\u003E\n- 2x Derelict investigation missions to investigate sightings of missing vessels (More to come)\n\u003C/p\u003E\n\u003Cp\u003E\n- 3x Cruise missions, visit multiple destinations across Kerbin and return to the KSC for a large payout. (More to come)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003EFuture Plans:\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n- Implementation of Contract Configurator\u0027s new DialogBox behavior.\n\u003C/p\u003E\n\u003Cp\u003E\n- More waypoint trickery for Returning to KSC docks.\n\u003C/p\u003E\n\u003Cp\u003E\n- Diving relics such as Atlantis and sunken ships.\n\u003C/p\u003E\n\u003Cp\u003E\n- More of each type of mission.\n\u003C/p\u003E\n\u003Cp\u003E\n- River cruises.\n\u003C/p\u003E\n\u003Cp\u003E\n- Transoceanic cruises. -- Added in V1.0.2 (More to come)\n\u003C/p\u003E\n\u003Cp\u003E\n- Exploration missions and Circumnavigation.\n\u003C/p\u003E\n\u003Cp\u003E\n- Greater depth to the Derelict investigation story lines (Flying Dutchman, Mary Celeste, Serendipity).\n\u003C/p\u003E\n\u003Cp\u003E\n- More repeatable missions.\n\u003C/p\u003E\n\u003Cp\u003E\nFurther ideas are welcome!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EBoat Navigation Plugin \u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nA small plugin which adds background movement of vessels in water from place to place in real time or in time warp.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003EDescription:\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThis plugin adds navigation commands and a library of location coordinates for vessels to move to when not active, the progression from one point to another can be interrupted at anytime by switching to the navigating vessel. Furthermore it (as of 1.3.0) adds direct sea spawning options for SPH vessels.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022N5xe4Hn.png\u0022 src=\u0022http://i.imgur.com/N5xe4Hn.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003EContents:\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n- Ability to enter a desired Latitude, Longitude and Speed to navigate to from the vessels current position.\n\u003C/p\u003E\n\u003Cp\u003E\n- Ability to select and add a new destination to a library of 25 named locations around Kerbin. (Eve and Laythe to come)\n\u003C/p\u003E\n\u003Cp\u003E\n- The vessel will move in real time or in timewarp across the surface of Kerbin in the background, at intervals of 30 seconds per position update (to avoid lag).\n\u003C/p\u003E\n\u003Cp\u003E\n- Ability to spawn a vessel directly into the sea! (No more complex ship carrying rovers!)\n\u003C/p\u003E\n\u003Cp\u003E\nThis all means that a voyage that would normally take hours of 4x physics warp can now be achieved by setting a destination and a speed, switching to do something else and returning to the vessel once it has arrived (or at various points across its journey)!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003EFuture Plans:\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n- Capping of the speed input field to the max speed of a vessel (if anyone knows how I could work out the max speed from a vessels part information please let me know!)\n\u003C/p\u003E\n\u003Cp\u003E\n- Optimization of Config loading code\n\u003C/p\u003E\n\u003Cp\u003E\n- Active vessel navigation (currently only SAS steering to desired bearing)\n\u003C/p\u003E\n\u003Cp\u003E\n- Possible branching into Rover Navigation (now possible by adaption of this plugin - Interested parties please message me)\n\u003C/p\u003E\n\u003Cp\u003E\n- Locations and name suggestions are welcome for addition to the coordinate library!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003EDependencies:\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/101604\u0022 rel=\u0022external nofollow\u0022\u003EContract Configurator V1.7.0\u003C/a\u003E or greater - Required for any contract to work.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/125063-Maritime-Pack-Alpha-Release\u0022 rel=\u0022external nofollow\u0022\u003EFengist\u0027s Maritime Pack V0.1.4\u003C/a\u003E or greater - Required for the contract to spawn vessels (necessary for all missions except Recovery and Diving).\n\u003C/p\u003E\n\u003Cp\u003E\nI would also highly recommend \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/92514\u0022 rel=\u0022external nofollow\u0022\u003EKAS\u003C/a\u003E to assist with recovery contracts, furthermore \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/85209\u0022 rel=\u0022external nofollow\u0022\u003EBDArmoury\u003C/a\u003E may be helpful for the Scuttle missions to destroy the required vessels.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EDownload\u003C/span\u003E\u003C/span\u003E:\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12px;\u0022\u003ERelease \u0026amp; Source:\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://kerbalstuff.com/mod/1121/Contract%20Pack:%20Maritime%20Missions%20and%20Boat%20Navigation%20Plugin\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EKerbalStuff\u003C/span\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThis download contains both the Contract Pack and the Navigation Plugin, I would recommend keeping both unless you are a diehard salty sea Kerbal that\u0027s determined to visit each location in real time.. In which case I salute you!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003ELicense:\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThis pack and associated plugin is Licensed under \u003Ca href=\u0022https://creativecommons.org/licenses/by-nc-sa/4.0/\u0022 rel=\u0022external nofollow\u0022\u003ECC-BY-NC-SA-4.0\u003C/a\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nCredit is also noted for nightingale for a derivation of his SpawnVessel code used in ContractConfigurator under the MIT license, without it the Navigation plugin would not exist!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003EOther Mods by me:\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/129734-1-0-4-Orbital-Decay-V1-0-0-Full-Release-%2806-08-2015%29?p=2101142#post2101142\u0022 rel=\u0022external nofollow\u0022\u003EOrbital Decay\u003C/a\u003E - Add realistic orbital decay in the background to all vessels on or off rails, in or out of timewarp.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/123453-1-0-4-Contract-Pack-Historic-Missions-V1-4-0-01-08-2015\u0022 rel=\u0022external nofollow\u0022\u003EHistoric Missions Pack \u003C/a\u003E- A series of 400 contracts based on real space missions spanning from 1945 to 2015.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-03-24T15:02:19Z\u0022 title=\u002203/24/2016 03:02  PM\u0022 data-short=\u00228 yr\u0022\u003EMarch 24, 2016\u003C/time\u003E by Whitecat106\u003C/strong\u003E\n\u003Cbr\u003EUpdate - Bugfix\n\u003C/span\u003E\n"},{"CreatedByName":"Whitecat106","CreatedById":140086,"CreatedDateTime":"2015-08-29T22:11:28Z","Content":"\n\u003Cp\u003ECurrent Issues: \u003C/p\u003E\u003Cp\u003E- Max speed in the plugin destination tab is not capped to the vessels max speed (Just don\u0027t cheat okay?) - Hopefully I can work out a way of calculating the maximum possible speed of a vessel some how... \u003C/p\u003E\u003Cp\u003E- During high timewarp a forceful interrupt will occur if a background vessel reaches its destination cutting the timewarp rate to 0 instantly, this spike drops FPS momentarily, in the next plugin update I will change this to a slow spool down. \u003C/p\u003E\u003Cp\u003E- There are probably one or two issues with some contracts (should be alright but if there are any issues please let me know) \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ENext update (V1.1.0) plans:\u003C/p\u003E\u003Cp\u003E- More contracts, plugin vessel max speed cap, plugin support for vessels moving across shore biomes (navigation during river travel) and bugfixes! Enjoy \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"colmo","CreatedById":25950,"CreatedDateTime":"2015-08-30T11:15:36Z","Content":"\n\u003Cp\u003EThis will be even more fun when Infinite Dice refreshes his Boat Parts pack. I recommend adding KerbinSide bases to the preset coordinates.\u003C/p\u003E\u003Cp\u003EAbout the plugin - if two points on the ocean are not navigable in a straight line, does it plot a path to avoid intervening landmasses? What happens if there is no solution to this problem (i.e. the craft is in a landlocked water body)? Can it be used to navigate the rivers?\u003C/p\u003E\n"},{"CreatedByName":"Whitecat106","CreatedById":140086,"CreatedDateTime":"2015-08-30T12:59:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022colmo\u0022 data-cite=\u0022colmo\u0022\u003E\u003Cdiv\u003EThis will be even more fun when Infinite Dice refreshes his Boat Parts pack. I recommend adding KerbinSide bases to the preset coordinates.\u003Cp\u003EAbout the plugin - if two points on the ocean are not navigable in a straight line, does it plot a path to avoid intervening landmasses? What happens if there is no solution to this problem (i.e. the craft is in a landlocked water body)? Can it be used to navigate the rivers?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIndeed Infinte Dice\u0027s pack was one of the best of all time, however Fegists pack is really coming along fast! \u003C/p\u003E\u003Cp\u003EI will look into adding Kerbin Side bases, all it really needs is one big port somewhere that can launch vessels directly into the water but I don\u0027t think this has yet been done in Kerbin Side. \u003C/p\u003E\u003Cp\u003EAt the moment no, there is no fancy path plotting (I will look into it), basically right now the ideal route of getting places would be to go from point to point to avoid the next coordinate lying within a biome other than water (if the biome is not water the code notifies the user that the auto navigation has been turned off leaving the vessel at the last \u0027jump\u0027 coordinate before the \u0027bad\u0027 coordinate was processed, this means the user has to enter a new coordinate to navigate to instead), I will produce a map this afternoon of all the coordinates in the Library so that these may be used as individual points. \u003C/p\u003E\u003Cp\u003EI aimed to try and make the plugin as non cheaty and realistic as possible hence why the vessel isn\u0027t just teleported to the new location after a set time, however I was thinking that a series of waypoints (coordinates) could be entered by the user into a list on the UI and the navigation code would then go to each point in order (kind of basic user made pathfinding). This would mean that the user would not have to switch to the vessel 3/4 times to set new coordinates especially with locations on the West Side of Kerbin that are a real pain to get to. \u003C/p\u003E\u003Cp\u003EAs for rivers: since the code currently stops navigation when the biome is not water, and that all of the rivers on Kerbin are in a shores biome there is no way of differentiating between solid ground and water (even altitude/height doesn\u0027t seem to work as an indication due to the PQS stuff to do with Kerbin), so navigation across rivers is going to take a while (I just don\u0027t want to end up beaching anyone\u0027s boat). However the Library does contain coordinates for the Delta of each major river on Kerbin, so these can be navigated too but in the meantime the player must navigate the river themselves sorry \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe landlocked problem I think would only be solved with a Kerbin Side base, I will look into this but I am no part modeller..nor texture maker of any kind so it may take a while.. \u003C/p\u003E\u003Cp\u003EEnjoy anyway! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E I will look into Kerbin Side this afternoon and make an in game displayable map showing all the locations in the library!\u003C/p\u003E\u003Cp\u003EEdit: 15:03 I have fixed the logo issue in the contract pack where the logo\u0027s were not appearing correctly. Updated to 1.0.3\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-30T14:04:19Z\u0022 title=\u002208/30/2015 02:04  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 30, 2015\u003C/time\u003E by Whitecat106\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"colmo","CreatedById":25950,"CreatedDateTime":"2015-08-30T14:14:29Z","Content":"\n\u003Cp\u003EThe Oceania pack has water launch sites, but wasn\u0027t up to date for a recent KS release, so wasn\u0027t included.\u003C/p\u003E\u003Cp\u003EIf a boat uses fuel, some sort of means of depleting it would stop oceanic travel on zero fuel.\u003C/p\u003E\u003Cp\u003EAre craft oriented in the direction they are navigating to? We don\u0027t want them heading off on the wrong direction the moment they are switched back to.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-30T14:17:35Z\u0022 title=\u002208/30/2015 02:17  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 30, 2015\u003C/time\u003E by colmo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"wasml","CreatedById":120438,"CreatedDateTime":"2015-08-30T15:45:55Z","Content":"\n\u003Cp\u003ENavigation plugin - great idea! Downloaded.\u003C/p\u003E\n"},{"CreatedByName":"Whitecat106","CreatedById":140086,"CreatedDateTime":"2015-08-30T17:00:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022colmo\u0022 data-cite=\u0022colmo\u0022\u003E\u003Cdiv\u003EThe Oceania pack has water launch sites, but wasn\u0027t up to date for a recent KS release, so wasn\u0027t included.\u003Cp\u003EIf a boat uses fuel, some sort of means of depleting it would stop oceanic travel on zero fuel.\u003C/p\u003E\u003Cp\u003EAre craft oriented in the direction they are navigating to? We don\u0027t want them heading off on the wrong direction the moment they are switched back to.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI will look into what I can do about the Oceana pack tonight, at the moment I have just completed some work on v1.1.0 mostly to do with the plugin, a labelled map view is now avaliable for locations on both Kerbin and Laythe.\u003C/p\u003E\u003Cp\u003EAs for the fuel issue... I tried to manage something similar for my Orbital Decay Plugin and honestly it was so buggy and damaging that it completely derailed development of the mod, until someone can present me with a simple way of bulk resource counting, and removal after time I cannot implement this in my pack (I have examined TAC and Interstellar code heavily and I honestly cannot whack my brain around it!). In the mean time I have added a penalty of funds for each \u0027jump\u0027, that way long journeys cost more funds (hence why my contract pack rewards are somewhat generous). \u003C/p\u003E\u003Cp\u003EThe craft orientation and navigation for an active vessel is still in progress, basically the limit of its ability at the moment is a redirection of the heading of the craft to the calculated bearing when the SAS key is pressed and navigation is active (For some reason I cannot activate the SAS key from within the code? I must be missing something somewhere..) \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022wasml\u0022 data-cite=\u0022wasml\u0022\u003E\u003Cdiv\u003ENavigation plugin - great idea! Downloaded.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks wasml! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E--- So a note on work so far:\u003C/p\u003E\u003Cp\u003EVersion 1.1.0 (tonight or tomorrow)\u003C/p\u003E\u003Cp\u003E- Maps for Kerbin, Laythe and eventually Eve when I can find one :S \u003C/p\u003E\u003Cp\u003E- Changes to the Library system\u003C/p\u003E\u003Cp\u003E- Fixes for icon bugs\u003C/p\u003E\u003Cp\u003E- Possibly some Active vessel navigation additions if I can work out an appropriate method.\u003C/p\u003E\u003Cp\u003E- Possibly one or two more contracts (If I feel like it tonight basically)\u003C/p\u003E\u003Cp\u003EVersion 1.2.0 \u003C/p\u003E\u003Cp\u003E- Shores biome support\u003C/p\u003E\u003Cp\u003E- List mode for navigation between more than one Coordinate at a time\u003C/p\u003E\u003Cp\u003E- Ferry and Exploration (Landlocked Kerbin seas, Eve oceans and Laythe oceans contracts)\u003C/p\u003E\n"},{"CreatedByName":"AlonzoTG","CreatedById":118178,"CreatedDateTime":"2015-08-30T19:54:35Z","Content":"\n\u003Cp\u003EI\u0027m trying the celeste contract too early in career mode. I peeked the config file to know where to go. I went to the coords, nothing. also, I tried loading ur craft file, I don\u0027t have FS.Battery20 in my game becuz I felt it was redundant to procedural battery... =\\\u003C/p\u003E\n"},{"CreatedByName":"Whitecat106","CreatedById":140086,"CreatedDateTime":"2015-08-30T20:14:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AlonzoTG\u0022 data-cite=\u0022AlonzoTG\u0022\u003E\u003Cdiv\u003EI\u0027m trying the celeste contract too early in career mode. I peeked the config file to know where to go. I went to the coords, nothing. also, I tried loading ur craft file, I don\u0027t have FS.Battery20 in my game becuz I felt it was redundant to procedural battery... =\\\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAhh thats the issue, most of the contracts spawn a vessel/object at the required coordinates, if you don\u0027t have all the parts the vessel cannot spawn, I will change some of the .craft files to remove some unnecessary parts but the FS.Battery20 is required for the Serendipity mission anyway (needs power for active lights :S) I will change as much as I can to stock parts. But with all the parts the vessel would spawn and you could find the coordinates by looking at the map view rather than needing the config.\u003C/p\u003E\u003Cp\u003E--- I will release the next update within afew hours, in light of AlonozoTG\u0027s comment I shall also change some .craft files in the contract pack to reduce the number of required parts.\u003C/p\u003E\n"},{"CreatedByName":"colmo","CreatedById":25950,"CreatedDateTime":"2015-08-30T20:16:44Z","Content":"\n\u003Cp\u003ERe: Rivers - they could become navigable with plenty of set coordinates along their path, or if you could approximate them using a curve. Terrain detail variation is likely to cause problems though, as you probably already suspect.\u003C/p\u003E\u003Cp\u003EI think the ISRU code has a mechanism to change resources on a craft without being focused on it. Navigation plugin fuel use could do the same in reverse?\u003C/p\u003E\n"},{"CreatedByName":"Whitecat106","CreatedById":140086,"CreatedDateTime":"2015-08-30T20:33:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022colmo\u0022 data-cite=\u0022colmo\u0022\u003E\u003Cdiv\u003ERe: Rivers - they could become navigable with plenty of set coordinates along their path, or if you could approximate them using a curve. Terrain detail variation is likely to cause problems though, as you probably already suspect.\u003Cp\u003EI think the ISRU code has a mechanism to change resources on a craft without being focused on it. Navigation plugin fuel use could do the same in reverse?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s a good idea, it would certainly save trying to make changes to allow specific types of shores, and it could be implemented in a sequence of points just like my intention of adding a sequencing ability to travel to harder to get to destinations, thanks! 1.2.0 will be soon I promise! \u003C/p\u003E\u003Cp\u003EReally? I had not thought of that, it makes sense though, do you have any links to the KSP ISRU code? At the moment the old modders API is very outdated, and it saves a lot of time tinkering if there is an available .class file lying around! If it works it could solve alot of issues in this plugin as well as my orbital decay one!\u003C/p\u003E\n"},{"CreatedByName":"colmo","CreatedById":25950,"CreatedDateTime":"2015-08-30T21:06:22Z","Content":"\n\u003Cp\u003ERoverdude is the guy to ask, I haven\u0027t a clue how it works.\u003C/p\u003E\u003Cp\u003EHere\u0027s a repost from the Boat Parts thread I made that might fire a few more lightbulbs - it might be partly doable with current Maritime parts:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022colmo\u0022 data-cite=\u0022colmo\u0022\u003E\u003Cdiv\u003EI was checking out the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/101604-1-0-4-Contract-Configurator-v1-5-0-2015-06-23\u0022 rel=\u0022external nofollow\u0022\u003EContract Configurator\u003C/a\u003E mod and a lightbulb went on - this is perfect for the carrier.\u003Cp\u003EInstead of having to faff around with launching a carrier, it can be spawned wherever the contract requires. Contracts might be docking with the carrier (i.e. a landing) or some other condition consistent with landing (e.g. stationery) on or near (in the case of a sea plane) a carrier. Spawning it a good distance away comes in handy and adds challenge. Putting extra vehicles on the spawned carrier allows daisy-chaining missions e.g. land on carrier, then take a small boat to another surface location for a science survey.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Whitecat106","CreatedById":140086,"CreatedDateTime":"2015-08-30T21:31:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022colmo\u0022 data-cite=\u0022colmo\u0022\u003E\u003Cdiv\u003ERoverdude is the guy to ask, I haven\u0027t a clue how it works.\u003Cp\u003EHere\u0027s a repost from the Boat Parts thread I made that might fire a few more lightbulbs - it might be partly doable with current Maritime parts:\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks Ill ask him, that contract idea certainly sounds interesting too, I had planned on having some carrier based missions! \u003C/p\u003E\u003Cp\u003EI have just released v1.1.0 this fixes all of the contracts (none appeared to be working - silly me but its all working now!) and adds the map tab to the UI. Enjoy! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Whitecat106","CreatedById":140086,"CreatedDateTime":"2015-08-31T22:04:28Z","Content":"\n\u003Cp\u003ECurrently working on a few fixes to the Plugin and an additional 5 contracts to the pack, (3 carrier based missions (of a series of 10 planned, each follows the story line of the Kerbal Navy\u0027s new carrier: the Nautilus), 1 addition to the Mary Celeste story line and the beginning of the Flying Dutchman story line) (Don\u0027t worry the pack won\u0027t just become story line based, I will add to the other missions (I aim to fill the pack to around 50 contracts of varying types)) So think of this next update as v1.1.5.. Hopefully should have a release by tonight or tomorrow. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Please let me know if there are any issues in the existing contracts!\u003C/p\u003E\u003Cp\u003EEdit 01:35 \u003C/p\u003E\u003Cp\u003ENo release just yet, I am working on a bigger amount of missions added (Most of the Carrier-Nautilus program) However I am having issues with a few missions (Such as the carrier landing mission Colmo suggested), basically the carrier parts in Fengists CVE pack are just a bit too narrow to produce a nice gliding carrier craft that can reliably land (and thus complete the contract parameter) without crashing or overshooting (Some sort of arrest system would be incredibly helpful here!). Still trying to code some parts of the new Course coordinate system too (trying to make C# dictionaries within dictionaries and the like..), so an update may wait till Wednesday - unless a bug is found that I can fix easily!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-01T00:40:42Z\u0022 title=\u002209/01/2015 12:40  AM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 1, 2015\u003C/time\u003E by Whitecat106\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"AlonzoTG","CreatedById":118178,"CreatedDateTime":"2015-09-02T03:42:28Z","Content":"\n\u003Cp\u003EI\u0027m playing around with this a bit more, while it is a great concept, it\u0027s not quite there yet. Have a look at: \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Great-circle_navigation\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Great-circle_navigation\u003C/a\u003E \u003C/p\u003E\u003Cp\u003Efor the maths needed to pilot a ship properly.\u003C/p\u003E\n"},{"CreatedByName":"Whitecat106","CreatedById":140086,"CreatedDateTime":"2015-09-02T12:36:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AlonzoTG\u0022 data-cite=\u0022AlonzoTG\u0022\u003E\u003Cdiv\u003EI\u0027m playing around with this a bit more, while it is a great concept, it\u0027s not quite there yet. Have a look at: \u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Great-circle_navigation\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Great-circle_navigation\u003C/a\u003E \u003C/p\u003E\u003Cp\u003Efor the maths needed to pilot a ship properly.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThese are the formula\u0027s I have used, check out the source code in \u0027VesselData.cs\u0027. Although the implementation in KSP could do with some work, the basic idea is the same, there are only changes necessary for timewarp (hence I included an ETA field so that the time passed in game also affects the next update point (this is what makes it messy in KSP, plus the fact that I am only updating the points every 30 seconds to avoid major lag and FPS drops)). The bearing, and next points are calculated using the great circle method already. The only thing that is \u0027as the crow flies\u0027 is the distance to the destination point, purely because this doesn\u0027t really matter and would be an unnecessary process writing and reading from a .cfg setup. However the distance between points are calculated with the haversine formulas. \u003C/p\u003E\u003Cp\u003ESo I think the maths are properly done (if not jumps would appear random or simply not work), it is just KSP\u0027s conceptualization of the process (with such small distances (relative to the Earth), fast vessel speeds and long time gaps between updates), the visual bow-like movement is lost.\u003C/p\u003E\n"},{"CreatedByName":"AlonzoTG","CreatedById":118178,"CreatedDateTime":"2015-09-03T18:09:40Z","Content":"\n\u003Cp\u003Eoops, srry. \u003C/p\u003E\u003Cp\u003Eyeah, the GUI doesn\u0027t really work right now and lags the game horribly when open. You should probably try to steal some code for Mechjeb because it has surface targeting nailed cold.\u003C/p\u003E\n"},{"CreatedByName":"Whitecat106","CreatedById":140086,"CreatedDateTime":"2015-09-03T18:12:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AlonzoTG\u0022 data-cite=\u0022AlonzoTG\u0022\u003E\u003Cdiv\u003Eoops, srry. \u003Cp\u003Eyeah, the GUI doesn\u0027t really work right now and lags the game horribly when open. You should probably try to steal some code for Mechjeb because it has surface targeting nailed cold.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis was an issue within the \u0027Navigation\u0027 tab caused by the config file \u0027vesselData.cfg\u0027 filling up to the brim with old vessels and Debris, this will be fixed in the next update (1.2.0) tonight! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Whitecat106","CreatedById":140086,"CreatedDateTime":"2015-09-03T21:28:20Z","Content":"\n\u003Cp\u003EHi everyone, \u003C/p\u003E\u003Cp\u003EI have released version 1.1.1 as an intermediate version (still having some issues with the new course navigation system coming in 1.2.0), this version fixes bugs causing lag in the UI, I would recommend deleting your \u0027WhitecatIndustries\u0027 folder in the game data before installing this new version. This version also adds some features to the contract system in preparation for 1.2.0 (Hopefully by Saturday at the latest!) \u003C/p\u003E\u003Cp\u003EWhitecat\u003C/p\u003E\n"},{"CreatedByName":"zeropositivo","CreatedById":133563,"CreatedDateTime":"2015-09-07T20:40:23Z","Content":"\n\u003Cp\u003EHello there\u003C/p\u003E\u003Cp\u003EAwesome idea!\u003C/p\u003E\u003Cp\u003EI\u0027ve been giving it a try. Do you know why the Nautilus carrier just sits 45Ã‚Â° tilted to the right until you manage to get some kerbals into the crew cabin?\u003C/p\u003E\u003Cp\u003EAlso, can it even reach 30m/s? I\u0027ve tried my best pushing it to its limit, but the best she could do was 25m/s (and with a weird tendency to turn left)\u003C/p\u003E\u003Cp\u003EEDIT: I was able to reach up to 46m/s after juggling around with water compression and engine limiters. However, I\u0027ve noticed something... the nautilus mission is impossible to complete! It requires the ship to be at the shores, the island AND the atoll at the same time! Simply visiting all of them or even dropping one of the subships in each location did not fulfill the requirement. So, sadly, this mission is currently impossible\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-07T23:18:18Z\u0022 title=\u002209/07/2015 11:18  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 7, 2015\u003C/time\u003E by zeropositivo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Whitecat106","CreatedById":140086,"CreatedDateTime":"2015-09-07T23:25:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022zeropositivo\u0022 data-cite=\u0022zeropositivo\u0022\u003E\u003Cdiv\u003EHello there\u003Cp\u003EAwesome idea!\u003C/p\u003E\u003Cp\u003EI\u0027ve been giving it a try. Do you know why the Nautilus carrier just sits 45Ã‚Â° tilted to the right until you manage to get some kerbals into the crew cabin?\u003C/p\u003E\u003Cp\u003EAlso, can it even reach 30m/s? I\u0027ve tried my best pushing it to its limit, but the best she could do was 25m/s (and with a weird tendency to turn left)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHello ZeroPositivo,\u003C/p\u003E\u003Cp\u003EThanks! Ahh this issue is due to the ballast in the vessel being uneven, I\u0027m afraid this is due to my own creation of the Nautilus carrier, I had tried it out and I only just managed 30.5m/s you may have to adjust the ballast in the ship by using the compressor and de compressor, it is all due to the waterline of the ship so if you change the ballast around this should fix this... I think. \u003C/p\u003E\u003Cp\u003EThe 45 degree list may be due to the spawning initially from the contract (sorry about this!) \u003C/p\u003E\u003Cp\u003EI will fix the above for the next update! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"zeropositivo","CreatedById":133563,"CreatedDateTime":"2015-09-08T10:41:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Whitecat106\u0022 data-cite=\u0022Whitecat106\u0022\u003E\u003Cdiv\u003EHello ZeroPositivo,\u003Cp\u003EThanks! Ahh this issue is due to the ballast in the vessel being uneven, I\u0027m afraid this is due to my own creation of the Nautilus carrier, I had tried it out and I only just managed 30.5m/s you may have to adjust the ballast in the ship by using the compressor and de compressor, it is all due to the waterline of the ship so if you change the ballast around this should fix this... I think. \u003C/p\u003E\u003Cp\u003EThe 45 degree list may be due to the spawning initially from the contract (sorry about this!) \u003C/p\u003E\u003Cp\u003EI will fix the above for the next update! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks for that!\u003C/p\u003E\u003Cp\u003EAh, sorry, edited my message after you responded to it. Here\u0027s what I added:\u003C/p\u003E\u003Cp\u003EEDIT: I was able to reach up to 46m/s after juggling around with water compression and engine limiters. However, I\u0027ve noticed something... It requires the ship to be at the shores, the island AND the atoll at the same time! Simply visiting all of them or even dropping one of the subships in each location did not fulfill the requirement. So, sadly, this mission is currently impossible\u003C/p\u003E\n"},{"CreatedByName":"colmo","CreatedById":25950,"CreatedDateTime":"2015-09-09T07:59:02Z","Content":"\n\u003Cp\u003EI wouldn\u0027t fret too much about an arrestor system. When Infinite Dice made his, we didn\u0027t have much in the way or airbrakes or VTOL without mods.\u003C/p\u003E\u003Cp\u003ENow, it\u0027s trivial - even regular control surfaces can be setup for airbraking, the trick is to deploy them so one set offsets the pitch imparted by another set. There\u0027s always a repackageable chute for emergencies.\u003C/p\u003E\u003Cp\u003EI\u0027m still a bit grumpy that the basic engine got nerfed so hard it doesn\u0027t have sufficient thrust to be a VTOL engine stowed in a Mk2 cargo bay. I\u0027m hoping the little 0.625m jets PorkJet previewed for next release can do the job.\u003C/p\u003E\n"},{"CreatedByName":"Whitecat106","CreatedById":140086,"CreatedDateTime":"2015-09-09T14:07:25Z","Content":"\n\u003Cp\u003EHi everyone, \u003C/p\u003E\u003Cp\u003EWorking on the next update 1.1.2 now, this will fix the issues with multiple contracts including waypoints. However if I can finally get this new course navigation system to work I will skip 1.1.2 and go straight to 1.2.0 with that system implemented and a method of visualizing waypoint coordinates (rather than guessing at the nearest marker!), this will probably be done by just adding a note in the contract. \u003C/p\u003E\u003Cp\u003ESo I am trying my best to fix some of these issues and make the pack playable! \u003C/p\u003E\u003Cp\u003EWhitecat \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EEDIT 16:12 \u003C/p\u003E\u003Cp\u003EOkay everyone, contracts are fixed, waypoint coordinates are available and the course navigation system works, all I need now is some courses... (Yes don\u0027t worry the big windy river on Kerbin is coming... Its just going to take hours to make (I have to find the precise coordinates of every bend and write these down...)) So expect a release this evening or tomorrow morning with maybe one or two initial courses! Still looking for a method of determining whether the vessel is on water or land since this is indistinguishable by the \u0027shores\u0027 biome...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-09T15:16:26Z\u0022 title=\u002209/09/2015 03:16  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 9, 2015\u003C/time\u003E by Whitecat106\u003C/strong\u003E\n\u003Cbr\u003EMore info\n\u003C/span\u003E\n"},{"CreatedByName":"Whitecat106","CreatedById":140086,"CreatedDateTime":"2015-09-10T16:49:26Z","Content":"\n\u003Cp\u003EOkay the next update is out, courses and contract fixes are here. Delete your old version before installing this one though! Next update will be 1.2.1 to fix bugs and include more contracts and courses!\u003C/p\u003E\n"}]}