{"TopicId":119602,"ForumId":29,"TopicTitle":"Getting started","CreatedByName":"Thorvain","CreatedById":150397,"CreatedDateTime":"2015-08-28T20:25:31Z","PageNum":1,"Articles":[{"CreatedByName":"Thorvain","CreatedById":150397,"CreatedDateTime":"2015-08-28T20:25:31Z","Content":"\n\u003Cp\u003EHi all, I have been playing KSP for a while now and have recently begun exploring the use of mods to increase the realism; an aspect I find very entertaining in KSP.\u003C/p\u003E\u003Cp\u003EI am interested in creating a mod that overhauls the science system to bring create a more realistic experience. However I have no experience with creating a mod for a game and have no idea where to get started. I have some experience with C\u002B\u002B coding and am not adverse to putting time in learning things. \u003C/p\u003E\u003Cp\u003ESo far I have gathered that KSP runs in c# and from what I have seen a lot of the syntax is familiar to me. How would I go about modifying the science based code in order to change the way science is awarded and the tech tree is structured?\u003C/p\u003E\u003Cp\u003Ei can give a better overview of my idea if required but I figured this would get me started.\u003C/p\u003E\u003Cp\u003Eany help would be greatly appreciated.\u003C/p\u003E\u003Cp\u003Ethorvain.\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2015-08-29T00:59:49Z","Content":"\n\u003Cp\u003EWelcome!\u003C/p\u003E\u003Cp\u003EYou can get started writing code for KSP by following the \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Main_Page\u0022 rel=\u0022external nofollow\u0022\u003Estartup guide on the wiki\u003C/a\u003E. However, while it\u0027s not hard to \u003Cem\u003Eadd\u003C/em\u003E functionality, it\u0027s rather harder to replace things. I\u0027d suggest taking a look at this thread, as it seems relevant to your endeavor re science.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/120748-WIP-RealScience-Say-good-bye-to-whack-a-mole-style-science\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/120748-WIP-RealScience-Say-good-bye-to-whack-a-mole-style-science\u003C/a\u003E\u003C/p\u003E\n"}]}