{"TopicId":119762,"ForumId":69,"TopicTitle":"Can we talk about how buggy the Structural Pylon is?","CreatedByName":"Franklin","CreatedById":89718,"CreatedDateTime":"2015-08-30T18:59:12Z","PageNum":1,"Articles":[{"CreatedByName":"Franklin","CreatedById":89718,"CreatedDateTime":"2015-08-30T18:59:12Z","Content":"\n\u003Cp\u003EThis guy: \u003Cimg src=\u0022http://wiki.kerbalspaceprogram.com/images/thumb/0/0e/Structural_Pylon.png/104px-Structural_Pylon.png\u0022 alt=\u0022104px-Structural_Pylon.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis guy has produced some wild bugs in some of my designs. Anything from inexplicable balance issues to being teleported into a black void when trying to revert a flight, with engines firing that I didn\u0027t stage.\u003C/p\u003E\u003Cp\u003EMy latest ship to use them I can\u0027t even load the ship file anymore. As soon as I added them none of the VAB buttons would work and all the parts wouldn\u0027t adhere to stages. Even after a VAB reload. It\u0027s a wild ride.\u003C/p\u003E\u003Cp\u003EAnyone have any designs just completely marred by this thing? I\u0027m impressed, frankly.\u003C/p\u003E\u003Cp\u003EHere\u0027s the ship file in case anyone else has never experienced this: \u003Ca href=\u0022http://www.filedropper.com/structuralpylonsmyass\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.filedropper.com/structuralpylonsmyass\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-30T19:02:36Z\u0022 title=\u002208/30/2015 07:02  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 30, 2015\u003C/time\u003E by KasperVld\u003C/strong\u003E\n\u003Cbr\u003Elanguage\n\u003C/span\u003E\n"},{"CreatedByName":"OddFunction","CreatedById":143805,"CreatedDateTime":"2015-08-30T20:42:14Z","Content":"\n\u003Cp\u003EIf you can post a step-by-step reproduction of one or more of these issues I am positive you will generate some discussion \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Gaarst","CreatedById":126740,"CreatedDateTime":"2015-08-30T21:10:27Z","Content":"\n\u003Cp\u003EHonestly, in over 2 years of playing KSP, I have \u003Cem\u003Enever\u003C/em\u003E used this thing. I actually learnt it could act as a decoupler only very recently.\u003C/p\u003E\u003Cp\u003EJust use a radial decoupler and let this guy join Dres and docking mode (since 1.0) in the realms of forsaken KSP features...\u003C/p\u003E\n"},{"CreatedByName":"Fendleton","CreatedById":22867,"CreatedDateTime":"2015-08-30T22:49:57Z","Content":"\n\u003Cp\u003EPart of the issue for replication is that even attaching stuff to it is really hard....it\u0027s hard to select in the build mode if you want to move it, and it always feels as if the actual collision mesh of the part doesn\u0027t match what you\u0027re looking at (although I daresay it probably does match it).....it may have improved in the 1.0 family of versions, but I ditched it back in 0.23 or so and never looked back. It\u0027s just a horrible, horrible part. Sad really, because the idea of it is actually pretty good.\u003C/p\u003E\u003Cp\u003EEDIT: I have also had some glitches with it, but that\u0027s so far back it may not be applicable with the part today.\u003C/p\u003E\n"},{"CreatedByName":"Franklin","CreatedById":89718,"CreatedDateTime":"2015-08-31T04:49:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022OddFunction\u0022 data-cite=\u0022OddFunction\u0022\u003E\u003Cdiv\u003EIf you can post a step-by-step reproduction of one or more of these issues I am positive you will generate some discussion \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESet up some asparagus staging with them as your decouplers. Then try and copy them and attach the copies. I seem to have a 100% success rate with producing bugs with these things, you really can\u0027t not do it if you use them frequently. Or like, play with that ship file I linked.\u003C/p\u003E\u003Cp\u003EAnd what Fendleton said, the thing\u0027s collision mesh is nowhere near correct, it\u0027s really difficult to even select the dang things in build.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-31T04:51:30Z\u0022 title=\u002208/31/2015 04:51  AM\u0022 data-short=\u00228 yr\u0022\u003EAugust 31, 2015\u003C/time\u003E by Franklin\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"yorshee","CreatedById":135011,"CreatedDateTime":"2015-08-31T10:09:24Z","Content":"\n\u003Cp\u003EAs many have said, nobody really uses this part because regular ol\u0027 decouplers exist, so it could have slipped through QA and Experimental testing because it\u0027s so ignored. I\u0027ll have a go with messing with the part today to see what bugs I can find with it. Is there a bugtracker post for this?\u003C/p\u003E\n"}]}