{"TopicId":119813,"ForumId":16,"TopicTitle":"Wings and their worth","CreatedByName":"NFunky","CreatedById":128066,"CreatedDateTime":"2015-08-31T14:11:21Z","PageNum":1,"Articles":[{"CreatedByName":"NFunky","CreatedById":128066,"CreatedDateTime":"2015-08-31T14:11:21Z","Content":"\n\u003Cp\u003EHey guys,\u003C/p\u003E\u003Cp\u003ESo I\u0027m playing KSP with 3.7x scale planets and distances. I\u0027m not that new to the game, but new enough that I never bothered to develope an SSTO before switching over to the larger scale. It\u0027s still not real world orbital speed (approx. 4500), but it\u0027s significantly higher than stock, and I\u0027ve found payload fractions and rocket design to be close enough to real life for now.\u003C/p\u003E\u003Cp\u003ECurrently, I haven\u0027t gotten far enough in my career to have turbojets, aerospikes or RAPIERs. I\u0027m about to complete a mun mission that will net me enough science to aquire one of these, but as of yet I don\u0027t have any. Thing is though, I\u0027m building this modular mothership to use for the mun mission and an upcoming Duna shot, possibly even more, as it can be refueled back at Kerbin. I\u0027ve been using a shuttle to bring up components and I\u0027m not spending THAT much money, due to parachute recoverable (FMRS) boosters and first two (of 4) external tanks. I still lose those last tanks though, and the boosters and first tanks only get a fraction recovery because of how far down range they are.\u003C/p\u003E\u003Cp\u003EOkay, so I guess my question is, economically, if I\u0027m playing with this large scale Kerbin, is it worth it to go for any of the classic SSTO tech, or just go back to using disposeable or maybe at least 1st stage recoverable rockets? BTW, I have scaled up reentry heating as well, so the upper stages of a rocket would be quite hard to recover.\u003C/p\u003E\u003Cp\u003EAll the threads I\u0027ve read on these forums basically say that shuttles are not very economical, no matter what, those are all talking about a normal scale Kerbin. And as far as SSTOs, is this orbital velocity (4500 with the same 70 km atmosphere) impossible for a scaled up classic KSP air-breather? Do you guys think winged spacecraft of any sort are at all economical in 3.7x?\u003C/p\u003E\u003Cp\u003EI\u0027m assuming if I use turbojets or RAPIERs, I can get about 1,100 m/s before I hit 30 km, but after that I still need about 4,000 dV of pure rocket power to make orbit. Are aerospikes my best bet? Maybe with a single turbojet for initial ascent? Any discussion on real world SSTOs and partially reuseable vehicles welcome as well of course. I don\u0027t know where the deviding line is between KSP scale and real life that makes the usual SSTOs relatively easy in stock.\u003C/p\u003E\u003Cp\u003EThanks\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-08-31T14:36:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NFunky\u0022 data-cite=\u0022NFunky\u0022\u003E\u003Cdiv\u003EHey guys,\u003Cp\u003ESo I\u0027m playing KSP with 3.7x scale planets and distances. I\u0027m not that new to the game, but new enough that I never bothered to develope an SSTO before switching over to the larger scale. It\u0027s still not real world orbital speed (approx. 4500), but it\u0027s significantly higher than stock, and I\u0027ve found payload fractions and rocket design to be close enough to real life for now.\u003C/p\u003E\u003Cp\u003ECurrently, I haven\u0027t gotten far enough in my career to have turbojets, aerospikes or RAPIERs. I\u0027m about to complete a mun mission that will net me enough science to aquire one of these, but as of yet I don\u0027t have any. Thing is though, I\u0027m building this modular mothership to use for the mun mission and an upcoming Duna shot, possibly even more, as it can be refueled back at Kerbin. I\u0027ve been using a shuttle to bring up components and I\u0027m not spending THAT much money, due to parachute recoverable (FMRS) boosters and first two (of 4) external tanks. I still lose those last tanks though, and the boosters and first tanks only get a fraction recovery because of how far down range they are.\u003C/p\u003E\u003Cp\u003EOkay, so I guess my question is, economically, if I\u0027m playing with this large scale Kerbin, is it worth it to go for any of the classic SSTO tech, or just go back to using disposeable or maybe at least 1st stage recoverable rockets? BTW, I have scaled up reentry heating as well, so the upper stages of a rocket would be quite hard to recover.\u003C/p\u003E\u003Cp\u003EAll the threads I\u0027ve read on these forums basically say that shuttles are not very economical, no matter what, those are all talking about a normal scale Kerbin. And as far as SSTOs, is this orbital velocity (4500 with the same 70 km atmosphere) impossible for a scaled up classic KSP air-breather? Do you guys think winged spacecraft of any sort are at all economical in 3.7x?\u003C/p\u003E\u003Cp\u003EI\u0027m assuming if I use turbojets or RAPIERs, I can get about 1,100 m/s before I hit 30 km, but after that I still need about 4,000 dV of pure rocket power to make orbit. Are aerospikes my best bet? Maybe with a single turbojet for initial ascent? Any discussion on real world SSTOs and partially reuseable vehicles welcome as well of course. I don\u0027t know where the deviding line is between KSP scale and real life that makes the usual SSTOs relatively easy in stock.\u003C/p\u003E\u003Cp\u003EThanks\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf the air density and gravity are the same, then spaceplanes should achieve the same performance as stock. RAPIERs can exceed 1500 m/sec even at very heavy loads. Turbojets can exceed 1100 when heavily loaded. \u003C/p\u003E\u003Cp\u003EBasically it\u0027s the same thing as building an SSTO spaceplane with an additional 2,200 m/sec DV. I\u0027m thinkin\u0027 that\u0027s doable at a comparable payload fraction to conventional staged rockets.\u003C/p\u003E\u003Cp\u003EI have a 24t SSTO spaceplane that carries 8.6t of cargo to orbit in stock KSP; 36%. It weighs roughly 13t in orbit, so my back-of-the-envelope says it can hit that orbit with 3.8t payload. That\u0027s about 16%, which is in-line with staged lifters.\u003C/p\u003E\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-31T14:56:44Z\u0022 title=\u002208/31/2015 02:56  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 31, 2015\u003C/time\u003E by GoSlash27\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-08-31T14:53:23Z","Content":"\n\u003Cp\u003EEven with the stock-sized solar system, SSTO spaceplanes don\u0027t have much practical value. As you increase the size of the solar system, their value becomes even less. So unless you just want to play with them, either as a challenge or because it\u0027s just your thing, my advice is to just avoid them. They really don\u0027t save you enough money to be worth the trouble unless you\u0027ve set some harsh difficulty options concerning money. If you\u0027re playing with default or easier money settings, then you\u0027ll have so much money that reusable spacecraft have no real value. And this is especially true before you unlock the whole tech tree. What\u0027s the point of being able to refuel a Duna ship that will be obsolete by the time it returns?\u003C/p\u003E\u003Cp\u003EThe general things about spaceplanes are as follows:\u003C/p\u003E\u003Cp\u003E* NOTE: This all assumes you want a \u0022useful\u0022 spaceplane but \u0022useful\u0022 means different things to different people. To me, \u0022useful\u0022 means capable of carrying a decent load to LKO. Therefore, I define \u0022useful\u0022 has carrying at least 4 Kerbals AND can dock, or can carry something requiring the long cargo bay and can get home again without refueling. Those are my minimum standards. If it can do more but if it can\u0027t do either of these things, then there\u0027s no real point in having it.\u003C/p\u003E\u003Cp\u003E* Spaceplanes are just an alternative form of lifter, just to get stuff from the ground to LKO (and maybe back). Even in stock-sized solar systems, they\u0027re not really capable of going farther without making their payload fraction too small to be worth the trouble.\u003C/p\u003E\u003Cp\u003E* A spaceplane\u0027s utility as a payload lifter is limited by the size of its cargo bay. With the Mk2 parts, you payloads can only be 1.25m without much stuff radially attached. With Mk3 parts, its the same only with 2.5m. If your payloads have any real width to them, then they won\u0027t fit in a cargo bay and you have to use a rocket anyway.\u003C/p\u003E\u003Cp\u003E* The more dV needed to reach orbit due to solar system size, the less useful spaceplanes become and the harder they are to make work.\u003C/p\u003E\u003Cp\u003E* Spaceplanes are huge timesinks. They require much more time to build and tweak than rockets, they take much more time to reach (or fail to reach) orbit, and are very dependent on being flown correctly so it\u0027s hard to tell sometimes whether the design is flawed or you just need to fly it differently. As a result, you can easily spend all of several days tweaking a single design before even being able to decide it doesn\u0027t work and having to start over. OTOH, you can usually slap a rocket together in 5 minutes and be pretty much assured it will work the 1st time. Some folks groove on the spaceplane design grind, others don\u0027t. To me, this is the biggest turn-off of spaceplanes and is why I rarely use them.\u003C/p\u003E\u003Cp\u003E* Once you\u0027ve gone to the trouble to make a \u0022useful\u0022 spaceplane, all you have is something that can carry a small (both in mass and dimensions) cargo to LKO. Assuming you can then land it safely on the runway, you can use it repeatedly for only the cost of the fuel it consumes. But this low operating cost isn\u0027t at all significant in the game unless you\u0027re either broke or plan to use the spaceplane many times.\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-08-31T15:08:40Z","Content":"\n\u003Cp\u003E^ I agree with all of this, which is why I only use SSTO spaceplanes for routine logistics flights to LKO. Transporting crew to orbit and back is a function you have to do fairly often. Ditto carrying fuel/ oxidizer and monoprop to orbit. Spaceplanes are good for these mundane jobs.\u003C/p\u003E\u003Cp\u003E Everything else, I use conventional lifters.\u003C/p\u003E\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-08-31T15:44:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GoSlash27\u0022 data-cite=\u0022GoSlash27\u0022\u003E\u003Cdiv\u003E^ I agree with all of this, which is why I only use SSTO spaceplanes for routine logistics flights to LKO. Transporting crew to orbit and back is a function you have to do fairly often. Ditto carrying fuel/ oxidizer and monoprop to orbit. Spaceplanes are good for these mundane jobs.\u003Cp\u003E Everything else, I use conventional lifters.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYup, a glorious, sweet-looking spaceplane is really just a mundane, short-haul delivery truck. However, the need for these \u0022beer runs\u0022 varies a lot with playstyle and somewhat with your position in a career game, and a lot of that ultimately revolves around the size of your wallet. If you can afford to do everything with 1-shot rockets, then spaceplanes have no economic attraction and become simply a matter of taste.\u003C/p\u003E\u003Cp\u003EAlso, 1.1 will impose some stock version of AntennaRange. Therefore, everybody will need some sort of commsat constellation at Kerbin, Mun, and Minmus. So there you have a bunch of things needing to get to LKO and probes easily fit inside cargobays. However, probes are very cheap to launch with rockets and you\u0027ll need to have the network in place early on, long before you unlock spaceplane engines. So by the time you can make a probe-launching SSTO, it won\u0027t have a job anymore, and probably won\u0027t save you much money anyway given the cheapness of probe lifters.\u003C/p\u003E\n"},{"CreatedByName":"Hagen von Tronje","CreatedById":148278,"CreatedDateTime":"2015-08-31T15:55:34Z","Content":"\n\u003Cp\u003EI find building spaceplanes a lot of fun but the closest to \u0022practical\u0022 I can make them is retrieving kerbals from orbit. I keep chasing the dream of a SSTO spaceplane that goes to LKO, refuels, goes to Eve orbit, refuels, lands on Eve, refuels, then does the same in reverse, from runway to Eve surface back home. It...is not an easy dream.\u003C/p\u003E\n"},{"CreatedByName":"Reddeyfish","CreatedById":142160,"CreatedDateTime":"2015-08-31T16:15:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022 data-cite=\u0022Geschosskopf\u0022\u003E\u003Cdiv\u003EAlso, 1.1 will impose some stock version of AntennaRange. Therefore, everybody will need some sort of commsat constellation at Kerbin, Mun, and Minmus. So there you have a bunch of things needing to get to LKO and probes easily fit inside cargobays. However, probes are very cheap to launch with rockets and you\u0027ll need to have the network in place early on, long before you unlock spaceplane engines. So by the time you can make a probe-launching SSTO, it won\u0027t have a job anymore, and probably won\u0027t save you much money anyway given the cheapness of probe lifters.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey\u0027re also adding a Deep Space Network to Kerbin, so the kerbin commsats aren\u0027t necessary.\u003C/p\u003E\n"},{"CreatedByName":"Vegetal","CreatedById":147251,"CreatedDateTime":"2015-08-31T16:16:30Z","Content":"\n\u003Cp\u003EI guess it\u0027s doable, but you will carry less payload to orbit than on a stock game.\u003C/p\u003E\u003Cp\u003EAs they pointed out already, it depends on your wallet and your willingness to design a good plane. If cost is starting to be a concern for your game, then it\u0027s probably a good idea.\u003C/p\u003E\n"},{"CreatedByName":"panzer1b","CreatedById":95108,"CreatedDateTime":"2015-08-31T16:20:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Hagen von Tronje\u0022 data-cite=\u0022Hagen von Tronje\u0022\u003E\u003Cdiv\u003EI find building spaceplanes a lot of fun but the closest to \u0022practical\u0022 I can make them is retrieving kerbals from orbit. I keep chasing the dream of a SSTO spaceplane that goes to LKO, refuels, goes to Eve orbit, refuels, lands on Eve, refuels, then does the same in reverse, from runway to Eve surface back home. It...is not an easy dream.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIm similar, except ive officially given up on both types of SSTEs (single stage to eve/eeloo and back without any irsu or refueling). At least laythe is possible.\u003C/p\u003E\u003Cp\u003EAs for practicality, i agree with some of the above posters, there is absolutely no reason for making single stages to wherever unless you want some kind of reuseable refueleable lander (for say duna or laythe or even kerbin) in sandbox where funds do not matter. I dont know why, but i just always liked the concept of single staged fighter style craft like starfighters or whatnot in alot of sci-fi movies that dont need to refuel at all more or less, and can go very very far distances. That and i enjoy the challenge of making these things, hard as hell, yes, but you cant say making a SSTL (single stage to laythe and back) isnt at least somewhat of an accomplishment as you dont really see many of those around after 1.04 hit. The only thing im not too happy with is the fact that my HK-201 abuses part clipping to no end, but i fail to see any other way to make it work in the 1st place while keeping a very specific external appearance (there is just no volume to place fuel left that isnt taken up by bombs/missiles).\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/tRcFswE.png\u0022 alt=\u0022tRcFswE.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd im quite lucky i brought enough wings, they give it a hair too much lift on kerbin, but at least they let you land on duna at ~80m/s, which is survivable if you know how to avoid death-jumps on the surface.\u003C/p\u003E\u003Cp\u003EAnyways, to answer the OP question, i find SSTOs to be perfectly viable, although the more dV you need, the more attractive multi-stage systems are, since there is only so much you cab pull from one stage in terms of dV. While i may very well be wrong, rockets are better for payload fractions, and are (obviously) far easier to create. If you enjoy the challenge, its perfectly possible to make a SSTO work with the RSS mod, it just requires alot more engineering (and you can FORGET about going to other planets with it without any refueling). My best craft (non military one) had ~5.5K dV in orbit using teh stock solar system, and its TWR was not something id call bad so it may or may not work with larger systems depending on how much extra dV you need to get orbital (if you can keep from loosing altitude on just nukes then it should keep going to orbit albeit slowly).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-31T16:28:35Z\u0022 title=\u002208/31/2015 04:28  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 31, 2015\u003C/time\u003E by panzer1b\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-08-31T16:21:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Reddeyfish\u0022 data-cite=\u0022Reddeyfish\u0022\u003E\u003Cdiv\u003EThey\u0027re also adding a Deep Space Network to Kerbin, so the kerbin commsats aren\u0027t necessary.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, AFAIK it\u0027ll be like Antenna Range where you don\u0027t need the RT-style geosynchronous constellation. However, Kerbin itself can only talk so far so to talk to other planets, you\u0027ll need relays. The easiest way to do that in AR is to put a pair of big dishes in highly elliptical polar orbits, one going up and the other down, and out of phase with each other so that when one probe is near its Ap, the other is near its Pe. That way, they both spend most of their time out near their Aps, which are far enough above and blow the ecliptic that they can see over any intervening planets.\u003C/p\u003E\n"},{"CreatedByName":"Hagen von Tronje","CreatedById":148278,"CreatedDateTime":"2015-08-31T16:30:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022panzer1b\u0022 data-cite=\u0022panzer1b\u0022\u003E\u003Cdiv\u003EIm similar, except ive officially given up on both types of SSTEs (single stage to eve/eeloo and back without any irsu or refueling). At least laythe is possible.\u003Cp\u003EAs for practicality, i agree with some of the above posters, there is absolutely no reason for making single stages to wherever unless you want some kind of reuseable refueleable lander (for say duna or laythe or even kerbin) in sandbox where funds do not matter. I dont know why, but i just always liked the concept of single staged fighter style craft like starfighters or whatnot in alot of sci-fi movies that dont need to refuel at all more or less, and can go very very far distances. That and i enjoy the challenge of making these things, hard as hell, yes, but you cant say making a SSTL (single stage to laythe and back) isnt at least somewhat of an accomplishment as you dont really see many of those around after 1.04 hit. The only thing im not too happy with is the fact that my HK-201 abuses part clipping to no end, but i fail to see any other way to make it work in the 1st place while keeping a very specific external appearance (there is just no volume to place fuel left that isnt taken up by bombs/missiles).\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/tRcFswE.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/tRcFswE.png\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOne of the big barriers I find is that it\u0027s just more practical to have reusable vehicles for each leg.\u003C/p\u003E\u003Cp\u003ESSTO to LKO rendezvous? Easy enough.\u003C/p\u003E\u003Cp\u003EReusable transfer from Kerbin to planet of choosing? Also not THAT hard, especially if you have fuel stations at the destination.\u003C/p\u003E\u003Cp\u003EBut not on the same vehicle. I just think it\u0027s simpler to make a reusable travel network where you SSTO then transfer craft at the station.\u003C/p\u003E\u003Cp\u003EStill, like you, I love the idea of a \u0022personal space yacht\u0022 a la Heinlein (esp Lazarus Long\u0027s personal craft).\u003C/p\u003E\n"},{"CreatedByName":"panzer1b","CreatedById":95108,"CreatedDateTime":"2015-08-31T16:30:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022 data-cite=\u0022Geschosskopf\u0022\u003E\u003Cdiv\u003EWell, AFAIK it\u0027ll be like Antenna Range where you don\u0027t need the RT-style geosynchronous constellation. However, Kerbin itself can only talk so far so to talk to other planets, you\u0027ll need relays. The easiest way to do that in AR is to put a pair of big dishes in highly elliptical polar orbits, one going up and the other down, and out of phase with each other so that when one probe is near its Ap, the other is near its Pe. That way, they both spend most of their time out near their Aps, which are far enough above and blow the ecliptic that they can see over any intervening planets.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIm just hoping they give us true droid brains instead of just probes.......\u003C/p\u003E\u003Cp\u003EThat or at least let us control probes from another vessel thats manned by skinjobs. This gives me an idea actually, DROID CONTROL SHIPS!\u003C/p\u003E\n"},{"CreatedByName":"moogoob","CreatedById":118251,"CreatedDateTime":"2015-08-31T16:40:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022panzer1b\u0022 data-cite=\u0022panzer1b\u0022\u003E\u003Cdiv\u003EIm just hoping they give us true droid brains instead of just probes.......\u003Cp\u003EThat or at least let us control probes from another vessel thats manned by skinjobs. This gives me an idea actually, DROID CONTROL SHIPS!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think that using a manned ship to control probes is already planned to be a feature. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-09-02T04:32:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022panzer1b\u0022 data-cite=\u0022panzer1b\u0022\u003E\u003Cdiv\u003EIm just hoping they give us true droid brains instead of just probes.......\u003Cp\u003EThat or at least let us control probes from another vessel thats manned by skinjobs. This gives me an idea actually, DROID CONTROL SHIPS!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA pox on you \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E. Such archaic, stone-age things are totally incompatible with today\u0027s world of fully autonomous vehicles on land, sea, air, and space.\u003C/p\u003E\n"}]}