{"TopicId":119886,"ForumId":20,"TopicTitle":"[Mod Concept] Velgharr Industries K-SET Program","CreatedByName":"Asajev","CreatedById":108155,"CreatedDateTime":"2015-09-01T06:14:55Z","PageNum":1,"Articles":[{"CreatedByName":"Asajev","CreatedById":108155,"CreatedDateTime":"2015-09-01T06:14:55Z","Content":"\n\u003Cp\u003EHi guys I will be upfront and say I am not a great mod developer or a plugin developer but I have some concepts that I would like to try and make and learn along the way. I feel that career is a good game especially when we at community tech tree and other mods like life support, FAR, Deadly Reentry, Remote Tech, etc...\u003C/p\u003E\u003Cp\u003EOne thing that I personally feel is missing is expanding the gameplay of EVA in Space Stations and Base Building. So here are some rough concepts I have for development of this mod.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EKerbal Engineers:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EWhile the great mods that Roverdude has made for colonization use parts to build the structures I was thinking of borrowing that mechanic but with a twist. You need Kerbal to transfer or load and install the parts. This means that once the shell has been deployed an Engineer would have to go on EVA and transfer the parts manually. While this seems to be a huge amount of repetitive work for something that you can transfer through internals or clicking between two modules. It adds the space walks like when they were building the ISS.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EKerbal Scientist:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EI found the modes that Nemiah created such as Orbital Materials Science and DMagic Science mod interesting. Yet I always felt that it was missing stuff. I like the concept of setting up labs in orbit or in a planet and then taking experiments from Kerbin for a single use in that area like normal science experiments and installing them and taking time to research them. The scientist would have to go on EVA to callibrate and install the science instruments on the mounting points of the labs. The scientist would also be able to install computer cores and data banks to add more data capability to a lab.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EKerbal Pilot:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EI think that a Kerbal Pilot on EVA coul control Tugs and Manipulate larger objects then normal using KAS and KIS so that the Engineer and Scientist could install the modules and parts they need to do their work.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EExtra Vehicular Activities:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThis should be limited to an ammount of maybe 1 hour per day per Kerbal. This would be the rough equivalent of a 4 hour EVA on the ISS.\u003C/p\u003E\u003Cp\u003ELet me know what I can do or give suggestions. Like I said this are rough concepts at this point.\u003C/p\u003E\n"},{"CreatedByName":"Asajev","CreatedById":108155,"CreatedDateTime":"2015-09-09T05:56:04Z","Content":"\n\u003Cp\u003EWell since I see no one adding to my concept I guess I will start by trying to design the Bouvardia Orbital Modular Science Module. My plan at least for starters is trying to mod the stock mobile lab and test the concept. After that I will attempt to create a new 3d model for the core chasis. How ever beyond modding the name I can not figure out how to add a new science experiment into the module say add the stock experiments into the lab. Could one of you guys point me were I can find information on how to make that part work.\u003C/p\u003E\n"},{"CreatedByName":"Lt Vax","CreatedById":149558,"CreatedDateTime":"2015-09-10T19:55:16Z","Content":"\n\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/94638-Mod-Development-Links-Compilation-START-HERE\u0022 rel=\u0022external nofollow\u0022\u003EMass Tutorials\u003C/a\u003E or \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/131243-Video-Modding-Tutorial-Collection-%28Video-Only%29\u0022 rel=\u0022external nofollow\u0022\u003EVideo Only Tutorials\u003C/a\u003E There are a few more vids than the Mass section but the Mass should have the Science covered for you. Also I like the idea off extra EVA things, like Station repairs or I wanted to add abandoned ships in like Asteroids. For now tho it\u0027s C# learning for me, best of luck.\n"}]}