{"TopicId":119971,"ForumId":16,"TopicTitle":"Weird thrust issue once game switches to \u0026quot;Orbit\u0026quot; mode.","CreatedByName":"InambaGuum","CreatedById":142715,"CreatedDateTime":"2015-09-02T16:19:24Z","PageNum":1,"Articles":[{"CreatedByName":"InambaGuum","CreatedById":142715,"CreatedDateTime":"2015-09-02T16:19:24Z","Content":"\n\u003Cp\u003EI\u0027ve never had a problem like this...I can\u0027t tell if I\u0027m doing something wrong with my design or if it\u0027s a bug (or possibly weird mod interaction). But I have a spaceplane that flies beautifully on both the air-breathing and closed cycle stages while in the atmosphere, and then as soon as the navball switches to \u0022Orbit\u0022 mode, any thrust applied seems to be pointing about 45 degrees above where the nose is headed, causing the nose to pitch wildly down immediately. As you can see from the screenshots, the thrust vector is dead through the center of mass. I\u0027ve tried different engines, moving the center of mass, moving the center of lift (not sure why that would matter, of course), disabling TAC Fuel Balancer, etc., and the problem persists through everything I\u0027ve tried.\u003C/p\u003E\u003Cp\u003EHelp?\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/lOHTp#0\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/lOHTp#0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Eedit: Tried disabling every mod except Joint Reinforcement (necessary to keep this thing from flying apart). It\u0027s not a mod issue...so I must be doing something wrong with my design.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-02T16:38:05Z\u0022 title=\u002209/02/2015 04:38  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 2, 2015\u003C/time\u003E by InambaGuum\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"xtoro","CreatedById":79015,"CreatedDateTime":"2015-09-02T16:54:24Z","Content":"\n\u003Cp\u003EI suspect it\u0027s because your wings extend out below your CoM. In the VAB you\u0027re seeing your CoM with full fuel tanks. Remove the fuel in the VAB and I suspect you\u0027ll see that your CoM has lowered. There is a mod called RCS Build Aid that shows you your CoM with empty fuel tanks (DCoM, DRY CoM). Give that a shot, or empty your tanks and see if that\u0027s the problem. A quick fix might be adding another reaction wheel to fight the offset.\u003C/p\u003E\n"},{"CreatedByName":"Randazzo","CreatedById":136468,"CreatedDateTime":"2015-09-02T17:04:43Z","Content":"\n\u003Cp\u003EThe key here is the altitude at which the display switches to \u0022orbit\u0022, and the effect it\u0027s having on your control surfaces, probably combined with shifting CoM. The only real difference between \u0022Orbit\u0022 and \u0022Surface\u0022 is the navball display, nothing in the game actually changes. It doesn\u0027t switch over until ~30km or so (I think, might even be higher), when the atmosphere is getting too thin for wings and control surfaces.\u003C/p\u003E\n"},{"CreatedByName":"Vegetal","CreatedById":147251,"CreatedDateTime":"2015-09-02T17:11:45Z","Content":"\n\u003Cp\u003EDefinitely the wings. You have too much weight below CoM, and as xtoro said, when you dried up most of your fuel, the CoM shifted downwards.\u003C/p\u003E\u003Cp\u003EI also recommend RCS Build Aid, it\u0027s almost essential in my opinion.\u003C/p\u003E\n"},{"CreatedByName":"InambaGuum","CreatedById":142715,"CreatedDateTime":"2015-09-02T17:12:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Randazzo\u0022 data-cite=\u0022Randazzo\u0022\u003E\u003Cdiv\u003EThe key here is the altitude at which the display switches to \u0022orbit\u0022, and the effect it\u0027s having on your control surfaces, probably combined with shifting CoM. The only real difference between \u0022Orbit\u0022 and \u0022Surface\u0022 is the navball display, nothing in the game actually changes. It doesn\u0027t switch over until ~30km or so (I think, might even be higher), when the atmosphere is getting too thin for wings and control surfaces.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah...I\u0027m sure it\u0027s some kind of boundary altitude thing, rather than the display...that is just where the problem starts. \u003C/p\u003E\u003Cp\u003EThe thing is -- the problem doesn\u0027t happen gradually. Pre-\u0022orbit\u0022, it works fine. Post-\u0022orbit\u0022, it suddenly thrusts 45 degrees off, without any kind of intervening state. I tried adjusting my wing plane up to better compensate for empty tanks, and I checked the spaceplane in the SPH with all the tanks completely empty (which they aren\u0027t when this problem happens), and the thrust vector still goes through the CoM within a degree or two. That doesn\u0027t seem to be the problem, as far as I can tell.\u003C/p\u003E\n"},{"CreatedByName":"Randazzo","CreatedById":136468,"CreatedDateTime":"2015-09-02T17:18:10Z","Content":"\n\u003Cp\u003EHmm. I\u0027d still try adding a reaction wheel somewhere and see if that resolves the issue. I\u0027ve had plenty of designs that suddenly can\u0027t keep themselves right at high altitude and it\u0027s always been a lack of control authority in thin atmosphere. Another issue could be asymmetric thrust (which happens in KSP, unless you\u0027ve placed them in a specific manner or use a mod to fix it) from those jet engines but I\u0027d imagine they\u0027ve cut out before you get that high.\u003C/p\u003E\n"},{"CreatedByName":"InambaGuum","CreatedById":142715,"CreatedDateTime":"2015-09-02T17:25:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Randazzo\u0022 data-cite=\u0022Randazzo\u0022\u003E\u003Cdiv\u003EHmm. I\u0027d still try adding a reaction wheel somewhere and see if that resolves the issue. I\u0027ve had plenty of designs that suddenly can\u0027t keep themselves right at high altitude and it\u0027s always been a lack of control authority in thin atmosphere. Another issue could be asymmetric thrust (which happens in KSP, unless you\u0027ve placed them in a specific manner or use a mod to fix it) from those jet engines but I\u0027d imagine they\u0027ve cut out before you get that high.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt already has an Advanced Inline Stabilizer. :/ And yeah, it\u0027s on the rocket engines by that point. \u003C/p\u003E\u003Cp\u003EI will try RCS Build-Aid...sounds good regardless...but looks like I may have to scrap this fellow.\u003C/p\u003E\n"},{"CreatedByName":"The_Rocketeer","CreatedById":81727,"CreatedDateTime":"2015-09-02T17:28:08Z","Content":"\n\u003Cp\u003EYou can manually switch between \u0027surface\u0027 and \u0027orbit\u0027 speed displays by clicking on it (on top of the navball). Try manually switching at lower and higher altitudes and see if the problem really is \u0027orbit-mode\u0027 related. If so, bug (so report it). If not, probably movement of CoM issue as suggested.\u003C/p\u003E\n"},{"CreatedByName":"ForScience6686","CreatedById":144187,"CreatedDateTime":"2015-09-02T18:38:35Z","Content":"\n\u003Cp\u003EI would guess it\u0027s the aero forces causing problems, especially if SAS is on follow prograde. When it switches to orbit, you are no longer prograde to the air stream which is still relevant at that altitude. I have had this issue with large payloads and low control authority, immediate loss of control. I tend to go for a steeper ascent when I encounter this issue. I thought the nav ball switch was more relevant to horizontal speed, as I can get the switch over at minimus at extremely low altitudes but almost orbital speeds.\u003C/p\u003E\n"},{"CreatedByName":"bigcalm","CreatedById":143587,"CreatedDateTime":"2015-09-02T20:32:05Z","Content":"\n\u003Cp\u003EI had this on one of my planes -- what\u0027s happening is that in the atmosphere your wings / control surfaces are allowing you to steer in the direction you want. However, in space, you don\u0027t have this, so it\u0027s dictated by the centre-of-thrust vs. the centre-of-mass. From the vessel pic, it looks like the centre of mass is out of line with the centre of thrust, causing the plane to rotate under thrust.\u003C/p\u003E\u003Cp\u003EPossible solutions are:\u003C/p\u003E\u003Cp\u003E1) Make the centre of mass in line with the centre of thrust\u003C/p\u003E\u003Cp\u003E2) Add more reaction wheels\u003C/p\u003E\u003Cp\u003E3) As soon as you start coasting towards apoapsis, reduce the thrust of your engines to 25% or so of their maximum. This should then allow your reaction wheels to compensate for the unbalanced centre of mass / centre of thrust problem.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-02T20:53:23Z\u0022 title=\u002209/02/2015 08:53  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 2, 2015\u003C/time\u003E by bigcalm\u003C/strong\u003E\n\u003C/span\u003E\n"}]}