{"TopicId":120176,"ForumId":32,"TopicTitle":"Best PC Games - KSP #17","CreatedByName":"quasarquantum","CreatedById":102124,"CreatedDateTime":"2015-09-05T04:04:39Z","PageNum":1,"Articles":[{"CreatedByName":"quasarquantum","CreatedById":102124,"CreatedDateTime":"2015-09-05T04:04:39Z","Content":"\n\u003Cp\u003EPC Gamer published their Top 100 Games\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.pcgamer.com/best-pc-games/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.pcgamer.com/best-pc-games/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EKSP ended up in 17th place.\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-09-05T04:35:27Z","Content":"\n\u003Cp\u003EWell, I guess any publicity is good publicity, but PC Gamer hasn\u0027t been relevant since the 90\u0027s.\u003C/p\u003E\n"},{"CreatedByName":"MadChris48","CreatedById":112853,"CreatedDateTime":"2015-09-05T14:25:52Z","Content":"\n\u003Cp\u003EI was just about to post this too. from 90th to 17th. WOOT!\u003C/p\u003E\n"},{"CreatedByName":"LordFerret","CreatedById":111598,"CreatedDateTime":"2015-09-05T15:02:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Alshain\u0022 data-cite=\u0022Alshain\u0022\u003E\u003Cdiv\u003EWell, I guess any publicity is good publicity, but PC Gamer hasn\u0027t been relevant since the 90\u0027s.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPC Gamer relevant? Ever? HA HA HA HA HA LOLOLOLOL HA HA HA HA HA LOLOLZ snicker snicker snort\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EPlease. \u003C/em\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 alt=\u0022:rolleyes:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Rosco P. Coltrane","CreatedById":61065,"CreatedDateTime":"2015-09-05T20:51:30Z","Content":"\n\u003Cp\u003EI\u0027ll never understand these \u0022top x something\u0022 lists. Is impossible to do such thing. The definition of \u0022best\u0022 is not universal. Everybody will have a list of games they consider the best in their categories for one reason or another. A list compiled be some folks on a magazine will inevitably disappoint. I have no less than 5 games that aren\u0027t even in that list. There are also entires genres missing completely. Who makes this list?! Well, someone with a very different taste than me, obviously.\u003C/p\u003E\n"},{"CreatedByName":"Hagen von Tronje","CreatedById":148278,"CreatedDateTime":"2015-09-05T21:04:55Z","Content":"\n\u003Cp\u003EWhy are there a bunch of multiplatform games that didn\u0027t even originate on PC? GTAV, top ranked PC game? I mean, of course I disagree with a lot of the picks and don\u0027t care that much about that, but you\u0027d think at least they\u0027d stick with games primarily known as PC games, not just games that one day got ported to PC. Why not throw in FFVII, Ecco the Dolphin, Mega Man X, and Super Mario Bros, all of which got PC ports?\u003C/p\u003E\n"},{"CreatedByName":"Senormeens","CreatedById":145344,"CreatedDateTime":"2015-09-05T22:49:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rosco P. Coltrane\u0022 data-cite=\u0022Rosco P. Coltrane\u0022\u003E\u003Cdiv\u003EI\u0027ll never understand these \u0022top x something\u0022 lists. Is impossible to do such thing. The definition of \u0022best\u0022 is not universal. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah thats pretty much the same reason that x/10 game reviews are also kinda dumb in my opinion, cuz everyone has there own opinion on whats annoying and whats awesome.\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2015-09-05T23:02:14Z","Content":"\n\u003Cp\u003EI suppose... Such lists can help generate sales? Idk... Let\u0027s rank the top ten musicians while we\u0027re at it.\u003C/p\u003E\n"},{"CreatedByName":"LordFerret","CreatedById":111598,"CreatedDateTime":"2015-09-05T23:05:04Z","Content":"\n\u003Cp\u003EThe ratings of PC games (and other such things) are exactly as done with movies these days ... by $$$$$ made.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-09-05T23:15:55Z","Content":"\n\u003Cp\u003ESeeing the first two Thief games on that list made my day, but putting Oblivion ahead of Morrowind is a crime. Also missing was the original System Shock, even though the Underworld engine had terrible controls.\u003C/p\u003E\n"},{"CreatedByName":"Hotaru","CreatedById":135669,"CreatedDateTime":"2015-09-05T23:41:38Z","Content":"\n\u003Cp\u003EGood to see KSP on the list, good to see some other games I like on there too (not least FTL). \u003C/p\u003E\u003Cp\u003EI\u0027ve always said there\u0027s no such thing as \u0022objectively good,\u0022 you can say a game was \u003Cem\u003Esuccessful--\u003C/em\u003Eit made money--\u003Cem\u003Eacclaimed\u003C/em\u003E--critics and the like spoke highly of it--\u003Cem\u003Epopular\u003C/em\u003E--users gave it good ratings--but \u003Cem\u003Egood\u003C/em\u003E is just down to whether it works for any given player. There are a lot of \u0022good\u0022 games on that list that didn\u0027t do much for me. I\u0027m not a huge FPS nut so I didn\u0027t get much out of Half-Life 2. I never got more than an hour into Morrowind (the NPCs drove me nuts) and I got bored pretty fast with Oblivion too. And I can\u0027t fathom putting Mass Effect 2 or 3 ahead of the original, or New Vegas ahead of Fallout 3. \u003C/p\u003E\u003Cp\u003ESo while it\u0027s amusing to see somebody else\u0027s opinion on the best PC games ever, that\u0027s all I see it as--just somebody\u0027s (or in this case a few people\u0027s) opinion, not more or less valid than my own. What I liked about this PC Gamer list is that they don\u0027t pretend it\u0027s the last word, they pretty much present it as nothing more than their own opinions, for us to take or leave.\u003C/p\u003E\n"}]}