{"TopicId":120108,"ForumId":15,"TopicTitle":"Best way to go about making a Biome Map?","CreatedByName":"CoriW","CreatedById":57866,"CreatedDateTime":"2015-09-04T09:35:35Z","PageNum":1,"Articles":[{"CreatedByName":"CoriW","CreatedById":57866,"CreatedDateTime":"2015-09-04T09:35:35Z","Content":"\n\u003Cp\u003EHello, I\u0027ve been working on a Kopernicus planet for about a week now and I finally have the planet to the point that I\u0027m mostly happy with it. So I\u0027ve decided it\u0027s time to start working on the biome map and well, I was sort of wondering if anyone has any tips or advice they can share about making a Biome Map. Are there any specific programs I should use, or tools I could utilize in order to make the process a bit easier, because I mean it would be torture to have to manually specify everything on a 4k map.\u003C/p\u003E\u003Cp\u003ETo put into perspective what I\u0027m working with, here\u0027s the height map. Just looking at the mountain ranges alone has me scratching my head as to how to go about assigning biomes to them.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/74725194/KSP/Debug/HeightMap.png\u0022 alt=\u0022HeightMap.png\u0022\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"NecroBones","CreatedById":105424,"CreatedDateTime":"2015-09-04T12:14:32Z","Content":"\n\u003Cp\u003EI guess it really depends on how you want to divide up the biomes. An easy method would be to ignore the terrain features, and divide it up regionally. Another might be to use Photoshop (or GIMP or whatever) to reduce the height map\u0027s color depth to maybe 4 or 8 shades, increase back to full RGB, and then mask and flood-fill some of those regionally, and you\u0027d get both region and altitude information.\u003C/p\u003E\n"},{"CreatedByName":"CoriW","CreatedById":57866,"CreatedDateTime":"2015-09-05T08:46:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NecroBones\u0022 data-cite=\u0022NecroBones\u0022\u003E\u003Cdiv\u003EI guess it really depends on how you want to divide up the biomes. An easy method would be to ignore the terrain features, and divide it up regionally. Another might be to use Photoshop (or GIMP or whatever) to reduce the height map\u0027s color depth to maybe 4 or 8 shades, increase back to full RGB, and then mask and flood-fill some of those regionally, and you\u0027d get both region and altitude information.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHey thanks so much for the Advice man! Did exactly what you said, ended up changing the height maps color depth to 8 which has given just the right amount of control over terrain specified biomes without it being unmanageable.\u003C/p\u003E\u003Cp\u003EI do have one other question... I\u0027ve been working on my biome map and have come up with the ideas for all the biomes and well, between regional and terrain specified biomes, there\u0027s 18. That\u0027s more than any of the stock planets, so the question -- Is that a good or bad idea?\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EEDIT\u003C/strong\u003E: Was thinking about it... The pro\u0027s seem to be that it would give people more reason to go to the planet and there would be lots of playability value as there would be a lot of science to gather, the cons would be that there is too much science available thus making my planet \u0022overpowered\u0022 for science when compared to the stock planets. Then again at the same time usually by the time people get out of Kerbin SOI they already have a good chunk of the tech tree unlocked and its not long after they leave Kerbin SOI that it is fully unlocked.\u003C/p\u003E\u003Cp\u003EOne thing that I suppose I could do as well with the number of biomes the planet will have is lower the science values for the planet. The pro\u0027s of doing so is that there wouldn\u0027t be as many science points to get from the planet as a whole making it less overpowered compared to stock planets, however the cons are that each landing site gives less science individually making people less inclined to put in the effort to go there.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-05T09:59:11Z\u0022 title=\u002209/05/2015 09:59  AM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 5, 2015\u003C/time\u003E by CoriW\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"InterstellarOrbit","CreatedById":168687,"CreatedDateTime":"2016-09-17T18:29:10Z","Content":"\n\u003Cp\u003E\nWouldn\u0027t be hard to make custom biomes for Craters and Such?\n\u003C/p\u003E\n"}]}