{"TopicId":120132,"ForumId":55,"TopicTitle":"For the Critics","CreatedByName":"DSKY","CreatedById":115470,"CreatedDateTime":"2015-09-04T17:08:30Z","PageNum":1,"Articles":[{"CreatedByName":"DSKY","CreatedById":115470,"CreatedDateTime":"2015-09-04T17:08:30Z","Content":"\n\u003Cp\u003EAll of us who are reading and posting to this development forum share a strong common bond: our enjoyment of Kerbal Space Program. Yet the discussion here can get heated and downright nasty at times. This can take many forms; my pet peeve happens to be those folks who oppose a suggestion because there is \u0022no reason\u0022 to implement it. Of course there\u0027s a reason; the original poster had one. It may or may not be popular, useful, or even possible, but there is a reason. Just because you are unable to imagine one doesn\u0027t mean there isn\u0027t one.\u003C/p\u003E\u003Cp\u003EMy other (one of my other...) addictions is Minecraft. One of the members of the Mincraft suggestion forum, yoshi9048, wrote an excellent guide for critics. \u0022Critics\u0022 not in the pejorative sense - criticism is not inherently bad; in fact is is necessary to refine ideas. Yoshi\u0027s guide was intended to help keep the discussion civil and productive. I encourage everyone posting on this forum - ANY forum - to read it. \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.minecraftforum.net/forums/minecraft-discussion/suggestions/44180-for-the-critics-ftc\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.minecraftforum.net/forums/minecraft-discussion/suggestions/44180-for-the-critics-ftc\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"nothingSpecial","CreatedById":118683,"CreatedDateTime":"2015-09-04T22:28:28Z","Content":"\n\u003Cp\u003EI am waiting for someone to respond \u0022there is no reason to read that guide\u0022.\u003C/p\u003E\n"},{"CreatedByName":"DSKY","CreatedById":115470,"CreatedDateTime":"2015-09-05T03:04:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022nothingSpecial\u0022 data-cite=\u0022nothingSpecial\u0022\u003E\u003Cdiv\u003EI am waiting for someone to respond \u0022there is no reason to read that guide\u0022.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo kidding! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"mythbusters844","CreatedById":72313,"CreatedDateTime":"2015-09-05T04:54:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DSKY\u0022 data-cite=\u0022DSKY\u0022\u003E\u003Cdiv\u003EYet the discussion here can get heated and downright nasty at times...[There are] folks who oppose a suggestion because there is \u0022no reason\u0022 to implement it. Of course there\u0027s a reason; the original poster had one. It may or may not be popular, useful, or even possible, but there is a reason. Just because you are unable to imagine one doesn\u0027t mean there isn\u0027t one.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECan you give a specific example of these two happening in the KSP forums (and not minecraft forums)?\u003C/p\u003E\n"},{"CreatedByName":"DSKY","CreatedById":115470,"CreatedDateTime":"2015-09-05T17:18:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mythbusters844\u0022 data-cite=\u0022mythbusters844\u0022\u003E\u003Cdiv\u003ECan you give a specific example of these two happening in the KSP forums (and not minecraft forums)?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMy pleasure.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#3E3E3E;\u0022\u003ETopic: \u003C/span\u003E\u003Cspan style=\u0022color:#3E3E3E;\u0022\u003ERemove the nosecone on the new mk1Cockpit - Gifs and pictures\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EReply \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/132767-Remove-the-nosecone-on-the-new-mk1Cockpit-Gifs-and-pictures?p=2164656\u0026amp;viewfull=1#post2164656\u0022 rel=\u0022external nofollow\u0022\u003E#29\u003C/a\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kuu Lightwing\u0022 data-cite=\u0022Kuu Lightwing\u0022\u003E\u003Cdiv\u003ENo. It just looks bad. We already have some parts that don\u0027t look good no matter what you attach to the front of them - Mk3 cockpit and both Mk2-to-Mk1 adapters. Don\u0027t turn the new smooth and sleek cockpit into one more of those parts.\u003Cp\u003EAnd even if you make avionics hub fit, there\u0027s no other part that would look good in its place. Just no reason to spoil PorkJet\u0027s design.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETopic: \u003Cspan style=\u0022color:#3E3E3E;\u0022\u003EProcedural sub-biomes to motivate more surface exploration\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EReply \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/130230-Procedural-sub-biomes-to-motivate-more-surface-exploration?p=2125815\u0026amp;viewfull=1#post2125815\u0022 rel=\u0022external nofollow\u0022\u003E#44\u003C/a\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kegereneku\u0022 data-cite=\u0022Kegereneku\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ENow you can say I\u0027m yelling at you.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cem\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EIt is a goal. An exploration game needs \u0022fog of war,\u0022 period.\u003C/span\u003E\u003C/em\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou are being stupid here... \u0022Random Generation =/= Fog of War\u0022 no matter how you look at it. It\u0027s confusing the actual gameplay of exploration, with the mean you produce the \u0022contents\u0022 that you will be exploring.\u003C/p\u003E\u003Cp\u003EAs I\u0027m trying damn hard to make you understand : You can get bored of exploring 100 randomly generated/copypasted pattern on 50 planets, faster than exploring 10 handcrafted place (of choice !) on 8 planets.\u003C/p\u003E\u003Cp\u003E \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"nothingSpecial","CreatedById":118683,"CreatedDateTime":"2015-09-05T18:18:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DSKY\u0022 data-cite=\u0022DSKY\u0022\u003E\u003Cdiv\u003EMy pleasure.\u003Cp\u003E\u003Cspan style=\u0022color:#3E3E3E;\u0022\u003ETopic: \u003C/span\u003E\u003Cspan style=\u0022color:#3E3E3E;\u0022\u003ERemove the nosecone on the new mk1Cockpit - Gifs and pictures\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EReply \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/132767-Remove-the-nosecone-on-the-new-mk1Cockpit-Gifs-and-pictures?p=2164656\u0026amp;viewfull=1#post2164656\u0022 rel=\u0022external nofollow\u0022\u003E#29\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ETopic: \u003Cspan style=\u0022color:#3E3E3E;\u0022\u003EProcedural sub-biomes to motivate more surface exploration\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EReply \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/130230-Procedural-sub-biomes-to-motivate-more-surface-exploration?p=2125815\u0026amp;viewfull=1#post2125815\u0022 rel=\u0022external nofollow\u0022\u003E#44\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003EI read both of your examples. Except for the line \u0022you are being stupid here\u0022 which shouldn\u0027t really belong, both of them contain legit critique, and I personally agree with stated arguments against proposed ideas. There is no reason to put them into \u0022they oppose just because there is no reason\u0022, because they oppose to proposed suggestions because there is a reason not to implement them (without thorough development of initial ideas). \u003Cp\u003ESo unless you show any \u0022there is no reason\u0022 arguments that are not imply \u0022there is a reason not to\u0022 arguments, there is no reason to claim that there is no reason to use \u0022there is no reason\u0022 arguments on KSP forums.\u003C/p\u003E\u003Cp\u003EOr, to put all of the above in simple words: the first example is a really good critique and the second is bad in shape but is based on a understandable concern.\u003C/p\u003E\u003Cp\u003EOr, to put all of the above in fewer words: there is no reason to use this posts as examples.\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-09-05T19:09:41Z","Content":"\n\u003Cp\u003EYour first example (Reply #29) is perfectly legitimate. He offered valid reasons why he believed it should NOT be implemented. It isn\u0027t that he can\u0027t imagine a reason to do it, it\u0027s that he specifically doesn\u0027t want it to happen. If the original poster has the right to suggest it, then others have the right to refute it as a bad idea they don\u0027t want to have happen.\u003C/p\u003E\u003Cp\u003EThe second reply is probably more to your cause, as you say debates can get heated. The poster does seem to be getting a little too upset. Never the less, he still has reasons not to implement the idea. There is nothing wrong with dissenting opinions, and there is \u0022no reason\u0022 to censor the ideas of others just because they don\u0027t agree with your idea.\u003C/p\u003E\n"},{"CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2015-09-05T20:38:14Z","Content":"\n\u003Cp\u003ESo what addition or change to the KSP are we talking here about?\u003C/p\u003E\n"},{"CreatedByName":"nothingSpecial","CreatedById":118683,"CreatedDateTime":"2015-09-05T23:03:58Z","Content":"\n\u003Cp\u003EAddition of reason, of course!\u003C/p\u003E\n"}]}