{"TopicId":120209,"ForumId":16,"TopicTitle":"VTOL post-1.0?","CreatedByName":"KristopherKerblumbus","CreatedById":132207,"CreatedDateTime":"2015-09-05T18:00:31Z","PageNum":1,"Articles":[{"CreatedByName":"KristopherKerblumbus","CreatedById":132207,"CreatedDateTime":"2015-09-05T18:00:31Z","Content":"\n\u003Cp\u003EOkay, so obviously my first admission is that I\u0027m using B9 parts, which are currently on \u0022WIP\u0022 status, and I don\u0027t know how much that has to do with my problem. If that\u0027s the case, say so and I\u0027ll go on my merry way. But I think I just haven\u0027t figured out 1.0.4\u0027s flight physics yet. In .90, I was able to build 747-size orange-tank VTOL atmospheric airplanes that I was going to use to drop parts for base building. Then, 1.0 came out, and now I can\u0027t even get something like \u003Ca href=\u0022http://i.imgur.com/UDPylPG.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ethis\u003C/a\u003E to lift off. I\u0027ve got KER, so I know the stats I need (1.0\u002B TWR in the vertical direction, plenty of reaction wheels and a balanced CoM/CoT), but I\u0027m just having no luck. Does anybody have any tips? Thanks! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_happy.png\u0022 alt=\u0022^_^\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-05T23:25:45Z\u0022 title=\u002209/05/2015 11:25  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 5, 2015\u003C/time\u003E by KristopherKerblumbus\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"peachoftree","CreatedById":110108,"CreatedDateTime":"2015-09-05T18:56:55Z","Content":"\n\u003Cp\u003EWhat exactly is causing it not to lift off? does it not get off the ground, flip over, or something else? Some screenshots or a video would be extremely useful here.\u003C/p\u003E\n"},{"CreatedByName":"KristopherKerblumbus","CreatedById":132207,"CreatedDateTime":"2015-09-05T19:18:11Z","Content":"\n\u003Cp\u003ESorry. I thought I was clear enough in the OP. I\u0027ve tried a number of different designs, so screenshots really *wouldn\u0027t* be helpful. My problem is that I can\u0027t get anything off the ground. I guess my question is if the post-1.0 B9 jet altering configs reduce the thrust such that nothing lifts, and again, I\u0027m using KER, so I understand the basic ideas and have the stats to check what works and what doesn\u0027t, I\u0027m just unable to get anything to lift unless I use a ridiculous amount of engines (e.g., three Sabre-M engines on a Mk. II cockpit, one 8m fuel tank and a bicoupler)\u003C/p\u003E\n"},{"CreatedByName":"JTpopcorn","CreatedById":130311,"CreatedDateTime":"2015-09-05T19:33:53Z","Content":"\n\u003Cp\u003EI assume by lifting you mean vertical takeoff. If so, a screenshot of your craft would help. Also, KER should be able to show the TWR of a given stage, and if that is less than 1 there is your problem. However, engines have fun thrust curves based on speed and altitude, so I assume that at a standstill the Sabre\u0027s can\u0027t lift the plane because they are most effective in upper atmo and space at high speeds. Right click on the engines once launched to see their actual thrust at rest.\u003C/p\u003E\n"},{"CreatedByName":"KristopherKerblumbus","CreatedById":132207,"CreatedDateTime":"2015-09-05T20:03:14Z","Content":"\n\u003Ca href=\u0022http://i.imgur.com/UDPylPG.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/UDPylPG.jpg\u003C/a\u003E This was the first thing I tried, posted in the OP. It was a longrange science and exploration craft that served me well pre-1.0. Now, post 1.0, that won\u0027t get off the ground. Nothing will. Even when I shrink it to less than half the size and strip the wings off just to test the VTOL portion. I can get HTOL planes off the ground fine. Just built an HL-size SSTO that can go up to a 200km orbit easy.\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2015-09-05T21:08:00Z","Content":"\n\u003Cp\u003EWell, static thrust for the jet engines is greatly reduced. I don\u0027t know about KER, but I know MJ doesn\u0027t really give good TWR for jet engines. I\u0027m not sure what it\u0027s using for a baseline, but that might be the issue you\u0027re running into. KER might think you\u0027re putting out more thrust that what\u0027s actually coming out.\u003C/p\u003E\u003Cp\u003EUnfortunately VTOLs did indeed take a big hit because of this. Also, the CoM location on jet engines is problematic for VTOL craft.\u003C/p\u003E\u003Cp\u003EI haven\u0027t built a lot of VTOLs in 1.0, so hopefully someone with more recent experience will stumble in, but I have also found VTOL craft harder to work with in 1.0.\u003C/p\u003E\u003Cp\u003EIt might be worth simply spamming jet engines all over and seeing if you can get it to lift off. Just to make sure there isn\u0027t something up with your mounting technique or some other phantom thing in the way of the engines.\u003C/p\u003E\u003Cp\u003ECheers,\u003C/p\u003E\u003Cp\u003E~Claw\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-05T21:10:56Z\u0022 title=\u002209/05/2015 09:10  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 5, 2015\u003C/time\u003E by Claw\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"panzer1b","CreatedById":95108,"CreatedDateTime":"2015-09-05T21:39:09Z","Content":"\n\u003Cp\u003EI see you are trying to use basic jet engines for liftoff in VTOL mode, dont even waste your time, those engines are now WORTHLESSLY underpowered in every department, garbage thrust, especially liftoff thrust, very heavy, and they seem to not gain thrust until you are moving at high speeds.\u003C/p\u003E\u003Cp\u003ECurrently your best bet would be turbojets for the VTOL portion, those have the best thrust when immobile, and their mass is insignificantly more then the basic jet.\u003C/p\u003E\u003Cp\u003EReally the basic jet is SO BAD ive been avoiding that one for everything these days, it cant do jack anymore (in 1.0 it was at least useable at lower speeds, now its so bad its worthless at any speed).\u003C/p\u003E\u003Cp\u003EHopefully the devs will take a good look at 1.1 and balance, so we dont end up with as many worthless parts (there are too many engines right now that are redundant or just purely underpowered). Really the sole use i have for the basic jet are boats where the ISP matters, and the bad thrust isnt a big deal as you cant go too fast or you explode.....\u003C/p\u003E\u003Cp\u003EJust try to swap your VTOL system for turbojets, they are better thrust and can actually lift some stuff into the sky, the basic jets are useless unless you are playing career and actually want to do something on kerbin.\u003C/p\u003E\n"},{"CreatedByName":"KristopherKerblumbus","CreatedById":132207,"CreatedDateTime":"2015-09-05T23:24:57Z","Content":"\n\u003Cp\u003EWell, that\u0027s part of it I guess. I was using basic jets because they throttle up so quickly, and I try to use as few as possible because I like aesthetics. But if jets just took a huge hit and it\u0027s not just me, I\u0027ll just see where I can go from here. Thanks for all the help guys, I\u0027ll consider this answered\u003C/p\u003E\n"},{"CreatedByName":"percyPrune","CreatedById":130676,"CreatedDateTime":"2015-09-07T11:25:13Z","Content":"\n\u003Cp\u003EUsing basic jets I now have to double up on the number I used in 1.0.2 and, even so, TWR is quite marginal and the extra engines add a weight penalty. Like you I still use them though because of their reaction time (and aesthetics). Another downside is that they are serious gas guzzlers now!\u003C/p\u003E\u003Cp\u003EThis just gets off the ground with 4 lift \u002B2 forward engines and full fuel load:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/fcqbC6D\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/fcqbC6Dl.png\u0022 alt=\u0022fcqbC6Dl.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EOnly solution is \u0022Moare h\u0027enjins\u0022!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-07T11:30:43Z\u0022 title=\u002209/07/2015 11:30  AM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 7, 2015\u003C/time\u003E by percyPrune\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"I_Killed_Jeb","CreatedById":84817,"CreatedDateTime":"2015-09-07T16:29:12Z","Content":"\n\u003Cp\u003EThe only reliable way to get a true TWR readout with jet engines with KER is to launch the craft and get the in-flight readout of TWR (look at the denominator).\u003C/p\u003E\n"}]}