{"TopicId":120419,"ForumId":16,"TopicTitle":"Pro or Retrograde Capture","CreatedByName":"Przemqo","CreatedById":150827,"CreatedDateTime":"2015-09-08T06:38:57Z","PageNum":1,"Articles":[{"CreatedByName":"Przemqo","CreatedById":150827,"CreatedDateTime":"2015-09-08T06:38:57Z","Content":"\n\u003Cp\u003EHey, can someone clarify me this: if I am approaching other planet (other SOI, to be exact) and I want to perform burn to get captured, does it make a difference on which side of the planet periapsis will be? I know it is important for slingshots, but for that? I tried to find the answer but I am still confused. Thanks!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-08T14:02:42Z\u0022 title=\u002209/08/2015 02:02  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 8, 2015\u003C/time\u003E by Przemqo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-09-08T07:03:53Z","Content":"\n\u003Cp\u003EIt doesn\u0027t matter unless you want to be orbiting a specific direction. If you don\u0027t care, you can go in on either side.\u003C/p\u003E\u003Cp\u003EIf you do care, you need to make sure your direction of travel across the planet is the same or opposite the rotation of the planet, and then there are polar orbits.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-08T07:07:11Z\u0022 title=\u002209/08/2015 07:07  AM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 8, 2015\u003C/time\u003E by Alshain\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-09-08T07:10:08Z","Content":"\n\u003Cp\u003EIf you want to land, you\u0027ll need to expend more fuel if you come from a retrograde orbit than from a prograde one.\u003C/p\u003E\u003Cp\u003EFixing your orbit early in transfer is very cheap, and while you\u0027re there: put your PE on equatorial, so you\u0027ll get a very far AN or DN node to do some cheap inclination change.\u003C/p\u003E\n"},{"CreatedByName":"ghpstage","CreatedById":129622,"CreatedDateTime":"2015-09-08T07:46:50Z","Content":"\n\u003Cp\u003EMost of the results of a retrogradce orbit are felt after the orbit is achieved, the increased dV cost for landing on planets that has already been mentioned being one, but also as all moons in the stock system orbit their parent planets prograde it makes getting to those extremely costly!\u003C/p\u003E\n"},{"CreatedByName":"tbarcello","CreatedById":147952,"CreatedDateTime":"2015-09-08T08:45:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Przemqo\u0022 data-cite=\u0022Przemqo\u0022\u003E\u003Cdiv\u003EHey, can someone clarify me this: if I am approaching other planet (other SOI, to be exact) and I want to perform burn to get captured, does it make a difference on which side of the planet periapsis will be? I know it is important for slingshots, but for that? I tried to find the answer but I am still confused. Thanks!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFor example, you want to make eccentric orbit 50 km on 500 km. I would set up my approach to 500km and make a burn to circulize or make 50k periapsis, only because I\u0027m using nuclear engines that take longer to burn, so it is easier to time the burn on higher orbit.\u003C/p\u003E\n"},{"CreatedByName":"Geher","CreatedById":116288,"CreatedDateTime":"2015-09-08T12:27:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tbarcello\u0022 data-cite=\u0022tbarcello\u0022\u003E\u003Cdiv\u003EFor example, you want to make eccentric orbit 50 km on 500 km. I would set up my approach to 500km and make a burn to circulize or make 50k periapsis, only because I\u0027m using nuclear engines that take longer to burn, so it is easier to time the burn on higher orbit.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut it costs more fuel, because you\u0027re not exploiting the oberth effect.\u003C/p\u003E\n"},{"CreatedByName":"mrclucks","CreatedById":139561,"CreatedDateTime":"2015-09-08T13:10:57Z","Content":"\n\u003Cp\u003EI don\u0027t believe it matters which way you end up orbiting to get captured. Coming in prograde will speed you up relative to solar orbit, but not the body you\u0027re orbiting and coming in retro is the reverse. \u003C/p\u003E\u003Cp\u003EIf you are in a retrograde orbit and you enter an atmosphere, you will expirence more drag and heat due to the atmosphere rotating against you at the speed of the planets rotation. On the flip side, when you enter an atmosphere on a prograde orbit, the atmosphere is rotating with you and your relative speed to the atmosphere is your orbital speed minus the planet rotation (its not 100% due to needing some sort of angle to enter an atmosphere)\u003C/p\u003E\n"},{"CreatedByName":"Gaarst","CreatedById":126740,"CreatedDateTime":"2015-09-08T13:27:09Z","Content":"\n\u003Cp\u003EAs said above prograde or retrograde orbit do not change much. If you orbit a body prograde and want to land on it then you\u0027ll spare the dV corresponding to the body\u0027s rotation velocity.\u003C/p\u003E\u003Cp\u003ERetrograde orbits allow you to have free return trajectories (used by Apollo) but it\u0027s not really useful for KSP...\u003C/p\u003E\n"},{"CreatedByName":"Przemqo","CreatedById":150827,"CreatedDateTime":"2015-09-08T14:01:53Z","Content":"\n\u003Cp\u003EOkay, now I understand, thank you all!\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-09-08T14:45:00Z","Content":"\n\u003Cp\u003EMost bodies rotate so slowly that it won\u0027t matter much for landing - not more than 100 m/s.\u003C/p\u003E\u003Cp\u003EWhen you\u0027ve landed, look at the difference between yoursurface and orbital velocity... that is how much you save.\u003C/p\u003E\u003Cp\u003EThat\u0027s also how much you save if you launch into a prograde orbit afterwards.\u003C/p\u003E\u003Cp\u003EIt won\u0027t matter much (the heating will be different, that is all) if you will be landing in a body with an atmosphere\u003C/p\u003E\u003Cp\u003EThe biggest difference is if you plan on going to a moon orbiting the planet that you captured at, because they all orbit prograde\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-09-08T23:17:42Z","Content":"\n\u003Cp\u003EI generally enter prograde because it saves me a little DV for landing, orbit, and escape. \u003C/p\u003E\u003Cp\u003E But often for bodies that are tidally- locked I will enter polar so I can hit all of the biomes.\u003C/p\u003E\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"},{"CreatedByName":"Starhawk","CreatedById":131400,"CreatedDateTime":"2015-09-09T00:16:18Z","Content":"\n\u003Cp\u003EThis ^.\u003C/p\u003E\u003Cp\u003EHappy landings!\u003C/p\u003E\n"},{"CreatedByName":"jstnwht","CreatedById":114462,"CreatedDateTime":"2015-09-09T00:22:30Z","Content":"\n\u003Cp\u003EWhy does a tidally locked planet deserve a polar orbit? Do not all bodies require some sort of inclination to get science in different biomes? I always attempt a prograde capture first, but for flybys (of the mun) I enter retrograde so it slings me back into a kerbin atmospheric capture. It depends on what you are trying to accomplish.\u003C/p\u003E\u003Cp\u003EEdit: I know biomes are all along the equator, but polar orbits always guarantee all the biomes will be hit, as long as your orbit isn\u0027t synchronous or resonant with sidereal rotation.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-09T00:25:05Z\u0022 title=\u002209/09/2015 12:25  AM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 9, 2015\u003C/time\u003E by jstnwht\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"jiminator","CreatedById":149196,"CreatedDateTime":"2015-09-09T02:00:15Z","Content":"\n\u003Cp\u003EI reentered the kerbin soi with a reusable craft but found I was retrograde, thus all all encounters were going to be difficult. I was able to use mun though to flip my orbit around, so that works.\u003C/p\u003E\n"}]}