{"TopicId":120409,"ForumId":44,"TopicTitle":"Constelation program restart?","CreatedByName":"Spacetraindriver","CreatedById":149403,"CreatedDateTime":"2015-09-08T03:36:26Z","PageNum":1,"Articles":[{"CreatedByName":"Spacetraindriver","CreatedById":149403,"CreatedDateTime":"2015-09-08T03:36:26Z","Content":"\n\u003Cp\u003EAs some of you might know, Obama basically threw NASA\u0027s manned spacecrafts out of the window. Including the Constellation program. Current Orion does not count as it is not manned YET. In fact I\u0027m surprised NASA even has funding these days considering the war in the middle east. But presidential elections are coming soon, which means new decisions. Which might affect NASA. Hillary, I\u0027m worried she might throw out NASA all together. Though I\u0027m thinking about the one all over the news about his aggressive campaigns. I thinking he might just be the one to revive NASA. What do you think?\u003C/p\u003E\n"},{"CreatedByName":"Sampa","CreatedById":130079,"CreatedDateTime":"2015-09-08T03:44:00Z","Content":"\n\u003Cp\u003Eyou mean Trump? Yeah! He or some other Republican!\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EBut, this is NOT the place to be talking politics...\u003C/p\u003E\n"},{"CreatedByName":"Spacetraindriver","CreatedById":149403,"CreatedDateTime":"2015-09-08T03:46:43Z","Content":"\n\u003Cp\u003EOpps...\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-09-08T04:11:45Z","Content":"\n\u003Cp\u003EConstellation wasn\u0027t even going to work. They had trouble with Ares1, and Ares V wasn\u0027t making much headway either. Not to mention that Altair practically didn\u0027t even exist as a well thought out design.\u003C/p\u003E\u003Cp\u003ENo, getting rid of Ares 1 and just using the heavy launcher portion was the right way to go.\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-09-08T04:16:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Spacetraindriver\u0022 data-cite=\u0022Spacetraindriver\u0022\u003E\u003Cdiv\u003EAs some of you might know, Obama basically threw NASA\u0027s manned spacecrafts out of the window.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow so?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Spacetraindriver\u0022 data-cite=\u0022Spacetraindriver\u0022\u003E\u003Cdiv\u003EIncluding the Constellation program.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EConstellation lacked focus. It was over budget and way behind schedule. Besides, it wasn\u0027t cancelled, it was really redirected into the \u003Ca href=\u0022https://en.wikipedia.org/wiki/Space_Launch_System\u0022 rel=\u0022external nofollow\u0022\u003ESLS\u003C/a\u003E which is still in development.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Spacetraindriver\u0022 data-cite=\u0022Spacetraindriver\u0022\u003E\u003Cdiv\u003ECurrent Orion does not count as it is not manned YET.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou mean the SLS? What about the push for privatization, the Dragon, the CST-100, and the DreamChaser? Do those not count as manned space craft? Constellation wasn\u0027t manned yet either, it wasn\u0027t finished, and wasn\u0027t likely to ever be at the rate they were going.\u003C/p\u003E\u003Cp\u003EI think the only one we have to worry about, Republican or Democrat is Ted Cruz. He has been anti-NASA for a very long time, and unfortunately he is currently in charge of NASA.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-08T04:18:26Z\u0022 title=\u002209/08/2015 04:18  AM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 8, 2015\u003C/time\u003E by Alshain\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"fredinno","CreatedById":143381,"CreatedDateTime":"2015-09-08T06:35:35Z","Content":"\n\u003Cp\u003EThe question is, why? SLS is a overall better, more flexible, and cheaper design, why go back?\u003C/p\u003E\u003Cp\u003EIf NASA wanted to launch Orion to LEO, and do a lunar misson Constellation-style, and launch people to the ISS instead if CCDev, they would use Delta IV Heavy instead of Ares I in the new architecture. After all, the Delta-5 meter upper stage is near- identical to the ICPS, making Block I human-rating much easier and cheaper.\u003C/p\u003E\u003Cp\u003EIf more performace was needed, then you could use the human-rated Atlas rocket (but using a new 3-core heavy variant.\u003C/p\u003E\u003Cp\u003EAltair was also a bad idea overall- it was too big, and Lunar orbital insertion was better done by a detachable upper stage (or a larger Ares V upper stage).\u003C/p\u003E\u003Cp\u003ENo, don\u0027t revive Constellation. Please.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2015-09-08T10:10:07Z","Content":"\n\u003Cp\u003EI haven\u0027t seen anything indicating that Trump is pro-space or that Clinton is anti-space. Space policy is so way down on the agendas of both sides (and of the public opinion) that it doesn\u0027t even register. If anything, I would think that democrats would be pro-government spending (which would be good for NASA, right?), and republicans would be against it, but then logic rarely applies in politics. And unfortunately, we aren\u0027t allowed to discuss those topics here, so I\u0027ll stop at that.\u003C/p\u003E\u003Cp\u003EConstellation was a flawed concept on many levels, and although there was a \u0022Vision for Space Exploration\u0022, it was actually just cheap talk with no funding to back it up. Because of that, and because of some fundamental design decisions that were more based on pleasing some corporations rather than technical requirements, the whole thing was doomed from the start. It was basically set up as poison for the next administration who had no other option than to cancel it.\u003C/p\u003E\u003Cp\u003EThe same is true for SLS, which most people understand is unsustainable at the current funding levels and with no proper goal. The next administration will have to choose between one of the following options:\u003C/p\u003E\u003Cp\u003E- Cancel SLS and concentrate on yet another vehicle development program. This would continue the trend of handing out money to the usual contractors regardless of whether it accomplishes anything (which is NASA\u0027s main purpose nowadays). However, it would basically gut the manned spaceflight program for another decade.\u003C/p\u003E\u003Cp\u003E- Focus on Mars. At realistic budget levels, this would end up being a 20 year program to develop the vehicles. In the meantime, the SLS will sit around in a hangar costing billions to maintain and waiting for a payload. Realistically though, a lot of money will be spent on contractors (which will make Congress happy), and the whole thing will be cancelled with the next change of administration.\u003C/p\u003E\u003Cp\u003E- Focus on returning to the Moon. IMO, this is the only achievable goal at current funding levels and the only way to leverage SLS and Orion. The only new hardware development that\u0027s needed is a lander. That will probably take 10 years to develop, but by that time the ISS will be ending and funds can then be diverted to a semi-permanent lunar outpost. Congress won\u0027t like this, because it means less money being poured into their constituencies, but NASA would actually achieve something.\u003C/p\u003E\u003Cp\u003ELet\u0027s face it, Orion was designed to go to Moon, and that\u0027s pretty much all it can do. It will never be an interplanetary vehicle and there really isn\u0027t much else \u0022Beyond Low-Earth Orbit\u0022 that it can actually be used for. It\u0027s useless for Mars and visiting Lagrange points or picking up pieces of asteroids gets old after you\u0027ve done it once.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-08T10:19:03Z\u0022 title=\u002209/08/2015 10:19  AM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 8, 2015\u003C/time\u003E by Nibb31\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"montyben101","CreatedById":74173,"CreatedDateTime":"2015-09-08T10:17:45Z","Content":"\n\u003Cp\u003EHmm. I have a feeling that if they cancelled NASA people would have a complete .... fit.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2015-09-08T10:29:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022montyben101\u0022 data-cite=\u0022montyben101\u0022\u003E\u003Cdiv\u003EHmm. I have a feeling that if they cancelled NASA people would have a complete .... fit.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI doubt you could actually shut down NASA. After all, NASA does much more than manned spaceflight. There is all the unmanned exploration, the aeronautical research, and the international cooperation, that is all necessary.\u003C/p\u003E\u003Cp\u003EBut you can cancel programs and if NASA was reduced to those missions and just complete the ISS program, I don\u0027t think the public opinion would care much.\u003C/p\u003E\u003Cp\u003EHowever, there is a lot to think about before you do cancel a major program. You need to think about the consequences and to provide an alternative for the people who worked on those programs. When you put 10000 aerospace engineers out of work, you risk losing the technological edge and your technical capability as a nation. NASA pays contractors, contractors pay workers, workers pay taxes, buy stuff, and keep the economy afloat. Government spending is never wasted. Having unemployed engineers sitting around seeking jobs elsewhere is bad for everyone.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-08T10:31:18Z\u0022 title=\u002209/08/2015 10:31  AM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 8, 2015\u003C/time\u003E by Nibb31\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2015-09-08T10:55:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Spacetraindriver\u0022 data-cite=\u0022Spacetraindriver\u0022\u003E\u003Cdiv\u003EHillary, I\u0027m worried she might throw out NASA all together.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E That\u0027d require repealing the NASA creation act-an act of congress-the POTUS doesn\u0027t have that authority. Do you not have civics classes where you are?\u003C/p\u003E\n"},{"CreatedByName":"_Augustus_","CreatedById":115084,"CreatedDateTime":"2015-09-08T11:19:42Z","Content":"\n\u003Cp\u003EDidn\u0027t Congress sign a bill to make the SLS un-cancellable?\u003C/p\u003E\u003Cp\u003EAlso, it\u0027s our own fault that we have such bureaucracy and why all of our young people don\u0027t even know about 3/4 of our space program and think that the whole Saturn V landed on the moon, and why we have senators thinking that there are flags planted on Mars. We never bothered to educate Gen X and millennials in these things, but those people are now running our nation and are too rigid to re-learn anything. They don\u0027t care unless they get to go to Mars themselves, that\u0027s why everyone likes Mars One but not NASA or SpaceX. NASA is trying with Gen Y, but they\u0027re all still under 16 and will probably be told by their parents to work at McDonald\u0027s or a prison instead of the aerospace industry or NASA.\u003C/p\u003E\u003Cp\u003EThe aerospace industry itself is pretty bloated, the only reason we have HLLV\u0027s is because satellite producers refuse to innovate and keep making ridiculous 5-ton satellites that could probably be compacted down to half that mass. While the SLS is certainly a good rocket, it\u0027s almost as expensive as making completely new hardware and is really just an excuse to keep the Shuttle contractors in business. \u003Cstrong\u003EThe DOD is going to be sold SLS rockets to use to launch spy satellites, no joke. Boeing has actually made a deal to do that already.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EMeanwhile, even though NASA is struggling to get 20 billion dollars a year, we give out hundreds of billions of dollars like candy to other nations.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EChina\u003C/strong\u003E is having issues and they could collapse before they plant a flag on the moon.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ERussia\u003C/strong\u003E is biting more than they can chew lately, and Angara is a terrible design, they only like it because it\u0027s cheap unlike Energia. They could literally go to the Moon with minimal new technology but instead they want to build Clustermax Xtreme and the Orionski.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EIndia\u003C/strong\u003E has hope, but they\u0027re decades away from doing anything beyond LEO. \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EIran\u003C/strong\u003E thinks that they can get a guy in space, but if that ever happens before I\u0027m dead then you can give me a punch in the nose.\u003C/p\u003E\u003Cp\u003EForget Europe. The EU is just going to fall apart anyway, there\u0027s no way Europe will have a manned spacecraft of it\u0027s own.\u003C/p\u003E\u003Cp\u003EIf we get one of the two oddball non-politican Republican candidates elected, though, NASA has hope.\u003C/p\u003E\u003Cp\u003ECarson is a scientist, he naturally would give a boost to NASA and other scientific administrations, right? And Trump, in his own words, \u0022wants America to do things again\u0022. That probably includes going to the Moon and Mars..\u003C/p\u003E\u003Cp\u003ENot talking politics, just saying.\u003C/p\u003E\u003Cp\u003EAlso why are so many people saying NASA is dead? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-08T11:25:42Z\u0022 title=\u002209/08/2015 11:25  AM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 8, 2015\u003C/time\u003E by _Augustus_\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"shynung","CreatedById":101096,"CreatedDateTime":"2015-09-08T11:24:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EHowever, there is a lot to think about before you do cancel a major program. You need to think about the consequences and to provide an alternative for the people who worked on those programs. When you put 10000 aerospace engineers out of work, you risk losing the technological edge and your technical capability as a nation. NASA pays contractors, contractors pay workers, workers pay taxes, buy stuff, and keep the economy afloat. Government spending is never wasted. Having unemployed engineers sitting around seeking jobs elsewhere is bad for everyone.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo basically, it doesn\u0027t really matter whether some NASA program was making progress or not. It\u0027s just to keep them busy, so to speak.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2015-09-08T11:37:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022shynung\u0022 data-cite=\u0022shynung\u0022\u003E\u003Cdiv\u003ESo basically, it doesn\u0027t really matter whether some NASA program was making progress or not. It\u0027s just to keep them busy, so to speak.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExplains a lot, doesn\u0027t it...\u003C/p\u003E\n"},{"CreatedByName":"shynung","CreatedById":101096,"CreatedDateTime":"2015-09-08T11:56:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EExplains a lot, doesn\u0027t it...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI was afraid something like this was going to happen.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E Sad to know it has happened for a very long time, but nothing I can do from here.\u003C/p\u003E\u003Cp\u003EAt least my copy of KSP hasn\u0027t failed on me yet.\u003C/p\u003E\n"},{"CreatedByName":"MinimumSky5","CreatedById":115138,"CreatedDateTime":"2015-09-08T11:56:34Z","Content":"\n\u003Cp\u003EDon\u0027t write off Europe yet, despite what our PM likes to say, it\u0027s too good of an idea for everyone to throw their hands up and call it quits. Also, ESA has a much better method of fundraising than NASA, as it gets X% of the money that the EU raises in taxes (I don\u0027t know the actual percentage), which is handed to them with no tags attached (So rather than being told \u0022This money is for this probe, and this money is for the ISS\u0022 they get a fat wad of cash and spend it as they see fit, so random politics can\u0027t derail their programs.)\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2015-09-08T12:53:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022_Augustus_\u0022 data-cite=\u0022_Augustus_\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003ERussia\u003C/strong\u003E is biting more than they can chew lately, and Angara is a terrible design, they only like it because it\u0027s cheap unlike Energia. They could literally go to the Moon with minimal new technology but instead they want to build Clustermax Xtreme and the Orionski.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E Angara is an excellent design for what it\u0027s designed to do; replace the various ICBM-conversion small launchers for small Russian government payloads and Proton for large GSO ones, while using \u0027green\u0027 propellants to keep the Kazakhs happy. Complaining it isn\u0027t in the same class as SLS is like complaining a combine harvester can\u0027t hit 60.\u003C/p\u003E\n"},{"CreatedByName":"Spacetraindriver","CreatedById":149403,"CreatedDateTime":"2015-09-08T14:36:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Alshain\u0022 data-cite=\u0022Alshain\u0022\u003E\u003Cdiv\u003EHow so?\u003Cp\u003EConstellation lacked focus. It was over budget and way behind schedule. Besides, it wasn\u0027t cancelled, it was really redirected into the \u003Ca href=\u0022https://en.wikipedia.org/wiki/Space_Launch_System\u0022 rel=\u0022external nofollow\u0022\u003ESLS\u003C/a\u003E which is still in development.\u003C/p\u003E\u003Cp\u003EYou mean the SLS? What about the push for privatization, the Dragon, the CST-100, and the DreamChaser? Do those not count as manned space craft? Constellation wasn\u0027t manned yet either, it wasn\u0027t finished, and wasn\u0027t likely to ever be at the rate they were going.\u003C/p\u003E\u003Cp\u003EI think the only one we have to worry about, Republican or Democrat is Ted Cruz. He has been anti-NASA for a very long time, and unfortunately he is currently in charge of NASA.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThose are by private compainies sooooooo\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2015-09-08T15:28:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Spacetraindriver\u0022 data-cite=\u0022Spacetraindriver\u0022\u003E\u003Cdiv\u003EThose are by private compainies sooooooo\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJust like every US spacecraft in the past, CST-100 and Dragon are funded by NASA and built by private sector contractors.\u003C/p\u003E\u003Cp\u003EThe only difference is in the way the contracts are structured, but Commercial Crew is fundamentally a government program for launching NASA astronauts into space.\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2015-09-08T15:59:58Z","Content":"\n\u003Cp\u003ENASA won\u0027t be cancelled, and their budget will remain as it is. It has been very consistent in the long term in constant dollars since Apollo. NASA, like military bases, national labs, etc, is not going anywhere since it was intentionally spread among as many districts as possible (including 3 high electoral vote states). This has been true since the Washington Administration\u0027s frigate building program. \u003C/p\u003E\u003Cp\u003EConstellation wasn\u0027t going to work. People need to give up on the \u0022apollo\u0022 model, it\u0027s not a thing any more unless we have a new \u0022Cold War,\u0022 to generate a new Space Race. If the chinese start claiming they own real estate on the Moon, perhaps, and claim large chunks as sovereign territory. Short of that, NASA will plug along, forced to buy what Congress wants (because the right people make hay from the pork). Never forget that Apollo was the biggest porkbarrel ever.\u003C/p\u003E\n"},{"CreatedByName":"fredinno","CreatedById":143381,"CreatedDateTime":"2015-09-08T17:14:22Z","Content":"\n\u003Cp\u003EA Lunar return is not the only mission plan that\u0027d actually be achievable within current funding levels.\u003C/p\u003E\u003Cp\u003EOrion can visit Earth-Moon langrage points with no extra hardware (albeit such a thing would be pointless, and a useful mission would require a HAB module to test long duration spaceflight. (can be based off ISS modules, \u0027dry workshop\u0027 of SLS EUS, or an infltable Bigelow space station (though tge latter would need more development dollars)) The HAB technology could also be extended to Mars and Venus Flybys, and by sending a ARM-derived lander first(whuch would be docked to) to NEOs and Mars\u0027 moons. Then, you could build a self-sustaining astrodial base off of this hardware, with the basic habitat module being based off the L2 HAB. Use this base to study the NEO, along with mining techniques.\u003C/p\u003E\u003Cp\u003ELunar landers don\u0027t really have anything to do with existing tehnology-Altair didn\u0027t ever really get off the drawing board, and this mission proposal fits the \u0027flexible path\u0027 climate in NASA today (though this is admittedly subject to change).\u003C/p\u003E\n"},{"CreatedByName":"fredinno","CreatedById":143381,"CreatedDateTime":"2015-09-08T17:51:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022_Augustus_\u0022 data-cite=\u0022_Augustus_\u0022\u003E\u003Cdiv\u003EDidn\u0027t Congress sign a bill to make the SLS un-cancellable? \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes. Even if they didn\u0027t, cancelling SLS would be even more unpopular than cancelling Constellation, as it\u0027s way farther in development than Constellation, and there is no space shuttle backup program to keep manned spaceflight running in case things don\u0027t go well. The latter is probably one of the primary reason the shuttle was developed. But I digress.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022_Augustus_\u0022 data-cite=\u0022_Augustus_\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThey don\u0027t care unless they get to go to Mars themselves, that\u0027s why everyone likes Mars One but not NASA or SpaceX. NASA is trying with Gen Y, but they\u0027re all still under 16 and will probably be told by their parents to work at McDonald\u0027s or a prison instead of the aerospace industry or NASA. \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027d dispute that.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\u003Cp\u003EMost people don\u0027t care about space travel in my opinion, because it is going very slowly. It\u0027s not very exciting (to most) when it takes over 40 years to send men to another celestial object like we did in the \u002770s.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022_Augustus_\u0022 data-cite=\u0022_Augustus_\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThe aerospace industry itself is pretty bloated, the only reason we have HLLV\u0027s is because satellite producers refuse to innovate and keep making ridiculous 5-ton satellites that could probably be compacted down to half that mass. \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENah. Ion drive space tugs would fix the problem better and obsolete HLV for anything else than government launches.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022_Augustus_\u0022 data-cite=\u0022_Augustus_\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EWhile the SLS is certainly a good rocket, it\u0027s almost as expensive as making completely new hardware and is really just an excuse to keep the Shuttle contractors in business. \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo, the Ares V, with (largely) completely new hardware, was better than SLS, with it\u0027s Shuttle-derived infrastructure? (I know it\u0027s not that simple, but still) Tell that to the people who made Jupiter DIRECT, who are a major reason for SLS being as it is. BTW, NASA \u003Cem\u003Ecould\u003C/em\u003E probably hire the same contractors to make a completely new rocket design.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022_Augustus_\u0022 data-cite=\u0022_Augustus_\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003Cstrong\u003EThe DOD is going to be sold SLS rockets to use to launch spy satellites, no joke. Boeing has actually made a deal to do that already.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESource? \u003C/p\u003E\u003Cp\u003EThere are 2 things I can think of where SLS would be useful fro DOD-\u003C/p\u003E\u003Cp\u003E1. Manned Reconnaissance (not happening, due to the fact that it would be better done by unmanned spacecraft).\u003C/p\u003E\u003Cp\u003E2. Kinetic Bombardment. \u003Cimg src=\u0022http://www.closedtruth.com/wp-content/uploads/2013/02/rods.jpg\u0022 alt=\u0022rods.jpg\u0022\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Kinetic_bombardment\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Kinetic_bombardment\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThis could technically be done by launching the 9T rods proposed with EELVs, though this would require a LOT of launches I\u0027m not exactly sure would be economical. 10 rods in a launcher like the one shown in a polar orbit, would probably require a Block II SLS. \u003C/p\u003E\u003Cp\u003EAs a bonus, each one would be impossible to shoot down (Mach 10 speed) and would cause about as much damage as a small nuclear warhead. \u003C/p\u003E\u003Cp\u003EI think that new facilities would be required though, with current proposed infrastructure only allowing for up to 2 launches per year, that would be a pretty major bottleneck for the deploying of such a system. It would also require a new launch pad for SLS polar orbital launches. SLC-6E anyone?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022_Augustus_\u0022 data-cite=\u0022_Augustus_\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003Cstrong\u003ERussia\u003C/strong\u003E is biting more than they can chew lately, and Angara is a terrible design, they only like it because it\u0027s cheap unlike Energia. They could literally go to the Moon with minimal new technology but instead they want to build Clustermax Xtreme and the Orionski.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, reviving Energia would be like reviving Saturn V. It\u0027s too old to be done economically.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tater\u0022 data-cite=\u0022tater\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EConstellation wasn\u0027t going to work. People need to give up on the \u0022apollo\u0022 model, it\u0027s not a thing any more unless we have a new \u0022Cold War,\u0022 to generate a new Space Race. If the chinese start claiming they own real estate on the Moon, perhaps, and claim large chunks as sovereign territory. Short of that, NASA will plug along, forced to buy what Congress wants (because the right people make hay from the pork). Never forget that Apollo was the biggest porkbarrel ever.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EClaiming territory on other worlds is illegal anyways:P.\u003C/p\u003E\n"},{"CreatedByName":"shynung","CreatedById":101096,"CreatedDateTime":"2015-09-08T17:54:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tater\u0022 data-cite=\u0022tater\u0022\u003E\u003Cdiv\u003ENASA won\u0027t be cancelled, and their budget will remain as it is. It has been very consistent in the long term in constant dollars since Apollo. NASA, like military bases, national labs, etc, is not going anywhere since it was intentionally spread among as many districts as possible (including 3 high electoral vote states). This has been true since the Washington Administration\u0027s frigate building program.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOf course it won\u0027t. NASA is an agency, not a program; agencies cannot be \u0027cancelled\u0027.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhat\u0027s more likely to happen, given the current situation as I see it, is that NASA is going to be told to do things that may not actually bring any meaningful progress. The SLS program, for instance, might get cancelled the moment they are flight-ready, and get replaced by some other program to keep the engineers busy, so those engineers will pay taxes, buy stuff (=boost economy), and vote. The SLS itself may never get the chance to show their full capabilities; maybe a few test flights to (try to) convince people that all that hard work finally paid off, but no actual missions planned for it.\u003C/p\u003E\n"},{"CreatedByName":"fredinno","CreatedById":143381,"CreatedDateTime":"2015-09-08T17:59:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022shynung\u0022 data-cite=\u0022shynung\u0022\u003E\u003Cdiv\u003EOf course it won\u0027t. NASA is an agency, not a program; agencies cannot be \u0027cancelled\u0027.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003Cp\u003EWhat\u0027s more likely to happen, given the current situation as I see it, is that NASA is going to be told to do things that may not actually bring any meaningful progress. The SLS program, for instance, might get cancelled the moment they are flight-ready, and get replaced by some other program to keep the engineers busy, so those engineers will pay taxes, buy stuff (=boost economy), and vote. The SLS itself may never get the chance to show their full capabilities; maybe a few test flights to (try to) convince people that all that hard work finally paid off, but no actual missions planned for it.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut would they? Look at the Shuttle, they had themselves scrambling for meaningful payloads much of the time after Challenger until ISS construction, and it existed for 30 years despite never achieving what it set out to do, and overall being an expensive detour. The only program post-space race I can think that ended like how you proposed SLS would end, was Energia-Buran, which was because the Soviet Union was dying, and was practically unable to fund it.\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2015-09-08T18:11:44Z","Content":"\n\u003Cp\u003EI\u0027d like to think by time SLS is ready to fly there would be at least one payload in development. A lot can happen in three years. For better or worse.\u003C/p\u003E\u003Cp\u003EI\u0027m thinking Space X is going to pull the rug out from under everyone.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-08T18:21:24Z\u0022 title=\u002209/08/2015 06:21  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 8, 2015\u003C/time\u003E by Motokid600\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ten Key","CreatedById":123319,"CreatedDateTime":"2015-09-08T19:59:31Z","Content":"\n\u003Cp\u003EPolitical dysfunction isn\u0027t a new phenomenon-- certainly, the 1950\u0027s and \u002760\u0027s were not a time of great political stability. And yet, somehow we managed. And we will continue to manage. . .sometimes ya\u0027ll can be so negative it\u0027s depressing. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\u003Cp\u003ENASA does a lot more than manned spaceflight. A \u003Cem\u003Elot\u003C/em\u003E more. And if SLS is just pork barrel spending with no mission (and it is) it at least gives NASA a bit of a head start should something interesting happen. Breakout capability, if you will. \u003C/p\u003E\u003Cp\u003EI would very much like for us to go to Mars. ISRU makes more sense on Mars, it takes less energy to get there and I think Mars has more to teach us about spaceflight and interplanetary exploration. But the hardware currently under development is certainly more suited for a return to the Moon, and if nothing else it would be very interesting to see how the human body reacts to long duration exposure to lunar gravity. If Europe decides to get serious about a research outpost on the Moon once the ISS is over and done with, I think that would be a good thing for NASA to participate in. \u003C/p\u003E\u003Cp\u003EBut no, NASA is not \u0022dying\u0022. The states of Florida, Texas and California would \u003Cem\u003Enever\u003C/em\u003E let that happen. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"}]}