{"TopicId":120655,"ForumId":32,"TopicTitle":"Things that stand between you and playing the same KSP save","CreatedByName":"nothingSpecial","CreatedById":118683,"CreatedDateTime":"2015-09-11T14:06:59Z","PageNum":1,"Articles":[{"CreatedByName":"nothingSpecial","CreatedById":118683,"CreatedDateTime":"2015-09-11T14:06:59Z","Content":"\n\u003Cp\u003ESeveral days ago I hopefully finished my thesis si I thought \u0022Well, I can try career with Tree Toppler - no grind with 100% contracts, oh boy!\u0022.\u003C/p\u003E\u003Cp\u003EHa. Ha.\u003C/p\u003E\u003Cp\u003EToday all the active contracts have gone. I was going to colonize Minmus, then Mun, then slowly gather orbital infrastructure and train my Kerbanauts on Dune to finally go get the Laythe (and maybe Eve, who knows?).\u003C/p\u003E\u003Cp\u003EAnd now I lost all my motivation to do this.\u003C/p\u003E\u003Cp\u003EAnd the same thing go every time that I plan to make some kind of logically plausible story - something interrupts me, and I just go and start from scratch.\u003C/p\u003E\u003Cp\u003ESo I usually play in sandbox when I have some vaguely shaped project in mind (like \u0022learn manual docking\u0022, \u0022learn interplanetary\u0022, \u0022learn shuttles\u0022). But I do really really want some day to make a proper progression.\u003C/p\u003E\u003Cp\u003ESo... Have you ever faced anything that hampers your playthrough?\u003C/p\u003E\n"},{"CreatedByName":"Johnny Wishbone","CreatedById":118096,"CreatedDateTime":"2015-09-11T14:59:11Z","Content":"\n\u003Cp\u003EMaybe I\u0027m weird, but I actually get the most enjoyment in career mode from the early part of it. Once I\u0027ve gotten to the point of having enough tech and funds to get to Duna, I\u0027m pretty much bored. Way I see it, if I can get to Duna, I can get to anywhere in the system and basically the game becomes sandbox at that point. The fun for me is building up my program to get to that point. So I end up restarting my career games over and over again and work on ways to do more with less.\u003C/p\u003E\n"},{"CreatedByName":"Randazzo","CreatedById":136468,"CreatedDateTime":"2015-09-11T15:14:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Johnny Wishbone\u0022 data-cite=\u0022Johnny Wishbone\u0022\u003E\u003Cdiv\u003EMaybe I\u0027m weird, but I actually get the most enjoyment in career mode from the early part of it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s not weird. I find the most enjoyable part of the game to be the early Mun/Minmus trips. Once you\u0027ve been to all the biomes on each, you\u0027re pretty well set for tech. Add a couple trips to Duna or Ike, or even Eve or Gilly, and the tree should be done, especially if you have Mobile Labs churning out science over both the Mun and Minmus in the meantime. \u003C/p\u003E\u003Cp\u003EBeyond that I quickly get bored now. There\u0027s really no point going anywhere, each rock is just as desolate and bland as the next.\u003C/p\u003E\n"},{"CreatedByName":"nothingSpecial","CreatedById":118683,"CreatedDateTime":"2015-09-11T15:26:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Johnny Wishbone\u0022 data-cite=\u0022Johnny Wishbone\u0022\u003E\u003Cdiv\u003EMaybe I\u0027m weird, but I actually get the most enjoyment in career mode from the early part of it.\u003C/div\u003E\u003C/blockquote\u003EI agree with Randazzo, you do not seem to be weird for me too. The less is more approach is really pleasurable.\n"},{"CreatedByName":"monstah","CreatedById":95210,"CreatedDateTime":"2015-09-11T16:24:43Z","Content":"\n\u003Cp\u003EI, too, hang around the early part of the game for a lot longer than I need, and I restart my saves everytime a new version breaks some mod I was using and my ships explode.\u003C/p\u003E\u003Cp\u003EWhich is why I play with as little mod parts as I can.\u003C/p\u003E\n"},{"CreatedByName":"troyfawkes","CreatedById":109437,"CreatedDateTime":"2015-09-11T17:19:05Z","Content":"\n\u003Cp\u003EI slowly add more mods until the FPS is unbearable :/ I do have a pretty stable career going that I should just stick to, but now I\u0027m so tempted by 1.1 coming out that I don\u0027t think I\u0027ll be able to haha. Maybe with 1.1\u0027s performance fixes I\u0027ll do better?\u003C/p\u003E\n"},{"CreatedByName":"Columbia","CreatedById":135031,"CreatedDateTime":"2015-09-12T11:58:39Z","Content":"\n\u003Cp\u003EPerformance issues, other games, and too little time.\u003C/p\u003E\n"},{"CreatedByName":"TheAurora","CreatedById":138888,"CreatedDateTime":"2015-09-12T16:00:29Z","Content":"\n\u003Cp\u003EI have been going through an endless cycle that drives me insane. I will start out with stock, then get the urge to get mods that look cool, and eventually make an install that is unstable and have an urge to go back to stock. This along with my desire for logical progression ( Satellite, LEO, Moon, Station, Minmus etc.) is why I have never sent Kerbals anywhere except Duna even though I have played since .22. I always start over!\u003C/p\u003E\n"},{"CreatedByName":"nothingSpecial","CreatedById":118683,"CreatedDateTime":"2015-09-12T16:39:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheAurora\u0022 data-cite=\u0022TheAurora\u0022\u003E\u003Cdiv\u003EI have been going through an endless cycle that drives me insane. I will start out with stock, then get the urge to get mods that look cool, and eventually make an install that is unstable and have an urge to go back to stock. This along with my desire for logical progression ( Satellite, LEO, Moon, Station, Minmus etc.) is why I have never sent Kerbals anywhere except Duna even though I have played since .22. I always start over!\u003C/div\u003E\u003C/blockquote\u003ESo familiar.\u003Cp\u003EAlso I today finally break KSP trying to get better graphics (no mods, just OpenGL/memory optimization/etc), so even my \u0022go get Laythe\u0022 project is shelved.\u003C/p\u003E\u003Cp\u003EI suppose I will wait for 1.1.\u003C/p\u003E\n"},{"CreatedByName":"kStrout","CreatedById":116630,"CreatedDateTime":"2015-09-12T16:55:59Z","Content":"\n\u003Cp\u003EFor me it is always the next version of KSP, I have never played a carrier game further than a manned duna flyby Way back in 0.23(for now, I will do a duna base soon, just a bit more science), before the next version of KSP comes out, drastically changing the early game, so I start over and the whole process repeats itself.\u003C/p\u003E\n"},{"CreatedByName":"DocMoriarty","CreatedById":57433,"CreatedDateTime":"2015-09-12T17:05:33Z","Content":"\n\u003Cp\u003EThe last thing that made me stop playing my save was a bug. At some point just everything that was a little bigger than a handful parts started to explode as soon as I made it the current craft or at the latest when I started to accelerate time. It was not a SAS thing. Not even rebooting the system helped. So it must have been a bug written into the savegame, probably a falsely changed parameter about forces or something. My suspicion is that it was the result of a claw related bug since I play vanilla KSP.\u003C/p\u003E\u003Cp\u003EOther than that I try to stay to my savegame until a new main version is published. For most main versions so much changes (like 0.9-\u0026gt;1.0) that it makes more sense to start out new. So the reasons why I start new saves are:\u003C/p\u003E\u003Cp\u003E- New version of KSP with major changes\u003C/p\u003E\u003Cp\u003E- Bugs in savegame\u003C/p\u003E\n"}]}