{"TopicId":120864,"ForumId":32,"TopicTitle":"Kerbal Space Shuttle and rocket Economics","CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-09-14T10:33:39Z","PageNum":2,"Articles":[{"CreatedByName":"The_Rocketeer","CreatedById":81727,"CreatedDateTime":"2015-09-14T21:34:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Skorpychan\u0022 data-cite=\u0022Skorpychan\u0022\u003E\u003Cdiv\u003EThe most efficient space shuttle design would have been Buran-style, with the engines under the main fuel tank, and dedicated on-orbit engines making good use of onboard fuel.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell that depends what you mean by efficient. You\u0027d basically lose your ascent engines every launch when the ET decoupled. They have some big price tags, I understand.\u003C/p\u003E\n"},{"CreatedByName":"Highguard","CreatedById":150696,"CreatedDateTime":"2015-09-14T21:57:23Z","Content":"\n\u003Cp\u003EPure rocket SSTOs are easy to build than spaceplanes and much better able to handle wide or awkward payloads.\u003C/p\u003E\u003Cp\u003E\u0022Shuttle\u0022 style suffers from the aerodynamic limitations of spaceplanes and the fuel-hungry limitations of rockets. Either SSTO approach will always win, if you can get anywhere near KSC without wings and wheels.\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-09-14T22:52:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022More Boosters\u0022 data-cite=\u0022More Boosters\u0022\u003E\u003Cdiv\u003EI\u0027d like your comment on the shuttle I posted as it seems to deliver 42t to a 200 x 200 orbit just fine, recovering all but the ET. Though I\u0027m not sure that SSME stand in is a stock engine.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt looks cool, but its not \u0022close enough\u0022 functionally for what I\u0027m looking for:\u003C/p\u003E\u003Cp\u003E#1) That is a pre-1.0 video, where all engines have constant thrust whether at sea level or vacuum\u003C/p\u003E\u003Cp\u003E#2) Those are gimballing adjustable thrust liquid fuel boosters, not SRBs. While the real shuttle had thrust vectoring on the SRBs, we don\u0027t have that option. I think to stay true to the shuttle challenge, you shouldn\u0027t be able to adjust the throttle.\u003C/p\u003E\u003Cp\u003EUsing LFBs also gets you much better Isp and performance.\u003C/p\u003E\u003Cp\u003E#3) He doesn\u0027t recover the LFBs. He switches to them and deploys the parachute, but they will still despawn in the atmosphere, due to a gameplay limitation.\u003C/p\u003E\u003Cp\u003EThey actually despawn in the video if you pay attention.\u003C/p\u003E\u003Cp\u003EThis will severely impact the cost efficiency of this, as those LFBs are pretty expensive relative to SRBs.\u003C/p\u003E\u003Cp\u003EAs far as I can tell, the cost of those non-recoverable boosters is:\u003C/p\u003E\u003Cp\u003E25,000 for the KR-2L, 2,500 for the adaptor, 3,000x4 for the LF tanks, 800 for the 2.5 to 1.25m adaptor \u002B some chutes and probably sepratrons.\u003C/p\u003E\u003Cp\u003EOver 40,000 for each booster.... gone\u003C/p\u003E\u003Cp\u003EAlso, I don\u0027t like part clipping, which his designs use (to each their own though)\u003C/p\u003E\u003Cp\u003EI see on his thread, he updated it for 1.0 aero... he uses mammoth engines now, thats 39k just for the engine, and you can\u0027t really recover it.\u003C/p\u003E\u003Cp\u003EI\u0027m sure I could make a bigger shuttle. His version uses \u0026gt;6x the amount of LFO that mine uses, bit it gets a bigger payload to a higher orbit,\u003C/p\u003E\u003Cp\u003ENeither one is going to be very economical\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-14T22:55:07Z\u0022 title=\u002209/14/2015 10:55  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 14, 2015\u003C/time\u003E by KerikBalm\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"mikegarrison","CreatedById":137807,"CreatedDateTime":"2015-09-14T23:22:28Z","Content":"\n\u003Cp\u003EAir-breathing spaceplanes in KSP are way, way too optimistic. Partly it is because of the tiny Kerbin scale, and partly it is because of the completely unrealistic engines.\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-09-15T02:13:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022More Boosters\u0022 data-cite=\u0022More Boosters\u0022\u003E\u003Cdiv\u003ETechnically you don\u0027t even need to incline your engines if you balance the center of thrust by adding liquid fuel boosters connected under the external tank. Once the external tank dries up, dump it and the balancing LFBs. Maybe that would work? Anyway I\u0027ve seen some shuttles that lift oranges and more to orbit on Youtube. Once again I haven\u0027t had the chance to try this so take this for what its worth, but maybe your shuttle building isn\u0027t as refined as your SSTO building?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMoreBoosters,\u003C/p\u003E\u003Cp\u003E If I were to design an economically- viable STS style lifter in KSP... I wouldn\u0027t. STS- style launchers just plain aren\u0027t worth it for the economics and DV budget of Kerbin.\u003C/p\u003E\u003Cp\u003E Yeah, I realize that I \u003Cem\u003Ecould\u003C/em\u003E build something that\u0027s not much like the actual STS and get better results. That\u0027s why I build SSTO spaceplanes instead. I chose to build a design that\u0027s as faithful as I can get it to the actual STS using all stock parts. \u003C/p\u003E\u003Cp\u003E I *could* attach a booster to the tank, or go Ariane/ Dyna-Soar or a tank in the nose or sandwich or all sorts of other options. In fact, I\u0027ve played with all of them. But those aren\u0027t \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Efaithful STS designs.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EIt might very well be that my STS designs \u0022aren\u0027t as refined\u0022 as my SSTOs, but that ain\u0027t why you won\u0027t find vertical lift reusables that exceed 40% payload fraction. Nobody is making shuttles that can do that. Or for that matter, shuttles that can match the cost- effectiveness of disposables.\u003C/p\u003E\u003Cp\u003E You point out someone who\u0027s made an economical STS in KSP, and then restate your case.\u003C/p\u003E\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"},{"CreatedByName":"Geher","CreatedById":116288,"CreatedDateTime":"2015-09-15T06:28:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GoSlash27\u0022 data-cite=\u0022GoSlash27\u0022\u003E\u003Cdiv\u003EYou point out someone who\u0027s made an economical STS in KSP, and then restate your case.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, would you still call it a STS, when it has a heatshield, a probe core, some rcs and lot\u0027s of parachutes on the external tank?\u003C/p\u003E\n"},{"CreatedByName":"The_Rocketeer","CreatedById":81727,"CreatedDateTime":"2015-09-15T06:44:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Geher\u0022 data-cite=\u0022Geher\u0022\u003E\u003Cdiv\u003EWell, would you still call it a STS, when it has a heatshield, a probe core, some rcs and lot\u0027s of parachutes on the external tank?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIs this a joke? I want to laugh but it might come off as rude.\u003C/p\u003E\n"},{"CreatedByName":"More Boosters","CreatedById":147303,"CreatedDateTime":"2015-09-15T07:52:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GoSlash27\u0022 data-cite=\u0022GoSlash27\u0022\u003E\u003Cdiv\u003EMoreBoosters,\u003Cp\u003E If I were to design an economically- viable STS style lifter in KSP... I wouldn\u0027t. STS- style launchers just plain aren\u0027t worth it for the economics and DV budget of Kerbin.\u003C/p\u003E\u003Cp\u003E Yeah, I realize that I \u003Cem\u003Ecould\u003C/em\u003E build something that\u0027s not much like the actual STS and get better results. That\u0027s why I build SSTO spaceplanes instead. I chose to build a design that\u0027s as faithful as I can get it to the actual STS using all stock parts. \u003C/p\u003E\u003Cp\u003E I *could* attach a booster to the tank, or go Ariane/ Dyna-Soar or a tank in the nose or sandwich or all sorts of other options. In fact, I\u0027ve played with all of them. But those aren\u0027t \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Efaithful STS designs.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EIt might very well be that my STS designs \u0022aren\u0027t as refined\u0022 as my SSTOs, but that ain\u0027t why you won\u0027t find vertical lift reusables that exceed 40% payload fraction. Nobody is making shuttles that can do that. Or for that matter, shuttles that can match the cost- effectiveness of disposables.\u003C/p\u003E\u003Cp\u003E You point out someone who\u0027s made an economical STS in KSP, and then restate your case.\u003C/p\u003E\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt seems the main problem is the anemic recovery system, necessitating the use of mods.\u003C/p\u003E\u003Cp\u003EYou (and KerikBalm) came up with the whole \u0022honest to STS\u0022 thing,the thing was hardly efficient in real life and there\u0027s no way it can compete in a toy planet where SSTOs are possible without super future tech. The main idea always was recoverable payload fairing w/ engines launched vertically. \u003C/p\u003E\u003Cp\u003EAs for people making an economical STS in \u003Cstrong\u003Estock\u003C/strong\u003E KSP, it may not be possible, but I\u0027m not sure about mod usage. Even then, I still haven\u0027t had the chance to fool around with designs myself.\u003C/p\u003E\n"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-09-15T08:16:38Z","Content":"\n\u003Cp\u003EDoes RSS changes something ?\u003C/p\u003E\n"},{"CreatedByName":"More Boosters","CreatedById":147303,"CreatedDateTime":"2015-09-15T08:26:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Warzouz\u0022 data-cite=\u0022Warzouz\u0022\u003E\u003Cdiv\u003EDoes RSS changes something ?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell a user on the first page claimed that the only way to get a spaceplane to space is a shuttle-like assembly there.\u003C/p\u003E\n"},{"CreatedByName":"Nansuchao","CreatedById":135151,"CreatedDateTime":"2015-09-15T09:00:48Z","Content":"\n\u003Cp\u003EIn stock Kerbin you can reach orbit easily with a spaveplane, orbital speed 2.230 m/s more or less. Try to imagine doing the same thing in a planet 10 times Kerbin, with 130 km of atmosphere, with an orbital speed of 8.000 m/s more or less. How many spaceplanes you can build with more than 10 k of Delta/V? What payload can they bring to orbit? \u003C/p\u003E\u003Cp\u003EAnd, due to the fact that in RSS you have DRE, how easy it will be to reenter the atmosphere at more than 8.000 m/s?\u003C/p\u003E\u003Cp\u003EIn that case, a shuttle style vehicle is more useful, if you can manage to recover some empty stages.\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-09-15T09:07:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022More Boosters\u0022 data-cite=\u0022More Boosters\u0022\u003E\u003Cdiv\u003EIt seems the main problem is the anemic recovery system, necessitating the use of mods.\u003Cp\u003EYou (and KerikBalm) came up with the whole \u0022honest to STS\u0022 thing,the thing was hardly efficient in real life and there\u0027s no way it can compete in a toy planet where SSTOs are possible without super future tech. The main idea always was recoverable payload fairing w/ engines launched vertically. \u003C/p\u003E\u003Cp\u003EAs for people making an economical STS in \u003Cstrong\u003Estock\u003C/strong\u003E KSP, it may not be possible, but I\u0027m not sure about mod usage. Even then, I still haven\u0027t had the chance to fool around with designs myself.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMore Boosters,\u003C/p\u003E\u003Cp\u003E The main problem (at least in stock) is that the orbiter itself is dead weight and weighs more than the payload. You have to build a stack that will lift all of it into orbit instead of just the payload itself. That\u0027s a whole lot more fuel, structure, and boosters than you need for the job and when it\u0027s all said and done you\u0027ve spent more than the cost of 3 engines in order to save them.\u003C/p\u003E\u003Cp\u003E I\u0027m sure RSS changes the situation because SSTO spaceplanes are no longer viable, but even then I doubt an STS would be worth it. It was never competitive with disposables in real life.\u003C/p\u003E\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"},{"CreatedByName":"More Boosters","CreatedById":147303,"CreatedDateTime":"2015-09-15T09:13:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GoSlash27\u0022 data-cite=\u0022GoSlash27\u0022\u003E\u003Cdiv\u003EIt was never competitive with disposables in real life.\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut the point of this thread is to see how effective it would be if what made it non-competitive, the high maintenance costs, didn\u0027t exist. Now it\u0027s probably not competitive at stock KSP, but we still haven\u0027t heard details about RSS. Assuming RSS doesn\u0027t toy with the recovery system and you still get a full refund for a successful landing on the runway, it may be sensible there.\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-09-15T09:31:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022More Boosters\u0022 data-cite=\u0022More Boosters\u0022\u003E\u003Cdiv\u003EBut the point of this thread is to see how effective it would be if what made it non-competitive, the high maintenance costs, didn\u0027t exist. Now it\u0027s probably not competitive at stock KSP, but we still haven\u0027t heard details about RSS. Assuming RSS doesn\u0027t toy with the recovery system and you still get a full refund for a successful landing on the runway, it may be sensible there.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMore Boosters,\u003C/p\u003E\u003Cp\u003E I haven\u0027t played with RSS; I run 100% stock. But I doubt it could ever break even with a disposable due to KSP\u0027s cost balancing. Engines are too cheap and fuel is too expensive.\u003C/p\u003E\u003Cp\u003E Say your shuttle weighs 3 times the payload it carries. That means you need 4 times as much fuel and structure, 4x the boosters, and 4x more powerful main engines vs. a simple disposable. The whole thing exists in order to recover the cost of the engines. Expending 1/4 the fuel, boosters and structure and just wasting the weaker engines is cheaper overall.\u003C/p\u003E\u003Cp\u003E Best,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-09-15T09:40:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022More Boosters\u0022 data-cite=\u0022More Boosters\u0022\u003E\u003Cdiv\u003EIt seems the main problem is the anemic recovery system, necessitating the use of mods.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, the boosters aren\u0027t that expensive, but yea...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EYou (and KerikBalm) came up with the whole \u0022honest to STS\u0022 thing,the thing was hardly efficient in real life and there\u0027s no way it can compete in a toy planet where SSTOs are possible without super future tech. The main idea always was recoverable payload fairing w/ engines launched vertically. \u003Cp\u003EAs for people making an economical STS in \u003Cstrong\u003Estock\u003C/strong\u003E KSP, it may not be possible, but I\u0027m not sure about mod usage. Even then, I still haven\u0027t had the chance to fool around with designs myself.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, many of the economic issues present in real life are not present in KSP, as stated in the first post.\u003C/p\u003E\u003Cp\u003EAlso, I\u0027m not trying to compare it to SSTOs.\u003C/p\u003E\u003Cp\u003EI\u0027m wondering if it competes with disposable rockets... along the lines of Red\u0027s post:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003ERecovers the pricey rocket engine, all it discards are the SRBs and fuel tanks. Still, it is not the most economically viable, for that I would order them so:\u003Cp\u003E1. Airbreathing recoverable SSTO (fuel cost only)\u003C/p\u003E\u003Cp\u003E2. Pure rocket SSTO (fuel cost only, but higher than airbreathing)\u003C/p\u003E\u003Cp\u003E3. Shuttle style (fuel cost \u002B tanks and SRBs)\u003C/p\u003E\u003Cp\u003E4. Rocket with disposable stages (fuel cost \u002B tanks \u002B engines, etc)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E-fwiw, in my case, the orbiter itself does have some LFO storage in the form of the mk3 to 3.75m adaptor, thus some tankage is recovered (also, the OMS tanks).\u003C/p\u003E\u003Cp\u003EAnyway, I question if 3 is really cheaper than 4.\u003C/p\u003E\u003Cp\u003EI know it will not beat 1 or 2, thats not the question.\u003C/p\u003E\u003Cp\u003ESo in the case of my design, I calculated roughly 1,500 per ton to orbit.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/134299-Launch-Vehicle-Optimization-Test-Results\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/134299-Launch-Vehicle-Optimization-Test-Results\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThat guy is getting between 1200 to 1500 funds per ton to orbit with a 2 stage disposable system.\u003C/p\u003E\u003Cp\u003EI *might* be able to significantly improve my cost per ton to orbit with the STS style... perhaps down to 1,000, if I increase the fuel tankage of the orbiter I could save some funds that way (I\u0027m even envisioning recovering 1 of the two orange tanks inside the mk3 bay after the payload is released).\u003C/p\u003E\u003Cp\u003EThe SRBs will cost 10,800, of the \u0026gt;26,000 launch cost, and I don\u0027t think I can recover that cost.\u003C/p\u003E\u003Cp\u003ERecovering the orange tanks would save over 5000, but I think I\u0027ll only recover/eliminate 1 of them max.\u003C/p\u003E\u003Cp\u003E-Nothing to be done about fuel cost.\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-09-15T11:25:44Z","Content":"\n\u003Cp\u003EKerikBalm,\u003C/p\u003E\u003Cp\u003E You actually spent $27,000 to place 50t in orbit. 18t of that was payload.\u003C/p\u003E\u003Cp\u003E Had you treated the entire thing as payload and sacrificed the engine, it would\u0027ve dropped your launch cost to $1,000/ tonne.\u003C/p\u003E\u003Cp\u003E But of course you wouldn\u0027t have needed such a big ungainly stack or a Rhino just for an 18t payload, so your final cost would\u0027ve been much lower.\u003C/p\u003E\u003Cp\u003E I think there\u0027s also some confusion about part recovery and stock KSP. You\u0027re not going to recover the boosters without mods and I don\u0027t know if you\u0027re counting the tank as recovered.\u003C/p\u003E\u003Cp\u003E If you\u0027re using a mod to recover parts for your shuttle, there\u0027s no reason why you can\u0027t also recover spent stages on a traditional lifter as well. \u003C/p\u003E\u003Cp\u003E I did figure out where the discrepancy was between our designs, though: \u003C/p\u003E\u003Cp\u003E-Your shuttle, stack, and therefore payload are twice the mass of mine.\u003C/p\u003E\u003Cp\u003E-You\u0027re calculating the dropped bits as recovered and I\u0027m not.\u003C/p\u003E\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"},{"CreatedByName":"Nansuchao","CreatedById":135151,"CreatedDateTime":"2015-09-15T11:48:44Z","Content":"\n\u003Cp\u003EYou can have some useful shuttle style vehicle in RSS, but not following the STS way to launch. The advantage of shuttles, is that they can deliver payloads and crew together, and with KIS/KAS this becomes interesting. With the Recovery Stage mod then, you loose just the fuel.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-09-15T11:56:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GoSlash27\u0022 data-cite=\u0022GoSlash27\u0022\u003E\u003Cdiv\u003EThe reason shuttles can\u0027t keep up with disposables is the tyranny of the rocket equation. Most of what\u0027s placed in orbit is not payload, so the stack is huge in comparison. All the extra fuel and oxidizer erases any savings you get from returning the engines.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think of the tyranny of the rocket equation as the exponential growth of propellant mass with increasing dV requirements. Changing payload mass has a linear relationship with total propellant mass for a given dV requirement, so it\u0027s not quite as bad. For that matter it\u0027s not as if the disposable staged rocket puts only payload in orbit, the circularization stage must enter orbit as well. The penalty is the additional mass from a larger engine and the recovery equipment vs a disposable circularization stage, which I\u0027m pretty sure will be significantly less than the payload mass.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerikBalm\u0022 data-cite=\u0022KerikBalm\u0022\u003E\u003Cdiv\u003EAnyway, I question if 3 is really cheaper than 4.\u003Cp\u003EI know it will not beat 1 or 2, thats not the question.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat was very much a from-the-hip estimate. I should try to further optimize a shuttle design and see how low I can get the costs.\u003C/p\u003E\n"},{"CreatedByName":"Captain H@dock","CreatedById":139017,"CreatedDateTime":"2015-09-15T12:00:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nansuchao\u0022 data-cite=\u0022Nansuchao\u0022\u003E\u003Cdiv\u003EThe advantage of shuttles, is that they can deliver payloads and crew together\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t see how that\u0027s different from any of the others 3 design families listed by Red Iron Crown...\u003C/p\u003E\u003Cp\u003EAs long as your payload/part-that-reaches-orbit has a crew compartment, you get this no matter what the vehicle lifting it to orbit is...\u003C/p\u003E\u003Cp\u003EAnd as far as crew compartment parts go, cockpits aren\u0027t the most weight effective ones*. So that\u0027s yet another feature of the STS that is not helping with efficiency.\u003C/p\u003E\u003Cp\u003E* in order: mk3 crew (400kg per seat), mk2 crew (500kg per seat), mk1 can (860kg per seat). 1.1 might change that a bit with the mk1 crew cabin. I think all cockpits are above 1Ton per seat.\u003C/p\u003E\n"},{"CreatedByName":"The_Rocketeer","CreatedById":81727,"CreatedDateTime":"2015-09-15T12:27:29Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003EDuh. Ignore this post.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EActually, I found a better use for it.\u003C/p\u003E\u003Cp\u003ECan anyone offer an actual costed design for a disposable rocket with \u003Cstrong\u003Eidentical or better\u003C/strong\u003E mission capability/specifications to an STS replica?\u003C/p\u003E\u003Cp\u003EBy this I mean:\u003C/p\u003E\u003Cp\u003E1. Reach orbit in 2 stages or less (counting SRBs as a stage).\u003C/p\u003E\u003Cp\u003E2. Large cargo bay for deployment AND recovery of modules to/from orbit.\u003C/p\u003E\u003Cp\u003E3. Space for at least 4 kerbanauts.\u003C/p\u003E\u003Cp\u003E4. Ability to land safely with or without payload.\u003C/p\u003E\u003Cp\u003E5. While doing both of 4, ability to land consistently on the runway at KSC without sick pilot skills (gliding in isn\u0027t THAT hard).\u003C/p\u003E\u003Cp\u003E6. Reach/exceed STS max circular orbit altitude (Slashy, give us a figure for this!)\u003C/p\u003E\u003Cp\u003E7. Carry equivalent payload (dimensions and mass).\u003C/p\u003E\u003Cp\u003E8. Rendezvous and dock (with suitable cargo-bay module for docking) with a station.\u003C/p\u003E\u003Cp\u003E9. Possibly others (as suggested).\u003C/p\u003E\u003Cp\u003EIt seems to me that unless a rocket can outperform the STS at its own game, this conversation is moot. Perhaps the STS was/is the best way to do what it can do without going to the expense of developing a new vehicle for every new mission.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-15T14:45:42Z\u0022 title=\u002209/15/2015 02:45  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 15, 2015\u003C/time\u003E by The_Rocketeer\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-09-15T12:32:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The_Rocketeer\u0022 data-cite=\u0022The_Rocketeer\u0022\u003E\u003Cdiv\u003ENo, but don\u0027t forget any increase in propellant mass causes a sympathetic increase in dV requirement anyway (for a given payload).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt does not. The dV to orbit does not change for a rocket of given efficiency (similar TWR, staging, Isp, aero), no matter how large or small it is. That\u0027s how payload fractions work.\u003C/p\u003E\u003Cp\u003EA simple example: Imagine you have a rocket that can put 5t into LKO. Strap two of those rockets together and it will put 10t into LKO.\u003C/p\u003E\n"},{"CreatedByName":"The_Rocketeer","CreatedById":81727,"CreatedDateTime":"2015-09-15T12:55:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EIt does not. The dV to orbit does not change for a rocket of given efficiency (similar TWR, staging, Isp, aero), no matter how large or small it is. That\u0027s how payload fractions work.\u003Cp\u003EA simple example: Imagine you have a rocket that can put 5t into LKO. Strap two of those rockets together and it will put 10t into LKO.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think you misunderstood me - I was talking about increase in dV costs for a more massive rocket with additional fuel but the same engine thrust, not doubling everything - but in any case I realised you were discussing a scaling payload mass rather than a fixed one, hence retracted post.\u003C/p\u003E\n"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-09-15T13:47:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The_Rocketeer\u0022 data-cite=\u0022The_Rocketeer\u0022\u003E\u003Cdiv\u003EI think you misunderstood me - I was talking about increase in dV costs for a more massive rocket with additional fuel but the same engine thrust, not doubling everything - but in any case I realised you were discussing a scaling payload mass rather than a fixed one, hence retracted post.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes I noticed that fuel fraction increases with payload increase. BUT, dry mass fraction is reduced. Adding that, the price per ton goes (slighlty) down as payload mass increases. In the end mass efficiency increases with high payload. \u003C/p\u003E\u003Cp\u003EThat\u0027s what I\u0027ve noticed with my Cygnus SSTO rockets. Check my table I posted before.\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-09-15T14:36:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GoSlash27\u0022 data-cite=\u0022GoSlash27\u0022\u003E\u003Cdiv\u003EKerikBalm,\u003Cp\u003E You actually spent $27,000 to place 50t in orbit. 18t of that was payload.\u003C/p\u003E\u003Cp\u003E Had you treated the entire thing as payload and sacrificed the engine, it would\u0027ve dropped your launch cost to $1,000/ tonne.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHad I sacrificed the engine, it would have just dropped back down after the SRBs burned out.\u003C/p\u003E\u003Cp\u003EOr, perhaps you mean I don\u0027t recover the engine... now I need to add that KR-2L\u0027s cost to the cost of the launch:\u003C/p\u003E\u003Cp\u003E25\u002B27k = 52k for the launch now.\u003C/p\u003E\u003Cp\u003EI would also need to add the cost of the internal LFO tank on the orbiter that is used to orbit.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E But of course you wouldn\u0027t have needed such a big ungainly stack or a Rhino just for an 18t payload, so your final cost would\u0027ve been much lower.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYea, that\u0027s my feeling.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI think there\u0027s also some confusion about part recovery and stock KSP. You\u0027re not going to recover the boosters without mods and I don\u0027t know if you\u0027re counting the tank as recovered.\u003Cp\u003E If you\u0027re using a mod to recover parts for your shuttle, there\u0027s no reason why you can\u0027t also recover spent stages on a traditional lifter as well. \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI was not counting the external tank, nor the SRBs as being recovered.\u003C/p\u003E\u003Cp\u003EI just looked at the cost in the VAB, and then took off the external tank and its attacked SRBs, and subtracted that cost from the previous cost to get the launch cost.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E I did figure out where the discrepancy was between our designs, though: \u003Cp\u003E-Your shuttle, stack, and therefore payload are twice the mass of mine.\u003C/p\u003E\u003Cp\u003E-You\u0027re calculating the dropped bits as recovered and I\u0027m not.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m not calculating the dropped bits as recovered.\u003C/p\u003E\u003Cp\u003EI\u0027m not sure my stack is twice the mass of yours.\u003C/p\u003E\u003Cp\u003EI use twice the SRBs, yes \u002B 48 tons\u003C/p\u003E\u003Cp\u003E- but 2 orange tanks are the same as one large kerbodyne tank, and your external tank is even bigger than that\u003C/p\u003E\u003Cp\u003EBased on the picture I see:\u003C/p\u003E\u003Cp\u003E1x Kerbodyne S3-14400 Tank -\u0026gt; even mass with my external tank\u003C/p\u003E\u003Cp\u003E1x Kerbodyne S3-7200 Tank: -40 tons\u003C/p\u003E\u003Cp\u003E1x mk3-\u0026gt;2.5m adaptor: -14.3 tons\u003C/p\u003E\u003Cp\u003E1x C7 Brand Adapter - 2.5m to 1.25m: -4.5 tons\u003C/p\u003E\u003Cp\u003E3x skippers are the same mass as 1x KR-2L, so that is even.\u003C/p\u003E\u003Cp\u003EAs I look at it, my design should be ~11 tons lighter than yours.\u003C/p\u003E\u003Cp\u003EDid you get my design confused with the one from that video of a STS with liquid fuel boosters (that seemed to count the boosters as recoverable)?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-15T23:08:04Z\u0022 title=\u002209/15/2015 11:08  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 15, 2015\u003C/time\u003E by KerikBalm\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Gargamel","CreatedById":64714,"CreatedDateTime":"2015-09-15T15:30:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Johnny Wishbone\u0022 data-cite=\u0022Johnny Wishbone\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E Statistically, it was the most dangerous vehicle ever flown into space,\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis I think I disagree with. It may be true, but we cannot know as the rest of the other systems never flew as many missions as the STS did (Soyuz maybe?). Apollo had one fatal accident and one near miss, out of what, 11 manned missions (plus SkyLabs)? Mercury had 6 manned, Gemini 10 (correct me if those are wrong). Most of the programs never flew enough missions to get a good enough sample size of reliability. I\u0027m not saying your wrong, just that we can never know just how reliable those other programs really were. The STS didn\u0027t have it\u0027s first fatal incident until STS-51, it\u0027s 25th manned flight, and then STS-107 (113th manned).\u003C/p\u003E\n"}]}