{"TopicId":120864,"ForumId":32,"TopicTitle":"Kerbal Space Shuttle and rocket Economics","CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-09-14T10:33:39Z","PageNum":1,"Articles":[{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-09-14T10:33:39Z","Content":"\n\u003Cp\u003ELet me start by saying I\u0027ve been using SSTOs way too much lately, and I don\u0027t actually have a good idea what the cost per ton is for normal rockets.\u003C/p\u003E\u003Cp\u003EThe main thing that killed the space shuttle economics was the cost of refurbishing the space shuttle, and maintaining the facilities to store them, etc.\u003C/p\u003E\u003Cp\u003EIn KSP, we don\u0027t have those costs. 100% recovery, no costs at all to use something again if it lands back on the runway. So... could a space shuttle make economic sense in KSP, given the perfect reusability savings?\u003C/p\u003E\u003Cp\u003ELast night I had a crack at making a shuttle style launcher, using mk3 parts.\u003C/p\u003E\u003Cp\u003EDespite the videos I saw on youtube, it wasn\u0027t so hard, and my first attempt got to space, although I didn\u0027t try to see if I could get to orbit, as I already noticed some flaws to correct.\u003C/p\u003E\u003Cp\u003EDesign 2 got to orbit.\u003C/p\u003E\u003Cp\u003ETweaked it a bit more, and for attempt 3 I got it to space carrying a payload (~18 tons)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/m9kOsCx.png?1\u0022 alt=\u0022m9kOsCx.png?1\u0022\u003E\u003C/p\u003E\u003Cp\u003E*Note, I didn\u0027t actually put much development into the orbiter. It has no landing gear, and I haven\u0027t checked if the wings are positioned in a way that will actually make it stable in horizontal gliding flight). This was just a test of the asymetric launch system.\u003C/p\u003E\u003Cp\u003EHowever, when I calculated the cost of getting this payload to orbit... It came out to 26,898 funds (plus whatever the onboard fuel in the orbiter cost)\u003C/p\u003E\u003Cp\u003EThat is about 1,500 funds per ton to orbit... and I still have to deorbit and land the orbiter like a SSTO spaceplane.\u003C/p\u003E\u003Cp\u003EIn comparison, my SSTO that carries cargo in a mk3 bay costs ~100 funds per ton to orbit\u003C/p\u003E\u003Cp\u003EMy SSTO that carries cargo way too big to fit in a mk3 bay costs between 175 - 250 funds per ton to orbit.\u003C/p\u003E\u003Cp\u003EThis semi-reusable non-airbreathing shuttle is roughly 6 to 15 times more expensive than my airbreathing SSTO spaceplanes.\u003C/p\u003E\u003Cp\u003EI was wondering if my costs per ton for this shuttle are typical for shuttle designs?\u003C/p\u003E\u003Cp\u003EI never did look into non-airbreathing SSTOs, what do they typically cost per ton?\u003C/p\u003E\u003Cp\u003EI haven\u0027t designed staging pure rocket lifters with cost in mind for a while now (I\u0027ll throw one together in sandbox, but ignoring cost)\u003C/p\u003E\u003Cp\u003EI will admit... it does look cool in orbit though... it looks much more elecant than my mk3 spaceplanes with engine nacelles, intakes, added length due to carrying much more onboard fuel, more control surfaces because it needs to be able to fly horizontally full and empty... etc.\u003C/p\u003E\u003Cp\u003EFor reference, my shuttle\u0027s main tank was 2x orange tanks capped at both ends with nosecones, and then two pairs of the kickback SRBs (4 total, not 2, we need more powerful SRBs). It has 4x monoprop engines, and a 2.5 monoprop tank inside the main bay. I\u0027d be better off using LFO tanks and the main engine at low thrust... but the monoprop as an OMS supply seems cooler. Even if the real SS OMS was hypergolic bipropellent.\u003C/p\u003E\u003Cp\u003EI doubt SRB recovery would improve the economics of it much.\u003C/p\u003E\u003Cp\u003EI\u0027m tempted to use this design in my career save for fun, but the economics of it seem so poor.\u003C/p\u003E\u003Cp\u003EThe ascent is faster than with a SSTO (somewhat due in to a better framerate but its not fair to compare a launcher for 20 tons vs a launcher for \u0026gt;120 ton payloads), so maybe a working shuttle would be a good compromise between time and economics.\u003C/p\u003E\u003Cp\u003EHowever, I doubt it will actually end up being any cheaper.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-14T12:32:37Z\u0022 title=\u002209/14/2015 12:32  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 14, 2015\u003C/time\u003E by KerikBalm\u003C/strong\u003E\n\u003Cbr\u003Espelling, sentence fragments\n\u003C/span\u003E\n"},{"CreatedByName":"The_Rocketeer","CreatedById":81727,"CreatedDateTime":"2015-09-14T10:50:58Z","Content":"\n\u003Cp\u003EIt almost certainly won\u0027t. I\u0027ve learned since playing KSP what an economic white elephant the real STS was.\u003C/p\u003E\u003Cp\u003EIf anything I would guess that your shuttle is considerably MORE economical than RL, since it seems to me that you must have used a Buran-style under-tank rocket which the NASA shuttles didn\u0027t (if not then I\u0027m slightly awed by your success - I\u0027ve spent many hours refining my designs to get them into orbit). The issues of CoM shift were resolved with highly gimballed engines that splayed out in different directions, such that the assembly rose on a multi-legged \u0027stool\u0027 of thrust, rather than a single pedestal (as rockets normally do). This results in huge fuel wastage just for extra stability.\u003C/p\u003E\n"},{"CreatedByName":"Nansuchao","CreatedById":135151,"CreatedDateTime":"2015-09-14T10:55:08Z","Content":"\n\u003Cp\u003EIn stock KSP a Shuttle vehicle is interesting as a challenge, not good for much more. If you try in RSS, you\u0027ll find that the only safe way to reach orbit with a plane is the shuttle way.\u003C/p\u003E\n"},{"CreatedByName":"More Boosters","CreatedById":147303,"CreatedDateTime":"2015-09-14T10:59:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerikBalm\u0022 data-cite=\u0022KerikBalm\u0022\u003E\u003Cdiv\u003ELet me start by saying I\u0027ve been using SSTOs way too much lately, and I don\u0027t actually have a good idea what the cost per ton is for normal rockets.\u003Cp\u003EThe main thing that killed the space shuttle economics was the cost of refurbishing the space shuttle, and maintaining the facilities to store them, etc.\u003C/p\u003E\u003Cp\u003EIn KSP, we don\u0027t have those costs. 100% recovery, no costs at all to use something again if it lands back on the runway. So... could a space shuttle make economic sense in KSP, given the perfect reusability savings?\u003C/p\u003E\u003Cp\u003ELast night I had a crack at making a shuttle style launcher, using mk3 parts.\u003C/p\u003E\u003Cp\u003EDespite the videos I saw on youtube, it wasn\u0027t so hard, and my first attempt got to space, although I didn\u0027t try to see if I could get to orbit, as I already noticed some flaws to correct.\u003C/p\u003E\u003Cp\u003EDesign 2 got to orbit.\u003C/p\u003E\u003Cp\u003ETweaked it a bit more, and for attempt 3 I got it to space carrying a payload (~18 tons)\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/m9kOsCx.png?1\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/m9kOsCx.png?1\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E*Note, I didn\u0027t actually put much development into the orbiter. It has no landing gear, and I haven\u0027t checked if the wings are positioned in a way that will actually make it stable in horizontal gliding flight). This was just a test of the asymetric launch system.\u003C/p\u003E\u003Cp\u003EHowever, when I calculated the cost of getting this payload to orbit... It came out to 26,898 funds (plus whatever the onpoard fuel in the orbiter cost)\u003C/p\u003E\u003Cp\u003EThat is about 1,500 funds per ton to orbit... and I still have to deorbit and land the orbiter like a SSTO spaceplane.\u003C/p\u003E\u003Cp\u003EIn comparison, my SSTO that carries cargo in a mk3 bay costs ~100 funds per ton to orbit\u003C/p\u003E\u003Cp\u003EMy SSTO that carries cargo way too big to fit in a mk3 bay costs between 175 - 250 funds per ton to orbit.\u003C/p\u003E\u003Cp\u003EThis semi-reusable non-airbreathing shuttle is roughly 6 to 15 times more expensive than my airbreathing SSTO spaceplanes.\u003C/p\u003E\u003Cp\u003EI was wondering if my costs per ton for this shuttle are typical for shuttle designs?\u003C/p\u003E\u003Cp\u003EI never did look into non-airbreathing SSTOs, what do they typically cost per ton?\u003C/p\u003E\u003Cp\u003EI haven\u0027t designed staging pure rocket lifters with cost in mind for a while now (I\u0027ll throw one together in sandbox, but I haven\u0027t tried to build a vertical launc\u003C/p\u003E\u003Cp\u003EI will admit... it does look cool in orbit though... it looks much more elecant than my mk3 spaceplanes with engine nacelles, intakes, added length due to carrying much more onboard fuel, more control surfaces because it needs to be able to fly horizontally full and empty... etc.\u003C/p\u003E\u003Cp\u003EFor reference, my shuttle\u0027s main tank was 2x orange tanks capped at both ends with nosecones, and then two pairs of the kickback SRBs (4 total, not 2, we need more powerful SRBs). It has 4x monoprop engines, and a 2.5 monoprop tank inside the main bay. I\u0027d be better off using LFO tanks and the main engine at low thrust... but the monoprop as an OMS supply seems cooler. Even if the real SS OMS was hypergolic bipropellent.\u003C/p\u003E\u003Cp\u003EI doubt SRB recovery would improve the economics of it much.\u003C/p\u003E\u003Cp\u003EI\u0027m tempted to use this design in my career save for fun, but the economics of it seem so poor.\u003C/p\u003E\u003Cp\u003EThe ascent is faster than with a SSTO (somewhat due in to a better framerate but its not fair to compare a launcher for 20 tons vs a launcher for \u0026gt;120 ton payloads), so maybe a working shuttle would be a good compromise between time and economics.\u003C/p\u003E\u003Cp\u003EHowever, I doubt it will actually end up being any cheaper.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHey, I\u0027ve been thinking about the exact same thing but I haven\u0027t been able to test anything since I currently don\u0027t have my computer with me. I think the main problem here is the underpowered SRBs; I believe you can improve the situation by using the SRBs from the SpaceY parts pack.\u003C/p\u003E\u003Cp\u003EA few notes:\u003C/p\u003E\u003Cp\u003E- Rhino seems a bit overpowered for this case, it may have good ISP but it also has huge weight at 9 tonnes so you may want to try weaker, lighter LFO engines with stronger SRBs (you\u0027ll have to consult a mod or rightfully buff the Kickbacks for this)\u003C/p\u003E\u003Cp\u003E- You should try to recover the SRBs.\u003C/p\u003E\u003Cp\u003E- 3.75m tanks may be more sensible as two oranges have more drag, at least they look like they do.\u003C/p\u003E\u003Cp\u003E- You don\u0027t have to adhere strictly to the real life design, it wasn\u0027t very practical after all. You could for example try R.A.P.I.E.Rs (like 3-4 of them) at the orbiter\u0027s main body to make landing easier, or use a mod 3.75m version of it.\u003C/p\u003E\u003Cp\u003EBut of course I never got the chance to try any of this and I am hardly an SSTO expert so take these for what they are worth.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The_Rocketeer\u0022 data-cite=\u0022The_Rocketeer\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003EIt almost certainly won\u0027t. I\u0027ve learned since playing KSP what an economic white elephant the real STS was.\u003C/span\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003EIf anything I would guess that your shuttle is considerably MORE economical than RL, since it seems to me that you must have used a Buran-style under-tank rocket which the NASA shuttles didn\u0027t (if not then I\u0027m slightly awed by your success - I\u0027ve spent many hours refining my designs to get them into orbit). The issues of CoM shift were resolved with highly gimballed engines that splayed out in different directions, such that the assembly rose on a multi-legged \u0027stool\u0027 of thrust, rather than a single pedestal (as rockets normally do). This results in huge fuel wastage just for extra stability.\u003C/span\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003EWell he is using a Rhino and he clearly kept the engine on the orbiter, so I\u0027d say the ridiculous thrust that engine has for space standards (and this payload really, you\u0027re lifting how many tons to orbit now?) reduces your losses to stability allowing you to fix the center of thrust with a far smaller engine inclination.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-14T11:01:24Z\u0022 title=\u002209/14/2015 11:01  AM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 14, 2015\u003C/time\u003E by More Boosters\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Johnny Wishbone","CreatedById":118096,"CreatedDateTime":"2015-09-14T11:25:22Z","Content":"\n\u003Cp\u003EThe space shuttle was sold to Congress and the American taxpayers as a \u0022low cost, reusable\u0022 vehicle to space. However, it was designed to be a money pit (even before the Air Force got their dirty fingers into it and messed up the design even more). NASA administrators saw what happened to funding for Apollo once its goals were achieved and knew if they wanted continuous funding for manned space programs, they would need a vehicle that would require continuous funding while appearing to be keeping costs down because so much of it was \u0022reusable\u0022. You just had to ignore the fact that pretty much every part of the orbiter other than the crew cabins and cockpit needed to be ripped apart and rebuilt after every mission.\u003C/p\u003E\u003Cp\u003EI\u0027ve never understood the love for the space shuttle, in real life, or by people playing this game. (I\u0027m not judging you, if you are someone that loves it; I just don\u0027t get it.) Statistically, it was the most dangerous vehicle ever flown into space, it was the most expensive ever flown into space, and it was an overall piece of junk that could barely meet its most basic mission requirements (and had far less capability than the Saturn V rocket it replaced). Personally, I believe the space shuttle set the American space program back by at least 10 years, as that is how long its going to take for us to re-design the rockets we already mastered (and lost) and get us back into manned spaceflight.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-14T11:49:24Z\u0022 title=\u002209/14/2015 11:49  AM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 14, 2015\u003C/time\u003E by Red Iron Crown\u003C/strong\u003E\n\u003Cbr\u003EEasy with the language.\n\u003C/span\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-09-14T11:32:25Z","Content":"\n\u003Cp\u003EKerikBalm,\u003C/p\u003E\u003Cp\u003E Heck, my shuttle only lifts about 7 tonnes. I\u0027m curious to see what your launch stack looks like.\u003C/p\u003E\u003Cp\u003EHere\u0027s mine:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i52.photobucket.com/albums/g13/GoSlash27/KSP/Shuttle%20Kourageous/Kourageous3_zps2y0ogul9.jpg\u0022 alt=\u0022Kourageous3_zps2y0ogul9.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i52.photobucket.com/albums/g13/GoSlash27/KSP/Shuttle%20Kourageous/Kourageous1_zpsiovlv8m6.jpg\u0022 alt=\u0022Kourageous1_zpsiovlv8m6.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E Yeah, the economics are just about as ugly as you can get.\u003C/p\u003E\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"},{"CreatedByName":"More Boosters","CreatedById":147303,"CreatedDateTime":"2015-09-14T11:46:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GoSlash27\u0022 data-cite=\u0022GoSlash27\u0022\u003E\u003Cdiv\u003EKerikBalm,\u003Cp\u003E Heck, my shuttle only lifts about 7 tonnes. I\u0027m curious to see what your launch stack looks like.\u003C/p\u003E\u003Cp\u003EHere\u0027s mine:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i52.photobucket.com/albums/g13/GoSlash27/KSP/Shuttle%20Kourageous/Kourageous3_zps2y0ogul9.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i52.photobucket.com/albums/g13/GoSlash27/KSP/Shuttle%20Kourageous/Kourageous3_zps2y0ogul9.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i52.photobucket.com/albums/g13/GoSlash27/KSP/Shuttle%20Kourageous/Kourageous1_zpsiovlv8m6.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i52.photobucket.com/albums/g13/GoSlash27/KSP/Shuttle%20Kourageous/Kourageous1_zpsiovlv8m6.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E Yeah, the economics are just about as ugly as you can get.\u003C/p\u003E\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETechnically you don\u0027t even need to incline your engines if you balance the center of thrust by adding liquid fuel boosters connected under the external tank. Once the external tank dries up, dump it and the balancing LFBs. Maybe that would work? Anyway I\u0027ve seen some shuttles that lift oranges and more to orbit on Youtube. Once again I haven\u0027t had the chance to try this so take this for what its worth, but maybe your shuttle building isn\u0027t as refined as your SSTO building?\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-09-14T11:47:04Z","Content":"\n\u003Cp\u003E\u0022 Rhino seems a bit overpowered for this case, it may have good ISP but it also has huge weight at 9 tonnes so you may want to try weaker, lighter LFO engines\u0022\u003C/p\u003E\u003Cp\u003EWell, its Isp at launch is pretty bad, not as terrible as it used to be. Anyway, When I launched the orbited without a payload, I throttled it to 50%, otherwise it produced too much thrust.\u003C/p\u003E\u003Cp\u003EWith a payload, I could throttle it to 100% and with maximum pitch without resorting to the vernors, it was working and allowing me to pitch over into a gravity turn.\u003C/p\u003E\u003Cp\u003EPart of it is that I just didn\u0027t want to bother with a engine cluster, and part of it was looks.\u003C/p\u003E\u003Cp\u003EI could also try using a mk3 to 2.5m adapter and putting a mainsail on there (I a skipper would not be sufficient) I don\u0027t know if saving 3 tons and some better atmospheric Isp is worth the loss of ~30 vacuum Isp.\u003C/p\u003E\u003Cp\u003EThe other thing is that the Rhino has one of the largest gimbal ranges in the game -\u0026gt; 4 degrees.\u003C/p\u003E\u003Cp\u003ERadial engines get 8.0 degrees of gimbal.\u003C/p\u003E\u003Cp\u003EThe mainsail, skipper, and mammoth get 2.0\u003C/p\u003E\u003Cp\u003EThe Rapier, LV-T45, and 48-7s get 3.0\u003C/p\u003E\u003Cp\u003EThe LFB gets 1.5\u003C/p\u003E\u003Cp\u003EThe KR-2L gets 4.0 degrees of gimbal. A high gimbal is what you want for a design like this.\u003C/p\u003E\u003Cp\u003EI supposed I could use a pair of Thuds..\u003C/p\u003E\u003Cp\u003EA Poodle gets 4.5 degrees of gimbal, but is totally unsuited for the main engine.\u003C/p\u003E\u003Cp\u003ELV-909s get 4 degrees of gimbal as well but are just as bad as the poodle for this use.\u003C/p\u003E\u003Cp\u003EI\u0027m going to stick with the KR-2L for now due to high gimbal and vacuum Isp.\u003C/p\u003E\u003Cp\u003E\u0022with stronger SRBs (you\u0027ll have to consult a mod or rightfully buff the Kickbacks for this)\u0022\u003C/p\u003E\u003Cp\u003EWell, I could switch from pairs of SRBs to trios of SRBs... but that will then neccesitate a stronger main engine to balance the added thrust on that sie of the CoM (with a KR-2L, I could just go from 50% thrust ot 75% thrust). This will be even worse if I have a heavier payload strapped to the side of the tank\u002BSRB combo.\u003C/p\u003E\u003Cp\u003E20 tons is already quite bad. I don\u0027t want to have to restrict payload mass even more to maintain balance.\u003C/p\u003E\u003Cp\u003EThe LFB is what gives me control because I can throttle that one, so I\u0027d like to have excess thrust so I can have it at lower throttle on launch, and throttle it up as the SRB fuel is consumed and the main tank empties (which will shift the CoM, and make it want to pitch over)\u003C/p\u003E\u003Cp\u003E\u00223.75m tanks may be more sensible as two oranges have more drag, at least they look like they do.\u0022\u003C/p\u003E\u003Cp\u003EIts inline oranges, not side by side. I\u0027m pretty sure they are lower drag. a 2.5m diameter cross section rather than 3.75m.\u003C/p\u003E\u003Cp\u003EPlus I\u0027d then need to add the 3.75-\u0026gt; 2.5m adapter before sticing nose cones on.\u003C/p\u003E\u003Cp\u003E\u0022You should try to recover the SRBs.\u0022\u003C/p\u003E\u003Cp\u003EI\u0027m trying to make it all stock, that would work with someone else with an all stock install. I\u0027ve made recoverable SRBs before, they consist of fleas paired with LES\u0027s, and have extremely short burn times so that they land before leaving physics range.\u003C/p\u003E\u003Cp\u003EThis is absolutely not an option with fully fueled kickbacks due to the game engine (although you could stock-ish do text file editing and save file duplication to allow you to recover the SRBs, by pasting the SRB part data back into the game after you recover your orbiter/get it to orbit, and then followingthe SRBs down).\u003C/p\u003E\u003Cp\u003EAs such, I don\u0027t plan on attaching chutes, and designing the decoupling system to stop them from being destroyed during the decouple (its happened every time so far, but its never hit my orbiter\u002B main tank, so I don\u0027t care for now)\u003C/p\u003E\u003Cp\u003E\u0022You don\u0027t have to adhere strictly to the real life design, it wasn\u0027t very practical after all. You could for example try R.A.P.I.E.Rs (like 3-4 of them) at the orbiter\u0027s main body to make landing easier,\u0022\u003C/p\u003E\u003Cp\u003ELanding is not the problem. I often land my SSTOs without any use of engines after the deorbit burn.\u003C/p\u003E\u003Cp\u003EThe RL design was not practical because of the refurbishment costs.. which aren\u0027t there in KSP.\u003C/p\u003E\u003Cp\u003EI\u0027ve already made Vertical Launch airbreathing spaceplanes... granted they mostly fly like a horizontal launch space plane, and just have a very short burn of SRBs to launch them vertically, pitch over, and enter horizontal flight by the end of the runway (in which case the SRBs are recovered for 100%).\u003C/p\u003E\u003Cp\u003EIt is tempting to put a pair of rapiers or turboramjets on this to improve payload fraction though.\u003C/p\u003E\u003Cp\u003EAirbreathing engines in KSP are so OPd, that one might as well just make SSTOs if you use them.\u003C/p\u003E\u003Cp\u003EI\u0027ve already taken vertical launch SSTO rockets, and stuck on some turboramjets to improve their payload capacity and enable softer parachute landings.\u003C/p\u003E\u003Cp\u003EI am trying to adhere to:\u003C/p\u003E\u003Cp\u003E- No airbreathing engines (at least not used to get to orbit)\u003C/p\u003E\u003Cp\u003E- Not single stage, but most of the expensive parts are recoverable\u003C/p\u003E\u003Cp\u003E- Does make precision landings back at KSC (ie, has significant aerodynamic surfaces... I don\u0027t want to have to quickload a dozen times to get my de-orbit burn just right)\u003C/p\u003E\u003Cp\u003E- Asymetry for the fun - In KSP we could just make a design where the external tank is directly above/below the orbiter, and the SRBs strap on to the sides of the orbiter... no need to worry about a thrust imbalance\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-14T11:51:34Z\u0022 title=\u002209/14/2015 11:51  AM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 14, 2015\u003C/time\u003E by KerikBalm\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-09-14T11:48:44Z","Content":"\n\u003Cp\u003EThe fuel use gets a bit better if you rearrange things to avoid the thrust offset issues:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/61004449/KSP/1.0.4/screenshot838.png\u0022 alt=\u0022screenshot838.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ERecovers the pricey rocket engine, all it discards are the SRBs and fuel tanks. Still, it is not the most economically viable, for that I would order them so:\u003C/p\u003E\u003Cp\u003E1. Airbreathing recoverable SSTO (fuel cost only)\u003C/p\u003E\u003Cp\u003E2. Pure rocket SSTO (fuel cost only, but higher than airbreathing)\u003C/p\u003E\u003Cp\u003E3. Shuttle style (fuel cost \u002B tanks and SRBs)\u003C/p\u003E\u003Cp\u003E4. Rocket with disposable stages (fuel cost \u002B tanks \u002B engines, etc)\u003C/p\u003E\n"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-09-14T12:00:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EThe fuel use gets a bit better if you rearrange things to avoid the thrust offset issues:\u003Cp\u003E\u003Ca href=\u0022https://dl.dropboxusercontent.com/u/61004449/KSP/1.0.4/screenshot838.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://dl.dropboxusercontent.com/u/61004449/KSP/1.0.4/screenshot838.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ERecovers the pricey rocket engine, all it discards are the SRBs and fuel tanks. Still, it is not the most economically viable, for that I would order them so:\u003C/p\u003E\u003Cp\u003E1. Airbreathing recoverable SSTO (fuel cost only)\u003C/p\u003E\u003Cp\u003E2. Pure rocket SSTO (fuel cost only, but higher than airbreathing)\u003C/p\u003E\u003Cp\u003E3. Shuttle style (fuel cost \u002B tanks and SRBs)\u003C/p\u003E\u003Cp\u003E4. Rocket with disposable stages (fuel cost \u002B tanks \u002B engines, etc)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFor \u0022Pure rocket SSTO\u0022, you also have the recovery price which is usually 2 to 5% because you mostly never land on the runway. But true, most of the cost comes from the fuel.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-14T12:02:29Z\u0022 title=\u002209/14/2015 12:02  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 14, 2015\u003C/time\u003E by Warzouz\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-09-14T12:05:41Z","Content":"\n\u003Cp\u003EA pure rocket plane-style SSTO is just as easy to land on the runway as an airbreathing one, and an airbreathing VTOL SSTO is just as difficult to land precisely as a pure rocket one. It\u0027s not the propulsion that makes the difference for recovery, but the landing method.\u003C/p\u003E\n"},{"CreatedByName":"More Boosters","CreatedById":147303,"CreatedDateTime":"2015-09-14T12:10:26Z","Content":"\n\u003Cp\u003EI think it\u0027s worth considering that the real life space shuttle used cryogenic engines with greater efficiency so it may also be the engines in KSP not doing it justice. \u003C/p\u003E\u003Cp\u003EThat, or STS-inspired designs need further work to be adapted properly to KSP.\u003C/p\u003E\u003Cp\u003EAs soon as I get to play KSP I have a few ideas from mods like the cryogenic engines from the similarly named mod and a cluster of LANTERNs from Atomic Age. Maybe others would like to try in my place?\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-09-14T12:29:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022More Boosters\u0022 data-cite=\u0022More Boosters\u0022\u003E\u003Cdiv\u003ETechnically you don\u0027t even need to incline your engines if you balance the center of thrust by adding liquid fuel boosters connected under the external tank. Once the external tank dries up, dump it and the balancing LFBs. Maybe that would work? Anyway I\u0027ve seen some shuttles that lift oranges and more to orbit on Youtube. Once again I haven\u0027t had the chance to try this so take this for what its worth, but maybe your shuttle building isn\u0027t as refined as your SSTO building?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESlash-I can\u0027t take pictures right now (not home yet, wouldn\u0027t be appropriate to start up KSP) - but I could upload the craft file:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/8pznz6wu0jxm6g6/Space%20Shuttle.craft?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/8pznz6wu0jxm6g6/Space%20Shuttle.craft?dl=0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EMore Boosters-\u0026gt; That is sort of \u0022cheating\u0022. The challenge is to have all liquid fuel engines carried on the orbiter and recovered. You are proposing more of a Buran style launch, which is easier and less recoverable (it may be better IRL, but this is KSP)\u003C/p\u003E\u003Cp\u003EJohnny Wishbone-\u0026gt; I think you are a bit too cynical. I doubt it was designed to be a money pit, at least not a money pit per launch.\u003C/p\u003E\u003Cp\u003ESure, the aerospace contracters would like regular business - but they\u0027d get that if there were low refurbishment costs and 50 launches per year, or high refurbishment costs and 2 launches per year.\u003C/p\u003E\u003Cp\u003EIn the end, yes, it turned out terrible. Too many compromises. The original proposals before the airforce got involved (which was neccessary to obtain funding, but in the end killed it) with small wings, a smaller payload bay, and much less cross range capability look much more appealing.\u003C/p\u003E\u003Cp\u003ENASA was dreaming up a huge moneypit for aerospace contractors with an entire STS, not just the shuttle. I highly doubt the engineers working on the project intentionally made bad proposals, or that NASA picked the one that would prevent the rest of the STS from becoming a reality.\u003C/p\u003E\u003Cp\u003EHindsight is 20/20... \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Hanlons_razor\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Hanlon\u0027s_razor\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u0022Never attribute to malice that which is adequately explained by stupidity.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003ERed- Hehe, I see you posted a picture of exactly what I was describing as I was editing my post.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EA pure rocket plane-style SSTO is just as easy to land on the runway as an airbreathing one, and an airbreathing VTOL SSTO is just as difficult to land precisely as a pure rocket one. It\u0027s not the propulsion that makes the difference for recovery, but the landing method.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think we have another case of people thinking that airbreathing implies spaceplane, and pure rocket implies not a space plane.\u003C/p\u003E\u003Cp\u003EBut don\u0027t make a mistake of your own... althought you don\u0027t explictely say it, it almost seems implied... \u003C/p\u003E\u003Cp\u003EVTOLs can be quite easy to land precisely.\u003C/p\u003E\u003Cp\u003EIf it is a tail sitter that lands under parachutes, and launches vertically like a rocket, and has no wings, it can be quite hard to land precisely.\u003C/p\u003E\u003Cp\u003EOr it could be something with vertical lift jets, that otherwise flies horizontaly.\u003C/p\u003E\u003Cp\u003EOr it could be like what I use on bodies that aren\u0027t kerbin and lack a runway\u002Bits associated extremely flat grassy surrounding:\u003C/p\u003E\u003Cp\u003ECapable of stable horizontal aerodynamic flight -\u0026gt; fly right over the target areaat low altitude, extend landing legs and pitch full up, pop chutes and apply a puff of thrust if needed to soften the landing.\u003C/p\u003E\u003Cp\u003ETo me, its not the landing method, its the \u0022flight method\u0022\u003C/p\u003E\u003Cp\u003EDoes it proceed along a ballistic arc, or do you have aerodynamic surfaces to allow you to alter your trajectory, to refine it... to make \u0022mid course corrections\u0022.\u003C/p\u003E\u003Cp\u003EThe more you can alter your trajectory, the easier it is to land where you want.\u003C/p\u003E\n"},{"CreatedByName":"More Boosters","CreatedById":147303,"CreatedDateTime":"2015-09-14T12:44:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerikBalm\u0022 data-cite=\u0022KerikBalm\u0022\u003E\u003Cdiv\u003EMore Boosters-\u0026gt; That is sort of \u0022cheating\u0022. The challenge is to have all liquid fuel engines carried on the orbiter and recovered\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn that case, perhaps you could have high efficiency but still small engines mounted horizontally? Maybe you\u0027ll be allowed to keep your main engine without inclination then?\u003C/p\u003E\u003Cp\u003ESome sparks, perhaps?\u003C/p\u003E\n"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-09-14T13:03:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerikBalm\u0022 data-cite=\u0022KerikBalm\u0022\u003E\u003Cdiv\u003E... If it is a tail sitter that lands under parachutes, and launches vertically like a rocket, and has no wings, it can be quite hard to land precisely.\u003Cp\u003E...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut even though, the recovery cost variation is very slim.\u003C/p\u003E\u003Cp\u003E- Land on runway or launchpad = 100%\u003C/p\u003E\u003Cp\u003E- Land anywhere on KSC ground = 98% \u003C/p\u003E\u003Cp\u003E- Land at 50km from KSC = 97%\u003C/p\u003E\u003Cp\u003E- Land at 100km from KSC = 95%\u003C/p\u003E\u003Cp\u003E- Land on the other half of Kerbin = 20%\u003C/p\u003E\u003Cp\u003EIt\u0027s very easy to land at less than 50km from KSC with a non directive object using only airbrakes. There is not much difference with perfect runway landing. The only thing you want to know is where to deorbit and burn dV.\u003C/p\u003E\u003Cp\u003EIf the recovery costs where much higher, SSTO rocket might not be as interesting.\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-09-14T13:37:11Z","Content":"\n\u003Cp\u003EIf my craft costs 100,000 funds, and the fuel cost is 5,000 -\u0026gt; then a 95% recovery results in it costing twice as much to launch a payload.\u003C/p\u003E\u003Cp\u003EEven a 98% recovery would represent a 40% increase in costs.\u003C/p\u003E\n"},{"CreatedByName":"Frozen_Heart","CreatedById":118627,"CreatedDateTime":"2015-09-14T13:46:52Z","Content":"\n\u003Cp\u003EWith my shuttle I found that it cost a lot more to launch than conventional rockets, but is a tiny bit cheaper if you manage to land the orbiter again.\u003C/p\u003E\u003Cp\u003ESSTOs blow everything else out of the water costwise though. You only have to pay for the payload and fuel. I\u0027m awful at making those though. :/\u003C/p\u003E\n"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-09-14T14:08:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerikBalm\u0022 data-cite=\u0022KerikBalm\u0022\u003E\u003Cdiv\u003EIf my craft costs 100,000 funds, and the fuel cost is 5,000 -\u0026gt; then a 95% recovery results in it costing twice as much to launch a payload.\u003Cp\u003EEven a 98% recovery would represent a 40% increase in costs.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELet\u0027s take some more real data : 15% to 20% fuel cost is more realistic for a rocket SSTO (space plane don\u0027t miss the runway).\u003C/p\u003E\u003Cp\u003EFor example the 150T launcher\u003C/p\u003E\u003Cp\u003E- Wet cost = 260k\u003C/p\u003E\u003Cp\u003E- Dry cost = 210k\u003C/p\u003E\u003Cp\u003E- 100% recover = 50k (cost, not recovered fund)\u003C/p\u003E\u003Cp\u003E- 98% = 55k\u003C/p\u003E\u003Cp\u003E- 97% = 58k\u003C/p\u003E\u003Cp\u003E-\u0026gt; 15% variation (as of 97% easy average / full recovery)\u003C/p\u003E\u003Cp\u003EIf you use SSTO spaceplane, sure you want to land on the strip. That is quite easy with little practice\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://n.lejeune.free.fr/ksp/cygnus_g.png\u0022 alt=\u0022cygnus_g.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"tseitsei","CreatedById":139058,"CreatedDateTime":"2015-09-14T14:27:50Z","Content":"\n\u003Cp\u003ESpaceplanes are most cost efficient since it only costs the price of fuel used to send something to orbit and payload fractions can also be very good in proper designs (30% is quite easy to achieve on smaller scale planes and \u0026gt;20%-30% is quite simple with bigger designs as well)\u003C/p\u003E\u003Cp\u003EOn rockets you lose some money even if you use parachutes to recover early stages because you can\u0027t land them neatly on the runway...\u003C/p\u003E\n"},{"CreatedByName":"More Boosters","CreatedById":147303,"CreatedDateTime":"2015-09-14T16:46:54Z","Content":"\n\u003Cp\u003EJust saw this comment on youtube:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022font-family:Roboto;\u0022\u003E\u003Cspan style=\u0022color:#000000;\u0022\u003EWhy dont you just stick 2 shuttles on the fuel tank: problem solved\u003C/span\u003E\u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:Roboto;\u0022\u003E\u003Cspan style=\u0022color:#000000;\u0022\u003EHow would this work out? Can you even put two vehicles into orbit at once? I mean the human factor would prevent it, no?\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:Roboto;\u0022\u003E\u003Cspan style=\u0022color:#000000;\u0022\u003EEdit:\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:Roboto;\u0022\u003E\u003Cspan style=\u0022color:#000000;\u0022\u003EAlso found this:\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/Qc3mfzdq8Ig?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003ESure it uses LFBs and not SRBs but it does the job.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-14T16:55:19Z\u0022 title=\u002209/14/2015 04:55  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 14, 2015\u003C/time\u003E by More Boosters\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-09-14T17:03:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Warzouz\u0022 data-cite=\u0022Warzouz\u0022\u003E\u003Cdiv\u003ELet\u0027s take some more real data : 15% to 20% fuel cost is more realistic for a rocket SSTO (space plane don\u0027t miss the runway).\u003Cp\u003EFor example the 150T launcher\u003C/p\u003E\u003Cp\u003E- Wet cost = 260k\u003C/p\u003E\u003Cp\u003E- Dry cost = 210k\u003C/p\u003E\u003Cp\u003E- 100% recover = 50k (cost, not recovered fund)\u003C/p\u003E\u003Cp\u003E- 98% = 55k\u003C/p\u003E\u003Cp\u003E- 97% = 58k\u003C/p\u003E\u003Cp\u003E-\u0026gt; 15% variation (as of 97% easy average / full recovery)\u003C/p\u003E\u003Cp\u003EIf you use SSTO spaceplane, sure you want to land on the strip. That is quite easy with little practice\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://n.lejeune.free.fr/ksp/cygnus_g.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://n.lejeune.free.fr/ksp/cygnus_g.png\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELets look at that first rocket.\u003C/p\u003E\u003Cp\u003EA 100% recover would be 414 funds per ton.\u003C/p\u003E\u003Cp\u003EA 95% recover would be 539 fund per ton -\u0026gt;30% more per ton.\u003C/p\u003E\u003Cp\u003ELook at the last rocket.\u003C/p\u003E\u003Cp\u003EA 100% recover would be 329 funds per ton.\u003C/p\u003E\u003Cp\u003EA 95% recover would be 449 funds per ton.\u003C/p\u003E\u003Cp\u003EA 36.5% increase in cost per ton.\u003C/p\u003E\u003Cp\u003EGetting a 100% recovery does significantly effect the cost per ton, even for non-airbreathers which have higher fuel costs.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-14T17:05:59Z\u0022 title=\u002209/14/2015 05:05  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 14, 2015\u003C/time\u003E by KerikBalm\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"More Boosters","CreatedById":147303,"CreatedDateTime":"2015-09-14T17:07:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerikBalm\u0022 data-cite=\u0022KerikBalm\u0022\u003E\u003Cdiv\u003ELets look at that first rocket.\u003Cp\u003EA 100% recover would be 414 funds per ton.\u003C/p\u003E\u003Cp\u003EA 95% recover would be 539 fund per ton -\u0026gt;30% more per ton.\u003C/p\u003E\u003Cp\u003ELook at the last rocket.\u003C/p\u003E\u003Cp\u003EA 100% recover would be 329 funds per ton.\u003C/p\u003E\u003Cp\u003EA 95% recover would be 449 funds per ton.\u003C/p\u003E\u003Cp\u003EA 36.5% increase in cost per ton.\u003C/p\u003E\u003Cp\u003EGetting a 100% recovery does significantly effect the cost per ton, even for non-airbreathers which have higher fuel costs.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027d like your comment on the shuttle I posted as it seems to deliver 42t to a 200 x 200 orbit just fine, recovering all but the ET. Though I\u0027m not sure that SSME stand in is a stock engine.\u003C/p\u003E\n"},{"CreatedByName":"viktor19","CreatedById":111560,"CreatedDateTime":"2015-09-14T19:53:21Z","Content":"\n\u003Cp\u003EWhen you compare big dumb boosters with reusable systems it ironically boils down to what happens when they are not flying. At first it seems like: \u0022Shuttle can carry less payload than other rockets, but it\u0027s reusable - you can use it over and over.\u0022 That\u0027s true, but what about the boats NASA made specifically for fishing boosters in the Atlantic? The story doesn\u0027t stop there, boosters are checked and new fuel has to be loaded. What about the SSMEs that have to be removed from the Shuttle? What about those 30,000 tiles?\u003C/p\u003E\u003Cp\u003E Personally, I think that Elon Musk\u0027s middle way is just what humanity needs...\u003C/p\u003E\u003Cp\u003ENow back to KSP. We don\u0027t have NASA\u0027s problems like someone already mentioned. Still, Shuttle replica is a nice challenge for KSP, period. You have to balance thrust, mass...for peanuts in savings. Go small, make a spaceplane! Go big, make a first stage, add a probe core, some batteries, airbrakes (and optionally, parachutes). Land where you want, when you want.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EThe fuel use gets a bit better if you rearrange things to avoid the thrust offset issues:\u003Cp\u003E\u003Ca href=\u0022https://dl.dropboxusercontent.com/u/61004449/KSP/1.0.4/screenshot838.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://dl.dropboxusercontent.com/u/61004449/KSP/1.0.4/screenshot838.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ERecovers the pricey rocket engine, all it discards are the SRBs and fuel tanks. Still, it is not the most economically viable, for that I would order them so:\u003C/p\u003E\u003Cp\u003E1. Airbreathing recoverable SSTO (fuel cost only)\u003C/p\u003E\u003Cp\u003E2. Pure rocket SSTO (fuel cost only, but higher than airbreathing)\u003C/p\u003E\u003Cp\u003E3. Shuttle style (fuel cost \u002B tanks and SRBs)\u003C/p\u003E\u003Cp\u003E4. Rocket with disposable stages (fuel cost \u002B tanks \u002B engines, etc)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is literally the thing I was waiting my whole KSP life!\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-09-14T20:55:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EThe fuel use gets a bit better if you rearrange things to avoid the thrust offset issues:\u003Cp\u003E\u003Ca href=\u0022https://dl.dropboxusercontent.com/u/61004449/KSP/1.0.4/screenshot838.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://dl.dropboxusercontent.com/u/61004449/KSP/1.0.4/screenshot838.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ERecovers the pricey rocket engine, all it discards are the SRBs and fuel tanks. Still, it is not the most economically viable, for that I would order them so:\u003C/p\u003E\u003Cp\u003E1. Airbreathing recoverable SSTO (fuel cost only)\u003C/p\u003E\u003Cp\u003E2. Pure rocket SSTO (fuel cost only, but higher than airbreathing)\u003C/p\u003E\u003Cp\u003E3. Shuttle style (fuel cost \u002B tanks and SRBs)\u003C/p\u003E\u003Cp\u003E4. Rocket with disposable stages (fuel cost \u002B tanks \u002B engines, etc)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERIC,\u003C/p\u003E\u003Cp\u003EThe reason shuttles can\u0027t keep up with disposables is the tyranny of the rocket equation. Most of what\u0027s placed in orbit is not payload, so the stack is huge in comparison. All the extra fuel and oxidizer erases any savings you get from returning the engines.\u003C/p\u003E\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"},{"CreatedByName":"Skorpychan","CreatedById":72052,"CreatedDateTime":"2015-09-14T21:20:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GoSlash27\u0022 data-cite=\u0022GoSlash27\u0022\u003E\u003Cdiv\u003ERIC,\u003Cp\u003EThe reason shuttles can\u0027t keep up with disposables is the tyranny of the rocket equation. Most of what\u0027s placed in orbit is not payload, so the stack is huge in comparison. All the extra fuel and oxidizer erases any savings you get from returning the engines.\u003C/p\u003E\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s because the shuttle\u0027s big wings and control surfaces, big main engines with heavy complex gimbal systems, and empty fuel tanks are all dry mass. The most efficient space shuttle design would have been Buran-style, with the engines under the main fuel tank, and dedicated on-orbit engines making good use of onboard fuel. And also a lifting body rather than big delta wings.\u003C/p\u003E\u003Cp\u003EOn top of that, using a rocket to launch something with wings on seems a little wasteful. I\u0027d rather have seen it air-launched from under a bomber, or maybe this: \u003Ca href=\u0022https://en.wikipedia.org/wiki/Conroy_Virtus\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Conroy_Virtus\u003C/a\u003E - I found it browsing wikipedia over the weekend, and it seems like a great idea. Get up high and up to a good velocity before releasing the shuttle and igniting the engines.\u003C/p\u003E\n"}]}