{"TopicId":120946,"ForumId":32,"TopicTitle":"How far have you gone in Kerbal Space Program?","CreatedByName":"Columbia","CreatedById":135031,"CreatedDateTime":"2015-09-15T13:55:33Z","PageNum":5,"Articles":[{"CreatedByName":"keeper","CreatedById":124530,"CreatedDateTime":"2015-09-27T19:24:07Z","Content":"\n\u003Cp\u003EI\u0027ve been playing for a year or two, not even got to another planet yet. \u003C/p\u003E\u003Cp\u003EIn the mean time i\u0027ve spent my hours building stations, rovers, mining rigs, moar rovers, lifters, landers, tugs, cranes, trains, and no planes. \u003C/p\u003E\u003Cp\u003EWell, i have been playing with my first working plane atm. It goes, it lifts, it turns and goes fast! I can get it into space and back, just not quite an orbit. My first working plane \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E after so long\u003C/p\u003E\n"},{"CreatedByName":"Astyrrean","CreatedById":145572,"CreatedDateTime":"2015-09-27T19:29:47Z","Content":"\n\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/3BvQTeyi8D0?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EAstyrrean\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-28T03:10:29Z\u0022 title=\u002209/28/2015 03:10  AM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 28, 2015\u003C/time\u003E by goldenpeach\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Terwin","CreatedById":139655,"CreatedDateTime":"2015-09-28T15:13:10Z","Content":"\n\u003Cp\u003EI\u0027ve been playing since March(0.90), and last night I recovered a ship landed safely on Kerbin that had visited Gilly, Eve\u0027s upper atmosphere and Moho(after a quick stop on Duna/Ike).\u003C/p\u003E\u003Cp\u003E(first craft to return from somewhere other than Duna or asteroid fetching(not counting Kerbin SOI and training visits to Kerbol SOI))\u003C/p\u003E\u003Cp\u003EI also took a scan-sat probe around the Joolian system a bit, finishing up with a slingshot around Tylo that has set me up to try and capture around Vall for some scanning while I wait for my manned ship(currently heading to Dres to drop a flag and make off with an asteroid-drop-tank)\u003C/p\u003E\n"},{"CreatedByName":"-RanZ-","CreatedById":51892,"CreatedDateTime":"2015-09-28T15:44:55Z","Content":"\n\u003Cp\u003EI have been everywhere. Many places I have landed on w/ Kerbals and a few with just probes/rovers. I have had kerbals land and return from Moho and Eeloo, those are probably the furthest.\u003C/p\u003E\n"},{"CreatedByName":"Demon_82","CreatedById":81626,"CreatedDateTime":"2015-09-28T16:24:33Z","Content":"\n\u003Cp\u003EThere\u0027s some flying stuff that\u0027s reached the limit of the Kerbol system, and continued getting away, not always on purpose. Some Kraken enhaced explosions sent part of my Kerbin space station pretty far and pretty fast... my purpose built probes have never been that fast, but they\u0027ve gone pretty far too.\u003C/p\u003E\u003Cp\u003EI\u0027ve landed everywhere, and I\u0027ve got back from some places even... sorry stranded kerbals. And I\u0027ve build stock modular land bases on Mun, Duna, Eve and Laythe, as big as the lag in the game let me.\u003C/p\u003E\u003Cp\u003EAnd my main savegame still works since 0.21, where I made all this xD\u003C/p\u003E\n"},{"CreatedByName":"dr_jt","CreatedById":58149,"CreatedDateTime":"2015-09-29T01:36:52Z","Content":"\n\u003Cp\u003EI\u0027ve gone about 3 feet, that would be about a meter for you backwards folks that use the metric system. \u003C/p\u003E\u003Cp\u003EI\u0027ve gone out to Jool and her moons. I have never gone in system to Eve. I don\u0027t know why. I\u0027ve just never done so. I like to go to Minmus for some reason. I send all sorts of craft to Minmus. It\u0027s kind of the go to place for my Kerbals. I think it\u0027s the color.\u003C/p\u003E\n"},{"CreatedByName":"WalkingShadow89","CreatedById":108181,"CreatedDateTime":"2015-09-29T02:56:16Z","Content":"\n\u003Cp\u003EI\u0027ve landed on every single body in the solar system except for Tylo. That one is gonna give me trouble for a while!\u003C/p\u003E\n"},{"CreatedByName":"Xacktar","CreatedById":88876,"CreatedDateTime":"2015-09-29T02:56:40Z","Content":"\n\u003Cp\u003EI\u0027ve been to Eeloo\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://images.akamai.steamusercontent.com/ugc/693902535310381977/3CF92D218AA974DEA102518440343EE83BBBD48D/?\u0022 alt=\u0022?\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlso touched down on Moho with a probe and almost every other place with the exception of Tylo. Tylo\u0027s a tricky one.\u003C/p\u003E\n"},{"CreatedByName":"Mad Rocket Scientist","CreatedById":139256,"CreatedDateTime":"2015-09-29T03:05:28Z","Content":"\n\u003Cp\u003ESometimes I move my chair back and forth a bit while I\u0027m playing.\u003C/p\u003E\n"},{"CreatedByName":"Teutooni","CreatedById":76518,"CreatedDateTime":"2015-09-30T02:19:42Z","Content":"\n\u003Cp\u003EI once designed and built a great arkship with closed lifesupport loop for 10 kerbals (TAC-LS \u002B USI), several landers for exploring every landable body, robotic fuel miners and refineries, etc. Iirc it was close to 400 parts with over 800 tons mass. It was designed to be able to explore everything and never need to return. You can see where this is going don\u0027t you? Just turning the thing was measured in orbits, not minutes or seconds. Needless to say it never left kerbin SOI, it was simply too painful to play.\u003C/p\u003E\u003Cp\u003EThe most difficult/complicated thing I\u0027ve done mission-wise is probably an unmanned duna mission with remote tech signal delay. The mission included 5 separate probes carried by one rocket: a communications hub with large antenna, an orbiter with SCANsat equipment for both duna and ike, plus landers for both. Landing with and without atmosphere become quite interesting when there\u0027s over a minute signal delay. Both are doable, but need some tricks.\u003C/p\u003E\u003Cp\u003EPiloting-wise the most difficult thing was landing a 200-ton spaceplane on Tylo with TWR of 1.2. It was fusion powered (KSPI), so insane delta-v but low TWR. Iirc a suicide burn distance would have been almost outside Tylo\u0027s SOI. It was a great educational experience - I think everyone should familiarize themselves with constant altitude landings.\u003C/p\u003E\u003Cp\u003ELiterally the farthest I\u0027ve been is Eeloo, but don\u0027t really consider that a significant achievement. Just pack enough lifesupport for a decade or two and it\u0027s not that different from any interplanetary trip.\u003C/p\u003E\u003Cp\u003EStill haven\u0027t returned from Eve on any version.\u003C/p\u003E\n"},{"CreatedByName":"Robotengineer","CreatedById":104525,"CreatedDateTime":"2015-09-30T02:23:43Z","Content":"\n\u003Cp\u003EI\u0027ve been to Eeloo in stock and Mars in RSS/RO. (Eeloo was manned, the Mars mission was just a probe.)\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2015-09-30T02:43:14Z","Content":"\n\u003Cp\u003EMoho, Eeloo. Slate, Wal. All manned land and returns with TACLS. The last two concluded last night meaning break time from KSP before 1.1 hits. I have to try these things called \u0022other video games\u0022.\u003C/p\u003E\n"},{"CreatedByName":"peachoftree","CreatedById":110108,"CreatedDateTime":"2015-09-30T03:04:30Z","Content":"\n\u003Cp\u003EMy farthest return mission is Duna, but I have sent kerbals as far as laythe, but they never got the chance to come home \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E. I also have sent a one-way probe to Moho\u003C/p\u003E\n"},{"CreatedByName":"Hary R","CreatedById":111339,"CreatedDateTime":"2015-09-30T05:23:01Z","Content":"\n\u003Cp\u003Eone kerbal that have successfully survive a lithobreak on Duna:( after 2 years of play. Need to play more.\u003C/p\u003E\n"},{"CreatedByName":"G\u0026#039;th","CreatedById":98595,"CreatedDateTime":"2015-09-30T06:09:26Z","Content":"\n\u003Cp\u003EManned? Only to interplanetary space. Unmanned? I\u0027ve landed probes on Eve and Duna, though one was DOA and the other wasn\u0027t even intended to be able to land.\u003C/p\u003E\u003Cp\u003EI\u0027m planning on changing that though once and for all.\u003C/p\u003E\n"},{"CreatedByName":"WWEdeadman","CreatedById":105591,"CreatedDateTime":"2015-09-30T10:02:23Z","Content":"\n\u003Cp\u003EWell, I\u0027ve been to every Planet and Moon in the stock game, and I\u0027ve shot stuff out of the Solar System. In terms of biggest projects, I\u0027d say:\u003C/p\u003E\u003Cp\u003E-Multiple attempts at huge Eve return ships, only one of which managed to get off Eve. (But that was so large, the game laggt to 2-3 FPS and I couldn\u0027t get the ship off Kerbin and to Eve without Hyperedit, cause the game would crash when I tried to add a launch stage or a transfer tug.\u003C/p\u003E\u003Cp\u003E-A huge probe package for the Jool system, that had an orbiter \u002B lander for every Moon and an orbiter \u002B atmospheric probe for Jool.\u003C/p\u003E\u003Cp\u003E-A really huge rescue mission for a contract. A Kerbal stranded in Orbit of the Sun. Below Mohos Orbit. He was called \u0022Scott Kerman\u0022 so I couldn\u0027t resist rescuing him. And yes, he did come to Kerbin safely. Although rather unconventionally.\u003C/p\u003E\u003Cp\u003E(Documentation of all of this in my Let\u0027s Play videos)\u003C/p\u003E\n"},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2015-09-30T13:19:28Z","Content":"\n\u003Cp\u003EHad probe landers on every body in stock (barring the Sun), including Jool\u0027s atmosphere. Furthest return/crewed mission was Duna.\u003C/p\u003E\u003Cp\u003EThen I got tied up in LKO with tourists and labs and forgot about all the other planets. Not unlike post-Apollo NASA \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"algeo","CreatedById":147723,"CreatedDateTime":"2015-09-30T14:02:03Z","Content":"\n\u003Cp\u003EI think I\u0027ve visited just about every planet and moon (and, indeed, crashed a few probes into kerbol) but like the above poster I generally keep to the vicinity of kerbin and its moons. \u003C/p\u003E\u003Cp\u003EThere\u0027s always some way of making a mun landing or LKO-station building just as hard as a trip to any distant planet or moon. I just prefer to spend my time building crazy contraptions and launching them over and over with varying degrees of success over sitting in orbit and keeping track of transfer windows.\u003C/p\u003E\n"},{"CreatedByName":"RA3236","CreatedById":150734,"CreatedDateTime":"2015-09-30T17:35:58Z","Content":"\n\u003Cp\u003ELong story short: Eeloo and beyond. Long: the rocket that sent that kamikaze probe could only launch kerbals to Minmus.\u003C/p\u003E\u003Cp\u003EIn career, LKO. Seriously, I\u0027m a sandbox person. And for planet visits that were fair:\u003C/p\u003E\u003Cp\u003EKerbol: crashed, escaped from SOI\u003C/p\u003E\u003Cp\u003EMoho: I think I got a probe there once, but that was it.\u003C/p\u003E\u003Cp\u003EEve: burned up on aerobraking.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003EKerbin Career: LKO. Over wise visited everything with Mechjeb.\u003C/p\u003E\u003Cp\u003EDuna: Attempted landing, but parachutes didn\u0027t deploy. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 alt=\u0022:rolleyes:\u0022\u003E\u003C/p\u003E\u003Cp\u003EDres: Not even close to getting to it.\u003C/p\u003E\u003Cp\u003EJool: Gravity assist for my trip to Eeloo. To help I used Tylo and Laythe.\u003C/p\u003E\u003Cp\u003EEeloo: Okay, I lied about the kamikaze thing. What happened was that I was trying to get out of Kerbols Soi and to do so in that trip I scraped the surface and destroyed my generator... It was a good thing that I had emergency solar panels, not that they worked.\u003C/p\u003E\u003Cp\u003EAnd before you ask, I\u0027ve been playing since January. And I always use mods that don\u0027t add in engines and fuel tanks, which does mean I use Mechjeb. Actually I pulled out my Eeloo trip without it when I found out that my LKO heavy lifter could go to Eeloo sending a probe and I was like, I didn\u0027t know my Minmus probe had 17km/s of delta v!!!!\u003C/p\u003E\u003Cp\u003EAnd yes, that was in 0.90.0. I won\u0027t be able to pull it off again for a while...\u003C/p\u003E\u003Cp\u003E\u003Cem\u003ESorry for the excessive rambling on about a mistake...\u003C/em\u003E\u003C/p\u003E\n"},{"CreatedByName":"eataTREE","CreatedById":116601,"CreatedDateTime":"2015-10-01T23:38:13Z","Content":"\n\u003Cp\u003EJust last week I landed a rover on Tekto (Titan-like moon of Sarnus from the Outer Planets Mod), and I consider this to be my crowning KSP achievement thus far. \u003C/p\u003E\u003Cp\u003EMoho: Successful manned return mission\u003C/p\u003E\u003Cp\u003EEve: Manned orbital observation, probe landing\u003C/p\u003E\u003Cp\u003EGilly: Successful manned return mission\u003C/p\u003E\u003Cp\u003EMun/Minimus: Many successful manned return missions, Great Big Spaceport constructed in Munar orbit\u003C/p\u003E\u003Cp\u003EDuna: Several successful return missions\u003C/p\u003E\u003Cp\u003EIke: Same, Ike is easy\u003C/p\u003E\u003Cp\u003EDres: Stranded Kerbals there in unsuccessful mission attempt, haven\u0027t been back. D\u0027oh!\u003C/p\u003E\u003Cp\u003EJool: Manned return mission to Bop and Pol, but not Tylo, Vail, or Laythe\u003C/p\u003E\u003Cp\u003E(Here begin the Outer Planets)\u003C/p\u003E\u003Cp\u003ESarnus: 65-kilometers-of-delta-V Big Grandiose Expedition currently underway, rover deployed to Tekto, second rover destined for Slate\u003C/p\u003E\u003Cp\u003ENeidon: Never been\u003C/p\u003E\u003Cp\u003EUrium: Never been\u003C/p\u003E\u003Cp\u003EPlock: Never been\u003C/p\u003E\u003Cp\u003ECercani system (Other Worlds star pack): Never been\u003C/p\u003E\u003Cp\u003EAll of the above were performed with TAC-LS and RemoteTech installed. When you start considering 20-year missions, keeping your Kerbals fed and breathing becomes a BIG challenge.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-01T23:42:39Z\u0022 title=\u002210/01/2015 11:42  PM\u0022 data-short=\u00228 yr\u0022\u003EOctober 1, 2015\u003C/time\u003E by eataTREE\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Bev7787","CreatedById":136501,"CreatedDateTime":"2015-10-01T23:39:09Z","Content":"\n\u003Cp\u003EMoon orbit in RSS, Eve, Duna, Mun, Minmus\u003C/p\u003E\n"},{"CreatedByName":"T\u0026#039;Flok","CreatedById":137717,"CreatedDateTime":"2015-10-02T00:37:57Z","Content":"\n\u003Cp\u003ESince I use cheats to get my somewhat limited Sci-Fi experience I\u0027ve visited all of the planets and moons except Val until a few months back (Val is my favorite, it\u0027s blue and I feel tranquility on there). My playstyle is that of an independent nomadic explorer. I\u0027m planning to build something big in 1.1, something that is currently a pain to fly due to low FPS and other limitations currently in KSP hampering any enjoyment of the game for me.\u003C/p\u003E\n"},{"CreatedByName":"winged","CreatedById":143617,"CreatedDateTime":"2015-10-02T09:32:49Z","Content":"\n\u003Cp\u003EPluto flyby with Jupiter gravity assist in RSS.\u003C/p\u003E\u003Cp\u003EStock? Crewed mission and return from every celestial body.\u003C/p\u003E\n"}]}