{"TopicId":121000,"ForumId":55,"TopicTitle":"ISRU ideas","CreatedByName":"jwbrase","CreatedById":150131,"CreatedDateTime":"2015-09-16T08:43:07Z","PageNum":1,"Articles":[{"CreatedByName":"jwbrase","CreatedById":150131,"CreatedDateTime":"2015-09-16T08:43:07Z","Content":"\n\u003Cp\u003EI have two interesting ISRU ideas: One for Dres and one for Eve.\u003C/p\u003E\u003Cp\u003EThe Dres idea is fairly straightforward: Have a special ISRU resource that Xenon can be extracted from, available only on Dres. This would allow players to get a fairly cheap source of Xenon by mining Dres, which would encourage exploration of a planet that might otherwise be considered out of the way.\u003C/p\u003E\u003Cp\u003EThe Eve idea is twofold:\u003C/p\u003E\u003Cp\u003EFirst, since Eve\u0027s ocean biome is called the \u0022Explodium Sea\u0022, have liquid fuel be an ISRU resource that can be directly and quickly collected by craft splashed down on Eve without any intermediate processing.\u003C/p\u003E\u003Cp\u003ESecondly, have jet engines work on Eve, but instead of using atmospheric oxygen and onboard fuel, have them use atmospheric fuel and onboard oxidizer on Eve. Potentially one could also have a \u0022fuel condenser\u0022 part that used copious amounts of electricity to extract liquid fuel from air gathered through intakes on Eve, to allow craft landed inland on Eve to also extract liquid fuel, although more slowly than craft landed in the ocean and with much steeper power requirements.\u003C/p\u003E\n"},{"CreatedByName":"RidingTheFlow","CreatedById":111197,"CreatedDateTime":"2015-09-16T09:56:45Z","Content":"\n\u003Cp\u003EFor xenon factory to be useful, in first place some uses are needed for large amount of xenon - larger engines and tanks.\u003C/p\u003E\u003Cp\u003EUsing electricity to extract fuel for jet engine is very roundabout. Much better is just to make electric propfan \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"FlyingPete","CreatedById":127384,"CreatedDateTime":"2015-09-16T11:07:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jwbrase\u0022 data-cite=\u0022jwbrase\u0022\u003E\u003Cdiv\u003EThe Dres idea is fairly straightforward: Have a special ISRU resource that Xenon can be extracted from, available only on Dres. This would allow players to get a fairly cheap source of Xenon by mining Dres, which would encourage exploration of a planet that might otherwise be considered out of the way.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERemember though that once you can obtain fuel in orbit, there\u0027s less benefit to the ion engines- just have more fuel tanks that you launch empty.\u003C/p\u003E\u003Cp\u003EThere was originally a much more convoluted resource system planned, some of which can be recognised in the current system. I\u0027d definitely like to see the option to harvest the oceans on Laythe or Eve- particularly if Eve\u0027s oceans can yield propellium directly.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/lGlWdyn.png\u0022 alt=\u0022lGlWdyn.png\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jwbrase\u0022 data-cite=\u0022jwbrase\u0022\u003E\u003Cdiv\u003ESecondly, have jet engines work on Eve, but instead of using atmospheric oxygen and onboard fuel, have them use atmospheric fuel and onboard oxidizer on Eve.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI like this idea. Fundamentally there\u0027s no difference between supplying oxidiser in a reducing atmosphere or supplying fuel in an oxidising atmosphere. You could have a spacecraft that dips into the atmosphere and flies around without landing, using jet engines.\u003C/p\u003E\u003Cp\u003E The same engines could be made to work in Jool\u0027s atmosphere too for further exploration there.\u003C/p\u003E\n"},{"CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2015-09-16T12:41:15Z","Content":"\n\u003Cp\u003EI still think Xenon should be mineable using ISRU. In my opinion it would be a great way to obtain cash if you consider the contracts silly.\u003C/p\u003E\u003Cp\u003EStill waiting for the air intakes to have ISRU uses. Maybe Xenon could be obtained from air on some bodies like Laythe, Eve or Jool?\u003C/p\u003E\u003Cp\u003EI don\u0027t care about oceans.\u003C/p\u003E\n"},{"CreatedByName":"CaptainTurbomuffin","CreatedById":113456,"CreatedDateTime":"2015-09-16T16:51:11Z","Content":"\n\u003Cp\u003EI was really disappointed when instead of that rescoure flow diagram, we got only ore. I hope that the current system is just a transition. Being able to produce rescoures much more efficiently on specific bodies is necessary, and for dres... That\u0027s the only planet I haven\u0027t visited, and that I won\u0027t, because I have little time, while it\u0027s a really uninteresting, black MÃƒÂ¼n. It should definitely be made more useful. Intake air from eve? Not for ocean-less areas, but for diving from orbit! Even if you could extract pure fuel from eve\u0027s oceans, you would have a hard time returning it, and it would be more efficient to bring it from Kerbin. The mentioned jet? Wouldn\u0027t that be nearly as efficient as rocket motors? Suddenly I had a bold idea to make eve\u0027s oceans more remunerative: How about being able to extract a really efficient super-fuel from there, that\u0027s much better than the LFO mix, and wich can\u0027t be found at kerbin?\u003C/p\u003E\n"},{"CreatedByName":"Grumman","CreatedById":76014,"CreatedDateTime":"2015-09-16T17:00:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jwbrase\u0022 data-cite=\u0022jwbrase\u0022\u003E\u003Cdiv\u003EI have two interesting ISRU ideas: One for Dres and one for Eve.\u003Cp\u003EThe Dres idea is fairly straightforward: Have a special ISRU resource that Xenon can be extracted from, available only on Dres. This would allow players to get a fairly cheap source of Xenon by mining Dres, which would encourage exploration of a planet that might otherwise be considered out of the way.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI dislike this idea. I would much prefer to be able to harvest Xenon from Jool\u0027s atmosphere - a cool idea in a cool location - rather than deliberately putting it somewhere that nobody likes going.\u003C/p\u003E\n"},{"CreatedByName":"Slam_Jones","CreatedById":125101,"CreatedDateTime":"2015-09-16T17:31:32Z","Content":"\n\u003Cp\u003EXenon is very much minable... if you don\u0027t mind mods or .cfg editing. I believe the Near Future suite of mods adds the ability to your ISRU to do as such (along with the other fuel types).\u003C/p\u003E\n"},{"CreatedByName":"Joonatan1998","CreatedById":97636,"CreatedDateTime":"2015-09-16T18:04:31Z","Content":"\n\u003Cp\u003E\u002B1 for the Dres idea.\u003C/p\u003E\u003Cp\u003EHaving mineable xenon everywhere would be broken, but this could make dres a bit more interesting.\u003C/p\u003E\u003Cp\u003EI think the ISRU system really needs another resource, it is clearly designed for more than one.\u003C/p\u003E\u003Cp\u003E2 would make it look much more polished.\u003C/p\u003E\n"}]}