{"TopicId":121368,"ForumId":55,"TopicTitle":"New Maneuver Node Editing Tool","CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-09-21T18:58:26Z","PageNum":3,"Articles":[{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-11-17T16:58:24Z","Content":"\n[quote name=\u0027m4ti140\u0027]In my opinion the tool should rotate with the map, it would make it more intuitive as you would add delta v by moving the marker in the direction you want to burn into on the map.[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nIt makes it less intuitive because it is inconsistent. The whole idea is to not have to be looking at the node to use it. If I\u0026#39;m around Duna, trying to find tune a node at Kerbin for my encounter I really don\u0026#39;t care what orientation the map is. It needs to remain consistent throughout or it might as well not be done at all.\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-17T17:00:45Z\u0022 title=\u002211/17/2015 05:00  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 17, 2015\u003C/time\u003E by Alshain\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"wreckreation","CreatedById":114933,"CreatedDateTime":"2015-11-17T20:08:33Z","Content":"\nHow about keyboard controls? A rough analogue of the maneuver directions (prograde, retro.. etc.) are the intuitive directions forward, backward, up, down, left right. We already have keys that map to those: the rcs translation keys I,J,K,L,H,N.\u003Cbr\u003E\n\u003Cbr\u003E\nI think it would be intuitive to use them to adjust the maneuver node. I propose Alt\u002B[L, J, I, K, H, N].\u003Cbr\u003E\n\u003Cbr\u003E\nprograde: Alt\u002BL\u003Cbr\u003E\nretrograde: Alt\u002BJ\u003Cbr\u003E\nnormal: Alt\u002BI\u003Cbr\u003E\nanti-normal: Alt\u002BK\u003Cbr\u003E\nradial: Alt\u002BH\u003Cbr\u003E\nanti-radial: Alt\u002BN\n"},{"CreatedByName":"theJesuit","CreatedById":122369,"CreatedDateTime":"2015-11-17T20:29:39Z","Content":"\nAn amazing concept. I would hope that putting values in similar to precise node would be part of the concept or at the very least expressing a numerical value on the display to show how much. The additional info could be a drop down from the toolbar button.\u003Cbr\u003E\n\u003Cbr\u003E\nI\u0026#39;m keen on the idea that the Centre across the main display clear too.\u003Cbr\u003E\n\u003Cbr\u003E\nPeace.\n"},{"CreatedByName":"CatmanFS","CreatedById":152677,"CreatedDateTime":"2015-11-20T02:15:59Z","Content":"\nYeah, I mean at least some kind of manual control over the directional DV, radial, normal, prograde numbers should be typable. Kind of tired of trying to massage the click and drag mechanic especially when my mouse likes to occasionally \u0022let go\u0022 when I\u0026#39;m holding the button down.\n"},{"CreatedByName":"jf0","CreatedById":148341,"CreatedDateTime":"2015-11-20T04:55:55Z","Content":"\nSomething that has always bugged me is that the vectors of the node are relative to the new predicted orbit, not the current orbit. for prograde/retrograde maneuvers it doe not matter. But if you drag the normal vectors, this will change the inclination of the new orbit, but also rotates the maneuver node vectors too! the node vectors would be more intuitive if they did not rotate as the predicted orbit changed.\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-11-20T22:30:33Z","Content":"\n[quote name=\u0027theJesuit\u0027]An amazing concept. I would hope that putting values in similar to precise node would be part of the concept or at the very least expressing a numerical value on the display to show how much. The additional info could be a drop down from the toolbar button.\u003Cbr\u003E\n\u003Cbr\u003E\nI\u0026#39;m keen on the idea that the Centre across the main display clear too.\u003Cbr\u003E\n\u003Cbr\u003E\nPeace.[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nThe whole idea is to keep it stock alike but more accessible, so no, that is not in this plan.\u003Cbr\u003E\n\u003Cbr\u003E\n[COLOR=\u0022silver\u0022][SIZE=1]- - - Updated - - -[/SIZE][/COLOR]\u003Cbr\u003E\n\u003Cbr\u003E\n[quote name=\u0027jf0\u0027]Something that has always bugged me is that the vectors of the node are relative to the new predicted orbit, not the current orbit. for prograde/retrograde maneuvers it doe not matter. But if you drag the normal vectors, this will change the inclination of the new orbit, but also rotates the maneuver node vectors too! the node vectors would be more intuitive if they did not rotate as the predicted orbit changed.[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nYes, that is part of the \u0022no rotation\u0022 idea in this suggestion. It should only rotate during/after a burn. Otherwise it shouldn\u0026#39;t rotate.\n"},{"CreatedByName":"herbal space program","CreatedById":112590,"CreatedDateTime":"2015-11-20T23:47:08Z","Content":"\nThis would definitely be a big improvement. The only things I can think to add would be 1) to have 3 explicit coarse/fine settings, where one mouse wheel click equals 0.1, 1, or 10m/s, which are shown somewhere on the display and can be changed with hotkeys like timewarp, and 2) to have some description of where the node being edited is (e.g. \u0022orbiting Kerbin\u0022) as part of the display, so that you don\u0026#39;t get confused about what\u0026#39;s what.\n"},{"CreatedByName":"Biejoo","CreatedById":153243,"CreatedDateTime":"2015-11-24T08:43:37Z","Content":"\nVery good idea! I hope this gets picked up by Squad, because it would really smoothen one of the roughest bits of gameplay.\u003Cbr\u003E\n\u003Cbr\u003E\nIf this is too much work, I would propose something else as a stopgap:\u003Cbr\u003E\nI think the biggest issue (playing the focus game to be able to grab your node the way you want it) could be fixed by a very simple solution: being able to focus on a Node.\n"},{"CreatedByName":"egoego","CreatedById":138988,"CreatedDateTime":"2015-11-24T12:56:23Z","Content":"\nThis idea looks like it could really improve manouver node handling. And you wouldn\u0026#39;t even need to change manouver nodes itself, just add a new GUI element. I like this idea.\n"},{"CreatedByName":"CorBlimey","CreatedById":134058,"CreatedDateTime":"2015-11-26T00:01:39Z","Content":"\nyes, this would be very useful.\u003Cbr\u003E\n\u003Cbr\u003E\nI would also like it to have small numbers next to the markers showing how much dV in each vector (not edited via numbers, simply a teeny tiny yellow number - hope that is not too un-stockalike ;p)\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-26T00:04:57Z\u0022 title=\u002211/26/2015 12:04  AM\u0022 data-short=\u00228 yr\u0022\u003ENovember 26, 2015\u003C/time\u003E by CorBlimey\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Robje","CreatedById":59484,"CreatedDateTime":"2015-11-30T22:12:41Z","Content":"\n\u003Cp\u003E\nYou have my support too.\n\u003C/p\u003E\n"},{"CreatedByName":"Nemeko","CreatedById":154318,"CreatedDateTime":"2015-12-02T23:04:56Z","Content":"\n\u003Cp\u003E\nI\u0027m totally support this, is necessary for interplanetary tranfers and i support the precision improvement, but not the imput with numbers there is a mod for that, also i hope this fix the problem of taking the wrong icon (prograde, retrograde, etc) in some situations (becose of the camera angle)\n\u003C/p\u003E\n"},{"CreatedByName":"Mad Rocket Scientist","CreatedById":139256,"CreatedDateTime":"2015-12-03T00:34:14Z","Content":"\n\u003Cp\u003E\nI completely support this.\n\u003C/p\u003E\n"},{"CreatedByName":"SpaceplaneAddict","CreatedById":149322,"CreatedDateTime":"2015-12-03T01:00:26Z","Content":"\n\u003Cp\u003E\nI want this now.\n\u003C/p\u003E\n"},{"CreatedByName":"CorBlimey","CreatedById":134058,"CreatedDateTime":"2015-12-15T20:30:01Z","Content":"\n\u003Cp\u003E\nshameless bump \u003Cimg alt=\u0022:cool:\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 title=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2015-12-16T13:12:05Z","Content":"\n\u003Cp\u003E\nFor me, the ability to enter numbers for prograde, normal, and radial burn Dv and time of burn would greatly improve maneuver node editing.\n\u003C/p\u003E\n\u003Cp\u003E\nIf combined with not having to click on an orbit line to make a node it would solve the majority of the issues I have with making a node.\n\u003C/p\u003E\n"},{"CreatedByName":"Jenyaza","CreatedById":155707,"CreatedDateTime":"2016-01-23T21:15:52Z","Content":"\n\u003Cp\u003E\nAmasing! Download now... *where is download link, i miss it?\n\u003C/p\u003E\n"},{"CreatedByName":"Gaarst","CreatedById":126740,"CreatedDateTime":"2016-01-23T21:17:56Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222376146\u0022 data-ipsquote-contentid=\u0022121368\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221453583752\u0022 data-ipsquote-userid=\u0022155707\u0022 data-ipsquote-username=\u0022Jenyaza\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 minute ago, Jenyaza said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAmasing! Download now... *where is download link, i miss it?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis is not a mod, just a suggestion for changes in the stock game. I don\u0027t think anyone has made a mod out of this.\n\u003C/p\u003E\n"},{"CreatedByName":"capran","CreatedById":65692,"CreatedDateTime":"2016-01-23T21:19:41Z","Content":"\n\u003Cp\u003E\nSomeone implement this in a mod. Stat.\n\u003C/p\u003E\n"},{"CreatedByName":"michelcolman","CreatedById":157405,"CreatedDateTime":"2016-01-24T10:32:53Z","Content":"\n\u003Cp\u003E\nExcellent idea. My main problems with the current maneuver nodes are:\n\u003C/p\u003E\n\u003Cp\u003E\n- Moving a node along the orbit is very hard to do because you often grab one of the handles instead. You have to zoom in (losing sight of the new orbit) and possibly change the camera angle just to be able to hover the mouse over just the right spot so the node circle is illuminated and not one of the handles. Often requires pixel perfect mouse alignment, and the thing is not even standing still so you end up clicking on the wrong part anyway as the handle lit up a fraction of a second before you click.\n\u003C/p\u003E\n\u003Cp\u003E\n- It\u0027s hard to find a camera angle where you can adjust the node and also see the resulting orbit. For example, to plan a Mun capture, you need to have the Mun and the node in view at the same time, so it\u0027s impossible to precisely change the location of the node. A one pixel change gives a totally different result. So you need to zoom in, make an adjustment, zoom out again, etc...\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, I can think of one alternative that might be even more useful and versatile: split screen so you can have two seperate views. Focus one on the intercept, and the other view on the maneuver node. This would have many other uses, and would make changes to the maneuver node system unnecessary.\n\u003C/p\u003E\n"},{"CreatedByName":"Evanitis","CreatedById":145424,"CreatedDateTime":"2016-01-24T10:36:07Z","Content":"\n\u003Cp\u003E\nIt would be lovely. The main reason I \u003Cs\u003Echeat\u003C/s\u003E use MJ instead of KER is that it can make some \u003Cem\u003Eperfect\u003C/em\u003E nodes in certain situations. That\u0027s infinitely better than than nudging the stock gizmo until it fits.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-01-24T10:37:00Z\u0022 title=\u002201/24/2016 10:37  AM\u0022 data-short=\u00228 yr\u0022\u003EJanuary 24, 2016\u003C/time\u003E by Evanitis\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"CloudlessEchoes","CreatedById":142599,"CreatedDateTime":"2016-02-06T16:03:14Z","Content":"\n\u003Cp\u003E\nThis would definitely make things better than stock. However, I\u0027d probably still use Precisenode or MJ because I want fine control. The biggests issues I have with stock (besides what this concept will fix):\n\u003C/p\u003E\n\u003Cp\u003E\n-Inability for real fine control\n\u003C/p\u003E\n\u003Cp\u003E\n-No way to know how much of each vector you have input, or to zero out any of them\n\u003C/p\u003E\n\u003Cp\u003E\n-No way to lock to apo, peri, dn, etc (VERY important for efficient orbits and corrections)\n\u003C/p\u003E\n\u003Cp\u003E\nI kind of like the idea of being able to change the reference frame of the nodes too, but it would definitely be an advanced option.\n\u003C/p\u003E\n"},{"CreatedByName":"superstrijder15","CreatedById":155985,"CreatedDateTime":"2016-02-07T21:23:42Z","Content":"\n\u003Cp\u003E\nI dont know if it\u0027s already been said, but maybe allow for target mode? So I could plan moving compared to target in advance. mainly useful with slow turners when you want to skip trough part of the orbit, during which the vectors change.\n\u003C/p\u003E\n"},{"CreatedByName":"Morse","CreatedById":154930,"CreatedDateTime":"2016-03-31T07:55:28Z","Content":"\n\u003Cp\u003E\nHi, author of the Precise Maneuver mod here.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m about to update my mod for 1.1, and to overhaul it a little in the process. I want to do it modular, and I\u0027m thinking about adding this kind of gizmo as one of the modules. I imagine it to look something like this (a rough mockup, icons are not shown, but they\u0027ll be there):\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022salDgj1.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/salDgj1.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAll the modules should be optional (i.e. node selector module, orbit mode module and so on) so in the extreme case you\u0027ll be able to disable all the modules except the one, and have a window very close in the functionality and look to the proposed in this thread. I\u0027m still not sure about the details, and what kind of visual effects should show the usage of the controls (the hover-on glow is a no brainer obviously, but when you click and drag, should it be a stretch, or an increasing glow, or both, or what).\n\u003C/p\u003E\n\u003Cp\u003E\nSuggestions are welcome. I intend to start coding during the weekend, hopefully it\u0027ll be ready for 1.1 release.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-03-31T10:45:20Z\u0022 title=\u002203/31/2016 10:45  AM\u0022 data-short=\u00228 yr\u0022\u003EMarch 31, 2016\u003C/time\u003E by Morse\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"michelcolman","CreatedById":157405,"CreatedDateTime":"2016-03-31T09:44:59Z","Content":"\n\u003Cp\u003E\nI\u0027ll give a couple of suggestions:\n\u003C/p\u003E\n\u003Cp\u003E\n- Maybe add the maneuver direction icons (prograde, normal, radial) to make it clear which one you\u0027re adjusting.\n\u003C/p\u003E\n\u003Cp\u003E\n- \u0022Orbit mode:\u0022 would probably be better named \u0022Conics mode:\u0022 since escape trajectories are not technically orbits.\n\u003C/p\u003E\n\u003Cp\u003E\n- Not sure what the \u0022\u002Borbits\u0022 and \u0022-orbits\u0022 buttons do, does that change CONIC_PATCH_LIMIT? In that case it\u0027s certainly a good idea to include it, but it might be confused with the \u002B/- buttons on the standard maneuver nodes which go to the next and previous orbits. Since it\u0027s changing a setting just like the \u0022orbit mode\u0022 buttons that are directly above, it\u0027s probably better to add a label \u0022Number of conics\u0022 for better visual consistency, or even better \u0022Display 3 conics\u0022 with \u0022\u002B\u0022/\u0022-\u0022 buttons behind it that change the number. \n\u003C/p\u003E\n\u003Cp\u003E\n- Can you also display the three individual delta-v components instead of just the total delta-v? And maybe to a higher than 0.1 m/s precision. With atomic engines, I often make really tiny adjustments by pressing shift and immediately X again. Nice if you want to leave a gravity assist trajectory exactly in the orbital plane, for example. Doesn\u0027t matter much when you\u0027re just going to the Mun, but makes a huge difference when pingponging in the Jool system.\n\u003C/p\u003E\n\u003Cp\u003E\n- Stock maneuver nodes are relative to the new path for some reason. When you add a normal burn, the node axes twist around so that the normal vector is really applying some unwanted retrograde. It would often be useful to define the node relative to the old path. I understand it may take a lot of work to convert between the two, but if it\u0027s at all possible, it would be a great addition if users could switch between \u0022relative to old\u0022 and \u0022relative to new\u0022. (The actual node will probably always be relative to the new path, but your window could display and manipulate a converted set of values)\n\u003C/p\u003E\n\u003Cp\u003E\n- An \u0022execute maneuver\u0022 button like the one in Mechjeb would be nice, too. But try to make it more precise, Mechjeb\u0027s execution only has about a 0.1 m/s accuracy, so I usually have to do the last bit of the burn by hand to get exactly the path I want.\n\u003C/p\u003E\n\u003Cp\u003E\nThat\u0027s all, should only take you 5 minutes or so ;-)\n\u003C/p\u003E\n\u003Cp\u003E\nThanks!\n\u003C/p\u003E\n\u003Cp\u003E\nMichel\n\u003C/p\u003E\n"}]}