{"TopicId":121498,"ForumId":46,"TopicTitle":"Some helpful hints about signatures","CreatedByName":"adsii1970","CreatedById":89014,"CreatedDateTime":"2015-09-23T15:25:59Z","PageNum":1,"Articles":[{"CreatedByName":"adsii1970","CreatedById":89014,"CreatedDateTime":"2015-09-23T15:25:59Z","Content":"\n\u003Cp\u003EI do not remember seeing another thread that covers what I am about to share here. If there is one, I would like to make an apology to those who have ventured to share what I am about to share. I\u0027ve always been fascinated by the various signatures I see on this forum and after a couple of months, have decided to pass on some information that I\u0027ve learned by trial and error. This is a work in progress and will probably be revised, edited, and changed as I discover more information to pass on. \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#B22222;\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cstrong\u003EThere is a 1,000 character limit when customizing your signature\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EYes, that\u0027s correct. Whether it is straight text or the use of tags and urls, there are only 1,000 characters you can use to customize your signature. For many users, this will never be a problem. If you are like me and want to highlight your most popular thread, your online photo album on Photobucket or Imgr, or maybe your various challenge badges, it becomes fairly easy to approach or even go over the 1,000 character limit. Here are some tips I have learned in the process of developing my forum\u0027s signature.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#0000FF;\u0022\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E\u003Cstrong\u003EShorten URLS\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EThis was a \u0022well, duh!\u0022 moment I had this morning. I actively blog (religion and politics \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E) and often use outbound links in my blog. I also teach at a local college and often will reference Internet sources for my students to use. It hit me that in each of those cases, I always change the long url (this is the address that tells the computer where to go on the web) to a short url. Personally, I use \u003Ca href=\u0022https://tinyurl.com/create.php\u0022 rel=\u0022external nofollow\u0022\u003Etiny url\u003C/a\u003E for that task. You can save a significant amount of characters by shortening your outbound urls. So far, this works with IMGR, Photobucket, KerbakX, and every other url you care think of AND that won\u0027t get you in trouble with the moderators. \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/members/12867-Red-Iron-Crown\u0022 rel=\u0022external nofollow\u0022\u003ERedIronCrown\u003C/a\u003E offered me a bit of assistance today about another way to shorten the url, specifically to links within the forum. There are two commands that may be used that reduce the character count specifically. Both are considered tags and can efficiently reduce the character count. They are the [thread] and tags. For the below examples, the thread tag will take you back to this page and the post tag will be \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/members/12867-Red-Iron-Crown\u0022 rel=\u0022external nofollow\u0022\u003ERedIronCrown\u0027s \u003C/a\u003Einsightful post:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003E[thread=134953]Thread tag redirecting to the original thread[/thread] and [post=2210573]The post tag redirecting to RedIronCrown\u0027s post[/post]\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EAnd this is how they would appear (and behave) in your signature:\u003C/p\u003E\u003Cp\u003E[thread=134953]Thread tag redirecting to the original thread[/thread] and The post tag redirecting to RedIronCrown\u0027s post\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#0000FF;\u0022\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E\u003Cstrong\u003EWhy say it with text when an image will do\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003ENot all image files contain...images! Using your favorite photo editing or graphics editing software, use the text tool to type in all the text you desire. Then save the image as a PNG file, upload it to an online photo storage site, such as IMGR or PhotoBucket, and use the photo hosting platform\u0027s url for the image. Be sure your image is no taller than roughly 145 pixels - any longer than this and the forum format will cut the bottom off your image. Oh, yeah, by using the photo/graphics editing software, you can combine images and text to create a unique signature and minimize the characters you use by shortening the url.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#0000FF;\u0022\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E\u003Cstrong\u003ETables can help you structure your signature\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EI use a table with four columns with the contents of each cell centered. The script to create a table is fairly simple. I have included all the scripting here used in my signature:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E[TABLE=\u0022width: 950, align: center\u0022]\u003Cbr\u003E[TR]\u003Cbr\u003E[TD][URL=\u0022http://tinyurl.com/nazem9e\u0022][img=http://tinyurl.com/pa7fasa][/URL][/TD]\u003Cbr\u003E[TD]\u003C/pre\u003E\u003Cp\u003E[CENTER][SIZE=1][B]Member of the KSP community since October 2013[/B]\u003Cbr\u003E\u003Cbr\u003E[img=http://tinyurl.com/o4qwn2q]\u003Cbr\u003E[B]Flag of the United Kerbin Republic[/B][/SIZE]\u003Cbr\u003E[/CENTER]\u003C/p\u003E\u003Cp\u003E\u003Cbr\u003E[/TD]\u003Cbr\u003E[TD]\u003C/p\u003E\u003Cp\u003E[CENTER][SIZE=1][B][COLOR=#B22222]Original Forum Threads include[/COLOR][/B]\u003Cbr\u003E\u003Cbr\u003E[thread=132659][B][I]The Highly Educated KSP Player - legends in our own minds?[/I][/B][/thread]\u003Cbr\u003E[thread=134953][B][I]Some helpful hints about signatures[/I][/B][/thread]\u003Cbr\u003E[/SIZE][/CENTER]\u003C/p\u003E\u003Cp\u003E\u003Cbr\u003E[/TD]\u003Cbr\u003E[TD]\u003C/p\u003E\u003Cp\u003E[CENTER][URL=\u0022http://tinyurl.com/pv2bv8t\u0022][img=http://tinyurl.com/oh6clm3][/URL]\u003Cbr\u003E[/CENTER]\u003C/p\u003E\u003Cp\u003E\u003Cbr\u003E[/TD][/TR]\u003Cbr\u003E[/TABLE]\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EBy using images and shortening the urls, the signature consists of 626 characters (including spaces) or 598 characters if spaces are not counted. Between the use of image files and shortened urls, the possibilities for further customization of a signature are nearly limitless.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#0000FF;\u0022\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E\u003Cstrong\u003EUsing tags in your signature\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003ESince I\u0027ve introduced a couple of BBCode tags already and in the example of my signature, you\u0027ve seen a few more examples of the BBCode. There are many different BBCodes that can do everything from [highlight]highlighting key text[/highlight], \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Eadding a line through text\u003C/span\u003E, embedding images, videos, or any other special format you can think of. Since I do not believe in recreating the wheel, I\u0027m going to link to the websites, \u003Ca href=\u0022http://ubuntuforums.org/misc.php?do=bbcode\u0022 rel=\u0022external nofollow\u0022\u003EBBCode List - Ubuntu Forums\u003C/a\u003E and \u003Ca href=\u0022https://www.phpbb.com/community/faq.php?mode=bbcode\u0022 rel=\u0022external nofollow\u0022\u003EphpBB BB Code Guide\u003C/a\u003E. While both sites list the possible BBCode tags that can be used, I have found the \u003Ca href=\u0022https://www.phpbb.com/community/faq.php?mode=bbcode\u0022 rel=\u0022external nofollow\u0022\u003EphpBB BBCode\u003C/a\u003E Guide to be the most useful. \u003C/p\u003E\u003Cp\u003EJust remember that \u003Cstrong\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003EBBCode tags count towards the 1,000 character limit\u003C/span\u003E\u003C/strong\u003E for signatures. With that said, formatting text, such as bold, underline, or Italics adds an additional 7 characters to whatever text you are planning to format (those are fairly short BBCodes)! The more complex you make your signature, the more characters you will use in formatting the signature. \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#B22222;\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cstrong\u003EGetting inspiration for your signature\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#0000FF;\u0022\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E\u003Cstrong\u003EYour forum signature should reflect...you\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EThis sounds like a common sense thing, but I have learned that common sense is not necessarily common. If you spend a few minutes viewing any of the threads, it becomes apparent that there are literally hundreds of variations of signatures used on this forum. Some are very specific and will focus on a particular theme while others seem to be more\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-11T15:26:20Z\u0022 title=\u002211/11/2015 03:26  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 11, 2015\u003C/time\u003E by adsii1970\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-09-23T17:08:06Z","Content":"\n\u003Cp\u003EGreat post adsii1970!\u003C/p\u003E\u003Cp\u003EI\u0027ve moved it over to the Kerbal Network (the forum forum).\u003C/p\u003E\u003Cp\u003ERegarding shortening URLs, if you are linking to a post or thread here on the forums you can use the [noparse] and [thread] tags. Like so:\u003C/p\u003E\u003Cp\u003E[thread=134953]This thread[/thread]\u003C/p\u003E\u003Cp\u003Eand\u003C/p\u003E\u003Cp\u003EThe OP[/noparse]\u003C/p\u003E\u003Cp\u003EGives this:\u003C/p\u003E\u003Cp\u003E[thread=134953]This thread[/thread]\u003C/p\u003E\u003Cp\u003Eand\u003C/p\u003E\u003Cp\u003EThe OP\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-23T17:27:12Z\u0022 title=\u002209/23/2015 05:27  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 23, 2015\u003C/time\u003E by Red Iron Crown\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"adsii1970","CreatedById":89014,"CreatedDateTime":"2015-09-23T17:22:51Z","Content":"\n\u003Cp\u003EThanks for the encouragement. And thank you for letting me know about the {post} and {thread} tags. As I have the time, I want to continue to work on this more... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"monstah","CreatedById":95210,"CreatedDateTime":"2015-09-23T19:24:51Z","Content":"\n\u003Cp\u003EHey, I just might use {post} and {thread}!\u003C/p\u003E\n"}]}