{"TopicId":121581,"ForumId":36,"TopicTitle":"[Idea] Career\u002B","CreatedByName":"Kartoffelkuchen","CreatedById":108501,"CreatedDateTime":"2015-09-24T13:36:47Z","PageNum":1,"Articles":[{"CreatedByName":"Kartoffelkuchen","CreatedById":108501,"CreatedDateTime":"2015-09-24T13:36:47Z","Content":"\n\u003Cp\u003EHello guys, I had an idea, and somehow it doesn\u0027t want to get out of my head.\u003C/p\u003E\u003Cp\u003EThe idea is, that we create a career mode based on the space race, meaning that we have different projects, like Mercury, Gemini, Apollo, STS, etc. We basically \u0022delete\u0022 all stock parts (of course only via a MM config \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E ), and replace those with custom parts we created. Those parts are based on stock parts, but are welded together of many different parts. Meaning that we have a Mercury command pod, based on MK1 pod, but with tiny built in RCS pods, to be able to orient the capsule in space, for example. \u003C/p\u003E\u003Cp\u003EThen, there are stages. Like a Thor-based main stage, and you choose which upper stage you use, based on your mission requirements. So you have stages like Able, Agena etc, which you place on top of the core stage. Newer and more powerful stages can get unlocked via the Techtree.\u003C/p\u003E\u003Cp\u003EThis makes things more challenging, you always have to keep an eye on your budget, which will be very limited, a mission failure could be the end of your game. Also, to make things even more harder, you won\u0027t have SAS modules any more for attitude control in space, only RCS thrusters. No RCS fuel, no chance to point your small Mercury capsule in the right way to fire your (ungimballed) retrorockets for reentry. \u003C/p\u003E\u003Cp\u003EI have no idea if this would be a good idea, but somehow I like the idea. So yeah, if you also like the idea, I will happily try to make something like this! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"montyben101","CreatedById":74173,"CreatedDateTime":"2015-09-24T13:59:38Z","Content":"\n\u003Cp\u003EHmm its a pretty cool idea, I think you should be able to modify the parts though but be limited by budget.\u003C/p\u003E\n"},{"CreatedByName":"Kartoffelkuchen","CreatedById":108501,"CreatedDateTime":"2015-09-24T14:08:22Z","Content":"\n\u003Cp\u003EYeah, the plan is also to give the possibility of \u0022upgrading\u0022 parts. OK, it\u0027s not really upgrading, but that you have, let\u0027s say on one node an engine producing 150kN of thrust with specific impulse of 280 and 305, and then, on a node a bit later, there\u0027s *almost* the same engine again, but it has better stats than the first engine, meaning for example increased thrust, let\u0027s say 165kN and a specific impulse of 295 and 320, or something like that. Best example is the Merlin engine series, with 1A being the main one, which then gets improved with following engines (1C,1D) (OK, this was simplyfied, M1D is basically a completely new engine), or RS-27 engine.\u003C/p\u003E\n"},{"CreatedByName":"MK3424","CreatedById":19932,"CreatedDateTime":"2015-09-24T16:17:58Z","Content":"\n\u003Cp\u003EWell, there is something similar to what you\u0027re talking about: \u003C/p\u003E\u003Cp\u003ETjsnh has made two mods:\u003C/p\u003E\u003Cp\u003ESoviet Space Program Career mode conversion: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/125286-Soviet-Space-Program-career-mode-total-conversion\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/125286-Soviet-Space-Program-career-mode-total-conversion\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnd \u003C/p\u003E\u003Cp\u003ENASA Career mode conversion: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/127398-NASA-Career-mode-total-conversion\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/127398-NASA-Career-mode-total-conversion\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"123nick","CreatedById":27488,"CreatedDateTime":"2015-09-24T21:49:15Z","Content":"\n\u003Cp\u003Eisnt standard ksp already like that? many a time, i had my game ended by 1 bad mission.\u003C/p\u003E\n"}]}