{"TopicId":121672,"ForumId":32,"TopicTitle":"Unknown Easter Egg?","CreatedByName":"BuckarooBanzai","CreatedById":151575,"CreatedDateTime":"2015-09-25T19:47:11Z","PageNum":1,"Articles":[{"CreatedByName":"BuckarooBanzai","CreatedById":151575,"CreatedDateTime":"2015-09-25T19:47:11Z","Content":"\n\u003Cp\u003EOk, I was flying at the Mun the other day, and in a mood to land just about anywhere. I decided to land near and a bit north of the deep gorge that extends out of the eastern side of a large crater. I landed at 5D, 15\u0027, 33\u0022 N // 240D, 11\u0027, 34\u0022 E. There WAS a large boulder field there, having all the appearance of an Egg. Large and small boulders, sparkled on approach like ground scatter until I got down low to see they were objects. When I went on EVA the boulders were insubstantial. I could walk through them and the view from inside was as if they were not there at all. I planted a flag by one, named it Boulder Park. Took a bunch of screenshots and those can be seen on Steam, Splendid Splinter is my Steam name. Now my files were a bit messy. I had accidentally loaded 2 versions and my parts were all duplicated in the VAB, so I decided to clean it up. Saved the game with the new site and reloaded on Steam. NOW the boulders are gone;=( The ship is there. The flag is there. The boulders are simply gone. Was this a glitch? It was a LARGE field of shiny boulders. Was it because I had an old version and they\u0027ve been removed? Anyone ever see these before? I can\u0027t find any post regarding objects like this. I just get the Magic Boulder. I was ready to send a rover up and find the crashed Mun or Bust ship. But now there\u0027s nothing there. I was sure I\u0027d found something, and now it\u0027s gone. Do they move it around like the Burned Woods? hehe \u003Ca href=\u0022http://mmorpg-info.org/fun/burned-woods/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://mmorpg-info.org/fun/burned-woods/\u003C/a\u003E Anyhow, if anyone\u0027s seen this or knows anything about it, I\u0027m curious.\u003C/p\u003E\n"},{"CreatedByName":"Slam_Jones","CreatedById":125101,"CreatedDateTime":"2015-09-25T20:40:28Z","Content":"\n\u003Cp\u003ESounds to me like you\u0027ve discovered ground scatter. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E On Mun, it shows up as boulders. On Kerbin, it shows up (usually) as trees.\u003C/p\u003E\u003Cp\u003EIt tends to only render within a certain range, which can make it seem like they\u0027re popping up out of nowhere. Due to the way it\u0027s set up, they have no collision mesh, which means, yes, you can walk right through them.\u003C/p\u003E\u003Cp\u003ETheoretically, you can find scatter anywhere on the Mun, but maybe it\u0027s restricted to certain biomes/elevations.\u003C/p\u003E\n"},{"CreatedByName":"The_Rocketeer","CreatedById":81727,"CreatedDateTime":"2015-09-25T21:59:50Z","Content":"\n\u003Cp\u003EYes, boulders on Mun are the same as trees/cactus/boulders on Kerbin. I don\u0027t know the rules about where and when they spawn - they\u0027re randomly generated, so they don\u0027t appear in the exact same place each time, but when you return to Mun you\u0027ll often see them sparkling below your craft when in low orbits.\u003C/p\u003E\u003Cp\u003EIt is odd that they inconsistently spawn though.\u003C/p\u003E\n"}]}