{"TopicId":121787,"ForumId":16,"TopicTitle":"Thrust in space! ;)","CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2015-09-27T05:02:22Z","PageNum":1,"Articles":[{"CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2015-09-27T05:02:22Z","Content":"\n\u003Cp\u003EI was in a thread I made about a vehicle I was making. Someone mentioned that now ISP is the only thing to change. Is this how it will work from now on?(I\u0027m assuming he meant thrust remains the same and fuel guzzling changes now) Does this mean that I should always balance my thrust to weight the same for space and ground now? What happened to those values that say max thrust at Seal level are different than space. Is that going away now.\u003C/p\u003E\u003Cp\u003EI\u0027m not certain the person who told me was correct or that I understood what he meant... The game shows ISP changing thrust. So shouldn\u0027t my thrusters get more efficient in space. And why don\u0027t I see this affect when I get into orbit.\u0026lt;- Why I am believing him but not understanding it. It seems as if I get no more out of the thruster in space. Which I was counting on for my designs. Or is this all a glitch that has to be settled later in a patch? I\u0027m a bit confused. What is the current state of thrust in space?!\u003C/p\u003E\u003Cp\u003EEdit: BTW, I came away from what he said like it was some temporary fix so I\u0027m not sure if tutorials would help. I\u0027m trying to find out what it is supposed to be, what it is now, and what they are going to do with it. I\u0027m pretty confused as to my ship design atm because of it. I was designing on one concept, that the thrust increases once and as you get in orbit. But I\u0027m not sure that is happening now or why.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-27T05:07:11Z\u0022 title=\u002209/27/2015 05:07  AM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 27, 2015\u003C/time\u003E by Arugela\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-09-27T05:06:39Z","Content":"\n\u003Cp\u003ENot correct. Thrust to Weight ratio depends on weight. Weight is a function of the force of gravity and if the force of gravity is less, TWR is \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Eless\u003C/span\u003E EDIT: \u003Cstrong\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003Emore\u003C/span\u003E\u003C/strong\u003E (as opposed to mass which the strength of gravitational attraction and remains unchanged). So the further you get from gravity\u0027s center, the less you weigh. As you ascend you get further from Kerbin\u0027s center of gravity.\u003C/p\u003E\u003Cp\u003EThe only way that would change is if Squad decided to abandon physics.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-27T05:09:54Z\u0022 title=\u002209/27/2015 05:09  AM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 27, 2015\u003C/time\u003E by Alshain\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2015-09-27T05:08:27Z","Content":"\n\u003Cp\u003ESo Is the information on the engines still correct as to how they function?\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-09-27T05:09:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Arugela\u0022 data-cite=\u0022Arugela\u0022\u003E\u003Cdiv\u003ESo Is the information on the engines still correct as to how they function?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat information on the engines?\u003C/p\u003E\n"},{"CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2015-09-27T05:16:17Z","Content":"\n\u003Cp\u003EThe information in game when you right click on them.\u003C/p\u003E\n"},{"CreatedByName":"FungusForge","CreatedById":148313,"CreatedDateTime":"2015-09-27T05:18:25Z","Content":"\n\u003Cp\u003EPre-1.0 pressure changed how much fuel engines consumed. So the Ion Engine for example would be stupid inefficient on Kerbin at sea level. Now an engine\u0027s thrust changes (like it would in real life) so taking the Ion Engine for example again, it now produces minimal thrust on Kerbin ASL while consuming the same ratio of fuel it would in space.\u003C/p\u003E\u003Cp\u003EIf you right click on an active engine it should tell you the current thrust. If you run an engine on the launchpad and run the engine in space there should be a thrust increase. Out of all the engines however, the Aerospike is the least effected, much like how a real aerospike rocket has minimal change in ISP.\u003C/p\u003E\u003Cp\u003EUnless you are using asymmetrical engine setups then this shouldn\u0027t really make any difference on the rocket. If you are using asymmetrical engine setups then there will be some noticeable effect on the CoT and may cause minor instability.\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-09-27T05:18:40Z","Content":"\n\u003Cp\u003EOh, yes of course that is accurate. That data is directly populated from the parts config so it is pretty much impossible to be wrong.\u003C/p\u003E\n"},{"CreatedByName":"xtoro","CreatedById":79015,"CreatedDateTime":"2015-09-27T05:36:27Z","Content":"\n\u003Cp\u003EISP is your engine\u0027s efficiency, like Miles per Gallon. Having good or bad MPG has nothing to do with how powerful the engine is.\u003C/p\u003E\u003Cp\u003EThrust changes in space because of the design of the engine\u0027s nozzle. Which depending on its shape, can be optimized for sea-level, high altitude, vacuum, and everything in between. But if an engine is optimized for low altitude launches, it will be less efficient in a vacuum, and vice versa. There is also the presence or lack of external pressure outside the engine nozzle which also affects its thrust. Thrust is always measured by a force such as newtons.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Rocket_engine_nozzle\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Rocket_engine_nozzle\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EDon\u0027t confuse ISP with thrust, or TWR, and don\u0027t confuse weight with mass. These are all different things. Mass never changes, but weight does, depending on the gravitational forces being applied to the ship/object. This is why TWR changes. But it\u0027s still important to know when wanting to launch/land on a planet or moon because you need a ratio of more than 1:1.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-27T05:39:01Z\u0022 title=\u002209/27/2015 05:39  AM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 27, 2015\u003C/time\u003E by xtoro\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Foxster","CreatedById":113764,"CreatedDateTime":"2015-09-27T09:32:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022xtoro\u0022 data-cite=\u0022xtoro\u0022\u003E\u003Cdiv\u003E ...Mass never changes...\u003C/div\u003E\u003C/blockquote\u003EUnless you are going pretty quickly \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-09-27T10:01:22Z","Content":"\n\u003Cp\u003Earugela,\u003C/p\u003E\u003Cp\u003E I think I understand what you\u0027re getting at. It used to be that thrust was constant and fuel flow varied with Isp. That changed with the 1.0 update. Now fuel flow is constant and thrust varies with Isp. If you check the info on the parts you will see 2 figures for thrust and 2 figures for Isp. \u003C/p\u003E\u003Cp\u003E This unnamed other poster is mistaken.\u003C/p\u003E\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"},{"CreatedByName":"Corw","CreatedById":7116,"CreatedDateTime":"2015-09-27T11:11:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022xtoro\u0022 data-cite=\u0022xtoro\u0022\u003E\u003Cdiv\u003EMass never changes, but weight does, depending on the gravitational forces being applied to the ship/object. This is why TWR changes. But it\u0027s still important to know when wanting to launch/land on a planet or moon because you need a ratio of more than 1:1.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is half-true, because the mass of the vehicle changes as it expends fuel. Shedding fuel mass is main factor in TWR change during flight.\u003C/p\u003E\n"},{"CreatedByName":"xtoro","CreatedById":79015,"CreatedDateTime":"2015-09-27T15:20:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Corw\u0022 data-cite=\u0022Corw\u0022\u003E\u003Cdiv\u003EThis is half-true, because the mass of the vehicle changes as it expends fuel. Shedding fuel mass is main factor in TWR change during flight.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell of course. Just like the mass is reduced after you drop off cargo, but I assume 99% of people are aware that spent fuel equal lost mass and it\u0027s not worth mentioning. What I meant was that an object retains the same mass whether it\u0027s in microgravity or under the influence of 10x earth\u0027s gravity...\u003C/p\u003E\n"}]}