{"TopicId":12178,"ForumId":18,"TopicTitle":"A completely unrelated maths problem","CreatedByName":"togfox","CreatedById":17083,"CreatedDateTime":"2012-06-06T04:13:10Z","PageNum":1,"Articles":[{"CreatedByName":"togfox","CreatedById":17083,"CreatedDateTime":"2012-06-06T04:13:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ESusan, Stephen and Stephanie helped their mother to carry home the shopping. Each child had seven pieces of fruit in his or her bag a mixture of apples and oranges. Stephanie had twice as many apples as Susan and fewer oranges than Stephen. Stephen had half as many oranges as Susan. How many apples did he have?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENow, before you post, I know what the answer is ... it\\\u0027s written in small print and upside down on the page of my magazine. I don\\\u0027t want to know what the answer, I want to know how you worked out the answer. This problem, and many derivitives like it, have always escaped me and I\\\u0027d like to understand the technique behind solving such mathematical equations. Thx.\u003C/p\u003E\n"},{"CreatedByName":"Ydoow","CreatedById":10165,"CreatedDateTime":"2012-06-06T04:36:26Z","Content":"\n\u003Cp\u003EI like this. Let\\\u0027s see if I can do it...\u003C/p\u003E\u003Cp\u003ENow that I got more o\\\u0027 dat math educationomatics stuffs, I might take a more algebraic approach than I normally would.\u003C/p\u003E\u003Cp\u003EOkay everyone has 7 fruits total, and there\\\u0027s two different types of fruit in each bag.\u003C/p\u003E\u003Cp\u003Eso x\u002By=7, or better yet,\u003C/p\u003E\u003Cp\u003Ea\u002Bo= 7 (apples/oranges)\u003C/p\u003E\u003Cp\u003Ea\u003Csub\u003Estephanie\u003C/sub\u003E = 2*a\u003Csub\u003Esusan\u003C/sub\u003E (stephanie has twice as many apples as susan)\u003C/p\u003E\u003Cp\u003Eo\u003Csub\u003Estephanie\u003C/sub\u003E \u0026lt; o\u003Csub\u003Estephan\u003C/sub\u003E (stephanie has fewer oranges than stephan)\u003C/p\u003E\u003Cp\u003Eo\u003Csub\u003Estephen\u003C/sub\u003E = .5*o\u003Csub\u003Esusan\u003C/sub\u003E (stephen has half as many oranges as susan)\u003C/p\u003E\u003Cp\u003ENow we put this all together somehow...\u003C/p\u003E\u003Cp\u003EStephanie:\u003C/p\u003E\u003Cp\u003E2a\u003Csub\u003Esusan\u003C/sub\u003E \u002B o = 7\u003C/p\u003E\u003Cp\u003EStephen:\u003C/p\u003E\u003Cp\u003Ea \u002B .5o\u003Csub\u003Esusan\u003C/sub\u003E = 7\u003C/p\u003E\u003Cp\u003ESusan:\u003C/p\u003E\u003Cp\u003Ea \u002B o =7\u003C/p\u003E\u003Cp\u003EAnd then we assume that you must have a full integer worth of fruits (no, 1.5 apples..)\u003C/p\u003E\u003Cp\u003EKnowing that stephen has half as many oranges as susan, and Stephanie has fewer oranges than Stephan, I\\\u0027m left to believe Susan can only have 4 or 6 oranges.\u003C/p\u003E\u003Cp\u003EAny odd number wouldn\\\u0027t make sense, because stephen would have 2.5 or 1.5 oranges.\u003C/p\u003E\u003Cp\u003EAnd if Susan had 2 oranges, then Stephen would have 1 orange, meaning Stephanie would have to have less than 1 orange.\u003C/p\u003E\u003Cp\u003E0 is possible, but then Stephanie must have 2a\u003Csub\u003Esusan\u003C/sub\u003E apples.\u003C/p\u003E\u003Cp\u003EMeaning the equation would have to be\u003C/p\u003E\u003Cp\u003E2a \u002B 0 =7\u003C/p\u003E\u003Cp\u003E2a = 7\u003C/p\u003E\u003Cp\u003E7/2 = a - basically meaning Stephanie would need a non-integer amount of apples.\u003C/p\u003E\u003Cp\u003ESO! Susan has 4, or 6 oranges.\u003C/p\u003E\u003Cp\u003EReally now...I guess it\\\u0027s just guess and check. It\\\u0027s only 50/50 chance of being right.\u003C/p\u003E\u003Cp\u003ESo...let\\\u0027s assume Susan has 4 oranges.\u003C/p\u003E\u003Cp\u003ESusan:\u003C/p\u003E\u003Cp\u003Ea \u002B (4) =7\u003C/p\u003E\u003Cp\u003Ea=3\u003C/p\u003E\u003Cp\u003E3\u002B4=7\u003C/p\u003E\u003Cp\u003EStephen:\u003C/p\u003E\u003Cp\u003Ea \u002B .5(4)\u003Csub\u003Esusan\u003C/sub\u003E = 7\u003C/p\u003E\u003Cp\u003Ea\u002B2=7\u003C/p\u003E\u003Cp\u003Ea=5\u003C/p\u003E\u003Cp\u003E5\u002B2=7\u003C/p\u003E\u003Cp\u003EStephanie:\u003C/p\u003E\u003Cp\u003E2(3)\u003Csub\u003Esusan\u003C/sub\u003E \u002B o\u0026lt;(.5*(4)) = 7\u003C/p\u003E\u003Cp\u003E6\u002B(o\u0026lt;2)=7\u003C/p\u003E\u003Cp\u003Eo=1\u003C/p\u003E\u003Cp\u003E6\u002B1=7\u003C/p\u003E\u003Cp\u003EAnd bam.\u003C/p\u003E\u003Cp\u003EThat sounds right to me.\u003C/p\u003E\u003Cp\u003EI think we all do this in our head, it\\\u0027s just not so explicit (we don\\\u0027t really think a\u002Bo=7, we just push numbers around).\u003C/p\u003E\u003Cp\u003EHonestly, if I didn\\\u0027t have paper, I would normally just guess and check while following the numbers around.\u003C/p\u003E\n"},{"CreatedByName":"togfox","CreatedById":17083,"CreatedDateTime":"2012-06-06T22:22:18Z","Content":"\n\u003Cp\u003EYep - that\\\u0027s right - or so my magazine says when I turn it upside down. I guess working out how many oranges everyone has is as simple as 7 - a.\u003C/p\u003E\n"}]}