{"TopicId":121701,"ForumId":69,"TopicTitle":"Not thrusting during part of an escape orbit","CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2015-09-25T23:30:31Z","PageNum":1,"Articles":[{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2015-09-25T23:30:31Z","Content":"\n\u003Cp\u003ESo, this is a weird one. A \u003Cem\u003Ereally\u003C/em\u003E weird one, so I am looking for pointers. See, some of you might have seen this pic I posted yesterday of me, moving a big potato with lots of patience:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Y6M856Q.png\u0022 alt=\u0022Y6M856Q.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd it all went well, until about when I crossed Mun\u0027s orbit: the [censored] won\u0027t keep thrusting! I mean, I get the engine effects, I get the consumable drain, I get the torque, all indicators show thrust... And yet, the freaking maneuver node shows no change in velocity happening. It seems as if the acceleration was too low to register, or something. So I started experimenting, and ended up redoing the whole capture burn again from periapsis... same thing happened, suddenly I couldn\u0027t move the maneuver any further and the dV readout \u0022froze\u0022. Interestingly enough, at high levels of phsyical timewarp, the thing seems to accelerate, but the whole thing becomes so wonky it\u0027s difficult to say whether it is the usual wonky orbits of oscillating vehicles due to CoM changes, or actual sustained thrust, before you start spinning.\u003C/p\u003E\u003Cp\u003EThe \u003Cem\u003Eonly\u003C/em\u003E thing I can think of, is that this is somehow related to the coordinate system, where I have crossed some boundary where my coordinate changes between timesteps is just the right amount for my acceleration to be ignored as an error or rounded out or something. Because you see, as soon as I let it escape into solar orbit, I again can see progress in the maneuver burns. And when I was thrusting close to periapsis, the same thing. The dev console shows no weird stuff happening (or no weirder than usual). I\u0027m at my wit\u0027s end, and I might just lose 10\u002B hours of gameplay spent in building and flying this mission. So I need your help smart guys! You can take a stab at replicating by loading this savefile, you don\u0027t really need any mods or nothing since I re-saved it (and re-tested) in a stock install. It\u0027s a quicksave, and excuse my colorful language when naming bug-hunting saves:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www./download/485pcw7zfkvkmz1/....sfs\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./download/485pcw7zfkvkmz1/....sfs\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s set up so you just have to load it from the quicksave menu, and start thrusting and see if that maneuver node goes down. Acceleration \u003Cem\u003Eshould\u003C/em\u003E be visible in a short time, I was making 0.015m/s\u003Csup\u003E2\u003C/sup\u003E without issues even with the nuke throttled down to keep up with the refinery output, and that is 0.1 m/s in less than ten seconds, so you will know quickly if things go as wrong as they go for me, every time. Even if you just tell me that maneuver node goes down for you, it would still be a great help, means there is something wrong on my end and I can stop throwing swear words at the game and direct them at myself instead. Thanks for your time in any case!\u003C/p\u003E\u003Cp\u003ERune. Honestly, I am this close to calling \u0022bugs\u0022 and installing hyperedit for the first time in three years. It\u0027s \u003Cem\u003Ethat\u003C/em\u003E frustrating.\u003C/p\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2015-09-26T15:03:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Majorjim\u0022 data-cite=\u0022Majorjim\u0022\u003E\u003Cdiv\u003EHi Rune. Have you tried editing the nukes stats? Upping the thrust in increments. It may tell you if it\u0027s that rounded out issue you mentioned. If so then its just a current game limitation that can be overcome or circumvented.\u003Cp\u003E It\u0027s an easy file edit and even easier to undo. Can\u0027t hurt.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, I tried that today, actually, first 160kN, then \u003Cem\u003E6000\u003C/em\u003EkN on the nuke. Nothing, the maneuver node stays stuck right there, so now I am truly out of ideas, it seems this is not a \u0022I didn\u0027t puck enough thrust and it is getting lost in the rounding\u0022. It was funny to see the nuke hide inside the rest of the ship under the enormous thrust, tough.\u003C/p\u003E\u003Cp\u003ERune. What is not fun is having my career save stuck because of this. Help?\u003C/p\u003E\n"},{"CreatedByName":"Yukon0009","CreatedById":109376,"CreatedDateTime":"2015-09-26T15:18:12Z","Content":"\n\u003Cp\u003EI\u0027d say probably a Klaw bug, reload and see if it happens.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EAlso check you PM inbox\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"Majorjim!","CreatedById":61954,"CreatedDateTime":"2015-09-26T16:55:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rune\u0022 data-cite=\u0022Rune\u0022\u003E\u003Cdiv\u003EYeah, I tried that today, actually, first 160kN, then \u003Cem\u003E6000\u003C/em\u003EkN on the nuke. Nothing, the maneuver node stays stuck right there, so now I am truly out of ideas, it seems this is not a \u0022I didn\u0027t puck enough thrust and it is getting lost in the rounding\u0022. It was funny to see the nuke hide inside the rest of the ship under the enormous thrust, tough.\u003Cp\u003ERune. What is not fun is having my career save stuck because of this. Help?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDamn dude, I\u0027m sorry that didn\u0027t work. \u003C/p\u003E\u003Cp\u003E That was my only idea.. What do you think it could be? A claw bug? It is a Kraken fest that thing.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Yukon0009\u0022 data-cite=\u0022Yukon0009\u0022\u003E\u003Cdiv\u003EI\u0027d say probably a Klaw bug, reload and see if it happens.\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EAlso check you PM inbox\u003C/span\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELOL! I didn\u0027t see you had written the same. If we both think that then that must count for something. Right? \u003C/p\u003E\u003Cp\u003E I wish you luck Rune.\u003C/p\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2015-09-26T19:07:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Yukon0009\u0022 data-cite=\u0022Yukon0009\u0022\u003E\u003Cdiv\u003EI\u0027d say probably a Klaw bug, reload and see if it happens.\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EAlso check you PM inbox\u003C/span\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat do you know, I finally managed to shoehorn it into a captured orbit and complete the last 20 m/s that I needed. I used a combination of rebooting the game about 5 times, upping the nuke thrust to 600 so I could see whether or not I was thrusting soon, and liberally playing with timewarp to take full advantage of the squiggly orbit. Cheaty as hell, but at least now it\u0027s captured, and I can slowly aerobrake it and keep on experimenting with what the hell is going on. I will post it here if I reach any significant conclusions.\u003C/p\u003E\u003Cp\u003EI might be a Klaw bug, but if so it is very weird. It was installation-agnostic, as it happened on both a 100% stock install, and my usual one with all of Claw\u0027s fixes. It seemed to happen after a short while every time, but sometimes it was present form the start, others it would just show up from the second load onwards, or after a period of time. The only thing consistent is that once it appeared, the only way to get the orbit to change involved a restart of the whole game, and sometimes not even that. I even tried releasing the Klaw and redocking, with the ~10mins of frustration fiddling with the pivot aligning the thrust vector that implies!\u003C/p\u003E\u003Cp\u003EOh, and I cleaned my inbox a bit, but I just have your message about the SCF which I would swear I replied to...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Majorjim\u0022 data-cite=\u0022Majorjim\u0022\u003E\u003Cdiv\u003EDamn dude, I\u0027m sorry that didn\u0027t work. \u003Cp\u003E That was my only idea.. What do you think it could be? A claw bug? It is a Kraken fest that thing.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003ELOL! I didn\u0027t see you had written the same. If we both think that then that must count for something. Right? \u003C/p\u003E\u003Cp\u003E I wish you luck Rune.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt \u003Cem\u003Eshort\u003C/em\u003E of worked. As in, not really, but it helped me diagnose when the bug was happening and when it wasn\u0027t. But yeah, apparently the bug itself is thrust-agnostic. And it has something to do with restarting the game. In any case, thanks for the effort!\u003C/p\u003E\u003Cp\u003ERune. At least the save is moving on. It seems asteroid refueling stations will have to wait a bit, tough... the damn Klaw is truly a bugfest.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-26T19:23:53Z\u0022 title=\u002209/26/2015 07:23  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 26, 2015\u003C/time\u003E by Rune\u003C/strong\u003E\n\u003C/span\u003E\n"}]}