{"TopicId":121846,"ForumId":16,"TopicTitle":"Minimal altitude for a stable orbit around airless bodies ?","CreatedByName":"Gaarst","CreatedById":126740,"CreatedDateTime":"2015-09-27T21:46:26Z","PageNum":1,"Articles":[{"CreatedByName":"Gaarst","CreatedById":126740,"CreatedDateTime":"2015-09-27T21:46:26Z","Content":"\n\u003Cp\u003ESo, a while ago, when I sent my first probes to the Jool moons, I managed to put one on orbit of each moon, quite low for some. After doing a few other missions, and therefore warping time a little, I realised the probe orbiting Bop was gone. Due to the shape of Bop, I assumed that the map view did not correspond to the actual surface (like Gilly) and that the probe crashed.\u003C/p\u003E\u003Cp\u003EMore recently in my RSS save, I put a probe in very low orbit around the Moon (50x15km), and the same thing happened: after a while, the probe was gone.\u003C/p\u003E\u003Cp\u003EI\u0027ll add that in both cases, I did orbit the body more than once while focussing the vessel, and I did not crash. Furthermore, while the average surface altitude on the Moon is 8km, I haven\u0027t found any feature reaching 15km (it went maybe up to 10-11km at the borders of the greatest craters) so the lunar probe did not crash with the surface.\u003C/p\u003E\u003Cp\u003ESo, I was wondering if there is a sort of minimal altitude/height below which a probe is considered to crash on the ground ?\u003C/p\u003E\u003Cp\u003EIf so, is there a way to determine that altitude or height above ground ? Maybe using the surface features or radius of the body.\u003C/p\u003E\u003Cp\u003EAlso, does this happen for all airless bodies, or just some of them are glitchy ?\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-09-27T22:26:49Z","Content":"\n\u003Cp\u003EYes actually. The minimum guaranteed safe orbit is just above the altitude of the highest peak. This can usually be found on the wiki\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Bop\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.kerbalspaceprogram.com/wiki/Bop\u003C/a\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThe highest point on Bop is an astounding 21,758 m, marking the highest point above sea level in the \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Kerbol_System\u0022 rel=\u0022external nofollow\u0022\u003EKerbol System\u003C/a\u003E. The point lies at 23.87Ã‚Â° W and 64.57Ã‚Â° N and is as high as \u003Ca href=\u0022https://en.wikipedia.org/wiki/Olympus_Mons\u0022 rel=\u0022external nofollow\u0022\u003EOlympus Mons\u003C/a\u003E on \u003Ca href=\u0022https://en.wikipedia.org/wiki/Mars\u0022 rel=\u0022external nofollow\u0022\u003EMars\u003C/a\u003E.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is dependent on your orbit, on the Mun for example, the highest peak is near the pole, so equatorial orbits can be much lower. But if you stay above that highest peak there is no possible way to hit the body.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-27T22:28:59Z\u0022 title=\u002209/27/2015 10:28  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 27, 2015\u003C/time\u003E by Alshain\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Thatguywholikesionengines","CreatedById":160854,"CreatedDateTime":"2016-06-06T20:47:04Z","Content":"\n\u003Cp\u003E\nWell, if you want eeloo for some reason, if your craft is less than 7 meters in any diameter or width and stuff like that, then 2930 is lowest for equatorial, but i usually go for 3000.\n\u003C/p\u003E\n"},{"CreatedByName":"Hupf","CreatedById":152424,"CreatedDateTime":"2016-06-07T19:44:15Z","Content":"\n\u003Cp\u003E\n\u003Ca href=\u0022http://www.kerbalmaps.com/charts/elevation_inclination/#\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.kerbalmaps.com/charts/elevation_inclination/#\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2016-06-07T20:30:13Z","Content":"\n\u003Cp\u003E\nEven if your orbit is in theory above all the peaks, this can still sometimes happen... I forget what the rules are though... I just avoid really low orbits above airless worlds (and its realistic... such low orbits probably wouldn\u0027t be stable due to increased perturbations from uneven mass concentration of the body you\u0027re orbiting.\n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2016-06-07T21:18:17Z","Content":"\n\u003Cp\u003E\nEspecially with the orbit decay bug that\u0027s in 1.1.2. There is no such thing as a \u0022stable orbit\u0022 currently.\n\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2016-06-08T11:34:37Z","Content":"\n\u003Cp\u003E\nit doesn\u0027t decay on rails\n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2016-06-08T14:45:44Z","Content":"\n\u003Cp\u003E\nNo, it doesn\u0027t. And I don\u0027t think the landing legs deltaV bug happens on rails, either. But regarding the OP\u0027s initial orbit, there is \u003Cstrong\u003E\u003Cem\u003Enothing\u003C/em\u003E\u003C/strong\u003E on the Mun that will ever take you out at 15km, so something funny is going on.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-08T14:52:16Z\u0022 title=\u002206/08/2016 02:52  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 8, 2016\u003C/time\u003E by bewing\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Stoney3K","CreatedById":139954,"CreatedDateTime":"2016-06-09T08:18:54Z","Content":"\n\u003Cp\u003E\nThere is some different logic which determines if an orbit is \u0022stable\u0022 (not hitting anything on the surface) if the craft is on rails. I believe the minimum altitude (ASL) for checking if a craft didn\u0027t smash into the surface when it\u0027s on rails is higher than when the craft is focused.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, there may be some crazy stuff going on when you\u0027re using RSS, since RSS re-purposes the existing bodies in the Kerbol system to act differently.\n\u003C/p\u003E\n"}]}