{"TopicId":121884,"ForumId":44,"TopicTitle":"Macross Missile Spam -\u0026gt; The only way to go","CreatedByName":"SomeGuy12","CreatedById":103022,"CreatedDateTime":"2015-09-28T13:02:52Z","PageNum":1,"Articles":[{"CreatedByName":"SomeGuy12","CreatedById":103022,"CreatedDateTime":"2015-09-28T13:02:52Z","Content":"\n\u003Cp\u003ESo I\u0027ve realized something. If space warships are ever built, and they have missiles as a weapon, unlike on Earth, there\u0027s no reason you cannot send every single missile you have at the enemy at the same time. You would cold launch the missiles, sending them out into space near the launching ships, and they would use RCS to form up into a formation. When ready, every single missile would ignite it\u0027s main engine and hurtle towards the enemy warships simultaneously in order to overwhelm any defenses. \u003C/p\u003E\u003Cp\u003EFor targets where you estimate this would be overkill, you would calculate the optimal number of missiles to eliminate the target and send only those.\u003C/p\u003E\u003Cp\u003EYou can\u0027t do this on earth because missiles can\u0027t just float out in a vacuum near the mother ship, keeping up with it since there is no friction in space. Missiles have to burn fuel to stay in the air, so they have to head towards the enemy right away.\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2015-09-28T13:14:19Z","Content":"\n\u003Cp\u003EAnd the missiles will still get picked off one by one in transit using some sort of a rapid-firing laser. You simply can\u0027t launch enough missiles to overwhelm something that only needs a few ms to destroy a target, and has \u003Cem\u003Ehours\u003C/em\u003E of tracking time.\u003C/p\u003E\u003Cp\u003EUntil we figure out FTL travel, which would make close-range battles viable, the only way to fight in space is at light speed, so that your enemy has zero warning time. That basically means beam weapons.\u003C/p\u003E\n"},{"CreatedByName":"Endersmens","CreatedById":80723,"CreatedDateTime":"2015-09-28T13:25:32Z","Content":"\n\u003Cp\u003EOne way to combat the rapid fire laser taking out missiles would be to have your attacking craft to be in a retrograde orbit, assuming you have excellent guidance systems. Although this takes a lot of planning and a lot of time and a lot of delta-v if you were in a regular orbit.\u003C/p\u003E\n"},{"CreatedByName":"More Boosters","CreatedById":147303,"CreatedDateTime":"2015-09-28T14:32:38Z","Content":"\n\u003Cp\u003EIn space, unless some countermeasures are made (which they will be made, eventually) by the time space warfare becomes a thing, missiles will be wasted space and mass that could be used for lasers.\u003C/p\u003E\n"},{"CreatedByName":"shynung","CreatedById":101096,"CreatedDateTime":"2015-09-28T14:46:37Z","Content":"\n\u003Cp\u003EI\u0027d like to quote myself on this particular topic:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022shynung\u0022 data-cite=\u0022shynung\u0022\u003E\u003Cdiv\u003E...the missile is a \u003Cstrong\u003Elaser-carrying miniature unmanned spaceship\u003C/strong\u003E. It doesn\u0027t have to be right next to the ship it\u0027s looking for, just close enough that light-speed lag is low enough so that quick targeting is possible. Despite the power requirements of laser weapons, it doesn\u0027t need radiators as big a larger ship would, because all it has to do is to pump out one good zap with its laser, and that\u0027s it; destruction of the reactor core or laser emitter/turret immediately afterwards is acceptable. It also doesn\u0027t need propellant to get back to where it came from, so it doesn\u0027t suffer too much from the rocket equation.\u003Cp\u003EAlso, its sensors don\u0027t have to track the target all the time. It can instead receive targeting information from the ship that launched it, or even outright controlled from the launching ship. The sensors and emitters can be buried inside ablative armors able to shrug off whatever sensor-blinder laser the target may have, and pop open via explosive bolts at the moment just before firing. Like that, the vulnerable moments are the time frames between armor popping off and laser firing, and this can be reduced to milliseconds or even microseconds with the right equipment and the right firing sequence.\u003C/p\u003E\u003Cp\u003EHeck, mount several targeting sensors on separate disposable ablative armor fairing, and pop them open before the main laser fairing. Get enough targeting data with these sensors before the target\u0027s anti-sensor lasers blind them, then aim the main laser using this targeting data, while still covered by ablative fairing. This way, when the main laser\u0027s fairing popped off, it\u0027s already aimed at the target, reducing time from pop-off to laser fire even smaller.\u003C/p\u003E\u003Cp\u003ELike this, the only way a target can defend itself is to destroy the missile outright, using lasers meant for engaging other ships. If the target has only a few anti-ship lasers, a laser-missile swarm would ensure a few got close enough to unload a few zaps.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-09-28T15:47:15Z","Content":"\n\u003Cp\u003EBasically, swarm of laser drones, instead of explosive warheads or such.\u003C/p\u003E\u003Cp\u003EAlthough I imagine flak rounds/rockets can still be used as area denial weapons, since they don\u0027t need to be fired directly at the enemy, just in the same orbit to cause a debris field that deny them that orbit.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-28T16:22:33Z\u0022 title=\u002209/28/2015 04:22  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 28, 2015\u003C/time\u003E by RainDreamer\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Shania_L","CreatedById":58975,"CreatedDateTime":"2015-09-28T16:20:02Z","Content":"\n\u003Cp\u003EKinetic energy weapons are still a very viable option, you dont need an explosive or even armour penetration vs a spaceship. As the previous poster mentioned area denial debris clouds, essentially cluster munitions of solid dense matter would be very effective vs thin skinned vessels. You really dont expect spaceships to have thick armour plating do you?\u003C/p\u003E\u003Cp\u003EYou can shoot at a ball bearing with a laser all you like, it can be made reflective enough that a lot of the energy is deflected away and even if you do over heat it, then you just have smaller particles travelling at you just as fast.\u003C/p\u003E\u003Cp\u003EHow about lab grown diamond spheres? Its just crushed up carbon, given enough energy they could be mass produced pretty easy. Light can be deflected or pass straight through, maybe not as much mass as a metal ball, but when it hits at many kmps it really wont matter that much.\u003C/p\u003E\n"},{"CreatedByName":"shynung","CreatedById":101096,"CreatedDateTime":"2015-09-28T16:32:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RainDreamer\u0022 data-cite=\u0022RainDreamer\u0022\u003E\u003Cdiv\u003EBasically, swarm of laser \u003Cstrong\u003Edrones\u003C/strong\u003E, instead of explosive warheads or such.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMore or less. Except that the things we usually call drones (Parrot AR.Drone, MQ-1 Predator) flies back after doing whatever they\u0027re supposed to do. These things don\u0027t, so they\u0027re more akin to cruise missiles or ICBMs.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EAlthough I imagine flak rounds/rockets can still be used as area denial weapons, since they don\u0027t need to be fired directly at the enemy, just in the same orbit to cause a debris field that deny them that orbit.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo, something to act like landmines, except using kinetic energy.\u003C/p\u003E\n"},{"CreatedByName":"0111narwhalz","CreatedById":110660,"CreatedDateTime":"2015-09-28T16:35:48Z","Content":"\n\u003Cp\u003EWho needs ball bearings? Just throw some kitty litter out the lock and then manoeuvre out of the intercept. As long as the kitty litter hits fast enough, it\u0027ll probably do plenty of damage. It\u0027ll also do very widespread damage, being composed of many tiny particles.\u003C/p\u003E\n"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-09-28T16:42:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022shynung\u0022 data-cite=\u0022shynung\u0022\u003E\u003Cdiv\u003EMore or less. Except that the things we usually call drones (Parrot AR.Drone, MQ-1 Predator) flies back after doing whatever they\u0027re supposed to do. These things don\u0027t, so they\u0027re more akin to cruise missiles or ICBMs.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMaybe we call them autonomous disposable weapon platforms? Cause they are not weapons themselves, but platform carrying the weapon that acts autonomously and to be destroyed after its use? Hmm...\u003C/p\u003E\u003Cp\u003EAs war evolves, so does its terminology...\u003C/p\u003E\n"},{"CreatedByName":"Endersmens","CreatedById":80723,"CreatedDateTime":"2015-09-28T16:46:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00220111narwhalz\u0022 data-cite=\u00220111narwhalz\u0022\u003E\u003Cdiv\u003EWho needs ball bearings? Just throw some kitty litter out the lock and then manoeuvre out of the intercept. As long as the kitty litter hits fast enough, it\u0027ll probably do plenty of damage. It\u0027ll also do very widespread damage, being composed of many tiny particles.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EThis just in: ISS goes in to red alert mode after NYAN cat passed in front of the ISS\u0027s orbit, leaving a cloud of kitty litter in it\u0027s wake.\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-09-28T16:48:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Shania_L\u0022 data-cite=\u0022Shania_L\u0022\u003E\u003Cdiv\u003EKinetic energy weapons are still a very viable option, you dont need an explosive or even armour penetration vs a spaceship. As the previous poster mentioned area denial debris clouds, essentially cluster munitions of solid dense matter would be very effective vs thin skinned vessels. You really dont expect spaceships to have thick armour plating do you?\u003Cp\u003EYou can shoot at a ball bearing with a laser all you like, it can be made reflective enough that a lot of the energy is deflected away and even if you do over heat it, then you just have smaller particles travelling at you just as fast.\u003C/p\u003E\u003Cp\u003EHow about lab grown diamond spheres? Its just crushed up carbon, given enough energy they could be mass produced pretty easy. Light can be deflected or pass straight through, maybe not as much mass as a metal ball, but when it hits at many kmps it really wont matter that much.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EKinetic projectile takes extremely long time to travel when comparing to light speed laser. They will just dodge your shot. If you use that, you have to make sure they have nowhere else to dodge to, which means a lot of flak covering all possible orbits, and even then they might just escape the area instead. And if you are intending to capture the location, you have to clean up the place.\u003C/p\u003E\n"},{"CreatedByName":"shynung","CreatedById":101096,"CreatedDateTime":"2015-09-28T16:54:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RainDreamer\u0022 data-cite=\u0022RainDreamer\u0022\u003E\u003Cdiv\u003EMaybe we call them autonomous disposable weapon platforms? Cause they are not weapons themselves, but platform carrying the weapon that acts autonomously and to be destroyed after its use? Hmm...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERegular missiles fit that category. Picture an antitank missile. That slug of TNT can\u0027t fly itself to the tank without its rocket motor, and it can\u0027t hit the tank accurately without its guidance systems.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EAs war evolves, so does its terminology...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E100 years ago, the term \u0027tank\u0027 refers only to liquid containers.\u003C/p\u003E\n"},{"CreatedByName":"wumpus","CreatedById":133850,"CreatedDateTime":"2015-09-28T17:26:42Z","Content":"\n\u003Cp\u003ENote that using beam weapons implies that you can focus your beam past a few light seconds. I don\u0027t think that can be done with current tech (and might run into physical limits as well). See \u003Ca href=\u0022https://what-if.xkcd.com/13/\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://what-if.xkcd.com/13/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThere is a reason that modern weapons are largely based on 15th century gunpowder tech: guns just really work. I\u0027d assume that flinging dumb, high velocity masses at targets would work in \u0022planet wars\u0022 as well. Launchers might be ion-based (for first strike/stealthy launches) or some sort of nuclear rocket for a more rapid launch (note that both could decelerate after launching the rounds.\u003C/p\u003E\u003Cp\u003EEssentially the difference between using slugs and beams is that a beam would simply diffuse the energy across a target while the slug would concentrate the damage in both space and time. Presumably you would have to adjust the density of your slugs to match the target, but it would be far easier to change weapons than to redesign whatever the target is to hide what slug to use.\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-09-28T17:38:56Z","Content":"\n\u003Cp\u003EWith hard X rays and 30 meter focusing arrays, at power outputs equivalent to what we have today at ICF fusion facilities (petawatts, but very short pulses), you\u0027re talking ranges in multiples of AUs... light minutes to light hours...\u003C/p\u003E\u003Cp\u003EWhen your capital ship or death moon can vaporize things from jupiter uring Jupiter\u0027s closest approach, what are you going to do with missiles?\u003C/p\u003E\u003Cp\u003EThe attack is over before you\u0027ve even seen the light from the laser...\u003C/p\u003E\u003Cp\u003EMeanwhile... how much dV do your missiles have? what sort of transfer time will they have to jupiter? can they even make it outside of a launch window?\u003C/p\u003E\u003Cp\u003EA railgun with 5km/s projectile velocity? are you going to retaliate with that? that\u0027s not even enough dV to reach Jupiter from Earth orbit, let alone retaliate outside of a transfer window.\u003C/p\u003E\u003Cp\u003EMassive death rays would win.\u003C/p\u003E\u003Cp\u003EI\u0027m wondering if old battleships are a good approximation.\u003C/p\u003E\u003Cp\u003EThe one with the biggest guns that can reach farthest wins.\u003C/p\u003E\u003Cp\u003EThere is no horizon to hide behind, or another medium to move through (as with aircraft carriers and aircraft).\u003C/p\u003E\u003Cp\u003EIf I\u0027ve got a 5 AU range death ray... you\u0027ll just have to hope I\u0027m careless and don\u0027t notice you until you are very close...\u003C/p\u003E\u003Cp\u003EBut there is no stealth in space... so.... I\u0027ll just keep my death ray well away from Earth, but still well within striking range\u003C/p\u003E\n"},{"CreatedByName":"J.Random","CreatedById":63332,"CreatedDateTime":"2015-09-28T17:42:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SomeGuy12\u0022 data-cite=\u0022SomeGuy12\u0022\u003E\u003Cdiv\u003EYou can\u0027t do this on earth because missiles can\u0027t just float out in a vacuum near the mother ship, keeping up with it since there is no friction in space. Missiles have to burn fuel to stay in the air, so they have to head towards the enemy right away.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EStarting the second Iraq campaign, US navy did exactly that. They\u0027ve used more than 300 tomahawks for a simultaneous strike on all important infrastructure objects and air defence targets. Launching from multiple ships scattered around Persian Gulf and Red sea, aiming at different targets at greatly varying distances, they\u0027ve had to time launches carefully to make hits more or less simultaneous, and they did.\u003C/p\u003E\u003Cp\u003ENot only cruise missile launches, but unguided artillery strikes can be done this way. All you need to do is to time it right, in accordance with distances to targets and shells\u0027 flight time to each other.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-28T17:45:39Z\u0022 title=\u002209/28/2015 05:45  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 28, 2015\u003C/time\u003E by J.Random\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2015-09-28T18:22:13Z","Content":"\n\u003Cp\u003EProblem is to focus hard x-ray, you can focus UV pretty easy. \u003C/p\u003E\u003Cp\u003EOne nice tricks might be to launch an mirror, or place them in strategic orbits, yes you can still not take the mirror missile to close but it should be easier to get close enough to the target than a warship low mass make it easier to zigzag faster, you are also an smaller target.\u003C/p\u003E\u003Cp\u003EAs a mine cover the mirror with an balloon of some low reflecting surface and it would not be trivial to spot in orbit. \u003C/p\u003E\u003Cp\u003EOn activate you Pop the balloon who also unfolds the mirror, now you start the engine to make you harder to hit from some lightsecunds away while you aim, your ship shoot after some set time who the mirror know.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022J.Random\u0022 data-cite=\u0022J.Random\u0022\u003E\u003Cdiv\u003EStarting the second Iraq campaign, US navy did exactly that. They\u0027ve used more than 300 tomahawks for a simultaneous strike on all important infrastructure objects and air defence targets. Launching from multiple ships scattered around Persian Gulf and Red sea, aiming at different targets at greatly varying distances, they\u0027ve had to time launches carefully to make hits more or less simultaneous, and they did.\u003Cp\u003ENot only cruise missile launches, but unguided artillery strikes can be done this way. All you need to do is to time it right, in accordance with distances to targets and shells\u0027 flight time to each other.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes its best to use maximum firepower if you can. Multiple benefits: surprise, harder to shoot down so many incoming it also disrupt the enemy more.\u003C/p\u003E\u003Cp\u003EYou can often not do it for maximum effect, you don\u0027t have unlimited gun tubes, rocket launcher of bombers. \u003C/p\u003E\u003Cp\u003EAgainst a single target you don\u0027t want to use to much ammo, as you have limited, that about the next target, that is the first was decoys.\u003C/p\u003E\n"},{"CreatedByName":"Mazon Del","CreatedById":32991,"CreatedDateTime":"2015-09-28T18:35:17Z","Content":"\n\u003Cp\u003EI have made a point in some long previous post on this topic, it was like 2 pages long of text so I\u0027ll just summarize it. In short, your objective in space combat is to ensure that the enemy cannot carry out their objective, whatever that might be or whatever you think it might be. One way to do this is to destroy the ship\u0027s ability to function. Another way is to remove the ships ability to reach its target, regardless of the level of ship functionality.\u003C/p\u003E\u003Cp\u003ESo here\u0027s how it goes. Over any appreciable distance (LEO/NEO is too close for this, but starting to get out to lunar distances and beyond this argument applies), pure ballistics are pointless. The amount of effort necessary by the enemy to dodge your shots relative to the cost to you in using these weapons strictly favors them, additionally just because you have a railgun does not mean you can actually reach the target even if they did not dodge, it is a question of the dV imparted onto the shot in that you might not have enough to reach their orbital path. Missiles are of increasingly little worth as distance increases. This is largely because we get back to the question of dV. If you have a missile capable of sending a several hundred pound warhead (regardless of nuke, sandcaster, or laser emission warhead), you are loading up on a probably literally ton of mass onto your warship. Plus, at these sorts of ranges the enemy warship is favored due to an interesting effect. They need to not be hit by the missile, but the missile must take action to hit them. Ergo, they have an effective FTL knowledge of what the missile\u0027s actions are going to be in terms of movement (IE: If we nudge the ship this way, in 1.6 seconds when it sees that, it has to move in THAT direction otherwise it will have to spend its fuel inefficiently later). The defending ship has likely hours and days of time it can spend toying with the missile either trying to shoot it down or making it waste its fuel until it can no longer intercept the ship.\u003C/p\u003E\u003Cp\u003ESo finally we get to lasers. Lasers have a bunch of obvious advantages such as the speed of light, low mass, etc, as well as several obvious downsides in that it generates heat and has focusing difficulties over long range. As an extra note, the greater the energy density in your beam, the more pronounced the light repulsion effect will be (photons try very halfheartedly to push away from other nearby photons), so with a powerful enough laser even if you had a perfectly linear beam, it would start to spread out anyway. That said, there are a bunch of games you can play with it, but the REAL effect you get with lasers is heat deposition. You do not need to puncture an enemies hull in order to disable them from doing their job. You just need to heat them up. TLDR: As the temperature rises the crew has a series of problems in ascending order: Crew health, fuel temperature, component health. Generally speaking the human crew is unnecessary for whatever the end task is, so they might decide to sacrifice themselves and have the ship continue on automatic. The next problem the ship ends up having is that the fuel is likely to be some liquid or another, as with most things as it heats up it expands. When the pressure starts getting too bad (which is likely, but not guaranteed, to happen at a lower temperature than other electrical failures) either the ship will need to vent/use the fuel (reducing its future ability to change vector to dodge additional later attacks) or it will let the pressure build until rupture. Eventually the fuel situation will reach a point where the ship can no longer maneuver and still reach its destination, meaning that either they break off the attack and/or surrender, or they go ballistic and are easily taken out by the one plinker of a railgun that you should have on board just in case you are in this situation (or in low orbit around somebody).\u003C/p\u003E\u003Cp\u003EAnd yes, this is still a summarized version.\u003C/p\u003E\n"},{"CreatedByName":"SomeGuy12","CreatedById":103022,"CreatedDateTime":"2015-09-28T19:55:04Z","Content":"\n\u003Cp\u003EBomb pumped X-rays, or there is some kind of nuclear shotgun round. Both would need a missile to deploy the weapon since obviously the vehicle that uses it will be destroyed by the nuke going off. You might be able to set off the X-ray effect or the nuclear shotgun round outside the range of the enemy laser point defense. \u003C/p\u003E\u003Cp\u003EAnother option is you move a warship to extreme laser range of the enemy warship and it launches missiles. See, at extreme laser range, laser mirrors themselves are fragile because their coatings are only tuned for an exact frequency. So the enemy warship is forced to uncover it\u0027s laser to fire at the missiles, but if it does that, it\u0027s laser mirrors get zapped. You could use missiles to force a decision this way.\u003C/p\u003E\u003Cp\u003EI think missiles might have their place for a while. X-rays are hard to focus as mirrors don\u0027t even work. Sure, eventually, it does sound like there will be nothing but really power lasers in kilometer\u002B mountings. An enormous warship will be to carry just 1 laser.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-28T19:57:09Z\u0022 title=\u002209/28/2015 07:57  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 28, 2015\u003C/time\u003E by SomeGuy12\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Mazon Del","CreatedById":32991,"CreatedDateTime":"2015-09-28T20:16:24Z","Content":"\n\u003Cp\u003EThe problem with missiles simply is that they take far too long to reach their target over any appreciable distance. If you are in a close enough orbit to each other, then sure missiles and railguns can do a variety of things, but bomb pumped x-ray emitters (a-la Honor Harrington\u0027s bread and butter) don\u0027t really actually have a whole lot of range in reality. Several miles to be sure, maybe even a few tens of miles, but over the distances and closing speeds likely involved that\u0027s still a bullseye. Plus, we have a wonderful tech that we can use for the laser mirrors. Deployable foil mirrors, the US uses them for spy satellite telescope mirrors. You set one up, use it till it starts getting inefficient (too warped, holed, etc) and then pop another one out. They are about as efficient to store as solar sails are, and weigh just as much. Though now you get also into a resource war of using said mirrors as defense AND offense.\u003C/p\u003E\n"},{"CreatedByName":"Dedjal","CreatedById":57220,"CreatedDateTime":"2015-09-28T20:26:03Z","Content":"\n\u003Cp\u003EPlace mirrors on missile, watch the enemy panic when their super efficient flack laser does null.\u003C/p\u003E\n"},{"CreatedByName":"SomeGuy12","CreatedById":103022,"CreatedDateTime":"2015-09-28T20:58:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mazon Del\u0022 data-cite=\u0022Mazon Del\u0022\u003E\u003Cdiv\u003EThe problem with missiles simply is that they take far too long to reach their target over any appreciable distance. If you are in a close enough orbit to each other, then sure missiles and railguns can do a variety of things, but bomb pumped x-ray emitters (a-la Honor Harrington\u0027s bread and butter) don\u0027t really actually have a whole lot of range in reality. Several miles to be sure, maybe even a few tens of miles, but over the distances and closing speeds likely involved that\u0027s still a bullseye. Plus, we have a wonderful tech that we can use for the laser mirrors. Deployable foil mirrors, the US uses them for spy satellite telescope mirrors. You set one up, use it till it starts getting inefficient (too warped, holed, etc) and then pop another one out. They are about as efficient to store as solar sails are, and weigh just as much. Though now you get also into a resource war of using said mirrors as defense AND offense.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI dunno...It kind of sounds to me like you are going to need the mirror to be in a rigid mount (because your ship is under thrust in a battle. If you are stationary, someone could fire a shotgun kinetic round of tiny hypervelocity pellets. You have to be always under thrust juking sideways, and changing which direction you are juking to not get hit)\u003C/p\u003E\u003Cp\u003EThe rigid mounted mirror is presumably going to contain thousands of tiny micro adjustment devices, probably some kind of wire that shrinks slightly when exposed to electric current or something, mounting on the back side of the mirror. The mirror is probably actively cooled as well, using some kind of vibration-free MHD coolant pump system. \u003C/p\u003E\u003Cp\u003EThis is a lot of gear, more than you can throw out into space. You need all this equipment - the beam power of a laser mirror is enormous, measured in megawatts per square meter. As it heats during firing, you need to be continually adjusting the mirror to keep the focal spot at the target as small as possible. This is also why the mirror has to be cooled, since otherwise it will eventually overheat.\u003C/p\u003E\u003Cp\u003EOh, and to deal with missiles, it may have to slew relatively violently between targets located several degrees apart. \u003C/p\u003E\u003Cp\u003EIt all depends on assumptions. I\u0027m assuming a \u0022plausible mid-future\u0022 where the mirrors are only 5 to 10 meters across, limiting beam range to only a few thousand kilometers. Missiles can have closing speeds above 20 kilometers/second, higher if the firing ship uses it\u0027s high efficiency fusion drive to get a firing pass with a closing speed of 100 kps or more. That gives you a lot less time to react. In addition, in some engagements the firing ship or another warship has it\u0027s own lasers, within beam range of the victim warship. Victim warship unfurls delicate 5-10 meter, actively cooled mirrors, and the other warship burns off their outer coating, taking them out of the battle.\u003C/p\u003E\u003Cp\u003EI can see repairing the minor damage to the mirror - just a single molecule layer has been ablated off - mid battle, by replacing the mirror segments or even some kind of nanotechnology repair print head that moves over the mirror, fixing it. It\u0027s going to take time to do this, however, and if maximum beam range is 3000 kilometers and the missiles are closing at 10 kps, you have only 5 minutes.\u003C/p\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2015-09-28T21:27:07Z","Content":"\n\u003Cp\u003EI\u0027m glad to see our last discussion in space warfare enlightened a lot of people on how, given the distances involved, any kind of non-relativistic kinetics is completely outclassed by a decent laser system. And relativistic kinetics are complete sci-fi... Anyhow, one tiny thing the laser proponents are forgetting is angular precision limitations: lasers are unlikely to get consistent hits much farther than a few thousand kms to a few light seconds on account of that, given current technology and/or reasonable extensions of it.\u003C/p\u003E\u003Cp\u003EBut really, the bit that you are all forgetting is that a space battle will be a battle for sensor dominance. You can\u0027t fire at what you can\u0027t see! Since the dominating weapon will be lasers due to their speed-of-light nature, and the dominant sensors will be optical, because it\u0027s the one thing you can\u0027t hide from, I posit that once a ship is blinded, and it can\u0027t target, it is defeated. And that \u003Cem\u003Ewill\u003C/em\u003E happen long before the range drops below effective \u0022kill range\u0022, because it takes MUCH less energy, much less concentrated, to fry a sensor than to ablate material. Therefore the whole battle is decided when one side gets sensor dominance, by frying the optical sensors of the other with they dispersed beams, at the maximum range they can get a reliable lock on the other ship. The rest is just mop-up operations, either by closing range so you can ablate them to death, or deploying cheap kinetic interceptors.\u003C/p\u003E\u003Cp\u003ERune. Check out the last thread on space warfare for \u003Cem\u003Ea lot\u003C/em\u003E of discussions on \u0022lasers vs kinetics\u0022, and even the inevitable discussion of \u0022stealth in space\u0022.\u003C/p\u003E\n"},{"CreatedByName":"SomeGuy12","CreatedById":103022,"CreatedDateTime":"2015-09-28T21:36:33Z","Content":"\n\u003Cp\u003ERune...not this crap again. No stealth in space, and any competent space warship commander will have dozens of backup sensor systems and will deploy a fleet of drone spacecraft, far from the battle, that all also have sensors. They will, at a minimum, scan 100% of the sky in infrared at least once a minute so you cannot be surprised by anything under thrust. The drone spacecraft sensor net will all relay their data to the mothership, and will also give you views from other angles, so even if someone manages to mask their emissions in a narrow cone, they will be seen still. \u003C/p\u003E\u003Cp\u003EIt\u0027s just not gonna happen. The only \u0022stealth\u0022 that is plausible is that if you approach a planet and enter low orbit, someone could launch from the far side and come after you. You wouldn\u0027t know about the launch vehicles because you can hide on a planet with the mass of the planet and the planet\u0027s atmosphere to act like heat sinks and to scramble IR signals.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-09-28T21:38:10Z","Content":"\n\u003Cp\u003EMissile spam should work if you can convince your opponent to pull in their radiators, the objective being to overload their heat dissipation/sink ability when their laser PDS goes nuts on the targets. Submunitions, drones, x-ray lasers, etc... just make the PDS work even harder/hotter.\u003C/p\u003E\n"}]}