{"TopicId":121876,"ForumId":16,"TopicTitle":"How to align Wheels with landing struts ?","CreatedByName":"Stigy","CreatedById":151508,"CreatedDateTime":"2015-09-28T08:35:43Z","PageNum":1,"Articles":[{"CreatedByName":"Stigy","CreatedById":151508,"CreatedDateTime":"2015-09-28T08:35:43Z","Content":"\n\u003Cp\u003EI\u0027m building my third surface base. I always have had a problem to align wheels of my construction vehicles witch struts of the buildings. It\u0027s necessary to align these two - otherwise docking ports on vehicles and buildings will not align. The main problem is suspension of vehicles working differently under various loads. Buildings usually keep their height when I lock suspension (unless the suspension is overloaded). So do You have any idea or trick how to measure these stuff in VAB without hours of tests ?\u003C/p\u003E\u003Cp\u003EThx in advance.\u003C/p\u003E\n"},{"CreatedByName":"Highguard","CreatedById":150696,"CreatedDateTime":"2015-09-28T12:33:30Z","Content":"\n\u003Cp\u003ENo, the routine of base design goes like this:\u003C/p\u003E\u003Cp\u003E1) Spend hours getting ports aligned.\u003C/p\u003E\u003Cp\u003E2) Spend more hours getting ports aligned because of suspension differences.\u003C/p\u003E\u003Cp\u003E3) Fail to dock ports because the landing zone is not perfectly flat (co-planar).\u003C/p\u003E\u003Cp\u003E4) Use the claw instead of ports.\u003C/p\u003E\u003Cp\u003E5) Suffer Kraken attacks.\u003C/p\u003E\u003Cp\u003EWhich means I have a much lower level of patience than many people, who do build wonderful bases. My view is that they are much more trouble than they are ever worth without ...\u003C/p\u003E\u003Cp\u003E6) Give up and install KIS/KAS so you can connect parts without docking.\u003C/p\u003E\n"},{"CreatedByName":"SpeedDaemon","CreatedById":38448,"CreatedDateTime":"2015-09-28T14:09:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Highguard\u0022 data-cite=\u0022Highguard\u0022\u003E\u003Cdiv\u003ENo, the routine of base design goes like this:\u003Cp\u003E6) Give up and install KIS/KAS so you can connect parts without docking.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E^--- Best option\u003C/p\u003E\u003Cp\u003EOtherwise, you can try adding landing struts to your rovers, placed the same relative to the docking port as those on the station. Then drive up and align the ports, then extend the struts to bring the rover up to the proper level.\u003C/p\u003E\u003Cp\u003EYou still have the \u0022it isn\u0027t totally flat\u0022 problem, though.\u003C/p\u003E\n"},{"CreatedByName":"Stigy","CreatedById":151508,"CreatedDateTime":"2015-09-28T22:36:16Z","Content":"\n\u003Cp\u003EOk then. I must admit it\u0027s not easy, but it was some kind of challenge for me. I\u0027ve constructed rovers with struts, landing wheels and more than one fuel tanks - I\u0027ve balanced them with fuel pumped, from rear tank to front one and back - this way i can align any ports in reasonably non flat surface... For balance the best are Ore tanks because they are heavy - and affects your rover really noticeably. But still - you have to do some tests on your \u0022playground\u0022. Without \u0022revert flight\u0022 and \u0022recover vessel\u0022 options my base would look like a junkyard.\u003C/p\u003E\n"},{"CreatedByName":"cerberusti","CreatedById":89638,"CreatedDateTime":"2015-09-29T01:17:49Z","Content":"\n\u003Cp\u003EIf you really have trouble, put a small engine under the docking port. This will let you take weight off the suspension to get to the height you need (especially effective on low gravity worlds, where you can get away with a very small engine for the mass).\u003C/p\u003E\n"}]}