{"TopicId":121943,"ForumId":70,"TopicTitle":"Game State not the same when I last left","CreatedByName":"gamerscircle","CreatedById":151261,"CreatedDateTime":"2015-09-29T06:37:29Z","PageNum":1,"Articles":[{"CreatedByName":"gamerscircle","CreatedById":151261,"CreatedDateTime":"2015-09-29T06:37:29Z","Content":"\n\u003Cp\u003EI am sure that this might be mod related, but since I am new and not sure what I options might be, I thought I would post a message and see what folks have to suggest.\u003C/p\u003E\u003Cp\u003EI played about 8 hrs of KSP, lots of flying, building, etc. etc. There was no crashes and I did an F5 before I left for a break and when I came back to the same game and loaded it up. When I went to the space center [so that I could get to my space station], everything that I had ever put in orbit including debris was gone.\u003C/p\u003E\u003Cp\u003EThe kerbals that were in ships and stations were \u0022missing in action\u0022\u003C/p\u003E\u003Cp\u003EThank you in advance for ideas.\u003C/p\u003E\u003Cp\u003E-Andy\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-09-29T06:51:49Z","Content":"\n\u003Cp\u003EEw, that does not sound pleasant.\u003C/p\u003E\u003Cp\u003EF5 does not save over your default save file, it creates a new one. I would suggest you do this:\u003C/p\u003E\u003Cp\u003E1) Locate your persistent file. It will be named persistent.sfs in a folder off of your ksp folder named saves\\\u0026lt;yoursavename\u0026gt;\\ BACK THIS FILE UP.\u003C/p\u003E\u003Cp\u003E2) Load the game, and at the space center hit ESC and select \u0022load\u0022\u003C/p\u003E\u003Cp\u003E3) Select \u0022quicksave\u0022 from that menu. This is the file you created when you hit F5.\u003C/p\u003E\u003Cp\u003E4) If everything is fine, you\u0027re good. If not... Ew.\u003C/p\u003E\u003Cp\u003EDo you use Kerbal Alarm Clock? It makes tons of backups when you use the \u0022jump to\u0022 feature. You could try loading those as well instead of the Quicksave you loaded in step 3.\u003C/p\u003E\n"}]}