{"TopicId":122161,"ForumId":16,"TopicTitle":"wanna replay KSP - addon suggestions?","CreatedByName":"SoWeMeetAgain","CreatedById":145256,"CreatedDateTime":"2015-10-02T14:41:55Z","PageNum":1,"Articles":[{"CreatedByName":"SoWeMeetAgain","CreatedById":145256,"CreatedDateTime":"2015-10-02T14:41:55Z","Content":"\n\u003Cp\u003EHello everyone,\u003C/p\u003E\u003Cp\u003EI want to replay KSP but I don\u0027t want to do the exact same thing again. The most fun thing for me is to figure out new stuff.\u003C/p\u003E\u003Cp\u003EThe last run I ended because my spaceship parts I wanted to assemble in orbit didn\u0027t fit ... even though I had used the connectors as a prefab so they were 100% the same distance blabla.\u003C/p\u003E\u003Cp\u003EAnyways, I know there are some mods out there that redesign the career mode, all new contracts, maybe even start unmanned and such. But which ones are good? Which things work well together?\u003C/p\u003E\u003Cp\u003EHas anyone played several and can give me tips which things are good?\u003C/p\u003E\u003Cp\u003EIs there maybe a site where people vote on mods with a star system or something?\u003C/p\u003E\u003Cp\u003Echeers,\u003C/p\u003E\u003Cp\u003ESoWe\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-05T10:02:21Z\u0022 title=\u002210/05/2015 10:02  AM\u0022 data-short=\u00228 yr\u0022\u003EOctober 5, 2015\u003C/time\u003E by SoWeMeetAgain\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"mattssheep4","CreatedById":146984,"CreatedDateTime":"2015-10-02T15:02:32Z","Content":"\n\u003Cp\u003EI recently started as save with the Engineering Tech Tree mod, and all the suggested mods that can go with it. These include Interstellar, FASA, Firespitter, KWRocketry, and a few others I don\u0027t remember off the top of my head. I also suggest Kerbal Alarm Clock and Kerbal Engineer Redux. This setup makes for a very interesting game with lots of options for tech tree unlocking and rocket building, and other fun stuff. I added TAC Life Support to this, you might consider that as well.\u003C/p\u003E\n"},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2015-10-02T15:02:35Z","Content":"\n\u003Cp\u003ENot sure I understand how to \u0027replay\u0027 a game with no ending \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E But assuming you mean you\u0027re looking for a fresh start, I\u0027d consider primarily suggest \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/114092-1-0-4-Kopernicus-New-Horizons-v1-6-5-1-07Sept15-More-polish!\u0022 rel=\u0022external nofollow\u0022\u003ENew Horizons\u003C/a\u003E for a nice change of pace if you\u0027re used to the stock system.\u003C/p\u003E\u003Cp\u003ETo draw the game out longer, drop your science income to 10-20%, get Community Tech Tree, and fill it with things that you personally enjoy, e.g. Space Y, Atomic Age, Near Future, Infernal Robotics, MKII Expansion - whatever floats your boat really. A new stack of mods each career will generally give you a pretty different focus and play style \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"mattssheep4","CreatedById":146984,"CreatedDateTime":"2015-10-02T15:07:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022eddiew\u0022 data-cite=\u0022eddiew\u0022\u003E\u003Cdiv\u003ENot sure I understand how to \u0027replay\u0027 a game with no ending \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E But assuming you mean you\u0027re looking for a fresh start, I\u0027d consider primarily suggest \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/114092-1-0-4-Kopernicus-New-Horizons-v1-6-5-1-07Sept15-More-polish!\u0022 rel=\u0022external nofollow\u0022\u003ENew Horizons\u003C/a\u003E for a nice change of pace if you\u0027re used to the stock system.\u003Cp\u003ETo draw the game out longer, drop your science income to 10-20%, get Community Tech Tree, and fill it with things that you personally enjoy, e.g. Space Y, Atomic Age, Near Future, Infernal Robotics, MKII Expansion - whatever floats your boat really. A new stack of mods each career will generally give you a pretty different focus and play style \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"jman508","CreatedById":122550,"CreatedDateTime":"2015-10-02T15:31:13Z","Content":"\n\u003Cp\u003EWell, ive been out of the forums for a long time and the game for about the same period of time and i was browsing around on google images for ksp ssto\u0027s and found this really cool one and i thought \u0022hey ill try to remake it!\u0022 since the thing looked like it was more than a few versions old. as for mods i was never one of those players i would always download a bunch of mods and then really think they made the game too easy in some ways (i can be considered a purist but i do think some modes do add alot to the game and do improve it from alot of angles) \u003C/p\u003E\u003Cp\u003Ebut now the said ssto i remade is now on course for jool to assist in building a station and flagging every jool moon.\u003C/p\u003E\u003Cp\u003Eone mod that i have been considering for a long time now would have to be RSS i haven\u0027t heard any recent info on it some dont yell at me if my infos wrong but if im correct it upscales all the planets so that they\u0027re the correct size and names and such. so if you\u0027re a hardcore player (along with your comp) i would suggest getting it if you want something new and highly challenging.\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-10-02T21:29:56Z","Content":"\n\u003Cp\u003E\u002B1 to New Horizons, it completely rejiggers the solar system (and makes Kerbin a moon of a gas giant), which really changes how the game goes. Lots of new challenges.\u003C/p\u003E\u003Cp\u003EAnother option instead of New Horizons is Outer Planets Mod, which leaves the existing solar system alone but adds more planets out on the fringes (analogs of Saturn, Uranus, Neptune, Pluto). Very nicely and professionally done.\u003C/p\u003E\u003Cp\u003EIf you\u0027re looking to change gameplay, consider adding RemoteTech, which makes flying unmanned probes harder: you can\u0027t control them unless you have LOS back to KSC, and there\u0027s lightspeed delay in controlling them. It means you need to build networks of communications satellites, which is pretty cool.\u003C/p\u003E\u003Cp\u003EAnother gameplay option is to add TAC Life Support, which means pretty much what it sounds like. Your kerbals consume food, water, and oxygen, and will die if they run out. So you have to design your missions with enough supplies.\u003C/p\u003E\u003Cp\u003EExtraplanetary Launchpads adds the ability to build rockets off-world. I played a game where I set myself a rule that as soon as I got enough hardware and tech to be able to mine \u0026amp; manufacture off-world, don\u0027t launch anything else from Kerbin and expand completely from my base on Minmus. That was fun.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-10-02T23:05:11Z","Content":"\n\u003Cp\u003EYet another vote for New Horizons, awesome mod. With a caveat - it\u0027s best if you\u0027re already decent at interplanetary transfers.\u003C/p\u003E\n"}]}