{"TopicId":122225,"ForumId":16,"TopicTitle":"Rocket returns to 90 degrees and reverses direction..?","CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2015-10-03T18:22:31Z","PageNum":1,"Articles":[{"CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2015-10-03T18:22:31Z","Content":"\n\u003Cp\u003EI fly for a bit and start to get around 10km in a very large rocket. I\u0027m flying around 60 degrees with the indicator at about 45 degrees. After a while the ship uncontrollably starts going the other direction. I can\u0027t figure out why.. It eventually returns directly the opposite direction to 90 degrees then goes the other way and I loose all control. I can\u0027t seem to isolate it. Has anyone run into this problem. I\u0027m not sure if it\u0027s an engine issue or some weird structural issue or what. I\u0027m lost atm. The ship is very symmetrical. So I\u0027m not really understanding where the force is coming from. I think the fuel is draining evenly. So I don\u0027t think that is it. And it has happened on several version of the craft. I have big boosters on and it doesn\u0027t do this without them. But I don\u0027t know if that is the boosters or the boosters bringing the issue out and it isn\u0027t seen because of other issues...\u003C/p\u003E\u003Cp\u003EIf I put SAS on retrograde I can kind of stop it but It\u0027s hard to figure out. If I do maintain direction it seems to slowly rotate while doing so... I\u0027m pretty sure the engines are even though. Unless they are misplaced up farther. The only other thing I can think of is that they are so stacked up that they are blocking each other randomly and throwing off the general direction of thrust somehow.\u003C/p\u003E\u003Cp\u003EWarning: 1100\u002B parts ship.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www./download/e3a6y81oaey541n/The_Orion_Mining_Spaceship_Basic.craft\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./download/e3a6y81oaey541n/The_Orion_Mining_Spaceship_Basic.craft\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EAlso, does anyone know which way an arrow should be pointing on a decoupler? Away from the main craft of towards it. I\u0022m using TR-38-D.\u003C/p\u003E\u003Cp\u003EEdit: I just noticed. As my fuel drops and my velocity increases, even though they are strutted, they seems to be moving wildly around. I had put struts to stop this. But this doesn\u0027t necessarily explain why it goes in one direction sometimes. Or does it? Maybe the boosters aren\u0027t stable on their own... I can\u0027t tell but some of the struts may have broken. It\u0027s night time while I\u0027m testing it. But the problems primarily start while the struts are definitely still attached.\u003C/p\u003E\u003Cp\u003EEdit2: I\u0027m adding another layer of those struts between the boosters on the upper tanks to see if it helps. Hopefully it works, but I don\u0027t think it\u0027s the whole problem. Also, I\u0027m doing a tear down and rebuilding the middle and engine sections soon. So I can get rid of lots of little structural issues this thing has and test out a new layout to connect the middle and back sections. Hopefully that make sit more sound structurally.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-15T04:41:23Z\u0022 title=\u002210/15/2015 04:41  AM\u0022 data-short=\u00228 yr\u0022\u003EOctober 15, 2015\u003C/time\u003E by Arugela\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Slam_Jones","CreatedById":125101,"CreatedDateTime":"2015-10-03T18:24:48Z","Content":"\n\u003Cp\u003EYou may want to try slapping some more Reaction Wheels on it, or place some stabilizing fins at the bottom of each stage. just make sure the bottom set of fins are the largest.\u003C/p\u003E\u003Cp\u003EReaction wheels will help it keep pointed the direction you want, and the fins would help make sure the rear end stays at the rear (kinda like the feathers on an arrow).\u003C/p\u003E\u003Cp\u003EAs far as I know (and I could be wrong) that issue is usually caused by the payload becoming heavier than the booster (due to shifting CoM from burning fuel), which makes it want to flip around.\u003C/p\u003E\n"},{"CreatedByName":"Higgs","CreatedById":121852,"CreatedDateTime":"2015-10-03T18:27:25Z","Content":"\n\u003Cp\u003EPictures of it?\u003C/p\u003E\n"},{"CreatedByName":"Mastikator","CreatedById":135309,"CreatedDateTime":"2015-10-03T18:48:23Z","Content":"\n\u003Cp\u003EAs the rocket burns fuel the upper tanks empty first.\u003C/p\u003E\u003Cp\u003EThis pushes the center of mass lower.\u003C/p\u003E\u003Cp\u003EAs the center of mass moves behind the center of drag it flips over. (you can do an experiment to check this out in your own home, throw a dart end-side first, it will flip over since the fins at the end have a high amount of drag and the tip is heavy)\u003C/p\u003E\u003Cp\u003EYou can put fins at the bottom, but that would increase both the mass and the overall drag thus reducing your total delta-v. Considering that it\u0027s a mining ship that may or may not be a problem.\u003C/p\u003E\u003Cp\u003EAnother solution is to disable the upper fuel tanks until the lower ones are almost empty.\u003C/p\u003E\n"},{"CreatedByName":"Slam_Jones","CreatedById":125101,"CreatedDateTime":"2015-10-03T18:55:59Z","Content":"\n\u003Cp\u003E1210 parts! Impressive! You must be running a supercomputer \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E I\u0027m surprised my .craft parser even got thru the whole thing \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2015-10-03T19:00:28Z","Content":"\n\u003Cp\u003EI\u0027ll be adding more reaction wheels on the tear down. I\u0027m actually burning from the center. The top has 1/3 of the total fuel and the boosters 2/3 of the total fuel on launch. They are very condensed. There are actaully 9 total tanks directly in the same position and 2 of those layered in a set of 4 boosters.\u003C/p\u003E\u003Cp\u003EI\u0027m testing again with extra struts. Hopefully it helps. But I need to get to faster speeds to see if it acts up again when the tanks are closer to empty. (Edit3: I\u0027m hitting around 700m/s surface velocity and the boosters are trying to go all over the place. The struts linking them together seem to be holding, but I don\u0027t know if their internal struts not holding together individually or what. I\u0027ll have to figure out how to make them more stable possibly. Basically once the boosters are half way through their bottom tanks they start to flail...Edit4: On the upside 1200\u002B parts explosions are very entertaining! 8p)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1262.photobucket.com/albums/ii613/PicsMe101/KSP/Screenshot%20from%202015-10-03%2014-56-06_zpssqabyusp.png~original\u0022 alt=\u0022Screenshot%20from%202015-10-03%2014-56-06_zpssqabyusp.png%7Eoriginal\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1262.photobucket.com/albums/ii613/PicsMe101/KSP/Screenshot%20from%202015-10-03%2014-56-02_zps0bqpo4zo.png~original\u0022 alt=\u0022Screenshot%20from%202015-10-03%2014-56-02_zps0bqpo4zo.png%7Eoriginal\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s a little laggy to fly. It\u0027s takes a while to do test flights sadly. I\u0027m not running hardware that is that good. I\u0027m surprised more people can\u0027t run this sort of thing. It\u0027s that or because I always build craft this bit I\u0027m used to always flying in lots of lag...\u003C/p\u003E\u003Cp\u003ESpecs:\u003C/p\u003E\u003Cp\u003EFedora 22 x64(Linux)\u003C/p\u003E\u003Cp\u003EPhenom II 1100t\u003C/p\u003E\u003Cp\u003E8gigs 1600mhz ram (2x4gig)\u003C/p\u003E\u003Cp\u003E256gb SSD main drive\u003C/p\u003E\u003Cp\u003ENvidia 560ti 1gb 384 core edition\u003C/p\u003E\u003Cp\u003E750gb raid 10 (6x250gb drives. Random old drives and somewhat slow write because of differences.)\u003C/p\u003E\u003Cp\u003EIt could be the SSD helping...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-03T19:20:18Z\u0022 title=\u002210/03/2015 07:20  PM\u0022 data-short=\u00228 yr\u0022\u003EOctober 3, 2015\u003C/time\u003E by Arugela\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Slam_Jones","CreatedById":125101,"CreatedDateTime":"2015-10-03T19:09:04Z","Content":"\n\u003Cp\u003EUsually much easier to work with screenshots taken during the day, but luckily I have GIMP and could change up brightness/etc to make it more visible.\u003C/p\u003E\u003Cp\u003EI\u0027d say stick on fins on the end of the two booster \u0022legs,\u0022 with at least 3x symmetry on each. After that, add at least 3 Reaction wheels to each leg, plus a similar amount to the top of the craft, just behind the cockpit.\u003C/p\u003E\u003Cp\u003EI don\u0027t have too much experience with the level of clipping you\u0027ve got going on with those fuel tanks, but that might be an issue as well. Make sure they\u0027re properly strutted, as oscillations there would only create a positive feedback loop (meaning, the movement causes more movement, which cause more, and more, etc in a loop til something breaks)\u003C/p\u003E\u003Cp\u003EThis should boost stability greatly, and keep it pointed mostly the way you want to go. Just remember not to be too aggressive on your turns, or it will cause too much drag and, potentially, some big issues. keep your heading no more than 5 degrees from your prograde marker.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-03T19:11:18Z\u0022 title=\u002210/03/2015 07:11  PM\u0022 data-short=\u00228 yr\u0022\u003EOctober 3, 2015\u003C/time\u003E by Slam_Jones\u003C/strong\u003E\n\u003Cbr\u003EGrammar, spelling\n\u003C/span\u003E\n"},{"CreatedByName":"ForScience6686","CreatedById":144187,"CreatedDateTime":"2015-10-03T19:11:45Z","Content":"\n\u003Cp\u003EI\u0027m wandering about the aoa you\u0027re using. You should be facing prograde \u002B- 5 degrees until out of the thick atmosphere. From your description, you are moving off prograde and causing the aero forces to hit the side of the rocket causing it to flip. You need to be above 25k before doing any aggressive maneuvers. Also make sure you are viewing surface velocity.\u003C/p\u003E\n"},{"CreatedByName":"Kryxal","CreatedById":102688,"CreatedDateTime":"2015-10-04T03:14:37Z","Content":"\n\u003Cp\u003EDefinitely turning too hard, too soon, then not being able to follow prograde. TWR looks like it\u0027s probably a bit on the high side too. Try kicking over not quite 5 degrees at 100 m/s, hold till your velocity vector catches up, then FOLLOW that vector at least to 20-30 km as best you can. See if that\u0027s a better launch profile, adjust as needed.\u003C/p\u003E\n"},{"CreatedByName":"MarvinKitFox","CreatedById":99545,"CreatedDateTime":"2015-10-04T05:13:26Z","Content":"\n\u003Cp\u003EIts a simple case of too much drag up front.\u003C/p\u003E\u003Cp\u003EThat second container ship on the forward bulkhead simply does not counter the wind drag of the portside oil refinery.\u003C/p\u003E\u003Cp\u003E.\u003C/p\u003E\u003Cp\u003E.\u003C/p\u003E\u003Cp\u003EAt least not while you are sideslipping at 500 miles per hour.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-04T05:15:35Z\u0022 title=\u002210/04/2015 05:15  AM\u0022 data-short=\u00228 yr\u0022\u003EOctober 4, 2015\u003C/time\u003E by MarvinKitFox\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2015-10-04T07:20:55Z","Content":"\n\u003Cp\u003EYea, it could be an issue of me flying wrong. I fly full power and angle. I don\u0027t do anything more complicated. Although there were a lot of structural stuff I have since solved on the new build. I have basically only flown space planes since I started playing. So I\u0027m used to burning full speed to gain an apoapsis. I haven\u0027t really learned any of the subtleties of rocket flight. I\u0027m flying it now trying to maintain a lower surface velocity and a lot of the problems are not there for now. Although I\u0027m still early in a test flight.\u003C/p\u003E\n"},{"CreatedByName":"MarvinKitFox","CreatedById":99545,"CreatedDateTime":"2015-10-04T13:26:37Z","Content":"\n\u003Cp\u003EOk, lets rephrase my comment.\u003C/p\u003E\u003Cp\u003EYour rocket has the intrinsic smooth aerodynamic shape of... a feather duster.\u003C/p\u003E\u003Cp\u003EThat is being shoved backwards.\u003C/p\u003E\u003Cp\u003Ein a barrel of treacle.\u003C/p\u003E\u003Cp\u003EYou should expect to see some slight steering issues.\u003C/p\u003E\u003Cp\u003EIf you really *must* use that configuration, then at least have it flying directly prograde.\u003C/p\u003E\u003Cp\u003EYour problem is that you are presenting a very draggy, long, and likely wobbly shape to severe crosswinds.\u003C/p\u003E\u003Cp\u003EEither smooth the shape, OR add so much drag at the back that it overwhelms the turning forces, OR fly so close to prograde (surface speed!) that there is no crosswind.\u003C/p\u003E\n"},{"CreatedByName":"ForScience6686","CreatedById":144187,"CreatedDateTime":"2015-10-04T13:48:44Z","Content":"\n\u003Cp\u003ETry and stay under 300 m/s until above 10km, then full throttle. Begin your turn between 50-100m. At 5-10 degrees, then follow prograde up above 30k before making big maneuvers. Larger payloads I use a more gentle turn until I\u0027m up out of the thick atmosphere. And I almost always use fairing now.\u003C/p\u003E\n"},{"CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2015-10-04T14:01:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MarvinKitFox\u0022 data-cite=\u0022MarvinKitFox\u0022\u003E\u003Cdiv\u003EOk, lets rephrase my comment.\u003Cp\u003EYour rocket has the intrinsic smooth aerodynamic shape of... a feather duster.\u003C/p\u003E\u003Cp\u003EThat is being shoved backwards.\u003C/p\u003E\u003Cp\u003Ein a barrel of treacle.\u003C/p\u003E\u003Cp\u003EYou should expect to see some slight steering issues.\u003C/p\u003E\u003Cp\u003EIf you really *must* use that configuration, then at least have it flying directly prograde.\u003C/p\u003E\u003Cp\u003EYour problem is that you are presenting a very draggy, long, and likely wobbly shape to severe crosswinds.\u003C/p\u003E\u003Cp\u003EEither smooth the shape, OR add so much drag at the back that it overwhelms the turning forces, OR fly so close to prograde (surface speed!) that there is no crosswind.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYea, I\u0027ve been adjusting by using the follow prograde button to stear. I tilt it 5 degrees at start then follow prograd and let it fall naturally. It seems to work really well. At 10k or more I change from surface to orbital velocity and it changes the prograde marker and it follows it. Kind of like an auto pilot. It seems to be working so far. I\u0027ve given up stearing in atmosphere. And yes I must keep the shape. It is a replica ship of \u0022The Orion\u0022 that is going to be in Star Citizen.\u003C/p\u003E\u003Cp\u003EHere are the latest save files. I fixed some issues with it. Though I added more parts. I might need to thin out some of those struts.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www./folder/phyp96txcn9o8af,01tduvwnor4go4u/shared\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www./folder/phyp96txcn9o8af,01tduvwnor4go4u/shared\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt still needs coms, science, probes, and other cargo. But I can\u0027t get my computer to take more parts.\u003C/p\u003E\u003Cp\u003EBTW, would adding nosecones or something on the forward/upward facing side of those containers reduce drag(Or reduce drag in a way meaningful to getting into orbit.). I\u0027m not sure what the current calculations are for drag to tell how much stuff affects it. I don\u0027t know if it\u0027s good to take struts off or add something to see if it alleviates it and gets me into orbit faster.\u003C/p\u003E\u003Cp\u003EI don\u0027t currently have any nosecones no this ship. the only thing similar are two CLAWS on the front of the ship to grab asteroids. And I don\u0027t think they help with that.... Or do they?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1262.photobucket.com/albums/ii613/PicsMe101/KSP/Screenshot%20from%202015-10-04%2011-42-12_zpsntwujhzi.png~original\u0022 alt=\u0022Screenshot%20from%202015-10-04%2011-42-12_zpsntwujhzi.png%7Eoriginal\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1262.photobucket.com/albums/ii613/PicsMe101/KSP/Screenshot%20from%202015-10-04%2011-56-44_zps7u2st9me.png~original\u0022 alt=\u0022Screenshot%20from%202015-10-04%2011-56-44_zps7u2st9me.png%7Eoriginal\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1262.photobucket.com/albums/ii613/PicsMe101/KSP/Screenshot%20from%202015-10-04%2012-45-35_zpsiknbpodz.png~original\u0022 alt=\u0022Screenshot%20from%202015-10-04%2012-45-35_zpsiknbpodz.png%7Eoriginal\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1262.photobucket.com/albums/ii613/PicsMe101/KSP/Screenshot%20from%202015-10-04%2012-52-35_zps1ia2west.png~original\u0022 alt=\u0022Screenshot%20from%202015-10-04%2012-52-35_zps1ia2west.png%7Eoriginal\u0022\u003E\u003C/p\u003E\u003Cp\u003EI forgot to add tail fins to the boosters. I\u0027ll have to add those next and see what they do.\u003C/p\u003E\u003Cp\u003EAnd I\u0027m aware the angle is steep. I oops. I put the pick up though to demonstrate the drag lines for the question about nosecones.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-04T17:00:51Z\u0022 title=\u002210/04/2015 05:00  PM\u0022 data-short=\u00228 yr\u0022\u003EOctober 4, 2015\u003C/time\u003E by Arugela\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ForScience6686","CreatedById":144187,"CreatedDateTime":"2015-10-04T15:13:12Z","Content":"\n\u003Cp\u003EBe cautious switching to orbital so early, you are still in significant atmosphere at that point. Other than that congratulations\u003C/p\u003E\n"},{"CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2015-10-04T17:21:42Z","Content":"\n\u003Cp\u003EIf I put nosecones on some of the forward/upward facing surfaces would they work if I also sunk them in or do they have to be above other surfaces and be exposed?\u003C/p\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2015-10-04T17:29:44Z","Content":"\n\u003Cp\u003EMost people will tell you to start turning as quickly as possible for an efficient ascent. And they are right.\u003C/p\u003E\u003Cp\u003EBut this is not \u0022most ships.\u0022 And your \u0022effeciency ratio\u0022 gets multiplied with a 1|0 factor indicating if you made it into orbit or not.\u003C/p\u003E\u003Cp\u003EAs others pointed out, the aerodynamics of this vessel are nearly not existent. So I\u0027d shoot this one straight up in the sky and only \u003Cem\u003Edare\u003C/em\u003E to make a turn once you hit the 50km altitude.\u003C/p\u003E\u003Cp\u003EOr consider using fairings. Or a different design. Or both.\u003C/p\u003E\n"},{"CreatedByName":"ForScience6686","CreatedById":144187,"CreatedDateTime":"2015-10-04T18:23:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kerbart\u0022 data-cite=\u0022Kerbart\u0022\u003E\u003Cdiv\u003EMost people will tell you to start turning as quickly as possible for an efficient ascent. And they are right.\u003Cp\u003EBut this is not \u0022most ships.\u0022 And your \u0022effeciency ratio\u0022 gets multiplied with a 1|0 factor indicating if you made it into orbit or not.\u003C/p\u003E\u003Cp\u003EAs others pointed out, the aerodynamics of this vessel are nearly not existent. So I\u0027d shoot this one straight up in the sky and only \u003Cem\u003Edare\u003C/em\u003E to make a turn once you hit the 50km altitude.\u003C/p\u003E\u003Cp\u003EOr consider using fairings. Or a different design. Or both.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree with fairing but 50km is a bit long to wait to turn. Losing a lot of time to build horizontal speed which is more important than vertical speed.\u003C/p\u003E\n"},{"CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2015-10-04T18:46:30Z","Content":"\n\u003Cp\u003EIf I put fairings around all of those ore tanks would it get rid of the drag? I wonder if I could put some around those hub parts to make it look like a fuselage. Or A big one around the engine pod to give it the proper aesthetics. Do large fairings make a lot of lag or are they a good parts count reducer if used heavily?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-04T18:49:08Z\u0022 title=\u002210/04/2015 06:49  PM\u0022 data-short=\u00228 yr\u0022\u003EOctober 4, 2015\u003C/time\u003E by Arugela\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ForScience6686","CreatedById":144187,"CreatedDateTime":"2015-10-04T19:30:17Z","Content":"\n\u003Cp\u003EIf I recall correctly, they are counted as one part and remains as a part on the ship until the base is discarded. I would put the whole payload in the fairing or just use nose cones.\u003C/p\u003E\n"},{"CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2015-10-04T19:38:30Z","Content":"\n\u003Cp\u003EDo nose cones reduce drag now? I read a while back they don\u0027t do anything. so far I have been flying with some on and I don\u0027t think it\u0027s doing much.. I\u0027m confused how it works as I have more drag lines than exposed surfaces. It\u0027s like it creates drag in the middle of the plane even with no airflow.\u003C/p\u003E\u003Cp\u003EI was also reading something about struts causing lots of lag. But that it only occurs on the parent part. I wonder if it would help to reverse my struts and start them on the fuselage instead of the ore containers.\u003C/p\u003E\u003Cp\u003EBefore Cones!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1262.photobucket.com/albums/ii613/PicsMe101/KSP/Screenshot%20from%202015-10-04%2011-42-12_zpsntwujhzi.png~original\u0022 alt=\u0022Screenshot%20from%202015-10-04%2011-42-12_zpsntwujhzi.png%7Eoriginal\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter Cones:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1262.photobucket.com/albums/ii613/PicsMe101/KSP/Screenshot%20from%202015-10-04%2016-06-57_zpssvfp6cxz.png~original\u0022 alt=\u0022Screenshot%20from%202015-10-04%2016-06-57_zpssvfp6cxz.png%7Eoriginal\u0022\u003E\u003C/p\u003E\u003Cp\u003EDoes anyone see a difference? Besides the kerbals faces.\u003C/p\u003E\u003Cp\u003EI only see a little less fuel in the one with cones. Probably from the extra parts.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-04T20:11:17Z\u0022 title=\u002210/04/2015 08:11  PM\u0022 data-short=\u00228 yr\u0022\u003EOctober 4, 2015\u003C/time\u003E by Arugela\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ForScience6686","CreatedById":144187,"CreatedDateTime":"2015-10-04T20:53:52Z","Content":"\n\u003Cp\u003ENose cones are highly recommended, not sure about the strut question though.\u003C/p\u003E\n"},{"CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2015-10-05T05:47:00Z","Content":"\n\u003Cp\u003EI have an interesting question. If you use two reaction wheels. One on top of the other. And one is turned using the rotation tool to face the opposite direction and sitting on the exact same space as the other one, so they are completely stacked but facing opposite directions, will they double the reaction power or nullify each other?\u003C/p\u003E\u003Cp\u003EMy testing indicates they do not nullify each other. But is there anything else to this?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-05T06:34:27Z\u0022 title=\u002210/05/2015 06:34  AM\u0022 data-short=\u00228 yr\u0022\u003EOctober 5, 2015\u003C/time\u003E by Arugela\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-10-05T06:44:57Z","Content":"\n\u003Cp\u003E\u0022Do nose cones reduce drag now? I read a while back they don\u0027t do anything. so far I have been flying with some on and I don\u0027t think it\u0027s doing much..\u0022\u003C/p\u003E\u003Cp\u003EYes, they do, you probably read something that was written before the big 1.0 aerodynamic overhaul.\u003C/p\u003E\u003Cp\u003E\u0022I\u0027m confused how it works as I have more drag lines than exposed surfaces. It\u0027s like it creates drag in the middle of the plane even with no airflow.\u0022\u003C/p\u003E\u003Cp\u003EEvery exposed part will have some drag, but if the node above them is occupied (by another fuel tank, or a nose cone) they will have less drag.\u003C/p\u003E\u003Cp\u003EMore red lines, but the sume of the drag is lower.\u003C/p\u003E\u003Cp\u003ETest it yourself, go in sandbox, take a RT-10 SRB, put a mk1 inline on top of it, and some stabilizing fins at the bottom. \u003C/p\u003E\u003Cp\u003ELaunch it with no nosecone, see how high you get.\u003C/p\u003E\u003Cp\u003ELaunch it with a standard rounded nose cone\u003C/p\u003E\u003Cp\u003EThen try an advanced nose cone\u003C/p\u003E\u003Cp\u003EThen try a shock cone.\u003C/p\u003E\u003Cp\u003EThen try a 2x2 structural panel placed flat....\u003C/p\u003E\u003Cp\u003EYou should see big differences\u003C/p\u003E\n"},{"CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2015-10-05T12:21:53Z","Content":"\n\u003Cp\u003EOne of the problems is, as I have finally discovered, is that I have 384 large reaction wheels and they are not properly struted(and I\u0027m not sure if they can be). They wobble a bit and make it impossible to maneuver properly. I\u0027ll have to see what happens now that I have strutted them a bit. Are they going to add a new reaction wheel the size of the Kerbodyne S3-14400 tank. The game could use one. It should probably have 120 torque and simple 4x the stats(assuming double the diameter) or whatever is appropriate for the size increase to the diameter or however it works. I have to use too many parts for size of the ship and it really needs the torque. Any idea why one of these is not in game yet?\u003C/p\u003E\u003Cp\u003EI have strutted some of it down but the inner stuff still has a lot of wobble more than likely and I keep deviating slightly from my ideal path in flight.. I wonder how much of this is the reason for my shakes after I get in orbit with full thrust.\u003C/p\u003E\u003Cp\u003EHere are the updated craft files. I have more parts on the main ship and I put wings on the boosters.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www./download/kd21hsksdmki1w5/The_Orion_Basic_wBooster%283%29.craft\u0022 rel=\u0022external nofollow\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www./download/kd21hsksdmki1w5/The_Orion_Basic_wBooster%283%29.craft\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./download/kd21hsksdmki1w5/The_Orion_Basic_wBooster%283%29.craft\u003C/a\u003E \u0026lt;- With Boosters\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www./download/fdwhpek32w1yd55/The_Orion_Basic%282%29.craft\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./download/fdwhpek32w1yd55/The_Orion_Basic%282%29.craft\u003C/a\u003E \u0026lt;- Without Boosters\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-06T03:26:01Z\u0022 title=\u002210/06/2015 03:26  AM\u0022 data-short=\u00228 yr\u0022\u003EOctober 6, 2015\u003C/time\u003E by Arugela\u003C/strong\u003E\n\u003C/span\u003E\n"}]}