{"TopicId":122437,"ForumId":16,"TopicTitle":"how do i get lower grade contracts?","CreatedByName":"carneyvich","CreatedById":147880,"CreatedDateTime":"2015-10-06T15:21:03Z","PageNum":1,"Articles":[{"CreatedByName":"carneyvich","CreatedById":147880,"CreatedDateTime":"2015-10-06T15:21:03Z","Content":"\n\u003Cp\u003EMy main source of income is tourest trips to suborbital space and back but because of my high rep i don\u0027t have those types of contracts anymore. i tryed lowering my reputation but the hard contracts are still staying and because of this i cant get income anymore so.....help? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-07T16:26:34Z\u0022 title=\u002210/07/2015 04:26  PM\u0022 data-short=\u00228 yr\u0022\u003EOctober 7, 2015\u003C/time\u003E by carneyvich\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Champ","CreatedById":96425,"CreatedDateTime":"2015-10-06T15:29:35Z","Content":"\n\u003Cp\u003ESorry, i couldn\u0027t say how you could get those \u0022tourist on suborbital flight\u0022 contracts, but i think you may have better sources of income. Satellite on equatorial contracts (beware not to have 180 degrees inclination) are good for this, specially because you can have 6 of them, (2 around kerbin, 2 around mun and 2 around minmus) and fullfill all 6 of them with just a single ship.\u003C/p\u003E\u003Cp\u003E\u0022Space stations in orbit around XXX\u0022 are great for money too. Remember you don\u0027t have to build fully fonctional stations. Just fullfill the requirements : probe core, antenna, solar panels, room for X kerbals, and that\u0027s all. You don\u0027t have to put kerbals in it.\u003C/p\u003E\u003Cp\u003EThese are my preferred income contracts. Pays well, easily and quickly done.\u003C/p\u003E\n"},{"CreatedByName":"carneyvich","CreatedById":147880,"CreatedDateTime":"2015-10-06T15:40:26Z","Content":"\n\u003Cp\u003Eyou didn\u0027t answer my question\u003C/p\u003E\n"},{"CreatedByName":"Glaran K\u0026#039;erman","CreatedById":146334,"CreatedDateTime":"2015-10-06T15:42:46Z","Content":"\n\u003Cp\u003EGet the mod Contract \u003Cspan style=\u0022color:#ff0000;\u0022\u003EFILTER\u003C/span\u003E (not Configurator as I mistakenly typed first), this will allow you to \u0027Blacklist\u0027 any types of contracts you don\u0027t want and can even pick what types of bodies (Maybe you like only one type of contract but only around Kerbin?). Since you\u0027re rep is high you don\u0027t NOT have have access to the contracts, the the chances of them popping up this far along are incredibly low. So mod it up and sift until satisfied! (Note: I like low level test contracts at launch pad/landed at Kerbin and I can only get three at a time, by the time the third time one comes up it seems the chances of another become near infinite! So complete those and then sort again)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-06T15:45:29Z\u0022 title=\u002210/06/2015 03:45  PM\u0022 data-short=\u00228 yr\u0022\u003EOctober 6, 2015\u003C/time\u003E by Glaran K\u0026#39;erman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Crown","CreatedById":18262,"CreatedDateTime":"2015-10-06T16:05:32Z","Content":"\n\u003Cp\u003EA solution which might not need mods might be to reduce the reputation my accepting contracts and then aborting them again. This will make you loose some reputation, I think, until it\u0027s low enough to have it low enough to have tourist contracts.\u003C/p\u003E\u003Cp\u003EBut I\u0027m not sure if it will work. Recovery and tourist contrasts are quite funny sometimes. I landed on Minmus and now I\u0027m getting a bunch of \u0027test this on launch pad\u0027 contracts. Maybe they just appear randomly and you need to decline contracts until they show up on the list.\u003C/p\u003E\n"},{"CreatedByName":"Champ","CreatedById":96425,"CreatedDateTime":"2015-10-06T16:27:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022carneyvich\u0022 data-cite=\u0022carneyvich\u0022\u003E\u003Cdiv\u003Eyou didn\u0027t answer my question\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs i said, \u0022Sorry, i couldn\u0027t say how you could get those \u0022tourist on suborbital flight\u0022 contracts\u0022.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Crown\u0022 data-cite=\u0022Crown\u0022\u003E\u003Cdiv\u003EA solution which might not need mods might be to reduce the reputation my accepting contracts and then aborting them again. This will make you loose some reputation, I think, until it\u0027s low enough to have it low enough to have tourist contracts.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOP said he already lowered reputation, but it does not work.\u003C/p\u003E\n"},{"CreatedByName":"SpeedDaemon","CreatedById":38448,"CreatedDateTime":"2015-10-06T17:56:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Crown\u0022 data-cite=\u0022Crown\u0022\u003E\u003Cdiv\u003EA solution which might not need mods might be to reduce the reputation my accepting contracts and then aborting them again. This will make you loose some reputation, I think, until it\u0027s low enough to have it low enough to have tourist contracts.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you\u0027re going to dump rep, you might as well get some funds or science out of it by doing it via the admin building strategies. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"mattssheep4","CreatedById":146984,"CreatedDateTime":"2015-10-06T18:52:49Z","Content":"\n\u003Cp\u003EAnother way to lose rep (although this doesn\u0027t seem to be what you\u0027re asking) is to spend it in Mission Control for science or moolah.\u003C/p\u003E\n"},{"CreatedByName":"carneyvich","CreatedById":147880,"CreatedDateTime":"2015-10-06T19:03:59Z","Content":"\n\u003Cp\u003Ethat\u0027s what i tryed before\u003C/p\u003E\n"},{"CreatedByName":"Glaran K\u0026#039;erman","CreatedById":146334,"CreatedDateTime":"2015-10-06T19:47:51Z","Content":"\n\u003Cp\u003EJust to let you know carneyvich, you\u0027re not going to get what you want without a mod. You\u0027ll be declining for days.\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2015-10-07T08:24:07Z","Content":"\n\u003Cp\u003EReputation controls the difficulty of the contracts (one, two or three stars), and through that, their payout value. Contrary to popular belief, Reputation does \u003Cem\u003Enot\u003C/em\u003E control contract \u003Cem\u003Econtent\u003C/em\u003E apart from a small few contract types having a minimum threshold before they appear at all.\u003C/p\u003E\u003Cp\u003EAs a result, lowering your reputation does nothing at all in this case.\u003C/p\u003E\u003Cp\u003EYou no longer get subobital toursit flights because the game has determined your space program has progressed beyond that stage. It looks at your most impressive achievements and uses that as a guideline to generate contracts.\u003C/p\u003E\u003Cp\u003E- If you just started out, it generates suborbita tourist flights\u003C/p\u003E\u003Cp\u003E- Once you have achieved orbit, it generates orbital tourist flights\u003C/p\u003E\u003Cp\u003E- Once you have entered the Mun\u0027s SoI, toursist start wanting to go to Mun and Minmus\u003C/p\u003E\u003Cp\u003E- Oce you have left Kerbin\u0027s SoI, tourists start wanting to go out into solar orbit, to Duna and to Eve\u003C/p\u003E\u003Cp\u003E- And so on\u003C/p\u003E\u003Cp\u003EThis is true for all contract types, including surveys, exploration, science return, station building, base building, satellite launches, and so on and so forth.\u003C/p\u003E\u003Cp\u003EYou will no longer be offered suborbital tourist contracts, completely independent of your reputation.\u003C/p\u003E\n"},{"CreatedByName":"Crown","CreatedById":18262,"CreatedDateTime":"2015-10-07T09:59:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Champ\u0022 data-cite=\u0022Champ\u0022\u003E\u003Cdiv\u003EOP said he already lowered reputation, but it does not work.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI somehow missed that.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Streetwind\u0022 data-cite=\u0022Streetwind\u0022\u003E\u003Cdiv\u003E[...]Reputation does \u003Cem\u003Enot\u003C/em\u003E control contract \u003Cem\u003Econtent\u003C/em\u003E [...]\u003Cp\u003EYou will no longer be offered suborbital tourist contracts, completely independent of your reputation.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Glaran K\u0022 data-cite=\u0022Glaran K\u0022\u003E\u003Cdiv\u003EJust to let you know carneyvich\u0027 date=\u0027 you\u0027re not going to get what you want without a mod. You\u0027ll be declining for days.[/quote\u0027]\u003Cp\u003EWell, then the only way is to use a mod.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"FancyMouse","CreatedById":142946,"CreatedDateTime":"2015-10-07T10:13:20Z","Content":"\n\u003Cp\u003Emaybe it\u0027s a chance to poke the next more-efficient source of income, for example LKO rescues.\u003C/p\u003E\n"},{"CreatedByName":"Champ","CreatedById":96425,"CreatedDateTime":"2015-10-07T11:08:23Z","Content":"\n\u003Cp\u003EDo you really use lko rescues as a source of income ? I use it as a way to get free kerbals but, for income, \u0022satellite on an equatorial orbit\u0022 seems really better : it takes less time and pays more (specially when a single satellite can complete 6 missions).\u003C/p\u003E\n"},{"CreatedByName":"FancyMouse","CreatedById":142946,"CreatedDateTime":"2015-10-07T12:39:12Z","Content":"\n\u003Cp\u003EFor one period of time, yes. Satellite isn\u0027t paying too much unless high star ones with weird orbit, which can\u0027t be easily batched. LKO rescues are consistent OTOH, and you only need LKO\u002B500ish dV for batch rescuing 4 kerbals, reducing cost. And for me LKO rendezvous isn\u0027t taking more time than matching satellite orbits.\u003C/p\u003E\u003Cp\u003ELater on interplanetary station contracts will take over.\u003C/p\u003E\n"},{"CreatedByName":"obsidian_x","CreatedById":145147,"CreatedDateTime":"2015-10-07T13:48:27Z","Content":"\n\u003Cp\u003EI must be doing something wrong, every tourist contract I got in the early game was something like 10k for suborbital, and another 4-10k for returning them. I couldn\u0027t build (early game ships) to make any profits. I know you can take multiples to increase the profit margin, but I found them pretty tedious, for not much return. I did the minimum to get my base reputation up a bit, to get the more interesting contracts. Have found the satellite missions the most lucrative, but then I have a couple of contract mods added too. \u003C/p\u003E\u003Cp\u003ESince replicating the spaceplane scott manley built (with mini satellite with a claw and parachutes) in the ksp walkthrough series, LKO rescues and part returns are pretty good for me now. Also got me loads of practice with rendezvous and precision clawing.\u003C/p\u003E\u003Cp\u003EI did see a tourist mission for Duna flyby with a decent return, but I haven\u0027t even returned my own crews yet.\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-10-07T13:54:44Z","Content":"\n\u003Cp\u003EI\u0027m not sure if tourist contracts are affected by reputation that much, at least their rewards all seem to be much higher than other contracts at the same rep level.\u003C/p\u003E\n"},{"CreatedByName":"soulsource","CreatedById":110576,"CreatedDateTime":"2015-10-07T14:46:35Z","Content":"\n\u003Cp\u003EAs those contracts will still show up, but just with a very low probability, you could just refuse contracts until you get one of the suborbital tourist missions.\u003C/p\u003E\u003Cp\u003EBut as others have said: Suborbital tourism doesn\u0027t pay very well. Part tests, and later satellite missions typically yield much higher income at lower cost.\u003C/p\u003E\n"},{"CreatedByName":"carneyvich","CreatedById":147880,"CreatedDateTime":"2015-10-07T16:26:00Z","Content":"\n\u003Cp\u003Eok thanks guys i have much to think about. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\n"}]}