{"TopicId":122597,"ForumId":32,"TopicTitle":"Flying rockets and aircraft made in KSP in real life","CreatedByName":"zephramcochrane","CreatedById":152122,"CreatedDateTime":"2015-10-08T16:56:01Z","PageNum":1,"Articles":[{"CreatedByName":"zephramcochrane","CreatedById":152122,"CreatedDateTime":"2015-10-08T16:56:01Z","Content":"\n\u003Cp\u003EHi,\u003C/p\u003E\u003Cp\u003EMy questions are short. Has anyone here taken an aircraft or rocket design built in KSP and built/flown it in real life? If so, what was your experience and do you have photos? \u003C/p\u003E\u003Cp\u003EThanks\u003C/p\u003E\n"},{"CreatedByName":"FishInferno","CreatedById":106219,"CreatedDateTime":"2015-10-08T21:59:05Z","Content":"\n\u003Cp\u003EI have made a model rocket based on a KSP design. I suppose the airframe would be more or less accurate, but the weight and thrust would not be.\u003C/p\u003E\u003Cp\u003EClick the image for the dedicated thread\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/129816-Video-No-Parachute-No-Problem-a-KSP-model-rocket-MISSION-SUCCESS!\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i62.tinypic.com/28ib512.jpg\u0022 alt=\u002228ib512.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"zephramcochrane","CreatedById":152122,"CreatedDateTime":"2015-10-09T01:44:36Z","Content":"\n\u003Cp\u003EAwesome! Did it perform like the rocket on the computer? Also, I can\u0027t tell but how big is the rocket? And its powered by solid rocket motors?\u003C/p\u003E\n"},{"CreatedByName":"StrandedonEarth","CreatedById":89439,"CreatedDateTime":"2015-10-09T02:24:46Z","Content":"\n\u003Cp\u003EYou launch around all those trees? I hope there\u0027s a nice open field behind you, with the wind blowing towards it. I lost a rocket to a tree and it took two years for the payload section to finally drop into some brambles underneath. I think someone must have found it first, however, because while I found the nosecone and \u0027chute on the ground, there was no sign of the legonauts that were inside. Around here I can only find fields big enough for B-class motors, I tend to lose C-powered rockets\u003C/p\u003E\u003Cp\u003EAnd in response to your dedicated thread, I can only say, \u0022Moar struts!\u0022\u003C/p\u003E\u003Cp\u003EZephram: looks like standard Estes solid model rocket motors. His thread listed a C6-5 motor, which packs 12.5g (0.44oz) of propellants for a whopping 15.3N (3.4lbs) of thrust.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-09T02:31:10Z\u0022 title=\u002210/09/2015 02:31  AM\u0022 data-short=\u00228 yr\u0022\u003EOctober 9, 2015\u003C/time\u003E by StrandedonEarth\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MaxxQ","CreatedById":102622,"CreatedDateTime":"2015-10-09T02:53:58Z","Content":"\n\u003Cp\u003EObviously, it\u0027s not mine, but I built and flew rockets like the above for over 30 years before circumstances required me to drop the hobby (may start up again soon, but right now it\u0027s still not possible). That model looks to be about a foot to 18 inches tall, about 1.325 to 1.637 inches diameter (standard Estes tube sizes BT-55 or BT-60), and probably flying on a B, or C motor (each roughly .75 inches diameter by 1.75 inches long - 5 to 10 N-sec avg. impulse). They are solid propellant motors (black powder), as model and high-power rocketry don\u0027t use liquid propellants. Amateur rocketry allows liquids and other materials, and some motor manufacturers have created and sell hybrid motors (usually nitrous for the oxidizer, and some form of solid for the fuel). Motor prices range from a few dollars for a 2, 3, or 4 pack for Estes motors (E and F motors come in two-packs ($20-30 per pack), standard A-D motors come in three-packs ($15-$20 per pack), and mini A motors are four to a pack (about $12-$15)).\u003C/p\u003E\u003Cp\u003EMid-range motors (G,H, and I) start at about $20-$30 per motor for single-use, up to $50 or so. These are usually composite motors, using ammonium perchlorate as the propellant. There are reloadable motors casings available, but whereas the propellant is slightly cheaper than single-use motors, the initial cost of the casing offsets that until you have roughly 20 flights on it. After that is when you start seeing savings.\u003C/p\u003E\u003Cp\u003EJ motors and above are considered high-power motors and everything from an H and up (I\u0027ve seen O and P motors before - each letter designation is roughly twice the impulse of the previous letter) requires varying levels of certification from either the NAR (National Association of Rocketry - \u003Ca href=\u0022www.nar.org\u0022 rel=\u0022external nofollow\u0022\u003Ewww.nar.org\u003C/a\u003E) or the Tripoli Rocketry Association (\u003Ca href=\u0022www.tra.org\u0022 rel=\u0022external nofollow\u0022\u003Ewww.tra.org\u003C/a\u003E). Also, any rocket weighing more than 3.3 pounds on the pad, or using more than 1500 grams total of propellant requires an FAA notification of the location of the launch, estimated altitude, and approximate number of launches expected. Either of those two sites will have a listing of local clubs or chapters, and they will help you with the official notifications and such.\u003C/p\u003E\u003Cp\u003EModel rocketry has been around for over 50 years and has an excellent safety record, due to strict enforcement of of the rocketry safety code(s). Any damages or injuries resulting from rocketry over the years has been the result of negligent fliers who ignore safety rules. Becoming a member of either of the organizations covers you with a $1,000,000 insurance policy - which AFAIK, has never been used.\u003C/p\u003E\u003Cp\u003EHere\u0027s one of mine from around 1997 or so: \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/GcX2Qd3.jpg\u0022 alt=\u0022GcX2Qd3.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s a 3x upscale of an Estes design from the early 1970\u0027s. The original was about 2 feet long and weighed around 3 ounces, flying on B and C class motors. My upscale was about 6.5 feet tall, weighed around 8 pounds on the pad, and flew to 1,600\u002B feet (according to the onboard electronic altimeter) using an I-161 single-use composite motor from Aerotech. This was it\u0027s second flight of that day.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-09T03:25:50Z\u0022 title=\u002210/09/2015 03:25  AM\u0022 data-short=\u00228 yr\u0022\u003EOctober 9, 2015\u003C/time\u003E by MaxxQ\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"FishInferno","CreatedById":106219,"CreatedDateTime":"2015-10-09T11:13:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022zephramcochrane\u0022 data-cite=\u0022zephramcochrane\u0022\u003E\u003Cdiv\u003EAwesome! Did it perform like the rocket on the computer? Also, I can\u0027t tell but how big is the rocket? And its powered by solid rocket motors?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt did not go to space, like a similar design would have done in KSP;). The rocket is about a foot tall, and It is powered by a C-class model rocket motor. The video in the thread I linked shows the launch.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022StrandedonEarth\u0022 data-cite=\u0022StrandedonEarth\u0022\u003E\u003Cdiv\u003EYou launch around all those trees? I hope there\u0027s a nice open field behind you.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere is a football field behind the parking lot. That is my backup launch site, my primary one is a bunch of sports fields across the street from there but on that day there was an event going on there.\u003C/p\u003E\n"}]}