{"TopicId":122749,"ForumId":32,"TopicTitle":"What to back up before an update","CreatedByName":"cup a joe","CreatedById":145990,"CreatedDateTime":"2015-10-10T21:41:41Z","PageNum":1,"Articles":[{"CreatedByName":"cup a joe","CreatedById":145990,"CreatedDateTime":"2015-10-10T21:41:41Z","Content":"\n\u003Cp\u003EHi guys I have another n00by question for ya\u0027ll\u003C/p\u003E\u003Cp\u003EI want to be able to back up my game before updates as I have mods n\u0027stuff but I don\u0027t really want to back up the entire KSP folder if I can help it. \u003Cspan style=\u0022text-decoration:underline;\u0022\u003ERather I would like to know the bare minimum that will let my mods work, and ships stay should a update cause problems.\u003C/span\u003E (My desktop is on the fritz so I have been using my laptop which has a tiny SSD and the ksp folder is 1.77GB. I have found using the cloud to be annoying when it comes to large files.) \u003C/p\u003E\u003Cp\u003EI have looked online and Google has said just the save file and persistence is fine but I just don\u0027t trust that for some reason. I will back up the entire thing if I must but I would much rather not.\u003C/p\u003E\u003Cp\u003EOn another note I\u0027d like to know how to save a copy of the current MK1 cockpit before the 1.0.5 update as those little bulges on the sides have helped me to degrees that they really shouldn\u0027t. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EThanks!\u003C/p\u003E\u003Cp\u003EIf this is the wrong place for this thread let me know and I will change it!.\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-10-10T21:52:04Z","Content":"\n\u003Cp\u003EWell if you don\u0027t backup the entire game folder, you can\u0027t restore it so there is not really any point to it. You can just copy out the saves folder, but you also need the GameData folder for any mods you are using. If 1.0.5 does break your game, you need the whole thing anyway or those files won\u0027t be usable.\u003C/p\u003E\u003Cp\u003EIt\u0027s unlikely to happen. What they have described probably won\u0027t break a thing and you could just continue your game. If you have an existing craft with the changing parts in persistence, it might look a little out of place but it should still be usable. (This includes the Mk1 jet parts, Jet engines, the Torroidal Aerospike Engine, and the XM-G50 air intake, unless I\u0027m forgetting something) If you have an existing saved craft you may have to take a part or two off and put it back again. If you can, bring any planes using these parts home and recover them to prevent minor issues.\u003C/p\u003E\u003Cp\u003EIn the past changing parts didn\u0027t cause a whole lot of harm, in some cases they looked like they were floating because the size or node position changed and no longer match the texture, but they still worked.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-10T21:58:10Z\u0022 title=\u002210/10/2015 09:58  PM\u0022 data-short=\u00228 yr\u0022\u003EOctober 10, 2015\u003C/time\u003E by Alshain\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Floker","CreatedById":152194,"CreatedDateTime":"2015-10-10T21:52:22Z","Content":"\n\u003Cp\u003E/GameData is the folder you\u0027re looking for. This is where the mods are located. Somewhere in /GameData/Squad you can also find the cockpit. So if you keep a copy of the GameData folder you have a backup of all the parts by squad (\u002B interiors) and your installed mods.\u003C/p\u003E\u003Cp\u003EThe savegame folder contains your savegames and your craft files. \u003C/p\u003E\u003Cp\u003ESo if I\u0027m not forgetting about something here you can backup savegames \u002B GameData and you\u0027re good to update.\u003C/p\u003E\u003Cp\u003EHope this helps a bit. :-)\u003C/p\u003E\n"},{"CreatedByName":"Archgeek","CreatedById":116048,"CreatedDateTime":"2015-10-10T21:58:34Z","Content":"\n\u003Cp\u003EI\u0027d say update your mods to the latest good version you can find, and copy your KSP folder to a larger, non solid-state drive, like an external or a NAS (Network Attached Storage, pretty much an external or several in one box, sitting on your local network). You\u0027re pretty much stuck backing up the whole thing, but you can at least back it up off your SSD and just drag it back if you need it. Heck, it\u0027s not that huge, so you can even shove it on flash drive if you like...maybe even zip it up so you only get one file\u0027s worth of transfer latency, which would also be good for the NAS solution.\u003C/p\u003E\n"},{"CreatedByName":"Floker","CreatedById":152194,"CreatedDateTime":"2015-10-10T22:26:53Z","Content":"\n\u003Cp\u003EThat\u0027s true. It\u0027s best to keep the whole thingy. 16GB sticks are available for like 5 bucks and you\u0027re safe :-)\u003C/p\u003E\n"},{"CreatedByName":"Skalou","CreatedById":133496,"CreatedDateTime":"2015-10-10T22:55:23Z","Content":"\n\u003Cp\u003Eyep, \u003C/p\u003E\u003Cp\u003Emy advice: find a way to save everything!\u003C/p\u003E\u003Cp\u003E you won\u0027t be able to download to old version after the update. keep it at least a few time, just to be sure you can play the new version without waiting a mod update or needing to go change a craft before the import.\u003C/p\u003E\u003Cp\u003Eyou don\u0027t have a usb key?\u003C/p\u003E\u003Cp\u003Eif not, the minimum is to save the \u0022save\u0022 folder and make a list of the mod you are using.\u003C/p\u003E\n"},{"CreatedByName":"RocketPilot573","CreatedById":62803,"CreatedDateTime":"2015-10-10T22:56:30Z","Content":"\n\u003Cp\u003EJust back up the entire KSP folder. Otherwise you\u0027ll be stuck with the new update. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Sabor","CreatedById":59932,"CreatedDateTime":"2015-10-13T13:54:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cup a joe\u0022 data-cite=\u0022cup a joe\u0022\u003E\u003Cdiv\u003EHi guys I have another n00by question for ya\u0027ll\u003Cp\u003EI want to be able to back up my game before updates as I have mods n\u0027stuff but I don\u0027t really want to back up the entire KSP folder if I can help it. \u003Cspan style=\u0022text-decoration:underline;\u0022\u003ERather I would like to know the bare minimum that will let my mods work, and ships stay should a update cause problems.\u003C/span\u003E (My desktop is on the fritz so I have been using my laptop which has a tiny SSD and the ksp folder is 1.77GB. I have found using the cloud to be annoying when it comes to large files.) \u003C/p\u003E\u003Cp\u003EI have looked online and Google has said just the save file and persistence is fine but I just don\u0027t trust that for some reason. I will back up the entire thing if I must but I would much rather not.\u003C/p\u003E\u003Cp\u003EOn another note I\u0027d like to know how to save a copy of the current MK1 cockpit before the 1.0.5 update as those little bulges on the sides have helped me to degrees that they really shouldn\u0027t. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EThanks!\u003C/p\u003E\u003Cp\u003EIf this is the wrong place for this thread let me know and I will change it!.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you\u0027re like me, your mod folder is larger than the entire vanilla KSP. Some mods won\u0027t work when you update to a new version of Kerbal, and will have to re-download an updated version of the mod. You may as well back up the entire game onto a flash drive and keep it around (This is what I do) So at any time you can go right back to your fully functional and modded previous version of KSP until the mods you DO want have been updated. But if it\u0027s specific parts/configs/mods you want, they\u0027ll be in the Gamedata folder\u003C/p\u003E\n"}]}