{"TopicId":122766,"ForumId":51,"TopicTitle":"Ascent: A Kerbal Career","CreatedByName":"samwiseiam25","CreatedById":89962,"CreatedDateTime":"2015-10-11T02:25:42Z","PageNum":1,"Articles":[{"CreatedByName":"samwiseiam25","CreatedById":89962,"CreatedDateTime":"2015-10-11T02:25:42Z","Content":"\n\u003Cp\u003EThis will be a series of mission reports detailing the Kerbal Space Agency\u0027s first and continuing steps into space. The current ultimate goal is to set up fueling infrastructure in the Duna system and use it to launch a mission to Eloo, which I have never been to. I\u0027m playing a mostly stock career, using KAS, KIS, Stock Bugfix, Asteroid Day, and Kerbal Alarm Clock. I may add additional mods as I go, but this is what I\u0027m starting with.\u003C/p\u003E\u003Cp\u003ENow- Onward to the first mission report! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EOn the first day of the space program, the Kerbal Space Agency acquired its first two contracts: gathering science from Kerbin and launching its first vessel. One would think that Kerbin-based contracts wouldn\u0027t fall under the scope of a space agency, but the interns that we currently have running mission control haven\u0027t seemed to fully grasp the concept of a space program yet.\u003C/p\u003E\u003Cp\u003ETo complete these contracts, the space program\u0027s engineers have created the \u0022Kerput.\u0022 Little more than a capsule welded on top of a small \u0022Flea\u0022 SRB, the Kerput demonstrates the pinnacle of Kerbalkind\u0027s knowledge about space travel, namely that space is \u0022up,\u0022 rockets can make you go up, and, therfore, a space program needs rockets. Rookie pilot Jebediah Kerman has been chosen as the pilot of this first historic mission, since he seems to be one of the few kerbals to grasp the concept of holding on to the control stick of the test craft instead of being distracted by the pretty sights out of the viewport.\u003C/p\u003E\u003Cp\u003EAt the launchpad, in order to fulfill one of the program\u0027s first contracts and gather some data on Kerbin\u0027s environment to provide a control to compare measurements to once we start exploring space, Mission Commander and craft pilot Jebediah Kerman left the capsule on the launch pad to record his observations of his surroundings before launching his craft. After returning to the command capsule, Jeb grabbed a hold of the control stick and waited for the countdown before activating the \u0022Flea\u0022 SRB. It was difficult to hear his transmissions over the roar of the rocket motor, but based on the facial expressions from the cockpit camera, the mission control staff has recommended that he be given a full psychological evaluation. Unfortunately, the Kerput\u0027s SRB did not burn for nearly long enough to reach into space so the recovery parachute was deployed and the Kerput touched down in the grasslands to the west of KSC... and promptly fell over. Jebediah posed next to his spacecraft after mission completion.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/vs6Qm\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EAlthough our first spacecraft failed to reach orbit, we gathered data from Kerbin that will help us develop more powerful spacecraft and provide control data to compare Kerbin to space and other bodies we visit. We also completed our first contracts and made a decent amount of funds in the process. The program\u0027s next mission will build on this success and attempt to reach into space for the first time!\u003C/p\u003E\u003Cp\u003EPOST NOTE:\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003EThis is one of my first time\u0027s posting on a forum, let alone the KSP forum. As a consequence I am unsure of how exactly to insert pictures that aren\u0027t massive, I\u0027m currently using steam to take and host the screenshots. If anyone could tell me how to insert smaller, less obnoxious pictures or tell me where to find directions on how to do so, that would be great.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EUsing imgur as suggested. Thanks!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-11T04:22:29Z\u0022 title=\u002210/11/2015 04:22  AM\u0022 data-short=\u00228 yr\u0022\u003EOctober 11, 2015\u003C/time\u003E by samwiseiam25\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Bev7787","CreatedById":136501,"CreatedDateTime":"2015-10-11T02:40:11Z","Content":"\n\u003Cp\u003EUse imgur. You don\u0027t need an account to upload and you can post your reports in albums. Also great start!\u003C/p\u003E\n"},{"CreatedByName":"samwiseiam25","CreatedById":89962,"CreatedDateTime":"2015-10-12T02:32:51Z","Content":"\n\u003Cp\u003EThanks for the tip about imgur, it\u0027s much more convenient. I should have some more stuff up sometime in the next few days that\u0027s a little more exciting, since the first mission doesnt allow for much variety. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"samwiseiam25","CreatedById":89962,"CreatedDateTime":"2015-10-13T16:18:31Z","Content":"\n\u003Cp\u003EAfter the success of the initial flight, the Kerbal Space Agency directed its research efforts into Basic Rocketry, Survivability, and Engineering 101. With these new advancements, the next mission was designed as a sub-orbital flight to take advantage of the agency\u0027s contract to escape Kerbin\u0027s atmosphere and to gather our first science from space! To accomplish this mission, the engineers in the VAB proudly announced the development of the Kerput 2. This design adds a scientific materials bay attached to the command pod and incorporates a heat shield due to concerns that returning to Kerbin from space could be \u0022like, really hot, dude\u0022 according to our top scientific minds. This is also our first rocket to incorporate the concept of staging, dropping the dead weight of used-up fuel tanks and rocket motors in order to improve efficiency.\u003C/p\u003E\u003Cp\u003EThe Kerput 2 is long and thin, and the design team initially had some concerns about its stability in flight, however these concerns proved to be unfounded as Rookie pilot Valentina Kerman lifted off in the Kerput 2. She worked her way through the staging sequence until she achieved a suborbital trajectory, then focused on activating her crafts scientific instruments. Upon passing 70k in altitude, Valentina completed the contract to escape Kerbin\u0027s atmosphere and became the first kerbal to ever reach into space! While she was there, she also gathered the space program\u0027s first scientific data from space. The Kerput 2\u0027s capsule then made the first ever re-entry back into Kerbin\u0027s atmosphere, which produced flames around the craft and panic in mission control until Gene Kerman noticed that Valentina had slowed down safely thanks to her craft\u0027s heat shield and deployed her recovery parachute. Valentina made a gentle landing in Kerbin\u0027s sea and gathered a few more bits of scientific data before the recovery team arrived to take her home.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/60RBR\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003ESince this was our first suborbital flight, it also ended up completing a number of the World\u0027s First Contracts as well as returning enough science to allow our scientists to unlock General Rocketry and Advanced Rocketry. In addition, based on the limitations we encountered in terms of building heavy, complicated rockets and the number of contracts that we can hold at one time, the Agency has initiated upgrades of the Launchpad, VAB, and Mission Control building. These upgrades will allow us to more easily take on our next goal: getting the first Kerbal to orbit!\u003C/p\u003E\n"}]}