{"TopicId":123163,"ForumId":21,"TopicTitle":"Foil. SSTM Crew Trainer.","CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2015-10-16T11:50:28Z","PageNum":1,"Articles":[{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2015-10-16T11:50:28Z","Content":"\n\u003Cp\u003ENo, I didn\u0027t make a mistake in the title, this is not your usual SSTO. This is a single stage to \u003Cem\u003EMun\u003C/em\u003E. Or Minmus. Or \u003Cem\u003Eboth\u003C/em\u003E. Presenting the easiest way to get your crew to lvl 3 in a single flight!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/WX5qthB.png\u0022 alt=\u0022WX5qthB.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ESee, there\u0027s this mission profile that has been short of my standard for crew training before they step out of Kerbin\u0027s vicinity: visit Minmus, plant a flag, pop out of of Kerbin\u0027s sphere of influence for the briefest of periods, then reverse and boost back into Kerbin\u0027s SOI, getting a Mun encounter on the long way down, to finish with an aerobrake and back to base. It gives you just enough XPs (Flag on Minmus, solar orbit, and Mun flyby) to bring the kerbals cleanly into lvl3, where you unlock pretty much all the abilities worth having (specifically, all the repair abilities). Problem is, the dV Budget to do that is \u003Cem\u003Esteep\u003C/em\u003E. Going to Minmus saves you landing dV, but still, that\u0027s like 3-4km/s depending on how long you take to leave Kerbin\u0027s SOI and come back, and that is if you aerobrake for full effect and are really good at navigating. And since 1.0, aerobraking at interplanetary speeds is either tricky if you are a very good pilot in a thermal-proofed ship, or downright suicidal if you are not.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/yq4cKp6.png\u0022 alt=\u0022yq4cKp6.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis kind of mission is \u003Cem\u003Eexactly\u003C/em\u003E what my old, pre-1.0 Spatha was built to do, have a crapton of dV and just plunge in the good old souposphere to break at the end of a mission. Some of you might remember that ship... But nowadays that just won\u0027t fly with the reentry heating! So I\u0027ve had to actually improve on the performance, and quite a lot. But fear not! I did, and this is the result: After such a strenuous mission, the new Sabre gets back to Kerbin\u0027s atmosphere with \u003Cem\u003E800m/s still in its tanks\u003C/em\u003E. More than enough to slow you down to suborbital speeds before the reentry interface, but you also have a \u003Cem\u003Ehuge\u003C/em\u003E lifting ratio, and the thing is balanced really nice, so you can \u003Cem\u003Ealso\u003C/em\u003E reenter at frightening speeds, completely sideways to the airflow, and brake in the high atmosphere before things start to really heat up (tested at 2,900m/s at entry with a periapsis of 30kms). The thing is so light and \u0022lifty\u0022, it is like reentering on a leaf! And, no part has a less than 2000Ã‚Âº rating, just to further ease things.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/NlWcls2.png\u0022 alt=\u0022NlWcls2.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo now, a word or two on the user manual:\u003C/p\u003E\u003Cp\u003EFirst, never mind that orbital proofing pic up there, it says you only have about 2km/s on LKO, but that is because I didn\u0027t put any fuel lines there, to save weight and drag: you will have to move fuel manually from the wing tanks into the central rocket body. With that taken care of, your dV is around 3,250m/s.\u003C/p\u003E\u003Cp\u003ESecond, the thing is a leaf, with a ridiculously low wing loading. That \u003Cem\u003Ereally\u003C/em\u003E helps, making it rise like an elevator with minimal drag losses, tearing through the Mach barrier like it wasn\u0027t there, and aerobraking incredibly gently if you present all that surface to the atmosphere. But, it can also glide very far, and fast, if you go prograde, and I didn\u0027t put any airbrakes, so you can actually get to the runway a bit \u003Cem\u003Etoo\u003C/em\u003E fast if you don\u0027t take care. If that\u0027s the case, just circle around it until you speed goes below 100m/s or so. Turns out, having a lot of wing \u003Cem\u003Ereally\u003C/em\u003E cuts on drag, and this is an extreme example. If anything, the thing is a tiny bit unstable in roll, due to the anhedral tail, but hey, it looks awesome, so I\u0027ll allow it I guess. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 alt=\u0022:rolleyes:\u0022\u003E In any case, it is balanced enough so that you can actually maintain the \u0026gt;45Ã‚Âº angles of attack required to turn lift into drag, and make full use of a spaceplane\u0027s ability to brake much higher, and faster, than any capsule, without bouncing out of atmo.\u003C/p\u003E\u003Cp\u003EOh, and I almost forgot: ther is some oxidizer in there, but it\u0027s only for the kick out or Kerbin\u0027s atmosphere. It should run out just as you get your apoapsis out of the atmosphere, and afterwards the RAPIERs are pretty much useless until you reenter.\u003C/p\u003E\u003Cp\u003EAnd it think that\u0027s everything so, without further due, here you go! The customary album and DL, have fun trying it out.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/ajz0x\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022http://www./download/d04mcp6pj6f7wvj/SSTO\u002BMk\u002BLXIX\u002B-\u002BFoil.craft\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./download/d04mcp6pj6f7wvj/SSTO\u002BMk\u002BLXIX\u002B-\u002BFoil.craft\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ERune. I\u0027m not too sure on the name, tough... Foil or Sabre? Which one do \u003Cem\u003Eyou\u003C/em\u003E think suits it better?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-19T09:23:03Z\u0022 title=\u002210/19/2015 09:23  AM\u0022 data-short=\u00228 yr\u0022\u003EOctober 19, 2015\u003C/time\u003E by Rune\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Majorjim!","CreatedById":61954,"CreatedDateTime":"2015-10-16T12:42:15Z","Content":"\n\u003Cp\u003EHi Rune,\u003C/p\u003E\u003Cp\u003E So have you landed it on Mun? Also you say that it can land on Mun or Minmus or both. Can it single stage from Kerbin, land on Minmus take off land on Mun and return to Kerbin without refueling?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-16T12:51:32Z\u0022 title=\u002210/16/2015 12:51  PM\u0022 data-short=\u00228 yr\u0022\u003EOctober 16, 2015\u003C/time\u003E by Majorjim\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2015-10-16T13:07:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Majorjim\u0022 data-cite=\u0022Majorjim\u0022\u003E\u003Cdiv\u003EHi Rune,\u003Cp\u003E So have you landed it on Mun? Also you say that it can land on Mun or Minmus or both. Can it single stage from Kerbin, land on Minmus take off land on Mun and return to Kerbin without refueling?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe \u003Cem\u003Enumbers\u003C/em\u003E say it should do all those things (although Mun \u003Cem\u003Eand\u003C/em\u003E Minmus landed in the single mission is a bit iffy, and would certainly preclude going into solar orbit and require an efficient intermunar transfer), but, I haven\u0027t myself tested anything but the mission I outlined, plus a lot of atmospheric testing. Perhaps someone else can put a few screenies of it landed on Mun before I get around to it? Although I do have a base there full of rookies and a fresh batch of lvl 3\u0027s, so it might not be long...\u003C/p\u003E\u003Cp\u003EIn any case, the mission I described is like 2,5km/s (~1km/s to reach Minmus, ~0.5 to land and take off, and about another km/s to get to solar orbit quick and then turn back and reverse), and it does that with a 800m/s overhead, consistently, so after the ~2.5km/s of a munar mission, you have still almost another whole km/s to visit Minmus, and energetically, you are halfway there already while on Munar orbit. Also, the ascent would be very crucial, as would be how you use the abundant monoprop. As I said, since I skimped on fuel lines, it\u0027s a bit hard to judge until I\u0027ve tried it myself with 100% certainty.\u003C/p\u003E\u003Cp\u003ERune. But I think it \u003Cem\u003Ecan\u003C/em\u003E be done if you know your stuff. Feel challenged enough?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-16T13:16:12Z\u0022 title=\u002210/16/2015 01:16  PM\u0022 data-short=\u00228 yr\u0022\u003EOctober 16, 2015\u003C/time\u003E by Rune\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Majorjim!","CreatedById":61954,"CreatedDateTime":"2015-10-16T13:41:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rune\u0022 data-cite=\u0022Rune\u0022\u003E\u003Cdiv\u003EThe \u003Cem\u003Enumbers\u003C/em\u003E say it should do all those things (although Mun \u003Cem\u003Eand\u003C/em\u003E Minmus landed in the single mission is a bit iffy, and would certainly preclude going into solar orbit and require an efficient intermunar transfer), but, I haven\u0027t myself tested anything but the mission I outlined, plus a lot of atmospheric testing. Perhaps someone else can put a few screenies of it landed on Mun before I get around to it? Although I do have a base there full of rookies and a fresh batch of lvl 3\u0027s, so it might not be long...\u003Cp\u003EIn any case, the mission I described is like 2,5km/s (~1km/s to reach Minmus, ~0.5 to land and take off, and about another km/s to get to solar orbit quick and then turn back and reverse), and it does that with a 800m/s overhead, consistently, so after the ~2.5km/s of a munar mission, you have still almost another whole km/s to visit Minmus, and energetically, you are halfway there already while on Munar orbit. Also, the ascent would be very crucial, as would be how you use the abundant monoprop. As I said, since I skimped on fuel lines, it\u0027s a bit hard to judge until I\u0027ve tried it myself with 100% certainty.\u003C/p\u003E\u003Cp\u003ERune. But I think it \u003Cem\u003Ecan\u003C/em\u003E be done if you know your stuff. Feel challenged enough?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI always get a kind of muscle twitch anytime people say a craft can do something without actually doing it themselves. so do \u003Cem\u003Eyou\u003C/em\u003E feel challenged enough?!\u003C/p\u003E\u003Cp\u003E LOL, teasing aside my SSTO flying skills are laying withered and shivering unused in a corner so I wont be trying it myself. As we would say here in England, I went to the \u0027other\u0027 place.\u003C/p\u003E\n"},{"CreatedByName":"Kevin Kyle","CreatedById":110492,"CreatedDateTime":"2015-10-16T14:09:56Z","Content":"\n\u003Cp\u003ENice , might have to try this one out. So many ships, so little time. Thanks to you and all who build these wonderful toys to play with. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2015-10-16T14:10:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kevin Kyle\u0022 data-cite=\u0022Kevin Kyle\u0022\u003E\u003Cdiv\u003ENice , might have to try this one out. So many ships, so little time. Thanks to you and all who build these wonderful toys to play with. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou are welcome! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Majorjim\u0022 data-cite=\u0022Majorjim\u0022\u003E\u003Cdiv\u003EI always get a kind of muscle twitch anytime people say a craft can do something without actually doing it themselves. so do \u003Cem\u003Eyou\u003C/em\u003E feel challenged enough?!\u003Cp\u003E LOL, teasing aside my SSTO flying skills are laying withered and shivering unused in a corner so I wont be trying it myself. As we would say here in England, I went to the \u0027other\u0027 place.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThen again, you are always jumping to conclusions a bit... I said it can go to Mun and Minus, but I only talked about the mission I use it for, which involves only landing on Minmus, but visits both satellites, and solar orbit too. So technically, yeah, I\u0027ve done it myself. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt is unlikely that I will go for a Minmus/Mun tour soon, my career save is neglected enough as it is of late. It\u0027s time I visit some planets out there and actually use my stuff! Still, I\u0027m interested to see how much the dV meter reads when on the Munar surface.\u003C/p\u003E\u003Cp\u003ERune. Not much playing time these days.\u003C/p\u003E\n"},{"CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2015-10-16T14:34:20Z","Content":"\n\u003Cp\u003EIf it\u0027s stock, where did you get the plant things. And are they going to be in stock at some point. Growing moon food would be a lot of fun. Maybe they should get together with the guys who make \u0022Take on mars\u0022 and similar games and put all that type of stuff into planetary items and bases. Could be cool!\u003C/p\u003E\n"},{"CreatedByName":"Majorjim!","CreatedById":61954,"CreatedDateTime":"2015-10-16T14:51:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rune\u0022 data-cite=\u0022Rune\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThen again, you are always jumping to conclusions a bit... I said it can go to Mun and Minus, but I only talked about the mission I use it for, which involves only landing on Minmus, but visits both satellites, and solar orbit too. So technically, yeah, I\u0027ve done it myself. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt is unlikely that I will go for a Minmus/Mun tour soon, my career save is neglected enough as it is of late. It\u0027s time I visit some planets out there and actually use my stuff! Still, I\u0027m interested to see how much the dV meter reads when on the Munar surface.\u003C/p\u003E\u003Cp\u003ERune. Not much playing time these days.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think your description is misleading. Saying you can \u0027visit\u0027 both implies you landed. That\u0027s all. I am not jumping to conclusions at all.\u003C/p\u003E\u003Cp\u003E I just personally disagree with saying something can do something when even the designer has not done it. It goes against my ethos becuase even if the numbers say so it may be impossible for a human to complete it. And you knew perfectly well what I was referring to when I said have you done it.\u003C/p\u003E\u003Cp\u003E And the answer is no. Just for clarity of course. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E And, yes, this is just my opinion. And dude, you say you dont have time to play but you flew it to minmus, around Mun and back but, what, didn\u0027t have time to land?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-16T15:15:31Z\u0022 title=\u002210/16/2015 03:15  PM\u0022 data-short=\u00228 yr\u0022\u003EOctober 16, 2015\u003C/time\u003E by Majorjim\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ExplorerKlatt","CreatedById":107424,"CreatedDateTime":"2015-10-16T16:08:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Arugela\u0022 data-cite=\u0022Arugela\u0022\u003E\u003Cdiv\u003EIf it\u0027s stock, where did you get the plant things. And are they going to be in stock at some point. Growing moon food would be a lot of fun. Maybe they should get together with the guys who make \u0022Take on mars\u0022 and similar games and put all that type of stuff into planetary items and bases. Could be cool!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe plant thing are from USI-LS. The craft itself is stock. It\u0027s just landed next to a base that isn\u0027t entirely stock.\u003C/p\u003E\n"},{"CreatedByName":"ryan234abc","CreatedById":136492,"CreatedDateTime":"2015-10-16T16:15:10Z","Content":"\n\u003Cp\u003EGreat craft as always. I\u0027ve learnt to never expect anything bad by now, and I hold to the fact that there never will be. This\u0027ll be handy for sure. A question for you though. How do you go about landing plane, SSTO\u0027s etc on atmosphericless planets? I\u0027d imagine you just landing it like a rocket and tip forward at the last second, but there has to be a better way to do this. Tylo would prove a challenge to do this on for sure...\u003C/p\u003E\u003Cp\u003EAnyway, another great craft. Love the joint tail fin btw.\u003C/p\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2015-10-16T16:41:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ryan234abc\u0022 data-cite=\u0022ryan234abc\u0022\u003E\u003Cdiv\u003EGreat craft as always. I\u0027ve learnt to never expect anything bad by now, and I hold to the fact that there never will be. This\u0027ll be handy for sure. A question for you though. How do you go about landing plane, SSTO\u0027s etc on atmosphericless planets? I\u0027d imagine you just landing it like a rocket and tip forward at the last second, but there has to be a better way to do this. Tylo would prove a challenge to do this on for sure...\u003Cp\u003EAnyway, another great craft. Love the joint tail fin btw.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks! But I\u0027m sure I can be less than inspired every now and then... I just have set myself a good standard on R-SUV to measure against, and see if something is release-worthy. And yeah, I land them just like rockets, tipping over at the last second. It\u0027s one of the reasons of the tail, actually, it\u0027ll tend to drop you on your landing gear and protects the nuke from rough landings. WWhich, incidentally, I totally stole from someone else when I saw it on the SSTO thread, but I can\u0027t remember who to thank right now. ^^\u0027\u003C/p\u003E\u003Cp\u003EOn other models, like the Javelin, I have added vertical landing gear, it\u0027s not hard if you are willing to take a slight drag hit and make the whole thing easier. Besides, the tipping maneuver, as you say, only work on the lower gravities... you have to take off afterwards!\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ExplorerKlatt\u0022 data-cite=\u0022ExplorerKlatt\u0022\u003E\u003Cdiv\u003EThe plant thing are from USI-LS. The craft itself is stock. It\u0027s just landed next to a base that isn\u0027t entirely stock.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYup, exactly that. And just to clarify, no fuel was exchanged there, I just docked to refresh the TAC clock with a prototype that didn\u0027t have backup drone control for when the kerbals go on strike.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Majorjim\u0022 data-cite=\u0022Majorjim\u0022\u003E\u003Cdiv\u003EI think your description is misleading. Saying you can \u0027visit\u0027 both implies you landed. That\u0027s all. I am not jumping to conclusions at all.\u003Cp\u003E I just personally disagree with saying something can do something when even the designer has not done it. It goes against my ethos becuase even if the numbers say so it may be impossible for a human to complete it. And you knew perfectly well what I was referring to when I said have you done it.\u003C/p\u003E\u003Cp\u003E And the answer is no. Just for clarity of course. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E And, yes, this is just my opinion. And dude, you say you dont have time to play but you flew it to minmus, around Mun and back but, what, didn\u0027t have time to land?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EVisiting can mean many things. For example, a SSTM could perfectly well be something that does a free return. Or get there one-way. Or you wouldn\u0027t say Apollo 8 visited the Moon? In any case, semantics.\u003C/p\u003E\u003Cp\u003EAs to playing time... well, this was built at the beginning of September. Only now did I finish the two inaugural missions, both of which were made to ever so slowly advance my save towards interplanetary flight. Total amount of time spent outside career since then? Zero. So, yeah, it should be clear from my releasing tempo lately that I don\u0027t have the time to build and test exhaustively. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E And during my limited playtime, anyhow, I will only do the stuff that I enjoy doing, really, I think that is the sensible thing, or I would burn out very quickly if I took it as an obligation or something.\u003C/p\u003E\u003Cp\u003ERune. In any case, I think it is very clearly stated in the OP, what the reference mission is.\u003C/p\u003E\n"},{"CreatedByName":"Majorjim!","CreatedById":61954,"CreatedDateTime":"2015-10-16T17:00:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rune\u0022 data-cite=\u0022Rune\u0022\u003E\u003Cdiv\u003EThanks! But I\u0027m sure I can be less than inspired every now and then... I just have set myself a good standard on R-SUV to measure against, and see if something is release-worthy. And yeah, I land them just like rockets, tipping over at the last second. It\u0027s one of the reasons of the tail, actually, it\u0027ll tend to drop you on your landing gear and protects the nuke from rough landings. WWhich, incidentally, I totally stole from someone else when I saw it on the SSTO thread, but I can\u0027t remember who to thank right now. ^^\u0027\u003Cp\u003EOn other models, like the Javelin, I have added vertical landing gear, it\u0027s not hard if you are willing to take a slight drag hit and make the whole thing easier. Besides, the tipping maneuver, as you say, only work on the lower gravities... you have to take off afterwards!\u003C/p\u003E\u003Cp\u003EYup, exactly that. And just to clarify, no fuel was exchanged there, I just docked to refresh the TAC clock with a prototype that didn\u0027t have backup drone control for when the kerbals go on strike.\u003C/p\u003E\u003Cp\u003EVisiting can mean many things. For example, a SSTM could perfectly well be something that does a free return. Or get there one-way. Or you wouldn\u0027t say Apollo 8 visited the Moon? In any case, semantics.\u003C/p\u003E\u003Cp\u003EAs to playing time... well, this was built at the beginning of September. Only now did I finish the two inaugural missions, both of which were made to ever so slowly advance my save towards interplanetary flight. Total amount of time spent outside career since then? Zero. So, yeah, it should be clear from my releasing tempo lately that I don\u0027t have the time to build and test exhaustively. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E And during my limited playtime, anyhow, I will only do the stuff that I enjoy doing, really, I think that is the sensible thing, or I would burn out very quickly if I took it as an obligation or something.\u003C/p\u003E\u003Cp\u003ERune. In any case, I think it is very clearly stated in the OP, what the reference mission is.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOk Rune, I just wanted to say what I said. We have to agree to disagree. See ya.\u003C/p\u003E\n"},{"CreatedByName":"CrashTestDanny","CreatedById":151030,"CreatedDateTime":"2015-10-16T20:14:02Z","Content":"\n\u003Cp\u003ESweet looking ship! Have some more rep - I know you need it!\u003C/p\u003E\n"},{"CreatedByName":"Redshift OTF","CreatedById":78679,"CreatedDateTime":"2015-10-16T21:39:50Z","Content":"\n\u003Cp\u003EBeautiful and functional! I will have to try this one.\u003C/p\u003E\n"},{"CreatedByName":"Himynameisjake","CreatedById":101602,"CreatedDateTime":"2015-10-17T00:08:21Z","Content":"\n\u003Cp\u003EMake up your mind on the intakes! lol\u003C/p\u003E\n"},{"CreatedByName":"CrashTestDanny","CreatedById":151030,"CreatedDateTime":"2015-10-17T05:56:59Z","Content":"\n\u003Cp\u003EOk Wow...\u003C/p\u003E\u003Cp\u003EI just SSTO\u0027ed this thing first try. Made it to SubO 72k x 44k with 4920 deltaV left. That means 4700 left after circularization... wow...\u003C/p\u003E\n"},{"CreatedByName":"Camaron","CreatedById":100218,"CreatedDateTime":"2015-10-17T06:06:32Z","Content":"\n\u003Cp\u003EOh neet. I think I\u0027ll tear it apart and build a giant one \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003ESeems to be my thing. Something works. Let\u0027s scale it up until it doesn\u0027t!\u003C/p\u003E\n"},{"CreatedByName":"CrashTestDanny","CreatedById":151030,"CreatedDateTime":"2015-10-17T06:09:43Z","Content":"\n\u003Cp\u003EThat\u0027s my official Flight Test report: Wow.\u003C/p\u003E\u003Cp\u003EThat\u0027s what I\u0027m looking for in a spaceplane!! \u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/oPhYA\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003E4894 delta-V on LKO. Headed for Min now...\u003C/p\u003E\u003Cp\u003EDanny\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Camaron\u0022 data-cite=\u0022Camaron\u0022\u003E\u003Cdiv\u003EOh neet. I think I\u0027ll tear it apart and build a giant one \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003Cp\u003ESeems to be my thing. Something works. Let\u0027s scale it up until it doesn\u0027t!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELOL! Love it!\u003C/p\u003E\u003Cp\u003EDanny\u003C/p\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2015-10-17T10:21:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Redshift OTF\u0022 data-cite=\u0022Redshift OTF\u0022\u003E\u003Cdiv\u003EBeautiful and functional! I will have to try this one.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGlad you like it! I hope it serves our needs well.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Himynameisjake\u0022 data-cite=\u0022Himynameisjake\u0022\u003E\u003Cdiv\u003EMake up your mind on the intakes! lol\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat do you mean?\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Camaron\u0022 data-cite=\u0022Camaron\u0022\u003E\u003Cdiv\u003EOh neet. I think I\u0027ll tear it apart and build a giant one \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003Cp\u003ESeems to be my thing. Something works. Let\u0027s scale it up until it doesn\u0027t!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHehehe, that\u0027s a funny one. Tell us how it goes!\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CrashTestDanny\u0022 data-cite=\u0022CrashTestDanny\u0022\u003E\u003Cdiv\u003EThat\u0027s my official Flight Test report: Wow.\u003Cp\u003EThat\u0027s what I\u0027m looking for in a spaceplane!! \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/oPhYA\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/oPhYA\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E4894 delta-V on LKO. Headed for Min now...\u003C/p\u003E\u003Cp\u003EDanny\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003ELOL! Love it!\u003C/p\u003E\u003Cp\u003EDanny\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo Mechjeb can make the calculation right. I didn\u0027t think it had quite so much dV! Thanks for the thorough testing, as always.\u003C/p\u003E\u003Cp\u003ERune. Damn posting from a phone is crappy.\u003C/p\u003E\n"},{"CreatedByName":"RAINCRAFTER","CreatedById":127524,"CreatedDateTime":"2015-10-17T13:40:36Z","Content":"\n\u003Cp\u003EI\u0027m posting from an IOS device too! YAYYYYY Anyway, I think it\u0027s a good craft. Get Rep\u0027d!\u003C/p\u003E\n"},{"CreatedByName":"CrashTestDanny","CreatedById":151030,"CreatedDateTime":"2015-10-17T15:35:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rune\u0022 data-cite=\u0022Rune\u0022\u003E\u003Cdiv\u003ESo Mechjeb can make the calculation right. I didn\u0027t think it had quite so much dV! Thanks for the thorough testing, as always.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s not actually something I would bank on in a spaceplane. The number changes without any fuel usage and I haven\u0027t quite figured that out. Yet... Especially since it went up after moving fuel around and locking the tanks that the Rapiers are directly attached to... Let\u0027s calculate it ourselves and see...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/BRu1mbC.png\u0022 alt=\u0022BRu1mbC.png\u0022\u003E\u003C/p\u003E\u003Cp\u003Eln(Mstart/Mend) * Isp * 9.81 ought to be simple enough, right?\u003C/p\u003E\u003Cp\u003EMstart looks like 23.258. Mend looks like 17.050. (current mass, dry mass from the readout).\u003C/p\u003E\u003Cp\u003EIsp of the Nerv is 800 and there\u0027s only one of them...\u003C/p\u003E\u003Cp\u003Eso ln(23.258/17.050) works out to... ln(1.36410557...) = 0.310498955...\u003C/p\u003E\u003Cp\u003Ethat * 800 is 248.4 and multiplied by 9.81 is 2436.8... I must have missed something... I\u0027ll try to figure it out later... lol...\u003C/p\u003E\u003Cp\u003EDanny\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EOk - I think I partially understand what MechJeb is doing here. First, if we add in the Isp from the Rapiers, we get a whole lot closer to MechJeb\u0027s numbers (4200ish), which is clearly wrong since the Rapiers are paperweights until we return to an atmosphere. The 2400 I calculated is still a little high because some of the fuel is reserved for the Rapiers during said return flight. It seems that neither MechJeb (reports false numbers) nor KER (refuses to report) understand which fuel is going to go where, which probably means that the crossfeed and/or fuel pump mods and/or KSP are not reporting something correctly... but analyzing code is too much like work for me - I\u0027m just gonna fly it and see what happens. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\u003Cp\u003EI think my delta-V budget for landing on Min, then escaping Kerbin and coming back via the Mun should be under 2k anyhow, right? Let\u0027s see... Insertion 160, landing 180, ascent 180, escape (Min) 160, escape (Kerbin) 20, return 90... that\u0027s 790 - I have 2400... I can do it with three or four little mistakes and still be able to glide in... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\u003Cp\u003ESounds like a plan, right?\u003C/p\u003E\u003Cp\u003EDanny\u003C/p\u003E\n"},{"CreatedByName":"Azimech","CreatedById":50750,"CreatedDateTime":"2015-10-17T15:54:43Z","Content":"\n\u003Cp\u003EThat\u0027s a very nice ship!\u003C/p\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2015-10-17T15:58:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CrashTestDanny\u0022 data-cite=\u0022CrashTestDanny\u0022\u003E\u003Cdiv\u003EThat\u0027s not actually something I would bank on in a spaceplane. The number changes without any fuel usage and I haven\u0027t quite figured that out. Yet... Especially since it went up after moving fuel around and locking the tanks that the Rapiers are directly attached to... Let\u0027s calculate it ourselves and see...\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/BRu1mbC.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/BRu1mbC.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Eln(Mstart/Mend) * Isp * 9.81 ought to be simple enough, right?\u003C/p\u003E\u003Cp\u003EMstart looks like 23.258. Mend looks like 17.050. (current mass, dry mass from the readout).\u003C/p\u003E\u003Cp\u003EIsp of the Nerv is 800 and there\u0027s only one of them...\u003C/p\u003E\u003Cp\u003Eso ln(23.258/17.050) works out to... ln(1.36410557...) = 0.310498955...\u003C/p\u003E\u003Cp\u003Ethat * 800 is 248.4 and multiplied by 9.81 is 2436.8... I must have missed something... I\u0027ll try to figure it out later... lol...\u003C/p\u003E\u003Cp\u003EDanny\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EOk - I think I partially understand what MechJeb is doing here. First, if we add in the Isp from the Rapiers, we get a whole lot closer to MechJeb\u0027s numbers (4200ish), which is clearly wrong since the Rapiers are paperweights until we return to an atmosphere. The 2400 I calculated is still a little high because some of the fuel is reserved for the Rapiers during said return flight. It seems that neither MechJeb (reports false numbers) nor KER (refuses to report) understand which fuel is going to go where, which probably means that the crossfeed and/or fuel pump mods and/or KSP are not reporting something correctly... but analyzing code is too much like work for me - I\u0027m just gonna fly it and see what happens. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\u003Cp\u003EI think my delta-V budget for landing on Min, then escaping Kerbin and coming back via the Mun should be under 2k anyhow, right? Let\u0027s see... Insertion 160, landing 180, ascent 180, escape (Min) 160, escape (Kerbin) 20, return 90... that\u0027s 790 - I have 2400... I can do it with three or four little mistakes and still be able to glide in... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\u003Cp\u003ESounds like a plan, right?\u003C/p\u003E\u003Cp\u003EDanny\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh, so Mechjeb is also confused. Move all the fuel towards the center tanks, it\u0027s the best plaace for it. I really tought long and hard about piping it up... But honestly, you only need to move it once, and at leisure once in space. The RAPIERs can draw it wherever it is if you ever re-light them, so don\u0027t worry about that. All in all, you should have quite a bit more than those 2km/s, at least one more.\u003C/p\u003E\u003Cp\u003ERune. You might have some fuel still in the wings, too\u003C/p\u003E\n"},{"CreatedByName":"Castille7","CreatedById":101668,"CreatedDateTime":"2015-10-17T17:55:00Z","Content":"\n\u003Cp\u003EIt\u0027s enough challenge building an SSTO and you made one to do this, definitely deserves REP but I can\u0027t rep you again yet and I am ok with that its a good thing to spread the love around, I\u0027ll catch you later on that rep\u003C/p\u003E\n"},{"CreatedByName":"SlithyTove","CreatedById":151140,"CreatedDateTime":"2015-10-17T18:49:58Z","Content":"\n\u003Cp\u003EVery nice. \u003C/p\u003E\u003Cp\u003EI just did a similar training run with my XP Bus.\u003C/p\u003E\u003Cp\u003EYours looks to be much less expensive though.......\u003C/p\u003E\u003Cp\u003EAs far as the name goes.... Foil for sure. Since a foil is in fact, a training implement to use to learn a rapier. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"}]}