{"TopicId":123362,"ForumId":55,"TopicTitle":"Enable faster physics warp for very low TWR craft","CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-10-19T12:59:24Z","PageNum":1,"Articles":[{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-10-19T12:59:24Z","Content":"\n\u003Cp\u003EHaving extremely low TWR craft in the game (ion drive, nukes pushing very big craft) makes for an interesting gameplay mechanic. It\u0027s a fun challenge to navigate your way in orbit when you can only make very gentle nudges to the craft.\u003C/p\u003E\u003Cp\u003EHowever, having to sit in front of the computer for literally hours to complete a burn is major un-fun. It\u0027s not a difficulty challenge, it\u0027s just tedious.\u003C/p\u003E\u003Cp\u003ESuggestion: Enable higher physics warp speeds for very low TWR craft. The first notch up from the current max of 4 would be, say, 10. Could stop there, or possibly offer higher some higher tiers in factors of two (20, 40, 80).\u003C/p\u003E\u003Cp\u003ETo make this playable and not godawfully bug-prone, the game can put some limitations on the feature that prevent going to the really-high warp unless all criteria are met:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ECraft must not be in atmosphere.\u003Cbr\u003E\u003Cul\u003E\u003Cli\u003EHitting atmosphere while in accelerated mode drops the physics warp down to 4.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E[*]Ship acceleration (TWR) must not be higher than the allowable amount.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EThe allowable TWR goes down as the physics warp rate goes up, i.e. warp-20 would have half the limit that warp-10 does.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EIf the TWR increases past the limit while in accelerated mode (e.g. due to better mass ratio after burning fuel, or because the player throttled up or activated more engines), it automatically drops down to the next-lower allowable limit.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E[*]There can\u0027t be any other craft within the \u0022physics bubble\u0022 (2.3 km) that causes them to run not-on-rails.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EOr perhaps they\u0027re allowed to be, as long as they themselves meet all the criteria, e.g. are not themselves accelerating or in atmosphere, etc.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EIf something comes in range that breaks the criteria, the physics warp drops down to 4.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E[*]All reaction-wheel torque is damped down to warp-4 levels.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EExample: if you\u0027re running at physics warp 10, the reaction wheels are running at 40% strength. At physics warp 20, they\u0027d be running at 20% strength.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThis is to make the ship controllable without light touches making it spaz out.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EIt also stops SAS from shaking the ship to pieces.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E[*]If the ship is in a location where the \u0022normal\u0022 (non-physics) timewarp would be limited to a speed \u0026lt; 10 (e.g. due to being very low altitude over a planet), then physics warp is automatically dropped down to 4.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E...you get the idea. If I\u0027ve missed a spot, it would be handled as described above.\u003C/p\u003E\u003Cp\u003EThis wouldn\u0027t let players do anything they can\u0027t already do, and with proper care and attention to implementation details as described above, I don\u0027t see why it would cause programmatic issues or bugs in the physics simulation. All it would do is take a lot of pointless tedium out of the game, and encourage more exploration of interesting ship designs.\u003C/p\u003E\n"},{"CreatedByName":"Balto-the-Wolf-Dog","CreatedById":17192,"CreatedDateTime":"2015-10-19T13:38:24Z","Content":"\n\u003Cp\u003EInterstellar mod has a function for solar sails that allows them to operate even on rails (I assume by editing the trajectory directly). I\u0027d love to see ions do that stock, especially in tandem with realistic performance. It would make burn-all-the-way transfers performable.\u003C/p\u003E\n"},{"CreatedByName":"mattinoz","CreatedById":118580,"CreatedDateTime":"2015-10-19T22:30:25Z","Content":"\n\u003Cp\u003EDo physics in KSP/Unity reach equilibrium?\u003C/p\u003E\u003Cp\u003EI mean situations like this with constant acceleration in a vacuum the forces on the craft must reach a point that it obvious craft won\u0027t fall apart. \u003C/p\u003E\u003Cp\u003EThere must be a point like that when physics calculations are just going to produces exactly the same results and could be scaled back to allow higher rails like warps.\u003C/p\u003E\n"},{"CreatedByName":"waterlubber","CreatedById":119333,"CreatedDateTime":"2015-10-19T22:40:13Z","Content":"\n\u003Cp\u003EI would also like to see the game increasing joint strength by an equivalent factor, and running the thermal system at normal speed. Perhaps in a similar fashion to \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/134152-Advanced-%28Multi-Threaded%29-Physics-Warp\u0022 rel=\u0022external nofollow\u0022\u003Ethis \u003C/a\u003Emulti-threaded physics warp idea I had. I agree though, this would be great!\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mattinoz\u0022 data-cite=\u0022mattinoz\u0022\u003E\u003Cdiv\u003EDo physics in KSP/Unity reach equilibrium?\u003Cp\u003EI mean situations like this with constant acceleration in a vacuum the forces on the craft must reach a point that it obvious craft won\u0027t fall apart. \u003C/p\u003E\u003Cp\u003EThere must be a point like that when physics calculations are just going to produces exactly the same results and could be scaled back to allow higher rails like warps.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis would be fairly difficult to implement. Maybe we just tighten up the joints?\u003C/p\u003E\n"},{"CreatedByName":"NeatCrown","CreatedById":101431,"CreatedDateTime":"2015-10-19T23:43:26Z","Content":"\n\u003Cp\u003EI found one a while ago, but I\u0027m not sure if \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/69363-0-25-Time-Control-9-23-14-v13-2/page26\u0022 rel=\u0022external nofollow\u0022\u003Ethis\u003C/a\u003E is it. Also, this one\u0027s from 0.25, so it\u0027s likely not compatible (I haven\u0027t tried it out myself). But it seems someone made a patch.\u003C/p\u003E\n"},{"CreatedByName":"uncle_jew","CreatedById":152178,"CreatedDateTime":"2015-10-22T00:41:33Z","Content":"\n\u003Cp\u003EFully agree - KSP has a great xenon engine, but it\u0027s completely useless because I would have to stare at the screen for like 30 minutes even with a 4x physics warp. I also keep using bigger chemical engines for orbital maneuvers than necessary, again mostly to avoid having to wait during the burn.\u003C/p\u003E\u003Cp\u003EIf the ship\u0027s parts are in equilibrium (as usually is the case with low thrust), this doesn\u0027t need much more calculations than coasting without thrust.\u003C/p\u003E\n"}]}