{"TopicId":123464,"ForumId":20,"TopicTitle":"What Graphic mods work on 1.0.4","CreatedByName":"NateDaBeast","CreatedById":150489,"CreatedDateTime":"2015-10-21T00:17:39Z","PageNum":1,"Articles":[{"CreatedByName":"NateDaBeast","CreatedById":150489,"CreatedDateTime":"2015-10-21T00:17:39Z","Content":"\n\u003Cp\u003EHello, I\u0027ve recently started using some graphics mod like EVE, but sometimes on the map view and when looking at Kerbin, half of the planet turns into a mix of grey and white and ruins everything with EVE.\u003C/p\u003E\u003Cp\u003ESo I\u0027m wondering what mod\u0027s do you use for graphic enhancements ?\u003C/p\u003E\n"},{"CreatedByName":"G\u0026#039;th","CreatedById":98595,"CreatedDateTime":"2015-10-21T00:48:28Z","Content":"\n\u003Cp\u003EWell, there\u0027s two versions of EVE. One is stable and works well still, and the other is still a WIP and likely buggy for pretty much everybody. Sounds like you may have gotten the latter. Or you installed something wrong. Who knows.\u003C/p\u003E\u003Cp\u003EAnyway, .24 EVE does work. As does Astronomer\u0027s Interstellar (most of it. And actually I think his previous packs still work too, though I haven\u0027t used them) and Avg\u0027s Cloud pack. TextureReplacer of course still works fine. KSPRC IIRC works but takes some doing to get it going. Distant Object and Planetshine are working. \u003C/p\u003E\u003Cp\u003EBut I would check out this thread:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/136815-Avg-s-Visual-Ultimatum-76-non-part-mods-to-enhance-stock-visual-sound-and-veteran-career-gameplay\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/136815-Avg-s-Visual-Ultimatum-76-non-part-mods-to-enhance-stock-visual-sound-and-veteran-career-gameplay\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAvg put a large list together of pretty much every working visual enhancement mod as well as some others that go in that direction. I\u0027m someone who likes to scour the Addon forum (among other places) every day looking for new things to add and he still managed to post some things I hadn\u0027t seen yet.\u003C/p\u003E\n"},{"CreatedByName":"Red Shirt","CreatedById":147465,"CreatedDateTime":"2015-10-21T11:53:07Z","Content":"\n\u003Cp\u003EEVE, the older one, works fine except for the greying dark side that happens because the city lights texture files are tga format. If you keep EVE then download and install Edge of Oblivion (highly recommend) it has png format texture files for the city lights. You will need to go into game data / boulder/ city lights / textures and remove the tga files. Works well for me.\u003C/p\u003E\n"},{"CreatedByName":"Thahat","CreatedById":100130,"CreatedDateTime":"2015-10-21T12:30:57Z","Content":"\n\u003Cp\u003Eoriginal eve(the one you have) but the gray and white thing is caused by an error in citylights (as far as i remember)\u003C/p\u003E\u003Cp\u003Eif i rmeember correctly there is a folder somewhere called citylights, remove that one, no more odd gray/white dark side of the planet.\u003C/p\u003E\u003Cp\u003Ethen if you want to be fancy (and you do) add scatterer.\u003C/p\u003E\u003Cp\u003Ethen add planetlighting\u003C/p\u003E\u003Cp\u003Ethen because your ram will curse at you, google how to put ksp into open-gl mode, and do that.\u003C/p\u003E\u003Cp\u003Ebut because you want prety stuff, let your graphics card overwrite ksp\u0027s opengl settings so you can have you pie and eat it too \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E (specifically, let it overwrite the anti-aliassing setting, to at least 2x)\u003C/p\u003E\u003Cp\u003Eand then play the game, and see that it is BEUTIFULL, during sunrises over kerbin XD\u003C/p\u003E\u003Cp\u003Eafterwards\u003C/p\u003E\n"}]}