{"TopicId":12355,"ForumId":34,"TopicTitle":"[PART, 1.0.2] Anatid Robotics / MuMech - MechJeb - Autopilot - Historical thread","CreatedByName":"r4m0n","CreatedById":5404,"CreatedDateTime":"2012-06-08T22:30:41Z","PageNum":275,"Articles":[{"CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2014-05-31T09:26:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022modernwar90\u0022 data-cite=\u0022modernwar90\u0022\u003E\u003Cdiv\u003EWhat would I be doing wrong with them? I don\u0027t see how you can use docking ports wrong so MechJeb doesn\u0027t work because of them... I just click them onto the side of a rockomax hubmax like you\u0027re supposed to... I even manually set the MechJeb pod \u0022control from here\u0022.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you\u0027re using the MJ pod itself as the control point, and it\u0027s not aligned so that when the ship is on the pad the navball is \u0027straight up\u0027 and all blue, the ship won\u0027t fly right. You have to set control to a pod or docking port or other part that\u0027s aligned with the thrust axis. You only want to set control to a side mounted docking port when you\u0027re doing things like docking.\u003C/p\u003E\u003Cp\u003EWhich by the way is NOT the problem I\u0027m having with MechJeb\u0027s not working with a Kethane salvage craft that has two 16K tanks but works fine with one that has two 8K tanks.\u003C/p\u003E\n"},{"CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2014-05-31T10:53:11Z","Content":"\n\u003Cp\u003EI just did a test of a KSP install with no mods other than the latest MechJeb build, MJ put on the pods with Module Manager and Hyperedit so I don\u0027t have to launch and fly test ships all the way.\u003C/p\u003E\u003Cp\u003EA very simple, newly made craft \u003Ca href=\u0022http://pastebin.com/YSAS0PHd\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://pastebin.com/YSAS0PHd\u003C/a\u003E with a new name so there\u0027s no profile for it. Popped it to a 20KM Mun orbit then I tried to use Maneuver Planner to change the inclination to 2 degrees.\u003C/p\u003E\u003Cp\u003EWhat happened? Exactly the same issue I\u0027ve been having with my main KSP setup. It warped to the node and started to do the burn correctly but when it got down to 0.3 m/sec left it cut the engine to idle, aimed the exhaust at the Mun then sat there gently wobbling around. Sometimes it doesn\u0027t even start the maneuver correctly, it\u0027ll just aim the engine at the Mun then do the idle and wobble thing.\u003C/p\u003E\u003Cp\u003EOutput log from that flight. \u003Ca href=\u0022http://pastebin.com/dv70aHnU\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://pastebin.com/dv70aHnU\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EEdit- I bet it\u0027s something hyperedit is or is not doing when it moves a craft. Just hit me that with .23.5 maneuver planner has failed to work correctly with every craft I have moved with hyperedit but has worked with crafts I have launched and used MJ to fly to their destination.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-31T11:10:17Z\u0022 title=\u002205/31/2014 11:10  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 31, 2014\u003C/time\u003E by Galane\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"joemama","CreatedById":111999,"CreatedDateTime":"2014-05-31T18:25:12Z","Content":"\n\u003Cp\u003EHello all. first post. Where do i put the icons folder that is in the mechjeb download? Do i put the parts into the parts folder in the gamedata folder or the parts folder in the ksp folder? Just got back to ksp after a year off so dying to try all this new stuff but i need mechjeb to enjoy myself\u003C/p\u003E\n"},{"CreatedByName":"Pondafarr","CreatedById":99169,"CreatedDateTime":"2014-05-31T19:49:18Z","Content":"\n\u003Cp\u003EInquiry: what is the suggested KSP approach procedures for using Spaceplane Guidance autoland? Should I be at a specific distance, specific altitude, glide angle, how should my prograde vector be positioned in relation to the ILS target, etc etc.\u003C/p\u003E\u003Cp\u003ESearched all over, can\u0027t find a good guide on how to use it.\u003C/p\u003E\n"},{"CreatedByName":"Holocus","CreatedById":89107,"CreatedDateTime":"2014-05-31T20:01:49Z","Content":"\n\u003Cp\u003EIs it just me or has MechJeb become a bit \u0027wonky\u0027 lately? Running KSP v 0.23.5.464 and Mechjeb 2-2.2.1.257 (from the latest devbuild, same problems as with the 2.2.1 release) brand new installs of KSP and mechjeb\u003C/p\u003E\u003Cp\u003EAnd it seems to simply ignore the Force Roll option when using docking autopilot \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnother problem I have noticed is when using the transfer to other planet option. it sets a course with about 3times the thust needed and tries to blast staight into Kerbin. it does however set the correct course if I wait until about 15 mins until the burn and clears it and creates a new node. (tested towards Duna and Eve)\u003C/p\u003E\u003Cp\u003EIt also doesn\u0027t set correct inclination anylonger for transfers to MinMus or to Moho (only tested towards those) resulting in a massive course correction needed\u003C/p\u003E\u003Cp\u003EThese issues I think started appearing after the KSP 0.23 version, never had any of these problems before. \u003C/p\u003E\u003Cp\u003EAnyone else noticing these issues or is there something I\u0027m missing?\u003C/p\u003E\u003Cp\u003E/Holocus\u003C/p\u003E\n"},{"CreatedByName":"Hedd","CreatedById":68918,"CreatedDateTime":"2014-05-31T22:27:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pondafarr\u0022 data-cite=\u0022Pondafarr\u0022\u003E\u003Cdiv\u003EInquiry: what is the suggested KSP approach procedures for using Spaceplane Guidance autoland? Should I be at a specific distance, specific altitude, glide angle, how should my prograde vector be positioned in relation to the ILS target, etc etc.\u003Cp\u003ESearched all over, can\u0027t find a good guide on how to use it.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt automatically adjusts itself from anywhere in the atmosphere. I\u0027ve goofed around with it a bit and had my spaceplane trying to dive straight down from 30km so be careful about where you activate it. Otherwise, just line up the runways generally at an intelligent approach, hit the button, and find out if you\u0027re balanced good. Note: It doesn\u0027t compensate for nose gear lift, it always tries to land flat, so if your nose gear is longer than your rear gears, you\u0027re gonna have to flare it yourself just before touchdown.\u003C/p\u003E\n"},{"CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2014-06-01T04:25:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Hedd\u0022 data-cite=\u0022Hedd\u0022\u003E\u003Cdiv\u003EIt automatically adjusts itself from anywhere in the atmosphere. I\u0027ve goofed around with it a bit and had my spaceplane trying to dive straight down from 30km so be careful about where you activate it. Otherwise, just line up the runways generally at an intelligent approach, hit the button, and find out if you\u0027re balanced good. Note: It doesn\u0027t compensate for nose gear lift, it always tries to land flat, so if your nose gear is longer than your rear gears, you\u0027re gonna have to flare it yourself just before touchdown.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt does work better with planes that have thrust going than it does flying a powerless glider. It\u0027s somewhat like the earliest autoland systems on airliners. It can get on course and glide path to the runway but it\u0027s still up to the pilot to run the throttle and the brakes. I put some jet engines on my Rocko Monster SRB glider so MechJeb will fly it instead of dropping it nozzle first into the ocean. Once it gets it onto the path it\u0027s happy with I can pop the jets off and sit back and watch it do a perfect deadstick landing.\u003C/p\u003E\u003Cp\u003ESomething to note, a parachute on the back end does nothing at all to yank a glider out of tail down attitude, even with landing autopilot off it doesn\u0027t help much once a glider is going down backwards. I tried that because some real planes have used parachutes as an emergency aid to get them out of flat spins or other situations where there\u0027s not enough airflow over the control surfaces to regain control of the aircraft.\u003C/p\u003E\u003Cp\u003EI\u0027d like to see a glidepath virtual HUD so a plane or glider could be manually flown into the position MechJeb can take over from.\u003C/p\u003E\u003Cp\u003EReal ALS has systems to guide the pilots to the correct altitude/distance for the computers to be able to take over. Newer automatic flight systems are good enough to run the entire flight from start of takeoff roll to landing and full stop. I wouldn\u0027t be surprised if the newest ones can also taxi to and from the runway. Look up on Youtube the first Airbus A380 landing at SFO. There\u0027s a cockpit video showing the pilot hardly ever touching the sidestick. Some of the time he\u0027s using a keyboard - when it\u0027s not folded down under the instrument panel. I wonder if they can fly the plane with WASD? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Eleven","CreatedById":60502,"CreatedDateTime":"2014-06-02T02:42:56Z","Content":"\n\u003Cp\u003EI\u0027ve encountered something I haven\u0027t seen before. After installing build 257 (I always extract the entire new zip over my old one) every time I make a maneuver, lock in on the node and timewarp to the burn, my ships can no longer stay locked on the node during the timewarp. It wobbles around A LOT and has to re-lock on the node after coming out of timewarp. That\u0027s never happened before. Anyone else getting this?\u003C/p\u003E\n"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2014-06-02T07:42:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Hedd\u0022 data-cite=\u0022Hedd\u0022\u003E\u003Cdiv\u003EIt automatically adjusts itself from anywhere in the atmosphere. I\u0027ve goofed around with it a bit and had my spaceplane trying to dive straight down from 30km so be careful about where you activate it. Otherwise, just line up the runways generally at an intelligent approach, hit the button, and find out if you\u0027re balanced good. Note: It doesn\u0027t compensate for nose gear lift, it always tries to land flat, so if your nose gear is longer than your rear gears, you\u0027re gonna have to flare it yourself just before touchdown.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ereduce throttle a little before touchdown. It will flare. It has to or it will touch down short of the runway.\u003C/p\u003E\n"},{"CreatedByName":"MoeMelek","CreatedById":105088,"CreatedDateTime":"2014-06-02T12:11:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Holocus\u0022 data-cite=\u0022Holocus\u0022\u003E\u003Cdiv\u003EAnother problem I have noticed is when using the transfer to other planet option. it sets a course with about 3times the thust needed and tries to blast staight into Kerbin. it does however set the correct course if I wait until about 15 mins until the burn and clears it and creates a new node. (tested towards Duna and Eve)\u003Cp\u003EIt also doesn\u0027t set correct inclination anylonger for transfers to MinMus or to Moho (only tested towards those) resulting in a massive course correction needed\u003C/p\u003E\u003Cp\u003EThese issues I think started appearing after the KSP 0.23 version, never had any of these problems before. \u003C/p\u003E\u003Cp\u003EAnyone else noticing these issues or is there something I\u0027m missing?\u003C/p\u003E\u003Cp\u003E/Holocus\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have the suicide plunge into Kerbin on occasion, as well as the inflated dV. If the dV seems off, I just time warp a bit and try again. \u003C/p\u003E\u003Cp\u003EI have also done a mission to Minimus and had the same problem as you.\u003C/p\u003E\n"},{"CreatedByName":"futrtrubl","CreatedById":77310,"CreatedDateTime":"2014-06-02T19:03:31Z","Content":"\n\u003Cp\u003EFor Minmus at least are you doing a plane matching maneuver before doing the Hohmann transfer?\u003C/p\u003E\u003Cp\u003EEdward\u003C/p\u003E\n"},{"CreatedByName":"dtoxic","CreatedById":103573,"CreatedDateTime":"2014-06-02T20:26:25Z","Content":"\n\u003Cp\u003Ehello all i have a question regarding RCS Throttle...how do i turn of that so that the RCS doesent start when i;am out of fuel i;am using #257 developer version\u003C/p\u003E\n"},{"CreatedByName":"Holocus","CreatedById":89107,"CreatedDateTime":"2014-06-02T20:48:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022futrtrubl\u0022 data-cite=\u0022futrtrubl\u0022\u003E\u003Cdiv\u003EFor Minmus at least are you doing a plane matching maneuver before doing the Hohmann transfer?\u003Cp\u003EEdward\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EActually I havent tried that, don\u0027t go to Minmus that often, just did it as a check. MechJeb used to fix that earlier though!\u003C/p\u003E\n"},{"CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2014-06-03T01:07:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Holocus\u0022 data-cite=\u0022Holocus\u0022\u003E\u003Cdiv\u003EActually I havent tried that, don\u0027t go to Minmus that often, just did it as a check. MechJeb used to fix that earlier though!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou don\u0027t have to do a plane match, you can do a fine tune closest approach after doing the transfer burn, but the angle you intercept at will be anywhere but equatorial.\u003C/p\u003E\u003Cp\u003E1. Match planes\u003C/p\u003E\u003Cp\u003E2. Transfer burn\u003C/p\u003E\u003Cp\u003E3. Fine tune closest approach (optionally aim for aerobake/capture if destination has atmo)\u003C/p\u003E\u003Cp\u003E4. Circularize after passing the intercept marker, too early and it\u0027ll try to circularize around the body you are leaving\u003C/p\u003E\u003Cp\u003EI like to aim the intercept *at* the target rather than *around* it. That way any bits the rocket sheds afterwards are very likely to be self disposing. A fine tune can be done after to miss it.\u003C/p\u003E\n"},{"CreatedByName":"rosenkranz","CreatedById":57152,"CreatedDateTime":"2014-06-04T15:37:01Z","Content":"\n\u003Cp\u003EQuestion. Is the location of the runway and launchpad hard coded? I\u0027m using the MoveKSC mod and MJ still thinks it\u0027s in the stock location. If it\u0027s in a settings file somewhere, i\u0027m blind. So right now using the spaceplane guidance is less than helpful.\u003C/p\u003E\u003Cp\u003EIf it\u0027s not, I\u0027d like to make a feature request \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EOn the landing assistant, make the the button for [Target KSC] a dropdown with a list that could be configureable either from a GUI or just a config file.\u003C/p\u003E\u003Cp\u003ERight now, i\u0027ve placed flags as markers for landing zones for returning stages and flags off the end of my runway to help me.\u003C/p\u003E\n"},{"CreatedByName":"Alfik","CreatedById":112310,"CreatedDateTime":"2014-06-05T12:33:51Z","Content":"\n\u003Cp\u003EI downloaded the new version MechJeb, and I discovered a new bug, which previously did not have. \u003C/p\u003E\u003Cp\u003EOn the right side of the screen I have no control bar, so I can not turn on any panel. Panels that were turned on, disappeared. \u003C/p\u003E\u003Cp\u003EOn the MechJeb lit red control, and do not work any options that were previously on, such as speed limits, or overload (acceleration) limit.\u003C/p\u003E\u003Cp\u003ENew version I just rewrote the old place (on Gamedata folder), but when I discovered the error, I tried to solve the problem completely deleting MechJeb and expanding new download. Unfortunately, I still have the same result.\u003C/p\u003E\n"},{"CreatedByName":"Hatsune_Neko","CreatedById":67460,"CreatedDateTime":"2014-06-06T07:01:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Alfik\u0022 data-cite=\u0022Alfik\u0022\u003E\u003Cdiv\u003EI downloaded the new version MechJeb, and I discovered a new bug, which previously did not have. \u003Cp\u003EOn the right side of the screen I have no control bar, so I can not turn on any panel. Panels that were turned on, disappeared. \u003C/p\u003E\u003Cp\u003EOn the MechJeb lit red control, and do not work any options that were previously on, such as speed limits, or overload (acceleration) limit.\u003C/p\u003E\u003Cp\u003ENew version I just rewrote the old place (on Gamedata folder), but when I discovered the error, I tried to solve the problem completely deleting MechJeb and expanding new download. Unfortunately, I still have the same result.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have to add my 2 cents in as well\u003C/p\u003E\u003Cp\u003Efor i am having the same issue, i\u0027m using career mode and so far all i see is a tiny black dot where as if i click on it nothing happens. if i click an hold, some times i can get the little box to expand ( in a few different sizes i mite add ) but i can not get the control panel or task bar to show up.\u003C/p\u003E\u003Cp\u003EI have researched a large portion of the tech so i got what i believe to be most of mechjeb researched.\u003C/p\u003E\u003Cp\u003Ei went back to curse and re read the instructions but after redownloading, and reinstalling the mod, its still the same issue.\u003C/p\u003E\u003Cp\u003Etook a couple pictures of it.\u003C/p\u003E\u003Cp\u003EOutside my first space station, got it together before the last update when mechjeb was working\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://steamcommunity.com/sharedfiles/filedetails/?id=267776489\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://steamcommunity.com/sharedfiles/filedetails/?id=267776489\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Ethis one i got in a bit closer\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://steamcommunity.com/sharedfiles/filedetails/?id=267776596\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://steamcommunity.com/sharedfiles/filedetails/?id=267776596\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Eand this is of my new lander, you can easily see the black dot on the solar panel\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://steamcommunity.com/sharedfiles/filedetails/?id=267776706\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://steamcommunity.com/sharedfiles/filedetails/?id=267776706\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Ethis is before i joined my space station together and the last update.\u003C/p\u003E\u003Cp\u003Ecan clearly see the MJ button, same place as in the enw version but now its just a black dot instead of a button.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://steamcommunity.com/sharedfiles/filedetails/?id=232017188\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://steamcommunity.com/sharedfiles/filedetails/?id=232017188\u003C/a\u003E \u003C/p\u003E\u003Cp\u003Ehope this helps for i love this addon. got me into orbit first time and learned how to stay there. course i still cant dock with out it lol\u003C/p\u003E\n"},{"CreatedByName":"Tahib","CreatedById":111243,"CreatedDateTime":"2014-06-06T09:50:51Z","Content":"\n\u003Cp\u003EHi, have got some problems with exploding solar panels at ascent, using Mods BTSM and Deadly Reentry. I assume its a G-Force limit. Can you add \u0022show g-force\u0022 and \u0022limit g-force\u0022 functionality? Would be pretty nice. It seems that it get calculated by acceleration, not sure about that.\u003C/p\u003E\u003Cp\u003ELimiting terminal and acceleration to 35m/sÃ‚Â² (or terminal alone to 40) does the job with my current vessel, but thats only a workaround. Btsm and Deadly Reentry seem to utilize a different terminal speed table too.\u003C/p\u003E\u003Cp\u003Eedit: nevermind. seems the limit is exactly at 30m/sÃ‚Â².\u003C/p\u003E\u003Cp\u003E--\u003C/p\u003E\u003Cp\u003E cfg file inside mechjebs directoy with\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E@PART\u003Cbr\u003E[*]:HAS[@MODULE[ModuleCommand],!MODULE[MechJebCore]]:Final\u003Cbr\u003E{\u003Cbr\u003E    MODULE\u003Cbr\u003E    {\u003Cbr\u003E        name = MechJebCore\u003Cbr\u003E    }\u003Cbr\u003E}\u003C/pre\u003E\u003Cp\u003E adds mechjeb functionality to every vessel without the need to add the module. I believe this really should be there by default.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-08T13:05:36Z\u0022 title=\u002206/08/2014 01:05  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 8, 2014\u003C/time\u003E by Tahib\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2014-06-07T09:00:08Z","Content":"\n\u003Cp\u003EJust did more testing, using old, all stock parts, crafts I put together in .21\u003C/p\u003E\u003Cp\u003EIf I launch to Kerbin orbit \u003Cem\u003Ethen\u003C/em\u003E move the ship with Hyperedit, Maneuver Planner and Rendezvous Autopilot work.\u003C/p\u003E\u003Cp\u003EIf I launch to Kerbin orbit and use Mechjeb to do maneuvers, it works. If I use Mechjeb to fly to the Mun, it still works.\u003C/p\u003E\u003Cp\u003EIf I just pluck a ship off the launchpad to orbit with Hyperedit, they fail to work properly. This go-round I had rendezvous AP doing a plane change that went directly to a full throttle Mun escape, and another where it didn\u0027t even begin to do it correctly, just aimed the engine at Mun and burned. I tried several times, reverting to launch or VAB - every time Mechjeb\u0027s maneuvering won\u0027t work properly with a Hyperedit \u0022launched\u0022 craft.\u003C/p\u003E\u003Cp\u003EThe problem only appears to be with ships that have NOT launched. Is there some new thing in .23.5 that gets set when a rocket or plane leaves the pad or runway under its own power? Something that Hyperedit isn\u0027t setting when it\u0027s used to teleport a craft to an orbit?\u003C/p\u003E\u003Cp\u003EWhatever is being buggy, it\u0027s preventing me from using Hyperedit, which a real damper on testing since the only way I can use Mechjeb is to fly things to places the long way.\u003C/p\u003E\u003Cp\u003ESo I\u0027ll fly a ship out to salvage the 32K Kethane from the lander in Mun orbit, which was the original plan to prepare for IR .16, but that still leaves me unable to do Moho lander testing, my next target after going to Eve and back. (Which is going to get a major rework on the transfer ship using Kerbodyne and ThunderMax or ThunderMaximus pieces to reduce parts count to something manageable.)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-07T09:10:56Z\u0022 title=\u002206/07/2014 09:10  AM\u0022 data-short=\u002210 yr\u0022\u003EJune 7, 2014\u003C/time\u003E by Galane\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Padishar","CreatedById":97386,"CreatedDateTime":"2014-06-07T10:20:16Z","Content":"\n\u003Cp\u003EIf you haven\u0027t done so already, I suggest you report this to the Hyperedit people. In the meantime, have you tried strapping the thing you want to launch to a large booster (large enough to get it a few hundred metres into the air) and then launch it, decouple the payload and then hyperedit it into orbit from atmospheric flight?\u003C/p\u003E\n"},{"CreatedByName":"sojourner","CreatedById":65674,"CreatedDateTime":"2014-06-07T16:32:28Z","Content":"\n\u003Cp\u003EYeah, that sounds like more of a hyperedit issue than a mechjeb issue.\u003C/p\u003E\n"},{"CreatedByName":"djnattyd","CreatedById":63737,"CreatedDateTime":"2014-06-07T16:47:13Z","Content":"\n\u003Cp\u003EWhat does the countdown timer on the ascent autopilot do? Bit of an odd question I agree but it doesn\u0027t seem to do anything (unless it\u0027s a hidden action) when I select \u0022Launch to rendezvous\u0022.\u003C/p\u003E\n"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2014-06-07T16:47:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rosenkranz\u0022 data-cite=\u0022rosenkranz\u0022\u003E\u003Cdiv\u003EQuestion. Is the location of the runway and launchpad hard coded? I\u0027m using the MoveKSC mod and MJ still thinks it\u0027s in the stock location. If it\u0027s in a settings file somewhere, i\u0027m blind. So right now using the spaceplane guidance is less than helpful.\u003Cp\u003EIf it\u0027s not, I\u0027d like to make a feature request \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EOn the landing assistant, make the the button for [Target KSC] a dropdown with a list that could be configureable either from a GUI or just a config file.\u003C/p\u003E\u003Cp\u003ERight now, i\u0027ve placed flags as markers for landing zones for returning stages and flags off the end of my runway to help me.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eseconded, especially with multiple launch centers being possible now in RSS and others.\u003C/p\u003E\n"},{"CreatedByName":"softweir","CreatedById":2795,"CreatedDateTime":"2014-06-07T17:53:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022djnattyd\u0022 data-cite=\u0022djnattyd\u0022\u003E\u003Cdiv\u003EWhat does the countdown timer on the ascent autopilot do? Bit of an odd question I agree but it doesn\u0027t seem to do anything (unless it\u0027s a hidden action) when I select \u0022Launch to rendezvous\u0022.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBefore launch, MJ auto-warps until the target is in an appropriate position for launch. If you set a countdown timer then it ends the auto-warp soon enough that the last seconds of the countdown happen at 1x warp. Without the countdown setting, you will get 4 or 5 seconds at 1x, but no more.\u003C/p\u003E\u003Cp\u003EIn other words, it\u0027s for Roleplayers who want to do their best NASA Mission countdown. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E I like it. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"djnattyd","CreatedById":63737,"CreatedDateTime":"2014-06-07T18:24:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022softweir\u0022 data-cite=\u0022softweir\u0022\u003E\u003Cdiv\u003Esnip\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAhh! Well i guess my question is answered then \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}