{"TopicId":12355,"ForumId":34,"TopicTitle":"[PART, 1.0.2] Anatid Robotics / MuMech - MechJeb - Autopilot - Historical thread","CreatedByName":"r4m0n","CreatedById":5404,"CreatedDateTime":"2012-06-08T22:30:41Z","PageNum":63,"Articles":[{"CreatedByName":"zxqv8","CreatedById":65472,"CreatedDateTime":"2013-05-23T20:59:16Z","Content":"\n\u003Cp\u003EI like MechJeb a lot, but its very presence on any ship of any size causes an intermittent stutter of the entire game; however, this is exacerbated by larger ships. If I leave it installed, but not placed on the active ship, the game runs fine. I don\u0027t even know how to determine what would cause this problem.\u003C/p\u003E\n"},{"CreatedByName":"Climberfx","CreatedById":57126,"CreatedDateTime":"2013-05-23T21:08:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022T3E\u0022 data-cite=\u0022T3E\u0022\u003E\u003Cdiv\u003ESo you also just copied the MechJeb2 Folder in the Gamedata, where it rests next to the \u0022Squad\u0022 one? \u003Cp\u003EDammit, cant make it work \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003EEdit: or do I miss a step regarding the \u0022parts\u0022 ?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, all it need is inside that folder you put in the GameData.\u003C/p\u003E\u003Cp\u003EBut remember to delete all the others files from previous installs...\u003C/p\u003E\n"},{"CreatedByName":"Kegereneku","CreatedById":66154,"CreatedDateTime":"2013-05-23T21:34:43Z","Content":"\n\u003Cp\u003EMechjeb 2 is up to date. But it doesn\u0027t seem contain the parts from 1.9.8 and this one doesn\u0027t work in 0.20 (yet ?)\u003C/p\u003E\u003Cp\u003EI hope they\u0027ll stay compatible because I only have 13 flights on 47 that can work with only Mech-Jeb 2. (And I was waiting the new 0.2 before launching an ambitious Duna mission.\u003C/p\u003E\n"},{"CreatedByName":"Castun","CreatedById":4581,"CreatedDateTime":"2013-05-23T22:44:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022zxqv8\u0022 data-cite=\u0022zxqv8\u0022\u003E\u003Cdiv\u003EI like MechJeb a lot, but its very presence on any ship of any size causes an intermittent stutter of the entire game; however, this is exacerbated by larger ships. If I leave it installed, but not placed on the active ship, the game runs fine. I don\u0027t even know how to determine what would cause this problem.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI only had this problem with the new .20 update, when I was still trying to run mods like MechJeb before they were updated as well. It would even lag badly on a ship with only a few parts, although I don\u0027t remember if it mattered whether using a MechJeb part or not.\u003C/p\u003E\n"},{"CreatedByName":"Kcombs75","CreatedById":67410,"CreatedDateTime":"2013-05-23T23:48:57Z","Content":"\n\u003Cp\u003EI can\u0027t get the update to work and was hoping for some help. I downloaded the update and put it in my GameData folder so it looks like this: KSP\u0026gt;GameData\u0026gt;MechJeb2, but when I turn on the game I don\u0027t have any MechJeb parts; it\u0027s as though I don\u0027t have the mod at all. Any thoughts?\u003C/p\u003E\n"},{"CreatedByName":"closz06","CreatedById":64757,"CreatedDateTime":"2013-05-24T00:22:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kcombs75\u0022 data-cite=\u0022Kcombs75\u0022\u003E\u003Cdiv\u003EI can\u0027t get the update to work and was hoping for some help. I downloaded the update and put it in my GameData folder so it looks like this: KSP\u0026gt;GameData\u0026gt;MechJeb2, but when I turn on the game I don\u0027t have any MechJeb parts; it\u0027s as though I don\u0027t have the mod at all. Any thoughts?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDo you have Damned Robotic? I added DR and it made my KSP stuck on loading screen. Had to take it off and reinstall MEchJeb\u003C/p\u003E\n"},{"CreatedByName":"s20dan","CreatedById":1080,"CreatedDateTime":"2013-05-24T00:25:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kcombs75\u0022 data-cite=\u0022Kcombs75\u0022\u003E\u003Cdiv\u003EI can\u0027t get the update to work and was hoping for some help. I downloaded the update and put it in my GameData folder so it looks like this: KSP\u0026gt;GameData\u0026gt;MechJeb2, but when I turn on the game I don\u0027t have any MechJeb parts; it\u0027s as though I don\u0027t have the mod at all. Any thoughts?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E I just installed it into KSP\\Parts and KSP\\Plugins. Seems to be working fine like that.\u003C/p\u003E\n"},{"CreatedByName":"Kcombs75","CreatedById":67410,"CreatedDateTime":"2013-05-24T00:29:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022s20dan\u0022 data-cite=\u0022s20dan\u0022\u003E\u003Cdiv\u003EI just installed it into KSP\\Parts and KSP\\Plugins. Seems to be working fine like that.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESee I can\u0027t do that b/c for some reason if I have anything in the old parts folder all my parts disappear. I had to delete everything from that folder to be able to see any parts in-game.\u003C/p\u003E\n"},{"CreatedByName":"Kcombs75","CreatedById":67410,"CreatedDateTime":"2013-05-24T00:30:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022closz06\u0022 data-cite=\u0022closz06\u0022\u003E\u003Cdiv\u003EDo you have Damned Robotic? I added DR and it made my KSP stuck on loading screen. Had to take it off and reinstall MEchJeb\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot sure what that is. If it\u0027s a mod then no I don\u0027t.\u003C/p\u003E\n"},{"CreatedByName":"Duskrider","CreatedById":67424,"CreatedDateTime":"2013-05-24T00:58:35Z","Content":"\n\u003Cp\u003EI seem to be having the same problem as several folks here. MechJeb 2 simply isn\u0027t working. I have KSP via Steam and have completely deleted KSP and re-installed .20 a couple of times. I have no other mods running, and it doesn\u0027t matter if I install it the new way or the old way... nothing shows up in the game. I\u0027m on Windows 7. When I first ran .20 after the update, the older version of MechJeb was there, but I couldn\u0027t use or select any of the parts and the textures were not correct. I was hoping MechJeb 2 would fix that, and it sounds like it\u0027s supposed to, but it just... doesn\u0027t show up in the parts. It does, however, briefly flash on the loading screen.\u003C/p\u003E\n"},{"CreatedByName":"GJNelson","CreatedById":60188,"CreatedDateTime":"2013-05-24T01:23:18Z","Content":"\n\u003Cp\u003EMechJeb2 only has the MechJeb2 AR202 module now. Attach it to your spacecraft and you will be able to use MechJeb2. Of course, connect it to your command capsule or you will jettison it at some point.\u003C/p\u003E\n"},{"CreatedByName":"Duskrider","CreatedById":67424,"CreatedDateTime":"2013-05-24T01:41:49Z","Content":"\n\u003Cp\u003EAh, thanks GJNelson. That\u0027s it. \u003C/p\u003E\u003Cp\u003ENot very obvious I\u0027m afraid. No wonder I wasn\u0027t seeing it. Now the question is what will happen to all of the flights I have in progress with the old parts. Should I go through the trouble of installing both MechJeb 2 and the old one (and updating the part cfg files), or just start a new game.\u003C/p\u003E\u003Cp\u003EAhh, the hard decisions make being a virtual space program administrator all the more challenging.\u003C/p\u003E\n"},{"CreatedByName":"Dweller_Benthos","CreatedById":15418,"CreatedDateTime":"2013-05-24T03:20:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Duskrider\u0022 data-cite=\u0022Duskrider\u0022\u003E\u003Cdiv\u003EAh, thanks GJNelson. That\u0027s it. \u003Cp\u003ENot very obvious I\u0027m afraid. No wonder I wasn\u0027t seeing it. Now the question is what will happen to all of the flights I have in progress with the old parts. Should I go through the trouble of installing both MechJeb 2 and the old one (and updating the part cfg files), or just start a new game.\u003C/p\u003E\u003Cp\u003EAhh, the hard decisions make being a virtual space program administrator all the more challenging.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have the old parts installed as well as the new one on .20 and it works fine. I updated the config files for the old parts to use the new mechjeb and changed the surface attach rule to allow them to be used as the first part in a ship. Switching to the old flights seems to work fine. I haven\u0027t had time to actually use any of the functions in mechjeb, so can\u0027t speak for that, but at least I get no crashes or errors when loading or switching ships.\u003C/p\u003E\u003Cp\u003ESome of the textures are still messed up though, but I can live with that for now.\u003C/p\u003E\n"},{"CreatedByName":"gabmaia","CreatedById":33005,"CreatedDateTime":"2013-05-24T03:32:42Z","Content":"\n\u003Cp\u003EIs auto-enabling physical time warping when the auto pilot is turning extremely heavy ships without rcs an acceptable suggestion?\u003C/p\u003E\n"},{"CreatedByName":"FredMSloniker","CreatedById":58524,"CreatedDateTime":"2013-05-24T06:28:06Z","Content":"\n\u003Cp\u003EWould it be possible to add support for VTOL craft to MechJeb?\u003C/p\u003E\u003Cp\u003EIn order of complexity to implement and desirability, I can think of three ways to do it:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EAdd a toggle that switches what MechJeb thinks of as the business end of the ship. Its current behavior is to point the front of whatever part you\u0027re controlling from (e.g., the nose of a cupola) in the direction you want to thrust; using the toggle would have it instead point the \u003Cem\u003Etop\u003C/em\u003E of the cupola in that direction. Combined with action groups to switch whether the back or bottom rockets are active, this would allow VTOL flight.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAdd a six-button panel that lets you orient the ship with its front, back, top, bottom, left, or right face in the desired direction of thrust. This would additionally allow things like controlling a ship from a rear-facing \u0027turret\u0027.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EHave MechJeb automatically determine the direction of the ship\u0027s thrust vector and orient based on that. That way I could, for instance, tell it to ascend with the bottom rockets active and have it start to go up, then turn on the rear rocket and have it bring the nose up accordingly.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EI can sort of get the behavior I want by placing an OKTO2 on top of the ship and switching pod which I\u0027m controlling from when I switch active rockets. However, the ultimate goal here is for me to be able to land a ship with a cupola on its side on the Mun while in the cupola view, and switching to IVA also causes control to switch to that pod. As I found out the hard way, this has deleterious effects on MechJeb\u0027s ability to land the craft, especially if one switches to IVA less than 500 meters off the surface. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 alt=\u0022:0.0:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Tremzack","CreatedById":27768,"CreatedDateTime":"2013-05-24T06:52:13Z","Content":"\n\u003Cp\u003EIn MechJeb II, where are the phase angles?\u003C/p\u003E\n"},{"CreatedByName":"AndreyATGB","CreatedById":62674,"CreatedDateTime":"2013-05-24T08:28:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tremzack\u0022 data-cite=\u0022Tremzack\u0022\u003E\u003Cdiv\u003EIn MechJeb II, where are the phase angles?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI can\u0027t recall exactly, but it\u0027s either in the Orbit tab of Custom Window Editor or Misc. They\u0027re the first 2 options (All moon phase angles, all planet phase angles).\u003C/p\u003E\n"},{"CreatedByName":"johnnyhandsome","CreatedById":59580,"CreatedDateTime":"2013-05-24T10:36:38Z","Content":"\n\u003Cp\u003EHow do you upgrade from 1.9.8 to 2.whatever? The folder structure is different fro MechJeb.\u003C/p\u003E\u003Cp\u003EIn the game, do I need to change the MechJeb parts attached to ships in the VAB?\u003C/p\u003E\u003Cp\u003EWhat about flights already in progress that are using MechJeb parts, will they be unaffected?\u003C/p\u003E\n"},{"CreatedByName":"The Stinger","CreatedById":40838,"CreatedDateTime":"2013-05-24T11:02:56Z","Content":"\n\u003Cp\u003EWhen adding the following to a pod, cockpit or probecore, mechjebs breaks.\u003C/p\u003E\u003Cp\u003EThe menu on the side will be empty in VAB and on the launchpad.\u003C/p\u003E\u003Cp\u003EAnd when trying to liftoff, the vehicle gets stuck. The engines run but it just doesn\u0027t want to move.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EMODULE\u003Cp\u003E{ \u003C/p\u003E\u003Cp\u003E name = MechJebCore\u003C/p\u003E\u003Cp\u003E blacklist = MechJebModuleLandingAutopilot MechJebModuleAscentAutopilot MechJebModuleDockingAutopilot MechJebModuleDockingGuidance MechJebModuleRendezvousAutopilot MechJebModuleRoverController MechJebModuleRoverWindow MechJebModuleSpaceplaneAutopilot\u003C/p\u003E\u003Cp\u003E}\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EScreenshots of the empty menus:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1086.photobucket.com/albums/j454/The-Stinger/screenshot54_zps3cab2e3a.png\u0022 alt=\u0022screenshot54_zps3cab2e3a.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1086.photobucket.com/albums/j454/The-Stinger/screenshot55_zpsea7e2c33.png\u0022 alt=\u0022screenshot55_zpsea7e2c33.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2013-05-24T11:26:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022johnnyhandsome\u0022 data-cite=\u0022johnnyhandsome\u0022\u003E\u003Cdiv\u003EHow do you upgrade from 1.9.8 to 2.whatever? The folder structure is different fro MechJeb.\u003Cp\u003EIn the game, do I need to change the MechJeb parts attached to ships in the VAB?\u003C/p\u003E\u003Cp\u003EWhat about flights already in progress that are using MechJeb parts, will they be unaffected?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe MechJeb 2 part is different. You can keep MechJeb 1 alongside MechJeb 2.\u003C/p\u003E\n"},{"CreatedByName":"drbeanz","CreatedById":65253,"CreatedDateTime":"2013-05-24T13:58:35Z","Content":"\n\u003Cp\u003EIs anyone having problem with the SURF(within smart A.S.S.) control in MJ 2.0.8? I made a large rocket that mech Jeb 1.9.8 could fly just fine using the SURF control, however when I fly it with 2.0.8 it wobbles like freaking crazy! The rocket is stable I can control it by hand and the ASAS seems to handle it just fine.\u003C/p\u003E\n"},{"CreatedByName":"Canopus","CreatedById":57774,"CreatedDateTime":"2013-05-24T14:17:45Z","Content":"\n\u003Cp\u003EThe rendevousz atopilot works until it plans to match velocities at closest approach. Then it stops and says next maneuver in 68 years?\u003C/p\u003E\n"},{"CreatedByName":"DerekL1963","CreatedById":57091,"CreatedDateTime":"2013-05-24T14:54:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Canopus\u0022 data-cite=\u0022Canopus\u0022\u003E\u003Cdiv\u003EThe rendevousz atopilot works until it plans to match velocities at closest approach. Then it stops and says next maneuver in 68 years?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh good... I\u0027m not the only one having that problem. Ran into that last night.\u003C/p\u003E\n"},{"CreatedByName":"The_Duck","CreatedById":1156,"CreatedDateTime":"2013-05-24T15:14:48Z","Content":"\n\u003Cp\u003EI\u0027ve just fixed the problem with the rendezvous autopilot, I believe. If you want to try a dev build with the fix, download MechJeb2.dll from here: \u003Ca href=\u0022http://jenkins.mumech.com/job/MechJeb2/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://jenkins.mumech.com/job/MechJeb2/\u003C/a\u003E . Then replace \u0026lt;your KSP folder\u0026gt;\\GameData\\MechJeb2\\Plugins\\MechJeb2.dll with the one you downloaded.\u003C/p\u003E\n"},{"CreatedByName":"Titler","CreatedById":59827,"CreatedDateTime":"2013-05-24T15:18:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Canopus\u0022 data-cite=\u0022Canopus\u0022\u003E\u003Cdiv\u003EThe rendevousz atopilot works until it plans to match velocities at closest approach. Then it stops and says next maneuver in 68 years?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis happens for me too; the problem is it\u0027s not plotting the actual interception, as you can rotate the craft around manually and see that there\u0027s no blue target on the navball.\u003C/p\u003E\u003Cp\u003EThere\u0027s a short term fix; open up the \u0022Rendezvous Planner\u0022 and click \u0022Match velocities at closest approach\u0022 and it\u0027ll skip to that part correctly, and from there complete the rest of the flight under autopilot correct.\u003C/p\u003E\n"}]}