{"TopicId":12355,"ForumId":34,"TopicTitle":"[PART, 1.0.2] Anatid Robotics / MuMech - MechJeb - Autopilot - Historical thread","CreatedByName":"r4m0n","CreatedById":5404,"CreatedDateTime":"2012-06-08T22:30:41Z","PageNum":105,"Articles":[{"CreatedByName":"Wyseman76","CreatedById":67018,"CreatedDateTime":"2013-07-27T21:26:34Z","Content":"\n\u003Cp\u003EI can not get MJ working. I can place the control unit, and open the options on the right. I have tried a couple dozen rocket types and none of them will leave the pad without a massive loss of control as if MJ is doing nothing but it is on and controlling the throttle. I have tried every link in here, I have removed and re-installed KSP to no avail. I\u0027m at a loss.\u003C/p\u003E\n"},{"CreatedByName":"ebaydan777","CreatedById":62060,"CreatedDateTime":"2013-07-27T21:27:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Wyseman76\u0022 data-cite=\u0022Wyseman76\u0022\u003E\u003Cdiv\u003EI can not get MJ working. I can place the control unit, and open the options on the right. I have tried a couple dozen rocket types and none of them will leave the pad without a massive loss of control as if MJ is doing nothing but it is on and controlling the throttle. I have tried every link in here, I have removed and re-installed KSP to no avail. I\u0027m at a loss.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ehave you tried to hit engage autopilot on the ascent guidance portion of MJ?\u003C/p\u003E\n"},{"CreatedByName":"Volitaire","CreatedById":76168,"CreatedDateTime":"2013-07-27T21:44:31Z","Content":"\n\u003Cp\u003EMake sure when you are on the ground that the navball\u0027s orientation is correct. Sometimes you may need to set a \u0022control from here\u0022 point on your rocket to ensure that it is correct. The ball should be blue in case you didn\u0027t know \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"zxczxczbfg","CreatedById":74636,"CreatedDateTime":"2013-07-27T21:59:58Z","Content":"\n\u003Cp\u003EYep. Make sure that MJ recognizes that your ship is pointed upwards. I installed my MJ unit upside down on one of my probes (to stop the antenna from clipping through the communication dish). It thought it was pointed towards the ground, but when the altimeter started ticking up instead of down, it had a sort of digital panic attack and my rocket started corkscrewing out of control (I tried to resist the urge to shout \u0022DO A BARREL ROLL!\u0022).\u003C/p\u003E\n"},{"CreatedByName":"Volitaire","CreatedById":76168,"CreatedDateTime":"2013-07-27T22:21:04Z","Content":"\n\u003Cp\u003EAlso a bit of an update but I was able to dock one thing with autopilot today. Performing a second launch right now to test it out with the part I had the most trouble with the other day.\u003C/p\u003E\n"},{"CreatedByName":"ebaydan777","CreatedById":62060,"CreatedDateTime":"2013-07-27T22:23:31Z","Content":"\n\u003Cp\u003Emy docking autopilot works just fine in 21.1\u003C/p\u003E\n"},{"CreatedByName":"Volitaire","CreatedById":76168,"CreatedDateTime":"2013-07-27T22:29:30Z","Content":"\n\u003Cp\u003EThe other day there were a few of us having issues with it after the SAS hotfix from kerbal got pushed. It seems that there may have been another fix of some sort that cme out as well....though not sure, like said I am performing a second test to confirm if things are working better today. Of course it could also still be an issue somewhere in MJ that is causing the problem...if it wasn\u0027t an update from kerbal, that could be intermittent to some extent as well.\u003C/p\u003E\n"},{"CreatedByName":"Jean Deaux","CreatedById":59842,"CreatedDateTime":"2013-07-27T22:38:53Z","Content":"\n\u003Cp\u003EI\u0027ve done a clean install (deleting the old save game and starting anew) and I can\u0027t get Mechjeb placed on anything. I\u0027ve taken it down to the only mod I have loaded is Mechjeb and it won\u0027t let me stick it on anything. I think if it\u0027s already on your ship design your okay, but don\u0027t take it off because it looks like you may not get it back on.\u003C/p\u003E\n"},{"CreatedByName":"Valley","CreatedById":73883,"CreatedDateTime":"2013-07-27T23:19:02Z","Content":"\n\u003Cp\u003EMJ 2 keeps slamming my craft into the Mun - Warp does not turn off and *BOOM* \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E What is that about? Warp use to go to 1 at a certain point.\u003C/p\u003E\n"},{"CreatedByName":"Ozzah","CreatedById":74402,"CreatedDateTime":"2013-07-27T23:36:45Z","Content":"\n\u003Cp\u003ESorry if this has been covered before.\u003C/p\u003E\u003Cp\u003EI build two ships to launch up into orbit and dock together. I\u0027m not super-experienced with the game, but I did manage to get both ships into perfect 100Km 0Ã‚Â° orbit, but this docking thing appears to be WELL beyond my abilities at this stage.\u003C/p\u003E\u003Cp\u003EI remember in 0.20 that MechJeb had a docking autopilot, however I built these two ships and launched them right after 0.21 came out, when my MechJeb plugin stopped working. In other words, the two ships are currently orbiting Kerbal a few hundred metres from one another, neither one with a MechJeb computer attached.\u003C/p\u003E\u003Cp\u003EI opened up the persistent.sfs file, and noticed it largely appears to have a similar format to the .craft files. What is the safest and easiest way to hack on a MechJeb module? Or, is there another way to get MechJeb to dock these two for me without editing files?\u003C/p\u003E\u003Cp\u003EThanks so much!\u003C/p\u003E\n"},{"CreatedByName":"dmusson","CreatedById":72983,"CreatedDateTime":"2013-07-28T00:00:25Z","Content":"\n\u003Cp\u003EI\u0027ve had a couple of instance of the auto warp feature \u0027run on\u0027 and overshoot the next node by a minute or two. Usually during rendezvous auto pilot.\u003C/p\u003E\n"},{"CreatedByName":"Wyseman76","CreatedById":67018,"CreatedDateTime":"2013-07-28T00:47:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ebaydan777\u0022 data-cite=\u0022ebaydan777\u0022\u003E\u003Cdiv\u003Ehave you tried to hit engage autopilot on the ascent guidance portion of MJ?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eyup i\u0027ve used MJ for all my tedious launches for major space builds. I also checked to make sure the navball orientation is correct. checked control from here, all the common checks but to no avail. I\u0027m truly at a loss.\u003C/p\u003E\n"},{"CreatedByName":"birk","CreatedById":74400,"CreatedDateTime":"2013-07-28T01:49:59Z","Content":"\n\u003Cp\u003EI am new to the game and am anxious to use this add-on. I\u0027m trying to launch a ship using the ascent autopilot. What MechJeb parts must be installed? Just one? All? Thanks in advance!\u003C/p\u003E\n"},{"CreatedByName":"sojourner","CreatedById":65674,"CreatedDateTime":"2013-07-28T01:59:41Z","Content":"\n\u003Cp\u003ECouple things I am learning with docking larger ships.\u003C/p\u003E\u003Cp\u003E1. only have one active fly wheel on the target. disable all others including attached craft. This minimizes wobble.\u003C/p\u003E\u003Cp\u003E2. I have been leaving SAS active on the target rather than using mechjeb\u0027s KillRot. It seems more stable.\u003C/p\u003E\u003Cp\u003E3. To help avoid the \u0022spin of doom\u0022 on the active ship when you turn on docking autopilot, do not set \u0022control from here\u0022 on the docking port you\u0027ll be using to dock with the target. (This is not guaranteed, but it helped in some cases)\u003C/p\u003E\u003Cp\u003E4. the active ship really does not need more than one active fly wheel - again, to reduce wobble.\u003C/p\u003E\u003Cp\u003E5. A little blip on the time warp never hurts before engaging the autodocking.\u003C/p\u003E\n"},{"CreatedByName":"dapullia","CreatedById":72580,"CreatedDateTime":"2013-07-28T02:05:18Z","Content":"\n\u003Cp\u003EI have spotted something very interested. I am running the latest MechJeb and did some more testing on the ascent problems I have been having where it kicks the roll axis hard left or hard right on the pad and keeps it there till it rolls the rocket 90 to 180 degrees. It seems that MecJeb has a real hate problem with rockets that depend on engine gimbals for steering. As soon as I stick a set of small canards on the rocket then MecJeb starts behaving. It seems that MecJeb is not handling finless rockets properly anymore. A simple example I used was an asparagus staged rocket with a default kit rockomax red tank core and the stand off radial decouplers in a configuration with 6 to 8 stacked 2 high of the long white and black FL-800 fuel tanks with proper strutting. I used a Mainsail on the center red tank and the non-gymboled FL-35 engines under each of the asparagus boosters. The result is always lawn dart or breakup. I rebuilt the craft using 4 Red tanks as the boosters and then it launched but rotated 90 to 180 degrees before stopping. I then added the fins to the same 5 red tank rocket and MecJeb flew it marvelously. The thing is that I have never used fins in the past as my launch clamps usually sheer them off. It seems like its a bug that you have to use fins on your rockets otherwise MecJeb just does not work right.\u003C/p\u003E\n"},{"CreatedByName":"BloodyRain2k","CreatedById":50835,"CreatedDateTime":"2013-07-28T02:46:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022dmusson\u0022 data-cite=\u0022dmusson\u0022\u003E\u003Cdiv\u003EI\u0027ve had a couple of instance of the auto warp feature \u0027run on\u0027 and overshoot the next node by a minute or two. Usually during rendezvous auto pilot.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve had that problem too a few times, mostly at 1000x warp.\u003C/p\u003E\u003Cp\u003EI fixed it by changing line 117 in MechjebModuleNodeExecutor.cs: else if (!MuUtils.PhysicsRunning() \u0026amp;\u0026amp; core.attitude.attitudeAngleFromTarget() \u0026gt; 10 \u0026amp;\u0026amp; timeToNode \u0026lt; 600)\u003C/p\u003E\u003Cp\u003EBefore that 600 was just 300, since that change I didn\u0027t have problems anymore.\u003C/p\u003E\n"},{"CreatedByName":"sojourner","CreatedById":65674,"CreatedDateTime":"2013-07-28T03:37:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022dapullia\u0022 data-cite=\u0022dapullia\u0022\u003E\u003Cdiv\u003EI have spotted something very interested. I am running the latest MechJeb and did some more testing on the ascent problems I have been having where it kicks the roll axis hard left or hard right on the pad and keeps it there till it rolls the rocket 90 to 180 degrees. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve not had this problem with my heavy launcher. I use one gimbaled mainsail on the center stack and the asparagus stages all use non-gimbaled. Of course, I do use 3 lander cans on the center stack, which may have some effect. Fly\u0027s straight and true until just before the last set of asparagus drops, at which point it does a slow spin of 90 degrees on the axis of thrust. Not a problem of any kind.\u003C/p\u003E\n"},{"CreatedByName":"dlrk","CreatedById":60033,"CreatedDateTime":"2013-07-28T04:10:20Z","Content":"\n\u003Cp\u003EI\u0027m getting a great deal of excessive wobbling/bouncing. This was fixed by the .dll Sabian posted a couple pages back.\u003C/p\u003E\n"},{"CreatedByName":"transcendentape","CreatedById":58072,"CreatedDateTime":"2013-07-28T04:17:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022darkstrike\u0022 data-cite=\u0022darkstrike\u0022\u003E\u003Cdiv\u003EThat\u0027s the thing though Transcendentape, I tried DISABLING the torque in every combination I could think of on all the wheels/pods (including trying JUST having the TINY reaction wheel in the probe core of the nuclear stage active) and MechJeb STILL does the same thing, so I don\u0027t think the fact I have too much torque should matter, theoretically, it should just mean my ship can maneuver faster...? I should also mentioned I tried locking the gimbal on the engines too...\u003Cp\u003EI\u0027ll try removing them, but if disabling them doesn\u0027t seem to make a difference, I don\u0027t think removing them would matter...?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Edarkstrike- try this craft file: \u003Ca href=\u0022https://docs.google.com/file/d/0B14T_txmzYaSeW5aak0xRmc4LXM/edit?usp=sharing\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://docs.google.com/file/d/0B14T_txmzYaSeW5aak0xRmc4LXM/edit?usp=sharing\u003C/a\u003E. This should show that the problem is in your design, not mechjeb. I correctly oriented mechjeb (you had it upside down), corrected your rcs, removed excess SAS torque, reconfigured your ship a little, and provided a stable launch platform. Since you didn\u0027t include your launch platform in your craft file, I don\u0027t know if your having problems with it as well, but this one should give you a decent starting point. On ascent, limit acceleration to 20m/s, prevent overheat, begin turn at 10k, end turn at 75k, and orbit altitude is 75k. Should have just enough fuel to get you there. Let me know in PM if you\u0027ve got any issues. This has been an interesting exercise in NP appreciation, thanks.\u003C/p\u003E\u003Cp\u003EMore on topic, with this fresh install I had only two mods loaded, mechjeb and editor tools. I still noticed the map screen shaking that messes up the kethane mod, so it\u0027s either a game bug or something mechjeb is doing, as I\u0027ve recreated the problem without kethane.\u003C/p\u003E\u003Cp\u003EJeb says \u0022Hi\u0022.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1162.photobucket.com/albums/q527/transcendentape/TakaraIILDonDuna.png\u0022 alt=\u0022TakaraIILDonDuna.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-28T05:48:42Z\u0022 title=\u002207/28/2013 05:48  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 28, 2013\u003C/time\u003E by transcendentape\u003C/strong\u003E\n\u003Cbr\u003Eadded pic\n\u003C/span\u003E\n"},{"CreatedByName":"wulf899","CreatedById":67061,"CreatedDateTime":"2013-07-28T04:45:45Z","Content":"\n\u003Cp\u003EHey all,\u003C/p\u003E\u003Cp\u003EI\u0027ve tried using the 1.9.8 as well as the latest version of MechJeb, however whenever I launch a spacecraft MechJeb fails to correct the course of the craft. The automated throttle works perfectly, however it\u0027s just that particular thing (probably the most important one) which It can\u0027t do. I\u0027m using KSP 1.21, so its a probable indication of something that may need to be fixed (possibly because of how the SAS works nowadays).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-28T04:50:51Z\u0022 title=\u002207/28/2013 04:50  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 28, 2013\u003C/time\u003E by wulf899\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"dapullia","CreatedById":72580,"CreatedDateTime":"2013-07-28T04:51:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sojourner\u0022 data-cite=\u0022sojourner\u0022\u003E\u003Cdiv\u003EI\u0027ve not had this problem with my heavy launcher. I use one gimbaled mainsail on the center stack and the asparagus stages all use non-gimbaled. Of course, I do use 3 lander cans on the center stack, which may have some effect. Fly\u0027s straight and true until just before the last set of asparagus drops, at which point it does a slow spin of 90 degrees on the axis of thrust. Not a problem of any kind.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn my cases, it seems to want to do the 90 degree rotation literally on the pad at ignition without some kind of steering fins. If it cant rotate it then it continues to apply force usually causing the rocket to pitch most generally in the 10 o\u0027clock direction if your looking straight on in the default view followed by a crazy attempt to roll the rocket which normally almost always will cause it to end up flying in a direction that ends in a powered nose first direct flight into the ground. The odd thing is that once I added external control surfaces then it seemed satisfied. I am running the Mac Steam version of KSP so not sure if that may cause any differences. Like I say, as long as either the rocket can survive and stay vertical through the 90 to 180 degree roll or you put some kind of fins on it then it works. So far this behavior is fully repeatable. I noticed earlier a DLL update was posted to address launch issues. Has the normal main download been updated yet? I might attempt to redownload the base version and attempt the test again.\u003C/p\u003E\u003Cp\u003ESecond question, what happened to the auto intercept feature that would automatically bring you to within X distance of the target craft? I noticed that seems to be missing now.\u003C/p\u003E\u003Cp\u003EThird Question, how does the timed launch feature actually work? It seems that it launches not to the same orbital location but just to the same orbit as your target and then you have to use a transfer/phasing orbit to do the final approach and docking. It would be nice if you could specify in the launch that want the craft\u0027s final position to be within a certain distance of the target and possibly whether it is to attempt a direct launch or launch to a lower stable orbit and automatically transition to using the orbital maneuvers to close the distance (to conserve fuel for instance).\u003C/p\u003E\n"},{"CreatedByName":"wulf899","CreatedById":67061,"CreatedDateTime":"2013-07-28T05:00:08Z","Content":"\n\u003Cp\u003EWAIT NO MY BAD. I forgot to Get rid of the old mechjeb parts, as well as the plugin files of the same version. silly me.\u003C/p\u003E\u003Cp\u003EWorks fantastic, doin\u0027 a great job. (Y)\u003C/p\u003E\n"},{"CreatedByName":"sojourner","CreatedById":65674,"CreatedDateTime":"2013-07-28T05:13:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022dapullia\u0022 data-cite=\u0022dapullia\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ESecond question, what happened to the auto intercept feature that would automatically bring you to within X distance of the target craft? I noticed that seems to be missing now.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003EIt\u0027s called rendezvous planner/autopilot now. works great for me. I set the autopilot to 50m then activate docking autopilot from there. uses very little monoprop. (well, compared to what I was used to with ORDA. I was never one to try manual docking. I\u0027m sure those guys think MJ is a monoprop guzzler.\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThird Question, how does the timed launch feature actually work? It seems that it launches not to the same orbital location but just to the same orbit as your target and then you have to use a transfer/phasing orbit to do the final approach and docking. It would be nice if you could specify in the launch that want the craft\u0027s final position to be within a certain distance of the target and possibly whether it is to attempt a direct launch or launch to a lower stable orbit and automatically transition to using the orbital maneuvers to close the distance (to conserve fuel for instance).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E Works fine for me. I\u0027ve had it put me as close as 200m in some cases. The furthest it\u0027s left me is 30km from the target, but that was just a poor rocket with low control authority to begin with.\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-28T05:15:58Z\u0022 title=\u002207/28/2013 05:15  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 28, 2013\u003C/time\u003E by sojourner\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Hedd","CreatedById":68918,"CreatedDateTime":"2013-07-28T05:54:27Z","Content":"\n\u003Cp\u003ESo I\u0027ve been running into an issue lately where I\u0027ve been trying to dock and MJ would just make the RCS light flicker to beat the band. While doing so the ship would just slowly do cartwheels. Worked fine before, can\u0027t seem to get the bugger to work anymore. Tried some SAS toggling and it didn\u0027t seem to make any difference.\u003C/p\u003E\n"},{"CreatedByName":"sojourner","CreatedById":65674,"CreatedDateTime":"2013-07-28T07:40:15Z","Content":"\n\u003Cp\u003E^\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/12384-PART-0-21-Anatid-Robotics-MuMech-MechJeb-Autopilot-v2-0-9?p=549842\u0026amp;viewfull=1#post549842\u0022 rel=\u0022external nofollow\u0022\u003ESee my previous post on the subject.\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESee if any of that helps.\u003C/p\u003E\n"}]}