{"TopicId":12355,"ForumId":34,"TopicTitle":"[PART, 1.0.2] Anatid Robotics / MuMech - MechJeb - Autopilot - Historical thread","CreatedByName":"r4m0n","CreatedById":5404,"CreatedDateTime":"2012-06-08T22:30:41Z","PageNum":221,"Articles":[{"CreatedByName":"K3-Chris","CreatedById":61664,"CreatedDateTime":"2014-03-04T07:44:52Z","Content":"\n\u003Cp\u003ENvm it has nothing to do with the KW port, it\u0027s doing it with matching stock 1m ports as well.\u003C/p\u003E\n"},{"CreatedByName":"sarbian","CreatedById":57146,"CreatedDateTime":"2014-03-04T10:38:12Z","Content":"\n\u003Cp\u003EWalsht9 : well it works fine here. Without more useful info, a save game or at least some screenshot those report are not really useful.\u003C/p\u003E\u003Cp\u003EK3|Chris : I lowered the distance it aims for before stopping, and the AP does not have the time to deactivate itself now. It\u0027s the same bug that plagued the version I released in September just before going on a trip.\u003C/p\u003E\u003Cp\u003EI have to think of a proper way do manage this...\u003C/p\u003E\n"},{"CreatedByName":"drtedastro","CreatedById":70911,"CreatedDateTime":"2014-03-05T04:51:13Z","Content":"\n\u003Cp\u003EHello Sarbian and all. I have noticed that when using the Landing Guidance mod, after you have selected whichever target (KSC, VAB or your own coordinates), the unit immediately slews to correct orientation (for time of burn) and if you do NOT use autoWarp this is fine. However, if you have selected autoWarp, the craft warps (holding last orientation) and warps to the time of needed burn, comes out of warp and then starts burn(s) as craft is slewing to needed position.\u003C/p\u003E\u003Cp\u003EIt looks to me, in humble opinion, that the warp needs to shut down sooner so that craft can get into correct position after being stuck in warp position.\u003C/p\u003E\u003Cp\u003EIt would also be nice if it was possible to create a node to be used for landing at a point that would \u0027adjust\u0027 to take into account the orbit of the body and the vessel. Landing guidance does this automatically (somehow) and is great. it would be real helpful to be able to create a node that was \u0027locked\u0027 somehow to SoI reference and took rotation into account.\u003C/p\u003E\u003Cp\u003EMJ is my most used mod. It allows me to pursue the aspects of KSP that I enjoy without having to worry about eye / hand coordination for flight, docking and landing. It makes the game a lot more enjoyable for ME....\u003C/p\u003E\u003Cp\u003EMany, MANY thanks to Sarbian and all who do and have worked on it.\u003C/p\u003E\n"},{"CreatedByName":"Hobie","CreatedById":105016,"CreatedDateTime":"2014-03-05T15:45:58Z","Content":"\n\u003Cp\u003EHello all.\u003C/p\u003E\u003Cp\u003EHave a strange issue.\u003C/p\u003E\u003Cp\u003EStarting a sandbox the mechjeb loads on a ship; if i start a new carreer or load one i will have the item but it is unusable in the list, like pressed.\u003C/p\u003E\u003Cp\u003EI see it but can\u0027t use.\u003C/p\u003E\u003Cp\u003Eusing last version of the game and the latest patch available of the lab.\u003C/p\u003E\u003Cp\u003EAny suggestion?\u003C/p\u003E\n"},{"CreatedByName":"BloodyRain2k","CreatedById":50835,"CreatedDateTime":"2014-03-05T17:31:11Z","Content":"\n\u003Cp\u003EMy suggestion would be to read what the window says about the modules being locked until you unlocked them with science.\u003C/p\u003E\n"},{"CreatedByName":"sonicsst","CreatedById":16043,"CreatedDateTime":"2014-03-05T19:09:21Z","Content":"\n\u003Cp\u003EI don\u0027t think that\u0027s the problem. Any parts added after a node has been researched will not be available until it is researched individually. Fortunately, it\u0027s free. Find the flight control node in the research centre. If the AR202 part isn\u0027t greyed out, click it. Hope this helps.\u003C/p\u003E\n"},{"CreatedByName":"ThomsenX","CreatedById":103318,"CreatedDateTime":"2014-03-05T19:52:01Z","Content":"\n\u003Cp\u003E(cross-post from \u003Cem\u003EProcedural Fairings\u003C/em\u003E thread, as I suspect the problem lies with MechJeb)\u003C/p\u003E\u003Cp\u003EHey all! I\u0027ve been having this bug with Procedural Fairings and MechJeb lately...\u003C/p\u003E\u003Cp\u003EI carry out a lot of routine launches, so I often outsource the tedious work to MechJeb (running v2.1.1), but I ran into this problem recently, where MechJeb would stage (i.e. jettison) my payload fairing walls and decouple the built-in decoupler in the payload fairing base. To see exactly what I mean,\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/HPGj2zr3wMU?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E. Basically MechJeb will jettison/decouple all Procedural Fairings parts at some point during launch. In the video, I used a rocket with this staging:\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003E0: Fairing walls (had them set up to jettison on Custom01, so I wanted to keep them out of reach of staging)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E1: Fairing base\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E2: Orbital injection stage, main launch stage separation\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E3: Main launch stage, 4x SRB separation\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E4: Initial 4x SRB stage, to get us off the ground\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EMoments after decoupling stage 3 and activating the orbital injection engine, the fairing walls would pop off and the decoupler deactivate, thus leaving me with a freely floating payload post-injection burn.\u003C/p\u003E\u003Cp\u003EI have never seen MechJeb interfere this way with any other parts, so it seems (AFAIK) to be MechJeb and Procedural Fairings somehow clashing.\u003C/p\u003E\u003Cp\u003EDoes anyone know of a fix? If you do, I beg you to post it here. I\u0027m on the verge of desperation, as FAR dislikes my rockets unless I use fairings, and I can\u0027t use them under the current circumstances \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003ECheers, \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E - ThomsenX\u003C/p\u003E\u003Cp\u003EEDIT: Was informed in referred thread to use \u003Cem\u003EStop at stage\u003C/em\u003E #, but MechJeb\u0027s autostage function should stop at stage 2, yet it activates higher stages (0 and 1 simultaneously) while using stage 2.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-05T19:54:05Z\u0022 title=\u002203/05/2014 07:54  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 5, 2014\u003C/time\u003E by ThomsenX\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"BigD145","CreatedById":417,"CreatedDateTime":"2014-03-05T21:14:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ThomsenX\u0022 data-cite=\u0022ThomsenX\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EEDIT: Was informed in referred thread to use \u003Cem\u003EStop at stage\u003C/em\u003E #, but MechJeb\u0027s autostage function should stop at stage 2, yet it activates higher stages (0 and 1 simultaneously) while using stage 2.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere is another location where you set staging. Perhaps that is getting priority. I think it\u0027s just \u0022settings.\u0022\u003C/p\u003E\n"},{"CreatedByName":"ThomsenX","CreatedById":103318,"CreatedDateTime":"2014-03-05T22:17:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BigD145\u0022 data-cite=\u0022BigD145\u0022\u003E\u003Cdiv\u003EThere is another location where you set staging. Perhaps that is getting priority. I think it\u0027s just \u0022settings.\u0022\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI realize now that my wording wasn\u0027t very clear \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E I wasn\u0027t using \u003Cem\u003EStop at stage\u003C/em\u003E # because I expected MechJeb to \u003Cem\u003Enot\u003C/em\u003E trigger fairings prematurely (because a lower stage\u0027s engine was burning on autopilot at the time). \u003Cem\u003EStop on stage\u003C/em\u003E # works like a charm, and I ended up using it in defeat, so finally my space station received its load of snacks and supplies.\u003C/p\u003E\u003Cp\u003EMy inquiry was more related to this question: \u003Cem\u003Ewhy\u003C/em\u003E does MechJeb stage off the two upper stages (containing only fairing decouplers) when [1] there\u0027s already an active stage with an engine burning and [2] there are neither fuel tanks nor engines in any of the two stages above the active stage?\u003C/p\u003E\n"},{"CreatedByName":"sarbian","CreatedById":57146,"CreatedDateTime":"2014-03-05T22:24:37Z","Content":"\n\u003Cp\u003EThe staging config looks fine so it\u0027s indeed strange. Which part is the root part of the rocket ?\u003C/p\u003E\u003Cp\u003EI use procedural fairing \u0026amp; MJ often, and I don\u0027t think I had this before (but I often set my fairing to eject when the orbital stage engine starts so ...)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-05T22:27:07Z\u0022 title=\u002203/05/2014 10:27  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 5, 2014\u003C/time\u003E by sarbian\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"K3-Chris","CreatedById":61664,"CreatedDateTime":"2014-03-05T22:35:00Z","Content":"\n\u003Cp\u003EFrom my experience having your last engine bellow you fairings in the staging always makes MJ ditch the fairings right after firing that engine, even if you\u0027re a 20km alt or whatever, you have to use stop at # to not have it do that.\u003C/p\u003E\u003Cp\u003EWould be nice if MJ only auto-staged to detach spent tanks instead.\u003C/p\u003E\n"},{"CreatedByName":"ThomsenX","CreatedById":103318,"CreatedDateTime":"2014-03-05T22:38:13Z","Content":"\n\u003Cp\u003EThe root part is the large stock radial probe (L01), attached in the orbital stage (which serves as a rendezvous tug too). Nothing too uncommon there, I guess.\u003C/p\u003E\u003Cp\u003EEDIT: i wonder if an \u0027ignore tag\u0027 could potentially be applied to certain parts, which MechJeb would recognize and ignore? I know it\u0027d take a few lines of code from the dev, but it would be incredibly useful.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-05T22:40:55Z\u0022 title=\u002203/05/2014 10:40  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 5, 2014\u003C/time\u003E by ThomsenX\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sarbian","CreatedById":57146,"CreatedDateTime":"2014-03-05T22:49:13Z","Content":"\n\u003Cp\u003EOk, It must think the fairings are something else that can be staged. I\u0027ll add it to the list of things I have to look into.\u003C/p\u003E\n"},{"CreatedByName":"likke_A_boss","CreatedById":94697,"CreatedDateTime":"2014-03-06T00:25:46Z","Content":"\n\u003Cp\u003EI believe that 187 has cannot carry out any nodes precisely, it is alway pretty off, even when the node is brought down to 0 Delta-V left.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2014-03-06T04:33:47Z","Content":"\n\u003Cp\u003EWhy does the last version force you to back up to 50 meter from target port before docking?\u003C/p\u003E\u003Cp\u003EI use mechjeb docking for docking huge ships and tend to go within 10 meter from target and lined up before activating it, as its now it easy eat 400 unit monoprop trying to dock. \u003C/p\u003E\u003Cp\u003EThe 1/17 version was better here, it however has an bug so it don\u0027t use torque on probes.\u003C/p\u003E\n"},{"CreatedByName":"BloodyRain2k","CreatedById":50835,"CreatedDateTime":"2014-03-06T04:41:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022magnemoe\u0022 data-cite=\u0022magnemoe\u0022\u003E\u003Cdiv\u003EWhy does the last version force you to back up to 50 meter from target port before docking?\u003Cp\u003EI use mechjeb docking for docking huge ships and tend to go within 10 meter from target and lined up before activating it, as its now it easy eat 400 unit monoprop trying to dock. \u003C/p\u003E\u003Cp\u003EThe 1/17 version was better here, it however has an bug so it don\u0027t use torque on probes.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you\u0027re 10m away and lined up you might aswell finish it yourself...\u003C/p\u003E\n"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2014-03-06T05:19:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022K3|Chris\u0022 data-cite=\u0022K3|Chris\u0022\u003E\u003Cdiv\u003EFrom my experience having your last engine bellow you fairings in the staging always makes MJ ditch the fairings right after firing that engine, even if you\u0027re a 20km alt or whatever, you have to use stop at # to not have it do that.\u003Cp\u003EWould be nice if MJ only auto-staged to detach spent tanks instead.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere actually is a fix possible for that... there\u0027s a list of modules that MJ ignores when deciding whether or not it should stage. Adding the fairing modules (or fairing decoupler.... I forget which) fixes that.\u003C/p\u003E\u003Cp\u003EI actually suggested that long ago but I think my timing was poor, development seemed to be slow but thread activity high so it probably got lost in the noise.\u003C/p\u003E\u003Cp\u003EIf Sarbian doesn\u0027t see this I\u0027ll dig up the necessary module names and poke him on IRC\u003C/p\u003E\n"},{"CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2014-03-06T05:48:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BloodyRain2k\u0022 data-cite=\u0022BloodyRain2k\u0022\u003E\u003Cdiv\u003EIf you\u0027re 10m away and lined up you might aswell finish it yourself...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe last docking I did, (don\u0027t recall which 18x build) it got down to a short distance then slowed to an extremely slow forward speed, constantly firing RCS back and forth but still making very slow forward progress. I finally shut the docking AP off and manually activated the jets to shove it home the last half meter or so due to the mono being close to depleted. (Two FL-R1 tanks.)\u003C/p\u003E\u003Cp\u003EWhat would be very nice if it can be adjusted is increasing the range at which the docking ports can be targeted. With high part count ships and lag it gets to be a bit of a nail biter waiting for the range to close to where when switching ships the docking port right click menus will stay open on the other ship. It leaves a rather short time for the docking AP to get moved into alignment. If I can see the docking port on the other ship, it should be possible to target it, from at least 200 meters.\u003C/p\u003E\u003Cp\u003EI do like the change in KSP .23 where the right click menus stay open when rotating the camera around to get the opposing ship into view from both ships. That makes docking a much easier process, with the open menus acting as \u0027flags\u0027 to locate the other ship. Docking on the dark side, without lights? Much easier in .23! (Still want a sunrise/sunset, midday/midnight option for rendezvous and launch/landing functions.)\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2014-03-06T06:50:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BloodyRain2k\u0022 data-cite=\u0022BloodyRain2k\u0022\u003E\u003Cdiv\u003EIf you\u0027re 10m away and lined up you might aswell finish it yourself...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EProblem is ships with 500 part count and 2-500 ton making them very hard to controll with less than an meter accuracy but you can get within 10-20 meter pretty easy.\u003C/p\u003E\u003Cp\u003EAs the reminding distance is short the monoprop use is less important to and it look like it has gone up again in this version.\u003C/p\u003E\u003Cp\u003EHere it look like its 41 meter, if you are to close it move you out and then inn again. \u003C/p\u003E\u003Cp\u003EThe good news is that it automatically reduces speed then getting close.\u003C/p\u003E\n"},{"CreatedByName":"Read have Read","CreatedById":60863,"CreatedDateTime":"2014-03-06T07:27:08Z","Content":"\n\u003Cp\u003EI seem to be getting a lot of exceptions from mechjeb\u003C/p\u003E\u003Cp\u003EAn Sample from the output log: (I can\u0027t paste the full thing to Pastebin :/ )\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://pastebin.com/Dsu4rtQk\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://pastebin.com/Dsu4rtQk\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI had some orange coloured errors from the FAR extension as well.\u003C/p\u003E\n"},{"CreatedByName":"sarbian","CreatedById":57146,"CreatedDateTime":"2014-03-06T23:37:35Z","Content":"\n\u003Cp\u003EThat\u0027s one I know off but I don\u0027t have a fix for yet. The stage stats can change while the drawing is done and you get that exception (it\u0027s a bit more complex but that the short version)\u003C/p\u003E\n"},{"CreatedByName":"darkstrike","CreatedById":60004,"CreatedDateTime":"2014-03-07T20:49:13Z","Content":"\n\u003Cp\u003EHi all,\u003C/p\u003E\u003Cp\u003EI\u0027ve got the latest version of MJ and I completely removed any MJ files before I installed it....however, with almost all of my ships, large and small, many parts and few parts, I\u0027ve been having an issue with MJ\u0027s Autopilot constantly rolling my ships left and right and MASSIVELY overcompensating when trying to point towards a node to the point I have to intervene and try and \u0027help\u0027 it aim at the node with the movement keys or even turning autopilot off and having to fly manually. It used to work fine on these same ships before....what happened? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"frumpalumpaguss","CreatedById":80951,"CreatedDateTime":"2014-03-08T03:54:04Z","Content":"\n\u003Cp\u003EAlright, I\u0027m sure this has been fixed/answered but here it goes. Just installed 2.1.1. I\u0027ve done everything I can imagine to attempt to get it to work in career mode, even followed people\u0027s advice on youtube/google. Can\u0027t get it to work. Any help would be greatly appreciated.\u003C/p\u003E\n"},{"CreatedByName":"sonicsst","CreatedById":16043,"CreatedDateTime":"2014-03-08T04:46:44Z","Content":"\n\u003Cp\u003EI think we need more info. What problem are you having? How is it not working?\u003C/p\u003E\n"},{"CreatedByName":"frumpalumpaguss","CreatedById":80951,"CreatedDateTime":"2014-03-08T05:37:45Z","Content":"\n\u003Cp\u003EI have the ability to see the new part (the little box) but can\u0027t select it. I\u0027ve already purchased it in R\u0026amp;D but I\u0027m still unable to use it.\u003C/p\u003E\n"}]}