{"TopicId":123500,"ForumId":44,"TopicTitle":"If neutrinos have mass, why do scientists theorize they may move faster than light?","CreatedByName":"Aethon","CreatedById":110755,"CreatedDateTime":"2015-10-21T17:28:36Z","PageNum":1,"Articles":[{"CreatedByName":"Aethon","CreatedById":110755,"CreatedDateTime":"2015-10-21T17:28:36Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022http://www.nasa.gov/feature/goddard/nasa-goddard-scientist-gives-outlaw-particles-less-room-to-hide\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.nasa.gov/feature/goddard/nasa-goddard-scientist-gives-outlaw-particles-less-room-to-hide\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u0022\u003Cspan style=\u0022font-family:\u0027Helvetica Neue\u0027;\u0022\u003E\u003Cspan style=\u0022color:#000000;\u0022\u003EIf neutrinos happen to be traveling faster than light, a feat that violates Einstein\u0027s relativity theory but is allowed by some newer rival theories, these measurements provide a way to determine how far they\u0027re pushing the speed limit.\u0022\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EWait what? They just gave away the Nobel prize for proving that neutrinos have mass, but how can a massive particle move faster than light? I understand these observations confine the phenomena to a smaller possible range of light speed violation, but how can scientist theorize the breakdown of the Lorentz invariance?? I would be interested to hear K^2 or someone else with an intimate knowledge of physics do some \u0027splainin\u0027 pls..\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://journals.aps.org/prd/abstract/10.1103/PhysRevD.91.045009\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://journals.aps.org/prd/abstract/10.1103/PhysRevD.91.045009\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Hannu","CreatedById":60596,"CreatedDateTime":"2015-10-21T17:56:22Z","Content":"\n\u003Cp\u003EWhy not. Postulate of theory of relativity is based just observations. We have not seen any real particle faster than light. But as every scientific theory, it should be tested and it is very good idea to think what kind of an effect superluminal particles would have in our detectors. If we find such particles we may get hint of physics beyond theory of relativity. Any scientist does not believe that current physical theories are perfect model of the universe.\u003C/p\u003E\n"},{"CreatedByName":"Shpaget","CreatedById":45577,"CreatedDateTime":"2015-10-21T18:08:38Z","Content":"\n\u003Cp\u003EOur understanding of the Universe is always changing and we attempt to make our models fit as best as we can. When we find a proof that our model is wrong in some aspect and does not fit any more, we find a model that does fit and explain the newly observed phenomena. That model does not need to be 100% accurate, just good enough for now.\u003C/p\u003E\u003Cp\u003EEven if neutrinos are proven to be traveling faster than light, it doesn\u0027t place us in a position we\u0027haven\u0027t been before. For a long time Newtonian physics was all that mattered and relativistic formulae were not used. They weren\u0027t needed since people weren\u0027t studying that area of physics. Once they did start to meddle with it, Newtonian physics proved to be inaccurate and the need to find a new model arose.\u003C/p\u003E\u003Cp\u003EIf neutrinos are proven to be faster than light, we will find a new model that will deal with that branch of physics, while still keeping and using relativistic formulae where applicable, just like we continued to use Newtonian physics for everyday life.\u003C/p\u003E\u003Cp\u003EIt\u0027s very exciting time to be alive.\u003C/p\u003E\n"},{"CreatedByName":"Robotengineer","CreatedById":104525,"CreatedDateTime":"2015-10-21T20:37:09Z","Content":"\n\u003Cp\u003EReality backs up theories, not the other way around. \u003Cem\u003EIf\u003C/em\u003E neutrinos travel FTL, and have mass, we need to rethink Relativity.\u003C/p\u003E\n"},{"CreatedByName":"Technical Ben","CreatedById":10512,"CreatedDateTime":"2015-10-21T21:13:06Z","Content":"\n\u003Cp\u003EThings like gravity change the way we think about the problems, literally. \u003C/p\u003E\u003Cp\u003EFor example, imagine someone naively thinking... \u0022Can I make a giant mountain?... no, can I make the biggest mountain ever... no, can I make a mountain the size of the MOON!\u0022 Take gravity out of the equation, and it seems reasonably possible. We \u0022just need to make it bigger!\u0022 However, when we add gravity in, we realise it would collapse under it\u0027s own weight into a moon. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003ELike wise, \u0022we can just add more speed to go FTL\u0022 makes the assumption there is nothing to mess up that plan. While certain things could theoretically go FTL, and neutrinos could do if created as FTL particles (you cannot accelerate up to, but could theoretically start from that speed), most current readings present them as slower or equal to light (that is the universal constant, not the actual speed of a photon. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E ).\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2015-10-21T21:33:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Aethon\u0022 data-cite=\u0022Aethon\u0022\u003E\u003Cdiv\u003E\u003Ca href=\u0022http://www.nasa.gov/feature/goddard/nasa-goddard-scientist-gives-outlaw-particles-less-room-to-hide\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.nasa.gov/feature/goddard/nasa-goddard-scientist-gives-outlaw-particles-less-room-to-hide\u003C/a\u003E\u003Cp\u003E\u0022\u003Cspan style=\u0022font-family:\u0027Helvetica Neue\u0027;\u0022\u003E\u003Cspan style=\u0022color:#000000;\u0022\u003EIf neutrinos happen to be traveling faster than light, a feat that violates Einstein\u0027s relativity theory but is allowed by some newer rival theories, these measurements provide a way to determine how far they\u0027re pushing the speed limit.\u0022\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EWait what? They just gave away the Nobel prize for proving that neutrinos have mass, but how can a massive particle move faster than light? I understand these observations confine the phenomena to a smaller possible range of light speed violation, but how can scientist theorize the breakdown of the Lorentz invariance?? I would be interested to hear K^2 or someone else with an intimate knowledge of physics do some \u0027splainin\u0027 pls..\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://journals.aps.org/prd/abstract/10.1103/PhysRevD.91.045009\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://journals.aps.org/prd/abstract/10.1103/PhysRevD.91.045009\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUgh. That\u0027s what happens when you try to do quantum gravity. Stuff breaks. The kind of stuff that shouldn\u0027t break. And it\u0027s not always clear if things are actually broken like that in nature, or if the math is bad. Now, smart money is on math being bad in this case, but it\u0027s one of these cases where experimental check does a lot more good than volumes of theoretical work.\u003C/p\u003E\u003Cp\u003EIn principle, speed of light is a purely local limit. That\u0027s why we have things like Alcubierre Drive. So you can always envision something, even a particle, moving faster than light. In theory. In practice, these things come with a shopping list of highly implausible things. Like negative mass. So I don\u0027t think a lot of people seriously expect to see FTL neutrinos, but if it actually shows up in this particular effective field theory, it\u0027s worth excluding in the experiment. And then it will be back to the drawing board for a bunch of theorists.\u003C/p\u003E\n"},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2015-10-22T22:32:53Z","Content":"\n\u003Cp\u003EThat article reads like a bunch of hypotheticals, and incidentally happens to cite what I myself was about to mention:\u003C/p\u003E\u003Cp\u003EThe original study suggesting superluminal neutrinos existed was performed back in 2011, and after a media bubble it was found that the detector was, in fact, imperfectly calibrated and had given inaccurate readings. Since then I\u0027ve never heard anything suggesting any superluminal neutrinos or other particles actually existed, so I perceive this article as more of a thought experiment than anyone seriously theorizing about anything.\u003C/p\u003E\u003Cp\u003EIn other words, they\u0027re theorizing about what neutrinos would be like IF they moved faster than light, but not making any claims that they actually do.\u003C/p\u003E\n"}]}