{"TopicId":123560,"ForumId":70,"TopicTitle":"A cause of multiple copies of a part. (Linux and possibly Windows)","CreatedByName":"Wolf Baginski","CreatedById":138549,"CreatedDateTime":"2015-10-22T20:49:18Z","PageNum":1,"Articles":[{"CreatedByName":"Wolf Baginski","CreatedById":138549,"CreatedDateTime":"2015-10-22T20:49:18Z","Content":"\n\u003Cp\u003EI had a problem with multiple copies of the same part. Lots of multiple copies, and it was the whole set of parts form a Mod which had been working OK in Windows.\u003C/p\u003E\u003Cp\u003EThe first part of the solution was when I checked the PartDatabase.cfg file in the KSP root folder (same place as the executable). The multiple copies were there. The file is a list of parts, and the key is in this bit (for each part).\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:\u0027courier new\u0027;\u0022\u003E\u003Cstrong\u003EPART\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:\u0027courier new\u0027;\u0022\u003E\u003Cstrong\u003E{\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:\u0027courier new\u0027;\u0022\u003E\u003Cstrong\u003E url = Corvus/Parts/Corvus_Nose/Corvus_Nose\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027courier new\u0027;\u0022\u003EThat URL is the sub-folder in GameData and the multiple copies were there. I should have looked sooner, because that first element of the URL was in the \u0022hidden\u0022 format. It\u0027s used by both Linux and Windows. In bath cases, the file manager program defaults to not showing folder and file names if the format \u0022\u003C/span\u003E\u003C/span\u003E\u003Cspan style=\u0022font-family:\u0027courier new\u0027;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027courier new\u0027;\u0022\u003E.filename\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\u0022\u003C/p\u003E\u003Cp\u003ESo, for some reason, I had been trying to install a Mod. The Linux archive manager had been failing to extract the file properly, and had put the contents in a hidden folder. I hadn\u0027t checked for this, tried to extract the files again, and got them in another hidden folder. And it seems that Windows zipfile handling had worked OK.\u003C/p\u003E\u003Cp\u003EWhen KSP loaded, it neatly loaded all the hidden-subfolder contents (we could argue about that: that\u0027s something that could be used in abusive ways) and there were the multiple copies.\u003C/p\u003E\u003Cp\u003EThere don\u0027t look to be any flaws in the actual extracted content. I was able to copy-and-paste the correct subfolder from one of the hidden folders. The rest was deleted, and no problems.\u003C/p\u003E\u003Cp\u003ESince I had no problem with the same compressed file under Windows I hesitate to blame the data compression.\u003C/p\u003E\u003Cp\u003EIt was version 0.5.4. of the KAS mod, which cas things such as winches and fuel-transfer pipes, and elements that can be used for construction in the field.\u003C/p\u003E\u003Cp\u003EIt seems possible to me that a hidden subfolder might be created if something goes wrong with the extraction of a set of files. So it\u0027s worth checking for that. I don\u0027t know if the Windows equivalent extracts to such a local hidden subfolder. I have a feeling it uses the Temp folder, which means it dodges the whole multiple-copy problem.\u003C/p\u003E\n"},{"CreatedByName":"Stone Blue","CreatedById":77721,"CreatedDateTime":"2015-10-22T21:51:27Z","Content":"\n\u003Cp\u003EHmmm... Thanx for this...I think I just recently noticed a few part dupes in the editor, and was wondering how that happened...Havent even had the chance to investigate it though...So I\u0027ll check this...I also switch between Windoze and Linux, and access my Gamedata folder in both OS\u0027s, also installing mods from both OSs in the same KSP install folder.\u003C/p\u003E\n"},{"CreatedByName":"Wolf Baginski","CreatedById":138549,"CreatedDateTime":"2015-10-22T23:53:55Z","Content":"\n\u003Cp\u003EI\u0027m not sure how you\u0027re using the same GameData folder in both, but there certainly shouldn\u0027t be any problem with the file formats and folder structures. Windows does have Shortcuts, which are the same sort of idea as symlinks in Unix, so I think I can see where to start looking. I\u0027ve certainly not had any problems reading and writing to ntfs partitions from Linux.\u003C/p\u003E\u003Cp\u003EI don\u0027t see any great advantage in using a Windows version when you have Linux, but there may be a couple of gotchas. Have you tried KSP with Wine?\u003C/p\u003E\n"},{"CreatedByName":"Stone Blue","CreatedById":77721,"CreatedDateTime":"2015-10-23T00:53:08Z","Content":"\n\u003Cp\u003ENo, not PLAYING using the same KSP install folder, just unzipping mod folders, pruning parts, editing .cfgs in either Windoze or Linux...I use the Windows Search to find duplicate files in the Gamedata...Havent gotten a similar function in Linux to work...Also, sometimes I\u0027m in Windows surfing the web or forums, and just easier to install a mod I just downloaded in Windows, than to reboot into Linux to do it...Stuff like that...\u003C/p\u003E\u003Cp\u003EI HAVE noticed I\u0027ve been able to copy the complete Linux Gamedata folder, over to a Windows KSP install folder, and the game seems to play fine in Windows...Havent tried the reverse...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-23T03:49:12Z\u0022 title=\u002210/23/2015 03:49  AM\u0022 data-short=\u00228 yr\u0022\u003EOctober 23, 2015\u003C/time\u003E by Stone Blue\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Wolf Baginski","CreatedById":138549,"CreatedDateTime":"2015-10-23T21:32:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Stone Blue\u0022 data-cite=\u0022Stone Blue\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI HAVE noticed I\u0027ve been able to copy the complete Linux Gamedata folder, over to a Windows KSP install folder, and the game seems to play fine in Windows...Havent tried the reverse...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI haven\u0027t done a complete folder, but I\u0027ve done that Windows to Linux with subfolders, no problem.\u003C/p\u003E\u003Cp\u003EAssume you had an install set up to use a different Tech Tree. GameData-A uses the standard tech tree, and a link to that could be in GameData-B. You could certainly do that for the Squad subfolder. I\u0027d likely also do it for Module Manager and one or two others\u003C/p\u003E\u003Cp\u003EIs it worth the hassle? Disk space is cheap.\u003C/p\u003E\n"}]}