{"TopicId":12355,"ForumId":34,"TopicTitle":"[PART, 1.0.2] Anatid Robotics / MuMech - MechJeb - Autopilot - Historical thread","CreatedByName":"r4m0n","CreatedById":5404,"CreatedDateTime":"2012-06-08T22:30:41Z","PageNum":200,"Articles":[{"CreatedByName":"Virtualgenius","CreatedById":67644,"CreatedDateTime":"2014-01-14T22:30:27Z","Content":"\n\u003Cp\u003EThats very interesting codepoet on explaining how MJ lands is it possible to tighten the variables perhaps or not that simple, generally I am trying to setup a base and I usually want my dwelling no further apart than 25m. I usually eva a kerbal move him to a position then target him, in previous versions I have always landed 5 to 10m away and sometimes right on top.\u003C/p\u003E\n"},{"CreatedByName":"BARCLONE","CreatedById":76024,"CreatedDateTime":"2014-01-15T00:39:22Z","Content":"\n\u003Cp\u003EA follow-up to my last post...\u003C/p\u003E\u003Cp\u003EI was watching the screen during one rendezvous, and saw the time warp indicator (upper left corner) flicker the second arrow briefly, but repeatedly, even though the ship was supposed to be at only time warp 1. Something is tickling the warp when it shouldn\u0027t...\u003C/p\u003E\n"},{"CreatedByName":"sarbian","CreatedById":57146,"CreatedDateTime":"2014-01-15T12:36:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BARCLONE\u0022 data-cite=\u0022BARCLONE\u0022\u003E\u003Cdiv\u003E I\u0027m experiencing a lot of nav ball target reticle jittering as a burn reaches the end,[...]\u003Cp\u003EAny ideas?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EStock does it too afaik. I can\u0027t do anything about it.\u003C/p\u003E\n"},{"CreatedByName":"HoneyFox","CreatedById":19237,"CreatedDateTime":"2014-01-15T12:51:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sarbian\u0022 data-cite=\u0022sarbian\u0022\u003E\u003Cdiv\u003EStock does it too afaik. I can\u0027t do anything about it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPerhaps you can make it automatically switch to KillRot mode when the delta V is smaller than a certain threshold (a bit bigger than the threshold that judge the completion of a maneuver), then use RCS thrusters to do the last bit of tuning. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EOf course such procedure would be better to have a switch so users can decide whether they want this or not.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-15T13:11:04Z\u0022 title=\u002201/15/2014 01:11  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 15, 2014\u003C/time\u003E by HoneyFox\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Bobe","CreatedById":95803,"CreatedDateTime":"2014-01-15T12:58:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Neutrinovore\u0022 data-cite=\u0022Neutrinovore\u0022\u003E\u003Cdiv\u003EHmm. I must be doing something wrong. A lot of people are talking about how freakishly accurate the landing autopilot is, that they have to deliberately create some offset, or take manual control, in order to avoid landing right on top of the flag or object that they\u0027ve targeted for landing. The only thing I have to do to avoid landing on a specific spot or object is to target that spot and select \u0027land at target\u0027. \u003Cp\u003EMechJeb has NEVER landed me closer than 30 meters from the target, and on the few occasions when it did get that close I\u0027m pretty sure it was an accident. When I\u0027m in orbit and select \u0027land at target\u0027, MJ does the de-orbit burn, but stops trying to make corrections as soon as the predicted landing site is within 150 meters of the target, and it generally doesn\u0027t even attempt to make any corrections at all after that unless the prediction gets farther away than 500 meters or so. \u003C/p\u003E\u003Cp\u003EThis isn\u0027t really a big deal to me, I don\u0027t mind taking manual control if necessary, it\u0027s just annoying to see you guys talking about being able to have MJ land your ship right on the VAB helipad or on the launch pad without any trouble, that\u0027s all. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnyway, my $0.02. Later. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EStrange. The only issues I\u0027ve had with the landing guidance is it sometimes forgetting to perform the braking burn. Typically this is my error, as I may have forgotten to install batteries or something, but on a few occasions it has simply failed inexplicably. However, ignoring those instances, all my landing have been within 1-2 m of my target, regardless of the size, and I actually haven\u0027t experienced that issue since.\u003C/p\u003E\u003Cp\u003EI had a Mk1 lander touch down next to a rover I had waiting and it was so precise (or rather fractionally imprecise) that it nestled up snugly against the rover with its legs either side of it. It was an... intimate encounter. Recently I set up a kethane operation with three heavy landers of between 40 and 45 tons each, all landing directly on their target flags. I will say that all these landings were in a vacuum, my few landings on Duna (I\u0027ll ignore the horrific crash on Eve, my bad) were successful but I haven\u0027t tried to land at a target. I\u0027m so obsessed with setting up this kethane resupply system that my other endeavours are on the back burner.\u003C/p\u003E\n"},{"CreatedByName":"sarbian","CreatedById":57146,"CreatedDateTime":"2014-01-15T14:00:13Z","Content":"\n\u003Cp\u003EOn thing is important to mention when you talk about the landing AP (and any other problem with MJ) : do you use the official release or the dev version (and it\u0027s release number). The landing AP had some big change since the last official.\u003C/p\u003E\u003Cp\u003ELater Today or tomorrow I\u0027ll release the RCS / Docking AP I worked on for the last 2 night and we will see how it goes. It was working fine late yesterday but I need to fix something I broke in the AP logic.\u003C/p\u003E\u003Cp\u003EI amazed how hard it is to have the RCS controller do precise burn. It should be easy and yet I had to add damping just so it don\u0027t wobble all around while trying to maintain a set speed. \u003C/p\u003E\u003Cp\u003EI should check again how the RCS available thrust is computed, that may be the root of my problem. I am sure \u003Ca href=\u0022https://github.com/MuMech/MechJeb2/pull/93\u0022 rel=\u0022external nofollow\u0022\u003Ethe guy who added it\u003C/a\u003E did not know how to do it properly \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"diomedea","CreatedById":93700,"CreatedDateTime":"2014-01-15T14:07:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sarbian\u0022 data-cite=\u0022sarbian\u0022\u003E\u003Cdiv\u003E I am sure \u003Ca href=\u0022https://github.com/MuMech/MechJeb2/pull/93\u0022 rel=\u0022external nofollow\u0022\u003Ethe guy who added it\u003C/a\u003E did not know how to do it properly \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI am sure that same guy (hint who he is! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E) now knows much better, and not only about that feature.\u003C/p\u003E\n"},{"CreatedByName":"sarbian","CreatedById":57146,"CreatedDateTime":"2014-01-15T14:12:06Z","Content":"\n\u003Cp\u003EI hope he does, it was his first contribution to MJ and it was sooooo long ago \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"codepoet","CreatedById":73449,"CreatedDateTime":"2014-01-15T14:23:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DerekL1963\u0022 data-cite=\u0022DerekL1963\u0022\u003E\u003Cdiv\u003EYou and me both...\u003Cp\u003EAnd to answer Codepoets\u0027s questions;\u003C/p\u003E\u003Cp\u003E...\u003C/p\u003E\u003Cp\u003EThe answer is \u0022yes\u0022. I\u0027ve tried a variety of scenarios, and I find it impossible to predict when MJ will land right on target, and when it will land somewhere completely unrelated.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOK, well if you would like to offer up a paricular scenario that someone interested working on the code will be able to reproduce and maybe improve then please do so - it would be useful to have a save file, or craft file with full instructions and a landing location on a particular body, from a particular starting orbit. Unfortunately saying \u0022it does not work in a variety of scenarios\u0022 is not going to give anyone much to work with and is unlikely to motivate anyone to want to do any dev work on that area.\u003C/p\u003E\u003Cp\u003EI can offer some advice though related to the code I have worked on (ie parachutes): \u003C/p\u003E\u003Cp\u003E1) You will probably get better results if you have more than one parachute on your craft (particularly a drogue and a non-drouge) and use tweakables to set the full deploy height for each one be different so then each open at different times. That way the auto pilot will have more oppertunites to correct for errors by changing when it plans to open the parachutes.\u003C/p\u003E\u003Cp\u003E2) You will get the best results with the parachutes depending on the pitch angle of the velocity vector at the time that the parachute(s) are deployed. That might take a little thinking to work our that that means - basically how much you are going down against how much you are going sideways. If you are going straight down before the parachutes open (low altitude eve) then it does not matter much when they open you will always land in the same place. However if you are going almost horizontal when you deploy the parachutes (ie high altitude Duna) a small change in the ground height can make a big difference to when the parachutes are fully deployed and hence the landing location. Somewhere in between these two extremes is a peak of optimum accurarcy. (ie Kerbin).\u003C/p\u003E\u003Cp\u003EI hope this is helpful or at least interesting. Sorry that I am not offering to make it work better, but it works fine for my own gameplay, and that is what motivates me. However if you can provide a detailed scenario where it is failing I will gladly take a look.\u003C/p\u003E\n"},{"CreatedByName":"BARCLONE","CreatedById":76024,"CreatedDateTime":"2014-01-15T16:59:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sarbian\u0022 data-cite=\u0022sarbian\u0022\u003E\u003Cdiv\u003EStock does it too afaik. I can\u0027t do anything about it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBoth stock and the \u0022enhanced\u0022 mod are affected. Rats!\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022HoneyFox\u0022 data-cite=\u0022HoneyFox\u0022\u003E\u003Cdiv\u003EPerhaps you can make it automatically switch to KillRot mode when the delta V is smaller than a certain threshold (a bit bigger than the threshold that judge the completion of a maneuver), then use RCS thrusters to do the last bit of tuning. \u003Cp\u003EOf course such procedure would be better to have a switch so users can decide whether they want this or not.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s something I was wondering about -- using the RCS (if available) when the Dv required gets below a certain (user-settable?) value. Using the main engine seems to be over-kill for some of these burns, and depending on the engine, it has to be \u0022pulsed\u0022 rapidly to keep from over-burning.\u003C/p\u003E\n"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2014-01-15T18:59:29Z","Content":"\n\u003Cp\u003ESarbian, I was looking at the docking AP code to see about tweaking how the rate at which the AP approaches the docking axis. Really to change the ratio between lateralVelocityNeeded and zVelocityNeeded. Doesn\u0027t seem that hard to do but something else caught my eye which was zSep and lateralSep.magnitude. You\u0027re comparing the two in places in the code even though they\u0027re dissimilar things. The code still works (until you get very VERY close to the dock) because reducing lateral separation brings zSep within the range that it expects in order to be able to advance forward. But the earlier comparison is to check if zSep is less than lateralSep even though zSep actually has to be high (being the dot product between two vectors) in order to be considered close to the docking axis. That\u0027s why it tends to follow a diagonal course to the dock and why on a few occasions it gets hung up very close to the dock but offset by a few tenths of meters. (it probably could let go at that point and magnetic attraction take over but it\u0027s still stuck in approach mode)\u003C/p\u003E\u003Cp\u003EEdit: There\u0027s a few places in there where it seems like it\u0027s expecting that zSep is the distance to the dock (along the axis) but because it\u0027s a dot product its range will always be -1 to 1. (though for our purposes, when in front of the dock it\u0027s really going to be 0 to 1)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-15T19:11:38Z\u0022 title=\u002201/15/2014 07:11  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 15, 2014\u003C/time\u003E by Starwaster\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sarbian","CreatedById":57146,"CreatedDateTime":"2014-01-15T20:24:08Z","Content":"\n\u003Cp\u003EDot product are in the -1 to 1 range only for the dot of 2 normalized vector. Here zAxis is normalized but separation is not, so zSep is actually the distance.\u003C/p\u003E\u003Cp\u003EAnyway I am rewriting all that right now \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Damaske","CreatedById":60029,"CreatedDateTime":"2014-01-15T20:55:37Z","Content":"\n\u003Cp\u003EIs there a known problem with RAIPER engines and mechjebs vertical landing? I\u0027ve been attempting to land a ship that has 2 basic jet engines (off at time of landing) and two RAIPER engines. I run the RAIPER in air-breather mode and i end up slamming into the ground. Is there an setting that you can set the RAIPER\u0027s max output, to its lowest (at ground level) ISP (or whatever it is) so Mechjeb is forced to brake much earlier. I feel that if you set the lowest thrust as the max it can do it will burn a much better braking burn. \u003C/p\u003E\u003Cp\u003EIf needed I can submit the craft i am using to help improve testing and getting the RAIPER engines landing fine tuned.\u003C/p\u003E\n"},{"CreatedByName":"sarbian","CreatedById":57146,"CreatedDateTime":"2014-01-15T21:04:51Z","Content":"\n\u003Cp\u003EMJ will have trouble landing anything running on air-breather. They are too slow to change regime.\u003C/p\u003E\n"},{"CreatedByName":"Damaske","CreatedById":60029,"CreatedDateTime":"2014-01-15T21:51:59Z","Content":"\n\u003Cp\u003EI\u0027ve heard that the RAIPER has no spool up time or is that only the close cycle mode? Also I am using the latest dev build #167.\u003C/p\u003E\n"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2014-01-15T22:12:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sarbian\u0022 data-cite=\u0022sarbian\u0022\u003E\u003Cdiv\u003EDot product are in the -1 to 1 range only for the dot of 2 normalized vector. Here zAxis is normalized but separation is not, so zSep is actually the distance.\u003Cp\u003EAnyway I am rewriting all that right now \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou sure about that? I\u0027ve never seen a dot product out of that range before.\u003C/p\u003E\u003Cp\u003EMaybe it\u0027s because I\u0027m used to normalizing everything though but that sounds odd\u003C/p\u003E\n"},{"CreatedByName":"sarbian","CreatedById":57146,"CreatedDateTime":"2014-01-15T22:47:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Damaske\u0022 data-cite=\u0022Damaske\u0022\u003E\u003Cdiv\u003EI\u0027ve heard that the RAIPER has no spool up time or is that only the close cycle mode? Also I am using the latest dev build #167.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe AirBreathing config of the RAPIER has those value, so it has spool up time :\u003C/p\u003E\u003Cp\u003E useEngineResponseTime = True\u003C/p\u003E\u003Cp\u003E engineAccelerationSpeed = 0.2\u003C/p\u003E\u003Cp\u003E engineDecelerationSpeed = 0.35\u003C/p\u003E\u003Cp\u003EStarwaster : the definition of the dot product is the product of both vector magnitude multiplied by the cos of the angle between them, so it can indeed go beyond 1.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-15T23:56:36Z\u0022 title=\u002201/15/2014 11:56  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 15, 2014\u003C/time\u003E by sarbian\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Damaske","CreatedById":60029,"CreatedDateTime":"2014-01-15T23:26:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sarbian\u0022 data-cite=\u0022sarbian\u0022\u003E\u003Cdiv\u003EThe AirBreathing config of the RAPIER has those value, so it has spool up time :\u003Cp\u003E useEngineResponseTime = True\u003C/p\u003E\u003Cp\u003E engineAccelerationSpeed = 0.2\u003C/p\u003E\u003Cp\u003E engineDecelerationSpeed = 0.35\u003C/p\u003E\u003Cp\u003E.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eok, so make sure its in closed cycle before landing got it.\u003C/p\u003E\u003Cp\u003Estill crashed and burned in closed cycle on the VAB setting, plus with drogue parachute it missed the building completely.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-16T08:03:37Z\u0022 title=\u002201/16/2014 08:03  AM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 16, 2014\u003C/time\u003E by Damaske\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2014-01-16T10:34:39Z","Content":"\n\u003Cp\u003EIt doesn\u0027t open parachutes in more than a single stage.\u003C/p\u003E\u003Cp\u003EI took \u003Ca href=\u0022http://kerbalspaceprogram.com/craftforlandingandreturningfrombotheveandgillyinonelaunchlifterincluded/\u0022 rel=\u0022external nofollow\u0022\u003Ethis craft\u003C/a\u003E, removed the launcher, the rovers, the two side mounted cockpits/pods - everything but the Eve lander part. Then I removed the chair and the tank and engine it was sitting on, replaced with a MK1 pod with a docking port and a couple of ox stat panels. Topped off with an OKTO2 on top of the port so it could fly unmanned.\u003C/p\u003E\u003Cp\u003EDuring landing MechJeb only popped the two MK25 chutes, and it waited to do the suicide burn until the landing gear was almost touching the ground, still descending at over 20 m/sec. I lowered the gear manually earlier, so I don\u0027t know if it would also have failed to lower it soon enough.\u003C/p\u003E\u003Cp\u003EI had TAC fuel balancer running because during the deorbit burns it was draining pretty fast from the tanks that would drop first during ascent from Eve. Wouldn\u0027t work too well to have part of the ship fall off too soon.\u003C/p\u003E\u003Cp\u003EIt\u0027s supposedly a craft capable of landing on Eve with quite a bit more weight on it, and returning part of it to Eve orbit to dock with a Kerbin return vehicle. Manual flying instructions are included. As-built, to get MechJeb to properly handle the launch requires setting control to the OKTO2 under the chair on top.\u003C/p\u003E\u003Cp\u003EI\u0027ll try it again, with all the chutes put into one stage. Might also try it with the chutes removed. If that works then I\u0027ll test with a 2 man can. If that works then I\u0027ll know what sort of fuel and engine power I need. This lander is too spread out and spindly, some reconfiguring to make it bundled tighter should work with my Eve mission plan.\u003C/p\u003E\n"},{"CreatedByName":"royying","CreatedById":20591,"CreatedDateTime":"2014-01-16T15:22:12Z","Content":"\n\u003Cp\u003Enew version MJ don\u0027t show landing guidance blue marker when the predicted location is on the water\u003C/p\u003E\u003Cp\u003Ebut pointing the predicted site on water is useful for me\u003C/p\u003E\u003Cp\u003EI hope this feature will return in future version\u003C/p\u003E\n"},{"CreatedByName":"sojourner","CreatedById":65674,"CreatedDateTime":"2014-01-16T18:01:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022royying\u0022 data-cite=\u0022royying\u0022\u003E\u003Cdiv\u003Enew version MJ don\u0027t show landing guidance blue marker when the predicted location is on the water\u003Cp\u003Ebut pointing the predicted site on water is useful for me\u003C/p\u003E\u003Cp\u003EI hope this feature will return in future version\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s due to the way KSP handles water now. The marker is under the water being drawn on the surface of the planet.\u003C/p\u003E\n"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2014-01-16T20:41:40Z","Content":"\n\u003Cp\u003EA couple of bugs to report in the latest dev (build 167) version. Or they might have started in an earlier version but I\u0027ve been busy with Copernicus modeling so I haven\u0027t really noticed until I needed to dock these big ass parts.\u003C/p\u003E\u003Cp\u003EAfter undocking (or possibly undocking then switching between the two craft with []) one or more of the two become uncontrollable by MJ2 (SmartASS, maneuver nodes or docking AP or anything where it needs to adjust attitude)\u003C/p\u003E\u003Cp\u003EThere\u0027s no errors in the output_log.txt during that time other than the ones informing me that there is \u0027no icon for X\u0027 (in a rather accusatory tone I might add, yes, I KNOW MJ2! I have to download them)\u003C/p\u003E\u003Cp\u003EHowever in the attitude control panel I see -Infinity for the PID settings (Kp, Kd, Ki) and Tf setting autotunes to a value that is abnormal compared to what it usually sets for that particular craft. For instance, a very large craft (several hundred mt) might have a Tf assigned of 0.4 or a small craft might have one assigned of 1. Sometimes toggling RCS balancing a couple of times clears it but generally I have to exit to Space Port so that both craft unload.\u003C/p\u003E\u003Cp\u003EI don\u0027t see this happen except for craft that I have recently undocked.\u003C/p\u003E\n"},{"CreatedByName":"Damaske","CreatedById":60029,"CreatedDateTime":"2014-01-16T20:53:21Z","Content":"\n\u003Cp\u003EI have been noticing a recent roll to one side on my rockets under ascent autopilot, And I\u0027ve also noticed that Mechjeb does NOT control the ships roll at all. I feel that there need to be a lock to keep the roll locked in a certain potion, ( user selectable) so your able to keep the wings level to help provide lift during space plane ascents. \u003C/p\u003E\u003Cp\u003EI\u0027ve had space planes roll 90 degrees from wing level and then spin out of control due to mechjeb not keeping the wings level. Is there something that can be done aboot this or is it a \u0022stock\u0022 issue and unfixable without many headaches and code cracking?\u003C/p\u003E\n"},{"CreatedByName":"MOARdV","CreatedById":60950,"CreatedDateTime":"2014-01-16T20:58:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Starwaster\u0022 data-cite=\u0022Starwaster\u0022\u003E\u003Cdiv\u003EI don\u0027t see this happen except for craft that I have recently undocked.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think this is a \u0022feature\u0022 introduced in KSP 0.23 (not in MJ) where the command pod doesn\u0027t get reassigned after undocking. I think right-clicking on the command pod and pressing \u0022Control from Here\u0022 fixed it.\u003C/p\u003E\n"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2014-01-16T21:12:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MOARdV\u0022 data-cite=\u0022MOARdV\u0022\u003E\u003Cdiv\u003EI think this is a \u0022feature\u0022 introduced in KSP 0.23 (not in MJ) where the command pod doesn\u0027t get reassigned after undocking. I think right-clicking on the command pod and pressing \u0022Control from Here\u0022 fixed it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWow really? That sucks if that\u0027s what it is. I wonder what programmatic solutions are possible.... i.e. assigning one in the code if the attitude controller could detect that such a condition exists. But then there would be the question of where to control from? The most obvious choice would be the docking port that was previously docked. Or the root part if it\u0027s eligible. (usually is but you can\u0027t take that for granted)\u003C/p\u003E\n"}]}