{"TopicId":12355,"ForumId":34,"TopicTitle":"[PART, 1.0.2] Anatid Robotics / MuMech - MechJeb - Autopilot - Historical thread","CreatedByName":"r4m0n","CreatedById":5404,"CreatedDateTime":"2012-06-08T22:30:41Z","PageNum":329,"Articles":[{"CreatedByName":"fatbrother","CreatedById":123353,"CreatedDateTime":"2014-11-17T04:20:43Z","Content":"\n\u003Cp\u003EFeature request: special support for long burns on low orbit\u003C/p\u003E\u003Cp\u003EIt is well known that best Delta-V to kinetic energy conversion is deep in gravity well. So when you try to do an escape burn, it is best to do on a low orbit.\u003C/p\u003E\u003Cp\u003EWhen you have low TWR (like when you run a heavy ship with nuclear engines or not so heavy ship with electrical ones), time of the burn can be comparable to orbital period. I have seen posts of the people complaining on this, and the advice was to raise the orbit or make it more elliptical. But this is a loss of Delta-V.\u003C/p\u003E\u003Cp\u003EAlso, in this case, most of the burn ship is accelerating on high angle to its velocity vector. This is also a loss of delta-V. Optimal (in terms of DV to energy conversion) acceleration would be parallel to current velocity vector, like when you do a gravity turn on ascend.\u003C/p\u003E\u003Cp\u003ECan we have a special mode for low orbit low TWR burns? I see two possible ways to implement this:\u003C/p\u003E\u003Cp\u003E1. Split a maneuver node to several nodes placed along the trajectory.\u003C/p\u003E\u003Cp\u003E2. A special \u0022gravity-turn-like\u0022 mode of node execution, manually selectable or automatically engaged when burn time is \u0026gt; 10% of orbital period.\u003C/p\u003E\n"},{"CreatedByName":"MainSailor","CreatedById":74050,"CreatedDateTime":"2014-11-17T15:58:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sarbian\u0022 data-cite=\u0022sarbian\u0022\u003E\u003Cdiv\u003Edtoxic : nope. I could add something do disable it and have only one global config. I ll need to look into the impact.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat actually begs an interesting question, what does, say, the Ascent Guidance use as it\u0027s defaults? Unnamed Spacecraft\u0027s config? I think it\u0027s odd that it seems like new vessels bounce around between a default config and last used.\u003C/p\u003E\n"},{"CreatedByName":"sarbian","CreatedById":57146,"CreatedDateTime":"2014-11-17T16:14:55Z","Content":"\n\u003Cp\u003EMJ has 4 source of config and for each module field we can set up where it\u0027s saved/loaded. \u003C/p\u003E\u003Cp\u003EIf a field is set to use all 3 config level then they load with this order of priority : \u003C/p\u003E\u003Cp\u003E - the vessel config itself (in your savegame for that ship). Only present after you flew the ship once. It\u0027s the \u003Cstrong\u003Elocal\u003C/strong\u003E config.\u003C/p\u003E\u003Cp\u003E - The config file named after the vessel (in mechjeb subfolder). It lets you have a base config when you launch a new ship that share a name (and most likly a design) with a saved one. It\u0027s the \u003Cstrong\u003Etype\u003C/strong\u003E config.\u003C/p\u003E\u003Cp\u003E - The \u003Cstrong\u003Eglobal\u003C/strong\u003E MJ config. (in mechjeb subfolder).\u003C/p\u003E\u003Cp\u003E - The code default\u003C/p\u003E\u003Cp\u003EFor Ascent Guidance the config is saved in Type and Global. Which makes sense since ship that share a name most likely share and ascent profile, and since you just launched them they don\u0027t have any config in the savegame.\u003C/p\u003E\n"},{"CreatedByName":"Tahib","CreatedById":111243,"CreatedDateTime":"2014-11-17T17:01:58Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003ESmart A.S.S - Surf - Sun\u003C/strong\u003E does not always do what it should.\u003C/p\u003E\u003Cp\u003EIt seems that it points the vessel to the center of the ellipse, not to the sun directly when in Kerbol SOI. With limited solar panel efficiency, its crucial to point directly to Kerbol itself. Surf-Surf-Hdg:90,Pit:-90 works better while in Kerbol SOI.\u003C/p\u003E\n"},{"CreatedByName":"sarbian","CreatedById":57146,"CreatedDateTime":"2014-11-17T17:09:25Z","Content":"\n\u003Cp\u003EThat remind me that I need to redo that code since I found a better way since. That should fix the bug. \u003C/p\u003E\u003Cp\u003ELater today if I find the time, later this week if not.\u003C/p\u003E\n"},{"CreatedByName":"sarbian","CreatedById":57146,"CreatedDateTime":"2014-11-17T23:43:13Z","Content":"\n\u003Cp\u003EAnd it\u0027s fixed in dev.\u003C/p\u003E\n"},{"CreatedByName":"kholmar","CreatedById":76217,"CreatedDateTime":"2014-11-18T05:24:02Z","Content":"\n\u003Cp\u003Equick question, I follow your jenkins dev build page and stay right up to date with those.\u003C/p\u003E\u003Cp\u003Eon a normal day, all I need to replace is the .dll file which is why you offer it as a separate download...right?\u003C/p\u003E\u003Cp\u003Eor do you often make changes to the other files?\u003C/p\u003E\u003Cp\u003Ehow would I know?\u003C/p\u003E\u003Cp\u003Ethanks!\u003C/p\u003E\u003Cp\u003EBill\u003C/p\u003E\n"},{"CreatedByName":"sarbian","CreatedById":57146,"CreatedDateTime":"2014-11-18T10:14:29Z","Content":"\n\u003Cp\u003E99% of the time only the dll changes. But from time to time we have to add a new file and there is no clear way of seeing it unless you look at github commit.\u003C/p\u003E\n"},{"CreatedByName":"kholmar","CreatedById":76217,"CreatedDateTime":"2014-11-18T22:31:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sarbian\u0022 data-cite=\u0022sarbian\u0022\u003E\u003Cdiv\u003E99% of the time only the dll changes. But from time to time we have to add a new file and there is no clear way of seeing it unless you look at github commit.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Every good, thank you!\u003C/p\u003E\n"},{"CreatedByName":"steve_v","CreatedById":69272,"CreatedDateTime":"2014-11-20T05:01:19Z","Content":"\n\u003Cp\u003EAs much as I hate complaining, this has come to the point where it\u0027s really killing my enjoyment of the game.\u003C/p\u003E\u003Cp\u003EMJ appears to have a significant performance impact.\u003C/p\u003E\u003Cp\u003EI have been testing with a stock 0.25 \u002BMJ (current dev build) install, stock \u0027albatross\u0027 craft rolling down the runway. No control input whatsoever.\u003C/p\u003E\u003Cp\u003EGNU/Linux, both 32 \u0026amp; 64 bit builds.\u003C/p\u003E\u003Cp\u003EHaving a MechJeb module on any craft is causing regular lag spikes, both in framerate, and more importantly in physics rate.\u003C/p\u003E\u003Cp\u003EThis is most noticeable as a regular \u0027flicker\u0027 of the game clock into the yellow, with an otherwise good framerate (100\u002BFPS), camera rotation also \u0027hitches\u0027 at these intervals.\u003C/p\u003E\u003Cp\u003EThis occurs with no mechjeb windows open, becomes worse as soon as _any_ MechJeb window is displayed, including the menu.\u003C/p\u003E\u003Cp\u003EI have not found a way to log the physics rate but here are some graphs of the frametime, it\u0027s not as clear but certainly shows some impact.\u003C/p\u003E\u003Cp\u003EWithout MJ:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s10.postimg.org/nbrvzjrs9/NO_MJ.png\u0022 alt=\u0022NO_MJ.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EWith MJ:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s27.postimg.org/sgrmjqvub/image.png\u0022 alt=\u0022image.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://damnation.dnsalias.net/~steve/Player-2014-11-20T17:52:03\u002B1300-64.log\u0022 rel=\u0022external nofollow\u0022\u003ELogs\u003C/a\u003E are clean.\u003C/p\u003E\u003Cp\u003EAny ideas what\u0027s causing this, or what I can do to alleviate it?\u003C/p\u003E\u003Cp\u003EAre windows users seeing this too?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-20T07:00:29Z\u0022 title=\u002211/20/2014 07:00  AM\u0022 data-short=\u00229 yr\u0022\u003ENovember 20, 2014\u003C/time\u003E by steve_v\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"CatastrophicFailure","CreatedById":57438,"CreatedDateTime":"2014-11-20T05:21:42Z","Content":"\n\u003Cp\u003EPix no worky. And for the record, win 7 \u0026amp; 8 I\u0027ve always gotten a noticible lag with MJ windows open. Just accepted it as price of admission.\u003C/p\u003E\n"},{"CreatedByName":"steve_v","CreatedById":69272,"CreatedDateTime":"2014-11-20T07:06:38Z","Content":"\n\u003Cp\u003EIrritating, work for me. Re-hosted, better?\u003C/p\u003E\u003Cp\u003ELow frame rates I can deal with, It\u0027s the \u0027stutter\u0027 for want of a better term that\u0027s driving me nuts, even on very low part count vessels.\u003C/p\u003E\u003Cp\u003EThis lags on rails warp too, everything freezes for a fraction of a second every few seconds. Camera movement stops, input is ignored etc. makes it a real pain to fly.\u003C/p\u003E\u003Cp\u003ERemove MJ and viola, smooth framerates scaling as expected with part count.\u003C/p\u003E\u003Cp\u003EI usualy run with ~40 other mods, including some computationaly expensive plugins (FAR, KER \u0026amp; trajectories spring to mind), nothing else has this effect. Some do drop the framerate a bit, but it\u0027s a constant hit across the board - not this \u0027everything stops while MJ does it\u0027s stuff\u0027. There\u0027s got to be something more to this.\u003C/p\u003E\u003Cp\u003EI dont have to have a window open - it\u0027s just worse if I do, besides, I don\u0027t believe just drawing a static window to the screen should be more of a performance killer than for eg. an aerodynamic simulation...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-20T07:32:50Z\u0022 title=\u002211/20/2014 07:32  AM\u0022 data-short=\u00229 yr\u0022\u003ENovember 20, 2014\u003C/time\u003E by steve_v\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"xytovl","CreatedById":112756,"CreatedDateTime":"2014-11-20T07:41:23Z","Content":"\n\u003Cp\u003EI have also noticed the stutter effect, but I have been unable to get the profiler to work \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/73586-Profiling-Debugging-Support-For-KSP-Plugins-%2822-Aug-Unity-4-5%29\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/73586-Profiling-Debugging-Support-For-KSP-Plugins-%2822-Aug-Unity-4-5%29\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt collects data, but then emveepee or mprof-decoder fail to read it with plenty of \u0022Exception: ApplicationName=\u0027/usr/bin/nm\u0027, CommandLine=\u0027-n /dev/dri/card0\u0027, CurrentDirectory=\u0027\u0027, Native error= Out of memory\u0022 errors.\u003C/p\u003E\u003Cp\u003EIf anyone has useful traces I can try to analyze them, I think the .mprof file described in the ksp-devtools thread can be copied. It would help a lot to get that info and see where time is spent.\u003C/p\u003E\n"},{"CreatedByName":"steve_v","CreatedById":69272,"CreatedDateTime":"2014-11-20T08:27:37Z","Content":"\n\u003Cp\u003EYeah, I never managed to get profiling working either \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ll try again over the weekend, though I generally know my way around compilers and libraries my experience with mono / C# is practically nill, so I probably won\u0027t know what I\u0027m looking at.\u003C/p\u003E\u003Cp\u003ENevertheless, I shall attempt to get you a trace...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-20T08:42:40Z\u0022 title=\u002211/20/2014 08:42  AM\u0022 data-short=\u00229 yr\u0022\u003ENovember 20, 2014\u003C/time\u003E by steve_v\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"steve_v","CreatedById":69272,"CreatedDateTime":"2014-11-20T09:26:50Z","Content":"\n\u003Cp\u003EOK, so I have a \u003Ca href=\u0022https://www.dropbox.com/s/umf8ow5wuk5nlwu/monoprof.mprof?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Etrace\u003C/a\u003E, and I have emveepee opening it okay too (had to pass --runtime=v4.0 to mono to get emveepee to run)\u003C/p\u003E\u003Cp\u003EBut, as I suspected, It doesn\u0027t mean much to me.\u003C/p\u003E\u003Cp\u003EActually, there doesn\u0027t appear to be much information in it at all, but you may see different. Or I may be missing something \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 alt=\u0022:rolleyes:\u0022\u003E.\u003C/p\u003E\u003Cp\u003EDo I need to build MJ with debug symbols (or the C# equivalent) to get usefull data?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-20T09:30:03Z\u0022 title=\u002211/20/2014 09:30  AM\u0022 data-short=\u00229 yr\u0022\u003ENovember 20, 2014\u003C/time\u003E by steve_v\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sarbian","CreatedById":57146,"CreatedDateTime":"2014-11-20T12:46:07Z","Content":"\n\u003Cp\u003EI had the profiler to work since I was more or less one of the beta tester, and I also used an \u003Ca href=\u0022https://github.com/Faark/AssemblyBasedProfiler\u0022 rel=\u0022external nofollow\u0022\u003Eother too\u003C/a\u003El made by Faark. At the time I fixed a CPU bug that was easy to spot.\u003C/p\u003E\u003Cp\u003EI have a few ideas about the problem origin, but I m not sure I can fix them easily. ATM I m pretty sure the spikes comes from the garbage collector, which would means that MJ create far too much short lived object. There is also a problem related to the mono version used by KSP and \u0022foreach\u0022 use, but this one should not manisfest when MJ is built with VS or a recent Mono (as the jenkins server does). \u003C/p\u003E\u003Cp\u003EAn other problem could come from the dV sim, but it does not run all the time.\u003C/p\u003E\u003Cp\u003EI ll look at your trace later from home since dropxbox is blocked at work. The profiler can be useful, but it does show an average picture and spike are lost in the average data. I need to find a new way to trace those, maybe with a new version of Faark tool\u003C/p\u003E\n"},{"CreatedByName":"steve_v","CreatedById":69272,"CreatedDateTime":"2014-11-20T12:59:43Z","Content":"\n\u003Cp\u003EMy bet\u0027s on garbage collection TBH, it\u0027s awfull regular \u0026amp; about the right intervals (yes, I\u0027ve been playing with GCMonitor).\u003C/p\u003E\u003Cp\u003ENow, If I can just get the profiler set up for 64bit I might be able to see which of the _other_ mods I\u0027m running on my main install are contributing...\u003C/p\u003E\u003Cp\u003EThe more mods installed (AKA lower framerate in general) the worse this gets but MJ is the only one that has a noticeable impact alone, and certainly appears to be the biggest culprit overall.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-20T13:04:38Z\u0022 title=\u002211/20/2014 01:04  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 20, 2014\u003C/time\u003E by steve_v\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sarbian","CreatedById":57146,"CreatedDateTime":"2014-11-20T13:11:48Z","Content":"\n\u003Cp\u003EI could easily add some code in MechjebCore to track down which Module create the more garbage. I ll bet on VesselState ATM \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Vlos","CreatedById":76954,"CreatedDateTime":"2014-11-20T13:53:25Z","Content":"\n\u003Cp\u003EFeature request: automatic show/hide windows.\u003C/p\u003E\u003Cp\u003EDocking autopilot when docking port is target, node editor in map view, rendezvous autopilot when vessel is target...\u003C/p\u003E\u003Cp\u003E(and my english is so bad (google translator too)...)\u003C/p\u003E\n"},{"CreatedByName":"xytovl","CreatedById":112756,"CreatedDateTime":"2014-11-20T18:51:57Z","Content":"\n\u003Cp\u003EGarbage collector seems to be a good suspect, but there are some other functions we could check.\u003C/p\u003E\u003Cp\u003EFrom the profiler traces, I see that MuMech.MechJebModuleMenu.WindowGUI is at 1.05% of total time, and especially System.Linq.QuickSort (0.57% for the sort, of which 0.52% in the DisplayOrder Compare method).\u003C/p\u003E\u003Cp\u003EIt is unlikely that it causes stuttering as it is a flat cost for every frame but we can improve it.\u003C/p\u003E\u003Cp\u003EThe next hot point is the VesselState.Update at 0.75% (the whole fixedUpdate is 0.80%). Inside VesselUpdate, AnalyzeParts is at 0.43%, UpdateMoIAndAngularMom at 0,20% and UpdateBasicInfo at 0,1%\u003C/p\u003E\u003Cp\u003ESame comment regarding stuttering.\u003C/p\u003E\u003Cp\u003EI\u0027ll see if I can make any improvement and submit them.\u003C/p\u003E\n"},{"CreatedByName":"sarbian","CreatedById":57146,"CreatedDateTime":"2014-11-20T19:15:35Z","Content":"\n\u003Cp\u003EThe display order could be stored in a cache. It would need to be cleared when custom windows are added/removed. \u003C/p\u003E\u003Cp\u003EAs for VesselUpdate I m not surprised at all, it\u0027s here that most of the complex stuff is done. \u003C/p\u003E\u003Cp\u003EI\u0027ll look more into the memory stuff.\u003C/p\u003E\n"},{"CreatedByName":"Somtaaw","CreatedById":109192,"CreatedDateTime":"2014-11-21T19:15:18Z","Content":"\n\u003Cp\u003EI\u0027m sure this has been asked before, but I can\u0027t seem to find it in thread so I\u0027ll ask anyways.\u003C/p\u003E\u003Cp\u003EWhile using Blizzy\u0027s toolbar, Mechjeb icon is not disappearing from the stock applauncher/toolbar, and the icon stays on the right side of screen. Is this intended, or did I mess up a file somewhere so it\u0027s not properly migrating off the stock toolbar to blizzys.\u003C/p\u003E\u003Cp\u003ETo clarify slightly further, MJ is sitting on blizzy toolbar, and works when I click anything I want from there, Im just wondering why the other icons are not disappearing like other mods do when placed onto the blizzy toolbar.\u003C/p\u003E\n"},{"CreatedByName":"hazens1","CreatedById":129789,"CreatedDateTime":"2014-11-21T20:20:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Somtaaw\u0022 data-cite=\u0022Somtaaw\u0022\u003E\u003Cdiv\u003EI\u0027m sure this has been asked before, but I can\u0027t seem to find it in thread so I\u0027ll ask anyways.\u003Cp\u003EWhile using Blizzy\u0027s toolbar, Mechjeb icon is not disappearing from the stock applauncher/toolbar, and the icon stays on the right side of screen. Is this intended, or did I mess up a file somewhere so it\u0027s not properly migrating off the stock toolbar to blizzys.\u003C/p\u003E\u003Cp\u003ETo clarify slightly further, MJ is sitting on blizzy toolbar, and works when I click anything I want from there, Im just wondering why the other icons are not disappearing like other mods do when placed onto the blizzy toolbar.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere is an option in the MechJeb settings for this to remove the standard toolbar button.\u003C/p\u003E\n"},{"CreatedByName":"vpeonix0407","CreatedById":77447,"CreatedDateTime":"2014-11-22T05:30:35Z","Content":"\n\u003Cp\u003EI\u0027m wondering if someone can help me.\u003C/p\u003E\u003Cp\u003EI currently have 2 ships in orbit around Eve.\u003C/p\u003E\u003Cp\u003EI want them to rendezvous with each other but for some reason the change inclination function on Mech Jeb 2.4 isn\u0027t working properly, at least not in this instant.\u003C/p\u003E\u003Cp\u003EIt appears to set up the node properly (with the predicted orbit as required), but the ship ends up facing in the wrong direction (usually away from Eve) and my ship ends up falling out of orbit.\u003C/p\u003E\u003Cp\u003ENo other Mech Jeb function has this problem and it is doing this with both ships.\u003C/p\u003E\u003Cp\u003EIt doesn\u0027t matter if I use \u0022Change inclination\u0022 \u0022Match planes with target\u0022 or \u0022Rendezvous Autopilot\u0022.\u003C/p\u003E\u003Cp\u003EI started a sandbox game, launched a ship into Kerbal orbit, went to change inclinations and it worked fine.\u003C/p\u003E\u003Cp\u003ESo either I did something wrong with both of these ships or there is something wrong with Mech Jeb in relation to Eve.\u003C/p\u003E\u003Cp\u003ECan anybody help me?\u003C/p\u003E\n"},{"CreatedByName":"Eleven","CreatedById":60502,"CreatedDateTime":"2014-11-22T05:44:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022vpeonix0407\u0022 data-cite=\u0022vpeonix0407\u0022\u003E\u003Cdiv\u003EI\u0027m wondering if someone can help me.\u003Cp\u003EI currently have 2 ships in orbit around Eve.\u003C/p\u003E\u003Cp\u003EI want them to rendezvous with each other but for some reason the change inclination function on Mech Jeb 2.4 isn\u0027t working properly, at least not in this instant.\u003C/p\u003E\u003Cp\u003EIt appears to set up the node properly (with the predicted orbit as required), but the ship ends up facing in the wrong direction (usually away from Eve) and my ship ends up falling out of orbit.\u003C/p\u003E\u003Cp\u003ENo other Mech Jeb function has this problem and it is doing this with both ships.\u003C/p\u003E\u003Cp\u003EIt doesn\u0027t matter if I use \u0022Change inclination\u0022 \u0022Match planes with target\u0022 or \u0022Rendezvous Autopilot\u0022.\u003C/p\u003E\u003Cp\u003EI started a sandbox game, launched a ship into Kerbal orbit, went to change inclinations and it worked fine.\u003C/p\u003E\u003Cp\u003ESo either I did something wrong with both of these ships or there is something wrong with Mech Jeb in relation to Eve.\u003C/p\u003E\u003Cp\u003ECan anybody help me?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFirst and easiest guess would be that one vessel is not being controlled from the correct aspect....you know, it\u0027s being controlled from a part that has it oriented incorrectly to do what you want. Check each one and see that \u0027control from here\u0027 is where it should be \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}