{"TopicId":123699,"ForumId":16,"TopicTitle":"Kerbol orbit - disappointing science return","CreatedByName":"uncle_jew","CreatedById":152178,"CreatedDateTime":"2015-10-24T17:09:38Z","PageNum":1,"Articles":[{"CreatedByName":"uncle_jew","CreatedById":152178,"CreatedDateTime":"2015-10-24T17:09:38Z","Content":"\n\u003Cp\u003EI am a KSP beginner playing in the career mode. Just did my first short (crewed) venture out to the Kerbol orbit and back to Kerbin.\u003C/p\u003E\u003Cp\u003ESomehow I got a lot less science return from the Kerbol orbit than I hoped for. I did a materials study, a temperature scan, Mystery Goo, EVA and crew reports. KSP reported the situation as \u0022while in space high over the Sun\u0022. The experiments were brought back to Kerbin, so there should be no transmission losses.\u003C/p\u003E\u003Cp\u003EFor the materials study, I gut 50 science points (data amount:25, data value: 2.0). For comparison, a materials study done when landed on Kerbin produced 7.5 science points.\u003C/p\u003E\u003Cp\u003EAccording to \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Science#Celestial_body_multipliers\u0022 rel=\u0022external nofollow\u0022\u003Ethis table\u003C/a\u003E, following science multipliers apply:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ELanded on Kerbin: 0.3x\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EHigh in space over Kerbol: 6.5x\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThis means that the same research done \u0022high in space over Kerbol\u0022 is supposed to produce 6.5 / 0.3 = 21.6x more science than on the surface of Kerbin. But I only got 50.0 / 7.5 = 6.66x more science - a shortfall by a factor of 3.\u003C/p\u003E\u003Cp\u003EAny ideas why? Or did I miscalculate the expected return?\u003C/p\u003E\u003Cp\u003EWhile aerobraking, I accidentally turned the capsule the wrong way and overheat(?) bars at some parts showed around 50%. Could overheating during reentry have diminished the science return?\u003C/p\u003E\u003Cp\u003EAlso, I didn\u0027t upgrade my R\u0026amp;D complex yet and it lists \u0022Research Science Limit 100\u0022, but I assume this limit only applies when exchanging science points for technologies? And my total science return from the flight was 183 points, so clearly, I don\u0027t see a 100-point limit applied anywhere.\u003C/p\u003E\u003Cp\u003EThanks!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-24T18:43:59Z\u0022 title=\u002210/24/2015 06:43  PM\u0022 data-short=\u00228 yr\u0022\u003EOctober 24, 2015\u003C/time\u003E by uncle_jew\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-10-24T17:57:43Z","Content":"\n\u003Cp\u003Edid you already do a materials bay high over Kerbol once before?\u003C/p\u003E\u003Cp\u003EDiminishing returns and all that...\u003C/p\u003E\n"},{"CreatedByName":"G\u0026#039;th","CreatedById":98595,"CreatedDateTime":"2015-10-24T18:04:14Z","Content":"\n\u003Cp\u003EI believe the multiplier applies to the actual total science you return. So in reality you are getting that 6.5x science multiplier, its just you\u0027re applying it too early. If you earn 7.5 on Kerbin\u0027s surface, you\u0027ll earn 6.5x that high above Kerbol.\u003C/p\u003E\n"},{"CreatedByName":"UmbralRaptor","CreatedById":2767,"CreatedDateTime":"2015-10-24T18:06:38Z","Content":"\n\u003Cp\u003EThe table was* out of date. The high Kerbol orbit science multiplier was decreased from 6.5 to 2 around 0.90.\u003C/p\u003E\u003Cp\u003EYou are correct about the research limit being the most expensive (in terms of science points) technology you can buy.\u003C/p\u003E\u003Cp\u003E*not is -- I just fixed that bit in response to your question.\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-10-24T20:56:36Z","Content":"\n\u003Cp\u003EAlso, in answer to your other questions:\u003C/p\u003E\u003Cp\u003EHeat doesn\u0027t cause damage, at least not partially. KSP doesn\u0027t have any concept of \u0022damaged\u0022, only \u0022destroyed\u0022 (well, except for engineer-fixable items like wheels and lander legs). As long as a component doesn\u0027t overheat to the point of exploding, it\u0027s none the worse for wear.\u003C/p\u003E\u003Cp\u003EAnd the 100 science limit on the science facility only applies to the highest level of tech that you\u0027re allowed to research. It has no effect on the gathering or retrieving of science. The worst that can happen to you if you keep accumulating science without upgrading the science facility is that eventually you\u0027ll end up with a pile of unspendable science points that will just sit around until you upgrade the facility so you can spend them.\u003C/p\u003E\n"}]}