{"TopicId":123779,"ForumId":55,"TopicTitle":"Possible Jet engine intake flow through in 1.05/1.1","CreatedByName":"Rath","CreatedById":138223,"CreatedDateTime":"2015-10-26T06:42:18Z","PageNum":1,"Articles":[{"CreatedByName":"Rath","CreatedById":138223,"CreatedDateTime":"2015-10-26T06:42:18Z","Content":"\n\u003Cp\u003EOn the 1.05 imgur album (\u003Ca href=\u0022http://m.imgur.com/a/NkzMp\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://m.imgur.com/a/NkzMp\u003C/a\u003E) there is a caption for the inline intake that says it is a \u0027divertless supersonic intake\u0027. Which makes me wonder.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EAlso, in the pictures the jet fuel fuselage appears to be retextured. Which was needed, too.\u003C/p\u003E\n"},{"CreatedByName":"CaptainTurbomuffin","CreatedById":113456,"CreatedDateTime":"2015-10-26T08:50:08Z","Content":"\n\u003Cp\u003EBy adding the goliath engine, they won\u0027t heal the BJE. I found a solution: Move the BJE\u0027s vel.curves towards subsonic provinces. This would make it a subsonic engine instead of a sonic engine, and it would have much greater thrust there. Also, others suggested before that the nacelle shouldn\u0027t be useless on the BJE setup. They suggested tha the nacelle would be the engine, and the current engine the thruster. I also have a better solution for that. Make the naccelle give better vel.curves to the BJE on low speeds (like if it improved airflow). This would make things much better, and also, the BJE would become an excessively good VTOL engine. I have suggested this before, you can \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/134883-VTOL-and-Basic-Jet-fixes-%28with-test-mod%29\u0022 rel=\u0022external nofollow\u0022\u003Efind more details here.\u003C/a\u003E I also made a test mod, so you can experience that how good it is.\u003C/p\u003E\n"},{"CreatedByName":"Rath","CreatedById":138223,"CreatedDateTime":"2015-10-26T21:56:55Z","Content":"\n\u003Cp\u003EHuh? I was talking about stuff I saw in the album, not was to improve it.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EI have made suggestion like those before though.\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2015-10-27T01:25:49Z","Content":"\n\u003Cp\u003EA DSI is a type of inlet used for excellent transonic pressure recovery. It\u0027s a fairly distinctive shape. \u003Ca href=\u0022https://en.wikipedia.org/wiki/Diverterless_supersonic_inlet\u0022 rel=\u0022external nofollow\u0022\u003ESee this article here\u003C/a\u003E. It\u0027s a lighter inlet that avoids the need for an adjustable ramp, as traditionally used for high efficiency supersonic inlets.\u003C/p\u003E\n"}]}