{"TopicId":123770,"ForumId":15,"TopicTitle":"First time at making models having trouble with it.","CreatedByName":"Kazashimo123","CreatedById":152713,"CreatedDateTime":"2015-10-26T00:12:20Z","PageNum":1,"Articles":[{"CreatedByName":"Kazashimo123","CreatedById":152713,"CreatedDateTime":"2015-10-26T00:12:20Z","Content":"\n\u003Cp\u003EI am new to making mods for kerbal, I\u0027ve managed to make a basic model in Blender, but I want to make a texture for it and I have no idea how to. Also I cannot seem to figure out how to get the Part Tools in Unity, I\u0027ve looked in the forums on how to do this, but I still can\u0027t find anything.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-26T01:28:38Z\u0022 title=\u002210/26/2015 01:28  AM\u0022 data-short=\u00228 yr\u0022\u003EOctober 26, 2015\u003C/time\u003E by Kazashimo123\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"PugzInSpace","CreatedById":151638,"CreatedDateTime":"2015-10-26T04:45:13Z","Content":"\n\u003Cp\u003EThere are many ways to make a texture for your parts. You can unwrap the UVs in Blender, then take a snapshot and paint over them in a program like GIMP. You can also pre make your textures if you already know what you want, and then apply the texture to a material, then unwrap and modify the UV\u0027s over the texture in real time (this is what I prefer). As for importing Part Tools into Unity, you can just drag and drop the Part Tools folder into your assets window in the Unity workspace. It should load all of the scripts in a folder also titled Part Tools in your assets window. \u003C/p\u003E\u003Cp\u003EThere is an entire thread dedicated to modding tutorials and information by Cpt. Kipard.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/94638-Mod-Development-Links-Compilation-START-HERE\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/94638-Mod-Development-Links-Compilation-START-HERE\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EHere you can learn about modeling, texturing, animation, config files, and general information about Unity and 3D modeling programs. \u003C/p\u003E\u003Cp\u003EI wish you good luck in your modding endeavors. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"InsaneDruid","CreatedById":137849,"CreatedDateTime":"2015-10-26T09:59:55Z","Content":"\n\u003Cp\u003EYou can start \u003Ca href=\u0022http://www.blender.org/manual/editors/uv_image/index.html\u0022 rel=\u0022external nofollow\u0022\u003Ehere on blender.org\u003C/a\u003E to read more about uv-mapping and texturing in blender.\u003C/p\u003E\u003Cp\u003EBasically, you need blender and and 2d image manipulation program, like gimp or photoshop.\u003C/p\u003E\u003Cp\u003EThe best (but paid) tutorials you will find at \u003Ca href=\u0022https://cgcookie.com/learn-blender/\u0022 rel=\u0022external nofollow\u0022\u003Ecg cookie\u003C/a\u003E. Its 23 dollars for a month but in my optinion, its money WELL spent.\u003C/p\u003E\n"}]}