{"TopicId":123866,"ForumId":16,"TopicTitle":"Best ascent profile","CreatedByName":"uncle_jew","CreatedById":152178,"CreatedDateTime":"2015-10-27T17:00:37Z","PageNum":1,"Articles":[{"CreatedByName":"uncle_jew","CreatedById":152178,"CreatedDateTime":"2015-10-27T17:00:37Z","Content":"\n\u003Cp\u003EHello,\u003C/p\u003E\u003Cp\u003Ethis question has been probably asked 1000 times before: What is the best ascent profile from Kerbin?\u003C/p\u003E\u003Cp\u003EI searched for answers, and most answers are like \u0022turn 5-10 degrees after reaching 100m/s, then do a gravity turn\u0022. But the gravity turn will work \u003Cem\u003Every\u003C/em\u003E differently after tilting 5 and 10 degrees! It also depends a lot on whether or not I throttle down at max-Q.\u003C/p\u003E\u003Cp\u003EIs there a detailed table (or a calculator) somewhere for e.g. the best Kerbin ascent profile? Like:\u003C/p\u003E\u003Cp\u003Ealtitude speed pitch\u003C/p\u003E\u003Cp\u003Ealtitude speed pitch\u003C/p\u003E\u003Cp\u003Ealtitude speed pitch\u003C/p\u003E\u003Cp\u003E...\u003C/p\u003E\u003Cp\u003ESo that you could actually \u003Cstrong\u003Efollow\u003C/strong\u003E a trajectory, instead of blindly tilting \u00225-10 degrees\u0022 and hoping for the best?\u003C/p\u003E\u003Cp\u003EAlso, how do you figure out the total delta v your rocket produced? Is a mod required for this?\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-10-27T17:12:33Z","Content":"\n\u003Cp\u003EWhat you describe is my generic ascent - vertical to 100 m/s, pitchover, then hold prograde. How much the pitchover needs to be indeed depends on the rocket, so I just use a bit of trial and error. In general the higher the TWR the more aggresive the pitch over.\u003C/p\u003E\n"},{"CreatedByName":"Retread","CreatedById":89946,"CreatedDateTime":"2015-10-27T17:20:55Z","Content":"\n\u003Cp\u003EI agree that the initial nudge has a great deal to do with how a gravity turn will turn out. You can control the rate at which your rocket tips towards the horizon to some degree with the throttle, however. As you ascend, keep a close eye on your TWR; you\u0027ll need a mod like mechjob or kerbal engineer for this. (They will also calculate your delta V for you). If you find the nose of the ship not dropping to the horizon fast enough, throttle back to reduce your TWR. If it is dropping too quickly, increase your throttle. This technique does not give you a huge amount of control, and will not overcome poor design decisions, but it does allow some control over the flight path.\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2015-10-27T17:22:53Z","Content":"\n\u003Cp\u003EA well designed rocket, (and I mean on the order of NASA level design) once you pitch over ever so slightly, you can turn off SAS and it will perform about as optimal an ascent as you can get. Cantab is right, pitch at 100m/s, then follow prograde (or depending on your TWR keep slightly below prograde) and you will be fine.\u003C/p\u003E\n"},{"CreatedByName":"Reddeyfish","CreatedById":142160,"CreatedDateTime":"2015-10-27T17:25:22Z","Content":"\n\u003Cp\u003Erocket delta-v can be calculated manually, but most people use Kerbal Engineer.\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-10-27T17:41:27Z","Content":"\n\u003Cp\u003EI just typed this the other day so forgive me if I don\u0027t want to do it again lol. The thread I\u0027m linking has a lot of good info in it anyway. It does differ based on the rocket, but it\u0027s not hard to design all your rockets to be relatively consistent and you should do that. None of my launches will ever be exact, you would need Mechjeb or kOS to do that. But the procedure in that post has a list of \u0027milestones\u0027 that I try to be somewhat close to. You don\u0027t have to be perfect.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/137567-Why-is-creating-a-Kerbin-orbit-so-unpredictable?p=2262719\u0026amp;viewfull=1#post2262719\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/137567-Why-is-creating-a-Kerbin-orbit-so-unpredictable?p=2262719\u0026amp;viewfull=1#post2262719\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-27T17:47:30Z\u0022 title=\u002210/27/2015 05:47  PM\u0022 data-short=\u00228 yr\u0022\u003EOctober 27, 2015\u003C/time\u003E by Alshain\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"aluc24","CreatedById":152712,"CreatedDateTime":"2015-10-27T18:19:56Z","Content":"\n\u003Cp\u003EI have a generic ascent profile which works well for me: pitch down 2 degrees every 1000m. So at 1km you pitch to 88Ã‚Â°, at 2km - 86Ã‚Â°, and so forth. At 30km you\u0027ll have 30Ã‚Â° pitch, hold it until apoapsis reaches 70km, then pitch down to 0. Burn until desired apoapsis is reached, and do circularization burn.\u003C/p\u003E\u003Cp\u003EWorks for most rockets I designed, gives a very smooth ascent.\u003C/p\u003E\n"},{"CreatedByName":"Mastikator","CreatedById":135309,"CreatedDateTime":"2015-10-27T18:48:08Z","Content":"\n\u003Cp\u003EThe higher the TWR the more you turn. A normal 1.4 TWR should do a 10-20 degree turn when you get to 100m/s (depending on the TWR of later stages). You pay less gravity drag when you burn horizontally.\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-10-27T20:29:49Z","Content":"\n\u003Cp\u003EThe amount of pitch really does depend on ship\u0027s TWR. It also depends on what your planned velocity profile is, for managing aerodynamic drag. The issue is that aero drag spikes upward sharply at Mach 1, which is a bit over 300 m/s at sea level on Kerbin.\u003C/p\u003E\u003Cp\u003EI\u0027ve seen a couple of schools of thought on this:\u003C/p\u003E\u003Cp\u003EOption #1: Take it slow. Avoid going over Mach 1 until you\u0027re high enough in the atmosphere that aero drag isn\u0027t such an issue. With this approach, keep speed under 300 m/s until you\u0027re over 10 km, then punch it hard.\u003C/p\u003E\u003Cp\u003EOption #2: Bat out of hell. If you have a high enough TWR, just blast right through Mach 1 and head out of the atmosphere as fast as you possibly can.\u003C/p\u003E\u003Cp\u003EI tend to go with option #1 myself (primarily because to use #2, I\u0027d have to have a wastefully high TWR, with too much mass dedicated to engines).\u003C/p\u003E\u003Cp\u003EThis affects ascent profile, because the \u0022take it slow\u0022 approach means that your gravity turn will bend harder, so you wouldn\u0027t pitch over as much. Whereas the #2 approach would need to pitch harder sooner, because its pitch won\u0027t drop by as much in the gravity turn because it\u0027ll be going so fast.\u003C/p\u003E\n"},{"CreatedByName":"uncle_jew","CreatedById":152178,"CreatedDateTime":"2015-10-27T22:14:52Z","Content":"\n\u003Cp\u003EThanks for the feedback. How big are the delta-V losses due to the atmosphere?\u003C/p\u003E\u003Cp\u003EI keep the speed under 300m/s until 10km. But there is still some air friction above 10km. If I have the rocket tilted by 45 degrees when I hit the 10km mark, the rocket will be glowing red hot between 20km and 30km altitude - but how much delta V does it lose due to that? If I keep it tilted at 25-30 degrees between 10-20km, I get to orbit without any (visible) air friction effects.\u003C/p\u003E\u003Cp\u003EI use engine gimbaling with the SAS to control the tilt - the SAS is in the prograde mode, with occasional manual inputs.\u003C/p\u003E\n"},{"CreatedByName":"Retread","CreatedById":89946,"CreatedDateTime":"2015-10-27T22:41:32Z","Content":"\n\u003Cp\u003EOnce you\u0027re above 10km, friction losses are pretty minimal, despite the fireworks going on around your rocket.\u003C/p\u003E\u003Cp\u003EWith the right rocket design, you can actually turn SAS right off, and let the rocket fly itself to space on a gravity turn, naturally following the prograde marker. It takes some practice adjusting your TWR in flight, but I do most of my launches without SAS now.\u003C/p\u003E\n"},{"CreatedByName":"FancyMouse","CreatedById":142946,"CreatedDateTime":"2015-10-27T23:11:56Z","Content":"\n\u003Cp\u003ENot glowing red is a sign of not enough gravity turn. Drag loss is a lot less than it seems from visual effects.\u003C/p\u003E\n"}]}