{"TopicId":124072,"ForumId":16,"TopicTitle":"Tips on undersizing engines?","CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2015-10-30T06:50:32Z","PageNum":1,"Articles":[{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2015-10-30T06:50:32Z","Content":"\n\u003Cp\u003EI\u0027m generally fine with low-TWR orbital stages that don\u0027t need to land anywhere. So often enough, when hoosing an engine for them, I\u0027m tempted to downsize - mount a Terrier instead of a Poodle, for instance. But at the same time, I feel kind of pressured into mounting the Poodle anyway, because I know that the stack will start to wobble a lot if I suddenly go 2.5m -\u0026gt; 1.25m -\u0026gt; 2.5m somewhere in the middle. And I\u0027ve only had limited success trying to fight it with struts.\u003C/p\u003E\u003Cp\u003EDo any of you regularly take smaller engines than the stack size would dictate? And if you do, how do you deal with the wobble?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-30T19:46:35Z\u0022 title=\u002210/30/2015 07:46  PM\u0022 data-short=\u00228 yr\u0022\u003EOctober 30, 2015\u003C/time\u003E by Streetwind\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"FancyMouse","CreatedById":142946,"CreatedDateTime":"2015-10-30T07:15:16Z","Content":"\n\u003Cp\u003ENot too regularly but I do it sometimes (most notably hitchhiker\u002B909 and then land on places like Mun). I don\u0027t feel bad about it, and I haven\u0027t had any problem with it - 4 strut setup is usually enough for me. I always *feel* put the struts with a X setup is more stable than \u002B when doing maneuver towards one of the \u002B direction. No evidence, though.\u003C/p\u003E\u003Cp\u003EOr maybe my payload is just not heavy enough so that struts can easily win.\u003C/p\u003E\n"},{"CreatedByName":"Geher","CreatedById":116288,"CreatedDateTime":"2015-10-30T07:19:27Z","Content":"\n\u003Cp\u003EMOAR STRUTS!\u003C/p\u003E\u003Cp\u003EWhen I have a really long thin rocket that\u0027s very wobbly I put Cubic Octagonal Struts on the Side of the rocket and connect them with normal struts.\u003C/p\u003E\u003Cp\u003EBut for the case of the engine being smaller than the tank, 3 struts from the lower tank to the upper tank (the small engine is inbetween) should be enough.\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2015-10-30T08:06:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Geher\u0022 data-cite=\u0022Geher\u0022\u003E\u003Cdiv\u003EBut for the case of the engine being smaller than the tank, 3 struts from the lower tank to the upper tank (the small engine is inbetween) should be enough.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell as I said, my results with struts have been mixed. How would I attach them for consistently good results? Straight up? Slanted inwards? Slanted outwards? Slanted sideways and crossed?\u003C/p\u003E\n"},{"CreatedByName":"sgt_flyer","CreatedById":57690,"CreatedDateTime":"2015-10-30T09:30:40Z","Content":"\n\u003Cp\u003EI generally have good results with slanted sideways and not crossing (triangles), but sideways and crossing works equally well \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E (but you need to place them as close as the stage\u0027s side as possible)\u003C/p\u003E\u003Cp\u003EUsing adapters can also help (even the flat ones) - joining nodes of two different sizes is generally more wobbly \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s the designs of open lattice russian designs anyway. (Sideways Triangles on soyuz, sideways crossings on proton and N1 rocket)\u003C/p\u003E\u003Cp\u003EI\u0027ve used with good results this sideway crossings / triangles within my chaos star rockets, and they are quite stiff despite the payload\u0027s weight \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/115732-V1-04-Chaos-Star-Series-1500-1200-and-500-tons-to-LKO-launcher-maximum-fairing-diameter\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/115732-V1-04-Chaos-Star-Series-1500-1200-and-500-tons-to-LKO-launcher-maximum-fairing-diameter\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-30T09:41:53Z\u0022 title=\u002210/30/2015 09:41  AM\u0022 data-short=\u00228 yr\u0022\u003EOctober 30, 2015\u003C/time\u003E by sgt_flyer\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-10-30T09:42:45Z","Content":"\n\u003Cp\u003EI frequently put a 48-7s on a 1.25m stack and never have problems. Of course, the payloads are usually small too. I have used 3 or 4 vertical struts with good results.\u003C/p\u003E\u003Cp\u003EI\u0027ve used a terrier (or even a nuke or a swivel/reliant, though I haven\u0027t used those in space outside of early career in a while) on the larger tanks, too, and in those cases if the vertical struts don\u0027t work, 6 or 8 struts in sets of 2 in an X pattern does the trick.\u003C/p\u003E\u003Cp\u003EIt also helps sometimes to disable all control devices on your payload during launch, and put a probe core somewhere on the lifter and control from there on liftoff. Then if your payload wobbles, the lifting engines don\u0027t gimble all crazily trying to \u0022correct\u0022 a problem that\u0027s not there.\u003C/p\u003E\n"},{"CreatedByName":"nothingSpecial","CreatedById":118683,"CreatedDateTime":"2015-10-30T09:43:33Z","Content":"\n\u003Cp\u003EThat was really my first problem with KSP. I tried to simulate Ariane-like wide payload fairing with 2.5m payload on 1.25m lifter back in 23.0, and it didn\u0027t work well.\u003C/p\u003E\u003Cp\u003EFirst of all - yeah, cube-strut-cube setup can help you.\u003C/p\u003E\u003Cp\u003EShortening the stack and investing in boosters (I believe) also can help you deal with wobble.\u003C/p\u003E\u003Cp\u003EGenerally speaking, try to not put rocket under wobble at all - low angle of attack, no phys-warp.\u003C/p\u003E\u003Cp\u003EIf you have some extra payload, not just fuel-heatshield-capsule, consider to put it behind your Terrier in stack and once in orbit just rotate the craft and dock to it, the way Apollo CSM did it with LEM.\u003C/p\u003E\u003Cp\u003ETry to increase number of struts. I usually go for six or eight struts total.\u003C/p\u003E\u003Cp\u003EIf you feel like engineering, you can do something crazy like skycranning and multidocking.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://i.gyazo.com/54f09139ac1ac81cc391fd5e4c90c425.png\u0022 alt=\u002254f09139ac1ac81cc391fd5e4c90c425.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-10-30T09:54:44Z","Content":"\n\u003Cp\u003EAttaching engines radially works well for me. For example, if I have a 2.5m stack, radially attach a couple of the 4-ton-capacity 1.25m tanks, and put the engines on those. Then the butt end of my 2.5m stack can just attach directly to a decoupler. Nice and stiff (better, in fact, than if I had gone with a Poodle).\u003C/p\u003E\u003Cp\u003EIt\u0027s a win all around. It reduces the vertical height, which makes it less floppy. Shorter means lower moment of angular inertia, which means my reaction wheels get more bang for their buck. Having a couple of 1.25m stacks off to the side that aren\u0027t part of the main structural integrity core of the ship gives me a really convenient place to pack on stack-mounted components (reaction wheels, batteries, ore tanks, whatever) without boosting either the height or the part count of the ship\u0027s central core, which really helps stiffness a lot. The side-mounted engines mean I can use long, awkwardly shaped engines if I want to (such as LV-Ns), and they give a convenient mount point to stick on a couple of SRBs below them for launch. Having the outriggers out to the side also gives a convenient mounting location for laterally attached solar panels, since it moves them out from the center of the ship so they\u0027re less likely to get shaded.\u003C/p\u003E\n"},{"CreatedByName":"sgt_flyer","CreatedById":57690,"CreatedDateTime":"2015-10-30T10:07:53Z","Content":"\n\u003Cp\u003EAnother possibility, is to use the translation tool technique to create a gap between the fuel tank and the decoupler, then put your terrier on a radial attachment point and radially attach it to the fuel tank \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/43086-Open-Source-Construction-Techniques-for-Craft-Aesthetics?p=1709894\u0026amp;viewfull=1#post1709894\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/43086-Open-Source-Construction-Techniques-for-Craft-Aesthetics?p=1709894\u0026amp;viewfull=1#post1709894\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBasically, place your upper stage fuel tank, add a 2.5m decoupler directly under it. Use the rotation tool to turn the decoupler vertically by 90Ã‚Â° (In \u0027snap\u0027 mode, then translate the decoupler downwards as far as you need (in smooth mode, to avoid unwanted sideways movements). Go back to the rotation tool in \u0027snap\u0027 mode to put back the decoupler horizontally, and you\u0027ll have a gap between the tank and the decoupler. Finally add your radial attachment point \u002B terrier underneath the tank. No more 2.5 -\u0026gt; 1.25 -\u0026gt; 2.5 problem \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E (you can add a few struts to connect the lower stage to the upper stage if you want, to keep a \u0027realistic\u0027 connection between the two \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-10-30T11:18:04Z","Content":"\n\u003Cp\u003EWhat I\u0027ve always done is, from the top: 2.5m tank, 1.25m engine, 1.25m decoupler, 2.5m fairing base, 2.5m tank. Then take the fairing straight up to the tank above. Then three or four struts down from the bottom of the upper tank into the fairing base.\u003C/p\u003E\u003Cp\u003EWhat I also do is put a probe core somewhere on my launcher, usually on either the first or second stage, and control from it during launch. A Stayputnik on a small nose cone does well and looks kinda neat. SAS responds to the movement of the controlling part, so this means that if the top of the rocket wobbles a bit it doesn\u0027t matter as much.\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2015-10-30T12:06:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sgt_flyer\u0022 data-cite=\u0022sgt_flyer\u0022\u003E\u003Cdiv\u003EUsing adapters can also help (even the flat ones) - joining nodes of two different sizes is generally more wobbly \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022https://dl.dropboxusercontent.com/u/44754370/screenshot35.png\u0022 rel=\u0022external nofollow\u0022\u003EI have done this before\u003C/a\u003E. The Kerbal President sent me a sternly worded letter on manners and propriety. I do not do this anymore.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00225thHorseman\u0022 data-cite=\u00225thHorseman\u0022\u003E\u003Cdiv\u003EIt also helps sometimes to disable all control devices on your payload during launch, and put a probe core somewhere on the lifter and control from there on liftoff. Then if your payload wobbles, the lifting engines don\u0027t gimble all crazily trying to \u0022correct\u0022 a problem that\u0027s not there.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EInteresting idea... I shall investigate.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sgt_flyer\u0022 data-cite=\u0022sgt_flyer\u0022\u003E\u003Cdiv\u003EBasically, place your upper stage fuel tank, add a 2.5m decoupler directly under it. Use the rotation tool to turn the decoupler vertically by 90Ã‚Â° (In \u0027snap\u0027 mode, then translate the decoupler downwards as far as you need (in smooth mode, to avoid unwanted sideways movements). Go back to the rotation tool in \u0027snap\u0027 mode to put back the decoupler horizontally, and you\u0027ll have a gap between the tank and the decoupler. Finally add your radial attachment point \u002B terrier underneath the tank. No more 2.5 -\u0026gt; 1.25 -\u0026gt; 2.5 problem \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E (you can add a few struts to connect the lower stage to the upper stage if you want, to keep a \u0027realistic\u0027 connection between the two \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENow THAT\u0027S an intriguing trick! Definitely going to try that one. Although it\u0027ll probably keep me from forming an interstage around the gap... or maybe not... must experiment.\u003C/p\u003E\n"},{"CreatedByName":"SpaceplaneAddict","CreatedById":149322,"CreatedDateTime":"2015-10-30T13:37:12Z","Content":"\n\u003Cp\u003EI just did. One tweakscaled jet fuel tank and a 1.25 nuke engine. Trying to fight a wobble? Try using just one tank then the engine. So Tank-Engine-Whatever\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-10-30T15:14:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003EWhat I\u0027ve always done is, from the top: 2.5m tank, 1.25m engine, 1.25m decoupler, 2.5m fairing base, 2.5m tank. Then take the fairing straight up to the tank above. Then three or four struts down from the bottom of the upper tank into the fairing base.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOne issue with that approach is that since you\u0027re starting the struts from the top stage, their mass will stay with it after stage separation. That would be .2 tons if you have four struts. (Maybe not much of an issue if your top stage is really massive).\u003C/p\u003E\u003Cp\u003EAdding the short, squat 2.5m-to-1.25m adapter on top of the fairing base allows placing the struts there and extending them upwards, so they\u0027ll get dropped she. You stage.\u003C/p\u003E\u003Cp\u003EOr just omit the interstage fairing and eat the aero hit you take from the mid-stack roughness.\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2015-10-30T15:24:52Z","Content":"\n\u003Cp\u003EMy Mun/Minmus landers are usually pretty simple: Mk2 Lander-can, Rockomax X200-8 and powered by just a single LV-909 \u0022Terrier\u0022 More than enough to land and get back to orbit.\u003C/p\u003E\u003Cp\u003EThe Poodle is slightly more efficient engine but weighs more than three times as much. The weight difference more than makes up for the slightly lower ISP.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://wiki.kerbalspaceprogram.com/images/f/f1/Mk2can.png\u0022 alt=\u0022Mk2can.png\u0022\u003E\u003Cimg src=\u0022http://wiki.kerbalspaceprogram.com/images/thumb/5/50/X200-8_FT.png/190px-X200-8_FT.png\u0022 alt=\u0022190px-X200-8_FT.png\u0022\u003E\u003Cimg src=\u0022http://wiki.kerbalspaceprogram.com/images/thumb/9/9b/LV-T909_LFE.png/190px-LV-T909_LFE.png\u0022 alt=\u0022190px-LV-T909_LFE.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-30T15:27:07Z\u0022 title=\u002210/30/2015 03:27  PM\u0022 data-short=\u00228 yr\u0022\u003EOctober 30, 2015\u003C/time\u003E by Tex_NL\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"celem","CreatedById":91132,"CreatedDateTime":"2015-10-30T17:26:51Z","Content":"\n\u003Cp\u003EI will say that if you are experiencing wobble across a weak joint like this then one of my main steps is to disable all the torque and RCS stuff from above the join. It doesnt help that on launch your main core is gimballing at the back \u003Cstrong\u003Eand\u003C/strong\u003E the pod up front is trying to torque, leads to aggravation of the flexing. Once out of atmosphere its less harmfull but imparts a lot of stress during atmopsheric flight if your rocket keeps assuming a banana-like profile.\u003C/p\u003E\n"},{"CreatedByName":"Van Disaster","CreatedById":58876,"CreatedDateTime":"2015-10-30T17:50:21Z","Content":"\n\u003Cp\u003EPretty much re-iterating what\u0027s said before: put a core on your launcher - it helps if you build launchers seperately \u0026amp; payloads as subassemblies - and disable reaction wheels on the payload, make sure you \u0022control from here\u0022 on the launcher\u0027s core. If you\u0027re running mods then iirc procedural fairings will auto-strut the payload, although I may have a faulty memory \u0026amp; mistaking that for auto-strutting the fairing. You might try rebuilding the launcher so the initial high-power boost stage is actually two boost stages attached radially, and the upper atmosphere/orbital insertion stage is the one under the payload - that way you can strut the payload to all stages.\u003C/p\u003E\u003Cp\u003EAs a last resort you could radially mount even smaller engines:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://flic.kr/p/y3UYAj\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022https://farm6.staticflickr.com/5672/21036385766_8d01e324bb_z.jpg\u0022 alt=\u002221036385766_8d01e324bb_z.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Sovek","CreatedById":57251,"CreatedDateTime":"2015-10-30T20:28:08Z","Content":"\n\u003Cp\u003EMy suggestion is using Procedural Parts (fuel tanks and fairings) and make the rocket the way you need it. I find clustering/smaller engines for upper stages to be very effective. My current 3 kerbal rocket uses 6 H-1 engines for the first stage (1.25m engines, on 2.5m tanks) and 3 RL-10s for second stage/transfer. CSM engine is like a .625 part.\u003C/p\u003E\n"},{"CreatedByName":"Norcalplanner","CreatedById":112223,"CreatedDateTime":"2015-11-01T05:51:16Z","Content":"\n\u003Cp\u003EThree letters - KJR\u003C/p\u003E\n"}]}