{"TopicId":124063,"ForumId":16,"TopicTitle":"Late Launch Spinout Problem","CreatedByName":"ToThaMun!","CreatedById":152909,"CreatedDateTime":"2015-10-30T02:58:39Z","PageNum":1,"Articles":[{"CreatedByName":"ToThaMun!","CreatedById":152909,"CreatedDateTime":"2015-10-30T02:58:39Z","Content":"\n\u003Cp\u003EHey guys. New player to Kerbal here and have been working toward getting to the Mun on my own. I\u0027ve gotten several craft into orbit and space but I\u0027m working on a solution to actually do the above and be able to get to the moon with fuel left over. Been trying to maximize thrust and lighten my ship perhaps or just throw in a ton of fuel pods. I\u0027m doing career mode btw. Currently unlocked the \u0022 Advanced \u0022 areas.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://abload.de/img/kerbalrocket1hgusc.png\u0022 alt=\u0022kerbalrocket1hgusc.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EPic of the current rocket I\u0027m working with. The thing is, and its been an issue with a lot of rockets I\u0027ve made. The thing goes straight up just fine, but when it hits about 7Km or 10Km or so it starts to pitch up and it is completely uncontrollable and it eventually just leads to a pure spin. \u003C/p\u003E\u003Cp\u003EAny ideas on how to get this rocket to stay stable throughout the gravity manuever and all that? This thing has enough thrust to get me into at the very least the last part of the atmosphere before I decouple and go into my space rocket with triple small boosters with fuel on its own. I use that rocket for actual space travel. If I can stabalize the launch I\u0027ll work on giving my main rocket enough fuel for the Mun but atm just trying to figure out this constant pitch problem at 7-10Km. Ir has happened with a lot of other rocket builds too. Around the same time frame. 7-10Km.\u003C/p\u003E\n"},{"CreatedByName":"Phil deCube","CreatedById":120897,"CreatedDateTime":"2015-10-30T03:07:12Z","Content":"\n\u003Cp\u003EIn the Tutorials sub-folder underneath this one you\u0027ll find \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/117876-Why-Does-My-FLIPing-Rocket-Always-Flip-Over%21-%28Easy-Picture-Explanation%29\u0022 rel=\u0022external nofollow\u0022\u003Ethis tutorial\u003C/a\u003E.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-30T03:50:37Z\u0022 title=\u002210/30/2015 03:50  AM\u0022 data-short=\u00228 yr\u0022\u003EOctober 30, 2015\u003C/time\u003E by Phil deCube\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DeMatt","CreatedById":90539,"CreatedDateTime":"2015-10-30T03:45:33Z","Content":"\n\u003Cp\u003EFor a craft intended to orbit the Mun, but not land on it, I see the following issues:\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EYou have two decouplers for each of the solid rocket boosters. Don\u0027t do that, the SRBs only attach to one - the one you click the SRB into place on. Feel free to use struts if you have problems with them wobbling - they\u0027ll automatically break when the decoupler fires.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ENeeds solar panels and batteries to power the reaction wheels in the capsule.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ERadiator\u0027s unnecessary. Use a heat shield, and dump everything but the capsule before reentry.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe Mk1 Command Pod is both cheaper and lighter than the Mk1 Cockpit, and it even has a node for precisely the parachute capable of landing it.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EYou lack fins. A set of AV-R8\u0027s will give you extra steering authority in the atmosphere.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe Thud engines are unnecessary for the LKO-Mun-and-back part of the flight, and poorly designed for the launch-to-LKO part.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EI assume the decoupler beneath the center LV-909 is there for adding another stage, and you\u0027re not trying to fly with it.\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"Rath","CreatedById":138223,"CreatedDateTime":"2015-10-30T05:05:29Z","Content":"\n\u003Cp\u003EAnother thing I see--By using the good \u0027ol Mk1 eyeball I can tell that it probably doesnt have enough Delta V\u003C/p\u003E\n"},{"CreatedByName":"ToThaMun!","CreatedById":152909,"CreatedDateTime":"2015-10-30T05:52:18Z","Content":"\n\u003Cp\u003EThanks for the answers and the tips guys! I pretty much scrapped that design and went with something a bit different. Actually made it to the Mun! I didn\u0027t have enough fuel to orbit or anything but I got pretty close and was able to land back on Kerbal with my ship intact. I felt like one of those dudes from NASA pumping my fist and hopping up and down once I actually landed safely. Didn\u0027t think it was going to happen as I ran out of fuel on approach and was coming in at 3100km/s lol.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://abload.de/img/kerbalmunrocket8cjij.png\u0022 alt=\u0022kerbalmunrocket8cjij.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHeres the one that got me there this time. I\u0027m going to take what you guys have said and see if I can get the OP type out of orbit next. I\u0027d like to be able to build a full on spaceship and get it into orbit with the boosters and then detach and see what happens from there. Kind of what I did above though really.\u003C/p\u003E\n"},{"CreatedByName":"CrashTestDanny","CreatedById":151030,"CreatedDateTime":"2015-10-30T05:56:18Z","Content":"\n\u003Cp\u003EOne word... FINS... If you are losing control during atmospheric flight, fins are probably the answer.\u003C/p\u003E\u003Cp\u003EDanny\u003C/p\u003E\n"},{"CreatedByName":"LTrotsky","CreatedById":152994,"CreatedDateTime":"2015-11-01T12:30:19Z","Content":"\n\u003Cp\u003E1. Loss of Control During Kerbin Ascent. \u003C/p\u003E\u003Cp\u003EAssuming you haven\u0027t built and aerodynamic disaster, this is almost always due to overthrust. The aero model now isn\u0027t very tolerant of vehicles moving fast through the atmosphere where the center of mass is closer to the top than the bottom of the vehicle. The more thrust you are applying to the vehicle, the worse it gets. If you have a craft applying 3g accel, and the thrust is at the bottom and the center of mass is at the top, you will flip in atmosphere. Most vehicles do not need more than 2g accel capability for 3 minutes to get into orbit. Anything beyond 2g is probably wasting fuel bigtime due to drag (\u0027pushing wind\u0027).\u003C/p\u003E\u003Cp\u003E2. Overengineering. \u003C/p\u003E\u003Cp\u003EYou can get to the Mun with much much less than you are building. Try something much simpler, and arrange your staging for specific functions. In most cases, you should have 2 stages to get into LKO, 1 for the heavy lift off the pad at between 1.5 and 1.8g, and a second stage (which I call the Orbit Build stage) which can provide around 2g accel until you build a 75k orbit. Remember the 10Kn to 1ton ratio: for every 1 ton of vehicle, you need 10Kn to provide 1g. If your vehicle has 40tons on the pad, you need 800Kn for 2g, etc. Your third stage should be a transit stage, and you may need an additional stage for return, depending on what you are doing. Getting to the Mun requires about 860 Dv, but remember that Orbit Capture requires around 300Dv, depending on your approach velocity. Escape and return to Kerbin requires no more than 300Dv. \u003C/p\u003E\u003Cp\u003EUse Korolev\u0027s Rocket Formula to calculate Dv in each stage. For this to be useful, you need to know how much Dv you need for each stage to complete it\u0027s function. \u003C/p\u003E\u003Cp\u003EStage 1 - Heavy Lift (or Launch Boost) = 2000 to 2500 Dv. \u003C/p\u003E\u003Cp\u003EStage 2 - Orbit Build = 2000 to 2500 Dv.\u003C/p\u003E\u003Cp\u003EStage 3 - Transit and Orbit Capture = 1300 Dv\u003C/p\u003E\u003Cp\u003EStage 4 - Kerbin Return = 300 Dv. \u003C/p\u003E\u003Cp\u003ESay you have a 4 stage rocket. In the VAB, note the mass in the Engineer\u0027s report (that number is now M1). Now empty all the tanks in the first stage, and check the new mass. That number is now M2. \u003C/p\u003E\u003Cp\u003EFind your Dv by : ln(M1/M2) * ISP * 9.81 = Dv for that stage.\u003C/p\u003E\n"},{"CreatedByName":"AlextheBodacious","CreatedById":139447,"CreatedDateTime":"2015-11-02T04:39:07Z","Content":"\n\u003Cp\u003EIf you test your rockets in the demo (or any early) version your in-game experience will multiply x10.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-11-02T08:42:51Z","Content":"\n\u003Cp\u003EIf you want to eyeball your craft without doing a ton of math, you can see your TWR on launch. The G meter on the right side of the navball has a tick for each 1G of acceleration your ship is under. On the launchpad, it\u0027s a 1G. When you launch, you want it to be about halfway up between that and the next tick.\u003C/p\u003E\n"}]}