{"TopicId":124423,"ForumId":55,"TopicTitle":"The new, longer jet engine models","CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-11-04T13:35:20Z","PageNum":8,"Articles":[{"CreatedByName":"Foxster","CreatedById":113764,"CreatedDateTime":"2015-11-05T21:03:15Z","Content":"\n\u003Cp\u003EIt does rather seem as though they are like a broken pencil.\u003C/p\u003E\n"},{"CreatedByName":"BlueCanary","CreatedById":131301,"CreatedDateTime":"2015-11-05T21:46:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bloody_looser\u0022 data-cite=\u0022Bloody_looser\u0022\u003E\u003Cdiv\u003EJust because I don\u0027t use exploit, it won\u0027t disappear. Cubic strutted nozzles have nothing to do with real life.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EVertically placed nozzles with the actual engine there in all but appearance (in pretty much every VTOL I\u0027ve seen on the Spacecraft Exchange there is space where the engine could be in real life, and the nozzle weighs as much as the engine would) don\u0027t seem at all like an exploit to me. All this is doing is limiting designs to ones where the engine is directly in front of the nozzle, which is not a limitation present in real life, and is also one that will be a huge issue for a lot of people.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EDebatable at the least. Creativity, or so I\u0027ve been told around here, is working within the confines of the given pieces to create something new and unexpected. Pieces are changing and you won\u0027t be able to create the old, tired things you\u0027ve been creating. Try something new! We\u0027re getting a 0.625m engine to go with the bigger ones, no reason a few of those can\u0027t be clipped into an airframe for VTOL work.\u003Cp\u003EThis is exactly like the arguments against changing to a new aerodynamic model; pure doom and gloom. You either adapt, mod it to your liking, or walk away. If this change goes through, that is. I hope it does, the parts look pretty good (more polys please).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is completely different from arguments against a new aerodynamic model - the new aerodynamic meant considerably more realistic gameplay and quite a lot of extra options in how people played the game. This is a change that will barely affect some people, but also be a massive annoyance for a lot of others, and doesn\u0027t bring any substantial benefits to make up for the negatives.\u003C/p\u003E\u003Cp\u003EAnd yes, we are getting a 0.625m jet. It also has a great big awkward engine sticking out of it.\u003C/p\u003E\n"},{"CreatedByName":"Frozen_Heart","CreatedById":118627,"CreatedDateTime":"2015-11-05T22:00:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EJust because I don\u0027t use exploit, it won\u0027t disappear. Cubic strutted nozzles have nothing to do with real life.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOf course VTOLs are just a glitch and are completely impossible in real life. Just an exploit like infiglide or K-drive or airhogging. They have no place in a realistic physics game. /s\u003C/p\u003E\n"},{"CreatedByName":"Majorjim!","CreatedById":61954,"CreatedDateTime":"2015-11-05T22:17:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Capt Snuggler\u0022 data-cite=\u0022Capt Snuggler\u0022\u003E\u003Cdiv\u003Epoint is the poll says people are pro turbine.\u003Cp\u003EI\u0027m only in favour of the turbine\u003Cspan style=\u0022font-size:8px;\u0022\u003E(compressor/tubewithspinnyblades)\u003C/span\u003E part being present on the craft somewhere, but not necessarily attached directly to the nozzle part. id rather it be a separate part.(with additional functions) but ill settle for squads idea rather than no turbine at all.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt says \u003Cem\u003Esome\u003C/em\u003E people are interested in it. The way I look at it is it only makes sense if the turbine can be separate from the nozzle. This would keep both camps happy.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EDebatable at the least. Creativity, or so I\u0027ve been told around here, is working within the confines of the given pieces to create something new and unexpected. Pieces are changing and you won\u0027t be able to create the old, tired things you\u0027ve been creating. Try something new! We\u0027re getting a 0.625m engine to go with the bigger ones, no reason a few of those can\u0027t be clipped into an airframe for VTOL work.\u003Cp\u003EThis is exactly like the arguments against changing to a new aerodynamic model; pure doom and gloom. You either adapt, mod it to your liking, or walk away. If this change goes through, that is. I hope it does, the parts look pretty good (more polys please).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou keep saying that Regex, \u0022creativity, or so I\u0027m told here..\u0022 Do you have your own interpretation of what \u0027creativity\u0027 is?\u003C/p\u003E\n"},{"CreatedByName":"Noname117","CreatedById":53624,"CreatedDateTime":"2015-11-05T22:48:43Z","Content":"\n\u003Cp\u003EYeah, as it\u0027s been mentioned several times, this change gives limited benefit for major losses, especially with the VTOL crowd. Now I\u0027m not saying turbines should never be added to the game, but I think we should leave them out for this next update. The turbines should only be added when they add a way to still build nice looking VTOLS. This would entitle either adding in VTOL engines, or making the turbines a separate part. If they can\u0027t do either before 1.0.5 comes out, then they shouldn\u0027t add the turbines.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-11-05T22:53:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BlueCanary\u0022 data-cite=\u0022BlueCanary\u0022\u003E\u003Cdiv\u003EThis is completely different from arguments against a new aerodynamic model\u003C/div\u003E\u003C/blockquote\u003EI disagree.\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BlueCanary\u0022 data-cite=\u0022BlueCanary\u0022\u003E\u003Cdiv\u003Ethe new aerodynamic meant considerably more realistic gameplay and quite a lot of extra options in how people played the game. This is a change that will barely affect some people, but also be a massive annoyance for a lot of others, and doesn\u0027t bring any substantial benefits to make up for the negatives.\u003C/div\u003E\u003C/blockquote\u003EAu contraire, it looks much better/more realistic and will open up new options in craft building. It will also spur \u0022creativity\u0022 in people who want to use it in unintended or innovative ways.\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BlueCanary\u0022 data-cite=\u0022BlueCanary\u0022\u003E\u003Cdiv\u003EAnd yes, we are getting a 0.625m jet. It also has a great big awkward engine sticking out of it.\u003C/div\u003E\u003C/blockquote\u003EDo you think it\u0027ll have a 1.25m wide engine sticking out of it? I have a hard time believing it\u0027ll be all doom and gloom like you\u0027re saying, especially if it generally conforms in proportion to the larger one.\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Majorjim\u0022 data-cite=\u0022Majorjim\u0022\u003E\u003Cdiv\u003EDo you have your own interpretation of what \u0027creativity\u0027 is?\u003C/div\u003E\u003C/blockquote\u003EIt doesn\u0027t particularly matter what my definition is, people have used that definition of \u0022creativity\u0022 as a cudgel against procedural parts suggestions for a long time. Some of the arguments against actually make a decent amount of sense in the context of bare-bones KSP: The Game Not So Much Designed By Squad (despite being dumb in the context of a total conversion like RO/RSS), and those arguments apply in this context as well.\n"},{"CreatedByName":"SpenSpaceCorp","CreatedById":98977,"CreatedDateTime":"2015-11-05T23:02:03Z","Content":"\n\u003Cp\u003EI like the turbine idea, however would like to see something along the lines of having its visibility toggle-able or rotatable (for VTOL purposes and such).\u003C/p\u003E\n"},{"CreatedByName":"Bloody_looser","CreatedById":95664,"CreatedDateTime":"2015-11-05T23:27:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BlueCanary\u0022 data-cite=\u0022BlueCanary\u0022\u003E\u003Cdiv\u003EVertically placed nozzles with the actual engine there in all but appearance (in pretty much every VTOL I\u0027ve seen on the Spacecraft Exchange there is space where the engine could be in real life, and the nozzle weighs as much as the engine would) don\u0027t seem at all like an exploit to me. All this is doing is limiting designs to ones where the engine is directly in front of the nozzle, which is not a limitation present in real life, and is also one that will be a huge issue for a lot of people.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESince 1.0 aero implementation drag is not based on mass. Let\u0027s take a micronode and give it parameters and mass of the jet engine. It will behave differently, like clipped tanks will behave differently in flight than stacked ones. Thus, argument \u0027mass is still there\u0027 won\u0027t do. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Frozen_Heart\u0022 data-cite=\u0022Frozen_Heart\u0022\u003E\u003Cdiv\u003EOf course VTOLs are just a glitch and are completely impossible in real life. Just an exploit like infiglide or K-drive or airhogging. They have no place in a realistic physics game. /s\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EY u no read?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bloody_looser\u0022 data-cite=\u0022Bloody_looser\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ERegarding VTOL builder problems - I do not VTOL, since I don\u0027t like \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Ecubic strut madness\u003C/span\u003E \u0027creative\u0027 VTOL-building methods. All that stuff feels like airhogging, engine clipping etc. One more exploit down. \u003C/p\u003E\u003Cp\u003EIt\u0027s totally fine to start a movement for adding directed jet or tiltrotor, though. VTOLs exist IRL so it\u0027ll be reasonable. Cubic strutting nozzles all over the plane is not.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Noname117","CreatedById":53624,"CreatedDateTime":"2015-11-05T23:30:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EAu contraire, it looks much better/more realistic and will open up new options in craft building. It will also spur \u0022creativity\u0022 in people who want to use it in unintended or innovative ways.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt does definitely look more realistic and opens up new options in craft building, but it closes down others. The others which it closes down, primarily having to do with VTOLS, are far greater than the ones it opens up, which have to do more with decoration. I\u0027d honestly rather have my VTOLS be able to not be extremely tall or not have massive amounts of tiny, drag producing engines attached to them than to have some future craft I build look slightly prettier.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SpenSpaceCorp\u0022 data-cite=\u0022SpenSpaceCorp\u0022\u003E\u003Cdiv\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis. Very much this. It\u0027s an easy solution to the problem which would make nobody angry. Probably the best thing SQUAD could do. Is there any way we could get SQUAD to notice this brilliant idea right here?\u003C/p\u003E\n"},{"CreatedByName":"Azimech","CreatedById":50750,"CreatedDateTime":"2015-11-05T23:34:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EDebatable at the least. Creativity, or so I\u0027ve been told around here, is working within the confines of the given pieces to create something new and unexpected. Pieces are changing and you won\u0027t be able to create the old, tired things you\u0027ve been creating. Try something new! We\u0027re getting a 0.625m engine to go with the bigger ones, no reason a few of those can\u0027t be clipped into an airframe for VTOL work. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERegex, have you seen anything of what I\u0027ve built in the last few years? I mod myself, but it\u0027s the creating of new, exciting stuff with stock parts way beyond the mental confines of anything \u0022space\u0022 that attracts me. And for creating something new, here goes: In KSP I\u0027ve invented the stock turboshaft helicopter and turboprop airplane, the stock coaxial helicopter, a propeller/turboshaft engine thrust measuring device, the double sided open bearing, a working audio synthesizer, a multi-speed planetary gearbox, a stock automotive clutch, a stock self-reloading rotating barrel missile launcher and a totally new way of building huge spacecraft hulls. Probably forgot a few. So yeah, I\u0027m pretty good at creating new and unexpected things and my opinion on a monolithic jet engine is this: it sucks! Take a look at Bubbadevlin\u0027s walker or the other turbine powered creations, now try to imagine them with these long, thick things sticking out.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThis is exactly like the arguments against changing to a new aerodynamic model; pure doom and gloom. You either adapt, mod it to your liking, or walk away. If this change goes through, that is. I hope it does, the parts look pretty good (more polys please).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMost of us engineering types will turn to modding, thus be less inspiring to a lot of people when we create something new and exciting. All for a few more polygons.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-05T23:44:09Z\u0022 title=\u002211/05/2015 11:44  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 5, 2015\u003C/time\u003E by Azimech\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"paul23","CreatedById":120544,"CreatedDateTime":"2015-11-05T23:58:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bloody_looser\u0022 data-cite=\u0022Bloody_looser\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EY u no read?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cem\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EIt\u0027s totally fine to start a movement for adding directed jet or tiltrotor, though. VTOLs exist IRL so it\u0027ll be reasonable. Cubic strutting nozzles all over the plane is not.\u003C/span\u003E\u003C/em\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell this argument could be taken to many systems: RCS is equally magical. As are electronic equipment.\u003C/p\u003E\u003Cp\u003EBasically KSP abstracts the pipes away. You do not have to add wires/tubes for electricity/monopropellant. - So how is it \u0022weird\u0022 that you can also have a \u0022magical duct\u0022 for the hot air?\u003C/p\u003E\u003Cp\u003EAlso: do we then get more fuselage/construct options available early in career? Right now when you open the first yet engine, and you wish to not make a fuselage strutted engine you probably use two engines and the very small 1.25L tank in front of it (no need for more fuel for simple aircraft, while you might very much wish to have more power with that first engine).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-06T00:01:24Z\u0022 title=\u002211/06/2015 12:01  AM\u0022 data-short=\u00228 yr\u0022\u003ENovember 6, 2015\u003C/time\u003E by paul23\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-11-06T00:14:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Azimech\u0022 data-cite=\u0022Azimech\u0022\u003E\u003Cdiv\u003ERegex, have you seen anything of what I\u0027ve built in the last few years?\u003C/div\u003E\u003C/blockquote\u003ENope. Browsing through craft made from stock parts is not my cup of tea in the least.\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Azimech\u0022 data-cite=\u0022Azimech\u0022\u003E\u003Cdiv\u003EMost of us engineering types will turn to modding, thus be less inspiring to a lot of people when we create something new and exciting.\u003C/div\u003E\u003C/blockquote\u003EI\u0027m curious why, exactly, modding makes things less inspiring?\u003Cp\u003EAnyway, I\u0027m sure the \u0022engineering types\u0022 will find new inspiration from the new limits imposed upon them (if this goes through, that is). They survived the new aerodynamic simulation, after all.\u003C/p\u003E\n"},{"CreatedByName":"Noname117","CreatedById":53624,"CreatedDateTime":"2015-11-06T00:29:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EI\u0027m curious why, exactly, modding makes things less inspiring?\u003Cp\u003EAnyway, I\u0027m sure the \u0022engineering types\u0022 will find new inspiration from the new limits imposed upon them (if this goes through, that is). They survived the new aerodynamic simulation, after all.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EModding makes things far less available for everyone, as they have to then download every single mod involved in the craft. Stock craft are far more available for everyone to use, so when one sees something impressive done with it they can think \u0022Oh, I can do that too!.\u0022 Plus something is far more impressive when you build something out of only the parts the devs put in the game, rather than something out of a set of modded parts more designed for that purpose. Adding the longer jet models just makes there a little less to do with stock craft, unless you are OK with your craft looking hideous\u003C/p\u003E\u003Cp\u003EAnd yes, the engineers did survive 1.0, but quite a few got peeved with some parts functioning entirely differently than they used to. Plus, the new aero had benefits towards gameplay and engineering challenges, this just has drawbacks.\u003C/p\u003E\n"},{"CreatedByName":"klgraham1013","CreatedById":105132,"CreatedDateTime":"2015-11-06T00:48:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EIt doesn\u0027t particularly matter what my definition is, people have used that definition of \u0022creativity\u0022 as a cudgel against procedural parts suggestions for a long time. Some of the arguments against actually make a decent amount of sense in the context of bare-bones KSP: The Game Not So Much Designed By Squad (despite being dumb in the context of a total conversion like RO/RSS), and those arguments apply in this context as well.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe lego approach to building was established since the initial release of KSP. I believe in a consistent design ethos. So, that\u0027s why I encourage the lego approach in KSP parts.\u003C/p\u003E\u003Cp\u003EWhether building in lego or molding in clay, it\u0027s all creativity in the end.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Noname117\u0022 data-cite=\u0022Noname117\u0022\u003E\u003Cdiv\u003Esnip\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve never understood the...discrediting?...of mods, because it makes craft harder to share. I would much rather have a 5m tank than hodgepodge something together in stock.\u003C/p\u003E\u003Cp\u003E...but, maybe I\u0027m less about sharing, and more about what parts can do for me.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-11-06T00:50:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Noname117\u0022 data-cite=\u0022Noname117\u0022\u003E\u003Cdiv\u003EModding makes things far less available for everyone\u003C/div\u003E\u003C/blockquote\u003EI guess. Maybe I don\u0027t see that side of things because I don\u0027t really care to download other people\u0027s craft or see any value in sharing my own.\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Noname117\u0022 data-cite=\u0022Noname117\u0022\u003E\u003Cdiv\u003EPlus something is far more impressive when you build something out of only the parts the devs put in the game, rather than something out of a set of modded parts more designed for that purpose.\u003C/div\u003E\u003C/blockquote\u003EvOv I suppose, if that\u0027s your cup of tea. Personally I find most entirely-stock \u0022artsy\u0022 craft to just look ... bodged together at the best.\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Noname117\u0022 data-cite=\u0022Noname117\u0022\u003E\u003Cdiv\u003EAdding the longer jet models just makes there a little less to do with stock craft, unless you are OK with your craft looking hideous\u003C/div\u003E\u003C/blockquote\u003EI don\u0027t think it\u0027ll be nearly as bad as you\u0027re making it out to be, especially with new parts on their way.\n"},{"CreatedByName":"Azimech","CreatedById":50750,"CreatedDateTime":"2015-11-06T00:52:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003ENope. Browsing through craft made from stock parts is not my cup of tea in the least.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThen why are you in this discussion? You automatically assume I only build using stock parts -\u0026gt; so you didn\u0027t even read the thing about the gearbox and synthesizer. This is not about my creations, but your attitude towards the community. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI\u0027m curious why, exactly, modding makes things less inspiring?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027re blasting at people because a number of them might become confined in their creativity because they like to use stock parts, yet you cannot conceive what the problem is if using mods like procedural parts, having almost no confines at all. That\u0027s what I call a double standard.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAnyway, I\u0027m sure the \u0022engineering types\u0022 will find new inspiration from the new limits imposed upon them (if this goes through, that is). They survived the new aerodynamic simulation, after all.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUsing quotation marks in this case is very condescending.\u003C/p\u003E\u003Cp\u003EYes, making increasingly heavy, bulky, draggy but most of all part intensive crafts. \u003C/p\u003E\u003Cp\u003EAnd forget about VTOL, I\u0027m talking this 100% stock turboprop as an example:\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/2k8nv\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EIt uses my own developed PO8R: 8 blowers \u0026amp; 16 turbine blades, with a 3 bladed 3-4-4 standard issue compound propeller, producing 170kN static thrust.\u003C/p\u003E\u003Cp\u003ENow tell me about your engineering, please.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-06T00:58:22Z\u0022 title=\u002211/06/2015 12:58  AM\u0022 data-short=\u00228 yr\u0022\u003ENovember 6, 2015\u003C/time\u003E by Azimech\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"BlueCanary","CreatedById":131301,"CreatedDateTime":"2015-11-06T01:09:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022klgraham1013\u0022 data-cite=\u0022klgraham1013\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI\u0027ve never understood the...discrediting?...of mods, because it makes craft harder to share. I would much rather have a 5m tank than hodgepodge something together in stock.\u003C/p\u003E\u003Cp\u003E...but, maybe I\u0027m less about sharing, and more about what parts can do for me.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s hard to share mod craft because anyone wanting to use that craft would have to download all the right mods too, and also for some people (for me at least) it\u0027s not even an option most of the time because of not having a fast enough computer to handle the mods. I would like to use 5m tanks and stuff for some things, but with the combination of crashes and difficulty sharing I find it\u0027s just easier to stay stock.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-11-06T01:10:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Azimech\u0022 data-cite=\u0022Azimech\u0022\u003E\u003Cdiv\u003ESo yeah, I\u0027m pretty good at creating new and unexpected things and my opinion on a monolithic jet engine is this: it sucks! Take a look at Bubbadevlin\u0027s walker or the other turbine powered creations, now try to imagine them with these long, thick things sticking out.\u003C/div\u003E\u003C/blockquote\u003ETaking a step back, while that kind of thing is brilliant, it borders on exploiting game oddities and unrealisms and is not the intended use of the parts. And while using parts for unintended purposes should be and will be possible in KSP, those unintended purposes should not be used to defend keeping the parts in a way that is unrealistic and/or detrimental to their intended purpose.\u003Cp\u003E(The current offset CoM is detrimental to the intended purpose of the jet because it\u0027s non-obvious, and has sent players chasing the apparent bug instead of playing the game. The pre-offset-CoM behaviour was somewhat detrimental because it made some planes tail-heavy, though I consider it vastly preferably to the current shenanigans.)\u003C/p\u003E\u003Cp\u003EThe closest analogy to this jet change would be the ion engine\u0027s changes in 1.0. It used to work just fine in atmosphere and ion gliders were a thing, but that was never a realistic thing to do. Then 1.0 came along and hit the ion engine with a dose of reality, rendering it useless in thick atmosphere. All those lovely ion gliders that so many people built, \u003Cem\u003Egone, useless, obsolete\u003C/em\u003E. And there hasn\u0027t been a replacement, we don\u0027t have an electric propeller or anything else to do realistically what the ion engine once did unrealistically. And that wasn\u0027t even a change that really benefited the ion engine in other ways, there was nothing really \u003Cem\u003Ewrong\u003C/em\u003E or confusing or problematic with it making thrust in atmosphere other than the lack of realism. But you know what? In my view, \u003Cem\u003ESquad did the right thing\u003C/em\u003E when they changed the ion engine in 1.0. And if we want to fly on Eve or Duna we have to find new ways, stock or modded.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-11-06T01:13:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Azimech\u0022 data-cite=\u0022Azimech\u0022\u003E\u003Cdiv\u003EThen why are you in this discussion?\u003C/div\u003E\u003C/blockquote\u003EBecause it\u0027s about the future of a part I will use. A large basis for Realism Overhaul is in stock parts.\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Azimech\u0022 data-cite=\u0022Azimech\u0022\u003E\u003Cdiv\u003EYou\u0027re blasting at people\u003C/div\u003E\u003C/blockquote\u003EI\u0027m not \u0022blasting at\u0022 anyone, you\u0027re imagining things.\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Azimech\u0022 data-cite=\u0022Azimech\u0022\u003E\u003Cdiv\u003Ebecause a number of them might become confined in their creativity because they like to use stock parts,\u003C/div\u003E\u003C/blockquote\u003EYou are already confined in your creativity by using only stock parts. If one changes, like the Mk1 cockpit, what will you do? You will adapt, mod it, or walk away. You can\u0027t possibly think that the parts artwork in KSP would forever be static, can you? We\u0027ve had tons of change in the last few updates. Find new ways of doing things, prove that you are an engineer!\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Azimech\u0022 data-cite=\u0022Azimech\u0022\u003E\u003Cdiv\u003Eyet you cannot conceive what the problem is if using mods like procedural parts, having almost no confines at all.\u003C/div\u003E\u003C/blockquote\u003ENo, I can\u0027t see any problem with procedural parts at all.\n"},{"CreatedByName":"Azimech","CreatedById":50750,"CreatedDateTime":"2015-11-06T01:35:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EBecause it\u0027s about the future of a part I will use. A large basis for Realism Overhaul is in stock parts.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s even worse. You\u0027re trying to influence stock parts, thereby trying to steer how others experience the program, then going to use modded version of those parts anyway. Create your own damn engines, I do it as well for my other (modded) installs.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EYou are already confined in your creativity by using only stock parts. If one changes, like the Mk1 cockpit, what will you do? You will adapt, mod it, or walk away. You can\u0027t possibly think that the parts artwork in KSP would forever be static, can you? We\u0027ve had tons of change in the last few updates. Find new ways of doing things, prove that you are an engineer!\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELike I said, you have a double standard. And my confinement is my own free will based on random intervals. Here\u0027s a video for ya ;-)\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/yNogeEcx8Qg?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-06T01:38:27Z\u0022 title=\u002211/06/2015 01:38  AM\u0022 data-short=\u00228 yr\u0022\u003ENovember 6, 2015\u003C/time\u003E by Azimech\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-11-06T01:38:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EBecause it\u0027s about the future of a part I will use. A large basis for Realism Overhaul is in stock parts.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExcept you are hung up on black and white. Most of us want grey. We don\u0027t mind having them as long as we can turn them off. Thinking on it, they could just create an animation that makes it dissapear and tie to to a tweakable button. It would be like the ladders only no actual retraction animation, just poof and only available in the editor. This is what we discussed about the poll being worthless, it doesn\u0027t have that option in it and I would be willing to bet if it did, 90% would have voted for it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-06T01:42:48Z\u0022 title=\u002211/06/2015 01:42  AM\u0022 data-short=\u00228 yr\u0022\u003ENovember 6, 2015\u003C/time\u003E by Alshain\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-11-06T01:45:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Azimech\u0022 data-cite=\u0022Azimech\u0022\u003E\u003Cdiv\u003EThat\u0027s even worse. You\u0027re trying to influence stock parts\u003C/div\u003E\u003C/blockquote\u003EIn terms of looks? Yeah, you bet.\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Alshain\u0022 data-cite=\u0022Alshain\u0022\u003E\u003Cdiv\u003EExcept you are hung up on black and white.\u003C/div\u003E\u003C/blockquote\u003EI\u0027m not. I have no objection to a toggleable part I just have no illusions about Squad actually making it that way considering their development choices and especially in light of PorkJet\u0027s comments on Reddit. What I have an objection to is splitting up the engine into more pieces because I think it goes against the core paradigm of KSP.\u003Cp\u003EI also think people are making a literal mountain out of a molehill.\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-11-06T01:53:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EI\u0027m not. I have no objection to a toggleable part I just have no illusions about Squad actually making it that way considering their development choices and especially in light of PorkJet\u0027s comments on Reddit. What I have an objection to is splitting up the engine into more pieces because I think it goes against the core paradigm of KSP.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPorkjet doesn\u0027t make the decisions. He can say whatever he wants, but it isn\u0027t his game. If Harvester changes his mind after community feedback, guess what is going to happen.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EI also think people are making a literal mountain out of a molehill.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat is your opinion, and you have a right to it. Some of us get upset when Squad actively ruins something we enjoy doing in the game, even worse when there is very little benefit to doing it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-06T01:59:10Z\u0022 title=\u002211/06/2015 01:59  AM\u0022 data-short=\u00228 yr\u0022\u003ENovember 6, 2015\u003C/time\u003E by Alshain\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Glaran K\u0026#039;erman","CreatedById":146334,"CreatedDateTime":"2015-11-06T02:04:57Z","Content":"\n\u003Cp\u003EI do really like the new models. You can always grab a modded engine or they could always add vector engines later for those who want to make specifically VTOLS.\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-11-06T02:08:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI do really like the new models. You can always grab a modded engine or they could always add vector engines later for those who want to make specifically VTOLS.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMods are not the solution for doing things we used to could do with stock. What if I said they should remove all decouplers and those that want them can use mods. That\u0027s insane, right? Well this suggestion is no less insane.\u003C/p\u003E\n"}]}