{"TopicId":124424,"ForumId":16,"TopicTitle":"Docking several ports simultaniously","CreatedByName":"Kebra","CreatedById":115002,"CreatedDateTime":"2015-11-04T14:18:52Z","PageNum":1,"Articles":[{"CreatedByName":"Kebra","CreatedById":115002,"CreatedDateTime":"2015-11-04T14:18:52Z","Content":"\n\u003Cp\u003EI often see people assembling habitat rings or do multiple claw \u0022anchors\u0022 to asteroids.\u003C/p\u003E\u003Cp\u003EHowever i have a really hard time getting the game to accept multiple hooks. As soon the crafts are joined the ports stop magnetizing or clawing.\u003C/p\u003E\u003Cp\u003EIs there a trick or a mod that can help me?\u003C/p\u003E\n"},{"CreatedByName":"mrclucks","CreatedById":139561,"CreatedDateTime":"2015-11-04T14:28:05Z","Content":"\n\u003Cp\u003EYou\u0027ll want to undock the port that is docked, and it\u0027ll dock again basically right away. Just keep doing that and as long as your ports line up, you should eventually have them all docked\u003C/p\u003E\n"},{"CreatedByName":"Sheppard","CreatedById":93282,"CreatedDateTime":"2015-11-04T14:58:25Z","Content":"\n\u003Cp\u003EWith claws, as far as I remember (or if this hasn\u0027t changed since the claw was introduced) only 3 claws can hang on simultaneously, from the same ship, to an asteroid. \u003C/p\u003E\u003Cp\u003EDocking ports need to be perfectly aligned to be able to dock simultaneously, but it is possible in stock. It\u0027s not that hard once you get a hang of it. Even a tiny deviation will result in failure. So you need to build your ship accordingly. Hold down the ALT key to copy objects to make sure you can build an identical copy, align everything in the VAB and then split the ship up using sub-assemblies. If you build one port that is off by only a little, it won\u0027t dock. \u003C/p\u003E\u003Cp\u003EAlso, when the magnetic lock kicks in, disable RCS and SAS, those can also prevent a successful lock. \u003C/p\u003E\u003Cp\u003EA easier way is to use those tri-coupler or quad-coupler \u002B docking ports components to align everything and connect 3 or 4 ports together. Depends on your needs.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2015-11-05T00:07:14Z","Content":"\n\u003Cp\u003EThis question about how to play the game has been moved to Gameplay Questions.\u003C/p\u003E\n"}]}