{"TopicId":124480,"ForumId":18,"TopicTitle":"Qualifying to become an astronaut might not be as hard as you think. Also, NASA is hiring.","CreatedByName":"Cirocco","CreatedById":100285,"CreatedDateTime":"2015-11-05T10:23:45Z","PageNum":1,"Articles":[{"CreatedByName":"Cirocco","CreatedById":100285,"CreatedDateTime":"2015-11-05T10:23:45Z","Content":"\n\u003Cp\u003EThis one is for all our American forum friends who are passionate about space: NASA recently made a post on their tumblr account debunking a couple of myths and incorrect preconceptions a lot of people have about becoming an astronaut. They also posted what the actual requisites are. And really, they\u0027re not as strict as you\u0027d think. A bachelor in a scientific field, 3 or more years of experience and passing the physical test is all that is really required. (Also, you need to have the American nationality, but that seems rather obvious if you want to work for the US space agency)\u003C/p\u003E\u003Cp\u003ETumblr post can be found here:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://nasa.tumblr.com/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://nasa.tumblr.com/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ENASA is also hiring new astronauts. For those interested in applying, go here:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.nasa.gov/astronauts/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.nasa.gov/astronauts/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EWith all the space nuts on the KSP forums, there must be at least some people who qualify for this. Heck, if I were American, I would totally sign up.\u003C/p\u003E\u003Cp\u003EGet out there KSP-ers! Chances that you will be selected are of course slim, but definitely not outside of the realm of possibility! And if just one person makes it, you will carry the hopes and dreams of the rest of us with you.\u003C/p\u003E\u003Cp\u003EGood luck to those who make the attempt \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Elthy","CreatedById":63317,"CreatedDateTime":"2015-11-05T10:57:03Z","Content":"\n\u003Cp\u003EWhen you read the book from Chris Hadfield you will notice that the realy hard part comes after the initial application. You have to be someone who dedicated his entire life into becoming an astronaut, just like becoming a worldchampion in sports...\u003C/p\u003E\n"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-11-05T11:16:02Z","Content":"\n\u003Cp\u003EJust because it is an easy job to get doesn\u0027t mean it is an easy job to do. But I would encourage people to apply anyway if it is their dreams. If anything, I hope we will have an astronaut KSP fan that would bring along a Kerbal plushie to space.\u003C/p\u003E\n"},{"CreatedByName":"Tex Mechs Robot","CreatedById":83406,"CreatedDateTime":"2015-11-05T12:05:57Z","Content":"\n\u003Cp\u003EI\u0027ve got friends at NASA and contacts with the astronaut recruiters at JSC: becoming an astronaut is NOT easy. Not that it\u003C/p\u003E\u003Cp\u003Es unreachable and it is a fantastic goal. But you won\u0027t just accidentally become an astronaut because one day. It takes many years of hard work to show that you\u0027re capable and qualified.\u003C/p\u003E\n"},{"CreatedByName":"Cirocco","CreatedById":100285,"CreatedDateTime":"2015-11-05T12:28:39Z","Content":"\n\u003Cp\u003Eof course becoming an astronaut is hard. As mentioned, it takes years of dedication. I just wanted to point out that you \u003Cem\u003Equalify\u003C/em\u003E to be one is actually not outside the realm of possibility at all.\u003C/p\u003E\u003Cp\u003EChances of actually becoming an astronaut after you apply: very small (but not impossible)\u003C/p\u003E\u003Cp\u003EChances that you are qualified to apply to be an astronaut: probably higher than most people think.\u003C/p\u003E\n"},{"CreatedByName":"Tex Mechs Robot","CreatedById":83406,"CreatedDateTime":"2015-11-05T12:42:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cirocco\u0022 data-cite=\u0022Cirocco\u0022\u003E\u003Cdiv\u003Eof course becoming an astronaut is hard. As mentioned, it takes years of dedication. I just wanted to point out that you \u003Cem\u003Equalify\u003C/em\u003E to be one is actually not outside the realm of possibility at all.\u003Cp\u003EChances of actually becoming an astronaut after you apply: very small (but not impossible)\u003C/p\u003E\u003Cp\u003EChances that you are qualified to apply to be an astronaut: probably higher than most people think.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAhhh got it. I think your use of the word \u0022qualifying\u0022 is what threw me off. If you had said \u0022applying\u0022 instead, I would have got the message loud and clear. To me, to qualify implies that you achieve all necessary goals and make it to the end. Which is strange because I know this is not even necessarily true. For instance, I am a big NASCAR fan (go ahead and judge) but the same is true of most automotive races. The entrants must first qualify for the race and then those that do race for the win.\u003C/p\u003E\n"},{"CreatedByName":"Cirocco","CreatedById":100285,"CreatedDateTime":"2015-11-05T12:50:02Z","Content":"\n\u003Cp\u003Eyeah, semantics are a female dog, especially since English is not my native language. I do apologize if I got people confused or got their hopes up in vain.\u003C/p\u003E\u003Cp\u003EStill though, I thought that the requirements for application were a lot stricter than they are (I thought that a certain number of flight hours was pretty much mandatory as well as at least a master\u0027s degree or higher).\u003C/p\u003E\u003Cp\u003EI\u0027d totally sign up for application if I lived in the US. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"ThePULSAR","CreatedById":150820,"CreatedDateTime":"2015-11-05T14:06:50Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022http://www.nasa.gov/astronauts\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.nasa.gov/astronauts\u003C/a\u003E \u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/QjECZVitU00?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EAnyone want to go for it?\u003C/p\u003E\n"},{"CreatedByName":"Jovus","CreatedById":117163,"CreatedDateTime":"2015-11-05T14:15:07Z","Content":"\n\u003Cp\u003EWant to? Absolutely. But no way am I ever going to be qualified.\u003C/p\u003E\n"},{"CreatedByName":"WinkAllKerb\u0026#039;\u0026#039;","CreatedById":78047,"CreatedDateTime":"2015-11-05T15:49:45Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022https://imgflip.com/i/to183\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022https://i.imgflip.com/to183.jpg\u0022 alt=\u0022to183.jpg\u0022\u003E\u003C/a\u003E\u003Ca href=\u0022https://imgflip.com/memegenerator\u0022 rel=\u0022external nofollow\u0022\u003Evia Imgflip Meme Maker\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Ecould also work with Richard Dean anderson and a swiss knife. Mutlipass Multitask. @Tex kinda agree each time i applied for something i wasn\u0027t supposed to get qualified to i used to be hired in the end anyway ; ) so believe and face yourself in the mirror and do it is always the best approach.\u003C/p\u003E\u003Cp\u003ESure thing is being an astronaut is kinda a \u0022priesthood\u0022 and \u0022all earth kind devotion\u0022 before anithing else.\u003C/p\u003E\n"},{"CreatedByName":"pTrevTrevs","CreatedById":131541,"CreatedDateTime":"2015-11-05T16:13:40Z","Content":"\n\u003Cp\u003EYep, being an astronaut is my dream. I plan to get at least a bachelor in Aerospace Engineering (ideally a Masters or a PhD). Then I just have to find some way to get 1000 hours flying time in jet aircraft, and then I can apply. I guess I had better start working on the physical requirements too. It\u0027s never to early to start, is it?\u003C/p\u003E\n"},{"CreatedByName":"BLUESTREAK","CreatedById":103065,"CreatedDateTime":"2015-11-05T16:15:58Z","Content":"\n\u003Cp\u003EI\u0027d love to, providing NASA doesn\u0027t mind waiting for me to finish my maths and physics degree, nor if they mind waiting a few years for me to get a visa, find a job, move to the US before applying for and getting American citizenship first. Much obliged.\u003C/p\u003E\u003Cp\u003EAlthough, joking aside, if ESA could hold off a couple of years before they start their next recruiting round, it would be very much appreciated...\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2015-11-05T16:16:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022pTrevTrevs\u0022 data-cite=\u0022pTrevTrevs\u0022\u003E\u003Cdiv\u003EI guess I had better start working on the physical requirements too. It\u0027s never to early to start, is it?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBeing an astronaut seems to be a lifestyle, not something you do now and then.\u003C/p\u003E\n"},{"CreatedByName":"pTrevTrevs","CreatedById":131541,"CreatedDateTime":"2015-11-05T16:51:59Z","Content":"\n\u003Cp\u003EYeah, it\u0027s a lifestyle, that\u0027s why I\u0027m considering getting myself in shape to be able to pass the physical now while I\u0027m young, even though it will be ten years or more before I am eligible to apply.\u003C/p\u003E\n"},{"CreatedByName":"InterCity","CreatedById":98462,"CreatedDateTime":"2015-11-05T17:33:06Z","Content":"\n\u003Cp\u003EDamnit. I\u0027m european and too busy to move to the US.\u003C/p\u003E\u003Cp\u003EIf we could get ESA to recruit though...\u003C/p\u003E\u003Cp\u003EI wouldn\u0027t pass the physical test, so I\u0027m still screwed \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"r_rolo1","CreatedById":26192,"CreatedDateTime":"2015-11-05T17:36:32Z","Content":"\n\u003Cp\u003EHum, I\u0027m too old, too unhealthy and too not a US citizen to apply \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EOTOH I would like to see the day where space agencies would have a serious need for field biochemists ( I\u0027m a biochemist by formation ). That would be a very good sign \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Just Jim","CreatedById":148725,"CreatedDateTime":"2015-11-05T17:36:52Z","Content":"\n\u003Cp\u003EIf I was 30 years younger, you wouldn\u0027t be able to hold me back!!!!\u003C/p\u003E\n"},{"CreatedByName":"Volix","CreatedById":144192,"CreatedDateTime":"2015-11-05T17:49:00Z","Content":"\n\u003Cp\u003EFrom the \u003Ca href=\u0022http://www.nasa.gov/centers/johnson/pdf/606877main_FS-2011-11-057-JSC-astro_trng.pdf\u0022 rel=\u0022external nofollow\u0022\u003EAstronaut Selection and Training\u003C/a\u003E document:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003Ethe candidate must have a standing height between 62 and 75 inches.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJust 1 inch too tall \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E. Of course I\u0027d also need a couple years to finish my doctorate as some of the others here:D.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2015-11-05T18:30:16Z","Content":"\n\u003Cp\u003EI could totally be an astronaut if I were a little older, had some flight hours, were fit, knew anything about flying besides aerodynamics, and the list goes on.\u003C/p\u003E\n"},{"CreatedByName":"justidutch","CreatedById":99185,"CreatedDateTime":"2015-11-05T18:34:15Z","Content":"\n\u003Cp\u003EPeople should be in good physical condition regardless of what they do, because, life. One of the things the ancient Greeks got right was that physical conditioning for the body is just as important as educating and exercising your brain.\u003C/p\u003E\n"},{"CreatedByName":"Kozak","CreatedById":128114,"CreatedDateTime":"2015-11-05T18:49:27Z","Content":"\n\u003Cp\u003EI should totally sign up for this.\u003C/p\u003E\n"},{"CreatedByName":"theend3r","CreatedById":97560,"CreatedDateTime":"2015-11-05T19:03:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Volix\u0022 data-cite=\u0022Volix\u0022\u003E\u003Cdiv\u003EFrom the \u003Ca href=\u0022http://www.nasa.gov/centers/johnson/pdf/606877main_FS-2011-11-057-JSC-astro_trng.pdf\u0022 rel=\u0022external nofollow\u0022\u003EAstronaut Selection and Training\u003C/a\u003E document:\u003Cp\u003EJust 1 inch too tall \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E. Of course I\u0027d also need a couple years to finish my doctorate as some of the others here:D.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMe too. Is this some kind of dwarf space program?\u003C/p\u003E\n"},{"CreatedByName":"NecroBones","CreatedById":105424,"CreatedDateTime":"2015-11-05T19:05:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jovus\u0022 data-cite=\u0022Jovus\u0022\u003E\u003Cdiv\u003EWant to? Absolutely. But no way am I ever going to be qualified.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m in the same boat. \u003C/p\u003E\u003Cp\u003EIf I were 20 years younger and had a Ph.D, I might have had a shot. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E (I know, they talk about equivalent experience... but really, not having a higher degree closes a lot of doors, even when people say it doesn\u0027t)\u003C/p\u003E\n"},{"CreatedByName":"Flymetothemun","CreatedById":17689,"CreatedDateTime":"2015-11-05T19:05:54Z","Content":"\n\u003Cp\u003E\u0022Ability to pass the NASA Astronaut physical, which includes the following specific requirements: ...\u003C/p\u003E\u003Cp\u003E... Standing height between 62 and 75 inches\u0022\u003C/p\u003E\u003Cp\u003EWell, that counts me out. When I hit 13 I started to shoot up like the Saturn V.\u003C/p\u003E\n"},{"CreatedByName":"Cuky","CreatedById":111755,"CreatedDateTime":"2015-11-05T19:09:00Z","Content":"\n\u003Cp\u003EI would love to apply but I still haven\u0027t finished my bachelor\u0027s degree. Add to that that I am not from US and that I would probably fail at physical tests...\u003C/p\u003E\n"}]}