{"TopicId":12498,"ForumId":21,"TopicTitle":"Enterprise...Again! [Stock 0.15]","CreatedByName":"sirguinea","CreatedById":17565,"CreatedDateTime":"2012-06-11T04:49:40Z","PageNum":1,"Articles":[{"CreatedByName":"sirguinea","CreatedById":17565,"CreatedDateTime":"2012-06-11T04:49:40Z","Content":"\n\u003Cp\u003ELadies and Gentlemen, I present the fully orbit capable Enterprise. I was trying to create a stock version of this ship having only succeeded in creating a mod version with C7 parts before. As luck would have it, the C7 parts I had used in the past became a part of the game. I used what I call a \u0027doppelganger\u0027 design in which I doubled up on the saucer and nacelles in order to balance it for take off. Once you get yourself in a nice stable orbit just eject the doppelganger and what you have is a very nice Enterprise space station. Right now you can only apply a very small amount of thrust with the remaining fuel or she will put her nose down and go for a spin. This is because there is only fuel left in the nacelles which isn\\\u0027t very balanced. Future incarnations will try to put the last of the fuel in the impulse engines; in past designs I\\\u0027ve found that to be very stable.\u003C/p\u003E\u003Cp\u003EThis is the setup. I found that after cloning the saucer and nacelles I had to replace the SAS modules individually or else bad things happen after take off. I don\\\u0027t know if it\\\u0027s a glitch but the cloned SAS modules would make it spin out of control. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/PF2cU.png?1\u0022 alt=\u0022PF2cU.png?1\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EAfter Orbit she can only fire those nacelles, looks awesome but isn\\\u0027t great for flight.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/7XiFd.png?1\u0022 alt=\u00227XiFd.png?1\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EI know there is an excess of SAS on this thing but they are more for aesthetics than anything else. They are the only pieces besides RCS tanks that are short and fit the main tanks. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/DjiFv.png?1\u0022 alt=\u0022DjiFv.png?1\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EPerhaps when docking arrives I will be able to refuel this thing in orbit. I think I saw somewhere this would be a feature of docking.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/AZvMs.png?1\u0022 alt=\u0022AZvMs.png?1\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/23xE3.png?1\u0022 alt=\u002223xE3.png?1\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/cvnTM.png?1\u0022 alt=\u0022cvnTM.png?1\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"TheDownloaderG3y","CreatedById":24212,"CreatedDateTime":"2012-06-11T11:35:13Z","Content":"\n\u003Cp\u003ENice Idea. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EDo More. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"colmo","CreatedById":25950,"CreatedDateTime":"2012-06-11T13:10:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sirguinea\u0022 data-cite=\u0022sirguinea\u0022\u003E\u003Cdiv\u003ERight now you can only apply a very small amount of thrust with the remaining fuel or she will put her nose down and go for a spin.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat are the three main thrusters? Put a big one on the central hull and small ones on the nacelles to balance the thrust. The Aerospike has the most thrust, then the \\\u002740\\\u0027, then the gimbal \\\u002735\\\u0027, and lastly the teeny lander thruster.\u003C/p\u003E\u003Cp\u003EUse more stages if necessary, with your doppelganger setup on top, to get it up there with more fuel left.\u003C/p\u003E\u003Cp\u003ECould you use fuel half-tanks instead of all those SAS modules?\u003C/p\u003E\u003Cp\u003EMoving the command module would change the order the tanks drain - use a MkI cockpit in the \\\u0027disc\\\u0027 section (where the Enterprise bridge is!) and replace the current one with a ramjet intake for the deflector array. By my reckoning, this would mean the lower section would drain of fuel first, solving the nose-down thrust behaviour.\u003C/p\u003E\n"}]}