{"TopicId":125065,"ForumId":69,"TopicTitle":"Intake air not showing up in Resources list","CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2015-11-11T14:16:46Z","PageNum":1,"Articles":[{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2015-11-11T14:16:46Z","Content":"\n\u003Cp\u003ESo I just updated my 1.0.5 this morning (should be the new build) and noticed that my intake air level isnt being shown in the resource list in flight. Ive tried a few different intakes and nothing seems to pop up.\u003C/p\u003E\n"},{"CreatedByName":"KasperVld","CreatedById":40700,"CreatedDateTime":"2015-11-11T14:57:38Z","Content":"\n\u003Cp\u003EThis is intended behaviour \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2015-11-11T14:59:41Z","Content":"\n\u003Cp\u003EOh! Hmm.. Sorry how are we supposed to gauge how much air our engines are getting? It really helps when hotkeying intakes.\u003C/p\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2015-11-11T16:55:39Z","Content":"\n\u003Cp\u003ERight click the engines.\u003C/p\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2015-11-11T17:16:30Z","Content":"\n\u003Cp\u003EIm sorry, am I an idiot? I don\u0027t see intake air there either. Generally I\u0027d been keeping most intakes closed until I got higher in the atmosphere, watching the total intake air decline until the point I knew the engines would starve, then open the other intakes. I mean I can memorize what altitude this happens, but the visual feedback was nice.\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2015-11-11T18:52:01Z","Content":"\n\u003Cp\u003EIt was intentionally hidden. Because IntakeAir is generated and consumed in the same frame, it can be misleading because IntakeAir may look full (am I using any?) or because it\u0027s showing empty (I have none, why is my engine still running?).\u003C/p\u003E\u003Cp\u003EAlso, open/close on the intakes pretty much does nothing for drag now. It\u0027s no longer part of the new 1.0 aero model, so closing the intakes doesn\u0027t save you any drag. And IntakeAir isn\u0027t something that can be spammed up anymore and feed an engine well beyond it\u0027s service ceiling, because that was also changed in 1.0.\u003C/p\u003E\u003Cp\u003EIt would be helpful to know if you\u0027re supplying the full demand to the engine, but the existing resource system isn\u0027t set up well for displaying that sort of information given the way IntakeAir works. I\u0027m not sure if there\u0027s a better way to do it, without a rework of the resource code.\u003C/p\u003E\u003Cp\u003ECheers,\u003C/p\u003E\u003Cp\u003E~Claw\u003C/p\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2015-11-11T19:08:32Z","Content":"\n\u003Cp\u003EOh thats good to know, thanks! It was something I had been used to doing and I supposed I hadn\u0027t noticed the savings disappear. I suppose some sort of indicator could help, but given that rapiers visibly sputter there\u0027s at least some warning they\u0027re about to switch over.\u003C/p\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2015-11-11T19:14:41Z","Content":"\n\u003Cp\u003EProp. Requirement Met refers to, I believe, the air.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/uVrjAnH.jpg?2\u0022 alt=\u0022uVrjAnH.jpg?2\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2015-11-11T20:56:24Z","Content":"\n\u003Cp\u003EDoes it? When I was watching on rapiers it never dipped below 100%, then they switched, but maybe thats something unique to them.\u003C/p\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2015-11-11T21:40:17Z","Content":"\n\u003Cp\u003EAlso sorry mods, feel free to move this to gameplay questions if you like.\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2015-11-11T21:40:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ObsessedWithKSP\u0022 data-cite=\u0022ObsessedWithKSP\u0022\u003E\u003Cdiv\u003EProp. Requirement Met refers to, I believe, the air.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAh yeah. I forgot that got added. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E (Though I think it\u0027s not just \u0022IntakeAir,\u0022 but works all the same.)\u003C/p\u003E\n"}]}