{"TopicId":125090,"ForumId":70,"TopicTitle":"Contract \u0026quot;Launch our first vessel\u0026quot; not registering","CreatedByName":"Vegetal","CreatedById":147251,"CreatedDateTime":"2015-11-11T17:44:26Z","PageNum":1,"Articles":[{"CreatedByName":"Vegetal","CreatedById":147251,"CreatedDateTime":"2015-11-11T17:44:26Z","Content":"\n\u003Cp\u003EHello. My game has some mods, but none that affect contracts. The only part mod is KIS and KAS.\u003C/p\u003E\u003Cp\u003EStarted new career in 1.0.5, but I\u0027m already orbiting the Mun by now, and the pesky \u0022launch our first vessel\u0022 contract is still there staring at my face, occupying a slot in the contracts list. WHY?\u003C/p\u003E\u003Cp\u003EThe rest seems to be working fine, it\u0027s just this one.\u003C/p\u003E\n"},{"CreatedByName":"krenshala","CreatedById":76062,"CreatedDateTime":"2015-11-13T03:06:12Z","Content":"\n\u003Cp\u003EI have experienced this since 1.0.4, but only if I had the Kerbal EVA before launching the vessel. If the crew didn\u0027t get out (say, for some EVA reports while flying at Kerbin\u0027s Shores just before launch) then it would properly register.\u003C/p\u003E\u003Cp\u003EOn that same note, the contract would complete for me if, on the second rocket flight, I did not do an EVA.\u003C/p\u003E\u003Cp\u003EI haven\u0027t tested whether it still happens in 1.0.5, however, as my habit became to lob Jeb ASAP, then have Val get the EVA reports from the launchpad prior to her flight in the second vessel. I\u0027ll check it after work tomorrow (need to sleep now ... darn day job) if nobody else has before hand.\u003C/p\u003E\n"},{"CreatedByName":"kjub","CreatedById":153422,"CreatedDateTime":"2015-11-26T20:07:22Z","Content":"\nHave you resolved this issue yet? Cause I\u0026#39;m having this one too. It is not related to girder, it is not related to EVA. Even with Mk1 Pod and Flea only I cannot fulfill this contract. Also if you try to complete it via debug window, it comes back to Mission Control.\n"},{"CreatedByName":"Galileo","CreatedById":150430,"CreatedDateTime":"2015-11-27T04:02:38Z","Content":"\nLaunch your first vessel without a launch clamp...like directly off the ground\n"}]}