{"TopicId":125194,"ForumId":16,"TopicTitle":"So, in flight now actually means in FLIGHT. But what does that mean?","CreatedByName":"Muskrat","CreatedById":153467,"CreatedDateTime":"2015-11-12T12:34:49Z","PageNum":1,"Articles":[{"CreatedByName":"Muskrat","CreatedById":153467,"CreatedDateTime":"2015-11-12T12:34:49Z","Content":"\n\u003Cp\u003ESo I started my first 1.0.5 game yesterday, and noticed I wasn\u0027t able to complete \u0022in flight\u0022 contracts with a rocket any more. That\u0027s interesting, but also problematic..since I have some \u0022in flight\u0022 contracts for high altitudes I thought would be no problem to complete, and I can\u0027t reach with standard planes, on low tech.\u003C/p\u003E\u003Cp\u003EDoes anyone know what the requirements to be considered \u0022in fight\u0022 now are? It seems it\u0027s more than just \u0022are you moving through an atmosphere, not on the ground\u0022.\u003C/p\u003E\u003Cp\u003EBasically, in game terms, at what point does a rocket with fins/wings stop being a rocket, and start being a \u0022rocket plane\u0022 that \u0022flys\u0022, instead of \u0022falls\u0022?\u003C/p\u003E\u003Cp\u003EI guess the real question is: how much wing (lift) do I need to be considered in flight? Or are there other parameters?\u003C/p\u003E\u003Cp\u003EAnswer: seems like it was a one time phenomenom, or a mod was doing something funky. New contracts I take don\u0027t exhibit this behavior.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-13T16:46:14Z\u0022 title=\u002211/13/2015 04:46  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 13, 2015\u003C/time\u003E by Muskrat\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-11-12T13:26:59Z","Content":"\n\u003Cp\u003EIt hasn\u0027t changed. In flight is still not on the ground just like always.\u003C/p\u003E\n"},{"CreatedByName":"Muskrat","CreatedById":153467,"CreatedDateTime":"2015-11-12T13:31:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Alshain\u0022 data-cite=\u0022Alshain\u0022\u003E\u003Cdiv\u003EIt hasn\u0027t changed. In flight is still not on the ground just like always.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThen why was my rocket not able to complete an \u0022in flight\u0022 contract when all conditions besides \u0022flying\u0022 were met. But the plane I built was?\u003C/p\u003E\n"},{"CreatedByName":"ineon","CreatedById":152379,"CreatedDateTime":"2015-11-12T16:17:09Z","Content":"\n\u003Cp\u003EWhat always gets me is misreading the specs for testing in flight particularly with regards to the altitude, e.g.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ETest component x... something something ... Kerbin ... something ... 60,000m\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI get up to above 60,000m and test the component (or do the experiment or whatever) and don\u0027t fulfil the contract then read it again and realise that it says \u003Cstrong\u003Eunder\u003C/strong\u003E 60,000m. Did you double check that you fulfil all the other specs?\u003C/p\u003E\n"},{"CreatedByName":"Stoney3K","CreatedById":139954,"CreatedDateTime":"2015-11-12T16:45:33Z","Content":"\n\u003Cp\u003E\u0027in flight\u0027 means \u0027inside the atmosphere\u0027. Above the atmosphere it becomes sub-orbital.\u003C/p\u003E\u003Cp\u003EAny contract that specifies \u0027in flight\u0027 on an airless body (like Mun) is a bug.\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2015-11-12T16:53:00Z","Content":"\n\u003Cp\u003EYeah, a screenshot of the situation and contract, or the save itself might help. If it is a bug, then it also helps to have the save so I can feed that info back into the tracker.\u003C/p\u003E\u003Cp\u003ECheers,\u003C/p\u003E\u003Cp\u003E-Claw\u003C/p\u003E\n"},{"CreatedByName":"Muskrat","CreatedById":153467,"CreatedDateTime":"2015-11-12T17:57:05Z","Content":"\n\u003Cp\u003EI did have some mods that may not have been compatible with 1.0.5, which I removed. Not sure if they would impact this however (KER, KJR, Science Alert, ForScience!, Stage Recovery). I think I got rid of everything but KER and ForScience!, but can\u0027t remember if that was before or after I completed the contracts.\u003C/p\u003E\u003Cp\u003EI\u0027ll double check this when I get home, and post a screen shot.\u003C/p\u003E\n"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2015-11-14T02:00:00Z","Content":"\n\u003Cp\u003EThe only time being in the atmosphere doesn\u0027t count as \u0022in-flight\u0022 is when you are on an escape trajectory, aerobraking for instance, otherwise anything in the atmosphere is considered \u0022in-flight\u0022.\u003C/p\u003E\n"}]}