{"TopicId":125116,"ForumId":16,"TopicTitle":"Declining contracts in 1.0.5 career mode now costs you rep?","CreatedByName":"Johnny Wishbone","CreatedById":118096,"CreatedDateTime":"2015-11-11T19:35:16Z","PageNum":2,"Articles":[{"CreatedByName":"Stoney3K","CreatedById":139954,"CreatedDateTime":"2015-11-11T21:44:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Enorats\u0022 data-cite=\u0022Enorats\u0022\u003E\u003Cdiv\u003EMore seriously though, I think the idea here is to reflect that each of the contracts SHOULD be doable and that if you can\u0027t or won\u0027t do them then that reflects poorly on your reputation. It also encourages players to try completing contracts they might have otherwise just ignored.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t think \u0022avoiding punishment\u0022 is a good way of making dull, grinding gameplay more rewarding.\u003C/p\u003E\u003Cp\u003EIMO, the contracts should be more varied and more science-oriented, with (possibly special) parts that get unlocked for the contract when you need them. For example, you can\u0027t do an orbital survey in the \u0022regular\u0022 fashion but you may be able to do it on a contract, unlocking the survey scanner when you have accepted a contract that needs it.\u003C/p\u003E\u003Cp\u003EThis would also allow unmanned probes and rockets early on in the game with parts that are valid for a single contract only.\u003C/p\u003E\n"},{"CreatedByName":"gchristopher","CreatedById":106024,"CreatedDateTime":"2015-11-11T21:44:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Col_Jessep\u0022 data-cite=\u0022Col_Jessep\u0022\u003E\u003Cdiv\u003ESo instead of declining contract you can now just time warp to the next sunrise and get new contracts?\u003Cp\u003EThe only way to solve the slot machine problem is to \u003Cstrong\u003Emake interesting missions that the player wants to accept\u003C/strong\u003E.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EPenalizing the player for dismissing uninteresting missions is bad game design.\u003C/strong\u003E The player has no influence on what missions he gets. We had enough impossible missions like launch clamps in flight over the MÃƒÂ¼n to know that some missions are outright impossible. No matter what, no player should feel forced to accept contracts he doesn\u0027t like or to time warp until new contracts become available.\u003C/p\u003E\u003Cp\u003EAnd I don\u0027t accept the \u0022you can turn it off\u0022 answer. You can turn off gravity too, but that\u0027s not how the game should be played under normal circumstances.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExactly right! I\u0027m glad the reputation penalty can be disabled, but it shouldn\u0027t be enabled by default at all! \u003C/p\u003E\u003Cp\u003EA contract system is very hard to design and the results aren\u0027t as good as they might someday be. Penalizing the player for working around that limitation is a poor design decision. \u003C/p\u003E\u003Cp\u003EI\u0027m not remotely moved by arguments centered around \u0022realism\u0022 in contract offerings and reputation. Actual space industry contract negotiation concerns shouldn\u0027t be a consideration for game design, except as fodder for parody. That would be a great attitude for revising the contract system! \u0022Real world contracts are not remotely fun, so let\u0027s make a fun, silly, Kerbal-ized system where the main relation to reality is comical.\u0022\u003C/p\u003E\u003Cp\u003EThankfully, it\u0027s a minor and easily avoided problem. At least the rest of the 1.0.5 changes look pretty cool!\u003C/p\u003E\n"},{"CreatedByName":"Just Jim","CreatedById":148725,"CreatedDateTime":"2015-11-11T21:45:20Z","Content":"\n\u003Cp\u003EI actually like the idea, and think it\u0027s somewhat realistic to real life. You get approached by a company time and time again with a contract offer, and you constantly turn them down, eventually they\u0027re gonna take their business elsewhere, and your reputation is gonna a hit.\u003C/p\u003E\u003Cp\u003ELife isn\u0027t fair, and now neither is mission control.... and I think its awesome!\u003C/p\u003E\n"},{"CreatedByName":"Stoney3K","CreatedById":139954,"CreatedDateTime":"2015-11-11T21:50:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Just Jim\u0022 data-cite=\u0022Just Jim\u0022\u003E\u003Cdiv\u003EI actually like the idea, and think it\u0027s somewhat realistic to real life. You get approached by a company time and time again with a contract offer, and you constantly turn them down, eventually they\u0027re gonna take their business elsewhere, and your reputation \u003Cem\u003E\u003Cstrong\u003Ewith that company\u003C/strong\u003E\u003C/em\u003E is gonna a hit.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECorrected for inflation, if we would have a per-agency reputation database, I would be more into that. It\u0027s like saying to agency X: \u0022Stop sending me those bloody tourists! They\u0027re not going to space on our vessels!\u0022 which would give the user more influence in *what* contracts are offered in the future.\u003C/p\u003E\u003Cp\u003EA bad rep on a company that only offers tourist contracts means that company will stop offering contracts. Meanwhile, a good rep on a company means that more challenging contracts will be offered by *that* particular company, but not by another. You would need to earn your reputation on a per-agency basis.\u003C/p\u003E\n"},{"CreatedByName":"Wesreidau","CreatedById":75430,"CreatedDateTime":"2015-11-11T21:53:03Z","Content":"\n\u003Cp\u003EI don\u0027t mind it. If you\u0027re running a satellite company, and you go up to SpaceX and ask them to launch your comms sat in a geosync orbit, and they go \u0022meh, no\u0022, what do you do? You go somewhere else, the ESA or Russia or something. The next satellite you need launched, you\u0027re a little less likely to ask SpaceX and a little more likely to go with the other company who launched you. And if you just go through telling every job offer no, people will thing you\u0027re not interested in the offers at all. So yes, there is a reputation hit for declining a job offer. \u003C/p\u003E\u003Cp\u003ENow, if SpaceX says, \u0022we\u0027re floating the idea but we aren\u0027t able to sign for this launch yet\u0022, IE tabling the proposal, your agents will put their offers out elsewhere. In a couple days the ESA accepts and your SpaceX offer expires. Sorry SpaceX, too slow. Its not the same as a flat \u0022No thanks\u0022. I assume Mort over in the admin building is a slick enough negotiator to prevent that from being taken poorly. He has days to make up an excuse, after all.\u003C/p\u003E\n"},{"CreatedByName":"CreepyB4by","CreatedById":152622,"CreatedDateTime":"2015-11-11T22:04:32Z","Content":"\n\u003Cp\u003EI have seen several posts that claim that this change makes the game more realistic, but I don\u0027t think declining a job would decline your reputation in real life. Especially if it\u0027s a job that most people would decline. If you accept the job and fail, then it makes sense that the rep goes down, but to decline an offer? That sounds pretty stupid to me, tbh. If Nasa was approached by 100 countries or companies that all wanted moon rocks and they said no, it would not impact their reputation at all. \u003C/p\u003E\u003Cp\u003EThat\u0027s ok, tho, most games take a back seat to logic, I can get used to it, but with the other problems I\u0027ve begun to see in the game, it\u0027s quickly diminishing its own replay value with me. I am anxious to see how this works out on Xbox, for console players, I can guarantee that the Multiple vehicles moving/huge Ships launching lag problems won\u0027t fly with the broken tutorial. It\u0027ll be rejected harder than the new Fantastic Four movie. Some console players don\u0027t own a computer and they wouldn\u0027t look up Scott Manley on Youtube even if they did. Scott Manley\u0027s near-celebrity status in this game\u0027s SOI is a testament to just how non-functioning the tutorial is. If it was working, no one would know his name. Basically, what I\u0027m saying is, I don\u0027t like it, but it seems like it\u0027s par for the course around here.\u003C/p\u003E\n"},{"CreatedByName":"ajburges","CreatedById":26570,"CreatedDateTime":"2015-11-11T22:34:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022klgraham1013\u0022 data-cite=\u0022klgraham1013\u0022\u003E\u003Cdiv\u003EI\u0027ve always liked the idea of the player submitting mission proposals and the game assigning appropriate rewards. Might me a good end-game way of doing contracts.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis. My most egregious contract cycling had always been to get contracts tangentially related to a planned mission (bases for miners, stations for stations/mother ships, polar sats for surveys). I\u0027m putting something there anyway and a RNG is the only reason nobody wants it.\u003C/p\u003E\u003Cp\u003EI would also like some negotiability on contracts. Make adjustments not favor the player, but allow us some bounds to play with the particulars. Who needs a base on Eve for 20 Kerbals or a super-Munar, polar satilite?\u003C/p\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2015-11-11T22:36:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ajburges\u0022 data-cite=\u0022ajburges\u0022\u003E\u003Cdiv\u003EI would also like some negotiability on contracts. Make adjustments not favor the player, but allow us some bounds to play with the particulars. Who needs a base on Eve for 20 Kerbals or a super-Munar, polar satilite?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhy limit yourself to one base? Why not fifteen, or twenty? But we\u0027ll penalize you for declining \u003Cem\u003Ethose\u003C/em\u003E!\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-11-11T23:19:20Z","Content":"\n\u003Cp\u003EThis is just a stupid change, so I\u0027m penalized if I don\u0027t want to do ISRU contracts or base building contracts?\u003C/p\u003E\u003Cp\u003EWay screw up career mode Squad. There was a time when this game was about doing what you wanted to do. I\u0027m glad I can turn it off but it should be defaulted off for everything except grind mode.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-11T23:21:23Z\u0022 title=\u002211/11/2015 11:21  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 11, 2015\u003C/time\u003E by Alshain\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Legendary Emu","CreatedById":71911,"CreatedDateTime":"2015-11-11T23:25:27Z","Content":"\n\u003Cp\u003E\u0022Oh, I see you are a newly founded space agency that just recently landed a small probe on the moon. Tell me, can you build me a space station holding 11 kerbals and 4000 units of fuel? And while you are at it, can you pop by Duna and rescue some kerbal?\u0022\u003C/p\u003E\n"},{"CreatedByName":"Renegrade","CreatedById":96629,"CreatedDateTime":"2015-11-11T23:33:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Alshain\u0022 data-cite=\u0022Alshain\u0022\u003E\u003Cdiv\u003EI\u0027m glad I can turn it off but it should be defaulted off for everything except grind mode.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, this seems like it should have been on only if you pick higher difficulty levels (and custom games of course). Doubly so since the current contracts (although improved from before) are still like 20% \u0022oooh\u0022 and 80% \u0022oh HECK no!\u0022. If there were more meaningful, interesting contracts I\u0027d not be so concerned.\u003C/p\u003E\u003Cp\u003E(I like some of the new contracts that have come up since I started my 1.0.5 save, but the old contracts are still littering the list with their awfulness)\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-11-11T23:45:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Renegrade\u0022 data-cite=\u0022Renegrade\u0022\u003E\u003Cdiv\u003EYeah, this seems like it should have been on only if you pick higher difficulty levels (and custom games of course). Doubly so since the current contracts (although improved from before) are still like 20% \u0022oooh\u0022 and 80% \u0022oh HECK no!\u0022. If there were more meaningful, interesting contracts I\u0027d not be so concerned.\u003Cp\u003E(I like some of the new contracts that have come up since I started my 1.0.5 save, but the old contracts are still littering the list with their awfulness)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI wouldn\u0027t be so concerned if only the default limit wasn\u0027t 10 blasted contracts. If you are going to do this, give us a good range to choose from, at least 25 at a time.... \u003Cstrong\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EBY DEFAULT\u003C/span\u003E\u003C/strong\u003E.\u003C/p\u003E\n"},{"CreatedByName":"oglommi","CreatedById":127214,"CreatedDateTime":"2015-11-12T00:12:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kelderek\u0022 data-cite=\u0022Kelderek\u0022\u003E\u003Cdiv\u003EWell this explains why I now have 0 rep on my new career - I had cycled through a bunch of contracts last night before logging off and never noticed the penalty.\u003Cp\u003EThis is not a good solution to the \u0022slot machine\u0022 problem, especially not for a normal mode career. If you consider how many possible variations of contracts can pop up now along with how few are actually available at any given moment, it is entirely to be expected that we would want to cycle through the list to find something different. To apply a penalty just doesn\u0027t make any sense - maybe in one of the harder game modes, but definitely not in a normal career.\u003C/p\u003E\u003Cp\u003ELooks like I need to go tweak my persistence file and maybe use the debug menu to add back in some rep.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, this rep penalty seems like a horrible idea, the career game is very grindy as is. Adding rep penalty for skipping timeconsuming stupid contracts makes career mode abhorrent.\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2015-11-12T00:43:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Johnny Wishbone\u0022 data-cite=\u0022Johnny Wishbone\u0022\u003E\u003Cdiv\u003E...I have been one of the biggest supporters of career mode since it was introduced ... \u003Cp\u003EJust like the tech tree, the contract system is a good idea with a very poor implementation. Adding in ridiculous constraints like this aren\u0027t making it better. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell indeed; if you want sanity, look elsewhere. *Shuffles aside* Welcome to the sandbox, all you need is imagination here.\u003C/p\u003E\u003Cp\u003ECan I interest you in a Dres timeshare?\u003C/p\u003E\n"},{"CreatedByName":"WinkAllKerb\u0026#039;\u0026#039;","CreatedById":78047,"CreatedDateTime":"2015-11-12T01:05:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022oglommi\u0022 data-cite=\u0022oglommi\u0022\u003E\u003Cdiv\u003EYes, this rep penalty seems like a horrible idea, the career game is very grindy as is. Adding rep penalty for skipping timeconsuming stupid contracts makes career mode abhorrent.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Elet\u0027s now have a talk about how career is in the real world, not grindy at all, no rep penalty at all, no stupid contract at all.\u003C/p\u003E\u003Cp\u003Enope really i don\u0027t get it, career mode not abhorrent at all *shrug*\u003C/p\u003E\n"},{"CreatedByName":"panzer1b","CreatedById":95108,"CreatedDateTime":"2015-11-12T01:10:43Z","Content":"\n\u003Cp\u003EI think its realistic and keeps people from abusing the decline spam until they get exactly what they want tactic.\u003C/p\u003E\u003Cp\u003EThat said, it should only kick in after say 3 or so successive declines in a row. that would keep people from cycling until they get contract they want, and itll still let people decline some of the less fun and or not their style contracts without penalty.\u003C/p\u003E\u003Cp\u003EMyself though, i see no need for contracts, one, there are no military focused ones, two, career in general isnt military focused as well, blowing up capital ships costs alot of money, and there is no such thing as different factions implemented yet, so i cant really do funds tracking for different groups. That, and i have enough of an imagination that i dont need to be guided through the game or anything like that. If i want to do a contract, whats stopping me from doing exactly teh same thing in a sandbox save? If i want to land on duna, i can go land on duna in sandbox, if i want to place a satelite in some spot, i can do that in sandbox at the time and place of my choosing. So yeah, for those of us that either have alot of imagination and can make up our own goals, or come from the days before science unlocks even existed, there is no point to career.\u003C/p\u003E\n"},{"CreatedByName":"FancyMouse","CreatedById":142946,"CreatedDateTime":"2015-11-12T01:15:13Z","Content":"\n\u003Cp\u003EI suddenly remember there\u0027s mod like Rejector - and that will literally become rep black hole:)\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-11-12T01:23:44Z","Content":"\n\u003Cp\u003EWell I\u0027ve quit career mode because I realised I was doing early stuff a lot, but my last career \u003Cem\u003EI never declined contracts\u003C/em\u003E. Seeing people spam that X button until they got what they want just looked blatantly exploity. If I really didn\u0027t like any of the contracts I\u0027d \u003Cem\u003Etimewarp\u003C/em\u003E through a few days. That has meaningful consequences - transfer windows might be missed, missions en route might arrive and need attention, and I was using TAC Life Support too.\u003C/p\u003E\u003Cp\u003EI think Squad have done the right thing making decline not free. And I\u0027d say that if you\u0027re spending your time hitting that X button until a contract comes up that\u0027s exactly what you want, consider playing Science or Sandbox instead and just \u003Cem\u003Edoing\u003C/em\u003E exactly what you want.\u003C/p\u003E\n"},{"CreatedByName":"Norpo","CreatedById":113342,"CreatedDateTime":"2015-11-12T01:26:23Z","Content":"\n\u003Cp\u003EMy real problem with it is that rejecting contracts is strictly a quality of life feature, 99% of the time. If you just wait ~7 days then contracts disappear and get replaced with different ones, so instead of rejecting contracts, you can just wait a little while with time warp. And since time doesn\u0027t matter...\u003C/p\u003E\u003Cp\u003EI really want to see more time based features in stock Career mode, but it seems like the devs are just dipping their toes in the water of time-based mechanics, which doesn\u0027t really work if waiting gives you advantages but it\u0027s not really a commodity in any real sense, aside from transfer windows. See: the science lab giving you science, and now this. If waiting and doing nothing meant something it would matter, but as it stands you can just wait, and as long as you don\u0027t wait \u003Cem\u003Edecades\u003C/em\u003E then contract failure by deadline almost never happens. If time based mechanics just give you stuff as opposed to taking them away as well, then you can just hit the magic time warp button, and get free science, or get new contracts for free.\u003C/p\u003E\u003Cp\u003EThe two schools of thought seem to be \u0022I want more time based features, NASA doesn\u0027t do one mission at a time\u0022 and \u0022I don\u0027t want time to matter, I just want to do one mission at a time, juggling 10 missions at once isn\u0027t my idea of fun\u0022, and it seems like the devs are trying to please \u003Cem\u003Eboth\u003C/em\u003E groups, which almost never works out.\u003C/p\u003E\u003Cp\u003EBut that\u0027s just like, my opinion, man.\u003C/p\u003E\u003Cp\u003EEDIT: Also, mods prove that time based mechanics CAN work, Life Support mods, Kerbal Construction Time, to an extent SanSAT, and the like all add time based mechanics, and when used together they create a synergy, which really improves\u003Cspan style=\u0022font-size:8px;\u0022\u003E(YMMV)\u003C/span\u003E the game. Half-doing time based mechanics just makes it pointless most of the time.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-12T01:33:27Z\u0022 title=\u002211/12/2015 01:33  AM\u0022 data-short=\u00228 yr\u0022\u003ENovember 12, 2015\u003C/time\u003E by Norpo\u003C/strong\u003E\n\u003Cbr\u003EI\u0026#039;m Norpo, and i\u0026#039;m here at Editors Anonymous because EDIT: fixed typo\n\u003C/span\u003E\n"},{"CreatedByName":"cyberpawn","CreatedById":126699,"CreatedDateTime":"2015-11-12T01:38:18Z","Content":"\n\u003Cp\u003Ehey guys i have a question? what if i wait till contract expire? did i get -rep?\u003C/p\u003E\u003Cp\u003Eedit: without accepting it..\u003C/p\u003E\n"},{"CreatedByName":"T.C.","CreatedById":111697,"CreatedDateTime":"2015-11-12T01:38:45Z","Content":"\n\u003Cp\u003EReal question here: How does declining contracts benefit the player in any way? I think I\u0027m unfamiliar with the game mechanic being discussed in this thread.\u003C/p\u003E\u003Cp\u003EIs everyone suggesting that if I decline a contract, I will get a fresh new offer faster than I would have if I had ignored the contract?\u003C/p\u003E\u003Cp\u003E-TC\u003C/p\u003E\n"},{"CreatedByName":"Norpo","CreatedById":113342,"CreatedDateTime":"2015-11-12T01:41:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cyberpawn\u0022 data-cite=\u0022cyberpawn\u0022\u003E\u003Cdiv\u003Ehey guys i have a question? what if i wait till contract expire? did i get -rep?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think if you just let a contract expire then you don\u0027t lose rep.\u003C/p\u003E\n"},{"CreatedByName":"cyberpawn","CreatedById":126699,"CreatedDateTime":"2015-11-12T01:45:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Norpo\u0022 data-cite=\u0022Norpo\u0022\u003E\u003Cdiv\u003EI think if you just let a contract expire then you don\u0027t lose rep.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eaw yeah.. nice to know my rep is safe. thank you for answering my question sir.. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"FancyMouse","CreatedById":142946,"CreatedDateTime":"2015-11-12T01:46:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022T.C.\u0022 data-cite=\u0022T.C.\u0022\u003E\u003Cdiv\u003EReal question here: How does declining contracts benefit the player in any way? I think I\u0027m unfamiliar with the game mechanic being discussed in this thread.\u003Cp\u003EIs everyone suggesting that if I decline a contract, I will get a fresh new offer faster than I would have if I had ignored the contract?\u003C/p\u003E\u003Cp\u003E-TC\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMore importantly, the type of contract you deny may not be the same type of contract that appears the next. So you can easily cherry pick, say 4 rescue missions, or Kerbin station\u002BSun station\u002Bother planet station, and do them in a batch, while without declining it will be hard to do (either luck or need a long game time).\u003C/p\u003E\n"},{"CreatedByName":"WinkAllKerb\u0026#039;\u0026#039;","CreatedById":78047,"CreatedDateTime":"2015-11-12T01:50:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022T.C.\u0022 data-cite=\u0022T.C.\u0022\u003E\u003Cdiv\u003EReal question here: How does declining contracts benefit the player in any way? I think I\u0027m unfamiliar with the game mechanic being discussed in this thread.\u003Cp\u003EIs everyone suggesting that if I decline a contract, I will get a fresh new offer faster than I would have if I had ignored the contract?\u003C/p\u003E\u003Cp\u003E-TC\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Efor example you can decline only a few to get the same kind of contract and doing them in a single or two mission/launch row.\u003C/p\u003E\u003Cp\u003EI just started a custom (almost normal but minor pref harder setting thing), offered contract are much much more coherent, i usually fill my 7 slot @ rank 2 and as said clean them in one or two launch.\u003C/p\u003E\u003Cp\u003EPenalty are on @ default value but i don\u0027t really even feel them. so ... even thinking about upping them ...\u003C/p\u003E\u003Cp\u003Ebut clearly if someone is spamming the x button, it should either tweak it\u0027s career accordingly or switch to science or sandboxmode \u002B the change made to the contract system are overall smooth and on the good way compared how too it was 1.0x , .9x etc.\u003C/p\u003E\u003Cp\u003EDev related and returns i tend to find that approach much more pertinent than bigger changes, the contracts and sciences system have been sources of polemic since they were introduced with tons and tons of arguing threads. Just check the history about the subject in the suggestions sub forum (not even speaking of other sub forum) mostly say it all \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E(be warned that if you go have a look there you might not play ksp today so much there is to read on the subject)\u003C/span\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-12T02:11:38Z\u0022 title=\u002211/12/2015 02:11  AM\u0022 data-short=\u00228 yr\u0022\u003ENovember 12, 2015\u003C/time\u003E by WinkAllKerb\u0026#39;\u0026#39;\u003C/strong\u003E\n\u003Cbr\u003Edislexia typographia \u0026#039;cclicence\u0026#039;\n\u003C/span\u003E\n"}]}