{"TopicId":125218,"ForumId":29,"TopicTitle":"ModuleResourceHarvester: HarvesterType = 2 not working.","CreatedByName":"Chaos_Klaus","CreatedById":140720,"CreatedDateTime":"2015-11-12T18:12:09Z","PageNum":1,"Articles":[{"CreatedByName":"Chaos_Klaus","CreatedById":140720,"CreatedDateTime":"2015-11-12T18:12:09Z","Content":"\n\u003Cp\u003EHey forum.\u003C/p\u003E\u003Cp\u003EWith the new boyancy in 1.0.5 I started modifying the mk1 liquid fuel tank so it would act as a ballast tank.\u003C/p\u003E\u003Cp\u003EI am using the community resources pack to specify the \u0022water\u0022 resource.\u003C/p\u003E\u003Cp\u003EI use these part modules:\u003C/p\u003E\u003Cp\u003EModuleResourceConverter ... to consume water and convert it to \u0022nothing\u0022. This removes water from the tank while the converter is running.\u003C/p\u003E\u003Cp\u003EModuleResourceHarvester ... this is supposed to harvest the \u0022water\u0022 resource from the ocean and place it in the tank.\u003C/p\u003E\u003Cp\u003EMy problem is with the Harvester.\u003C/p\u003E\u003Cp\u003EIf I set HarvesterType = 2 (which means it will act like an atmospheric harvester) I can happily harvest water from the air. If I set HarvesterType = 1, I can see in the part description that it now says \u0022oceanic\u0022. However I get no button when I right click the part and try to use it. It doesn\u0027t matter if the part is submerged or not. The button for the converter is still there and works.\u003C/p\u003E\u003Cp\u003EWhy is that so? Are those harvester types not really implemented into stock KSP? Then again stock doesn\u0027t use any atmospheric harvesters and they seem to work fine. Am I missing a code line?\u003C/p\u003E\u003Cp\u003EHere is the part\u0027s config file so far.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003EPART\u003Cbr\u003E{\u003Cbr\u003E    name = Ballast Tank\u003Cbr\u003E    module = Part\u003Cbr\u003E    author = Chaos.Klaus\u003Cbr\u003E    rescaleFactor = 1\u003Cbr\u003E    node_stack_top = 0.0, 0.9375, 0.0, 0.0, 1.0, 0.0\u003Cbr\u003E    node_stack_bottom = 0.0, -0.9375, 0.0, 0.0, -1.0, 0.0\u003Cbr\u003E    node_attach = 0.0, 0.0, -0.625, 0.0, 0.0, 1.0, 1\u003Cbr\u003E    TechRequired = aviation\u003Cbr\u003E    entryCost = 2600\u003Cbr\u003E    cost = 550\u003Cbr\u003E    category = FuelTank\u003Cbr\u003E    subcategory = 0\u003Cbr\u003E    title = Ballast Tank\u003Cbr\u003E    manufacturer = D8 Submersibles\u003Cbr\u003E    description = A modified fuel tank that can be flodded with water to decrease it\u0027s boyancy. To increase boyancy again, repressurize the tank with the compressed air that is stored in a different compartment of the tank.\u003Cbr\u003E    attachRules = 1,1,1,1,0\u003Cbr\u003E    mass = 0.25\u003Cbr\u003E    dragModelType = default\u003Cbr\u003E    maximum_drag = 0.2\u003Cbr\u003E    minimum_drag = 0.3\u003Cbr\u003E    angularDrag = 2\u003Cbr\u003E    crashTolerance = 10\u003Cbr\u003E    breakingForce = 50\u003Cbr\u003E    breakingTorque = 50\u003Cbr\u003E    maxTemp = 2000 // = 3000\u003Cbr\u003E    thermalMassModifier = 2.0\u003Cbr\u003E    fuelCrossFeed = True\u003Cbr\u003E    bulkheadProfiles = size1, srf\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E    MODEL\u003Cbr\u003E    {\u003Cbr\u003E        model = Squad/Parts/Structural/mk1Parts/Fuselage\u003Cbr\u003E    }\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E    RESOURCE\u003Cbr\u003E    {\u003Cbr\u003E        name = Water\u003Cbr\u003E        amount = 1000\u003Cbr\u003E        maxAmount = 2000\u003Cbr\u003E    }\u003Cbr\u003E\u003Cbr\u003E    MODULE\u003Cbr\u003E    {\u003Cbr\u003E        name = ModuleFuelJettison\u003Cbr\u003E    }\u003Cbr\u003E\u003Cbr\u003E    MODULE\u003Cbr\u003E    {\u003Cbr\u003E        name = ModuleResourceHarvester\u003Cbr\u003E        HarvesterType = 1    // this specifies the harvester to be of the \u0022oceanic\u0022 type. 0 is \u0022surface\u0022, 2 is \u0022atmospheric\u0022, 1 is \u0022oceanic\u0022\u003Cbr\u003E        Efficiency = 1\u003Cbr\u003E        ResourceName = Water\u003Cbr\u003E        ConverterName = air vents \u003Cbr\u003E        StartActionName = open vents\u003Cbr\u003E        StopActionName = close vents        \u003Cbr\u003E    }\u003Cbr\u003E\u003Cbr\u003E    MODULE\u003Cbr\u003E    {\u003Cbr\u003E         name = ModuleResourceConverter\u003Cbr\u003E         ConverterName = Compressor\u003Cbr\u003E         StartActionName = start repressurizing\u003Cbr\u003E         StopActionName = stop repressurizing\u003Cbr\u003E\u003Cbr\u003E         INPUT_RESOURCE\u003Cbr\u003E         {\u003Cbr\u003E            ResourceName = Water\u003Cbr\u003E            Ratio = 10\u003Cbr\u003E            FlowMode = STAGE_PRIORITY_FLOW\u003Cbr\u003E         }\u003Cbr\u003E    }\u003Cbr\u003E}\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EEDIT: Mixed it up. Corrected: 1 is oceanic and 2 is atmospheric. Problem still stands.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-12T22:18:35Z\u0022 title=\u002211/12/2015 10:18  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 12, 2015\u003C/time\u003E by Chaos_Klaus\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Chaos_Klaus","CreatedById":140720,"CreatedDateTime":"2015-11-16T10:11:49Z","Content":"\nOK. So I found out that the oceanic harvester from Karbonite also doesn\u0026#39;t show the buttons ... until you deploy it. \u003Cbr\u003E\n\u003Cbr\u003E\nDo these harvester types need an animation, or do I need to specify some special mesh that tells KSP where the resource is taken in? I guess the same applies to drills.\n"},{"CreatedByName":"057Kingpin","CreatedById":153880,"CreatedDateTime":"2015-11-21T00:00:06Z","Content":"\nHey, I\u0026#39;ve been attempting the same thing. 1st I do not think the oceanic is implemented in stock KSP nor do I think atmospheric is implemented. It doesnt seem to be an issue with having to deploy, as if you tell the module to be a surface you should be able to start and stop harvesting of water. Water must be an available resource under the vessel for the option to pop up in surface mode, so you have to create the water resource and have it populate the planet (i tested by just having the entire planet have 100% water) I cant determine how to tell if the ship is in water however... only when the ship is in the water biome (unfortunately much of costal water is the shore biome). I edited the surface ore scanner to scan for water to help me trouble shoot this. I thought perhaps oceanic may only work when the ship was in the water biome but to no avail, and surface stops working as soon as you are in too deep of water (basically when you leave the shore biome). Harvesting on land has not worked yet, may try to just edit the rill to harvest water and see what happens.\n"},{"CreatedByName":"Chaos_Klaus","CreatedById":140720,"CreatedDateTime":"2015-11-22T15:15:44Z","Content":"\nI used the community resource pack. It has definitions for both oceanic and atmospheric water. Atmospheric harvesting works fine! (even under water)\u003Cbr\u003E\n\u003Cbr\u003E\nI installed Karbonite, which has an oceanic harvester. It uses the stock resource system ... and works. I don\u0026#39;t know where the problem is.\n"}]}