{"TopicId":125271,"ForumId":16,"TopicTitle":"Air Intake, what did I miss?","CreatedByName":"SpacedCowboy","CreatedById":92106,"CreatedDateTime":"2015-11-13T05:13:35Z","PageNum":1,"Articles":[{"CreatedByName":"SpacedCowboy","CreatedById":92106,"CreatedDateTime":"2015-11-13T05:13:35Z","Content":"\n\u003Cp\u003EWhy is the air intake gone from the resource box? (Upper right hand) Did I miss something?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-13T20:24:04Z\u0022 title=\u002211/13/2015 08:24  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 13, 2015\u003C/time\u003E by SpacedCowboy\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2015-11-13T06:50:28Z","Content":"\n\u003Cp\u003EThe amount shown does not actually tell you whether your engines are having their requirement met. Instead, right-click on your engine to see the percentage of its fuel and oxidizer/air requirement met.\u003C/p\u003E\u003Cp\u003E(The intake bar could be full and your engines could be flamed out from combustion failing, or conversely the intake bar could be empty but your engines could still be getting 100% of what they need)\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2015-11-13T11:21:26Z","Content":"\n\u003Cp\u003EFrom the Changelog:\u003C/p\u003E\u003Cp\u003E\u0022* IntakeAir resource is now fully hidden in Resources App.\u003C/p\u003E\u003Cp\u003E* IntakeAir is no longer displayed, since it was confusing, instead engines show whether their current requirements are being met.\u003C/p\u003E\u003Cp\u003E* Resources now have an isVisible flag, which determines whether the resource is visible on the right-click menu. Applied it (as false) to IntakeAir.\u0022\u003C/p\u003E\u003Cp\u003EIt was published along with the release announcement and is in the readme file with your copy of KSP.\u003C/p\u003E\u003Cp\u003EWhen there\u0027s an update there\u0027s usually a lot of changes included which don\u0027t get a lot of discussion anywhere. Squad are pretty good at documenting them in the changelog though, so it pays to read the readme for every release.\u003C/p\u003E\n"}]}