{"TopicId":125395,"ForumId":55,"TopicTitle":"Any chance to see stock procedural wings in future updates?","CreatedByName":"Vegatoxi","CreatedById":134066,"CreatedDateTime":"2015-11-14T09:31:50Z","PageNum":1,"Articles":[{"CreatedByName":"Vegatoxi","CreatedById":134066,"CreatedDateTime":"2015-11-14T09:31:50Z","Content":"\n\u003Cp\u003EQuestion is in the title.\u003C/p\u003E\u003Cp\u003ECurrent stock wings/control surfaces not give enough freedom. And mods not always get regular and timely updates.\u003C/p\u003E\n"},{"CreatedByName":"Van Disaster","CreatedById":58876,"CreatedDateTime":"2015-11-14T10:57:42Z","Content":"\n\u003Cp\u003EHistorically Squad have given a firm \u0022no\u0022 to any suggestions about procedural anything at all.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-11-14T11:37:34Z","Content":"\n\u003Cp\u003EThe modular wing pieces work pretty well for me. I haven\u0027t worked with the bigger stuff so much.\u003C/p\u003E\u003Cp\u003EIf we do get procedural wings, then the fairings are an example of how not to do it I feel. I don\u0027t want something that I can\u0027t remake if I delete it.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-11-14T13:09:07Z","Content":"\n\u003Cp\u003E[Moderator] Moved this suggestion for the stock game over to Suggestions \u0026amp; Development Discussion. [/Moderator]\u003C/p\u003E\u003Cp\u003E[Personal Opinion] Yes, please. I\u0027m generally against procedurals in the stock game as I feel it detracts from the Lego-like building mechanics of KSP, but they just make too much sense for wings. We currently have 37 wing and control surface parts filling up the editor menu and there are still shapes that are difficult or impossible to make. These could be replaced by just two or three procedural parts and give us much greater design flexibility. [/Personal Opinion]\u003C/p\u003E\n"},{"CreatedByName":"klgraham1013","CreatedById":105132,"CreatedDateTime":"2015-11-14T16:18:38Z","Content":"\n\u003Cp\u003EProbably not. I\u0027m hoping for some Mk3 modular wings. All this prefab stuff we\u0027ve been getting recently is, kind of, a bummer.\u003C/p\u003E\n"},{"CreatedByName":"Vegetal","CreatedById":147251,"CreatedDateTime":"2015-11-14T16:34:57Z","Content":"\n\u003Cp\u003EI\u0027m all for it. Would simplify the building process a lot.\u003C/p\u003E\n"},{"CreatedByName":"Van Disaster","CreatedById":58876,"CreatedDateTime":"2015-11-14T19:28:50Z","Content":"\n\u003Cp\u003EI\u0027ve always been for it, maybe the fairings were the wedge to get more parts.\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-11-14T19:45:26Z","Content":"\n\u003Cp\u003ENormally I am against procedural parts except where it would create an unnecessarily large number of parts to create new and interesting designs. For this reason, I\u0027m torn on this. I like the modular wings, but they do create a lot of parts, and the large series of wings is simply unacceptable, all planes look like 767\u0027s or Shuttles and that isn\u0027t right, no creativity at all. Procedural Wings would certainly solve this, but I really like building modular wings.\u003C/p\u003E\n"},{"CreatedByName":"Van Disaster","CreatedById":58876,"CreatedDateTime":"2015-11-14T20:37:33Z","Content":"\n\u003Cp\u003EYou still have to build modular wings even with pWings ( unless you end up with some complicated editor that lets you pinch \u0026amp; pull parts of a single wing - that\u0027d involve inserting vertices into a mesh and consequent UV remapping in realtime, which is a bit more than anything we have atm - deleting edit points would be fun to do accessibly :S ), you just only have to build them outwards rather than backwards as well. One of the best things about the b9 wings is the integration of the control surfaces - and in fact procedural control surfaces themselves.\u003C/p\u003E\n"},{"CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2015-11-14T22:32:08Z","Content":"\n\u003Cp\u003EI\u0027m with RIC and Alshain on this one. Kind of torn. Modular wings are alright IMO, but recently I\u0027ve been experimenting with B9 pWings for the BAD-T tournament and they are amazing for smooth and aerodynamic wings with control surfaces not sticking out like we have now. pWings are really amazing for that kind of thing. And with that sentence I think I just changed my mind.\u003C/p\u003E\u003Cp\u003ENot the tanks though. I like LEGO rockets.\u003C/p\u003E\n"},{"CreatedByName":"NoMrBond","CreatedById":69263,"CreatedDateTime":"2015-11-14T22:44:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Van Disaster\u0022 data-cite=\u0022Van Disaster\u0022\u003E\u003Cdiv\u003EHistorically Squad have given a firm \u0022no\u0022 to any suggestions about procedural anything at all.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot quite, Maxmaps expressed interest in some procedural structural parts (trusses/girders were mentioned), and procedural fairings (which are already in game).\u003C/p\u003E\u003Cp\u003EIt just has to make sense and not trivialize gameplay\u003C/p\u003E\n"},{"CreatedByName":"klgraham1013","CreatedById":105132,"CreatedDateTime":"2015-11-15T14:17:16Z","Content":"\n\u003Cp\u003EThe fairings already undermine this, but:\u003C/p\u003E\u003Cp\u003EI think they need to choose a design philosophy and stick with it. I see merit in lego and procedural, but having both in one game just causes confusion. \u0022Why can I make wings how every I want, but I can\u0027t stretch tanks to the length I want?\u0022 By maintaining the lego-style, a new player understands the system and what can and should be possible. The restrictions are apparent and easy to understand.\u003C/p\u003E\u003Cp\u003EAs far as the number of wing parts, that could become irrelevant with shared textures and thoughtful sorting.\u003C/p\u003E\n"},{"CreatedByName":"Moss","CreatedById":106413,"CreatedDateTime":"2015-11-16T08:17:06Z","Content":"\nI\u0026#39;ve got no problem with having both procedural and pre-fab wings in the game. Same goes for fuel tanks. Just make each pre-frab part a procedural part with \u0022locked\u0022 parameters, such as it\u0026#39;s length, nodes and internal resource, with the ability to unlock fully procedural parts later in the career tree.\n"},{"CreatedByName":"Capt Snuggler","CreatedById":65092,"CreatedDateTime":"2015-11-16T11:25:12Z","Content":"\nI used to be against it but have now completely changed my mind.\u003Cbr\u003E\n\u003Cbr\u003E\nnow that larger craft are more common and part count is becoming a critical issue for many players I think procedural wings would help solve many lag issues and problems with building.\u003Cbr\u003E\n\u003Cbr\u003E\ndespite the best efforts of Porkjet the [B]multipart wing system does not and cannot work 100% of the time[/B] but a procedural system, if done correctly, could.\n"},{"CreatedByName":"Vegatoxi","CreatedById":134066,"CreatedDateTime":"2015-11-16T11:55:22Z","Content":"\n[quote name=\u0027klgraham1013\u0027]The fairings already undermine this, but:\u003Cbr\u003E\n\u003Cbr\u003E\nI think they need to choose a design philosophy and stick with it. I see merit in lego and procedural, but having both in one game just causes confusion. \u0022Why can I make wings how every I want, but I can\u0026#39;t stretch tanks to the length I want?\u0022 By maintaining the lego-style, a new player understands the system and what can and should be possible. The restrictions are apparent and easy to understand.\u003Cbr\u003E\n\u003Cbr\u003E\nAs far as the number of wing parts, that could become irrelevant with shared textures and thoughtful sorting.[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nWell, B9 dond free you from LEGO-style building, especially when you deal with big wings.\u003Cbr\u003E\nAnd B9 wing looks beautiful than bunch of stock wing plates sticked together\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-11-16T12:00:03Z","Content":"\n[quote name=\u0027klgraham1013\u0027]As far as the number of wing parts, that could become irrelevant with shared textures and thoughtful sorting.[/QUOTE]\u003Cbr\u003E\nIt\u0026#39;s not just memory footprint (which is apparently not all that much for the stock parts anyway). It\u0026#39;s that each part has its own inertia calcs, aero calcs, and thermal calcs. Part count of a vessel is the biggest factor in KSP performance, measures to keep it in check are very welcome.\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-11-16T16:59:15Z","Content":"\n[quote name=\u0027Red Iron Crown\u0027]It\u0026#39;s not just memory footprint (which is apparently not all that much for the stock parts anyway). It\u0026#39;s that each part has its own inertia calcs, aero calcs, and thermal calcs. Part count of a vessel is the biggest factor in KSP performance, measures to keep it in check are very welcome.[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nExactly, thats why I\u0026#39;m torn on this. On the one hand I don\u0026#39;t want to lose the modular wings. On the other hand, even 1.1 won\u0026#39;t totally eliminate part count issues and wings make a lot of it. I wouldn\u0026#39;t object to proc wings if it expanded what we can build creatively due to varying shape, sizes, and lack of part count \u0026#39;restrictions\u0026#39;.\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-16T17:02:57Z\u0022 title=\u002211/16/2015 05:02  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 16, 2015\u003C/time\u003E by Alshain\u003C/strong\u003E\n\u003C/span\u003E\n"}]}