{"TopicId":125495,"ForumId":44,"TopicTitle":"nuclear in space constructively","CreatedByName":"Findthepin1","CreatedById":139989,"CreatedDateTime":"2015-11-15T06:52:46Z","PageNum":1,"Articles":[{"CreatedByName":"Findthepin1","CreatedById":139989,"CreatedDateTime":"2015-11-15T06:52:46Z","Content":"\n\u003Cp\u003EI heard about Project Longshot. From my understanding, it wasn\u0027t done because they couldn\u0027t launch it. It was to weight 396 metric tons. We would need between 4 and 7 SLS launches (depends whether Block 2) to launch nowadays. If it is built in orbit it could be done. AFAIK the only reason it isn\u0027t being done is the space treaty having banned nuclear explosions in space. This treaty was done in a time of Cold War paranoia, when nobody realized that these technologies could be used peacefully and constructively. I think in a couple decades we will have people trying not only to build stuff like Longshot and Orion, but also trying to power bases with reactors or doing large seismic experiments with nuclear seismic things. Why haven\u0027t they undone this and tried to peacefully use these concepts? Is it that people aren\u0027t interested in space anymore?\u003C/p\u003E\n"},{"CreatedByName":"fredinno","CreatedById":143381,"CreatedDateTime":"2015-11-15T07:06:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Findthepin1\u0022 data-cite=\u0022Findthepin1\u0022\u003E\u003Cdiv\u003EI heard about Project Longshot. From my understanding, it wasn\u0027t done because they couldn\u0027t launch it. It was to weight 396 metric tons. We would need between 4 and 7 SLS launches (depends whether Block 2) to launch nowadays. If it is built in orbit it could be done. AFAIK the only reason it isn\u0027t being done is the space treaty having banned nuclear explosions in space. This treaty was done in a time of Cold War paranoia, when nobody realized that these technologies could be used peacefully and constructively. I think in a couple decades we will have people trying not only to build stuff like Longshot and Orion, but also trying to power bases with reactors or doing large seismic experiments with nuclear seismic things. Why haven\u0027t they undone this and tried to peacefully use these concepts? Is it that people aren\u0027t interested in space anymore?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFear of nukes.\u003C/p\u003E\n"},{"CreatedByName":"Hcube","CreatedById":137241,"CreatedDateTime":"2015-11-15T09:58:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022fredinno\u0022 data-cite=\u0022fredinno\u0022\u003E\u003Cdiv\u003EFear of nukes.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFear of nukes that is maybe irrational, in this case of constructive use and space exploration, but understandable. I don\u0027t know if I myself would be in favor of it.\u003C/p\u003E\n"},{"CreatedByName":"Lohan2008","CreatedById":80945,"CreatedDateTime":"2015-11-15T10:35:17Z","Content":"\n\u003Cp\u003EFear of nuclear bombs dropping from orbit.\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2015-11-15T11:05:47Z","Content":"\n\u003Cp\u003EOrion, as well as breaking a whole bunch of arms control treaties, would be enormously expensive. Longshot requires technologies that don\u0027t yet exist, and again would be enormously expensive for limited scientific gain. Even more conventional reactor projects like Prometheus hit cost issues rather than the mystical all-powerful fear of nuclear anything invoked all so often on this site\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-16T10:20:52Z\u0022 title=\u002211/16/2015 10:20  AM\u0022 data-short=\u00228 yr\u0022\u003ENovember 16, 2015\u003C/time\u003E by Kryten\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2015-11-16T09:40:00Z","Content":"\n[quote name=\u0027Lohan2008\u0027]Fear of nuclear bombs dropping from orbit.[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nyou can drop inert masses from orbit and get nuke-equivalent results.\n"},{"CreatedByName":"Hcube","CreatedById":137241,"CreatedDateTime":"2015-11-16T09:58:32Z","Content":"\n[quote name=\u0027Nuke\u0027]you can drop inert masses from orbit and get nuke-equivalent results.[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nNow replace the inert mass with a nuke. That\u0026#39;s a nukeÃ‚Â² effect !\n"},{"CreatedByName":"prophet_01","CreatedById":111502,"CreatedDateTime":"2015-11-16T12:11:37Z","Content":"\nI\u0026#39;m definitely not a fan of regular use of nuclear bombs, regardless of their potential use. It would likely require the construction of new bombs to match the requirements of space flight and to get the best results. \u003Cbr\u003E\nThere are enough security hazards regarding nuclear weapons out there that have been traded on the black market and somehow ended up in very instable nations. That\u0026#39;s already a huge concern as we can\u0026#39;t keep an eye on or even know about all of them.\u003Cbr\u003E\n\u003Cbr\u003E\nSo even if I\u0026#39;d trust some of the space agencies with keeping an eye on their nukes and taking care of a fully enclosed and safe production line, there is still the question about what might happen if it\u0026#39;s not just NASA that starts using nukes for their missions. If one agency uses this conceot, others might follow for prestige or whatever reasons. And even if they all intend to only use them for peacefull missions in the name of science, I still think this is like opening pandora\u0026#39;s box. \u003Cbr\u003E\nThe production and storage of new nukes in certain countries that repeatedly \u0026#39;lost\u0026#39; some of their warheads during political instable periodes is the stuff that most goverment\u0026#39;s nightmaes are made of. \u003Cbr\u003E\nThis is not just about baseless paranoya, it\u0026#39;s about avoiding unpredictable situations with potentially dangerous results.\u003Cbr\u003E\nThe problems and concerns with those concepts don\u0026#39;t start once the nukes are in orbit. It\u0026#39;s a lot easier to keep track of stuff up in orbit compared to what it\u0026#39;s like with the nukes in storage down here on earth.\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-16T12:28:10Z\u0022 title=\u002211/16/2015 12:28  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 16, 2015\u003C/time\u003E by prophet_01\u003C/strong\u003E\n\u003C/span\u003E\n"}]}