{"TopicId":125599,"ForumId":18,"TopicTitle":"How well will this laptop play KSP?","CreatedByName":"Tortoise","CreatedById":68002,"CreatedDateTime":"2015-11-16T03:25:15Z","PageNum":1,"Articles":[{"CreatedByName":"Tortoise","CreatedById":68002,"CreatedDateTime":"2015-11-16T03:25:15Z","Content":"\nI\u0026#39;ve been away from KSP for quite some time now and I\u0026#39;m looking to jump back into it soon. I have a tight budget and I need a new PC for it. \u003Cbr\u003E\nHow would this laptop run KSP?\u003Cbr\u003E\n[url]http://www.bestbuy.com/site/dell-inspiron-15-6-laptop-intel-core-i7-6gb-memory-1tb-hard-drive-black-gloss/4540000.p?skuId=4540000\u0026id=1219764047599[/url]\u003Cbr\u003E\n\u003Cbr\u003E\nId also like to note that I will use many mods in KSP. Mostly with new parts, better aerodynamics (FAR), and much more.\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-16T03:31:15Z\u0022 title=\u002211/16/2015 03:31  AM\u0022 data-short=\u00228 yr\u0022\u003ENovember 16, 2015\u003C/time\u003E by Tortoise\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Flymetothemun","CreatedById":17689,"CreatedDateTime":"2015-11-16T03:28:55Z","Content":"\nCopy\u002BPaste from HeroHunter\u0026#39;s thread on the same subject:\u003Cbr\u003E\n\u003Cbr\u003E\nI run KSP perfectly fine on stock settings with 6 gigs of ram and a 1.9 GHz processor that doubles as a GPU (it\u0026#39;s one of those new APU types you might see).\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2015-11-16T03:41:23Z","Content":"\nI will run decently. I have an i7 2.4 GHz laptop with Intel \u0022Integrated Graphics\u0022 and KSP runs fairly well on it.\u003Cbr\u003E\n\u003Cbr\u003E\nHaving said that, you will have to manage your expectations a bit. KSP is quite processor intensive and while not [I]that[/I] GPU intensive, the fact that the CPU has to take care of that as well doesn\u0026#39;t help. Expect your cooler fans to rev up like turbopumps once you start playing KSP and see lots of red markers when in the atmosphere or in low orbit over water. I installed the Kerbo Katz utility to reduce the frame rate to something insane slow (5 FPS if memory serves me right) when the KSP window loses focus. That way, if you pause the game (and Alt-Tab out of it) your hardware gets a bit of a break.\u003Cbr\u003E\n\u003Cbr\u003E\nMy [I]previous[/I] laptop (slightly lower specs but with a real graphics card) ran extremely hot with KSP and I had to use ice packs to cool it. That one stopped working at one point and I suspect overheating. Having moved things around the house a bit I know have a desk to call my own and bought a modest desktop (i7, 3.4MHz) with a simple (NVidia GTX 745) graphics card. KSP runs [I]much[/I] smoother without the computer breaking a sweat (completely silent).\u003Cbr\u003E\n\u003Cbr\u003E\nIf you don\u0026#39;t [I]need[/I] a laptop and you want something to play KSP on, I\u0026#39;d get a desktop. That\u0026#39;s what I did.\n"}]}