{"TopicId":125980,"ForumId":32,"TopicTitle":"Which to chose ADV rocketry, General construction, or Flight control","CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2015-11-20T14:09:23Z","PageNum":1,"Articles":[{"CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2015-11-20T14:09:23Z","Content":"\nI have 44.8 of tech point, and have experiential \u0022terrier\u0022 engine, i need to test it rough staging sequence at altitude of 25-28 km and 1080-1200 m/s speed, i wonder how to make that test when i put it at sub-orbital flight at 74 km the speed at test altitude was to slow when i make apogee at 115 km it was to fast :(\u003Cbr\u003E\n\u003Cbr\u003E\nI want to make this test because it give me 5 tech points not mentioning hard cash and prestige :D\u003Cbr\u003E\nBut i lost the \u0022tearier\u0022 engine and force me to unlock it via tech tree, but i wonder does flight control is better than advanced rocketry?\n"},{"CreatedByName":"Korizan","CreatedById":142032,"CreatedDateTime":"2015-11-20T15:17:30Z","Content":"\nWell unless the system has changed you don\u0026#39;t have to fuel it just activate it.\u003Cbr\u003E\nSo you could treat it like a payload and activate it at the right time you should be good to go.\n"},{"CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2015-11-20T16:37:31Z","Content":"\n[quote name=\u0027Korizan\u0027]Well unless the system has changed you don\u0026#39;t have to fuel it just activate it.\u003Cbr\u003E\nSo you could treat it like a payload and activate it at the right time you should be good to go.[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nI finally did it, and i had fuel, fortunately so i can decelerate before landing, and even with that i \u0022killed\u0022 poor Bob several time, before i landed properly, but i have lucky F9 key on on my keyboard ;)\n"},{"CreatedByName":"Korizan","CreatedById":142032,"CreatedDateTime":"2015-11-20T19:12:08Z","Content":"\nGRATS !!!, sometimes the most aggravating Missions in the end are the most fun.\n"},{"CreatedByName":"MrOsterman","CreatedById":153514,"CreatedDateTime":"2015-11-20T19:19:15Z","Content":"\nIn good news to come: Once you start bringing samples back from Mun you\u0026#39;re not going to worry about 3 science... :)\n"}]}