{"TopicId":126077,"ForumId":16,"TopicTitle":"How to prevent flat spins?","CreatedByName":"WesleyWestland","CreatedById":139912,"CreatedDateTime":"2015-11-21T16:38:16Z","PageNum":1,"Articles":[{"CreatedByName":"WesleyWestland","CreatedById":139912,"CreatedDateTime":"2015-11-21T16:38:16Z","Content":"\nI\u0026#39;m trying to design a cargo plane in 1.0.5 (same size as the Stearwing A300, but I regard using the stock craft as cheating), using the FAT-455 wings, but it won\u0026#39;t work. I\u0026#39;ve tried many different configurations (high wing, low wing, Goliath engines, Wheesley engines, CoL on top of CoM, CoL behind CoM, etc.) but whatever I do, it ends up in a flat spin whenever I try to bank to try and turn. What am I doing wrong? The Stearman A300 flies fine, CoM and CoL are in similar places, only his CoL arrow is pointing up and aft instead of straight up. I can get it to point aft slightly by angling the main wings, but that only seems to make the problem worse. Do you have to treat the FAT-455 differently maybe?\u003Cbr\u003E\n\u003Cbr\u003E\n\u003Cbr\u003E\nThanks in advance,\u003Cbr\u003E\n\u003Cbr\u003E\nWesleyWestland.\u003Cbr\u003E\n\u003Cbr\u003E\nEDIT: the problem has been solved! :D\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-22T15:12:22Z\u0022 title=\u002211/22/2015 03:12  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 22, 2015\u003C/time\u003E by WesleyWestland\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-11-21T17:35:30Z","Content":"\nPlease share a picture of your plane in the SPH with the CoM and CoL indicators turned on, that will be immensely helpful in determining what is going on.\n"},{"CreatedByName":"ForScience6686","CreatedById":144187,"CreatedDateTime":"2015-11-21T17:53:20Z","Content":"\nI would guess you\u0026#39;re losing too much speed in the turn. You got to take it gentle the bigger you go as you are taking forward momentum to change direction. If you get into a spin, turning into it and trying to stay on prograde is my best advice, having excess power will help as well.\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-11-21T18:31:06Z","Content":"\nMake sure you have enough vertical stabilizer.\u003Cbr\u003E\n\u003Cbr\u003E\nAlso, make sure you have roll authority turned off for your vertical stabilizers, otherwise they can end up fighting against themselves. You want vertical stabilizers to be enabled for [B]yaw only[/B].\n"},{"CreatedByName":"ForScience6686","CreatedById":144187,"CreatedDateTime":"2015-11-21T18:42:08Z","Content":"\nThat\u0026#39;s a good point by snark. I\u0026#39;ve used the wing strake with a tail fin to help stabilize some crafts. It helps push the tail back if you start to spin. However if you don\u0026#39;t have the speed, you won\u0026#39;t have the aero forces to help you.\n"},{"CreatedByName":"stenole","CreatedById":144084,"CreatedDateTime":"2015-11-21T19:02:07Z","Content":"\nIn the editor, with CoM and CoL visible, rotate the entire craft in the roll plane 90 degrees. If the CoL is in front of the CoM, the craft is unstable in the yaw plane. Another way to check it is to rotate the ship a few degrees in the yaw plane and look at which way the lift arrow is rotating the ship. If it is pulling the ship away from where you want it to point, it means it is unstable. You can also use this method for ships with wings at odd angles to determine not only if it is stable near prograde, but also if it has angles where it is naturally unstable. Since body lift and warping of the wings during flight is not taken into account in the editor, it is not 100% reliable. It gives you a ballpark estimate of what is wrong though, and it saves you the trouble of needing to test everything incrementally in flight.\n"},{"CreatedByName":"WesleyWestland","CreatedById":139912,"CreatedDateTime":"2015-11-22T07:50:17Z","Content":"\nThank you all for replying so quickly. I\u0026#39;ll try and post some screenshots later today. I already had my control surfaces set to their right axis. I doubt it is a speed loss problem, as it also happens when banking 5 or 10 degrees. I\u0026#39;ll try rolling it in the editor.\n"},{"CreatedByName":"Skorpychan","CreatedById":72052,"CreatedDateTime":"2015-11-22T09:29:11Z","Content":"\nAdd some dihedral, perhaps, or some more vertical surfaces.\n"},{"CreatedByName":"WesleyWestland","CreatedById":139912,"CreatedDateTime":"2015-11-22T15:11:04Z","Content":"\nOkay, I\u0026#39;ve tried your tips (I already had yaw only for the rudder, I already had dihedral), and it seems that adding a wing strake in front of the rudder and extra vertical stabilizers like the Shuttle Carrier Aircraft has, has solved the problem. The CoL and CoM were hardly changed at all. Thanks all!\u003Cbr\u003E\n\u003Cbr\u003E\nWesleyWestland.[IMG]http://imgur.com/a/TX8NL[/IMG]http://imgur.com/a/TX8NL\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-22T20:16:36Z\u0022 title=\u002211/22/2015 08:16  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 22, 2015\u003C/time\u003E by WesleyWestland\u003C/strong\u003E\n\u003C/span\u003E\n"}]}