{"TopicId":126080,"ForumId":16,"TopicTitle":"Why does my spaceplane have reversed roll controls?","CreatedByName":"Workable Goblin","CreatedById":153289,"CreatedDateTime":"2015-11-21T17:13:40Z","PageNum":1,"Articles":[{"CreatedByName":"Workable Goblin","CreatedById":153289,"CreatedDateTime":"2015-11-21T17:13:40Z","Content":"\nI have run into a peculiar problem with an SSTO spaceplane I am designing, where for some reason it will sometimes reverse the roll controls, that is it will bank to the right when I tell it to bank to the left and vice versa. Besides making it more difficult to control, this completely screws up SAS and autopilots because, naturally, if the aircraft is banking to the left they will try banking to the right, only in this case that makes the bank become more severe and so on and so forth until the aircraft tumbles out of control. Peculiarly, it is [i]only[/i] the roll controls that are affected, while pitch and yaw are unaffected. I have checked to make sure that controls aren\u0026#39;t inverted, and they are not (as might be expected from the previous sentence), and the navball is normally oriented, so I am at a loss as to [i]why[/i] this is happening.\u003Cbr\u003E\n\u003Cbr\u003E\nIt is using modded parts (from the Mark 4 spaceplane mod and the Mark 2/3 expansion pack, as well as tweakscaled stock parts and MechJeb), but this does not itself seem to make any difference. The first time this appeared, after all, I cured it by deleting the then-root part and re-rooting the whole vehicle on the probe core I was using as the command pod, only to have it reappear when I decided to rearrange the parts (in particular, to move the probe core to the middle of the vehicle instead of the front end) and add some additional monopropellant and reaction wheels based on my testing. This time, re-rooting the spacecraft has not had any effect at all, nor has moving the probe core back to the front of the vehicle.\u003Cbr\u003E\n\u003Cbr\u003E\nDoes anyone have any ideas about why this could be happening and how to fix it? I can post pictures if you like, but I don\u0026#39;t think they will be very revealing; from the exterior, everything seems quite ordinary and normal.\u003Cbr\u003E\n\u003Cbr\u003E\n(As an aside, why are joints with drone cores so flexible? It doesn\u0026#39;t make any sense to me that drone cores would be so much less rigid than other fuselage segments...)\n"},{"CreatedByName":"Korizan","CreatedById":142032,"CreatedDateTime":"2015-11-21T18:53:55Z","Content":"\nWell a guess but is sounds like.\u003Cbr\u003E\nThe game checks if your control surfaces are on a wing, forward of the center of mass, or the tail, behind the center of mass and changes direction accordingly.\u003Cbr\u003E\nIf the Control surfaces are right on the center of mass the game might be flipping as the load changes or it is not sure what to do with them.\u003Cbr\u003E\nSo actually a picture would be rather helpful right now especially one with the center of mass on it.\n"},{"CreatedByName":"Workable Goblin","CreatedById":153289,"CreatedDateTime":"2015-11-21T19:44:07Z","Content":"\nThat certainly is not the problem, since I have a very rear-mounted wing and rather forwards canards. Neither is particularly near the center of mass, nor are the control surfaces mounted to them (or that form part of them, in the case of the canards).\u003Cbr\u003E\n\u003Cbr\u003E\nActually, it seems to have cured itself, having just taken the thing for a test flight. Very unsatisfying, especially since I didn\u0026#39;t actually do anything that would logically have caused it to stop being cross-wired, but there you have it...\n"},{"CreatedByName":"Spacebug300","CreatedById":135290,"CreatedDateTime":"2015-11-22T21:47:26Z","Content":"\nFirst double check that none of your lift surfaces are inverted (obviously) and keep in mind that, when you tweak scale parts they might break physics especially when we are talking about rescaling wings.\n"},{"CreatedByName":"Yakuzi","CreatedById":85181,"CreatedDateTime":"2015-11-22T21:56:39Z","Content":"\nIs your probe core by any chance flipped so its facing backwards? Try switching control to a different command module and check if the problem persists.\u003Cbr\u003E\nI had a similar problem where my craft pitched down when pulling up and vice versa... My upside-down cockpit was the culprit (don\u0026#39;t ask), resolved with switching control to a different command module.\n"},{"CreatedByName":"Fendleton","CreatedById":22867,"CreatedDateTime":"2015-11-22T21:57:59Z","Content":"\nAre you using any swept-back wing parts with ailerons attached to them? I\u0026#39;ve experienced control reversal on these parts in the past, particularly the stock swept wing (the non-modular one). If that\u0026#39;s the case, then swap them over to pitch (or flaps, or delete them), and use another part instead.\u003Cbr\u003E\n\u003Cbr\u003E\nThis is a really, really annoying glitch when it occurs, but it\u0026#39;s usually possible to work around by swapping out where controls are.\n"},{"CreatedByName":"hanatoro","CreatedById":11617,"CreatedDateTime":"2016-01-19T23:48:18Z","Content":"\n\u003Cp\u003E\nI have encountered this issues myself and I believe that it may be related to changing CoM during flight. When I used TAC fuel balancer to balance out the fuel loads and roll control returned to normal.\n\u003C/p\u003E\n"}]}