{"TopicId":12617,"ForumId":24,"TopicTitle":"Greetings Programs!","CreatedByName":"HenryL","CreatedById":27835,"CreatedDateTime":"2012-06-13T14:12:21Z","PageNum":1,"Articles":[{"CreatedByName":"HenryL","CreatedById":27835,"CreatedDateTime":"2012-06-13T14:12:21Z","Content":"\n\u003Cp\u003EGreetings and salutations fellow intrepid explorers.\u003C/p\u003E\u003Cp\u003EI have just returned from my first successful venture to Minmus aboard my trusty design, the Aldrin V. This is not to be confused with the less successful Aldrin IV.. please everyone, a moment of silence for those poor fellows stranded on the Mun when their lander flipped over.\u003C/p\u003E\u003Cp\u003EFirst, some thanks are in order: to the whole Squad team for giving us such a great game. Second, I have to thank Kosmo-Not for his booster ideas that I shamelessly have stolen for my Aldrin V from his excellent Kosmos Zero ship. \u003Ca href=\u0022http://kerbalspaceprogram.com/forum/index.php?topic=6310.0\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/forum/index.php?topic=6310.0\u003C/a\u003E Next I want to thank Feanor for his great (and should be included in STOCK!) addon of the 0.5 scale stock parts. \u003Ca href=\u0022http://kerbalspaceprogram.com/forum/index.php?topic=4555.0\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/forum/index.php?topic=4555.0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnyone else feel that those landing legs have some spring in them? Or is it that the taller the lander, the more \u0027bounce\u0027 there is because of a lack of rigidity in the joints? It helped a bit when I added some struts. The fins on the lander stage are there for more than esthetics, they also help keep it upright if there is too much bounce on landing.\u003C/p\u003E\u003Cp\u003EOK, going to try and attach a pic here.. Let\\\u0027s see if that works.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://img254.imageshack.us/img254/2929/aldrinv.png\u0022 alt=\u0022aldrinv.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Eand here is the lander portion on the Mun:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://img213.imageshack.us/img213/9589/aldrinvonmoon.png\u0022 alt=\u0022aldrinvonmoon.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"Endeavour","CreatedById":21125,"CreatedDateTime":"2012-06-13T14:27:54Z","Content":"\n\u003Cp\u003EWelcome to the Forums! That is a nice looking rocket!\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2012-06-13T16:17:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003Ea moment of silence for those poor fellows stranded on the Mun \u003C/div\u003E\u003C/blockquote\u003E Which ones? I\\\u0027ve left at least 45 myself. If we were all playing in the same universe, the place would be coated with them by now. \u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EAnyone else feel that those landing legs have some spring in them? \u003C/div\u003E\u003C/blockquote\u003E I\\\u0027ve come to believe that this is why I\\\u0027m having so much trouble landing on Mun. I touch down ever so gently, then one of my spring-loaded legs snaps back and sumersaults my ship, which rotation the SAS doesn\\\u0027t stop until I\\\u0027m upside down, and then I land on my head. I\\\u0027ve tried switching to fins for landing gear, and then my ship doesn\\\u0027t flip, but the fins crumple and it falls over. I\\\u0027m experimenting with strut reinforcement. (After they fall off, the fins explode, which cracks me up. What? Are they made out of dynamite?)\n"},{"CreatedByName":"Volt","CreatedById":4686,"CreatedDateTime":"2012-06-13T16:30:08Z","Content":"\n\u003Cp\u003ESalutations, fellow Tron fan(?)\u003C/p\u003E\n"},{"CreatedByName":"HenryL","CreatedById":27835,"CreatedDateTime":"2012-06-13T17:15:10Z","Content":"\n\u003Cp\u003EYes, definitely a fan of Tron.\u003C/p\u003E\u003Cp\u003EThanks for the compliment on the rocket. That is the end result not only of many hours of work, but many brave Kerbals died in its design phase.\u003C/p\u003E\u003Cp\u003EAs it is, I think it might be more than a tad overpowered. When you get to the Mun you still have about 1/2 of stage #3\\\u0027s fuel left and now must jettison to start the descent phase. I have almost as much left when going to Minmus, which surprised me. But overall, as I am not that efficient of a flyer I would rather have a bit too much.\u003C/p\u003E\n"},{"CreatedByName":"Capt\u0026#039;n Skunky","CreatedById":1261,"CreatedDateTime":"2012-06-13T18:20:03Z","Content":"\n\u003Cp\u003EWelcome to the KSP Forums!\u003C/p\u003E\u003Cp\u003EHappy Launching!\u003C/p\u003E\u003Cp\u003EArrr!\u003C/p\u003E\u003Cp\u003ECapt\\\u0027n Skunky\u003C/p\u003E\u003Cp\u003EKSP Community Manager\u003C/p\u003E\n"}]}