{"TopicId":126111,"ForumId":34,"TopicTitle":"[1.12.x] BetterBurnTime v1.10: Provides extra burn-time indicators on the navball for suicide burns \u0026amp; target rendezvous.","CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-11-21T23:28:10Z","PageNum":1,"Articles":[{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-11-21T23:28:10Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:20px;\u0022\u003E\u003Cstrong\u003EWhat it does\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nWhen the ship is in vacuum and on a collision course with the ground, it will automatically show time-to-impact, and the estimated burn time to kill your velocity at ground level.\n\u003C/li\u003E\n\u003Cli\u003E\nWhen the ship is in orbit and has an upcoming rendezvous with a target ship, it will automatically show time-to-closest-approach, and the estimated burn time to match velocity to the target.\n\u003C/li\u003E\n\u003Cli\u003E\nWhen the ship is on a course to enter or exit atmosphere in the next few minutes, shows time until the transition.\n\u003C/li\u003E\n\u003Cli\u003E\nFor closest-approach, it shows a countdown indicator to tell you when to start your burn.\n\u003C/li\u003E\n\u003Cli\u003E\nWhen the ship\u0027s orbital period is close to geosynchronous, shows a time-delta-from-geosynchronous display, to make it easy to set up synchronous orbit.\n\u003C/li\u003E\n\u003Cli\u003E\nWhen the ship has a target and its orbital period is close to the target\u0027s, shows a time-delta-from-target-synchronous display, to make it easy to synchronize orbits.\n\u003C/li\u003E\n\u003Cli\u003E\nSRBs display their burn time. It\u0027s shown on the part tooltip in the vehicle editor, as well as on the part\u0027s right-click menu in the editor and in flight.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cbr\u003E\u003Cstrong\u003EWhat this means for landing on vacuum worlds:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nNo more messing around with ground-level maneuver nodes to figure out when to start your retro-burn.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cstrong\u003EWhat this means for target rendezvous:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nIf you can set up a rendezvous that will take you within 10 km of the target, you\u0027ll see an estimated time-until-closest-approach, and an estimated burn time to match velocity with the target.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cstrong\u003EWhat this means for setting up communications networks:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nIt\u0027s really easy to set up synchronous satellites (either geosynchronous, or synchronous with each other).\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cbr\u003E\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cstrong\u003E\u003Ca href=\u0022http://spacedock.info/mod/21/BetterBurnTime\u0022 rel=\u0022external nofollow\u0022\u003EDownload from SpaceDock\u003C/a\u003E\u003C/strong\u003E\u003C/span\u003E\u003Cbr\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003ELicense: \u003Ca href=\u0022https://creativecommons.org/licenses/by-nc-nd/4.0/\u0022 rel=\u0022external nofollow\u0022\u003ECC-BY-NC-ND 4.0\u003C/a\u003E\u003C/span\u003E\u003Cbr\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E\u003Ca href=\u0022https://github.com/KSPSnark/BetterBurnTime\u0022 rel=\u0022external nofollow\u0022\u003ESource code\u003C/a\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022impact.png\u0022 class=\u0022ipsImage\u0022 height=\u0022198\u0022 width=\u0022296\u0022 src=\u0022https://raw.githubusercontent.com/KSPSnark/BetterBurnTime/master/screenshots/impact.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cspan style=\u0022font-size:20px;\u0022\u003E\u003Cstrong\u003ENotes\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cstrong\u003EThe \u0022countdown\u0022 indicator\u003C/strong\u003E\u003C/span\u003E\u003Cbr\u003E\nFor closest-approach, the mod displays a \u0022countdown\u0022 indicator. This is a little row of green dots, immediately below the estimated burn time. This row of dots counts down until it\u0027s time to start your burn: when the last dot disappears, start the burn.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022countdown.png\u0022 class=\u0022ipsImage\u0022 src=\u0022https://raw.githubusercontent.com/KSPSnark/BetterBurnTime/master/screenshots/countdown.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe display is logarithmic.  The last three (biggest, leftmost) dots are in seconds:  3, 2, 1, go.  After the first three dots, it\u0027s 5 seconds, 10 seconds, 15 seconds, then it doubles for each dot after that.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ENote:\u003C/strong\u003E No countdown indicator is currently shown for the \u0022time to impact\u0022 indicator; this is because \u0022when should I start?\u0022 is more complex, depending on a lot of factors including your descent angle, \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003E\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E\u003C/abbr\u003E, etc.  This feature may eventually be added, but until then, you\u0027re on your own.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you don\u0027t like this indicator, you can do any of the following (see \u003Ca href=\u0022http://spacedock.info/mod/21/BetterBurnTime\u0022 rel=\u0022external nofollow\u0022\u003Emod page on SpaceDock\u003C/a\u003E for details):\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nCustomize its appearance\n\u003C/li\u003E\n\u003Cli\u003E\nMake it numeric rather than graphic (e.g. \u0022Start burn in 43s\u0022 or \u0022Burn-43s\u0022 or however you like)\n\u003C/li\u003E\n\u003Cli\u003E\nTurn it off completely\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cstrong\u003EThe \u0022insufficient fuel\u0022 warning\u003C/strong\u003E\u003C/span\u003E\u003Cbr\u003E\u003Cbr\u003E\nNormally, the mod displays estimated burn time like this (48 seconds in this example):\u003Cbr\u003E\u003Cstrong\u003EEst. Burn: 48s\u003C/strong\u003E\u003Cbr\u003E\nIf the mod decides that you don\u0027t have enough \u003Cabbr title=\u0022Delta-V\u0022\u003E\u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E\u003C/abbr\u003E to do the specified burn, it will display the time like this instead:\u003Cbr\u003E\u003Cstrong\u003EEst. Burn: (~48s)\u003C/strong\u003E\u003Cbr\u003E\nNote that it won\u0027t do this if you have the \u0022infinite fuel\u0022 cheat turned on (since then you always have enough \u003Cabbr title=\u0022Delta-V\u0022\u003E\u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E\u003C/abbr\u003E!)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cstrong\u003EThe time-to-impact indicator\u003C/strong\u003E\u003C/span\u003E\u003Cbr\u003E\nUnder the right circumstances, the mod will display a \u0022time until impact\u0022 indicator (instead of \u0022time until maneuver\u0022), along with an estimated burn time which is how long your engine would need to kill your velocity at ground level.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022impact.png\u0022 class=\u0022ipsImage\u0022 src=\u0022https://raw.githubusercontent.com/KSPSnark/BetterBurnTime/master/screenshots/impact.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAll of the following conditions must be met for this indicator to be displayed:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nThe impact tracker isn\u0027t disabled via settings (see \u0022Settings\u0022, below)\n\u003C/li\u003E\n\u003Cli\u003E\nThe planet/moon whose \u003Cabbr title=\u0022Sphere of Influence\u0022\u003E\u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESoI\u003C/abbr\u003E\u003C/abbr\u003E you\u0027re in has no atmosphere.  (Someday I may release an update to enable the impact indicator when it\u0027s in atmosphere, but not right now.  It gets ugly and would significantly complicate the calculations.)\n\u003C/li\u003E\n\u003Cli\u003E\nYou\u0027re on a trajectory that intersects the surface.\n\u003C/li\u003E\n\u003Cli\u003E\nYou\u0027re falling by at least 2 m/s.\n\u003C/li\u003E\n\u003Cli\u003E\nThe time of impact is no more than 120 seconds away (though you can tweak this with settings, see below).\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nNote that the time-to-impact is based on the assumption that you don\u0027t do a retro-burn and just coast to your doom.  So if you\u0027re figuring out \u0022when do I start my retro-burn to land,\u0022 you\u0027ll generally want to wait a little bit after the point at which time-to-impact equals estimated burn time.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cstrong\u003EThe time-to-closest-approach indicator\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nUnder the right circumstances, the mod will display a \u0022time until closest approach\u0022 indicator (instead of \u0022time until maneuver\u0022), along with an estimated burn time to match velocity with the target.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022approach.png\u0022 class=\u0022ipsImage\u0022 src=\u0022https://raw.githubusercontent.com/KSPSnark/BetterBurnTime/master/screenshots/approach.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAll of the following conditions must be met for this indicator to be displayed:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nThe approach tracker isn\u0027t disabled via settings (see \u0022Settings\u0022, below)\n\u003C/li\u003E\n\u003Cli\u003E\nYou don\u0027t have a maneuver node set\n\u003C/li\u003E\n\u003Cli\u003E\nThe impact tracker (see above) isn\u0027t displaying time-to-impact\n\u003C/li\u003E\n\u003Cli\u003E\nYou have a target, which is a vessel (e.g. not a planet)\n\u003C/li\u003E\n\u003Cli\u003E\nNeither you nor your target is landed\n\u003C/li\u003E\n\u003Cli\u003E\nYou have an upcoming approach within 10 km distance\n\u003C/li\u003E\n\u003Cli\u003E\nThe closest approach is no more than 15 minutes from now\n\u003C/li\u003E\n\u003Cli\u003E\nYou\u0027re not within 200 meters of the target and going under 10 m/s, or within 400 meters and going under 1 m/s\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nTo slow your craft to a halt when it\u0027s close to the target, you should start your burn when the time-until-closest-approach is about half of the estimated burn time shown.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cstrong\u003EThe time-to-atmosphere indicator\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIf you\u0027re imminently about to enter or exit atmosphere, it shows time remaining.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022atmosphere.png\u0022 class=\u0022ipsImage\u0022 src=\u0022https://raw.githubusercontent.com/KSPSnark/BetterBurnTime/master/screenshots/atmosphere.png\u0022\u003E\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nThe atmosphere tracker only shows time until transition (there\u0027s no burn time or countdown dots).\n\u003C/li\u003E\n\u003Cli\u003E\nNote that for time-until-exit, it assumes a ballistic trajectory and makes \u003Cem\u003E\u003Cu\u003Eno attempt whatsoever\u003C/u\u003E\u003C/em\u003E to account for drag.\n\u003C/li\u003E\n\u003Cli\u003E\nThere are config options for this feature in config.xml. If you don\u0027t like the default behavior, you can adjust how far ahead of time it displays the warning, or turn the feature off completely if you prefer.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cstrong\u003EThe synchrony tracker\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIf you\u0027re in orbit, and you\u0027re reasonably close to being in synchronous orbit around the current celestial body, the mod will display a \u0022geosynchrony tracker\u0022 that shows how close you are to perfect geosync.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022geosync.png\u0022 class=\u0022ipsImage\u0022 height=\u0022200\u0022 width=\u0022298\u0022 src=\u0022https://raw.githubusercontent.com/KSPSnark/BetterBurnTime/master/screenshots/geosync.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe tracker displays a time delta (positive or negative) showing how far off your current orbital period is from perfect geosynchrony. It shows hours/minutes/seconds until you get within 10 seconds, then switches to milliseconds display. \u003Cspan style=\u0022font-size:11px;\u0022\u003E(The transition point is configurable, see below.)\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIf you\u0027re in orbit and you have a \u003Cu\u003E\u003Cem\u003Etarget\u003C/em\u003E\u003C/u\u003E, then you get a \u0022target synchrony\u0022 indicator, that works the same as the geosynchrony one, but shows time delta relative to target rather than relative to the celestial body\u0027s rotation period.\n\u003C/p\u003E\n\u003Cp\u003E\nThis makes it easy to put satellites in synchronous orbit. If the value is negative, thrust \u003Cimg alt=\u0022:prograde:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/prograde3.png\u0022 title=\u0022:prograde:\u0022\u003E; if positive, thrust \u003Cimg alt=\u0022:retrograde:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/retrograde2.png\u0022 title=\u0022:retrograde:\u0022\u003E. Goal is to get as close to zero as possible, for synchronous orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nAll of the following conditions must be met for this indicator to be displayed:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nNo other tracker is currently active.\n\u003C/li\u003E\n\u003Cli\u003E\nYou\u0027re in a stable orbit \u003Cspan style=\u0022font-size:11px;\u0022\u003E(e.g. not suborbital or escaping)\u003C/span\u003E.\n\u003C/li\u003E\n\u003Cli\u003E\nThe period of your current orbit is within 5% of the current celestial body\u0027s rotation period \u003Cspan style=\u0022font-size:11px;\u0022\u003E(this is configurable, see below)\u003C/span\u003E.\n\u003C/li\u003E\n\u003Cli\u003E\nYour ship has been \u0022idle\u0022 (defined as, no throttle and no control inputs) for less than 10 seconds \u003Cspan style=\u0022font-size:11px;\u0022\u003E(this is configurable, see below)\u003C/span\u003E.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nIn addition, this tracker also supports an \u003Cstrong\u003E\u003Cspan style=\u0022background-color:#ffff00;\u0022\u003Eoverride key\u003C/span\u003E\u003C/strong\u003E that allows \u003Cstrong\u003Emanually forcing it to display\u003C/strong\u003E, even if the above conditions aren\u0027t met, as long as no other tracker is active. By default, the override key is the \u003Cstrong\u003Eright Ctrl key\u003C/strong\u003E \u003Cspan style=\u0022font-size:11px;\u0022\u003E(this can be changed via config)\u003C/span\u003E. Also, by default, the override is only active while you\u0027re actually holding the key down; however, there\u0027s a config setting that lets you make it \u0022sticky\u0022 (i.e. press once to turn on, press a second time to turn off).\n\u003C/p\u003E\n\u003Cp\u003E\nWhen the override key is active and you\u0027re not currently in a stable orbit, it will just say \u003Cstrong\u003Egsync ~\u003C/strong\u003E.  If the override key is active and geosynchronous orbit is actually impossible for the current celestial body (because the needed altitude would be outside the \u003Cabbr title=\u0022Sphere of Influence\u0022\u003E\u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESoI\u003C/abbr\u003E\u003C/abbr\u003E), then it will say \u003Cstrong\u003Egsync X\u003C/strong\u003E.  (These are only shown when the override is active, since if it isn\u0027t, in this case the tracker\u0027s not shown at all.)\n\u003C/p\u003E\n\u003Cp\u003E\nSee the \u0022How to configure\u0022 section below for a list of these configuration settings.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cstrong\u003EThe \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003E\u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E\u003C/abbr\u003E burn-time indicator\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nSRBs display their burn time, in the following places:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nOn the tooltip in the parts pane in the editor\n\u003C/li\u003E\n\u003Cli\u003E\nOn the part\u0027s right-click menu (in the editor)\n\u003C/li\u003E\n\u003Cli\u003E\nOn the part\u0027s right-click menu (in flight)\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cimg alt=\u0022srb.png\u0022 class=\u0022ipsImage\u0022 height=\u0022420\u0022 width=\u0022819\u0022 src=\u0022https://raw.githubusercontent.com/KSPSnark/BetterBurnTime/master/screenshots/srb.png\u0022\u003E\u003Cbr\u003E\u003Cspan style=\u0022font-size:9px;\u0022\u003E(Note that the burn time calculation takes thrust limiter into account.)\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cstrong\u003ECaveats\u003C/strong\u003E\u003C/span\u003E\u003Cbr\u003E\u003Cbr\u003E\nA few things to know about how the mod works. Summary presented here; please see the \u003Ca href=\u0022https://github.com/KSPSnark/BetterBurnTime/blob/master/README.md\u0022 rel=\u0022external nofollow\u0022\u003EREADME\u003C/a\u003E for full details.\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nIt doesn\u0027t know about staging. It assumes that all fuel will be consumed by your current stage. Therefore, the burn time estimate and \u003Cabbr title=\u0022Delta-V\u0022\u003E\u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E\u003C/abbr\u003E warning indicator may be inaccurate if you\u0027re going to be staging in the middle of the burn. (After you stage, though, it will immediately update itself.)\n\u003C/li\u003E\n\u003Cli\u003E\nIt doesn\u0027t know about fuel flow. It assumes that all your fuel will be available to all your engines throughout the burn. Therefore, if any of your engines are going to run dry before others during the burn, the time estimate will be optimistic. (After the engines run dry, though, it will immediately update itself.)\n\u003C/li\u003E\n\u003Cli\u003E\nIt ignores electrical supply, so make sure your ion engine has enough power.\n\u003C/li\u003E\n\u003Cli\u003E\nTime to impact is very simplistic. It looks at the elevation directly under the ship, and at your current vertical speed.  It corrects for the acceleration of gravity, but nothing else.  This means that if you\u0027re flying over rough terrain, the time-to-impact indicator will be irregular (it will suddenly get shorter when you\u0027re flying over an ascending slope, or longer when you\u0027re flying over a descending slope).  If you\u0027re hurtling horizontally and about to smack into the side of a mountain range looming up in front of you, the mod has no clue.  Be warned.\n\u003C/li\u003E\n\u003Cli\u003E\nThe time-to-impact estimate takes into account your current velocity and the acceleration of gravity, and that\u0027s it.  It deliberately does \u003Cu\u003E\u003Cem\u003Enot\u003C/em\u003E\u003C/u\u003E take into account the acceleration of your engines, if you\u0027re firing them.  It\u0027s an estimate of \u0022how long would I take to smash into the ground if I turned off all my engines.\u0022  So when you\u0027re retro-burning to land, the actual time to reach the ground will be \u003Cu\u003E\u003Cem\u003Elonger\u003C/em\u003E\u003C/u\u003E than the displayed estimate, depending on things such as your \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003E\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E\u003C/abbr\u003E, throttle setting, angle of approach, etc.  So if you want to time your burn so that you reach zero velocity right when you get to ground level, you\u0027ll need to wait a little bit past the point where the estimated time to impact equals the estimated burn time.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cstrong\u003EHow to configure\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAfter the first time you run KSP with the mod installed, there will be a configuration file located at under this location in your KSP folder, which you can edit to adjust settings:\n\u003C/p\u003E\n\u003Cp\u003E\nGameData/BetterBurnTime/PluginData/BetterBurnTime/config.xml\n\u003C/p\u003E\n\u003Cp\u003E\nSpecific settings listed in spoiler.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cul\u003E\u003Cli\u003E\n\u003Cstrong\u003EUseSimpleAcceleration:\u003C/strong\u003E By default, this is set to 0, meaning that the mod will use complex acceleration in its calculations.  If you set it to 1, then you will force the mod to use simple acceleration for all its calculations all the time.\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EOverrideKey:\u003C/strong\u003E Defaults to \u0022right ctrl\u0022. Sets which key is used to toggle BetterBurnTime\u0027s \u0022override\u0022 behavior (e.g. for geosynchrony tracker). See \u003Ca href=\u0022https://docs.unity3d.com/Manual/ConventionalGameInput.html\u0022 rel=\u0022external nofollow\u0022\u003EUnity documentation\u003C/a\u003E for allowable values.\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EStickyOverride:\u003C/strong\u003E Defaults to 0, meaning that the override key is only active while you\u0027re holding it down. Set to 1 if you want it to be \u0022press once to turn on, press a second time to turn off\u0022.\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EShowImpactTracker:\u003C/strong\u003E By default, this is set to 1.  If you set it to 0, then you will disable the \u0022time to impact\u0022 display.\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EMaxTimeToImpact:\u003C/strong\u003E This is the maximum time, in seconds, that the impact tracker will predict a collision with terrain.  By default, it\u0027s 120 (two minutes). You can raise or lower this.  (Has no effect if ShowImpactTracker is set to 0, since then all impact tracking is turned off.)\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EShowClosestApproachTracker:\u003C/strong\u003E By default, this is set to 1. If you set it to 0, then you will disable the \u0022time until closest approach\u0022 display.\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EMaxTimeUntilEncounter:\u003C/strong\u003E This is the maximum time, in seconds, that the closest-approach tracker will predict a closest approach. By default, it\u0027s 900 (fifteen minutes).\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EMaxClosestApproachDistanceKm:\u003C/strong\u003E This is the maximum distance, in kilometers, that a closest approach can be for the closest-approach tracker to show a prediction. By default, it\u0027s 10 km.\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EMinTargetDistanceMeters:\u003C/strong\u003E The target must be at least this many meters away from your ship for the closest-approach tracker to show a prediction. By default, it\u0027s 200 meters.\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EShowAtmosphereTransition:\u003C/strong\u003E  Defaults to 1. Set to 0 if you don\u0027t want to show the atmosphere transition tracker.\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EMaxTimeToAtmosphereExit:\u003C/strong\u003E Max seconds beforehand to display the atmosphere exit warning.  Defaults to 300.\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EMaxTimeToAtmosphereEntry:\u003C/strong\u003E Max seconds beforehand to display the atmosphere entry warning.  Defaults to 900.\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EGeosyncPrecisionLimit:\u003C/strong\u003E Defaults to 0.05, i.e. 5%. This is how close to geosynchronous you need to be before the geosynchrony tracker is displayed (if the override key is inactive). Set to zero if you want to disable the geosync tracker entirely.\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EGeosyncIdleTimeout:\u003C/strong\u003E Defaults to 10 (seconds).  If the ship has been idle for more than this many seconds, the geosynchrony tracker is hidden (if the override key is inactive).\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EGeosyncLabel:\u003C/strong\u003E Defaults to \u0022gsync\u0022. This is the text of the label used on the geosync tracker.\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003ETargetsyncLabel:\u003C/strong\u003E Defaults to \u0022tsync\u0022. This is the text of the label used on the target-sync tracker.\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EGeosyncSecondsTransition:\u003C/strong\u003E Defaults to 10 (seconds). If the geosync-error time displayed is fewer than this many seconds, the display switches to milliseconds.\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EFormatSeconds, etc.:\u003C/strong\u003E Various entries named \u0022Format\u0022 are used for formatting the time display. You can edit these to change the way time is displayed. See the \u003Ca href=\u0022https://msdn.microsoft.com/en-us/library/0c899ak8.aspx\u0022 rel=\u0022external nofollow\u0022\u003E.NET numeric formatting rules\u003C/a\u003E for details.\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003ECountdownText:\u003C/strong\u003E This string is used for displaying the \u0022countdown\u0022 indicator. You can customize this to suit yourself, just be sure to separate the \u0022pips\u0022 with whitespace.\n\u003Cul\u003E\u003Cli\u003E\nTo make it display a numeric value rather than a graphic string of \u0022pips\u0022, just include \u0022{0}\u0022 in the string. For example: \u0022Start burn in {0}\u0022\n\u003C/li\u003E\n\u003Cli\u003E\nTo turn off the countdown indicator completely, set this to an empty string.\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003ECountdownTimes:\u003C/strong\u003E This string is a comma-delimited list of threshold times (in seconds) for displaying the number of pips in the countdown indicator. (Ignored if you\u0027re using a numeric countdown.)\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cstrong\u003EA historical note\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe original impetus for this mod was actually something that no longer is part of the mod! Before KSP 1.5, the stock burn-time indicator for maneuver nodes was... suboptimal. It had a variety of shortcomings that made it less useful than it could have been.\n\u003C/p\u003E\n\u003Cp\u003E\nBetterBurnTime was originally created to address those shortcomings and make the navball\u0027s burn-time indicator \u0022just work better\u0022. That was the original purpose; that was originally the \u003Cem\u003Eonly\u003C/em\u003E thing that the mod did.\n\u003C/p\u003E\n\u003Cp\u003E\nOver time, I added some additional handy functions-- the landing, rendezvous, and atmosphere-transition information.\n\u003C/p\u003E\n\u003Cp\u003E\nThen, KSP 1.5 drastically improved the stock navball, and basically did all the improvements that BetterBurnTime was originally created to do. Yay! So that\u0027s stock now, which means I removed that functionality from BetterBurnTime after KSP 1.5.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, the additional functions are still convenient, and still not in stock, so those remain-- and are now what BetterBurnTime is about, since its original purpose (maneuver nodes) has become moot.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you\u0027re running a pre-1.5 version of KSP and want better navball functionality, you can run BetterBurnTime 1.6.1 and get the enhanced maneuver-node functionality.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cstrong\u003EAcknowledgments\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cspan\u003EThanks to \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/156531-fullmetalmachinist/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022156531\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/156531-fullmetalmachinist/\u0022 rel=\u0022\u0022\u003E@FullMetalMachinist\u003C/a\u003E for the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/126111-105-betterburntime-v12-accurate-burn-time-indicator-on-navball-no-more-na/\u0026amp;page=4#comment-2422659\u0022 rel=\u0022\u0022\u003Eexcellent suggestion\u003C/a\u003E of using a row of dots to show the countdown-to-start-burn.  Ask and ye shall receive!  Thanks also to \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/144882-gen-jack-d-ripper/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022144882\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/144882-gen-jack-d-ripper/\u0022 rel=\u0022\u0022\u003E@Gen. Jack D. Ripper\u003C/a\u003E for usability suggestions on the countdown timer\u0027s appearance.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"kivech","CreatedById":69612,"CreatedDateTime":"2015-11-21T23:31:32Z","Content":"\nNice, downloading now.\n"},{"CreatedByName":"HoloYolo","CreatedById":138353,"CreatedDateTime":"2015-11-21T23:44:50Z","Content":"\nTake my rep! Finally, an accurate way to see burn times!\n"},{"CreatedByName":"Hotaru","CreatedById":135669,"CreatedDateTime":"2015-11-21T23:47:39Z","Content":"\nCool, that\u0026#39;s always bugged me about the stock indicator. Will definitely give this mod a try, thanks!\n"},{"CreatedByName":"Waxing_Kibbous","CreatedById":151611,"CreatedDateTime":"2015-11-22T00:31:09Z","Content":"\nWow, you\u0026#39;re a hero for this. I\u0026#39;m liking this trend of micro-mods Snark :D\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2015-11-22T00:38:50Z","Content":"\n\u003Cp\u003E\nFunny, I was just thinking about this today. “What if I plug in the dv into the rocket equation with the current mass as the starting point, then I know the mass at the end of the burn, and the difference is divided by the fuel flow. I\u0027d get the burn time fairly accurate, every time”\u003Cbr\u003E\u003Cbr\u003E\nI\u0027m clueless about making mods, so thanks for reading my mind. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-12-25T03:44:57Z\u0022 title=\u002212/25/2015 03:44  AM\u0022 data-short=\u00228 yr\u0022\u003EDecember 25, 2015\u003C/time\u003E by Kerbart\u003C/strong\u003E\n\u003Cbr\u003ERemoved forum migration ickies\n\u003C/span\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-11-22T00:49:53Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222291505\u0022 data-ipsquote-contentid=\u0022126111\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221448152269\u0022 data-ipsquote-userid=\u0022151611\u0022 data-ipsquote-username=\u0022Waxing_Kibbous\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 11/21/2015 at 7:31 PM, Waxing_Kibbous said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWow, you\u0027re a hero for this. I\u0027m liking this trend of micro-mods Snark \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nThanks. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\nI\u0027m a big fan of \u003Ca href=\u0022https://en.wikipedia.org/wiki/KISS_principle\u0022 rel=\u0022external nofollow\u0022\u003EKISS\u003C/a\u003E. I\u0027m also a big fan of minimalist mods that are unintrusive to gameplay experience and avoid adding UI complexity or taking screen real estate. This mod probably has the highest ratio of \u0022hours spent coding/debugging per pixel affected\u0022 of anything I\u0027ve worked on. \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\nMy own personal micro-mod hero is the author of \u003Cstrong\u003ENavball Docking Alignment Indicator\u003C/strong\u003E:\n\u003C/p\u003E\n\u003Ciframe data-embedcontent=\u0022\u0022 frameborder=\u00220\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/137648-11-navball-docking-alignment-indicator-community-edition/\u0026amp;do=embed\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\nAside from the incredible usefulness of the mod, I love its Zen-like simplicity. Zero UI to futz with. Zero screen real estate. It just adds a little icon to the navball, automatically, and only when it\u0027s needed. Hats off. \u003Cu\u003E\u003Cem\u003EThat\u003C/em\u003E\u003C/u\u003E is the ideal I strive for.\u003Cbr\u003E\u003Cbr\u003E\nJust for comparison, I like this far more than the other popular docking aid I see referenced a lot, NavyFish\u0027s \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/40423-11-docking-port-alignment-indicator-version-64-updated-05112016/\u0022 rel=\u0022\u0022\u003EDocking Port Alignment Indicator\u003C/a\u003E, because the latter adds UI and takes up screen space. I find it interesting that the one I don\u0027t like is four times more popular in terms of download count than the one I like, no idea why.\u003Cbr\u003E\u003Cbr\u003E\nAnyway, thank you, it\u0027s nice to feel appreciated!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:9px;\u0022\u003E(Update, May 2016:  Fixed formatting, and replaced broken links to now-defunct hosting site.  Went in and updated it because someone just quoted this post in the thread.)\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-11-22T01:23:09Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222291515\u0022 data-ipsquote-contentid=\u0022126111\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221448152730\u0022 data-ipsquote-userid=\u002278303\u0022 data-ipsquote-username=\u0022Kerbart\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 11/22/2015 at 4:38 PM, Kerbart said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nFunny, I was just thinking about this today. “What if I plug in the dv into the rocket equation with the current mass as the starting point, then I know the mass at the end of the burn, and the difference is divided by the fuel flow. I\u0027d get the burn time fairly accurate, every time”\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nThat was pretty much my own thought process, too. This has bugged me since I first started playing KSP. It seemed like such a simple thing to fix; I mean, heck, it\u0027s not rocket sci-- Oh. Well, okay, but it\u0027s not that \u003Cem\u003Ecomplicated\u003C/em\u003E, thought I. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\nAnyway, once I started diving into the details, it was a bit more complicated than I had anticipated, mainly because the problem seems so simple that it\u0027s easy to miss the edge cases, of which there turn out to be lots.\u003Cbr\u003E\u003Cbr\u003E\nHere are the edge cases I ran up against, and what I do about them:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nWhat if not enough fuel? Do the \u0022real\u0022 calculation for the fueled part of the burn, then assume constant acceleration (at the empty mass) for the remainder.\n\u003C/li\u003E\n\u003Cli\u003E\nWhat if propellants are mismatched (e.g. running out of O before LF)? Figure out how much burn time is available for each one and pick the shortest.\n\u003C/li\u003E\n\u003Cli\u003E\nWhat if the engines aren\u0027t all pointing in the same direction? Take the vector sum of their thrusts when computing acceleration.\n\u003C/li\u003E\n\u003Cli\u003E\nWhat if the engines have different Isp from each other? Combine them appropriately.\n\u003C/li\u003E\n\u003Cli\u003E\nWhat about staging? Don\u0027t try to predict it, just publish a caveat. \u003Cimg alt=\u0022:blush:\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 title=\u0022:blush:\u0022\u003E\u003C/li\u003E\n\u003Cli\u003E\nWhat about fuel flow causing one engine to run dry before others? Ditto.\n\u003C/li\u003E\n\u003Cli\u003E\nWhat about electricity? Just ignore it.\n\u003C/li\u003E\n\u003Cli\u003E\nWhat if the \u0022infinite fuel\u0022 cheat is on? Dumb it down to simple constant acceleration.\n\u003C/li\u003E\n\u003Cli\u003E\nWhat about thrust limiters? Deal with \u0027em.\n\u003C/li\u003E\n\u003Cli\u003E\n...that\u0027s all I can remember off the top of my head, but you get the idea.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222291515\u0022 data-ipsquote-contentid=\u0022126111\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221448152730\u0022 data-ipsquote-userid=\u002278303\u0022 data-ipsquote-username=\u0022Kerbart\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 11/22/2015 at 4:38 PM, Kerbart said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027m clueless about making mods, so thanks for reading my mind. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHeh, quite welcome.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nFYI: as long as you know programming and C#, it turns out that modding KSP is ridiculously easy. Why the \u003Cem\u003Edickens\u003C/em\u003E didn\u0027t I start this sooner? Never took the plunge until a week ago, on the assumption that the learning curve would be really time-consuming. Turns out to be easy to jump right in. And my goodness, Visual Studio is even free to download these days. (When the heck did \u003Cem\u003Ethat\u003C/em\u003E happen?) I was very pleasantly surprised. It\u0027s a combination of Squad making a very mod-friendly design (kudos for that!), and .NET\u0027s being really nice to program with. Just start a new C# library, add a reference to the KSP assembly and Unity, and you\u0027re off to the races.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-02-24T16:18:58Z\u0022 title=\u002202/24/2016 04:18  PM\u0022 data-short=\u00228 yr\u0022\u003EFebruary 24, 2016\u003C/time\u003E by Snark\u003C/strong\u003E\n\u003Cbr\u003Efixed formatting for compatibility with new forum software\n\u003C/span\u003E\n"},{"CreatedByName":"bgeery","CreatedById":128020,"CreatedDateTime":"2015-11-22T01:25:21Z","Content":"\nKerbal Engineer has no problem calculating with staging needed mid-burn, so hopefully you can add that feature to your mod as well. Still, a big improvement over the stock functionality.\n"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2015-11-22T01:46:16Z","Content":"\n[quote name=\u0027bgeery\u0027]Kerbal Engineer has no problem calculating with staging needed mid-burn, so hopefully you can add that feature to your mod as well. Still, a big improvement over the stock functionality.[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nThat\u0026#39;s because Engineer has an extremely complex fuel flow simulation running. So it can figure out how much dV you have in each stage, how many engines in each stage, etc...\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-11-22T01:57:44Z","Content":"\n\u003Cp\u003E\n\u003Cspan\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222291562\u0022 data-ipsquote-contentid=\u0022126111\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221448155521\u0022 data-ipsquote-userid=\u0022128020\u0022 data-ipsquote-username=\u0022bgeery\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 11/21/2015 at 5:25 PM, bgeery said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nKerbal Engineer has no problem calculating with staging needed mid-burn, so hopefully you can add that feature to your mod as well. Still, a big improvement over the stock functionality.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Cspan\u003E\u003C/span\u003E\u003Cbr\u003E\nI was wondering how long it would be until someone mentioned \u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKER\u003C/abbr\u003E. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\nYes, it\u0027s possible to do that. I thought about it, I\u0027d love to handle it. However, having thought it through, I made a conscious decision not to, and that decision is unlikely to change.\u003Cbr\u003E\u003Cbr\u003E\nFirst things first: \u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKER\u003C/abbr\u003E is a very big, complex mod. Go look at its \u003Ca href=\u0022https://github.com/CYBUTEK/KerbalEngineer\u0022 rel=\u0022external nofollow\u0022\u003EGitHub repository\u003C/a\u003E sometime... then go compare it to \u003Ca href=\u0022https://github.com/KSPSnark/BetterBurnTime\u0022 rel=\u0022external nofollow\u0022\u003Emy own mod\u003C/a\u003E, which lives in a teeny-tiny fraction of the amount of code and has no UI at all. \u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKER\u003C/abbr\u003E is at least 10 times the size of my mod, it\u0027s a massive tour de force. Not gonna try to compete with that. I have not the slightest intention of trying to solve the problems that \u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKER\u003C/abbr\u003E does. It\u0027s already been there and done that, no need to reinvent the wheel. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\nAlso: The staging problem is non-trivial. It\u0027s a massive jump in complexity. What you have in your head is undoubtedly the simple case of \u0022I have one engine below one tank, and then a decoupler above that, and then another engine with another tank.\u0022 \u003Cem\u003EThat\u003C/em\u003E would be simple to code. But KSP allows building rockets in all kinds of ways, and by the time you add fuel flow paths through ducts and so on and so forth, it becomes quite complex.\u003Cbr\u003E\u003Cbr\u003E\nSolving that one problem is something I could do. However, not only has \u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKER\u003C/abbr\u003E already solved it, but I would spend considerably more time on it that on the entire rest of the mod put together. It would be a lot of effort expended to handle one particular scenario... and I have other mods I\u0027d rather write in the meantime. \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\nPlus, there\u0027s a philosophical issue here: Once you start introducing staging and such, it starts to get into the realm of uncertainty that a mod \u003Cem\u003Ecan\u0027t\u003C/em\u003E resolve without UI to get input from the player. For example, suppose there are some drop tanks... do you know \u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cem\u003Ewhen\u003C/em\u003E\u003C/span\u003E the player intends to drop them? It won\u0027t necessarily be right when they run out of fuel. Maybe the player wants to tote those empty tanks to Mun orbit to fill them up before heading off to Eeloo.\u003Cbr\u003E\u003Cbr\u003E\nOne way to solve that problem is to go the route of \u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKER\u003C/abbr\u003E, which has not only a lot of logic under the hood, but also tons of UI. The player can make lots of decisions and tell the mod what to do.\u003Cbr\u003E\u003Cbr\u003E\nHowever, I don\u0027t want to do that. I like (and therefore want to write) mods that have the bare minimum of UI-- none, if possible. I\u0027ve deliberately designed this mod so that it doesn\u0027t require any interaction at all: you just install it and it silently and automatically makes your game experience better. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E That does mean that any decision point that would require player input is going to be an issue. I choose to deal with that by not dealing with it: I deliberately limit the scope of the mod to only solve problems for which there is one obvious correct answer.\u003Cbr\u003E\u003Cbr\u003E\nIf the player wants something fancier, then there\u0027s \u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKER\u003C/abbr\u003E happily waiting for them.\n\u003C/p\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2015-11-22T02:09:02Z","Content":"\n[quote name=\u0027Snark\u0027](...)\u003Cbr\u003E\nHere are the edge cases I ran up against, and what I do about them:\u003Cbr\u003E\n[LIST]\u003Cbr\u003E\n[*]...\u003Cbr\u003E\n[*]...\u003Cbr\u003E\n[*]...that\u0026#39;s all I can remember off the top of my head, but you get the idea.\u003Cbr\u003E\n[/LIST]\u003Cbr\u003E\n(...)[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nThat\u0026#39;s a lot more than I would think of. As mentioned in other posts, yes, you can build some that takes [I]every[/I] case into consideration and rebuild half of KER, but even with the \u0022no staging\u0022 (and that would add an amount of complexity I\u0026#39;d rather not think of) this is already [I]way[/I] more accurate than the stock indicator.\u003Cbr\u003E\n\u003Cbr\u003E\nAs for the simplicity of modding... I guess I\u0026#39;ll have to try it one day. For now I\u0026#39;m happy as a pig in the mud writing scripts for kRPC. :)\n"},{"CreatedByName":"Waxing_Kibbous","CreatedById":151611,"CreatedDateTime":"2015-11-22T02:10:20Z","Content":"\nI may be imagining things, but I noticed when throttling an engine down via right-click on the engine the est. burn time increased accordingly, nice that that works as planned. This is a good mod for beginners IMO, one of my early frustrations was the lack of a burn time readout which seemed to happen on a pretty regular basis. I agree with the KER comparison, this is a nice simple readout that\u0026#39;s good for many cases.\n"},{"CreatedByName":"bgeery","CreatedById":128020,"CreatedDateTime":"2015-11-22T02:58:04Z","Content":"\n[quote name=\u0027DMagic\u0027]That\u0026#39;s because Engineer has an extremely complex fuel flow simulation running. So it can figure out how much dV you have in each stage, how many engines in each stage, etc...[/QUOTE]Maybe you can get the numbers from Engineer if it\u0026#39;s installed and just display them? Or perhaps use the code yourself in your mod (it\u0026#39;s licensed GNU v3); why reinvent the wheel? Anyway, just thinking out loud.\u003Cbr\u003E\n\u003Cbr\u003E\nPS: didn\u0026#39;t see your longer reply until after I replied.\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-22T03:01:49Z\u0022 title=\u002211/22/2015 03:01  AM\u0022 data-short=\u00228 yr\u0022\u003ENovember 22, 2015\u003C/time\u003E by bgeery\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-11-22T03:07:19Z","Content":"\n[quote name=\u0027Waxing_Kibbous\u0027]I may be imagining things, but I noticed when throttling an engine down via right-click on the engine the est. burn time increased accordingly, nice that that works as planned. This is a good mod for beginners IMO, one of my early frustrations was the lack of a burn time readout which seemed to happen on a pretty regular basis. I agree with the KER comparison, this is a nice simple readout that\u0026#39;s good for many cases.[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nIf you mean throttling by adjusting the thrust limiter on the engine: yes, it handles that! :)\u003Cbr\u003E\n\u003Cbr\u003E\nI had fun during my testing by building a pushmi-pullyu ship that was basically just a fuel tank with a Terrier at each end, pointing in opposite directions. Set one of them to, say, 50% with the thrust limiter, then have fun watching the burn time shoot up and down as I slide the other one above and below 50%.\n"},{"CreatedByName":"X40c","CreatedById":1253,"CreatedDateTime":"2015-11-22T03:23:49Z","Content":"\nDoes this support more complicated modded engines, like the ones from KSPI? The one thing the vanilla brurntime indicator had going for it, was that it could sometimes give you an inkling about engines that MechJeb or Engineer weren\u0026#39;t able to.\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-11-22T03:33:19Z","Content":"\n[quote name=\u0027X40c\u0027]Does this support more complicated modded engines, like the ones from KSPI? The one thing the vanilla brurntime indicator had going for it, was that it could sometimes give you an inkling about engines that MechJeb or Engineer weren\u0026#39;t able to.[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nThe mod has no custom support for any mod, and I have never run KSPI, so I don\u0026#39;t know the answer without knowing something about how their engines work.\u003Cbr\u003E\n\u003Cbr\u003E\nThat said, I wrote it as generically as possible. It queries the ship for all its engines, asks the engines about their propellant requirements, scans the ship for a tally of how much of those propellants are on board. Any engine that works basically like a stock engine does (\u0022I have a thrust amount, I have an ISP, I require the following propellants carried on board in order to work\u0022) ought to be fine.\u003Cbr\u003E\n\u003Cbr\u003E\nThough if KER and MechJeb stub their toes, that would be a pretty tough act to follow.\u003Cbr\u003E\n\u003Cbr\u003E\nWhat\u0026#39;s so special about the engines in KSPI?\n"},{"CreatedByName":"X40c","CreatedById":1253,"CreatedDateTime":"2015-11-22T04:31:40Z","Content":"\n[quote name=\u0027Snark\u0027]The mod has no custom support for any mod, and I have never run KSPI, so I don\u0026#39;t know the answer without knowing something about how their engines work.\u003Cbr\u003E\n\u003Cbr\u003E\nThat said, I wrote it as generically as possible. It queries the ship for all its engines, asks the engines about their propellant requirements, scans the ship for a tally of how much of those propellants are on board. Any engine that works basically like a stock engine does (\u0022I have a thrust amount, I have an ISP, I require the following propellants carried on board in order to work\u0022) ought to be fine.\u003Cbr\u003E\n\u003Cbr\u003E\nThough if KER and MechJeb stub their toes, that would be a pretty tough act to follow.\u003Cbr\u003E\n\u003Cbr\u003E\nWhat\u0026#39;s so special about the engines in KSPI?[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nVariable thrust and ISP (e.g. lower thrust = higher ISP and vice versa), engine\u0026#39;s that provide near-infinite amount of dV at low thrust as long as they\u0026#39;re powered and of course the whole power system that I don\u0026#39;t really expect to be accounted for. There\u0026#39;s also stuff like soot buildup and what not.\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-11-22T05:37:55Z","Content":"\n[quote name=\u0027X40c\u0027]Variable thrust and ISP (e.g. lower thrust = higher ISP and vice versa), engine\u0026#39;s that provide near-infinite amount of dV at low thrust as long as they\u0026#39;re powered and of course the whole power system that I don\u0026#39;t really expect to be accounted for. There\u0026#39;s also stuff like soot buildup and what not.[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nWell, it depends how it\u0026#39;s implemented. BetterBurnTime has no idea about variable Isp. It just asks the engine \u0022what\u0026#39;s your Isp?\u0022 and goes with that. So depending on how the KSPI engines are implemented and how they answer the question, it might give a wild overestimate or a wild underestimate about the available dV.\u003Cbr\u003E\n\u003Cbr\u003E\nThat said: even in the worst case scenario where it\u0026#39;s terrible, I wrote the mod with a config option (see the README) that tells it to just turn off all dV checking and do a simple burn time calculation based on \u0022time = dV / acceleration\u0022, the same way the stock game models it. So if you turn on that option, you won\u0026#39;t get the extra dV goodness, but at least you\u0026#39;ll still have something that works better than the stock game (i.e. it gets rid of that darn \u0022N/A\u0022).\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-11-23T23:00:24Z","Content":"\nOH FRABJOUS DAY! Thank you Mr. Snark :). This will make doing flotillas SO much easier. No more need to bump the throttles prior to doing a burn node created months in advance :).\n"},{"CreatedByName":"m4ti140","CreatedById":67296,"CreatedDateTime":"2015-11-24T00:23:15Z","Content":"\nThis should be stock. In fact it should be included in stock bug fixes as well. This is effectively a fix for a serious bug that\u0026#39;s been present in KSP for aeons.\n"},{"CreatedByName":"Black-Talon","CreatedById":57463,"CreatedDateTime":"2015-12-06T21:33:08Z","Content":"\n\u003Cp\u003E\nJust discovered this mod and I\u0027m going to give it a try.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m curious about something you might know...I have run into times when the burn actually takes much longer than predicted by the stock estimate that I cannot explain. These are long burns (3 to 4 minutes) with smaller, low thrust, engines (stock engines though, assuming I remember this right). Nothing that\u0027s obvious to me is impacting them. I\u0027m locked onto the maneuver node and burn full throttle for 3 minutes only to discover that another 2 minutes of burn is now expected. No stages or other changes are occurring during the burn. It just slowly doesn\u0027t perform at the expectations of the estimate.\n\u003C/p\u003E\n\u003Cp\u003E\nI haven\u0027t been able to think up an explanation for this. Given you\u0027ve spent some time wrapping your mind around the flaws of the stock Burn Time Indicator, I thought you might have an idea that I have over looked? I\u0027ll let you know if I experience this with your mod, and under what conditions. Otherwise I\u0027m optimistic that it is a thing of the past!\n\u003C/p\u003E\n\u003Cp\u003E\nAs I think about this previous experience I wonder... does this mod do any correction based on actual performance over the last 5 seconds or so? Or is it strictly calculated from the numbers reported? Perhaps my problem was that for whatever reason, the engine just isn\u0027t performing as it\u0027s stats would indicate it should. Still wish I knew why.\n\u003C/p\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2015-12-06T21:42:00Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222311104\u0022 data-ipsquote-contentid=\u0022126111\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221449437588\u0022 data-ipsquote-userid=\u002257463\u0022 data-ipsquote-username=\u0022Black-Talon\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 minutes ago, Black-Talon said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAs I think about this previous experience I wonder... does this mod do any correction based on actual performance over the last 5 seconds or so? Or is it strictly calculated from the numbers reported? Perhaps my problem was that for whatever reason, the engine just isn\u0027t performing as it\u0027s stats would indicate it should. Still wish I knew why.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe mod takes the I\u003Csub\u003Esp\u003C/sub\u003E of the engines used and the fuel consumption, and plugs that into the rocket equation (DV = \u003Cem\u003EI\u003Csub\u003Esp\u003C/sub\u003E×g×ln\u003Csup\u003Em_wet\u003C/sup\u003E\u003C/em\u003E⁄\u003Cem\u003E\u003Csub\u003Em_dry\u003C/sub\u003E), \u003C/em\u003Eso you get (based on the current \u0022wet\u0022 mass) the \u0022dry\u0022 mass required for the DV needed. The difference is the amount of propellant to be used; that\u0027s divided by the mass flow of the propellant and that gets you the time.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Black-Talon","CreatedById":57463,"CreatedDateTime":"2015-12-07T04:11:17Z","Content":"\n\u003Cp\u003E\nAs I suspected. Makes sense, uses the right numbers.\n\u003C/p\u003E\n\u003Cp\u003E\nIf my craft is messing up those numbers, perhaps by having the engines crooked, impeded thrust, or perhaps even other bugs that create wasted thrust, my estimate will of course be wrong.\n\u003C/p\u003E\n\u003Cp\u003E\nIf I see it again I\u0027ll try to figure out what\u0027s going on for real. Thanks!\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-12-08T01:21:18Z","Content":"\n\u003Cp\u003E\nHi all, just posted v1.1.  The main change is that I\u0027ve added an estimated time-of-impact for when you\u0027re approaching the surface of a vacuum world, accompanied by an estimated burn time for killing your velocity at the surface.  It comes with some caveats (see the description in the main thread post), but hopefully it should be helpful for landing on the Mun or other places that don\u0027t have an atmosphere.  No more messing around with a ground-level maneuver node to figure out when to start your suicide burn. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E  Anyway, let me know what you think.\n\u003C/p\u003E\n"}]}