{"TopicId":126374,"ForumId":21,"TopicTitle":"TriStar 1b, 1.0.5 Early Career Mode LKO Shuttle","CreatedByName":"BenCushwa","CreatedById":153724,"CreatedDateTime":"2015-11-24T19:52:56Z","PageNum":1,"Articles":[{"CreatedByName":"BenCushwa","CreatedById":153724,"CreatedDateTime":"2015-11-24T19:52:56Z","Content":"\nSo, here I am, posting my very first ship to the Spacecraft Exchange.\u003Cbr\u003E\n\u003Cbr\u003E\nOne of the new parts I was really excited about in 1.0.5 was the Mk1 Crew Cabin. I saw a lot of potential there for lightweight and/or early Career Mode shuttles to get Kerbals experience and rescue stranded Kerbals from LKO. Unfortunately, this lovely part has one serious drawback: both of the crew hatches are underneath the connection nodes, which means that you can\u0026#39;t EVA a Kerbal in or out of the cabin if connected to something on both ends. Needless to say, this complicates the design process.\u003Cbr\u003E\n\u003Cbr\u003E\nNot one to let simple issues like this stand in my way, I pressed on. My early attempts involved excess amounts of crew shuffling and then excess amounts of clipping. I went through several different configurations before settling on the Tristar configuration that met what I consider to be my design ideals: functional, easy on the eye, and clipping only in seemingly realistic ways. After a few minor revisions, I felt satisfied with the results.\u003Cbr\u003E\n\u003Cbr\u003E\nNOTE: Even though it\u0026#39;s listed under Mod Craft, this craft is entirely stock except for the presence of one KER part to provide the KER readouts.\u003Cbr\u003E\n\u003Cbr\u003E\nSo, without further ado, I present the TriStar 1b.\u003Cbr\u003E\n\u003Cbr\u003E\n[spoiler=\u0022Pictures\u0022] [IMG]http://i.imgur.com/xiFI3sZ.png[/IMG] \u003Cbr\u003E\n\u003Cbr\u003E\n\u003Cbr\u003E\n[IMG]http://i.imgur.com/uWOK7GC.png[/IMG]\u003Cbr\u003E\n\u003Cbr\u003E\n\u003Cbr\u003E\n[IMG]http://i.imgur.com/q6FY4YT.jpg[/IMG]\u003Cbr\u003E\n[/spoiler]\u003Cbr\u003E\n\u003Cbr\u003E\n[spoiler=\u0022Quick video of orbital mission\u0022] [video=youtube;gwkqcSJn3kI]https://www.youtube.com/watch?v=gwkqcSJn3kI[/video] [/spoiler]\u003Cbr\u003E\n\u003Cbr\u003E\n[URL=\u0022http://kerbalx.com/BenCushwa/TriStar-Ib\u0022]Link[/URL] to craft file on KerbalX.\u003Cbr\u003E\n\u003Cbr\u003E\nAscent is simple and stable: stage to launch, pitch the nose down to ~80 elevation and the ship should maintain that heading on it\u0026#39;s own. Drop the SRBs and the drop tanks as soon as they empty. After dropping the tanks, you should be near 30km in altitude, which is about when you should start pitching the nose down to continue raising your apoapsis and circularizing. Drop your main engines (and blow the forward hatch covers) when they run our of fuel (you\u0026#39;ll still be sub-orbital, so no long-term debris to worry about) and continue your orbital insertion with the final orbital vehicle. You should end up with roughly 1000 deltaV left in the tanks for rendezvous maneuvering in a circular LKO of 80-90km, be it to transfer crew or rescue stranded Kerbals.\u003Cbr\u003E\n\u003Cbr\u003E\nRe-entry is likewise simple. Perform your re-entry burn, separate your engines, and hold retrograde through re-entry. It will handle negative periapsis re-entries from LKO (as seen in the video) as well as shallower angle 30km periapsis re-entries. It should be able to handle re-entry from anywhere in the Kerbin SOI with careful flight planning, but I have not tested this.\u003Cbr\u003E\n\u003Cbr\u003E\nStashed away inside the hollow Structural Fuselage is a battery and an additional reaction wheel to ensure sufficient control authority. The TWR is relatively balanced throughout ascent so you don\u0026#39;t have to worry about throttling down to reduce drag. My plan moving forward (once I\u0026#39;ve gotten this particular career mode game far enough along) is to add RCS capability and a docking port to the design to turn it into an effective LKO station transfer shuttle.\u003Cbr\u003E\n\u003Cbr\u003E\nEnjoy.\u003Cbr\u003E\n\u003Cbr\u003E\nUPDATE: I just confirmed that the TriStar 1b can fly from LKO from a free-return-to-reentry flyby of the Mun and can survive a reentry from the Mun\u0026#39;s SOI if you set Kerbin periapsis at ~30km[I].[/I] I was reasonably certain it could make it to the Mun and back (flyby only) based on how much deltaV it had on LKO, but I was less certain about the landing because I cut the heat shields back to the bare minimum. She had just enough.\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-25T21:49:47Z\u0022 title=\u002211/25/2015 09:49  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 25, 2015\u003C/time\u003E by BenCushwa\u003C/strong\u003E\n\u003Cbr\u003EObvious edit is obvious\n\u003C/span\u003E\n"},{"CreatedByName":"H2O.","CreatedById":92782,"CreatedDateTime":"2015-11-24T19:59:06Z","Content":"\nCongrats on sharing your first rocket!\u003Cbr\u003E\n\u003Cbr\u003E\nYes that crew cabin is very handy, almost to the point where it makes the Mk2 Lander Can obsolete.\u003Cbr\u003E\nLove the way you clear the door :)\n"},{"CreatedByName":"BenCushwa","CreatedById":153724,"CreatedDateTime":"2015-11-25T14:07:39Z","Content":"\n[quote name=\u0027H2O.\u0027]Love the way you clear the door :)[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nThanks. I spent a whole lot of time looking for a \u0022fixed\u0022 solution (i.e. not detaching anything), but ensuring that you have enough room for a Kerbal to access the hatch while still providing sufficient aerodynamic protection (both launch and re-entry) made the final orbital stage too long or involved excessive amounts of clipping for my tastes. My other primary candidate design was one that had the two crew cabins perpendicular to the cockpit such that the hatches faced out the side; it worked well, weighed less, and had fewer parts/stages but I didn\u0026#39;t like the way it looked.\n"}]}