{"TopicId":126530,"ForumId":32,"TopicTitle":"Aimed launch vs Orbit","CreatedByName":"JeeF","CreatedById":143053,"CreatedDateTime":"2015-11-26T20:17:02Z","PageNum":1,"Articles":[{"CreatedByName":"JeeF","CreatedById":143053,"CreatedDateTime":"2015-11-26T20:17:02Z","Content":"\nHello guys,\u003Cbr\u003E\n\u003Cbr\u003E\nI\u0026#39;ve experimented a lot with Kerbal over the past 6 months I\u0026#39;ve been playing it.\u003Cbr\u003E\nAfter a while, I started making calculations on how to launch directly up instead of going into an orbit for a moon landing, etc (using RSS and RO).\u003Cbr\u003E\n\u003Cbr\u003E\nI find it\u0026#39;s very efficient... a lot less fuel needed. If you select the correct launch site, wait for the right angle to the moon, an aimed direct launch can save me up to 2k delta-v.\u003Cbr\u003E\n\u003Cbr\u003E\nNot only you need less time/fuel/total weight to get to the moon (or other planets), but you also spend less time in the atmosphere, so you lose even less delta-v there as well.\u003Cbr\u003E\n\u003Cbr\u003E\nFor the moon, I find that a 42-45 degree angle from launch gets me an intercept 99% of the time, with very little correction necessary to get a moon orbit, most of the time I can even get it trimmed with RCS.\u003Cbr\u003E\n\u003Cbr\u003E\nI\u0026#39;ve played a lot with it and I\u0026#39;ve tried thinking of a reason why it would be a bad idea, or a worse idea compared to orbit, but couldn\u0026#39;t. Tried searching internet about it and didn\u0026#39;t find anything.\u003Cbr\u003E\n\u003Cbr\u003E\nWhat do you guys think? Why isn\u0026#39;t it done in real life and why can\u0026#39;t I find one youtuber using this same strategy? What am I missing?\u003Cbr\u003E\n\u003Cbr\u003E\n[IMG]http://s9.postimg.org/p9l8t6f3j/asd.jpg[/IMG]\u003Cbr\u003E\n\u003Cbr\u003E\nPossible causes?\u003Cbr\u003E\n\u003Cbr\u003E\n1) Needs more precision, tighter launch window, bigger chance of missing intercept?\u003Cbr\u003E\nWell, maybe, and if so not by much. When you consider the fact you\u0026#39;d be almost \u0022parked\u0022 at 0m/s waiting for the moon to come. The moon\u0026#39;s gravity gets me on 99% of the attempts without any corrections.\u003Cbr\u003E\n\u003Cbr\u003E\n2) ... ? Idk.\u003Cbr\u003E\n\u003Cbr\u003E\n3) Why isn\u0026#39;t this done in real life?\n"},{"CreatedByName":"FungusForge","CreatedById":148313,"CreatedDateTime":"2015-11-26T20:28:08Z","Content":"\nI\u0026#39;ve done this kinda thing before once. Turned a stock Mun landing into a weekend trip. Faster, conceivably more efficient.\u003Cbr\u003E\n\u003Cbr\u003E\nPart of the reason it isn\u0026#39;t done in real life is possibly because unlike KSP, NASA and so on have to actually worry about the debris slamming back down into Earth. When something normally de-orbits, it has more than plenty exposure to atmosphereic drag so that when something like an engine slams into the ground, it only puts a hole in a roof. However a straight drop, with far less drag to deal with, would likely slam into the ground at greater speeds, making an inconvenient hole in the roof the complete lack of a house (or worse).\n"},{"CreatedByName":"I_Killed_Jeb","CreatedById":84817,"CreatedDateTime":"2015-11-26T20:34:29Z","Content":"\nwell for one thing we have no equatorial launch centers IRL...\n"},{"CreatedByName":"Ten Key","CreatedById":123319,"CreatedDateTime":"2015-11-26T20:37:15Z","Content":"\nEarth/Kerbin\u0026#39;s gravity acts continuously on any \u0022vertical\u0022 velocity you give to the rocket. So if you launch straight up, gravity is going to be acting against you for the entire trip. It can be shown mathematically that the most efficient Moon/Mun transit is to launch along a standard trajectory, but instead of going into Earth/Kerbin orbit, you just keep on burning until you have an intercept. \u003Cbr\u003E\n\u003Cbr\u003E\nNASA didn\u0026#39;t do this with Apollo for safety reasons. Going into Earth orbit first cost them some fuel, but it allowed the crew time to make sure everything on the spacecraft was okay before they committed to a lunar trajectory.\n"},{"CreatedByName":"Archgeek","CreatedById":116048,"CreatedDateTime":"2015-11-26T20:47:00Z","Content":"\nBy all accounts this should really have no benefit -- As Ten Key said, you\u0026#39;ll have nasty gravity drag going straight up to get your AP to Mun town, and then instead of burning for with an already significant tangential velocity, you\u0026#39;ll be floating around the Mun\u0026#39;s path with near-zero relative velocity, so you\u0026#39;ll have to burn for nigh-unto the fullness of the Mun\u0026#39;s own orbital velocity about Kerbin, save for what it gives you by dragging your craft along a bit as it rampages by. Though I\u0026#39;m curious just how much delta-v the Mun would impart to a near-stationary craft in its passing.\n"},{"CreatedByName":"More Boosters","CreatedById":147303,"CreatedDateTime":"2015-11-26T20:54:21Z","Content":"\nWell your first stage can be as heavy as you want it to be, so no need to optimize it.\u003Cbr\u003E\n\u003Cbr\u003E\n[COLOR=\u0022silver\u0022][SIZE=1]- - - Updated - - -[/SIZE][/COLOR]\u003Cbr\u003E\n\u003Cbr\u003E\nWell your first stage can be as heavy as you want it to be, so no need to optimize it.\u003Cbr\u003E\n\u003Cbr\u003E\nAnd it won\u0026#39;t save 2k DV. It will save that to get a Mun intercept, but you\u0026#39;ll still need to circularize to a Munar orbit. Going high up and circularizing there is less favorable than doing this at a lower altitude.\n"},{"CreatedByName":"samstarman5","CreatedById":12469,"CreatedDateTime":"2015-11-26T21:25:43Z","Content":"\nLately I have learned that what goes up does come down quite differently depending on what angle it is coming down. It has been a very painful lesson these last few updates, so it truly is something to take into consideration as far as how you want to handle your mission. Even if you are just going for a fly-by/free return of the Mun, putting your craft into orbit of Kerbin first, even if you don\u0026#39;t stay for one full orbit, can make a world of difference, and gives you some time to fine tune your trajectory. What you plan for from the launchpad is actually a lot different from orbit, and being in freefall does give you more choices that cost you less in dV.\u003Cbr\u003E\nIf you commit to a straight launch to the Mun, then a lot of those choices go away, and it can make aiming for a specific landing spot more expensive and difficult. Overall, it is better to let Kerbin help you along and let your orbits guide you.\u003Cbr\u003E\n\u003Cbr\u003E\n[quote name=\u0027I_Killed_Jeb\u0027]well for one thing we have no equatorial launch centers IRL...[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nWell, there is the ESA center in French Guiana, which is dang close.\u003Cbr\u003E\n\u003Cbr\u003E\n[quote name=\u0027Archgeek\u0027]By all accounts this should really have no benefit -- As Ten Key said, you\u0026#39;ll have nasty gravity drag going straight up to get your AP to Mun town, and then instead of burning for with an already significant tangential velocity, you\u0026#39;ll be floating around the Mun\u0026#39;s path with near-zero relative velocity, so you\u0026#39;ll have to burn for nigh-unto the fullness of the Mun\u0026#39;s own orbital velocity about Kerbin, save for what it gives you by dragging your craft along a bit as it rampages by. Though I\u0026#39;m curious just how much delta-v the Mun would impart to a near-stationary craft in its passing.[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nWell, it depends what the craft/object is near-stationary to. In space, being stationary to one thing pretty much means you are nowhere near stationary to anything else. And the Moon has done its fair share of kicking Saturn boosters into solar orbit or just a wider orbit of Earth. I had one session where I had left a booster in high Kerbin orbit and later found it on its way out to solar orbit. Even though objects outside of your immediate area are on rails, they are still subject to rules of SOI and the gravity therein.\u003Cbr\u003E\n\u003Cbr\u003E\n[quote name=\u0027More Boosters\u0027]Well your first stage can be as heavy as you want it to be, so no need to optimize it.\u003Cbr\u003E\n\u003Cbr\u003E\n[COLOR=\u0022silver\u0022][SIZE=1]- - - Updated - - -[/SIZE][/COLOR]\u003Cbr\u003E\n\u003Cbr\u003E\nWell your first stage can be as heavy as you want it to be, so no need to optimize it.[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nIn a way, that is true for Kerbin, which is a perfect sphere (but for the mountains and seas, of course), but on Earth, the further north or south of the equator, you do need a larger launch stage due to more gravity working against you and less spin working for you. And for those who work with career mode, it does mean a lot how much you put into each stage. However, you only need really be concerned about what you are pushing up and less about what you are pushing against, as that is a constant no matter where you are on any world.\n"},{"CreatedByName":"Wallygator","CreatedById":97357,"CreatedDateTime":"2015-11-26T22:29:36Z","Content":"\nI\u0026#39;m waiting for a mod that creates population centres all around kerbin, and crushes a players rep when debris drops from the sky nearby them... that would be a very interesting game mechanic.\u003Cbr\u003E\n\u003Cbr\u003E\nStill, but more on topic - the factors that sculpted the apollo mission profiles were far more than just fuel usage. Ranger and Surveyor missions could execute a direct ascent, but a manned mission required quite a few more safeguards.\n"},{"CreatedByName":"A_name","CreatedById":134040,"CreatedDateTime":"2015-11-26T22:58:22Z","Content":"\nI think the reason this isn\u0026#39;t done in real life is because of safety concerns. If you launch to LEO and your craft fails there, you have options. But if you\u0026#39;re launching into a direct transfer and something goes wrong, you can find yourself stuck on an escape trajectory, a collision course to the moon, an extremely steep and un-survivable reentry or some other trajectory that otherwise dooms you.\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-11-26T23:09:48Z","Content":"\ngravity losses... why thrust going away from earth and lose 9.8m/s/s from whatever your acceleration is, when you can thrust parallel to the earth, and not lose anything...\n"},{"CreatedByName":"OhioBob","CreatedById":128005,"CreatedDateTime":"2015-11-26T23:12:21Z","Content":"\n[quote name=\u0027Archgeek\u0027]Though I\u0026#39;m curious just how much delta-v the Mun would impart to a near-stationary craft in its passing.[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nEscape velocity. The same velocity it takes to escape is added when the craft falls in toward Mun.\n"},{"CreatedByName":"maccollo","CreatedById":72759,"CreatedDateTime":"2015-11-26T23:21:45Z","Content":"\n[quote name=\u0027JeeF\u0027]Why isn\u0026#39;t it done in real life and why can\u0026#39;t I find one youtuber using this same strategy? What am I missing?[/QUOTE] Your fundamental assertion, that it saves significant delta V, is wrong.\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-11-26T23:28:43Z","Content":"\n[quote name=\u0027maccollo\u0027]Your fundamental assertion, that it saves significant delta V, is wrong.[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nThis. We explored this in depth about a year ago. Launching vertically is not more efficient from a standpoint of DV, fuel expenditure, or payload fraction. The reason is that you lose all benefit from the Oberth effect and your burn is fighting gravity the entire time. \u003Cbr\u003E\nIf you use a rocket with a very high t/w, then it\u0026#39;s not *much* less efficient in DV (although it is still less efficient), but it\u0026#39;s even worse for fuel and payload fraction.\u003Cbr\u003E\nThe only advantage is that it\u0026#39;s easier to pilot.\u003Cbr\u003E\n\u003Cbr\u003E\nBest,\u003Cbr\u003E\n-Slashy\n"},{"CreatedByName":"Temstar","CreatedById":24430,"CreatedDateTime":"2015-11-27T00:01:32Z","Content":"\nThat said, if you have an truly immense amount of delta-V then this type of transfer may be practical. This is called a brachistochrone trajectory where the ship more or less just accelerate directly at the target and fire its engine (and therefore accelerate) until the half way point, then flips around and fire it\u0026#39;s engine retrograde so it can enter orbit upon arrival.\u003Cbr\u003E\n\u003Cbr\u003E\nCompared to low energy Hohmann transfer orbit a brachistochrone trajectory will get you to the target much much faster. Someone worked out that a ship capable of accelerate at 0.3G for hours will be able to reach Moon from LEO in about 6 hours, rather than 4 days that the Apollo spacecrafts took. Trip to Jupiter with this ship will take 2 weeks, and Saturn in 3 weeks.\u003Cbr\u003E\n\u003Cbr\u003E\nThat is, assuming you have an engine that can fire continuously for hours and days and weeks, rather than minutes with chemical rockets.\u003Cbr\u003E\n\u003Cbr\u003E\nI recall someone actually did a brachistochrone to Mun in KSP. It should be doable with NTR engines given the much reduced distance compared to real life but it will still require a huge ship.\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-27T00:07:20Z\u0022 title=\u002211/27/2015 12:07  AM\u0022 data-short=\u00228 yr\u0022\u003ENovember 27, 2015\u003C/time\u003E by Temstar\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SgtSomeone","CreatedById":151722,"CreatedDateTime":"2015-11-27T00:06:22Z","Content":"\nI think there are two factors here which may be mixing up the answers here. \u003Cbr\u003E\n\u003Cbr\u003E\n1) a direct ascent (i.e not orbiting earth/kerbin before firing to the moon/mun) is more fuel-efficient than the alternative, but there are other reasons (like others have mentioned to do it).\u003Cbr\u003E\n\u003Cbr\u003E\n2) a vertical launch is less efficient than a launch with a gravity turn. This is because, as Ten Key mentioned, every second spent going vertically up instead of horizontal results in losing 9.8m/s/s. The most efficient way to enter orbit around an airless body is to jump just a little and then rotate 90 degrees and fire away until you miss the ground. Much less time and delta V spent fighting gravity\u003Cbr\u003E\n\u003Cbr\u003E\nTherefore, you may be right about fuel savings, but you could probably get even more savings if you incorporated a bit of a gravity turn in your launch profile. It would, however, be much more difficult (but not impossible) to calculate ahead of time.\n"},{"CreatedByName":"Geher","CreatedById":116288,"CreatedDateTime":"2015-11-27T07:46:38Z","Content":"\nI also thought a vertical ascend would be more efficient, because then you don\u0026#39;t have to raise your periapsis. I thought it would be especially more efficient when your engine has high thrust so that the burn time is very short.\u003Cbr\u003E\nWell, I guess I was wrong. Again what learned :)\n"}]}