{"TopicId":126541,"ForumId":55,"TopicTitle":"A discussion on multiplayer","CreatedByName":"322997am","CreatedById":146422,"CreatedDateTime":"2015-11-26T22:13:43Z","PageNum":1,"Articles":[{"CreatedByName":"322997am","CreatedById":146422,"CreatedDateTime":"2015-11-26T22:13:43Z","Content":"\nI want to create a thread where multiplayer can be discussed peacefully. I wanted to give squad some ideas also. So in multiplayer there is the issue of proccesing. If you have 20 people on a server all launching 200 part planes then that is insane and will only do on a 64gb ram desktop. But, even though this will take some work I think it will be worth it. I suggest the online processing \u0022stuff\u0022 gets evenly distributed over all the pcs online. That is if all 20 players are playing with 8gb ram then that\u0026#39;s -the OS and base Ksp which Leaves 6x20=like almost 120gb that can totally handle the players. Even people with sucky computers will put something into the server. Next the issue of time warp. I think instead of players zipping away from each other I want a system that when you press a button everyone gets a message\u0022someone wants to time warp. Then they have 10 minutes to land and the person has 10mins to do the time warp. If the other players do not reach a time warp ready position in 10 minutes due to ignoring the message their craft will be terminated and a certain fine taken if it\u0026#39;s a career server. And you can only time warp 1ce every 12 hours in real life to prevent abuse of time warp. Then the problem of craft griefing. So every craft will have \u0022permissions\u0022. So they can share the craft to allow fuel/mono-prop/other resources/crew in and out. They can also set the craft to lock the controls of the other user if docked/made contact with. I would like there to be many other permission settings. I\u0026#39;m kinda comparing a video game to google docs but IDC. You will also have a list of all players who have touched anything on your station at all. If they broke anything you can see that and see what they broke. If they accidentally clipped a solar panel then you click pardon and if you think the kamikazed your station then you report it and the person gets auto banned and they get a griefer tag for 30 days and everyone can see that. Maybe you can add dunce caps for the kerbals of the griefers. And also you can propose a war and if the players says yes then for 10 kerbin days the players can break anything on each other\u0026#39;s craft. And (duh) I want a good chat. Not like some slap it in 2 seconds chat but a nice and enjoyable chat. Tell me what you think and post your thoughts below.\n"},{"CreatedByName":"panzer1b","CreatedById":95108,"CreatedDateTime":"2015-11-30T16:59:54Z","Content":"\n\u003Cp\u003E\nObviously server needs to have the ability to limit the part count per player as well, yeah, lag city.  It should be admin based, as say servers focused more in space wouldnt need as strict part count limits as airplane servers, in space, its unlikely for multiple players to be in teh same spot at the exact same time, a few may interact, but i doubt anyone would be able to arrange a mass server everyone rendevous at once. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAs for crafts and griefing, well, i feel it needs to be both server set and player set.  Peaceful servers should allow people to request that noone breaks their crafts, and as you say, i agree that they should have the option to allow/disallow resource transfers, as some might want to set up a fuel depo, others might prefer to keep their fuel private.  Then we also need to have servers that can enable something like combat mode where there are little rules aside perhaps the inability to control enemy ships, but shooting at each other has to be allowed as well, combat without destruction is rather boring.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI feel time warp should be handled like DMP, it works there very well, and minus the obvious bugs with that mod, noone complains about the way warp works there.  Essentially anyone is free to time warp however they want, then then people will \u0022sync\u0022 to others if they wish to interact.  I think that it would also be nice to allow admins to set custom time warp, say disallow it entirely on a server, or allow it but with some restruictions such as no warping in close proximity with another, ect.\n\u003C/p\u003E\n"},{"CreatedByName":"322997am","CreatedById":146422,"CreatedDateTime":"2015-11-30T22:05:28Z","Content":"\n\u003Cp\u003E\nWhat do you think on the sharing cpu  resources? It will reduce lag tho\n\u003C/p\u003E\n"}]}