{"TopicId":126654,"ForumId":32,"TopicTitle":"Real talk: Solar orbit stations","CreatedByName":"More Boosters","CreatedById":147303,"CreatedDateTime":"2015-11-30T16:08:18Z","PageNum":1,"Articles":[{"CreatedByName":"More Boosters","CreatedById":147303,"CreatedDateTime":"2015-11-30T16:08:18Z","Content":"\n\u003Cp\u003E\nEvery once in a while you\u0027ll get a contract asking you to build a space station in a solar orbit. These pay ridiculous amounts of money, more than something like visiting frickin Duna. And this wouldn\u0027t have been a problem if a solar orbit wasn\u0027t one of the easiest things in the game. Cluster a bunch of SRBs, build whatever silly station they want, launch it straight up, escape Kerbin\u0027s SoI and you\u0027re done. Then delete it because you hate yourself and you hate this silly mechanic but you didn\u0027t want to grind meaningful contracts that barely pay anything just so you could unlock the next level of science labs.\n\u003C/p\u003E\n\u003Cp\u003E\nUgh.\n\u003C/p\u003E\n"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-11-30T16:29:23Z","Content":"\n\u003Cp\u003E\nJust take 2 of those contract : build station around Duna and Build station around Sun. Then get there\n\u003C/p\u003E\n\u003Cp\u003E\nOne station, 2 rewards.\n\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2015-11-30T16:49:04Z","Content":"\n\u003Cp\u003E\nI use Antenna Range mod. Each of my stations serves as an communications hub, housing a set of biggest, most power-hungry antennas. Stations in solar orbit are usually left unmanned as soon as contract is completed - i have better things to do for my Kerbals than pickle in Hitchhikers Cans for decades \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"rocketbuilder","CreatedById":154102,"CreatedDateTime":"2015-11-30T16:53:56Z","Content":"\n\u003Cp\u003E\nUse the station contracts mod, it makes you build stations and only rarely asks for a new one. Most contracts are like to add a new habitation module and cycle the crew around.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"CrashTestDanny","CreatedById":151030,"CreatedDateTime":"2015-11-30T17:05:33Z","Content":"\n\u003Cp\u003E\nSo I\u0027ve been thinking about a permanent solar station in an orbit that would keep it perpetually the same distance from Kerbin - just outside of Kerbin\u0027s SOI.  Easy enough to do I think, just escape Kerbin either pro or retro to Kerbin\u0027s orbit of Kerbol and then shortly after escaping Kerbin, tweak the station\u0027s orbit to match Kerbin\u0027s (but not to return to Kerbin).  Seems like this might offer benefits as someplace that\u0027s relatively easy to get to plus very easy to use as a staging/refueling location for longer trips  might even simplify some trips, no?  Am I just nuts or is this a moderately decent idea?\n\u003C/p\u003E\n"},{"CreatedByName":"severedsolo","CreatedById":80345,"CreatedDateTime":"2015-11-30T17:32:53Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222301285\u0022 data-ipsquote-contentid=\u0022126654\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221448902436\u0022 data-ipsquote-userid=\u0022154102\u0022 data-ipsquote-username=\u0022rocketbuilder\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, rocketbuilder said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nUse the station contracts mod, it makes you build stations and only rarely asks for a new one. Most contracts are like to add a new habitation module and cycle the crew around.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nActually Kerbin Space Station will only ask for a new station if it doesn\u0027t already find one in orbit around that body. That was very important for me, the endless \u0022build a new station\u0022 contracts drove me batty.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-30T19:19:38Z\u0022 title=\u002211/30/2015 07:19  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 30, 2015\u003C/time\u003E by severedsolo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MrOsterman","CreatedById":153514,"CreatedDateTime":"2015-11-30T17:39:02Z","Content":"\n\u003Cp\u003E\nI like the \u0022build a station in orbit just out of Kerbol\u0027s SOI\u0022 but I\u0027d be worried about the fuel cost to and from it over time.  I\u0027m horrible about planning fuel costs in general and just had the fun of burning my mono thrusters for 10 minutes to get my Peri down enough for an aerocapture after retrieving a random space part in Kerbol orbit.  And to add to that I had an engineer on the mission who I had, literally, just rescued the day before from his own \u0022lost in space\u0022 pod....\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"CrashTestDanny","CreatedById":151030,"CreatedDateTime":"2015-11-30T19:21:46Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222301357\u0022 data-ipsquote-contentid=\u0022126654\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221448904773\u0022 data-ipsquote-userid=\u002280345\u0022 data-ipsquote-username=\u0022severedsolo\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, severedsolo said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nActually Kerbin Space Sation will only ask for a new station if it doesn\u0027t already find one in orbit around that body. That was very important for me, the endless \u0022build a new station\u0022 contracts drove me batty.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAnd THANK YOU so much for that!  The incessant begging for new redundant space stations was really getting to me.  I\u0027m using your KSS pack and the only trouble I have now is the repetitive contracts to evacuate or respond to a medical [not] emergency. Anyhow, I\u0027d love to give you some rep for that, but it\u0027s not yet clear to me how to do so... I thought clicking the little plus next to your rep would add it, but that does not seem to be the case....\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nDanny\n\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-11-30T22:01:34Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222301308\u0022 data-ipsquote-contentid=\u0022126654\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221448903133\u0022 data-ipsquote-userid=\u0022151030\u0022 data-ipsquote-username=\u0022CrashTestDanny\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, CrashTestDanny said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSo I\u0027ve been thinking about a permanent solar station in an orbit that would keep it perpetually the same distance from Kerbin - just outside of Kerbin\u0027s SOI.  Easy enough to do I think, just escape Kerbin either pro or retro to Kerbin\u0027s orbit of Kerbol and then shortly after escaping Kerbin, tweak the station\u0027s orbit to match Kerbin\u0027s (but not to return to Kerbin).  Seems like this might offer benefits as someplace that\u0027s relatively easy to get to plus very easy to use as a staging/refueling location for longer trips  might even simplify some trips, no?  Am I just nuts or is this a moderately decent idea?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis isn\u0027t as easy to do as you think.  If  you\u0027re close to Kerbin\u0027s SOI, then it won\u0027t be long before it enters Kerbin\u0027s SOI and either impacts or gets catapulted far, far away.  This usually happens when you\u0027re warping another ship at high rate and not paying attention to the station, when SOI boundaries (and even planetary surfaces) often get a bit fuzzy.  So to be safe, I\u0027d put it at least 25-30% of an orbit ahead of or behind Kerbin, not anywhere really close to it.\n\u003C/p\u003E\n\u003Cp\u003E\nAt which point, you have to ask yourself, what\u0027s it good for?  Is it a useful place to use en route to another planet?  No, it\u0027s actually worse.  While it\u0027s exactly as far from everywhere else as Kerbin is, you can\u0027t use any of the transfer window figure-outers, and you get no Oberth effect when doing transfer burns at the station.  Is it quick and easy to get to?  No, it will take the better part of a year to get there, and rendezvous is about the same level of difficulty as catching an asteroid in solar orbit.  And then you have to get yourself back instead of riding the asteroid home, which is another long trip.  So other than using it as a prison for your worst criminals, there\u0027s not really any reason to go there.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, if you use Remote Tech or Antenna Range with LOS blocking turned on, it can be useful to put automated communications relays in such positions.  They allow you to see around the sun.  But OTOH, you can just put relays in highly elliptical polar orbits at every planet and you\u0027ll also have a path around the sun, and if you\u0027re going to other planets anyway, why not take the relays with you?\n\u003C/p\u003E\n"},{"CreatedByName":"samstarman5","CreatedById":12469,"CreatedDateTime":"2015-12-01T08:10:44Z","Content":"\n\u003Cp\u003E\nSo what is stopping you from adding your own challenge to the contract?  Not a thing at all.  As long as you match whatever requirements are set, you can do whatever you want to get it done. This is not so much a case of a silly contract as more a case that you can\u0027t be bothered to take advantage of a contract like this to try some new parts, some new launch method, or anything else you can imagine.  Something to keep in mind with 1.0.5 is that station is likely going to come up in a later contract to add a module to it of some kind, bring kerbals to it, or maybe even bring it to a different orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nI definitely appreciate the responses to this post, but when you boil it down, this is just another complaint post to something you just don\u0027t like, and actually do not need to initiate.  Find something you can engage yourself in. There are a lot of options available, with more to come.  You do not have to do every single contract offered.  I, for one, really don\u0027t care for the testing and hauling contracts, so I really don\u0027t bother with them myself unless they do fit into a mission I do want to perform. I never turn down the extra funds, science, or rep that may come from that.\n\u003C/p\u003E\n"},{"CreatedByName":"MrOsterman","CreatedById":153514,"CreatedDateTime":"2015-12-01T12:50:23Z","Content":"\n\u003Cp\u003E\nWell I did just really look at the money payout on that Solar Base contract and it\u0027s left me wondering if I should put some time into making the one I just put up a functional one.  Right now it\u0027s parked just outside of the Kerbol SOI and I\u0027m debating on pulling it BACK into orbit so I can use it for something a little more productive and a little less risky (I\u0027ve got a tourist, scientist and pilot aboard it now).  \n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m also at a small pinch point with feeling like I need to do something to get more cash in hand given that I\u0027m growing my science pretty stupid fast but I don\u0027t have the funds to upgrade RnD yet to use it.  \n\u003C/p\u003E\n\u003Cp\u003E\nMy plan for the solar base is to make it either a Munar or Minus orbiter and put it to work there so I know I can get my people on and off of it safely.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-12-01T13:43:45Z","Content":"\n\u003Cp\u003E\nYes, there is very little use for a solar space station. Time to get there will be very bound by windows.\n\u003C/p\u003E\n\u003Cp\u003E\nI use a lot of space stations, but I\u0027ve none around Kerbol and my Kerbin station is never used, except on very rare occasion to refuel my space plane for high orbit operation (kerbal rescue due to old and ill designed return vehicle from interplanetary transfers)\n\u003C/p\u003E\n"},{"CreatedByName":"rocketbuilder","CreatedById":154102,"CreatedDateTime":"2015-12-02T07:24:05Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222301357\u0022 data-ipsquote-contentid=\u0022126654\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221448904773\u0022 data-ipsquote-userid=\u002280345\u0022 data-ipsquote-username=\u0022severedsolo\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 30/11/2015, 17:32:53, severedsolo said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nActually Kerbin Space Station will only ask for a new station if it doesn\u0027t already find one in orbit around that body. That was very important for me, the endless \u0022build a new station\u0022 contracts drove me batty.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah, I meant that it rarely asks for a new one around any body, and never ones with stations.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd I\u0027ve never seen it ask about a solar station.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-12-02T07:24:52Z\u0022 title=\u002212/02/2015 07:24  AM\u0022 data-short=\u00228 yr\u0022\u003EDecember 2, 2015\u003C/time\u003E by rocketbuilder\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Curveball Anders","CreatedById":107529,"CreatedDateTime":"2015-12-02T10:03:16Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222302834\u0022 data-ipsquote-contentid=\u0022126654\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221448977425\u0022 data-ipsquote-userid=\u0022140055\u0022 data-ipsquote-username=\u0022Warzouz\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n20 hours ago, Warzouz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYes, there is very little use for a solar space station.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOne could try to advertise it to tourists as a very exclusive (and expensive) tanning studio for rich and influential Kerbal.\n\u003C/p\u003E\n\u003Cp\u003E\n(Or would that be a greening studio?)\n\u003C/p\u003E\n"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-12-02T10:08:40Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222304387\u0022 data-ipsquote-contentid=\u0022126654\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221449050596\u0022 data-ipsquote-userid=\u0022107529\u0022 data-ipsquote-username=\u0022Curveball Anders\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 minute ago, Curveball Anders said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOne could try to advertise it to tourists as a very exclusive (and expensive) tanning studio for rich and influential Kerbal.\n\u003C/p\u003E\n\u003Cp\u003E\n(Or would that be a greening studio?)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIn a pure roleplay style, this station wouldn\u0027t be much fun. In beta, I had a dedicated mission around Kerbol. This mission was boring. The scenery was nearly still. On the opposite, the station orbiting Laythe was increadibly nice with Jool-rises and neaby Vall and Tylo with the naked eye. Fantastic sight !\n\u003C/p\u003E\n"}]}