{"TopicId":126641,"ForumId":55,"TopicTitle":"Realism vs. Kerbalism?","CreatedByName":"GagaX","CreatedById":57813,"CreatedDateTime":"2015-11-30T14:11:21Z","PageNum":3,"Articles":[{"CreatedByName":"jros83","CreatedById":118956,"CreatedDateTime":"2015-12-05T18:27:01Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222309518\u0022 data-ipsquote-contentid=\u0022126641\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221449337707\u0022 data-ipsquote-userid=\u0022119411\u0022 data-ipsquote-username=\u0022tater\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n37 minutes ago, tater said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nActually, my analogy is spot-on. Manned spaceflight is a combination of rocketry, and life support. Both are necessary systems, and the latter drives pretty much all mission design. The reason the moon was challenging technologically was the requirement that it be really safe for astronauts.\n\u003C/p\u003E\n\u003Cp\u003E\nNote that everything would be a toggle, anyway, as it already is. It\u0027s not noobs that would use this, it\u0027s a replay thing. If you\u0027ve been playing a couple years and you are still on stock-sized kerbol system, and not using LS, etc... you must be harder to bore than I am. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nEach their own.\n\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2015-12-05T18:29:43Z","Content":"\n\u003Cp\u003E\nHere\u0027s the deal with all of this, that drives me into complete insanity. This game is a sandbox at heart. We can argue up and down, but the basic premise the game started with was \u0022build whatever and go where ever.\u0022 It grew with a lot of additions, but the core mechanics have remained unchanged.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSo while I\u0027m not categorically opposed to the addition of Life Support, I would like to see it being done in a way that isn\u0027t simply another limiting factor added to the game. Is it a limiting factor in real life? Yep, it sure is. But if life support just becomes another \u0022you must attach X number of part Y on your ship to fly for time Z\u0022, that also becomes \u0022boring\u0022 to me. If it becomes a matter of development time, I would much rather see time spent adding more powerful tools in the game first. Tools that allow for complex mission planning and mission management. I\u0027d rather be able to fly more simultaneous missions to more places in complex ways, than to have to add more parts to my already laggy ships just so I can go on the same flights that I already do.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIf we want to get into the realism debate, those complex mission management tools are just as \u0022grass roots.\u0022 Do I have a team of hundreds of thousands of scientists and a huge array of supercomputers at my disposal? Nope. A real space program consists of a couple more people than just me and a flight crew. Yet that part is often overlooked in the \u0022should KSP be a lol wacky simulator, or hardcore engineering design sim\u0022 debate. There is a nice middle ground in there too, though I\u0027m sure there are plenty of people who disagree. If you want a complex game with comm network and life support requirements, then you need to give the player complex tools to be able to figure it all out.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIn any case, I don\u0027t mean to sidetrack the overall theme of the thread onto a specific topic. I suppose that was one example (in my mind) that I\u0027m probably more of a 75%, than a 0 or 100%. But that\u0027s probably a bit of a simplification as well. I\u0027m onboard with fairly realistic physics (doesn\u0027t have to be n-body and atomic level CFD though), but I\u0027m not a fan of adding things like fuel slosh, limited firings on engines, etc. into the core game. Those elements are also all realistic, but it\u0027s still a video game. Added elements can (and should) provide new challenges, but they should also done with the mindset of adding to the \u0022build whatever and go where ever\u0022 core of the game.\n\u003C/p\u003E\n"},{"CreatedByName":"Jovus","CreatedById":117163,"CreatedDateTime":"2015-12-05T18:38:25Z","Content":"\n\u003Cp\u003E\nI just want my wet/dry ratios to both make sense and not be terrible. :/\u003Cbr\u003E\u003Cbr\u003E\nIt\u0027s not even the 9:1 that bothers me so much, actually, as that it\u0027s randomly different across parts and fuels.\n\u003C/p\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2015-12-05T18:50:33Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222309577\u0022 data-ipsquote-contentid=\u0022126641\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221449340183\u0022 data-ipsquote-userid=\u0022100668\u0022 data-ipsquote-username=\u0022Claw\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n24 minutes ago, Claw said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIf you want a complex game with comm network and life support requirements, then you need to give the player complex tools to be able to figure it all out.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI actually completely agree. I think many of us hoping for LS don\u0027t expect it to be included before major game mechanics are polished up, and some simple mission planning tools would be huge. In fact, in many ways LS doesn\u0027t work before you have that because its too difficult to estimate how long your missions will be and plan accordingly. \n\u003C/p\u003E\n\u003Cp\u003E\nI do think though that long term, if done right, LS could add a lot more than adding mandatory parts. If the basics were simple but efficient greenhouses required some forethought there would be legit gameplay and weight tradeoffs to consider depending on how long your mission was. It also could be a sincere basis for thinking about time as a cost. Transfers could be optimized by the player for shorter flight times or lower dV. Beyond adding just the sense that we were living off the land and surviving in harsh environments it adds tension and urgency. Even if the realism is simplified (and it should be), it opens up real considerations and could inject a cool new layer to the game. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-12-05T18:54:06Z\u0022 title=\u002212/05/2015 06:54  PM\u0022 data-short=\u00228 yr\u0022\u003EDecember 5, 2015\u003C/time\u003E by Pthigrivi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2015-12-05T20:01:52Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222309606\u0022 data-ipsquote-contentid=\u0022126641\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221449341433\u0022 data-ipsquote-userid=\u0022105624\u0022 data-ipsquote-username=\u0022Pthigrivi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n50 minutes ago, Pthigrivi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\ndifficult to estimate how long your missions will be and plan accordingly\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYes, exactly. 100% yes.\n\u003C/p\u003E\n\u003Cp\u003E\nIf it\u0027s a game of trial and error, then the penalty for failure can\u0027t be extreme. That\u0027s the current design philosophy (mainly trial and error). That\u0027s why I\u0027m always resistant about blanket \u0022LS needs to be added.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222309606\u0022 data-ipsquote-contentid=\u0022126641\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221449341433\u0022 data-ipsquote-userid=\u0022105624\u0022 data-ipsquote-username=\u0022Pthigrivi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n50 minutes ago, Pthigrivi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nif done right\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat\u0027s the crux, isn\u0027t it. Determining what\u0027s \u0022right\u0022 for thousands of opinions. And (to try to keep from derailing the topic further on LS), this comment is really applicable to the broad question of this thread.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOf all games that I\u0027ve played...KSP, more then virtually any other, is the closest to being \u0022all things to all people.\u0022 This game is so incredibly flexible even as pure stock. It\u0027s a space game, but since things are sort of built together in an open ended way, people build rockets, scifi space ships, planes, space planes, boats, trains, cars, rovers, submarines, airships, helicopters, and even Ferris wheels (yes, Ferris wheels). It\u0027s that aspect of KSP that I\u0027m always most protective of. If it comes down to perfect realism and being able to do virtually anything you can imagine, I\u0027m personally always going to error in favor of giving people creative freedom.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd no, I don\u0027t mean to say realism is diametrically opposed to fun. It doesn\u0027t have to be one or the other. For some people, perfect realism \u003Cu\u003Eis\u003C/u\u003E the fun. But as I just said, \u0022for \u003Cu\u003Esome\u003C/u\u003E people, perfect realism is the fun.\u0022 The glorious thing about KSP is that it\u0027s capable of both (if people aren\u0027t hung up on \u0022must be stock\u0022). It frustrates me greatly to watch threads where people get upset about \u0022how\u0022 others are having fun, rather than embracing the game they enjoy and being excited that others \u0022are\u0022 having fun.\n\u003C/p\u003E\n"},{"CreatedByName":"Hyomoto","CreatedById":64780,"CreatedDateTime":"2015-12-05T20:23:05Z","Content":"\n\u003Cp\u003E\nGosh, I can vote.  There are times I love building largely accurate rockets, but it\u0027s also fun to build something insanely stupid it shouldn\u0027t fly ... and then getting it to fly.\n\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2015-12-05T22:23:05Z","Content":"\n\u003Cp\u003E\nComm networks as added to KSP in mods are not even slightly realistic, they are needlessly tedious, particularly given that the distance from Kerbol to Eeloo is about 1/2 the distance from Sol to Venus, right?\n\u003C/p\u003E\n\u003Cp\u003E\nHere\u0027s why I chimed in on LS, and why I would actually welcome a \u003Cem\u003Echance\u003C/em\u003E of part failures in career (perhaps via a mechanic where parts were gained on an \u0022experimental\u0022 basis until tested a certain number of hours/days/whatever). I\u0027d like to see reliability a factor vs other benefits of parts. So you pick upper stage engines based upon reliability (as Apollo did) and restart. Heck, I\u0027d also be in favor of changing the throttling ability of engines to be far more realistic, as well as restart not being a thing for many. Note that these forms of realism would only come into play at all in the context of career alone (and career needs a gut-job improvement, frankly).\n\u003C/p\u003E\n\u003Cp\u003E\nCurrently there is no mechanic whereby crewed missions are any different than uncrewed missions. \n\u003C/p\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2015-12-06T19:52:57Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222309689\u0022 data-ipsquote-contentid=\u0022126641\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221449345712\u0022 data-ipsquote-userid=\u0022100668\u0022 data-ipsquote-username=\u0022Claw\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 12/5/2015, 3:01:52, Claw said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIf it\u0027s a game of trial and error, then the penalty for failure can\u0027t be extreme. That\u0027s the current design philosophy (mainly trial and error). That\u0027s why I\u0027m always resistant about blanket \u0022LS needs to be added.\u0022\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOh I would never be so presumptuous. Its worth considering though, right? Sandbox is a ton of fun but I know they care a lot about making career work too, creating a really thoughtful, immersive game. I think we would also probably agree that with better tools the error rate could be reduced and the game would benefit across the board.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222309689\u0022 data-ipsquote-contentid=\u0022126641\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221449345712\u0022 data-ipsquote-userid=\u0022100668\u0022 data-ipsquote-username=\u0022Claw\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 12/5/2015, 3:01:52, Claw said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOf all games that I\u0027ve played...KSP, more then virtually any other, is the closest to being \u0022all things to all people.\u0022 This game is so incredibly flexible even as pure stock. It\u0027s a space game, but since things are sort of built together in an open ended way, people build rockets, scifi space ships, planes, space planes, boats, trains, cars, rovers, submarines, airships, helicopters, and even Ferris wheels (yes, Ferris wheels). It\u0027s that aspect of KSP that I\u0027m always most protective of. If it comes down to perfect realism and being able to do virtually anything you can imagine, I\u0027m personally always going to error in favor of giving people creative freedom.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAbsolutely. There\u0027s been a lot of weird judginess about playstyles which seems crazy to me. That flexibility is so important, and if LS were to be considered would have to respect that. Its completely possible to do it so that all those things are still possible, and could even open a whole new branch of creativity, building orbital farms, colony bases, lots of fun new things. I think in most of the chats we\u0027ve had about it there\u0027s been a basic consensus that LS should:\n\u003C/p\u003E\n\u003Cp\u003E\n- Be a single, simple, LS resource that could be understood at a glance.\n\u003C/p\u003E\n\u003Cp\u003E\n- Be toggleble, and offer a less serious consequence for failure like going on strike or hibernating as well permadeath.\n\u003C/p\u003E\n\u003Cp\u003E\n- Offer a 3 to 20 day grace period, either in the form of \u0027hunger\u0027 as in USI-LS, or as a small standard stock for each pod to cover most Kerbin SOI missions.\n\u003C/p\u003E\n\u003Cp\u003E\n- Include a prerequisite mission pre-planner, including dV and mission time estimator and alarm clock functions so players could plan ahead.\n\u003C/p\u003E\n\u003Cp\u003E\nThe exact mechanics of extending and/or regenerating LS are more flexible, but its certainly possible to create something that\u0027s just involved enough so as not to become a series of perfunctory checklist parts, and not so fussy as to cause endless headaches. At any rate Im sure Bob is up to it \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-12-06T20:28:42Z\u0022 title=\u002212/06/2015 08:28  PM\u0022 data-short=\u00228 yr\u0022\u003EDecember 6, 2015\u003C/time\u003E by Pthigrivi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"panzer1b","CreatedById":95108,"CreatedDateTime":"2015-12-07T04:20:32Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222310952\u0022 data-ipsquote-contentid=\u0022126641\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221449431577\u0022 data-ipsquote-userid=\u0022105624\u0022 data-ipsquote-username=\u0022Pthigrivi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, Pthigrivi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n- Be a single, simple, LS resource that could be understood at a glance.\n\u003C/p\u003E\n\u003Cp\u003E\n- Be toggleble, and offer a less serious consequence for failure like going on strike or hibernating as well permadeath.\n\u003C/p\u003E\n\u003Cp\u003E\n- Offer a 3 to 20 day grace period, either in the form of \u0027hunger\u0027 as in USI-LS, or as a small standard stock for each pod to cover most Kerbin SOI missions.\n\u003C/p\u003E\n\u003Cp\u003E\n- Include a prerequisite mission pre-planner, including dV and mission time estimator and alarm clock functions so players could plan ahead.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI would be content with this, though i doubt id actually turn it on minus the trial run i give every new feature (even if i feel its not my thing to begin with).\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThat said, i agree with claw that LS in general is a waste of time spent doing when there are FAR more critical things to be done.  One, i consider bugs way more critical, and there are still too many to be put in one post.  If there is nothing major left to fix or do, then by all means go ahead and spend time on LS, but until that point (which from the current state of affairs is very far away). \n\u003C/p\u003E\n"},{"CreatedByName":"Frozen_Heart","CreatedById":118627,"CreatedDateTime":"2015-12-07T10:30:20Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222310952\u0022 data-ipsquote-contentid=\u0022126641\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221449431577\u0022 data-ipsquote-userid=\u0022105624\u0022 data-ipsquote-username=\u0022Pthigrivi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n14 hours ago, Pthigrivi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n- Be a single, simple, LS resource that could be understood at a glance.\n\u003C/p\u003E\n\u003Cp\u003E\n- Be toggleble, and offer a less serious consequence for failure like going on strike or hibernating as well permadeath.\n\u003C/p\u003E\n\u003Cp\u003E\n- Offer a 3 to 20 day grace period, either in the form of \u0027hunger\u0027 as in USI-LS, or as a small standard stock for each pod to cover most Kerbin SOI missions.\n\u003C/p\u003E\n\u003Cp\u003E\n- Include a prerequisite mission pre-planner, including dV and mission time estimator and alarm clock functions so players could plan ahead.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI could completely agree with this as well. Having it represented but forgiving is important. A single resource would be best to keep things easy to understand.\n\u003C/p\u003E\n\u003Cp\u003E\nI think treating it almost like electricity is the best way to go about it, with the kerbals going into hibernation when running out of life support. Certain parts would store LS (command pods, hitchhikers), while other parts could generate it (Atmo scrubber, and even a larger greenhouse module for stations and bases)\n\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2015-12-07T15:48:24Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222309689\u0022 data-ipsquote-contentid=\u0022126641\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221449345712\u0022 data-ipsquote-userid=\u0022100668\u0022 data-ipsquote-username=\u0022Claw\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 5 December 2015 20:01:52, Claw said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYes, exactly. 100% yes.\n\u003C/p\u003E\n\u003Cp\u003E\nIf it\u0027s a game of trial and error, then the penalty for failure can\u0027t be extreme. That\u0027s the current design philosophy (mainly trial and error). That\u0027s why I\u0027m always resistant about blanket \u0022LS needs to be added.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThat\u0027s the crux, isn\u0027t it. Determining what\u0027s \u0022right\u0022 for thousands of opinions. And (to try to keep from derailing the topic further on LS), this comment is really applicable to the broad question of this thread.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOf all games that I\u0027ve played...KSP, more then virtually any other, is the closest to being \u0022all things to all people.\u0022 This game is so incredibly flexible even as pure stock. It\u0027s a space game, but since things are sort of built together in an open ended way, people build rockets, scifi space ships, planes, space planes, boats, trains, cars, rovers, submarines, airships, helicopters, and even Ferris wheels (yes, Ferris wheels). It\u0027s that aspect of KSP that I\u0027m always most protective of. If it comes down to perfect realism and being able to do virtually anything you can imagine, I\u0027m personally always going to error in favor of giving people creative freedom.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd no, I don\u0027t mean to say realism is diametrically opposed to fun. It doesn\u0027t have to be one or the other. For some people, perfect realism \u003Cu\u003Eis\u003C/u\u003E the fun. But as I just said, \u0022for \u003Cu\u003Esome\u003C/u\u003E people, perfect realism is the fun.\u0022 The glorious thing about KSP is that it\u0027s capable of both (if people aren\u0027t hung up on \u0022must be stock\u0022). It frustrates me greatly to watch threads where people get upset about \u0022how\u0022 others are having fun, rather than embracing the game they enjoy and being excited that others \u0022are\u0022 having fun.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nPersonally, I think that design philosophy is holding KSP back. Back in the days where getting to orbit was most of the game (and maybe the Mün if you were really good), trial and error worked fine. All your flights were relatively short and you could iterate quickly. If you stranded the odd kerbal on the Mün, then help (or likely another crash \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E ) was just a day away in game time.\n\u003C/p\u003E\n\u003Cp\u003E\nThese days, trial and error just gets in the way. Game mechanics can\u0027t be too challenging because the penalty for failure can\u0027t be too extreme. Game mechanics are hobbled in some cases because they\u0027re just too hard to balance assuming the player is using trial-and-error. The parts test contracts spring to mind - given some decent planning tools they could be a lot more fun. As it is, I\u0027m either not going to bother trying them for the paltry reward, or I\u0027m going to \u0027revert flight\u0027 a whole lot in the process - which takes away a lot of the point of Career mode since it allows the penalties for failure to be eliminated at a stroke.\n\u003C/p\u003E\n\u003Cp\u003E\nDoing anything interplanetary is discouraged because who wants to spend months of game time flying a ship to Duna, only to have it fail at the last minute because you didn\u0027t trial and error your fuel load correctly? Finally, as you mentioned in an earlier post, simultaneous missions are discouraged because if you do pancake that Duna probe you have two unappetising choices, either reiterate, start again and wait another umpteen months of game time, or redo the mission and lose whatever progress you made on your other missions.\n\u003C/p\u003E\n\u003Cp\u003E\nI also think that flexibility is KSP\u0027s weakness as well as its strength, particularly in career mode. It makes for a superlative sandbox and a career game that tries to be all things to all people but also falls short of the mark for all people. I appreciate what you\u0027re saying but I also think that Sandbox mode provides ample scope for all the Ferris Wheels, trains, helicopters, or whatever you want to build. For Career mode, I say dial back the flexibility and give us more of what was intended - a space program management game. If that means that some creative freedom is lost along the way, then so be it.\n\u003C/p\u003E\n\u003Cp\u003E\nThat doesn\u0027t necessarily mean layering on oodles and oodles of detail (such as fuel sloshing and limited restart engines for example \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E ) - the very best games combine simplicity \u003Cem\u003Eand\u003C/em\u003E depth. The problem with KSP Career mode is that it doesn\u0027t have either - the basics of playing the game are not simple and the game as a whole lacks depth. And it lacks depth because, in most cases, adding depth would be unfair on players - if they\u0027re assumed to be playing through trial and error.\n\u003C/p\u003E\n\u003Cp\u003E\nJust my thoughts anyhow. Feel free to disagree. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-12-07T15:52:59Z\u0022 title=\u002212/07/2015 03:52  PM\u0022 data-short=\u00228 yr\u0022\u003EDecember 7, 2015\u003C/time\u003E by KSK\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"juanml82","CreatedById":105344,"CreatedDateTime":"2015-12-07T15:52:27Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222309689\u0022 data-ipsquote-contentid=\u0022126641\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221449345712\u0022 data-ipsquote-userid=\u0022100668\u0022 data-ipsquote-username=\u0022Claw\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 5/12/2015 17:01:52, Claw said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222311997\u0022 data-ipsquote-contentid=\u0022126641\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221449503304\u0022 data-ipsquote-userid=\u002261025\u0022 data-ipsquote-username=\u0022KSK\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 minutes ago, KSK said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n(snip)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI agree. Trial and error doesn\u0027t work for interplanetary and more complex missions and fleet/space program managment\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-12-07T15:53:02Z\u0022 title=\u002212/07/2015 03:53  PM\u0022 data-short=\u00228 yr\u0022\u003EDecember 7, 2015\u003C/time\u003E by juanml82\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2015-12-07T17:14:28Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222311997\u0022 data-ipsquote-contentid=\u0022126641\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221449503304\u0022 data-ipsquote-userid=\u002261025\u0022 data-ipsquote-username=\u0022KSK\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, KSK said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThese days, trial and error just gets in the way. Game mechanics can\u0027t be too challenging because the penalty for failure can\u0027t be too extreme. Game mechanics are hobbled in some cases because they\u0027re just too hard to balance assuming the player is using trial-and-error. The parts test contracts spring to mind - given some decent planning tools they could be a lot more fun. As it is, I\u0027m either not going to bother trying them for the paltry reward, or I\u0027m going to \u0027revert flight\u0027 a whole lot in the process - which takes away a lot of the point of Career mode since it allows the penalties for failure to be eliminated at a stroke.\n\u003C/p\u003E\n\u003Cp\u003E\nDoing anything interplanetary is discouraged because who wants to spend months of game time flying a ship to Duna, only to have it fail at the last minute because you didn\u0027t trial and error your fuel load correctly? \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat\u0027s sort of my point. If a player is unwilling to even do part test contracts, because failure means they can just revert, why would they want to spend most of their play time to fly all the way out to somewhere just to find out that they not only fell short on fuel, but that they are also short on LS. Or even if they were just short on fuel, the crew is dead now because they can\u0027t wait two years for rescue. Is that realistic? Yep. But now it\u0027s just another revert away. So difficulty is just sidestepped anyway. There isn\u0027t even a reason to bother building a rescue mission.\n\u003C/p\u003E\n\u003Cp\u003E\nLike I said, if you want complex gameplay, you have to give the player some complex tools.\n\u003C/p\u003E\n\u003Cp\u003E\nI don\u0027t think we disagree. I just know that the current KSP design philosophy doesn\u0027t support the idea of complex tools. Therefore I\u0027m not a fan of something like LS, because it hobbles core gameplay without adding in something unique. (\u0022You now need part X to do the same thing you did last week.\u0022) Same for a comm network. (\u0022You now need a satellite network so you can land a probe on the planet and do nothing.\u0022) Same for nearly anything that relies on time.\n\u003C/p\u003E\n\u003Cp\u003E\nThose things need to be looked at from a holistic view. Adding them on one part at a time is what gives a disjointed, \u0022something is missing\u0022 feeling. KSP is what it is, and to expect radical change this late might be optimistic. If it\u0027s not going to get radical change, then anything new needs to enhance the core mechanics, or else it just adds to the disjointed feeling.\n\u003C/p\u003E\n\u003Cp\u003E\nSo it\u0027s never a question of \u0022realism\u0022 vs. \u0022lol kerbal\u0022 in my mind.\n\u003C/p\u003E\n\u003Cp\u003E\nTake the comm network for example. Instead of the only new mechanic being \u0022you need a comm network to control your probe, just like you could last week.\u0022 Add some new features with it, but features that contribute to core gameplay. It can still be required for probe control, but take the opportunity to add something that pushes core gameplay. Then people are more willing to accept it.\n\u003C/p\u003E\n\u003Cp\u003E\nFor example: How about certain (maybe larger sized) probe cores can add waypoints and transmit them over the network. Then smaller and larger probe cores can receive them for navigation. Maybe I can even queue narrow band maps to that waypoint. Now I\u0027ve just given the player a new tool for planning and exploring, and a reason to build a comm network. Probe cores get something unique, and I didn\u0027t force the need for life support as a balance factor. You get a bonus for building something without it simply being a purely new barrier to old gameplay. Is that all perfectly realistic, probably not. But it\u0027s also not \u0022lol so kerbal.\u0022 It\u0027s something in the middle, but more importantly it aids the player\u0027s ability to explore and go fly somewhere.\n\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2015-12-07T20:38:15Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222312097\u0022 data-ipsquote-contentid=\u0022126641\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221449508468\u0022 data-ipsquote-userid=\u0022100668\u0022 data-ipsquote-username=\u0022Claw\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Claw said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n*snip*\n\u003C/p\u003E\n\u003Cp\u003E\nLike I said, if you want complex gameplay, you have to give the player some complex tools.\n\u003C/p\u003E\n\u003Cp\u003E\nI don\u0027t think we disagree. I just know that the current KSP design philosophy doesn\u0027t support the idea of complex tools. Therefore I\u0027m not a fan of something like LS, because it hobbles core gameplay without adding in something unique. (\u0022You now need part X to do the same thing you did last week.\u0022) Same for a comm network. (\u0022You now need a satellite network so you can land a probe on the planet and do nothing.\u0022) Same for nearly anything that relies on time.\n\u003C/p\u003E\n\u003Cp\u003E\nThose things need to be looked at from a holistic view. Adding them on one part at a time is what gives a disjointed, \u0022something is missing\u0022 feeling. KSP is what it is, and to expect radical change this late might be optimistic. If it\u0027s not going to get radical change, then anything new needs to enhance the core mechanics, or else it just adds to the disjointed feeling.\n\u003C/p\u003E\n\u003Cp\u003E\n*snip*\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNo - I don\u0027t think we do disagree and that\u0027s a very good point about taking the wider view. Like it or not, I doubt the core gameplay of KSP is going to change much now so, yeah, additions need to factor that in. For what its worth, I thought your ideas for satellite networks were great!\n\u003C/p\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2015-12-08T02:26:07Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222312097\u0022 data-ipsquote-contentid=\u0022126641\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221449508468\u0022 data-ipsquote-userid=\u0022100668\u0022 data-ipsquote-username=\u0022Claw\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n20 hours ago, Claw said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nLike I said, if you want complex gameplay, you have to give the player some complex tools.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSee I don\u0027t think we do need complex tools, I just think we need simple ones. I mean we have COM, COL and COT indicators to get a plane off the runway. It guides trial and error, and helps a player improve even as they experiment. But then we\u0027re expected to get to Eeloo by eyeball. It\u0027s not surprising that so few players make it to other planets, as we really don\u0027t have the tools to do so. It wouldn\u0027t take a total game overhaul to get there. There could be a really simple Mission Planner in Mission Control or the Tracking Station, where you could select \u0022Starting Body\u0022 and \u0022Target Body\u0022 and be supplied with:\n\u003C/p\u003E\n\u003Cp\u003E\nTime until next Transfer window: x [Set Alarm]\n\u003C/p\u003E\n\u003Cp\u003E\nDelta V to Orbit (100km): x\n\u003C/p\u003E\n\u003Cp\u003E\nDelta V to Transfer: x\n\u003C/p\u003E\n\u003Cp\u003E\nTime until Intercept: x [Set Alarm]\n\u003C/p\u003E\n\u003Cp\u003E\nDelta V to Capture (100km): x\n\u003C/p\u003E\n\u003Cp\u003E\nDelta V to Surface: x\n\u003C/p\u003E\n\u003Cp\u003E\nThen you could repeat the process for the return journey. I know there\u0027s concern about overwhelming new players with too much data, and I actually agree that initial phase of throwing things together and seeing what happens is a really fun, important part of learning. You can very easily get to Minmus or the Mun without it. It\u0027s going beyond that to building complex interplanetary missions that really requires this kind of information. The easy solution to this is to make it part of a building upgrade, so that its locked until players really need it. The same could be done in the VAB supplying dV and TWR on tier 2 or 3 out of 4. If later life support were added, Available Life Support could be displayed in days in the engineer\u0027s report, and then players could easily compare with the Mission Planner to see if they were appropriately supplied. \n\u003C/p\u003E\n\u003Cp\u003E\nI get what you\u0027re saying about the spirit of the game, its just a progression question, really. None of this seems fundamentally different from supplying players with engine thrust or solar panel output information, nor does it impede players from making whatever wacky cool thing they choose. If anything it helps them push the limits of what is possible. Its just a question of when to make new information available to a player to help them grow and do bigger and cooler things. Nor does the limitation LS might put on players seem fundamentally different from the limits the new aerodynamics or heat models impose. If it were staged generously you wouldn\u0027t have to worry too much about it early on. Kerbals in hibernation or on strike could still be rescued, and I\u0027m sure people who didn\u0027t want to think about it could turn it off. I totally agree there are a ton of more pressing things the dev\u0027s might address, and even I would want to see building tiers and the experience system fleshed out and a pass at science before spending time on LS. Still, it has the potential to add an amazing layer to long-term gameplay.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-12-08T14:12:26Z\u0022 title=\u002212/08/2015 02:12  PM\u0022 data-short=\u00228 yr\u0022\u003EDecember 8, 2015\u003C/time\u003E by Pthigrivi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-12-08T03:42:04Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222309887\u0022 data-ipsquote-contentid=\u0022126641\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221449354185\u0022 data-ipsquote-userid=\u0022119411\u0022 data-ipsquote-username=\u0022tater\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 05/12/2015 22:23:05, tater said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nComm networks as added to KSP in mods are not even slightly realistic, they are needlessly tedious, particularly given that the distance from Kerbol to Eeloo is about 1/2 the distance from Sol to Venus, right?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nEver tried AntennaRange? You can perfectly well use the big dish to connect directly to Kerbin from anywhere in the system, just like how real spacecraft talk to the Deep Space Network - right up until the planet you\u0027re orbiting gets in the way. That IMHO is how it should be.\n\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2015-12-08T06:41:44Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222312896\u0022 data-ipsquote-contentid=\u0022126641\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221449541567\u0022 data-ipsquote-userid=\u0022105624\u0022 data-ipsquote-username=\u0022Pthigrivi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Pthigrivi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSee I don\u0027t think we do need complex tools, I just think we need simple ones.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell, maybe we should chock this one up to differences in my meaning of \u0022complex\u0022 the the context of the Kerbal universe. As under the current philosophy, a dV readout is considered complex. So without diving into specific examples, the types of things you threw out are along the lines of what I mean. (Like \u0022Time until next optimum transfer window.\u0022)\n\u003C/p\u003E\n"},{"CreatedByName":"Hannu2","CreatedById":154334,"CreatedDateTime":"2015-12-08T08:38:20Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222309606\u0022 data-ipsquote-contentid=\u0022126641\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221449341433\u0022 data-ipsquote-userid=\u0022105624\u0022 data-ipsquote-username=\u0022Pthigrivi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 5.12.2015 klo, Pthigrivi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI do think though that long term, if done right, LS could add a lot more than adding mandatory parts.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis is true. Typically LS is just that you put few parts on ship and little larger fuel tanks and launcher. But errors and failures is what makes things interesting. For example it is possible to cut 10-20 % from travel time with relatively low increase of DV. But I if plan to use that and then use too much fuel at target, for example for landings, or error in KSP\u0027s trajectory prediction guides me to wrong return orbit I send resource ship. Some of my most interesting missions have been light emergency supply ships to ships on interplanetary trajectories. They must have more than 10 km/s dv and ability to make rendezvous on solar orbits. Also forgetting life supplies of Minmus crafts have lead to interesting abort and rescue operations.\n\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2015-12-08T16:04:16Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222312984\u0022 data-ipsquote-contentid=\u0022126641\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221449546124\u0022 data-ipsquote-userid=\u0022104935\u0022 data-ipsquote-username=\u0022cantab\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n12 hours ago, cantab said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nEver tried AntennaRange? You can perfectly well use the big dish to connect directly to Kerbin from anywhere in the system, just like how real spacecraft talk to the Deep Space Network - right up until the planet you\u0027re orbiting gets in the way. That IMHO is how it should be.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah, I was talking about RT (implicit in my talking about comm \u0022networks.\u0022\n\u003C/p\u003E\n"},{"CreatedByName":"bn880","CreatedById":82903,"CreatedDateTime":"2015-12-30T18:59:48Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222309887\u0022 data-ipsquote-contentid=\u0022126641\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221449354185\u0022 data-ipsquote-userid=\u0022119411\u0022 data-ipsquote-username=\u0022tater\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 12/5/2015 at 5:23 PM, tater said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nComm networks as added to KSP in mods are not even slightly realistic, they are needlessly tedious, particularly given that the distance from Kerbol to Eeloo is about 1/2 the distance from Sol to Venus, right?\n\u003C/p\u003E\n\u003Cp\u003E\nHere\u0027s why I chimed in on LS, and why I would actually welcome a \u003Cem\u003Echance\u003C/em\u003E of part failures in career (perhaps via a mechanic where parts were gained on an \u0022experimental\u0022 basis until tested a certain number of hours/days/whatever). I\u0027d like to see reliability a factor vs other benefits of parts. So you pick upper stage engines based upon reliability (as Apollo did) and restart. Heck, I\u0027d also be in favor of changing the throttling ability of engines to be far more realistic, as well as restart not being a thing for many. Note that these forms of realism would only come into play at all in the context of career alone (and career needs a gut-job improvement, frankly).\n\u003C/p\u003E\n\u003Cp\u003E\nCurrently there is no mechanic whereby crewed missions are any different than uncrewed missions. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAgreed on reliability, it\u0027s a part of Engineering and space travel.  Gameplay suffers a lot in career mode due to the lack of it.\n\u003C/p\u003E\n"},{"CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2015-12-31T00:31:32Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222309577\u0022 data-ipsquote-contentid=\u0022126641\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221449340183\u0022 data-ipsquote-userid=\u0022100668\u0022 data-ipsquote-username=\u0022Claw\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 05/12/2015 at 7:29 PM, Claw said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHere\u0027s the deal with all of this, that drives me into complete insanity. This game is a sandbox at heart. We can argue up and down, but the basic premise the game started with was \u0022build whatever and go where ever.\u0022 It grew with a lot of additions, but the core mechanics have remained unchanged.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSo while I\u0027m not categorically opposed to the addition of Life Support, I would like to see it being done in a way that isn\u0027t simply another limiting factor added to the game. Is it a limiting factor in real life? Yep, it sure is. But if life support just becomes another \u0022you must attach X number of part Y on your ship to fly for time Z\u0022, that also becomes \u0022boring\u0022 to me. If it becomes a matter of development time, I would much rather see time spent adding more powerful tools in the game first. Tools that allow for complex mission planning and mission management. I\u0027d rather be able to fly more simultaneous missions to more places in complex ways, than to have to add more parts to my already laggy ships just so I can go on the same flights that I already do.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIf we want to get into the realism debate, those complex mission management tools are just as \u0022grass roots.\u0022 Do I have a team of hundreds of thousands of scientists and a huge array of supercomputers at my disposal? Nope. A real space program consists of a couple more people than just me and a flight crew. Yet that part is often overlooked in the \u0022should KSP be a lol wacky simulator, or hardcore engineering design sim\u0022 debate. There is a nice middle ground in there too, though I\u0027m sure there are plenty of people who disagree. If you want a complex game with comm network and life support requirements, then you need to give the player complex tools to be able to figure it all out.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIn any case, I don\u0027t mean to sidetrack the overall theme of the thread onto a specific topic. I suppose that was one example (in my mind) that I\u0027m probably more of a 75%, than a 0 or 100%. But that\u0027s probably a bit of a simplification as well. I\u0027m onboard with fairly realistic physics (doesn\u0027t have to be n-body and atomic level CFD though), but I\u0027m not a fan of adding things like fuel slosh, limited firings on engines, etc. into the core game. Those elements are also all realistic, but it\u0027s still a video game. Added elements can (and should) provide new challenges, but they should also done with the mindset of adding to the \u0022build whatever and go where ever\u0022 core of the game.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI agree with this in 10000%\n\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2015-12-31T01:11:29Z","Content":"\n\u003Cp\u003E\nOne, \u0022comm networks\u0022 as per RT are not realistic. If we had finite ground stations and bandwidth, then maybe we\u0027d need to think about other solutions, but particularly given the tools in KSP it is just tedious (the lack of automated station keeping, for example).\n\u003C/p\u003E\n\u003Cp\u003E\nTwo, regarding LS \u0022adding more parts\u0022 in effect is \u0022adding more mass.\u0022 In the long run, that\u0027s all LS is, requiring bigger and more massive craft for missions that require longer durations. It need not micromanage every aspect of LS, it literally only needs to consider the base mass of the mechanical LS systems (many would be folded into existing crewed parts anyway), and then the net consumed mass per day. Sure, water might be recycled at 94% or something like that, and food much less so, but in the end all that matters is the net extra mass you must take. That\u0027s it, it\u0027s just mass. If you wanted to be more complex, do what Roverdude is talking about and have some requirement for ha volume per kerbal per unit time (they need nicer digs for a 10 year mission than a 10 day mission).\n\u003C/p\u003E\n\u003Cp\u003E\nIf you are going to send in effect a mk1 capsule to Duna, and that\u0027s all you can manage, then it should be a probe.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-12-31T02:53:26Z\u0022 title=\u002212/31/2015 02:53  AM\u0022 data-short=\u00228 yr\u0022\u003EDecember 31, 2015\u003C/time\u003E by tater\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"r_rolo1","CreatedById":26192,"CreatedDateTime":"2015-12-31T02:12:09Z","Content":"\n\u003Cp\u003E\nTo the OP:\n\u003C/p\u003E\n\u003Cp\u003E\nThe original idea for this game, as stated by Harv himself, was basically a 2,5D rocket launch into the atmo of a single planet that got on rails and 2D as soon as you left the atmo ... in other words ( the ones of ex-SQUAD MaxMaps ) a little more than a flash game , and more , made by someone that admitted that he only really learned about orbital mechanics while coding the game \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E So, the game has been since the beginning being steadily drifting towards more realism and that is a good thing \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E ( atleast IMHO ... I\u0027m pretty sure I would not play \u0022Angry Kerbals throw rockets to space\u0022 for a long time \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E )\n\u003C/p\u003E\n\u003Cp\u003E\nThat aside, and adressing the actual OP point , I think that eventually most parts on the game will end being very close of RL counterparts ... simply because the similar laws of physics ( hopefully \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E ) will force convergent  solutions. Not necessarily equal, but surely close in terms of actual performance.\n\u003C/p\u003E\n\u003Cp\u003E\nP:S I do not understand the logic behind the test on the second option of the poll. Kerbal rockets are not whacky or even explodey, atleast not more than human ones: their parts are so overengineered for crash tolerance and heat resistance their rockets would not reach space in Earth and TBH I can\u0027t even do half of the crazy things that were done in RL within stock KSP ( say, like tethering two objects at diferent orbits to catapult the lower one higher at the expense of the other ... or, my favourite, how one of the biggest space agencies in the world used for decades as their staple ship a glider with custom engines with loads of gimbal bolted sideways to a rocket mostly pushed by some really big SRB \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E  Infact, the game doesn\u0027t even have SRB with thurst vectoring, something that predates the Apollo program :/ ). The whacky ones are us, not the Kerbals \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-12-31T02:33:54Z\u0022 title=\u002212/31/2015 02:33  AM\u0022 data-short=\u00228 yr\u0022\u003EDecember 31, 2015\u003C/time\u003E by r_rolo1\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Requia","CreatedById":112924,"CreatedDateTime":"2015-12-31T02:23:42Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222309589\u0022 data-ipsquote-contentid=\u0022126641\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221449340705\u0022 data-ipsquote-userid=\u0022117163\u0022 data-ipsquote-username=\u0022Jovus\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 12/5/2015 at 11:38 AM, Jovus said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI just want my wet/dry ratios to both make sense and not be terrible. :/\u003Cbr\u003E\u003Cbr\u003E\nIt\u0027s not even the 9:1 that bothers me so much, actually, as that it\u0027s randomly different across parts and fuels.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe stock tanks all have exactly the same wet:dry ratio to the nearest kilogram. The variations in percentages are just rounding errors.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-12-31T02:24:06Z\u0022 title=\u002212/31/2015 02:24  AM\u0022 data-short=\u00228 yr\u0022\u003EDecember 31, 2015\u003C/time\u003E by Requia\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"wumpus","CreatedById":133850,"CreatedDateTime":"2015-12-31T16:03:42Z","Content":"\n\u003Cp\u003E\nI like the \u0022kerbal\u0022 level of realism.  I am also very glad that the realism overhaul set of mods exist, and when I am \u0022done\u0022 with KSP proper I expect to spend time in the \u0022real\u0022 thing.\n\u003C/p\u003E\n\u003Cp\u003E\nI want explosive staging back.  To me that was the \u0022most kerbal\u0022 part of the game and I miss it.\n\u003C/p\u003E\n"}]}