{"TopicId":126889,"ForumId":70,"TopicTitle":"Ship shaking violently itself apart KSP 1.05","CreatedByName":"Sheppard","CreatedById":93282,"CreatedDateTime":"2015-12-02T22:06:58Z","PageNum":1,"Articles":[{"CreatedByName":"Sheppard","CreatedById":93282,"CreatedDateTime":"2015-12-02T22:06:58Z","Content":"\n\u003Cp\u003E\nYesterday I had a nasty little bug on a modded install (Mech Jeb, AVP V2, EVE, Protractor, Docking port Indicator, Enhanced Navball, Asteroid Day, Hyper Edit, Alarm Clock, Module Manager, all up-to-date). Have not encountered it before. Posted this also in the \u0022Grand KSP 1.05 Discussion Thread\u0022, but decided to ask here for help, since it is more appropriately. \n\u003C/p\u003E\n\u003Cp\u003E\nAfter decoupling a stage on my ship in solar orbit heading for Moho, after 10-20 seconds, the ship starts to shake violently and tears itself apart. It doesn\u0027t matter if SAS is on or not. Warping time does not fix it. Going back to space center does not fix it. Restarting the game does not fix it. I have to mention that I have clipped fuel tanks in the design, but if this was the problem, I should have encountered the bug before staging and on other ships that have a similar design.\n\u003C/p\u003E\n\u003Cp\u003E\nActivating SAS and moving the ship or changing to point from where it is controlled seems to accelerate the process, but the shaking start also without me doing anything.\n\u003C/p\u003E\n\u003Cp\u003E\nHere are the files, if anyone wants to take a look, and hopefully offer a solution (hope I have included all): \u003Ca href=\u0022http://www.4shared.com/get/tfWvf-Viba/KSP_Bug_files.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.4shared.com/get/tfWvf-Viba/KSP_Bug_files.html\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nJust load the quicksave on the ship \u0022Icarus\u0022 in solar orbit and wait 10-20sec for the shaking to start.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m running the Steam version of KSP, version 1.05, so everything is up-to-date.\n\u003C/p\u003E\n\u003Cp\u003E\nHere are some screenshots with the bloody thing:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ciframe class=\u0022imgur-album\u0022 frameborder=\u00220\u0022 height=\u0022550\u0022 src=\u0022//imgur.com/a/vOoZB/embed?background=ffffff\u0026amp;text=1a1a1a\u0026amp;link=4e76c9\u0022 width=\u0022100%\u0022\u003E\u003C/iframe\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI can\u0027t really continue to play anymore without fixing this, because it\u0027s critical to my gameplay. I have to burn 800m/s in the next hours with the ship to encounter Moho, or everything will be lost and in vain. It took a lot of hours of work to design the ship, all the little side-ships, assemble all in orbit and plot a decent course to Moho within my dV. I really hope someone can help me fix this and save the ship.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-12-02T22:08:51Z\u0022 title=\u002212/02/2015 10:08  PM\u0022 data-short=\u00228 yr\u0022\u003EDecember 2, 2015\u003C/time\u003E by Sheppard\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Sheppard","CreatedById":93282,"CreatedDateTime":"2015-12-03T16:22:23Z","Content":"\n\u003Cp\u003E\nWell I kind of found a solution. By cheating! I put one of the Kerbals on EVA and left him there as a reference. Using Hyperedit I landed the ship on Kerbin (it disintegrated into a couple tens of debris which I recovered to get my money and crew back). Then, I edited the last stage of my ship (the one in the screenshots) and strutted the hell out of that portion that started shaking. Again using Hyperedit, I rendezvous my ship within 600m of the Kerbal left in solar orbit, boarded the ship and that\u0027s it. I now have my ship back, on the same course, with the same crew.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe struts seem to hold everything in place. Will see if the sudden shaking and wobbling returns. So far, so good.\n\u003C/p\u003E\n"},{"CreatedByName":"Jetski","CreatedById":119969,"CreatedDateTime":"2015-12-14T17:25:12Z","Content":"\n\u003Cp\u003E\nI had the same problem with a lander I built, 4 lf tanks radial mount on a lander capsule, 1 nuke at the bottom.  Tanks started shaking and smashed up ship.  Added struts, now it\u0027s fine.\n\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2015-12-14T17:45:18Z","Content":"\n\u003Cp\u003E\nWell something is very wrong with the SAS in 1.0.5 in general. Its too harsh and constantly over corrects. \n\u003C/p\u003E\n"},{"CreatedByName":"radonek","CreatedById":84077,"CreatedDateTime":"2015-12-14T18:33:33Z","Content":"\n\u003Cp\u003E\nI had similar problem with two asteroid-pushers. I have two possible culprits: one is using timewarp to stop rotation, other is struts attached to the Klaw.\n\u003C/p\u003E\n"},{"CreatedByName":"Stone Blue","CreatedById":77721,"CreatedDateTime":"2015-12-14T18:58:51Z","Content":"\n\u003Cp\u003E\nYeah, on an asymetrical ship like that, I\u0027m not surprised you had issues...\u003Cbr\u003E\u003Cbr\u003E\nHave you ever heard of \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/50911-105-kerbal-joint-reinforcement-v314-62215/\u0022\u003EKerbal Joint Reinforcement\u003C/a\u003E ?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Perry Apsis","CreatedById":97519,"CreatedDateTime":"2015-12-15T04:07:48Z","Content":"\n\u003Cp\u003E\nHad a similar problem with one ship in... Yeesh, I think it was 1.0.4, but it could have been 1.0.5. Restoring from a quick save would mean you had 10-30 seconds before it started again. If I warped when it was just beginning, it would stop it but then it would start again shortly after stopping warp. And of course, once it was going I couldn\u0027t warp because the ship was accelerating. Tried it with/without SAS. Eventually I rebuilt the ship from scratch and it never happened again.\n\u003C/p\u003E\n\u003Cp\u003E\nAside from MJ, Module Manager, and Hyperedit, nothing really in common with your mod list. I\u0027m inclined to think it\u0027s a bug in the game itself and not related to a mod.\n\u003C/p\u003E\n"},{"CreatedByName":"ColKlonk","CreatedById":137078,"CreatedDateTime":"2015-12-15T06:01:09Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222322419\u0022 data-ipsquote-contentid=\u0022126889\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221450115118\u0022 data-ipsquote-userid=\u002266349\u0022 data-ipsquote-username=\u0022Motokid600\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n12 hours ago, Motokid600 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWell something is very wrong with the SAS in 1.0.5 in general. Its too harsh and constantly over corrects. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThere\u0027s nothing very wrong with it.. it just doesn\u0027t work properly ..period.  :-)\n\u003C/p\u003E\n\u003Cp\u003E\nHas been like this ever since I bought this game.... pity, as Orbiter\u0027s SAS/RCS works \u0027perfectly\u0027.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}