{"TopicId":126842,"ForumId":36,"TopicTitle":"Open Source Part Challenges?\u0060","CreatedByName":"artwhaley","CreatedById":118388,"CreatedDateTime":"2015-12-02T03:28:01Z","PageNum":1,"Articles":[{"CreatedByName":"artwhaley","CreatedById":118388,"CreatedDateTime":"2015-12-02T03:28:01Z","Content":"\n\u003Cp\u003E\nWe used to have a thing here in the forums where we picked a part category and then everyone went to work building a part for that category?  It was a bit of a competition, but mostly it was for fun and education - making a single part is a lot less scary than making an entire mod pack...  and the thread was open for discussion if you ran into hangups along the way.  And at the end all the parts were posted with full 3d models, unity files, and textures so anyone could download and learn from them.  \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI always enjoyed it!  Is anyone else interested in getting this going again?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027d also thought about slowing turning some of those open source parts into a library of sorts... with an up to date part in as many categories as possible... a docking port, a control surface, a landing leg, etc...  with full unity source files and some documentation, so anyone that\u0027s having problems setting one up could download a complete and working example.  I\u0027m happy to do some organization on it, if it\u0027s something people would be willing to contribute to and think would be useful?\n\u003C/p\u003E\n"},{"CreatedByName":"wasml","CreatedById":120438,"CreatedDateTime":"2015-12-03T02:12:53Z","Content":"\n\u003Cp\u003E\nI like the idea and had followed some of the old part challenges. I think working examples would be very useful. That said my modeling skills are very basic (to put it kindly) and time to help with this would be extremely limited.\n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2015-12-03T02:43:58Z","Content":"\n\u003Cp\u003E\nI\u0027d do that.\n\u003C/p\u003E\n"}]}