{"TopicId":126972,"ForumId":51,"TopicTitle":"Forgotten Space Program","CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2015-12-04T01:02:10Z","PageNum":62,"Articles":[{"CreatedByName":"Thedrelle","CreatedById":145967,"CreatedDateTime":"2018-08-22T16:10:35Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223437769\u0022 data-ipsquote-contentid=\u0022126972\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221534876664\u0022 data-ipsquote-userid=\u002269224\u0022 data-ipsquote-username=\u0022Cydonian Monk\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n21 hours ago, Cydonian Monk said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI usually tweak my \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E before liftoff to be between 1.1 and 1.5, and the kOS scripts I was using are tuned for that range.\n\u003C/p\u003E\n\u003Cp\u003E\nThe issue was somehow related to autostruts. If I had autostruts on anything, the craft was basically impossible to control after a certain point and the kraken took over. Sometimes that point was 1cm above the launchpad, sometimes it was 20km. Rarely, as evidenced by the Germanium 1, it was in orbit. If I disabled all autostruts the issues went away, so I did that and went back to using conventional struts. \n\u003C/p\u003E\n\u003Cp\u003E\nThose issues appear to have been fixed in v1.4.x. \n\u003C/p\u003E\n\u003Cp\u003E\nFWIW, KSP v1.3.x was so bug-ridden and unstable for me (both with and without mods) that I stopped playing the game for more than a year (this bit of Forgotten that I flew in February and March notwithstanding). At this point I\u0027m just glad the game is somewhat playable again.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nautostruts, huh? maybe that\u0027s part of my problem.. sometimes my rockets turn into snakes. \n\u003C/p\u003E\n\u003Cp\u003E\nI usually keep my \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E around 1.6-2.0, and turn off \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E if the kraken comes a callin\u0027.  My \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003Etwr\u003C/abbr\u003E is probably needlessly high. I also never have such massive payloads. \n\u003C/p\u003E\n"},{"CreatedByName":"Garibaldi2257","CreatedById":98008,"CreatedDateTime":"2018-08-22T21:52:31Z","Content":"\n\u003Cp\u003E\nYou might wanna tone it down to 1.3 to 1.7 or so.  2.0 is way high, and you\u0027re probably wasting fuel fighting the atmosphere.\n\u003C/p\u003E\n"},{"CreatedByName":"Thedrelle","CreatedById":145967,"CreatedDateTime":"2018-08-23T16:38:02Z","Content":"\n\u003Cp\u003E\naw, but I love it when my rockets look like fireballs leaving the atmosphere, just like when they enter it!\n\u003C/p\u003E\n\u003Cp\u003E\nreally, i will start adjusting my launches and see what that does for me. thanks!\n\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2018-09-17T01:46:55Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cstrong\u003ETitanium: The Next Generation\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThat expert was none other than famous rocket scientist Wernher von Kerman. Jonbald had sent him and Gene into orbit to protect them from the usual cycle-based turmoil, and had hoped they would be able to work remotely until all operations had transferred to Copper Station. Unfortunately he needed their attention here, on the surface, their hands guiding the workers as they assembled their rockets and spacecraft. He had overestimated the ability of a mostly untrained populace in building and operating complex machinery. Jonbald himself was proof enough they could safely return and be protected from disappearing into whatever void it is that claims kerbals when the cycles hit. \n\u003C/p\u003E\n\u003Cp\u003E\nOf course he didn\u0027t really need to bring them back to have Wernher and Gene on-planet. He could always imprint another pair of kerbals at the crashed UFO, using the skills and memories of the long-disappeared versions of the Wernher and Gene who first discovered it. Do that and he\u0027d have another Gene and another Wernher. Except that doing so would cross a line even Jonbald was wary of. It was one thing to give these new Wernhers their old memories, to give a fresh Gene his old leadership skills, but another thing entirely to destroy the mind of an otherwise innocent kerbal. He was already suspicious of the machine itself, an alien device of unknown origin which he himself barely understood after nearly a decade of use and research. Using it to imprint other kerbals was wrong, perhaps a crime, and was not something Jonbald cared to do. \n\u003C/p\u003E\n\u003Cp\u003E\nUnless another Wernher or another Gene showed up, that is. Jonbald had never fully understood the disappearances and other peculiarities, but throughout all of it there had only been one set of these two familiar kerbals at one time. He was aware of multiple Jebediahs and Bills and Bobs sometimes meeting their copies, but those three were so clueless that nothing much could bother them. How would an intelligent kerbal adapt to meeting its double? (He had wondered once what became of the army of Jebs Albro had at his command, but concluded they must have met a fate similar to the many kerbals Albro had stranded. Albro\u0027s many shadow projects, from OTS to OSD to Continuum itself, had always used kerbals as disposable. It was something Jonbald worked to change when he took over, but there was little to no accounting of what had gone before.)\n\u003C/p\u003E\n\u003Cp\u003E\nSo here they were. At present there was only the one Gene and the one Wernher, and they were in the wrong place. Additionally, there were fresh kerbals on Kerbin who needed experience and flight time. Crews Jonbald had started training as soon as the space program restarted. These crews needed to go up, and the crews up there needed to come down. They could either keep throwing away capsules, or they could return to an older, proven design. A design which had produced three flight-proven craft: Titanium. \n\u003C/p\u003E\n\u003Cp\u003E\nOf the three previous Titanium craft, two were stuck in orbit at the Transfer One, while the third had somehow survived down on the surface. (It wasn\u0027t unheard of for such aircraft to survive the cycles. Jonbald\u0027s own personal jet a prime example.) They suspected the two Titaniums in orbit had been there too long, and didn\u0027t trust them to land safely. (Their chosen landing gear were no longer considered in-spec for a craft as heavy as the Titanium orbiter.) And the third one on Kerbin was little more than an airframe test unit. Still, he felt it could prove useful, and asked the ground crews to move it into the \u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E and keep it protected and under cover.\n\u003C/p\u003E\n\u003Cp\u003E\nThe overall design was good, but needed some tweaks. Obviously the landing gear had to be improved to the point that it could withstand touchdown of such a heavy vehicle. Older variants had limited flight capability, the two Juno jet engines were only capable of extending the glide post-reentry. Four Junos would be enough to make the Titanium an actual aircraft, capable of a runway takeoff and free flight when not full of rocket fuel. And finally the hack-job of a probe core was replaced with a larger, inline core, capable of flying the craft to and from orbit on its own.\n\u003C/p\u003E\n\u003Cp\u003E\nOnce the initial changes were complete, Jonbald had ordered construction and integration of a new orbiter. They didn\u0027t have much in the way of production capacity - all of their tooling was designed for the more traditional rockets - but producing a one-off should be easy.\n\u003C/p\u003E\n\u003Cp\u003E\nThe process resulted in the Titanium Y-series orbiter. \n\u003C/p\u003E\n\u003Cp\u003E\nThe first (and so far only) vehicle in the series, Ti-Y-1, was being prepared for flight when Gene and Wernher started out for Copper Station. Both of them had spent all of their time in orbit at Manganese Station; Wernher running orbital science operations while Gene managed the day to day tasks of the agency (and occasionally remote launch and flight director duties). They both hopped into an Iron shuttle and used it to transfer to Copper Station, awaiting the arrival of the first of the new Titaniums.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180324_ksp0496_fe-xfer.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022604\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180324_ksp0496_fe-xfer.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180324_ksp0507_fe-xfer.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022602\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180324_ksp0507_fe-xfer.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n--\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nThey needn\u0027t wait long, as the Titanium Y-5 was rolled out to the launch pad shortly after they arrived at Copper. As is usual for the design, the Ti-Y-1 orbiter was mated to a disposable nose tank. Only the tank would be discarded, the remainder of the vehicle (the entire Ti-Y-1) would return to the space center. Simple, reusable, effective. \n\u003C/p\u003E\n\u003Cp\u003E\nThe crew was transferred to the obiter once it was safely on the launch pad. This first flight would feature a full crew of one pilot and five new scientists. The new pilot, Kadun, had been hand-selected by Jonbald from a large pool of candidates. She had completed a small amount of qualification flying to prove she could handle an aircraft, then thrown to the wolves aboard this flight. The scientists meanwhile were recruited from the top universities across Kerbin. They included Julwise, Lemming, Neloly, Wildan, and Haycas; all five of them respected researchers in various technologies that would prove useful to the continued development of Project Copper.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180324_ksp0511_ti-y5.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022602\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180324_ksp0511_ti-y5.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe launch itself was a bit shaky at first. The orbiter ever so slightly bumped the launch clamps while jumping up from the pad, but Kadun and the flight computer were both able to keep it on course. They were well beyond hypersonic when the nose tank was emptied, the main engines cut, and the tank was discarded. Once clear of the tank, Kadun maneuvered the craft for its orbital insertion burn, and set up a rendezvous with Copper Station.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180324_ksp0520_ti-y5.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022600\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180324_ksp0520_ti-y5.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180324_ksp0523_ti-y5.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022602\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180324_ksp0523_ti-y5.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThat rendezvous took place a short time later, after less than a whole orbit. The other Iron shuttle had been moved to one of the radial docking ports, allowing the Titanium to dock at the docking port along the main spine of the station. (It would not have easily fit anywhere else, as either the wings, the nose, or the vertical stabilizers would collide with something.)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180324_ksp0530_ti-y5.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022604\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180324_ksp0530_ti-y5.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180324_ksp0534_ti-y5.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022601\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180324_ksp0534_ti-y5.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe five scientists moved into the new long-term home while Gene and Wernher gathered their things and made their way into the Titanium. Elkin was happy to welcome the new blood into the ranks of the science corps, though the five new kerbals were a bit confused as to whey there were already other kerbals in orbit. This was all very new to them, and as far as they had known a couple munths ago kerbals had not ventured into space. Now here they were, witnessing first-hand that kerbals had not only been to space, but were living there quite successfully. \n\u003C/p\u003E\n\u003Cp\u003E\nWith the crew swap complete, Kadun undocked the Ti-Y-1 from Copper Station, pushed away until they were at a safe distance, then brought them down to a reentry orbit. Once they were at a safe periapsis and aligned such that their reentry would bring them down near the space center, she completed their deorbit burn.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180324_ksp0535_ti-y5.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022600\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180324_ksp0535_ti-y5.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180324_ksp0540_ti-y5.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022600\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180324_ksp0540_ti-y5.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nUnfortunately someone had slipped up on the reentry math. They were still very much hypersonic and well over 30km when they passed overhead of the space center. \n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Don\u0027t worry,\u0022 Kadun called out to her two passengers in the crew compartment, \u0022this new shuttle is equipped with enough jet power to fly us to dry land somewhere. Just stay strapped in and we\u0027ll see what we get.\u0022 \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180324_ksp0546_ti-y5.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022603\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180324_ksp0546_ti-y5.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWhat they got wasn\u0027t very good. If she allowed the glide path to continue, they would come down in the ocean halfway between the space center and the next continent. As soon as the craft was able, she banked hard north, biting into the thicker air. There was an island, roughly two thirds of the way back to the space center. From the charts it appeared she could land there, perhaps roughly so as it lacked any signs of civilization, and they might have to if the fuel didn\u0027t hold out. It was a bit North of a flight path that would take them back to the runway, but if their fuel ran out too soon they\u0027d have to ditch into the ocean. \n\u003C/p\u003E\n\u003Cp\u003E\nKadun opted for the rough island landing over the salt life.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180324_ksp0550_ti-y5.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022600\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180324_ksp0550_ti-y5.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180324_ksp0561_ti-y5.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022600\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180324_ksp0561_ti-y5.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nTurns out they had more than enough fuel to spare.\n\u003C/p\u003E\n\u003Cp\u003E\nKadun opened up the intercom again, more to make a mental note than to share her thoughts with Gene. \u0022If you\u0027ll look off to our starboard side, you\u0027ll see an interesting island featuring a large flat area to the north side of it. Based on our distance downrange from the space center, this island would make a good landing site in the event of a failed launch.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nA few moments later Gene was in the cockpit with her. \u0022Wouldn\u0027t a return to launch site be safer?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Sure, if you can make it back. If we fail on ascent the odds are good the main engine just cut out or died a painful death. At that point the shuttle itself will be completely full of rocket fuel and oxidizer, making it too heavy to carry with just these four jet engines. We could try to dump the ox, but to tooling for that all goes through the main engine. If the fuel lines are the reason the engine cut out, we\u0027d have to take the nearest target we can glide to. RTLS might not be possible, and this is the only rock between us and infinity.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Do you think you could land a craft this large on that island?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Absolutely, sir.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nGene hmmmed. \u0022Ok, I\u0027ll think about it. And I\u0027ll have a team look into preparing an abort to island scenario, work it into the training regimen. Maybe send a couple lumberjacks and ground crews out to clear a landing strip on the island itself.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Thank you, sir.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180324_ksp0577_ti-y5.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022602\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180324_ksp0577_ti-y5.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe remainder of the flight back was uneventful. The orbiter ran out of fuel just short of the space center, but well within their glide path. Kadun killed the engines with a swipe at their controls shortly before she adjusted the flaps for landing. \n\u003C/p\u003E\n\u003Cp\u003E\nThe touchdown was buttery smooth, rotation placing only the slightest strain on the nose landing gear. The speed brakes were enough to slow them (though she wondered if perhaps they could use drogue chutes as well), and she unlocked the steering on the nose gear to drive the craft onto the tarmac in front of the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180324_ksp0580_ti-y5.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022602\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180324_ksp0580_ti-y5.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180324_ksp0583_ti-y5.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022604\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180324_ksp0583_ti-y5.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfterwards, they all three posed for the obligatory post-flight photograph. A successful flight, with one new pilot having proven her mettle, five new scientists deployed into orbit, and two of the most important kerbals in the program back on the ground. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180324_ksp0586_ti-y5.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022604\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180324_ksp0586_ti-y5.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nTitanium was back in business.\n\u003C/p\u003E\n\u003Cp\u003E\n====\n\u003C/p\u003E\n\u003Cp\u003E\nNavigation: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/126972-forgotten-space-program/\u0026amp;do=findComment\u0026amp;comment=3498024\u0022 rel=\u0022\u0022\u003ENext Post\u003C/a\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-12-03T06:59:39Z\u0022 title=\u002212/03/2018 06:59  AM\u0022 data-short=\u00225 yr\u0022\u003EDecember 3, 2018\u003C/time\u003E by Cydonian Monk\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"GearsNSuch","CreatedById":190371,"CreatedDateTime":"2018-09-17T10:18:17Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223452440\u0022 data-ipsquote-contentid=\u0022126972\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221537148815\u0022 data-ipsquote-userid=\u002269224\u0022 data-ipsquote-username=\u0022Cydonian Monk\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, Cydonian Monk said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nthe army of Jebs\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI will be very disappointed if this does not (re)appear.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe Titanium Shuttle has always been one of my favorite craft in this mission report. Glad to see it return.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThank you!\n\u003C/p\u003E\n"},{"CreatedByName":"The Minmus Derp","CreatedById":187595,"CreatedDateTime":"2018-09-17T11:40:43Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223452589\u0022 data-ipsquote-contentid=\u0022126972\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221537179497\u0022 data-ipsquote-userid=\u0022190371\u0022 data-ipsquote-username=\u0022GearsNSuch\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, GearsNSuch said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe Titanium Shuttle has always been one of my favorite craft in this mission report. Glad to see it return.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:\u0027Lucida Sans Unicode\u0027, \u0027Lucida Grande\u0027, sans-serif;\u0022\u003Ei agree. can i see the.craft?\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2018-09-17T14:05:32Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223452625\u0022 data-ipsquote-contentid=\u0022126972\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221537184443\u0022 data-ipsquote-userid=\u0022187595\u0022 data-ipsquote-username=\u0022The Minmus Derp\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, The Minmus Derp said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:\u0027Lucida Sans Unicode\u0027, \u0027Lucida Grande\u0027, sans-serif;\u0022\u003Ei agree. can i see the.craft?\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHere\u0027s the 1.4.5 version:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://kerbalx.com/CydonianMonk/Titanium-v145-Crew-Shuttle-for-up-to-6-Kerbals\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://kerbalx.com/CydonianMonk/Titanium-v145-Crew-Shuttle-for-up-to-6-Kerbals\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Thedrelle","CreatedById":145967,"CreatedDateTime":"2018-09-17T16:45:10Z","Content":"\n\u003Cp\u003E\nexcellent flight, nice correction of an overshoot!\n\u003C/p\u003E\n"},{"CreatedByName":"superstrijder15","CreatedById":155985,"CreatedDateTime":"2018-11-26T19:57:02Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223452440\u0022 data-ipsquote-contentid=\u0022126972\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221537148815\u0022 data-ipsquote-userid=\u002269224\u0022 data-ipsquote-username=\u0022Cydonian Monk\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 9/17/2018 at 3:46 AM, Cydonian Monk said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\njust short of the spade center\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe what now?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nNice \u0027new\u0027 chapters since I went into university, amazing read!\n\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2018-11-26T20:11:23Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223494195\u0022 data-ipsquote-contentid=\u0022126972\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221543262222\u0022 data-ipsquote-userid=\u0022155985\u0022 data-ipsquote-username=\u0022superstrijder15\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 minutes ago, superstrijder15 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe what now?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nLOL. Obviously should have been the \u0027shovel\u0027 center, the place where all kerbals go to get their miscellaneous garden implements. \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 minutes ago, superstrijder15 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNice \u0027new\u0027 chapters since I went into university, amazing read!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThanks!\n\u003C/p\u003E\n\u003Cp\u003E\nThings are winding down here so I might have some \u0027new\u0027 chapters to post soon. (This thread\u0027s aniversary is coming up soon anyway....)\n\u003C/p\u003E\n"},{"CreatedByName":"Nivee~","CreatedById":183478,"CreatedDateTime":"2018-11-29T13:33:52Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223494215\u0022 data-ipsquote-contentid=\u0022126972\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221543263083\u0022 data-ipsquote-userid=\u002269224\u0022 data-ipsquote-username=\u0022Cydonian Monk\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 11/27/2018 at 1:41 AM, Cydonian Monk said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI might have some \u0027new\u0027 chapters to post soon.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWow, all my favorite authors posting new chapters outta nowhere! Nice!! I will be waiting!\n\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2018-12-03T06:59:01Z","Content":"\n\u003Cp\u003E\nAs of this post, the Forgotten Space Program has been in operation for three years. Thanks everyone for sticking around, through both the crazy parts and the crazy boring parts.  Cheers,\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n--\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cstrong\u003EForgotten Space Program\u003C/strong\u003E\u003C/span\u003E\u003Cbr\u003E\u003Cstrong\u003EVolume 2 Sequence 7 Modulus 7\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cstrong\u003EWhere We Left Off...\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cs\u003EIt is a period of civil war. Rebel spaceships, venturing out from Kerbin, have won their first victory against the\u003C/s\u003E.... No, wait, that\u0027s not right. \n\u003C/p\u003E\n\u003Cp\u003E\nIt is a cycle of exploration and adventure. \u0022The Jumble of Parts\u0022, having completed a successful exploration of the Joolian System, is returning home to Kerbin with unexpected new friends. Macfred, Gletrix, and Agake have hitched their Sulphur shuttle to the \u0022Jool Jester\u0022, an interplanetary cruiser captained by the elder Maclie Kerman and crewed by the kerbals of the Forgotten Space Program. The chaos of The Cycles and a lost mission to Dres have compelled them to return to Kerbin to regroup. Thomlock returns with them on a secretive mission for his old acquaintance Albro. \n\u003C/p\u003E\n\u003Cp\u003E\nElsewhere in the Kerbol System, Queen Sieta and her pirate defender Captain Hallock are approaching an unsuspecting target. Their stolen spaceship, \u0022The Memory of Tomorrow\u0022, is short on fuel and supplies, and in need of minor repairs. Operating as outcasts and independent from the space program, they must scavenge for parts and steal fuel from wherever they can. They will soon descend on new prey.\n\u003C/p\u003E\n\u003Cp\u003E\nBack on Kerbin \u0022The Boss\u0022, Rosuki, remains under the care and observation of the mysterious monks of \u0022The Order of the Kerbin World-Firsts Record-Keeping Society.\u0022 She regularly communes with an unknown entity, a being which presents itself to her as an image of Jonbald. An entity with unknown - and unclear - motives. She is quietly building the foundation of a new space program, a secretive operation built far from the reaches of any existing world powers.\n\u003C/p\u003E\n\u003Cp\u003E\nJonbald meanwhile has usurped control of the space program from Rosuki, himself directly responsible for her \u0022hospitalization\u0022 by the Worlds-First. He is driven by an unknown impulse to leave this planet and return... return... he\u0027s not sure where. This impulse has suppressed his traditional sense of morality, and he has fallen so far as to conscript the local populace into the factories and forges needed to fuel the program. With the aide of Gene and Wernher, their own memories and experiences restored by an alien device, the space program is building the key to Jonbald\u0027s exodus. A key which might destroy Kerbin itself....\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\n--\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cstrong\u003ECopper Gain\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nHaving Gene and Wernher back on the planet was exactly what the space program needed. In no time at all Gene had found and corrected several issues with the way things were being run at the space center, and had ironed out most of the problems that were causing grief with their industrial support structure. Meanwhile Wernher had pointed out several failures of process in the integration and operation of the rockets themselves.\n\u003C/p\u003E\n\u003Cp\u003E\nIn the end most of the problems were minor - a missed wrenching here, an un-hammered nail there. Gene could find no deliberate instances of sabotage, though he agreed with Jonbald there could always be the potential for such. And there was a lack of through training for the kerbals at the factories and the space center which led to confusion. So many of these minor problems and confused kerbals that it all added up, resulting in the death of several rockets by a million paper cuts. \n\u003C/p\u003E\n\u003Cp\u003E\nThe pause they took to train the kerbals at their command took more time than fixing most of the issues, but in the end they had their production queue running at full speed. A few test firings and one test launch later and they were ready to march on with building Copper.\n\u003C/p\u003E\n\u003Cp\u003E\nFirst up was the second replacement launch of the solar arrays, Copper 6B. There was initial apprehension at launching in the middle of an eclipse, but Gene and Jonbald both refused to be bound by superstition and order it to go. Besides, they had launched during an eclipse hundreds of times - it was so common an event that it might even be considered to be lucky.\n\u003C/p\u003E\n\u003Cp\u003E\nLuck, it turned out, was on their side.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180324_ksp0589_cu6b.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022601\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180324_ksp0589_cu6b.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180324_ksp0594_cu6b.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022603\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180324_ksp0594_cu6b.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180324_ksp0598_cu6b.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022602\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180324_ksp0598_cu6b.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe LV-50 Orchestra finally operated as it was designed, and the Copper 6B was presented to orbit. This monstrosity of a vehicle included the first three solar armatures for use by Copper Station, heavy duty affairs that would provide enough energy for the station even at orbits as distant as Dres.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180324_ksp0600_cu6b.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022600\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180324_ksp0600_cu6b.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nInitial rendezvous with Copper Station occurred in the dark - as is only fitting and proper. Once Copper 6B was on-station, the construction tug was remotely moved out to grab the first of the arrays to install. Each individual armature took roughly 1/3rd of an orbit to install and align. As such, the entire installation took several orbits to complete, and used the skills of several of the current residents of Copper Station. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180324_ksp0608_cu6b.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022602\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180324_ksp0608_cu6b.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180324_ksp0612_cu6b.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022600\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180324_ksp0612_cu6b.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180324_ksp0613_cu6b.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022601\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180324_ksp0613_cu6b.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180324_ksp0618_cu6b.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022604\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180324_ksp0618_cu6b.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180324_ksp0626_cu6b.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022602\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180324_ksp0626_cu6b.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180324_ksp0631_cu6b.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022603\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180324_ksp0631_cu6b.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe upper stage of Copper 6B was deorbited once the third and final array was detached by the construction tug, but not before transferring any excess fuel and monoprop to the tug. And with the installation and alignment of the third solar array, Copper Station had achieved its minimum required level of operations.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180324_ksp0638_cu6b.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022604\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180324_ksp0638_cu6b.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180324_ksp0641_cu6b.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022603\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180324_ksp0641_cu6b.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe solar arrays were the primary source of heat in the Copper Station design (at least until any nuclear reactors came into play), so the nine of the heavy radiators currently at the station were expanded and running first. Once all crews were certain the thermal control system was running as it should, they unfurled the delicate sails of the solar armatures.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180324_ksp0642_cu6b.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022603\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180324_ksp0642_cu6b.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180324_ksp0644_cu6b.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022603\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180324_ksp0644_cu6b.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nThe next several launches all rolled off without a hitch. Next came the replacement launch for The Node - Copper 8A - somewhat redesigned and respec\u0027d by Wernher. The tweaks were mostly to the included docking armatures, which were rebalanced to handle the upcoming flurry of Titanium launches. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180325_ksp0649_cu8a.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022604\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180325_ksp0649_cu8a.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180325_ksp0652_cu8a.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022602\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180325_ksp0652_cu8a.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180325_ksp0655_cu8a.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022600\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180325_ksp0655_cu8a.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe launch and rendezvous were perfect, as already mentioned. The extended armatures were installed onto The Node before The Node itself was placed onto Copper Station. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180325_ksp0660_cu8a.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022599\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180325_ksp0660_cu8a.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180325_ksp0666_cu8a.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022602\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180325_ksp0666_cu8a.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe installation of The Node itself required a small dance of the ships already at the station. The two Iron shuttles were moved to the end of the stack and used to extract the command bridge. Once that was free The Node was moved into place. (The Copper 8A\u0027s orbital stage was deorbited at some point in this process.)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180325_ksp0677_cu8a.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022601\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180325_ksp0677_cu8a.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180325_ksp0683_cu8a.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022600\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180325_ksp0683_cu8a.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOnce The Node was in position, the tug moved free and the command bridge was placed back onto the stack.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180325_ksp0687_cu8a.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022602\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180325_ksp0687_cu8a.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nWith The Node in place, the next two pieces of main-stack trusswork were launched: Copper 9 and Copper 10. These were simple spacer pieces, intended to add room for the upcoming habitation modules and later nuclear power plant modules. Both of these were completely routine, and completed with zero problems. \n\u003C/p\u003E\n\u003Cp\u003E\nThe first - Copper 9 - was installed between the radiator assembly and the rear air locks. The construction tug pulled the air lock assembly free while the Cu9 upper stage maneuvered its truss piece into place.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180325_ksp0689_cu9.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022603\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180325_ksp0689_cu9.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180325_ksp0697_cu9.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022602\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180325_ksp0697_cu9.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180325_ksp0704_cu9.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022600\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180325_ksp0704_cu9.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180325_ksp0706_cu9.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022601\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180325_ksp0706_cu9.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe second - Copper 10 - was placed directly behind The Node. The habitation modules would later be installed between the Cu10 truss and the original station truss, spacing them out from both the solar arrays and the docking areas at the front of the station.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180325_ksp0710_cu10.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022600\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180325_ksp0710_cu10.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180325_ksp0717_cu10.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022601\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180325_ksp0717_cu10.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180325_ksp0720_cu10.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022603\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180325_ksp0720_cu10.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180325_ksp0724_cu10.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022601\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180325_ksp0724_cu10.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd with that, the space program was finally back on schedule.\n\u003C/p\u003E\n\u003Cp\u003E\n--\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cstrong\u003EFriendly Warning\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe silence in the room was near total, the only noise the shuffling of papers in a report Jonbald was reading. The air shifted, a draft from somewhere unknown, one of the papers fluttered lightly. It was a sensation now familiar to Jonbald, and he looked up expecting to see one of the usual messenger monks. He was quite delighted to see his old friend and mentor, Archibald. One of the eldest of the elders of their order.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Archibald. What an unexpected surprise.\u0022 The old monk had appeared seemingly out of thin air, as was their custom. They don\u0027t actually materialize out of nothing, nor do they teleport or use some other alien method, of that Jonbald was certain. His curiosity once compelled him to review the security camera footage. No, the mysterious little monks all entered through doors and walked down halls, just like the rest of them. They were aided only by choice timing, near-silent footsteps, and an uncanny ability to hide in plain sight. Theater tricks. Rosuki had moved much like them, too, before he had sent her away. \n\u003C/p\u003E\n\u003Cp\u003E\n\u0022What brings you down from North Mountain? You\u0027re not one who often strays far from home.\u0022 Archibald had a somber look about him, the only time Jonbald had ever seen him anything less than mildly giddy.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Hello, my good friend. How are you?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022I\u0027m... curious.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022As always. I regret I have brought no gifts for you this time, only a warning. One you\u0027d do best not to ignore.\u0022 He took a long breath before continuing. \u0022You are straying too close to the fire, Jonbald. You need to stop, to back off, lest you hurt yourself and bring ruin down upon us all.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Oh? Rather melodramatic there, even for you. And what is it I\u0027m doing now?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Don\u0027t be coy. You\u0027re building a ship, and a big one. We know. We\u0027ve seen the plans, the ones you\u0027ve not shared outside your little cabal. You\u0027ve impressed thousands into working at the factories, to churn out larger and larger rockets in numbers and at rates none of us have seen before. You move too quickly, building this starship of yours, and these failures are the result of your boundless haste.\u0022 \n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Those failures are behind us now...\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nHe raised his hands to quiet Jonbald\u0027s response. \u0022No, let me finish. We know what you\u0027ve been doing in the North. Just as we know what Copper really is. I know what it is you hope to find on the Mün. If you continue down this path you risk activating the contamination protocols. Kerbol, Kerbin, and everything in this star system would be destroyed. We can\u0027t allow it.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022So it is intact. The crash on the Mün.\u0022 Jonbald smiled. That was exactly the news he wanted to hear, though he wasn\u0027t entirely sure why. \n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Jonbald, friend, listen to me. You are not yourself. That machine has twisted you, and it\u0027s that machine which is driving these unnatural desires.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022And what desires are those?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022To leave. To return someplace you think is your home.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Ah, that.\u0022 His smile turned sour. \u0022Trust me, my old friend, I\u0027m as much Jonbald today as I was those many years ago. We both know kerbals can not stay here forever. Albro realized it when he started Continuum. Half the work of Continuum and its Orbital Sciences Division was to find gaps in physics. Holes. Cheats. Ways out. A means for us to leave, to run from this cyclical unavoidable destruction. We may not have seen eye to eye on the methods, Albro and myself, but we did agree our place is out there amongst the stars. If we stay here we die.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022And if you leave we all die.\u0022 Archibald responded with a sad smile. \u0022The warnings of The Elders were not idly given.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022That superstitious nonsense again.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022How could you of all kerbals not believe? The Elders have been absolutely correct about everything. They witnessed the same cycles we do, they struggled as we must. Leave Kerbol, they said, and our Universe will collapse in upon itself. What is here must always be here.\u0022 He paused, Jonbald could feel the weight of Archibald\u0027s gaze. \u0022Understand, brother, that what we do, we do in the best interests of Kerbin. All of Kerbin, even those who are trapped here by fate.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022And I the same.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nArchibald walked backwards toward the office door. \u0022Then I wish you luck old friend. Please heed our warnings. Please stop this project, or redirect its efforts elsewhere. Do not pry at wrecks that are best left sealed. Do not disturb the dead. You are welcome to join us again at North Mountain any time, the invitation always stands and our doors are always open. Farewell.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nAnd with that he was gone. Slipped out of the door unnoticed, all while Jonbald was watching. What strange creatures these kerbals were.\n\u003C/p\u003E\n\u003Cp\u003E\nSo The Wreck was still there. And if the order was so concerned about Jonbald finding it, then it must be fully intact. Which would mean they had a second egg at their disposal. The contents of the one here on Kerbin were corrupted, mostly lost to time. Perhaps they could learn more from the one on The Mün. There may yet be more of their kind stranded there, trapped, trying to find some way out of this place.\n\u003C/p\u003E\n\u003Cp\u003E\nNow they had to go back to The Mün, and not just for a short stay. If they were to excavate and recover The Wreck they would need a large number of kerbals and a base to operate from. And possibly heavy equipment as well, depending on what situation their target was in. \n\u003C/p\u003E\n\u003Cp\u003E\nIt was time for a change of plans. \n\u003C/p\u003E\n\u003Cp\u003E\n====\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nNavigation:\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/126972-forgotten-space-program/\u0026amp;do=findComment\u0026amp;comment=3596027\u0022 rel=\u0022\u0022\u003E Next Post\u003C/a\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-05-09T04:03:26Z\u0022 title=\u002205/09/2019 04:03  AM\u0022 data-short=\u00225 yr\u0022\u003EMay 9, 2019\u003C/time\u003E by Cydonian Monk\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DragonsForce","CreatedById":160064,"CreatedDateTime":"2018-12-03T12:24:40Z","Content":"\n\u003Cp\u003E\nThe plot thickens (once more)!\n\u003C/p\u003E\n"},{"CreatedByName":"cubinator","CreatedById":150330,"CreatedDateTime":"2018-12-03T17:10:42Z","Content":"\n\u003Cp\u003E\nThis is seeming like\u003Cem\u003E 2001\u003C/em\u003E now, with the strange, secretive excavation project on the Mun.\n\u003C/p\u003E\n"},{"CreatedByName":"Pretorian28715","CreatedById":175947,"CreatedDateTime":"2018-12-03T17:22:01Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223498093\u0022 data-ipsquote-contentid=\u0022126972\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221543839880\u0022 data-ipsquote-userid=\u0022160064\u0022 data-ipsquote-username=\u0022DragonsForce\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, DragonsForce said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe plot thickens (once more)!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAye, and it must be Neutron Star thick by now, \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/69224-cydonian-monk/\u0026amp;do=hovercard\u0022 data-mentionid=\u002269224\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/69224-cydonian-monk/\u0022 rel=\u0022\u0022\u003E@Cydonian Monk\u003C/a\u003E really knows how to do that.....\n\u003C/p\u003E\n"},{"CreatedByName":"Angelo Kerman","CreatedById":106975,"CreatedDateTime":"2018-12-04T00:58:14Z","Content":"\n\u003Cp\u003E\nHappy anniversary! Nice to see that the Forgotten Space Program hasn’t been... forgotten. Looking forward to seeing what happens next!\n\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2019-05-09T04:02:16Z","Content":"\n\u003Cp\u003E\n\u003Cimg alt=\u002220180325_quiteold.jpg\u0022 class=\u0022ipsImage\u0022 height=\u002296\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180325_quiteold.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNow why would I go and do a thing like that? This mission report is also quite old, covering a mission flown in March of 2018. An old thread seems like the perfect place for it.... \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n==\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cstrong\u003EPlanning Pioneers\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nJonbald took a look around at the small crowd which had gathered in his office. Munths had passed, or was it Minths?, and they had yet to launch the next two major components of Project Copper. It was good to be cautious, yet so much caution and inaction can just as easily hurt as improve morale. There is such a thing as being too ready for something. Time for a motivational speech.  \n\u003C/p\u003E\n\u003Cp\u003E\n\u0022We\u0027ve reached an important milestone with Project Copper, one we should celebrate. We had many fits and starts, and most of our missteps were due to my own shortcomings and limitations.\u0022 One of the senior administrators started to protest, but he waved them off quickly. \u0022No, I really mean that. I should have understood the limitations of reality, and recognized that I was pushing all of us too hard. I did not, and for that I apologize.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022And yet here we are. We\u0027ve built what many consider impossible - a space station which presently will be capable of supporting dozens of kerbals indefinitely. And for this accomplishment we deserve praise. And a bit of a rest. So go, enjoy yourselves tonight, for tomorrow we have much work to do. There are snacks and drinks and the usual fountain of cheese set up in the Astrokerb Building.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nHe smiled his tired smile, and waved them all towards the door. \u0022Now shoo, the lot of you. Go have fun. I have some things to attend to and will join you later in the evening.\u0022 They were all just standing there, the daft kerbs, smiling back at him. He smiled an even creepier smile back to drive the point home, then waved them away one last time. \u0022Go on, get going.\u0022 Thankfully that moved them along, as his only remaining option was to start throwing office supplies at them, something which might sour the mood.\n\u003C/p\u003E\n\u003Cp\u003E\nHe pulled his two co-conspirators aside before they followed the horde to engorge themselves on chips and queso. \u0022Wernher, Gene, I\u0027d like to steal a moment of your time, if I may.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Of course, boss. What\u0027s up?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022The Mün. Up, that is. And I have it on good authority another of our missing star children might have fallen there, if you catch my meaning.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nWernher frowned momentarily, before excitedly pointing upwards with his left index finger. \u0022Ja! Another of ze mystery craft! Of course, we always knew ze northern one was talking to something nearby, und this vould make sense.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Ok,\u0022 Gene said, \u0022what do you need from us?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Well, first we need to find out exactly where it is. Then we\u0027ll need a base of operations from which to study and recover it. And a small fleet of ships and surface equipment to support such an endeavour.\u0022 Jonbald leaned back in his chair and gave them a real smile. \u0022And it just so happens I know of a base we could use.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nGene raised an eyebrow, but Jonbald answered before he could vocalize his obvious thought. \n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Pioneer. Yes, it\u0027s on the older side of things, but it\u0027s a large facility and is already rigged for hydroponics. With luck it\u0027ll still be in good condition.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022And what of its former resident?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Hallock? Oh, I don\u0027t think we\u0027ll be seeing him again any time soon. We\u0027ll send a few extra modules for the base as well, but we\u0027ll need an exploration and repair crew to get measurements and the like before we send anything heavy.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Now, what do you say to this little plan of mine?\u0022 \n\u003C/p\u003E\n\u003Cp\u003E\nBoth agreed.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Excellent. Wernher, I need to start work on adapting the Iron into a multipurpose lander. Something that can reach any spot on The Mün from Pioneer and return. And we\u0027ll need a refinery to make water and fuel from whatever we can find nearby. Gene, I need you to ramp up recruiting efforts. I have a list of candidate suggestions, but I suspect we\u0027ll need a larger than usual pool of active crews to make this work.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Yet all of this is for tomorrow. Let\u0027s go have some cake.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n--\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cstrong\u003ELiving With Copper\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe next day mission control was abuzz with excitement. Copper 11 had been rolled out to the launchpad once everyone emerged from their post-celebratory stupor and was ready to launch. It would need every Newton its LV-50 Orchestra launch vehicle had available to loft itself into orbit and to the rest of Copper Station. Its record-breaking 619.5 tonnes on the launchpad would no doubt go unmatched for many years. Or at least until Copper 12 launched in a few days. \n\u003C/p\u003E\n\u003Cp\u003E\nOnce everyone had stressed themselves up enough, Jonbald hit the big red \u0022Launch!\u0022 button, and away it went. Or rather away it crawled... Slowly clawing its way into the sky, inch by inch. There was no tower to clear, but had there been one it might have taken 5 or 6 seconds for it to clear it. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180325_ksp0725_cu11.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022600\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180325_ksp0725_cu11.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd then it was off. The remainder of the ascent was under the control of the flight computers, which knew exactly what to do. When it overshot into a slightly higher orbit they angled down, pulling the ascent back into its correct path. The fairing was split apart just a few moments following Stage 1 burnout and separation, exposing the two large centrifuges and the rest of the first habitation node to the void. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180325_ksp0729_cu11.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022600\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180325_ksp0729_cu11.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180325_ksp0731_cu11.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022602\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180325_ksp0731_cu11.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe launch was an instantaneous one, with rendezvous occurring just a bit after one orbit. The Cu-11\u0027s upper stage completed the rendezvous burn and brought their rate of closure down to a safer level. Meanwhile the crews aboard Copper Station got to work.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180325_ksp0737_cu11.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022603\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180325_ksp0737_cu11.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFirst they had to open a hole in the assembled stalk of the station where the new module would be installed. Having been quite some time since the previous module, the internal corridor had acquired rather a bit of junk. Elkin had his new army of researchers clear it out. They needed something new to do anyway.\n\u003C/p\u003E\n\u003Cp\u003E\nMeanwhile Verly prepared the tail section of the station for local operational control. To prevent any possible issues with loss-of-signal during the installation, she had planned to remain in the aft section of the station while is separated from the bridge and the rest of the assemblage at the fore. \n\u003C/p\u003E\n\u003Cp\u003E\nOnce everyone was ready and in place, they split Copper Station in two and moved the new Cu-11 module in by remote. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180325_ksp0740_cu11.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022601\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180325_ksp0740_cu11.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180325_ksp0745_cu11.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022603\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180325_ksp0745_cu11.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180325_ksp0748_cu11.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022602\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180325_ksp0748_cu11.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOnce the module was installed, its orbital stage transferred its useful supplies into the station\u0027s fore tanks and returned to a fiery grave in Kerbin\u0027s upper atmosphere. The station was then reassembled and all of its internal connections and wired put back into service. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180325_ksp0751_cu11.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022602\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180325_ksp0751_cu11.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWith the hardest part of the Copper 11 installation out of the way, they decided it was time to test the operation of the two centrifuge sections. These modules are designed to have two rotating masses moving in opposing directions in the hope this would balance out the bizarre motions and imbalances such objects can acquire in microgravity. They only way they would know if the design actually worked was to unfold the habitation arms and set them to spinning. The station\u0027s crew evacuated to the Iron shuttles and the bridge, just in case they needed to make a quick exit.\n\u003C/p\u003E\n\u003Cp\u003E\nFirst came the unfolding. In the dark. As is common in space travel, half of all interesting things occur at night, as is only right and proper. This time they had enough light to drive back the dark, enough fire to drive back the ice of the void.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180325_ksp0753_cu11.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022600\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180325_ksp0753_cu11.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe unfolding action did impart a bit of a wiggle, a slight shimmy, onto the station itself. But once the six arms started their spin, their dampeners soaked up the dangerous waves and the structure returned to its proper form. The Sun rose just as the centrifuges were fully spun up.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180325_ksp0756_cu11.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022604\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180325_ksp0756_cu11.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA new dawn rising for their life in space.\n\u003C/p\u003E\n\u003Cp\u003E\n--\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cstrong\u003ECopper 12\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe second Copper habitation module was scooted to the launchpad several days later. Tied for total mass at liftoff with the Cu-11, the Cu-12 also dripped slowly into the sky. For some reason its first stage separation was somewhat more explosive than that of the Cu-11, but nothing important was lost so the flight continued.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180327_ksp0764_cu12.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022600\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180327_ksp0764_cu12.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180327_ksp0768_cu12.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022602\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180327_ksp0768_cu12.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180327_ksp0771_cu12.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022602\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180327_ksp0771_cu12.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe installation of Copper 12 was exactly the same as Copper 11. Verly had them stop the spin of the first habitation module and lock the centrifuges in place. She then split the station modules, moved the Cu-12 in by remote, salvaged as much of the supplies from the Cu-12\u0027s orbital stage as she could before detaching it, and then reassembled the fore and aft sections.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180327_ksp0774_cu12.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022631\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180327_ksp0774_cu12.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180327_ksp0775_cu12.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022601\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180327_ksp0775_cu12.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180327_ksp0779_cu12.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022604\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180327_ksp0779_cu12.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd with that, the second phase of Copper Station construction was complete. There was still an experimental cryogenic section they planned to launch, but work on the experimental nuclear reactor had stalled completely. And without the reactor there was no reason to add the two extra radiator modules. And phase four, the drive section, was meaningless without the needed energy output from the reactor.\n\u003C/p\u003E\n\u003Cp\u003E\nThey unfurled the two new sets of habitation arms and set all four rings into spin. It really was quite a remarkable environment, with a general sense of \u0022down\u0022 being \u0022out\u0022, and an obviously synthetic gravitational feeling. The most difficult part of adapting to the \u0022down\u0022 turned out to be forgetting it was occurring. Too much thought spoiled the illusion, and it would often take no more than pouring water to remind them they were in something that wasn\u0027t quite right.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180327_ksp0781_cu12.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022603\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180327_ksp0781_cu12.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180327_ksp0782_cu12.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022603\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180327_ksp0782_cu12.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220180327_ksp0783_cu12.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022601\u0022 src=\u0022http://0div0.org/images/ksp/forgot/20180327_ksp0783_cu12.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThey wouldn\u0027t have much time to adapt just yet though, as Jonbald and the rest of the space program were obviously gearing up for something big. But that\u0027s a story for next time....\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n====\n\u003C/p\u003E\n\u003Cp\u003E\nNavigation: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/126972-forgotten-space-program/\u0026amp;do=findComment\u0026amp;comment=3606225\u0022 rel=\u0022\u0022\u003ENext Post\u003C/a\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-05-28T04:18:53Z\u0022 title=\u002205/28/2019 04:18  AM\u0022 data-short=\u00225 yr\u0022\u003EMay 28, 2019\u003C/time\u003E by Cydonian Monk\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"IncongruousGoat","CreatedById":157062,"CreatedDateTime":"2019-05-09T04:09:41Z","Content":"\n\u003Cp\u003E\nIt lives?\n\u003C/p\u003E\n\u003Cp\u003E\n...\n\u003C/p\u003E\n\u003Cp\u003E\nIt lives! Huzzah! Good to see that this is still a thing.\n\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2019-05-09T04:12:09Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223596030\u0022 data-ipsquote-contentid=\u0022126972\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221557374981\u0022 data-ipsquote-userid=\u0022157062\u0022 data-ipsquote-username=\u0022IncongruousGoat\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 minutes ago, IncongruousGoat said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt lives?\n\u003C/p\u003E\n\u003Cp\u003E\n...\n\u003C/p\u003E\n\u003Cp\u003E\nIt lives! Huzzah! Good to see that this is still a thing.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt lives! And it\u0027s going to attempt to not go 6 months between posts again......\n\u003C/p\u003E\n"},{"CreatedByName":"cubinator","CreatedById":150330,"CreatedDateTime":"2019-05-09T04:13:30Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223596027\u0022 data-ipsquote-contentid=\u0022126972\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221557374536\u0022 data-ipsquote-userid=\u002269224\u0022 data-ipsquote-username=\u0022Cydonian Monk\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 minutes ago, Cydonian Monk said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe\u003Cspan\u003E﻿\u003C/span\u003E\u003Cspan\u003E﻿\u003C/span\u003E Mün. Up\u003Cspan\u003E﻿\u003C/span\u003E, that\u003Cspan\u003E﻿\u003C/span\u003E is\u003Cspan\u003E﻿\u003Cspan\u003E﻿\u003C/span\u003E\u003C/span\u003E.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHmm, impart some wise advice soon will you? \n\u003C/p\u003E\n"},{"CreatedByName":"KerballingSmasher","CreatedById":195689,"CreatedDateTime":"2019-05-09T06:48:13Z","Content":"\n\u003Cp\u003E\nWow... you\u0027ve been writing this thread side what, Beta? I\u0027m seriously blown away! Nice work and serious dedication!\n\u003C/p\u003E\n"},{"CreatedByName":"obney kerman","CreatedById":171373,"CreatedDateTime":"2019-05-09T13:46:54Z","Content":"\n\u003Cp\u003E\nIT LIVES!\n\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2019-05-09T14:50:50Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223596079\u0022 data-ipsquote-contentid=\u0022126972\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221557384493\u0022 data-ipsquote-userid=\u0022195689\u0022 data-ipsquote-username=\u0022Kerballing (Got Dunked On)\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, Kerballing (Got Dunked On) said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWow... you\u0027ve been writing this thread side what, Beta? I\u0027m seriously blown away! Nice work and serious dedication!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThanks. \n\u003C/p\u003E\n\u003Cp\u003E\nThis thread has only been going since KSP v1.0.5, which is post-release, but there are craft and kerbals and stories in it from the v18.3 demo and v19.0 alpha.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI loaded it last night in v1.7.0 to see if there are any migration issues, and so far it looks like \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E is the only thing that will cause problems thanks to the loss of the old \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E EVA struts. \u003Cspan\u003E\u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E (Some of which have been in place for four or five REAL years.) But otherwise everything looks good! I\u0027ll have to evaluate options for replacing struts; not sure the new \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E way of doing things works for my use case, whether more realistic or not. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EI have a few things to finish in v1.4.5 before I can move it all up to v1.7.0 though; and probably 3 more posts before we\u0027re even out of v1.3.1. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-05-09T15:32:38Z\u0022 title=\u002205/09/2019 03:32  PM\u0022 data-short=\u00225 yr\u0022\u003EMay 9, 2019\u003C/time\u003E by Cydonian Monk\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RocketSquid","CreatedById":152665,"CreatedDateTime":"2019-05-09T17:27:43Z","Content":"\n\u003Cp\u003E\nIs there a good place to start, besides just “the beginning”? I stepped away for too long.\n\u003C/p\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2019-05-09T17:32:33Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223596285\u0022 data-ipsquote-contentid=\u0022126972\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221557422863\u0022 data-ipsquote-userid=\u0022152665\u0022 data-ipsquote-username=\u0022RocketSquid\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 minute ago, RocketSquid said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIs there a good place to start, besides just “the beginning”? I stepped away for too long.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt\u0027s a good question that I don\u0027t have a good answer for. Two posts ago is a section titled \u0022Where we left Off\u0022 that gives a quick recap. Beyond that, probably when the Jool mission gets to Vall? (Ghosts on the Ice.)\n\u003C/p\u003E\n"}]}