{"TopicId":126963,"ForumId":55,"TopicTitle":"KSP: Galactic Warfare","CreatedByName":"BTG02","CreatedById":154437,"CreatedDateTime":"2015-12-03T23:17:55Z","PageNum":1,"Articles":[{"CreatedByName":"BTG02","CreatedById":154437,"CreatedDateTime":"2015-12-03T23:17:55Z","Content":"\n\u003Cp\u003E\nKerbal is developing fast, and people have great ideas. I feel that, once Kerbal has released on all playforms (or maybe before?), Squad should create a DLC or spin-off called \u0027KSP:GW\u0027, meaning Kerbal Space Program: Galactic Warfare. Mods on KSP have already attempted to create things like this, but it never tends to work out so well. I have a vision of a solar system, maybe players sharing planets and meteors, maybe on their own. They start like science mode (or career, never played career), but players must develop and create ships and weapons while researching yet more, while making bases on planets with others playing on, and forming allies and enemies. Could be like \u0027Civilisation\u0027 if anyone is familiar with that game. This would be so fun, firing missiles at opponents and forming armies and strategic attacks and defences. Imagine if it was official. If this way on Xbox One or something (almost like an MMO, but individual game-based, it wouldn\u0027t be good with it going forever!), it would be a huge hit, and most people would know about KSP. Worth a shot, right? Who agrees? Post your opinions and suggestions for a mode like this! Would you pay something like £10-20? Would you want it to be free? Share. I know I would pay a little for this. You?\n\u003C/p\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2015-12-03T23:36:02Z","Content":"\n\u003Cp\u003E\nNo, I\u0027m afraid weapons are on the do-not-suggest list, as they are not a planned feature. I happen to agree with the devs it\u0027s not in the spirit, but there are indeed mods for this. \n\u003C/p\u003E\n"},{"CreatedByName":"Halban","CreatedById":89536,"CreatedDateTime":"2015-12-03T23:51:20Z","Content":"\n\u003Cp\u003E\nI can\u0027t really see this working too well. Perhaps in a standalone game that\u0027s unrelated, but in KSP: you can basically already do this thanks to the ability to build stock missiles and of course the destruction. Which is a big part of the reason it already sells really well. \n\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-12-04T00:09:48Z","Content":"\n\u003Cp\u003E\nThere are mods for that.  Why would they need a spinoff?  Not to mention it goes against every reason for this game.  It\u0027s exploration, not war.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-12-04T00:10:47Z\u0022 title=\u002212/04/2015 12:10  AM\u0022 data-short=\u00228 yr\u0022\u003EDecember 4, 2015\u003C/time\u003E by Alshain\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"quasarrgames","CreatedById":91692,"CreatedDateTime":"2015-12-04T02:35:41Z","Content":"\n\u003Cp\u003E\nI want this soooooooo badd.......\n\u003C/p\u003E\n\u003Cp\u003E\nSOOOOO BADDDD!\n\u003C/p\u003E\n\u003Cp\u003E\nBUT something like this kinda already exists.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you like making floating battleships, conquering the world, giant tentacles, and steampunkyness, i\u0027d suggest you tray a game called \u003Cb\u003EAirships: Conquer The Skies\u003C/b\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"BTG02","CreatedById":154437,"CreatedDateTime":"2015-12-04T06:27:06Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222307114\u0022 data-ipsquote-contentid=\u0022126963\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221449185762\u0022 data-ipsquote-userid=\u0022105624\u0022 data-ipsquote-username=\u0022Pthigrivi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, Pthigrivi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNo, I\u0027m afraid weapons are on the do-not-suggest list, as they are not a planned feature. I happen to agree with the devs it\u0027s not in the spirit, but there are indeed mods for this. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIf only they would try at some point, it\u0027s be spectacular.\n\u003C/p\u003E\n"},{"CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2015-12-04T09:13:05Z","Content":"\n\u003Cp\u003E\nI kinda want something like this, but I think it can all be done with mods.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThough I\u0027m definitely setting myself a modded Elite-like server once multiplayer comes out. With economics, space yards, alcubierre drives and other sci-fi things.\n\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2015-12-04T12:27:52Z","Content":"\n\u003Cp\u003E\nSounds dead boring to me to be honest. Building elaborate spacecraft, spending months of in-game time getting them to other planets... and then watching them explode. Woot.\n\u003C/p\u003E\n\u003Cp\u003E\nBut regardless of personal opinion on how fun it would be, I think it would need KSP to be basically re-written from the ground up, or modded into oblivion to make it work properly. Stock KSP has extremely basic base-building and logistics features that wouldn\u0027t make for a particularly engaging strategy or warfare game. Given the expected amount of work involved I would expect to pay rather more than £10-20 for it.\n\u003C/p\u003E\n"},{"CreatedByName":"panzer1b","CreatedById":95108,"CreatedDateTime":"2015-12-07T04:49:20Z","Content":"\n\u003Cp\u003E\nDespite dedicating over 90% of all my KSP time to some form of combat related design/missions, im against stock weapons.  One, i really enjoy stock weapons as its a challenge to make them actually work well, and they are nicely balanced right now.  Stock weapons are super kerbal, with stuff like a trash-bin-fulla-boom with a structural panel on the front, or a ibeam with sepatrons strapped to them. \n\u003C/p\u003E\n\u003Cp\u003E\nThat, and while i have used them extensively throughout teh years, weapons mods are generally speaking rather overpowered and difficult to balance well.  For example, when i 1st got into weapons mods, i used one called DYJ\u0027s gattling gun.  I actually created a spinoff from that mod with upgrades (different calibers, different firepower, ect), but both of those mods were very difficult to balance, with them being either way too powerful and obliterating near everything, or way too weak and not doing squat.  Newer mods like BDArmory (which seems to have become the new standard of combat after skillful mod seems to have died off for the most part), have the same issue, it is very hard to balance them properly and make it so that guns not only do not instantly vaporize everything, but arent useless.\n\u003C/p\u003E\n\u003Cp\u003E\nNow stock combat (from my persepctive) is the most balanced, with perhaps the high end weapons being near impossible to counter, but in general you can make useful armor, and most weapons (with the overpowered ones made in the naval battles club thread exception) usually able to do some serious damage but not outright kill anything in 1 shot.  BDArmory may have gotten better over the years, but it just suffers too much, there are too many overpowered weapons (lazor, goalkeeper, ect), and it seems to cater too much towards missiles which are a little cheap with the autolockon.\n\u003C/p\u003E\n\u003Cp\u003E\nIf a DLC is ever released with this form, ill prolly at least take a look at it, but i doubt itll ever be as much fun/balanced as stock missiles and armor is.  Its just way more satisfying to wipe out a capital ship with a weapons made of parts that are designed for peaceful exploration.  Afterall, the devs did intend KSP to be a creative game where you make various militarized vessels out of otherwise peaceful parts \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n"}]}