{"TopicId":12715,"ForumId":24,"TopicTitle":"Bandock, at your service!","CreatedByName":"Bandock","CreatedById":28934,"CreatedDateTime":"2012-06-15T10:20:28Z","PageNum":1,"Articles":[{"CreatedByName":"Bandock","CreatedById":28934,"CreatedDateTime":"2012-06-15T10:20:28Z","Content":"\n\u003Cp\u003EYes, I played with the Kerbal Space Program demo since February 2012 after first encountering a mention of it on a website called Megagames. I decided to go ahead and visit the main website for the game download.\u003C/p\u003E\u003Cp\u003EFirst time I played with it of course, I went through the built-in tutorial (twice or three times to better understand certain concepts) and built of course the basic rocket. First designs I developed independently of course were attempts to see how high I can go. Getting stuck in space forever can be quite fun. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003ENext goal of course was to make it to the Mun. I actually tried this one on my own several times, but ended up either missing it most of the time or crashing into it (time warp related in some cases). The one time I did make to the Mun legitimately, I did not build a proper lander yet. It wasn\\\u0027t till I studied from trydyingtolive\\\u0027s Youtube tutorial (provided on the Wiki) that I begun training with a last stage design similar to his (with some later exceptions I used four winglets to try imitating some real landers as well as using a two fuel tank design). Another difference was I depended entirely on liquid fuel (instead of a mixture) to reach the Mun and make a successful landing.\u003C/p\u003E\u003Cp\u003EI got to say, learning to land took quite some time, but definitely was rewarding. I even later got to train without any kind of landers (though a very risky process which often resulted in destruction if not straight and required somewhere between 1-2 m/s to even land safely on a single engine.). That\\\u0027s about all for my story for now before I joined the forums successfully. And as a little treat, I made even a screenshot of a recent Mun landing (using demo version 0.13.3).\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://img.photobucket.com/albums/v458/Bandock/Screenshots/MunLanding1.png\u0022 alt=\u0022MunLanding1.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd by the way, it was also one of my first true attempts to practice choosing a landing site by achieving munar orbit since I gained more practice with orbiting (as well as a bit of studying from another simulator\\\u0027s manual called Orbiter, which I assume y\\\u0027all know). Well, that\\\u0027s about it as stated. If I have any interesting experience (even when I get a chance to play with the paid version), I\\\u0027ll let y\\\u0027all know. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2012-06-15T10:28:29Z","Content":"\n\u003Cp\u003EWelcome to the community Bandock, that\\\u0027s a cool pic of your Munar landing, it reminds me of when I was starting out \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EYeah landing on the engine alone is a risky business, it\\\u0027s very easy to break off the drive and strand yourself, but the sense of achievement is worth it, it\\\u0027s even harder without ASAS \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EThere\\\u0027s a lot more waiting for you in the Alpha, you can test yourself by landing next to earlier ships, rendezvous in orbit and even land on Kerbins new moon, Minmus.\u003C/p\u003E\u003Cp\u003EOr just practice with aircraft and spaceplanes \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EHave fun flying Bandock.\u003C/p\u003E\n"},{"CreatedByName":"Bandock","CreatedById":28934,"CreatedDateTime":"2012-06-15T10:33:22Z","Content":"\n\u003Cp\u003EThank you very much sal_vager. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\\\u0027ll make sure to experiment with space planes and other aircraft design when I get access to the paid version. ;D\u003C/p\u003E\n"},{"CreatedByName":"Capt\u0026#039;n Skunky","CreatedById":1261,"CreatedDateTime":"2012-06-15T16:39:23Z","Content":"\n\u003Cp\u003EWelcome to the KSP Forums!\u003C/p\u003E\u003Cp\u003EHappy Launching!\u003C/p\u003E\u003Cp\u003EArrr!\u003C/p\u003E\u003Cp\u003ECapt\\\u0027n Skunky\u003C/p\u003E\u003Cp\u003EKSP Community Manager\u003C/p\u003E\n"},{"CreatedByName":"Bandock","CreatedById":28934,"CreatedDateTime":"2012-06-15T17:28:27Z","Content":"\n\u003Cp\u003EThank You Capt\\\u0027n Skunky. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\\\u0027ll make sure to have a great time here.\u003C/p\u003E\n"}]}