{"TopicId":127209,"ForumId":16,"TopicTitle":"Flying Wing Control Surfaces","CreatedByName":"Tailwind","CreatedById":151505,"CreatedDateTime":"2015-12-07T05:47:31Z","PageNum":1,"Articles":[{"CreatedByName":"Tailwind","CreatedById":151505,"CreatedDateTime":"2015-12-07T05:47:31Z","Content":"\n\u003Cp\u003E\nWhen playing KSP 1.0.4 I had come up with a pretty good airplane to do the aerial survey contracts.  It was a flying wing design with a fuselage.  It had radial intakes near the Mk 1 cockpit up front a Wheezly in back for normal thrust.  The fuselage had one liquid fuel tank and a rocket fuel tank to feed a pair of Thuds at the rear of the fuselage for the zoom climbs.  The wings were swept with strakes and a single fin and rudder on the fuselage.  It was rather remeniscent of a LongEZ without the canard.  (I hadn\u0027t unlocked the canard yet.)  The airplane flew very well, with stall speed under 30 m/s.\n\u003C/p\u003E\n\u003Cp\u003E\nNow in 1.0.5, still fairly early in a career campaign I\u0027m trying to build a similar airplane.  The problem is the control surfaces, (elevons and discrete elevators) deflect in the opposite direction needed.  I don\u0027t remember from 1.0.4 if there was a setting to reverse the throw on the controls, or if it just recognized that there was no canard.  Has this function been removed from the game in 1.0.5?  Is there a way I can reverse the control throws manually?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nGerry\n\u003C/p\u003E\n"},{"CreatedByName":"Val","CreatedById":126227,"CreatedDateTime":"2015-12-07T09:24:39Z","Content":"\n\u003Cp\u003E\nI believe, control surfaces automatically determine their deflection direction depending on whether their hinge axis crosses the centerline infront or behind CoM.\n\u003C/p\u003E\n\u003Cp\u003E\nThough I\u0027m not 100 % on that. But it\u0027s definitely dependent on CoM.\n\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2015-12-09T08:51:01Z","Content":"\n\u003Cp\u003E\nVal is right. What you might be running into is when using a swept wing...If the connection point of the swept wing happens to be in front of the CoM, but the control surface is behind the CoM, the control surface will not deflect the correct direction (appears inverted). The fix is to move the swept wing further back.\n\u003C/p\u003E\n"},{"CreatedByName":"Tailwind","CreatedById":151505,"CreatedDateTime":"2015-12-09T16:55:03Z","Content":"\n\u003Cp\u003E\nThanks for the thoughts Val and Claw.  I\u0027ll play with it some more and report what I find.\n\u003C/p\u003E\n\u003Cp\u003E\nGerry\n\u003C/p\u003E\n"},{"CreatedByName":"cephalo","CreatedById":143148,"CreatedDateTime":"2015-12-10T14:20:57Z","Content":"\n\u003Cp\u003E\nAnother issue regarding the deflection angle of elevons is that wings seem to have a pre-determined leading edge. So if you have a delta wing on backwards, and then put elevons on what is now the rear, the pitch controls will work correctly but the roll controls will be reversed for some reason. Seems like a bug.\n\u003C/p\u003E\n\u003Cp\u003E\nThis bothers me a bit, because it\u0027s useful sometimes to have a reverse angle on the trailing edge when you have a flight profile with a high angle of attack, such as re-entry. It keeps things a bit more stable in that situation. Ah, maybe the game doesn\u0027t model things to that detail and it\u0027s just in my head. It sure looks cool though.\n\u003C/p\u003E\n\u003Cp\u003E\nEDIT: It should keep the drag closer to the CoM in that situation, so your plane doesn\u0027t want to pitch toward prograde as much.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-12-10T14:23:28Z\u0022 title=\u002212/10/2015 02:23  PM\u0022 data-short=\u00228 yr\u0022\u003EDecember 10, 2015\u003C/time\u003E by cephalo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tailwind","CreatedById":151505,"CreatedDateTime":"2015-12-13T17:05:48Z","Content":"\n\u003Cp\u003E\nVal, I think you\u0027ve hit the nail on the head.  I played with the wing mounting position, as I moved them back when the hinge line projected back to the centerline of the fuselage behind the CG, then they started to work correctly.  I tried a few other things as well. I moved the wings forward again, and adjusted the sweep with the rotate tool.  With the wing tips ridiculously in front of the CG, but the hinge line still behind, the controls still work \u0022correctly\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway, my solution was to start with a \u0027structural wing B\u0027 with the long side (not the hypotenuse) at the fuselage, then added the swept wing outboard.  I moved the wing inboard with the offset tool, clipping well into the B wing.  At this point I still wasn\u0027t happy with the location of the center of lift position so I added a \u0027C\u0027 section of wing with the long end forward, to extend the strake.  I set up all of my conventional aircraft with the CL ball within the back half of the CG ball.  Tanks are centered at or slightly behind the CG so as they drain the CG moves marginally forward.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway, got it working now, thanks for the thoughts everyone.\n\u003C/p\u003E\n\u003Cp\u003E\nGerry\n\u003C/p\u003E\n"}]}