{"TopicId":127423,"ForumId":32,"TopicTitle":"What is the most HORRIBLE way one of your kerbals died","CreatedByName":"322997am","CreatedById":146422,"CreatedDateTime":"2015-12-10T01:42:15Z","PageNum":11,"Articles":[{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2017-09-09T07:33:33Z","Content":"\n\u003Cp\u003E\nAlone. In the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E. Watching the rockets fly away without her.\n\u003C/p\u003E\n"},{"CreatedByName":"HerrCrazi","CreatedById":180017,"CreatedDateTime":"2017-09-10T10:27:03Z","Content":"\n\u003Cp\u003E\nFalling out of a re-entering vessel in upper atmosphere with no chutes. There was no emergency ship \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nUnfortunately the half of the crew survived by falling in water. The other ones lithobraked very hard. \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"RobertJPowell","CreatedById":137709,"CreatedDateTime":"2017-09-10T19:01:15Z","Content":"\n\u003Cp\u003E\nusing Baris, fully integrated rocket. crew less launch went fine. Launch with Jeb, catastrophic failure of the first stage - no more Jeb. The \u003Cabbr title=\u0022Launch Escape System\u0022\u003ELES\u003C/abbr\u003E worked fine.. only problem was the capsule was pointed towards the ground.. Poor Jeb!\n\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2017-09-10T20:55:19Z","Content":"\n\u003Cp\u003E\nUsing BARIS.  My 1st low-tech plane of a new game rolled from integration to the end of the dirt runway.  When Val pushed the button to start the engine, the cockpit itself immediately exploded.  No damage to the rest of the plane.  No trace of Val was ever found.  \n\u003C/p\u003E\n\u003Cp\u003E\nThis was horrible because it wasn\u0027t a glorious death, just pointless.   So Val\u0027s spirit is doomed to Limbo instead of Kalhalla.\n\u003C/p\u003E\n"},{"CreatedByName":"qzgy","CreatedById":160994,"CreatedDateTime":"2017-09-10T20:59:21Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223169790\u0022 data-ipsquote-contentid=\u0022127423\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221505076919\u0022 data-ipsquote-userid=\u002269507\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 minutes ago, Geschosskopf said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nUsing BARIS.  My 1st low-tech plane of a new game rolled from integration to the end of the dirt runway.  When Val pushed the button to start the engine, the cockpit itself immediately exploded.  No damage to the rest of the plane.  No trace of Val was ever found.  \n\u003C/p\u003E\n\u003Cp\u003E\nThis was horrible because it wasn\u0027t a glorious death, just pointless.   So Val\u0027s spirit is doomed to Limbo instead of Kalhalla.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHow the (expletive of choice) does that work? Like, the cockpit is nowhere near the engine. Right? RIGHT?!?\n\u003C/p\u003E\n\u003Cp\u003E\nPoor val though.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2017-09-10T21:19:05Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223169794\u0022 data-ipsquote-contentid=\u0022127423\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221505077161\u0022 data-ipsquote-userid=\u0022160994\u0022 data-ipsquote-username=\u0022qzgy\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 minutes ago, qzgy said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHow the (expletive of choice) does that work? Like, the cockpit is nowhere near the engine. Right? RIGHT?!?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell, in BARIS, pods weren\u0027t supposed to malfunction  (explosive malfunctions are an option I selected).  However, pods contain both fuel and EC so at present,  BARIS thinks they\u0027re tanks and batteries, which of course ARE subject to malfunctiond.  Angel \u0027s working on a fix for this, although I kinda like it this way.  Very Kerbal \u003Cimg alt=\u0022:cool:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 title=\u0022:cool:\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnyway, that\u0027s how Val died here.  Jeb died similarly the day before, but in his case it was when he deployed his chute at the end of the otherwise successful 1st crewed launch in this game.  So he died gloriously instead of horribly \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Confused Scientist","CreatedById":179591,"CreatedDateTime":"2017-09-10T21:34:26Z","Content":"\n\u003Cp\u003E\nMy stupidest death was \u003Cem\u003Ealmost \u003C/em\u003Ea glitch in 1.2 where I had a rover on the surface of the Mun, and whenever it loaded it would get thrown up to 7.5 km above sea level. However, nobody was onboard at the time. Instead, the stupidest death happened when I had a spacecraft on a suborbital trajectory when the game bugged out and locked control (I couldn\u0027t even timewarp). Hm, that\u0027s strange... I can\u0027t do anything. Game\u0027s not frozen, I can still move the camera... try going to space center? Still no... Hey look, I can still timewarp!\n\u003C/p\u003E\n\u003Cp\u003E\nWait.\n\u003C/p\u003E\n"},{"CreatedByName":"AeroGav","CreatedById":152027,"CreatedDateTime":"2017-09-11T20:01:53Z","Content":"\n\u003Cp\u003E\nWas playing Realism Overhaul last year, one of my first aircraft completed its survey mission and landed in the grasslands just outside the space centre peninsula.      Pressed \u0022Recover Vessel\u0022.     Nothing happens.   Pressed \u0022Return to Space Centre\u0022.  View changes to Space Centre.   Went to Tracking station.  Selected aircraft, pressed recover.  Still there.\n\u003C/p\u003E\n\u003Cp\u003E\nHaving plenty of cash,  I shrugged and took another contract, built a new airplane.    While flying this mission, got a message \u0022MK1 Cockpit has run out of food.\u0022       \n\u003C/p\u003E\n\u003Cp\u003E\nDidn\u0027t think anything of it.   The flight only took 20 minutes and I landed back at the space centre and recovered.  A few days later got a bombshell message \u0022Valentina Kerman has died of starvation\u0022 !     \n\u003C/p\u003E\n\u003Cp\u003E\nI had yet to encounter the life support issues that came with that modpack, having yet to do any space missions lasting more than a couple of orbits.  Had I known this would prove fatal, I would have tried harder to recover that glitched craft.   Worst case, I could have sent a rescue rover and had her EVA over, leave that plane as a gate guardian.        Why didn\u0027t she just order a Pizza?\n\u003C/p\u003E\n"},{"CreatedByName":"Human Person","CreatedById":174876,"CreatedDateTime":"2017-09-11T20:03:41Z","Content":"\n\u003Cp\u003E\nI fried Bob on EVA too close to the Sun.\n\u003C/p\u003E\n"},{"CreatedByName":"Sun-Guardian","CreatedById":181303,"CreatedDateTime":"2017-09-11T22:21:30Z","Content":"\n\u003Cp\u003E\nI was fairly new to the game and upon departure from the mun I somehow tapped a single key too many times and the key lock window popped up while at the same time locking my vessels direction.  So as I frantically cancelled out of the window to get back into the game my vessel proceeded to loop continuously while gaining too much speed. In a last ditch effort to save poor Jeb I angled the vessel back to the mun with what little fuel I had left. Once I ran out I had a flight path that intercepted the ground but at well over escape velocity speeds.\n\u003C/p\u003E\n\u003Cp\u003E\nneedless to say I pointed Jeb\u0027s head to the ground and hoped for the best. Jeb bounced... and never saw another celestial body again.\n\u003C/p\u003E\n"},{"CreatedByName":"Regor","CreatedById":175796,"CreatedDateTime":"2017-09-13T13:21:25Z","Content":"\n\u003Cp\u003E\nReentering capsule from Jool without heat shield.\n\u003C/p\u003E\n\u003Cp\u003E\nBECAUSE I FORGOT\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E\u003Cspan style=\u0022font-size:72px;\u0022\u003E\u003Cstrong\u003ETHUG LIFE.\u003C/strong\u003E\u003C/span\u003E\u003C/em\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"ThatHomelessGuy","CreatedById":170351,"CreatedDateTime":"2017-09-15T04:03:21Z","Content":"\n\u003Cp\u003E\nJeb starved to death after my very first launch. Playing career a kraken tried to mate with my rolling science capsule and it was ripped appart and the game crashed. When I reloaded the game he was leaving kerbins \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E at escape velocity from the kerbol system. I hadn\u0027t even enough science for the first upgrade so he starved to death on his way to glory. I kept his capsule loaded as a momento and tracked it\u0027s progress into interstellar space throughout the career. It actually blitzed through Jools \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E like it didn\u0027t exist just a straight line right through. I renamed it Jebs Voyager after that.\n\u003C/p\u003E\n"},{"CreatedByName":"MajorMushroom","CreatedById":181421,"CreatedDateTime":"2017-09-16T18:51:41Z","Content":"\n\u003Cp\u003E\nIt\u0027s not horrible, but my most frustrating death was accidentally falling from the top of a too long landing vehicle\n\u003C/p\u003E\n"},{"CreatedByName":"Jeb federation","CreatedById":173430,"CreatedDateTime":"2017-09-18T15:34:26Z","Content":"\n\u003Cp\u003E\nHad one die from an I beam going through his head... OK so maybe I initiated the launch sequence.... Alright I fired it from a tank!\u003Cimg alt=\u0022:/\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/ZNGIcon1.png\u0022 title=\u0022:/\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Helmetman","CreatedById":181322,"CreatedDateTime":"2017-09-18T16:34:19Z","Content":"\n\u003Cp\u003E\nI watched a video about Scott Manley one day that tried to shoot a prograde orbiting and a retrograde orbiting vessel against one another by matching their close encounters using 10x time decceleration with the timewarp mod.\n\u003C/p\u003E\n\u003Cp\u003E\nI did this using some high diameter vessel with tanks and structural elements (some kind of square half cubic looking space station) I tried smashing it into my KISS station [Kerbal inventory science station]\n\u003C/p\u003E\n\u003Cp\u003E\nA station I thought that was my science and assembly station. The assembly part is due to the KISS name referring to the inventory system mod and had containers with \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E cargo bays and such. The thing is, I use abbreviations for all my sattelites and stations to organize it better, said strategy backfired enormously. It seemed I had another station called KISS [Kerbal interplanetary solar settlement]\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s some kind of kerbal habitat with a lot of solar panels and some Nervas for propulsion. It had 43 Kerbals onboard.\u003Cbr\u003E\nIn terms of crew only 3 x mk1crew cabin modules survived and contained 5 Kerbals.\n\u003C/p\u003E\n\u003Cp\u003E\n38 Kerbals \u003Cabbr title=\u0022Killed in action\u0022\u003EKIA\u003C/abbr\u003E... [Bob is on the \u003Cabbr title=\u0022Killed in action\u0022\u003EKIA\u003C/abbr\u003E list] \u003Cimg alt=\u0022:confused:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 title=\u0022:confused:\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nObviously I quiksaved several seconds before impact so after I reloaded I found out I couldn\u0027t do anything to stop the catastrophy without editing the save file...\u003Cbr\u003E\nDear me.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"cratercracker","CreatedById":171449,"CreatedDateTime":"2017-09-23T20:44:43Z","Content":"\n\u003Cp\u003E\nI\u0027ve got one accidentally turn on \u0022Despacito\u0022 in his pod, he choose the not to suffer for long.\n\u003C/p\u003E\n"},{"CreatedByName":"ChampDiamondFoot","CreatedById":181594,"CreatedDateTime":"2017-09-23T23:55:38Z","Content":"\n\u003Cp\u003E\nI was doing a drop pod scenario with a pod holding 10 \u003Cs\u003Espess mehreens\u003C/s\u003E Kerbals, the pod was designed not to have parachutes. Lets just say that I should have put 1 on when testing it, maybe they wouldn\u0027t have crashed at 80m/s. \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022:wink:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"JP_Magoo","CreatedById":170727,"CreatedDateTime":"2017-09-29T03:02:12Z","Content":"\n\u003Cp\u003E\nBurning up on re-entry probably. \u003Cimg alt=\u0022:/\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/ZNGIcon1.png\u0022 title=\u0022:/\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Virdin","CreatedById":179246,"CreatedDateTime":"2017-09-29T12:02:45Z","Content":"\n\u003Cp\u003E\nSlammed his body into the ground at 2km/s. He unfortunately spagettified, giving him infinite pain and a 203G slap to the face.\n\u003C/p\u003E\n"},{"CreatedByName":"Stewcumber","CreatedById":79928,"CreatedDateTime":"2017-12-02T17:02:12Z","Content":"\n\u003Cp\u003E\nJeb signed up to KSP to see the solar system, set up colonies and moan about the wheel physics. He knew the risks, had accepted he would likely end up sitting alone on some Godforsaken rock without any snacks. However, through my incompetence Jeb actually died (rather unpleasantly it must be said) in front of the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nI feel slightly bad.\n\u003C/p\u003E\n\u003Cp\u003E\nOnly slightly.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00227MV7y47.gif\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/7MV7y47.gif\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-12-02T17:04:00Z\u0022 title=\u002212/02/2017 05:04  PM\u0022 data-short=\u00226 yr\u0022\u003EDecember 2, 2017\u003C/time\u003E by Stewcumber\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Cortwade","CreatedById":182896,"CreatedDateTime":"2017-12-02T22:58:35Z","Content":"\n\u003Cp\u003E\nThe Ares Program was doomed to fail from the start.... but I did it anyway.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nOriginally, the Ares Program was an idea to make a self-sufficient base on another planet. We had all the technology to do it... on paper... but in practice it proved difficult.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe Ares I was sent out at the first Kerbin/Duna Transfer window. It made orbit successfully, and was in the process of deorbiting to land. However, the area chosen was horrible for landing. While descending, it was discovered we\u0027d be landing in the Dunian highlands, which were around 8Km High. The drogue shoots fired successfully, but before the lander could open the primary chutes, it hit the ground at around 50 m/s, because I was firing the nukes at full force. The nukes all broke, and the core hab/constructrion module rolled away, along with about 5 rocket parts pods that I brought to allow base construction. I was immobile... but I did notice I had \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E control still. I went to the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E and devised a claw arm to attach myself to one of the rocket part pods. (Note I was using EPL). I rushed back to Ares I, and discovered I had no workshops, so no productivity... so nothing would be built on this day.\n\u003C/p\u003E\n\u003Cp\u003E\n As a response to Ares I, the Ares II was sent up at the next launch window, with the capability of being able to build more of itself. It had everything neccessary; a drill, smelter, and workshop. Or so I thought. It turns out the Extraplanetary Surface Structures\u0027 central Hub Module\u0027s workshop productivity factor... doesn\u0027t make it a workshop. So stuck with only about 40 parts, and broken solar panels, I made a new solar panel and drove along for a while, because the base was mobile. However, during an EVA mission, I did four-times warp. This caused the base to freak out and flip; the Smelter and Drill were destroyed, and all that remained was the central hub with the 4 terrified kerbals inside it. Another mission to Duna would not be devised for 3 years.\n\u003C/p\u003E\n\u003Cp\u003E\n Ares III was finally sent up. It created an entire city, with an air force to boot. However, please note that nobody died during the previous missions. It was during the Ares III mission. The central infastructure module landed a mere 3 Km from Ares II, so when I finally made a hab module for the base, I sent it off over there to pick the old crew up. (Remember, all my bases had wheels to be mobile if need be) So on the way there, I went up some steep terrain. This\u0027ll be important later. So about 3 days later, I arrived at the Ares II Final Site, and picked up the two pilots, one engineer, and one scientist that remained. This was gonna be a great day! Then on my way back, we were going down that steep terrain. Suddenly, the control Cupola exploded. I guess we hit a violent terrain change. The hab modules were now hurtling downhill at 40\u002B m/s. In a hurry, I EVA\u0027d the two pilots, and made them jump off the speeding hab. While controling one of the EVA\u0027d kerbals, I watched his friend hit the ground, and speghettify due to a kraken attack. Shortly thereafter, I saw the hab modules exploding while impacting a cliff. I then watched, in terror, as my own kerbal impacted the ground. He rolled for a few seconds, then when he got to around 10 m/s... he speghettified. That caused the deaths of 4 kerbals. The sole survivor of Ares II, who was left outside for the two years between the missions in his EVA mission, then walked back to the sole survivor of the Ares III mission. The entire base was only populated by a pilot, and an engineer for 3 years, until they finally rescued all 8 crew of the Ares I.\n\u003C/p\u003E\n"},{"CreatedByName":"SiriusRocketry","CreatedById":178125,"CreatedDateTime":"2017-12-15T02:09:20Z","Content":"\n\u003Cp\u003E\nAn early incredibly over engineered Duna rocket never even lifted a kilometer of the pad. After 260 meters, one of the \u0027Thor\u0027 KW rocketry boosters crashed into the main Goliath engine, causing the entire rocket to explode. I\u0027d had time to EVA Ardos Kerman and Bilret Kerman however. Ardos used his EVA pack and hit the ground a few meters from the pad. Bilret wasn\u0027t so lucky- she was swallowed by the launch pad inferno \u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"AngrybobH","CreatedById":165814,"CreatedDateTime":"2017-12-15T05:18:32Z","Content":"\n\u003Cp\u003E\nI flew and entirely untested spaceplane with 1 kerbal into orbit to retrieve 7 others and a huge load of science(over 6000 sci points) from \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E. The plane was based on a previous line of sub-orbital planes that were quite unstable but mostly flyable. What could possibly go wrong? I flew straight into orbit and performed the rendezvous and it was smooth the whole way. de-orbit was uneventful. The glide path looked ok. Somewhere about mach 3.5 and still over 20 km in the air the airframe decided it liked yawing left better than flying straight. The flat spin was recoverable after losing 5 km altitude and it still had the speed to make the runway. At 2km up and still a touch over mach 1 it decided upside down was better. An engine burn and some frantic inputs put me over the ocean at about 200m and still mach 1. Thats when it suddenly rolled left and yawed into the water. The left wing exploded and the plane rolled right and pitched hard into the waves. 1 landing gear and the cargo bay with all my science is all that survived. So, it was a success after all.\n\u003C/p\u003E\n"},{"CreatedByName":"Inverurie Jones","CreatedById":154679,"CreatedDateTime":"2017-12-15T19:45:27Z","Content":"\n\u003Cp\u003E\nAn unfortunate glitch resulted in the simultaneous de-orbiting of \u003Cem\u003ESpacelab 1 \u003C/em\u003Eand the KSS \u003Cem\u003EDiscovery. \u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI sent all the crew to the REKT escape pods and ejected them in the upper atmosphere. Unfortunately one pulled a Goose and collided with part of the station as it ejected, destroying its parachute.\n\u003C/p\u003E\n\u003Cp\u003E\nFive little yellow pods floated slowly down to the surface while the sixth spun off into the distance, following roughly the same trajectory as the pin-wheeling wreck of the station.\n\u003C/p\u003E\n"},{"CreatedByName":"Gyrfalcon5","CreatedById":177625,"CreatedDateTime":"2017-12-15T20:00:18Z","Content":"\n\u003Cp\u003E\nBeing part of the KSS team, I pay with stellar bodies all the time, especially for an upcoming project. Anyway, I was Hyperediting a Kerbal into position around a binary system for a screenshot. These particular stars, Kerolon and Kerlim, were White Giant and Red Dwarf respectively. And so, while moving in Jeb as close as I could without starting to get glitchy-star edges, I realized too late that the \u0027temperature\u0027 cheat was disabled. RIP Jeb. I got the screenshot, though!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022coverphoto.png\u0022 src=\u0022https://photos-2.dropbox.com/t/2/AAAKhojI7-vNzD99MWybHQNvcBlTTEtmXcOAxcymP9zZpQ/12/468538116/png/32x32/1/_/1/2/coverphoto.png/ELeKuOUDGKEDIAcoBw/9B2kK04vdqHxUs8JSAgIoqSK0y8bEfTZA_kNMN_n0qw?preserve_transparency=1\u0026amp;size=800x600\u0026amp;size_mode=3\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n#ShamelessPromotion \n\u003C/p\u003E\n"}]}