{"TopicId":127731,"ForumId":55,"TopicTitle":"adding multiplayer","CreatedByName":"wolf creates16","CreatedById":128163,"CreatedDateTime":"2015-12-12T23:28:02Z","PageNum":6,"Articles":[{"CreatedByName":"Nightshift83","CreatedById":156712,"CreatedDateTime":"2016-02-24T18:13:38Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222427754\u0022 data-ipsquote-contentid=\u0022127731\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221456336449\u0022 data-ipsquote-userid=\u002232993\u0022 data-ipsquote-username=\u0022razark\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 minutes ago, razark said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSuccess in one business does not automatically translate into success in another.  Just because a company had a good history of marketing, you can\u0027t expect them to have success with, for example, writing video games.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n(Of course, there\u0027s nothing to say a company \u003Cem\u003Ecan\u0027t\u003C/em\u003E be successful in a different industry than they have previously worked in.)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nLast reply on this one, what other company could have a more broaden experience in multimedia than an advert company ? (don\u0027t get me wrong I usually hate these guys and their respective working field :))\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnd yes why can\u0027t they be successful ? I mean they brought us KSP.. So what can you expect from a gaming company - EA - Ubisoft - SEGA (everything from RomeII up to Attila in their case) these days??????\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nor guys like P.Molineux..Sid Meier..?? Hell, if Heinz-Ketchup throws out a good video game I wouldn\u0027nt mind (might be bad example due to political implications)\n\u003C/p\u003E\n"},{"CreatedByName":"razark","CreatedById":32993,"CreatedDateTime":"2016-02-24T18:23:10Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222427786\u0022 data-ipsquote-contentid=\u0022127731\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221456337618\u0022 data-ipsquote-userid=\u0022156712\u0022 data-ipsquote-username=\u0022Nightshift83\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 minutes ago, Nightshift83 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nLast reply on this one, what other company could have a more broaden experience in multimedia than an advert company ?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nA successful video game involves a lot more than just multimedia work, and a lot of that experience is not going to be found in both advertising and game development.  Multimedia work?  Sure.  But what about user interface design?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222427786\u0022 data-ipsquote-contentid=\u0022127731\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221456337618\u0022 data-ipsquote-userid=\u0022156712\u0022 data-ipsquote-username=\u0022Nightshift83\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 minutes ago, Nightshift83 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAnd yes why can\u0027t they be successful ? I mean they brought us KSP.. So what can you expect from a gaming company - EA - Ubisoft - SEGA (everything from RomeII up to Attila in their case) these days??????\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWould you expect someone to hire EA or Ubisoft to develop advertisements?  When your dog is sick, do you take it to a veterinarian or a bricklayer?  If you want a company to develop a new airliner for you, would you call Boeing or a plumber?\n\u003C/p\u003E\n"},{"CreatedByName":"Nightshift83","CreatedById":156712,"CreatedDateTime":"2016-02-24T18:32:50Z","Content":"\n\u003Cp\u003E\nAwe c\u0027mon video game industry has changed so much these days. And for your comparison: I trust a vetenerian to tell me if my finger might be broken or not he does\u0027nt even have to be specialized in monkeys.\n\u003C/p\u003E\n\u003Cp\u003E\nEA and Ubisoft developing advertisements ? What do think made them so successfull ? I mean just look at \u0027Watchdogs\u0027 or \u0027Silent Hunter V\u0027 compared to the expectations and what was delivered even the endproduct was merely and advertisement.\n\u003C/p\u003E\n\u003Cp\u003E\nBut seriously I don\u0027t want to get this thread off-topic.\n\u003C/p\u003E\n\u003Cp\u003E\nCan\u0027t we agree on that SQUAD that seemingly derived from an ad-company had delivered one of the best, unique games in the last years ?\n\u003C/p\u003E\n\u003Cp\u003E\nWhat other agrument should one need ??\n\u003C/p\u003E\n\u003Cp\u003E\n(Seriously I\u0027m not going to talk to you anymore if you don\u0027t bow before my clever argumentation now!)\n\u003C/p\u003E\n"},{"CreatedByName":"razark","CreatedById":32993,"CreatedDateTime":"2016-02-24T18:52:42Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222427811\u0022 data-ipsquote-contentid=\u0022127731\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221456338770\u0022 data-ipsquote-userid=\u0022156712\u0022 data-ipsquote-username=\u0022Nightshift83\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n15 minutes ago, Nightshift83 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nCan\u0027t we agree on that SQUAD that seemingly derived from an ad-company had delivered one of the best, unique games in the last years ?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI never said I thought Squad couldn\u0027t or hadn\u0027t done so.  I was just pointing out why people might have issues with a marketing company attempting to break into the video game industry.  Frankly, Squad shows exactly how well it can be done.\n\u003C/p\u003E\n\u003Cp\u003E\nBut yes, this is rather off-topic.\n\u003C/p\u003E\n"},{"CreatedByName":"Nightshift83","CreatedById":156712,"CreatedDateTime":"2016-02-24T18:54:56Z","Content":"\n\u003Cp\u003E\nApology accepted \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-02-24T18:55:14Z\u0022 title=\u002202/24/2016 06:55  PM\u0022 data-short=\u00228 yr\u0022\u003EFebruary 24, 2016\u003C/time\u003E by Nightshift83\u003C/strong\u003E\n\u003Cbr\u003Ejust kidding\n\u003C/span\u003E\n"},{"CreatedByName":"Zer0Winds","CreatedById":159204,"CreatedDateTime":"2016-02-29T22:04:01Z","Content":"\n\u003Cp\u003E\nUh... Question... How would Multiplayer work? This game requires you to time warp, which if one person was to time warp, how would it affect everyone else? And would people be queued to launch? Or are there multiple space centers? I just don\u0027t see multiplayer working in this game... I saw sal say it\u0027s under development, but I say this anyway; Do we NEED multiplayer? There are plenty of space simulation multiplayer games (Space Engineers is an example, though I may be wrong, I\u0027ve mostly just heard about the game) and this one just doesn\u0027t seem to work well with it. Time warping would be weird since it affects the Kerbol System, making celestial bodies move faster, and ships and stations orbit faster. I suppose if it was limited to Kerbin, but then it wouldn\u0027t be Kerbal SPACE Program. Sure it would be cool to be flying planes into each other, or working together on a massive Mun Base, but... I just can\u0027t see it working. I\u0027m sorry, but it\u0027s just not something I can see in KSP.\n\u003C/p\u003E\n"},{"CreatedByName":"Zer0Winds","CreatedById":159204,"CreatedDateTime":"2016-02-29T22:13:17Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222327429\u0022 data-ipsquote-contentid=\u0022127731\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221450418094\u0022 data-ipsquote-userid=\u0022150717\u0022 data-ipsquote-username=\u0022DrMarlboro\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 12/18/2015 at 9:54 PM, DrMarlboro said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI just don\u0027t see how multiplayer would work in this game without ruining it.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat is there to do in multiplayer? Build a station, but then how do you decided who pilots the station? How does building that station benefit anyone? How do we get to that station without time warp in a decent amount of time? \n\u003C/p\u003E\n\u003Cp\u003E\nBut what else is there to do together? Well.. nothing except dogfighting because anything on Kerbin can pretty much be done in real time. \n\u003C/p\u003E\n\u003Cp\u003E\nKsp isn\u0027t like survival games, or rts games, or shooters. In survival games you can both work on a base, gather resources, defend that base from ai and other players, and in rts you can play against each other or work towards a common victory condition, and I don\u0027t think I need to explain shooters. The point is, since rocket and plane building is very much a one person job, there really is no way to have multiplayer that isn\u0027t combat oriented. Which aparently is all some people want anyway, but it doesn\u0027t fit ksp very well. \n\u003C/p\u003E\n\u003Cp\u003E\nThe only feasible multiplayer I could think of would be the space race me and my friends do. But that would only require integrated tracking of other clients, since we don\u0027t actually have to be in the same game. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah I was pretty much thinking the same thing when I said what I said. Sorry, I didn\u0027t read into it after seeing most people saying how much of a good idea it was.\n\u003C/p\u003E\n"},{"CreatedByName":"pandaman","CreatedById":130621,"CreatedDateTime":"2016-03-01T14:28:50Z","Content":"\n\u003Cp\u003E\nAs I said before multi player is not really my thing personally, but IF they get it to work in a way they are happy with then I see no problem with it, as long as I can still play solo offline. \n\u003C/p\u003E\n\u003Cp\u003E\nI can see MP working and being great fun for relatively small groups playing co-op missions or going to war with each other.  I really don\u0027t envision a MMO type situation with hundreds of players, and if it can be done then thats impressive and good luck to them, I just doubt I will join in.\n\u003C/p\u003E\n"},{"CreatedByName":"Po0ka","CreatedById":100192,"CreatedDateTime":"2016-03-02T14:58:29Z","Content":"\n\u003Cp\u003E\nMe and my friends are patiently waiting for the multiplayer feature to come out, doing war is only one of the many possibilities offered by such feature.\u003Cbr\u003E\nWe tried the multiplayer mods out there and we kept getting trouble related to either time warp, ship duplicating, random explosions, and more.\u003Cbr\u003E\nIf someone does not want multiplayer, so be it, he can still play in single player.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, griefing is most likely to happen when playing with strangers, just don\u0027t play on publicly announced servers and there should be no problem.\n\u003C/p\u003E\n"},{"CreatedByName":"Tonyiih","CreatedById":163882,"CreatedDateTime":"2016-05-09T07:51:13Z","Content":"\n\u003Cp\u003E\nHi everyone,\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI know this is a subject that has been discussed alot over the last years, but I wonder why there isn\u0027t a multiplayer/co-op feature yet in this game.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m talking about a multiplayer/co-op/lan connection mode where you can play with friends and do the career mode together. Maybe it would be a good idea to have two or more KSP centers placed on Kerbin so you and you\u0027re friends each has its own KSP center. I really like to play this game with a good friend without lag, on a real-time basis. I\u0027d like to track his progress, his vessels and what he is doing in real-time in the same game as I am playing in. This way we can create big space stations and do missions together.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI am wondering if the developers are still thinking to add these features to the game, because it would add alot of dynamic to the game.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe multiplayer mod for KSP is pretty awesome too and works a little bit with the features I just wrote, but it just is not perfect. If someone can create a mod like this, it would be kind of easy for the developers to create a good and stable multiplayer/co-op feature for the game I think.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nHow do you guys think about this?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nKind regards,\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnthonie\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-09T07:52:36Z\u0022 title=\u002205/09/2016 07:52  AM\u0022 data-short=\u00228 yr\u0022\u003EMay 9, 2016\u003C/time\u003E by Tonyiih\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Redneck","CreatedById":2030,"CreatedDateTime":"2016-05-10T14:30:15Z","Content":"\n\u003Cp\u003E\nI just hope that if multiplayer is implemented that we can host our own server. I hope squad doesn\u0027t use a central server setup with a possible pay-to-play idea like say wow. And also why start over with development? Why not just improve and refine DMP? \n\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2016-05-10T14:45:50Z","Content":"\n\u003Cp\u003E\nDMP isn\u0027t quite enough, we\u0027d want better than that, and I\u0027m 100% in favour of player hosted games including LAN support.\n\u003C/p\u003E\n"},{"CreatedByName":"Fred Cop","CreatedById":146298,"CreatedDateTime":"2016-05-10T19:10:09Z","Content":"\n\u003Cp\u003E\nPersonally, I can see an issue with Multiplayer; \u0022Mistake Tolerance\u0022 (Might not be the best way to describe it)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIn KSP\u0027s current singleplayer stage, when you make mistakes or your rocket and planes fall apart, it can be funny and teaches us about new things we should be aware about when making crafts, such as structure, fuel flow, etc. And of course if the vessel isn\u0027t perfect on launch, you can always revert back. It becomes an entertaining game of trial and error.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n...In multiplayer, this may become a handicap. Imagine you are playing multiplayer with your friends and you decide to make a space station, or a mothership, or anything that requires more than one launch to fly and assemble. You all make it to High Kerbin Orbit, and it turns out a friend\u0027s component of the station/base/ship is faulty, or their rocket runs out of fuel.\n\u003C/p\u003E\n\u003Cp\u003E\nYou\u0027d have to wait many, many minutes for your friend to change the rocket or station/base/ship segment, fly it out of Kerbin\u0027s atmosphere, and spend many more trying to get as close to the final assembly. And I think you\u0027d lose interest before they can orbit Kerbin, meaning you\u0027d either leave the station/base/ship to do other things for fun or give up on multiplayer entirely. It becomes a game of \u0022prove that twiddling your thumbs for long periods of time is exciting\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBut other than that, I can\u0027t help but think about burning Kerbals via atmospheric re-entry with a couple of friends.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-10T19:23:25Z\u0022 title=\u002205/10/2016 07:23  PM\u0022 data-short=\u00228 yr\u0022\u003EMay 10, 2016\u003C/time\u003E by Fred Cop\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"mattinoz","CreatedById":118580,"CreatedDateTime":"2016-05-11T07:51:03Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222573505\u0022 data-ipsquote-contentid=\u0022127731\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221462907409\u0022 data-ipsquote-userid=\u0022146298\u0022 data-ipsquote-username=\u0022Fred Cop\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, Fred Cop said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIn KSP\u0027s current singleplayer stage, when you make mistakes or your rocket and planes fall apart, it can be funny and teaches us about new things we should be aware about when making crafts, such as structure, fuel flow, etc. And of course if the vessel isn\u0027t perfect on launch, you can always revert back. It becomes an entertaining game of trial and error.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIf trial and error is fun in single player why would it suddenly be not fun in multi-player?\n\u003C/p\u003E\n\u003Cp\u003E\nTo me the fun of multi-player would be opening up new trials to make errors in. Either you\u0027re competitive then avoiding errors is about bragging rights. Co-operative then you as a team use each other skills to trial things you can\u0027t do on your own and use your strengths to avoid errors.\n\u003C/p\u003E\n\u003Cp\u003E\nTo me in KSP time is rarely critical enough that if a couple of missed launches are going to stop you. That\u0027s all tied in to the challenge the team sets however there is many bodies in system that 100dV will buy you a day or two of catch up in the transfer window.\n\u003C/p\u003E\n\u003Cp\u003E\nTo me one-player causing others to be bored is always going to be a social issue that is very hard for game mechanics to solve. \n\u003C/p\u003E\n"},{"CreatedByName":"PlutoPlanet126","CreatedById":164045,"CreatedDateTime":"2016-05-12T00:39:56Z","Content":"\n\u003Cp\u003E\nKSP Multiplayer would be so cool!\n\u003C/p\u003E\n"},{"CreatedByName":"jwenting","CreatedById":57735,"CreatedDateTime":"2016-05-13T20:03:49Z","Content":"\n\u003Cp\u003E\nKSP Online, now with Microtransactions.\n\u003C/p\u003E\n\u003Cp\u003E\nTerrier engines, special discount today: 10 for $4.99!!!\n\u003C/p\u003E\n\u003Cp\u003E\nTHAT is the future you\u0027re getting with multiplayer. Thanks but no thanks.\n\u003C/p\u003E\n"},{"CreatedByName":"mattinoz","CreatedById":118580,"CreatedDateTime":"2016-05-13T23:39:40Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222579907\u0022 data-ipsquote-contentid=\u0022127731\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221463169829\u0022 data-ipsquote-userid=\u002257735\u0022 data-ipsquote-username=\u0022jwenting\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, jwenting said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nKSP Online, now with Microtransactions.\n\u003C/p\u003E\n\u003Cp\u003E\nTerrier engines, special discount today: 10 for $4.99!!!\n\u003C/p\u003E\n\u003Cp\u003E\nTHAT is the future you\u0027re getting with multiplayer. Thanks but no thanks.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhy would multi-player lead to #microTransactionAreEvil?\n\u003C/p\u003E\n\u003Cp\u003E\nsure it needs a server but we could host them ourselves or if of value to how we are playing or the group we playing with we might rent a cloud instance to be the server. To me that is just user pays not competitor pays like micro transactions. \n\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2016-05-13T23:52:12Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222580396\u0022 data-ipsquote-contentid=\u0022127731\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221463182780\u0022 data-ipsquote-userid=\u0022118580\u0022 data-ipsquote-username=\u0022mattinoz\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n13 minutes ago, mattinoz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhy would multi-player lead to #microTransactionAreEvil?\n\u003C/p\u003E\n\u003Cp\u003E\nsure it needs a server but we could host them ourselves or if of value to how we are playing or the group we playing with we might rent a cloud instance to be the server. To me that is just user pays not competitor pays like micro transactions. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI think he is more referencing the Minecraft paradigm than a micro-transaction game format (even though he called it microtransactions).  However, it\u0027s a silly comparison.  Just because some servers choose to do that to pay for the server cost doesn\u0027t mean there aren\u0027t thousands of other people hosting private servers for their friends.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-13T23:52:55Z\u0022 title=\u002205/13/2016 11:52  PM\u0022 data-short=\u00228 yr\u0022\u003EMay 13, 2016\u003C/time\u003E by Alshain\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"jwenting","CreatedById":57735,"CreatedDateTime":"2016-05-15T02:03:54Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222580396\u0022 data-ipsquote-contentid=\u0022127731\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221463182780\u0022 data-ipsquote-userid=\u0022118580\u0022 data-ipsquote-username=\u0022mattinoz\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn ‎5‎/‎13‎/‎2016 at 1:39 AM, mattinoz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhy would multi-player lead to #microTransactionAreEvil?\n\u003C/p\u003E\n\u003Cp\u003E\nsure it needs a server but we could host them ourselves or if of value to how we are playing or the group we playing with we might rent a cloud instance to be the server. To me that is just user pays not competitor pays like micro transactions. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSomeone has to pay for the servers. Which means either an item mall, in game purchases (which boils down to the same thing), or a subscription fee.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd the trend in online gaming has for over a decade been to move towards item malls and in game purchases because it\u0027s both more profitable and leads to less opposition from the player base (many of whom will happily spend hundreds of dollars a week in an item mall but complain at having to pay a $10 a month subscription fee, complaining the latter is way too much).\n\u003C/p\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2016-05-15T03:19:48Z","Content":"\n\u003Cp\u003E\nwhy is it people still want multiplayer? there are far too many things that can go wrong, too many hurdles \u0026lt;part counts, mods, trolls, etc\u0026gt; to be accounted for for this to be viable in a game, that I have said before, and shall say again: KSP does not now, nor has it EVER lent itself to anything more than a single player game. \n\u003C/p\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2016-05-15T03:46:40Z","Content":"\n\u003Cp\u003E\nI think its challenging, but it could be fun. I know several friends with whom I\u0027d love to do a cooperative build with. Just seeing other people\u0027s creations and collaborations interacting would be a blast. \n\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2016-05-15T04:29:05Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222582525\u0022 data-ipsquote-contentid=\u0022127731\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221463282388\u0022 data-ipsquote-userid=\u002278020\u0022 data-ipsquote-username=\u0022AlamoVampire\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n13 hours ago, AlamoVampire said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nwhy is it people still want multiplayer? there are far too many things that can go wrong, too many hurdles \u0026lt;part counts, mods, trolls, etc\u0026gt; to be accounted for for this to be viable in a game, that I have said before, and shall say again: KSP does not now, nor has it EVER lent itself to anything more than a single player game. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nFor the same reasons we always wanted multiplayer.  The reasons haven\u0027t changed just because you don\u0027t want multiplayer.  If you don\u0027t want multiplayer, then when it gets here... don\u0027t play it.  It\u0027s really that simple.  It just simply won\u0027t affect you.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-15T16:48:11Z\u0022 title=\u002205/15/2016 04:48  PM\u0022 data-short=\u00228 yr\u0022\u003EMay 15, 2016\u003C/time\u003E by Alshain\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2016-05-15T05:20:21Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/110959-alshain/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022110959\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/110959-alshain/\u0022 rel=\u0022\u0022\u003E@Alshain\u003C/a\u003E Lack of imagination? It\u0027s the imagination of HOW IT \u003Cstrong\u003E\u003Cem\u003E\u003Cu\u003EWILL GO WRONG\u003C/u\u003E\u003C/em\u003E\u003C/strong\u003E that makes me say its bad.\n\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2016-05-15T05:21:24Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222582635\u0022 data-ipsquote-contentid=\u0022127731\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221463289621\u0022 data-ipsquote-userid=\u002278020\u0022 data-ipsquote-username=\u0022AlamoVampire\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 minute ago, AlamoVampire said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/110959-alshain/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022110959\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/110959-alshain/\u0022 rel=\u0022\u0022\u003E@Alshain\u003C/a\u003E Lack of imagination? It\u0027s the imagination of HOW IT \u003Cstrong\u003E\u003Cem\u003E\u003Cu\u003EWILL GO WRONG\u003C/u\u003E\u003C/em\u003E\u003C/strong\u003E that makes me say its bad.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nLike I said, then don\u0027t play it.  This is entirely a feature that doesn\u0027t affect you if you don\u0027t use it.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-15T05:22:03Z\u0022 title=\u002205/15/2016 05:22  AM\u0022 data-short=\u00228 yr\u0022\u003EMay 15, 2016\u003C/time\u003E by Alshain\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2016-05-15T06:34:28Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222582637\u0022 data-ipsquote-contentid=\u0022127731\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221463289684\u0022 data-ipsquote-userid=\u0022110959\u0022 data-ipsquote-username=\u0022Alshain\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Alshain said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nLike I said, then don\u0027t play it.  This is entirely a feature that doesn\u0027t affect you if you don\u0027t use it.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI agree right up until the inevitable and entirely unavoidable happens after they add a thing not needed: single player content development and polish suffer because resources forcibly shift to the not needed thing.\n\u003C/p\u003E\n"}]}