{"TopicId":128443,"ForumId":25,"TopicTitle":"KAS KIS Manual Assembly Duna Challenge","CreatedByName":"sardia","CreatedById":149922,"CreatedDateTime":"2015-12-22T18:01:38Z","PageNum":1,"Articles":[{"CreatedByName":"sardia","CreatedById":149922,"CreatedDateTime":"2015-12-22T18:01:38Z","Content":"\n\u003Cp\u003E\nWhile I was arriving my base on duna, some of my rockets had accidents and broke apart, so I had to reattached them. This is where I got my idea for the challenge. You must assemble a rocket that will get you to kerbin using nothing more than KAS and the spare parts letting the countryside ( courtesy of hyper edit). The only requirements are you must assemble it piece by piece. If needed you are allowed to edit the cfg to reduce the number of kerbals needed. Ie screwdriver doesn\u0027t require engineers or to increase the weight limit that kerbals can move. I know it can be prohibitive how many engineers you\u0027d need just to assemble a medium sized rocket. I\u0027ll post pics when I attempt it myself. \n\u003C/p\u003E\n"},{"CreatedByName":"sardia","CreatedById":149922,"CreatedDateTime":"2015-12-23T06:28:18Z","Content":"\n\u003Cp\u003E\n\u003Ca href=\u0022http://imgur.com/a/Ux7WT\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/Ux7WT\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nfirst attempt started off well,\u003Cbr\u003E\nthe rocket was building straight up and I was feeling I wouldn\u0027t even need the extra gear to make sure it stayed up.\n\u003C/p\u003E\n\u003Cp\u003E\nThe rocket is too tall, and I can\u0027t hold items in my inventory and jump, cuz I\u0027d be too heavy. I ended up jumping aboard and tilting the vehicle onto it\u0027s belly. Or so I tried, until it flips tits up.\n\u003C/p\u003E\n\u003Cp\u003E\nReaction wheels are pretty OP, as I managed to right the upside vehicle by attaching the Reaction wheels, a mk2 probe, and the cockpit.\n\u003C/p\u003E\n\u003Cp\u003E\nI skipped the tedious scene of me assembling a ragtag miner \u002B refueling scene, but there we go.\n\u003C/p\u003E\n\u003Cp\u003E\nDamn the fat butt on the nerva, I had a tail strike, which means I need to shove another nuke on there. No other damage though, so salvagable. I\u0027m starting to regret attaching those (broken!) landing legs.\n\u003C/p\u003E\n\u003Cp\u003E\nDamn, I flipped in flight.\n\u003C/p\u003E\n\u003Cp\u003E\nMuch easier to take off when you find a nice mountain to use as a ramp\n\u003C/p\u003E\n\u003Cp\u003E\nMade it to Low Duna Orbit Yay! Now to wait a year for the transfer window...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nPS How do you post albums?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-12-23T06:29:09Z\u0022 title=\u002212/23/2015 06:29  AM\u0022 data-short=\u00228 yr\u0022\u003EDecember 23, 2015\u003C/time\u003E by sardia\u003C/strong\u003E\n\u003C/span\u003E\n"}]}