{"TopicId":128468,"ForumId":16,"TopicTitle":"How to activate the separator","CreatedByName":"JackBush","CreatedById":149535,"CreatedDateTime":"2015-12-22T23:39:10Z","PageNum":1,"Articles":[{"CreatedByName":"JackBush","CreatedById":149535,"CreatedDateTime":"2015-12-22T23:39:10Z","Content":"\n\u003Cp\u003E\nHere is the rover atop my ship. It is attached by a TR-18D stack separator which I first put on the command pod.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://imgur.com/kWNtQL7\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/kWNtQL7\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI got the ship with 3 Kerbals safely to Mun but don\u0027t know how to activate or trigger the separator so that it will pop or fling the rover off and onto the ground.\n\u003C/p\u003E\n\u003Cp\u003E\nHere is the description of the separator:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://imgur.com/gtmqUvn\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/gtmqUvn\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI have no idea what \u0022Crossfeed toggles in Editor, Flight default off\u0022 means. What is the editor? How would I turn default to \u0022on\u0022? \n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve been struggling with this whole attachment business for about 10 days now. I\u0027m now the swiftest learner around but I can put that ship together in about 60 seconds now, I\u0027ve done it so many times trying to get things right. This program is the least intuitive I\u0027ve ever used, going back to when I began using computers (1980s). People like me are fortunate to have a caring community such as the knowledgeable ones on this forum. I like the game a lot, but it\u0027s frustrating as hell. And I\u0027m grateful for the help I get here. \n\u003C/p\u003E\n\u003Cp\u003E\nI look forward to whatever answers you can provide to the questions above. I have 3 Kerbals sitting on Mun, waiting patiently to find out if they\u0027re going to get to ride around on their rover. Thanks in advance.\n\u003C/p\u003E\n\u003Cp\u003E\nSorry about the duplication!\n\u003C/p\u003E\n"},{"CreatedByName":"ForScience6686","CreatedById":144187,"CreatedDateTime":"2015-12-23T00:08:36Z","Content":"\n\u003Cp\u003E\nIt should default to on, which means it will be in the staging lineup.  So make sure it\u0027s in the right order and press space bar.  You can hover the mouse over it and it will highlight the staging icon for it.  If that doesn\u0027t work, chances are you placed it improperly attaching to the wrong node, or you already staged it and it didn\u0027t have the power to push your payload up and off.  \n\u003C/p\u003E\n"},{"CreatedByName":"Greenhornet553","CreatedById":154907,"CreatedDateTime":"2015-12-23T00:11:21Z","Content":"\n\u003Cp\u003E\nI think it refers to fuel crossfeed that usually is disabled unless enable during flight and in the VAB\n\u003C/p\u003E\n\u003Cp\u003E\nBTW That arrangement is horrifying, this is why we use sky cranes or somehow attach it to the bottom of the lander. If your Lander or Rover has torque, try decoupling it then shake the Lander or Rover till it falls off.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-12-23T00:15:42Z\u0022 title=\u002212/23/2015 12:15  AM\u0022 data-short=\u00228 yr\u0022\u003EDecember 23, 2015\u003C/time\u003E by Greenhornet553\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2015-12-23T00:26:17Z","Content":"\n\u003Cp\u003E\nDuplicate thread \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/128467-how-to-activate-the-separator/\u0022\u003Ehttp://forum.kerbalspaceprogram.com/index.php?/topic/128467-how-to-activate-the-separator/\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2015-12-23T01:32:41Z","Content":"\n\u003Cp\u003E\nLocking duplicate thread.  Carry on, all \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}