{"TopicId":128479,"ForumId":44,"TopicTitle":"Porkchop plot \u002B showing your flight path and where it will take you next (gravity assists)","CreatedByName":"Ens Gijs","CreatedById":11410,"CreatedDateTime":"2015-12-23T01:50:01Z","PageNum":1,"Articles":[{"CreatedByName":"Ens Gijs","CreatedById":11410,"CreatedDateTime":"2015-12-23T01:50:01Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:28px;\u0022\u003E\u003Cstrong\u003EThe proof of concept is now live at \u003Ca href=\u0022http://ens-gijs.github.io/ksp/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://ens-gijs.github.io/ksp/\u003C/a\u003E\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve been working on  adding flyby calculation to \u003Ca href=\u0022http://alexmoon.github.io/ksp/\u0022 rel=\u0022external nofollow\u0022\u003Ealexmoon\u0027s launch window planner\u003C/a\u003E for a couple of weeks in the evenings. It\u0027s coming along nicely but there is so much more I want to do with it \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe idea is that you will be able to click on the porkchop plot and see the flight path of not only the selected orbit but also of where that flight path can take you next. I\u0027m working on showing secondary interactions without making an absolute mess of things. She\u0027s a little rough but working well. Try this flight path out to get a flyby of the Mun from Minmus which results in a return to Kerbin.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022w3F686j.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/w3F686j.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe left image shows a transfer from Minmus to the Mun that results in a Kerbin deorbit flight path. \u003Cem\u003EUninteresting parts of the flight path were Photoshoped lighter - I haven\u0027t coded that up yet. \u003C/em\u003EThe Mun is shown twice, once with a label and once without - the one with the label is where the Mun is when you leave Minmus, the one without a label is where the Mun will be when you encounter it.\n\u003C/p\u003E\n\u003Cp\u003E\nThe right image is the flyby condition at the Mun. Kerbin is directly \u0022up\u0022 in that image and the Mun is traveling from left to right. The Pe at Mun is 7548m, which is minimum safe distance \u002B500m.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnyway, this post is just a hello world post for the project. \u003Cs\u003EI\u0027ll be working on it through the holiday and hopefully have it up and running somewhere you can play with it in a couple of days.\u003C/s\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-01-19T01:12:26Z\u0022 title=\u002201/19/2016 01:12  AM\u0022 data-short=\u00228 yr\u0022\u003EJanuary 19, 2016\u003C/time\u003E by Ens Gijs\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Frida Space","CreatedById":60943,"CreatedDateTime":"2015-12-23T11:03:56Z","Content":"\n\u003Cp\u003E\nThis would be great! Planning flybys for me has been such a tedious job. However I suggest putting this in some other forum where it can get proper attention! Good luck on your project \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Shania_L","CreatedById":58975,"CreatedDateTime":"2015-12-23T17:03:54Z","Content":"\n\u003Cp\u003E\nI\u0027d get this just for visualisation of the orbit I\u0027ll get off a single burn.\n\u003C/p\u003E\n\u003Cp\u003E\nIts great and all knowing where the \u0027cheap\u0027 burns and planet transfers occur, but I\u0027d just like to see the route I\u0027ll be taking\n\u003C/p\u003E\n"},{"CreatedByName":"PLAD","CreatedById":104158,"CreatedDateTime":"2015-12-24T15:54:21Z","Content":"\n\u003Cp\u003E\nThat looks really nice. Just that demo shows two things Flyby Finder can\u0027t do- show a graph of the path, and flybys of moons. I like that touch of showing the SOI\u0027s of the bodies in the overview rather than little dots for the bodies themselves. I look forward to seeing what you come up with!\n\u003C/p\u003E\n"},{"CreatedByName":"Ens Gijs","CreatedById":11410,"CreatedDateTime":"2015-12-26T20:10:35Z","Content":"\n\u003Cp\u003E\nThe proof of concept is now live at \u003Ca href=\u0022http://ens-gijs.github.io/ksp/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://ens-gijs.github.io/ksp/\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nMouse wheel will zoom you in and out. Click and drag to pan. If you are calculating transfers between moons the main solar view will track your primary (the planet the moons are orbiting) which may be a little annoying but it\u0027s better than the planet always shifting fully out of view.\n\u003C/p\u003E\n\u003Cp\u003E\nThe \u0022Final orbit\u0022 field is used to specify the flyby Pe at the destination body.\n\u003C/p\u003E\n\u003Cp\u003E\nFor now there is no control over side of passing - you cannot yet specify if you want to pass in front of or behind the target body for a higher or lower flyby orbit than the original - this is on my list of things to do.\n\u003C/p\u003E\n\u003Cp\u003E\nJust like Alex\u0027s original tool the results you are shown will not be exactly how things will happen in game. Especially around bodies with large SOI\u0027s relative to the length of your flight path (e.g. transferring between moons and flying by Jool). The patch conics approximation completely ignores SOI\u0027s - it considers the flight path turn and velocity changes to be instantaneous. I might improve on this in the future but there is a long list of things i need to get to before this.\n\u003C/p\u003E\n\u003Cp\u003E\nOne last note: the view on the right showing the flyby trajectory is always normalized - that is, it is rotated so the destination body is traveling left to right and its primary (e.g. the sun) is, nearly, directly up and the view is rotated such that the views XY plane is aligned with the plane of the flyby orbit... translation until i get 3d rotation support in that view know that it is aligned with your flyby\u0027s orbit and is not a strait \u0022down\u0022 view onto the body. To see this in action set a transfer from Kerbin to Eeloo and note the dots and \u0022rod\u0022 on the body - these represent the north and south poles and the line between them to help you get a sense of orientation. If you didn\u0027t follow this last bit dont worry about it \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EIf you want to look at the code... don\u0027t \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E this is a very rough thrown together proof of concept - it\u0027ll get a complete overhaul in a while but I wanted to get it out there for the community to start messing with.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-12-26T21:04:01Z\u0022 title=\u002212/26/2015 09:04  PM\u0022 data-short=\u00228 yr\u0022\u003EDecember 26, 2015\u003C/time\u003E by Ens Gijs\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ens Gijs","CreatedById":11410,"CreatedDateTime":"2016-01-18T22:19:02Z","Content":"\n\u003Cp\u003E\nJust a quick update. I\u0027m back to work on this project and I\u0027ve planned and executed my first complex trip using it! Don\u0027t get too excited though. The UI hasn\u0027t caught up to the theory just yet, but I\u0027m confidant now that the tool really can be valuable.\n\u003C/p\u003E\n\u003Cp\u003E\nThis is the trip I planned, and flew in KSP. The trip was a flyby of Duna with a \u0022free return\u0022 to Kerbin - all told it cost me just over 1200 dV to eject from LKO and return to Kerbins surface.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/rMQYgoN.png\u0022 alt=\u0022rMQYgoN.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cu\u003E\u003Cstrong\u003EKerbin Departure\u003C/strong\u003E\u003C/u\u003E\u003Cbr\u003E\nInitial Orbit: 100km\u003Cbr\u003E\nFlyby Altitude: 100km\u003Cbr\u003E\nDeparture: Year 1, day 222 at 3:07\u003Cbr\u003E\nTime of Flight: 366 days 2:33\u003Cbr\u003E\nEjection dV: 1114\u003Cbr\u003E\n  Prograde dV: 1112.4\u003Cbr\u003E\n  Normal dV: -51.2\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003ESpent 50dV at midpoint to Duna to correct injection error\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\u003Cu\u003E\u003Cstrong\u003EReturn Conditions\u003C/strong\u003E\u003C/u\u003E\u003Cbr\u003E\nCorrection burn dV: 27 estimated, 32 actual - performed at time of Duna flyby (at Duna Pe)\u003Cbr\u003E\nEncounter occurs at \u002B2 orbits\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003ESpent additional couple of dV to tune Kerbin encounter in interplanetary space. I\u0027m happy to report that from the Duna burn alone I achieved a Kerbin encounter, this adjustment burn was to actually hit the planet, not just the SOI \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/em\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Ens Gijs","CreatedById":11410,"CreatedDateTime":"2016-01-19T00:59:00Z","Content":"\n\u003Cp\u003E\nYou may now get EXCITED! I know I am \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve added support for using the WSAD keys to move your orbit selection around (holding a key down works too - lots of fun to see the planets spin and your orbits change).\n\u003C/p\u003E\n\u003Cp\u003E\nMost importantly I\u0027ve added a listing of what bodies your flyby will open up to you. In the screenshot below you will see \u003Cu\u003EKerbin (\u002B2) 3.02\u003C/u\u003E This means that the selected flyby will give you an encounter with Kerbin in 2 orbits of your craft for 3 m/s of deltaV (I bet you could do it for free \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E).\n\u003C/p\u003E\n\u003Cp\u003E\nTip: you can \u003Cstrong\u003Ehover \u003C/strong\u003Eover the encounter (e.g. \u003Cu\u003EKerbin (\u002B2) 3.02\u003C/u\u003E) to see the \u0022Time of flight\u0022 \u003Cem\u003E- this gets rather comical when using Jool to reach Eeloo.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022p1ZTRbE.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/p1ZTRbE.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-01-19T13:21:13Z\u0022 title=\u002201/19/2016 01:21  PM\u0022 data-short=\u00228 yr\u0022\u003EJanuary 19, 2016\u003C/time\u003E by Ens Gijs\u003C/strong\u003E\n\u003Cbr\u003EAdded note about hovering over encounter listings for Time of flight information.\n\u003C/span\u003E\n"},{"CreatedByName":"tomf","CreatedById":57809,"CreatedDateTime":"2016-01-19T11:38:12Z","Content":"\n\u003Cp\u003E\nSo if I wanted to go to Moho utilizing an assist from Eve would I set eve as my target with a 100km \u0022final\u0022 orbit and then WASD to adjust the plan to find one that gives me a good slingshot towards Moho?\n\u003C/p\u003E\n"},{"CreatedByName":"Ens Gijs","CreatedById":11410,"CreatedDateTime":"2016-01-19T13:07:50Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222369449\u0022 data-ipsquote-contentid=\u0022128479\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221453203492\u0022 data-ipsquote-userid=\u002257809\u0022 data-ipsquote-username=\u0022tomf\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, tomf said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSo if I wanted to go to Moho utilizing an assist from Eve would I set eve as my target with a 100km \u0022final\u0022 orbit and then WASD to adjust the plan to find one that gives me a good slingshot towards Moho?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nCorrect\n\u003C/p\u003E\n\u003Cp\u003E\nUsing various \u0022final\u0022 orbital altitudes may yield better slingshots as well. For example I found a nice free return from Eeloo  (round trip from kerbin) with an optimal flyby Pe of about 440k (savings were trivial, but Eeloo is a low gravity body anyway - 80dV at 100K flyby vs 30dV at 440K flyby). I was actually able to achieve the free return for 8dV in game by burning just after I exited Kerbin SOI instead of within / near Eeloo SOI as planned by the tool.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSorry for the pains of early access \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-01-19T13:14:53Z\u0022 title=\u002201/19/2016 01:14  PM\u0022 data-short=\u00228 yr\u0022\u003EJanuary 19, 2016\u003C/time\u003E by Ens Gijs\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ziggy Kerman","CreatedById":210324,"CreatedDateTime":"2021-02-25T16:18:55Z","Content":"\n\u003Cp\u003E\n Well, this is now revived, but does Plovessa and JebScrap do, anything? Since I\u0027m playing stock and using this for my grand tour and want to make sure I don\u0027t get a wrong flyby.\n\u003C/p\u003E\n"}]}