{"TopicId":128506,"ForumId":70,"TopicTitle":"Unity 5 and KSP 64 Bit","CreatedByName":"Pentazer","CreatedById":155776,"CreatedDateTime":"2015-12-23T14:21:57Z","PageNum":1,"Articles":[{"CreatedByName":"Pentazer","CreatedById":155776,"CreatedDateTime":"2015-12-23T14:21:57Z","Content":"\n\u003Cp\u003E\nHelp! I previously played a lot of KSP 64 bit but that was before unity 5 came along. In preparation for unity 5 playing I uninstalled KSP and reinstalled it (via Steam) and followed this guide:\n\u003C/p\u003E\n\u003Ciframe data-embedcontent=\u0022\u0022 frameborder=\u00220\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/105592-windows-64-bit-community-workaround/\u0026amp;do=embed\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\nIn order to make KSP run 64 bit using Unity 5. It was the same process for previous version of unity, which worked significantly better than KSP32 bit! However following the instructions this time produces this error:\n\u003C/p\u003E\n\u003Cp\u003E\nThere should be \u0027KSP_Data\u0027\u003Cbr\u003E\nfolder next to the executable\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve searched around and I can\u0027t seem to find a solution, everyone just keeps saying to reinstall KSP but this was all done on a fresh install. I even reverse and retried the process both before starting the game for the first time and then after starting the game for the first time (using the stock 32 bit exe which worked as expected).\n\u003C/p\u003E\n\u003Cp\u003E\nDoes anyone know how to fix this? I\u0027m sad kerbal!\n\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-12-23T15:32:16Z","Content":"\n\u003Cp\u003E\nWelcome aboard!\n\u003C/p\u003E\n\u003Cp\u003E\nThe current KSP, using the Win64 workaround or not, does not use Unity 5, that will come in the 1.1 update some time early in the new year.\n\u003C/p\u003E\n\u003Cp\u003E\nYou need to use the Unity 4.6.4 files as directed in the linked instructions to get it to work.\n\u003C/p\u003E\n\u003Cp\u003E\nThe Win64 version is not officially supported, so please take any further troubleshooting over to that thread. Locking this one up.\n\u003C/p\u003E\n"}]}