{"TopicId":128597,"ForumId":16,"TopicTitle":"beginner problems... too fast!!!!","CreatedByName":"Perotis","CreatedById":155860,"CreatedDateTime":"2015-12-25T03:33:10Z","PageNum":1,"Articles":[{"CreatedByName":"Perotis","CreatedById":155860,"CreatedDateTime":"2015-12-25T03:33:10Z","Content":"\n\u003Cp\u003E\nHaving trouble landing after sub-orbital flights.  Even when I pick a more ballistic trajectory, I always end up coming down too fast to deploy parachutes.\n\u003C/p\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2015-12-25T04:03:57Z","Content":"\n\u003Cp\u003E\nWhat\u0027s the angle you\u0027re reentering at? What\u0027s “more ballistic” for one, is “dude that\u0027s waaaaay too steep” for someone else. I’d aim for 45° or maybe even shallower, for starters (haven’t done them in ages so not sure what should work, but that should be a good starting point).\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, do not add too much to your ship. The Mk I is pretty aerodynamic. Add too much weight to it and yes, you’ll be able to study a lot of \u003Cem\u003Ehigh impact lithobraking\u003C/em\u003E.\n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2015-12-25T04:42:47Z","Content":"\n\u003Cp\u003E\nIt\u0027s not easy to give an answer to the problem without screenshots or craft files.\u003Cbr\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"PPR","CreatedById":70000,"CreatedDateTime":"2015-12-25T05:39:17Z","Content":"\n\u003Cp\u003E\nThe thing to remember is that the atmosphere slows down your re-entry.  When you are going straight down you will only have 70km of atmosphere to slow down.  This means you may be travelling too fast for your parachute to deploy.  When you de-orbiting at a high surface speed, you are slowing down sideways through hundreds of kilometers of atmosphere.  This gives you more time/distance to slow down until your parachute is able to deploy.  \n\u003C/p\u003E\n"},{"CreatedByName":"MarvinKitFox","CreatedById":99545,"CreatedDateTime":"2015-12-25T06:30:06Z","Content":"\n\u003Cp\u003E\nI believe the poster\u0027s problem is that his rocket is staying above the 260m/s max speed allowed for parachutes, even when in freefall near the surface.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAdvice:\n\u003C/p\u003E\n\u003Cp\u003E\n1) \u003Cu\u003Eland in the ocean,\u003C/u\u003E or at highest shore/grassland/ice regions. The altitude of any other terrain leads to too-thin air for speed reduction by drag alone.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n2) \u003Cu\u003EUse a much more draggy vehicle for reentry.\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nA naked MK1 capsule is draggy enough. The same capsule with 17 batteries, 8 instruments and a partridge in a pear tree is simply too heavy!\n\u003C/p\u003E\n\u003Cp\u003E\nIf you have a lengthy vehicle, try forcing it to go sideways during the last freefall.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you have landing gear, deploy them.\n\u003C/p\u003E\n\u003Cp\u003E\nTry to induce a rapid spin/flutter in your descending vehicle. This may *look* uncomfortable, but sure induces a lot of drag!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n3) \u003Cu\u003EConsider re-entry with a functional engine, and flying engine first.\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe engines are almost as heat-resistant as an ablative heatshield, plus you have the ability to use thrust to brake you below that critical 260m/s limit. Also, with use of a bit of thrust AT landing, you can afford to load *way* less parachutes.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n4) Once you get them, \u003Cu\u003Edrogue parachutes\u003C/u\u003E allow deployment at much higher speed and altitudes, and \u003Cu\u003EAirbrakes\u003C/u\u003E even more so!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nHave fun!\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-12-25T06:31:11Z\u0022 title=\u002212/25/2015 06:31  AM\u0022 data-short=\u00228 yr\u0022\u003EDecember 25, 2015\u003C/time\u003E by MarvinKitFox\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"nosirrbro","CreatedById":69814,"CreatedDateTime":"2015-12-25T06:40:27Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222335932\u0022 data-ipsquote-contentid=\u0022128597\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221451014390\u0022 data-ipsquote-userid=\u0022155860\u0022 data-ipsquote-username=\u0022Perotis\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Perotis said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHaving trouble landing after sub-orbital flights.  Even when I pick a more ballistic trajectory, I always end up coming down too fast to deploy parachutes.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nA good rule of thumb for the early career game when you dont have the more drogues and the like, is that even if it costs more a shallower re-entry is \u003Cstrong\u003Ealways a good idea.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIn the later game, the pros begin to be hurt by the cons where more shallow re-entry becomes much more viable, but assuming your in early career just add some extra boosters and thrust more horizontally.\n\u003C/p\u003E\n"},{"CreatedByName":"Tfin","CreatedById":27558,"CreatedDateTime":"2015-12-25T09:32:30Z","Content":"\n\u003Cp\u003E\nGo VERY shallow, until you have the stuff to go steeper. My first orbit in my current career was so shallow it was an in-atmosphere orbit. I passed over KSC twice, which might be a bit \u003Cem\u003Etoo \u003C/em\u003Eshallow, but it worked.\n\u003C/p\u003E\n"},{"CreatedByName":"Francois424","CreatedById":98138,"CreatedDateTime":"2015-12-25T11:10:24Z","Content":"\n\u003Cp\u003E\nWhen you start seeing mach effect (while haze) pull down and right to give your pod/ship an angle... It will decelerate faster allowing you to pull chutes sooner.  Drag chutes if you have them helps tons.\n\u003C/p\u003E\n\u003Cp\u003E\nGood luck.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-12-25T15:54:17Z","Content":"\n\u003Cp\u003E\nWelcome to the forums!\n\u003C/p\u003E\n\u003Cp\u003E\nLots of good advice from previous posters. To reiterate, though: It would really help if you could post a screenshot.\n\u003C/p\u003E\n\u003Cp\u003E\nThere are many more ways to be \u0022wrong\u0022 than to be \u0022right\u0022, and without a screenshot, nobody knows which of the 1,000 possible problems you might be having, so you end up receiving tons of advice for many different problems, including problems you don\u0027t have.\n\u003C/p\u003E\n\u003Cp\u003E\nIn short: with a screenshot, you\u0027ll get much more relevant, shorter answers.\n\u003C/p\u003E\n"},{"CreatedByName":"Perotis","CreatedById":155860,"CreatedDateTime":"2015-12-25T15:57:37Z","Content":"\n\u003Cp\u003E\nFrom the previous answeres, I guess I just have to try a longer arc.  \n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-12-25T16:35:46Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222336231\u0022 data-ipsquote-contentid=\u0022128597\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221451059057\u0022 data-ipsquote-userid=\u0022155860\u0022 data-ipsquote-username=\u0022Perotis\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n32 minutes ago, Perotis said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nFrom the previous answeres, I guess I just have to try a longer arc.  \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat \u003Cem\u003E\u003Cu\u003Emay\u003C/u\u003E\u003C/em\u003E be the problem.  There\u0027s also a strong chance that it may not be.  Depends on ship design, thus the plea for screenshots.  \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIn my experience, if I do a suborbital hop that\u0027s too steep, I\u0027m more likely to encounter burning-up problems than still-going-over-Mach-1-when-I-hit-the-ground problems.\n\u003C/p\u003E\n\u003Cp\u003E\nDo you have stack decouplers yet?  If so, you can try separating your Mk1 command pod from the rest of the ship when you\u0027re coming down.  If it\u0027s just the pod by itself, it has plenty of torque to control its orientation, and you can wrench it around so that it\u0027s falling blunt-end first.  A Mk1 pod in that orientation will easily slow down enough to pop the chute before hitting the ground.\n\u003C/p\u003E\n\u003Cp\u003E\nAnother option, if you\u0027ve got the command pod attached to a cylindrical fuel tank (for example, the 2-ton one), is to use body lift as much as possible when reentering.  That is, instead of pointing straight prograde/retrograde when descending, use the command pod\u0027s torque to fly at an angle, so that the cylindrical side of the rocket deflects the airstream downwards and generates lift.  This really helps to slow things down a lot.  I find that the sweet spot for this kind of body lift is a 2-ton tank with the Mk1 pod.  Longer than that, and the pod doesn\u0027t have enough torque to slew the angle enough to make a difference.  Shorter than that, and you don\u0027t get much body lift.\n\u003C/p\u003E\n"},{"CreatedByName":"LordKael","CreatedById":154046,"CreatedDateTime":"2015-12-25T21:29:05Z","Content":"\n\u003Cp\u003E\nMy first couple sub-orbital flights always ended in a maddening suicide burn, because I managed to give myself enough fuel. \n\u003C/p\u003E\n"},{"CreatedByName":"Sanic","CreatedById":149920,"CreatedDateTime":"2015-12-26T01:55:42Z","Content":"\n\u003Cp\u003E\nI just go straight up, and wiggle around a lot in the lower atmosphere. Spinning also helps. I\n\u003C/p\u003E\n\u003Cp\u003E\nBut I found that you can use a service bay right below your command pod that can work as a pretty effective airbrake.\n\u003C/p\u003E\n"},{"CreatedByName":"Kerba Fett","CreatedById":62292,"CreatedDateTime":"2015-12-27T18:50:29Z","Content":"\n\u003Cp\u003E\nApparently too many new players were surviving suborbital flights in previous versions of the game. The 1.05 version of the game increased the heating and thinned out the lower atmosphere to address that. \n\u003C/p\u003E\n\u003Cp\u003E\nLater in the tech tree you\u0027ll get drogue parachutes and seperatrons that you can use to slow your craft. While you\u0027re waiting for those, it\u0027s easier to just stick with orbital flights with a shallow reentry. \n\u003C/p\u003E\n"},{"CreatedByName":"strollen","CreatedById":142693,"CreatedDateTime":"2015-12-31T21:39:55Z","Content":"\n\u003Cp\u003E\nI recently started a new career game after not playing since 1.0.  Suborbitals are definitely harder than they use to be. I got a lot of tourism sub-orbital mission, so I ended up doing a lot of them.\n\u003C/p\u003E\n\u003Cp\u003E\nAs everyone says the most important thing to do is not fly straight up. Ideally you want to get to a 45 degree angle at launch as quickly as practical, but even a 30 degree should be enough distance to let you decelerate safely.\n\u003C/p\u003E\n\u003Cp\u003E\nSecond don\u0027t fly too high, you only need to get to 70,000 meters to qualify as a sub-orbital.  So adjust your fuel and accent angle to keep your altitude under 100K, the higher you go the faster you fall.  I found that a single Thumper booster ($850 one) was enough to get sub-orbital flights with most payloads, A Thumper at first stage, and Hammer 2nd stage was able to reliably and cheaply get a 3 person capsule to a suborbital for flying tourist contracts.\n\u003C/p\u003E\n"}]}