{"TopicId":128864,"ForumId":16,"TopicTitle":"Landing on airless bodies, reverse gravity turn?","CreatedByName":"sardia","CreatedById":149922,"CreatedDateTime":"2015-12-29T23:19:04Z","PageNum":1,"Articles":[{"CreatedByName":"sardia","CreatedById":149922,"CreatedDateTime":"2015-12-29T23:19:04Z","Content":"\n\u003Cp\u003E\nWhat\u0027s a way to land onto a planet with minimal delta v? I\u0027m aware of 2 ways, possibly 3. \n\u003C/p\u003E\n\u003Cp\u003E\nPointing retrograde and firing engines until you land. Bad\n\u003C/p\u003E\n\u003Cp\u003E\nDoing a Hohmann transfer and then a landing burn. Better\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve also heard ofa reverse gravity turn because NASA did it? Best??? \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022line-height:1.6;\u0022\u003ECan anyone confirm the best way to land based on my three options? Suicide burn, constant altitude landing, and reverse gravity turn. I\u0027m not sure if the third one works in ksp. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-12-29T23:55:32Z","Content":"\n\u003Cp\u003E\nThe best way to land on an airless world is the reverse of the best way to take off.\n\u003C/p\u003E\n\u003Cp\u003E\nThe best way to take off is to burn almost exactly sideways, only giving yourself enough vertical to not hit the ground (or any mountains!)\n\u003C/p\u003E\n\u003Cp\u003E\nTherefore, the best way to land is to come in super low, ideally with your periapsis a km over the ground or less. Then burn as hard as you can to arrest your motion. And bring an extra pair of underwear, because it can be a pretty harrowing experience.\n\u003C/p\u003E\n\u003Cp\u003E\nPersonally, I do essentially that but aim a km or two up, sacrificing some fuel efficiency to give myself time to pick a good landing spot.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-12-30T02:02:37Z\u0022 title=\u002212/30/2015 02:02  AM\u0022 data-short=\u00228 yr\u0022\u003EDecember 30, 2015\u003C/time\u003E by 5thHorseman\u003C/strong\u003E\n\u003Cbr\u003EChanged \u0026quot;opposite\u0026quot; in that first sentence to \u0026quot;reverse\u0026quot; for clarity.\n\u003C/span\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-12-30T00:20:54Z","Content":"\n\u003Cp\u003E\nThe most efficient way to land is the Hohmann transfer/ constant altitude method.\n\u003C/p\u003E\n\u003Cp\u003E\n The easiest, safest, and most precise method is (IMO) the reverse gravity turn.\n\u003C/p\u003E\n\u003Cp\u003E\nBest,\n\u003C/p\u003E\n\u003Cp\u003E\n-Slashy\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-12-30T00:38:35Z","Content":"\n\u003Cp\u003E\nWhat 5th Horseman said.  The ideal way to land is to do the exact reverse of the ideal way to take off.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you\u0027re on, say, the Mun, and you want to escape the Mun as efficiently as possible, what you do is take off at full throttle (and keep it at full throttle the whole time you\u0027re burning), and crank it over to near-horizontal immediately upon takeoff.  You want it to be only a tiny smidgeon above horizontal, to keep you from scraping your toes; you want the lowest trajectory you can manage without smacking into a mountain.  Then you burn hard and horizontally until you get to escape velocity (or orbital velocity, if you only want to go to orbit).\n\u003C/p\u003E\n\u003Cp\u003E\nThe above description assumes that you have a very high Mun-local TWR.  If your craft has less power available, then you\u0027d do something more like a conventional gravity turn.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, in reverse, what this means is you come in low, so that your initial Mun approach has you hitting the surface traveling almost horizontally, i.e. your Pe is only just barely underground.  Point surface-retrograde, and at the \u003Cem\u003E\u003Cu\u003Elast possible instant\u003C/u\u003E\u003C/em\u003E, you slam on full throttle and burn at full power until you come to a stop precisely at the moment you touch the ground.  And then change your shorts.\n\u003C/p\u003E\n\u003Cp\u003E\nThis approach is called a \u0022suicide burn,\u0022 for reasons having to do with the tricky business of deciding just exactly when the \u0022last possible moment\u0022 is.  \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOn a practical note, if you want to land with a suicide burn, there\u0027s a fairly simple technique for deciding when to start the burn.  Set up your approach so that you have your trajectory that intersects the surface.  Drop a maneuver node right at the point where your trajectory intersects the surface.  Drag the node\u0027s retrograde handle until the projected post-node trajectory collapses to a point and the node\u0027s handles start flipping back and forth.  The \u0022estimated burn time\u0022 indicator on the nav ball now tells you how long a burn you need, so start your burn when there\u0027s that much time remaining until impact.  (In reality, the right time isn\u0027t \u003Cem\u003E\u003Cu\u003Eexactly\u003C/u\u003E\u003C/em\u003E at that point, but typically a bit later; how much later depends on your TWR and the angle of approach.  I find that 70% works pretty well, as a rule of thumb-- i.e. if it tells me that I need a 10-second burn, I start when there are 7 seconds remaining.)\n\u003C/p\u003E\n\u003Cp\u003E\nOne problem with this is that the default behavior of the \u0022estimated burn time\u0022 indicator is kinda flaky (it just says \u0022N/A\u0022 until you use your engines, it doesn\u0027t account for increasing acceleration as you burn off fuel, etc.).  Also, mucking with the maneuver node can get tedious after the Nth time you\u0027ve done it.  If you\u0027d like to simplify matters a bit (and get a more accurate readout), may I recommend \u003Ca href=\u0022https://kerbalstuff.com/mod/1293/BetterBurnTime\u0022 rel=\u0022external nofollow\u0022\u003EBetterBurnTime\u003C/a\u003E, a little mod I wrote \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E that makes the estimated-burn-time indicator much more accurate (and provides a \u0022time to impact\u0022 readout for exactly the situation you\u0027re dealing with here).\n\u003C/p\u003E\n"},{"CreatedByName":"sardia","CreatedById":149922,"CreatedDateTime":"2015-12-30T16:37:46Z","Content":"\n\u003Cp\u003E\nWhat is it called when I kill all horizontal velocity, fall just above the surface, and then burn to kill all vertical velocity? How efficient is that? The benefits is I can pick out exactly where I want to land. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAs I\u0027m typing this I\u0027m already thinking to do this in a low orbit to save delta v. How much extra delta v do you save if everyone starts at the lowest orbit, say out of minmus?\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-12-30T17:18:07Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222342072\u0022 data-ipsquote-contentid=\u0022128864\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221451493466\u0022 data-ipsquote-userid=\u0022149922\u0022 data-ipsquote-username=\u0022sardia\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n41 minutes ago, sardia said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhat is it called when I kill all horizontal velocity, fall just above the surface, and then burn to kill all vertical velocity? How efficient is that? The benefits is I can pick out exactly where I want to land. \n\u003C/p\u003E\n\u003Cp\u003E\nAs I\u0027m typing this I\u0027m already thinking to do this in a low orbit to save delta v. How much extra delta v do you save if everyone starts at the lowest orbit, say out of minmus?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhat it\u0027s called is \u0022really inefficient.\u0022  \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWell, I should clarify that.  How efficient (or not) your described pattern is, depends on how high above the surface you are when you kill your velocity: the lower the better.  Just how low is your orbit?  For example, if your orbital altitude is, say, five kilometers, then doing what you described isn\u0027t terrible.  Not ideal, but not terrible.  On the other hand, if your orbit is dozens of kilometers high, it\u0027s really suboptimal.\n\u003C/p\u003E\n\u003Cp\u003E\nYou don\u0027t have to do what you described to decide where to land.  Come in on a low, slanting trajectory and just choose where your impact will be based on the map view.\n\u003C/p\u003E\n\u003Cp\u003E\nAll of this said:  if you\u0027re on \u003Cem\u003E\u003Cu\u003EMinmus\u003C/u\u003E\u003C/em\u003E, it really isn\u0027t all that critical.  Minmus is so tiny, and its escape velocity so slow, that your exact technique doesn\u0027t matter all that much.  \u0022This way is good\u0022 or \u0022that way is bad\u0022 statements notwithstanding, the difference is going to be very minor-- we\u0027re talking a few dozen m/s difference between \u0022perfect ideal\u0022 and \u0022sloppy.\u0022  So on Minmus, you really don\u0027t need to worry about it that much. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt makes a bigger difference on the Mun, whose escape velocity is several times that of Minmus.  And it makes a bigger deal still for vacuum worlds that are significantly bigger thant the Mun, such as Moho or Tylo.\n\u003C/p\u003E\n\u003Cp\u003E\nProbably the best reason for trying for a super-efficient landing on Minmus, given that it doesn\u0027t actually matter all that much there, is that it\u0027s good practice.  Minmus is the kiddie pool.  The numbers are small, the action is slow, you have plenty of time to observe and correct problems, so it makes a good \u0022proving ground\u0022 for practicing your high-efficiency vacuum landings before you go somewhere that\u0027s harder.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-12-30T17:20:32Z\u0022 title=\u002212/30/2015 05:20  PM\u0022 data-short=\u00228 yr\u0022\u003EDecember 30, 2015\u003C/time\u003E by Snark\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"OhioBob","CreatedById":128005,"CreatedDateTime":"2015-12-30T17:25:50Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222342072\u0022 data-ipsquote-contentid=\u0022128864\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221451493466\u0022 data-ipsquote-userid=\u0022149922\u0022 data-ipsquote-username=\u0022sardia\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n26 minutes ago, sardia said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhat is it called when I kill all horizontal velocity, fall just above the surface, and then burn to kill all vertical velocity? How efficient is that? The benefits is I can pick out exactly where I want to land. \n\u003C/p\u003E\n\u003Cp\u003E\nAs I\u0027m typing this I\u0027m already thinking to do this in a low orbit to save delta v. How much extra delta v do you save if everyone starts at the lowest orbit, say out of minmus?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI don\u0027t know what it\u0027s called, but I still do it that way even though I know its not the most efficient.  Actually I do something of a hybrid between this method and a suicide burn.  I\u0027ll inject myself into a decent orbit with the periapsis low over my intended landing site.  Then as I approach periapsis, I select my final landing site, perform a burn to kill my horizontal velocity, then drop to the surface and kill what ever vertical velocity I gained on the way down just before landing.  I find that this gives me more control over my landing site and makes the landing much less white knuckled.  It\u0027s less efficient than the other methods, but still not too bad if your vertical drop isn\u0027t too outrageous.  For example, on Mun if you drop from a dead stop at 20 km, you\u0027ll gain about 240 m/s during the fall.  However, if you drop from 2 km you\u0027ll gain only about 80 m/s.  The lower you make your periapsis, the more efficient, but the descent to the surface will happen more quickly and with greater stress.  When dropped from the same height, impact velocity on Minmus is about half what it is on Mun.\n\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-12-31T19:39:18Z","Content":"\n\u003Cp\u003E\nJust remember that if you care about the precise location of where you land, you\u0027re going to have to sacrifice at least some efficiency.  The problem with all the efficient methods of landing is that you commit to your landing spot from a reasonably high orbit, way too high to see what the ground there really looks like.  Now sometimes this doesn\u0027t matter, such as going for a flat spot on Minmus, but it can matter a great deal on Mun due to all the steep-sided craters everywhere.  Also, if you\u0027re trying to land next to one of your own previous ships/flags, you already know what the terrain is like (plus can target it for navball help in landing close to it).  But if you\u0027re going someplace you\u0027ve never been before, and you don\u0027t trust the terrain to be reasonably level over the general target area, you might be better served to use a less-efficient approach so you can pick your landing spot visually from low altitude.\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-12-31T20:35:53Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222343768\u0022 data-ipsquote-contentid=\u0022128864\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221451590758\u0022 data-ipsquote-userid=\u002269507\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n53 minutes ago, Geschosskopf said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nJust remember that if you care about the precise location of where you land, you\u0027re going to have to sacrifice at least some efficiency.  The problem with all the efficient methods of landing is that you commit to your landing spot from a reasonably high orbit, way too high to see what the ground there really looks like.  Now sometimes this doesn\u0027t matter, such as going for a flat spot on Minmus, but it can matter a great deal on Mun due to all the steep-sided craters everywhere.  Also, if you\u0027re trying to land next to one of your own previous ships/flags, you already know what the terrain is like (plus can target it for navball help in landing close to it).  But if you\u0027re going someplace you\u0027ve never been before, and you don\u0027t trust the terrain to be reasonably level over the general target area, you might be better served to use a less-efficient approach so you can pick your landing spot visually from low altitude.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u002B1 to this!\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, this is another, more subtle reason why you should try to design your lander to be as low and squat as possible, with a wide stance and low CoM.  That\u0027s not just good because of making accidental tipping over less likely:  it\u0027s also good because it makes your lander more tolerant of the terrain, so you have a lot more flexibility about where you can land, which in turn means you can land more efficiently because you can come down fast and not have to loiter while you scout out a landing site.\n\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-12-31T22:22:33Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222343853\u0022 data-ipsquote-contentid=\u0022128864\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221451594153\u0022 data-ipsquote-userid=\u0022125662\u0022 data-ipsquote-username=\u0022Snark\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Snark said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAlso, this is another, more subtle reason why you should try to design your lander to be as low and squat as possible, with a wide stance and low CoM.  That\u0027s not just good because of making accidental tipping over less likely:  it\u0027s also good because it makes your lander more tolerant of the terrain, so you have a lot more flexibility about where you can land, which in turn means you can land more efficiently because you can come down fast and not have to loiter while you scout out a landing site.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAnd \u002B1 to that in return.\n\u003C/p\u003E\n\u003Cp\u003E\nWith a properly squatty lander, the ultimate limit to the amount of slope you can land on is set by the steepness of the slope a Kerbal can stand on without going toboggining for miles with possibly fatal results.  On this and slightly less-steep slopes, the lander itself might be slowly, ever-so slowly, sliding downhill the whole time you\u0027re on the ground, but it only moves a few meters in the time it takes to grab the science and plant a flag so no harm done.  But if the Kerbal slides away, that will take up a lot of time, first for the slide and then, if the Kerbal survives, getting back to the lander  And when the Kerbal gets back, the lander might have slid to its doom.  So it\u0027s best to land where Kerbals can still walk.\n\u003C/p\u003E\n\u003Cp\u003E\nHOWEVER, the efficient landing trajectories come down in arcs.  This means than if you use an efficient landing trajectory, your lander\u0027s slope tolerance only applies to reverse slopes (on the far side of the terrain crest as you come down).  Foward slopes (on the near side of the crest) mean that there\u0027s a hill sticking up between you and your intended landing spot, which means you\u0027ll encounter the ground at a rather higher altitude and sooner than expected.  So if you\u0027re doing a suicide burn, you\u0027re dead, because you were planning on hitting the ground at a lower altitude on the far side of the hill at a later time, so haven\u0027t slowed down enough yet to survive the impact on the forward slope of the intervening hill.\n\u003C/p\u003E\n\u003Cp\u003E\nAfter splattering numerous Kerbals on forward slopes in untrustworthy terrain, I decided it just wasn\u0027t worth the risk to attempt to land efficiently.  So these days in such circumstances  I used the horribly inefficient but MUCH safer \u0022stop and drop\u0022 method.  That is, I get in the lowest possible orbit that will still clear the mountaintops.  Then I wait until a good spot to land on comes by, kill all my horizontal velocity, and drop down vertically on it.\n\u003C/p\u003E\n"},{"CreatedByName":"The Optimist","CreatedById":151904,"CreatedDateTime":"2016-01-01T02:16:39Z","Content":"\n\u003Cp\u003E\nProtip: If you\u0027re 9000 Meters above the ground, you\u0027re actually 7000. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI just wanted to say that.\n\u003C/p\u003E\n"},{"CreatedByName":"sardia","CreatedById":149922,"CreatedDateTime":"2016-01-01T04:19:52Z","Content":"\n\u003Cp\u003E\nNo worries, I have KER mod with true altitude HUD. \n\u003C/p\u003E\n\u003Cp\u003E\nDoes anyone know how efficiently mech jeb lands? \n\u003C/p\u003E\n\u003Cp\u003E\nI think with landingcoordinates, you should be able to land precisely and efficiently. e\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-01-01T04:22:17Z\u0022 title=\u002201/01/2016 04:22  AM\u0022 data-short=\u00228 yr\u0022\u003EJanuary 1, 2016\u003C/time\u003E by sardia\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Mahnarch","CreatedById":114432,"CreatedDateTime":"2016-01-01T17:47:33Z","Content":"\n\u003Cp\u003E\nMechjeb does a pretty good job, but it tends to burn a little more fuel.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nHowever, it usually gets me to within 18 meters of my munar outpost.\n\u003C/p\u003E\n"},{"CreatedByName":"Plusck","CreatedById":153264,"CreatedDateTime":"2016-01-01T20:30:25Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222343983\u0022 data-ipsquote-contentid=\u0022128864\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221451600553\u0022 data-ipsquote-userid=\u002269507\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n22 hours ago, Geschosskopf said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHOWEVER, the efficient landing trajectories come down in arcs.  This means than if you use an efficient landing trajectory, your lander\u0027s slope tolerance only applies to reverse slopes (on the far side of the terrain crest as you come down).  Foward slopes (on the near side of the crest) mean that there\u0027s a hill sticking up between you and your intended landing spot, which means you\u0027ll encounter the ground at a rather higher altitude and sooner than expected.  So if you\u0027re doing a suicide burn, you\u0027re dead, because you were planning on hitting the ground at a lower altitude on the far side of the hill at a later time, so haven\u0027t slowed down enough yet to survive the impact on the forward slope of the intervening hill.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI would add to that with:\n\u003C/p\u003E\n\u003Cp\u003E\nOn smaller bodies, like Minmus and smaller moons, the trajectory marked on the map is atrociously bad at showing you how high you are in fact.\n\u003C/p\u003E\n\u003Cp\u003E\nMaybe it is specific to me and my OS / install, but landing on any of the Flats on Minmus shows my suborbital trajectory hitting the ground far earlier than it does in reality. And it\u0027ll show me in orbit around Gilly when in fact my trajectory goes through Gilly\u0027s highlands.\n\u003C/p\u003E\n\u003Cp\u003E\nSo when it comes down to it, plotting a manouvre node to kill your velocity at touchdown gives a very good idea about when to start your burn, but you still need to eyeball it and switch between the outside view / map to see how far off your planned burn is going to be.\n\u003C/p\u003E\n"}]}