{"TopicId":128903,"ForumId":32,"TopicTitle":"Is orbital body ore farming viable?","CreatedByName":"glen.mack","CreatedById":75413,"CreatedDateTime":"2015-12-30T13:37:12Z","PageNum":1,"Articles":[{"CreatedByName":"glen.mack","CreatedById":75413,"CreatedDateTime":"2015-12-30T13:37:12Z","Content":"\n\u003Cp\u003E\nSo, I\u0027ve been thinking about this, and while it will obviously vary from craft to craft, I don\u0027t think the idea of bringing ore to an orbital station for processing is generally viable anywhere but Minmus, where you can essentially pick it up and throw it into orbit. Am I wrong? (considering doing some general math on the subject and maybe adding it to the wiki)\n\u003C/p\u003E\n\u003Cp\u003E\nThe problem isn\u0027t getting it into orbit, of course, it is using less fuel to get it to orbit than you can make out of the stuff you bring to orbit. (That\u0027s before you even consider the \u0022profit\u0022 margin) Has anyone done this, or are asteroids the best resource for interplanetary mother-ships? (by that I actually mean ships you never intend to land.)\n\u003C/p\u003E\n"},{"CreatedByName":"Temstar","CreatedById":24430,"CreatedDateTime":"2015-12-30T13:43:55Z","Content":"\n\u003Cp\u003E\nNo, even on places like Duna you can easily build a surface to orbit tanker that can carry up much more ore than the fuel it uses to land and take off. Remember also that the tanker doesn\u0027t have to be fuelled on orbit from the orbital refinery using the ore it carried up - it\u0027s easier to just have refining capability on the ground as well and refuel the tanker rocket on the ground while you\u0027re filling it with ore.\u003Cbr\u003E\u003Cbr\u003E\nThat, and because atomic rockets.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-12-30T13:46:36Z\u0022 title=\u002212/30/2015 01:46  PM\u0022 data-short=\u00228 yr\u0022\u003EDecember 30, 2015\u003C/time\u003E by Temstar\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"glen.mack","CreatedById":75413,"CreatedDateTime":"2015-12-30T14:00:03Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222341920\u0022 data-ipsquote-contentid=\u0022128903\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221451483035\u0022 data-ipsquote-userid=\u002224430\u0022 data-ipsquote-username=\u0022Temstar\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n14 minutes ago, Temstar said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNo, even on places like Duna you can easily build a surface to orbit tanker that can carry up much more ore than the fuel it uses to land and take off. Remember also that the tanker doesn\u0027t have to be fuelled on orbit from the orbital refinery using the ore it carried up - it\u0027s easier to just have refining capability on the ground as well and refuel the tanker rocket on the ground while you\u0027re filling it with ore.\u003Cbr\u003E\u003Cbr\u003E\nThat, and because atomic rockets.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nCould you post an image or craft file? I can\u0027t get my head around how you could transport more than 1500 dv worth of ore to orbit...\n\u003C/p\u003E\n"},{"CreatedByName":"Temstar","CreatedById":24430,"CreatedDateTime":"2015-12-30T14:21:54Z","Content":"\n\u003Cp\u003E\nHere\u0027s something I threw together:\u003Cbr\u003E\u003Cbr\u003E\u003Cimg class=\u0022ipsImage\u0022 src=\u0022http://i64.tinypic.com/mr6xzn.jpg\u0022 alt=\u0022mr6xzn.jpg\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\nHere\u0027s something that you could use to move ore between surface of the Mun and Mun orbit. It burns 25 tons of liquid fuel to move 60 tons of ore up to orbit with plenty of delta-V for both the descent and ascent.\n\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-12-30T15:58:10Z","Content":"\n\u003Cp\u003E\nMun mining seems to be widely enough, I assume it works fine. Consider that you\u0027re landing with payload empty, then flying back up with it full, which makes the fuel requirement much less than for landing and returning the same heavy payload.\n\u003C/p\u003E\n\u003Cp\u003E\nOn paper I can make a ship capable of landing itself on \u003Cem\u003EMoho\u003C/em\u003E, filling up 15 tons of ore, and launching it back to orbit using 12 tons of LFO overall. (Note that this ship does not carry the mining drills itself, it\u0027s just an ore hauler). While a slim margin that is a net gain, and means that shipping ore to orbit is viable almost everywhere.\n\u003C/p\u003E\n\u003Cp\u003E\nThat said if you refine your ore into fuel on the surface you gain a further advantage, because you don\u0027t even need your fuel for the ascent when you land. But you can still refine some on the surface and ship more raw ore into orbit if you like.\n\u003C/p\u003E\n"},{"CreatedByName":"glen.mack","CreatedById":75413,"CreatedDateTime":"2015-12-30T18:48:54Z","Content":"\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/62V1WMV.jpg\u0022 alt=\u002262V1WMV.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSo I ended up with this non-atmospheric low gravity miner.\n\u003C/p\u003E\n\u003Cp\u003E\nAfter some reading I realised I have been confusing units and mass, and 1 unit of ore represents 10kg, (I thought it was 1kg), so yes, of course it\u0027s viable.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-12-30T18:50:21Z\u0022 title=\u002212/30/2015 06:50  PM\u0022 data-short=\u00228 yr\u0022\u003EDecember 30, 2015\u003C/time\u003E by glen.mack\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sardia","CreatedById":149922,"CreatedDateTime":"2015-12-31T01:14:22Z","Content":"\n\u003Cp\u003E\nIf you really need ore based money that badly, why not drive a refinery on kerbin onto the grass. Mine the ore, crack it into liquid fuel, and recover?\n\u003C/p\u003E\n"},{"CreatedByName":"AbacusWizard","CreatedById":116476,"CreatedDateTime":"2015-12-31T07:04:17Z","Content":"\n\u003Cp\u003E\nIs there any reason to lift ore from the surface up into orbit? Why not just process it on the surface and bring the fuel up to orbit?\n\u003C/p\u003E\n"},{"CreatedByName":"Shpaget","CreatedById":45577,"CreatedDateTime":"2015-12-31T07:56:25Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222341943\u0022 data-ipsquote-contentid=\u0022128903\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221451485314\u0022 data-ipsquote-userid=\u002224430\u0022 data-ipsquote-username=\u0022Temstar\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n17 hours ago, Temstar said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHere\u0027s something I threw together:\u003Cbr\u003E\u003Cbr\u003E\u003Ca href=\u0022http://i64.tinypic.com/mr6xzn.jpg\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022mr6xzn.jpg\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 src=\u0022http://i64.tinypic.com/mr6xzn.jpg\u0022\u003E\u003C/a\u003E\u003Cbr\u003E\u003Cbr\u003E\nHere\u0027s something that you could use to move ore between surface of the Mun and Mun orbit. It burns 25 tons of liquid fuel to move 60 tons of ore up to orbit with plenty of delta-V for both the descent and ascent.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat\u0027s a beautiful design, but the part clipping bothers me a bit. Care to share the craft file? I\u0027d love to take it apart and examine in detail.\n\u003C/p\u003E\n"},{"CreatedByName":"Foxster","CreatedById":113764,"CreatedDateTime":"2015-12-31T11:00:56Z","Content":"\n\u003Cp\u003E\nI haven\u0027t yet found a use for mining and converting to fuel on any kind of regular basis. You can make any kind of practical mission in the system with one launch from Kerbin. \n\u003C/p\u003E\n\u003Cp\u003E\nPerhaps if you are into making huge, inefficient but aesthetically pleasing (to you) craft that require lots of fuel or you are using a mod that makes the system bigger then it might be worth doing from a practical point of view. \n\u003C/p\u003E\n\u003Cp\u003E\nHowever, it is a very interesting thing to do just as a technical challenge.   \n\u003C/p\u003E\n"},{"CreatedByName":"Evanitis","CreatedById":145424,"CreatedDateTime":"2015-12-31T12:22:10Z","Content":"\n\u003Cp\u003E\nI tend to place orbital refineries on Minmus and moons of planets that I\u0027m interested in during career games. But I\u0027m a lazy overbuilder who rarely touches math. I prefer to eyeball my designs. Having ISRUs around means I can just throw random crafts towards random bodies and decide what to do once I\u0027m there. If I make mistakes near a mining operation, I usually don\u0027t need an interplanetary rescue to fix those. In the worst case scenario, I can just send home the Kerbals with the refinery, or in some loose parts of it. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOf course, if you take pleasure in pre-planning and perfectly executing all your missions, mining has no point.\n\u003C/p\u003E\n"},{"CreatedByName":"Temstar","CreatedById":24430,"CreatedDateTime":"2015-12-31T13:14:22Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222343161\u0022 data-ipsquote-contentid=\u0022128903\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221451548585\u0022 data-ipsquote-userid=\u002245577\u0022 data-ipsquote-username=\u0022Shpaget\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, Shpaget said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThat\u0027s a beautiful design, but the part clipping bothers me a bit. Care to share the craft file? I\u0027d love to take it apart and examine in detail.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIf you insist:\u003Cbr\u003E\u003Ca href=\u0022http://www./download/ec8hxsnfwqc271h/Ore_Tanker.craft\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./download/ec8hxsnfwqc271h/Ore_Tanker.craft\u003C/a\u003E\u003Cbr\u003E\u003Cbr\u003E\nI threw it together pretty quickly.\n\u003C/p\u003E\n"},{"CreatedByName":"Shpaget","CreatedById":45577,"CreatedDateTime":"2015-12-31T14:52:07Z","Content":"\n\u003Cp\u003E\nThank you.\n\u003C/p\u003E\n"},{"CreatedByName":"glen.mack","CreatedById":75413,"CreatedDateTime":"2015-12-31T16:24:16Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222343127\u0022 data-ipsquote-contentid=\u0022128903\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221451545457\u0022 data-ipsquote-userid=\u0022116476\u0022 data-ipsquote-username=\u0022AbacusWizard\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 hours ago, AbacusWizard said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIs there any reason to lift ore from the surface up into orbit? Why not just process it on the surface and bring the fuel up to orbit?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe reason is fractional payload.\n\u003C/p\u003E\n\u003Cp\u003E\nThe ISRU is 4.25 tonnes. If you want to build a vessel just designed to mine and lift fuel to orbit, you build something like Temstar\u0027s rig, which could handle another 4.25t and lose barely 5-10 delta V when full.\n\u003C/p\u003E\n\u003Cp\u003E\nOn my design, it\u0027s about 400, not to mention the extra time I\u0027d spend on the surface processing. In a higher orbit, you spend less time blocked from the sun, so more electricity for processing.\n\u003C/p\u003E\n\u003Cp\u003E\nI wanted to design it as part of a go anywhere mothership, but the smaller the miner is, the less tolerance it has for an ISRU. If I drop it on the surface, it\u0027s gone so I only have 1 refueling stop, using the small converter only gives me the fuel that will fit in the tanks, and that becomes more of a fractional payload if I have to bring tanks too.\n\u003C/p\u003E\n\u003Cp\u003E\nMy miner is 37t wet, and should be able to bring 30t of ore up from most moons. It has a pretty bad TWR, but, the bonus is I can leave the ore on the mothership, have it process while I go back down to the moon and get more.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2015-12-31T22:16:42Z","Content":"\n\u003Cp\u003E\nThe avantage of refining on orbit is not having to choose the LF/OX ratio beforehand. Instead, you refine as you use it. Plus, it\u0027s the most compact way of storage.\n\u003C/p\u003E\n\u003Cp\u003E\nBut keeping a refinery on the ground is crucial! That way you fuel the ore tanker with \u0022free\u0022 fuel, and don\u0027t consider what is in its tanks as payload. Bottom line, even in deep gravity wells you can stockpile ore in orbit, if you can lift off with enough fuel to land again empty afterwards (I.E: not in Tylo)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nRune. My latest Grand Tour architecture wouldn\u0027t be possible without ISRU.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"AbacusWizard","CreatedById":116476,"CreatedDateTime":"2016-01-02T10:08:03Z","Content":"\n\u003Cp\u003E\nI just have a combination mine/refinery with plenty of solar, lots of backup battery power, and a few \u0022landing pads\u0022 (docking clamps) on the surface of Minmus, plus a large LF/OX tanker that lands on the landing pad, waits patiently to be filled up with delicious fresh-baked fuel, and then detaches and takes off up to orbit, where it acts as an orbital fuel depot for whatever needs it. When it runs out I land it and repeat the process.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nI can see the merit in the \u0022high orbit means more sun exposure\u0022 argument, but time isn\u0027t too much of a problem here, since I\u0027m mostly using it to refuel either small Minmus landers that don\u0027t need all that much fuel anyway or huge interplanetary ships that won\u0027t be back for another top-up for a few years anyway.\n\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2016-01-02T13:01:03Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222343515\u0022 data-ipsquote-contentid=\u0022128903\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221451579056\u0022 data-ipsquote-userid=\u002275413\u0022 data-ipsquote-username=\u0022glen.mack\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 12/31/2015 at 5:24 PM, glen.mack said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe reason is fractional payload.\n\u003C/p\u003E\n\u003Cp\u003E\nThe ISRU is 4.25 tonnes. If you want to build a vessel just designed to mine and lift fuel to orbit, you build something like Temstar\u0027s rig, which could handle another 4.25t and lose barely 5-10 delta V when full.\n\u003C/p\u003E\n\u003Cp\u003E\nOn my design, it\u0027s about 400, not to mention the extra time I\u0027d spend on the surface processing. In a higher orbit, you spend less time blocked from the sun, so more electricity for processing.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAnytime you need to reserve more than 4.25 tons of fuel for the ascent, it is more efficient to bring the big ISRU with you, than to just bring ore tanks with no ISRU convertor and try to bring unrefined ore to orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nTo put that in perspective, its a FL-T800 tank... if you use more than that to get your ore up, you should be using an ISRU\n\u003C/p\u003E\n\u003Cp\u003E\n^This was the case before we got the mini-ISRU. With the mini ISRU coming in at 1.25 tons, if you use a little more than a FL-T200\u0027s worth of fuel to get your ore to orbit, you should carry along this mini ISRU convertor. In this case, your orbiting craft should have the large ISRU, because its fuel:ore yield is 10x higher.\n\u003C/p\u003E\n\u003Cp\u003E\nI like to do massive landers with massive tanks on Mun/minmus (a KR-2L is my lander engine), so that I don\u0027t have to do lots of landings followed by rendevous to supply fuel depots... the lander basically is a fuel depot. When it gets that big, the ISRU mass is not very significant... and I take mostly fuel to orbit. If using a mini ISRU, you want to take mostly ore to orbit, with just the minimal fuel capacity needed to get that ore to orbit and dock it (otherwise it takes a lot longer, as you\u0027ll need to drill 10x more ore to fill up the fuel tanks due to the inefficient conversion of the small convertor)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022hTOcaAx.png\u0022 class=\u0022ipsImage\u0022 height=\u0022626\u0022 src=\u0022http://i.imgur.com/hTOcaAx.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI could do single launch missions to pretty much anywhere, but I like to do orbital assembly... fully reusable systems with tugs, spacious crew compartments for interplanetary journeys/stays on the surface, to put up orbiting fuel depots\u002B labs around the target planet/moon, and to get results from all science experiments for multiple biomes.... and I often I want to be able to \u0022play around\u0022 in the system, not just carefully execute maneuvers, treating every drop of fuel as irreplaceable, so I take ISRU... Except for Tylo, Eve, Moho, and Eeloo.\n\u003C/p\u003E\n\u003Cp\u003E\nFor moho, I did a fully reusable/recoverable mission, spacious crew accomodations (but not as spacious as my other missions), a full science lander \u002B orbiting fuel depot (but only enough lander fuel for 3.5 landings... so 3 landings... I\u0027m thinking a landing near a biomer border and a suborbital hop could have been more efficient)... but it took me two launches. I didn\u0027t use ISRU at all, and departed from LKO, not Mun/Minmus.\n\u003C/p\u003E\n\u003Cp\u003E\nI could have reduced the size of the mission even further, in theory, using ion drives for capture at moho and kerbin... but aint nobody got time for that.\n\u003C/p\u003E\n\u003Cp\u003E\nLaunching this as the payload to LKO without using any fuel... is not easy:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022rq1irRl.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/rq1irRl.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSo yea... ISRU could help a lot.\n\u003C/p\u003E\n\u003Cp\u003E\nIn theory I could have reduced the size even further and still made it fully reusable/recoverable, by having it stage even more, but then the stage recovery/reuse would be a lot more complicated and take years for stages to re-encounter kerbin again.\n\u003C/p\u003E\n"},{"CreatedByName":"suicidejunkie","CreatedById":155878,"CreatedDateTime":"2016-01-02T16:14:30Z","Content":"\n\u003Cp\u003E\nHow much benefit do you actually see from the refining in orbit in regards to the fuel choices?\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve never seen the advantage, but maybe I\u0027m just looking at a scale that\u0027s too large?  3 popsicle tankers, and 6 popsicle fuel depots might just swamp any fluctuations in usage.\n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2016-01-02T19:29:33Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222345687\u0022 data-ipsquote-contentid=\u0022128903\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221451729283\u0022 data-ipsquote-userid=\u0022116476\u0022 data-ipsquote-username=\u0022AbacusWizard\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 hours ago, AbacusWizard said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI can see the merit in the \u0022high orbit means more sun exposure\u0022 argument\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nEven in low orbit, a polar orbit gets you 25% more light than an equatorial orbit in a year (ie. 75% instead of around 50%). Which is still better than a high orbit.\n\u003C/p\u003E\n"},{"CreatedByName":"suicidejunkie","CreatedById":155878,"CreatedDateTime":"2016-01-02T22:53:40Z","Content":"\n\u003Cp\u003E\nThat math doesn\u0027t check out...\n\u003C/p\u003E\n\u003Cp\u003E\nAn arbitrarily high orbit reduces the occlusion of the sun to an arbitrarily low time per orbit; for extremely high kerbin orbits, the mun will block the sun just as much as kerbin will.\n\u003C/p\u003E\n\u003Cp\u003E\nA maximally tight polar orbit will get you 50% sunlight, except on two orbits per year when you\u0027re face on to the sun.  A wider polar orbit will leave you in the sun for additional days per year.\n\u003C/p\u003E\n\u003Cp\u003E\nFor the same orbital distance, the polar orbit will get you a little more sun on average, but I doubt it is worth the extra dV or the much more restricted launch windows required to rendezvous.\n\u003C/p\u003E\n"},{"CreatedByName":"mjl1966","CreatedById":105019,"CreatedDateTime":"2016-01-03T16:24:22Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222343239\u0022 data-ipsquote-contentid=\u0022128903\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221451559656\u0022 data-ipsquote-userid=\u0022113764\u0022 data-ipsquote-username=\u0022Foxster\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 12/31/2015 at 6:00 AM, Foxster said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI haven\u0027t yet found a use for mining and converting to fuel on any kind of regular basis. You can make any kind of practical mission in the system with one launch from Kerbin. \n\u003C/p\u003E\n\u003Cp\u003E\nPerhaps if you are into making huge, inefficient but aesthetically pleasing (to you) craft that require lots of fuel or you are using a mod that makes the system bigger then it might be worth doing from a practical point of view. \n\u003C/p\u003E\n\u003Cp\u003E\nHowever, it is a very interesting thing to do just as a technical challenge.   \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222343276\u0022 data-ipsquote-contentid=\u0022128903\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221451564530\u0022 data-ipsquote-userid=\u0022145424\u0022 data-ipsquote-username=\u0022Evanitis\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 12/31/2015 at 7:22 AM, Evanitis said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI tend to place orbital refineries on Minmus and moons of planets that I\u0027m interested in during career games. But I\u0027m a lazy overbuilder who rarely touches math. I prefer to eyeball my designs. Having ISRUs around means I can just throw random crafts towards random bodies and decide what to do once I\u0027m there. If I make mistakes near a mining operation, I usually don\u0027t need an interplanetary rescue to fix those. In the worst case scenario, I can just send home the Kerbals with the refinery, or in some loose parts of it. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOf course, if you take pleasure in pre-planning and perfectly executing all your missions, mining has no point.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI don\u0027t understand how ore can be useless.  The most immediate useful application that comes to mind is leapfrogging.\n\u003C/p\u003E\n\u003Cp\u003E\nAt first glance, doing something like going to Jool via Duna seems inefficient.  It takes a lot less dV to just go to Jool from LKO.  But, what if you set up a basic fuel colony on Duna?  There are ways via mods to set up a colony that is self sufficient.  At that point, every gram of fuel you refine on Duna is free return on investment.  That being the case, all I have to do to get from Krbal to Jool is put up enough dV go get to Duna, which is way cheaper than the total dV for Jool.  Once I get to Duna, the rest is free dV. \n\u003C/p\u003E\n\u003Cp\u003E\nSame argument for mun: all you need to go anywhere is dV to get to the Mun.  From there, dV is free.\n\u003C/p\u003E\n\u003Cp\u003E\nEven if not totally free, I bet the dV mined from Mun and Duna is cheaper in the long run than dV purchased on Kerbin.  This becomes useful if you\u0027re objective is to establish and grow permanent colonies\n\u003C/p\u003E\n\u003Cp\u003E\nOr does the math totally break down somewhere?  My retort here is conceptual, not analytical.\n\u003C/p\u003E\n\u003Cp\u003E\nAll this brings to mind an idea for science.  Right now, the only reason to go to Duna is to go there.  But what if each planet had \u0022special\u0022 science that is necessary to unlock certain branches in the tech tree?  Hmmmm.......(Or am I the hundredth monkey on this?)\n\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2016-01-03T17:38:06Z","Content":"\n\u003Cp\u003E\nArriving at or departing from a specific highly-inclined orbit is a nuisance. I wouldn\u0027t put my ore refinery in a polar orbit. Maybe something like a 30 degree inclination, that\u0027s a good compromise between access from the surface and access to escape/interplanetary trajectories.\n\u003C/p\u003E\n"},{"CreatedByName":"glen.mack","CreatedById":75413,"CreatedDateTime":"2016-01-03T19:02:19Z","Content":"\n\u003Cp\u003E\nMy interplanetary mother-ship is finished...\n\u003C/p\u003E\n\u003Cp\u003E\nPity getting it all to orbit is going to take twice as long...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/EzqFfJE.jpg\u0022 alt=\u0022EzqFfJE.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2016-01-03T20:22:38Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222341920\u0022 data-ipsquote-contentid=\u0022128903\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221451483035\u0022 data-ipsquote-userid=\u002224430\u0022 data-ipsquote-username=\u0022Temstar\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 12/30/2015 at 7:43 AM, Temstar said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNo, even on places like Duna you can easily build a surface to orbit tanker that can carry up much more ore than the fuel it uses to land and take off. Remember also that the tanker doesn\u0027t have to be fuelled on orbit from the orbital refinery using the ore it carried up - it\u0027s easier to just have refining capability on the ground as well and refuel the tanker rocket on the ground while you\u0027re filling it with ore.\u003Cbr\u003E\u003Cbr\u003E\nThat, and because atomic rockets.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nDepends on your definition of \u0027easier\u0027. I would rather make 20 trips back and forth from the surface than perform one surface docking. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOP, Kethane is much better suited to orbital refining, of course there is still a loss simply from carrying the drills everywhere, but it doesn\u0027t have the ridiculous engineer requirements that the crappy stock system does so you can do automated drilling with a probe.  If you want an annoying chore, use stock ISRU.  If you want a fun gameplay mechanic, use Kethane.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-01-03T20:24:40Z\u0022 title=\u002201/03/2016 08:24  PM\u0022 data-short=\u00228 yr\u0022\u003EJanuary 3, 2016\u003C/time\u003E by Alshain\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2016-01-03T20:42:53Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222343979\u0022 data-ipsquote-contentid=\u0022128903\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221451600202\u0022 data-ipsquote-userid=\u002252690\u0022 data-ipsquote-username=\u0022Rune\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 12/31/2015 at 11:16 PM, Rune said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n Bottom line, even in deep gravity wells you can stockpile ore in orbit, if you can lift off with enough fuel to land again empty afterwards (I.E: not in Tylo)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nExcept since SSTO landers without ISRU are possibe on Tylo... If you can start in orbit andland on tylo with all the fuel needed to get bck to orbit, then you can start on the surface of tylo (fueled by an ISRU) and get to orbit with all the fuel needed to land again. The margins are pretty small though making it a tedious undertaking to stockpile large amounts of fuel by ISRU on Tylo. It can be done though.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222347247\u0022 data-ipsquote-contentid=\u0022128903\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221451852558\u0022 data-ipsquote-userid=\u0022110959\u0022 data-ipsquote-username=\u0022Alshain\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n14 minutes ago, Alshain said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nDepends on your definition of \u0027easier\u0027. I would rather make 20 trips back and forth from the surface than perform one surface docking.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIts made much easier with the Claw. I\u0027ve started using fuel trucks with claws for supplying stuff on the surface of Laythe. Still, I find it much easier to just take the converter everywhere, that way I can land at the closest \u0022hot spot\u0022, and not be limited to a location that I\u0027ve previously placed equipment\n\u003C/p\u003E\n"}]}