{"TopicId":129079,"ForumId":70,"TopicTitle":"RCS not working when docked","CreatedByName":"cawsp","CreatedById":156182,"CreatedDateTime":"2016-01-02T02:34:19Z","PageNum":1,"Articles":[{"CreatedByName":"cawsp","CreatedById":156182,"CreatedDateTime":"2016-01-02T02:34:19Z","Content":"\n\u003Cp\u003E\nHi! I made tugs for towing in large fuel tanks and docking certain ships but whenever one of my tugs docks to another ship (with the claw or a docking port) it can no longer use RCS. Anyone have any idea what might be happening? I\u0027ve tried it with three different ships. This makes my tugs completely useless but I\u0027m confused why this would be happening. I posted a picture. RCS is turned on and I\u0027m controlling from the front docking port. There is plenty of electricity. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 src=\u0022http://s22.postimg.org/sftvbljht/KSP.png\u0022 alt=\u0022KSP.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"*Aqua*","CreatedById":103926,"CreatedDateTime":"2016-01-02T09:22:10Z","Content":"\n\u003Cp\u003E\nDid you try turning it off and on again? Also reset the controlling part, this might revive the RCS. And while you are at it check the RCS thruster if they are active or shut down. (Never hear of them shutting down by themselves but it doesn\u0027t hurt to check them.)\n\u003C/p\u003E\n\u003Cp\u003E\nAlso what mods do you have installed? And please upload the output_log.txt from your KSP/KSP_Data directory.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-01-02T09:22:33Z\u0022 title=\u002201/02/2016 09:22  AM\u0022 data-short=\u00228 yr\u0022\u003EJanuary 2, 2016\u003C/time\u003E by *Aqua*\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"cawsp","CreatedById":156182,"CreatedDateTime":"2016-01-02T18:58:13Z","Content":"\n\u003Cp\u003E\nThank you again Aqua! Amazingly turning it off and on actually fixed the problem!! This was the first time for me to try making tugs so I thought I did something wrong design-wise or I did something that wasn\u0027t suppose to be done. I will try restarting the game next time \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n"}]}