{"TopicId":129178,"ForumId":55,"TopicTitle":"Make Rescue Missions better (and more sensical)","CreatedByName":"capran","CreatedById":65692,"CreatedDateTime":"2016-01-03T17:37:54Z","PageNum":1,"Articles":[{"CreatedByName":"capran","CreatedById":65692,"CreatedDateTime":"2016-01-03T17:37:54Z","Content":"\n\u003Cp\u003E\nOne suggestion I have is to make rescue missions make sense. My biggest gripe about these is that the modules the kerbals in need of rescue are in have no docking ports! They\u0027re just a bare module.\n\u003C/p\u003E\n\u003Cp\u003E\nSo here\u0027s my list for suggested improvements:\n\u003C/p\u003E\n\u003Cp\u003E\n1. Make sure the dead craft has a docking port (and indicate in the mission briefing what type).\n\u003C/p\u003E\n\u003Cp\u003E\n2. Give some story how that kerbal got there! Maybe they belong to another country\u0027s space program? A private program?\n\u003C/p\u003E\n\u003Cp\u003E\n3. Make the dead craft a full-fledged space craft, not just a bare module. Just start it out with no (or not enough) fuel and monopropellent, That way, one possible rescue mission would be a simple probe-based refueller.\n\u003C/p\u003E\n\u003Cp\u003E\nOR\n\u003C/p\u003E\n\u003Cp\u003E\n4. Make it a full-fledged space craft, but with a critical component broken or missing , such as an engine.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI think this should be in stock. But maybe some clever mod crafter can make this happen?\n\u003C/p\u003E\n"},{"CreatedByName":"SpaceplaneAddict","CreatedById":149322,"CreatedDateTime":"2016-01-03T18:10:18Z","Content":"\n\u003Cp\u003E\nVery good suggestions that I fully support!\n\u003C/p\u003E\n"},{"CreatedByName":"Waxing_Kibbous","CreatedById":151611,"CreatedDateTime":"2016-01-03T20:19:35Z","Content":"\n\u003Cp\u003E\nI don\u0027t mind the basic floating capsules, but the idea of having a simple craft that just needed refuelling would be a nice bit of variety for sure.\n\u003C/p\u003E\n"},{"CreatedByName":"pandaman","CreatedById":130621,"CreatedDateTime":"2016-01-03T20:34:30Z","Content":"\n\u003Cp\u003E\nI struggle a bit with the rationale behind the rescue contracts.  Out of the blue some random dude gets himself stuck in orbit, for no apparent reason.  Surely if another agency was operating you would know about it, and when they launch stuff, even if it\u0027s beyond your current capabilities.  And if he/she needs rescuing then they need rescuing NOW, not in a few months when you develop the tech to do it.\n\u003C/p\u003E\n\u003Cp\u003E\nThe OP\u0027s suggestion does address some of this.\n\u003C/p\u003E\n\u003Cp\u003E\nI like the idea that they give a great opportunity to learn rendezvous etc so they serve a valuable purpose.\n\u003C/p\u003E\n\u003Cp\u003E\nMaybe a rescue should be exactly that, get the poor soul home in 2 days or he dies or maybe the agency that put him there gets him.  No profit, but lots of rep.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd the current \u0027rescue\u0027 contracts would possibly be better re-purposed as \u0027go fetch that satellite you put up last month\u0027 or \u0027a small asteriod has got captured in orbit please retrieve it\u0027.  They serve exactly the same purpose as rescue contracts, but make a lot more sense.\n\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-01-03T21:25:22Z","Content":"\n\u003Cp\u003E\nI suggested the same stuff about a year ago, good ideas. Really, the rescues imply a competing space program, which should be a real focus post 1.1, with the goal being a \u0022space race\u0022 mode of career play.\n\u003C/p\u003E\n"},{"CreatedByName":"capran","CreatedById":65692,"CreatedDateTime":"2016-01-03T21:43:44Z","Content":"\n\u003Cp\u003E\nGood ideas! Kind of makes me wish I knew how to make mods. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Temstar","CreatedById":24430,"CreatedDateTime":"2016-01-04T00:11:29Z","Content":"\n\u003Cp\u003E\nThe docking port idea is pretty good, but even if the craft stuck in orbit has a docking port I would never try to dock with it, it\u0027s much easier to just EVA the Kerbal across.\u003Cbr\u003E\u003Cbr\u003E\nInstead I like \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/130621-pandaman/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022130621\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/130621-pandaman/\u0022\u003E@pandaman\u003C/a\u003E\u0027s idea of spacecraft retrieval. As in instead of bringing a kerbal back, your goal is instead to return an existing spacecraft safely back to Kerbin, with much higher return if you manage to achieve 100% recovery by landing on the runway or launchpad. This means you either need to send up an \u0022deorbiting package\u0022 to dock, deorbit and protect the target during reentry, or later with higher tech level a spaceplane capable of capturing the spacecraft in its cargo hold ala the space shuttle.\n\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-01-04T04:04:47Z","Content":"\n\u003Cp\u003E\nThe craft belong to another program. \u0022Rescue\u0022 in many cases would consist of docking and delivering X LFO, and Y EC so that the craft could return to Kerbin itself. That or the game might place a competitor\u0027s station, and it must be delivered to the station (and docked there). Perhaps the only crew aboard are non-pilots, so you refuel it, then bring it home to that orbital base, etc. There are many possibilities.\n\u003C/p\u003E\n"},{"CreatedByName":"AbacusWizard","CreatedById":116476,"CreatedDateTime":"2016-01-05T00:32:17Z","Content":"\n\u003Cp\u003E\nI\u0027d also like to see more EVA-task-focused rescue missions, like\n\u003C/p\u003E\n\u003Cp\u003E\n• send an engineer to re-pack the accidentally deployed parachutes on a craft in low Kerbin orbit\n\u003C/p\u003E\n\u003Cp\u003E\n• send a scientist to reset the experiments on a science probe landed on Minmus\n\u003C/p\u003E\n\u003Cp\u003E\n• send an engineer to fix the broken wheels of a Duna rover\n\u003C/p\u003E\n\u003Cp\u003E\n• send a pilot to... uh... what do pilots do again?\n\u003C/p\u003E\n\u003Cp\u003E\n• we forgot to deploy solar panels before the satellite ran out of batteries; fix plz\n\u003C/p\u003E\n\u003Cp\u003E\nand so on. If KIS/KAS were absorbed into the stock game, it would open up even more possibilities.\n\u003C/p\u003E\n"},{"CreatedByName":"capran","CreatedById":65692,"CreatedDateTime":"2016-01-05T02:13:34Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222348782\u0022 data-ipsquote-contentid=\u0022129178\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221451953937\u0022 data-ipsquote-userid=\u0022116476\u0022 data-ipsquote-username=\u0022AbacusWizard\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, AbacusWizard said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022 style=\u0022background-image:none;background-position:0% 0%;background-repeat:repeat;\u0022\u003E\n\u003Cp\u003E\nI\u0027d also like to see more EVA-task-focused rescue missions, like\n\u003C/p\u003E\n\u003Cp\u003E\n• send an engineer to re-pack the accidentally deployed parachutes on a craft in low Kerbin orbit\n\u003C/p\u003E\n\u003Cp\u003E\n• send a scientist to reset the experiments on a science probe landed on Minmus\n\u003C/p\u003E\n\u003Cp\u003E\n• send an engineer to fix the broken wheels of a Duna rover\n\u003C/p\u003E\n\u003Cp\u003E\n• send a pilot to... uh... what do pilots do again?\n\u003C/p\u003E\n\u003Cp\u003E\n• we forgot to deploy solar panels before the satellite ran out of batteries; fix plz\n\u003C/p\u003E\n\u003Cp\u003E\nand so on. If KIS/KAS were absorbed into the stock game, it would open up even more possibilities.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYES!\n\u003C/p\u003E\n\u003Cp\u003E\nI love the idea of KIS/KAS in general, but find it frustrating to use. Moving/installing parts with engineers is cool, but the implementation is very frustrating. It works OK when you\u0027re on the ground, but doing it EVA in space is hard, you really need a way to secure the engineer to the ship and then manipulate an object. If Squad gives us this ability in game, they should make it easier to manipulate objects by locking them to the engineer and then just use regular EVA controls to maneuver the part.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, the winch system needs work. The lines are just straight lines, always taught and never slacken, and clip right through the ship and objects. When plugged and docked, parts can just clip right through each other, and if you timewarp, bad stuff happens.\n\u003C/p\u003E\n\u003Cp\u003E\nSo good idea, but they really need to rework it to make it work easier, and intuitively.\n\u003C/p\u003E\n"},{"CreatedByName":"AbacusWizard","CreatedById":116476,"CreatedDateTime":"2016-01-05T05:39:43Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222348871\u0022 data-ipsquote-contentid=\u0022129178\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221451960014\u0022 data-ipsquote-userid=\u002265692\u0022 data-ipsquote-username=\u0022capran\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, capran said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt works OK when you\u0027re on the ground, but doing it EVA in space is hard, you really need a way to secure the engineer to the ship and then manipulate an object.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI came up with a great workaround for that--I have each engineer carry (as standard issue) a powertool, a jetpack propellant tank, a pair of fuel hose connectors, \u003Cem\u003Eand a ladder segment\u003C/em\u003E. Whenever I approach a ship that needs repairs, I start by wielding the powertool, attaching the ladder segment to the ship, and grabbing on... instant handhold, anywhere!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nMoving large components towards the ship to be attached is tricky. I\u0027ve been experimenting with a small uncrewed \u0022tugboat\u0022 that grabs a part with a klaw, moves it gently into place, and lets go; then the engineer (already on site with said ladder segment) attaches it before it can drift away. Works pretty well so far.\n\u003C/p\u003E\n"},{"CreatedByName":"Leszek","CreatedById":119053,"CreatedDateTime":"2016-01-05T08:25:45Z","Content":"\n\u003Cp\u003E\nI only do science games so I don\u0027t have rescue missions, except once.\n\u003C/p\u003E\n\u003Cp\u003E\nA space station was in construction in orbit and I decided to launch a crewed module. (I have remote tech so it saves on things if I can just put a kerbal on it.)  Mid way up during launch the boosters crashed into the core booster and took out my launch vehicle.  So I dumped the fairings and started to try to get to orbit with a space tug with an orbital engine and a not so aerodynamic space station module.  I fail. However I did get close enough to orbit that my kerbal just got out and used his jet pack to complete the orbit and circularize successfully.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd that is how I got a kerbal in orbit by himself, no ship in sight.\n\u003C/p\u003E\n\u003Cp\u003E\nI realize it is slightly off topic but I post non the less for inspirational reasons.\n\u003C/p\u003E\n"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2016-01-05T14:43:06Z","Content":"\n\u003Cp\u003E\nRescuing missions are quite nice, but part recovery is a pain. you usually need some specifically design claw ship. It\u0027s long and painful. And who you want to pay 50000fund to recover a part that costs 1200funds. That\u0027s no RP.\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRecover parts should be ships or at least part of ships.\n\u003C/li\u003E\n\u003Cli\u003E\nRescue missions should validate non on Kerbin return but when the pilot is dumped at a station.\n\u003C/li\u003E\n\u003Cli\u003E\nRescue mission shouldn\u0027t  give free kerbals, this is too easy. Kerbals should accept to com for a bargain price (which could vary with the rescue location.\n\u003C/li\u003E\n\u003Cli\u003E\nNew mission type : recover science data from a pod (with or without pilot)\n\u003C/li\u003E\n\u003Cli\u003E\nMore rescue landed pilots (especially Mun and Minmus)\n\u003C/li\u003E\n\u003C/ul\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-01-06T02:24:07Z","Content":"\n\u003Cp\u003E\nI don\u0027t have a problem (much) with the Kerbin-based  rescue contracts, or even the ones for Mun or Minmus.  What feels kinda weird is this:  after an industrious and hard-fought career, boldly grabbing all available science to push back the frontiers of kerbal knowledge so that my technology finally makes a place like Jool reachable, and at great trouble and expense I manage to get there to, say, Vall... and somehow there\u0027s a kerbal in orbit there waiting for me, saying \u0022what took you so long\u0022?  That\u0027s where my willing-suspension-of-disbelief feels stretched a little thin.  \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAgreed that recover-parts contracts are a pain... in particular since I adamantly refuse to use the Klaw, ever, until and unless Squad gets serious about dekrakenizing it.  And even then it just seems wrong-- pulling something like a Mk1-2 command pod off a planetary surface is hard.  I don\u0027t mean the \u0022fun challenge\u0022 kind of hard, I mean the \u0022stupid frustrating pointless\u0022 kind of hard because it\u0027s the kind of thing that seems limited by arbitrary game mechanics-- trying to build a jury-rigged klaw contraption to grab it and then get back into space with a symmetric mass distribution.  Having recover-this-part contracts where the ship actually has a docking port on it-- now that starts to get interesting.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd I love \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/116476-abacuswizard/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022116476\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/116476-abacuswizard/\u0022\u003E@AbacusWizard\u003C/a\u003E\u0027s suggestions for EVA activities.  In general, anything that gives EVA kerbals something interesting to do is a plus in my book.\n\u003C/p\u003E\n\u003Cp\u003E\nRecovery contracts would also get a lot more interesting if the game had more reasonable ways to put things \u003Cu\u003E\u003Cem\u003Einto\u003C/em\u003E\u003C/u\u003E cargo bays.  I\u0027d love a cargo bay which, for example, causes anything physically inside it to be \u0022locked down\u0022 the moment the doors close, so that it\u0027s possible to capture something by maneuvering the cargo bay around it and then closing the doors.  Makes all sorts of things possible.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"AbacusWizard","CreatedById":116476,"CreatedDateTime":"2016-01-06T04:14:49Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222350237\u0022 data-ipsquote-contentid=\u0022129178\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221452047047\u0022 data-ipsquote-userid=\u0022125662\u0022 data-ipsquote-username=\u0022Snark\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Snark said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhat feels kinda weird is this:  after an industrious and hard-fought career, boldly grabbing all available science to push back the frontiers of kerbal knowledge so that my technology finally makes a place like Jool reachable, and at great trouble and expense I manage to get there to, say, Vall... and somehow there\u0027s a kerbal in orbit there waiting for me, saying \u0022what took you so long\u0022?  That\u0027s where my willing-suspension-of-disbelief feels stretched a little thin.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell, the marooned kerbalnauts don\u0027t start showing up in orbit around a planet until you\u0027ve visited it, right? Obviously they hitched a ride there on your probe as stowaways and now they\u0027re getting homesick.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222350237\u0022 data-ipsquote-contentid=\u0022129178\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221452047047\u0022 data-ipsquote-userid=\u0022125662\u0022 data-ipsquote-username=\u0022Snark\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Snark said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHaving recover-this-part contracts where the ship actually has a docking port on it-- now that starts to get interesting.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nDo you use KIS/KAS? You could have an engineer bolt a docking port to the darn thing. Problem solved. (The winches and grappling hooks can also be useful for hauling a part off the surface of a planet, but they get buggy if you try to do much maneuvering or any time warp at all.)\n\u003C/p\u003E\n\u003Cp\u003E\nAnd yeah, I think it would be a great idea if everything inside a cargo bay (or fairings, for that matter) was implicitly assumed to be bolted to the interior walls.\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-01-06T04:43:58Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222350358\u0022 data-ipsquote-contentid=\u0022129178\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221452053689\u0022 data-ipsquote-userid=\u0022116476\u0022 data-ipsquote-username=\u0022AbacusWizard\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n27 minutes ago, AbacusWizard said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nDo you use KIS/KAS? You could have an engineer bolt a docking port to the darn thing. Problem solved. (The winches and grappling hooks can also be useful for hauling a part off the surface of a planet, but they get buggy if you try to do much maneuvering or any time warp at all.)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah, I do use KIS/KAS, and I\u0027ve done exactly what you describe.  But it bugs me; there should be some way of doing this in stock, I shouldn\u0027t need KAS for it.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222350358\u0022 data-ipsquote-contentid=\u0022129178\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221452053689\u0022 data-ipsquote-userid=\u0022116476\u0022 data-ipsquote-username=\u0022AbacusWizard\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n28 minutes ago, AbacusWizard said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAnd yeah, I think it would be a great idea if everything inside a cargo bay (or fairings, for that matter) was implicitly assumed to be bolted to the interior walls.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell, at least they\u0027re fixing it for fairings in 1.1.  \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"AbacusWizard","CreatedById":116476,"CreatedDateTime":"2016-01-06T05:32:11Z","Content":"\n\u003Cp\u003E\nBy this point I pretty much think of KIS/KAS as stock anyway, since they\u0027re always the first mods I install whenever a new version comes out.\n\u003C/p\u003E\n"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2016-01-07T12:44:54Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222350237\u0022 data-ipsquote-contentid=\u0022129178\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221452047047\u0022 data-ipsquote-userid=\u0022125662\u0022 data-ipsquote-username=\u0022Snark\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 6/1/2016 at 3:24 AM, Snark said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nRecovery contracts would also get a lot more interesting if the game had more reasonable ways to put things \u003Cu\u003E\u003Cem\u003Einto\u003C/em\u003E\u003C/u\u003E cargo bays.  I\u0027d love a cargo bay which, for example, causes anything physically inside it to be \u0022locked down\u0022 the moment the doors close, so that it\u0027s possible to capture something by maneuvering the cargo bay around it and then closing the doors.  Makes all sorts of things possible.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat\u0027s a good idea. Every thing could be considered automatically struted and centered\n\u003C/p\u003E\n"},{"CreatedByName":"Just Jim","CreatedById":148725,"CreatedDateTime":"2016-01-07T13:05:14Z","Content":"\n\u003Cp\u003E\nI like the idea... I would also like to see multiple rescues in one contract... for instance, a ship with a crew of three had an accident.  Two crew members are now EVA\u0027d in orbit, the third is still on the ship, which is dead in space.  Now retrieve all three, plus the ship.\n\u003C/p\u003E\n"},{"CreatedByName":"monstah","CreatedById":95210,"CreatedDateTime":"2016-01-07T17:25:44Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222347471\u0022 data-ipsquote-contentid=\u0022129178\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221451866289\u0022 data-ipsquote-userid=\u002224430\u0022 data-ipsquote-username=\u0022Temstar\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 04/01/2016 at 10:11 PM, Temstar said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe docking port idea is pretty good, but even if the craft stuck in orbit has a docking port I would never try to dock with it, it\u0027s much easier to just EVA the Kerbal across.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nEver tried rescue missions with EVA Fuel installed? It converts EVA fuel into Monoprop and back again, which means leaving on an EVA drains monoprop resource from the pod. In rescue missions, there\u0027s none! I do them by carefully aligning the ships and jumping the kerbal from one to another (shift \u002B space bar), but if I miss it I have to get \u003Cem\u003Ethe ship to the Kerbal\u003C/em\u003E and not the other way around.\n\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-01-07T20:20:58Z","Content":"\n\u003Cp\u003E\nI want more competition with the opposing program that alternately screws everything up (hence a zillion rescue contracts), and gets things stunningly right (I put guys into orbit, and bam, my opponents are right there, often with more sophisticated parts than I have (since it picks the crewed part at random).\n\u003C/p\u003E\n"},{"CreatedByName":"Gojira1000","CreatedById":152681,"CreatedDateTime":"2016-01-07T20:31:05Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222352051\u0022 data-ipsquote-contentid=\u0022129178\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221452170694\u0022 data-ipsquote-userid=\u0022140055\u0022 data-ipsquote-username=\u0022Warzouz\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, Warzouz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThat\u0027s a good idea. Every thing could be considered automatically struted and centered\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222350237\u0022 data-ipsquote-contentid=\u0022129178\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221452047047\u0022 data-ipsquote-userid=\u0022125662\u0022 data-ipsquote-username=\u0022Snark\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 1/6/2016 at 6:24 PM, Snark said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nRecovery contracts would also get a lot more interesting if the game had more reasonable ways to put things \u003Cu\u003E\u003Cem\u003Einto\u003C/em\u003E\u003C/u\u003E cargo bays.  I\u0027d love a cargo bay which, for example, causes anything physically inside it to be \u0022locked down\u0022 the moment the doors close, so that it\u0027s possible to capture something by maneuvering the cargo bay around it and then closing the doors.  Makes all sorts of things possible.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis - this right here. I\u0027ve built Bond-Villain spaceship grabbers and managed to land with capsules rolling around in a ramp-entry cargo bay. It is Not Fun.\n\u003C/p\u003E\n"},{"CreatedByName":"MaxL_1023","CreatedById":152317,"CreatedDateTime":"2016-01-07T20:44:01Z","Content":"\n\u003Cp\u003E\nI would like to see part replacement missions. Basically, you should be able to use an engineer Kerbal to take a part off your ship in orbit, push it over to another vehicle and install it somewhere. Maybe a Mk I pod lost a parachute due to a micrometeor impact, so you need to bring up a new mk 16, detach it and install it. \n\u003C/p\u003E\n\u003Cp\u003E\nRefueling missions would also make sense, as long as the target has a docking port.\n\u003C/p\u003E\n\u003Cp\u003E\nBasically, rescue missions more sensible than somehow finding a derelict cupola module on a retrograde solar orbit.\n\u003C/p\u003E\n"},{"CreatedByName":"AbacusWizard","CreatedById":116476,"CreatedDateTime":"2016-01-08T00:50:55Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222352296\u0022 data-ipsquote-contentid=\u0022129178\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221452187544\u0022 data-ipsquote-userid=\u002295210\u0022 data-ipsquote-username=\u0022monstah\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, monstah said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nEver tried rescue missions with EVA Fuel installed? It converts EVA fuel into Monoprop and back again, which means leaving on an EVA drains monoprop resource from the pod. In rescue missions, there\u0027s none! I do them by carefully aligning the ships and jumping the kerbal from one to another (shift \u002B space bar), but if I miss it I have to get \u003Cem\u003Ethe ship to the Kerbal\u003C/em\u003E and not the other way around.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat\u0027s very similar to one of the first rescues I did, long before contracts were implemented. I had just accomplished my first crewed Mun landing (hooray!), but the lander was very low on fuel. I tried launching anyway and ran empty long before reaching orbit. I briefly tried the \u0022get out and push\u0022 approach, but it didn\u0027t look like it would work before lithobraking, so I decided to abandon ship. I had the lone kerbalnaut get out, grab all the science data, and use his jetpack to reach a stable orbit... barely. Ran out of jetpack propellant while circularizing.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSo I sent a probe with an empty command capsule to rescue him. I covered the whole thing with ladders and RCS jets and brought plenty of monoprop, taught myself the finer details of orbital rendezvous by reading some of Buzz Aldrin\u0027s writings on the subject, and slowly maneuvered really really close to the poor guy so he could grab the ladders, pull himself inside, and finally go home.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnother time my flagship, the \u003Cem\u003EVoyager I\u003C/em\u003E, was in orbit around Moho and had sent its lander (usually docked inside a cargo bay) down to the surface. The lander was able to take off and re-orbit, but in doing so used up all of its fuel \u003Cem\u003Eand monopropellant\u003C/em\u003E. The \u003Cem\u003EVoyager\u003C/em\u003E had to do all the work of the rendezvous and then maneuver \u003Cem\u003Eitself\u003C/em\u003E so as to make its own cargo bay engulf the lander. Tricky work.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-01-08T00:52:56Z\u0022 title=\u002201/08/2016 12:52  AM\u0022 data-short=\u00228 yr\u0022\u003EJanuary 8, 2016\u003C/time\u003E by AbacusWizard\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Matuchkin","CreatedById":135127,"CreatedDateTime":"2016-01-08T02:12:48Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222347111\u0022 data-ipsquote-contentid=\u0022129178\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221451842674\u0022 data-ipsquote-userid=\u002265692\u0022 data-ipsquote-username=\u0022capran\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 03/01/2016 at 0:37 PM, capran said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n1. Make sure the dead craft has a docking port (and indicate in the mission briefing what type).\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAdd? Certainly. Make sure? Certainly not.\n\u003C/p\u003E\n\u003Cp\u003E\nNot all craft have a docking port in case of any contingency, hoping for the \u003Cem\u003Eextremely\u003C/em\u003E unlikely event (real-life wise) of a hero launching to save them. The rescued crafts should have a \u003Cem\u003Echance \u003C/em\u003Eof having a docking port- some will, some won\u0027t.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, I would recommend another vital point:\n\u003C/p\u003E\n\u003Cp\u003E\n5. The certainty about the state of the mission target craft should vary.\n\u003C/p\u003E\n\u003Cp\u003E\n5 a) Some missions would be the ordinary bring-crew-back rescue flights.\n\u003C/p\u003E\n\u003Cp\u003E\n5 b) Other mission briefings will be somewhat uncertain about the craft\u0027s condition.\n\u003C/p\u003E\n\u003Cp\u003E\n5 c) In other missions, the rescuer will not know anything about the craft\u0027s conditions. The mission, in this case, will be a mission in which the player searches for \u003Cem\u003Eany debris or remains\u003C/em\u003E of the ship and/or crew. If he gets to the debris, he wins. Bonus points are rewarded for the retrieval of a few pieces of the ship or the frozen/ scorched corpses of the crew members. If the crew are not found alive/dead, money is obtained anyway (the mission\u0027s objective is to search for remains, not save the crew.\n\u003C/p\u003E\n\u003Cp\u003E\n6 d) There will be several contracts in which absolutely nothing is known about the target ship- its location, its crew status, whether it even \u003Cem\u003Eexists as a ship\u003C/em\u003E anymore. The player, at this point, would use long range antennae to find the ship, searching through any planet\u0027s SOI (or interplanetary space). The ship may be found deserted, the crew may be found whole, separated or missing (dead or alive). Otherwise, the only found remnants of the ship may just consist of pieces of scrap.\n\u003C/p\u003E\n\u003Cp\u003E\nNote: On each of the missions, crew reports from rescuing astronauts near the ship will just be about the ship\u0027s status and the crew\u0027s status. On the last two mission types, the crew report will include whether the ship or the crew is missing.\n\u003C/p\u003E\n"}]}