{"TopicId":129196,"ForumId":39,"TopicTitle":"Uncharted Past: A Brief History of Kerbin in Uncharted Lands","CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2016-01-03T22:54:45Z","PageNum":1,"Articles":[{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2016-01-03T22:54:45Z","Content":"\n\u003Cp\u003E\n\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/120111-105kopernicus-uncharted-lands-v02-13dec15-beta-believe-it/\u0026amp;page=1\u0022\u003EUncharted Lands\u003C/a\u003E is a planet pack for Kopernicus plugin, created by KillAshley, that remakes the Kerbol Solar System. It uses no heightmaps or color maps that are not procedurally generated with KSP\u0027s own procedural PQS system. It\u0027s quite cool.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWhat follows is a brief history of Kerbin in the uncharted lands universe.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nA very very long time ago, about one thousand years before the Kerbal Space Program was founded, a woman named Bohr was walking along the beaches of what is now northern Alaitsua. She had a very interesting idea regarding the blue-green rock that had very recently fallen out of the sky. She looked up at the rather wide ring arching across the southern sky. It too was blue-green, and more or less the exact same color. She told her friends about it, and one of them (named Chaffe the Explorer) mentioned the idea in his book of philosophy. The idea was this: Minmus, The Sky Arch, and the mineral known as Chondritum are all made from the same materials. No one had any proof of this, but the idea made a sort of logical sense, so the readers of the book rather liked the idea.\n\u003C/p\u003E\n\u003Cp\u003E\nOnly a few years later, many natural philosophers were captivated by the Sky Arch, ever since Chaffe The Explorer\u0027s \u0022The Study of The Skies\u0022 made them realize that it could be a physical object. They performed experiments and discovered several fascinating conclusions about the nature of the Kerbin system. They were \u003Ca href=\u0022https://youtu.be/CItDiuBWP5I?t=6m39s\u0022 rel=\u0022external nofollow\u0022\u003Eable to figure out that\u003C/a\u003E:\n\u003C/p\u003E\n\u003Col\u003E\u003Cli\u003E\nKerbin, Mun, and Dres are spherical.\n\u003C/li\u003E\n\u003Cli\u003E\nThe distance between Kerbin, Minmus, Mun, and Dres.\n\u003C/li\u003E\n\u003Cli\u003E\nThe fact that Kerbin orbits the Sun along with all of the planets.\n\u003C/li\u003E\n\u003Cli\u003E\nThe relative brightness of stars.\n\u003C/li\u003E\n\u003Cli\u003E\nThe distance to the stars.\n\u003C/li\u003E\n\u003C/ol\u003E\u003Cp\u003E\nThese discoveries were made using only the naked Kerbal eye, and simple geometry.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nUnfortunately, only 50 years after these discoveries were made, they were lost when anti-science barbarians burned down The Library of Kriman. Unfortunately, the burning down of The Library coincided with the fall of the Bealean empire, setting into course a 700 year long dark age.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAbout two hundred years before the first launch of the Kerbal Space Program, an astronomer pointed a new device at the sky. This device was built to look at distant ships, but could just as easily be used to look at the skies. This instrument was the Telescope. The inventor of the sky-telescope was named Zephram Kerman. Using the telescope, he produced detailed drawings on Minmus and Dres, and updated many of the low-detail maps of the Mun. He rediscovered the principles of astronomy, a series of books written about the sky arch. He made the first observation that the arch was very similar to a ring, and in his writings called the sky arch \u0022Kerbin\u0027s Ring.\u0022 His book was so amazing they named an entire sea after him.\n\u003C/p\u003E\n\u003Cp\u003E\nAbout a hundred years before the skies roared with the sound of the first sounding rocket to be shot away from the ground at the Kerbal Space Center, during the age of steam, the spectrometer was invented. A rather simple invention really, you would expect it to be invented far earlier. Using this instrument it was possible to find out that, incredibly, The Rings, Minmus, and the mineral known as Chondritum were made from the same substance.\n\u003C/p\u003E\n\u003Cp\u003E\nAbout 40, the civilized nations of the planet, North Bealeland, South Bealeland, The United States Of Alaitsua, the Boronto Provinces, and the Ussaric Union were getting quite mad at each other. They had all been stocking up one weapons, and it wasn\u0027t too long before a fight broke out. Once the war started, other countries got pulled into the war until much of the world was fighting this war.\n\u003C/p\u003E\n\u003Cp\u003E\nThe side known as The Good Guys was made up of the following nations:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nThe United States of Alaitsua\n\u003C/li\u003E\n\u003Cli\u003E\nSouth Bealeland\n\u003C/li\u003E\n\u003Cli\u003E\nSouth Peepo\n\u003C/li\u003E\n\u003Cli\u003E\nJungloid and Tundrunics National Territories\n\u003C/li\u003E\n\u003Cli\u003E\nCerimas\n\u003C/li\u003E\n\u003Cli\u003E\nB*lg**m (sorry to moderators if that\u0027s trying to get around \u003Ca href=\u0022http://hitchhikers.wikia.com/wiki/Belgium\u0022 rel=\u0022external nofollow\u0022\u003Ethe curse list)\u003C/a\u003E\n\u003C/li\u003E\n\u003Cli\u003E\nVance\n\u003C/li\u003E\n\u003Cli\u003E\nVaine\n\u003C/li\u003E\n\u003Cli\u003E\nThe Conglomerate of the Monarchy\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nThe side known as \u0022Come On Guys, You had to take THAT NAMe?\u0022 or COGYTHATNAM was made up of the following nations:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nCurpelsfractasodaless Union of Greater Ussarri\n\u003C/li\u003E\n\u003Cli\u003E\nUssarric Union\n\u003C/li\u003E\n\u003Cli\u003E\nVerminy\n\u003C/li\u003E\n\u003Cli\u003E\nOmork\n\u003C/li\u003E\n\u003Cli\u003E\nVaustria\n\u003C/li\u003E\n\u003Cli\u003E\nWest Boronto\n\u003C/li\u003E\n\u003Cli\u003E\nKazfin\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nThe COGYTHATNAM very nearly won the war, but when The United States of Alaitsua finally joined the fight officially, The Good Guys won. A treaty was drawn which significantly redrew the maps. Boronto was unified, Bealeland and Peepo were split, The Ussaric Union and the Curepelsfractasodaless Union of Greater Usarri reluctantly decided to change the spelling of their \u0022Ussarri\u0022, and Cerimas ceased being a monarchy. Not too long after the war, the nations of Kerbin almost universally decided that the whole thing was Verminy\u0027s fault and stopped trading with them. Verminy\u0027s economy began to fail. 20 years after the ceasefire of the first Kerbin War, the second Kerbin War began, with the same sides more or less. Verminy tried to take over Kerbin, and failed because the leader was not very charismatic and kept trying to kill everyone who worshiped Minmus. The end of the war began a new era of peaceful co-operation in the world. Except that the United States Of Alaitsua and the Curpelsfractasodaless Union of Greater Usarri were still made at each other. 10 years later, they were officially in a not-really-war called a \u0022cold war\u0022 and the nations of Vallator united into the Vallaton Union.\n\u003C/p\u003E\n\u003Cp\u003E\nDuring this cold war, a rocket scientist from the Verman military moved to Alaitsua and brought his rocket technology with him. His name was Wernher von Kerman, and he was very happy to stop dropping bombs on people with rockets and start shooting rockets into space. Unfortunately for him and his team, the Alaitsuan army recruited Wernher von Kerman for missile development against Greater Usarri.\n\u003C/p\u003E\n\u003Cp\u003E\nAfter a few years of development, the Kerbal Space Program was founded to explore space using missile technology. Usarri and Alaitua were now in a space race. But that\u0027s another story. (which may or may not end up being told)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEDIT: Forgot to post the final world map.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://i.imgur.com/1Hsgd5Y.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u00221Hsgd5Y.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/1Hsgd5Y.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-01-04T18:34:28Z\u0022 title=\u002201/04/2016 06:34  PM\u0022 data-short=\u00228 yr\u0022\u003EJanuary 4, 2016\u003C/time\u003E by GregroxMun\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"0111narwhalz","CreatedById":110660,"CreatedDateTime":"2016-01-04T11:44:03Z","Content":"\n\u003Cp\u003E\nThat world map looks somehow... wrong. Not sure what it is about it, apart from the fact that there\u0027s literally \u003Ci\u003Enothing at all\u003C/i\u003E recognisable as Kerbin. I can only assume this is your \u0022Aelternis Kerbol\u0022 thing you\u0027ve been working on? Didn\u0027t realise that involved rings and complete reworks of the terrain. Where are you putting the KSC?\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway, all that aside, I like the story, though I\u0027m a bit concerned about that one nation whose name includes a lot of asterisks. Seems to run a bit too close of a parallel to the history of ol\u0027 Terra here as well. Whatevs, looking good so far.\n\u003C/p\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2016-01-04T18:34:38Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222347936\u0022 data-ipsquote-contentid=\u0022129196\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221451907843\u0022 data-ipsquote-userid=\u0022110660\u0022 data-ipsquote-username=\u00220111narwhalz\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, 0111narwhalz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThat world map looks somehow... wrong. Not sure what it is about it, apart from the fact that there\u0027s literally \u003Ci\u003Enothing at all\u003C/i\u003E recognisable as Kerbin. I can only assume this is your \u0022Aelternis Kerbol\u0022 thing you\u0027ve been working on? Didn\u0027t realise that involved rings and complete reworks of the terrain. Where are you putting the KSC?\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway, all that aside, I like the story, though I\u0027m a bit concerned about that one nation whose name includes a lot of asterisks. Seems to run a bit too close of a parallel to the history of ol\u0027 Terra here as well. Whatevs, looking good so far.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNothing to do with Alternis Kerbol. I wrote in the OP that it is a mod called uncharted lands. I did not make the mod, KillAshley did. There\u0027s a link at the very top. KSC is in The United States of Alaitsua.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnd I\u0027ll let you in on a little secret: In every galaxy there is at least one species of sapient creature who does not know the true, dastardly, terrible meaning of the word B*lg**m.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022color:#FFFFFF;\u0022\u003EIt\u0027s a reference to The Hitchhiker\u0027s Guide to the Galaxy. The word is Belgium.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-01-04T18:38:44Z\u0022 title=\u002201/04/2016 06:38  PM\u0022 data-short=\u00228 yr\u0022\u003EJanuary 4, 2016\u003C/time\u003E by GregroxMun\u003C/strong\u003E\n\u003C/span\u003E\n"}]}