{"TopicId":129326,"ForumId":51,"TopicTitle":"Through the Prism - Chapter 4 - Louder than Words","CreatedByName":"Torgo","CreatedById":149873,"CreatedDateTime":"2016-01-05T18:16:33Z","PageNum":1,"Articles":[{"CreatedByName":"Torgo","CreatedById":149873,"CreatedDateTime":"2016-01-05T18:16:33Z","Content":"\n\u003Cp\u003E\nThe first chapter of this play through doesn\u0027t have much in the way of screenshots, and the Prelude isn\u0027t technically a mission as much as it is just an attempt to set the stage and develop some atmosphere to hopefully bring some context to the mission reports to follow.  And editing this thing for format is a huge waste of time.... \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:verdana, geneva, sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cu\u003E\u003Cstrong\u003EPrelude - Echoes\u003C/strong\u003E\u003C/u\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:\u0027courier new\u0027, courier, monospace;\u0022\u003E\u003Cem\u003EHelios III base – Moon, December, 2067\u003C/em\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n“Corporate, please repeat. How long do you say we have?”\n\u003C/p\u003E\n\u003Cp\u003E\n“Helios III, I repeat, between 14 and 15 hours until SME impact.”\n\u003C/p\u003E\n\u003Cp\u003E\n“There hasn’t been a report like that since Carrington back in 1859. Are you sure?”\n\u003C/p\u003E\n\u003Cp\u003E\n“Checked, re-checked and checked again, Floyd. This is a real fast mover, and larger than anything recorded since we’ve been able to determine the sizes.”\n\u003C/p\u003E\n\u003Cp\u003E\n“We’re currently on the light side of the Moon, what’s the prognosis on our tech here?”\n\u003C/p\u003E\n\u003Cp\u003E\n“Tech branch predicts 95% chance of total loss. The electronics are hard, but not THAT hard. Helios I and II are currently on the dark side, and Tech estimates that they should survive intact. Helios IV just went past the terminator, and Tech can’t accurately predict impact effects there at this time.”\n\u003C/p\u003E\n\u003Cp\u003E\n“Looks like we’re going to have to evac. Any word on an expedited shutdown process for us? I guess you guys figured we’d never shut down these bases.”\n\u003C/p\u003E\n\u003Cp\u003E\n“We’re working on that, Dave. Right now, concentrate on uploading as much as you can to the high-gain, and get your gear loaded into the Andromeda. You’ll need at least 2 hours to make it around to Helios II. The team there is already making some space for you.”\n\u003C/p\u003E\n\u003Cp\u003E\n“Copy, Corporate. Data transmission is the priority, we’ll budget 11 hours for shutdown and 3 hours for transport to Helios II. We’ll check back with you in 3 hours.”\n\u003C/p\u003E\n\u003Cp\u003E\n“Roger, Helios III. Next comm in 3 hours. Good luck up there. Corporate out.”\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022line-height:1.6;\u0022\u003ESince humans first made observations of the sky, solar eclipses have been moments of awe and terror. As science progressed to show the celestial mechanics involved, and not the actions of a deity, the terror aspects of an eclipse faded. That is, until the eclipse of October 14, 2023.\u003C/span\u003E\n\u003C/p\u003E\n\u003Ctable align=\u0022left\u0022 border=\u00222\u0022 cellpadding=\u00222\u0022 cellspacing=\u00223\u0022 style=\u0022width:1500px;\u0022\u003E\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd\u003E\n\u003Cimg alt=\u0022SvH1SUG.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/SvH1SUG.png\u0022\u003E\u003C/td\u003E\n\u003Ctd\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Carrington_Richard_sunspots_1859.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022https://upload.wikimedia.org/wikipedia/commons/e/e5/Carrington_Richard_sunspots_1859.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003ESunspots of September 1, 1859, as sketched by Richard Carrington. \u003C/em\u003E\u003Cbr\u003E\u003Cem style=\u0022line-height:1.6;\u0022\u003EA and B mark the initial positions of an intensely bright event, which\u003Cbr\u003E\nmoved over the course of five minutes to C and D before disappearing.\u003C/em\u003E\n\u003C/p\u003E\n\u003C/td\u003E\n\u003Ctd\u003E\n\u003Cimg alt=\u0022Xd0v0sF.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/Xd0v0sF.png\u0022\u003E\u003C/td\u003E\n\u003C/tr\u003E\u003C/tbody\u003E\u003C/table\u003E\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\u003Cspan style=\u0022line-height:1.6;\u0022\u003EIt was PostCo that perfected the new fusion power reactor that promised to provide all the energy the world would ever need. In just 10 years, a small band of scientists, engineers and one very enterprising CEO had taken the business from a fringe startup to nearly trillion dollar status. The Helios project was a series of six potential mining sites on the Moon, constructed to automate the process of mining, harvesting and delivering Helium-3 to fusion reactors being built on the Earth. Four bases were already in place with two more nearing launch. No other corporation was even close to launching a human to the Moon. \u003C/span\u003ETechnically, it wasn’t the eclipse that caused the issues, but the large Solar Mass Ejection that coincidentally impacted the Earth at the same time. While most of the military’s assets were hardened and mostly able to survive, the older commercial and GPS satellites had their circuitry overloaded and destroyed. Most of the power grid on Earth was impacted, and up to 95% of the planet was without electricity for the first week after the event.\n\u003C/p\u003E\n\u003Cp\u003E\nThe people of the time said the impact had set technology back between 50 and 100 years. Many governments fell and several countries banded together to provide basic services, but it was the corporations that drove the rebuild. There were nine major corporations now, and PostCo, sponsor of the Helios missions, was the newest of them.\n\u003C/p\u003E\n\u003Cp\u003E\nEven now, though nearly 50 years after the devastating solar storm, repercussions were still being felt. Satellites were still being replaced. Great effort was being put into hardening communication and power systems in an attempt to mitigate negative effects of future events. Communications satellites and GPS were the first craft replaced. Smaller harvester drones were also developed to find, attach to and de-orbit the failed equipment still in orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nA Helios base is designed to accommodate a crew of seven people, but only three people are needed before full operations begin. Dave Plowman was assigned the archaic title of mission commander, when he was really nothing more than a pilot and glorified middle manager at a branch office about 240,000 miles away from headquarters. Calling him a pilot was almost a stretch, as the computer did most of that work. Floyd Schmitt, great-grandson of Apollo XVII astronaut and geologist Harrison Schmitt, was the scientist responsible for analyzing the data being gathered at Helios III. \u003Cbr\u003E\n“If we shelter the scrapers and sifters, there’s a better chance they’ll survive. I should be able to get most of them in the garage before we need to go.” Sydney Barrat, engineer of the Helios III site, didn’t ‘drive’ the machines in the conventional sense, or even by remote control. It mostly amounted to sequencing events and allowing the central computer to orchestrate the individual movements, and Sydney had been a major player in the design of the system. If she remote controlled individual trucks, she could move them faster than the computer would, but she’d only be able to move one at a time. The pressurized mechanical bay would serve as a quasi-Faraday cage for those machines she could move in before the storm arrived. \u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:\u0027courier new\u0027, courier, monospace;\u0022\u003E\u003Cem\u003ETo be continued...\u003C/em\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-03-25T22:47:26Z\u0022 title=\u002203/25/2016 10:47  PM\u0022 data-short=\u00228 yr\u0022\u003EMarch 25, 2016\u003C/time\u003E by Torgo\u003C/strong\u003E\n\u003Cbr\u003Eformatting :(\n\u003C/span\u003E\n"},{"CreatedByName":"Torgo","CreatedById":149873,"CreatedDateTime":"2016-01-05T18:42:57Z","Content":"\n\u003Cp\u003E\nPrelude continued - will add a couple pics in later....\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAndromeda class crew transfer vehicles weren’t designed with sub-orbital trips around the Moon in mind. They would launch from the Earth and travel to the Moon in just under three days, and touchdown at a Helios site. Then, when it was time to return, the vehicle was designed to launch directly into a return trajectory, travel nearly three days back to earth, then separate the crew capsule for a standard unpowered descent while the rest of the vehicle burned up upon re-entry. The only function the pilot had was to confirm things were correct, and then press the occasional button. Truth was, though, that they only got to push buttons to keep them from feeling completely useless. They weren’t needed for any task outside of keeping the scientists and engineers from knowing their lives were all in the hands of a few thousand lines of computer code. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\nAs the three hour mark approached, the three humans of Helios III met in the conference room and established a connection back to Corporate. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n“We’ve got bad news and worse new, Helios III. Bad news is that either the SME is accelerating, or NASA isn’t getting good readings. The new estimate is that the flare is only 8 hours away. It will be tough to learn much more, because STEREO IV just got hit by the storm, and all contact has been lost. NASA won’t verify if they were destroyed, or if the storm is blocking communications.”\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n“That’s the worse news?” Floyd asked.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n“No, somehow, news of the storm got out, and things just went way south down here. Riots, panic, looting and general mayhem. Systems are already going down here. The military has been called in and things only look to get uglier. There are still plenty of people down here who remember how bad things got in \u002723.”\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n“So being face to face with this storm might be a safer bet than being back home” chirped Dave. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\nSydney asked “Are our families safe? Was Corporate able to bring them in?”\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n“Yes. All of your immediate families are here at headquarters. Custodial is dusting out the bomb shelter now. Nice to know someone was thinking ahead when they designed this place. How are preparations for your departure going up there?”\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\nFloyd responded. “The data has been uploaded and transmission is about to start. We’ve got backups loaded in the Andromeda, and another set ready to go out in the shed. Sydney was able to program the bots to get themselves back in the shed, and we thought they’d all be put away in time, but with this new estimate, we may lose some.” \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n“Leave the bots. We can replace them easily enough. Let’s worry about getting you out of there now. How goes the reprogramming?”\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n“It doesn’t. Haven’t even started on it yet. Is it even possible?” asked Floyd.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe feed was silent for what seemed an eternity, the figure on the screen standing as still as a statue. “This is PostCo. EVERYTHING is possible!”\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\nDave cocked an eye at Floyd “You set yourself up for that one, and if Lars down at Corporate hadn’t said it, I was going to.”\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n“The end of the world isn’t the best time for jokes, you two!” retorted Floyd.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n“Truth is,” said Lars over the video link, “There isn’t anyone in now from the programming team, and the knowledge base never accounted for off-book use of an Andromeda. I’m not sure we’ll be able to pull it off. We can, though. Get a launch window that will send you behind the Moon for at least 20 minutes before you start on your way back to Earth. Of course, coming to get you might not be easy. We’re anticipating total loss of tracking and communications for at least two weeks down here. We’ve got supplies laid in for three months.”\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n“When do we launch?” asked Dave.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n“I’m having the data sent up now. You should be ready to go in three hours. The trick will be timing the launch to get you behind the Moon at the right time, and our best guess right now is really just a guess.”\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\nDave chimed in “We’ve got front row seats to this thing, but it’s coming right at us. Radar isn’t giving a very good reading since it’s not a solid. The laser rangefinder is giving me confusing readings, but it really isn’t meant for this range or non-solids.”\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\nSydney asked “Can you reconfigure the launch to keep us behind the moon longer?”\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\nLars replied “We can, but that changes your departure time, and since you’ll be further above the surface, you may not be as protected up there.”\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n“What kind of change to the departure time?” asked Floyd. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n“I just got the latest update from the computer. We can slow your return rate, which will have you moving slower. It will take just about four days to get back. Chances are, though, we won’t have assets available to pick you up even if we do know where you come down. You’ll leave in four hours.”\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n“That would put the flare still four hours away, though. We’d be away from the Moon by then”\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n“Not”, said Sydney, “if we’re still in orbit. We can keep the computer from doing the trans-earth injection until we’re ready. We’ll still be pretty exposed for about 60 percent of the time, but if we can get the timing right, we can be protected as the flare passes, then head back to Earth when the coast is clear.”\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n“How are we going to do that?” asked Dave.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n“All of Corporate’s systems run on the same code base. The Andromeda’s systems aren’t far removed from the bots out there. I’m already in there and should have it fixed for us in about…. Now!”\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n“Corporate, we’re going to start packing the Andromeda now,” said Dave, “I’m not sure how much we’ll be able to cram in there, but we’ll make sure there isn’t much more room in there than we need for ourselves. We’ll try to get comms established after we launch. You guys be safe down there. We’ll see you soon.”\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n“Roger, Helios III. Good luck. Corporate out.”\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n“Floyd, can the systems on the Andromeda get any readings on the flare for us?” asked Dave. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n“Readings, yes. Useful readings, I don’t know. I doubt it given the base systems aren’t doing much, but if I can get some distance readings, even fuzzy, after each orbit, I might be able to work out a range we can use.”\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n“That sounds better than no chance,” said Sydney “and I’ve gotten you manual burn control, Dave. I’d never looked too deep at this code before, but a glance shows me that the computer had pretty much total control over ship. I’m betting that ‘soft as a baby’s butt’ landing we had here wasn’t your doing after all.” \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n“We’ll talk about that later,” said Dave “Let’s get suited up and get out of here.”\n\u003C/p\u003E\n"},{"CreatedByName":"Torgo","CreatedById":149873,"CreatedDateTime":"2016-01-06T04:03:23Z","Content":"\n\u003Cp\u003E\nPrelude Part III - one last giant wall of text before the missiony goodness starts flowing. \n\u003C/p\u003E\n\u003Cp\u003E\n“Let’s figure we’ve got 7 hours til the flare gets here. It’s going to take about an hour to get suited up. Have we even started checked the fuel level in that tin can yet? Is it ready or do we need to get that going?” asked Floyd. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n“First thing I did, even before getting the bots started. Should be ready to go in less than 2 hours.” said Sydney. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe crew started getting their suits on. Time, which usually ran slower during the tedious process, was unusually fast today. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n“What’s with the extra boxes. Floyd?” asked Dave.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n“We won’t be needing food here on the station, so I grabbed extra in case were out in the bush longer than expected. That, and I had to grab my old Kerbfleet comic books. I’m not leaving those behind!”\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n“That paper means extra weight on the …” started Dave.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\nFloyd cut him off “I left some socks and underwear behind. Don’t worry, my carry-on bag fits in the little bin, boss. Besides, after all the electronics get fried, my paper will still work. I hope you really like The Static Channel. It’s going to be in reruns for a while.”\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n“I’m starting to think getting cooked by this flare would be better than being cooped up in a can with you two.” chimed in Sydney. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n“If we don’t time this right, you get both” said Dave. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\nAs the last minutes of their countdown dwindled rapidly away, the trio trudged out to the landing pad to their ship. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt took a small amount of teamwork to load the extra boxes into the Andromeda and get them stowed. The crew decided to not pressurize the capsule immediately, feeling they’d be safer in their EVA suits should life support be compromised. If they made it, they’d be able to pressurize the cabin, or at least hook the suits up to shipboard life support. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n“I’ve got the modifications in place to allow us to stay in orbit” Sydney informed the others. “I also programmed in eight possibilities for TEI burn. You’ll be able to activate any of the first seven up to 20 seconds before they occur. The eighth fires automatically assuming there’s still a computer left to fire it.” \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\nWith a minute left in their countdown, Dave ran through final checks on the Andromeda. Everything looked correct and he hit the final arming button on the console. Now they had to just sit back and relax… as if that was even remotely possible. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe computer’s monotone voice started annunciating the countdown at ten seconds. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n“If we live, Sydney, can you re-program this thing to not sound like a tin can?”\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n“I’m sorry Dave, I’m afraid I can’t do that. unH!” she shot back, the rockets firing just as she got to the period in her sentence. The Andromeda rose from the pad, as nimbly as a squat can of fuel over a nozzle could rise (which, given the lack of atmosphere, was actually pretty nimble).\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\nTheir ascent burn continued as the craft went horizontal, circularizing into an orbit about 110 kilometers above the surface. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\nLooking out the window, Floyd asked “Aren’t we a little too high up to be protected?”\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\nDave responded “We don’t know how high too high is. There’s a chance that everything is too high. I don’t think anyone has ever studied how a flare would wrap around to the dark side… heh heh… looks like I’ll be taking you to the dark side of the moon, Floyd.” \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n“Did that just come to you, or have you been saving that one?” a pinkening Floyd muttered.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n“I owed you that one, smartass!” replied Dave. “Now, can you get the gear ready to see if we can try to eyeball this storm? I want the best information we can get so we can time our TEI right.”\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\nTheir orbit continued, and Earth rose almost directly in front of them, they looked down at a partially cloud covered South America.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n“Looks like there’s going to be a big light show tonight. You know if people in Ecuador are seeing the aurora again, it’s been a pretty crappy day,” said Floyd. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n“I can’t even imagine what it’s going to be like when we get home,” said Sydney. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n“I appreciate you being positive about this, Syd,“ Dave said. “We’ll cross that bridge when we come to it. Floyd packed enough for us to last almost two months if we tighten our rations. I just hope we land someplace that isn’t a thousand miles out to sea.”\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\nAs they came around from behind the night side, Floyd activated the radar and the video, hoping to get some readings on the approaching storm that they couldn’t see with their eyes. “No good readings so far, but we can look at the video and filter it down. I can’t be sure, but it certainly seems brighter now. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnother two hour orbit passed. On the video, they could see traces of the approaching storm, but they couldn’t well estimate just how fast it was moving or how far it was away from them. Radar proved useless in providing information they could use. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n“It’s possible another orbit has us very exposed. What do you say we chance it and burn for home at the next window? It will keep us protected, I think, the longest,” asked Dave. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n“If we lose systems after the burn, will we be able to manually separate the landing pod?” asked Floyd.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n“There are manual explosive bolts, so we should be able to do that, assuming they don’t get fried,” replied Dave. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\nAs the three continued their discussion about the pros and cons of leaving for Earth the next opportunity, they didn’t realize just how little time they had left. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n“One minute left for this chance,” Sydney announced. “I say we go for it. If we get hit and can’t burn, I don’t want to spend the rest of my time circling around aimlessly. I at least want to have a chance to get back.”\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n“I’m with her. Let’s get going and hope for the best, or at least the least worst,” added Floyd.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n“It’s settled,” said Dave. “We’re heading home.” Dave let the computer know that it was time, and about 40 seconds later, the rockets kicked back to life.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt wasn’t more than a few seconds after the burn, when everything turned the brightest white any of them had ever encountered. And then, just like that, it had never been more black. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"Torgo","CreatedById":149873,"CreatedDateTime":"2016-01-13T19:14:07Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:\u0027courier new\u0027, courier, monospace;\u0022\u003EOn to Chapter 1, with some images to come as soon as my PC decides to be cooperative again....\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003EChapter 1 – Point Me at the Sky\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n“My fellow Kerbs, today marks a turning point in the story of our existence.”\n\u003C/p\u003E\n\u003Cp\u003E\nWhen the Overkerb makes a speech on the viewscreen, a kerb’s life comes to a temporary halt to hear the message.\n\u003C/p\u003E\n\u003Cp\u003E\n“I speak to you today from this swamp, to introduce the kerbs and the place that will define our history as we enter this new age. A new age where we break free from the tyranny of gravity, if only for a little while, and begin to explore the universe around us.”\u003Cbr\u003E\u003Cimg alt=\u0022Ikd4irw.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/Ikd4irw.png\u0022\u003E\u003Cbr\u003E\u003Cem\u003E\u003Cspan style=\u0022font-size:11px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027courier new\u0027, courier, monospace;\u0022\u003EA view of the launchpad constructed where Jebediah\u0027s Junkyard had been.\u003C/span\u003E\u003C/span\u003E\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nWhen the Overkerb is making that speech to the world from that kerb’s back yard, his life will never be the same.\n\u003C/p\u003E\n\u003Cp\u003E\n“Today, I open the Kerbin Space Center. Here, our best scientists and engineers will develop the technology that will usher in a golden age of exploration.”\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022bov58Gt.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/bov58Gt.png\u0022\u003E\u003Cbr\u003E\u003Cem\u003E\u003Cspan style=\u0022font-size:11px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027courier new\u0027, courier, monospace;\u0022\u003EThe palatial new administrative headquarters of the space program.\u003C/span\u003E\u003C/span\u003E\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIt had been nearly three years since the last time the Overkerb had made any sort of speech. His will was carried out by low level managers and functionaries, none of whom had ever met him directly. There were only a handful of kerbs who could make that claim.\n\u003C/p\u003E\n\u003Cp\u003E\n“I present Wernher Kerman, who will act as director of this facility on my behalf. He will report directly to me and be solely responsible for the success of our new mission.”\n\u003C/p\u003E\n\u003Cp\u003E\nWernher was both a top scientist and engineer, a true renaissance kerb if there ever was one. He had been the kerb who singlehandedly solved the snack crisis of ’37.\n\u003C/p\u003E\n\u003Cp\u003E\n“Thank you, Overkerb. I am humbled and honored to be chosen for this new endeavor. Fellow kerbs, we have had a breakthrough that has allowed us to develop new concepts and technologies which will allow us to reach into the sky and into space beyond it. We will be able to send kerbs to the Mun. We will be able to live and work in space. We will send probes to the other planets in the system. We will study Kerbol itself. We will place new tools for communications, called satellites, into orbit around Kerbin which will allow all of us to communicate instantly with anyone else anywhere on the planet. We will map the planet and discover new resources. \u003Cspan\u003E \u003C/span\u003EThis will be a day that all kerbs will remember forever. And now, I would like to introduce the first 5 kerbs who will pioneer this effort.”\u003Cbr\u003E\u003Cimg alt=\u0022J68fYlu.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/J68fYlu.png\u0022\u003E\u003Cbr\u003E\u003Cem\u003E\u003Cspan style=\u0022font-size:11px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027courier new\u0027, courier, monospace;\u0022\u003EWernher introduces the first five Kerbonauts as the Overkerb looks on from the viewscreen.\u003C/span\u003E\u003C/span\u003E\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nJebediah could hardly contain himself. His swamp had been selected as the site of the new space center. Minions of the Overkerb and Wernher were pouring over every scrap of metal and plastic in his junkyard, taking whatever they thought would be useful.\n\u003C/p\u003E\n\u003Cp\u003E\nJebediah had been hand selected by Wernher’s team as the first ‘pilot’, who would be strapped inside what looked like an oversize snack tin that was glued to a mulch can full of explosives.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022gnPug3N.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/gnPug3N.png\u0022\u003E\u003Cbr\u003E\u003Cem\u003E\u003Cspan style=\u0022font-size:11px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027courier new\u0027, courier, monospace;\u0022\u003EThe new home for Astrokerbs at the space center.\u003C/span\u003E\u003C/span\u003E\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nNo kerb had ever been higher off the ground than they could jump. The prospect of flight had been, until the Overkerb’s speech, a completely alien concept. The only law higher than the Overkerb was the Law of Gravity, and now the Overkerb and Wernher were telling them even that law could be overcome. \u003Cspan\u003E \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAnd as Wernher droned on to the whole of Kerbanity about the new space center, Jeb’s mind wandered to the adventure awaiting him. It wandered so far, he didn’t hear Wernher introduce him.\n\u003C/p\u003E\n\u003Cp\u003E\n“Jeb, what are you doing, get up there!” Valentina whispered in his ear as she pushed him towards the stairs up onto the stage that had been their back porch as recently as this morning. Sister of Jebediah, Valentina had also been selected as a pilot in the new space program.\n\u003C/p\u003E\n\u003Cp\u003E\nJeb smiled and looked at the throng of excited kerbs as he walked out towards Wernher and the Overkerb at the podium. Six short hours ago, he was no one. Now he stood just feet from the televised image of the leader of the planet.\u003Cbr\u003E\u003Cimg alt=\u0022EVGX53u.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/EVGX53u.png\u0022\u003E\u003Cbr\u003E\u003Cem\u003E\u003Cspan style=\u0022font-size:11px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027courier new\u0027, courier, monospace;\u0022\u003EKerbs not smart enough to build ships will be \u003Cs\u003Eimprisoned\u003C/s\u003E working here to unlock new technologies.\u003C/span\u003E\u003C/span\u003E\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAs Jeb took his place standing next to Wernher, he heard his sister introduced. Valentina bounded up the stairs and took her place next to her brother.\n\u003C/p\u003E\n\u003Cp\u003E\nWernher then introduced the remaining three members of the initial class of ‘astronauts’. Another pilot, Sebastien, lead scientist Bob and lead engineer Bill.\n\u003C/p\u003E\n\u003Cp\u003E\nAll took their place on the stage, flanking Wernher and the Overkerb\u0027s image. The construction of several new buildings taking place behind them in what had just been a swamp.\u003Cbr\u003E\u003Cimg alt=\u0022P6zoTqb.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/P6zoTqb.png\u0022\u003E\u003Cbr\u003E\u003Cfont face=\u0022courier new, courier, monospace\u0022\u003E\u003Cspan style=\u0022font-size:11px;line-height:17.6px;\u0022\u003E\u003Ci\u003EThe least busiest building in the new compound, as there is nothing in the sky yet in need of tracking.\u003C/i\u003E\u003C/span\u003E\u003C/font\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n“Kerbs, in just 7 days, we will introduce the first piece of our new space program, the capsule that will be used to send a kerbal into the air and land him safely. That first flight will take place no more than 14 days from today. We will begin looking for the best and brightest around the planet to create the second wave of astronauts, and to also staff the construction, research and administration roles needed to drive us onward and upward. With this new science, everything will be possible.”\n\u003C/p\u003E\n\u003Cp\u003E\n“Thank you Wernher,\u0022 said the Overkerb. “May you always have more snacks than you need. Fellow kerbs, to mark this momentous occasion, we are throwing away the old calendar and starting new. Today is Day 1 of Year 1 of the Golden Age of Kerbin. The universe is now at our doorstep.”\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E\u003Cspan style=\u0022font-size:11px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027courier new\u0027, courier, monospace;\u0022\u003EThe new Astrokerb First Class trading card set:\u003Cbr\u003E\u003Cimg alt=\u0022Se9vX8E.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/Se9vX8E.png\u0022\u003E \u003Cimg alt=\u0022HqQtmZj.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/HqQtmZj.png\u0022\u003E \u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022PvONmxt.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/PvONmxt.png\u0022\u003E \u003Cimg alt=\u0022si5VVSs.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/si5VVSs.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u002215R7e3v.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/15R7e3v.png\u0022\u003E\u003C/span\u003E\u003C/span\u003E\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-03-23T00:08:48Z\u0022 title=\u002203/23/2016 12:08  AM\u0022 data-short=\u00228 yr\u0022\u003EMarch 23, 2016\u003C/time\u003E by Torgo\u003C/strong\u003E\n\u003Cbr\u003EPictures!!!!!\n\u003C/span\u003E\n"},{"CreatedByName":"Torgo","CreatedById":149873,"CreatedDateTime":"2016-01-20T05:57:51Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003EChapter 2 - Learning to Fly\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nPart 1 - Two days after the world changed, Wernher announced to the world that their first research breakthrough of Engineering 101, resulting in new experiments that would provide the currency needed to unlock new technologies, Science.\n\u003C/p\u003E\n\u003Cp\u003E\nThree days after that, Wernher announced that researchers had developed basic rocketry concepts, providing the engines that would power the capsules into the sky.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022oR3NyhP.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/oR3NyhP.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd true to his word, just 6 days after the calendar had been reset and the world shocked, Wernher introduced the first capsule, with Bob nervously working around the experiments just outside the large Vehicle Assembly Building. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E\u003Cspan style=\u0022font-size:11px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027courier new\u0027, courier, monospace;\u0022\u003E\u003Cimg alt=\u0022I9xHdP5.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/I9xHdP5.png\u0022\u003E\u003Cbr\u003E\nBob tests the experiment packages of the Testus capsule on the launchpad, Day 10 of Year 1\u003C/span\u003E\u003C/span\u003E\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nBob ran each of the experiment packages attached to the capsule and carefully documented the results. Nothing unexpected was found, but enough science was obtained that they could continue to research new technologies for the program. This also completed the contract given to them by the World\u0027s First group, which brought more funds to the program, and more prestige as the results were broadcast around the world. The World\u0027s First group also offered them a new contract, this one to escape the atmosphere and enter space. \n\u003C/p\u003E\n\u003Cp\u003E\nAfter Bob was done, the workers gathered the capsule back onto the truck and drove it back into the assembly building, where it would be attached to a booster rocket and sent into the air in just a few days time.\n\u003C/p\u003E\n\u003Cp\u003E\nThe morning of Day 9 was much like any of the previous 8 mornings. Kerbs worldwide clamored for news from the new space center. There was a buzz of excitement when Wernher was back on the viewscreen to announce the construction at the upgraded Mission Control building was complete, and that very, very soon, the fledgling space agency would be accepting new business from the rest of the world.  \n\u003C/p\u003E\n\u003Cp\u003E\nThe whole of Kerbal society was re-shaping itself. The Discovery Channel, long time to home to hit viewscreen shows like “Hydraziners”, “Ice Cap Bush Kerbs”, and “Kerb vs Wild” now had shows featuring actual discoveries. “Fast and Loud” was now about the new rockets. “Mythbusters” looked at misconceptions about flight and space and showed how Kerbs were going to prove them wrong.\n\u003C/p\u003E\n\u003Cp\u003E\nThere was also an incredibly popular new science fiction shows about an organization of space faring Kerbs called “Kerbfleet Animated Adventures.” The History Channel debuted a new show called “Ancient Aliens”, which made the outlandish claim that Kerb society was heavily influenced long ago by visitors from another planet. The host of the show quickly became a meme on the Konnected Kerbin network, even rivaling the amount of pictures of kittehkats.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022BgQejpq.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/BgQejpq.png\u0022\u003E\u003Cbr\u003E\u003Cspan style=\u0022font-family:\u0027courier new\u0027, courier, monospace;\u0022\u003E\u003Cspan style=\u0022font-size:11px;\u0022\u003E\u003Cem\u003EI\u0027m not saying it was Aliens, but...\u003C/em\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe buzz of the morning was just starting to die down when a small truck drove out of the Vehicle Assembly Building out towards the launch mound. There had been tremendous secrecy surrounding the details of the planned launch, but a news conference was being organized right then to announce the mission to the world. \n\u003C/p\u003E\n\u003Cp\u003E\nDubbed the Testus I, it was now just hours until this first small rocket was supposed to send Jebediah up into the sky. Wernher introduced Gene, the kerb who would act as the mission controller. Gene briefed the assembled reporters on what they should expect today.\n\u003C/p\u003E\n\u003Cp\u003E\nMission Control was predicting a flight that would reach about 16,000 meters and last about 6 minutes from liftoff to touchdown. They expected the capsule to go straight up very fast then come straight back down hopefully less fast.\n\u003C/p\u003E\n\u003Cp\u003E\n“Okay, sis, what am I supposed to do again?” A groggy Jeb asked from his new uncomfortable bunk in the modified prison designed building now serving as Astrokerb Headquarters.\n\u003C/p\u003E\n\u003Cp\u003E\n“Hold on tight on the way up. When the engine flames out, activate the materials bay,  run the small science packages, then activate the goo experiment”, said Val.\n\u003C/p\u003E\n\u003Cp\u003E\n“When the alarm goes off that you’re going down, turn it off then press the buttons to separate from the engine and release the parachute. Then sit back and relax and wait until you get back down on the ground,” she continued. \u0022And don\u0027t forget to make your report while you\u0027re still in the air.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n“With all this science stuff, why not send Bob up first? These are his toys” asked an incredulous Jeb.\n\u003C/p\u003E\n\u003Cp\u003E\n“You saw what happened in the simulator. Bob couldn’t keep the ship steady and it kept breaking up. You can keep it inline, and just press a few buttons and flip a few switches. \u0022 replied Val.\u003Cspan\u003E \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n“Well, technically...\u0022 she continued, \u0022the chute will deploy even if you don’t press the button or do the science… in case you pass out on the way up. But just think of all the snack tins your face will be on… the parades… the viewscreen shows… You’ll be the most famous Kerb ever!”\n\u003C/p\u003E\n\u003Cp\u003E\n“Well, until you go higher than me on the next flight, anyways” snarked Jeb.\n\u003C/p\u003E\n\u003Cp\u003E\nThe intercom in the room crackled to life. “Enough of the chatter, you two. Jeb, are you ready?”\n\u003C/p\u003E\n\u003Cp\u003E\n“Ready to sit there and press buttons like a trained monkeh, yes sir, Gene!”\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022We launch in 1 hour. Get out to your ship and climb aboard. There are final checks to run\u0022 Gene ordered. \n\u003C/p\u003E\n\u003Cp\u003E\n\u0022On my way now, sir.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n45 minutes later, Jeb completed the final pre-flight checks donned his flight suit and helmet, and climbed the ladder up to the capsule. \u0022Are you sure those lists covered everything?\u0022 he asked mission control through his suit radio. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022cJCuB81.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/cJCuB81.png\u0022\u003E\u003Cbr\u003E\u003Cem\u003E\u003Cspan style=\u0022font-size:11px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027courier new\u0027, courier, monospace;\u0022\u003EThe Testus I on the launch mound shortly before launch\u003C/span\u003E\u003C/span\u003E\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIt was about ten minutes later when Gene made the announcement that everyone was waiting for. \n\u003C/p\u003E\n\u003Cp\u003E\n\u0022All systems check out, and we\u0027re go for launch in 60 seconds.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00228kQX9Gt.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/8kQX9Gt.png\u0022\u003E\u003Cbr\u003E\u003Cspan style=\u0022font-family:\u0027courier new\u0027, courier, monospace;\u0022\u003E\u003Cspan style=\u0022font-size:11px;\u0022\u003E\u003Cem\u003EA view of the command console from the camera mounted on Jebediah\u0027s helmet. \u003C/em\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIf an entire civilization could hold its breath, it was happening now. Everyone on the planet was glued to a viewscreen waiting to see what was about to happen.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Ut6v8Sy.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/Ut6v8Sy.png\u0022\u003E\u003Cbr\u003E\u003Cfont face=\u0022courier new, courier, monospace\u0022\u003E\u003Cspan style=\u0022font-size:11px;line-height:17.6px;\u0022\u003E\u003Ci\u003EView from the roof of the Vehicle Assembly Building\u003C/i\u003E\u003C/span\u003E\u003C/font\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022lCQbBKW.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/lCQbBKW.png\u0022\u003E\u003Cbr\u003E\u003Cspan style=\u0022font-family:\u0027courier new\u0027, courier, monospace;\u0022\u003E\u003Cspan style=\u0022font-size:11px;\u0022\u003E\u003Cem\u003EOne brave (or foolish) camerakerb volunteered to man the camera behind the bunker near the launchpad.\u003C/em\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nSeconds seemed liked hours as they slowly ticked away. Hundreds of camerakerbs strained at the fence keeping them what everyone hoped was a safe distance away. Half of them expected success, half a disaster, and half just wanted the free snacks provided by the agency.\n\u003C/p\u003E\n\u003Cp\u003E\nAs the countdown reached ten seconds, a voice boomed over the intercom announcing each slowly fleeting second. The \u0022World\u0027s First\u0022 Agency, set up in secret by the Overkerb to provide funding to the program, was on hand with certificates and briefcases for what they hoped was about to be achieved.\n\u003C/p\u003E\n\u003Cp\u003E\nFinally, the voice overhead reached \u0027one\u0027, and nothing happened. The Testus I was still firmly on the launchpad. There was no boom, no fire, no screaming, just eerie silence. Confusion was just about to set in when the voice said \u0022Ignition\u0022 and everyone saw the smoke and fire on the pad.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E-- to be continued\u003C/em\u003E  \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-03-23T12:22:06Z\u0022 title=\u002203/23/2016 12:22  PM\u0022 data-short=\u00228 yr\u0022\u003EMarch 23, 2016\u003C/time\u003E by Torgo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Torgo","CreatedById":149873,"CreatedDateTime":"2016-03-23T16:39:58Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt\u0027s been a little too long since I continued this story, but I was having too much fun and making too much progress with my other save... but now that persistence file is just under 60 MB and I have to wait for 1.1 to continue with it, so on with the story.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EChapter 2 - Learning to Fly, Part II\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAs the cloud of smoke at the launch pad built, a solitary finger of flame rose up from the middle below a tiny black capsule with a kerb strapped inside, quite literally rocketing up from the surface. Kerbs watching at home on their viewscreens were treated to live pictures from the external cameras on the Testus I, showing them their world from an entirely different perspective. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/Apjsk1w.gif\u0022 alt=\u0022Apjsk1w.gif\u0022\u003E\u003Cbr\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cem\u003EA view of the launch from the camera on top of the VAB\u003C/em\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nInside the capsule, Jebediah was being pressed back in his seat and shaken around. He could hear chatter on the radio, but couldn’t make it out over the roar of the solid rocket booster below his seat.\u003Cbr\u003E\u003Cbr\u003E\nAt mission control, the reporters gathered outside watched the capsule ride the column of flame and smoke higher and higher. It took several seconds for the sound to reach them. It was a sound unlike anything any kerb had ever heard before. It was so loud it shook the cameras and the windows of the mission control building. Many kerbs were thankful that they had only little holes in their heads, and not actual ears, or else it would have been unbearable.\u003Cbr\u003E\u003Cbr\u003E\nJust as quickly as it had started, the roar inside the capsule was replaced by the sound of air rushing by as it continued straight up from the ground. Jeb took the occasion to press the buttons labeled ‘Materials Experiment’ and ‘Science Packages’. Once he confirmed he had data from those experiments, Jeb then pressed the button for ‘Goo Experiment’, then remembered to look out the window of his tiny capsule and record a report of his experience in the sky.\u003Cbr\u003E\u003Cbr\u003E\nSoon, Jeb experienced another feeling no kerb had ever felt before, a feeling of weightlessness as his capsule lost the fight against gravity and started to fall back to the planet. Jeb looked at what the engineers had called an ‘altimeter’ to see it read just under 16,000 meters. He could only see sky out of the tiny capsule window, but the external camera feed showed him a very tiny space center on the ground far below him. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/OfFBGKE.png\u0022 alt=\u0022OfFBGKE.png\u0022\u003E\u003Cbr\u003E\u003Cem\u003ELooking down at the space center from the capsule.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe descent alarm sounded, and Jeb pressed the last two buttons on the console, the first separating the capsule from the booster, and the second deploying the parachute. A quick view of the upward facing external camera confirmed that the chute had deployed. Jeb pondered, just for a moment, why the engineers included that feature. If the chute didn’t deploy, there was not much he would be able to do except scream all the way back down. He was, though, very happy to see that everything looked normal. \u003Cbr\u003E\u003Cbr\u003E\nInside mission control, there were cheers and high twos. Gene cautioned them that the mission was not yet over, and that it wouldn’t be until Jeb emerged from the capsule after it landed. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/u6wvOMb.png\u0022 alt=\u0022u6wvOMb.png\u0022\u003E\u003Cbr\u003E\u003Cem\u003EJeb\u0027s capsule descends slowly back to the ground\u003C/em\u003E\u003Cbr\u003E\u003Cbr\u003E\nAll over the planet, kerbs celebrated as they watched the capsule falling back to Kerbin much more slowly than it had risen. Not many paid attention to the separated booster stage plummeting down at a much higher rate of speed. They did, though, when the ground reached up to smack it, causing a loud explosion and leaving a sizable hole in the grass at the point of impact.  \u003Cbr\u003E\u003Cbr\u003E\nBack in the capsule, Jeb tried not to think about how much his life had changed in the last few weeks. He had run a humble scrap yard from this swampy land, just as his father had before him. The most excitement he had, before that night which began this new chapter of his life, was tearing down old vehicles and putting the pieces together into something new. But all that changed with the arrival of a mysterious light in the sky, a strange piece of unkerbly metal and a swarm of government worker kerbs with clipboards and pens and lab coats. The replay of events in his mind was rudely interrupted by the jolt of the planet ramming itself into his capsule at just over three meters per second. \u003Cbr\u003E\nEverything seemed to be in order, and he released the buckle of the straps holding him to his seat. The handle on the door turned when he pressed it, and the door swung open. Jeb clambered out and stood on the ground next to his capsule. A few yards away, he could see the smoking hole in the ground left by the booster rocket that had dropped back down below him. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/cQ7LAqx.png\u0022 alt=\u0022cQ7LAqx.png\u0022\u003E\u003Cbr\u003E\u003Cem\u003EOne short flight for a kerb, one giant leap for kerbkind\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe first wave of kerbs took just a few minutes to reach him. The doctors wanted to poke and prod him to make sure he was okay. The scientists were tearing apart the capsule to retrieve the data. The reports were all yelling questions at him. It made the rush of the launch just a few minutes before seem quite sedate. Jeb was sheparded into a waiting car and driven back to the Astrokerb headquarters building for a more thorough examination. He was now the most famous kerb in the world, and everyone wanted to talk to him. One of the secretaries started going over his schedule. For the next month, he’d rarely see his own bed. He’d be in front of seemingly every camera ever made, telling the same story over and over and over and over and over again to a public that wanted to hear it even more than that. \u003Cbr\u003E\u003Cbr\u003E\nAt the official press conference following the launch, construction of the Testus II was ordered, which this rocket packing both a solid booster and a newer liquid fueled engine. The capsule design was sound, but the liquid fuel tanks were still untested. It was also announced that the research team had just conquered survivability, prompting one soon-to-be-ex reporter to ask if maybe the launch should have been held AFTER that breakthrough instead of before. \u003Cbr\u003E\u003Cbr\u003E\nThe first outside contract was announced, with the agency agreeing to test a new heat shield developed by OMB Demolition. They also discussed the testing of a booster rocket and upper stage engine developed by the R \u0026amp; D team.  The only official timetable released was that these things would happen ‘soon™’ \u003Cbr\u003E\u003Cbr\u003E\nWhile all this was going on, Wernher was on his office with a private viewscreen connection to the Overkerb. The Overkerb had just authorized funding for upgrades to the tracking station in anticipation of future flights. \n\u003C/p\u003E\n\u003Cp\u003E\n\u0022And what of our, er... special guests, sir?\u0022 asked Wernher. \n\u003C/p\u003E\n\u003Cp\u003E\n\u0022They are impressed with the progress your team has made in such a short time, Werner,\u0022 responded the Overkerb. \u0022But we still have much to learn from them here. I will keep you apprised as the situation dictates. We have the attention of an entire planet focused on us now. That was the easy part. The hard part will be keeping that attention long enough to accomplish the goal. Now get back to work and get us into space.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Torgo","CreatedById":149873,"CreatedDateTime":"2016-03-24T17:02:01Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003EChapter 3 - High Hopes\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nJebediah\u0027s successful flight ushered in a new wave of activity at the space center. \n\u003C/p\u003E\n\u003Cp\u003E\nThe accounting team was busy totaling up the new funds received from the World\u0027s First people:\n\u003C/p\u003E\n\u003Ctable align=\u0022left\u0022 border=\u00221\u0022 cellpadding=\u00221\u0022 cellspacing=\u00221\u0022 style=\u0022width:800px;\u0022\u003E\u003Cthead\u003E\u003Ctr\u003E\u003Cth scope=\u0022col\u0022\u003E\nType\n\u003C/th\u003E\n\u003Cth scope=\u0022col\u0022\u003E\nTitle\n\u003C/th\u003E\n\u003Cth scope=\u0022col\u0022\u003E\nFunds\n\u003C/th\u003E\n\u003Cth scope=\u0022col\u0022\u003E\nSci\n\u003C/th\u003E\n\u003Cth scope=\u0022col\u0022\u003E\nRep\n\u003C/th\u003E\n\u003C/tr\u003E\u003C/thead\u003E\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd\u003E\nWorld\u0027s First\n\u003C/td\u003E\n\u003Ctd\u003E\nLaunch First Vessel\n\u003C/td\u003E\n\u003Ctd style=\u0022text-align:center;\u0022\u003E\n1,600\n\u003C/td\u003E\n\u003Ctd\u003E\n \n\u003C/td\u003E\n\u003Ctd\u003E\n \n\u003C/td\u003E\n\u003C/tr\u003E\u003Ctr\u003E\u003Ctd\u003E\nContract\n\u003C/td\u003E\n\u003Ctd\u003E\nLaunch First Vessel\n\u003C/td\u003E\n\u003Ctd style=\u0022text-align:center;\u0022\u003E\n3,817\n\u003C/td\u003E\n\u003Ctd style=\u0022text-align:center;\u0022\u003E\n1\n\u003C/td\u003E\n\u003Ctd style=\u0022text-align:center;\u0022\u003E\n1\n\u003C/td\u003E\n\u003C/tr\u003E\u003Ctr\u003E\u003Ctd\u003E\nWorld\u0027s First\n\u003C/td\u003E\n\u003Ctd\u003E\nSpeed Record - 25 m/s\n\u003C/td\u003E\n\u003Ctd style=\u0022text-align:center;\u0022\u003E\n9,600\n\u003C/td\u003E\n\u003Ctd style=\u0022text-align:center;\u0022\u003E\n1\n\u003C/td\u003E\n\u003Ctd style=\u0022text-align:center;\u0022\u003E\n2\n\u003C/td\u003E\n\u003C/tr\u003E\u003Ctr\u003E\u003Ctd\u003E\nWorld\u0027s First\n\u003C/td\u003E\n\u003Ctd\u003E\nSpeed Record - 50 m/s\n\u003C/td\u003E\n\u003Ctd style=\u0022text-align:center;\u0022\u003E\n9,600\n\u003C/td\u003E\n\u003Ctd style=\u0022text-align:center;\u0022\u003E\n1\n\u003C/td\u003E\n\u003Ctd style=\u0022text-align:center;\u0022\u003E\n2\n\u003C/td\u003E\n\u003C/tr\u003E\u003Ctr\u003E\u003Ctd\u003E\nWorld\u0027s First\n\u003C/td\u003E\n\u003Ctd\u003E\nAltitude Record - 1,500 m\n\u003C/td\u003E\n\u003Ctd style=\u0022text-align:center;\u0022\u003E\n9,600\n\u003C/td\u003E\n\u003Ctd style=\u0022text-align:center;\u0022\u003E\n1\n\u003C/td\u003E\n\u003Ctd style=\u0022text-align:center;\u0022\u003E\n2\n\u003C/td\u003E\n\u003C/tr\u003E\u003Ctr\u003E\u003Ctd\u003E\nWorld\u0027s First\n\u003C/td\u003E\n\u003Ctd\u003E\nAltitude Record - 4,500 m\n\u003C/td\u003E\n\u003Ctd style=\u0022text-align:center;\u0022\u003E\n9,600\n\u003C/td\u003E\n\u003Ctd style=\u0022text-align:center;\u0022\u003E\n1\n\u003C/td\u003E\n\u003Ctd style=\u0022text-align:center;\u0022\u003E\n2\n\u003C/td\u003E\n\u003C/tr\u003E\u003Ctr\u003E\u003Ctd\u003E\nWorld\u0027s First\n\u003C/td\u003E\n\u003Ctd\u003E\nSpeed Record - 250 m/s\n\u003C/td\u003E\n\u003Ctd style=\u0022text-align:center;\u0022\u003E\n9,600\n\u003C/td\u003E\n\u003Ctd style=\u0022text-align:center;\u0022\u003E\n1\n\u003C/td\u003E\n\u003Ctd style=\u0022text-align:center;\u0022\u003E\n2\n\u003C/td\u003E\n\u003C/tr\u003E\u003Ctr\u003E\u003Ctd\u003E\nWorld\u0027s First\n\u003C/td\u003E\n\u003Ctd\u003E\nAltitude Record - 14,000 m\n\u003C/td\u003E\n\u003Ctd style=\u0022text-align:center;\u0022\u003E\n9,600\n\u003C/td\u003E\n\u003Ctd style=\u0022text-align:center;\u0022\u003E\n1\n\u003C/td\u003E\n\u003Ctd style=\u0022text-align:center;\u0022\u003E\n2\n\u003C/td\u003E\n\u003C/tr\u003E\u003Ctr\u003E\u003Ctd\u003E\nWorld\u0027s First\n\u003C/td\u003E\n\u003Ctd\u003E\nSafely Returned Vessel to Surface\n\u003C/td\u003E\n\u003Ctd style=\u0022text-align:center;\u0022\u003E\n1,600\n\u003C/td\u003E\n\u003Ctd style=\u0022text-align:center;\u0022\u003E\n \n\u003C/td\u003E\n\u003Ctd\u003E\n \n\u003C/td\u003E\n\u003C/tr\u003E\u003C/tbody\u003E\u003C/table\u003E\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWith Survivability research completed, work began on General Rocketry which would unlock a host of new propulsion systems. The science team expected it would be about 5 days before they finished their work.\n\u003C/p\u003E\n\u003Cp\u003E\nA host of new part testing contracts were accepted to check out potential new engines to be used in future designs. On the morning of the 10\u003Csup\u003Eth\u003C/sup\u003E day, the accounting team reported they now had \u003Cspan style=\u0022font-size:11pt;font-family:Arial, sans-serif;\u0022\u003E√\u003C/span\u003E320,350 in the bank, with 93 science points to spend on new breakthroughs.\n\u003C/p\u003E\n\u003Cp\u003E\nWork began almost immediately to construct the Testus B, which was going to look at both the new Castor I booster and a separate heat shield. Bill was tabbed to run these tests, and on the morning of Day 12, he was outside the VAB putting the machine through its paces.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/3TPFQuh.png\u0022 alt=\u00223TPFQuh.png\u0022\u003E\u003Cbr\u003E\u003Cem\u003EEngineer Bob standing next to the Testus B after successfully completing two rounds of testing.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAfter testing the heat shield on the ground, OMB offered a new contract to test it in the air. To complete the next contract, the 2m heat shield will need to be flown to between 45,000 and 55,000 meters at a speed between 1,900 and 2,350 meters per second. \n\u003C/p\u003E\n\u003Cp\u003E\nAnother set of contracts was accepted from the R\u0026amp;D team to check out their newly developed Castor 120, Castor 30XL and Altair II boosters on the pad. Construction began on the Testus C to test the Castor 120 and the Testus D to check the \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/RXR3VPN.png\u0022 alt=\u0022RXR3VPN.png\u0022\u003E\u003Cbr\u003E\u003Cem\u003EOn the morning of the 14th, Valentina accompanied the Testus C to the pad and tested the Castor 120 booster.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nFollowing the successful test of the Castor 120 and Testus C, Wernher announced that the science team had completed their research into Stability to provide more control over future rockets. He expected it would take them 5 days to complete that, and that soon Valentina would be the next kerb to take flight in a larger, more powerful rocket.\n\u003C/p\u003E\n\u003Cp\u003E\nMeanwhile, rumors continued to circulate that the fireball seen a few weeks back was actually an alien spaceship, and that the government had captured aliens and was using them to unlock this new technology. To Wernher\u0027s chagrin, the more his people tried to discredit these fantastical stories, the more traction they gained in the popular culture.\n\u003C/p\u003E\n\u003Cp\u003E\nFor the first time anyone could remember, a kerb actually publicly questioned the integrity and authority of the Overkerb. The society had no laws specifically against dissent, but there had never been a place for it in their culture. That night, the Overkerb interrupted the nightly viewscreen entertainment shows to announce that a forum would be established where everyday kerbs would be allowed to respectfully ask questions about the space agency and space program, provided that questions dealt with science and facts, and not nonsensical fantasy like aliens and extra-terrestrial craft. Kerbs that could follow those rules could expect factual answers, or at least the most educated guesses that could be formulated, from the senior members of the program. \n\u003C/p\u003E\n\u003Cp\u003E\nIn the VAB, the designers continued to struggle with the Testus II. The solid rocket booster first stage was larger and heavier, but could not be fully loaded with fuel or else it would be too heavy to actually get off the ground. In sessions in the simulator, the second stage liquid engine kept failing to ignite, and none of the engineers could figure out why. Wernher encouraged them to keep working on it while he would try to get them answers.\n\u003C/p\u003E\n\u003Cp\u003E\nMeanwhile, Jeb\u0027s whirlwind tour continued. In 5 days, he had been in 13 parades, on 17 viewscreen shows and had 3 schools named after him. He did his best to keep his speaking limited to the talking points provided to him by the agency... Yes, he was nervous but not scared... OK, he was a little scared but fully confident in the space agency team... He hoped that this new era of exploration would encourage young kerbs to learn math and science... No, he hadn\u0027t met the Overkerb in person yet... No, he hadn\u0027t met the aliens yet, er No there is no such thing as aliens and stop speaking such nonsense... Yes, he couldn\u0027t wait to get into space and maybe even go to the Mun, but there are still a lot of problems to solve before we get there... Yes, he was a better pilot than his sister, but she\u0027d tell you differently. \n\u003C/p\u003E\n\u003Cp\u003E\nJeb looked at his schedule for the next week. 17 more parades, 2 more schools, 26 more viewscreen interviews, then finally a day almost off, where he\u0027d be back at the space center to have dinner with Val and Wernher and then start training in the simulator for the Testus IV flight. He was hoping he\u0027d finally get an answer from Wernher about the mysterious light in the sky that had started this strange new chapter in his life.  Rocks had fallen from the sky for as long as anyone could remember. Jeb had even seen some of them streak overhead, but none of them looked like the one he had seen most recently. And why did the Overkerb take away his junkyard so quickly afterwards? Was Wernher being 100% truthful with him? And why would they keep insisting there are no aliens, when at most all they really knew was that they didn\u0027t have any proof that aliens existed?\n\u003C/p\u003E\n"},{"CreatedByName":"Torgo","CreatedById":149873,"CreatedDateTime":"2016-03-25T22:46:51Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003EChapter 4 - Louder than Words\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nOn the morning of the 16\u003Csup\u003Eth\u003C/sup\u003E day, Sebastien was tabbed to take the newly completed Testus D to the mound to test both the Altair II booster and a radial parachute. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe tests went off without a hitch, bringing over 12,000 funds in while also bringing in a small amount of prestige and science. Two new contracts were accepted to replace the ones just fulfilled, first to test out OMB Demolition’s new TT-38 radial de-coupler, and a Merlin series liquid engine from the folks at R\u0026amp;D. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/VI2NcUG.png\u0022 alt=\u0022VI2NcUG.png\u0022\u003E\u003Cbr\u003E\u003Cem\u003ESebastien poses with the Testus D after a successful test\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nMeanwhile, in the simulator, test after test of combinations of solid boosters and liquid fuel engines continued to fail. They’d either be unstable or end up not flying with the fiery end down, or the fire would fail to start on the upper stage. The engineers decided to take another break from the problem and start building the Testus E, which would see how the Merlin series engine would perform. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\nNothing of note happened on day 17, with the entire compound now seemingly settled into a smooth rhythm and work proceeding along as scheduled. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\nThat would all be thrown out of whack on the 18\u003Csup\u003Eth\u003C/sup\u003E day, though, as it was the first ‘forum’ day, and Gene, Linus (Wernher’s assistant), Gus from operations and Walt from PR took their places on the dais and met with reporters and kerbs who had come with questions about the new space program and aliens.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\nWalt opened the proceedings by reminding all assembled that this was a forum for serious questions only, and those who wished to speak of aliens or other nonsense would be asked to leave.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\nThere was a long, uncomfortable silence until one KNN reporter asked about the strip of dirt next to the unused warehouse looking building. Gus explained that those areas would be used for a new ‘airplane’ and ‘spaceplane’ projects that would be established after we had established our ability to safely and reliably reach orbit with rockets.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:11pt;line-height:107%;font-family:Calibri, sans-serif;\u0022\u003EThe next question was directed at Gene, as another reporter asked about the delay with the Testus II and Valentina’s flight. Gene explained that the researchers and engineers had worked on many designs, but the testing on those designs would find serious issues. The team would evaluate the issues, adapt the designs to solve those, run tests, and find new issues created. As they were designing this rocket to carry a kerb, they wanted to eliminate as many problems as possible. Linus compared it to the process one of the side companies was facing when designing a viewscreen game that everyone could play which would simulate building rockets and launching them. Bugs would be found, then fixed, and then new bugs would be found. One reporter joked that maybe the Testus II design team was using that program. That reporter was quickly escorted from the property, and Gene wrote a note to himself that perhaps ‘Human Space Program’ wasn’t the best name for the game and that his teams shouldn’t be getting caught playing it.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/8t7hZSK.png\u0022 alt=\u00228t7hZSK.png\u0022\u003E\u003Cbr\u003E\u003Cem\u003EHuman Space Program v1.1 due out soon\u003Csup\u003ETM\u003C/sup\u003E\u003C/em\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nThere were some other questions, mostly focusing on upcoming plans. One civilian kerb asked how they could go about applying to be an astronaut. Another asked about how the technology being developed here would affect the rest of the world. Others focused on the current crew of astronauts. It was about an hour into the program when someone finally asked about the aliens, and Gene abruptly ended the discussion and angrily sent everyone home. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\nDay 19 saw an announcement from the kerbs in research. They had completed their work on Stability, and had delivered some new prototype larger fins to the VAB. The researchers were now turning their attention to developing more boosters and fuel tanks and expected to be ready to present prototypes within a week. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe new, larger fins combined with a breakthrough that an intern thought up on a snack break (though a mid-level manager made sure to take full credit for the solution). The solid boosters all worked, and simulations with the new fins showed them to be much more stable in flight, so why not use the larger XL30 as planned as the first stage, but then use the Star 48B booster as a second stage.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\nThey loaded the design into the simulator, which looked very suspiciously like the ‘Human Space Program’ game, and the results were nothing short of breathtaking. They ran the tests several times and got similar results. They were about to tell Wernher when the intern who had come up with the idea (before it was stolen) realized that the craft they’d designed was too heavy for the launch mound and they’d not be able to fly it. The middle manager who had claimed the idea as his own still had a meeting with Gene, who brought 2 agency security guards and an empty cardboard box with him. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\nWork on the tracking station expansion was just wrapping up, and the crew was disappointed when Gus told them that their 3 day leave had been cancelled, as they’d need to start upgrading the launch pad right that afternoon after the Testus E testing. It would take them at least 7 days of non-stop work to get that project done, but Gus promised the crew 6 days of leave if they finished on time.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/x77Pcae.png\u0022 alt=\u0022x77Pcae.png\u0022\u003E\u003Cbr\u003E\u003Cem\u003ELooking at the tracking station from the roof of the VAB\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nJebediah had returned early from his maniacal misery tour. The day’s events had been cancelled at the last minute when the PR team realized that one of the interviews was actually with the ‘Ancient Aliens’ guy who was using a fake name. Until all the event organizers and journalists could be verified as not alien worshipping crackpots, the agency was going to not participate in any more public events.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nJeb was disappointed, because he’d been looking forward to talking to that crazy haired kerb about aliens. He assuaged his feelings by stealing the Testus E out from under Bob and taking it to the pad to test the Merlin engine and the radial de-couplers. The engine worked as expected, but the de-couplers sent their empty tank attachments flying 60 meters in either direction, resulting in two loud explosions and a snack truck being rapidly disassembled while its owner was inside using the little kerbs’ room.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/kdVzE6f.png\u0022 alt=\u0022kdVzE6f.png\u0022\u003E\u003Cbr\u003E\u003Cem\u003EJebediah poses inside the new service bay module under the Testus E\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nTesting complete, two new engine testing contracts were hastily accepted and Jeb went to look for his sister Val so they could grab some dinner together.  \n\u003C/p\u003E\n\u003Cp\u003E\nIt was only going to take about 4 days to build the Testus II, so Gene had the teams begin work on the Testus F first, as it would be done and leave enough time for the II to be assembled and then launched with little delay. They also made plans for the Testus G.\n\u003C/p\u003E\n\u003Cp\u003E\nOn Day 22, Bob brought the Testus F to the pad to test the RL10 engine, yet another liquid fuel solution that might someday help them leave the planet. The engine performed exactly as the simulation said it would, and it was carted back to the VAB to be disassembled and the capsule incorporated into the Testus II. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/GSA36Lw.png\u0022 alt=\u0022GSA36Lw.png\u0022\u003E\u003Cbr\u003E\u003Cem\u003EBob and the Testus F\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nOn Day 23, the designers submitted their plans for the Testus III, which would forego the use of solid fuel and use only liquid fuel. The craft would not likely leave the atmosphere, but would mark the first use of liquid fuel, which is what the team would need to build larger rockets capable of reaching orbit. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nDay 24 saw the completion of the Advanced Rocketry research, and Wernher now had the team go to work on Basic Science, which would unlock some new experiments which could be used to replenish their now depleted stock of science. He also announced that the Testus II would launch on the 26th day.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nDay 25 was quiet, as everyone concentrated on their jobs to make sure tomorrow’s flight would be ready to go. \u003Cbr\u003E\nAs the sun rose on day 26, crowds of thousands jammed the area around the space center. None of the public could actually see the rocket, or the launch pad, or much of anything, really, but this was THE place to be. The operations team put the finishing touches on the new launch pad, which could now handle larger rockets. \n\u003C/p\u003E\n\u003Cp\u003E\nThe Testus II was trucked out to the pad and carefully moved into position. The pad crew helped Valentina climb up into the capsule and made sure she was securely strapped in. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/W04Qpe9.png\u0022 alt=\u0022W04Qpe9.png\u0022\u003E\u003Cbr\u003E\u003Cem\u003EThe Testus II on the pad, shortly before launch\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nLinus sat with the news crews, talking about the details of the launch. He mentioned to them that the target was reaching the upper atmosphere, but that the simulator runs had indicated they could actually reach space. \n\u003C/p\u003E\n\u003Cp\u003E\nThe crowd chanted along with the countdown and as it reached zero, watched for the rocket racing into the sky. They were not disappointed, as soon they saw the rocket on its way up, angling ever so slightly out over the ocean. It was a few seconds before the deafening roar of the engine hit them. \n\u003C/p\u003E\n\u003Cp\u003E\nIn the capsule, Val watched the gauges even though she didn’t have to do anything until after the second stage burned out. \u003Cbr\u003E\nOn the ground, Linus pointed out that the first stage was burned out, and would be dropped over the ocean as the smaller second stage ignited. As the rocket was already much too high for anyone on the ground to see, they all looked at the oversized view screens that had been set up. The telephoto lens on the VAB camera strained to keep up with the Testus II as it raced up and away on a new finger of flame. \n\u003C/p\u003E\n\u003Cp\u003E\nThe view switched to a feed from the external camera pointing back down at the planet. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/XT6LbUw.png\u0022 alt=\u0022XT6LbUw.png\u0022\u003E\u003Cbr\u003E\u003Cem\u003ELooking back from the edge of space\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nLinus explained that to escape the atmosphere, they needed to reach a height of at least 140,000 meters. Everyone watching could listen in to Val from the capsule as she read off the gauges as the rocket inched ever higher. \n\u003C/p\u003E\n\u003Cp\u003E\nFinally, after what seemed like forever, the altitude readout rolled over the goal and kept climbing. Calmly, Val started activating the switches that controlled the science experiments on board. All had been stowed in the service bay below the capsule and above the heat shield. As the craft topped out at just over 160,000 meters, she flipped the switch to jettison the spend rocket booster still attached to the ship. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/BJznS0C.png\u0022 alt=\u0022BJznS0C.png\u0022\u003E\u003Cbr\u003E\u003Cem\u003EA screen capture from the feed on Valentina\u0027s helmet in the capsule of the Testus II\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIt was proving more difficult than anticipated to get the capsule oriented for re-entry, but just after re-entering, Val was able to get the ship close enough to where it would correct itself on the way down. \n\u003C/p\u003E\n\u003Cp\u003E\nAnd correct itself it did. Violently. Val experienced over 10 G’s a few times on the way down as the capsule rotated, wobbling on its long axis while slowing down in the increased air pressure.\n\u003C/p\u003E\n\u003Cp\u003E\nThe recovery boats raced towards the spot where they thought the capsule would splash down. They spotted the parachutes from a few kilometers away. The simulator said the capsule should float, but no one had thought to actually test that to be sure. But in the end, the simulator was right. The capsule splashed down and bobbed gently in the water as it rolled to its side. The crew plucked Val from the capsule, then attached the chains to the craft and gently hauled it on board. \n\u003C/p\u003E\n\u003Cp\u003E\nBack at the space center, the party had already begun. The mission had resulted in an influx of nearly 75,000 funds. The research team calculated that the experiments brought back were worth 87 science, more than enough to unlock 2 more nodes of research as they prepared for the next great task of placing a craft in orbit. \n\u003C/p\u003E\n\u003Cp\u003E\nAnd inside a dark warehouse somewhere near the space center. the image of the Overkerb spoke to the small group assembled inside. \u0022Wernher, I never doubted you. As for our new friends... perhaps you now realize that we are able to do all this and more. With your help, who knows how far we can go.\u0022\n\u003C/p\u003E\n"}]}