{"TopicId":129373,"ForumId":70,"TopicTitle":"How to force chutes to open at a certain altitude on Mars","CreatedByName":"lextacy","CreatedById":107955,"CreatedDateTime":"2016-01-06T05:26:13Z","PageNum":1,"Articles":[{"CreatedByName":"lextacy","CreatedById":107955,"CreatedDateTime":"2016-01-06T05:26:13Z","Content":"\n\u003Cp\u003E\nI found an interesting issue while trying to send down the Viking lander to land on Mars. The way RSS is setup is that the new heating dynamics only are tuned to Earth. When you try to areo-brake Mars you will burn up(shock heat) the entire time until you hit the ground at around 2,500 kps. This is due to almost zero atmosphere. Therefore your not allowed to open the chutes to slow you down cuz you are still on fire. Its a game breaking situation since you have no way to slow you down. Albiet retro rockets \u0022could\u0022 be used , but that only happens AFTER the chutes have done their job. I would not even fathom the fuel requirements and weight issues by clunking my lander to death with all that fuel. So................\n\u003C/p\u003E\n\u003Cp\u003E\n1. Is there a way to get the chutes to force open at these mega super sonic speeds ? (consider that 2,500 m/ps on Mars is like opening chutes on Earth at around only 75 m/ps with respect to air pressure differential)\n\u003C/p\u003E\n\u003Cp\u003E\n2. Would I have to adjust other things? Things like breaking force ect.\n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2016-01-06T08:19:20Z","Content":"\n\u003Cp\u003E\nThe more flat your trajectory - the more dV you can dissipate in atmosphere.\n\u003C/p\u003E\n\u003Cp\u003E\nIRL chutes can be forced (and oftenlt are) to open with a gunpowder charge.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nFor comparison. From ru.wiki, translated from Russian.\n\u003C/p\u003E\n\u003Cp\u003E\nMars-3 landing.\n\u003C/p\u003E\n\u003Cp\u003E\nThe landing began after the 3rd trajectory correction.\u003Cbr\u003E\nBefore the lander separation, the orbiter has been oriented at proper angle for safe air breaking.\u003Cbr\u003E\nLander has been separated just before the orbiter comes onto Mars orbit, i.e. at hyperbolic speed, 12:14 Moscow time.\n\u003C/p\u003E\n\u003Cp\u003E\n15 minutes later a solid-fuel engine (mounted on a special truss) corrected the lander trajectory to hit the Mars atmosphere (dV = 120 m/s).\u003Cbr\u003E\nA correction system (mounted on the same truss) has turned the lander to prograde with a conic heatshield.\u003Cbr\u003E\nTwo small solid rockets mounted on the heatshield have stabilized the lander with rotation.\u003Cbr\u003E\nThat correction truss has been separated.\n\u003C/p\u003E\n\u003Cp\u003E\n4.5 hours of free flight until entering the atmosphere.\n\u003C/p\u003E\n\u003Cp\u003E\nA timer ignited two another solid motors mounted on the heatshield - to stop the rotation.\u003Cbr\u003E\n16:44 Moscow time: enter to atmosphere at speed 5.8 km/s with angles close to proper values.\n\u003C/p\u003E\n\u003Cp\u003E\nAirbreaking with a heatshield begins.\n\u003C/p\u003E\n\u003Cp\u003E\nAfter main airbreaking, yet on supersonic speed, acceleration sensor ignites a solid booster (or charge) mounted on the top of a parachute container. This solid-fuel charge forces the drogue parachute to open.\u003Cbr\u003E\n1.5 seconds later a linear cutting explosive charge cuts off the cap of the torus-shaped parachute container.\u003Cbr\u003E\nThis cap gone away with that drogue parachute.\u003Cbr\u003E\nBut flying away, this cap pulled out from container the main parachute (with reefed canopy).\n\u003C/p\u003E\n\u003Cp\u003E\nThe main parachute\u0027s cords were attached to a bunch of solid-fuel boosters, which wre, in turn, attached to the lander itself.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen airspeed got subsonic, a timer enabled a reef cutter which cut the reefs.\u003Cbr\u003E\nMain parachute canopy, being unreefed, fully opens.\n\u003C/p\u003E\n\u003Cp\u003E\n1-2 s later the heatshield is separated and falls away.\u003Cbr\u003E\nAlso radioaltimeter antennas are uncased.\n\u003C/p\u003E\n\u003Cp\u003E\nWhile chuting down, the airspeed gets 60 m/s.\n\u003C/p\u003E\n\u003Cp\u003E\nAt 20..30 m height (by rafio altimeter) the bunch of the landing solid boosters (do you still remember them? they were to attach the main chute) are ignited.\n\u003C/p\u003E\n\u003Cp\u003E\nThe main chute is separated and gone with (yes, you got it!) one more solid booster.\n\u003C/p\u003E\n\u003Cp\u003E\nThe landing engines are off (btw they arre mounted on a chute container).\n\u003C/p\u003E\n\u003Cp\u003E\nThe chute container is separated from the lander and gone away with (as this used to be) one more solid booster.\n\u003C/p\u003E\n\u003Cp\u003E\nThe fragile lander is packed in a foam plastic to prevent from damages.\n\u003C/p\u003E\n\u003Cp\u003E\nHappy touchdown.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-01-06T08:23:53Z\u0022 title=\u002201/06/2016 08:23  AM\u0022 data-short=\u00228 yr\u0022\u003EJanuary 6, 2016\u003C/time\u003E by kerbiloid\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"lextacy","CreatedById":107955,"CreatedDateTime":"2016-01-08T01:53:23Z","Content":"\n\u003Cp\u003E\nbut didnt Curiosity go ballistic into the atmosphere? , aka never bothered getting into a parking orbit to retro fire into a flat trajectory?  The man in charge, \u003Cspan\u003EAdam Steltzner stressed EDL, which is an acro for entry/decsent/landing .\u003C/span\u003E He stated a famous quote of going from thousands of meters per second to a complete stop in 15 minutes. Now dont get me wrong here, my Mars 3 lander did get into a parking orbit first and had a fairly shallow angle. I have to try my hand at Viking 1\u0026amp;2 where im going to try the most flat trajectory I can muster. Lets see what happens and ill post my results here.\n\u003C/p\u003E\n"}]}