{"TopicId":129496,"ForumId":70,"TopicTitle":"Loading failure with Realism Overhaul","CreatedByName":"manni01","CreatedById":109903,"CreatedDateTime":"2016-01-08T00:53:22Z","PageNum":1,"Articles":[{"CreatedByName":"manni01","CreatedById":109903,"CreatedDateTime":"2016-01-08T00:53:22Z","Content":"\n\u003Cp\u003E\nI was wanting to install RO with all its mods and some other mods, but RO itself is giving me issues. I install every mod individually and it works, but as soon as I add RO, it freezes when it gets to a certain point of loading. This only happens when I put the RO files into my gamedata folder, and without it works perfectly fine. I suspect it is because it is running out of ram, but I\u0027m not sure cause this macbook pro has 8 gb of ram (i know ksp is a 32 bit game and only takes like 3 of it). Did anyone else experience this and how did you fix it? \n\u003C/p\u003E\n\u003Cp\u003E\nthis is what my gamedata folder looks like\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022u0x1dBh.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/u0x1dBh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Gaarst","CreatedById":126740,"CreatedDateTime":"2016-01-08T00:58:06Z","Content":"\n\u003Cp\u003E\nThere can be many causes for a crash upon loading especially with heavy modpacks such as RO.\n\u003C/p\u003E\n\u003Cp\u003E\nWe would need your logs to determine the exact cause of your crash, but I see two options:\n\u003C/p\u003E\n\u003Col\u003E\u003Cli\u003E\nAs you said memory: it is frequent that RO installs reach the memory limit when booted for the first time, I think this is linked to ATM and as it compresses textures when first loading them, it should work after a few tries.\n\u003C/li\u003E\n\u003Cli\u003E\nAs RO is a very complex modpack with a lot of components and requirements you might be missing some required files that cause KSP to crash when searching for them. This is likely when manually installing RO which is why RO\u0027s thread strongly recommands using CKAN, to make sure you have all mods needed and the correct configs.\n\u003C/li\u003E\n\u003C/ol\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-01-08T00:58:55Z\u0022 title=\u002201/08/2016 12:58  AM\u0022 data-short=\u00228 yr\u0022\u003EJanuary 8, 2016\u003C/time\u003E by Gaarst\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2016-01-08T03:11:07Z","Content":"\n\u003Cp\u003E\nMake sure you\u0027re on build 1028\u002B of KSP.\n\u003C/p\u003E\n"},{"CreatedByName":"manni01","CreatedById":109903,"CreatedDateTime":"2016-01-08T03:54:56Z","Content":"\n\u003Cp\u003E\nThis is what I get for not updating. I updated and tried it again and it worked flawlessly. Thank you, NathanKell, for that. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nP.S. Gaarst, thanks for reminding me to check all the requirements, because it turns out that I didn\u0027t install real heat, lol\n\u003C/p\u003E\n"}]}