{"TopicId":129876,"ForumId":51,"TopicTitle":"Getting the hang of mining","CreatedByName":"FlyingPete","CreatedById":127384,"CreatedDateTime":"2016-01-13T20:54:20Z","PageNum":1,"Articles":[{"CreatedByName":"FlyingPete","CreatedById":127384,"CreatedDateTime":"2016-01-13T20:54:20Z","Content":"\n\u003Cp\u003E\nI\u0027m planning a mission to Duna. The intention is to use Ike as a mining outpost, in order to refuel the ships that will be returning the crew to Kerbin, and also to provide an on-site fuel supply for extensive exploration of the system.\n\u003C/p\u003E\n\u003Cp\u003E\nSo I thought I\u0027d do some experiments at Minmus to test out my mining craft. The main aim was to get the balance right as far as power consumption is concerned, so that mining can happen 6 hours a day, not just in sunlight.\n\u003C/p\u003E\n\u003Cp\u003E\nThe obligatory Scansat was dispatched first, to survey Minmus for signs of ore (and mint ice cream)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022nbF35YE.png\u0022 class=\u0022ipsImage\u0022 height=\u0022750\u0022 src=\u0022http://i.imgur.com/nbF35YE.png\u0022 width=\u0022937\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe miner itself was sent on its way soon after. The majority of the insertion burn was done by the general-purpose nuclear tug- a test of the hardware for the Duna mission. Crew for this test was Pilot Sure Kerman, Engineer Leia Kerman, and passenger Lizsan Kerman, who was probably expecting something more luxurious than a mining vessel.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022LsKAKvd.png\u0022 class=\u0022ipsImage\u0022 height=\u0022750\u0022 src=\u0022http://i.imgur.com/LsKAKvd.png\u0022 width=\u0022937\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nLanded on the Lesser Flats of Minmus, and drilling is underway. During the daytime, the solar arrays provide all the power needed to mine at this location\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022MDGFcjM.png\u0022 class=\u0022ipsImage\u0022 height=\u0022750\u0022 src=\u0022http://i.imgur.com/MDGFcjM.png\u0022 width=\u0022937\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWith the arrays retracted to simulate a night time operation, the fuel cells provide sufficient power to continue drilling. Although obviously the conversion efficiency is slightly reduced.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022qg8GESg.png\u0022 class=\u0022ipsImage\u0022 height=\u0022750\u0022 src=\u0022http://i.imgur.com/qg8GESg.png\u0022 width=\u0022937\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m also not sure of the best way to manage fuel consumption when producing monopropellant, or fuel or oxidiser only. I think the method will be to fill the LF/O tanks first, then produce monopropellant, then top up the LF/O to offset anything used by the fuel cells.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIn preparation for the Duna mission, I\u0027ll have the crew rendezvous with the space station orbiting Minmus, and meet up there with the crew of the science outpost. The crew will be rearranged, and \u0027Princess\u0027 Leia and the two scientists will go on a short sojourn out of Kerbin\u0027s SOI to gain experience points. The remaining crew (and passenger) will go home using the Miner.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-01-13T20:55:13Z\u0022 title=\u002201/13/2016 08:55  PM\u0022 data-short=\u00228 yr\u0022\u003EJanuary 13, 2016\u003C/time\u003E by FlyingPete\u003C/strong\u003E\n\u003C/span\u003E\n"}]}