{"TopicId":130073,"ForumId":69,"TopicTitle":"Missing contracts?","CreatedByName":"jwbrase","CreatedById":150131,"CreatedDateTime":"2016-01-17T04:26:17Z","PageNum":1,"Articles":[{"CreatedByName":"jwbrase","CreatedById":150131,"CreatedDateTime":"2016-01-17T04:26:17Z","Content":"\n\u003Cp\u003E\nI recently opened my KSP save and found all of my active contracts gone. Before I post a bug report or a thread in the tech support forum, is there any recent update (I\u0027m running on Steam, specifically, so I\u0027ll have whatever is most recent there) that was anticipated at release time to break contracts in pre-update saves (ie, is this an incompatible feature change, not a bug)? From what I can see, there hasn\u0027t been anything since the 1.0.5 hotfix, which came before this, and I can hardly believe that such a thing would be done before the release of 1.1, but if that is the case, I can just find out what the update date was, restore a backup from the day before to a new KSP folder, and keep playing from that point, no need to annoy the bugtracking staff. Otherwise, I\u0027ll need to grep through my backups to find my most recent good save so that I can attach that and a broken save to a bug report.\n\u003C/p\u003E\n"},{"CreatedByName":"Bloody_looser","CreatedById":95664,"CreatedDateTime":"2016-01-17T06:47:59Z","Content":"\n\u003Cp\u003E\nIt\u0027s most likely result of a game crash.\n\u003C/p\u003E\n"},{"CreatedByName":"Plusck","CreatedById":153264,"CreatedDateTime":"2016-01-17T16:44:13Z","Content":"\n\u003Cp\u003E\nIt\u0027s a known issue, but that shouldn\u0027t stop you adding a bug report if you have the logs from when it happened. Your particular situation might be different, and/or might confirm the source of the problem.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s happened to me twice. From what I recall, each time I was switching from one craft to another via the map. The buttons for \u0022target\u0022 and \u0022switch\u0022 were not showing up, so I double-clicked (actually more like triple-clicked) to switch craft. I can\u0027t say for sure that this was the moment the contracts disappeared, because I only noticed while manouvering, but another player has described exactly the same situation.\n\u003C/p\u003E\n\u003Cp\u003E\nSo yes, I\u0027m sure it\u0027ll help if you can provide further details. And in the meantime, if the above paragraph sounds familiar, avoid switching between ships by double-clicking...\n\u003C/p\u003E\n"}]}