{"TopicId":130210,"ForumId":51,"TopicTitle":"THE BARTDON PAPERS - \u0026quot;Cancel all previous directives.\u0026quot;","CreatedByName":"UnusualAttitude","CreatedById":129962,"CreatedDateTime":"2016-01-18T17:50:22Z","PageNum":3,"Articles":[{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2016-03-12T15:39:06Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222453137\u0022 data-ipsquote-contentid=\u0022130210\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221457738287\u0022 data-ipsquote-userid=\u0022129962\u0022 data-ipsquote-username=\u0022UnusualAttitude\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n16 hours ago, UnusualAttitude said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027d like to take advantage of this moment to humbly request your feedback and state your preferences, if any.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nStay with Camwise\u0027s commentary as long as the Muse lets you.  The situations Camwise gets into and the way he describes them remind me very much of some of my favorite books, such as:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\n\u003Ca href=\u0022https://en.wikipedia.org/wiki/The_Flashman_Papers\u0022 rel=\u0022external nofollow\u0022\u003EThe Flashman Papers\u003C/a\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Ca href=\u0022http://www.mcbooks.com/bookstore/catalog.php?set_id=25\u0022 rel=\u0022external nofollow\u0022\u003EThe Otto Prohaska Novels\u003C/a\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Ca href=\u0022https://en.wikipedia.org/wiki/The_Bandy_Papers\u0022 rel=\u0022external nofollow\u0022\u003EThe Bandy Papers\u003C/a\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Ca href=\u0022https://en.wikipedia.org/wiki/The_Good_Soldier_%C5%A0vejk\u0022 rel=\u0022external nofollow\u0022\u003EThe Good Soldier Švejk\u003C/a\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Ca href=\u0022https://en.wikipedia.org/wiki/Candide\u0022 rel=\u0022external nofollow\u0022\u003ECandide\u003C/a\u003E\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nI see this thread as the KSP version of those things.  Please keep doing it \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"UnusualAttitude","CreatedById":129962,"CreatedDateTime":"2016-03-12T19:45:02Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222453896\u0022 data-ipsquote-contentid=\u0022130210\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221457797146\u0022 data-ipsquote-userid=\u002269507\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Geschosskopf said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nStay with Camwise\u0027s commentary as long as the Muse lets you.  The situations Camwise gets into and the way he describes them remind me very much of some of my favorite books, such as:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\n\u003Ca href=\u0022https://en.wikipedia.org/wiki/The_Flashman_Papers\u0022 rel=\u0022external nofollow\u0022\u003EThe Flashman Papers\u003C/a\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Ca href=\u0022http://www.mcbooks.com/bookstore/catalog.php?set_id=25\u0022 rel=\u0022external nofollow\u0022\u003EThe Otto Prohaska Novels\u003C/a\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Ca href=\u0022https://en.wikipedia.org/wiki/The_Bandy_Papers\u0022 rel=\u0022external nofollow\u0022\u003EThe Bandy Papers\u003C/a\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Ca href=\u0022https://en.wikipedia.org/wiki/The_Good_Soldier_%C5%A0vejk\u0022 rel=\u0022external nofollow\u0022\u003EThe Good Soldier Švejk\u003C/a\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Ca href=\u0022https://en.wikipedia.org/wiki/Candide\u0022 rel=\u0022external nofollow\u0022\u003ECandide\u003C/a\u003E\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nI see this thread as the KSP version of those things.  Please keep doing it \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022true\u0022 src=\u0022http://1.1.1.2/bmi/forum.kerbalspaceprogram.com/uploads/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI will try and express the Voltaire that lies hidden within me, then. \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNice reading list. The Bandy Papers definitely looks like something I might enjoy: vintage fighter aircraft being my other unhealthy passion.\n\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2016-03-12T22:55:49Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222454186\u0022 data-ipsquote-contentid=\u0022130210\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221457811902\u0022 data-ipsquote-userid=\u0022129962\u0022 data-ipsquote-username=\u0022UnusualAttitude\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, UnusualAttitude said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI will try and express the Voltaire that lies hidden within me, then. \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNice reading list. The Bandy Papers definitely looks like something I might enjoy: vintage fighter aircraft being my other unhealthy passion.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nGood \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E.  BTW, although Otto Prohaska was a naval officer, he did a hitch in the air force, although you need to read the earlier books in the series to know why.  Other than Candide, though, my favorite series on that list is Flashman.\n\u003C/p\u003E\n"},{"CreatedByName":"UnusualAttitude","CreatedById":129962,"CreatedDateTime":"2016-03-13T22:20:56Z","Content":"\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cstrong\u003EPART TWO: THE VIEW FROM PHOBOS.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cem\u003E\u0022The universe seems neither benign nor hostile, merely indifferent to the concerns of such puny creatures as we are.\u0022\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:right;\u0022\u003E\nCarl Sagan.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nA FEW YEARS EARLIER.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nThe utility dirigeable \u003Cem\u003EVillefranche\u003C/em\u003E powered low over the shore and away from the sun rising over the mountains in the East. Engines throbbing, she sailed out over the ocean. \u003Cem\u003EVillefranche\u003C/em\u003E was one of the most impressive classes of airship ever to rove the skies of Earth, and the pride of the drilling company that owned her. She was used to carry engineers and equipment to and from the offshore platforms around the globe and, when her busy schedule allowed it, was occasionally chartered for scientific missions such as this one.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nOn this morning she was carrying some kind of submersible slung beneath the main crew compartment. It was a small, round vessel with twin ducted propeller engines at the rear and an appendage at the front that looked like the mechanical equivalent to a flattened crab\u0027s claw on the end of a robotic arm. Forward-facing and lateral view ports allowed the crew to examine the ocean\u0027s depths and operate the arm. The engineers used this type of deep-diving submarine to inspect and repair the submerged components of their rigs, and occasionally to salvage valuables from wrecked craft on the ocean floor. Certain scientists were sometimes foolish enough to want to dive into the waters for reasons other than those of dire necessity. The company\u0027s policy was to let them, as they sometimes made discoveries that were useful to their prospection activities, and the scientists were paying the insurance premiums.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cem\u003EVillefranche\u003C/em\u003E\u0027s destination was not far from the shore and just a few minutes after crossing the coastline, the airship\u0027s Coxswain reversed the pitch of the powerful fans and brought her skillfully to a halt in moments. He spun the wheel to turn the craft slowly into the wind whilst letting the engines idle to keep her spot on the coordinates they had been given. Inside the car, two scientists and the Skipper prepared to climb down the access shaft into the submersible. The Skipper was the last to descend and made sure the hatch was properly sealed behind them. He then dropped into the pilot\u0027s seat and began barking orders at the recovery team in the car above them.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Alreet, lads. Away with her!”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Aye, Skip!”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nClamps disengaged with a jolt. A powerful winch began to rotate, letting out cable and allowing the submersible to drop slowly towards the water below. The operation took several minutes, but went flawlessly, as the crew had done all of this a hundred times before and had it down to a fine art. The senior scientist spent the whole time looking anxiously over the Skipper\u0027s shoulder, as if examining the procedure with an intense worried scowl would somehow make things safer. His younger assistant, however, stared out of his lateral port and was transfixed by the ocean rising up to meet them, and by the mesmerizing sight of the swell and spray and the reflection of the low sun scattered by the wave tops.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nThe submersible hit the water with a crash, bobbed for a moment, then settled into a gentle lurch to and fro. More orders were barked, and the cable still attaching them to the airship was released. They were now free to slip beneath the blue waters of the Pacific Ocean.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nThe submarine was state-of-the-art for its day, and the Skipper was one of the most experienced submariners the company had on its payroll. This close to the coast, they were still on the continental shelf, and the waters were shallow here. The weather was calm, and this dive would be only to a depth of well under a hundred meters, whereas the vessel was capable of depths of thousands of metres without being crushed. The Skipper deftly flicked the switches that filled the ballast tanks and the the submarine disappeared beneath the waves for what everyone expected to be a routine trip.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nUp on \u003Cem\u003EVillefranche\u003C/em\u003E\u0027s bridge, the Captain received a message from one of their sister ships further out to sea, warning them of stronger winds and rain inbound from the West. He relayed this information to the Coxswain, and then on to the Skipper via the hydrophone attached to the recovery cable still dangling into the ocean. These two scientists had better make their search brief, whatever they were looking for. Higher winds would make recovering the submarine much more precarious. Half an hour passed, as the Captain paced back and forth on the bridge, waiting for further news about the weather.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nFurther back in the car, a technician from the drilling company had been entrusted with the task of recording the whole of the dive on tape, via the hydrophone link to the submersible. He idly watched the tape spool slowly from one reel to another, but wasn\u0027t really concentrating on what the voices from below the ocean\u0027s surface were saying. Most of the crew hadn\u0027t even been briefed on the precise objectives of the dive. He\u0027d just heard that they were looking for something on the ocean bed, and hoped to raise it using the sub\u0027s claw if this was possible. He\u0027d didn\u0027t even take any notice when the voices of the two scientists became more excited.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nWhat caught his attention and made him grab the headphones to block out the ambient hum of the airship was the familiar sound of the Skipper swearing. On board the airship and surrounded by his crew, the Skipper\u0027s language could be as coarse as that of any ship-mate of the company. He was even well-known for some of his more colourful expressions. But he usually made the effort to hold himself back when in the company of paying customers, especially in the confined space of the sub where his outbursts might be perceived as intimidating for the uninitiated young scientists or stuffy old professors sent by certain academies. Right then, he was clearly resorting to some of the grittiest, less commonly frequented corners of his vocabulary.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nAs the technician listened, the senior scientist seemed to be urging the submariner to get closer to the object they had apparently discovered. Skip was complaining about the amount of silt that the sub had kicked up, and the fact that whatever it was just had to be downstream from them as they made their close approach, didn\u0027t it? But could he do it, the scientist wanted to know, and could they grab the object with the submarine\u0027s mechanical arm?\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Aye, keep yer shert on ser, I\u0027m doin\u0027 me best \u0027ere.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nThat was last thing uttered that the technician could make out clearly, as just a few moments later his ears were blasted by a high-pitched electronic sound that warbled through the hydrophone with intense volume, causing him to reflexively clutch his head and then rip off the headphones with a gasp. The small speaker provided with the tape recorder continued to blare this noise out through the airship\u0027s cabin with surprising intensity for its size. And, barely audible above the strident tones and clicks, the occupants of the submersible shouting. This would be the last time the technician would ever hear the Skipper swear.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Call the Captain!” he shouted at the recovery team nearby, “Something\u0027s gone wrong down there.” He rushed over to the nearest viewing port and looked into the waters below, as if staring at the ocean hard enough would give him some clue as to what was going on nearly forty fathoms down. Behind him, the strange sound still pouring from the speaker came to an end, leaving in its wake a wall of static that could only be caused by churning water below the surface.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nThen a mass of bubbles broke the surface with a mighty bloop, whipping it into a frenzy of foam for a few moments before dying back down. But no submarine, and no Skipper. The technician was dumbstruck. This could only mean one thing: the sub\u0027s hull had been breached. The recovery team started to shout at each other, and a diver got ready to be lowered into the waves.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nAnother ten seconds passed, and then something else was vomited forth from the depths. It was the younger of the two scientists, choking, coughing, and thrashing about wildly in the water. Miraculously, he appeared to have been floated to the surface by the air pocket that had escaped from the submarine before he\u0027d had time to drown.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nDown in the water, Angun flailed his arms and legs, but he was no better at swimming than most Kerbals. When he had choked up water from his lungs enough to recover his voice, he began to cry out to the diver being lowered to pluck him from the ocean.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-12T22:05:36Z\u0022 title=\u002205/12/2016 10:05  PM\u0022 data-short=\u00228 yr\u0022\u003EMay 12, 2016\u003C/time\u003E by UnusualAttitude\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2016-03-14T17:41:53Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222455611\u0022 data-ipsquote-contentid=\u0022130210\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221457907656\u0022 data-ipsquote-userid=\u0022129962\u0022 data-ipsquote-username=\u0022UnusualAttitude\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n19 hours ago, UnusualAttitude said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nPART TWO: THE VIEW FROM PHOBOS.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSuch a vivid picture you paint with words.  No need for screenies \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWhat horror lies beneath?  Can\u0027t wait to find out.\n\u003C/p\u003E\n"},{"CreatedByName":"UnusualAttitude","CreatedById":129962,"CreatedDateTime":"2016-03-14T19:34:40Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222456737\u0022 data-ipsquote-contentid=\u0022130210\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221457977313\u0022 data-ipsquote-userid=\u002269507\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Geschosskopf said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSuch a vivid picture you paint with words.  No need for screenies \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022http://1.1.1.5/bmi/forum.kerbalspaceprogram.com/uploads/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThanks. Phew, good job too.\n\u003C/p\u003E\n\u003Cp\u003E\nI spent far too long writing that last night. And when I\u0027d finished I briefly toyed with the idea of setting up a custom install in 1.0.5 (because... submarines, and I\u0027m still on 1.0.4) with various specific mods (Hooligan Labs, KAS and Infernal Robotics), to build the airship, build the submarine and then grit my teeth through couple of hours of Hyper Edit to get the whole thing into exactly the right place and then refrain from bashing my keyboard to pieces out of frustration with KAS weirdness to lower the sub into the water without everything exploding, all to get a couple of screenshots to illustrate this introduction to part two. Then I looked at the time and thought \u0022\u003Cem\u003EWeeeell\u003C/em\u003E, you guys can just use your imagination for once.\u0022 \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"max_creative","CreatedById":159640,"CreatedDateTime":"2016-03-16T16:16:05Z","Content":"\n\u003Cp\u003E\nI think this is really cool, comment, shouldn\u0027t it be sols not days because days is 24 hours on earth. Sols is just from the time rises one day to the time the sun rises the next day.\n\u003C/p\u003E\n"},{"CreatedByName":"UnusualAttitude","CreatedById":129962,"CreatedDateTime":"2016-03-16T18:44:54Z","Content":"\n\u003Cp\u003E\nHey! Thanks! \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIf you\u0027re referring to the date at the top of each log, that is just the date (universal time) in my save when the action takes place or when Camwise gets a chance to write about things that happened previously. To keep track of passing time, particularly now that we will be visiting other bodies with days of different durations, it\u0027s just more simple to stick with days. \n\u003C/p\u003E\n\u003Cp\u003E\nOtherwise, yes, on an alien planetary body you should use Sols. Although on the Moon you could use Months I suppose... \n\u003C/p\u003E\n\u003Cp\u003E\nThanks for reading.  More tomorrow. Probably.  \n\u003C/p\u003E\n"},{"CreatedByName":"max_creative","CreatedById":159640,"CreatedDateTime":"2016-03-16T18:48:26Z","Content":"\n\u003Cp\u003E\nOh yeah, on the moon (or mun) it should be months. On kerbin days, and anywhere else sols.\n\u003C/p\u003E\n"},{"CreatedByName":"UnusualAttitude","CreatedById":129962,"CreatedDateTime":"2016-03-17T12:39:20Z","Content":"\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nYEAR 6, DAY 98. CAMWISE.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nFinally! This is the first chance I\u0027ve had to write since leaving Drygalski, and you cannot imagine how glad I am to be sitting behind my desk again in one piece. When we got in, I half expected to discover that my colleagues had given me up for dead and taken over my office, and that I would have to pester Froemone to get my favourite slide-rule back and clear a pile of Karanda\u0027s designs off of my desk and into the waste-paper basket where they belong. But to my surprise, everything seemed to be as it had been when I left, except the potted plant on my filing cabinet that was now quite a bit closer to wherever it is potted plants go after they die.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nEven after our capsule touched down, I\u0027d thought we\u0027d never make it. As I\u0027m sure you all heard on the newsflash, we re-entered way off course, got the periapsis altitude wrong – again – and bounced back off into space for another lap. \u003Cem\u003EFaure\u003C/em\u003E just didn\u0027t want to come home that day, it seemed. The second time round we hit the atmosphere above Africa and screamed right over the Middle East into Asia. Things would have gone better if the Himalayas hadn\u0027t been in the way.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nAfter a desperate attempt by Catbeth to get a blunt, capsule-shaped object to fly by adjusting its pitch angle, we managed to extend our glideslope enough to make it over the first row of peaks and pop our drogue chute above a mountain pass. We were still way above the normal altitude for our parachutes to work correctly, and if it hadn\u0027t been for a deep snow drift and the cushioning demise of the remains of our heat-shield, I wouldn\u0027t be here to tell you about it. And still, we weren\u0027t out of the woods yet...\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nWe first had to get a message back to mission control with our precise coordinates so that they knew where to look for us, but \u003Cem\u003EFaure\u003C/em\u003E\u0027s command module was equipped only with a stubby short-range omni antenna, and we would have to wait for one of the polar satellites to pass overhead as we didn\u0027t have the power to reach the geostationary network. One finally buzzed us, just minutes before the capsule\u0027s battery packed in for good, and we managed to make it understood that we had survived, give a detailed enough description of our location, and convince mission control that we weren\u0027t just kidding them when we said we had landed in the Himalayas, like, \u003Cem\u003Efor real.\u003C/em\u003E Then, once the radio lapsed back into terminal silence, we sat back and waited. The cold began to seep into the capsule.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nI\u0027d guessed it would take them quite a while to reach us. The nearest runway was more than a thousand kilometres away in Sriharikota, and there was no chance of landing a plane anywhere near our location. It would have to be a dirigeable, then. But I suspected we were also way above any reasonable operating altitude for an airship, and they might have to drop a land vehicle to drive the last stretch. Hell, we might even end up walking, which was something I was not looking forward to. After spending six weeks between micro-gravity and one sixth of a gee I felt like a ton of bricks, and the last thing we needed was a mountain hike.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nWe\u0027d landed just before sunset, and night came and went, and the cold sank into our bones. At sometime around mid morning, a long-range jet thundered low overhead and air-dropped a hefty looking package of what we assumed were emergency supplies and warm clothing several hundred metres away to the south. After impacting the valley floor it bounced away down the steep slope and, still rolling, disappeared unhelpfully into the distance.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg src=\u0022http://i.imgur.com/4bF8rc5.png?2\u0022 class=\u0022ipsImage\u0022 alt=\u00224bF8rc5.png?2\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nI will spare you the account of two more days of misery, but I will just say that it got to the point where we were mere hours away from drawing straws to decide which one of us would get to eat the other, so that at least one might survive until help arrived. Then we\u0027d heard the sound of the engine of an approaching vehicle making its way up the valley. I\u0027d be spared the conundrum of how to cook my pilot whilst stuck up a frozen mountain side with no matches. What followed was a two day long teeth-rattling journey in the back of a noisy all terrain vehicle, another day by airship (which was slightly more comfortable), and finally a few hours hypersonic across Asia and the Pacific to Omelek.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg src=\u0022http://i.imgur.com/lCD3OVr.png?1\u0022 class=\u0022ipsImage\u0022 alt=\u0022lCD3OVr.png?1\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nThey had all sorts of medical examinations to put us both through the moment we set foot back on the Island. I was barely left alone for another three days. But strangely enough, the one person who I didn\u0027t expect to leave me alone gave me a wide berth during this time. Angun had made just a brief and symbolic appearance at our official reception back at Omelek, before disappearing off back to his lab. He hadn\u0027t attempted to contact me since and I\u0027d just assumed that now he knew I wasn\u0027t going anywhere, he was in no hurry to hear my report for some reason. I certainly wasn\u0027t in any hurry to see him, as I would be spending far too much time in his company during the two years ahead.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg src=\u0022http://i.imgur.com/JnjS2wH.png\u0022 class=\u0022ipsImage\u0022 alt=\u0022JnjS2wH.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nIn any case, I was far more interested in catching up on the state of the hardware that was being launched for the trip to Mars. This of course was not merely out of professional interest, as my life would once again depend on how well it worked, and before leaving for the Moon I had left instructions for designs that should be fool-proof and enjoy a complete lack of frilly nonsense. This might sound a bit rich coming from the engineer who\u0027d decided that horizontal take-offs on an airless Moon were a Thing, but there would be no backups this time, and no drilling or refueling. We didn\u0027t know enough about our destination to count on anything being usable in situ. The remaining launch capacity we had to spare before the window was not sufficient to go for a complex, heavy mission anyway.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nThe little detailed knowledge we possessed about the Red Planet and its moons came from a fleet of three probes that had been launched during the same window more than two years ago. After a nine-month cruise, \u003Cem\u003EVers\u003C/em\u003E Eight had been the first to enter orbit over the poles. The \u003Cem\u003EVers\u003C/em\u003E family was our standard interplanetary pioneering probe and this one was quite similar to the first satellites we had sent to orbit the Moon but with a more powerful dish. Once captured, she began mapping the surface and taking pictures that would allow us to select future landing sites.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg src=\u0022http://i.imgur.com/n6io16X.png?2\u0022 class=\u0022ipsImage\u0022 alt=\u0022n6io16X.png?2\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nAnother probe, \u003Cem\u003EBach\u003C/em\u003E, was injected into a higher orbit and made a more detailed radar map of the surface, allowing Margaret and her team to trace out the main geological formations. The question of subsurface water or ice was raised, but we couldn\u0027t be sure if it was there until we had some surface samples to go on, or at least a rover on the ground. This meant the first mission would have to be completely self-sufficient in terms of fuel if we landed, or that we would have to content ourselves with orbiting the planet first to get a better look at what resources would be available to produce fuel. The CO2 atmosphere meant that producing methane was an option, but we\u0027d still need to take the hydrogen with us, or find it locally. Since we hadn\u0027t yet mastered the deceptively tricky art of putting hydrogen into a recipient and keeping it in there for any meaningful length of time, we had decided that our first crewed journey to Mars would not land on the surface.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg src=\u0022http://i.imgur.com/Qdx1CKR.png?2\u0022 class=\u0022ipsImage\u0022 alt=\u0022Qdx1CKR.png?2\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nThe most memorable moment of this first journey to Mars was our first landing on an alien world other than our own Moon, a feat accomplished by a plucky little probe called \u003Cem\u003EEscamps\u003C/em\u003E. Aiming for Phobos had been tricky, as it was an absolutely tiny target. Landing on it had been pure guesswork due to its rapid rotation and negligible gravitational field. By the time our probe drifted gently down onto its crazy terrain, our planned landing site inside its largest crater Stickney had long since passed it by and \u003Cem\u003EEscamps\u003C/em\u003E came to ground on a twenty degree slope well outside the crater\u0027s rim.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg src=\u0022http://i.imgur.com/4l06sMm.png\u0022 class=\u0022ipsImage\u0022 alt=\u00224l06sMm.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nThe telemetry showed that the probe had cartwheeled on the spot for a few minutes while its gyroscope tried to figure out which way was down, until we decided that it was probably never going to make up its mind and switched its inertial guidance off. As luck would have it, \u003Cem\u003EEscamps\u003C/em\u003E settled upright and returned the first images of this strange world. It had transmitted data for more than an hour until the landing site had rotated out of reach of our network. It would be the first and only transmission we would get from Phobos, as subsequent attempts to contact the probe had all failed.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg src=\u0022http://i.imgur.com/mRROfws.png\u0022 class=\u0022ipsImage\u0022 alt=\u0022mRROfws.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nDespite this, we\u0027d determined that Phobos would be a great place to start exploring and that we should include a lander in our mission. With a tiny amount of storeable hypergolic fuel, we would probably be able to bounce around it for ages, and take a significant proportion of it back to Earth with us in our sample canisters.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg src=\u0022http://i.imgur.com/N0xoNIa.png\u0022 class=\u0022ipsImage\u0022 alt=\u0022N0xoNIa.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nMeasurements of Phobos\u0027 gravity also told us that its total density was far lower than that of the dusty and rocky material we\u0027d seen on the surface. This meant that either its subsurface contained much lighter material - such as water ice - or that it was hollow and when we landed on it we would discover that it was in fact an intergalactic alien mothership. This latter hypothesis failed to convince me, as I didn\u0027t believe that any self-respecting advanced civilization would stoop so low as to travel between the stars in something that looks like a potato. Whatever its true nature turned out to be, Froemone couldn\u0027t wait for us to drill holes in it and start looking for fuel. If we could extract it, it would make conquering Mars a hell of a lot easier.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nMy train of thought was interrupted by a brief phone call from Angun\u0027s assistant, requesting that I attend a meeting with the team of Investigators at nine the following morning. I briefly considered inventing an excuse to wriggle out of the appointment – such as having to interview candidates to look after my potted plant while I was away on an interplanetary trip – but decided that this was just delaying the inevitable, and I confirmed that I would be present.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Who will look after you, then..?” I mused out loud to my office greenery, as I got up from my desk to gaze out of the window at the island and the vast expanse of the Pacific Ocean beyond. “Not Froemone, he\u0027ll try and synthesize biofuel out of you, or something. Maybe Karanda will do it? She has to be good at \u003Cem\u003Esomething\u003C/em\u003E...”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"UnusualAttitude","CreatedById":129962,"CreatedDateTime":"2016-03-21T22:33:39Z","Content":"\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nYEAR 6, DAY 99. CAMWISE.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nAfter strolling along the beach for half an hour after breakfast to enjoy the sound of the tide coming in, the warm wind on my face, and the salty smell of the ocean while I still could, I knocked on the door of Angun\u0027s office at a quarter past nine sharp. I was ushered in by his assistant who looked desperately relieved to see that I had in fact chosen to turn up at the appointment, and who consequently would not have to put up with her superior\u0027s displeasure at my absence and scurry round the space centre trying to track me down for another rendez-vous.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nThe Investigation Team this morning consisted of Principal Investigator Angun, who was sitting behind his large and rather pretentious marble-topped desk, and Investigator of Planetary Science Margaret who was standing by the bay window that looked eastwards towards the launch pad. She sat down by the desk as I came in and Angun gestured at me to take another chair in front of him.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nAngun was one of those people who liked to keep you guessing, and the fact that he had waited a full week after my return to summon me to this meeting was typical of his behavior. On some days he was full of dry, witty charm, on others he could be as blunt and uncompromising as the back of a shovel. There was no middle ground, and there was no way of telling which way things would go on a given day. He was a master of many scientific disciplines, but above all he had spent many years studying the biology of our planet. Few living Kerbals had traveled around the globe more than he had, studying life from polar microbes to deep-sea plankton, and pointing out that things were not as they should be if the geologists were right and that our planet had been here for more than four and a half billion years. He had been one of the first scholars to be taken seriously when suggesting that maybe we should start looking for answers elsewhere than on our home planet, which is how he\u0027d eventually become the lead scientist at Omelek.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022xuYByzW.png?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/xuYByzW.png?1\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nHis colleague Margaret was a much more predictable character and was generally considered to be the motherly figure of our space programme, well-liked by most of her colleagues. Like Angun, she was also a true explorer and had roamed the surface of the Earth from the Kalahari Craton to the Siberian Traps, trying to unravel its mysteries. Her considerable knowledge of how our planet works had earned her a place as the lead geologist of our team and the second scientist to set foot on the surface of the Moon.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022j33pIPc.png?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/j33pIPc.png?1\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nIt was Angun who broke the rather weighty silence. “Good morning, Camwise. First of all, allow me to congratulate you for making it home safely despite a few... setbacks. We were all quite impressed by your resourcefulness up there at Drygalski. Will you take some tea?”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nOh, it was one of his good days, I thought as he poured tea for Margaret and myself. \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“I was expecting to see Bartdon and Steledith here too,” I advanced cautiously.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Bartdon is extremely busy with preparations for our upcoming mission,” Angun replied. “Other projects are scheduled in our absence. As you may know, Bartdon will be in charge of the team while I am away. Steledith was invited to join us but probably forgot about the appointment, you know how she can be. Life will go on here without us, Camwise. Besides, there are a few things I wanted to talk about that are directly related to our journey to Mars. For now, they need only concern the participants in this voyage.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nOh dear, that sounded a little sinister, I thought. Out loud, I said “I was under the impression that you wanted to hear my account of what happened at Bailly crater.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nMargaret spoke gently. “We have read your report, Camwise. We know you experienced a very traumatic event. We have also spoken to your pilot, Catbeth. Have you recalled any additional details since your return to Earth?”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“I\u0027m afraid not,” I admitted.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“No matter,” Angun waved a hand and continued. “Our team will return to the Moon, most likely before we return from Mars, and a better-prepared mission should bring more answers. Naturally, you must understand that the discovery you made is of the utmost importance and will ensure that our projects continue to be funded by our sponsors. If you were right in guessing that what you saw is a ship of alien origin, then it represents the undeniable proof that life beyond the surface of our planet is possible, and I\u0027m sure that there will be many potential investors. But there is something else I wanted to ask you about.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Yes?”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Your medical report states that you have been experiencing some discomfort since your blackout at Bailly.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nUh-oh. So, Angun had access to my medical records now. I was pretty sure there were confidentiality rules covering all things related to health issues that didn\u0027t directly affect mission safety. But I was also pretty sure that people like Angun knew their way around these rules...\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“You described your sleep being troubled by unusual tones and rhythmical clicks that may or may not be psychosomatic. Do you still suffer from these symptoms?”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nAfter a moment\u0027s hesitation, I admitted “Yes... occasionally.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nAngun and Margaret looked at each other for a moment and seemed to communicate silently. This was getting more sinister by the minute. Margaret nodded almost imperceptibly, then Angun pulled open a draw in his office desk and produced a small tape recorder that he set on the desk in between us.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Camwise, I would like you to listen to this recording carefully and tell me if the noise you experience is in any way similar to it,” he said and pressed the play button.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedOther\u0022 contenteditable=\u0022false\u0022\u003E\n\u003Ciframe data-controller=\u0022core.front.core.autoSizeIframe\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/?app=core\u0026amp;module=system\u0026amp;controller=embed\u0026amp;url=https%3A%2F%2Fsoundcloud.com%2Fmurray-le-minus%2F2016-03-21-215110a\u0022 style=\u0022height:416px;\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nThe shrill tones of the signal cut through the tense atmosphere in Angun\u0027s office like a knife. There was no need to voice a reply, as the look on my face certainly betrayed the fact that I recognized it instantly as the same type of noise that had haunted my nights - and sometimes my days - ever since I had approached the ship on the surface of the Moon. It certainly began with the same characteristic pattern of notes, but I couldn\u0027t be sure that the whole sequence was identical. It lasted for nearly two minutes before ending abruptly, leaving a deafening silence.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Where was that recording made?” I finally asked.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nAngun hesitated for a moment before he replied. “In the Pacific Ocean, not far from the coast of South America. Thirty-two years ago.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“On \u003Cem\u003EEarth\u003C/em\u003E?”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Yes. I was still a student then and my tutor was a leading expert studying marine biology. He had compiled thousands of underwater sound recordings made around the world and had noticed that a strange background noise was present in some of them. We carried out additional recordings and used triangulation to track down the origin of the sound to a precise spot. We then dived in a submersible to investigate and found... an artifact. We managed to grasp it with the sub\u0027s salvaging claw...” \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nHe paused at this point, and for the first time since I had met him, Angun seemed to show visible emotion. “Then there was an accident, or at least at the time I had assumed it was an accident. The sub\u0027s hatch was equipped with an emergency release system that activated at a depth of eighty metres. I was lucky enough to escape to the surface. My tutor and the submarine\u0027s Captain didn\u0027t make it. We did get the whole dive on tape, however, and the underwater microphone picked up this noise the moment the accident happened.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nI was stunned that Angun had never mentioned this incident, nor had any other member of the investigation team. He seemed to guess this and continued.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Camwise, you must understand that for many years I had nothing to prove that the death of my tutor and the loss of a drilling company\u0027s submarine was due to anything other than a design flaw or some kind of mechanical failure from the sub itself, except for an unidentified noise on a strip of magnetic tape. The mining companies are powerful and they certainly did not appreciate losing their equipment and their personnel during a scientific research mission entirely unrelated to their usual more profitable activities. For quite a while I suspected some kind of elaborate hoax, or that I had been caught up in a sabotage attempt between rival companies. I certainly did not become Principal Investigator of this project by passing for a crackpot in search of hidden truth, so I kept this to myself until recently. However, I did come to realize that the noise you\u0027ve just heard is some kind of encoded signal, and I attempted to decipher it.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“And it\u0027s some kind of message?”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“It\u0027s better than that,” said Angun, pulling a piece of photographic paper out of his desk draw. “It\u0027s a picture.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg src=\u0022http://i.imgur.com/iDYe2yJ.png\u0022 class=\u0022ipsImage\u0022 alt=\u0022iDYe2yJ.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cbr\u003E\nI stared at the picture for a long while, with its world-shattering implications racing through my mind, before looking back up at Angun. “But the object you found on the ocean floor, what did it look like?\u0022\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nHe gazed back at me thoughtfully, as if he was still considering the matter. “It was a slab of some sort of black material, perfectly smooth. It looked like a kind of monument, but when I caught a brief glimpse of it through the submersible\u0027s viewing port, my first thought was that it looked like a tombstone.”\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-03-22T16:07:06Z\u0022 title=\u002203/22/2016 04:07  PM\u0022 data-short=\u00228 yr\u0022\u003EMarch 22, 2016\u003C/time\u003E by UnusualAttitude\u003C/strong\u003E\n\u003Cbr\u003EBetter discombobulation of the whatnot.\n\u003C/span\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2016-03-22T03:25:34Z","Content":"\n\u003Cp\u003E\nAh, so we finally see how the submarine accident plays in.  I was expected that to have been in the current timeframe.\n\u003C/p\u003E\n\u003Cp\u003E\nVery interesting.  I\u0027m still trying to guess what the picture is.  The Duna Pyramid perhaps?  But I was there recently and it\u0027s not on a flat plain like that, but is surrounded by high hills.\n\u003C/p\u003E\n\u003Cp\u003E\nDid you make that SCTV recording yourself?  That\u0027s pretty cool \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"UnusualAttitude","CreatedById":129962,"CreatedDateTime":"2016-03-22T07:26:05Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222468004\u0022 data-ipsquote-contentid=\u0022130210\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458617134\u0022 data-ipsquote-userid=\u002269507\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Geschosskopf said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAh, so we finally see how the submarine accident plays in.  I was expected that to have been in the current timeframe.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOops. Yeah. For the submarine incident I dropped a voluntarily vague time stamp (\u0022Before\u0022) and made some references to Angun being a young and junior scientist rather than the top dog of a space program and hoped it would be evident. Obviously not... I might go back and edit.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222468004\u0022 data-ipsquote-contentid=\u0022130210\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458617134\u0022 data-ipsquote-userid=\u002269507\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Geschosskopf said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022line-height:1.6;\u0022\u003EVery interesting.  I\u0027m still trying to guess what the picture is.  The Duna Pyramid perhaps?  But I was there recently and it\u0027s not on a flat plain like that, but is surrounded by high hills.\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nRemember, this is RSS. Anomaly coordinates are the same but the surrounding terrain might be very different. \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222468004\u0022 data-ipsquote-contentid=\u0022130210\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458617134\u0022 data-ipsquote-userid=\u002269507\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Geschosskopf said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022line-height:1.6;\u0022\u003EDid you make that SCTV recording yourself?  That\u0027s pretty cool \u003C/span\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 style=\u0022line-height:1.6;\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah,  there are all sorts of apps out there to read and generate SSTV, even for mobile devices.  I\u0027m still trying to get a better quality image though. \n\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2016-03-22T19:05:16Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222468157\u0022 data-ipsquote-contentid=\u0022130210\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458631565\u0022 data-ipsquote-userid=\u0022129962\u0022 data-ipsquote-username=\u0022UnusualAttitude\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 hours ago, UnusualAttitude said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nRemember, this is RSS. Anomaly coordinates are the same but the surrounding terrain might be very different. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAh, OK.  So, the monolith off South America is the one at KSC?\n\u003C/p\u003E\n"},{"CreatedByName":"UnusualAttitude","CreatedById":129962,"CreatedDateTime":"2016-03-22T20:16:49Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222468711\u0022 data-ipsquote-contentid=\u0022130210\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458673516\u0022 data-ipsquote-userid=\u002269507\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Geschosskopf said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAh, OK.  So, the monolith off South America is the one at KSC?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI think it\u0027s supposed to be the one that is in the mountains west of the KSC.\n\u003C/p\u003E\n"},{"CreatedByName":"Mjp1050","CreatedById":159323,"CreatedDateTime":"2016-03-22T23:31:17Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222468804\u0022 data-ipsquote-contentid=\u0022130210\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458677809\u0022 data-ipsquote-userid=\u0022129962\u0022 data-ipsquote-username=\u0022UnusualAttitude\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, UnusualAttitude said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI think it\u0027s supposed to be the one that is in the mountains west of the KSC.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWait - when did the mountains get a monolith?\n\u003C/p\u003E\n"},{"CreatedByName":"UnusualAttitude","CreatedById":129962,"CreatedDateTime":"2016-03-23T00:07:59Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222469099\u0022 data-ipsquote-contentid=\u0022130210\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458689477\u0022 data-ipsquote-userid=\u0022159323\u0022 data-ipsquote-username=\u0022Mjp1050\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n38 minutes ago, Mjp1050 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWait - when did the mountains get a monolith?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt has been there for as long as I\u0027ve been playing KSP \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s usually hidden under the surface of one of the southernmost peaks of the mountain range west of the KSC on stock Kerbin. Use ScanSat to pinpoint its location.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-03-23T00:09:53Z\u0022 title=\u002203/23/2016 12:09  AM\u0022 data-short=\u00228 yr\u0022\u003EMarch 23, 2016\u003C/time\u003E by UnusualAttitude\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Mjp1050","CreatedById":159323,"CreatedDateTime":"2016-03-23T01:20:44Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222469151\u0022 data-ipsquote-contentid=\u0022130210\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458691679\u0022 data-ipsquote-userid=\u0022129962\u0022 data-ipsquote-username=\u0022UnusualAttitude\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, UnusualAttitude said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt has been there for as long as I\u0027ve been playing KSP \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s usually hidden under the surface of one of the southernmost peaks of the mountain range west of the KSC on stock Kerbin. Use ScanSat to pinpoint its location.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAn underground monolith. Hmmmmm...\n\u003C/p\u003E\n\u003Cp\u003E\nI must investigate further.\n\u003C/p\u003E\n\u003Cp\u003E\nThanks!\n\u003C/p\u003E\n"},{"CreatedByName":"UnusualAttitude","CreatedById":129962,"CreatedDateTime":"2016-03-24T23:29:58Z","Content":"\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nYEAR 6, DAY 113. CAMWISE.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nMy meeting with Angun and Margaret had raised as many questions as it had answered, but at least I now knew why they were so desperate to reach Mars. In just a few short weeks we had gone from wondering whether we were alone in this universe, to wondering when we would stumble upon the next piece of memorabilia discarded by careless (but clearly intelligent) aliens in our own cosmic backyard. Angun\u0027s picture of the Martian surface clearly showed some sort of pyramidal structure rising unnaturally from the centre of an otherwise empty plain, and the multi-spectral scans and radar data from our orbiters had allowed us to narrow down the list of candidates to just a couple of possible sites. With this new insight, I got straight back to work in the knowledge that only two months remained before the transfer window.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nThere was certainly no shortage of enthusiasm and progress from the team. A major breakthrough was the fact that Froemone had finally figured out how to get our ship \u003Cem\u003ECernin\u003C/em\u003E to and back from Mars without needing to stop off at a gas station on the way, which was good news as that was a commodity that clearly seemed to be lacking in that part of the solar system. Our interplanetary cruiser would be boosted out from Low Earth Orbit where she was currently parked by a couple nuclear thermal rockets and their corresponding liquid methane tanks. Once we had corrected our course using any remaining fuel that hadn\u0027t leaked off into the vacuum, and that we were sure that our trajectory would intercept Mars, we would ditch these two tanks in deep space and hope that the Red Planet would be kind enough to kick them into an orbit that never came anywhere near Earth\u0027s. That might sound like we were tempting fate just a little, but hey, the aliens were leaving their stuff all over the place, so why couldn\u0027t we? From what we were seeing, it certainly seemed like a civilisation\u0027s level of technological prowess should be judged by the amount of junk it leaves lying around the solar system...\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nMars insertion, and the return journey nearly two and a half years from now, would be ensured by a large tank of hypergolic fuel. Experience with some of our probes that had been in space for years now had shown us that the mixture of Aerozine and NTO we used could be relied on to stay put even after very long periods of time. Fully fueled with both the departure and return stage, \u003Cem\u003ECernin\u003C/em\u003E would weigh in at over two hundred tonnes, about half of which would be burned off to get us to Mars in the first place.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nThe storeable fuel tank had been launched while Catbeth and I were still stuck up in the mountains after returning from the Moon. The two liquid methane tanks would be sent up in quick succession via the two remaining launches we could fit in before the transfer window with our heavy lifter \u003Cem\u003EPrayssac\u003C/em\u003E, and would be topped off by our spaceplane just before \u003Cem\u003ECernin\u003C/em\u003E broke orbit. None of these launches could be allowed to fail if we were to make it to Mars this year.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg src=\u0022http://i.imgur.com/XOzBJ0n.png?1\u0022 class=\u0022ipsImage\u0022 alt=\u0022XOzBJ0n.png?1\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nThe Martian rover team had their own share of good news, however. Following the old adage “if it ain\u0027t broke, don\u0027t fix it”, they had managed to squeeze our \u003Cem\u003EType G\u003C/em\u003E lunar rover into a fairing and add a hypergolic transfer stage that was compatible with our SSTO payload limit of 15 tonnes. This meant that rovers to Mars were now ten-a-penny, relatively speaking of course, as the launch costs were low and the \u003Cem\u003EType G\u003C/em\u003E was the closest thing we had to mass production. \u003Cem\u003EType G\u003C/em\u003Es Seven through Nine were slated for launch, followed by more if the workshop could churn them out in time.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u00226NtaNaO.png\u0022 src=\u0022http://i.imgur.com/6NtaNaO.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nSo, there remained only the prickly question of the Phobos lander, and work had started on this design rather late in the day. I knew little about what the team had come up with until this morning when I was invited to the launch pad to witness the first functional tests: only that it would be launched and transfer to Mars separately from \u003Cem\u003ECernin\u003C/em\u003E (we would rendez-vous with it in high Martian orbit), and that it was compatible with our 50 tonne \u003Cem\u003EDuravel\u003C/em\u003E booster.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nSo, at ten thirty sharp, Froemone met me at my office and rode with me to the launch pad where the VAB\u0027s latest offering awaited my critical eye. And judging by the fact that Froe was fidgeting, avoiding direct eye contact and uhmming even more than usual, I understood that I should probably expect the worst. While I drove, he was rambling on about the vagueness of the mission requirements on Phobos.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Uhm... we had to take into account the fact that the flight profile... uhm... has not yet been specified. We had a very short deadline, so uhm... we couldn\u0027t afford to design from scratch. We had to adapt a previously used lander uhm...”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nFortunately the ride was a short one and we pulled up near the launch pad where the technicians were busy around the \u003Cem\u003ECéré \u003C/em\u003Elander vehicle that would enable the first of my kind to walk on another world after an interplanetary journey. I stepped out of the car and squinted into the morning sun.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022dRmWaAE.png\u0022 src=\u0022http://i.imgur.com/dRmWaAE.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“You didn\u0027t...” I began.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Uhm...” cut in Froemone. “We used a much smaller fuel tank since the delta-V requirements on Phobos will be tiny and uhm... the vehicle has a much lower centre of gravity than the lander that you took to the Moon, uhm...”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nPoor Froemone: he was standing in for Karanda since at that moment she was in low Earth orbit herself to supervise the docking procedures that would enable \u003Cem\u003ECernin\u003C/em\u003E to leave for Mars, and would therefore be spared the embarrassment of explaining that our Phobos lander was merely a spin-off of the vehicle that had flopped so ungracefully onto the Moon\u0027s surface a few weeks ago.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Look, uhm... it has harpoons that will anchor you to the surface...”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nWell, the gravity on that rock had better be kind to us when we touch down.\n\u003C/p\u003E\n\u003Cp align=\u0022justify\u0022 style=\u0022margin-bottom:0in;font-style:normal;line-height:100%;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-03-24T23:54:27Z\u0022 title=\u002203/24/2016 11:54  PM\u0022 data-short=\u00228 yr\u0022\u003EMarch 24, 2016\u003C/time\u003E by UnusualAttitude\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Mad Rocket Scientist","CreatedById":139256,"CreatedDateTime":"2016-03-25T00:08:31Z","Content":"\n\u003Cp\u003E\nNice SSTO!  And of course, great story.\n\u003C/p\u003E\n"},{"CreatedByName":"UnusualAttitude","CreatedById":129962,"CreatedDateTime":"2016-03-25T00:19:15Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222472343\u0022 data-ipsquote-contentid=\u0022130210\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458864511\u0022 data-ipsquote-userid=\u0022139256\u0022 data-ipsquote-username=\u0022Mad Rocket Scientist\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 minutes ago, Mad Rocket Scientist said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNice SSTO!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nShhhh! Just don\u0027t tell anyone from the RSS/RO gang that the engine is uhm... completely made up... Well not quite, I borrowed the specs from the Reaction Engines Ltd SABRE. Except this one breathes liquid methane, which uhm... is all the rage these days. Uhm... \n\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2016-03-25T04:01:31Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222472300\u0022 data-ipsquote-contentid=\u0022130210\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458862198\u0022 data-ipsquote-userid=\u0022129962\u0022 data-ipsquote-username=\u0022UnusualAttitude\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, UnusualAttitude said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nYEAR 6, DAY 113. CAMWISE.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n.....we would ditch these two tanks in deep space and hope that the Red Planet would be kind enough to kick them into an orbit that never came anywhere near Earth\u0027s. That might sound like we were tempting fate just a little, but hey, the aliens were leaving their stuff all over the place, so why couldn\u0027t we? From what we were seeing, it certainly seemed like a civilisation\u0027s level of technological prowess should be judged by the amount of junk it leaves lying around the solar system...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhich means that future generations shall agree with my own very low assessment of this totally worthless and ludicrously misguided era of human history.  Littering is now a crime and people are encouraged, even required by force of tyrannical law, to recycle their trash.  In the future, the 21st Century will be regarded as the Darkest of the Dark Ages, a time in which Humanity must have been reduced to a handful of hunter-gatherers.  This because no evidence of our physical presence will survive, and all of our cloud-based knowledge will be wiped out by the next Windows upgrade or a solar flare, take your pick.  Parents, do whatever it takes to discourage your children from becoming archaeologists because that profession is doomed to go the way of flintknappers and wainwrights :\u003Cimg alt=\u0022:huh:\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 title=\u0022:huh:\u0022\u003E\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, UnusualAttitude said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Look, uhm... it has harpoons that will anchor you to the surface...”\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI foresee much suffering in Camwise\u0027s future \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"UnusualAttitude","CreatedById":129962,"CreatedDateTime":"2016-03-25T11:03:44Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222472641\u0022 data-ipsquote-contentid=\u0022130210\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458878491\u0022 data-ipsquote-userid=\u002269507\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, Geschosskopf said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhich means that future generations shall agree with my own very low assessment of this totally worthless and ludicrously misguided era of human history.  Littering is now a crime and people are encouraged, even required by force of tyrannical law, to recycle their trash.  In the future, the 21st Century will be regarded as the Darkest of the Dark Ages, a time in which Humanity must have been reduced to a handful of hunter-gatherers.  This because no evidence of our physical presence will survive, and all of our cloud-based knowledge will be wiped out by the next Windows upgrade or a solar flare, take your pick.  Parents, do whatever it takes to discourage your children from becoming archaeologists because that profession is doomed to go the way of flintknappers and wainwrights :\u003Cimg alt=\u0022:huh:\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 title=\u0022:huh:\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nDark times indeed, but have faith in 21st century mankind\u0027s ability to scatter waste on the \u003Ca href=\u0022https://www.google.fr/?gws_rd=ssl#q=waste\u002Bon\u002Beverest\u0022 rel=\u0022external nofollow\u0022\u003Etallest mountain tops \u003C/a\u003Eand across the \u003Ca href=\u0022https://en.wikipedia.org/wiki/Great_Pacific_garbage_patch\u0022 rel=\u0022external nofollow\u0022\u003Ewidest oceans\u003C/a\u003E. And may Elon Musk fullfill his dream of allowing us to sow our refuse across the plains and fill in the canyons of the Red Planet! Future archeologists will just have to be a little more adventurous.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222472641\u0022 data-ipsquote-contentid=\u0022130210\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458878491\u0022 data-ipsquote-userid=\u002269507\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, Geschosskopf said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI foresee much suffering in Camwise\u0027s future \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSir, surely you are not suggesting that I would be so cruel as to....\n\u003C/p\u003E\n\u003Cp\u003E\nNow you mention it, though....\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2016-03-26T15:47:04Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222472830\u0022 data-ipsquote-contentid=\u0022130210\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458903824\u0022 data-ipsquote-userid=\u0022129962\u0022 data-ipsquote-username=\u0022UnusualAttitude\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 3/25/2016 at 6:03 AM, UnusualAttitude said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSir, surely you are not suggesting that I would be so cruel as to....\n\u003C/p\u003E\n\u003Cp\u003E\nNow you mention it, though....\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nMuhahahaha!\n\u003C/p\u003E\n"},{"CreatedByName":"UnusualAttitude","CreatedById":129962,"CreatedDateTime":"2016-03-29T23:34:47Z","Content":"\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nYEAR 6, DAY 160. CAMWISE.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nThis evening, we shall send up more than fifty tonnes of liquid methane propellant for \u003Cem\u003ECernin\u003C/em\u003E\u0027s Earth departure stage on the final mission critical launch of our crewed trip to Mars. The rocket, our largest, is a \u003Cem\u003EPrayssac\u003C/em\u003E type booster carrying the second methane tank for our interplanetary ship, as well as the nuclear thermal rocket that goes behind it, and the mono-propellant tug that will help maneuver it into place along side the insertion and return stage, already orbiting three hundred and fifty kilometers above us.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nThe technicians have already been at work for many hours to make sure that more than one thousand tonnes of fuel tankage filled with natural gas, liquid hydrogen and oxygen, and a sprinkling of guidance systems added for good measure, will fly through the atmosphere and into space intact at speeds difficult to comprehend by any sane intellect. By now, most of my colleagues will be locked inside mission control, staring anxiously at data-filled screens in a dimly lit room, as mere powerless spectators wringing their hands as the seconds count slowly down to lift-off.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022ZjM25av.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/ZjM25av.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nI really should have been there with them, scouring the data for the slightest sign that any one of the thousands of parameters being monitored could suggest that something was amiss, and employing my intimate knowledge of the \u003Cem\u003EPrayssac\u003C/em\u003E rocket\u0027s Ratite Cluster main engine and Moa upper stage to ensure the payload would make it to space in one piece, thus securing my date with the Red Planet.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nBut instead, I was nowhere near mission control. I was at a party.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nI had decided that I was not going to spend one of my last few evenings on Earth for the next two years hand-wringing in a dimly lit room and I had therefore accepted Catbeth\u0027s offer to accompany her to the VAB roof launch party. I\u0027d never even heard of such an event until she told me about it, but apparently they were held for most major launches and attended by a mix of reckless young VAB engineers and Air Service pilots and ground crew who would brave the risk of being suspended or fired for the awe-inspiring view of a large rocket lifting off less than a thousand metres away. As Senior Engineer, I suppose I ought to frown on such activities, but Cat knew me well. I wasn\u0027t the sort of guy who gets a bunch of Air Service pilots grounded on his last evening out before a deep space mission.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nWe arrived at about T minus twenty after a seemingly endless climb up the service staircase that had me dripping with sweat, but we finally made it out into the warm evening air that baked the roof beneath the airship-pad. Already, a small crowd had gathered near the north end of the building overlooking the launch pad, where \u003Cem\u003EPrayssac\u003C/em\u003E stood fuming hydrogen vapour from her upper stage. Engineers with greasy overalls straight out of the day shift and smart-looking young aircrew turned to see who the newcomers were. Some of them recognised me with obvious apprehension, cutting off their conversations and shuffling nervously, waiting for me to express my inevitable displeasure at their rule-breaking.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Now, do I have to suspend the lot of you, or does someone here have a couple of cold ones for my pilot and myself...?” I grinned. At least three members of the audience rushed for their iceboxes.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nThe climb was worth it just for the view from the top of the VAB, regardless of whether rockets were being launched into space or not. Omelek is not a large island, so from the top of the one hundred metre tall structure it seemed as if we were floating, completely surrounded by the vast expanse of the Pacific Ocean stretching from one horizon to another in all directions. The weather was perfect, and barring any technical issues, it seemed most likely that the launch would go ahead as planned.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nI sat drinking in silence for a while as Catbeth left me to catch up with her fellow aircrew. Gazing into the ocean, my thoughts drifted back to the discovery Angun had made a few thousand kilometers from here over the eastern horizon. Despite having shared this revelation with his fellow scientist Margaret and myself, he had requested that we keep quiet on the matter until we had something better to show than a fuzzy image decoded from some beeping noises recorded on the sea bed three decades ago. Officially, we were still going on a science mission to bring back data from Mars, search for suitable landing sites, and evaluate the possibilities of using local resources for future crewed missions to the surface. We would have three Type G rovers to fling at the Red Planet, and many months in Martian orbit to drive them all over the surface. Once the main scientific objectives were out of the way, Angun would be able to suggest that the rovers should be directed towards the anomalies previously detected by our orbiting probes. If there was a structure on the surface waiting to be found, we would get to it eventually. We would probably have to share our secret secondary objectives with our pilot, Jonnie, but I already knew he would greet this news with the sound of nobody caring.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“T minus five minutes.” A small radio someone had brought along and tuned in to mission control announced the rocket\u0027s imminent departure and I stood up and shuffled carefully forward with the others towards the edge of the roof. Little by little, silence fell over the crowd as mission control went through the final checklists, then launch status check, and the \u003Cem\u003EPrayssac\u003C/em\u003E booster was switched over to internal guidance. Then, as the last ten seconds of countdown began, every single pilot and engineer around me raised his or her hands to cover their ears, or pulled well-used earplugs from overall pockets. I followed suit.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022k1Pc54q.png?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/k1Pc54q.png?1\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Ignition sequence starts...” Blue flames appeared at the bottom of the rocket and almost instantly flashed into scorching light. From this distance a third of a second passed and then the noise, a noise so loud that it twisted my guts and made it feel like the hands I had clamped over my ears were made of paper, physically shaking me and bringing tears to my eyes. The sound of fifteen meganewtons. Absolutely no-one heard the radio call out “zero” as the clamps were released and \u003Cem\u003EPrayssac\u003C/em\u003E surged upwards on a plume of flame and smoke. With a payload well within her ability, the massive rocket seemed almost spritely as she powered skywards, and in moments the Ratite engine cluster was level with our position on top of the VAB, and the noise got louder still, reaching a crescendo as she started to roll over, almost imperceptibly at first, and head away from us towards the East. It was literally breathtaking.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022yAIlNQx.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/yAIlNQx.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nBurning more than two cubic metres of liquid methane every second, the first stage blasted the booster skywards like an eighty metre tall middle finger flicked at gravity, and after a few more seconds we could lower our hands and watch the rocket pass above us, over the VAB and away from the setting sun. No longer having to squint, we could follow her progress as she shrugged the sound barrier aside effortlessly at ten kilometres, and powered on up towards the stratosphere where drag would no longer hold her back. The radio was once more audible and mission control\u0027s commentary once more began to trickle through.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022eaIbD2c.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/eaIbD2c.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Twelve point five kilometres, max Q at Mach 1.4.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nI knew the methane first stage should burn for about three minutes and five seconds, throttling back during the final moments before cut-off to avoid pogo through the slender shroud of the nuclear rocket at the bottom of the payload and hurling the upper stage to more than Mach ten at one hundred kilometres above the Pacific Ocean where various explosive devices would jettison the fairings and slice the rocket in two. Then a few seconds would pass and the second stage would ignite, and the awesomeness would begin all over again.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u00225fWcfKz.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/5fWcfKz.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Upper stage ignition confirmed.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nNext came the longer part of the burn that would ensure that the fuel tank destined for \u003Cem\u003ECernin\u003C/em\u003E would reach orbital velocity and be able to rendez-vous with the rest of the ship. It was a race against time as the hydrolox engine pushed through three, four, five kilometres per second before the upper stage reached the highest point in its ballistic trajectory, already well into space. Finally the trajectory began to flatten out as it drew close to the magical figure of seven-point-eight kilometres per second required for it to stay up there for good.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Second stage cut-off.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nSomething within me clicked into place at this point. Until now, it had all seemed hypothetical. The journey to Mars had still been hanging on a bunch of conditions that had to be met, a load of boxes to be ticked. But unless the caretaking crew on board \u003Cem\u003ECernin\u003C/em\u003E managed to make an epic fail out of the docking procedure, this was it. The last major obstacle was behind us. We were going. I must confess that my eyes began to water once more, and not because of any noise. In fact, after the short cheer that had followed the announcement of \u003Cem\u003ECernin\u003C/em\u003E\u0027s booster successfully reaching orbit, silence began to fall on the VAB roof, as my fellow party-goers began to drift away in small groups back to the staircase.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nI felt a presence at my shoulder, and expecting it to be Catbeth, I turned saying “Well, thank you TP for this forbidden yet thrilling exp...” but trailed off when I saw who it was.\n\u003C/p\u003E\n\u003Cp\u003E\n“Not your TP... \u003Cem\u003Eyet\u003C/em\u003E.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u00220XTi5vV.png?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/0XTi5vV.png?1\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nCat\u0027s sister Lisabeth faced me, smiling mischievously. It was my turn to shuffle nervously.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-03-29T23:37:01Z\u0022 title=\u002203/29/2016 11:37  PM\u0022 data-short=\u00228 yr\u0022\u003EMarch 29, 2016\u003C/time\u003E by UnusualAttitude\u003C/strong\u003E\n\u003C/span\u003E\n"}]}