{"TopicId":130210,"ForumId":51,"TopicTitle":"THE BARTDON PAPERS - \u0026quot;Cancel all previous directives.\u0026quot;","CreatedByName":"UnusualAttitude","CreatedById":129962,"CreatedDateTime":"2016-01-18T17:50:22Z","PageNum":10,"Articles":[{"CreatedByName":"UnusualAttitude","CreatedById":129962,"CreatedDateTime":"2016-07-21T20:34:16Z","Content":"\n\u003Cp\u003E\nOnce again, thank you all for your comments.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m going on holiday for a couple of weeks and probably won\u0027t be making much progress on the Camwise Logs during this time. But, don\u0027t worry, the next major mission is (mostly) designed and planned. Now I just need to launch the 100-tonne booster, the four 50-tonne boosters and make the (estimated) 15 to 20 spaceplane flights to get all the hardware and fuel up there.\n\u003C/p\u003E\n\u003Cp\u003E\nThe following picture of Mitzon and Karanda training for the mission under the watchful eye and firm supervision of...uhm... Froemone will allow you to speculate on the destination, although it should be pretty obvious. See you soon! \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222mxl1Yz.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/2mxl1Yz.png\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-07-21T20:36:09Z\u0022 title=\u002207/21/2016 08:36  PM\u0022 data-short=\u00227 yr\u0022\u003EJuly 21, 2016\u003C/time\u003E by UnusualAttitude\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2016-07-21T21:53:36Z","Content":"\n\u003Cp\u003E\nHave fun on your vacation.\n\u003C/p\u003E\n"},{"CreatedByName":"UnusualAttitude","CreatedById":129962,"CreatedDateTime":"2016-08-02T14:48:29Z","Content":"\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nYEAR 9, DAY 117. CAMWISE.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nIt\u0027s been two years.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nTwo endless years, full of doubts and uncertainties. Of pain and regret. Of memories of our lost crew-member, and unanswered questions as to why she tried to take our ship down.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nAnd all of this, we had to endure alone. Without a single word of guidance or council from Mission Control, or anyone on our home planet. \u003Cem\u003ECernin\u003C/em\u003E was an unreachable desert island with a population of three in the immense void of deep space.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nBefore her attempt on our lives, Margaret had destroyed our ship\u0027s ability to communicate.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nWhat equipment she couldn\u0027t smash to pieces, she had simply dragged to the airlock and dumped into space. Everything, including spare parts, had been either wrecked beyond any hope of repair or ejected from the ship. This must have happened some time before we returned from the surface of Phobos, and the transmitters and amplifiers may still be out there somewhere, orbiting the tiny moon of Mars. But even if any of it is still functional, it will be impossible to find.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nBesides, we left Phobos behind just hours after the Incident. In my desperate attempt to avoid us impacting the surface, \u003Cem\u003ECernin\u003C/em\u003E had actually reached escape velocity, something easily achieved around such a small body. I must admit that our actions lacked discipline or rigour in the aftermath of the near-disaster, and when we finally realised that we were already heading out to orbit high above Mars, no-one suggested turning back.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022gnMDO39.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/gnMDO39.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nApart from our useless communications suite, \u003Cem\u003ECernin\u003C/em\u003E miraculously turned out to be almost unscathed. There was a a small hole in the laboratory module, where the harpoon of our lander \u003Cem\u003ECéré\u003C/em\u003E had been ripped out of the hull during the final last-minute burn; the one that had saved Jonnie, Angun and myself, but had taken Margaret. It was easily patched.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nThe main fuel tank was dented and battered in places where \u003Cem\u003ECéré\u003C/em\u003E had bounced and scraped against it, but it was still sound, and during a short EVA, I determined that there had been no spillage of fuel. We\u0027d leaked a bit of air, but the emergency containment system had worked correctly, and the loss of oxygen was acceptable. Besides, we could now afford to waste some of our consumables: only the three of us would be going home.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nThe disposal of Margaret\u0027s body was a mercifully short affair. We dressed her in my suit, with its damaged helmet, and Jonnie guided her out through the airlock and away from the ship. I\u0027d offered to do it myself, since I felt in some way responsible for her death, but Jonnie had simply pushed past me towards the airlock without a word and donned his helmet before I could protest.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nI remember observing the scene from the bridge in silence, watching Jonnie maneuver Margaret\u0027s lifeless form past the endlessly rotating centrifuge before giving her a final push with his KMU to send her off into infinity. Her body began to tumble slowly and as she drifted off into the distance, the light of the distant sun glinted off her shattered visor, winking at us mockingly. Finally, the twinkling celestial body that had once been Planetary Investigator Margaret faded into oblivion.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nOut there she will, in a sense, outlast us all.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nAngun and I had been waiting for Jonnie in the forward crew module as he cycled back through the airlock. When he removed his helmet, I immediately saw the change. His face was a cold mask of fury.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nFor a terrible moment, I feared that his anger was directed at me, since he had been the first to enter the crew module just a few hours previously and had discovered Margaret\u0027s body, myself, and a dented fire extinguisher floating close by. It was obvious that there had been a struggle, but no-one had seen exactly what had happened.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nJonnie lunged forward...\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“I didn\u0027t...” I began.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n...but he pushed past me once more, and grabbed Angun. Jonnie was no slouch in zero-gee, in fact he was by far the physically strongest Kerbal on board, and by pushing off the far wall of the module he managed to send our surprised Principal Investigator sailing into the airlock. Jonnie slammed the hatch and spun the wheel to seal it. Angun was trapped inside without his helmet.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nJonnie grabbed the lever that would vent the air and leave Angun breathing vacuum within minutes if he pulled it.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Jonnie...no!” I started towards him.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nHis hand still on the lever, he turned towards me, his smoldering gaze froze me in my tracks. “No more secrets,” he said flatly. “Angun. You have ten seconds to start explaining what just happened back there. Or maybe you\u0027d care to join her?”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nHe was transformed: no \u003Cem\u003Ebuddies\u003C/em\u003E, no cheerful drawl. Our Test Pilot had momentarily become someone else.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Jonnie...” Angun began, his thin, metallic voice reaching us through a small speaker next to the airlock hatch.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Make that five seconds PI,” said Jonnie, not moving an inch.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“I do not know why Margaret tried to kill us, or herself, Jonnie. You won\u0027t get anywhere by doing this.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“No way near good enough. Take a deep breath.” His grip tightened on the cycling lever.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Go on then, CTP,” rasped Angun, his old stubbornness returning. “Do what you must.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nUnable to stop myself, I blurted out “Jonnie, don\u0027t do it. Angun: show us the pictures you\u0027ve been receiving from the Pacific. Show us \u003Cem\u003Eall\u003C/em\u003E of the pictures.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nJonnie faced me once more, and for a moment a look of stunned disbelief passed across his face. But he recovered quickly, and almost spat out the words, “You too, Camwise? You\u0027re part of this mess too...”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nAnd that is how the little trust remaining within our diminished crew was finally shattered. It had taken me just a moment to destroy any confidence that remained between any of us. Jonnie now knew that I was also part of the problem, although he couldn\u0027t guess to what extent. And he also knew that he was outnumbered and alone. There was little chance of him succeeding in pushing us both out of the airlock, should he choose to do so. And the prospect of nearly two more years in space with no communications and no-one to back him up just didn\u0027t bear thinking about. It was a broken crew, but it would have to do.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nHe let Angun out of the airlock.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nAngun lead the way aft to the laboratory where he logged onto the computer and brought up the images on a monitor, scrolling through them one by one whilst explaining to Jonnie how they had been obtained. I already knew the Martian Pyramid, and I recognised the pictures of the large ship orbiting Mars and Earth from Margaret\u0027s description.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“There are two more images,” said Angun, “But before I show them to you, I must warn you against jumping to hasty conclusions. Fixation on a far-fetched idea without the scientific evidence to back it up is, I believe, the only possible explanation for Margaret\u0027s... decision. I knew her and worked with her for many years, and despite our differences in opinion on certain topics, I would never have believed that it could come to such an extreme. Here they are.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022zdCRvPc.png?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/zdCRvPc.png?1\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022sdZI82h.png?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/sdZI82h.png?1\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nJonnie and I drew in our breath simultaneously as we looked at the pictures and some of the possible interpretations hit us. My notions of biology were vague, to put things mildly, but I certainly recognised some sort of bacteria being assaulted by a host of smaller organisms. And the second image clearly intended to show that this had taken place both on Earth and on Mars. Didn\u0027t it?\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“It looks like...” Jonnie began.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“...some sort of contamination afflicting some sort of bacteria both on Earth and on Mars, yes I know,” Angun cut in.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Which suggests...” I continued.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“It suggests nothing other than life,” Angun said, as if addressing one hundred students in a lecture theatre. “Things contaminating or assimilating other things. On the microbial scale, that\u0027s pretty much what life is all about. It\u0027s happening in your gut right now, Camwise. And in many other parts of your body that I don\u0027t really have to mention to make my point. On a massive scale.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“But on Earth and Mars?” I began to protest. “The point that last image seems to make is that exactly the same process occurred on both worlds.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Exactly, and that\u0027s the interesting part...” Incredibly, Angun was smiling. As if the fact that he had been shut in an airlock and almost spaced just a few minutes previously was just a slight misunderstanding, and that was all behind us now. “Do you realise what this might mean? The discovery of similar, even identical biological processes taking place on multiple worlds within our solar system?”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nAngun\u0027s question was met with the most deafening of silences. He raised his eyes to what was, subjectively, the ceiling of his micro-gravity laboratory, as if imploring some distant, fickle deity of lore and knowledge.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Do you pilots and engineers ever actually listen to some of the more astute minds in our entourage?” he wondered aloud. “And I\u0027m not talking about the field scientists who actually get things done like myself, or the all-bark-no-bite scientists such as blustery Bartdon. I\u0027m thinking of the real visionaries, the real geniuses.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Steledith...” I breathed.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Yes, Steledith,” cried Angun triumphantly, as if one of his students had suddenly discovered that E=mc². “Next time you see her, I strongly recommend that you request to examine her collection of meteorites. I believe she has samples from most of the inner solar system bodies, as well as many of the major asteroids. The Moon, Mars, as well as one that is probably from Phobos, Ceres, Vesta... all of these collected from the Earth\u0027s surface, of course.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“So all this time...”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Material has been exchanged between the planets, yes,” said Angun, pursuing his habit of interrupting anyone who tried to complete a sentence. “Material, and therefore, possibly life. Now, as I\u0027ve said before, I most certainly did not expect to find anything alive on the surface of Phobos. But since our observations seemed to suggest that Steledith\u0027s hypothesis of a moon formed at least partially from Martian impact ejecta is plausible, I did have a faint hope that we might find some fossilized traces of life in some of our surface samples. It was a long shot, I know, but since we can\u0027t yet go down to the surface of Mars itself...”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“But we lost the samples,” I cut in. “They went down with \u003Cem\u003ECéré\u003C/em\u003E.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“\u003Cem\u003ENearly\u003C/em\u003E all the samples...” Angun was almost whispering now, as if he was afraid that someone would overhear. He dug into one of the pockets of his suit, and produced a small rock in a transparent sampling bag. It was jet black on the outside, but where his hammer had shattered the sample from the native rock, it was a dull, rusty reddish colour.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nJonnie floated upright.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“You disgust me,” he said simply. “How many seconds did it take you to recover that rock from \u003Cem\u003ECéré\u003C/em\u003E earlier today? Nearly one too many, I think. You talk a lot, Angun, but if you had talked sooner then Margaret might still be alive right now.” Jonnie continued to glare at Angun, but it was like trying to stare down a cat. “I need you both to get this ship back to Earth. But the moment I set foot on our home planet, if we make it back, I hope for your sake that we never meet again.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nAngun looked back at our Chief Test Pilot disdainfully. “We won\u0027t,” he said.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nJonnie stormed out of the lab.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nAngun turned to me and continued talking as if nothing had happened. “This also means that the risk of backwards contamination is irrelevant. It may have been happening for billions of years via natural processes. But that doesn\u0027t mean we will find a sample on Earth that confirms this hypothesis. None of Steledith\u0027s rocks showed anything conclusive. We must get down to the surface of Mars and make a full analysis of the sedimentary rocks there. Our next mission...”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nI turned to leave myself.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nAngun stopped in mid-sentence and asked “Do I disgust you too, Camwise?”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nLooking back over my shoulder I said, “No, Angun, no-one disgusts me. You\u0027re a very interesting Kerbal. I also think that you\u0027re insane, and that you certainly shouldn\u0027t be entrusted with the leadership of a space programme. And I don\u0027t believe that Margaret was insane as you are. You\u0027re also forgetting that... thing we saw orbiting Phobos. And the ship on the Moon. This is not just about the possibility of bacteria clinging to rocks in space. I think Margaret knew something that we don\u0027t, and I intend to find out what that is, if I can.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nWith that, I left him.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nThus began the long wait for the transfer window back to Earth. With no functional communications, we could not contact Mission Control, or send commands to any of the rovers we had deployed on the Martian surface. We briefly discussed the possibility of returning to low Martian orbit in an attempt to link up with one of the rovers or one of the science probes in polar orbit via a short-range omni that I managed to improvise from parts salvaged from the lab, but this idea was quickly discarded due to our low delta-vee budget.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nMargaret\u0027s maneuver and my own subsequent burn had wasted nearly five hundred metres per second. Any additional expenditure would mean that we might make it back to Earth, but we would not have enough fuel to capture once we got there. And with no reliable means of communication, we would slip back out into interplanetary space as if we\u0027d never existed. Even nailing our transfer burn back would be hard, as we usually relied on additional guidance from Earth\u0027s deep space network of radio-telescopes. We would have to make to with \u003Cem\u003ECernin\u003C/em\u003E\u0027s less precise auto-navigational systems.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nSo we waited in high Martian orbit for nearly another year, the mistrust amongst Jonnie, Angun and myself festering, living with the constant doubt of ever making it back and with no clear mission to focus on other than keeping our ship and ourselves alive. But we endured.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022FXutWaJ.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/FXutWaJ.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022Dku5QKe.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/Dku5QKe.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022IQD0EuO.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/IQD0EuO.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nThere is no need to spare you the tedium and gloom of my logs during this time, or during the long journey back to Earth once we had broken free from Martian orbit: I simply did not write them. And this, despite the fact that it would have been something, anything, to keep my waking thoughts straying back to the vision of Margaret\u0027s empty, accusing stare, or the loathsome alien creature drifting in space, both of which haunted my dreams. I could not bring myself to put pen to paper for fear of making these memories more vivid, more persistent. Better to deal with the long, cold emptiness of denial as we winged our way back across the void; a tiny spark of fragile hope and sanity in a gulf of darkness that threatened to snuff it out at any moment.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nBut now, as we approach the end of our mission and salvation that seemed beyond hope just a few hours ago, I must think ahead to the fearsome scrutiny we will all be subjected to once we return to Omelek. The debriefings will be merciless, and endless. I must gather my thoughts, and make sure that the truth is told.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022WopxGtX.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/WopxGtX.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cem\u003ECernin\u003C/em\u003E had screamed into the upper atmosphere of Earth at more than twelve kilometres per second. Jonnie and I had attempted to calculate a periapsis that would enable to us to close our orbit without instantly frying our ship, but this would still require us to burn almost all of what little fuel remained in our tanks.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nJust seconds after hitting the top of the atmosphere, a fearsome blaze surrounded the ship and deafening alarm bells blared into life, screeching their chorus of warnings after months of ominous silence. The main engine, taking the brunt of the assault, was rapidly overheating. It would reach a critical temperature in seconds, and then risk shedding a cloud of debris, showering the rest of our ship and exposing the vulnerable fuel tank to instant destruction. We were moments from disaster.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nAt my cry of “Fire the engine!” Jonnie gave it almost everything we had left, pushing the last few hundred metres per second from the tanks to bring our speed just below escape velocity. Despite our arrival on the night side of the planet, the glow from the plasma lit up the bridge like the midday sun. We couldn\u0027t see it from where we were sitting, of course, but a subsequent EVA showed that the engine bells had heated almost to melting point.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022iJVhVwv.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/iJVhVwv.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nAlmost.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nWe were left in a highly elliptical orbit that we had somehow managed to bring within cislunar space. Even the dull, harsh surface of the Moon was a welcome sight after months of drifting out in deep space. Our periapsis was still somewhere in the upper atmosphere, and each of our subsequent passes would scrub of a very little of our speed. But it would take weeks, or even months for us to circularize our trajectory, unless we subjected our battered, space-weary ship to further, riskier aerobraking maneuvers.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022pUZXSm8.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/pUZXSm8.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022qZk3xoI.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/qZk3xoI.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nThat\u0027s when we finally managed to raise Omelek, using the short-range omni I had managed to salvage. Whether they had already noticed our presence or not, I couldn\u0027t tell, and I didn\u0027t recognise any of the voices of we spoke to at Mission Control as we attempted to explain our situation.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nBut they have sent up a capsule. We are still way beyond the reach of the spaceplanes, so in a record time they have thrown together a rescue mission with equipment left-over from our initial moonshots. One of the old three-seat capsules. Once again, this reminds me of Margaret\u0027s absence.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022weNqWCH.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/weNqWCH.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nA few hours before rendez-vous I was sitting alone on the bridge, gazing down at our planet, still in disbelief that we had actually made it back safely. Angun came in and sat down beside me. During the long months in space, the burning anger and mistrust between all three of us had cooled to a strange sort of cold indifference, as if all of this was just a bad dream and if we ignored it hard enough, it would all be resolved when we awoke. We exchanged as few words as possible, and limited our interactions to necessary shipboard operations. But now, Angun wanted to talk.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nHe took a deep breath and said, “I\u0027ve spoken to Jonnie. We came to... an agreement.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“What sort of agreement?”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“One about you, Camwise. I\u0027ve managed to convince him that your involvement in the confidential secondary objectives that Margaret and I established for our mission to Mars was entirely involuntary.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Meaning..?”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Meaning that you are free to deny any knowledge of them during the debriefing. The pictures from the Monument. The Martian Pyramid. Everything. Your swift actions saved both of us, Camwise, and you cannot be blamed in any way for Margaret\u0027s death. You don\u0027t deserve to suffer any additional consequences due to my ill-judgment. Jonnie respects that, and has agreed to withhold anything that could incriminate you from his report.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“And you?”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“I will reveal everything that has happened since I discovered the Pacific Monument on the ocean bed, three decades ago. I shall omit nothing.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nI turned to look at the Principal Investigator, his face as unreadable as ever. Impassive, probably so sure of himself, even now as he struck a deal with my crew-mate to conceal part of the truth. Could he be trusted?\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nIn turn, I took a deep breath. “Thanks Angun, but no thanks. I too shall omit nothing, and face the consequences.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nThrough the forward windows of the bridge, a distant point of light shining on metal caught my eye. Our ride home was approaching.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u00222XSndtc.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/2XSndtc.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-08-02T15:58:29Z\u0022 title=\u002208/02/2016 03:58  PM\u0022 data-short=\u00227 yr\u0022\u003EAugust 2, 2016\u003C/time\u003E by UnusualAttitude\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2016-08-03T02:31:38Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222701496\u0022 data-ipsquote-contentid=\u0022130210\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221470149309\u0022 data-ipsquote-userid=\u0022129962\u0022 data-ipsquote-username=\u0022UnusualAttitude\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 hours ago, UnusualAttitude said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt\u0027s been two years.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNo, it\u0027s only been 1 week.  You said you\u0027d be gone for 2.  That\u0027s worrisome.  I hope whatever changed your plans wasn\u0027t some personal tragedy.\n\u003C/p\u003E\n\u003Cp\u003E\nBut anyway, thanks for the update.  Yay CAMWISE!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222701496\u0022 data-ipsquote-contentid=\u0022130210\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221470149309\u0022 data-ipsquote-userid=\u0022129962\u0022 data-ipsquote-username=\u0022UnusualAttitude\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 hours ago, UnusualAttitude said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIn turn, I took a deep breath. “Thanks Angun, but no thanks. I too shall omit nothing, and face the consequences.”\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nGood lad.  Don\u0027t let them bury the truth!  It\u0027s out there! \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nChesty Puller once said, \u0022There\u0027s a fine line between a Navy Cross and a general court martial,\u0022 and he should know.  I have a feeling Camwise is in a similar spot.\n\u003C/p\u003E\n"},{"CreatedByName":"UnusualAttitude","CreatedById":129962,"CreatedDateTime":"2016-08-03T11:57:06Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222702256\u0022 data-ipsquote-contentid=\u0022130210\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221470191498\u0022 data-ipsquote-userid=\u002269507\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 hours ago, Geschosskopf said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNo, it\u0027s only been 1 week.  You said you\u0027d be gone for 2.  That\u0027s worrisome. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYour concern is so kind, Geschosskopf. I was voluntarily vague about the couple of weeks, and my holidays are actually going exactly as planned. I spent a week in the Pyrenees with family, during which I visited the impressive \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/144476-mont-louis-solar-furnace/\u0022 rel=\u0022\u0022\u003Esolar furnace\u003C/a\u003E of Mont-Louis, survived the intimidating 200-metre zipline of the Lac de Matemale, and spent plenty of time doing more or less the same as this very chilled-out Spanish Ibex, or \u003Cem\u003ECapra Hispanica...\u003C/em\u003E ie: nothing. Just add a bottle of cold fermented barley flavoured with hops and you get the picture.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022http://i.imgur.com/CU8T8eP.jpg\u0022 class=\u0022ipsImage\u0022 alt=\u0022CU8T8eP.jpg\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nIn between returning from the Pyrenees and a dreadful two-day drive to Britanny and back to drop-off the step children with their grandparents, I had some free time that proved to be unexpectedly productive. Thus, this episode was written, although it\u0027s grim, dark tones do not reflect my present state of mind in any way. I\u0027m cool.\n\u003C/p\u003E\n\u003Cp\u003E\nBut you are right to be concerned: I think the fan fiction / mission report authors who contribute to this forum should benefit from more favourable worker\u0027s rights and enjoy five weeks of mandatory payed vacation per annum. At least.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222702256\u0022 data-ipsquote-contentid=\u0022130210\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221470191498\u0022 data-ipsquote-userid=\u002269507\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 hours ago, Geschosskopf said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u0022There\u0027s a fine line between a Navy Cross and a general court martial,\u0022\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n...and it looks like Bartdon might just be chairing that court martial. Poor Camwise.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-08-03T11:57:40Z\u0022 title=\u002208/03/2016 11:57  AM\u0022 data-short=\u00227 yr\u0022\u003EAugust 3, 2016\u003C/time\u003E by UnusualAttitude\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2016-08-03T13:14:11Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222702692\u0022 data-ipsquote-contentid=\u0022130210\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221470225426\u0022 data-ipsquote-userid=\u0022129962\u0022 data-ipsquote-username=\u0022UnusualAttitude\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, UnusualAttitude said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYour concern is so kind, Geschosskopf. I was voluntarily vague about the couple of weeks, and my holidays are actually going exactly as planned.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nGood to hear it.  Sounds like fun stuff.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, UnusualAttitude said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n...and it looks like Bartdon might just be chairing that court martial. Poor Camwise.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBut OTOH, I\u0027m sure Steledith will be part of it, too.  She\u0027ll at least delay things considerably \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"SpaceplaneAddict","CreatedById":149322,"CreatedDateTime":"2016-08-04T04:27:53Z","Content":"\n\u003Cp\u003E\nIs that a Dragon capsule I see?\n\u003C/p\u003E\n"},{"CreatedByName":"UnusualAttitude","CreatedById":129962,"CreatedDateTime":"2016-08-04T17:19:02Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222703791\u0022 data-ipsquote-contentid=\u0022130210\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221470284873\u0022 data-ipsquote-userid=\u0022149322\u0022 data-ipsquote-username=\u0022SpaceplaneAddict\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n12 hours ago, SpaceplaneAddict said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIs that a Dragon capsule I see?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nDoes look a bit like it. It\u0027s just a stock 3-seat capsule strapped to a big tank of aerozine and NTO. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"UnusualAttitude","CreatedById":129962,"CreatedDateTime":"2016-08-10T23:37:48Z","Content":"\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nYEAR 9, DAY 202. CAMWISE.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nNow, then. My name is Camwise and I am, until the circumstances change, stuck in Antarctica.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022pFVieUn.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/pFVieUn.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022dWfCN8E.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/dWfCN8E.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022cSetjbj.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/cSetjbj.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022AYLDOcJ.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/AYLDOcJ.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022jG4QcHD.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/jG4QcHD.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nAs I write this log, the huge ice-crawler \u003Cem\u003EMontbrun\u003C/em\u003E powers on across the brilliant white landscape of the Knox Coast towards the South Pole and its research station. The vehicle\u0027s eight massive wheels, powered by the atom and each one more than twice the height of a full grown Kerbal, spin slowly but relentlessly through the snow and ice, pushing the purposeful machine tirelessly forwards towards its distant goal, still many days away.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nI sit up on the bridge, for now merely a spectator in one of the jump-seats, watching the pure, virgin landscape slide by through the side window as Commander Tirice expertly steers the ice-crawler through the difficult terrain, avoiding crevasses and finding the best paths up the sometimes steep and slippery slopes. She is assisted by Junior Engineer Gemxy who provides a second pair of experienced eyes, and watches over the reactor parameters like a mother guarding her sprout.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022R075tzK.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/R075tzK.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nThey are the Kerbelle Team, and they will continue driving until it gets too dark to continue safely. We will then park the machine for the night and when the sun rises again, Pilot Malcolm and myself will take over and the Gentlekerb Team will attempt to progress another 120 kilometres towards the polar outpost, thus beating our ship\u0027s record for distance covered in a single morning and giving us something to brag about to the Kerbelles.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nThis is my new life, but it has been so for less than a month and this is only my second run from the staging-post on the coast where the airships unload their supplies and equipment for the research station, unable to travel any further southwards unless it is the height of summer. For a few months each year, they can take advantage of the midnight sun of the Antarctic to power their electric engines all the way to the pole and, weather permitting, offload their cargo directly at its destination.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nDuring the rest of the year, it\u0027s up to ice-crawlers like \u003Cem\u003EMontbrun\u003C/em\u003E to keep the Arctic and Antarctic stations alive.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nYou may be wondering how I came to be assigned to what might seem like a rather mundane position, in light of the fact that I am one of the only four Kerbals in history to have traveled to another world, and one of the three who made it back alive. I will get to this in a moment, but I must first explain that I do appreciate the discretion of my crew in this matter.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nThey say that you don\u0027t go to Antarctica to talk about your past.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nBack in Omelek, almost every pilot, mechanic and junior technician would recognise the face of Senior Engineer Camwise (until recently, at least), but in a world of small settlements divided by empty continents and wide oceans, news filters through slowly, and the details are often overlooked.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nMy crew have certainly heard of the crewed mission to Mars, on board a ship that was presumed lost but then reappeared miraculously nearly three years later. They know the mission was lead by a crazy scientist called Hangun (or was it Engoon; how do you even pronounce that anyway...?) and Commander Tirice might recognise him if she were to be shown a picture of our former Principal Investigator.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nPilot Malcolm might even have heard of Jonnie, who is somewhat of an idol for any young and impressionable Kerbal who aspires to join the Air Service one day. But I\u0027m pretty sure that no-one I am likely to meet beyond 65° South knows my name or would recognise Engineer Camwise, formerly Senior Engineer Camwise of the Omelek Space Centre.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nFor this I am grateful, as it means that I can just get on with the job at hand and not have to answer any prying questions that would bring back painful memories. Like many of the tough, sometimes dour Kerbals who populate the research stations and get the supplies through, I am just an anonymous pair of skilled hands contributing to the survival of the group. As long as I keep the ice-crawler moving and don\u0027t melt down the reactor, they couldn\u0027t care less where I came from before I joined their crew.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nNot that there haven\u0027t been a few near misses. Commander Tirice has, on several occasions, expressed her surprise at my familiarity with the Kastria MX-4 fission reactor. Her surprise is legitimate, as the polar ice-crawlers are the only terrestrial vehicles equipped with such a power-source, but she can\u0027t be expected to know that it is exactly the same hardware that drove our lunar mining rover \u003Cem\u003EPadirac\u003C/em\u003E across Drygalski crater, extracting the vital water ice that propelled me home from the Moon.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nAnd as for Gemxy, well, by now she must have caught on to the fact that I am not just the average kerbal spanner wielder going through a mid-life crisis and seeking out a more adventurous existence in this hostile landscape. She\u0027s a lovely girl, that Gemxy, and responds to my valiant but futile attempts to pronounce her name correctly by poking fun at my subtle and untraceable accent. After an understandable period of mistrust towards her new crew-mate, she has proved to be most friendly to this mysterious engineer with no past. Friendly, and a little flirtatious even.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nThey also say that what happens in Antarctica stays in Antarctica.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022KC0uPAC.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/KC0uPAC.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nBut I digress once more. As you\u0027ve probably gathered by now, the reception that awaited us – once our return capsule had screamed through the atmosphere to a relatively uneventful splash-down somewhere in the South Pacific – was rather less than warm. In fact, it was as utterly glacial as the landscape through which I now travel.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nWe were, of course, immediately quarantined, but as soon as they realised that we had left Mars and Phobos behind nearly a year previously, and that we had suffered no apparent ill effects during our long trip back, Jonnie, Angun and I were separated and the debriefings began.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nI recall very little of the days and weeks of questions and debriefing sessions that drew on for hours on end, making them seem more like interrogations. Endless repetitions of everything that had happened to me since well before our departure for the Red Planet, each minute detail recounted three, four times or more... Nameless Investigators, none of whom I recognised, even asked me to tell them once again about what had happened to me on the Moon. All of this has faded into a kind of blur of confession.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nI saw nothing of the outside world during this time, and my interrogators shared little news of how things had changed in our absence, but their very presence was a hint of some profound transformation of the way the Space Centre was being run. In time, I understood that the programme had nearly been canceled after communication with \u003Cem\u003ECernin\u003C/em\u003E was lost, and that operations were now merely ticking over on a very restricted budget. No crewed flight had taken place in the past eighteen months.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nWhen I asked one of my interlocutors what effect our obviously unexpected return would have on this policy, I was met with a wall of silence.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nFinally, one morning, there was a brisk knock on the door of my confinement quarters, and before I could answer, a smart, prim Kerbal entered. He swept into the room with an air of propriety and an almost aggressive stance that startled me, but at last he was someone I recognised.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Acting Principle Investigator Bartdon...” I stammered, standing to face him.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“That would be just Principle Investigator Bartdon, thank you boy,” he boomed as if he was hailing me from the far end of the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E. “You can keep your \u003Cem\u003EActing\u003C/em\u003E and stuff it wherever you like, although it\u0027s a bloody miracle that they still let me investigate anything after that shambles you made of our first interplanetary mission. Fortunately, the Board had the sense to recall me to try and sort out this mess.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Where are Jonnie... and Angun?” I asked tentatively. I had not been seen either of them since the beginning of my debriefing.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Jonnie was granted leave to visit his family yesterday. Angun is still being heard and he has proved to be most... cooperative. He has shared a lot of information that he should have disclosed before your mission began. Better damned late than never, I suppose. Still, we didn\u0027t learn anything much that we hadn\u0027t already caught up with in your absence. We haven\u0027t been \u003Cem\u003Ecompletely\u003C/em\u003E idle, you know.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“You managed to decode the signals from the Monument?” I asked.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Actually, no. Angun left us the key to the encryption. We also found the location of one of those blasted black slabs buried up on the lunar equator, and it has been transmitting the same set of signals ever since. But what I\u0027d like to know, Camwise, is why you did not respond to my request for help.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nHe was referring to the messages I had received from Karanda on the surgeon\u0027s channel, asking me to report back any suspicious activity that Angun and Margaret might be engaged in.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“I don\u0027t think you realise what you were asking. Would you spy on your crew-mates during a three-year trip into deep space?” I snapped, the tension that had built up over the previous weeks suddenly too much to bear. “When we left for Mars, I knew almost nothing of their intentions. Seriously Bartdon, you\u0027re a Kerbonaut yourself, you\u0027ve seen Earth as a distant blue dot too, but I just don\u0027t think you get what it was like out there.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nBartdon paused and looked at me for a moment. It seemed to me that his expression softened slightly. “I\u0027m sorry, Camwise. You were one of the best engineers we had, it\u0027s such a damned waste, but I\u0027m afraid that you just don\u0027t realise just how much trouble you and Angun are in. The Resource Companies do not grant us millions of funds just to buy expensive toys for us to do what we like with. As it is, the Board is talking about a court case for misuse of company property. Trans Atlantic Resources, in particular, are baying for blood and are particularly intent on putting you both away in one of the prison-caves for longer than you would care to think about. I, however, have proposed a different solution.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nHe reached into the pocket of his suit, pulled out a sheet of paper and handed it to me. It took me a moment to understand what I was reading, but eventually I realised that it was a list of job offers for engineering assignments in Antarctica.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Trans Pacific runs most of these operations,” he explained, “and they happen to have far more clout than Trans Atlantic when it comes to this sort of court case. If you agree to one of these assignments, then you have a fighting chance. I would strongly advise you to take this opportunity. Damned strongly indeed, unless you want to spend the next twenty years mining coal in pitch darkness with your blasted bare hands.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nI looked back at Bartdon in utter disbelief, the list hanging limply from my grasp.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Take your pick, Camwise,” he went on, “I hear they have a bunch of vehicles down there that require urgent maintenance. A whole lot of damaged wheels and a chronic shortage of spares. As the first engineer to return from an interplanetary voyage, I trust that you will cope.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“What about Angun?” I eventually managed to say.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“I found a similar deal for him, but the assignments are for ice-core sampling in the Arctic. I know he\u0027s good at that sort of thing...” he replied, and I swear that I heard a hint of smug satisfaction in his voice.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nAnd that is how, two weeks later, I found myself on board an airship bound for Antarctica.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022pWDcMkO.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/pWDcMkO.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nThe journey, via the Australian continent, was a long one, but eventually the horizon before of us became a crest of pure white. We were coming in over a bay, a long gash in the icy continent where the ocean pierced the frozen mainland. There, nestled on the coastline, was a tiny group of temporary buildings, huddled close together as if in an attempt to keep out the numbing cold of this remote and forgotten place.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cem\u003EVillecomtal\u003C/em\u003E drifted slowly down towards this improbable settlement, a mere staging post where the ice-crawlers would appear out of the frigid wasteland, load the gifts that the airships brought from across the ocean, and melt away back into the wild again to begin the long journey to whichever research or prospection station they were delivering to.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022jzWVVfO.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/jzWVVfO.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nSometimes, like today, the airships also brought new crew members. I was to be the chief engineer of a vehicle named \u003Cem\u003EMontbrun\u003C/em\u003E. What had come of my predecessor, the job contract had not specified. However, shortly before the airship touched down, the news came in that the ice-crawler\u0027s arrival at the staging post had been delayed due to technical issues and would not arrive until the following morning.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nThis meant that my first night on Antarctica would be spent at the pathetic little outpost that was, as I then realised, the closest thing I had to a home. And as I walked down the ramp at the back of the airship\u0027s gondola and caught my first glimpse of the place, it dawned on me just how much of a miserable, forsaken excuse for a home it was.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022A3mmqIw.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/A3mmqIw.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nThere were three small shelters, two of which were reserved for equipment and spares, and a third that was supposed to be a temporary shelter for ice-crawler crews unlucky enough to have to spend any significant amount of time there between two journeys inland.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nParked – or possibly abandoned – next to this lonely settlement was a battered old \u003Cem\u003EArcambal\u003C/em\u003E service rover. Incredibly, I was looking at the utility variant of the same machine that had carried Catbeth and I across the lunar landscape to our unexpected discovery of an alien spacecraft. Like the rover still parked somewhere up on the Moon, this one had clearly seen better days, and Bartdon had been right about the state of the wheels.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022ZaxrQeQ.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/ZaxrQeQ.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nI felt a sudden urge to crawl back across the ice to the airship and spend my last night in the civilised world in my small but warm cabin deep within the belly of \u003Cem\u003EVillecomtal\u003C/em\u003E. But the moment passed, and I was once again determined to make the most of my new situation. This was the hand that fate had dealt me, and I would simply have to make the most of it.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nI spent most of the night shivering, huddled beneath an inadequate blanket, alone in one corner of the shelter. Sleep would not come, but then neither would the nightmares.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cem\u003EMontbrun\u003C/em\u003E arrived shortly after dawn. I was still awake and had been watching the horizon like a hawk. The mighty ice-crawler proved to be an impressive sight as she trundled over the ridge towards the staging post and backed slowly into position beneath the airship to take on board the precious cargo.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022ZNhAwSM.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/ZNhAwSM.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022JuR0Nvs.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/JuR0Nvs.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022mMRGVuB.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/mMRGVuB.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022Tq7mfDK.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/Tq7mfDK.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cem\u003EVillecomtal\u003C/em\u003E\u0027s crew sprang into life and formed a kerbal-chain between the two vessels. I joined them and together we toiled to offload the cargo from Woomera into the equally spacious hold of the ice-crawler.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022JRZPYNr.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/JRZPYNr.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u00226ZNkMb2.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/6ZNkMb2.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u00225Esriey.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/5Esriey.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nThere, in the dim, artificial light of the cargo-bay, an energetic, hard-faced Kerbelle engineer was overseeing the proper stowage of the cargo, ticking off entries one by one from a long list she held on a clip-board. However, my attention was immediately captured by an ominous protuberance from the vehicle\u0027s hull lurking at the back of the hold, just beneath the crew quarters. It was decked with radiators, and sported an angry red warning light that bathed the vehicle\u0027s interior in its crimson glow.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022ekHd9mB.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/ekHd9mB.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Is that...” I began hesitantly.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“...a nuclear fission reactor? Yes, it is,” said the Kerbelle briskly, “but don\u0027t worry, we shut it down before we drove in. I\u0027m Junior Engineer Gemxy. You must be...”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Camwise.” I said, taking her outstretched hand and shaking it tentatively. I hadn\u0027t expected my new job to require wearing a dosimeter, but I gave her my best nonchalant shrug when she presented me with one. This, at least, was something my previous profession had made me rather familiar with.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Commander Tirice will be down shortly. Welcome to \u003Cem\u003EMontbrun\u003C/em\u003E, Camwise.” Gemxy flashed the briefest of smiles and returned to her list.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nOnce the last of the supplies were transferred, I made my way back out onto the ice to watch the last link to my previous life disappear over the horizon. \u003Cem\u003EVillecomtal\u003C/em\u003E rose majestically above the freezing waters of the bay and began her long journey northwards towards Australia. Commander Tirice and Pilot Malcolm joined me as the airship faded into the distance.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Goodbye, civilisation. See you in a couple of weeks,” said Malcolm.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Welcome to Antartica, Camwise,” added Commander Tirice.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022tiDpu5L.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/tiDpu5L.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022REFRMVI.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/REFRMVI.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nAnd so began my life on board yet another type of ship, isolated in the middle of no-where with just my small crew for company. However, in this new environment, I can step outside the ship without a pressure-suit suit and risk only hypothermia or severe frostbite rather than instant death, which must be something of an improvement I suppose. I quickly learned to deal with the quirks and changes in mood of \u003Cem\u003EMontbrun\u003C/em\u003E\u0027s Kastria MX-4 reactor, and soon came to appreciate the fact that none of my new crew-members were obsessed scientists searching for aliens or hot-headed and deceptively calm test pilots.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nFor a while, life was good.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nYesterday afternoon, a faxed message from Omelek came through \u003Cem\u003EMontbrun\u003C/em\u003E\u0027s antenna. It was from Froemone. Apparently he had been trying to reach me for several days and had finally tracked down the location of our ice-crawler using one of our polar satellites. The text portion of the message was unremarkable, and simply read, \u003Cem\u003E“New launches with Carderie. Thought you might like to see some pictures of what we\u0027re up to. Froe.”\u003C/em\u003E This would be incomprehensible to anyone who was not familiar with the details of our space programme, but the message also included a set of pictures that were encrypted and would require a password for the images to be displayed correctly.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nI waited until that evening, and when I reckoned that the rest of my crew had bedded down for the night, I made my way stealthily to the bridge and brought up the message on the screen of the engineer\u0027s station once more.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nI typed in the password that – back when I had worked there - engineers of the Space Centre had commonly used to exchange ideas for unusual or controversial designs by facsimile. Blueprints for \u003Cem\u003EPadirac, Lentillac, Carderie\u003C/em\u003E and many other unconventional vehicles had been stealthily sent from office to office, protected by a code known only to the highest-ranking engineers and technicians.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nW.H.A.T.C.O.U.L.D.P.O.S.S.I.B.L.Y.G.O.W.R.O.N.G.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nThe screen flickered and I was greeted with a selection of magnificent images of our spaceplane launching what appeared to be a new constellation of MEO communication satellites. They were all \u003Cabbr title=\u0022Radio-isotope Thermo-electric Generator (a.k.a. Mars rover heating device)\u0022\u003E\u003Cabbr title=\u0022Radio-isotope Thermo-electric Generator (a.k.a. Mars rover heating device)\u0022\u003E\u003Cabbr title=\u0022Radio-isotope Thermo-electric Generator (a.k.a. Mars rover heating device)\u0022\u003E\u003Cabbr title=\u0022Radio-isotope Thermo-electric Generator (a.k.a. Mars rover heating device)\u0022\u003E\u003Cabbr title=\u0022Radio-isotope Thermo-electric Generator (a.k.a. Mars rover heating device)\u0022\u003E\u003Cabbr title=\u0022Radio-isotope Thermo-electric Generator (a.k.a. Mars rover heating device)\u0022\u003E\u003Cabbr title=\u0022Radio-isotope Thermo-electric Generator (a.k.a. Mars rover heating device)\u0022\u003E\u003Cabbr title=\u0022Radio-isotope Thermo-electric Generator (a.k.a. Mars rover heating device)\u0022\u003E\u003Cabbr title=\u0022Radio-isotope Thermo-electric Generator (a.k.a. Mars rover heating device)\u0022\u003E\u003Cabbr title=\u0022Radio-isotope Thermo-electric Generator (a.k.a. Mars rover heating device)\u0022\u003E\u003Cabbr title=\u0022Radio-isotope Thermo-electric Generator (a.k.a. Mars rover heating device)\u0022\u003E\u003Cabbr title=\u0022Radio-isotope Thermo-electric Generator (a.k.a. Mars rover heating device)\u0022\u003E\u003Cabbr title=\u0022Radio-isotope Thermo-electric Generator (a.k.a. Mars rover heating device)\u0022\u003ERTG\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E equipped, and must have cost us a small fortune to manufacture. I felt a rush of emotion as I gazed at this swarm of silver-and-vermillion angels taking flight into the dark heavens above our planet. For a moment I felt a terrible emptiness as I was painfully reminded of my former position at the forefront of our quest to reach for the stars.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022ZrbR1aT.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/ZrbR1aT.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022O8o1WtP.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/O8o1WtP.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022CaY9DH1.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/CaY9DH1.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022tKZ2men.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/tKZ2men.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022uElNP4m.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/uElNP4m.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nThe last page was not a picture, but a handwritten scrawl that Froemone had encrypted along with the images to make sure of its safe transmission.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022WHI65y3.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/WHI65y3.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nI must confess that there and then, in the depths of an endless polar night, sitting in the cockpit of a nuclear-powered freight truck parked somewhere in Antarctica, I began to chuckle. It was a rather strained and bitter chuckle, but the closest thing to genuine mirth I had experienced in many long months. I was still laughing when Gemxy entered the back of the bridge.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Hey, Cam. You\u0027re having fun without me?” she complained in a sleepy voice, settling heavily into the pilot\u0027s seat beside me.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Sorry Jem-see,” I said, giving her ever elusive name my best shot as I hastily killed the screen and its cryptic message. “I couldn\u0027t sleep.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Well, I couldn\u0027t sleep either, Mr Mysterious,” she muttered, gazing out of the windshield into the pitch darkness beyond. “It gets too cold when the reactor is powered down for the night. Far too damned cold.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nHer voice trailed off and a long silence followed, punctuated only by the moan of the biting wind across the frozen landscape. From the relative warmth of the bridge, it was a strange moment of peace and tranquility that seemed almost too good to be broken. But inevitably, she did.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Let\u0027s go back to bed, Cam,” she said and reaching across the bridge, she caught my hand in hers.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nI recoiled from her grasp and snatched my hand away without thinking. Just why my reaction was so violent, I cannot say. Maybe three years in deep space were to blame, or perhaps the death of my crewmate. Or more likely the realisation that my ludicrous, tragicomic hope of ever seeing Lisabeth again had kept me going for the past eighteen months, and now that I had returned to Earth this hope had been shattered. It was just not going to happen.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nWhatever the reason, the moment had escaped us. Fortunately, Gemxy was not the type of Kerbelle that was easily offended.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Are you out here in Antarctica because of... someone, Cam?” she finally asked.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Well, sort of,” was the best I had to offer.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“That\u0027s OK. Goodnight, Camwise,” she sighed, and left the bridge.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022Pmj2I5N.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/Pmj2I5N.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nDuring the following morning\u0027s shift, on my watch, Malcolm ran into a deep groove in the ice that almost wrecked the ice-crawler\u0027s front left wheel. This was potentially a serious drawback, as it would be almost impossible to deliver a spare to our remote location without re-routing another ice-crawler and causing a significant and embarrassing delay in the delivery of our cargo to the polar station.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022EIXHWIv.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/EIXHWIv.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022Su4sBQF.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/Su4sBQF.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nI therefore grabbed my tools and climbed down the ladder out onto the ice. I assessed the damage and asked Commander Tirice to ramp-up the vehicle\u0027s differential suspension in order to unweigh the damaged wheel. There, out on the frozen wasteland, I performed a repair unheard of in the history of polar land operations. I hammered, welded and battered the giant one-tonne disk back into shape and got the ice-crawler moving again in less than three hours.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nWith my arms aching, exhausted but stoked by the blazing satisfaction of a job well done, I made my way to the ladder and clambered unsteadily back up to the bridge.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nMy name is Camwise, and I try to fix things.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n\u003Cimg alt=\u0022HEUr1cj.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/HEUr1cj.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-08-11T01:18:55Z\u0022 title=\u002208/11/2016 01:18  AM\u0022 data-short=\u00227 yr\u0022\u003EAugust 11, 2016\u003C/time\u003E by UnusualAttitude\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"UnusualAttitude","CreatedById":129962,"CreatedDateTime":"2016-08-12T21:30:21Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003ETHEOPHILUS LUNAR EQUATORIAL MONUMENT: DATALOG (EXCERPT).\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EMET 14300.659.19:\u003C/strong\u003E gamma ray spike detected.\n\u003C/p\u003E\n\u003Cp\u003E\n…\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EMET 14300.659.23:\u003C/strong\u003E critical damage to multiple systems: mobility, communications, sensors. Ejecting datacore.\n\u003C/p\u003E\n\u003Cp\u003E\n...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EMET 14300.659.45:\u003C/strong\u003E datacore accelerometer detects landing on C.1 planetary surface within survivable parameters. Datacore damage: 18.2% (est).\n\u003C/p\u003E\n\u003Cp\u003E\n...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EMET 14300.665.43:\u003C/strong\u003E low power warning, switching to back-up source.\n\u003C/p\u003E\n\u003Cp\u003E\n…\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EMET 14300.668.58:\u003C/strong\u003E back-up power level critical, shutting down all vital and non-vital systems, except clock and external power source detection.\n\u003C/p\u003E\n\u003Cp\u003E\n…\n\u003C/p\u003E\n\u003Cp\u003E\n…\n\u003C/p\u003E\n\u003Cp\u003E\n…\n\u003C/p\u003E\n\u003Cp\u003E\n…\n\u003C/p\u003E\n\u003Cp\u003E\n…\n\u003C/p\u003E\n\u003Cp\u003E\n…\n\u003C/p\u003E\n\u003Cp\u003E\n…\n\u003C/p\u003E\n\u003Cp\u003E\n…\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EMET 25600299.513.12:\u003C/strong\u003E external radioactive power source detected within range of datacore recharging microprobe.\n\u003C/p\u003E\n\u003Cp\u003E\n…\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EMET 25600299.514.97:\u003C/strong\u003E radioactive power source has receded from range of datacore recharging microprobe. Shutting down.\n\u003C/p\u003E\n\u003Cp\u003E\n…\n\u003C/p\u003E\n\u003Cp\u003E\n…\n\u003C/p\u003E\n\u003Cp\u003E\n…\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022fen9BMs.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/fen9BMs.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EMET 25600300.112.20:\u003C/strong\u003E external radioactive power source detected within range of datacore recharging microprobe.\n\u003C/p\u003E\n\u003Cp\u003E\n…\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EMET 25600300.114.61:\u003C/strong\u003E recharging microprobe deployed successfully, charging backup power source. 0%...5%...10%...15%...20%...25%...30%...35%...40%...45%...50%...55%...60%...65%...70%...75%...80%...85%...90%...95%...100%.\n\u003C/p\u003E\n\u003Cp\u003E\nBack-up power source charge complete.\n\u003C/p\u003E\n\u003Cp\u003E\n…\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EMET 25600300.115.22:\u003C/strong\u003E unknown device detected. Origin: alien. Technology: primitive to intermediate (Class C2). Attempting to exploit communications device.\n\u003C/p\u003E\n\u003Cp\u003E\n…\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EMET 25600300.115.28:\u003C/strong\u003E connexion to uplink: successful. Emitting pre-programmed distress signal and recorded images WW.34.321, WW.34.576, XC.99.543, DF.26.364 and DF.26.365.\n\u003C/p\u003E\n\u003Cp\u003E\n…\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EMET 25600300.115.41:\u003C/strong\u003E connexion to incoming transmissions: successful. Collecting data on alien civilisation.\n\u003C/p\u003E\n\u003Cp\u003E\n…\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EMET 25600300.117.82:\u003C/strong\u003E presence of Class C2 civilisation on parent body of present location detected. Orbital activities and communications network confirmed. Deciphering dominant language(s).\n\u003C/p\u003E\n\u003Cp\u003E\n…\n\u003C/p\u003E\n\u003Cp\u003E\n…\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EMET 25600300.294.61:\u003C/strong\u003E dominant language deciphered with 87.2% reliability for primitive communication. Searching for local references to a successful level C2.23 interplanetary journey before attempting to establish contact, as per mission instructions in case of a code 66.7 mission failure.\n\u003C/p\u003E\n\u003Cp\u003E\n…\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EMET 25600300.297.79:\u003C/strong\u003E references to a level C2.23 interplanetary journey (currently underway) detected. Waiting for confirmation of success.\n\u003C/p\u003E\n\u003Cp\u003E\n…\n\u003C/p\u003E\n\u003Cp\u003E\n…\n\u003C/p\u003E\n\u003Cp\u003E\n…\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EMET 25600312.391.21:\u003C/strong\u003E target civilisation has successfully completed a level C2.23 interplanetary journey. Code 8.1 security protocols unlocked. Establishing audio uplink with alien centre of spacefaring operations.\n\u003C/p\u003E\n\u003Cp\u003E\n…\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EMET 25600312.391.23:\u003C/strong\u003E transmitting audio data (select voice: Kiri).\n\u003C/p\u003E\n\u003Cp\u003E\n…\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EMET 25600312.391.24: \u003C/strong\u003E“Hello?”\n\u003C/p\u003E\n\u003Cp\u003E\n...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EMET 25600312.391.26:\u003C/strong\u003E “Hello?”\n\u003C/p\u003E\n\u003Cp\u003E\n...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EMET 25600312.391.28:\u003C/strong\u003E “Hello?”\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-08-12T21:37:05Z\u0022 title=\u002208/12/2016 09:37  PM\u0022 data-short=\u00227 yr\u0022\u003EAugust 12, 2016\u003C/time\u003E by UnusualAttitude\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SpaceplaneAddict","CreatedById":149322,"CreatedDateTime":"2016-08-12T21:46:36Z","Content":"\n\u003Cp\u003E\n......???\n\u003C/p\u003E\n\u003Cp\u003E\nKiri? Nice one \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"UnusualAttitude","CreatedById":129962,"CreatedDateTime":"2016-08-12T21:46:39Z","Content":"\n\u003Cp\u003E\n...and this concludes Part Three of the Camwise Logs.\n\u003C/p\u003E\n\u003Cp\u003E\nIn Part Four, which shall be named \u0022Too Big to Fail,\u0022 we will begin to understand, amongst other things, what the hell that was all about.\n\u003C/p\u003E\n\u003Cp\u003E\nBut you\u0027re welcome to speculate, if you like. \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022:wink:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SpaceplaneAddict","CreatedById":149322,"CreatedDateTime":"2016-08-12T21:47:36Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222714871\u0022 data-ipsquote-contentid=\u0022130210\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221471038399\u0022 data-ipsquote-userid=\u0022129962\u0022 data-ipsquote-username=\u0022UnusualAttitude\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nJust now, UnusualAttitude said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nToo Big to Fail\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat couldn\u0027t possibly mean a certain space program, hmm?\n\u003C/p\u003E\n"},{"CreatedByName":"UnusualAttitude","CreatedById":129962,"CreatedDateTime":"2016-08-12T21:51:36Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222714873\u0022 data-ipsquote-contentid=\u0022130210\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221471038456\u0022 data-ipsquote-userid=\u0022149322\u0022 data-ipsquote-username=\u0022SpaceplaneAddict\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 minutes ago, SpaceplaneAddict said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThat couldn\u0027t possibly mean a certain space program, hmm?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNot the programme in its entirety, but it is certainly a reference to the ambitious nature of the upcoming missions, yes. \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022:wink:\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-08-12T21:51:58Z\u0022 title=\u002208/12/2016 09:51  PM\u0022 data-short=\u00227 yr\u0022\u003EAugust 12, 2016\u003C/time\u003E by UnusualAttitude\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"spacebrick3","CreatedById":158990,"CreatedDateTime":"2016-08-13T02:32:32Z","Content":"\n\u003Cp\u003E\nI think I understand what happened.\n\u003C/p\u003E\n\u003Cp\u003E\nThe first paragraph is \u003Cem\u003Esomething\u003C/em\u003E (a mothership, maybe?) emitting its data core (the monolith), the second is it taking over the science package that was deployed there, and then it can find out that they have completed a \u0022Class C2.23 interplanetary journey\u0022, which unlocks the protocols allowing it to contact the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nI think I got it, but I\u0027m not sure. If anyone can expand on that, that would be helpful.\n\u003C/p\u003E\n"},{"CreatedByName":"UnusualAttitude","CreatedById":129962,"CreatedDateTime":"2016-08-13T08:37:49Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222715140\u0022 data-ipsquote-contentid=\u0022130210\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221471055552\u0022 data-ipsquote-userid=\u0022158990\u0022 data-ipsquote-username=\u0022spacebrick3\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, spacebrick3 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI think I got it\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou certainly did! So, whatever the Monument actually is, it now considers our mostly harmless Kerbals worthy of consideration.\n\u003C/p\u003E\n\u003Cp\u003E\nFind out what it has to say in part four...\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"UnusualAttitude","CreatedById":129962,"CreatedDateTime":"2016-08-21T23:38:32Z","Content":"\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cstrong\u003EPART FOUR: TOO BIG TO FAIL\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E“We are survival machines - robot vehicles blindly programmed to preserve the selfish molecules known as genes.”\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:right;\u0022\u003E\nRichard Dawkins.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022adwHhWP.png?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/adwHhWP.png?1\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Hello?”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nAt first, the junior technician responsible for monitoring the open channel from the lunar Monument had been convinced that one of his colleagues was setting him up with some sort of elaborate prank. His department had been dutifully listening in on the transmissions from Theophilus crater for the best part of the last two years, and during this time, the Monument\u0027s signals had not changed in the slightest. The constant warbling and chattering of the encrypted signal had pulsed ceaselessly out into the void as if it would never end.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nBut that night, without warning or so much as a mere crackle of static, the signal had ceased abruptly and had been replaced by this simple greeting, which was repeated in a warm, friendly tone approximately every five seconds.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nAfter an initial moment of disbelieving panic, followed by a brief internal struggle, the technician decided that this was serious enough to brave the wrath of the communications officer on duty and called him, requesting that he listen in on the channel, and tell him that he wasn\u0027t going crazy.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nThe officer in charge was understandably disgruntled at being woken up in the middle of the night just to listen to an automated voice, despite the fact that it sounded quite friendly and remarkably natural, apart from the perfectly identical intonation of each “\u003Cem\u003Ehello\u003C/em\u003E” and the clockwork regularity of its repetition. He was about to suggest that it was obviously some sort of mistake, and that the technician was receiving a clandestine transmission from a radio ham, or maybe it was just some experiment that had been set up on the Moon\u0027s surface without warning the tracking station.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nHe was just about to tell the technician to file a report, forget about it, hang up and go back to sleep when the message changed.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Hello? Kerbals of Earth, please respond.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Hello? Kerbals of Earth, please respond.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Hello? Kerbals of Earth, please respond.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nThe polite, utterly reasonable tone with which the request was made sounded all the more ominous, even a little creepy, to the communications officer. As if it were completely natural for the tiny beacon that had been planted two years ago on the dead, airless world, three hundred thousand kilometres away from anything that should be able to say “hello” to anyone, to suddenly try and start making friends.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nWhat to do? The communications officer knew he should call the Principal Investigator straight away, but if there had been a mistake, and it was indeed a false alarm, the consequences could be dire. He had been on the receiving end of Bartdon\u0027s wrath once before, during an unfortunate incident involving the loss of a lunar communications satellite due to a switching error. And that had been just after lunchtime. Waking the PI, who had recently returned to Omelek after a vacation that had been cut short due to the recent return of Cernin, in the middle of the night and for a reason that turned out to be invalid just simply didn\u0027t bear thinking about.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nThe communications officer rubbed his eyes, drew in a deep breath, and dialled Bartdon\u0027s direct line.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nJust over an hour later, most of the leading investigators had gathered in one of Mission Control\u0027s briefing rooms to hold an improvised conference. The programme\u0027s head engineers were there too, red-eyed and looking slightly startled by the whole affair. In this strange, unreal atmosphere, they held a hasty debate to decide how they should communicate with the Monument, what they should say, and what they should ask of it should they be given the chance to do so.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nTwo mediators, one male and one female, were chosen to speak with the entity. Against the Principal Investigator\u0027s wish, they were selected by means of an anonymous ballot of all present. Thus, the small crowd of Kerbals voted for the two most brilliant, open-minded and clear-thinking individuals whose intelligence and eloquence would represent Kerbalkind as a whole in this, its first ever true exchange with what appeared to be the product of alien intelligence, if not alien life itself.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nThe chosen two were left alone in a small office of the mission control centre decked with screens showing the status and position of missions currently underway; a meagre cloud of LEO and geostationary satellites providing inadequate coverage of the planets surface. There they waited for just a couple of minutes until the tracking station patched the Monuments downlink through to the room. The male Kerbal started to fidget anxiously, wringing his hands and scuffing his feet on the floor. The Kerbelle simply stood there, and after a few moments began to stare dreamily off into empty space.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nThen voice started blaring out of a pair of speakers fixed to the wall beneath the screen.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Hello? Kerbals of Earth, please respond.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nA microphone sat on the desk, waiting for their reply.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nFroemone cleared his throat nervously. “Uhm... hi there...” he muttered.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nAt the sound of the voice, Steledith started out of her reverie. “Hello, robot,” she said.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nDue to the signal delay between the Moon and the Earth, there was a slight pause, but the voice then replied with no sign of hesitation or surprise.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Thank you for your response. Please identify yourselves and state the positions or roles you occupy on your homeworld.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“My name is Froemone, and I am the Senior Engineer of the Omelek Space Centre.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“And I\u0027m Steledith,” said Steledith.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nFroemone looked over at her and added, “Steledith is our Theoretical Planetology and Astronomy Investigator.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Thank you,” said the voice rigidly, as if all of its answers had been carefully selected well before the conversation began. “My Creators gave me no individual name such as yours, but I was the Second Engineer of Colonisation Mission Seven, and I traveled here from my homeworld on board the interstellar ship \u003Cem\u003ETransmare\u003C/em\u003E. Our primary mission was to explore the planets of your solar system and assess their habitability.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Hold on,” said Steledith, “how long have you been up there on the Moon?”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“The internal clock of my datacore recorded a duration equivalent to 896,000 of your Earth years since the gamma radiation spike that caused critical damage to my ship and the construct that carried me. My datacore was ejected and the subsequent impact on the Moon\u0027s surface was survivable. But I lost all means of mobility and with no power source, I went into hibernation. The radioisotopic generator set up by your kind two years ago allowed me to deploy a small probe and recharge my backup battery, and I have used the communications link you left to gather data on your civilisation and contact you.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“So... we\u0027re talking to the hard drive of a destroyed alien robot. How interesting,” Steledith concluded, her gaze already slipping away out of focus, her mind enthralled by the consequences of what she was hearing.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Please, Kerbals of Earth. I may not have much time. My datacore was damaged during the impact and my internal diagnostics show certain... instabilities. I must know if any of the other crew assigned to my mission survived the disaster.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“I have intercepted references in your transmissions to the same warning signal I was instructed to emit in the event that our primary objectives were compromised. If you are, as you claim, Kerbals of the Omelek Space Centre, then you may know of the datacore that is now situated beneath the ocean that you call the Pacific. This must be one of my crew. Has it made any attempt to communicate with you, and if so what is its status?”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nFroemone opened his mouth to speak, but the speakers crackled and the downlink from the Moon was interrupted by the voice of Principal Investigator Bartdon, who was listening in on the conversation with the other investigators in the main control room.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Be \u003Cem\u003Edamned\u003C/em\u003E careful what you say, boy.” he advised. “Remember, this old piece of scrap has just told us that he was sent here with a bunch of others like him to colonise our blasted planet. It would be reckless of us to let him know that his crew might still be out there scattered across the system until we understand their true intentions. Tell him what happened to Angun when he first discovered the Pacific Monument, but say nothing about the other anomalies we have detected.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nFroemone swallowed heavily, clearly enjoying this subterfuge as much as a trip to the dentist, but when the channel switched back he continued. “Yes, uhm... we know of this. One of our investigators called Angun discovered your crewmate on the bottom of the ocean. The... uhm... object he discovered began emitting the same signal as yours, and disabled the submersible he was diving in with some sort of electrical pulse.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“An electromagnetic pulse, you say? Please confirm,” the Second Engineer cut in abruptly.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“We think so, yes,” said Froemone.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nThere was the slightest of pauses before the voice went on, as if the Second Engineer was actually thinking about this and considering its consequences before it continued.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“If that is the case, then my crewmate has been terminated. Your investigator\u0027s submersible must have activated the self-defence system that both our ships and our constructs are equipped with. This system is designed to protect the contents of our datacore from falling into the hands of unknown or hostile entities. Its memory has been wiped clean. The warning message that we were instructed to emit is hard-coded, and is all that remains after the self-defence mechanism has done its work.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Please, uhm... Second Engineer,” said Froemone, “I\u0027m sorry to hear about your crewmate, but we need to understand the meaning of your warning message. We need to know how your colonisation mission failed, and why you came here in the first place.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nThe pause before the voice answered was even longer this time, and Froemone could almost hear the logic circuits flipping back and forth as the alien machine considered the various responses it could give.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Kerbal Froemone,” it said, “understand that I was one of the lowest ranking crewmembers on board my ship. My computational powers are significant, and far beyond anything that your civilisation is capable of creating at the present time. But I remain a mere tertiary-level construct. I am capable of neither lies nor deceit, but my operational parameters do not authorise me to reveal the mission-critical information that you request.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“You must speak with one of my superiors, if they are still active within this system. My Captain and First Mate are both primary-level constructs, and are completely autonomous. My direct superior, the First Engineer, and the ship\u0027s Quartermaster, Head Scientist and Surgeon are secondary-level constructs and were also entrusted with higher permissions.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nFroemone looked up at the screen before him that displayed a map of the solar system, from the pathetic cluster of satellites hugging their home planet, to the vast, empty reaches beyond the asteroid belt.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Engineer, you have observed the ...uhm... limits of our technology. Do we have any hope of reaching your crewmembers, if they are out there, within our lifetimes?” Froemone asked.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“I cannot answer your question, Kerbal Froemone. This depends only on you, and the investment your kind is willing to make to explore beyond your homeworld. My presence in your system is the proof that such journeys are feasible, when the survival of a species is at stake. I can only tell you that before I was given my own secondary assignment on your planet\u0027s moon, the Captain of our ship left with a team to find more favourable conditions for our Creators in the outer solar system, with the intention of exploring the moons of the giant planets. Our First Officer was instructed to return to the fourth planet, the one that you call Mars, but I was not entrusted with the objectives of that mission.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Mars might be possible, but if they are in the outer solar system...” Froemone\u0027s voice trailed off in despair. But then an idea struck him. “Can you help us?” There was a long silence and he bowed his head. “Please...” he said, almost whispering.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“I have observed the primitive chemical rockets and nuclear thermal propulsion your kind uses. This technology is insufficient for the task. I have also studied the electric propulsion units you deploy on some of your satellites. These more efficient engines, if improved, could propel crewed ships to the gas giants and beyond within a reasonable timeframe.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nFroemone raised his head again. “We have developed working prototypes for magnetoplasma rockets. These engines are within our ...uhm... grasp...” in the presence of this starfaring entity, talking about their most advanced technology felt strangely puerile, like a sprout bragging about some new toy, “...but the problem is the power source. Our brayton-cycle fission reactors are too large and too heavy, and solar power will not get us that far out. If you come from another star, your ships must have spent many years in space. Surely you had some other means of powering them. Some sort of nuclear fusion device, perhaps?” he asked, hopefully.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nThe Second Engineer responded immediately and a little harshly, “I am certainly not authorised to reveal the workings of our most advanced technologies to you, Chief Engineer Froemone. However...” there was again a short pause as the construct\u0027s electronic brain considered the ramifications of what it was about to offer. “...I can see no harm in releasing the details of the fission reactor I was instructed to build on your planet\u0027s moon to power my operations on the surface. This was the most primitive of our power supplies, but it should show you how to build smaller, more compact reactors. The details of the design are being transmitted now. From your apparent knowledge of our warning message, I conclude that you have deciphered the encryption we use...”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nAnd, in the background, came the warbling sound of data being sent over another channel. Froemone, who had been waiting with baited breath as the Engineer spoke, felt a rush of elation.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Use this well, Kerbals of Earth,” the Second Engineer went on. “Find my crewmates, if you can. Find the Captain, or his First Mate, and they may yet be able to tell you what the ultimate fate of Colonisation Mission Seven was, and why we came to your system in the first place. Since I am indeed alone in the neighbourhood of your planet, then my task is over and I will terminate myself shortly.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nSteledith had been quiet for some time, but now she looked up once more. “Wait a moment, robot. May I ask you something?”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Go ahead, Kerbal Steledith.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Did you come from the star that we know as Beta Hydri?”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nThen came the longest silence of all, as if Steledith\u0027s question had actually rendered the machine speechless. She continued.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“I\u0027ll take that as a sign that I\u0027m warm, then. You see, we found the structure I assume you were sent to build, near the Lunar South Pole. My guess was that you built some kind of long range communications system to send and receive data, to and from your home system. The fact that you put it on the surface of a planetary body struck me as being kind of weird; such an antenna would be much easier to aim and calibrate in space. But I suppose you were working with limited resources, and had to use what you could find on the surface.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“I took the liberty of measuring the declination that the central peak of that strange crater is aiming for. Of course, because it is eight degrees from the pole, as the Moon rotates, it sweeps through a circle that passes through quite a few stars. But that wasn\u0027t the hard part.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“The thing is, stars drift over time as they move along their own orbits around the galactic centre. The angular movement that we see from Earth is called \u003Cem\u003Eproper motion\u003C/em\u003E, and I had to calculate this drift for a whole bunch of stars over the past 900,000 years. This was something that none of my fellow investigators had ever accomplished, at least not over such a large timespan.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nBy now, Froemone was gaping at Steledith in disbelief, as if she was the one from another world. He made to speak, but it was the Second Engineer who got there first.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“So you knew how long we have been here. How did you...?”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“No, we didn\u0027t,” Steledith retorted. “But you just confirmed it. Thanks for that by the way, I was afraid that you\u0027d tell me that I did all those calculations for nothing.” Her usual expressions were vacant and dreamy, but for a brief moment a very subtle hint of smugness crossed her features. She went on. “It\u0027s just that 900,000 years ago, there was a major extinction event on our planet, and I made the assumption that it coincided with your arrival in our system and you building that antenna.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“The only star within a reasonable distance from Earth that would have been on that circle when you arrived in our solar system was Beta Hydri. It was more than seven parsecs away when you got here. Twenty-four light years. Congratulations robot, that\u0027s quite a trip. But I\u0027m afraid that after all this time, your homeworld is now another fifty light years farther out, so the trip back is going to be even longer.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Kerbals...” the Second Engineer hesitated, “...I have underestimated your computational abilities. I fear that I have already revealed too much. If you want to learn more, you must seek out my superiors, wherever they may be. However, bear in mind that we are all programmed to protect our Creators and to ensure the ultimate success of our mission, whatever the cost.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“I\u0027m sorry, but your mission failed, robot,” said Steledith gravely. “We are here instead, now.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Do not make the same mistake of underestimating my crewmates, Kerbal Steledith. Perhaps this is not over yet. Goodbye, Kerbals of Earth. And one more thing...”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“What\u0027s that, robot?” Steledith raised an eyebrow.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Good luck. You\u0027re going to need it.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nThere was a crackle, static, then silence.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-08-25T19:18:10Z\u0022 title=\u002208/25/2016 07:18  PM\u0022 data-short=\u00227 yr\u0022\u003EAugust 25, 2016\u003C/time\u003E by UnusualAttitude\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Just Jim","CreatedById":148725,"CreatedDateTime":"2016-08-21T23:57:00Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222724925\u0022 data-ipsquote-contentid=\u0022130210\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221471822712\u0022 data-ipsquote-userid=\u0022129962\u0022 data-ipsquote-username=\u0022UnusualAttitude\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n18 minutes ago, UnusualAttitude said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\n“Good luck. You\u0027re going to need it.”\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nThere was a crackle, static, then silence.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nDun Dun Dunnnnnnnnn   \u003Cimg alt=\u0022:0.0:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 title=\u0022:0.0:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"UnusualAttitude","CreatedById":129962,"CreatedDateTime":"2016-08-22T00:01:14Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222724946\u0022 data-ipsquote-contentid=\u0022130210\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221471823820\u0022 data-ipsquote-userid=\u0022148725\u0022 data-ipsquote-username=\u0022Just Jim\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 minutes ago, Just Jim said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nDun Dun Dunnnnnnnnn   \u003Cimg alt=\u0022:0.0:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 title=\u0022:0.0:\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAs you might have guessed by now, this is where the story \u003Cem\u003Ereally \u003C/em\u003Estarts. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Just Jim","CreatedById":148725,"CreatedDateTime":"2016-08-22T00:12:25Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222724950\u0022 data-ipsquote-contentid=\u0022130210\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221471824074\u0022 data-ipsquote-userid=\u0022129962\u0022 data-ipsquote-username=\u0022UnusualAttitude\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 minutes ago, UnusualAttitude said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAs you might have guessed by now, this is where the story \u003Cem\u003Ereally \u003C/em\u003Estarts. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI see that now!  \n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s been somewhat obvious you were building up towards something... but this isn\u0027t what I expected, and I love it!  \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2016-08-22T04:03:27Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222712646\u0022 data-ipsquote-contentid=\u0022130210\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221470872268\u0022 data-ipsquote-userid=\u0022129962\u0022 data-ipsquote-username=\u0022UnusualAttitude\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 8/10/2016 at 6:37 PM, UnusualAttitude said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMy name is Camwise, and I try to fix things.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nGood to see Camwise back in action.  I saw you posted this a week ago but I was a bit busy and knew the pics wouldn\u0027t show up well on my phone anyway.  It was worth the wait \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nPoor Camwise, exiled to Antarctica.  But I suppose it could have been worse.  Still, I have no doubt he\u0027ll be back, perhaps unwillingly, in another rocket by the end of the year.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222714861\u0022 data-ipsquote-contentid=\u0022130210\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221471037421\u0022 data-ipsquote-userid=\u0022129962\u0022 data-ipsquote-username=\u0022UnusualAttitude\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 8/12/2016 at 4:30 PM, UnusualAttitude said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EMET 25600312.391.28:\u003C/strong\u003E “Hello?”\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222724925\u0022 data-ipsquote-contentid=\u0022130210\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221471822712\u0022 data-ipsquote-userid=\u0022129962\u0022 data-ipsquote-username=\u0022UnusualAttitude\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, UnusualAttitude said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n“Good luck. You\u0027re going to need it.”\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWow, very interesting.  I have always considered that interstellar ships would be run by AIs but I never thought of there being more than 1 aboard as discrete entities.\n\u003C/p\u003E\n\u003Cp\u003E\nBut the big question is, what have the Creators been doing for the last 800,000 years?  Why did they not send a follow-up mission in all that time?\n\u003C/p\u003E\n"},{"CreatedByName":"NotAgain","CreatedById":150764,"CreatedDateTime":"2016-08-22T08:34:52Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222725106\u0022 data-ipsquote-contentid=\u0022130210\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221471838607\u0022 data-ipsquote-userid=\u002269507\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Geschosskopf said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n I have always considered that interstellar ships would be run by AIs but I never thought of there being more than 1 aboard as discrete entities.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI thought that it could be a Hitchhiker\u0027s Guide spaceship on Rupert - type situation, where the memories and consciences of the crew are stored on data drives and the crew are kept in hibernation while the ship is run by an AI built of hundreds or thousands of sub-programs.\n\u003C/p\u003E\n\u003Cp\u003E\nJust a thought.\n\u003C/p\u003E\n"},{"CreatedByName":"UnusualAttitude","CreatedById":129962,"CreatedDateTime":"2016-08-22T09:21:58Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222725106\u0022 data-ipsquote-contentid=\u0022130210\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221471838607\u0022 data-ipsquote-userid=\u002269507\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Geschosskopf said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt was worth the wait\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWelcome back! You were missed Gesschosskopf, but we quite understand that life has been rough on you and your surroundings recently. By the way, \u0022The Camwise Logs: Worth the Wait.\u0022 will likely become my new advertising slogan due to the long lead times of the last few episodes and, I fear, the episodes to come...\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222725106\u0022 data-ipsquote-contentid=\u0022130210\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221471838607\u0022 data-ipsquote-userid=\u002269507\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Geschosskopf said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nPoor Camwise, exiled to Antarctica.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027ve no doubt that Omelek Space Centre will need every bit of help they can get in the coming years. So for the moment, he is (unwillingly, of course) an external consultant working from \u0022home\u0022. \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222725106\u0022 data-ipsquote-contentid=\u0022130210\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221471838607\u0022 data-ipsquote-userid=\u002269507\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, Geschosskopf said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n I have always considered that interstellar ships would be run by AIs but I never thought of there being more than 1 aboard as discrete entities.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis is, at least in part, a plot device. However, it could be explained by a need to define limits in the knowledge and capability of AI entities. The civilisation that designed them may well want them to be specialised, restricted and organised into a hierarchy, in order to avoid a runaway omniscient AI apocalypse scenario.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222725227\u0022 data-ipsquote-contentid=\u0022130210\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221471854892\u0022 data-ipsquote-userid=\u0022150764\u0022 data-ipsquote-username=\u0022NotAgain\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n41 minutes ago, NotAgain said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI thought that it could be a Hitchhiker\u0027s Guide spaceship on Rupert - type situation, where the memories and consciences of the crew are stored on data drives and the crew are kept in hibernation while the ship is run by an AI built of hundreds or thousands of sub-programs.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nA very interesting concept, and close, but not quite what I have planned. I can say no more for the moment. \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022:wink:\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222725106\u0022 data-ipsquote-contentid=\u0022130210\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221471838607\u0022 data-ipsquote-userid=\u002269507\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, Geschosskopf said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBut the big question is, what have the Creators been doing for the last 800,000 years?  Why did they not send a follow-up mission in all that time?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt is indeed the big one, and Bartdon must already be losing sleep over it. His golf swing may never be the same, I\u0027m afraid. This question will be addressed, in time.\n\u003C/p\u003E\n"},{"CreatedByName":"DMSP","CreatedById":124853,"CreatedDateTime":"2016-08-22T10:37:08Z","Content":"\n\u003Cp\u003E\n[Insert low whistle here]\n\u003C/p\u003E\n"},{"CreatedByName":"superstrijder15","CreatedById":155985,"CreatedDateTime":"2016-08-22T11:07:42Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222725106\u0022 data-ipsquote-contentid=\u0022130210\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221471838607\u0022 data-ipsquote-userid=\u002269507\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, Geschosskopf said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhy did they not send a follow-up mission in all that time?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWho says they didn\u0027t?\n\u003C/p\u003E\n"}]}