{"TopicId":130486,"ForumId":16,"TopicTitle":"EVA orientation mess","CreatedByName":"Kelderek","CreatedById":131312,"CreatedDateTime":"2016-01-22T16:06:01Z","PageNum":1,"Articles":[{"CreatedByName":"Kelderek","CreatedById":131312,"CreatedDateTime":"2016-01-22T16:06:01Z","Content":"\n\u003Cp\u003E\nI had a really bizarre thing happen last night that I can only assume is some sort of bug or glitch.  I sent my kerbal on EVA to collect some science from experiments of a stage that would eventually be discarded so that he could take them back to kerbin inside the command pod.  While I was trying to maneuver around the vessel using the EVA RCS, the orientation kept changing its axis by 90 degrees in a random direction.  I would thrust once or twice to the left and all of a sudden I would be facing a completely different direction.  Every time I tried to correct and steer back to the ship the orientation would change again.  This orientation change meant that I could no longer control where I was going - it took all my effort just to stay in the vicinity of the ship and not fly off into the void.  \n\u003C/p\u003E\n\u003Cp\u003E\nThe shift was always 90 degrees in a (seemingly) random direction and it changed the camera and navball at the same time.  It also happened when I got close to the ship.  The ship was a simple 1.25m command pod, service bay, materials bay, fuel tank and terrier, with the pod able to decouple alone for re-entry.\n\u003C/p\u003E\n\u003Cp\u003E\nI eventually managed to get close enough to hit \u0022F\u0022 and grab on to the command pod and board, but this was a crazy few minutes that left me quite frazzled.\n\u003C/p\u003E\n\u003Cp\u003E\nAre any of you familiar with this and know how I might prevent it from happening again?  All my other EVAs seem to go ok, so I\u0027m not sure what made this one different - I\u0027m not sure how to reproduce it.\n\u003C/p\u003E\n"},{"CreatedByName":"ineon","CreatedById":152379,"CreatedDateTime":"2016-01-22T16:41:13Z","Content":"\n\u003Cp\u003E\nWere you in a very low orbit? It could be that by changing your direction by just a few m/s that you were changing from an orbital trajectory to a sub-orbital trajectory. I think that when you are orbiting then down is towards the south pole, whereas when you are sub-orbital down is towards the ground. \n\u003C/p\u003E\n\u003Cp\u003E\nEven if this is the case, then I agree that it still seems fairly poor usability to have all the directions flip.\n\u003C/p\u003E\n"},{"CreatedByName":"Kelderek","CreatedById":131312,"CreatedDateTime":"2016-01-22T18:39:52Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222374241\u0022 data-ipsquote-contentid=\u0022130486\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221453480873\u0022 data-ipsquote-userid=\u0022152379\u0022 data-ipsquote-username=\u0022ineon\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, ineon said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWere you in a very low orbit?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHmm, it\u0027s possible, but I don\u0027t recall exactly.  I had just launched off the surface of Minmus and was cleaning up the science data once I was in orbit before returning to Kerbin.  That seems like a reasonable explanation, but that is creepy weird that I would be right on the edge of the boundary like that.\n\u003C/p\u003E\n"},{"CreatedByName":"Zhetaan","CreatedById":125721,"CreatedDateTime":"2016-01-22T20:16:02Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/152379-ineon/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022152379\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/152379-ineon/\u0022\u003E@ineon\u003C/a\u003E is correct:  When in orbit, \u0027down\u0027 (meaning \u0027down\u0027 from the camera\u0027s perspective) is parallel to the south-pointing axis.  When suborbital, flying, or landed, \u0027down\u0027 is towards the centre of the planet.  There is always a shift from one to the other when you make orbit or deorbit; pay close attention to your next launch and you\u0027ll see it happen when your periapsis climbs off the surface of the planet.\n\u003C/p\u003E\n\u003Cp\u003E\nBecause Minmus has such low gravity, it takes very little to push yourself from orbital to suborbital and back again.  Add an overpowered jetpack and you\u0027ll find that the \u0027boundary\u0027 you described is quite large.\n\u003C/p\u003E\n\u003Cp\u003E\nTo keep it from happening again when you next go on EVA, try pressing \u0027V\u0027 to force the camera to go from automatic to a specific mode.  That should keep it from switching on you.\n\u003C/p\u003E\n\u003Cp\u003E\nAs to the navball changing, keep in mind that the EVA navball follows the camera rather than the Kerbal:  change the camera and you change the navball, too.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-01-22T20:17:49Z\u0022 title=\u002201/22/2016 08:17  PM\u0022 data-short=\u00228 yr\u0022\u003EJanuary 22, 2016\u003C/time\u003E by Zhetaan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kelderek","CreatedById":131312,"CreatedDateTime":"2016-01-22T21:33:05Z","Content":"\n\u003Cp\u003E\nThanks for the responses.  It was really frustrating -- it felt like driving a shopping cart at the grocery store when one wheel is broken.\n\u003C/p\u003E\n\u003Cp\u003E\nIf it happens again I\u0027ll try messing with the camera controls to see if that helps.\n\u003C/p\u003E\n"}]}