{"TopicId":130506,"ForumId":70,"TopicTitle":"Disappearing ships and no craft markers","CreatedByName":"The Optimist","CreatedById":151904,"CreatedDateTime":"2016-01-23T00:09:03Z","PageNum":1,"Articles":[{"CreatedByName":"The Optimist","CreatedById":151904,"CreatedDateTime":"2016-01-23T00:09:03Z","Content":"\n\u003Cp\u003E\nMod list: \n\u003C/p\u003E\n\u003Cp\u003E\nModulemanager 2.5.13\n\u003C/p\u003E\n\u003Cp\u003E\nMechjeb (1.0.5)\n\u003C/p\u003E\n\u003Cp\u003E\nKerbal Joint Reinforcement\n\u003C/p\u003E\n\u003Cp\u003E\nNoOffsetLimits \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI was trying to land a plane on my new aircraft carrier. So, I launched it and there were no markers around any of my craft. I set the carrier as my target, and I followed it. Then, after a couple of minutes, the target marker disappeared. I went into map view to look for it, but it was gone, except for at the tracking station. I reloaded, and the same thing happened. Anyone know why this happens? It\u0027s the same on my other save files, if that helps.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-01-23T01:16:30Z\u0022 title=\u002201/23/2016 01:16  AM\u0022 data-short=\u00228 yr\u0022\u003EJanuary 23, 2016\u003C/time\u003E by The Optimist\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2016-01-23T03:57:34Z","Content":"\n\u003Cp\u003E\nTry removing 3 of them, testing, and it you don\u0027t have the issue, remove that one and add another.  Repeat.  If you can\u0027t isolate a single mod, it\u0027s likely a conflict between two of them.  That becomes harder to test.  It appears that that version of MM is out of date, so update that first.  No offset limits and KJR would be the first I\u0027d look at.  Also make sure you have the latest version of all of those mods.\n\u003C/p\u003E\n"},{"CreatedByName":"vans0051","CreatedById":156435,"CreatedDateTime":"2016-01-28T16:43:54Z","Content":"\n\u003Cp\u003E\nI also started experiencing this problem this morning after installing MM last night.  I just downloaded MM (looks like version 2.6.18, if I\u0027m reading the .dll file correctly), so it can\u0027t be out of date yet.  The only other mod I\u0027m using is SpaceY Heavy Lifters (v1.8.2) and MechJeb (v2.5.1).  I can\u0027t tell from the description of the problem if it\u0027s the same as mine, but it sounds like it could be.  Basically, the diamonds that mark debris or another craft nearby and show the distance don\u0027t appear anymore after the MM install last night.\n\u003C/p\u003E\n"}]}