{"TopicId":13061,"ForumId":32,"TopicTitle":"Rocket science for noobs","CreatedByName":"Analogy","CreatedById":28969,"CreatedDateTime":"2012-06-22T04:53:03Z","PageNum":1,"Articles":[{"CreatedByName":"Analogy","CreatedById":28969,"CreatedDateTime":"2012-06-22T04:53:03Z","Content":"\n\u003Cp\u003EI don\\\u0027t see a comprehensive strategy guide around here, so I decided to write one.\u003C/p\u003E\u003Cp\u003EOkay, so let\\\u0027s start with the basics. Your trajectory in space is defined by your position and your velocity. If your current trajectory doesn\\\u0027t take you where you want to go, you use a change in velocity, or delta-v (from the greek symbol delta, representing change, and v, representing velocity) to change your trajectory so it ends up where you want to go. Delta-v is incredibly important, the amount of delta-v your vehicle is capable of producing fundamentally defines what it is capable of doing.\u003C/p\u003E\u003Cp\u003EDelta-v is a function of the amount of fuel in your vehicle and its total mass. It takes more fuel to impart the same amount of delta-v on more mass, and vice versa. That means that adding an engine, which has mass, can actually cause your vehicle to be capable of less total delta-v, even though you have more peak thrust available to you. Balancing the needs of having high thrust and of having low mass is critical.\u003C/p\u003E\u003Cp\u003EI see so many rockets that seem to have been designed by saying \u0027I\\\u0027m running out of fuel, better add more... Now I can\\\u0027t get off the pad, better add more engines\u0027 ad nauseum until you end up with this massive unwieldy vehicle brute forcing its way into space... Screw that! You can get into orbit and come back on one and a half tanks of fuel. You can land on Mun and come back on three. The secret is that a lighter rocket gets more delta-v out of the same amount of fuel. If you\\\u0027re running out of fuel, before you start adding more weight to the rocket, look for ways that you can *reduce* the weight of the rocket to get more delta-v out of the fuel you already have. This is what staging is fundamentally about, you don\\\u0027t drop things off your rocket because it looks cool, you drop things off your rocket because you don\\\u0027t need them anymore and dropping them makes your rocket lighter.\u003C/p\u003E\u003Cp\u003EYou start your mission on the ground on Kerbin with 175 m/s of velocity from the rotation of the planet. Your first task is to get above the atmosphere with enough velocity to not fall back into it, this is about 2300 m/s, or about 2125 m/s of delta-v. But wait, the atmosphere slows you down with drag. You are going to have to burn your engines more to get the same change in velocity. Also, because the shortest path out of the delta-v-sucking atmosphere is straight up, but your velocity in orbit wants to be sideways, the fuel you burn to take you straight up out of the atmosphere will not end up paying for itself in orbital velocity. In the end, your engines are going to have to burn as if you were giving yourself around 4500 m/s of delta-v in order to give you your 2300 m/s of orbital velocity! Madness!\u003C/p\u003E\u003Cp\u003ESo hopefully you\\\u0027re starting to see the implications of this for your spacecraft design. Right off the pad, you want your rocket to be producing as much thrust as you can to get your vehicle up through the thick part of the atmosphere as quickly as possible. Once you\\\u0027re through the thickest part of the atmosphere, though, above 30,000 meters, you\\\u0027re not counteracting the atmosphere anymore, you only need enough thrust to keep accelerating you toward orbit, so drop some of those heavy engines and empty fuel tanks to lighten your load. Once you\\\u0027re almost to orbit, you\\\u0027re not fighting anything anymore, your engines are delivering pure delta-v, so drop all but your last engine. Design each stage to have just enough thrust and just enough fuel to get to these points.\u003C/p\u003E\u003Cp\u003EAs for the stages themselves... Well, real-life spacecraft design puts one stage on top of another, but in KSP that\\\u0027s actually not the best approach. KSP engines are very very heavy, so putting an engine on an upper stage where the lower stages have to haul it all the way up is pretty inefficient. I have found that the best technique is to put all of your craft\\\u0027s engines on the bottom, firing at liftoff and drop them two at a time (opposite from each other so your center of gravity/thrust stays centered!) as you climb. Put your first \u0027stage\u0027 worth of fuel tanks on the first pair of engines that will drop, use fuel crossfeed pipes to feed all of the engines from prior stages so that when a stage drops off, the remaining stages are left with full fuel tanks. \u003Ca href=\u0022http://kerbalspaceprogram.com/forum/index.php?topic=14565.0\u0022 rel=\u0022external nofollow\u0022\u003EThis\u003C/a\u003E craft is a decent illustration of the principle, though a practical craft for routine tasks will not need anywhere close to that amount of power or fuel. Remember, you can get to Mun and back on 3 tanks!\u003C/p\u003E\u003Cp\u003EPart 2: Orbital mechanics will go here if this post gets a decent response.\u003C/p\u003E\n"},{"CreatedByName":"Zephram Kerman","CreatedById":15270,"CreatedDateTime":"2012-06-22T07:25:52Z","Content":"\n\u003Cp\u003EHey that\\\u0027s pretty gewd! Relatively concise, considering the quantity of concepts being presented. I\\\u0027ll look forward to reading your take on orbital mechanics. (That\\\u0027s a pretty huge area all by itself!)\u003C/p\u003E\n"},{"CreatedByName":"TerranCmdr","CreatedById":23552,"CreatedDateTime":"2012-06-23T02:59:43Z","Content":"\n\u003Cp\u003ENice! I actually learned quite a bit just from your little post there. Please follow up with orbital mechanics!\u003C/p\u003E\n"}]}