{"TopicId":130838,"ForumId":70,"TopicTitle":"Frozen Saves","CreatedByName":"Graves","CreatedById":157677,"CreatedDateTime":"2016-01-27T14:01:42Z","PageNum":1,"Articles":[{"CreatedByName":"Graves","CreatedById":157677,"CreatedDateTime":"2016-01-27T14:01:42Z","Content":"\n\u003Cp\u003E\nI began playing KSP fairly recently, and speaking with a friend who had more experience, I applied MechJeb2, SCAN, Docking Port Alignment and Alarm Clock.  I have copies of the game from Steam and GoG.  The same mods are on both installations.  As I played campaign mode, I would have occasional glitches where I would open the game and campaign and instead of loading normally, I would find my point of view was at KSC, ground level, between the VAB and R\u0026amp;D and viewing the SPH.  Sometimes an Earth Alarm with a rooster cry is waiting when this loads, something I\u0027ve not used.  When I find myself viewing this scene, the campaign is locked.  Sometimes I can open up the load window and try and load another save, when I do this sometimes I can get another save to successfully load, very occasionally I can open up another save to a spacecraft and I can view the craft, use MechJeb modules, but the right mouse button does nothing, same as it does when I\u0027m frozen at KSC.  Sometimes I can close the game and later go back and open a save which I was unable to open before.  This behavior has happened on both the GoG and Steam versions, before and after I updated to 1028.  I believed this was likely a memory issue and applied the aggressive active textures management mod, which appeared to deal with the issue for two days, though it wiped my contracts and I\u0027m now stuck with a tourist I can\u0027t get rid of.  This makes campaign play essentially impossible, I\u0027ve run the same set of missions over and over again, added contracts which aren\u0027t there next time I get the campaign to load, I have to survey the situation each time I load to see what I\u0027m trying to do. \n\u003C/p\u003E\n\u003Cp\u003E\nI haven\u0027t seen this behavior listed in the forums, any thoughts or suggestions?  I\u0027d start another campaign but since I don\u0027t know what is happening, I have no reason to believe I won\u0027t find myself in the same situation again. \n\u003C/p\u003E\n"},{"CreatedByName":"Benoit Hage","CreatedById":104585,"CreatedDateTime":"2016-01-28T12:54:17Z","Content":"\n\u003Cp\u003E\nIt is hard to tell from just your description. You will need to upload your logs. More information \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/83213-please-read-before-posting-stock-support-bug-reporting-guide/\u0022\u003Ein this thread\u003C/a\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nMy first impression is that you have mods that aren\u0027t updated, but I could be wrong.\n\u003C/p\u003E\n"},{"CreatedByName":"Kuengineer","CreatedById":158499,"CreatedDateTime":"2016-02-12T14:53:54Z","Content":"\n\u003Cp\u003E\nHaving the same issue, I run KAS, KIS, interstellar, kerbal alarm, trajectories, and engineer redoux.. updated all this morning. \n\u003C/p\u003E\n"}]}