{"TopicId":131011,"ForumId":18,"TopicTitle":"I made this random thread","CreatedByName":"The Optimist","CreatedById":151904,"CreatedDateTime":"2016-01-30T02:14:52Z","PageNum":1,"Articles":[{"CreatedByName":"The Optimist","CreatedById":151904,"CreatedDateTime":"2016-01-30T02:14:52Z","Content":"\n\u003Cp\u003E\nHello. I made this thread for some reason. I regret doing so. Please delete it\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-01-30T02:21:26Z\u0022 title=\u002201/30/2016 02:21  AM\u0022 data-short=\u00228 yr\u0022\u003EJanuary 30, 2016\u003C/time\u003E by The Optimist\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2016-01-30T02:22:29Z","Content":"\n\u003Cp\u003E\nScary thought, I know. But I\u0027ve accepted it. Even so, people are important on a smaller scale, and you should be kind and pursue your dreams, if only to do it.\n\u003C/p\u003E\n\u003Cp\u003E\nPerhaps life only exists to make sure it exists......?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nHere\u0027s something scarier:\n\u003C/p\u003E\n\u003Cp\u003E\nThink of all of the events that HAD to happen to make sure you exist in the way you do. The events of your life. The events of your parents\u0027 lives, their parents\u0027 lives, all the way back to the first lifeform on Earth. If it didn\u0027t exist, we might not even exist. What if our sun didn\u0027t even form? What if earth didn\u0027t form? What if the Galaxy didn\u0027t exist? Well, it wouldn\u0027t matter. The rest of the universe is almost entirely unaffected. Except Andromeda, I suppose. And the closest galaxies.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-01-30T02:25:46Z\u0022 title=\u002201/30/2016 02:25  AM\u0022 data-short=\u00228 yr\u0022\u003EJanuary 30, 2016\u003C/time\u003E by Bill Phil\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2016-01-30T02:27:45Z","Content":"\n\u003Cp\u003E\nAw man, I like getting philosophical....\n\u003C/p\u003E\n"},{"CreatedByName":"HebaruSan","CreatedById":156657,"CreatedDateTime":"2016-01-30T02:33:05Z","Content":"\n\u003Cp\u003E\nI relate to this. We\u0027re shockingly tiny, and it\u0027s crazy how many other \u003Cem\u003Egalaxies\u003C/em\u003E are out there, let alone stars and planets. Even if our civilization was interstellar already, we would still have no hope of visiting any substantial percentage of what we can see.\n\u003C/p\u003E\n\u003Cp\u003E\nBut then again, what are we comparing \u0022it\u0022 to? Every generation of humans has had the exact same relation to the universe that we do, they just didn\u0027t know it. And as far as we can tell from observing the skies, there aren\u0027t any pan-galactic civilizations out there that have transcended these limits.\n\u003C/p\u003E\n\u003Cp\u003E\nTo grasp for a silver lining... the game isn\u0027t over. Not by a long shot. We might have descendants for centuries, millennia, or longer, and the grand scope of the universe means that they can never possibly get bored or run out of exploring to do. Even if it takes our species, say, another twenty thousand years to gear up for exploring other star systems, they\u0027ll still be there, and the universe will barely have blinked in the meantime. Most of the stars won\u0027t even have evolved appreciably.\n\u003C/p\u003E\n\u003Cp\u003E\ntl;dr - I think it would be way more depressing if the universe was tiny and we had already explored all of it.\n\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2016-01-30T03:26:49Z","Content":"\n\u003Cp\u003E\nClosed by OP\u0027s request. \n\u003C/p\u003E\n"}]}