{"TopicId":13104,"ForumId":18,"TopicTitle":"Random cravings?","CreatedByName":"ping111","CreatedById":8679,"CreatedDateTime":"2012-06-23T02:51:04Z","PageNum":1,"Articles":[{"CreatedByName":"ping111","CreatedById":8679,"CreatedDateTime":"2012-06-23T02:51:04Z","Content":"\n\u003Cp\u003EHey there. Have you guys ever had a random craving for something (mainly food)? I just had one today for eggs. I normally hate eggs, but I just had one.\u003C/p\u003E\u003Cp\u003EAnd it was \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003E\u003Cstrong\u003EDELICIOUS.\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EYou?\u003C/p\u003E\n"},{"CreatedByName":"Randox","CreatedById":18034,"CreatedDateTime":"2012-06-23T04:06:21Z","Content":"\n\u003Cp\u003EI don\\\u0027t normally get so much as cravings, as the exact opposite (aversions), but I think its working the same way. Mostly I notice it between meat and vegetables. There are days where all I want is a huge salad, and other days where I have less than no desire to eat anything meat (and cheese, I always like cheese). Once you discount foods that contain addictive substances, and foods containing components that would naturally be quite rare in the wild (resulting in us being programmed to get as much of these things as possible regardless of how available they have become, which is a problem with certain fats), your taste and desire for foods should be changing based on what your body needs at any given time. If you start to run low on something, you should develop some sort of desire for foods that contain that substance and/or an aversion to foods that don\\\u0027t. Your taste perception also changes. The easiest way to experience this is with sodium levels (electrolytes). For the very brave, salt water (not very much salt, just a tad), and for everyone else Gatorade will do, should taste pretty bad if you\\\u0027ve been lounging around all day. If you go out and run a couple km, it will probably start tasting pretty good by the time your done, because now your body needs some salt. So it just retools your perception of taste to make whatever you need more appealing.\u003C/p\u003E\n"},{"CreatedByName":"Lord Wasteland","CreatedById":14093,"CreatedDateTime":"2012-06-23T04:12:15Z","Content":"\n\u003Cp\u003EI have had very weird cravings. One is chips and chocolate. Or chocolate covered chips...\u003C/p\u003E\n"},{"CreatedByName":"popeter123","CreatedById":18410,"CreatedDateTime":"2012-06-23T15:25:32Z","Content":"\n\u003Cp\u003E random craveings is a sign of being \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Epregnant\u003C/span\u003E hungry\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2012-06-23T15:26:41Z","Content":"\n\u003Cp\u003EOne night i woke up and really \u003Cstrong\u003EREALLY\u003C/strong\u003E wanted some kind of meat.\u003C/p\u003E\n"},{"CreatedByName":"robsr3v3ng3","CreatedById":18051,"CreatedDateTime":"2012-06-23T15:29:00Z","Content":"\n\u003Cp\u003Eahh I\\\u0027ve got a craving for rock cakes atm. My mum made some and you don\\\u0027t really want one, but once you have eaten one..... the rest must be eaten!\u003C/p\u003E\n"}]}