{"TopicId":131166,"ForumId":18,"TopicTitle":"Any homeworld fans here?","CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2016-02-01T13:24:35Z","PageNum":1,"Articles":[{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2016-02-01T13:24:35Z","Content":"\n\u003Cp\u003E\nAny homeworld fans here?\n\u003C/p\u003E\n\u003Cp\u003E\nI noticed a new homeworld game was coming out, and it got me thinking about my fond memories of homeworld, even just reading the manual.\n\u003C/p\u003E\n\u003Cp\u003E\nThe manual was actually pretty good sci-fi, and kept the handwaving to a minimum, with a *lot* of backstory (that was almost completely irrelevant, but fun).\n\u003C/p\u003E\n\u003Cp\u003E\nI never played homeworld: cataclysm.\n\u003C/p\u003E\n\u003Cp\u003E\nHomeworld 2: was pretty good. I like that they dropped the whole Taiidan/Kushan thing (as I played through the original game having the taiidan as the exiles/kharakians/hiigarans, and a lot of the background fluff actually supports that, but the cannon gods decided to take a side, and even re-wrote some of the background fluff about the ship names), but indirectly established Kushan as cannon through the mothership design.\n\u003C/p\u003E\n\u003Cp\u003E\nI wasn\u0027t wild about the ret-con of the hyperspace core they found in the Khar toba as being some special \u0022uber core\u0022 that was directly used in the mothership (as opposed to a reverse engineered and scaled up version as stated in the original). Or of Sajuuk not being the empire that had exiled them (as strongly implied but never explicitely stated), and instead being some progenitor warship... but overall it was fun\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThis latest homeworld game also does a bit of retconning, in the form of a prequel. Compared to HW2, or cataclysm\u0027s storyline, its pretty minor though.\n\u003C/p\u003E\n\u003Cp\u003E\nThe thing is... *there are no spaceships in the game*\n\u003C/p\u003E\n\u003Cp\u003E\nIts not a prequel about the great war before the exile, or leading the exile fleet to Kharak. Its about a war on the surface of Kharak. Its not about the Heresy wars/ Kiith Nabaal intervention mentioned in the backstory - which could make for a pretty good Age of Empires like campaign, playing as Kiith Nabaal, with a little bit of retconning to have them advance technologically as the campaign progresses, rather than WTFpwning the other Kiiths with repeating rifles, steel plating, and steam driven cannons... defeating armies 20 times their size, and having a huge proportion of the population side with them after they came out of hiding to put an end to the heresy wars that had gotten so bad that it was destroying the already marginal ecosystem (the Nabaal were the \u0022good guys\u0022, always with very generous surrender terms, and the only goal was ending the centuries long war... after the end, they again withdrew, rather than maintain a hegemony)\n\u003C/p\u003E\n\u003Cp\u003E\nNope... its about the expedition to the Khar Toba. What the original story described as a farily straightforward archaeological expedition to something a satellite detected in the middle of the desert has been turned into\n\u003C/p\u003E\n\u003Cp\u003E\n*spoilers follow*\n\u003C/p\u003E\n\u003Cp\u003E\na military expedition that turns into full scale warfare, and a race to reach the khar toba for the Diiamid, and before Kiith Galasien (and another kiith that betrays you, believing that they alone are worthy to have its secrets). Yea... Kiith Galasien which in the original backstory refused to accept the technological progress and unity brought by the Nabaal, who lost almost all their strength, and basically became small scale raiders and sabateurs... now command massive war machines with advanced technology scavenged from *other wrecked spaceships* (I don\u0027t have such a problem with this, as the exile fleet did have multiple ships, a cutscene in the original game did show more than one ship going down there, and the backstory did mention lots of other debris in orbit... its plausible to say that the khar toba was the only one to make it down more or less intact with its systems [at least the fusion reactor] still functioning).\n\u003C/p\u003E\n\u003Cp\u003E\nAlso... something about an imperial weapons satelitte and an imperial carrier in orbit around the planet when all this went down. Which would mean that the empire was aware of them finding the khar toba, recovering the hyperspace core (fine with me if we forget that HW2 re-write about the core being some super special irreproducible progenitor core, which would have made the empire go nuts trying to get it if they knew where it was), and the \u0026gt;100 years it took them to study the technology in the khar toba, build orbital infrastructure, mine stuff all around the system, test small hyperdrives, and build the mothership. Which would mean they sat around doing nothing just waiting for an excuse to wipe them out... when a simple message would already resonate with the various kiiths whose religions were ultimately based around the prohibition against developing hyperdrive technology.\n\u003C/p\u003E\n\u003Cp\u003E\nAs opposed to the original storyline which its implied that the empire more or less forgot about them, and then were surprised by the massive hyperspace signature from the mothership\u0027s test jump, at which point they over reacted and basically nuked the planet, which triggered an internal rebellion over their brutality, of course made the mothership incredibly hostile to them, and ultimately triggered the intervention of the poorly described galactic council (as the empire wasn\u0027t the only player on the galactic scene, even if it did seem to be the most powerful)\n\u003C/p\u003E\n"},{"CreatedByName":"T-Bouw","CreatedById":21500,"CreatedDateTime":"2016-07-05T17:51:25Z","Content":"\n\u003Cp\u003E\nA bit of a necro but still a relevant one in my oppinion.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd to answer: Yes! I became a fan yesterday when I played the original Homeworld for real this time.\u003Cbr\u003E\nI don\u0027t know why it never gripped me when I bought it when it came out but, since yesterday, I became a fan overnight.\u003Cbr\u003E\nPerhaps because I\u0027ve developed a lot more patience now that I\u0027m older.\n\u003C/p\u003E\n\u003Cp\u003E\nI haven\u0027t rage-quit yet and have gotten further than last time. So that\u0027s good.\u003Cbr\u003E\nIt also helped that installing and running the game (original CD no less!) on a Windows several versions newer since development went without a hic-up.\u003Cbr\u003E\nThat surprised me really. Most other old games don\u0027t want to run in some way or another. To me it shows how well it was put together back then.\n\u003C/p\u003E\n\u003Cp\u003E\nGood game!\n\u003C/p\u003E\n"},{"CreatedByName":"CAKE99","CreatedById":150099,"CreatedDateTime":"2016-07-06T00:26:32Z","Content":"\n\u003Cp\u003E\nI preordered the Homeworld Remastered Collection on Steam, but I never really played it due to various issues, such as,\n\u003C/p\u003E\n\u003Cp\u003E\nInsufficient hardware,\n\u003C/p\u003E\n\u003Cp\u003E\nBeing busy with other games,\n\u003C/p\u003E\n\u003Cp\u003E\nBeing too lazy to learn how to play \u003Cimg alt=\u0022:sticktongue:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 title=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"p1t1o","CreatedById":74091,"CreatedDateTime":"2016-07-06T10:30:21Z","Content":"\n\u003Cp\u003E\nI played Homeworld I and II when they came out, I\u0027ve just got the prequel \u0022Deserts of Kharak\u0022. Its a different take in that it is a ground-based RTS, but it does a really good job of recreating the atmosphere of the previous titles, and the gameplay is pretty much reminiscent. A pretty good good addition to the series IMO. If you like the first Homeworlds, you\u0027ll like this new one, and its very pretty!\n\u003C/p\u003E\n\u003Cp\u003E\nPretty tempted to pick up the remastered versions and replay them \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2016-07-06T10:51:03Z","Content":"\n\u003Cp\u003E\nThe remastered edition is pretty good. Not too much has been changed, just the relevant visuals have been brought up to modern standards\n\u003C/p\u003E\n"},{"CreatedByName":"Randazzo","CreatedById":136468,"CreatedDateTime":"2016-07-06T20:03:50Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222663339\u0022 data-ipsquote-contentid=\u0022131166\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221467802263\u0022 data-ipsquote-userid=\u002259088\u0022 data-ipsquote-username=\u0022Camacha\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 hours ago, Camacha said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe remastered edition is pretty good. Not too much has been changed, just the relevant visuals have been brought up to modern standards\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI was excited to hear about the remaster. Homeworld was amazing to me when it first came out, although I wasn\u0027t very good at it then.\n\u003C/p\u003E\n\u003Cp\u003E\nI am a little bummed Cataclysm wasn\u0027t able to be included though. That was definitely my favorite.\n\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2016-07-06T22:34:24Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222663965\u0022 data-ipsquote-contentid=\u0022131166\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221467835430\u0022 data-ipsquote-userid=\u0022136468\u0022 data-ipsquote-username=\u0022Randazzo\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Randazzo said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI am a little bummed Cataclysm wasn\u0027t able to be included though. That was definitely my favorite.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThey very much wanted to include it, but the source code has been lost to the rapids of time. They did not want to make a copy that felt off, so they opted to leave it. I respect that decision.\n\u003C/p\u003E\n"}]}