{"TopicId":131205,"ForumId":69,"TopicTitle":"Ship file recovery! (From launchpad)","CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2016-02-01T23:54:53Z","PageNum":1,"Articles":[{"CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2016-02-01T23:54:53Z","Content":"\n\u003Cp\u003E\nI need help badly to get a file back. The game messed up and screwed up my entire save. I have one ship I need back. And only one. I Moved the save files ship folder and it didn\u0027t transfer correctly into my backup file to save the latest version ofmy ship. I then(before realizing this) saved the backed up save back to my main folder. This left me with all of my updated saves back to the previous state and reverted back to the past 1.0.5 backup for that save. I put the game save back and now have the game back but the ship .craft file is permanently gone under all version but the correct version of the ship is sitting on the Launchpad from the quicksave but I can\u0027t use return to VAB to save the file and recover it. Is there a backend way to get a ship file back that is sitting on the launchpad. It must be referencing something to get the correct ship. So the game must have it save. How can I do this?! And how is it capable of being on the launchpad as it should be without a .craft file in the VAB folder It came from originally?!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnd please someone tell me why on gods earth this game does not let you go back to the VAB from the launchpad after restoring a quicksave?! It\u0027s absolutely idiotic. Where does it store the Information for the Vehicle on the pad. It has to have it because it is not in the ship folder anymore so it must be in the game files somewhere.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIt would take too much work to redo this ship from where the now old files left off. I\u0027ve been working on this ship for ages now. I really need some way to resave or copy the file on the launcpad back into the VAB folder. I can\u0027t find anything indicating how the Launchpad is still correctly loading this ship when the actual game .craft file is not there anymore in the saves VAB folder... I really need this ship back.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnd please for the love of god implement auto backup features in this game. I\u0027m so tired of having to manage backup stuff in this game manually. There are far too many bugs in this game to put up with and I can\u0027t stand having to do all of this anymore. It\u0027s way to easy to auto save over something or screw up a backup system you have to manually copy paste contantly. It\u0027s completely ridiculous. This is the reason computers exist. And this game isn\u0027t complicated. Making files auto save backup files in a folder should be easy for the game developers to do and implement well.\n\u003C/p\u003E\n\u003Cp\u003E\nIs anything else needed to get a save with the ship loaded on the runway like it is in my game?!\n\u003C/p\u003E\n\u003Cp\u003E\nQuicksave file mentioned: \u003Ca href=\u0022https://www.dropbox.com/s/836gzvic4ilod3b/quicksave.sfs?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/836gzvic4ilod3b/quicksave.sfs?dl=0\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEdit: BTW the save crash happened when the front of the ship exploded on Ike or something. I\u0027m not sure what happened. It just blew up while trying to begin to land. I have fixed the save outside of the lost/outdated .craft files.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-02-02T00:36:48Z\u0022 title=\u002202/02/2016 12:36  AM\u0022 data-short=\u00228 yr\u0022\u003EFebruary 2, 2016\u003C/time\u003E by Arugela\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2016-02-02T00:37:03Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/133381-arugela/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022133381\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/133381-arugela/\u0022 id=\u0022ips_uid_4\u0022\u003E@Arugela\u003C/a\u003E, make a copy of this save just in case, \u003Cs\u003E\u003Ca href=\u0022https://github.com/ClawKSP/InflightShipSave/releases\u0022 rel=\u0022external nofollow\u0022\u003Ethen use this tool\u003C/a\u003E.\u003C/s\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cs\u003EYou will need to go to the vessel so you are in control of it, then press F6, this will make a craft file of the ship in flight.\u003C/s\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nTried testing that tool here and it\u0027s not working in 1.0.5, so I suggest you upload the save in case anyone is able to extract the ship manually.\n\u003C/p\u003E\n"},{"CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2016-02-02T00:59:41Z","Content":"\n\u003Cp\u003E\nIt may have worked. I\u0027m testing the ship to see if there are any issues. But the save has reverted back to the correct amount of parts and what it should have had before I started. Unless it falls apart it may be back. Something seems to have fixed it..\n\u003C/p\u003E\n\u003Cp\u003E\nHere is the presumably recovered ship:(It didn\u0027t append the _rescue, but the ship is back to normal somehow since using the tool)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.dropbox.com/s/ibj9w4ud22l0kmi/The%20Orion%20Retriever%20x8%20Plus%20V3%201_0_5.craft?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/ibj9w4ud22l0kmi/The Orion Retriever x8 Plus V3 1_0_5.craft?dl=0\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nEdit: So far so good. It seems to be back to normal.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-02-02T01:25:01Z\u0022 title=\u002202/02/2016 01:25  AM\u0022 data-short=\u00228 yr\u0022\u003EFebruary 2, 2016\u003C/time\u003E by Arugela\u003C/strong\u003E\n\u003C/span\u003E\n"}]}