{"TopicId":131219,"ForumId":55,"TopicTitle":"Better UI for deleting craft","CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-02-02T01:47:13Z","PageNum":1,"Articles":[{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-02-02T01:47:13Z","Content":"\n\u003Cp\u003E\nCurrently, the only way to delete a ship in KSP is via the red button in the tracking station.  It works, but it has some rough edges.  There are three things in particular that I think would be helpful to add:\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E1. Show the vessel name in the confirmation dialog.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nWhen you\u0027re in the tracking station and you click the delete button, it pops up a warning dialog to the effect that \u0022the ship will be destroyed, are you sure?\u0022  My ask is, \u003Cstrong\u003Eprominently show the vessel name there.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nRationale:  What if the player accidentally selected the wrong ship and didn\u0027t notice it?  Making sure the player has an immediate visual indication of just \u003Cem\u003E\u003Cu\u003Ewhich ship will be deleted\u003C/u\u003E\u003C/em\u003E would be a nice safeguard.  Every time I click this red button, I always get an unpleasant nervous feeling and have to force myself to double- and triple-check.  A simple name display would really help with this.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E2. Show a different warning for crewed versus uncrewed ships.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe warning that it shows just says, this will be deleted and any crew on board will be killed.  Well, are there any crew?  If I delete this ship, am I killing anyone?  Another source of stress and uncertainty, and again, every time I delete any ship I have to force myself to go back and double-check the crew content before deleting.  It would be much more friendly to have two different warnings.\n\u003C/p\u003E\n\u003Cp\u003E\nUncrewed ships will say something like:  \u003Cem\u003EUnmanned vessel \u0022SnarkProbe II\u0022 will be deleted. Confirm?\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nCrewed ships would say something like:  \u003Cem\u003EWARNING!  Vessel \u0022Snarxplorer\u0022 has 3 kerbals aboard.  Deleting will KILL these kerbals.  Are you really sure?\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n...or words to that general effect.  As long as the wording is different, and the visual appearance of the dialog is significantly different enough that when you\u0027re expecting the uncrewed version to pop up, and the crewed version pops up instead, it makes you notice and go \u0022whoa\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E3.  Have some way in the flight UI to delete the current vessel.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nRight now, the only way to delete a vessel is from the tracking station.  This has a couple of issues.\n\u003C/p\u003E\n\u003Cp\u003E\nFirst issue: when I have a whole lot of active ships, I may not be able to remember for sure which one is the right one to delete-- just seeing it in the map view in the tracking station may not be enough.  I want to go to the ship and see for myself, first.  So right now what I have to do is: 1. go to the tracking station, 2. rummage around through the ship list to find the one that I \u003Cem\u003E\u003Cu\u003Ethink\u003C/u\u003E\u003C/em\u003E is the right one, 3. switch to it to confirm visually, 4. make a careful note of the name (maybe even write it down, if there are a lot of similarly named ships), 5. switch back to the tracking station again, 6. find the ship in the list again, 7. press the delete button, 8. fight a horrible sinking sense of dread that maybe I\u0027ve got the wrong ship, 9. confirm.  If I could just go to the ship, \u003Cem\u003E\u003Cu\u003Esee\u003C/u\u003E\u003C/em\u003E it, and then decided on the spot \u0022delete this ship\u0022 (which would take me back to KSC), that would really be helpful.\n\u003C/p\u003E\n\u003Cp\u003E\nSecond issue:  There are situations in KSC where the game won\u0027t let the player switch to another ship or return to KSC, i.e. when flying in atmosphere.  This can lead to a situation where the player is \u0022trapped\u0022 on the current ship and can\u0027t do anything at all to escape for several minutes.  For example, suppose I drop an expendable probe into Jool\u0027s atmosphere.  It takes its science measurements, transmits them, then I\u0027m done with it.  As far as I\u0027m concerned, I can destroy it and go on with life.  Except that the game has no way to destroy it from the in-flight UI, and it won\u0027t let me return to KSC or switch to another ship because I\u0027m in atmosphere.  All I can do is just stare helplessly at the ship for the next many minutes, waiting for it to fall all the way through Jool\u0027s atmosphere until it gets to the \u0022surface\u0022 and is destroyed.  That takes a long time, and there\u0027s absolutely nothing I can do.  It\u0027s just infuriating.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway, this ask is to have \u003Cem\u003E\u003Cu\u003Esome\u003C/u\u003E\u003C/em\u003E way to avoid the above two issues.  Obviously it\u0027s not something that should take up a lot of screen UI or be at all possible to activate by accident, or add to the clutter of the screen, so some careful thought would need to go into just how it\u0027s designed.  But surely there must be \u003Cem\u003E\u003Cu\u003Esome\u003C/u\u003E\u003C/em\u003E way to work it in.  A \u0022destroy\u0022 button next to the \u0022abort\u0022 button from the top center pull-down, perhaps?  (With confirmation dialog, of course.)  I don\u0027t really care what the UI looks like, as long as there is one.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027d also be fine with not adding an in-flight delete button if some other workaround could be found for the above two issues.  For example, if the \u0022return to KSC\u0022 button \u003Cem\u003E\u003Cu\u003Ealways works\u003C/u\u003E\u003C/em\u003E.  If you try to do it while in atmosphere, it could pop up a big ugly warning \u0022going back to KSC right now will kill this ship\u0022 and then allow you to confirm.  Or something.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-02-02T01:49:37Z\u0022 title=\u002202/02/2016 01:49  AM\u0022 data-short=\u00228 yr\u0022\u003EFebruary 2, 2016\u003C/time\u003E by Snark\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"AbacusWizard","CreatedById":116476,"CreatedDateTime":"2016-02-02T06:17:10Z","Content":"\n\u003Cp\u003E\nRelated: it would also be nice if the Tracking Station could show a thumbnail image of each craft in the list in much the same way that the Load menu does in the VAB/SPH interface.\n\u003C/p\u003E\n"},{"CreatedByName":"pandaman","CreatedById":130621,"CreatedDateTime":"2016-02-02T07:00:23Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/125662-snark/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022125662\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/125662-snark/\u0022\u003E@Snark\u003C/a\u003E \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/116476-abacuswizard/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022116476\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/116476-abacuswizard/\u0022\u003E@AbacusWizard\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nBoth you guys have suggested stuff here that I thought was missing for ages, but for some reason didn\u0027t get round to suggesting (I\u0027ve no idea why).\n\u003C/p\u003E\n\u003Cp\u003E\nHave a cookie, each (it\u0027s not fair to make you share one).\n\u003C/p\u003E\n"},{"CreatedByName":"Hannu2","CreatedById":154334,"CreatedDateTime":"2016-02-02T07:57:04Z","Content":"\n\u003Cp\u003E\nGood idea. There should also be an easy option to mark craft as a debris. It should be possible also by right click without power or command pod at all.\n\u003C/p\u003E\n"},{"CreatedByName":"marcello639","CreatedById":144435,"CreatedDateTime":"2016-02-02T15:21:21Z","Content":"\n\u003Cp\u003E\nAlso after click with mouse on craft in tracking station it should be deleted by pressing on keyboard DEL and ENTER. Clicking all this with mouse are so frustrating when deleting 50 debris. \n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-02-02T15:22:32Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222390111\u0022 data-ipsquote-contentid=\u0022131219\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221454399824\u0022 data-ipsquote-userid=\u0022154334\u0022 data-ipsquote-username=\u0022Hannu2\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, Hannu2 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nGood idea. There should also be an easy option to mark craft as a debris. It should be possible also by right click without power or command pod at all.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt\u0027s already possible to mark as debris for any craft with a command pod, even if they\u0027re out of power.  Just right-click and choose \u0022Rename\u0022.  I do this all the time.\n\u003C/p\u003E\n\u003Cp\u003E\nYes, it\u0027s a bit problematic for things that don\u0027t have a command pod on them, but in my experience that doesn\u0027t come up much and in those cases I\u0027m fine with just destroying the object.  It\u0027s enough of an edge case (with a reasonable workaround) that I\u0027m not sure it\u0027d be worth the return on investment to add a \u0022mark thing without command pod as debris\u0022 feature.\n\u003C/p\u003E\n"},{"CreatedByName":"Hannu2","CreatedById":154334,"CreatedDateTime":"2016-02-03T05:49:21Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222390487\u0022 data-ipsquote-contentid=\u0022131219\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221454426552\u0022 data-ipsquote-userid=\u0022125662\u0022 data-ipsquote-username=\u0022Snark\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n14 hours ago, Snark said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt\u0027s already possible to mark as debris for any craft with a command pod, even if they\u0027re out of power.  Just right-click and choose \u0022Rename\u0022.  I do this all the time.\n\u003C/p\u003E\n\u003Cp\u003E\nYes, it\u0027s a bit problematic for things that don\u0027t have a command pod on them, but in my experience that doesn\u0027t come up much and in those cases I\u0027m fine with just destroying the object.  It\u0027s enough of an edge case (with a reasonable workaround) that I\u0027m not sure it\u0027d be worth the return on investment to add a \u0022mark thing without command pod as debris\u0022 feature.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThanks for the information. They have changed it. I tried (many versions ago) but then renaming needed power.\n\u003C/p\u003E\n\u003Cp\u003E\nI agree that marking things as debris is not at very high position on the list of annoying things but it also does not take many lines of code to fix it. Of course it is no reasonable to do only it but if they do some kind of management functions overhaul it would be near free to implement.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Ruedii","CreatedById":57704,"CreatedDateTime":"2016-02-03T06:48:19Z","Content":"\n\u003Cp\u003E\nYes.\u003Cbr\u003E\u003Cbr\u003E\nI\u0027d also like to see a better recovery GUI.\u003Cbr\u003E\u003Cbr\u003E\nFor instance, it should prompt you if you want to recover nearby vessels, Kerbals and debris  (a nice check list).  This should indicate vessel type, whether the parts are manned, how many seats they have and if they have a probe core, so you can quickly identify the thing(s) you want to recover, and leave anything you want to keep out there (such as a base or a flag).\u003Cbr\u003E\u003Cbr\u003E\nThis would save a lot of time recovering debris of a vessel that suffered an unplanned disassembly during lithobreaking. \n\u003C/p\u003E\n"},{"CreatedByName":"StarManta","CreatedById":57805,"CreatedDateTime":"2016-02-04T20:08:24Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222390487\u0022 data-ipsquote-contentid=\u0022131219\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221454426552\u0022 data-ipsquote-userid=\u0022125662\u0022 data-ipsquote-username=\u0022Snark\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn February 2, 2016 at 10:22 AM, Snark said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYes, it\u0027s a bit problematic for things that don\u0027t have a command pod on them,\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWouldn\u0027t that already be marked as debris anyway?\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-02-04T22:19:30Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222393907\u0022 data-ipsquote-contentid=\u0022131219\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221454616504\u0022 data-ipsquote-userid=\u002257805\u0022 data-ipsquote-username=\u0022StarManta\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, StarManta said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWouldn\u0027t that already be marked as debris anyway?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\u003Cp\u003E\nMany such parts would be, yes.  The problem is that there are parts that are \u003Cem\u003E\u003Cu\u003Ecrewed\u003C/u\u003E\u003C/em\u003E, but aren\u0027t command pods.  Hitchhiker, science lab, Mk1 crew cabin, that sort of thing.\n\u003C/p\u003E\n\u003Cp\u003E\nKSP never automatically marks a piece as debris if it has a crewable part on it.  However, you can only \u003Cem\u003E\u003Cu\u003Erename\u003C/u\u003E\u003C/em\u003E if there\u0027s a command pod.  So for the few crewable-but-not-command parts, there\u0027s a hole there-- can\u0027t really do anything except destroy them from the tracking station.\n\u003C/p\u003E\n"},{"CreatedByName":"AbacusWizard","CreatedById":116476,"CreatedDateTime":"2016-02-05T07:24:55Z","Content":"\n\u003Cp\u003E\nYou can rename them from the tracking station whether they have a command pod or not.\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-02-05T16:10:00Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222394656\u0022 data-ipsquote-contentid=\u0022131219\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221454657095\u0022 data-ipsquote-userid=\u0022116476\u0022 data-ipsquote-username=\u0022AbacusWizard\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, AbacusWizard said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYou can rename them from the tracking station whether they have a command pod or not.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThanks, good to know.! \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E  Had no idea that renaming was actually an option in the tracking station.\n\u003C/p\u003E\n\u003Cp\u003E\nBut then, if I\u0027m in the tracking station, I could just delete them instead of renaming-as-debris anyway.  Right now, a big part of the reason I rename-as-debris from the flight view is precisely because there\u0027s no way to delete them from there.\n\u003C/p\u003E\n"},{"CreatedByName":"AbacusWizard","CreatedById":116476,"CreatedDateTime":"2016-02-06T01:23:09Z","Content":"\n\u003Cp\u003E\nYeah, that\u0027s true. I decided a little while ago to stop using the delete button as a way to challenge myself to design \u0022tidier\u0022 launches that jettison all expendable stages before reaching orbit (or while on a temporary collision course with the destination). This also led to the development of the H-Wing, a two-seat craft with a KAS harpoon gun for grabbing debris and towing it onto a suborbital trajectory, which has been an awful lot of fun to fly!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\u003Cimg class=\u0022ipsImage\u0022 src=\u0022https://lh3.googleusercontent.com/-xFGoxDr8MV0/VYjY0ArJRdI/AAAAAAAABfA/jwUWMp3x878/s640-Ic42/screenshot200.png\u0022 alt=\u0022screenshot200.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Ruedii","CreatedById":57704,"CreatedDateTime":"2016-02-21T05:47:15Z","Content":"\n\u003Cp\u003E\nI think the idea here is to make a universal controller to mark large clumps of items debris or delete.\u003Cbr\u003E\nA quick \u0022mark as debris\u0022 button would be VERY useful in the the Space Center, and a prompt regarding nearby objects would be useful as well. \u003Cbr\u003E\u003Cbr\u003E\nI don\u0027t know how many times it takes me far to long to clear a debris field of parts marked as probes or pods, and I don\u0027t know how many times it takes me too long to recover similar debris fields left littering the surface of Kerbin.\n\u003C/p\u003E\n"},{"CreatedByName":"Enceos","CreatedById":110725,"CreatedDateTime":"2016-05-31T16:55:23Z","Content":"\n\u003Cp\u003E\nSince Squad is currently searching the discussion threads for promising ideas, this one definitely needs an upvote.\n\u003C/p\u003E\n"},{"CreatedByName":"cfds","CreatedById":82109,"CreatedDateTime":"2016-06-02T07:43:15Z","Content":"\n\u003Cp\u003E\nSlightly related: Does the feature of recovering/deleting the vessel that sits in the list under the button due to through-click still work?\n\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2016-06-03T08:21:56Z","Content":"\n\u003Cp\u003E\nOne issue with deleting stuff is that decopled stuff like an fuel tank or fairing base on top of an docking port tend to be named ship, not junk and its no way to change it. Getting part count and crew members in the tracking station would be an huge help here. \n\u003C/p\u003E\n"},{"CreatedByName":"AbacusWizard","CreatedById":116476,"CreatedDateTime":"2016-06-04T07:38:21Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222614310\u0022 data-ipsquote-contentid=\u0022131219\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221464942116\u0022 data-ipsquote-userid=\u002257801\u0022 data-ipsquote-username=\u0022magnemoe\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n23 hours ago, magnemoe said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOne issue with deleting stuff is that decopled stuff like an fuel tank or fairing base on top of an docking port tend to be named ship, not junk and its no way to change it.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou can actually do that in the Tracking Station; select the ship (or decoupled stage or whatever), click on the Info button, and click on the name of the ship. That will let you change its name and icon... or at least it did before 1.1.x accidentally broke that feature. Not sure if it\u0027s been fixed yet.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222614310\u0022 data-ipsquote-contentid=\u0022131219\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221464942116\u0022 data-ipsquote-userid=\u002257801\u0022 data-ipsquote-username=\u0022magnemoe\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n23 hours ago, magnemoe said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nGetting part count and crew members in the tracking station would be an huge help here. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAgain, select the ship and click on the Info button.\n\u003C/p\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2016-06-04T08:38:18Z","Content":"\n\u003Cp\u003E\nCount me as a supporter of this.\n\u003C/p\u003E\n"},{"CreatedByName":"pandaman","CreatedById":130621,"CreatedDateTime":"2016-06-04T16:21:47Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222615802\u0022 data-ipsquote-contentid=\u0022131219\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221465025901\u0022 data-ipsquote-userid=\u0022116476\u0022 data-ipsquote-username=\u0022AbacusWizard\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, AbacusWizard said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYou can actually do that in the Tracking Station; select the ship (or decoupled stage or whatever), click on the Info button, and click on the name of the ship. That will let you change its name and icon... or at least it did before 1.1.x accidentally broke that feature. Not sure if it\u0027s been fixed yet.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAgain, select the ship and click on the Info button.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNo, not fixed yet unfortunately.  Not a game breaker by a long way, but a bit inconvenient.\n\u003C/p\u003E\n"},{"CreatedByName":"Aperture Science Employee","CreatedById":157190,"CreatedDateTime":"2016-06-07T18:01:21Z","Content":"\n\u003Cp\u003E\nI agree, the deleting craft UI needs to be gutted. I feel as if the spacecraft just enters the Kermuda Triangle when I press delete. That\u0027s what really happens. \u003Cimg alt=\u0022:o\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_ohmy.png\u0022 title=\u0022:o\u0022\u003E\u003C/p\u003E\n"}]}