{"TopicId":131366,"ForumId":32,"TopicTitle":"Nuclear rockets compromise, shielding instead of nerfing?","CreatedByName":"Buster Charlie","CreatedById":157768,"CreatedDateTime":"2016-02-04T15:26:40Z","PageNum":1,"Articles":[{"CreatedByName":"Buster Charlie","CreatedById":157768,"CreatedDateTime":"2016-02-04T15:26:40Z","Content":"\n\u003Cp\u003E\nI know ksp is not real life, and I know balances are made between fun game play and science fact. From reading commentary on the subject it appears the prevailing thought on why the LV-National needs to be made unrealistically weak is due to the lack of challenge or enfine diversity due to the obsolescence  of  chemical rocketry.\n\u003C/p\u003E\n\u003Cp\u003E\nI would argue that the same could be said of jet turbines  vs piston driven propeller  craft. There are piston  driven propeller craft today, but they are  dwarfed by the number of jet turbine driven aircraft, weather turbojet, turboprop,  or ducted fan models.\n\u003C/p\u003E\n\u003Cp\u003E\nSo if you are really feeling the need to have a reason to use a piston engine turning afree \u0022unlocking\u0022 jets,  then just reducing the thrust of the jets would work, but it wouldn\u0027t be satisfactory.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSo instead of making nuclear rocket engines weaker, give them downsides that make them NOT the only solution to every problem.\n\u003C/p\u003E\n\u003Cp\u003E\nIn real life, craft with this type of engine would have a \u0022shadow sheild\u0022 to protect he crew from radiation, as it would be too heavy to sheild the entire craft. Trying to simulate complex radiation emissions and shielding is obviously beyond themail scope of the game,  and it doesn\u0027t  address existing space radiation or shielding for long term deep space missions. \n\u003C/p\u003E\n\u003Cp\u003E\nMaybe a useful compromise would be to incorporate  a heat shield like solution. Treat  radiation like reentry heating to a degree, and require that the ships be built in a way that the non hardened  portions of the ship lay in the \u0022shadow\u0022 of your radiation sheild. Parts or kerbals extending beyond this shadow during engine ignition would suffer heat damage and go poof.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nYou would need a simple way to show this during ship design, maybe something as simple as a shadow map style overlay view or a stage recovery  style colored overlay. \n\u003C/p\u003E\n\u003Cp\u003E\nSo in summary,  by fudging radioactive  emissions of the engine as a balance against their superior thrust and isp would allow more interesting design decisions, not less.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nFor example: if the engine blows up the launch pad you still need chemical rockets for a 1st stage booster. Maybe a special atomic rocket launchpad could be an end game goal. \n\u003C/p\u003E\n\u003Cp\u003E\nIf you are going to make an atomic rocket tug, you\u0027d have to make sure the cargo won\u0027t be damaged, and more to the point you  may need chemical rockers for maneuvering close to a space station or any other craft when rendezvous and docking.\n\u003C/p\u003E\n\u003Cp\u003E\nFinall like a heat shield,  it adds extra weight, so the better protected your craft, the heavier it\u0027s dry weight, so even if the LV-N had better thrust and better is than any chemical rocket, you wouldn\u0027t use it all the time because it may just make more sense to build a simpler and lighter craft  than deal with the reaction control needs of a larger heavier craft.\n\u003C/p\u003E\n\u003Cp\u003E\n Right now for my personal use I un-nerfed  the lv-n because it\u0027s a single player game and I can do what I want. However I\u0027d rather see an official fix that keeps their real life awseoeness without making them a boring cure all to every problem.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Armisael","CreatedById":152425,"CreatedDateTime":"2016-02-04T18:29:52Z","Content":"\n\u003Cp\u003E\nBoth approaches are inventing nonsense that doesn\u0027t really apply to the engine - real NTRs have their shielding inside the engine already. The current model at least has the advantage of simplicity since it doesn\u0027t require any new systems.\n\u003C/p\u003E\n\u003Cp\u003E\nYou are, of course, free to mod this in yourself.\n\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2016-02-04T18:41:55Z","Content":"\n\u003Cp\u003E\nAdding extra required mass is pretty much the same as increasing the mass of the engine; you\u0027re still nerfing it.  The LV-N doesn\u0027t need any further nerfing, even in the form of shielding, it\u0027s fine as-is.\n\u003C/p\u003E\n"},{"CreatedByName":"Buster Charlie","CreatedById":157768,"CreatedDateTime":"2016-02-04T19:10:13Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222393809\u0022 data-ipsquote-contentid=\u0022131366\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221454611315\u0022 data-ipsquote-userid=\u002270807\u0022 data-ipsquote-username=\u0022regex\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n24 minutes ago, regex said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAdding extra required mass is pretty much the same as increasing the mass of the engine; you\u0027re still nerfing it.  The LV-N doesn\u0027t need any further nerfing, even in the form of shielding, it\u0027s fine as-is.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI had considered  this but my thought was all this in addition to increasing the thrust (and maybe isp) of the engine to begin with.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nHere is why it\u0027s different,  I had the thought that you could shield multiple engines under one sheild, which I realize may be unrealistic, would encourage larger ships because the same weight heat shield could be used on multiple engines as it could on one.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI also realize after further research this has been suggested ,otherwise I wouldn\u0027t have started this thread. But I really don\u0027t like artificially making atomic rockets less awesome than they should be just to prop up chemical combustion rockets.\n\u003C/p\u003E\n"},{"CreatedByName":"nosirrbro","CreatedById":69814,"CreatedDateTime":"2016-02-04T19:24:46Z","Content":"\n\u003Cp\u003E\nMaybe instead of a complex shielding system parts near the engine have the option to be \u0027armored\u0027 which increases the weight and makes them be unaffected, and at a certain distance admiring isn\u0027t required as it won\u0027t cause them to explode.\n\u003C/p\u003E\n"},{"CreatedByName":"Buster Charlie","CreatedById":157768,"CreatedDateTime":"2016-02-04T19:26:41Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222393854\u0022 data-ipsquote-contentid=\u0022131366\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221454613886\u0022 data-ipsquote-userid=\u002269814\u0022 data-ipsquote-username=\u0022nosirrbro\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 minutes ago, nosirrbro said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMaybe instead of a complex shielding system parts near the engine have the option to be \u0027armored\u0027 which increases the weight and makes them be unaffected, and at a certain distance admiring isn\u0027t required as it won\u0027t cause them to explode.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nReally that wouldn\u0027t be a bad idea if it were incorporated into a larger scale mechanic of hardening crew compartments for long term flights or solar flares or sun flyby \n\u003C/p\u003E\n\u003Cp\u003E\nI guess really all I\u0027m suggesting is, if atomic rockers are not end game engines that make chemical engines obsolete, then give us a reason why, don\u0027t just make them weaker.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-02-04T19:29:28Z\u0022 title=\u002202/04/2016 07:29  PM\u0022 data-short=\u00228 yr\u0022\u003EFebruary 4, 2016\u003C/time\u003E by Buster Charlie\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Vermil","CreatedById":122726,"CreatedDateTime":"2016-02-04T21:48:49Z","Content":"\n\u003Cp\u003E\nI think the real nuclear rocket engines which were suggested back in the days, were much more awesome than KSP\u0027s version. I think there was one with a gaseous Plutonium chamber that would do really good thrust for a long time on extremely little propellant. So the question is if nerfing LVN is \u0022realistic\u0022? Seems more political to me.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Vermil","CreatedById":122726,"CreatedDateTime":"2016-02-04T21:56:40Z","Content":"\n\u003Cp\u003E\nI also think the notion that we need to somehow protect technology in KSP from becoming obsolete, that we need to have reasons to still use some parts, - all that is nonsense.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s not how a game like this should work. In both career mode and science sandbox, it\u0027s a natural evolution to progress towards better technology. We should accept that some parts become obsolete and are mainly used at earlier stages of gameplay. If KSP evolves in any other way, I\u0027m going to deeply and bitterly resent it. And that would be a dam pity, as much as I like KSP now. \n\u003C/p\u003E\n"},{"CreatedByName":"Buster Charlie","CreatedById":157768,"CreatedDateTime":"2016-02-04T22:10:14Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222394023\u0022 data-ipsquote-contentid=\u0022131366\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221454623000\u0022 data-ipsquote-userid=\u0022122726\u0022 data-ipsquote-username=\u0022Vermil\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 minutes ago, Vermil said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI also think the notion that we need to somehow protect technology in KSP from becoming obsolete, that we need to have reasons to still use some parts, - all that is nonsense.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s not how a game like this should work. In both career mode and science sandbox, it\u0027s a natural evolution to progress towards better technology. We should accept that some parts become obsolete and are mainly used at earlier stages of gameplay. If KSP evolves in any other way, I\u0027m going to deeply and bitterly resent it. And that would be a dam pity, as much as I like KSP now. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nPretty  much my passion on this subject and why I want a better solution than make nuclear rockets weaker.\n\u003C/p\u003E\n\u003Cp\u003E\nI not interested in fantasy warp drives or purely Sci fi stuff. But I am interested in cutting edge progression of real world space technology in career mode, and if people want to play sandbox then they can use some self restraint and not use nuclear engines if they feel they are cheating. \n\u003C/p\u003E\n\u003Cp\u003E\nIf we were serious about manned exploration of our own solar system you can bet We would have developed nuclear rocketry more than some 60s era prototypes. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nLet\u0027s face it, KSP solar system is small, and it has no life support. I think this is the real reason people are okay with artificially weak nuclear rockets. If you faced the real challenge of moving live crew over huge distances where time spent in space really mattered more than how much you had to time warp, then you\u0027d be cheering for something a bit more advanced.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIf people want to slap a nerv into a mum lander, that\u0027s their business.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}