{"TopicId":131324,"ForumId":32,"TopicTitle":"1.04 to 1.05 Did I lose something?","CreatedByName":"EivlEvo","CreatedById":158024,"CreatedDateTime":"2016-02-03T19:06:07Z","PageNum":1,"Articles":[{"CreatedByName":"EivlEvo","CreatedById":158024,"CreatedDateTime":"2016-02-03T19:06:07Z","Content":"\n\u003Cp\u003E\nGreetings crew. Longtime ghoster.\n\u003C/p\u003E\n\u003Cp\u003E\nIn 1.04 I finally made a concerted effort to colonize Duna. I have 2 separate ships landed there that had landings go less than ideal.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen I opened the save in 1.05, if I open my service bays, the ships explode. I reload the quicksave, and now I don\u0027t have an option for opening service bays, and I\u0027m unable to select any of my ladders. Is this just one of those things from moving to the updated version?\n\u003C/p\u003E\n\u003Cp\u003E\nIs there a way to salvage this mission? Can I get my crew back? I\u0027m heavily invested (financially) in this group of missions, and as such... this may actually break my career.\n\u003C/p\u003E\n\u003Cp\u003E\nSorry for such a noob question. OTOH at least I didn\u0027t post about SSTO\u0027s or where to land on Duna?\n\u003C/p\u003E\n"},{"CreatedByName":"Francois424","CreatedById":98138,"CreatedDateTime":"2016-02-03T21:03:53Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003EQ. if I open my service bays, the ships explode.\u003C/strong\u003E\u003Cbr\u003E\nR. I have that happen all the time if they clip thru the ground and sometimes into other parts.  Make sure your cargo bay has enough clearance. \n\u003C/p\u003E\n\u003Cp\u003E\nFor your other woes, no Idea.\n\u003C/p\u003E\n\u003Cp\u003E\n*Edit*  try pressing the switch vessel keys \u0022[\u0022 and \u0022]\u0022 , if your vessel had a disassembly from the cargo bay thing you can switch to the other parts and EVA your guys from there and mount a rescue.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-02-03T21:05:15Z\u0022 title=\u002202/03/2016 09:05  PM\u0022 data-short=\u00228 yr\u0022\u003EFebruary 3, 2016\u003C/time\u003E by Francois424\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"EivlEvo","CreatedById":158024,"CreatedDateTime":"2016-02-04T15:31:54Z","Content":"\n\u003Cp\u003E\nThanks Francois.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s just strange that it was working fine prior, and also that my ladders can\u0027t be selected.\n\u003C/p\u003E\n"}]}