{"TopicId":131335,"ForumId":20,"TopicTitle":"Suggestions for downloading Tech Trees","CreatedByName":"Likasombodee","CreatedById":119111,"CreatedDateTime":"2016-02-03T23:47:09Z","PageNum":1,"Articles":[{"CreatedByName":"Likasombodee","CreatedById":119111,"CreatedDateTime":"2016-02-03T23:47:09Z","Content":"\n\u003Cp\u003E\nHello,\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI am just wondering if you anyone can suggest a tech tree for a first time career mode? I also have a few questions regarding career mode/mods/updates.\n\u003C/p\u003E\n\u003Cp\u003E\nSo I have been playing Kerbal on and off since the beta days (3 years ago). I\u0027d say i\u0027ve got somewhat of an advanced skill in the game as I\u0027ve done a manned Munar mission, rovers on Duna, and built LKO space stations. So as someone who is about to start a career mode for the first time, I was wondering if anyone could suggest a tech tree specifications:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nStart unmanned, somewhat historical progression\n\u003C/li\u003E\n\u003Cli\u003E\nEventually provide the ability to build bases on specifically Mun and Duna\n\u003C/li\u003E\n\u003Cli\u003E\nNot to overwhelming if possible\n\u003C/li\u003E\n\u003Cli\u003E\nAccess to the Near Future mod mid game\n\u003C/li\u003E\n\u003Cli\u003E\nCool late game (Interstellar, Warp Drives, Anti-matter, Fusion, etc.)\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nI have been looking at CTT and Adios, but I honestly can\u0027t decide. \u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAs i\u0027ve never modded KSP, I am also wondering what the effects are of the game updating. Will I have to constantly update the mods I install within KSP, and will this cause bugs as the game itself also updates? How do people install a tonne of mods and keep the stability of the game?\n\u003C/p\u003E\n\u003Cp\u003E\nThank You,\n\u003C/p\u003E\n"},{"CreatedByName":"Velve666","CreatedById":157954,"CreatedDateTime":"2016-02-04T08:56:20Z","Content":"\n\u003Cp\u003E\nYou could look into the mod \u0022SETI\u0022, thats as much help as i can be I\u0027m afraid, as I have tried to build a game fitting the description you posted, yet i felt I had no idea what i was doing. SETI has so many additional balancing mods and I would prefer to keep the game relatively stock.\n\u003C/p\u003E\n\u003Cp\u003E\nSo I second your post as there may be someone who could give an easier explanation or alternative.\n\u003C/p\u003E\n"},{"CreatedByName":"Yemo","CreatedById":114412,"CreatedDateTime":"2016-02-05T16:13:18Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222393305\u0022 data-ipsquote-contentid=\u0022131335\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221454576180\u0022 data-ipsquote-userid=\u0022157954\u0022 data-ipsquote-username=\u0022Velve666\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 4.2.2016 at 9:56 AM, Velve666 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYou could look into the mod \u0022SETI\u0022, thats as much help as i can be I\u0027m afraid, as I have tried to build a game fitting the description you posted, yet i felt I had no idea what i was doing. SETI has so many additional balancing mods and I would prefer to keep the game relatively stock.\n\u003C/p\u003E\n\u003Cp\u003E\nSo I second your post as there may be someone who could give an easier explanation or alternative.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/119111-likasombodee/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022119111\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/119111-likasombodee/\u0022\u003E@Likasombodee\u003C/a\u003E The \u0022Unmanned before Manned\u0022 spin-off in the SETI thread was made for that reason. It just makes you start unmanned without the extensive changes that SETIctt does and is compatible with the stock and the community tech tree.\n\u003C/p\u003E\n\u003Cp\u003E\nSo if you just want to start unmanned, use CKAN (mod manager) and just install \u0022Unmanned Before Manned\u0022 as well as the recommended mod \u0022CustomBarnKit\u0022.\u003Cbr\u003E\nThen add the Community Tech Tree, as a basis for all the late game mods (near future, colonization and so on) and you are good to go.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you do not like the stock contracts, I recommend replacing them as well. You could use SETIcontracts or the small InitialContracts for general progression and then add the contract packs Anomaly Survey, Field Research, Tourism and GivingAircraftAPurpose.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you find the stockalike UnmannedBeforeManned \u002B CTT a bit boring you can take a look at the other tech trees which change more.\n\u003C/p\u003E\n\u003Cp\u003E\nFor 1.0.5 (non-BTSM, non-RO) there are mainly EngineeringTechTree and SETI-CommunityTechTree, both provide more radical changes which imho make more sense than the Stock/UnmannedBeforeManned versions.\n\u003C/p\u003E\n\u003Cp\u003E\nIt is usually best to copy your vanilla ksp folder and install the mods in this copy, so there are no auto-updates to newer ksp versions. Many prefer to set up a working mod install and not update that install until they start a new career.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOne note regarding SETI: There is also meta-mod-packs when installing SETI-BalanceMod via CKAN, while leaving the recommendations selected, though that is in it\u0027s infancy and has very radical changes compared to stock. Not recommended if you want to keep stock feeling just with different start.\n\u003C/p\u003E\n"}]}