{"TopicId":131975,"ForumId":16,"TopicTitle":"Electricity exhaustion and dead ship","CreatedByName":"barfing_skull","CreatedById":126825,"CreatedDateTime":"2016-02-12T21:41:29Z","PageNum":1,"Articles":[{"CreatedByName":"barfing_skull","CreatedById":126825,"CreatedDateTime":"2016-02-12T21:41:29Z","Content":"\n\u003Cp\u003E\nThis isn\u0027t a typical \u0022why did my ship run out of power?\u0022 question.  I know why it ran out of power, but I\u0027m wondering about recovery from this situation.....\n\u003C/p\u003E\n\u003Cp\u003E\nThe problem is, I have, at times, on my craft greater consumption than I do production.  Which is fine until it hits 0.  My question is, when this happens why can\u0027t I turn off the power-consuming components to breathe new life into the craft?  You can\u0027t do ANYTHING to the craft, really, which might make sense if there was no power production, but I\u0027m a bit baffled at the inability to turn off consumption in the zero-power state.  Is this a conscious design condition?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nYes, I can stick extra batteries on there and halt their usage, then re-enable them if I run out, but this is problematic in this scenario because I\u0027m using the standalone Alcubierre drive mod, and that draws 10,000 Ec/sec.  My production is a little over 2,000 Ec/sec.  I can also carry capacitors, but when in the zero-power state, I can\u0027t even discharge those.\n\u003C/p\u003E\n\u003Cp\u003E\nI don\u0027t think this is mod-related, as it seems to be a general feature of the game that nothing can happen in the zero-power state.  Correct me if I\u0027m off base here.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nCheers,\n\u003C/p\u003E\n\u003Cp\u003E\n-BS\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-02-12T21:58:25Z","Content":"\n\u003Cp\u003E\nIt\u0027s not quite true that \u003Cem\u003E\u003Cu\u003Enothing\u003C/u\u003E\u003C/em\u003E can happen in zero-power state.  For example, you can still enable/disable resource containers (such as batteries).  However, from your post above, it\u0027s clear that you already know that.  \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOther than that, though... yeah, dead is pretty much dead.  I don\u0027t think Squad\u0027s likely to \u0022fix\u0022 that, either-- clearly they regard it as a \u003Cem\u003E\u003Cu\u003Efeature\u003C/u\u003E\u003C/em\u003E, not a bug (otherwise, why would they have coded it that way?), and I\u0027m inclined to agree with them.  (Actually, the fact that there are some things you \u003Cem\u003E\u003Cu\u003Ecan\u003C/u\u003E\u003C/em\u003E do, like enabling a reserve battery, seems like a bug to me.)\n\u003C/p\u003E\n\u003Cp\u003E\nThe whole point is, if there\u0027s no power to run the computer that\u0027s running the ship (i.e. the probe core), then it can\u0027t send any commands to the rest of the ship to turn anything off.  That\u0027s a real problem that NASA has to contend with, so why not you?  \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNow, what \u003Cem\u003E\u003Cu\u003Ewould\u003C/u\u003E\u003C/em\u003E be nice would be if the heavy-duty power consumers could be configured to automatically turn themselves off if they run out of electricity, so that your ship could recover automatically that way.  But that\u0027s not a game feature, that\u0027s a feature of the individual parts, and it sounds like those are parts from a mod, in your case.  So the way to fix that would be to get the mod author to add that as a feature.\n\u003C/p\u003E\n"},{"CreatedByName":"barfing_skull","CreatedById":126825,"CreatedDateTime":"2016-02-12T22:13:08Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222406069\u0022 data-ipsquote-contentid=\u0022131975\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221455314305\u0022 data-ipsquote-userid=\u0022125662\u0022 data-ipsquote-username=\u0022Snark\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 minutes ago, Snark said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt\u0027s not quite true that \u003Cem\u003E\u003Cu\u003Enothing\u003C/u\u003E\u003C/em\u003E can happen in zero-power state.  For example, you can still enable/disable resource containers (such as batteries).  However, from your post above, it\u0027s clear that you already know that.  \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOther than that, though... yeah, dead is pretty much dead.  I don\u0027t think Squad\u0027s likely to \u0022fix\u0022 that, either-- clearly they regard it as a \u003Cem\u003E\u003Cu\u003Efeature\u003C/u\u003E\u003C/em\u003E, not a bug (otherwise, why would they have coded it that way?), and I\u0027m inclined to agree with them.  (Actually, the fact that there are some things you \u003Cem\u003E\u003Cu\u003Ecan\u003C/u\u003E\u003C/em\u003E do, like enabling a reserve battery, seems like a bug to me.)\n\u003C/p\u003E\n\u003Cp\u003E\nThe whole point is, if there\u0027s no power to run the computer that\u0027s running the ship (i.e. the probe core), then it can\u0027t send any commands to the rest of the ship to turn anything off.  That\u0027s a real problem that NASA has to contend with, so why not you?  \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNow, what \u003Cem\u003E\u003Cu\u003Ewould\u003C/u\u003E\u003C/em\u003E be nice would be if the heavy-duty power consumers could be configured to automatically turn themselves off if they run out of electricity, so that your ship could recover automatically that way.  But that\u0027s not a game feature, that\u0027s a feature of the individual parts, and it sounds like those are parts from a mod, in your case.  So the way to fix that would be to get the mod author to add that as a feature.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI think I agree with the above when there\u0027s no power production, that would absolutely make sense that everything is dead and you\u0027re SOL.  But even a sufficient trickle would seem to be able to run a probe core.  Maybe there needs to be some sort of facility for power prioritization?  I don\u0027t immediately see a mod for that poking through CKAN.\n\u003C/p\u003E\n\u003Cp\u003E\nI think I\u0027ve seen cases where things like ion engines would just pulse or lose thrust to match the power production when stored Ec ran out.  I wonder if it\u0027s the huge draw of this particular part that\u0027s causing some sort of race condition that the consumer is winning.\n\u003C/p\u003E\n\u003Cp\u003E\nIt would be nice if the modded part had the ability to run at a slower pace.  It does have an indicator of the load percentage it\u0027s using, but it would also be nice to be able to cap that percentage.  I don\u0027t have one up right now, but I don\u0027t think that ISRU\u0027s can do that either?\n\u003C/p\u003E\n\u003Cp\u003E\nI wonder if the mod part that\u0027s filling its exotic matter is still filling it up when in the zero power state, given the power draw.  Maybe it would come alive again after it filled up and the consumption went away?  I\u0027ll have to try that....yep, it fills up the resource and power returns.  I\u0027m favouring the race condition hypothesis with this huge power draw part.\n\u003C/p\u003E\n\u003Cp\u003E\nCheers,\n\u003C/p\u003E\n\u003Cp\u003E\n-BS\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-02-12T22:25:40Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222406089\u0022 data-ipsquote-contentid=\u0022131975\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221455315188\u0022 data-ipsquote-userid=\u0022126825\u0022 data-ipsquote-username=\u0022barfing_skull\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 minutes ago, barfing_skull said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBut even a sufficient trickle would seem to be able to run a probe core.  Maybe there needs to be some sort of facility for power prioritization?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah, that\u0027s a good point, feels like a hole in the game.  If there are multiple contenders for electricity, then the probe core really should get priority over everything else.\n\u003C/p\u003E\n"},{"CreatedByName":"Sir_Robert","CreatedById":158111,"CreatedDateTime":"2016-02-13T14:27:20Z","Content":"\n\u003Cp\u003E\nI agree that you should be able to turn things off, and have run into the same problem with my early SCANsats. Fired up a heavier duty scanner with only surface panels, and it ran out.\n\u003C/p\u003E\n\u003Cp\u003E\nInterestingly enough, the trickle of power was still enough to run the probe and reaction wheels, but not enough to turn off the scanner.\n\u003C/p\u003E\n\u003Cp\u003E\nAs a workaround, this is exactly what cheat menus are for. Turn on infinite EC, switch off the power hog, and turn infinite EC back off. Since you\u0027re actually just using a workaround for a feature that should be possible in the first place, it\u0027s not cheating\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-02-13T14:27:45Z\u0022 title=\u002202/13/2016 02:27  PM\u0022 data-short=\u00228 yr\u0022\u003EFebruary 13, 2016\u003C/time\u003E by Sir_Robert\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Mahnarch","CreatedById":114432,"CreatedDateTime":"2016-02-15T22:37:59Z","Content":"\n\u003Cp\u003E\nI ran out of juice on the night side a while back while trying to construct a fuel tanker.\n\u003C/p\u003E\n\u003Cp\u003E\nIt was time against distance. Mano a mano. Man to man...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnd, when the Sun finally emerges over the horizon.. Son of A!!!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022http://i.imgur.com/nGXe4Lh.png?1\u0022 class=\u0022ipsImage\u0022 alt=\u0022nGXe4Lh.png?1\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Sir_Robert","CreatedById":158111,"CreatedDateTime":"2016-02-15T23:46:42Z","Content":"\n\u003Cp\u003E\nO Mun you tease\n\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2016-02-16T08:30:22Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222406089\u0022 data-ipsquote-contentid=\u0022131975\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221455315188\u0022 data-ipsquote-userid=\u0022126825\u0022 data-ipsquote-username=\u0022barfing_skull\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 12.2.2016 at 11:13 PM, barfing_skull said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI think I\u0027ve seen cases where things like ion engines would just pulse or lose thrust to match the power production when stored Ec ran out.  I wonder if it\u0027s the huge draw of this particular part that\u0027s causing some sort of race condition that the consumer is winning.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIn stock KSP, an electric engine will indeed lose thrust when it only receives a partial input of power, but it won\u0027t \u003Cem\u003Ethrottle\u003C/em\u003E itself. What actually happens is a super high frequency flickering of the on/off state. The engine tries to run at the preset throttle level, consumes all available power, discovers a lack of Ec, flames out, discovers that Ec is once again present (since there is active generation), and reactivates itself at the preset throttle level. All in the same physics frame. Then the game steps into the next frame, and the process repeats.\n\u003C/p\u003E\n\u003Cp\u003E\nThere exist the following solutions to this problem:\u003Cbr\u003E\n- Having a manned control pod maintains control even without Ec present. NOTE: Many modded control pods like to add probe features into manned control pods, so that even scientists and engineers can enjoy some computer-aided SAS. Unfortunately, for the purposes of KSP, what actually happens is the opposite. Such pods are not considered crew pods with SAS, but rather probe cores with crew capacity, and will behave exactly like probe cores when losing power, regardless of the amount of crew present. Which technically is realistic, since well, if your fly-by-wire system goes offline...\u003Cbr\u003E\n- Giving the engine a non-instant throttle response, like a jet engine has. Basically any non-instant value works; it can be really tiny. All it needs to do is ensure that the engine cannot fully throttle up in the span of the same physics frame in which it switched itself off and back on again. That will give you a tiny window of opportunity in which your Ec production potentially remains higher than the engine\u0027s consumption, since the engine is still spooling up. You might have control during that tiny window, and hammering x might let you zero out the throttle.\u003Cbr\u003E\n- Installing MechJeb, which nowadays comes with the ability to auto-throttle electric engines when the craft\u0027s Ec storage approaches zero. It\u0027ll even throttle the engines back up for you if the Ec storage recovers.\u003Cbr\u003E\n- And, of course, the old wisdom of having a deactivated backup battery that\u0027ll allow you to at least gain control for a second or two so you can zero out the throttle. Probe core batteries are great for this in stock KSP, though modded electric engines may have much higher Ec consumption than the Dawn ion engine.\n\u003C/p\u003E\n\u003Cp\u003E\nNow, the Alcubierre drive is probably not an engine, but rather a miscellaneous consumer. It doesn\u0027t have a throttle, so neither MechJeb nor throttle response tweaks will help you with it. The only solutions are providing enough Ec, or ensuring that your craft remains controllable even when bone dry.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-02-16T08:32:00Z\u0022 title=\u002202/16/2016 08:32  AM\u0022 data-short=\u00228 yr\u0022\u003EFebruary 16, 2016\u003C/time\u003E by Streetwind\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2016-02-16T10:47:42Z","Content":"\n\u003Cp\u003E\nOn most of my ship, I always lock the small batteries in pods and probe cores so I always have a safety. Those bats should be enough to let me shutdown other parts.\n\u003C/p\u003E\n\u003Cp\u003E\nBut, it\u0027s quite strange that you can\u0027t disable research/refinery when you don\u0027t have any power left. It\u0027s only a switch or a cable to cut...\n\u003C/p\u003E\n"},{"CreatedByName":"Hannu2","CreatedById":154334,"CreatedDateTime":"2016-02-16T11:24:06Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222406069\u0022 data-ipsquote-contentid=\u0022131975\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221455314305\u0022 data-ipsquote-userid=\u0022125662\u0022 data-ipsquote-username=\u0022Snark\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 12.2.2016 at 11:58 PM, Snark said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe whole point is, if there\u0027s no power to run the computer that\u0027s running the ship (i.e. the probe core), then it can\u0027t send any commands to the rest of the ship to turn anything off.  That\u0027s a real problem that NASA has to contend with, so why not you?  \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nEvery real \u0022probe core\u0022 have protection measures against such problems. If they detect that there will be emergency situation, for example battery charge becomes too low, they interrupt all scientific observations, turn off all devices but necessary avionics and communication equipment, rotate itself to an attitude where solar panels get power and communications to Earths is possible and enter into safe mode until mission control resets them and begin to investigate situation. I think that it should be default function on KSP cores too. It would be relatively easy to program (except attitude changes if ship is not active). Game could halt possible timewarp and show a message in such situation.\n\u003C/p\u003E\n\u003Cp\u003E\nBut I think that SQUAD has another opinion. It is possible and relatively easy to use safety battery or \u0022cheat\u0022 by editing save file.\n\u003C/p\u003E\n"}]}