{"TopicId":13199,"ForumId":32,"TopicTitle":"Is it possible to get an orbit that looks like this?","CreatedByName":"dogon11","CreatedById":20786,"CreatedDateTime":"2012-06-24T22:32:27Z","PageNum":1,"Articles":[{"CreatedByName":"dogon11","CreatedById":20786,"CreatedDateTime":"2012-06-24T22:32:27Z","Content":"\n\u003Cp\u003EI\\\u0027ve wondered about space for a while, but one thing I really wonder about in KSP now is if one can have an orbit that looks like the attachment. Is it possible in KSP? The real world?\u003C/p\u003E\n"},{"CreatedByName":"RedDwarfIV","CreatedById":11716,"CreatedDateTime":"2012-06-24T22:34:18Z","Content":"\n\u003Cp\u003ENot in KSP.\u003C/p\u003E\n"},{"CreatedByName":"Akaliwolf","CreatedById":26129,"CreatedDateTime":"2012-06-24T22:37:01Z","Content":"\n\u003Cp\u003EYeah, I dont thinks thats possible in Ksp...but in real life...I dont really know, sadly :L\u003C/p\u003E\n"},{"CreatedByName":"LukeTim","CreatedById":4138,"CreatedDateTime":"2012-06-24T22:37:24Z","Content":"\n\u003Cp\u003EWith my (admittedly limited) knowledge of orbital mechanics, I would say that it is not possible to get an orbit like that in real life or KSP.\u003C/p\u003E\u003Cp\u003EI always thought that the peri and apo had to always be exactly opposite each other.\u003C/p\u003E\n"},{"CreatedByName":"Phoenix Aerospace","CreatedById":26120,"CreatedDateTime":"2012-06-24T22:39:26Z","Content":"\n\u003Cp\u003ESure! That\\\u0027s juts a picture of a circular orbit taken at an angle, and rotated 90 degrees!\u003C/p\u003E\n"},{"CreatedByName":"dogon11","CreatedById":20786,"CreatedDateTime":"2012-06-24T22:43:32Z","Content":"\n\u003Cp\u003EI detect your sarcasm, but if anyone comes along and isn\\\u0027t be sarcastic when they answer this...\u003C/p\u003E\u003Cp\u003EIt\\\u0027s from the top down.\u003C/p\u003E\u003Cp\u003EYou made me laugh.\u003C/p\u003E\n"},{"CreatedByName":"shhhilent1","CreatedById":28278,"CreatedDateTime":"2012-06-24T22:47:34Z","Content":"\n\u003Cp\u003EIve done that in Orbiter 2010! XD\u003C/p\u003E\n"},{"CreatedByName":"UmbralRaptor","CreatedById":2767,"CreatedDateTime":"2012-06-24T22:53:17Z","Content":"\n\u003Cp\u003EIt\\\u0027s not doable -- the body you\\\u0027re orbiting around has to be at one of the ellipse\\\u0027s foci.\u003C/p\u003E\n"},{"CreatedByName":"illectro","CreatedById":763,"CreatedDateTime":"2012-06-25T01:03:32Z","Content":"\n\u003Cp\u003EIf you change gravity from an inverse square law to being proportional to distance then I think that\\\u0027s an orbit you would expect.\u003C/p\u003E\n"},{"CreatedByName":"Tim_Barrett","CreatedById":3206,"CreatedDateTime":"2012-06-25T01:19:42Z","Content":"\n\u003Cp\u003EIf that curve was present then it would be escape velocity. There would be no reason how an object could get that close and seemingly not be affected, and then change direction so quickly when it is further from the body it is orbiting.\u003C/p\u003E\n"},{"CreatedByName":"Ydoow","CreatedById":10165,"CreatedDateTime":"2012-06-25T02:04:07Z","Content":"\n\u003Cp\u003EThis is not possible.\u003C/p\u003E\u003Cp\u003EHere\\\u0027s why.\u003C/p\u003E\u003Cp\u003EAn ellipse has TWO focci\u003C/p\u003E\u003Cp\u003EWhen you\\\u0027re orbiting one planet, there can only be 1 physically represented focci, and the other doesn\\\u0027t truly exist, although it\\\u0027s position can be found.\u003C/p\u003E\u003Cp\u003EThis does NOT mean you can\\\u0027t make a elliptical orbit, I do it all the time. And in fact, the elliptical orbit you provided is very possible.\u003C/p\u003E\u003Cp\u003EHowever the placement of the planet is not possible.\u003C/p\u003E\u003Cp\u003EOrbiting a planet, you have 2 focci, as I said, one is physically represented (the planet) the other doesn\\\u0027t exist.\u003C/p\u003E\u003Cp\u003EThis means that only 1 influences your path (gravity).\u003C/p\u003E\u003Cp\u003EIf both influenced gravity, then you could take the average of their positions and it would give you a \\\u0027third imaginary\\\u0027 focci; the one you painted in that picture.\u003C/p\u003E\u003Cp\u003EThe picture just shows an estimated placement of the two focci that exist when you orbit.\u003C/p\u003E\u003Cp\u003EEither one of the red dots could be a planet, with the other being an imaginary, non-existant, focci.\u003C/p\u003E\u003Cp\u003EOr, if you imagine both focci are planets, then the middle (where you drew your planet) would become an imaginary focci\u003C/p\u003E\n"},{"CreatedByName":"Candre","CreatedById":15181,"CreatedDateTime":"2012-06-25T02:11:07Z","Content":"\n\u003Cp\u003EI once tried to simulate gravity with a computer program and goofed up on the force calculation. The pull ended up being constant, and that orbit is exactly what was produced.\u003C/p\u003E\n"},{"CreatedByName":"Khrissetti","CreatedById":29557,"CreatedDateTime":"2012-06-25T09:35:50Z","Content":"\n\u003Cp\u003Epresumably it would be possible if you spent tonnes of Delta-V burning to produce it? No idea why youu\\\u0027d bother, though...\u003C/p\u003E\n"},{"CreatedByName":"roarke","CreatedById":27433,"CreatedDateTime":"2012-06-25T09:59:51Z","Content":"\n\u003Cp\u003EBut what about that in space there is no right/left and up/down ?\u003C/p\u003E\n"},{"CreatedByName":"PeriapsisPrograde","CreatedById":33,"CreatedDateTime":"2012-06-25T14:59:45Z","Content":"\n\u003Cp\u003EIt\\\u0027s possible to make an orbit look that way in 3D space, however if constained perpendicular to the reference plane, then no.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/roZnU\u0022 rel=\u0022external nofollow\u0022\u003EImages\u003C/a\u003E make more sense.\u003C/p\u003E\n"},{"CreatedByName":"Dobrodav","CreatedById":25028,"CreatedDateTime":"2012-06-25T17:06:53Z","Content":"\n\u003Cp\u003EWell, maybe something close to that possible with additional huge gravity field from the side of periapsis. There is no way for such a system to be stable however.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2012-06-25T17:08:29Z","Content":"\n\u003Cp\u003EIm pretty sure i\\\u0027ve pulled this off in universe sandbox. Im retrying now.\u003C/p\u003E\n"},{"CreatedByName":"kknight13","CreatedById":30262,"CreatedDateTime":"2012-06-28T10:28:25Z","Content":"\n\u003Cp\u003Eone of keplers laws state that the orbit of a body is around two foci (the places where the turns 180 degrees) if the orbit is circular then the points occur in the same place.\u003C/p\u003E\u003Cp\u003Ein this case the two foci are at the top and bottom of the orbital circle, the body it is orbiting is near neither of these points. \u003C/p\u003E\u003Cp\u003EThe orbit is wrong\u003C/p\u003E\n"},{"CreatedByName":"N2maniac","CreatedById":27339,"CreatedDateTime":"2012-06-28T12:10:29Z","Content":"\n\u003Cp\u003EWith a 1/r\u003Csup\u003E2\u003C/sup\u003E force law, orbits will never look from that top down. Under a \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Er\u003C/span\u003E\u003Csup\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003E2\u003C/span\u003E\u003C/sup\u003Er\u003Csup\u003E1\u003C/sup\u003E force law (positive exponent!) they will appear like this (try a mass on a spring or a long pendulum, they generally do this).\u003C/p\u003E\u003Cp\u003EThere is a relation between the power of r that a force law takes and the shape of an orbit under that force law (in terms of what rotation angle is progressed as the altitude does 1 cycle), but I can\\\u0027t remember it at the moment. Many powers end up with the non-circular orbits not being closed for 1 cycle, with -2 and \u002B2 being notable exceptions.\u003C/p\u003E\u003Cp\u003EEdit: The \u002Br solution is r^1, not r^2. I do not know why I was thinking Hooke\\\u0027s law was r^2...\u003C/p\u003E\n"},{"CreatedByName":"Minecraftpeti","CreatedById":45035,"CreatedDateTime":"2012-09-28T15:00:41Z","Content":"\n\u003Cp\u003ENah, its not possible. A Orbit has to have a highest Point (Apoapsis) and a lowest Point (Periapsis). This means that you have to ascend 1/2 of the Orbit and then descend the other half.\u003C/p\u003E\u003Cp\u003EIn your Picture, you would be ascending twice an orbit, and this isnt possible.\u003C/p\u003E\n"},{"CreatedByName":"draeath","CreatedById":25709,"CreatedDateTime":"2012-09-28T15:15:10Z","Content":"\n\u003Cp\u003EWhat am I missing? This looks like a perfectly normal eccentric orbit at 90-degrees inclination (polar). Am I just blind?\u003C/p\u003E\u003Cp\u003EEDIT: Oooh, I get it. Nevermind. My brain was making it work by tricking me into thinking it was circular, with the camera off-angle.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-09-28T15:18:16Z\u0022 title=\u002209/28/2012 03:18  PM\u0022 data-short=\u002211 yr\u0022\u003ESeptember 28, 2012\u003C/time\u003E by draeath\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Felsmak","CreatedById":27187,"CreatedDateTime":"2012-09-28T15:16:40Z","Content":"\n\u003Cp\u003EI assume it isn\u0027t a circular orbit seen from an angle, so the answer is no. The parent body has to be in one of the two ends.\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2012-09-28T15:19:24Z","Content":"\n\u003Cp\u003EAye... a \u003Cem\u003Etrajectory\u003C/em\u003E can look like that, but only if you\u0027re very accurately messing with it all the time to keep it like that xD\u003C/p\u003E\n"},{"CreatedByName":"stoex","CreatedById":49212,"CreatedDateTime":"2012-09-28T15:20:22Z","Content":"\n\u003Cp\u003EI am pretty sure what is meant is that the viewing angle is from the normal of the orbital plane, meaning it is not a projection of a circular orbit. Thus not possible.\u003C/p\u003E\u003Cp\u003EOops, ninja\u0027d...\u003C/p\u003E\n"},{"CreatedByName":"Richy teh space man","CreatedById":12511,"CreatedDateTime":"2012-09-28T15:28:04Z","Content":"\n\u003Cp\u003ENice necro lolz\u003C/p\u003E\u003Cp\u003EBut yeah this orbit does look impossible tbh..\u003C/p\u003E\n"}]}