{"TopicId":13191,"ForumId":16,"TopicTitle":"How to build big rockets?","CreatedByName":"lolmama","CreatedById":26065,"CreatedDateTime":"2012-06-24T20:13:43Z","PageNum":1,"Articles":[{"CreatedByName":"lolmama","CreatedById":26065,"CreatedDateTime":"2012-06-24T20:13:43Z","Content":"\n\u003Cp\u003EOnce you have exhausted the capabilities of the stock parts you will start downloading mods\u003C/p\u003E\u003Cp\u003EBut the big parts can be hard to use if you don\\\u0027t know how to \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EHere are some tips to help you:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#0000FF;\u0022\u003E1. \u003C/span\u003E\u003Cstrong\u003E\u003Cspan style=\u0022color:#0000FF;\u0022\u003EUse mech jeb\u003C/span\u003E\u003C/strong\u003E\u003Cspan style=\u0022color:#0000FF;\u0022\u003E, mech jeb is a tool that allows you to get precise and accurate guidance on you craft and allows for very advanced orbital construction.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#0000FF;\u0022\u003E2. Use SAS modules, in addition to your advanced SAS at the top of you craft, add normal SAS modules to your intermediate stages and SRB to balance out the control. This will make your craft stop wobbling by evening out the SAS force and making it less top control heavy.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#0000FF;\u0022\u003E3. Use RCS. RCS can come in handy when in space and have no thrust, but it is as useful on the ground. If you use RCS when your SAS or Mech jeb is turned on you will have better control and stability.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#0000FF;\u0022\u003E4. Don\\\u0027t make your rocket too tall. Don\\\u0027t be afraid to use some SRB\\\u0027s or bigger engines. If your rocket becomes too tall it will start to wobble and bend where there are joints or new stages.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#0000FF;\u0022\u003E5. Some rockets tend to shake a bit where there are decouplers. I suggest getting some heavy duty struts from the KW challenger pack or Nova punch and strutting your rocket at weak spots.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003ERandom tip: Use payload fairing to cover your load. It makes it look better\u003C/span\u003E \u003C/p\u003E\n"}]}