{"TopicId":132412,"ForumId":55,"TopicTitle":"Different Icons for Drogue- and Mainchutes","CreatedByName":"Tantalus","CreatedById":118982,"CreatedDateTime":"2016-02-18T16:28:37Z","PageNum":1,"Articles":[{"CreatedByName":"Tantalus","CreatedById":118982,"CreatedDateTime":"2016-02-18T16:28:37Z","Content":"\n\u003Cp\u003E\nHey there,\n\u003C/p\u003E\n\u003Cp\u003E\njust an idea: give drogue chutes and main chutes slightly diffent icons in staging list. I dont think it would be a lot of work, but would make sorting the staging list a lot easier.\n\u003C/p\u003E\n\u003Cp\u003E\nRegards\n\u003C/p\u003E\n\u003Cp\u003E\nTantalus\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-02-18T16:40:02Z\u0022 title=\u002202/18/2016 04:40  PM\u0022 data-short=\u00228 yr\u0022\u003EFebruary 18, 2016\u003C/time\u003E by Tantalus\u003C/strong\u003E\n\u003Cbr\u003ETypo\n\u003C/span\u003E\n"},{"CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2016-02-25T01:49:34Z","Content":"\n\u003Cp\u003E\nI personally wouldn\u0027t see it as that big of a benefit. I mean, it\u0027s easy enough to mouse over the icon in the staging list and see which parachute lights up.\n\u003C/p\u003E\n"},{"CreatedByName":"rebelcommando1807","CreatedById":5892,"CreatedDateTime":"2016-02-25T02:47:39Z","Content":"\n\u003Cp\u003E\nAs minor of a thing as this is, it would be nice to have. And, realistically, all one would need to do with the drogue chutes for the different icon is have them be a bit thinner than the main chutes.\u003Cbr\u003E\u003Cbr\u003E\nThe problem then comes when implementing it - Simply because, AFAIK, the game gives an icon depending on the module (Otherwise, I could totally see air-breathing engines having a separate icon from rockets, as well as a new icon for ion engines), and it would be needlessly redundant to have a \u0027MainChute\u0027 module and a \u0027DrogueChute\u0027 module.\n\u003C/p\u003E\n\u003Cp\u003E\nThough, I would totally be for having a field added to the config to have the ability to point to a different \u0027StagingIcon\u0027 file, and just defaulting to the module\u0027s one. It could be a relatively minor change, but it would be nifty. (Of course, would have to be made in a specific way so it can be reliably applied, but that\u0027s the point of having file specifications, no?)\n\u003C/p\u003E\n"}]}