{"TopicId":132548,"ForumId":55,"TopicTitle":"Challenges with online leaderboards","CreatedByName":"michelcolman","CreatedById":157405,"CreatedDateTime":"2016-02-20T11:09:21Z","PageNum":1,"Articles":[{"CreatedByName":"michelcolman","CreatedById":157405,"CreatedDateTime":"2016-02-20T11:09:21Z","Content":"\n\u003Cp\u003E\nFeature suggestion: I think it would be a good idea to introduce some sort of online competition with leaderboards for specific challenges. For example:\n\u003C/p\u003E\n\u003Cp\u003E\n- Take off from Kerbin, get a surface sample from the Mün and get it back to Kerbin with the lowest amount of fuel (fuel in vehicle at launch), or the fastest time, or the cheapest rocket,...\n\u003C/p\u003E\n\u003Cp\u003E\n- Fly to Gilly and bring back surface samples from all three biomes with the lowest amount of fuel, fastest time, or cheapest rocket\n\u003C/p\u003E\n\u003Cp\u003E\n- Fly to Eelo, pass at less than 100 km and come back to Kerbin (fastest, cheapest,...)\n\u003C/p\u003E\n\u003Cp\u003E\nThis would lead to lots of competition and possibly new discoveries on how to fly most efficiently. Instead of just taking \u0022enough\u0022 fuel, you\u0027d really try to minimize the budget as much as possible and get there and back on vapours, using lots of gravity assists etc.\n\u003C/p\u003E\n\u003Cp\u003E\nYou would need some kind of verification, for example a recording, to catch cheaters. Whenever someone breaks a record, the recording would be sent as well.\n\u003C/p\u003E\n"},{"CreatedByName":"michelcolman","CreatedById":157405,"CreatedDateTime":"2016-02-20T12:13:35Z","Content":"\n\u003Cp\u003E\nOh, no mods of course. Challenge mode would disable mods (or be unavailable if mods are present), and each challenge could have a list of allowed equipment (no asteroid mining for minimum fuel missions, for example).\n\u003C/p\u003E\n\u003Cp\u003E\nThere could also be separate categories for records with or without quicksaving.\n\u003C/p\u003E\n\u003Cp\u003E\nIt would be interesting to see what the KSP community can come up with to break records. To fly to the Mün and back in the fastest time, one might use a huge rocket with lots of TWR and delta-v, fire straight up when the Mün is almost overhead, keep accelerating until the last moment, switch to a second set of engines that\u0027s pointing the other way to avoid wasting time turning around, do a suicide burn, jump out before the rocket even touches the ground (hard, right at the limit of the landing gear), get the sample, jump back in, fire straight to Kerbin, just enough braking to avoid burning up, parachutes at the last moment (or a retro burn if you could cram all that fuel into the original rocket), recover just as the vehicle touches down.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd then at the other end of the spectrum, somebody flying by all the planets one by one with a single smallish rocket using a ridiculously small amount of fuel slingshotting all over the place, with other people going \u0022What? I need that much fuel just to get to Minmus!\u0022. Yes, \u0022fly by all planets\u0022 should definitely be a challenge.\n\u003C/p\u003E\n"},{"CreatedByName":"pandaman","CreatedById":130621,"CreatedDateTime":"2016-02-20T12:17:26Z","Content":"\n\u003Cp\u003E\nWe currently have a \u0027challenges\u0027 thread that does this (sort of) where each challenge is \u0027monitored\u0027 by the author.   \n\u003C/p\u003E\n\u003Cp\u003E\nI get your point, and it\u0027s not a silly idea for those who want to use it.  I just don\u0027t personally see any real benefit over what already exists given the difficulty of it.\n\u003C/p\u003E\n\u003Cp\u003E\nThere are so many combinations of mods etc out there that \u0027policing\u0027 a global online competition to ensure that everyone plays fair would be a monumental, if not impossible, task.  Do not under estimate the power of ego, as soon as you introduce an \u0027official leaderboard\u0027 some people WILL cheat to get to the top.\n\u003C/p\u003E\n"},{"CreatedByName":"michelcolman","CreatedById":157405,"CreatedDateTime":"2016-02-20T12:28:27Z","Content":"\n\u003Cp\u003E\nCheating would be a problem, of course. Mods certainly could be disabled, but that wouldn\u0027t keep people from modifying the original game using a different method.\n\u003C/p\u003E\n\u003Cp\u003E\nI would suggest that the game would send a detailed log of the entire flight and this would be downloadable and replayable by anyone. This would serve a dual purpose, being very educational and catching cheaters. No need for anyone in particular to police it: whenever a suspicious record appears, people will replay it and flag it if it\u0027s a cheat.\n\u003C/p\u003E\n"},{"CreatedByName":"pandaman","CreatedById":130621,"CreatedDateTime":"2016-02-20T13:18:17Z","Content":"\n\u003Cp\u003E\nThat could work.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever any \u0027official\u0027 system, by it\u0027s definition would need Squad\u0027s involvement somewhere, even if it is only giving approval and keeping a wary eye on things to protect their interests and reputation. \n\u003C/p\u003E\n"}]}