{"TopicId":132653,"ForumId":32,"TopicTitle":"Test RT-10 Hammer over Kerbin","CreatedByName":"kharless","CreatedById":159044,"CreatedDateTime":"2016-02-21T16:56:07Z","PageNum":1,"Articles":[{"CreatedByName":"kharless","CreatedById":159044,"CreatedDateTime":"2016-02-21T16:56:07Z","Content":"\n\u003Cp\u003E\nGreetings,\n\u003C/p\u003E\n\u003Cp\u003E\nNewbie, I have a simple ship with an RT-10 Hammer SRB, a coupler, a pod and a shoot.  The test says to stage at 58-61K Meters and 360-450 M/S.\u003Cbr\u003E\nI right click run test and it launches but I am going to fast at 58K and suspect that is why I am not meeting the test requirements. I keep fiddling with the throttle to see if I can nail the right speed?\n\u003C/p\u003E\n\u003Cp\u003E\nI also noticed the test button is still available in flight, am I suppose to click that once I am at property altitude and proper speed?\n\u003C/p\u003E\n\u003Cp\u003E\nConfused but loving the game!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"kharless","CreatedById":159044,"CreatedDateTime":"2016-02-21T17:13:58Z","Content":"\n\u003Cp\u003E\nHmmm SRB\u0027s dont really appear to be throttle-able.  Makes sense.  So now I am changing my trajectory but still haven\u0027t nailed it.  Is this the right approach?\n\u003C/p\u003E\n"},{"CreatedByName":"kharless","CreatedById":159044,"CreatedDateTime":"2016-02-21T17:27:06Z","Content":"\n\u003Cp\u003E\nNever mind, got it to work.  Trajectory and waiting for all events then pressing the test button seemed to work.\n\u003C/p\u003E\n"},{"CreatedByName":"Sir_Robert","CreatedById":158111,"CreatedDateTime":"2016-02-21T17:43:46Z","Content":"\n\u003Cp\u003E\nThe test tells you to stage at that point. You are already staging it at launch, which means you can\u0027t complete the mission. you have to haul it up there first, THEN stage it (with a different rocket. Use a liquid fuel rocket so you can throttle and control your speed).\n\u003C/p\u003E\n\u003Cp\u003E\nSave some weight by taking the Solid Fuel out of the booster first, to make this easier\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-02-21T17:44:07Z\u0022 title=\u002202/21/2016 05:44  PM\u0022 data-short=\u00228 yr\u0022\u003EFebruary 21, 2016\u003C/time\u003E by Sir_Robert\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Aethon","CreatedById":110755,"CreatedDateTime":"2016-02-21T17:49:11Z","Content":"\n\u003Cp\u003E\nAlternately you can right click the engine on the launch pad and activate it from there, and then hit the stage button when you\u0027ve met the alt/speed requirement.  You might also need to r click the srb in the VAB to remove some of the fuel so you can coast into the altitude regime and be going the right speed. \n\u003C/p\u003E\n\u003Cp\u003E\nHope this helps, and welcome to the forums.\n\u003C/p\u003E\n"},{"CreatedByName":"worir4","CreatedById":75980,"CreatedDateTime":"2016-02-21T17:53:57Z","Content":"\n\u003Cp\u003E\nYou can change the throttle in the editor by right clicking. This can\u0027t be done in flight for SRBs. It might take some tweaking to get it right. Good luck!\n\u003C/p\u003E\n"}]}