{"TopicId":13273,"ForumId":25,"TopicTitle":"Voyage to the Sun","CreatedByName":"CyclonicTuna","CreatedById":21888,"CreatedDateTime":"2012-06-26T11:42:13Z","PageNum":1,"Articles":[{"CreatedByName":"CyclonicTuna","CreatedById":21888,"CreatedDateTime":"2012-06-26T11:42:13Z","Content":"\n\u003Cp\u003ESo with all the new content coming and with all the new features that will be implemented in the next version of KSP (as of now v0.16). I was just speculating to myself, wondering, dreaming so to say, about what other possibility\\\u0027s of KSP could hold. \u003C/p\u003E\u003Cp\u003EOne thing I\\\u0027d really like to see is the expansion of scientific stuff ;D, finding out more about the solar system. Being able to study planets with sattelites and sending rovers. Anyway, in this daydream I decided to travel.......to the Sun \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_ohmy.png\u0022 alt=\u0022:o\u0022\u003E!!!\u003C/p\u003E\u003Cp\u003EAs far as I know no-one ever tried this before, and I can honestly say, its not really that awsome. Secretly I was hoping for some kind of easter egg like the center of the galaxy in Spore as reward for travelling so far:\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/RgN4p6Anwu0?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003ESo I was curious as to what would happen would one fly directly into the sun ;P\u003C/p\u003E\u003Cp\u003ETurns out the sun is a big hot thing that burns your spacecraft if you get to close, it just so happens that it has a big gravitational pull and emits a lot of light. Nevertheless it was a fun little adventure. \u003C/p\u003E\u003Cp\u003EAnd the coolest thing is, I think I may have broken some records in the process for overall distance travelled and highest speed achieved. And that is where my challange comes in in the hybrid suggestion for the dev\\\u0027s/challanged topic (dev\\\u0027s if you read this what I mean by that ofcourse is that I would like to see functional sattelites etc).\u003C/p\u003E\u003Cp\u003EAnyways, I would like to see what you guys would do to get to the sun. What kind of vessel did you use, what speeds did you achieve, let me know!\u003C/p\u003E\u003Cp\u003EHere are some screenshots that discribe my journey and the records that (I think) I broke:\u003C/p\u003E\u003Cp\u003EFor my rocket I used only parts found in the Novapunch remix pack. It consisted of: \u003C/p\u003E\u003Cp\u003E#1 stage: \u003Cstrong\u003E2x\u003C/strong\u003E FL-T300 fuel tanks, \u003Cstrong\u003E4x\u003C/strong\u003E TiberDyne JF-1750 Solid Boosters, \u003Cstrong\u003E1x\u003C/strong\u003E 3M7X1 adapter plate with \u003Cstrong\u003E7x\u003C/strong\u003E M-50 Liquid fuel rocket engines, \u003Cstrong\u003E1x\u003C/strong\u003E RCST-300 RCS tank with \u003Cstrong\u003E4x\u003C/strong\u003E RV-105 RCS thruster blocks.\u003C/p\u003E\u003Cp\u003E#2 stage: \u003Cstrong\u003E2x\u003C/strong\u003E HH-78a large fuel tanks, \u003Cstrong\u003E1x\u003C/strong\u003E NERVA Mk. 1 Nuclear Thermal Rocket Engine, \u003Cstrong\u003E1x\u003C/strong\u003E RCS-175 RCS tank with again \u003Cstrong\u003E4X\u003C/strong\u003E RV-105 RCS thruster blocks. Then a M-38 unoccupied guidance system (we wouldn\\\u0027t want to burn our kerbals now would we \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E ) as guidance. A vanilla Advanced S.A.S module, and a Platinum Communications Model BXs-9 for \u0027gathering scientific results\u0027.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ESome statistics\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ETotal mission time: 34 days, 17 hours, 11 minutes, 19 seconds\u003C/p\u003E\u003Cp\u003EHighest speed achieved: 182.535 m/s, or mach 536.41 at sea level, or 0,060845% the speed of light.\u003C/p\u003E\u003Cp\u003ETotal distacne travelled: 31.417.724.130 m, or 1/301129,3867th of a lightyear.\u003C/p\u003E\u003Cp\u003EMind you, I deliberetly crashed into the sun because I wanted to see if it looked any diffrent up close, and what would happen if I would get really close. You can probably get higher speeds if you get in around an orbit.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EOne more thing!!\u003C/strong\u003E If you plan on trying this yourself, I suggest taking off at noon, when the sun is directly above your space craft. That way you only have to go straight up making maximal use of your fuel, and you don\\\u0027t need to preform any complex allignments.\u003C/p\u003E\n"},{"CreatedByName":"SunJumper","CreatedById":27062,"CreatedDateTime":"2012-06-26T12:56:57Z","Content":"\n\u003Cp\u003ENo, you wait until sunset, that way you are pointing directly in Kerbin\\\u0027s retrograde vector, allowing you to lose Kerbin\\\u0027s orbital momentum AND escape Kerbin in the one go...\u003C/p\u003E\n"},{"CreatedByName":"togfox","CreatedById":17083,"CreatedDateTime":"2012-06-26T13:24:04Z","Content":"\n\u003Cp\u003EIf you like science stuff then search for KGSS.\u003C/p\u003E\n"},{"CreatedByName":"maltesh","CreatedById":17144,"CreatedDateTime":"2012-06-26T14:50:25Z","Content":"\n\u003Cp\u003EYou actually get best use of the fuel by smoothly going into low orbit first, and then burning at the point where the limb of your planned hyperbolic escape will take you in the correct direction. As mechjeb\\\u0027s acnet stats will show you, this minimizes the gravity drag, for a more fuel-efficeint departure.\u003C/p\u003E\u003Cp\u003EIf you /really/ want to save fuel on a sundive though, you need to do a Bi-Elliptic transfer. Leave out the leading edge of Kerbin\\\u0027s SOI for a very distant apoapsis (I usually go for 131 GM from Kerbin orbit). Gravity drag will slow down your ship for you, leaving you with a lot less velocity to kill when you get out there. From Kerbin orbit, a Bi-Elliptic sundive can cut the required delta-V by half, at a cost of a trip that takes dozens of times longer (My typical bi-elliptic Sundive is a 1200-day trip). In fact, the numbers work out that it\\\u0027s more fuel-efficient to go the bi-elliptic route to sundive from any distance more than about 6 radii from the star.\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/go9WmKd2Wuc?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EThis was actually one of my first attemtps at it. The ship is fairly poorly designed, and I start burning to exit the leading pole of the Kerbin SOI too early, and compound the error by wasting fuel trying to bend my trajectory in LKO. This was also in version 0.12 something, where, like in the Demo Version, the sun doesn\\\u0027t yet have the kill line added in 0.14, resulting in a maximum velocity of about 4000 km/s at periapsis.\u003C/p\u003E\n"},{"CreatedByName":"CyclonicTuna","CreatedById":21888,"CreatedDateTime":"2012-06-27T16:10:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022maltesh\u0022 data-cite=\u0022maltesh\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EYou actually get best use of the fuel by smoothly going into low orbit first, and then burning at the point where the limb of your planned hyperbolic escape will take you in the correct direction. As mechjeb\\\u0027s acnet stats will show you, this minimizes the gravity drag, for a more fuel-efficeint departure.\u003C/p\u003E\u003Cp\u003EIf you /really/ want to save fuel on a sundive though, you need to do a Bi-Elliptic transfer. Leave out the leading edge of Kerbin\\\u0027s SOI for a very distant apoapsis (I usually go for 131 GM from Kerbin orbit). Gravity drag will slow down your ship for you, leaving you with a lot less velocity to kill when you get out there. From Kerbin orbit, a Bi-Elliptic sundive can cut the required delta-V by half, at a cost of a trip that takes dozens of times longer (My typical bi-elliptic Sundive is a 1200-day trip). In fact, the numbers work out that it\\\u0027s more fuel-efficient to go the bi-elliptic route to sundive from any distance more than about 6 radii from the star.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have no idea what you are talking about, but I believe you \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"}]}