{"TopicId":132711,"ForumId":18,"TopicTitle":"swjr-swis in KSP hybernation","CreatedByName":"swjr-swis","CreatedById":152460,"CreatedDateTime":"2016-02-22T12:57:04Z","PageNum":1,"Articles":[{"CreatedByName":"swjr-swis","CreatedById":152460,"CreatedDateTime":"2016-02-22T12:57:04Z","Content":"\n\u003Cp\u003E\nShort but sweet: I need to divert time and energy from less indispensable activities to get myself back into gainful employment. I expect to be much less active in these forums for the time being, but that\u0027s all it\u0027s about, no nefarious reasons or disgruntlement or anything like that. KSP is one of the best games I know, and has one of the best communities I know, I have very much enjoyed my time so far.\n\u003C/p\u003E\n\u003Cp\u003E\nI only became active in the forum very recently after a very long time of lurking anonymously, but in that short time I\u0027ve tried to be a positive and helpful contributor, if not always with actual helpful stuff, at least by provoking a smile or two. I hope I succeeded.\n\u003C/p\u003E\n\u003Cp\u003E\nRecent events have taught me it\u0027s important to express gratitude, which is why I decided to not simply fade silently: my thanks go to Squad for the awesome game, everyone involved in supporting the community, modding and non-modding alike, directly or indirectly. And thanks in general to the great community of KSP players - I\u0027ve learned a lot about KSP and Real Physics and engineering subjects from too many of you to name. Not unimportantly: I\u0027ve had a great deal of fun at the same time. Thank you.\n\u003C/p\u003E\n\u003Cp\u003E\nI hope I will be able to check in now and then to stay informed, and my intent is to get Life sorted out so I can spend more time with the game and the community soon again.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nswjr-swis\n\u003C/p\u003E\n"},{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2016-02-22T13:06:16Z","Content":"\n\u003Cp\u003E\nI hope that job hunting goes well man! And I really hope that you don\u0027t vanish from here!! You\u0027ve quickly become a notable member of the community so I do hope you remain connected!  And you\u0027ve been a great help and support to me over my recent KerbalX-Imgur issues, really appreciate that man.  \n\u003C/p\u003E\n\u003Cp\u003E\nYou\u0027re one of us, don\u0027t stray too far!! Good luck with sorting those pesky RL things! \n\u003C/p\u003E\n"},{"CreatedByName":"swjr-swis","CreatedById":152460,"CreatedDateTime":"2016-02-26T18:20:44Z","Content":"\n\u003Cp\u003E\nCompletely forgot to adapt my follow and notification settings... man do notifications pile up quickly.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway, thanks. I really don\u0027t expect to vanish entirely, I just need to manage the time, which unfortunately means restricting my participation. As much as I like KSP, the forum and the people, Life has priority.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway, up and away again.\n\u003C/p\u003E\n"}]}