{"TopicId":132989,"ForumId":25,"TopicTitle":"STOAT rides the WEASEL: Smallest/Lightest Rescue Craft?","CreatedByName":"Buster Charlie","CreatedById":157768,"CreatedDateTime":"2016-02-26T20:45:31Z","PageNum":1,"Articles":[{"CreatedByName":"Buster Charlie","CreatedById":157768,"CreatedDateTime":"2016-02-26T20:45:31Z","Content":"\n\u003Cp\u003E\nIn an excuse to use weasel themed Acronyms inspired by the Lunar Escape System I started a series of light craft using Stock parts, but honestly it could be done better with mod parts.\n\u003C/p\u003E\n\u003Cp\u003E\nIn fact if I can work out some bugs maybe i\u0027ll try my hand at making some custom mod parts specifically to streamline this idea (better form factor, less parts) while keeping the stock balance involved... \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022XPeV4ie.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/XPeV4ie.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nONTO THE IDEA!\n\u003C/p\u003E\n\u003Cp\u003E\nThe name of the Project is \u003Cstrong\u003EF.E.R.R.E.T - Focused Emergency Rescue-Rrendezvous Escape Technology\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe Vehicle is called the \u003Cstrong\u003ES.T.O.A.T. - Straight To Orbit Ascent Thruster\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIf you decide to build a lander, it falls under the project \u003Cstrong\u003EW.E.A.S.E.L. - Worst-case Emergency Ascent Surface Escape Lander\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIf you can think of a better name, go for it.\n\u003C/p\u003E\n\u003Cp\u003E\nThe Base Model STOAT can land by itself, lift off one astronaut, and circularize orbit on Gilly, Pol, Minmus, Bop, Ike, Dres, Mun, Eeloo, Vall, \u0026amp; Moho; This is not much of a challenge because some of these bodies you could use the EVA pack to do the same thing. In fact I was tempted to use 300 DV from the EVA pack to act as a 3rd stage (I wanted to save half the fuel for maneuvering to the rescue craft).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022FsJ0cSV.jpg?1\u0022 class=\u0022ipsImage\u0022 height=\u0022732\u0022 src=\u0022http://i.imgur.com/FsJ0cSV.jpg?1\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt uses a single Ant Engine, the probe core\u0027s reaction wheel for stability control, and a single battery (I had issues with the probe battery running out during some circulation maneuvers)\n\u003C/p\u003E\n\u003Cp\u003E\nThe Lander is just a test bed, you could include this with nearly anything to bring it to the surface. I used a Docking port as a decoupler for weight reasons, so if you use gravity turn or mechjeb I don\u0027t think you can use auto-stage. Also make sure you turn off fuel crossflow or your lander will suck the STOAT fuel supply dry (Ask me how I know this). Lander uses a fuelcell because it has more than enough fuel to land, it cuts down on solar panels, batteries, and it\u0027s only purpose is to keep the STOAT topped up until launch. You could always disable the battery on the STOAT until right before launch to be on the safe side.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nFor DUNA I actually didn\u0027t have to do much extra, just needed a little more Delta-V to get off.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022eyrnKrh.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/eyrnKrh.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThis uses the same Lander as the standard STOAT, Double the fuel and a more powerful engines mounted side by side to keep it from being too tall. I found the atmosphere and shape of the rocket made flipping a issue, so I used a smaller probe core and added a larger dedicated reaction wheel, and the same battery setup still worked. I didn\u0027t have issues with overheating, and I since propulsive landing worked, I didn\u0027t bother with parachutes or any other kit for the lander. I also discovered I had to play with the ascent profile, too shallow and you just wont make it, so you pretty much have to punch through the lower atmosphere as fast as possible to get this to work.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI was going to share my TYLO STOAT, but I think I overwrote it with my prototype LAYTHE one.  Pro side is we don\u0027t need the nose cones, but I think I might have needed to make it two stage (IIRC a single 1.25m small tank and the same engine as the lander, with a docking port decoupler), and the lander needed nearly all of it\u0027s fuel to land safely.\n\u003C/p\u003E\n\u003Cp\u003E\nThe Laythe Lander is providing me trouble, I\u0027ve got a lander that can land alright, but the STOAT stage is getting into full sized rocket territory, and its getting pretty tipsy unless on flat round, and forget water landing (it survives but can\u0027t keep it upright). I know EVE is going to be pretty much crazy in size but is still something I want to attempt. I did resort to sticking the command seat inside a 1.25m service bay (sideways) on one attempt to deal with atmospheric issues.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSo I\u0027d like some feedback and feel free to submit design or ideas.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nDesign goals:\n\u003C/p\u003E\n\u003Cp\u003E\nSingle Kerbal (I mean sure go for 2 or more, but I want to keep the footprint that will fit inside a 2.5m farring without looking like a pancake.) \n\u003C/p\u003E\n\u003Cp\u003E\nMinimum weight STOAT stage:\n\u003C/p\u003E\n\u003Cp\u003E\nAll it needs to do is get into a stable orbit where another ship can rendezvous and pick up the stranded kerbal, you can use the EVA pack for emergency orbital stability if needed, you need to reserve enough EVA fuel to get to the rescue ship.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe WEASEL acts as the launch platform  for the STOAT, if you just want to hyperedit something onto the planet to make a stand alone STOAT, be my guest, the WEASEL is optional but I essentially designed it to be a bare bones landable launch platform. Obviously on some planets this might be a challenge of itself, but we can assume the player gets the STOAT planetside with their own vehicle.\n\u003C/p\u003E\n\u003Cp\u003E\nI really don\u0027t care if you use mods, I used all stock parts but I used hyperedit to put the test platform into a target orbit to test landings and takeoffs. \n\u003C/p\u003E\n\u003Cp\u003E\nGo ahead and use mechjeb or gravity turn, or whatever you want to launch it. This isn\u0027t a piloting contest. \n\u003C/p\u003E\n\u003Cp\u003E\nI know I could have made the STOAT lighter and smaller using some of the STOCKALIKE parts mods that provide smaller fuel tanks or smaller reaction wheels or different probe cores. I\u0027m fine with mod builds, but I\u0027m also curious what can be done with STOCK parts.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI will post my craft to KerbalX if anyone wants it, but it\u0027s so basic I doubt you\u0027ll need that.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIdeas?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Buster Charlie","CreatedById":157768,"CreatedDateTime":"2016-03-02T11:26:35Z","Content":"\n\u003Cp\u003E\nOkay since nobody has said a peep I guess there is no interest in this challenge or maybe I was not specific enough.\n\u003C/p\u003E\n"},{"CreatedByName":"Nefrums","CreatedById":145422,"CreatedDateTime":"2016-03-02T12:35:02Z","Content":"\n\u003Cp\u003E\nI made something similar for my Jool 5 low mass entry. \n\u003C/p\u003E\n\u003Cp\u003E\nThis is a 1.8t Tylo lander.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/eJBkGl3.jpg\u0022 alt=\u0022eJBkGl3.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Buster Charlie","CreatedById":157768,"CreatedDateTime":"2016-03-02T12:37:37Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222438108\u0022 data-ipsquote-contentid=\u0022132989\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221456922102\u0022 data-ipsquote-userid=\u0022145422\u0022 data-ipsquote-username=\u0022Nefrums\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 minute ago, Nefrums said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI made something similar for my Jool 5 low mass entry. \n\u003C/p\u003E\n\u003Cp\u003E\nThis is a 1.8t Tylo lander.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://i.imgur.com/eJBkGl3.jpg\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022eJBkGl3.jpg\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 src=\u0022http://i.imgur.com/eJBkGl3.jpg\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI like that, but what of recovery?  I guess that was my main goal, what is the smallest liferaft to get off a planet or moon.\n\u003C/p\u003E\n"},{"CreatedByName":"Ziv","CreatedById":91995,"CreatedDateTime":"2016-03-05T13:00:22Z","Content":"\n\u003Cp\u003E\nI like this idea, I always like to build small. Maybe I\u0027ll give it a try! \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nCheck out my very old JOOL-5 low mass mission with ion drives: it was able to do an almost grand-tour, landing everywhere except Eve and the whole ship was less than 10 tons: \u003Ca href=\u0022http://imgur.com/a/Oevfg#0\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/Oevfg#0\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}