{"TopicId":13370,"ForumId":32,"TopicTitle":"Beyond the sun","CreatedByName":"kknight13","CreatedById":30262,"CreatedDateTime":"2012-06-28T10:34:52Z","PageNum":1,"Articles":[{"CreatedByName":"kknight13","CreatedById":30262,"CreatedDateTime":"2012-06-28T10:34:52Z","Content":"\n\u003Cp\u003ERecently i got two ships escaping the suns gravitational pull (scheduled to be free in sometime over 68 years) however i can\\\u0027t zoom out beyond the sun, does anyone know what happens after you escape the sun\\\u0027s pull? is there another body you start orbiting?\u003C/p\u003E\u003Cp\u003Ewould be really cool if you could get to other star systems but would probably take a couple of centuries at least and 10K speed is too slow for that.\u003C/p\u003E\n"},{"CreatedByName":"Cykyrios","CreatedById":17639,"CreatedDateTime":"2012-06-28T11:01:03Z","Content":"\n\u003Cp\u003EAs of now, there is no other body, and you can\\\u0027t escape Kerbol either, as its sphere of influence is infinite (the gravity becomes very close to zero after some time, though). The universe of the game itself is infinite, so either you can go on forever, or the game will crash at some point, or at least glitch.\u003C/p\u003E\u003Cp\u003EThe only useful thing you can do now, is to try and get back to Kerbin =P\u003C/p\u003E\n"},{"CreatedByName":"N2maniac","CreatedById":27339,"CreatedDateTime":"2012-06-28T12:00:34Z","Content":"\n\u003Cp\u003EYou can reach escape velocity for Kerbol fairly easily (should be about 4-5km/s over Kerbin\\\u0027s orbital speed at that altitude) but you never leave the SoI. It just becomes a slow journey at some point with a speed asymptotically approaching ship\\\u0027s hyperbolic excess velocity following its hyperbolic orbit.\u003C/p\u003E\n"},{"CreatedByName":"Cryphonus","CreatedById":23502,"CreatedDateTime":"2012-06-28T12:56:52Z","Content":"\n\u003Cp\u003EI left my computer open for about 2 days at x10000 time warp and nothing happened.\u003C/p\u003E\n"},{"CreatedByName":"SunJumper","CreatedById":27062,"CreatedDateTime":"2012-06-28T13:15:13Z","Content":"\n\u003Cp\u003EThere is a point, roughly 6,148,000,000,000,000,000m from Kerbol (or a sphere of \\\u0027em) where the physics conks out, and all your velocity is stopped. You need to exploit a special glitch for this to work, though...\u003C/p\u003E\n"},{"CreatedByName":"BlackBicycle","CreatedById":29657,"CreatedDateTime":"2012-06-28T13:36:56Z","Content":"\n\u003Cp\u003EI recently destroyed some compound debris in orbit with a laser cannon. I guess one component got destroyed, and others received such impulses that they went far and wide. As a result, after a Kerbin day or two they overflowed their 2 million or so altitude and predictably bugged out to minus 2 million or so (it\\\u0027s actually a bit over that). I was able to switch to them, but at that moment everything stopped working, I could do escape menu, but after I clicked on any buttons the menu will not function (either closed with no effect or just blinked the button, don\\\u0027t remember). I have the persistent from then, I think, could post upon request. I am using about 10 mods though, so beware before you request this.\u003C/p\u003E\n"},{"CreatedByName":"A Fat Pokemon","CreatedById":29245,"CreatedDateTime":"2012-06-28T18:25:30Z","Content":"\n\u003Cp\u003EWith a glitch I had experienced, I ended up going something like 24.7 times the speed of light, and just shot out of the solar system. I ran it at max warp, and you can never leave Kerbols SoI. I also went something like 260,000T 8)\u003C/p\u003E\n"}]}