{"TopicId":133886,"ForumId":55,"TopicTitle":"Ramjet \u0026amp; Scramjet engines","CreatedByName":"StevieC","CreatedById":146665,"CreatedDateTime":"2016-03-10T04:22:27Z","PageNum":1,"Articles":[{"CreatedByName":"StevieC","CreatedById":146665,"CreatedDateTime":"2016-03-10T04:22:27Z","Content":"\n\u003Cp\u003E\nTo be more specific, I\u0027d like to see two things:\n\u003C/p\u003E\n\u003Col\u003E\u003Cli\u003E\nA liquid-fueled scramjet (Supersonic-Combustion Ramjet) engine that can propel a craft from about 900 meters per second at roughly 10-12 km altitude above Kerbin up to 2-2.3 kilometers per second to push apoapsis between 120 and 160 kilometers with periapsis either above sea-level or to a depth below sea-level of less than 100 km\n\u003C/li\u003E\n\u003Cli\u003E\nA \u003Ca href=\u0022https://en.wikipedia.org/wiki/Ramjet#Integral_rocket_ramjet.2Fducted_rocket\u0022 rel=\u0022external nofollow\u0022\u003ESolid Fueled Integrated Rocket Ramjet\u003C/a\u003E (basically a solid-fueled ramjet that initially operates as a solid-fueled rocket-booster, and once the rocket-portion has burned out, it\u0027s built up enough airspeed for the booster\u0027s casing to act as the duct of a now-air-breathing solid-fueled ramjet engine that can accelerate the vehicle the rest of the way up to the speed and altitude at which the above-mentioned liquid-fueled scramjet can take over the task of accelerating the payload to orbit.\n\u003C/li\u003E\n\u003C/ol\u003E\n"},{"CreatedByName":"Nich","CreatedById":145678,"CreatedDateTime":"2016-03-10T19:30:52Z","Content":"\n\u003Cp\u003E\nRelatively speaking a whiplash with a shock cone is a ram jet and rapier and a shockcone out perform most scram jets we currently have.  I was able to hit 1700 m/s mach 5.75  Fastest scram jet I have heard of can only hit mach 7 but it doesn\u0027t even work until mach 3.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-03-10T19:31:16Z\u0022 title=\u002203/10/2016 07:31  PM\u0022 data-short=\u00228 yr\u0022\u003EMarch 10, 2016\u003C/time\u003E by Nich\u003C/strong\u003E\n\u003C/span\u003E\n"}]}