{"TopicId":13386,"ForumId":32,"TopicTitle":"100 Years of Orbital Motion In The Kerbin System Simulated","CreatedByName":"illectro","CreatedById":763,"CreatedDateTime":"2012-06-28T18:16:41Z","PageNum":1,"Articles":[{"CreatedByName":"illectro","CreatedById":763,"CreatedDateTime":"2012-06-28T18:16:41Z","Content":"\n\u003Cp\u003EI just took a low quality Adaptive stepsize Runge-Kutta ODE solver and ran it against a model of the Kerbin system (including the sun). The step precision was set to 10^-7 and we normalized the coordinate system to the barycenter of the Kerbin system.\u003C/p\u003E\u003Cp\u003EEven using this primitive solver the simulation covered about 30 days of game time per second on my laptop (I\\\u0027m sick of uninformed people claiming that computing all the gravity forces is computationally impossible BTW). Using a better algorithm (say a higher order predictor-corrector method) would make this significantly faster. Somewhere down the line It\\\u0027d be nice to see a proper n-body gravity model added, there\\\u0027s no technical reason that makes this impossible, just a limit of dev resources.\u003C/p\u003E\u003Cp\u003EAs you can see the orbit of Minmus looks erratic but it\\\u0027s likely to be stable over long periods since the Hill\\\u0027s Sphere of the Kerbol-Kerbin system is about 136,000km. All those people having trouble reaching minmus are no doubt happy it\\\u0027s kept on rails \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\\\u0027ll probably make some more of these and do some commentary when I have\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/9zLEys597PY?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003E(BTW, DEVS, if you\\\u0027re planning on adding any new planets, I\\\u0027ll be happy to use my astro-Fu and tell you whether the proposed additions are stable).\u003C/p\u003E\n"},{"CreatedByName":"Talisman","CreatedById":1230,"CreatedDateTime":"2012-06-28T18:27:38Z","Content":"\n\u003Cp\u003EThat\\\u0027s very awesome! Have you experimented with adding a dominant gas giant body in the system? Or making a full system? Would that be possible with the current kerbal sun?\u003C/p\u003E\n"},{"CreatedByName":"illectro","CreatedById":763,"CreatedDateTime":"2012-06-28T18:31:20Z","Content":"\n\u003Cp\u003EOh sure, we can add anything to this model, it\\\u0027s just important that new bodies be far enough away from their neighbours not to mess up the long term stability.\u003C/p\u003E\n"},{"CreatedByName":"maltesh","CreatedById":17144,"CreatedDateTime":"2012-06-28T18:47:11Z","Content":"\n\u003Cp\u003ENifty. Was the Mun\\\u0027s orbit inclined by Minmus interaction in the simulation?\u003C/p\u003E\n"},{"CreatedByName":"illectro","CreatedById":763,"CreatedDateTime":"2012-06-28T18:54:29Z","Content":"\n\u003Cp\u003EYes the mun and geostationary satellite pick up a bit of inclination over time, and in turn minmus loses inclination to the mun - the system oscillates. I should really go and plot some parameters over time.\u003C/p\u003E\n"},{"CreatedByName":"PakledHostage","CreatedById":8059,"CreatedDateTime":"2012-06-28T19:48:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022illectro\u0022 data-cite=\u0022illectro\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI just took a low quality Adaptive stepsize Runge-Kutta ODE solver and ran it against a model of the Kerbin system (including the sun). The step precision was set to 10^-7 and we normalized the coordinate system to the barycenter of the Kerbin system.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENice work! How did you pick the initial conditions for the orbits? Does Minmus\\\u0027 orbit change noticeably if you use slightly different initial conditions?\u003C/p\u003E\n"},{"CreatedByName":"illectro","CreatedById":763,"CreatedDateTime":"2012-06-28T20:00:02Z","Content":"\n\u003Cp\u003EThe initial conditions were picked based on the values in the wiki, with the orbital velocity changed to account for both bodies mass. \u003C/p\u003E\u003Cp\u003EAnd yes, minmus is very sensitive to initial conditions, I should do a plot that shows how the orbits vary over time if I move it by a few metres.\u003C/p\u003E\n"}]}