{"TopicId":133933,"ForumId":34,"TopicTitle":"[1.1.2] Phoenix Industries ARES Rover (The Martian) WIP Release - v1.2","CreatedByName":"-ctn-","CreatedById":130898,"CreatedDateTime":"2016-03-10T18:56:45Z","PageNum":1,"Articles":[{"CreatedByName":"-ctn-","CreatedById":130898,"CreatedDateTime":"2016-03-10T18:56:45Z","Content":"\n\u003Cp\u003E\n\u003Cimg alt=\u0022HxD5gYb.gif\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/HxD5gYb.gif\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nHey everyone! Lots of people have been anxiously waiting for this mod. It\u0027s finally at a point where it\u0027s playable, and all the necessary features are working.\u003Cbr\u003E\u003Cbr\u003E\nThis is a manned rover, based off of the design in The Martian! Now you can re-create your own missions to Duna, or drive across the planet. It features several parts: Command Pod with lights and KIS storage, Battery with attached solar panels, \u0022flatbed\u0022 main frame with KIS storage, and \u0022trailer\u0022 optional frame. The included craft file is already put together for you, but if you do it yourself - the trailer attaches kind of funny to the back of the flatbed. It must be rotated right and I use the offset tool in the VAB to fine-tune it. The wheels will flip you if you brake hard, and I suggest setting the brake force to 100 on the front wheels, which I\u0027ve already done on the example craft.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Nrofj3O.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/Nrofj3O.jpg\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\nSome things to note:\u003Cbr\u003E\nThe crew capacity is only ONE right now, it will be bumped up to THREE at a later time, when I\u0027ve started working on the IVA.\u003Cbr\u003E\nThere is NO IVA yet.\u003Cbr\u003E\nThere are NO WHEELS yet. I guess the new KSP update (1.1) will rewrite the wheel modules, and I had a heck of a time getting them to work for me anyways. The stock wheels look great with it, and the model was originally made to scale with the stock TR-2 wheels.\u003Cbr\u003E\nThe IVA that the cabin uses is the MK1 pod. \u003Cbr\u003E\nThere is an example craft included!\n\u003C/p\u003E\n\u003Cp\u003E\n...I think that\u0027s all for now.\u003Cbr\u003E\nHopefully you enjoy it, and if you don\u0027t, please tell me why!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nI recommend using the mod \u003Cstrong\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/101928-105-kerbal-inventory-system-kis-125/\u0022 rel=\u0022\u0022\u003EKerbal Inventory System\u003C/a\u003E \u003C/strong\u003Ewith this, so you can take full advantage over the features. (Like storing extra life support supplies for those really long trips.)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Ca href=\u0022http://spacedock.info/mod/388/Phoenix%20Industries%20ARES%20Rover\u0022 rel=\u0022external nofollow\u0022\u003EDownload from SpaceDock!\u003C/a\u003E\u003C/strong\u003E\u003Cbr\u003E\u003Cstrong\u003E\u003Ca href=\u0022http://imgur.com/a/gyV1h\u0022 rel=\u0022external nofollow\u0022\u003EImgur Album showcasing delivery of Rover using KIS and USI Freight parts.\u003C/a\u003E\u003C/strong\u003E\u003Cbr\u003E\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nChangelog:\n\u003C/p\u003E\n\u003Cp\u003E\nv.1.2-\u003Cbr\u003E\n- Tested against 1.1.2\u003Cbr\u003E\n-Re-exported from Unity 5.\u003Cbr\u003E\n-Added flag-decal option on Cabin.\n\u003C/p\u003E\n\u003Cp\u003E\nv.1.1 -\u003Cbr\u003E\n-Re-orientated parts means NavBall shows correct orientation. (When driving, you see the horizon instead of UP.)\u003Cbr\u003E\n-Balanced cost and crash speeds in config files.\u003Cbr\u003E\n-\u003Cstrong\u003EMAY BREAK EXISTING CRAFTS\u003C/strong\u003E. New example craft is included. Put it in the SPH folder. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nv.1.0 -  Release!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp style=\u0022color:rgb(39,42,52);font-family:\u0027Helvetica Neue\u0027, Helvetica, Arial, sans-serif;font-size:14px;font-style:normal;font-variant:normal;font-weight:normal;letter-spacing:normal;line-height:22.4px;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;background-color:rgb(255,255,255);\u0022\u003E\n\u003Cstrong style=\u0022font-weight:bold;\u0022\u003ELicense:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022color:rgb(39,42,52);font-family:\u0027Helvetica Neue\u0027, Helvetica, Arial, sans-serif;font-size:14px;font-style:normal;font-variant:normal;font-weight:normal;letter-spacing:normal;line-height:22.4px;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;background-color:rgb(255,255,255);\u0022\u003E\n\u003Cimg alt=\u002288x31.png\u0022 src=\u0022https://i.creativecommons.org/l/by-nc-sa/4.0/88x31.png\u0022 style=\u0022vertical-align:middle;border:0px;\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022color:rgb(39,42,52);font-family:\u0027Helvetica Neue\u0027, Helvetica, Arial, sans-serif;font-size:14px;font-style:normal;font-variant:normal;font-weight:normal;letter-spacing:normal;line-height:22.4px;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;background-color:rgb(255,255,255);\u0022\u003E\n\u003Cstrong style=\u0022font-weight:bold;\u0022\u003ECreative Commons Attribution-NonCommercial-ShareAlike 4.0 International License\u003Cbr\u003E\u003Cbr\u003E\nAlso includes the following nifty flags:\u003C/strong\u003E\u003Cbr\u003E\u003Cimg alt=\u0022emLmbAA.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/emLmbAA.png\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022oxqHpJV.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/oxqHpJV.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\nExample craft and KIS containers set-up for a cargo rover:\u003Cbr\u003E\u003Cimg alt=\u0022vJljMAt.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/vJljMAt.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-04T18:17:30Z\u0022 title=\u002205/04/2016 06:17  PM\u0022 data-short=\u00228 yr\u0022\u003EMay 4, 2016\u003C/time\u003E by -ctn-\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"akron","CreatedById":116554,"CreatedDateTime":"2016-03-10T21:03:18Z","Content":"\n\u003Cp\u003E\nGrats on release. Any plans to combine these in one pack or one release thread?\n\u003C/p\u003E\n"},{"CreatedByName":"-ctn-","CreatedById":130898,"CreatedDateTime":"2016-03-10T21:05:04Z","Content":"\n\u003Cp\u003E\nThanks!\n\u003C/p\u003E\n\u003Cp\u003E\nI would like to keep them separate, as each mod will have its own issues and bugs, and it will be easier for me to keep track if they have their own threads. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Neutrinovore","CreatedById":72520,"CreatedDateTime":"2016-03-10T22:22:54Z","Content":"\n\u003Cp\u003E\nCool, gonna try this one out today!  \u003Cimg alt=\u0022:cool:\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 title=\u0022:cool:\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBTW, I had thought that the other \u0027The Martian\u0027 rover mod was yours, and I wasn\u0027t impressed with that one, so I apologize for thinking less than complimentary thoughts about what I thought was THIS mod... I hope that makes sense, lol.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"-ctn-","CreatedById":130898,"CreatedDateTime":"2016-03-10T22:34:52Z","Content":"\n\u003Cp\u003E\nThat makes sense, I had tried to keep this separate from his, but he named it the same thing and posted about his mod on my thread. I have nothing against him or his mod, but a lot of people were confused thinking that I made that one or that he made this one, which I don\u0027t like. I don\u0027t want to take credit for anyone else\u0027s work but my own. \n\u003C/p\u003E\n\u003Cp\u003E\nLet me know what you think of it when you use it!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEDIT: Also, someone\u0027s already pointed an issue out - the rover is horizontal in the VAB, so when you\u0027re driving it, the navball displays the blue sky and not the horizon. For those that use MechJeb or kOS, this will be an issue for steering. I will adjust it later, ideally all it should take is to reorient the cockpit in Unity and re-export. \n\u003C/p\u003E\n\u003Cp\u003E\nAnd while I\u0027m at it, I know the texture on the front of the cockpit looks a little funky - I\u0027ll fix that too. I just wanted to get the functionality down for release and then do art passes later. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-03-10T22:39:44Z\u0022 title=\u002203/10/2016 10:39  PM\u0022 data-short=\u00228 yr\u0022\u003EMarch 10, 2016\u003C/time\u003E by -ctn-\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Deimos Rast","CreatedById":157420,"CreatedDateTime":"2016-03-10T23:09:20Z","Content":"\n\u003Cp\u003E\nGrats on the (working) release. Smart move on the wheels, I was worried this would be sidelined because of that.\n\u003C/p\u003E\n\u003Cp\u003E\nDownloading now; should be fun.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Deimos Rast","CreatedById":157420,"CreatedDateTime":"2016-03-10T23:49:44Z","Content":"\n\u003Cp\u003E\nSo I looked through the configs out of curiosity and to make some adjustments, and here\u0027s a few points of feed back, mainly nitpicks, (obviously this a WIP release, but the goal is eventual balance, which is a subjective thing):\n\u003C/p\u003E\n\u003Cp\u003E\nCockpit:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nCrash tolerance of 9 seems a bit low and there isn\u0027t any breakingForce/Torque entries (not sure if the game has default values for these?), but seeing as the trailers have crash ratings of 80 (granted those are solid metal).\n\u003C/li\u003E\n\u003Cli\u003E\nvesselType = probe \u0026amp; RequiredTech = largeUnmanned; is it intentional that a manned rover follow unmanned tech requirements?\n\u003C/li\u003E\n\u003Cli\u003E\nOP states it uses Mk1 pod internals when it\u0027s actually the Mk1 lander cabin, unless \u0022landerCabinSmallInternal\u0022 is actually the mk1pod internals?\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nTrailer \u0026amp; Hitch\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nCost of $30 seems low given the higher priced entry costs\n\u003C/li\u003E\n\u003Cli\u003E\nTrailer Hitch\u0027s title reads \u0022ARES Trailer Flatbed\u0022 which I\u0027m assuming is a typo.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nBattery looked fine.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nNone of the above are major issues, but I figured someone would post them eventually, might as well be me\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, I\u0027ll probably make a TAC Life Support MM config for this, and if I do, I\u0027ll probably post it. Is there a certain number of days life support you think is fitting? TACLS will automatically add food and such to this, but my guess is it\u0027ll be only like 3 days (1 crew capacity currently, same as Mk1 pod), which seems low for such a contraption.\n\u003C/p\u003E\n\u003Cp\u003E\nOff to actually give it a spin!\n\u003C/p\u003E\n"},{"CreatedByName":"-ctn-","CreatedById":130898,"CreatedDateTime":"2016-03-11T00:26:53Z","Content":"\n\u003Cp\u003E\nAh, crap! I hate it when I make mistakes like that. Okay, here it goes:\n\u003C/p\u003E\n\u003Cp\u003E\nYes, 9m/s is way too low. I\u0027ll change it to something more suitable. Maybe 15-25m/s. \n\u003C/p\u003E\n\u003Cp\u003E\nYoure right, it doesn\u0027t belong in unmanned. I\u0027ll have to re do that. It should only operate if there\u0027s an astronaut inside. \n\u003C/p\u003E\n\u003Cp\u003E\nAnd yes, the internals are from the mk1 landing can, not the pod. \n\u003C/p\u003E\n\u003Cp\u003E\nI don\u0027t remember setting the cost that low, but that\u0027s too good a deal (surplus of trailers?!)\n\u003C/p\u003E\n\u003Cp\u003E\nThat is indeed, a typo. \n\u003C/p\u003E\n\u003Cp\u003E\nAbsolutely post any configs you make for it, I\u0027ll bundle them. I was thinking 3-5 days of supplies. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nLet me know what you think after you take it for a ride!\n\u003C/p\u003E\n"},{"CreatedByName":"-ctn-","CreatedById":130898,"CreatedDateTime":"2016-03-11T04:00:52Z","Content":"\n\u003Cp\u003E\nUpdated to v.1.1 to fix the above issues and the NavBall issue. Changelog is on the OP.\u003Cbr\u003E\u003Cbr\u003E\nImgur album for those that have trouble getting the Rover \u0022delivered.\u0022 I haven\u0027t found a good way to attach the trailer with KIS yet, but I\u0027ll work on it.\u003Cbr\u003E\u003Cbr\u003E\u003Ca href=\u0022http://imgur.com/a/gyV1h\u0022 rel=\u0022external nofollow\u0022\u003EImgur Album.\u003C/a\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-03-11T15:18:06Z\u0022 title=\u002203/11/2016 03:18  PM\u0022 data-short=\u00228 yr\u0022\u003EMarch 11, 2016\u003C/time\u003E by -ctn-\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Deimos Rast","CreatedById":157420,"CreatedDateTime":"2016-03-12T00:24:18Z","Content":"\n\u003Cp\u003E\nNote: I write this about the 1.0 version, haven\u0027t checked out the update yet. Also keep in mind I have no idea how to Rover\u003Cimg alt=\u0022:lol:\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_laugh.png\u0022 title=\u0022:lol:\u0022\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nAlright, I let Jeb give her a spin and the results were a bit mixed (partly because it was Jeb and also because I don\u0027t know what I\u0027m doing). I spent a fair bit of time on my back, but she was a trooper (battery kind of got wrecked though). Tires were the stock ones in the OP, they attached very nicely. The entire Rover looks great in the VAB and puts together well. Some thoughts and feedback in no particular order:\n\u003C/p\u003E\n\u003Cp\u003E\n- The biggest complaint I have is with the trailer, specifically the hitch (see screenshots below). No matter how you try, you can\u0027t get it flush with the Flatbed in front of it. I think this could be solved if you made the hitching post underneath flat instead of angled, because as it is now, you can\u0027t attach to it (unless you want to use the angling tools) without it coming out skewed. You can compensate by dropping down the wheels so everything at least has an even contact surface, but it still isn\u0027t flush on top. I was also disappointed that you hadn\u0027t magically discovered how to create a working ball and socket joint, but I suppose KSP is still KSP at the end of the day (Infernal Robotics maybe?). No biggie\u003Cimg alt=\u0022^_^\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_happy.png\u0022 title=\u0022^_^\u0022\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n- Lights could stand to be a tad brighter maybe; as it is, I can\u0027t see them in the VAB and only at night outside can I tell if they\u0027re on. Have you thought about adding Cabin Lights as well?\n\u003C/p\u003E\n\u003Cp\u003E\n- What about an attach node on the top of the rover cab? Sure, surface attach things work currently, but it would make the \u0022roof rack\u0022 concept a little more flexible. Might break up the lines/shape though.\n\u003C/p\u003E\n\u003Cp\u003E\n- Since I flipped a few times I noticed something: there is no included reaction wheel. It wouldn\u0027t be a misplaced feature (I know I\u0027ll add one regardless).\n\u003C/p\u003E\n\u003Cp\u003E\n- KIS: I don\u0027t know how it works exactly, but I think the way you have the configs written makes KIS a dependency of ARES to get the Cabin/Trailer to work. You could add a \u0022:NEEDS[KIS]\u0022 to the relevant module, and I think that would work, but it might not be a bad idea to make a separate MM config that adds KIS to the parts, that way people without it can use the rover without having to perform config surgery. Not a 100% sure on this one, but I figure I\u0027d mention it.\n\u003C/p\u003E\n\u003Cp\u003E\n- KIS: Inventory Size (volume) of 4000 in the cabin seems a bit generous (2000 also does as well, but that\u0027s a trailer). If you do change it, please don\u0027t change the X,Y layout, as I hate it when I\u0027m confined to a tiny little box (what you have now it great).\n\u003C/p\u003E\n\u003Cp\u003E\n- Handling was crisp and seemed relatively balanced (front to back) but I\u0027m not sure how much of that is the wheels. Braking too sharply was bad, which you never are supposed to do anyway (she titled forward).\n\u003C/p\u003E\n\u003Cp\u003E\nI forgot to check my COM before hand, but here\u0027s a screenshot of it after the fact. It seems a bit high, but I\u0027m not entirely sure what it should look like. Note: the battery weighs 2 tons, as does the trailer its sitting on, whereas the cabin itself is only 1 ton.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 height=\u0022296\u0022 src=\u0022http://i.imgur.com/BoHaM22.png\u0022 width=\u0022444\u0022 alt=\u0022BoHaM22.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nHere is a shot of the offending trailer hitch. My suggestion is making it smooth/level/flat/flush/whatever so I can attach the pin to it straight on (I hope that makes sense). It would effectively allow the trailer to down a couple of inches (or a few centimeters, take your pick).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 height=\u0022836\u0022 src=\u0022http://i.imgur.com/7RjA0M7.png\u0022 width=\u0022456\u0022 alt=\u00227RjA0M7.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOverall, I think you have a winner here. Does it come with a payment plan or roadside assistance?\n\u003C/p\u003E\n"},{"CreatedByName":"-ctn-","CreatedById":130898,"CreatedDateTime":"2016-03-12T00:39:49Z","Content":"\n\u003Cp\u003E\nWell, I\u0027m glad you liked it so much! The KIS storage is accurate to the volume of the parts. 1000 in KIS storage means 1 meter cubed. \n\u003C/p\u003E\n\u003Cp\u003E\nThe trailer thing... I know. I keep trying to brainstorm how to magically make it swivel or be easier to attach. The angled hitch \u0022hubs\u0022 are what the film showed, but I can change it to square like you recommended - that would work better!\n\u003C/p\u003E\n\u003Cp\u003E\nWould a manned rover actually have reaction wheels? I thought about it too, since assembling it with KIS meant the rover flipping onto its back because KIS likes to toss things you attach. \n\u003C/p\u003E\n\u003Cp\u003E\nI hadn\u0027t even thought of the cabin lights until I released the mod, it should be easy enough to put them in. \n\u003C/p\u003E\n\u003Cp\u003E\nDoes anyone else think the lights should be brighter? I was afraid of making them too bright. In the film, they didn\u0027t seem to be very bright either. \n\u003C/p\u003E\n"},{"CreatedByName":"LeoBlueSpikes","CreatedById":154660,"CreatedDateTime":"2016-03-12T00:41:54Z","Content":"\n\u003Cp\u003E\nIs this compatible with realism overhaul?\n\u003C/p\u003E\n"},{"CreatedByName":"-ctn-","CreatedById":130898,"CreatedDateTime":"2016-03-12T00:49:49Z","Content":"\n\u003Cp\u003E\nI\u0027m not sure, I\u0027ve never tried that mod. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nHeres a photo for reference of the brightness of the lights:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 src=\u0022http://caps.pictures/201/5-the-martian/full/the-martian-movie-screencaps.com-4293.jpg\u0022 alt=\u0022the-martian-movie-screencaps.com-4293.jp\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Deimos Rast","CreatedById":157420,"CreatedDateTime":"2016-03-12T03:11:03Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222453229\u0022 data-ipsquote-contentid=\u0022133933\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221457743314\u0022 data-ipsquote-userid=\u0022154660\u0022 data-ipsquote-username=\u0022LeoBlueSpikes\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, LeoBlueSpikes said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIs this compatible with realism overhaul?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt\u0027s a parts pack, so unless RO changes the \u0022ElectricCharge\u0022 resource (which, it might come to think of it, or Real Fuels might) it probably will work, since that\u0027s the only resource currently included.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/130898-ctn/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022130898\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/130898-ctn/\u0022\u003E@-ctn-\u003C/a\u003E This is probably a question you\u0027ll get a lot seeing as RO, or at least the Real Solar System mod, actually adds Mars. Next question will be: \u0022how well do your solar panels work on Mars/Duna?\u0022 (since the suns rays are weaker there and such).\n\u003C/p\u003E\n\u003Cp\u003E\nRe: Rx Wheels: I think the reaction wheel issue might be a gameplay compromise, since to my knowledge, stock (and most mods) don\u0027t have radially attaching reaction wheels, so unless you add one interally, the player is kind of hosed. If you want to compromise on a compromise, you could set it low. There is always the option of the player adding rcs thrusters, but that seems silly in my opinion with something this size. You could also add it as an optional MM config if you \u003Cem\u003Ereally\u003C/em\u003E wanted to distance yourself from it, heh. Options options.\n\u003C/p\u003E\n\u003Cp\u003E\nRe: the lights. I think that picture might be more hollywood being dramatic than an actual realistic shot, but yeah, your\u0027s look about like that. This one might be more to taste, since I\u0027m usually cranking up ambient lighting and slapping head lights on everything, so might be best to get additional input.\n\u003C/p\u003E\n\u003Cp\u003E\nOh, and I was right about the TAC Life Support: It automatically adds 3 days worth of food/water/oxygen to the rover, which is probably fine for now. When you add more capacity, I might bump it up to 5 or so (can\u0027t have anyone fighting over snacks!).\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, the \u0022vesselType = Probe\u0022 comment I made: I think that just means the rover would be classified as a Probe on the Map screen, which the player could change in game. It wouldn\u0027t give it the ability to be unmanned or anything (that would require both \u0022minimumCrew = 0\u0022 \u0026amp; \u0022CrewCapacity = 0\u0022 I believe).\n\u003C/p\u003E\n"},{"CreatedByName":"sp1989","CreatedById":105359,"CreatedDateTime":"2016-03-13T02:24:15Z","Content":"\n\u003Cp\u003E\nWhat happened to the wheels you made?\n\u003C/p\u003E\n"},{"CreatedByName":"-ctn-","CreatedById":130898,"CreatedDateTime":"2016-03-13T04:25:43Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222454643\u0022 data-ipsquote-contentid=\u0022133933\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221457835855\u0022 data-ipsquote-userid=\u0022105359\u0022 data-ipsquote-username=\u0022sp1989\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, sp1989 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhat happened to the wheels you made?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027m still working on them, but probably won\u0027t release them because of the new wheel modules in 1.1 won\u0027t be compatible. \n\u003C/p\u003E\n"},{"CreatedByName":"-ctn-","CreatedById":130898,"CreatedDateTime":"2016-03-31T12:38:40Z","Content":"\n\u003Cp\u003E\nIf anyone uses this mod and has the Beta 1.1 version of KSP installed, please let me know what bugs/issues you find with it. Thanks!\n\u003C/p\u003E\n"},{"CreatedByName":"Solospirit","CreatedById":10719,"CreatedDateTime":"2016-04-02T21:45:52Z","Content":"\n\u003Cp\u003E\nWorking fine so far using the provided sample rover...I did need, and probably still need, to fine tune the wheels a bit...But since these are stock and not part of your mod its fine.....also...one heck of a fun rover in 1.1...its very stable...and pretty fast, but it is twitchy and spins very easily...not a problem..a feature!! Tried to crash it, and its holding up fine...So thumbs up in 1.1 so far...Thank you \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n...This was in KSC in the 1174 release of 1.1...not tried it on another planet (yet) will up date if I find any issues.\n\u003C/p\u003E\n\u003Cp\u003E\nEdit\n\u003C/p\u003E\n\u003Cp\u003E\nI may just be bad at navigating my kerbal...but Poor Jeb got stuck in the front wheel when exiting for an EVA (had to move him around quite a bit to exit,...at one point he and the rover parted company...and both ended on their backs :)) Getting out was difficult...I have yet to be able to climb back in...I may be able to do it with a low g world or a gravity hack...but , with the wheels in place...you cant get to the ladder, and thus to the crew hatch...Im going to try it with landing legs instead of front wheels...try to see where the issue is.\n\u003C/p\u003E\n\u003Cp\u003E\nOkay...tried pretty much everyway I could think of...I cant get back inside (F to climb comes back up...but no where I can find gives me the B to board option) Jeb and I had fun trying tho \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022color:rgb(33,33,33);font-family:Roboto, RobotoDraft, Helvetica, Arial, sans-serif;font-size:14px;font-style:normal;font-variant:normal;font-weight:normal;letter-spacing:normal;line-height:20px;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;float:none;background-color:rgb(255,255,255);\u0022\u003E\u003Ca href=\u0022https://goo.gl/photos/RUxKrx5apP4suXAB8\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://goo.gl/photos/RUxKrx5apP4suXAB8\u003C/a\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022color:rgb(33,33,33);font-family:Roboto, RobotoDraft, Helvetica, Arial, sans-serif;font-size:14px;font-style:normal;font-variant:normal;font-weight:normal;letter-spacing:normal;line-height:20px;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;float:none;background-color:rgb(255,255,255);\u0022\u003ELast Edit...Just to make sure it was not me ...I loaded the rover up in a 1.0.5 instal...and had no issues with getting into or out of the rover at all...so very likely something did change in 1.1\u003C/span\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-04-02T23:47:35Z\u0022 title=\u002204/02/2016 11:47  PM\u0022 data-short=\u00228 yr\u0022\u003EApril 2, 2016\u003C/time\u003E by Solospirit\u003C/strong\u003E\n\u003Cbr\u003ETo add a comment\n\u003C/span\u003E\n"},{"CreatedByName":"-ctn-","CreatedById":130898,"CreatedDateTime":"2016-04-06T16:59:36Z","Content":"\n\u003Cp\u003E\nAh, bummer. Have any other mods had issues with hatches? I wonder what the problem is.\n\u003C/p\u003E\n"},{"CreatedByName":"Solospirit","CreatedById":10719,"CreatedDateTime":"2016-04-06T23:42:24Z","Content":"\n\u003Cp\u003E\nNot that I have ran into so far...I did test most of the other rover mods..all seem to work fine. Anything I can help with to give you a better idea of what is going on?\n\u003C/p\u003E\n"},{"CreatedByName":"Solospirit","CreatedById":10719,"CreatedDateTime":"2016-04-08T00:29:57Z","Content":"\n\u003Cp\u003E\nThe Buffalo from Angel-125 also seems to have the same issue...I just noticed it posted on his thread, and downloaded and tried it myself...very similar issue.\n\u003C/p\u003E\n"},{"CreatedByName":"Steel Dragon","CreatedById":160095,"CreatedDateTime":"2016-04-08T00:31:51Z","Content":"\n\u003Cp\u003E\n\u003Ciframe class=\u0022imgur-album\u0022 frameborder=\u00220\u0022 height=\u0022550\u0022 src=\u0022//imgur.com/a/uZLDq/embed?background=ffffff\u0026amp;text=1a1a1a\u0026amp;link=4e76c9\u0022 width=\u0022100%\u0022\u003E\u003C/iframe\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAny plans to get it working for 1.1 and if so do you have a time frame? Love the mod and I need a working rover!!!\u003Cbr\u003E\u003Cbr\u003E\nEnjoy some Eye Candy\n\u003C/p\u003E\n"},{"CreatedByName":"-ctn-","CreatedById":130898,"CreatedDateTime":"2016-04-08T00:39:02Z","Content":"\n\u003Cp\u003E\nYes, I plan on updating it to 1.1. However, it isn\u0027t even released to non-Steam users yet (which includes me) - so I wouldn\u0027t be able to give a timeframe. \n\u003C/p\u003E\n"},{"CreatedByName":"Solospirit","CreatedById":10719,"CreatedDateTime":"2016-04-08T00:55:39Z","Content":"\n\u003Cp\u003E\nPosted to the Buffalo thread...but this might help you also....\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022gXKiGBU.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/gXKiGBU.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI had just exited and Bill is hung in mid air from the ladder...not moved at all...with no options at that spot \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Solospirit","CreatedById":10719,"CreatedDateTime":"2016-04-13T14:56:34Z","Content":"\n\u003Cp\u003E\nBrowsing the forums..and keeping an eye out for any other reports of this issue. I found this in the pre release modding thread...if you have not seen it , it may help your troubleshooting when you get 1.1 \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ciframe data-embedcontent=\u0022\u0022 frameborder=\u00220\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/136510-airlockhatches-and-ladders-in-ksp-11-unity-524f1/\u0026amp;do=embed\u0022\u003E\u003C/iframe\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-04-13T14:56:59Z\u0022 title=\u002204/13/2016 02:56  PM\u0022 data-short=\u00228 yr\u0022\u003EApril 13, 2016\u003C/time\u003E by Solospirit\u003C/strong\u003E\n\u003C/span\u003E\n"}]}