{"TopicId":133919,"ForumId":18,"TopicTitle":"I\u0026#039;m curious.. Any dog trainers in the KSP forums?","CreatedByName":"SlabGizor117","CreatedById":135987,"CreatedDateTime":"2016-03-10T15:21:35Z","PageNum":1,"Articles":[{"CreatedByName":"SlabGizor117","CreatedById":135987,"CreatedDateTime":"2016-03-10T15:21:35Z","Content":"\n\u003Cp\u003E\nI\u0027ve picked up dog training as a hobby with The Koehler Method   (\u003Ca href=\u0022http://www.koehlerdogtraining.com/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.koehlerdogtraining.com/\u003C/a\u003E) and I\u0027d like to see if there\u0027s anyone around the KSP forums who does dog training too.  If I have an interest in something, one of my favorite things is to talk about it and discuss it, and I wanted to find someone who\u0027d like to do the same.\n\u003C/p\u003E\n\u003Cp\u003E\nSo yeah, anyone around here who does dog training too?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Tex Mechs Robot","CreatedById":83406,"CreatedDateTime":"2016-03-10T15:54:37Z","Content":"\n\u003Cp\u003E\nI haven\u0027t used this method. I am getting a Labrador puppy in about 2 months though and have been thinking about how to train him for apartment living. I\u0027ll look into this method as an option going forward. Do you have any experiences to share?\n\u003C/p\u003E\n"},{"CreatedByName":"SlabGizor117","CreatedById":135987,"CreatedDateTime":"2016-03-10T18:46:58Z","Content":"\n\u003Cp\u003E\nSure!  My experience with the Koehler Method has thoroughly convinced me that it\u0027s the best method there is for training a dog.  What impresses me about it is this:\n\u003C/p\u003E\n\u003Cp\u003E\nIf you haven\u0027t trained dogs before, you may not know this, but there are two schools of thought on it.  One is positive reinforcement, whose trainers believe it necessary to make training a game, and make it all fun.  It uses nothing but treats and praise for training.  The second is primarily aversive, or even balanced trainers, who use positive reinforcement as well as(as the Koehler Method book puts it), \u0022allowing the dog the birthright he shares with all of God\u0027s creatures, the right to the consequences of his own actions\u0022.  But beyond that, what really impresses me about the Koehler method is that he escaped the \u0022Us vs. Them\u0022  mentality and stepped back to look at the big picture and said, \u0022No, you\u0027re all wrong, this is how it should be\u0022.  That really impresses me to see that Bill Koehler(the author) stepped away from \u0022Us\u0022 AND \u0022Them\u0022 to do his own research and come to his own conclusions, without the bias of the \u0022I\u0027m right, you\u0027re wrong\u0022 attitude.  \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nFor example, i saw a positive reinforcement website complaining about aversive methods.  The scenario they gave was an aversive trainer teaching a dog to heel.  The dog sees someone else walking their dog and breaks the heel position to go see the dog.  The trainer then pops the leash to pull the dog back to the heel position to correct that.  The website then says, \u0022Now the dog has learned that bad things happen when there\u0027s a dog around\u0022.  First of all, that\u0027s one of the most degrading things to a dog\u0027s intelligence that I have ever heard, but that\u0027s another conversation.  The problem there, though, is that the dog learns what that leash pop was for when he breaks heel to go to just a person on a walk, or a car, going by.  \n\u003C/p\u003E\n\u003Cp\u003E\nFurthermore, I don\u0027t even agree that that\u0027s how you would correct a dog leading ahead out of the heel position, and this is what impresses me.  The correction for forging ahead is a right about turn and a run, that shows the dog, when he hits the end of the leash, \u0022Oh- the trainer went that way, I guess I\u0027ll have to stay next to m to be warned when he turns around so that that doesn\u0027t happen.\u0022  Now when you put the Koehler Method as a whole, focusing on each detail of it like this, up to the microscope, and you see the effect that it has, you can tell right away, that the right about turn, and every other detail of this method, was very meticulously thought out, with planning and no bias.  So. That\u0027s what I mean when I say that it impresses me to see someone say, \u0022No, you\u0027re all wrong\u0022, because it proves that their thinking is unbiased.\n\u003C/p\u003E\n\u003Cp\u003E\nSo if you\u0027re interested in learning more about the method, and training your dog with it, go to the Koehler website linked in the OP and check it out.  If you\u0027d like to buy the book, you\u0027ll have to look it up(The Koehler Method of Dog Training) on Amazon or eBay to buy, because it\u0027s unfortunately out of print.  There are a lot of 1 star reviews by misinformed Social Justice Warrriors who would sign a petition for the book to be banned, but most haven\u0027t even read it, so I promise you there\u0027s no validity to their argument.\n\u003C/p\u003E\n\u003Cp\u003E\nLet me know what you think, and if you have any questions, feel free to message me.  This post was written on mobile though, and I don\u0027t have the time to proofread it, so let me know if anything needs clarifying.\n\u003C/p\u003E\n\u003Cp\u003E\nThanks!\n\u003C/p\u003E\n"},{"CreatedByName":"Tex Mechs Robot","CreatedById":83406,"CreatedDateTime":"2016-03-10T18:58:56Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222451097\u0022 data-ipsquote-contentid=\u0022133919\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221457635618\u0022 data-ipsquote-userid=\u0022135987\u0022 data-ipsquote-username=\u0022SlabGizor117\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 minutes ago, SlabGizor117 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nLet me know what you think, and if you have any questions, feel free to message me.  This post was written on mobile though, and I don\u0027t have the time to proofread it, so let me know if anything needs clarifying.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027m amazed you wrote that on a mobile device lol. I stick to 140 characters when I\u0027m on mine!\n\u003C/p\u003E\n\u003Cp\u003E\nI did go to the website and it all seems to make a lot of sense really. I\u0027ve got tons of time to think about it. I likely won\u0027t buy the book because I don\u0027t have a ton of time to read. They recommended a DVD set though that interests me because of how closely they say it follows the book and the visual learning will be easier for me to jump in and out of over then next couple of months. The title is \u0022Back to Work\u0022 by Margot Woods. Have you seen this?\n\u003C/p\u003E\n"},{"CreatedByName":"SlabGizor117","CreatedById":135987,"CreatedDateTime":"2016-03-10T20:55:52Z","Content":"\n\u003Cp\u003E\nI do know \u003Cem\u003Eof\u003C/em\u003E it, but only through the website, same as you..  I haven\u0027t watched it.  So, unfortunately, I can\u0027t tell you whether it would have enough information for you to take from it and train your own dog.  Regardless, I would buy the book anyways, you can get it around $5-$10(assuming you\u0027re in the US, I don\u0027t know what it would be otherwise) on Amazon.  It\u0027s about 200 pages, not overly long, so I wouldn\u0027t be concerned about having time to read it.  My concern with the DVDs is that it may merely demonstrate, not teach, how to use the method.  I may be wrong, but there\u0027s also some very valuable information as to the nature and \u0022why\u0022 of the method in the first part, that isn\u0027t anything to do with training.  If you have time for the DVDs, you\u0027ll definitely have time for the book.  You could do either and get by well enough I suppose, but I enjoy Bill Koehler\u0027s writing style and it made it easier to read as a result.  Also, he makes a lot of very good, fascinating points in the book that may not be in the DVDs either.  But again, your choice.  Maybe the DVDs will be easier for you to learn visually, I don\u0027t know.\n\u003C/p\u003E\n\u003Cp\u003E\nAnlther thing, you talked about \u0022jumping in and out\u0022 of it, and I should tell you that if you plan to train your dog by this method, you\u0027ll need to dedicate 6 days a week for 13 weeks to training, and stick to the schedule so that the learning process doesn\u0027t have any breaks in it.  It\u0027s a big commitment, as the website says, but the payoff is immense.  The Koehler Method is the first method I\u0027ve seen that doesn\u0027t teach your dog to Heel, Sit, Down, Stand(and stay for those last three), and Come.\n\u003C/p\u003E\n\u003Cp\u003E\nThe Koehler Method teaches you and your dog how to have a fulfilling, close companionship, without contention, by \u003Cem\u003Eusing\u003C/em\u003E the \u0022Heel, Sit, Down, Stand, and Come\u0022 exercises.  It\u0027s not a method for teaching your dog to do these \u0022tricks\u0022 and \u003Cem\u003Emaybe\u003C/em\u003E you\u0027ll find use for it around the home, it\u0027s a method for bettering your relationship with your dog, and it is the most effective method for the latter I have ever seen.  The term \u0022well-trained\u0022 used in dog training classes, purebred dog ads, and adoption shelters, is a \u003Cstrong\u003Ejoke\u003C/strong\u003E.  One of the best quotes I\u0027ve ever heard in dog training is, \u0022No dog is fully trained until it can be trusted at liberty regardless of distractions.\u0022  And something I would like to add to those who would label dog training this involved and in-depth, a boot camp made to produce an army dog incapable of love, and at attention at all times:  Dog training is not a restriction of freedom, but a tool to allow the dog to enjoy it\u0027s \u003Cem\u003Eright\u003C/em\u003E to freedom without fear of consequences.  That is, if an untrained dog gets out of the backyard and runs away, it has taken its freedom and there will be consequences.  \u003Cem\u003ESo if you love your dog,\u003C/em\u003E you would train him to the point that he would, once again, enjoy his \u003Cem\u003Eright \u003C/em\u003Eto freedom;  Freedom of exploration, and freedom of the right to the consequences of his actions, both good and bad.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-03-10T21:07:10Z\u0022 title=\u002203/10/2016 09:07  PM\u0022 data-short=\u00228 yr\u0022\u003EMarch 10, 2016\u003C/time\u003E by SlabGizor117\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tex Mechs Robot","CreatedById":83406,"CreatedDateTime":"2016-03-10T21:15:21Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222451287\u0022 data-ipsquote-contentid=\u0022133919\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221457643352\u0022 data-ipsquote-userid=\u0022135987\u0022 data-ipsquote-username=\u0022SlabGizor117\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n13 minutes ago, SlabGizor117 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI do know \u003Cem\u003Eof\u003C/em\u003E it, but only through the website, same as you..  I haven\u0027t watched it.  So, unfortunately, I can\u0027t tell you whether it would have enough information for you to take from it and train your own dog.  Regardless, I would buy the book anyways, you can get it around $5-$10(assuming you\u0027re in the US, I don\u0027t know what it would be otherwise) on Amazon.  It\u0027s about 200 pages, not overly long, so I wouldn\u0027t be concerned about having time to read it.  My concern with the DVDs is that it may merely demonstrate, not teach, how to use the method.  I may be wrong, but there\u0027s also some very valuable information as to the nature and \u0022why\u0022 of the method in the first part, that isn\u0027t anything to do with training.  If you have time for the DVDs, you\u0027ll definitely have time for the book.  You could do either and get by well enough I suppose, but I enjoy Bill Koehler\u0027s writing style and it made it easier to read as a result.  Also, he makes a lot of very good, fascinating points in the book that may not be in the DVDs either.  But again, your choice.  Maybe the DVDs will be easier for you to learn visually, I don\u0027t know.\n\u003C/p\u003E\n\u003Cp\u003E\nAnlther thing, you talked about \u0022jumping in and out\u0022 of it, and I should tell you that if you plan to train your dog by this method, you\u0027ll need to dedicate 6 days a week for 13 weeks to training, and stick to the schedule so that the learning process doesn\u0027t have any breaks in it.  It\u0027s a big commitment, as the website says, but the payoff is immense.  The Koehler Method is the first method I\u0027ve seen that doesn\u0027t teach your dog to Heel, Sit, Down, Stand(and stay for those last three), and Come.\n\u003C/p\u003E\n\u003Cp\u003E\nThe Koehler Method teaches you and your dog how to have a fulfilling, close companionship, without contention, by \u003Cem\u003Eusing\u003C/em\u003E the \u0022Heel, Sit, Down, Stand, and Come\u0022 exercises.  It\u0027s not a method for teaching your dog to do these \u0022tricks\u0022 and \u003Cem\u003Emaybe\u003C/em\u003E you\u0027ll find use for it around the home, it\u0027s a method for bettering your relationship with your dog, and it is the most effective method for the latter I have ever seen.  The term \u0022well-trained\u0022 used in dog training classes, purebred dog ads, and adoption shelters, is a \u003Cstrong\u003Ejoke\u003C/strong\u003E.  One of the best quotes I\u0027ve ever heard in dog training is, \u0022No dog is fully trained until it can be trusted at liberty regardless of distractions.\u0022  And something I would like to add to those who would label dog training this involved and in-depth, a boot camp made to produce an army dog incapable of love, and at attention at all times:  Dog training is not a restriction of freedom, but a tool to allow the dog to enjoy it\u0027s \u003Cem\u003Eright\u003C/em\u003E to freedom without fear of consequences.  That is, if an untrained dog gets out of the backyard and runs away, it has taken its freedom and there will be consequences.  \u003Cem\u003ESo if you love your dog,\u003C/em\u003E you would train him to the point that he would, once again, enjoy his \u003Cem\u003Eright \u003C/em\u003Eto freedom;  Freedom of exploration, and freedom of the right to the consequences of his actions, both good and bad.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThanks for the insight. The \u0022jumping in and out of it\u0022 was referring to the next 2 months while I learn and prepare for the arrival of the puppy and not the actual training. I can see how that was misleading at first and you\u0027re absolutely right, the consistency during training is a HUGE factor.\n\u003C/p\u003E\n\u003Cp\u003E\nYou\u0027ve convinced me to get the book as well so maybe I can find a copy of it somewhere and use the DVD as a supplement to see the principles in action.\n\u003C/p\u003E\n"},{"CreatedByName":"SlabGizor117","CreatedById":135987,"CreatedDateTime":"2016-03-10T21:18:19Z","Content":"\n\u003Cp\u003E\nAhh, ok.  Yeah, consistency is a huge thing in dog training.  I\u0027m glad to see that you\u0027re gonna get the book too, you can find it on amazon pretty easily.  Like I said before, it should be around $5-$10 not including shipping.  I\u0027m glad to see you\u0027re interested, you\u0027ll have to let me know what you think of it as you read it.  I\u0027ll send you a friend request too, and if you ever have any questions, I\u0027d love to answer them.\n\u003C/p\u003E\n"},{"CreatedByName":"KaleDgs","CreatedById":207840,"CreatedDateTime":"2020-10-27T14:20:35Z","Content":"\n\u003Cp\u003E\nYou can also find a solution online like a training program or a dog training expert. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-10-27T18:11:37Z\u0022 title=\u002210/27/2020 06:11  PM\u0022 data-short=\u00223 yr\u0022\u003EOctober 27, 2020\u003C/time\u003E by KaleDgs\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Spacescifi","CreatedById":197504,"CreatedDateTime":"2020-10-27T20:46:12Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222451287\u0022 data-ipsquote-contentid=\u0022133919\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221457643352\u0022 data-ipsquote-userid=\u0022135987\u0022 data-ipsquote-username=\u0022SlabGizor117\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 3/10/2016 at 12:55 PM, SlabGizor117 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n One of the best quotes I\u0027ve ever heard in dog training is, \u0022No dog is fully trained until it can be trusted at liberty regardless of distractions.\u0022  And something I would like to add to those who would label dog training this involved and in-depth, a boot camp made to produce an army dog incapable of love, and at attention at all times:  Dog training is not a restriction of freedom, but a tool to allow the dog to enjoy it\u0027s \u003Cem\u003Eright\u003C/em\u003E to freedom without fear of consequences.  That is, if an untrained dog gets out of the backyard and runs away, it has taken its freedom and there will be consequences.  \u003Cem\u003ESo if you love your dog,\u003C/em\u003E you would train him to the point that he would, once again, enjoy his \u003Cem\u003Eright \u003C/em\u003Eto freedom;  Freedom of exploration, and freedom of the right to the consequences of his actions, both good and bad.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nProfound.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThat logic applies to humans as well.\n\u003C/p\u003E\n\u003Cp\u003E\nProbably the main difference between us and them is that they lack the faculty of conscience.\n\u003C/p\u003E\n\u003Cp\u003E\nSo thus the logic you said applies even more so to them.\n\u003C/p\u003E\n\u003Cp\u003E\nAs for humans, they often justify or make excuses for what they do, but it does not change the logic.\n\u003C/p\u003E\n"}]}