{"TopicId":134126,"ForumId":32,"TopicTitle":"The Space Kraken Still Lives","CreatedByName":"Walkerj","CreatedById":144114,"CreatedDateTime":"2016-03-13T22:19:08Z","PageNum":1,"Articles":[{"CreatedByName":"Walkerj","CreatedById":144114,"CreatedDateTime":"2016-03-13T22:19:08Z","Content":"\n\u003Cp\u003E\nHello everyone who is reading this. I would like to tell you about my recent encounter with the legendary space kraken.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nIn my opinion a lot of people nowadays who encounter this creature in the game do not come across it \u0022naturally\u0022. What I mean by this is that these people are usually messing around with mods (hyperedit is one of the most common ways the kraken is summoned). This kind of induced attack is not what I would call \u0022natural\u0022. My recent encounter; however, was completely natural.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nFor those of you who don\u0027t know about the kraken you should know that in games like ksp there are sometimes bugs. The kraken is a more specific type of bug. Based on what I can gather a normal bug is just something strange happening in a game for some reason. The kraken is a bug that is much more violent. A kraken attack can be classified by a bug or series of bugs that suddenly appear with little to no warning and often result in the total destruction of your craft in ksp. Often these series of bugs are quite interesting and strange. In the early game kraken attacks were quite common but as the game was developed further these because less frequent. One release (I can\u0027t remember which) after years of strange attacks the Devs announced that the kraken had finally been slain. To further emphasize their point they put a dead corpse of a kraken somewhere in the game (I won\u0027t say where to avoid spoilers). After this I saw no evidence that the kraken was still alive besides a video here or there where someone was messing around with hyperedit (which to be fair is just taunting this beast). For at least a year I would just encounter a normal bug here or there but nothing that really could be called the kraken. This all changed the day I wrote this post.\n\u003C/p\u003E\n\u003Cp\u003E\nI was testing an SSTO design that could go to the Mun\u0027s orbit and back. I got to the Mun, got into orbit, then came back to Kerbin. I aero braked once then went in for the final desent. I was trying to land at the KSC but I overshot so I turned around and flew back towards the runway by burning some on my left over fuel in my rapier engines. I lined up almost perfectly with the runway, throttled back my engines and pitched down to bring me onto the end of the runway. About 10 seconds before I would have touched down I saw a little puff of smoke fly by my plane. I remember thinking it was strange because normally when you see puffs of smoke like that you are much higher up and they are white or grey colored. This puff was black like the kind of smoke you get from explosions. I didn\u0027t hear any explosions and the puff was really small so I thought nothing of it. About 3 seconds later (7 to landing) I saw another puff of smoke that was much the same as the first one. At the same time the smoke left my screen I heard my jet engines dying and restarting in rapid succession but I saw no sparks and at this point my throttle was at 0 so it shouldn\u0027t have mattered. Immediately after this my plane started to yaw to the left quite hard. This all took place in the time of about 1 second. I was not hitting the yaw keys and my throttles were at 0 so there was no reason for this yaw to the left. At this point I knew something was very wrong. Sudden, off in the distance, the small fuel tanks off the front of the VAB and to the side of mission control exploded for no reason. My plane was in one piece so there was no reason those tanks should have exploded. At this time I was about 5 seconds from landing so I attempted to straighten my plane out so I could land. It was also at this time it dawned on me that this was the kraken. I was messing with no mods so this was a completely natural and unprovoked attack. As soon as I thought this there was a brief lag spike and at the end of it my plane was suddenly pointed straight up for no reason. After another brief lag spike the plane jerked again and was pointed in a slightly different direction. It was at this time I though to record this so I hit the pause button. My video should be live in a day or so so I will put the link to it in a comment on this post when it is done. My plane was too low to the ground to recover from the attack so I stalled and slammed into the ground. A large part of my plane survived (unfortunately the crew was killed) and after it came to a stop it suddenly shot forward, stopped against and then just sat there and vibrated until I reverted the flight.\n\u003C/p\u003E\n\u003Cp\u003E\nAs you can see, this attack from the space kraken was unprovoked so it proves the kraken still lives.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe areas above where my original post but some new stuff has happened. Specifically this happened again in almost the exact same way and this time the entire thing was caught on camera. Here is my video where it took place. If you are interested I just the bugs or the kraken watch the first 3 minutes and the last 5.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022true\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/BJ_9QHcby44?feature=oembed\u0022 width=\u0022480\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nNone, now how do I get rid of this box?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-03-19T13:31:36Z\u0022 title=\u002203/19/2016 01:31  PM\u0022 data-short=\u00228 yr\u0022\u003EMarch 19, 2016\u003C/time\u003E by Walkerj\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2016-03-14T03:38:04Z","Content":"\n\u003Cp\u003E\nWell, there\u0027s still the waterboarding kraken and the klaw kraken that I have to avoid most days. And 1.1 is only a few days away. So really, we\u0027re going to have to do all our kraken searches all over again very soon.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Tourist","CreatedById":143403,"CreatedDateTime":"2016-03-14T03:54:12Z","Content":"\n\u003Cp\u003E\nSquad says they have slain the Kraken.... but they would say that. What they don\u0027t tell you are they are really just its captors and its acolytes. They can\u0027t kill or tame the Kraken, they merely feed it code to keep it satiated. But sometimes, it isn\u0027t enough, for its hunger is as great as its visage is terrible. So, sometimes it reaches from its prison in the void to the cuisine it likes the best.... space vessels and the green souls that travel within.     \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-03-14T21:50:37Z\u0022 title=\u002203/14/2016 09:50  PM\u0022 data-short=\u00228 yr\u0022\u003EMarch 14, 2016\u003C/time\u003E by Tourist\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2016-03-14T04:21:22Z","Content":"\n\u003Cp\u003E\nBy the Dres...Reading the opening post was like watching a particular type of video on YouTube. A lot of words, little substance. Let me put it more succintly: Kraken lives. Beware. \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 src=\u0022http://fc04.deviantart.net/fs71/f/2012/178/1/9/release_the_kraken_by_florinu123-d5522bd.jpg\u0022 alt=\u0022release_the_kraken_by_florinu123-d5522bd\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SchweinAero","CreatedById":126909,"CreatedDateTime":"2016-03-14T06:00:42Z","Content":"\n\u003Cp\u003E\nThe \u0022legendary space kraken\u0022 was a very specific glitch caused by decreasing floating point precision as your ship flew away from the world origin. For all intents and purposes, that one is no more.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat you describe sounds like this instead:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/87315-random-destruction-of-wings/\u0026amp;page=3#comment-2186851\u0022\u003Ehttp://forum.kerbalspaceprogram.com/index.php?/topic/87315-random-destruction-of-wings/\u0026amp;page=3#comment-2186851\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Kinglet","CreatedById":58832,"CreatedDateTime":"2016-03-14T06:56:55Z","Content":"\n\u003Cp\u003E\nGigantor solar panels always get attacked by the kraken if you attach them to a beam made of the tiny cubic struts.\n\u003C/p\u003E\n"},{"CreatedByName":"Walkerj","CreatedById":144114,"CreatedDateTime":"2016-03-14T10:16:01Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222456016\u0022 data-ipsquote-contentid=\u0022134126\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221457929282\u0022 data-ipsquote-userid=\u002257622\u0022 data-ipsquote-username=\u0022Scotius\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, Scotius said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBy the Dres...Reading the opening post was like watching a particular type of video on YouTube. A lot of words, little substance. Let me put it more succintly: Kraken lives. Beware. \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022release_the_kraken_by_florinu123-d5522bd\u0022 class=\u0022ipsImage\u0022 src=\u0022http://fc04.deviantart.net/fs71/f/2012/178/1/9/release_the_kraken_by_florinu123-d5522bd.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThanks for the input. I wanted to give this as much detail as possible to make it easier to visualize. I will try to keep my posts shorter in the future if it is possible. Awesome picture.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2016-03-14T11:53:19Z","Content":"\n\u003Cp\u003E\nThere are still many bugs. Kraken attacks are usually not repeatable. I had some some time ago\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\n\u0022Hitting KSC\u0022 30km from it... (-\u0026gt; 1.0.2 iirc)\n\u003C/li\u003E\n\u003Cli\u003E\nReloading a save and finding yourself totally elsewhere (but reloading again and get it right) (-\u0026gt; yesterday)\n\u003C/li\u003E\n\u003C/ul\u003E\n"},{"CreatedByName":"rudi1291","CreatedById":138990,"CreatedDateTime":"2016-03-14T12:04:38Z","Content":"\n\u003Cp\u003E\nI´m getting a lot of those \u0022Crashing into KSC\u0022 things lately. The last time a few days ago while approaching the island runway with my shuttle, about 90km away from KSC...\n\u003C/p\u003E\n"},{"CreatedByName":"merlinux","CreatedById":83117,"CreatedDateTime":"2016-03-14T12:15:06Z","Content":"\n\u003Cp\u003E\nI had a weird one yesterday \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E I loaded KSP and switched to my base on the mun and then my karibou rover started flying and slowly pitching like if gravity was turned off. It then exploded destroying a huge bit of my base.  Turned off KSP due to anger. But when I turned it back on everything was normal.... oh dear.\n\u003C/p\u003E\n"},{"CreatedByName":"Brainlord Mesomorph","CreatedById":110905,"CreatedDateTime":"2016-03-14T12:58:30Z","Content":"\n\u003Cp\u003E\nIn \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/134030-corrupt-ships-or-a-corrupt-game-the-kraken-lives-at-the-ksc/\u0022\u003Eanother thread\u003C/a\u003E I have corrupt ship files that will half dissapperar and turn Kerbin into a digitized white ball if you load them\n\u003C/p\u003E\n\u003Cp\u003E\nThank God persistent backups! \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEDIT: In that thread I postulate that we bring some of these issues on ourselves, by encountering strange behavior and continuing anyway, instead of going back to a saved game or a saved ship.\n\u003C/p\u003E\n\u003Cp\u003E\nOP: tell me, did this plane act at all oddly in the SPH as you were building it?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222456319\u0022 data-ipsquote-contentid=\u0022134126\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221457957706\u0022 data-ipsquote-userid=\u002283117\u0022 data-ipsquote-username=\u0022merlinux\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n54 minutes ago, merlinux said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI had a weird one yesterday \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E I loaded KSP and switched to my base on the mun and then my karibou rover started flying and slowly pitching like if gravity was turned off. It then exploded destroying a huge bit of my base.  Turned off KSP due to anger. But when I turned it back on everything was normal.... oh dear.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nits not rage-quitting if it keeps KSP from autosaving a corrupt game.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-03-14T13:12:33Z\u0022 title=\u002203/14/2016 01:12  PM\u0022 data-short=\u00228 yr\u0022\u003EMarch 14, 2016\u003C/time\u003E by Brainlord Mesomorph\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2016-03-14T13:10:35Z","Content":"\n\u003Cp\u003E\nI forgot that in my last career game, I had a space station into Mun polar orbit. The station was quite simple, tanks, lab, pods, no clip, few parts, no engines. A classic \u0022first space station\u0022 to the Mun.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen I set it into orbit, I noticed the stations would start a very slow rotation, even after time warping. Cutting all reaction wheels would reduce the rotation, but not suppress it. As if the Kraken would tenderly play wit its tentacles... to anoy me.\n\u003C/p\u003E\n\u003Cp\u003E\nThen on rare occasion while arriving with a lander around the station, it would start a heavy wobble and destroy itseft as if the Kraken was chewing it...\n\u003C/p\u003E\n\u003Cp\u003E\nI finally decided to deorbit the station and bring a new one...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"merlinux","CreatedById":83117,"CreatedDateTime":"2016-03-14T13:44:19Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222456358\u0022 data-ipsquote-contentid=\u0022134126\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221457960310\u0022 data-ipsquote-userid=\u0022110905\u0022 data-ipsquote-username=\u0022Brainlord Mesomorph\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n48 minutes ago, Brainlord Mesomorph said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nits not rage-quitting if it keeps KSP from autosaving a corrupt game.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell I know what to do now heheh\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnd btw I havent used the klaw since .25 for fear to what it would do to my ships. I had a huge save completely infected of klaw bugs... It was like a virus any ship who had been in contact with it would randomly invoke the kraken upon themselves at some stage. Took me a long while to figure out it was the damn thing. Its a shame cause I would gladly use the part in my designs. would simplify a lot of things;)\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-03-14T13:50:44Z\u0022 title=\u002203/14/2016 01:50  PM\u0022 data-short=\u00228 yr\u0022\u003EMarch 14, 2016\u003C/time\u003E by merlinux\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2016-03-14T18:15:38Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222456413\u0022 data-ipsquote-contentid=\u0022134126\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221457963059\u0022 data-ipsquote-userid=\u002283117\u0022 data-ipsquote-username=\u0022merlinux\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 hours ago, merlinux said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAnd btw I havent used the klaw since .25 for fear to what it would do to my ships. I had a huge save completely infected of klaw bugs... It was like a virus any ship who had been in contact with it would randomly invoke the kraken upon themselves at some stage. Took me a long while to figure out it was the damn thing. Its a shame cause I would gladly use the part in my designs. would simplify a lot of things;)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI only know about two klaw bugs remaining. Klaw jitter, which destroys about 1 ship in 50. And planet deletion, which AFAIK is 100% repeatable; but you can always avoid with careful focus control.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-03-14T22:56:51Z\u0022 title=\u002203/14/2016 10:56  PM\u0022 data-short=\u00228 yr\u0022\u003EMarch 14, 2016\u003C/time\u003E by bewing\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"merlinux","CreatedById":83117,"CreatedDateTime":"2016-03-14T18:49:24Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222456792\u0022 data-ipsquote-contentid=\u0022134126\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221457979338\u0022 data-ipsquote-userid=\u0022154251\u0022 data-ipsquote-username=\u0022bewing\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n29 minutes ago, bewing said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI only know about two klaw bugs remaining. Klaw jitter, which destroys about 1 ship in 50. And planet deletion, which AFAIK is 100% repeatable; but you can always avoid with careful focus control.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI can still see my ships, stations, base modules etc, exploding and bending like crazy when time warping. This in a save  when I had almost conquered duna, using MKS.... oh dear nightmares....\n\u003C/p\u003E\n\u003Cp\u003E\nBut I trust you I am sure most of those bugs have been fixed. it was a long while ago. \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E I am still scared though \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"diggzakk","CreatedById":116618,"CreatedDateTime":"2016-03-15T10:59:49Z","Content":"\n\u003Cp\u003E\ndont know if my one was the kraken..\n\u003C/p\u003E\n\u003Cp\u003E\ni accepted some rescue missions, one was in kerbin orbit aprox 4mio meters (i call this ship D for now).. nothing special\n\u003C/p\u003E\n\u003Cp\u003E\nafter i make a manned mun landing ship C, and send a second mission with rescue ship B (due to lack of fuel) to mun with an additional satelite mission ship A, the satelite ship A was requested to be in orbit aprox 11,4m m right direct in mun transfer orbit around kerbin.. so with the satelite i used gravity assists to expand and move the orbit which brings me one time very close to the 4 mio meter ship D, finishing the satelite contract takes maybe a half kerbin orbit, maybe one full not sure.. then i switch to ship B to pick up the guy from ship C and burn home to kerbin.. after leaving SOI i recognize the strange thing on ship D, the \u0022to be rescued guy\u0022, he had a new orbit crashing into the mun surface, no chance to safe his life\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\ni am not sure this is a normal behavior, as if i understand it right the ship D should be on rails until i rendesvouz under 2000 meters and switch over to him (i didnt do it) but how this also change his orbit so devastating that he crash into the mun, i dont think i hit the ship by accident to change his path this strange way\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nkraken maybe?\n\u003C/p\u003E\n"},{"CreatedByName":"max_creative","CreatedById":159640,"CreatedDateTime":"2016-03-16T03:33:13Z","Content":"\n\u003Cp\u003E\nRocket spontaneously combusted along with the launch pad after coming out of time warp.\n\u003C/p\u003E\n\u003Cp\u003E\n(this is actually a pretty well known bug) I always blame this stuff on the kraken, and say \u0022oh no the kraken is angry\u0022 then I sacrifice a craft by smashing it into the mountains near the ksc, or shoot it with a mass relay. Once I have a Moho base (#2 on my to do list after landing on the mun) I plan to throw it into the mohole to keep the kraken happy \u003Cimg alt=\u0022:rolleyes:\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 title=\u0022:rolleyes:\u0022\u003E yeah I know, it\u0027s useless but it gives me something to do.\n\u003C/p\u003E\n"},{"CreatedByName":"Walkerj","CreatedById":144114,"CreatedDateTime":"2016-03-19T13:27:04Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222456104\u0022 data-ipsquote-contentid=\u0022134126\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221457935242\u0022 data-ipsquote-userid=\u0022126909\u0022 data-ipsquote-username=\u0022SchweinAero\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn March 14, 2016 at 2:00 AM, SchweinAero said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe \u0022legendary space kraken\u0022 was a very specific glitch caused by decreasing floating point precision as your ship flew away from the world origin. For all intents and purposes, that one is no more.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat you describe sounds like this instead:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/87315-random-destruction-of-wings/\u0026amp;page=3#comment-2186851\u0022\u003Ehttp://forum.kerbalspaceprogram.com/index.php?/topic/87315-random-destruction-of-wings/\u0026amp;page=3#comment-2186851\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou\u0027re right, this is very similar to my problem.\n\u003C/p\u003E\n"}]}