{"TopicId":134254,"ForumId":51,"TopicTitle":"On of those days.","CreatedByName":"Wolf Baginski","CreatedById":138549,"CreatedDateTime":"2016-03-15T16:00:52Z","PageNum":1,"Articles":[{"CreatedByName":"Wolf Baginski","CreatedById":138549,"CreatedDateTime":"2016-03-15T16:00:52Z","Content":"\n\u003Cp\u003E\nJeb was hammering at his typewriter with what seems to be enough energy to orbit a Mun-probe. He was muttering things as well. Gene peered anxiously around the office door, nodded slightly, and quietly walked away.\n\u003C/p\u003E\n\u003Cp\u003E\nWernher looked up from his desk. \u0022He is annoyed\u0022, he suggested. \u0022Well, I am not pleased, Gene. This should embarrass all of us.\u0022 Then he smiled slightly. \u0022But the verbal reports. It could have been a movie from the old days, something Buster Kerbal might have made.\u0022 He held a palm-up before Gene could comment. \u0022Not \u003Cem\u003EThe General\u003C/em\u003E, but perhaps \u003Cem\u003EThe Minmus Rover\u003C/em\u003E.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nGene stifled an urge to giggle.  \u0022Perhaps so,\u0022 he agreed. \u0022I think Bill is correct about the proximate cause. But nobody is admitting anything. Are we so terrible?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nWernher shrugged. \u0022We can afford to laugh. Nobody was hurt. And we learned a great deal from the mission. I expect you want it on your checklists.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nGene nodded. \u0022Rover parking brake set On.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022I was watching on the camera.\u0022 Wernher sighed. \u0022The deployment light came on. The Kerbal Standard Initiators fired. We had weight on wheels. It all looked so good from Mission Control. And then the Rover appeared, visibly accelerating, followed by four kerbals, running as fast as a kerbal can in Minmus gravity.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022I know\u0022, said Gene.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Somebody at the Kerbal Broadcasting Corporation has already sped up the tape and added a soundtrack.\u0022 He sighed. \u0022I have been earwormed.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Yackety Sax?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nThere was a long silence.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022It wasn\u0027t quite the science we expected,\u0022 said Gene, \u0022but it was science.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nWernher smiled. \u0022And it was funny, but I shall not say that to Jeb.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}