{"TopicId":134305,"ForumId":16,"TopicTitle":"How to get optimal descent angle?","CreatedByName":"HorusKol","CreatedById":117326,"CreatedDateTime":"2016-03-16T03:04:21Z","PageNum":1,"Articles":[{"CreatedByName":"HorusKol","CreatedById":117326,"CreatedDateTime":"2016-03-16T03:04:21Z","Content":"\n\u003Cp\u003E\nSo, I had yet another a ship break up in the water because I was still going too fast to deploy chutes almost right down to the surface.\n\u003C/p\u003E\n\u003Cp\u003E\nI was coming in from an AP of about 80 km, and a PE of about 35-40 km, which seems to have worked most of the time before (although, in hindsight, those successful attempts might have been anywhere up to 100km/30km AP/PE) - with pretty much the same ship (capsule, crew compartment with tourists, and a heatshield).\n\u003C/p\u003E\n\u003Cp\u003E\nSo I\u0027m wondering if there\u0027s a decent rule of thumb to follow for re-entry to make sure my vertical speed drops to below 250m/s with enough time (altitude) for my chutes to deploy and slow me to 6m/s.\n\u003C/p\u003E\n"},{"CreatedByName":"FullMetalMachinist","CreatedById":156531,"CreatedDateTime":"2016-03-16T04:05:59Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222459216\u0022 data-ipsquote-contentid=\u0022134305\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458097461\u0022 data-ipsquote-userid=\u0022117326\u0022 data-ipsquote-username=\u0022HorusKol\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n39 minutes ago, HorusKol said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSo I\u0027m wondering if there\u0027s a decent rule of thumb to follow for re-entry to make sure my vertical speed drops to below 250m/s with enough time (altitude) for my chutes to deploy and slow me to 6m/s.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nGenerally speaking the reentry angle has more to do with how much heat your ship can handle, and less to do with slowing your ship enough to deploy \u0027chutes.  If you\u0027re not burning up on reentry, then your angle is probably fine.  \n\u003C/p\u003E\n\u003Cp\u003E\nHowever, slowing down enough for \u0027chutes is more controlled by your ship design than any flight path (assuming you don\u0027t burn up).  And for that to get sorted out, it\u0027d really help to see a screenshot of your ship to see what the problem might be. In the mean time, I put together a little experiment going off of your (slightly vague) description of your ship and reentry profile. \n\u003C/p\u003E\n\u003Cp\u003E\nThis first album is a fairly \u0027normal\u0027 early career tourism craft.  While it needs a little help keeping the right orientation during parts of reentry, it\u0027s pretty straightforward.  Note in the 4th and 5th pics how I\u0027m using body lift to slow down my vertical decent.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ciframe class=\u0022imgur-album\u0022 frameborder=\u00220\u0022 height=\u0022550\u0022 src=\u0022//imgur.com/a/thnT9/embed?background=ffffff\u0026amp;text=1a1a1a\u0026amp;link=4e76c9\u0022 width=\u0022100%\u0022\u003E\u003C/iframe\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022line-height:1.6;\u0022\u003ENow this next album is the same exact ship (it\u0027s actually the same reentry, I loaded a quicksave), but I \u0022accidentally\u0022 let control get away from me, and wound up pointing prograde. This is generally a \u003C/span\u003E\u003Cu style=\u0022line-height:1.6;\u0022\u003E\u003Cem\u003Ebad thing\u003C/em\u003E\u003C/u\u003E\u003Cspan style=\u0022line-height:1.6;\u0022\u003E for slowing down, but I was still able to (barely) deploy my \u0027chute at the last second. In the first picture, I\u0027m still \u0022pulling up\u0022 to give me the same slowing benefit of body lift, it\u0027s just so little that you can\u0027t see the cyan lift vectors (note the small AoA on the navball).\u003C/span\u003E\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ciframe class=\u0022imgur-album\u0022 frameborder=\u00220\u0022 height=\u0022550\u0022 src=\u0022//imgur.com/a/TwA4y/embed?background=ffffff\u0026amp;text=1a1a1a\u0026amp;link=4e76c9\u0022 width=\u0022100%\u0022\u003E\u003C/iframe\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nThere are varying configurations of this basic design for early career craft. The ones you need to be really careful of are if you have two or more crew cabins stacked in line under the command pod. This makes it almost \u003Cem\u003Eimpossible\u003C/em\u003E to hold retrograde the whole time, and if you flip around makes it again almost impossible to slow enough for \u0027chutes.  In that case, I\u0027d suggest something like this:\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022f5wWSfj.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/f5wWSfj.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nUpside down heat shield on top (with an expendable nose cone to help on the way up, it\u0027ll burn up on the way down) and radial \u0027chutes on the bottom. Notice how it\u0027s inherently stable while pointing prograde because it has the heavy heat shield/command pod combo on top, with the big, light crew pods on bottom (like an arrow).  This way it\u0027ll \u003Cu\u003E\u003Cem\u003Ewant\u003C/em\u003E\u003C/u\u003E to point the blunt end of the heat shield to the front, which will help tons with slowing you down.  \n\u003C/p\u003E\n\u003Cp\u003E\nThese are just some of the \u0022general rules of thumb\u0022 for reentering crafts. For more specific advise, I\u0027d suggest uploading a screenshot of the ship that\u0027s causing you problems.\n\u003C/p\u003E\n"},{"CreatedByName":"AeroGav","CreatedById":152027,"CreatedDateTime":"2016-03-16T07:34:13Z","Content":"\n\u003Cp\u003E\n\u003Cimg alt=\u00222016-01-26_00004_zpsekxx9d1k.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022564\u0022 src=\u0022http://i1144.photobucket.com/albums/o492/narostel/2016-01-26_00004_zpsekxx9d1k.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI ran into this problem too, especially on the \u0022take tourists on suborbital flight\u0022 missions where you come in very steep.   If you can put aerodynamic surfaces on,  you can fly a positive angle of attack and generate body lift , and also drag.    The problem is that in a conventional rocket layout,  fins on the crew re-entry vehicle will be right at the top of the rocket, making the complete launch vehicle aerodynamically unstable.\n\u003C/p\u003E\n\u003Cp\u003E\nI got my fins lower down in the vehicle by putting the upper stage fuel tanks above the kerbally bits in the stack.    The fins are therefore about halfway up the complete launchpad assembly,  close to the CG,  and can be overcome by more fins on the very bottom of the lower stage.  \n\u003C/p\u003E\n\u003Cp\u003E\n Instead of putting everything in line I suppose i could have made the lower stage in the form of two side by side boosters strapped to the upper, but there would be increased drag from the extra frontal area.   The inline design was plenty stable as it was, needed a good bit of nudging to gravity turn. \n\u003C/p\u003E\n"},{"CreatedByName":"Jaeleth","CreatedById":136435,"CreatedDateTime":"2016-03-16T09:05:47Z","Content":"\n\u003Cp\u003E\nWith AP at 80 and Pe at 30km your angle is a little steep, but that shouldn\u0027t be a problem... Unless you have an heavy, and aerodynamic, vessel. This way the aerobrake will be minimum until you reach lower layers of the atmosphere and, thus, burn up or, not burning up, you won\u0027t get below a safe speed for the chutes. Add aerobrakes in the rear end of the vessel and deploy them prior to enter atmosphere, it should work. If you feel necessary, add one or two drogue chutes to deploy before the real chutes. Also... Do not deploy all your chutes at the same time, do that gradually, this way, when they open, the stress on the structure won\u0027t be so big.\n\u003C/p\u003E\n\u003Cp\u003E\nIf, after all this, the ship is still breaking up, consider reinforcing the weakest parts with a strut or two...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-03-16T09:07:39Z\u0022 title=\u002203/16/2016 09:07  AM\u0022 data-short=\u00228 yr\u0022\u003EMarch 16, 2016\u003C/time\u003E by Jaeleth\u003C/strong\u003E\n\u003Cbr\u003EMisspell\n\u003C/span\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2016-03-16T15:12:15Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222459451\u0022 data-ipsquote-contentid=\u0022134305\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458119147\u0022 data-ipsquote-userid=\u0022136435\u0022 data-ipsquote-username=\u0022Jaeleth\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, Jaeleth said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWith AP at 80 and Pe at 30km your angle is a little steep\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nCommon misconception, that, sadly enough, gets repeated over and over on these forums as advice \u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E Choosing a flatter profile will make his problems worse, not better.\n\u003C/p\u003E\n\u003Cp\u003E\nA reentry right from the edge of the atmosphere with a periapsis timidly dipped into it will result in higher peak heat loading, higher peak G-forces, and steeper terminal trajecory than one that comes in from a higher apoapsis and a lower periapsis. Depending on your craft and the exact profile flown, it may even have higher total heat flux, too. It is extremely unsafe and should never be attempted unless flying spaceplanes.\n\u003C/p\u003E\n\u003Cp\u003E\nThe reason for this lies in vertical speed. On any given orbit, your vertical speed is lowest at the apses (where it flips direction), and highest halfways between them (where it flips its rate of change).\n\u003C/p\u003E\n\u003Cp\u003E\nNow, inside the atmosphere, there exist different regimes; some of which you want to be in, and some of which you don\u0027t want to be in. The upper reaches are an area you don\u0027t want to be in, because you experience a lot of heat load for pretty much no drag. Unscientifically speaking, heat scales linearly, drag scales exponentially with atmospheric density at constant speed. So as you go down further, your heat load only increases moderately, but your drag goes up sharply and slows you down much better. Therefore, the middle reaches of the atmosphere is where you really want to be at. Then, in the lower reaches, atmospheric density inreases so quickly that, even though the increasing drag still works in your favor, your craft\u0027s heat tolerances are simply exceeded. Therefore you don\u0027t want to be in the lower reaches either until you have slowed down.\n\u003C/p\u003E\n\u003Cp\u003E\nGoing back to vertical speed: imagine your apoapsis is at 70km, and you start with a timid periapsis of 40km. Where is your vertical speed the slowest? At your apses. So you immediately enter the upper reaches of the atmosphere at a very low vertical speed, which means you spend a really long time where you don\u0027t want to be. You rack up more and more heat without really slowing down for a while. When you approach your periapsis, you still aren\u0027t in the middle reaches, yet your vertical speed is already decreasing again. This goes until a point where you have, through sheer persistence, lost enough speed for things to flip. Suddenly, your periapsis starts falling away from you, while you\u0027re still 40 kilometers up and getting cooked hot for only moderate drag. Your vertical speed starts increasing, and you start losing altitude rapidly just as you enter the middle reaches where you really want to be. But you drop through them like a rock. Along comes the 20 kilometer mark where the atmospheric density really starts ramping up, and this is where you G-meter and your heating spikes up as your craft rams into the wall of air. Here, your forward motion is finally arrested properly, but potentially at the cost of sensitive parts that may not be able to bear that short, high peak. And unfortunately, you are now on a fairly steep trajectory downwards, because your vertical speed was allowed to climb so much beforehand. It may be okay if you have a lightweight craft, and are coming down over the ocean; but something heavier, or something approaching over land (especially the highlands) will simply not have the time to slow down enough for safe main chute deployment. So you better brought drogues - which, of course, are not available until a fair ways into the tech tree.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat if you started from a 100km periapsis, going towards a 25-30km periapsis? The highest vertical speed is halfway between the apses. That\u0027s where the upper reaches of the atmosphere are. You blitz through there, because you don\u0027t want to be there; they don\u0027t help you. Then, as you enter the middle of the atmosphere, with you periapsis somewhere around 25km and slowly sinking, you start leveling off naturally. You level off in a regime where there is ample drag, yet not enough heat to overwhelm your craft\u0027s tolerances. Pulling nice and steady, moderate G\u0027s, you slow down precisely in sync with your sink rate, and make a gentle and safe arc towards the surface that lets even heavier craft get a chance to pop their chutes.\n\u003C/p\u003E\n\u003Cp\u003E\nif you are flying a spaceplane, you can do the super flat profile because the spaceplane generates lift and can manually arrest its vertical speed in the middle reaches. In a capsule or similar non-lifting reentry vehicle, you need to rely on orbital mechanics to arrest your vertical speed for you so you have time to slow down. To do so, you need to go in steep enough to make things work. Thankfully, capsules generally have the benefit of ablative heat shields, and do not need to fear sustained heat loads (which sometimes kill spaceplanes that try to soak too much for too long).\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIf a 100km ap, 25km pe reentry does not allow the craft to slow down in time to open its chutes even over the ocean, however, then the craft has too high a ballistic coefficient (it is too aerodynamic for its weight), and it needs to either be fitted with airbrakes and/or drogue chutes, or redesigned entirely.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-03-16T15:18:41Z\u0022 title=\u002203/16/2016 03:18  PM\u0022 data-short=\u00228 yr\u0022\u003EMarch 16, 2016\u003C/time\u003E by Streetwind\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"HorusKol","CreatedById":117326,"CreatedDateTime":"2016-03-16T23:20:31Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222459275\u0022 data-ipsquote-contentid=\u0022134305\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458101159\u0022 data-ipsquote-userid=\u0022156531\u0022 data-ipsquote-username=\u0022FullMetalMachinist\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n19 hours ago, FullMetalMachinist said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222459275\u0022 data-ipsquote-contentid=\u0022134305\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458101159\u0022 data-ipsquote-userid=\u0022156531\u0022 data-ipsquote-username=\u0022FullMetalMachinist\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n19 hours ago, FullMetalMachinist said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThis first album is a fairly \u0027normal\u0027 early career tourism craft.  While it needs a little help keeping the right orientation during parts of reentry, it\u0027s pretty straightforward.  Note in the 4th and 5th pics how I\u0027m using body lift to slow down my vertical decent.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Ca href=\u0022#\u0022 rel=\u0022external\u0022\u003E \u003C/a\u003E \u003Cspan\u003EReveal hidden contents\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ciframe class=\u0022imgur-album\u0022 frameborder=\u00220\u0022 height=\u0022550\u0022 src=\u0022//imgur.com/a/thnT9/embed?background=ffffff\u0026amp;text=1a1a1a\u0026amp;link=4e76c9\u0022 width=\u0022100%\u0022\u003E\u003C/iframe\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nThese are just some of the \u0022general rules of thumb\u0022 for reentering crafts. For more specific advise, I\u0027d suggest uploading a screenshot of the ship that\u0027s causing you problems.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nYeah - that\u0027s pretty much my tourist taxi design there - and your strategy of using body lift is something that I seem to have been honing in on by trial and error. Even when going at high-speed with the flames, I\u0027ve angled my craft a little flatter than my retrograde velocity, and then more so as I start to slow down - this is all with SAS on, and Jeb seems to be able to hold it tight. Once I\u0027m not longer supersonic, I turn SAS off and let the craft tumble a bit more - but maybe I should try and just flatten my trajectory even more to get more lift.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway - successful return last night, though it was close as I was at 2,000 metres before I\u0027d slowed to 260 m/s. Might have more success now - thanks \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Jaeleth","CreatedById":136435,"CreatedDateTime":"2016-03-17T01:18:59Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222459732\u0022 data-ipsquote-contentid=\u0022134305\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458141135\u0022 data-ipsquote-userid=\u002298962\u0022 data-ipsquote-username=\u0022Streetwind\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n20 hours ago, Streetwind said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nCommon misconception, that, sadly enough, gets repeated over and over on these forums as advice \u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E Choosing a flatter profile will make his problems worse, not better.\n\u003C/p\u003E\n\u003Cp\u003E\nA reentry right from the edge of the atmosphere with a periapsis timidly dipped into it will result in higher peak heat loading, higher peak G-forces, and steeper terminal trajecory than one that comes in from a higher apoapsis and a lower periapsis. Depending on your craft and the exact profile flown, it may even have higher total heat flux, too. It is extremely unsafe and should never be attempted unless flying spaceplanes.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nToo shallow may kill you, ues, but so will too steep... And more frequently.\n\u003C/p\u003E\n\u003Cp\u003E\nYou forgot that choosing a flatter profile also means choosing a slower reentry speed, and speed is the real killer, as heat buildup is concearned. With a slower speed heat is not as much and temperature stabilizes at a point, if that point is below critical you may remain as long as you wish aerobraking.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022color:rgb(39,42,52);font-size:16px;background-color:rgb(255,255,255);\u0022\u003EWhen coming from higher Ap the reentry speed is higher too, \u003C/span\u003E\u003Cspan style=\u0022color:rgb(39,42,52);font-size:16px;background-color:rgb(255,255,255);\u0022\u003EI am not considering using engines for significant deceleration before reentry, of course.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAlthough yes, there is a balance between reentry angle and speed.\n\u003C/p\u003E\n\u003Cp\u003E\nActually, in Kerbin, with an heat shield, ( and even without one, on occasion) it is hard to really blow up on reentry. \n\u003C/p\u003E\n\u003Cp\u003E\nAnyway. Air brakes a heatshield and enough chutes, properly deployed, should even get an whole space station down on Kerbin without burning it. If anything, airbrakes are usefull for the final approach, anyway, before deploying chutes.\n\u003C/p\u003E\n\u003Cp\u003E\nI can\u0027t remember the last time I blew up anything on Kerbin, usually i set Ap at around 90km - 100km and Pe 50km.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, I just put it to the test...\n\u003C/p\u003E\n\u003Cp\u003E\nboth ap 80, pe 55 or ap100, pe 30 yielded the same results on a bullet-like vessel, that is an ftl400 tanks strapped to an heat shield, control gear and a chute, no fins, no airbrakes.\n\u003C/p\u003E\n\u003Cp\u003E\nboth didn\u0027t burn on atmos\n\u003C/p\u003E\n\u003Cp\u003E\nboth spent little ablator, the steeper angle worn less\n\u003C/p\u003E\n\u003Cp\u003E\nbut, and this was the question, terminal speed for both was high enough so that the chute could not be deployed, and both crashed due to that, actually terminal speed was ver close to each other at 3000m, the steeper angle was a little lower at the very end, but then again, it impacted terrain at a lower altitude than the shallower angle. Both impact speeds were subsonic.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nso... Final advice... Regardless of angle, do use airbrakes... Or fins... Or something that produces drag. Or simply, use heatshields as fins, at the rear, they will withstand huge reentry speeds and stabilize the ship like no other thing... Ugly, yes, but efficient, just think of an arrow, the front heatshield is the tip, the rear heatshields are the feathers...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-03-17T11:26:49Z\u0022 title=\u002203/17/2016 11:26  AM\u0022 data-short=\u00228 yr\u0022\u003EMarch 17, 2016\u003C/time\u003E by Jaeleth\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2016-03-17T01:26:45Z","Content":"\n\u003Cp\u003E\nIf you use canards (control surfaces up front), you can turn off your pod torque, turn SAS on retrograde, and walk away. You\u0027ll tumble out of control, because when you fly backwards, control surfaces have the opposite effect that SAS assumes they have -- so instead of stably pointing backwards, any perturbation will send you going sideways. And that is great for drag!\n\u003C/p\u003E\n\u003Cp\u003E\nAerodynamic surfaces are generally really powerful on re-entry, because there it\u0027s aerodynamic forces that you have to fight.\n\u003C/p\u003E\n\u003Cp\u003E\nAs for the Pe/Ap setting: this is really about heat, not about your speed at low altitude. Your speed below 10km is mostly about whether you can manage to maintain an attitude with sufficient drag -- i.e. can you point sideways, or at least flat-side-first (not pointy-end-first). Whether you melt on the way is much more complicated, indeed, but the OP didn\u0027t mention having an issue with that.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-03-17T01:37:17Z\u0022 title=\u002203/17/2016 01:37  AM\u0022 data-short=\u00228 yr\u0022\u003EMarch 17, 2016\u003C/time\u003E by numerobis\u003C/strong\u003E\n\u003C/span\u003E\n"}]}