{"TopicId":134320,"ForumId":44,"TopicTitle":"Harnassing the power of the big bang","CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-03-16T13:54:27Z","PageNum":1,"Articles":[{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-03-16T13:54:27Z","Content":"\n\u003Cp\u003E\nI have noticed lately that this group has sort of given way to alot of brain flatulance, so I thinks it time that I contributed.\n\u003C/p\u003E\n\u003Cp\u003E\nThe universe appears to be derived from a indescribable quantum singularity, at its origin is infinite energy density in spatial dimensions that are beyond definition. At the moment that this state begins to not be singular the overiding force in the universe is quantum gravity. While it is essentially impossible to see quantum gravity now, at that point in time particles (all non-massive) interacted with through massive waves that literally blew everything to itsy bitsy tiny non-massive pieces. Quantum gravity has been described as an entangled particle that interact via quantum interactions, the way I imagine this now is that the entangled particles interact randomly and so we are not able to control them; two far off particles interact creating an imaginary force between them.\n\u003C/p\u003E\n\u003Cp\u003E\nSo lets say that in 100 years from now we discovered the graviton and how to manipulate it. We can create 2 particles split them and force all the gravitational attractions, essentially accelerating the particles at the speed of light toward each other where they annihilate into perfect energy.\n\u003C/p\u003E\n\u003Cp\u003E\nSo we build a ship, two ships actually, and in the two ships are two plates, one fore each ship. To do this we attenuate quantum gravity so that it behaves \u0027normally\u0027 (the mechanism for doing this resides in some new fundemental boson we discover in 20 years). Each ship then has a solar array, a cannae drive with overly optimistic power conversions efficiency (1N/KW) and it is using the particles in space to accelerate. On the back of the array is an electromagnet that attaches to an interstellar probe, possibly manned. This new breed of minature humans can survive long term acceleration at 3g.\n\u003C/p\u003E\n\u003Cp\u003E\nSo we place these two ships in a opposed positions in orbit around the sun. at 4.5E10 meters 3g = 30 m/sec^2  30 = omega^2*r  = velocity^2/r  if 30 = v^2/4.5E10   1.35E12 = v2  V^2 = 10E6 or a million meters per second.\n\u003C/p\u003E\n\u003Cp\u003E\nAs the ships accelerate they generate centripetal force which causes ships to want to increase the semimajor axis of the orbit; however to counter then the engineers begin manipulating the quantum gravity between the two plates. The force is transmitted \u0027through\u0027 the sun with no perturbation, these are entangled interactions.\n\u003C/p\u003E\n\u003Cp\u003E\nOnce the maximum tolerable force is generated the distance between the plates is allowed to expand, so the ship moves beyond earths orbit and increases speed to 2E106 and just beyond mars to achieve 0.01c. Using a system of solar lenses placed through out the solar system on ships using the same device the suns output is focused on the accelerating ship. It then moves out to a distance beyond pluto (200AU) where it is moving at 0.1c.\n\u003C/p\u003E\n\u003Cp\u003E\nAt a point where the two ships have relativistic inertia in the direction of two opposed system the electromagnet releases the two ships and the head off to their two target worlds (assuming they have a massive stellar wind parachute that the deploy at some point to stop them). Once deployed the platform decelerates and recoils back to its initial orbit inside of mercury awaiting its next delivery.\n\u003C/p\u003E\n\u003Cp\u003E\nThis is an evolution of an old idea in which ships are chained together in an orbital circle, the problem with this idea is that the mass of the chains eventually results in an explosion of the centripetal restraining ring.\n\u003C/p\u003E\n\u003Cp\u003E\nThe idea assumes we can create structures of solar panels that are on the order of a gram per kilowatt and that can resist inertial forces several magnitudes better than structural materials now available.\n\u003C/p\u003E\n\u003Cp\u003E\nThere is a variant of this idea that uses captured solar gases to accelerate to relativistic velocities, but it takes 1000 time as long.\n\u003C/p\u003E\n"},{"CreatedByName":"wumpus","CreatedById":133850,"CreatedDateTime":"2016-03-16T14:12:21Z","Content":"\n\u003Cp\u003E\nLast I heard (20-30 years ago), somebody did harness \u0022big bang radiation - cosmic background radiation - universal 3K energy\u0022, but could only move the nanotech in one direction, not both.  Figuring out how to make a repeatable engine sounds like a massive break in conventional physics.\n\u003C/p\u003E\n\u003Cp\u003E\nThe other catch is that the energy involved is immensely small.  It would take vast collectors (in volume) to harness such things, solar cells or even sails would beat it by vast orders of magnitude (for going to Mars).  Expected uses are nanotech (just to make [re]powering the silly things vastly more convenient) or huge structures that travel between the stars (that otherwise wouldn\u0027t be powered by more reasonable things like solar or nuclear energy).\n\u003C/p\u003E\n"},{"CreatedByName":"peadar1987","CreatedById":81207,"CreatedDateTime":"2016-03-16T14:58:43Z","Content":"\n\u003Cp\u003E\nThat doesn\u0027t sound right. You\u0027d need a temperature gradient to get any sort of useful energy out, even linear motion requires an increase in kinetic energy.\n\u003C/p\u003E\n"},{"CreatedByName":"lugge","CreatedById":143343,"CreatedDateTime":"2016-03-16T14:58:48Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222459645\u0022 data-ipsquote-contentid=\u0022134320\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458136467\u0022 data-ipsquote-userid=\u0022107380\u0022 data-ipsquote-username=\u0022PB666\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, PB666 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI have noticed lately that this group has sort of given way to alot of brain flatulance, so I thinks it time that I contributed.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell, maybe you should just switch to another, more scientifc forum instead of a video game forum?\n\u003C/p\u003E\n"},{"CreatedByName":"HebaruSan","CreatedById":156657,"CreatedDateTime":"2016-03-16T15:25:44Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222459645\u0022 data-ipsquote-contentid=\u0022134320\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458136467\u0022 data-ipsquote-userid=\u0022107380\u0022 data-ipsquote-username=\u0022PB666\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, PB666 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nEach ship then has a solar array\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe force is transmitted \u0027through\u0027 the sun with no perturbation, these are entangled interactions.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI thought to maintain quantum entanglement, you had to avoid interacting with anything else. If you\u0027re using a solar panel for power, then you\u0027re interacting with photons from the sun. Wouldn\u0027t that break the entanglement?\n\u003C/p\u003E\n"},{"CreatedByName":"Steel","CreatedById":49317,"CreatedDateTime":"2016-03-16T15:34:00Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222459645\u0022 data-ipsquote-contentid=\u0022134320\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458136467\u0022 data-ipsquote-userid=\u0022107380\u0022 data-ipsquote-username=\u0022PB666\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, PB666 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI have noticed lately that this group has sort of given way to alot of brain flatulance, so I thinks it time that I contributed.\n\u003C/p\u003E\n\u003Cp\u003E\nThe universe appears to be derived from a indescribable quantum singularity, at its origin is infinite energy density in spatial dimensions that are beyond definition. At the moment that this state begins to not be singular the overiding force in the universe is quantum gravity. While it is essentially impossible to see quantum gravity now, at that point in time particles (all non-massive) interacted with through massive waves that literally blew everything to itsy bitsy tiny non-massive pieces. Quantum gravity has been described as an entangled particle that interact via quantum interactions, the way I imagine this now is that the entangled particles interact randomly and so we are not able to control them; two far off particles interact creating an imaginary force between them.\n\u003C/p\u003E\n\u003Cp\u003E\nSo lets say that in 100 years from now we discovered the graviton and how to manipulate it. We can create 2 particles split them and force all the gravitational attractions, essentially accelerating the particles at the speed of light toward each other where they annihilate into perfect energy.\n\u003C/p\u003E\n\u003Cp\u003E\nSo we build a ship, two ships actually, and in the two ships are two plates, one fore each ship. To do this we attenuate quantum gravity so that it behaves \u0027normally\u0027 (the mechanism for doing this resides in some new fundemental boson we discover in 20 years). Each ship then has a solar array, a cannae drive with overly optimistic power conversions efficiency (1N/KW) and it is using the particles in space to accelerate. On the back of the array is an electromagnet that attaches to an interstellar probe, possibly manned. This new breed of minature humans can survive long term acceleration at 3g.\n\u003C/p\u003E\n\u003Cp\u003E\nSo we place these two ships in a opposed positions in orbit around the sun. at 4.5E10 meters 3g = 30 m/sec^2  30 = omega^2*r  = velocity^2/r  if 30 = v^2/4.5E10   1.35E12 = v2  V^2 = 10E6 or a million meters per second.\n\u003C/p\u003E\n\u003Cp\u003E\nAs the ships accelerate they generate centripetal force which causes ships to want to increase the semimajor axis of the orbit; however to counter then the engineers begin manipulating the quantum gravity between the two plates. The force is transmitted \u0027through\u0027 the sun with no perturbation, these are entangled interactions.\n\u003C/p\u003E\n\u003Cp\u003E\nOnce the maximum tolerable force is generated the distance between the plates is allowed to expand, so the ship moves beyond earths orbit and increases speed to 2E106 and just beyond mars to achieve 0.01c. Using a system of solar lenses placed through out the solar system on ships using the same device the suns output is focused on the accelerating ship. It then moves out to a distance beyond pluto (200AU) where it is moving at 0.1c.\n\u003C/p\u003E\n\u003Cp\u003E\nAt a point where the two ships have relativistic inertia in the direction of two opposed system the electromagnet releases the two ships and the head off to their two target worlds (assuming they have a massive stellar wind parachute that the deploy at some point to stop them). Once deployed the platform decelerates and recoils back to its initial orbit inside of mercury awaiting its next delivery.\n\u003C/p\u003E\n\u003Cp\u003E\nThis is an evolution of an old idea in which ships are chained together in an orbital circle, the problem with this idea is that the mass of the chains eventually results in an explosion of the centripetal restraining ring.\n\u003C/p\u003E\n\u003Cp\u003E\nThe idea assumes we can create structures of solar panels that are on the order of a gram per kilowatt and that can resist inertial forces several magnitudes better than structural materials now available.\n\u003C/p\u003E\n\u003Cp\u003E\nThere is a variant of this idea that uses captured solar gases to accelerate to relativistic velocities, but it takes 1000 time as long.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nFrom what I\u0027m seeing, you\u0027re confusing quantum gravity, which is a legitimate field trying to consolidate the results of QM and GR, with some completely new and completely fictional force that will achieve your idea\n\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-03-16T18:11:15Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222459747\u0022 data-ipsquote-contentid=\u0022134320\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458141944\u0022 data-ipsquote-userid=\u0022156657\u0022 data-ipsquote-username=\u0022HebaruSan\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, HebaruSan said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI thought to maintain quantum entanglement, you had to avoid interacting with anything else. If you\u0027re using a solar panel for power, then you\u0027re interacting with photons from the sun. Wouldn\u0027t that break the entanglement?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell that is quantum entanglement of photons or electrons, this is quantum entanglement of gravitons. Yes and I know this is pushing what is known well off the edge of fantasy, but its no  more fantastic than some of the crap that has been presented here lately.\n\u003C/p\u003E\n\u003Cp\u003E\nBasic idea is that every quantum of energy in the universe is entangled with other quanta of energy and the graviton is the force mediating particle our device then mediates that force, it basically tells the particles they can only exchange force with other particles on the other plate (sometimes).\n\u003C/p\u003E\n\u003Cp\u003E\nAccording to what I have read (ignoring what I have said because I believe we know absolutely nothing about gravitons) that at the quantum level gravity is spontaneously communicated via spontaneous quantum wormholes (comparable to quantum entanglement of photons and electrons). This means that the communication events are all but random, but over scale they appear uniform (law of mass action applied to physics)  they are close to quantum scale episodic.\n\u003C/p\u003E\n\u003Cp\u003E\nSo the idea of the device is that we can control the when and the with whom. Obvlously we cannot, as this violates uncertainty principle, but even with uncertainty you can manipulate, for example I can broaden a reflect incident beam to get a more uniform wavelength of light. Or I can allow the frequency to broaden and get a slight more focused beam of light. So the assumption of the device is that we cannot control all the gravitons, but we can steer the gravitons toward interacting with certain other particles.\n\u003C/p\u003E\n\u003Cp\u003E\nSo how might our fantasy device do this. Suppose you could create matter, now suppose we can create matter antimater pairs, we create matter proton and anti-proton, and also electron and positron. For each event we feed the anti-electron to anti-proton and vice versa. These hydrogen and anti-hydrogen are used in a fusion reacton, a reactor and anti-reactor to build lithium, which is used finally to build iron and anti-iron. So now all the original products are paired and have a single common origin. The iron in both plates is heavily magnetized so that the plates are held within a magnetic device that is completely evacuated.  So the assumption here is that the gravitons are tuned to the original source of energy, so when pairs are created they share and interesting graviton force, and what we are doing in keeping their memory of that common origin.\n\u003C/p\u003E\n\u003Cp\u003E\nSo the bugs in this system, if such an interesting attraction can be created, then we have the ability to control that interaction, if the interaction exists between the plates then it always exists, which means that if it can pull the two devices together at 30 m/s2 then we have to repel that force all the time while omega^2 r is less than 30 m/s^2. When your in solar orbit thats a hell of alot of dV. But what you could do is to keep the plates at say 100 meters and begin spinning them until they are have a centripetal accelaration of 3g, then add energy to their rotational velocities (such as using a wire) until they are very far apart still pulling 3g * mass, this position would be normal relative to earths orbit about the sun and the orbits would be changed so they are pushed anti-normal into a orbit within mercuries orbit, as energy is added the plates separate, the force declines and more energy can be added.\n\u003C/p\u003E\n\u003Cp\u003E\nThe second bug in the system, the energy of the big bang may be partial, energy may have come from alternative sources such as dark energy and each photon that is created to create a pair, the unitized gravaton may represent very tiny fractional energies, so that each gravitationally entangled pair is a complex arrangment of gravitons with have attractions with energy elsewhere in this case the specific pair in the plate/antiplates may be very tiny.\n\u003C/p\u003E\n\u003Cp\u003E\nThe third bug that comes out of the first, when the interstellar ships are released there is no way to stop the plates from spiralling into each other, since the mass they were holding together is now gone, the plates will immediately pull to a fraction of the final radius, in doing so they will accelerate close to the speed of light, any attempt to slow them down would result in gravitational collapse. This shows a problem because gravitons acting in this way would violate conservation of energy. Because their force stays constant no matter how far you pull them apart or push them together. When I stretch the plates apart and the cohesion is still 3g I am basically stealing energy from the vacuum.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222459669\u0022 data-ipsquote-contentid=\u0022134320\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458137541\u0022 data-ipsquote-userid=\u0022133850\u0022 data-ipsquote-username=\u0022wumpus\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, wumpus said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nast I heard (20-30 years ago), somebody did harness \u0022big bang radiation - cosmic background radiation - universal 3K energy\u0022, but could only move the nanotech in one direction, not both.  Figuring out how to make a repeatable engine sounds like a massive break in conventional physics.\n\u003C/p\u003E\n\u003Cp\u003E\nThe other catch is that the energy involved is immensely small.  It would take vast collectors (in volume) to harness such things, solar cells or even sails would beat it by vast orders of magnitude (for going to Mars).  Expected uses are nanotech (just to make [re]powering the silly things vastly more convenient) or huge structures that travel between the stars (that otherwise wouldn\u0027t be powered by more reasonable things like solar or nuclear energy).\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat\u0027s not the big bang, that\u0027s the big cool, that is the energy of deionization and ionization energy comes from pair production. Which is way, way after the big bang. The big bang is the moment of inflation, you can extend that to the point in which electromagnetism and weak nuclear force separate.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-03-16T18:28:35Z\u0022 title=\u002203/16/2016 06:28  PM\u0022 data-short=\u00228 yr\u0022\u003EMarch 16, 2016\u003C/time\u003E by PB666\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-03-16T18:44:56Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222459719\u0022 data-ipsquote-contentid=\u0022134320\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458140323\u0022 data-ipsquote-userid=\u002281207\u0022 data-ipsquote-username=\u0022peadar1987\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, peadar1987 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThat doesn\u0027t sound right. You\u0027d need a temperature gradient to get any sort of useful energy out, even linear motion requires an increase in kinetic energy.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nRight, therefore the solar panels have to be incredibly light. There is energy in hv from the sun, but the problem is to get to 0.1c in means that the power conversion rate of a kg of solar panel has to be great or the riders are willing to wait a very very long time.\n\u003C/p\u003E\n\u003Cp\u003E\n0.1c  = 3E7 m/s\n\u003C/p\u003E\n\u003Cp\u003E\nKE = 3E14 joules/kg mass (we actually need several times this because ejection energy is going to be magnitudes more than this), so lets say it takes a year or 3.2E7 seconds. So then each kg of solar panel needs to make 3E7 = 30000 kw. So at Mercuries orbit its about 10 times as much sun as the surface of the earth or 13kw per meter, so that a kilogram of solar panel needs to spread over 2307 meters. So for example the solar panels that I made for demo here were 10x100 meters, each of those would way about 0.4 kg AND resist 3 g of force AND stay facing the sun. At the current idealized efficiency and disregarding g-forces on the panels it would take 2307 years to accelerate assuming we could maintain mercurial insolance. The reality of course is that to use reaction mass to reach 0.1c one needs a tremdous ejection mass energy relative to ship energy, 100:1 so it would take 230,000 and solar efficiencies are not ideal, and you have structural and electrical mass so a million years. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2016-03-17T19:14:28Z","Content":"\n\u003Cp\u003E\nFirst things first: clearing up misunderstandings: \u0022centripetal force\u0022 means \u0022whatever force is pulling the object toward the middle so it goes in a circle\u0022 - in this case, gravity. In a rotating reference frame such as that of an orbiting spaceship, the force that makes it resist gravity and push itself out to higher orbits is \u003Cem\u003Ecentrifugal\u003C/em\u003E force. When high-school physics teachers say it isn\u0027t real, they mean it isn\u0027t being generated via work and is not one of the fundamental forces, not that it should be called \u0022centripetal\u0022 force instead. \u0022Centrifugal\u0022 is indeed the correct term, and the force acts real enough regardless of what the physics teachers say about it. \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSo anyway. If I understand the setup correctly, we\u0027re putting two ships near each other and gravitationally connecting them via what amounts to a wormhole. When they are moved apart, the distance between them in normal space increases, but the strength of the gravitational force does not decrease, producing huge amounts of free potential energy.\u003Cbr\u003E\nMy gut tells me this shouldn\u0027t work, and my reasoning is thus: It\u0027s best to not think of entanglement and its related phenomena as traveling through space in the conventional sense. Rather, when particles are entangled, they effectively create a tiny wormhole between themselves through which they can transmit information (ideally, anyway. IRL there are obstacles to this, but let\u0027s ignore them for now). Wormholes are structures made of space; from the reference frame of an outside observer, the particles are separated by a large distance in normal space, but from the reference frame of either particle, the distance between them, using the wormhole, is minuscule. Thus they can exert large forces on one another and communicate rapidly. However, this also means that any and all large forces they exert will be exerted \u003Cem\u003Ethrough the wormhole\u003C/em\u003E (with or without Morgan Freeman) - not around it. Around it, those forces have to slog through regular space. Following?\u003Cbr\u003E\nSo applying this to the spaceships, they produce a gravitational attraction through a tiny wormhole, then move apart. The attraction continues to pull through the wormhole, causing both ships to \u0022want\u0022 to squeeze themselves into the wormhole and meet each other. Effectively, the wormhole end on each ship is pulling the ship into it via gravity transmitted through from the other ship. It\u0027s gravitationally equivalent to a tiny black hole in the ship, pulling the ship into itself. While this does generate a significant force on the ship, this force isn\u0027t reactionless any more than anything else. If the wormhole end is a sphere, nothing happens; if the force is directed in a particular direction, then when the wormhole end pulls the ship in one direction, it will pull itself in the opposite direction, resulting in no net motion. The mass of the wormhole itself is insignificant; a heavy wormhole would move less, and a light one would move more, but the total force on the system remains zero, both for the pair of ships and for each ship and wormhole end individually.\n\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-03-18T02:53:19Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222461573\u0022 data-ipsquote-contentid=\u0022134320\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458242068\u0022 data-ipsquote-userid=\u0022101649\u0022 data-ipsquote-username=\u0022parameciumkid\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, parameciumkid said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nFirst things first: clearing up misunderstandings: \u0022centripetal force\u0022 means \u0022whatever force is pulling the object toward the middle so it goes in a circle\u0022 - in this case, gravity. In a rotating reference frame such as that of an orbiting spaceship, the force that makes it resist gravity and push itself out to higher orbits is \u003Cem\u003Ecentrifugal\u003C/em\u003E force. When high-school physics teachers say it isn\u0027t real, they mean it isn\u0027t being generated via work and is not one of the fundamental forces, not that it should be called \u0022centripetal\u0022 force instead. \u0022Centrifugal\u0022 is indeed the correct term, and the force acts real enough regardless of what the physics teachers say about it. \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSo anyway. If I understand the setup correctly, we\u0027re putting two ships near each other and gravitationally connecting them via what amounts to a wormhole. When they are moved apart, the distance between them in normal space increases, but the strength of the gravitational force does not decrease, producing huge amounts of free potential energy.\u003Cbr\u003E\nMy gut tells me this shouldn\u0027t work, and my reasoning is thus: It\u0027s best to not think of entanglement and its related phenomena as traveling through space in the conventional sense. Rather, when particles are entangled, they effectively create a tiny wormhole between themselves through which they can transmit information (ideally, anyway. IRL there are obstacles to this, but let\u0027s ignore them for now). Wormholes are structures made of space; from the reference frame of an outside observer, the particles are separated by a large distance in normal space, but from the reference frame of either particle, the distance between them, using the wormhole, is minuscule. Thus they can exert large forces on one another and communicate rapidly. However, this also means that any and all large forces they exert will be exerted \u003Cem\u003Ethrough the wormhole\u003C/em\u003E (with or without Morgan Freeman) - not around it. Around it, those forces have to slog through regular space. Following?\u003Cbr\u003E\nSo applying this to the spaceships, they produce a gravitational attraction through a tiny wormhole, then move apart. The attraction continues to pull through the wormhole, causing both ships to \u0022want\u0022 to squeeze themselves into the wormhole and meet each other. Effectively, the wormhole end on each ship is pulling the ship into it via gravity transmitted through from the other ship. It\u0027s gravitationally equivalent to a tiny black hole in the ship, pulling the ship into itself. While this does generate a significant force on the ship, this force isn\u0027t reactionless any more than anything else. If the wormhole end is a sphere, nothing happens; if the force is directed in a particular direction, then when the wormhole end pulls the ship in one direction, it will pull itself in the opposite direction, resulting in no net motion. The mass of the wormhole itself is insignificant; a heavy wormhole would move less, and a light one would move more, but the total force on the system remains zero, both for the pair of ships and for each ship and wormhole end individually.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBoth gravity and centripetal forces are faux forces. But they are useful in defining omega and indirectly velocity.\n\u003C/p\u003E\n\u003Cp\u003E\nThey radius has to be quite large because at 1g limit or 3g in this case v2/r = 30 therefore v = sqrt(30*r) so if you want to achieve a velocity are necessarily talikng about circum solar orbits, fairly large ones. \n\u003C/p\u003E\n\u003Cp\u003E\nInterms of wormholes, its quantum gravitational wormholes the effect of these interactions is to warp spacetime only around the plates, where as everything else reflects normal spacetime. Its like a warp drive but the field is only warped in one direction inside the ship. The controller determines what propprtion of the gravitons warpnspace around the othe plate and vice versa, versus random interactions.\n\u003C/p\u003E\n\u003Cp\u003E\nOf course getting quantum variation to stack in favor of an improbable event violates entropy, \n\u003C/p\u003E\n"},{"CreatedByName":"YNM","CreatedById":98447,"CreatedDateTime":"2016-03-18T15:19:05Z","Content":"\n\u003Cp\u003E\nManipulating gravity directly ? May as well you create a subspace...\n\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-03-18T23:53:10Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222462731\u0022 data-ipsquote-contentid=\u0022134320\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458314345\u0022 data-ipsquote-userid=\u002298447\u0022 data-ipsquote-username=\u0022YNM\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, YNM said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nManipulating gravity directly ? May as well you create a subspace...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSubspace has no meaning outside of sci-fi, you mean quantum tunneling I suspect.\n\u003C/p\u003E\n"},{"CreatedByName":"YNM","CreatedById":98447,"CreatedDateTime":"2016-03-19T05:16:56Z","Content":"\n\u003Cp\u003E\nNo, I really mean a subspace - a space that is unconnected to the other space. Like, say, you could say that the space inside an alcubierre drive to be a subspace because you can\u0027t interact with the world outside you (or outside the drive).\n\u003C/p\u003E\n"},{"CreatedByName":"Windspren","CreatedById":134441,"CreatedDateTime":"2016-03-19T05:33:42Z","Content":"\n\u003Cp\u003E\nYou\u0027re really confusing quantum gravity. Quantum gravity is an attempt to merge General Relativity with the Standard Model, not some magic gravity entanglement force. In any case, a state of entanglement will collapse as soon as it is observed rendering it useless.\n\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-03-19T12:49:10Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222463743\u0022 data-ipsquote-contentid=\u0022134320\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458365622\u0022 data-ipsquote-userid=\u0022134441\u0022 data-ipsquote-username=\u0022Laythe Dweller\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, Laythe Dweller said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYou\u0027re really confusing quantum gravity. Quantum gravity is an attempt to merge General Relativity with the Standard Model, not some magic gravity entanglement force. In any case, a state of entanglement will collapse as soon as it is observed rendering it useless.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSome of the latest work on quantum gravity suggest that it acts they quantum entanglement.\n\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-03-19T13:55:00Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222463735\u0022 data-ipsquote-contentid=\u0022134320\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458364616\u0022 data-ipsquote-userid=\u002298447\u0022 data-ipsquote-username=\u0022YNM\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, YNM said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNo, I really mean a subspace - a space that is unconnected to the other space. Like, say, you could say that the space inside an alcubierre drive to be a subspace because you can\u0027t interact with the world outside you (or outside the drive).\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI don\u0027t think, at least in our universe, that hyperspace exists, the only wormholes that exist are quantum entanglements, and if we don\u0027t learn how to manipulate these in all their various flavours space travel well then my bad idea would be useless.\n\u003C/p\u003E\n\u003Cp\u003E\nLets say that gravity communicates via quantum entanglement. The key to this may be the fact that planks energy is in the 1000s of MW (1E28 or something electron volts range) whereas the smallest quanta of energy are in the low frequency hv range. This is what I think that recent paper is getting at, \u003Cstrong\u003Egravity maybe the response to cosmic dispersion\u003C/strong\u003E. We look at the dispersion as being matter, but in reality matter is a latecomer, it is in reality a dispersion of energy, and maybe the plank units of Energy really matter, some other dynamic of the universe forced an undesired dispersion of energy putting it at a natural disequibrium from its lowest state. This is not to say massively clumped energy is preferential, but in maybe multifaceted, meaning you could have two low energy states, on that is dispersed and heterogenous with regard to its origin, and another that is dispersed and homogenous, and the homogenous one would have a lower potential energy and higher intrinsic energy. Quantum gravity could be a reflexive response to dispersion of one natural energy state, that is starting state in which density is in the Plank energy density range. This disruption happened early on and became dispersed and randomized, like rain drops coming from different clouds in the midst of a hurricane. They still communicate, so my feeble energy to matter was a \u0027just so\u0027 method of reassociating energy and spliting it again. If it was true that gravity is the result of untied energy then you could have a gravitational sensor that looks for energies with a shared origin and move them to a certain location. It is possible that the energy states reform in potentials (which warping of space time creates) so one method might be to collect energy from potentials and use it to create matter. So step one would be to find the grand potential, step two would be create precisely that potential, step three would be to collect all the energy from the potential, step four would be create matter from that energy and step 5 would be separate the matter and antimatter created, and repeat process. After the matter was created it would require the input of more energy (not necessarily paired) to make plates - although it does not have to be plates it could be anti-protons in a plasma containment field. If you create anticarbon you could create diamond lattice out of it (although it does degrade at is surface to carbon gas). So the endform is not that important, what is important is that two objects have the same \u0027cosmic energetic origin\u0027. IOW you tie energy up and then you very carefully untie such that now it wants to communicate gravitons specifically with its reciprocal on the otherside of the sun.\n\u003C/p\u003E\n\u003Cp\u003E\nEven so once you create such a device, there is no way to turn on and off the attractions once created, they would be always on, but one could use relatively to speed up or slow down time for the particles.\n\u003C/p\u003E\n\u003Cp\u003E\nThe energy of this group however is queer (in the classic not colloquial sense) thoughts, it goes a while and then it becomes wanted of such thoughts, so I throw in a few very queer thoughts, and it quells the latent energy for a time. We can call is quantum allopensiveness of the kerbal flavour. everyone seems to engage in this, we have the albucierre drive proponents, the black hole drive proponents, the H-bomb drive proponents, nuclear-direct-electric proponents, nerva proponents, solar sail. It helps if we call these things what they are upfront (bad ideas ranging to very bad ideas).\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Windspren","CreatedById":134441,"CreatedDateTime":"2016-03-19T15:41:57Z","Content":"\n\u003Cp\u003E\nGravity does not rely on quantum entanglement, and entangled particles are not wormholes.\n\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-03-19T20:49:31Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222464091\u0022 data-ipsquote-contentid=\u0022134320\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458402117\u0022 data-ipsquote-userid=\u0022134441\u0022 data-ipsquote-username=\u0022Laythe Dweller\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, Laythe Dweller said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nGravity does not rely on quantum entanglement, and entangled particles are not wormholes.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222464091\u0022 data-ipsquote-contentid=\u0022134320\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458402117\u0022 data-ipsquote-userid=\u0022134441\u0022 data-ipsquote-username=\u0022Laythe Dweller\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, Laythe Dweller said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nGravity does not rely on quantum entanglement, and entangled particles are not wormholes.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nQuantum gravity may rely on quantum entanglement to communicate.\n\u003C/p\u003E\n"},{"CreatedByName":"Steel","CreatedById":49317,"CreatedDateTime":"2016-03-19T20:54:13Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222464472\u0022 data-ipsquote-contentid=\u0022134320\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458420571\u0022 data-ipsquote-userid=\u0022107380\u0022 data-ipsquote-username=\u0022PB666\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 minutes ago, PB666 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022line-height:1.6;\u0022\u003EQuantum gravity may rely on quantum entanglement to communicate.\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIs there a paper on this?\n\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-03-19T21:15:54Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222464482\u0022 data-ipsquote-contentid=\u0022134320\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458420853\u0022 data-ipsquote-userid=\u002249317\u0022 data-ipsquote-username=\u0022Steel\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n27 minutes ago, Steel said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIs there a paper on this?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nTheres a post on this from November/December. Ill see if I can find it.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.sciencedaily.com/releases/2013/12/131205142218.htm\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.sciencedaily.com/releases/2013/12/131205142218.htm\u003C/a\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-03-19T21:21:55Z\u0022 title=\u002203/19/2016 09:21  PM\u0022 data-short=\u00228 yr\u0022\u003EMarch 19, 2016\u003C/time\u003E by PB666\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Windspren","CreatedById":134441,"CreatedDateTime":"2016-03-20T03:47:35Z","Content":"\n\u003Cp\u003E\nThat post has a lot of inaccuracies. First of all, it is impossible to communicate information using entanglement, because the state of entanglement collapses as soon as it is observed. Second of all, physicists have not created entangled black holes. Finally, wormholes are still theoretical, and have not been created by entangled particles. That post looks like pure clickbait for people who are interested in theoretical physics but know very little about its fundamentals.\n\u003C/p\u003E\n"},{"CreatedByName":"YNM","CreatedById":98447,"CreatedDateTime":"2016-03-20T11:47:56Z","Content":"\n\u003Cp\u003E\nAlso, seems like that you\u0027re too tangled to the idea of quantum gravity. As with everything experimental, you shouldn\u0027t use it too often, more so in public. I mean, none of us signed the \u0022yes explain this with experimental quantum gravity\u0022 agreement letter.\n\u003C/p\u003E\n\u003Cp\u003E\nTherefore, my point still stands. Much like how they lifted the building into a station around Saturn in Interstellar, if you can manipulate gravity (uh, spacetime geometry) directly may as well you instantly arrive at the destination by using some complex spacetime geometry.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-03-20T11:48:55Z\u0022 title=\u002203/20/2016 11:48  AM\u0022 data-short=\u00228 yr\u0022\u003EMarch 20, 2016\u003C/time\u003E by YNM\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-03-20T13:29:32Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222465243\u0022 data-ipsquote-contentid=\u0022134320\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458474476\u0022 data-ipsquote-userid=\u002298447\u0022 data-ipsquote-username=\u0022YNM\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n53 minutes ago, YNM said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAlso, seems like that you\u0027re too tangled to the idea of quantum gravity. As with everything experimental, you shouldn\u0027t use it too often, more so in public. I mean, none of us signed the \u0022yes explain this with experimental quantum gravity\u0022 agreement letter.\n\u003C/p\u003E\n\u003Cp\u003E\nTherefore, my point still stands. Much like how they lifted the building into a station around Saturn in Interstellar, if you can manipulate gravity (uh, spacetime geometry) directly may as well you instantly arrive at the destination by using some complex spacetime geometry.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nRight, I guess you don\u0027t read tags. Let me help your vision \u003Cstrong\u003E(bad idea)\u003C/strong\u003E \u003Cstrong\u003E(quantum gravity)\u003C/strong\u003E \u003Cstrong\u003E(really bad idea)\u003C/strong\u003E [Note these are not edited in, but came with the original post]\n\u003C/p\u003E\n\u003Cp\u003E\nIt makes a point that you can take something from the literature and \u0027lean at the windmill\u0027 and come up with any scheme for acceleration. I am basically defending the idea just like any one of our sprites might, otherwise the pose has no value.\n\u003C/p\u003E\n\u003Cp\u003E\nThe same has been done here with: Albucierre drive, Worm hole drive, H-bomb drive,  . . . . . . .  .\u003Cem\u003Ewhat if we did this posts\u003C/em\u003E. This comes as a reflex to the problem that there are massive translational energy differentials between us and \u003Cem\u003Eeverywhere we would like to go\u003C/em\u003E as well as massive distances to cross. Standard modalities do not serve the purpose of single generation space travel, therefore we have a tendency to propose far fetched schemes to solve the problem and then go through a rationalization scheme to try to prove that the schemes are not as bad as they really are.  (i.e. really bad ideas is always a followup process to bad ideas)\n\u003C/p\u003E\n\u003Cp\u003E\n[\u003Cem\u003EBack to sprite mode\u003C/em\u003E]\n\u003C/p\u003E\n\u003Cp\u003E\nBut anyway, there is no specific problem with using quantum gravity as an explanation. The basic problem here is this particular theory is based on \u003Cem\u003Estring theory\u003C/em\u003E, which so far has no testable hypothesis. Quantum entanglement of gravitons may exist even if string theory does not, but that\u0027s another caveot. But if quantum entanglment of gravitons occurs then they can communicate instantly.\n\u003C/p\u003E\n\u003Cp\u003E\nManipulating quantum gravity \u003Cstrong\u003Eis\u003C/strong\u003E manipulating spacetime indirectly. Manipulating space-time on a broad scale has an absolute requirement of energy- massive amounts. It would be sort of like plotting a Hohmann transfer or massive amounts of acceleration and deceleration;  if quantum entanglement of gravitons exist then entangling them and separating them will afford you much more efficient means of manipulating spacetime than trying to achieve the same result without information about the states of particles (brute force applications of energy).\n\u003C/p\u003E\n\u003Cp\u003E\nThe key point here is that by linking entangled array with non-entangled array we can use energy from the sun to accelerate the craft to a desired quasi-orbital velocity and then release. The energy is conserved in the manipulation since the payload is released, leaving the entangled array free to \u0027cool\u0027 down to normal orbital statistics.\n\u003C/p\u003E\n\u003Cp\u003E\n[out of spirte mode]\n\u003C/p\u003E\n\u003Cp\u003E\nThe problems I have stated above:\n\u003C/p\u003E\n\u003Cp\u003E\n0. Two wormholes collapsing should create a gravitational wave instantly and should not coincide with a visible event, this may contradict the current observation.\u003Cbr\u003E\n1. Creation of entangled masses requires anti-matter stabiliization or the sorted of extremely rare energy-pairs (in the form of particles)\u003Cbr\u003E\n2. It also requires an efficient creation of anti-matter from potential energy that we do not currently have.\u003Cbr\u003E\n3. There is no way to manipulate I (intensity) after it is generated. Although you could take tiny pieces of the matrix and move them to opposed positions in a circumsolar orbit, once you are there you have to maintain a radial thrust to keep them from falling into each other. The only way to prevent this from happening without thrust is to move the pieces in while moving, this would require a wormhole (as in the fictional type) to both ships to transport.\n\u003C/p\u003E\n\u003Cp\u003E\n4th is a caveot. If quantum entanglement of gravitons occurs then it is quite simple to test it, creating matter anti-matter pairs and stabilizing them should create a force between them once the charges are neutralized. Since no such force has been  . . . . . .\n\u003C/p\u003E\n\u003Cp\u003E\n5. The key dogma of space science fiction is that plots almost always require a fictional device to move things so speed things up.\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}