{"TopicId":134617,"ForumId":16,"TopicTitle":"Next steps?","CreatedByName":"strider3","CreatedById":199830,"CreatedDateTime":"2016-03-20T21:49:06Z","PageNum":1,"Articles":[{"CreatedByName":"strider3","CreatedById":199830,"CreatedDateTime":"2016-03-20T21:49:06Z","Content":"\n\u003Cp\u003E\nWith the understanding that I am more into \u0022vertical launch\u0022 and continuing my Career mode...any suggestions?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 src=\u0022http://users.frii.com/viciii3/Tree01.jpg\u0022 alt=\u0022Tree01.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-03-20T21:59:28Z","Content":"\n\u003Cp\u003E\nDepends what your priorities are, but my own preference would be:\n\u003C/p\u003E\n\u003Col\u003E\u003Cli\u003E\nSpace Exploration, to unlock the barometer, so you can get more science points.\n\u003C/li\u003E\n\u003Cli\u003E\nFuel Systems, for the FL-T800 tank (lower part count) and fuel ducts (asparagus!)\n\u003C/li\u003E\n\u003Cli\u003E\nElectrics, for the OX-STAT solar panel (handy for longer missions, e.g. going to Minmus)\n\u003C/li\u003E\n\u003C/ol\u003E\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Hodari","CreatedById":157578,"CreatedDateTime":"2016-03-21T07:46:19Z","Content":"\n\u003Cp\u003E\nI\u0027d say for career mode, you should almost always prioritize one of two things:\n\u003C/p\u003E\n\u003Cp\u003E\n1. New science experiments or\n\u003C/p\u003E\n\u003Cp\u003E\n2. Whatever parts you need in order to get to new biomes in order to run your existing experiments there.\n\u003C/p\u003E\n\u003Cp\u003E\nThe one thing you need to avoid is wasting your points on something that won\u0027t help you progress and then leaving yourself with no way to progress further.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027d say you should get the solar panels first with barometer being a very close second.  Once you have some way to recharge their batteries, you can send probes to a lot of different places to get the science you need to unlock everything else(not to mention funds from world firsts and opening up a better variety of contracts).  With all those biomes now being available, the barometer would then quickly pay for itself. \n\u003C/p\u003E\n\u003Cp\u003E\nAfter that, things start to open up a lot more as far as options go.  Part count will start to be an issue, so the bigger fuel tanks might help(depending on if you can afford to upgrade the VAB yet.\n\u003C/p\u003E\n\u003Cp\u003E\nYou\u0027ll want to be able to land probes and especially kerbals on the Mun and Minmus, so getting landing struts and ladders would also help.\n\u003C/p\u003E\n\u003Cp\u003E\nActuators is also a very nice at around this time so you can get funding and free crew members from all the rescue contracts(can skip this if you want to just EVA them over once your rendezvous though).\n\u003C/p\u003E\n"},{"CreatedByName":"wumpus","CreatedById":133850,"CreatedDateTime":"2016-03-21T15:48:01Z","Content":"\n\u003Cp\u003E\n\u0022Lightning Bolt! Lightning Bolt! Lightning Bolt!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nWhile the above are certainly good arguments, I would strongly suggest the electrics as you pretty much need the ox-stat panel for anything (if you didn\u0027t you can still turn off battery power during your interception course, turn it back on for your orbital and possible descent burns.).  Getting the octoprobe just seals the deal.\n\u003C/p\u003E\n\u003Cp\u003E\nGetting more science instruments is usually best, but in this case you would open up upper/lower space near Minmus, upper/lower space near Mun, land probes on Minmus/Mun (and if you are adventurous and willing to learn about transfer windows, probes to Duna and Eve).  Also, you get the octoprobe which makes launching Bob up into orbit (or Minmus) and resetting all those experiments a snap (because the octoprobe gives you SAS).  Getting one more instrument would be nice, getting to use all your available instruments on all available biomes is priceless.\n\u003C/p\u003E\n"},{"CreatedByName":"Plusck","CreatedById":153264,"CreatedDateTime":"2016-03-22T02:45:19Z","Content":"\n\u003Cp\u003E\nAgreed for (a) solar then (b) science experiments then (c) fuel lines.\n\u003C/p\u003E\n\u003Cp\u003E\nThe reasoning? You really need solar panels to send probes anywhere. Once you can do that, you fire-and-forget a few (with antennae!) for easy science points. Then you get better experiments to multiply the return on your science missions. That should easily lead you to fuel lines which massively increase your potential dv and therefore your ability to go far in space.\n\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2016-03-22T02:50:19Z","Content":"\n\u003Cp\u003E\nYeah the OX-STAT is one of the few super critical parts in the game. Then \u0022moar science\u0022 is always the way to go. Granted, that fuel pump is important too (It and the strut are two more critical parts, but it\u0027s the least important of the 3 IMO) but you can get enough science points just taking a barometer to all the places you\u0027ve already been, to easily unlock it.\n\u003C/p\u003E\n\u003Cp\u003E\nI frequently max out the bottom of the tree before even getting the Mk3 engines on the top. And I frequently max those out before even considering the plane stuff.\n\u003C/p\u003E\n"}]}