{"TopicId":134668,"ForumId":18,"TopicTitle":"OMG What happened to....","CreatedByName":"StrandedonEarth","CreatedById":89439,"CreatedDateTime":"2016-03-21T15:21:49Z","PageNum":1,"Articles":[{"CreatedByName":"StrandedonEarth","CreatedById":89439,"CreatedDateTime":"2016-03-21T15:21:49Z","Content":"\n\u003Cp\u003E\nMy wife gets a call yesterday (Sunday) to come down to the daycare where she works to help clean up the matchsticks that used to be the fence. I whipped up this sign for her this morning to save at least some of the explanations.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ObiEDyA.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/ObiEDyA.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe place is called \u0022A Nice Place to Be.\u0022 Now the joke will be \u0022A Nice Place to Crash Your Car\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nEdit: I guess I should add the story: at 3 am the guy apparently fell asleep at the wheel, crossed the oncoming lanes, and plowed through 3 or 4 panels of cedar fencing before clipping the telephone pole and kissing the corner of the building. Flying debris crazed the outer pane of a double-glazed window, but the inner pane was thankfully still intact. Luckily he also missed the play structure inside the yard, which was just put in last summer, along with the new fence. \n\u003C/p\u003E\n\u003Cp\u003E\nThey are still open for business today, although they won\u0027t be using that yard for awhile, unless they get some temporary fencing.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyone else have any \u0022OMG What happened...?\u0022 stories?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-03-21T16:08:56Z\u0022 title=\u002203/21/2016 04:08  PM\u0022 data-short=\u00228 yr\u0022\u003EMarch 21, 2016\u003C/time\u003E by StrandedonEarth\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tex Mechs Robot","CreatedById":83406,"CreatedDateTime":"2016-03-21T15:53:16Z","Content":"\n\u003Cp\u003E\n\u0022Dangit Jeb! Watch where you\u0027re going next time!!\u0022\n\u003C/p\u003E\n"},{"CreatedByName":"Randazzo","CreatedById":136468,"CreatedDateTime":"2016-03-21T17:46:11Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222466915\u0022 data-ipsquote-contentid=\u0022134668\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458573709\u0022 data-ipsquote-userid=\u002289439\u0022 data-ipsquote-username=\u0022StrandedonEarth\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, StrandedonEarth said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAnyone else have any \u0022OMG What happened...?\u0022 stories?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nMany years ago I worked at a grocery store. One morning at about 10 am, we suddenly had a new entrance installed.\n\u003C/p\u003E\n\u003Cp\u003E\nAn elderly woman suffering from dementia and driving a 1970-something Cadillac Main Battle Tank had \u0022an episode\u0022 while driving in the parking lot and had pressed the accelerator to the floor instead of the brake. She plowed through the front wall of the store, directly into the day managers office. He happened to be sitting at his desk at the time, with his back to the wall. Several bricks struck him, at least one to the head, leaving him with a concussion and a gash on the back of his head but otherwise relatively unharmed. Imagine his surprise when he turned around to find the front end of a car sitting in his office. As it turned out, the thing that actually stopped the car was the floor safe, fastened to several feet of concrete or some such thing and sat against the wall directly behind his desk.\n\u003C/p\u003E\n"},{"CreatedByName":"HoloYolo","CreatedById":138353,"CreatedDateTime":"2016-03-21T17:50:02Z","Content":"\n\u003Cp\u003E\nI know this is going to be a mood killer but a guy and his friends were crossing the street when he got hit by a car and died there before the paramedics could save him. Before that on the same street, my friend Kyle got hit by a car and couldn\u0027t use his leg for a month.\n\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2016-03-23T14:56:27Z","Content":"\n\u003Cp\u003E\nWhy do you people build everything out of wood? It\u0027s fragile and flammable. \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"HoloYolo","CreatedById":138353,"CreatedDateTime":"2016-03-23T15:36:30Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222469855\u0022 data-ipsquote-contentid=\u0022134668\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458744987\u0022 data-ipsquote-userid=\u002279159\u0022 data-ipsquote-username=\u0022lajoswinkler\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n39 minutes ago, lajoswinkler said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhy do you people build everything out of wood? It\u0027s fragile and flammable. \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBecause it\u0027s reusable and it grows back fast.\n\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2016-03-23T15:42:46Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222469905\u0022 data-ipsquote-contentid=\u0022134668\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458747390\u0022 data-ipsquote-userid=\u0022138353\u0022 data-ipsquote-username=\u0022HoloYolo\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 minutes ago, HoloYolo said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBecause it\u0027s reusable and it grows back fast.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIrrelevant if the threat of dying in a fire (because one is actually living in a damn PYRE) is much higher than usual. Bricks, people. Use bricks and reinforced concrete skeleton.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 src=\u0022http://www.big-boys-gradnja.hr/media/11_O-NAMA/big_boys_gradnja_rogoznica.jpg\u0022 alt=\u0022big_boys_gradnja_rogoznica.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nHollow bricks insulate heat very well, they are lightweight, and reinforced concrete skeleton is elastic and very strong.\n\u003C/p\u003E\n"},{"CreatedByName":"StrandedonEarth","CreatedById":89439,"CreatedDateTime":"2016-03-23T16:19:33Z","Content":"\n\u003Cp\u003E\nAround here, wood is plentiful, and so are smoke alarms and fire stations. Wood is also renewable, and wood buildings actually count as a carbon sink. And the most recent building codes call for sprinklers in all multi-family housing. And it\u0027s usually the contents that start house fires, anyways. \n\u003C/p\u003E\n\u003Cp\u003E\nWhere red clay is plentiful, so are brick houses. And that reinforced concrete skeleton is new tech to me. It certainly solves the problem of brick structures being vulnerable to earthquakes. But brick and reinforced concrete are carbon-intensive materials. I imagine it is also more expensive, especially if the interior walls are also brick. But it must be great for sound and thermal insulation, although it also increases thermal mass. Those walls will stay warm most of the night.\n\u003C/p\u003E\n"},{"CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2016-03-23T20:33:32Z","Content":"\n\u003Cp\u003E\nLet\u0027s try and get this back on topic.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nMy only real \u0022OMG what happened\u0022 story was when I was living in the basement of my mother and stepfather\u0027s house. I was sleeping soundly at like 2 in the morning when there was a huge crash and loud bang, and when I jolted awake I couldn\u0027t see anything out of the pitch black. Needless to say, it was the fastest I had ever become awake. I actually didn\u0027t want to move because I thought there was debris trapping me in my bed, and I didn\u0027t want to dislodge it. When I finally got moving I checked around, and everything looked perfectly normal. No destruction.\n\u003C/p\u003E\n\u003Cp\u003E\nIt turns out (and my mom actually told me it might happen) is that, for whatever reason, the furnace starts with clanging sometimes, and because my room was next to the furnace, it was extremely loud.\n\u003C/p\u003E\n"},{"CreatedByName":"Frybert","CreatedById":97766,"CreatedDateTime":"2016-03-23T22:06:53Z","Content":"\n\u003Cp\u003E\nBack in January of 2011, I had recently moved to Kenosha, Wi. I had been sitting on my couch, browsing the internet on my laptop when the lights flickerd. At first I didn\u0027t think anyone about it. Then a few seconds later KA BOOM! The \u003Cs\u003Ewindows\u003C/s\u003E whole house shook. My initial reaction was oh, \u0027shuttle must have landed\u0027. That thought was quickly replaced with \u0027wait, I didn\u0027t know there was a shuttle up in the first place\u0027 and finally replaced with \u0027Oh wait, I\u0027m in Wisconsin, not Florida, unless something went DRASTICALLY wrong there\u0027s no way that was a shuttle.\u0027 It was at this point the woman I was living with at the time popped her head out from the kitchen, \u0022What in the world was that?\u0022 We exchanged \u0027I don\u0027t knows\u0027 and promptly started searching the internet. Less than 10 minutes after the event, this was posted to Youtube:\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022true\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/Np-_r9uMC7I?feature=oembed\u0022 width=\u0022480\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2016-03-23T22:44:05Z","Content":"\n\u003Cp\u003E\n\u003Ca href=\u0022https://parameciumkid.tumblr.com/post/141567499096/the-noodle-incident\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://parameciumkid.tumblr.com/post/141567499096/the-noodle-incident\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Frybert","CreatedById":97766,"CreatedDateTime":"2016-03-24T02:54:22Z","Content":"\n\u003Cp\u003E\nA friendly reminder this is not the place for politics, as a result some posts have been removed.\n\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2016-03-24T14:52:30Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222469970\u0022 data-ipsquote-contentid=\u0022134668\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458749973\u0022 data-ipsquote-userid=\u002289439\u0022 data-ipsquote-username=\u0022StrandedonEarth\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n22 hours ago, StrandedonEarth said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAround here, wood is plentiful, and so are smoke alarms and fire stations. Wood is also renewable, and wood buildings actually count as a carbon sink. And the most recent building codes call for sprinklers in all multi-family housing. And it\u0027s usually the contents that start house fires, anyways. \n\u003C/p\u003E\n\u003Cp\u003E\nWhere red clay is plentiful, so are brick houses. And that reinforced concrete skeleton is new tech to me. It certainly solves the problem of brick structures being vulnerable to earthquakes. But brick and reinforced concrete are carbon-intensive materials. I imagine it is also more expensive, especially if the interior walls are also brick. But it must be great for sound and thermal insulation, although it also increases thermal mass. Those walls will stay warm most of the night.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nReinforced concrete and bricks are the staples of house construction throughout the world. Yes, the contents will start the fire, but if the house itself is flammable, not only will the fire spread faster, but the house will be gone, too. In concrete-brick houses, fires don\u0027t usually cause such damage because bricks are refractory material.\n\u003C/p\u003E\n\u003Cp\u003E\nInterior walls are usually brick, too, but thinner. Who cares about carbon footprint? The house has more quality to it and lasts for a long, long time. No decay. Construction wood needs to be treated to attenuate mold and insects. Those substances are volatile. Brick and concrete require nothing.\n\u003C/p\u003E\n\u003Cp\u003E\nHeat insulation is good but an useful upgrade is backing it up with rock wool from the outside.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 src=\u0022http://www.webgradnja.hr/images/specifikacije/834/novo-21b.jpg\u0022 alt=\u0022novo-21b.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Pixel of Life","CreatedById":45646,"CreatedDateTime":"2016-03-25T18:39:07Z","Content":"\n\u003Cp\u003E\nMy local shopping mall. Ridiculously loud bang. The window of the shop next to me shatters into a million pieces. Thank goodness it was laminated glass. Scared the crap outta me though.\n\u003C/p\u003E\n"},{"CreatedByName":"TheKosanianMethod","CreatedById":163034,"CreatedDateTime":"2016-08-12T05:49:03Z","Content":"\n\u003Cp\u003E\nI was at scout camp, and had just finished at the rifle range. Then a huge huge woosh-BOOM came from overhead. The sound faded over about three seconds. No one knew what it was. Except me. After about two minutes, I told everyone. \n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u0022You do realize that was a sonic boom, right? Fighter jets just went over. F-15Es or F-16s, most likely F-16s.\u0022 Everyone looked at me like I had two heads.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"TwinKerbal","CreatedById":161536,"CreatedDateTime":"2016-08-12T13:22:54Z","Content":"\n\u003Cp\u003E\nThis might be a bit morbid, but once when I was a little kid, I was sledding down a hill when my brother went too fast and hit a river bank with rocks in it. I still remember us driving down the mountain at full speed to get to the hospital. Luckily he ended up fine. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-08-12T13:23:15Z\u0022 title=\u002208/12/2016 01:23  PM\u0022 data-short=\u00227 yr\u0022\u003EAugust 12, 2016\u003C/time\u003E by TwinKerbal\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Diche Bach","CreatedById":76097,"CreatedDateTime":"2016-08-12T13:57:15Z","Content":"\n\u003Cp\u003E\nI\u0027ve had my fair share, but the one that sticks in my head is a caving trip to SW Missouri (Perry County) back in the early 1990s. This part of Missouri is extremely karst, meaning most of the hydrology is underground. Longest caves in Missouri are in this county (been so long, memory is a bit fuzzy, and the numbers might have changed . . .) Rimstone River Cave and  . . . damn the other one I cannot remember.\n\u003C/p\u003E\n\u003Cp\u003E\nBoth of these are in the 30 miles of total surveyed distance ballpark, and what they consist of is: a dendritic network of downstream phreatic tubs with some vados modification. Far upstream ends either in a surface infeeder or a blockage. Downtream ends in either a blockage or a \u0022sump\u0022 (meaning the \u0022roof\u0022 of the cave goes below the water level). Essentially this is an \u0022underground river system\u0022 (which not all caves are by a long shot) in which the amount of water (and air, the important part) in the cave system is HIGHLY dependent on the amount of water currently in the immediate environs on the surface. To put it simply: these caves are extremely dangerous flood risks, particularly in the smaller infeeder (with the entrance sections especially) passages where the quantity of water coming in at the surface can easily exceed the volume of the passage itself = no air. Base on observations, there are very few if any places in this entire cave system that are always safe from flooding, though in some of the largest downstream trunk sections (the biggest trunks are in the 40 x 30 feet cross-section ballpark), the highest points in the passageway only flood about every decade or less.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, one must be quite attentive to the current situation of the aquifers as well as weather forecasts when visiting these caves: true for pretty much the whole of Perry County, MO (though in many caves, particularly in the Ozarks, flood risk is effectively a complete non-issue).\n\u003C/p\u003E\n\u003Cp\u003E\nI had driven from Columbia where I was in school and unfortunately the weather forecast was not good. Not terrible but not good. It was drizzling the whole time I was driving. Basically, the risk that the cave(s) would flood was not particularly high, but it was obviously above \u0022safe threshold.\u0022 My inclination was to get the Perry County locals I was going to meet to head to some destinations that were \u0022zero flood\u0022 risk, but the fellow who was leading the trip we had planned (which was a no-go as a result of the precipitation) suggested that we could do a useful trip just inside one of the entrances to Rimstone River cave. This particular entrance is a small sinkhole with small tube that leads about 150ft to a T-intersection with a larger tube that more or less has permanent water flow. The infeeder section is normally dry and flow into it only occurs under exceptionally high aquifer conditions. The larger tube is a near sump to the right and goes as a low airspace stoopwalk/crawl for a hundred feet or so before it too sumps.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen this entrance was \u0022discovered\u0022 it was no entrance at all, but merely a short cave, which by plotting against the Rimstone river map revealed that it must be the upstream side of the cave system. There is a large gravel bar immediately downstream of the T-part I referred to above, which was simply excavated a bit, which lowered the water level in the pool it was holding (which formed the \u0022sump\u0022) and this \u0027created\u0027 the entrance to the cave; quite a handy thing to have. However, this gravel bar tends to progressively block the flow over time, so periodic trips to scoop it out are necessary to keep the entrance passable without diving.\n\u003C/p\u003E\n\u003Cp\u003E\nSo we went in and did some digging and yep, the airspace in the low-crawl \u0022near sump\u0022 was nicely increased from 8 or 9 inches to nearly 16\u0022 . . . There were some other guys in the group who at least wanted to see the main trunk, but me, I was playing it safe. I headed back to the entrance to check the weather and the other cavers went downstream for quick tour, promising to be back in no more than 45 minutes or so.\n\u003C/p\u003E\n\u003Cp\u003E\nBack at the entrance I found things had cleared up quite a bit, not quite a sunny day, but no longer drizzling. So I headed back in and proceeded down the belly crawl infeeder to the T-intersection . . . and this is when the OMG moment happened.\n\u003C/p\u003E\n\u003Cp\u003E\nI got back to the small \u0022chamber\u0022 where the entrance belly crawl intersected the tube and peeked both up and downstream . . . yep all looked good. The lowering of the pool was continuing a bit still and the airpsace was even a few inches larger now.\n\u003C/p\u003E\n\u003Cp\u003E\nSuddenly I started to hear something. My heart froze as the prospect of drowning like a rat in a mudhole leapt into my mind. It started like a whistle, but quickly progressed to more of a howl, and thence on to what I can only describe as \u0022like a train horn\u0022 except just constant, i.e., not going on and off like the engineer actually does\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022true\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/VKhETMt9Y8o?feature=oembed\u0022 width=\u0022480\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nI raced back to the entrance and was surprised to note no inflowing water as I did, and when I got to the entrance and wriggled my way out, I was even more surprised: even sunnier than it was 10 minutes before and absolutely no sign of precipitation or impending flood disaster.\n\u003C/p\u003E\n\u003Cp\u003E\nI was of course a bit baffled and clambered back down into the sinkhole . . . yep, that noise was still down there . . . it was coming from somewhere inside!?\n\u003C/p\u003E\n\u003Cp\u003E\nSo cautiously, I decided, well it seems this isn\u0027t an existential thread moment so why don\u0027t you go see what the hell is making that noise.\n\u003C/p\u003E\n\u003Cp\u003E\nBack down at the T-intersection, it was now obvious the howling noise (which continued and had done so for some 10 minutes, but did seem to be starting to lower in intensity) was coming from the UPSTREAM section of the T-intersection. The water level in this section had obviously been lowered somewhat too, though not as dramatically as the pool that formed the original sump that blocked the entrance.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen I went upstream I found that the sump on the other side had been opened as well, and the noise was a result of the air rushing into the previously water-filled upstream sections that had been \u0022opened\u0022 by this higher pool having been lowered!\n\u003C/p\u003E\n\u003Cp\u003E\nI stooped there in knee-deep water for a few minutes watching the water ripple at the small 4\u0022 gap between cave roof and water surface as the air rushed upstream, listening to the howl as it slowly died down and disappared. One of the most amazing things I\u0027ve ever seen, and not only have I never heard any other cavers report anything similar, but of course . . . by the time my buddies got back it had completely quit and they didn\u0027t believe a word of it!\n\u003C/p\u003E\n"}]}