{"TopicId":134739,"ForumId":24,"TopicTitle":"New to forums and would love some mod suggestions","CreatedByName":"Wrecker","CreatedById":160685,"CreatedDateTime":"2016-03-22T17:38:31Z","PageNum":1,"Articles":[{"CreatedByName":"Wrecker","CreatedById":160685,"CreatedDateTime":"2016-03-22T17:38:31Z","Content":"\n\u003Cp\u003E\nHey everyone, just joined the forums and I\u0027m excited to talk to some more kerbonauts!  I\u0027ve been playing KSP pretty seriously for about 4 months now and I\u0027ve definitely jumped on the mod train.  I\u0027m currently trying to make a RO/RP-0/RSS Career work and am just hitting a few bumps with lack of engine variation.  I was wondering what kind of part mods other realism fans like to use.  I\u0027m a fan of anything that makes the game more intriguing or difficult like TAC and RemoteTech so feel free to mention any of those kind of mods too if you like.  \n\u003C/p\u003E\n"},{"CreatedByName":"Starhawk","CreatedById":131400,"CreatedDateTime":"2016-03-22T17:56:55Z","Content":"\n\u003Cp\u003E\nHello Wrecker and welcome to the forum!\n\u003C/p\u003E\n\u003Cp\u003E\nI play a very lightly modded game, myself.  KER, KAC, Editor Extensions, Enhanced Navball, and Scansat are pretty much it atm.  There are lots of realism folks around various areas of the forum, if they don\u0027t find you here.  Glad to have you aboard.\n\u003C/p\u003E\n\u003Cp\u003E\nHappy landings!\n\u003C/p\u003E\n"},{"CreatedByName":"Parv Kerman","CreatedById":160918,"CreatedDateTime":"2016-03-28T13:12:21Z","Content":"\n\u003Cp\u003E\nHey wrecker, welcome to the forums. I also joined it yesterday.\n\u003C/p\u003E\n\u003Cp\u003E\nif want a mod ask me!\n\u003C/p\u003E\n\u003Cp\u003E\nif you want to land on another planets without any effort so you may install hyperedit.\n\u003C/p\u003E\n\u003Cp\u003E\nif you want to install a mod, copy the mod\u0027s gamedata and paste it on game\u0027s gamedata.\n\u003C/p\u003E\n"},{"CreatedByName":"Gojira1000","CreatedById":152681,"CreatedDateTime":"2016-03-28T14:22:58Z","Content":"\n\u003Cp\u003E\nFor daily use: Kerbal Joint Reinforcement and Kerbal Engineer Redux\n\u003C/p\u003E\n\u003Cp\u003E\nFor prettiness: EVE and Scatterer\n\u003C/p\u003E\n\u003Cp\u003E\nFor Science: DMorbital Magic, Scansat\n\u003C/p\u003E\n\u003Cp\u003E\nFor parts: Lots of options, maybe play with Ven\u0027s Stock Revamp first to get you feet wet?\n\u003C/p\u003E\n\u003Cp\u003E\nOh, and possibly: TAC Life Support and MKS-lite\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-03-28T14:24:40Z\u0022 title=\u002203/28/2016 02:24  PM\u0022 data-short=\u00228 yr\u0022\u003EMarch 28, 2016\u003C/time\u003E by Gojira1000\u003C/strong\u003E\n\u003C/span\u003E\n"}]}