{"TopicId":134817,"ForumId":55,"TopicTitle":"Increase KSP Ship Classifications","CreatedByName":"RangerBoozma","CreatedById":151497,"CreatedDateTime":"2016-03-23T22:48:43Z","PageNum":1,"Articles":[{"CreatedByName":"RangerBoozma","CreatedById":151497,"CreatedDateTime":"2016-03-23T22:48:43Z","Content":"\n\u003Cp\u003E\nOne of the biggest problems I have in some of my larger save files is scrolling through pages of craft files, or selecting the wrong ship type when I reopen a save after a while. I would be interested in knowing how difficult it would be to add more classifications for ship types? \n\u003C/p\u003E\n\u003Cp\u003E\nWhat I\u0027m suggesting would be the ability to create more classifications of crafts. The ability to more specifically label ships in the Map screen would be quite an improvement. While in the Tracking Station, imagine that you click on the ship filter, but a drop down list with more options appears. You can select just your SSTO\u0027s, your airplanes, or your typically shapecraft. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSome of my ideas for new categories include:\n\u003C/p\u003E\n\u003Cp style=\u0022margin-left:40px;\u0022\u003E\n\u003Cstrong\u003EProbes: \u003C/strong\u003ERelays (the kind you need for RemoteTech 2), probes, surveyors, satellites\n\u003C/p\u003E\n\u003Cp style=\u0022margin-left:40px;\u0022\u003E\n\u003Cstrong\u003ERovers:\u003C/strong\u003E Manned, probe rovers\n\u003C/p\u003E\n\u003Cp style=\u0022margin-left:40px;\u0022\u003E\n\u003Cstrong\u003ELanders: \u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022margin-left:40px;\u0022\u003E\n\u003Cstrong\u003EShips:\u003C/strong\u003E Aeroplanes, SSTOs, ships\n\u003C/p\u003E\n\u003Cp style=\u0022margin-left:40px;\u0022\u003E\n\u003Cstrong\u003EStations:\u003C/strong\u003E Unmanned Stations, Manned Stations, motherships, fuel depots\n\u003C/p\u003E\n\u003Cp style=\u0022margin-left:40px;\u0022\u003E\n\u003Cstrong\u003EBases: \u003C/strong\u003EMining, Science\n\u003C/p\u003E\n\u003Cp style=\u0022margin-left:40px;\u0022\u003E\n\u003Cstrong\u003EEVA:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022margin-left:40px;\u0022\u003E\n\u003Cstrong\u003EFlags:\u003C/strong\u003E Markers (pennants instead of flags), Flags\n\u003C/p\u003E\n\u003Cp style=\u0022margin-left:40px;\u0022\u003E\n\u003Cstrong\u003EAsteroids:\u003C/strong\u003E Asteroids, asteroid bases\n\u003C/p\u003E\n\u003Cp style=\u0022margin-left:40px;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThis is just a few of the ideas I had off the top of my head, and would love to add more and maybe tr to get this considered for the game or a mod (with help of course).\n\u003C/p\u003E\n"},{"CreatedByName":"razark","CreatedById":32993,"CreatedDateTime":"2016-03-23T23:09:15Z","Content":"\n\u003Cp\u003E\nWe need the ability to create our own classifications of vessels.  Having more is good, but no set group is going to make everyone happy.  Players should have the ability to add new categories and assign them an icon.\n\u003C/p\u003E\n"},{"CreatedByName":"HorusKol","CreatedById":117326,"CreatedDateTime":"2016-03-24T02:14:06Z","Content":"\n\u003Cp\u003E\nYou could go further - like, tag ships as \u0022Duna\u0022 to show only those craft you are sending or have orbiting Duna...\n\u003C/p\u003E\n"},{"CreatedByName":"samstarman5","CreatedById":12469,"CreatedDateTime":"2016-03-24T04:33:10Z","Content":"\n\u003Cp\u003E\nThat sounds like something that could very potentially make a mess of the map screen and add more confusion than it might be worth, especially if you want to really single them out in map view.\n\u003C/p\u003E\n\u003Cp\u003E\nOne could simply work a prefix system to the names of their crafts to help know what they are more specifically.  For example, a fuel depot station could be called FDS Guzzler. A science processing station would be SPS Knowitall.  If you stick to specific and consistent abbreviations without repeating, it would get easy after some practice and memorization to tell them out.  Don\u0027t hesitate to use a notepad or some post-its to write them down.\n\u003C/p\u003E\n\u003Cp\u003E\nCurrently, I don\u0027t get that specific, but I have been in the habit of prefixing my ships with KSS for spaceship, KOS for orbital station, and KSL for ship-lander(etc.). I get the feeling that will change with 1.1, so I will definitely be expanding on the list of prefixes for my fleet. Also, if I want to go into the file folder I can tell them out easily there since that only differentiates between vessels built in the VAB and SPH.\n\u003C/p\u003E\n"},{"CreatedByName":"T.A.P.O.R.","CreatedById":137748,"CreatedDateTime":"2016-03-24T06:28:17Z","Content":"\n\u003Cp\u003E\nIf I\u0027m missing something let me know, but I\u0027d like to be able to set craft type in the VAB and Hangar before launch and not have to rely on the root part.\n\u003C/p\u003E\n\u003Cp\u003E\nalso I find that when my craft separated into two, I get the opposite to what I expected fairly often.\n\u003C/p\u003E\n\u003Cp\u003E\nby that I mean my lander is categorised as a ship and vice versa.\n\u003C/p\u003E\n\u003Cp\u003E\nthis mostly happens with stations.\n\u003C/p\u003E\n"},{"CreatedByName":"jlcarneiro","CreatedById":79196,"CreatedDateTime":"2016-03-24T06:39:26Z","Content":"\n\u003Cp\u003E\nThat\u0027s a nice idea!\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027d like, at least, a category similar to debris to group those crafts I don\u0027t want to show (landed vessels, for example) but that are NOT debris...\n\u003C/p\u003E\n"},{"CreatedByName":"MiniMatt","CreatedById":78749,"CreatedDateTime":"2016-03-24T07:21:43Z","Content":"\n\u003Cp\u003E\nI recall there was some talk, in one of the recent devnotes I think, of work undertaken to allow for better searching/ordering of crafts from the tracking station which (I *think*) was slated to be in 1.1.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ll try to rummage up a link, as whilst I don\u0027t think it went as far as your (excellent) suggestions, it may go some way to ease manageability of large fleets.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003Eedit:\u003C/strong\u003E \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/131794-devnote-tuesday-wednesday-edition-ii/\u0022\u003Efound it\u003C/a\u003E - though not quite as extensive as my memory led me to believe, essentially adding time to next maneuver node to the tracking station:\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222402271\u0022 data-ipsquote-contentid=\u0022131794\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221455125534\u0022 data-ipsquote-userid=\u002232604\u0022 data-ipsquote-username=\u0022Arsonide\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 2/10/2016 at 5:32 PM, Arsonide said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nA small clarification on this feature: the ETA of the next maneuver node is shown by slowly alternating it with the MET of the vessel as shown in the screenshot. Everything is still sorted by MET, so it\u0027s just a small quality of life feature to kind of grab the player\u0027s attention. It is not a sort, but that might be something worth looking at if and when we start displaying more information here, but for the moment it\u0027s just a small addition to see vessels that need your attention at a glance.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-03-24T07:46:16Z\u0022 title=\u002203/24/2016 07:46  AM\u0022 data-short=\u00228 yr\u0022\u003EMarch 24, 2016\u003C/time\u003E by MiniMatt\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2016-03-24T07:48:30Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222470679\u0022 data-ipsquote-contentid=\u0022134817\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458773323\u0022 data-ipsquote-userid=\u0022151497\u0022 data-ipsquote-username=\u0022RangerBoozma\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, RangerBoozma said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhat I\u0027m suggesting would be the ability to create more classifications of crafts.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027m gonna have to be that guy and say: we have a dedicated subforum for \u0022Suggestions and Development Discussion\u0022. \u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThis is a frequently suggested topic over there, by the way. It\u0027s just that it\u0027s a low priority issue that\u0027s unlikely to be on Squad\u0027s shortlist for immediate implementation while they have bigger fish to fry.\n\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2016-03-24T11:28:07Z","Content":"\n\u003Cp\u003E\nSuggestion moved to the suggestions forum.\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-03-24T14:36:43Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222471164\u0022 data-ipsquote-contentid=\u0022134817\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458800897\u0022 data-ipsquote-userid=\u0022137748\u0022 data-ipsquote-username=\u0022T.A.P.O.R.\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, T.A.P.O.R. said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIf I\u0027m missing something let me know, but I\u0027d like to be able to set craft type in the VAB and Hangar before launch and not have to rely on the root part.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI especially like this idea, mainly because it would dovetail nicely into the existing plumbing for dealing with vessel types, and therefore shouldn\u0027t be too hard to implement.\n\u003C/p\u003E\n\u003Cp\u003E\nOne of the things about suggestions:  it\u0027s not just how cool the suggestion is, it\u0027s how hard it would be to do.  It\u0027s a \u0022return on investment\u0022 thing.  If you\u0027re in Squad\u0027s position, and you only have a certain finite number of engineer-hours to spend on improving the game in any given release cycle, you have to focus on what will give you the most bang for your buck.  In other words:  how can we add the most value to the game for the least amount of effort?\n\u003C/p\u003E\n\u003Cp\u003E\nAllowing the player to set ship type in the VAB/SPH would be one of those things.\n\u003C/p\u003E\n\u003Cp\u003E\nAdding a few additional ship types (hardcoded, not configurable) would be another easy thing to do.  Add \u0022airplane\u0022 (lots of people wanting that!), and maybe two or three generic placeholder-type icons that people could use to designate whatever they want them to mean.\n\u003C/p\u003E\n\u003Cp\u003E\nOn the other hand, making it user-configurable would be a \u003Cem\u003E\u003Cu\u003Ehuge\u003C/u\u003E\u003C/em\u003E change, since it would break existing APIs and require rewriting lots of code.  Ship type is currently implemented as a C# \u003Cstrong\u003Eenum\u003C/strong\u003E, meaning a hard-coded and finite collection of specific values.  Adding new values to an enum is pretty straightforward; but changing a program from \u0022use a hard-coded list\u0022 to \u0022use a dynamically-configured list\u0022 is a much bigger change.  Nothing wrong with \u003Cem\u003E\u003Cu\u003Easking\u003C/u\u003E\u003C/em\u003E for it \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E ... but I kinda doubt that Squad would implement such a feature, at least not any time soon.  It\u0027s just too big an ask, for the amount of value it adds.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, my personal wishlist here is just:  add \u0022airplane\u0022 plus another two or three abstract icon types, and make the ship type settable in the VAB (with the former being a much higher priority than the latter, as far as I\u0027m concerned).\n\u003C/p\u003E\n\u003Cp\u003E\nMaking the ship type VAB-settable is something that a mod could do; but adding new ship types is something that no mod can touch, it would require an Act of Squad.\n\u003C/p\u003E\n\u003Cp\u003E\n(Another option to help users customize things would be to add some sort of \u003Cem\u003E\u003Cu\u003Eadditional\u003C/u\u003E\u003C/em\u003E field to ships, like color categories or something.  It\u0027s always easier to add a new thing than to change the semantics of an existing thing.  If I could check a box in the \u0022rename\u0022 dialog to choose \u0022what color should this ship be in the map view\u0022, even if I\u0027m limited to picking one of a list of half-a-dozen pre-selected colors, then I could totally go to town with that.)\n\u003C/p\u003E\n"},{"CreatedByName":"VaPaL","CreatedById":150974,"CreatedDateTime":"2016-03-24T17:49:48Z","Content":"\n\u003Cp\u003E\nI prefer the idea of creating custom groups for your crafts. After some time playing you eventually end with too much satellites, for instance, on Kerbin. Being able to classify them as Kerbin SOI Relay Network, Inner PLanets Relay, Outer Planets Relay, ComSats, MapSats, ScienceSats would be great. Not just to find them easily, but to show you only what you want on the map.\n\u003C/p\u003E\n"},{"CreatedByName":"Andem","CreatedById":155578,"CreatedDateTime":"2016-03-27T01:07:23Z","Content":"\n\u003Cp\u003E\nWhat we need is modularity and easily moddability.\n\u003C/p\u003E\n"},{"CreatedByName":"panzer1b","CreatedById":95108,"CreatedDateTime":"2016-03-28T15:28:19Z","Content":"\n\u003Cp\u003E\nI second this concept.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nRight now everything from starfighters to massive capital ships have the same icon, and i have to essentially mouse over them to check what its name it to get a clue about what the craft is (especially if i left it up in orbit for a while and come back to it later).\n\u003C/p\u003E\n\u003Cp\u003E\nneed to have following:\n\u003C/p\u003E\n\u003Cp\u003E\nfighter\n\u003C/p\u003E\n\u003Cp\u003E\nbomber\n\u003C/p\u003E\n\u003Cp\u003E\ncorvette\n\u003C/p\u003E\n\u003Cp\u003E\nfrigate\n\u003C/p\u003E\n\u003Cp\u003E\ndestroyer\n\u003C/p\u003E\n\u003Cp\u003E\ncruiser\n\u003C/p\u003E\n\u003Cp\u003E\nbattleship (although this is impossible to make without going above 4000 parts)\n\u003C/p\u003E\n\u003Cp\u003E\ncarrier\n\u003C/p\u003E\n\u003Cp\u003E\nsupply ship\n\u003C/p\u003E\n\u003Cp\u003E\ndropship\n\u003C/p\u003E\n\u003Cp\u003E\ntank\n\u003C/p\u003E\n\u003Cp\u003E\narmored car\n\u003C/p\u003E\n\u003Cp\u003E\nect\n\u003C/p\u003E\n"},{"CreatedByName":"ImmaStegosaurus!","CreatedById":160589,"CreatedDateTime":"2016-03-28T21:22:37Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222470679\u0022 data-ipsquote-contentid=\u0022134817\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458773323\u0022 data-ipsquote-userid=\u0022151497\u0022 data-ipsquote-username=\u0022RangerBoozma\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 22/03/2016 at 0:48 AM, RangerBoozma said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EProbes: \u003C/strong\u003ERelays (the kind you need for RemoteTech 2), probes, surveyors, satellites\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI wish satellites and relays were split into their own group. Probes and surveyors have destinations while relays and satellites do donuts.\n\u003C/p\u003E\n"}]}