{"TopicId":135095,"ForumId":55,"TopicTitle":"One engine to rule them all","CreatedByName":"Nich","CreatedById":145678,"CreatedDateTime":"2016-03-28T03:35:40Z","PageNum":1,"Articles":[{"CreatedByName":"Nich","CreatedById":145678,"CreatedDateTime":"2016-03-28T03:35:40Z","Content":"\n\u003Cp\u003E\nHis would probably be better as a mod idea then something for stock. The PES (perpously engineered engine) gives you sliders so you can set your atmospheric isp vacuum isp thurst gimbol range and form factor and use these to determine the mass of the engine.\n\u003C/p\u003E\n\u003Cp\u003E\nin the tech tree it would require nuke heavy and ion.\n\u003C/p\u003E\n\u003Cp\u003E\nabove a certain isp you would be required to use liquid or zenon.\n\u003C/p\u003E\n\u003Cp\u003E\nmore thrust = more mass\n\u003C/p\u003E\n\u003Cp\u003E\nmore isp = more mass\n\u003C/p\u003E\n\u003Cp\u003E\nidealy if you recreate an engine exactly you get the same mass but the real benefits come from removing what you don\u0027t need\n\u003C/p\u003E\n"},{"CreatedByName":"Vectura","CreatedById":119212,"CreatedDateTime":"2016-03-30T14:51:08Z","Content":"\n\u003Cp\u003E\nAnd what purpose would this really serve? Would it also change aesthetically, depending on the ISP and such? It would be dull as all hell if all the engines were identical.\n\u003C/p\u003E\n"},{"CreatedByName":"Nich","CreatedById":145678,"CreatedDateTime":"2016-03-30T16:08:09Z","Content":"\n\u003Cp\u003E\nA lot of times to optimize a design you need an inbetween engine. I was thinking you would use the moddel you are closest too.\n\u003C/p\u003E\n"},{"CreatedByName":"Jarin","CreatedById":71395,"CreatedDateTime":"2016-03-30T16:48:46Z","Content":"\n\u003Cp\u003E\nI could see this being decent as a mod. \u0022Procedural Engines\u0022 or somesuch.\n\u003C/p\u003E\n"},{"CreatedByName":"Rath","CreatedById":138223,"CreatedDateTime":"2016-04-02T01:57:26Z","Content":"\n\u003Cp\u003E\nMake bell curves change with ISP, thrust change combustion chamber size.\n\u003C/p\u003E\n\u003Cp\u003E\nProvide a few different base models too.\n\u003C/p\u003E\n\u003Cp\u003E\nSsme style, Saturn v model, shuttle oms, ion, monoprop (similar to the little radials), \n\u003C/p\u003E\n"}]}