{"TopicId":135587,"ForumId":39,"TopicTitle":"First Video - C-17 analogue paradropping ISRU rovers.","CreatedByName":"Volt","CreatedById":4686,"CreatedDateTime":"2016-03-31T23:05:54Z","PageNum":1,"Articles":[{"CreatedByName":"Volt","CreatedById":4686,"CreatedDateTime":"2016-03-31T23:05:54Z","Content":"\n\u003Cp\u003E\nSo I\u0027ve finally found some free video software with no strings attached and KSP is finally in a state where I can record (poorly) and play at the same time, so I thought I\u0027d baptise my old youtube channel with a quick video of what I\u0027ve been working on in 1.1P.\n\u003C/p\u003E\n\u003Cp\u003E\nThe Ryan C Mk.1 is a four-engine cargo aircraft capable of carrying 1.25m-ish payloads - up to about 15 tonnes of them - and deploying them via the rear cargo ramp. Unlike its Globemaster real-life counterpart, this guy does not do short landings or takeoffs or any particularly fast manoeuvring. In fact, flight dynamics wise it\u0027s basically a cargo A330 with awful low-speed characteristics. Such is vanilla. In the video configuration, it\u0027s kitted out with the retrofit for deploying three compact ISRU rovers I call \u0027Piglets\u0027 because of their goofy appearance, basically the smallest fully-equipped ISRU package I could produce, capable of making about 2 liquid fuel per day. At that rate, it\u0027ll take 75 days to fill its 150 LF capacity. So... not the best. When I\u0027ve got KIS installed, I\u0027m going to send out engineers on a STOL aircraft I designed today to tack chairs on and sit on them. I heard a levelled engineer increases your mining speed. Of course, I am dropping three of them, potentially in one location so it could be useful for fuelling up very, very tiny jets or drones. The idea of an air-parachute-deployed ISRU was planted in my head a while ago and practically burned a hole in my brain while I waited for 1.1, and I\u0027m so happy with the result that I decided to share it here.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022true\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/iPc-KbikpBE?feature=oembed\u0022 width=\u0022480\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI encountered a fair few developmental issues with the Piglet, namely the fact that the wheels just will not stop breaking in the cargo bay even though they\u0027re lashed down. I\u0027ve even edited the Rovemax wheels to give them 200m/s crash tolerance. No joy. For a while I was using docking ports on the bottom of the Piglet (a Mk 1 version) but they kept getting hung up during deployment and exploding, hilariously spitting the various peripherals out the back of the cargo ramp after the two core pieces popped. So it\u0027s been a bit of an ordeal and it\u0027s not quite over, but it\u0027s been a fun ordeal. Last time I did any plane building, I was only just starting engineering school, but with a bit more experience I\u0027m finding it easier and more rewarding to do this sort of thing. For anyone wondering about the naming... the Ryan is named after a pilot I met who was part of inspiring me to pursue that career path, and he flew a similar aircraft. I\u0027m a sentimental git.\n\u003C/p\u003E\n\u003Cp\u003E\nSorry if this post is a bit low-quality compared to a lot of the fanworks. It\u0027s sort of a test more than anything, to see if this video setup is any good. Thanks for reading if you got this far!\n\u003C/p\u003E\n"}]}