{"TopicId":135747,"ForumId":44,"TopicTitle":"Blue Origin Thread (merged)","CreatedByName":"Aethon","CreatedById":110755,"CreatedDateTime":"2014-09-10T15:20:34Z","PageNum":40,"Articles":[{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2015-02-20T09:31:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EIt is speculation, but recovering the boosters seems to fit with their business plan. There hasn\u0027t been an official announcement that I\u0027m aware of.\u003Cp\u003EWhat is worrying is that landing on a barge in the middle of the ocean appears to bring a whole new set of constraints (barge maintenance and availability, oceanic weather, etc...) which added to the launch constraints that are dictated by the payload (pad weather, launch windows, etc...), is going to make commercial offerings a bit awkward.\u003C/p\u003E\u003Cp\u003ESpeculations were that they would offer a discount for FH launches with recoverable boosters, but the recoverable booster option is not only going to have a much reduced payload, but is also going to have extra launch constraints tied to weather conditions at the recovery site and to the availability of the barge. Customers will have to accept a higher risk of scrubs and operational delays, which reduces the value of the reusable offering. Also increasing the possibility of recovery-related delays puts more pressure on SpaceX\u0027s already tight launch schedule. In the end, it might not all be worth it from a business perspective.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGood point, the recovery don\u0027t affect the customer much, an used stage has downsides but also some benefits, however the recovery itself is not the customers problem. \u003C/p\u003E\u003Cp\u003EFalcon heavy booster would be easier to fly back to pad as they drop earlier however the core will demand an barge landing. \u003C/p\u003E\u003Cp\u003EAs for now the barge is for testing it might be used later but then probably something larger and more sturdy.\u003C/p\u003E\n"},{"CreatedByName":"Woopert","CreatedById":84274,"CreatedDateTime":"2015-02-22T04:22:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Wingman703\u0022 data-cite=\u0022Wingman703\u0022\u003E\u003Cdiv\u003EAren\u0027t the names pretty much interchangeable? They are less then a mile from each other...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAbsolutely not! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Cape Canaveral Air Force Station is a military base and is very strict. Taking pictures while on the base is actually illegal. KSC is much more liberal with its rules and is a NASA facility. That being said, NASA and other companies do use USAF\u0027s launch pads with permission.\u003C/p\u003E\u003Cp\u003EAnother thing to note is that KSC is NOT actually on Cape Canaveral; rather, it is located on Merritt Island.\u003C/p\u003E\u003Cp\u003ECheers\u003C/p\u003E\n"},{"CreatedByName":"Sean Mirrsen","CreatedById":3873,"CreatedDateTime":"2015-02-22T06:25:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Woopert\u0022 data-cite=\u0022Woopert\u0022\u003E\u003Cdiv\u003EAbsolutely not! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Cape Canaveral Air Force Station is a military base and is very strict. Taking pictures while on the base is actually illegal. KSC is much more liberal with its rules and is a NASA facility. That being said, NASA and other companies do use USAF\u0027s launch pads with permission.\u003Cp\u003EAnother thing to note is that KSC is NOT actually on Cape Canaveral; rather, it is located on Merritt Island.\u003C/p\u003E\u003Cp\u003ECheers\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI forgot the details of the discussion, and was rather confused for a minute there as to which KSC you\u0027re talking about. XD\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2015-02-23T18:27:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EWhat is worrying is that landing on a barge in the middle of the ocean appears to bring a whole new set of constraints (barge maintenance and availability, oceanic weather, etc...) which added to the launch constraints that are dictated by the payload (pad weather, launch windows, etc...), is going to make commercial offerings a bit awkward.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, but the barge is just for testing. That\u0027s not how they\u0027re planning on recovering the boosters.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003ESpeculations were that they would offer a discount for FH launches with recoverable boosters, but the recoverable booster option is not only going to have a much reduced payload, but is also going to have extra launch constraints tied to weather conditions at the recovery site and to the availability of the barge. Customers will have to accept a higher risk of scrubs and operational delays, which reduces the value of the reusable offering. Also increasing the possibility of recovery-related delays puts more pressure on SpaceX\u0027s already tight launch schedule. In the end, it might not all be worth it from a business perspective.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWeather won\u0027t create delays when landing on land. They were able to successfully hover over stormy oceans with their last attempt- the problem was just that the barge didn\u0027t make a stable landing platform. On land, that\u0027s not an issue. Any weather that\u0027s good enough to launch during is good enough to pilot the launch stage back to the launch pad in 15 minutes later...\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EP.S.\u003C/strong\u003E As a side-note, why are you always so cynical about any possibility for advancing the state of spaceflight Nibb31? You\u0027ve took the altitude that nothing can be improved, and every new idea is worthless on at least 3 or 4 other threads like this I\u0027ve posted on in the past month...\u003C/p\u003E\n"},{"CreatedByName":"Airlock","CreatedById":101601,"CreatedDateTime":"2015-02-23T18:58:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Northstar1989\u0022 data-cite=\u0022Northstar1989\u0022\u003E\u003Cdiv\u003EYeah, but the barge is just for testing. That\u0027s not how they\u0027re planning on recovering the boosters.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOnly partially true. It\u0027s the only way SpaceX can recover the FH center core without a ridiculous impact on payload.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Northstar1989\u0022 data-cite=\u0022Northstar1989\u0022\u003E\u003Cdiv\u003EWeather won\u0027t create delays when landing on land. They were able to successfully hover over stormy oceans with their last attempt- the problem was just that the barge didn\u0027t make a stable landing platform. On land, that\u0027s not an issue. Any weather that\u0027s good enough to launch during is good enough to pilot the launch stage back to the launch pad in 15 minutes later...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETrue.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2015-02-24T08:22:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Northstar1989\u0022 data-cite=\u0022Northstar1989\u0022\u003E\u003Cdiv\u003EYeah, but the barge is just for testing. That\u0027s not how they\u0027re planning on recovering the boosters.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWe don\u0027t know for sure. Building a barge for 2 or 3 test landings only is a bit of an expense. \u0022Speculation\u0022 indicates that it will be repurposed to recover Falcon Heavy center cores or even Falcon 9 stages that can\u0027t take the performance hit of flyback manoeuvres. That hypothesis is supported by the fact that SpaceX is building a second barge for east coast launches, which would make no sense if it was just for a test campaign.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EWeather won\u0027t create delays when landing on land. They were able to successfully hover over stormy oceans with their last attempt- the problem was just that the barge didn\u0027t make a stable landing platform. On land, that\u0027s not an issue. Any weather that\u0027s good enough to launch during is good enough to pilot the launch stage back to the launch pad in 15 minutes later...\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESure, on land it\u0027s not a problem, and I\u0027m pretty confident that the land landings will be easier to pull off. I was specifically talking about water landings for the cases mentioned above. Weather certainly was a problem last time, and in this case, the launch window was linked to the payload and recovering the booster was a secondary concern. In the future, when customers are getting discounts for recovered boosters and the recovery is an operational requirement, high-sea weather and availability of the barge will become additional launch constraints. In such a context, either the launch would have been postponed for several weeks, or the customer would have to pay the additional cost of disposing the booster.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003Cstrong\u003EP.S.\u003C/strong\u003E As a side-note, why are you always so cynical about any possibility for advancing the state of spaceflight Nibb31? You\u0027ve took the altitude that nothing can be improved, and every new idea is worthless on at least 3 or 4 other threads like this I\u0027ve posted on in the past month...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI might sometimes sound a bit pessimistic, but it\u0027s probably because I have been sitting here looking at how the World works for a few more years than you, and there isn\u0027t really much to be optimistic about. However, one thing that bugs me is armchair engineers who think that they have it all figured out after playing KSP for a few months, when some of the smartest and most talented people on this planet are those working for big aerospace companies and agencies. Many of those armchair engineers love to assume that thousands of engineers and scientists are either all corrupt or simply stupid because they haven\u0027t built space elevators, launch loops, or microwave powered spaceplanes.\u003C/p\u003E\u003Cp\u003EAerospace companies know about these technologies. They have usually run trade-studies on them, because their business is to make money, and if they crack the holy grail of cheap access to space, they will make more money. They are stong R\u0026amp;D companies. Studying new stuff is their bread and butter. The reason they are not building those things is because their internal studies have shown that they are not viable, for various reasons.\u003C/p\u003E\u003Cp\u003EWhat SpaceX is doing is impressive. The engineering behind it is impressive, and the results are spectacular. So why haven\u0027t other space agencies pursued recoverable boosters? There have been dozens of studies since the days of Apollo, with all sorts of technical solutions. They are not doing it because real-world engineering is much harder and more expensive than it seems and because with current launch rates, the economics of recovering boosters does not make sense to them.\u003C/p\u003E\u003Cp\u003EThe key to cheap space access is demand, not technology. It\u0027s a vicious circle that is driven by economics more than technology. Costs will come down mechanically when there is volume, the actual technology that we will use by then doesn\u0027t really matter. It might happen in 20 or 200 or 2000 years, but when a substantial and viable demand appears, we will find a way.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-24T10:39:56Z\u0022 title=\u002202/24/2015 10:39  AM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 24, 2015\u003C/time\u003E by Nibb31\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Mighty1","CreatedById":95750,"CreatedDateTime":"2015-02-24T09:34:49Z","Content":"\n\u003Cp\u003EAnyone know what is the plan for the launch profile of the F9 heavy. I know that after booster seperation they turn around and go back, but the core will be going realy fast when it\u0027s done it\u0027s work. Will it turn back, land somewhere in the atlantic or africa or will it make one turn around the earth and then land. \u003C/p\u003E\u003Cp\u003EAlso, the last I heard is that the plans for 2nd stage have been scraped. Any changes in that plan?\u003C/p\u003E\n"},{"CreatedByName":"Sean Mirrsen","CreatedById":3873,"CreatedDateTime":"2015-02-24T09:40:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EMany of those armchair engineers love to assume that thousands of engineers and scientists are either all corrupt or simply stupid\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUm...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003Etheir business is to make money, and if they crack the holy grail of cheap access to space, they will make more money\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThe key to cheap space access is demand, not technology. It\u0027s a vicious circle that is driven by economics more than technology.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t know about you, but from a purely armchair engineer standpoint, the above qualifies for either one, or both, of the epithets in the first quote. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EYes, I know, \u0022that\u0027s how the world works\u0022. Well, then the world as it is, is stupid and/or corrupt. Being active parts of that world, the thousands of engineers and scientists you mention will also qualify. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2015-02-24T10:19:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mighty1\u0022 data-cite=\u0022Mighty1\u0022\u003E\u003Cdiv\u003EAnyone know what is the plan for the launch profile of the F9 heavy. I know that after booster seperation they turn around and go back, but the core will be going realy fast when it\u0027s done it\u0027s work. Will it turn back, land somewhere in the atlantic or africa or will it make one turn around the earth and then land. \u003Cp\u003EAlso, the last I heard is that the plans for 2nd stage have been scraped. Any changes in that plan?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe boosters will separate earlier, than the falcon 9 first stage making flyback easier. The core will overfly Florida if launched from Texas, it will go so fast it would be very expensive even with an braking burn to land in Florida or the Caribbean so you probably need an barge to recover it. \u003C/p\u003E\u003Cp\u003EThe barge is also an option if you can increase the payload on a Falcon 9 recoverable. If barge landings become common I guess they will use an larger one. \u003C/p\u003E\u003Cp\u003ECurrent project is for testing only, if it was the real deal the first thing you would do would be to get the equipment below deck.\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2015-02-24T10:19:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mighty1\u0022 data-cite=\u0022Mighty1\u0022\u003E\u003Cdiv\u003EAnyone know what is the plan for the launch profile of the F9 heavy. I know that after booster seperation they turn around and go back, but the core will be going realy fast when it\u0027s done it\u0027s work. Will it turn back, land somewhere in the atlantic or africa or will it make one turn around the earth and then land. \u003Cp\u003EAlso, the last I heard is that the plans for 2nd stage have been scraped. Any changes in that plan?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESpaceX doesn\u0027t publish its plans, so all of the options are pure speculation. As I said, SpaceX is building a second droneship for west coast launches, so they certainly think that they will be useful for regular operations after the test campaign. Since they are upgrading Vandenberg to launch Falcon Heavy, we can reasonably assume that they plan to recover the core boosters by landing them on the droneships in the middle of the ocean. Once the capability is operational, I don\u0027t see why they couldn\u0027t use it to recover Falcon 9 stages for some launches that can\u0027t afford the flyback manoeuver expenditure.\u003C/p\u003E\u003Cp\u003E2nd stage recovery isn\u0027t realistic or viable at this point. It might happen for whatever comes later, but I doubt we will see a fully recoverable Falcon.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sean Mirrsen\u0022 data-cite=\u0022Sean Mirrsen\u0022\u003E\u003Cdiv\u003EUm...\u003Cp\u003EI don\u0027t know about you, but from a purely armchair engineer standpoint, the above qualifies for either one, or both, of the epithets in the first quote. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOnly if you assume that running a business means that you are necessarily corrupt or stupid. \u003C/p\u003E\u003Cp\u003ERockets are an expensive and very low margin business. The business has been fine-tuned over the decades to be optimized for the demand levels that exist in the real world. When you are in that kind of market, you only do stuff if it makes sense economically. Just because you have \u0022better\u0022 technology doesn\u0027t mean that your solution is economically viable. \u003C/p\u003E\u003Cp\u003E(I use quotes on \u0022better\u0022, because the \u0022best\u0022 technology is the one that is optimal for a given set of requirements. In business, reusability, wings, fast turnaround, cool PR, or spectacular looks are not part of those requirements. The requirements are mission suitability and economical viability.)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-24T10:35:13Z\u0022 title=\u002202/24/2015 10:35  AM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 24, 2015\u003C/time\u003E by Nibb31\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SeaDog","CreatedById":116151,"CreatedDateTime":"2015-02-24T10:30:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nibb31\u0022 data-cite=\u0022Nibb31\u0022\u003E\u003Cdiv\u003EWe don\u0027t know for sure. Building a barge for 2 or 3 test landings only is a bit of an expense. \u0022Speculation\u0022 indicates that it will be repurposed to recover Falcon Heavy center cores or even Falcon 9 stages that can\u0027t take the performance hit of flyback manoeuvres. That hypothesis is supported by the fact that SpaceX is building a second barge for east coast launches, which would make no sense if it was just for a test campaign.\u003Cp\u003ESure, on land it\u0027s not a problem, and I\u0027m pretty confident that the land landings will be easier to pull off. I was specifically talking about water landings for the cases mentioned above. Weather certainly was a problem last time, and in this case, the launch window was linked to the payload and recovering the booster was a secondary concern. In the future, when customers are getting discounts for recovered boosters and the recovery is an operational requirement, high-sea weather and availability of the barge will become additional launch constraints. In such a context, either the launch would have been postponed for several weeks, or the customer would have to pay the additional cost of disposing the booster.\u003C/p\u003E\u003Cp\u003EI might sometimes sound a bit pessimistic, but it\u0027s probably because I have been sitting here looking at how the World works for a few more years than you, and there isn\u0027t really much to be optimistic about. However, one thing that bugs me is armchair engineers who think that they have it all figured out after playing KSP for a few months, when some of the smartest and most talented people on this planet are those working for big aerospace companies and agencies. Many of those armchair engineers love to assume that thousands of engineers and scientists are either all corrupt or simply stupid because they haven\u0027t built space elevators, launch loops, or microwave powered spaceplanes.\u003C/p\u003E\u003Cp\u003EAerospace companies know about these technologies. They have usually run trade-studies on them, because their business is to make money, and if they crack the holy grail of cheap access to space, they will make more money. Studying new stuff is their bread and butter. The reason they are not building those things is because their internal studies have shown that they are not viable, for various reasons.\u003C/p\u003E\u003Cp\u003EWhat SpaceX is doing is impressive. The engineering behind it is impressive, and the results are spectacular. So why haven\u0027t other space agencies pursued recoverable boosters? There have been dozens of studies since the days of Apollo, with all sorts of technical solutions. They are not doing it because real-world engineering is much harder and more expensive than it seems and because with current launch rates, the economics of recovering boosters does not make sense to them.\u003C/p\u003E\u003Cp\u003EThe key to cheap space access is demand, not technology. It\u0027s a vicious circle that is driven by economics more than technology. Costs will come down automatically when there is volume, the actual technology that we will use by then doesn\u0027t really matter. It might happen in 20 or 200 or 2000 years, but when a substantial and viable demand appears, we will find a way.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree that there are many armchair engineers who don\u0027t understand the difficulties of complex systems. My own field is more related to robotics and automatic control than rocketry, and I often feel the need to be the party pooper who tells everyone that the robots from for example boston dynamics arent really that revolutionary. They\u0027re basically just a development of 70\u0027s technology and that the real reason why our world isn\u0027t run by robots is simply because it\u0027s still insanely expensive to have robot do something that you can have a poor human do for one dollar per hour. We\u0027re absolutely not on the edge of some sci-fi robot revolution, sorry.\u003C/p\u003E\u003Cp\u003EAt the same time though, I do think you have to realize that simply because major players don\u0027t do something doesn\u0027t mean it\u0027s impossible. Back to my own field of autonomous control, I think major car manufacturers are lazy when it comes autonomous vehicles and machines. I think the basic problem is that they\u0027re good at making cars and machines that are fun, safe and easy to drive. All manufacturers develop their machines around the operator. If you try to make self driving machines, you\u0027re bringing the operator out of the equation, and nothing scares the major manufacturers more than that, becuase building around the operator is what they think they\u0027re good at. So they only do halfhearted attempts, because they feel the idea is fundamentally bad. I\u0027ve been in touch with the industry on these halfhearted attempts, and it\u0027s amazing to se a company try and do something that it actually doesn\u0027t believe in. They\u0027re doing a project mostly to show investors that it doesn\u0027t work. Mindboggling. That\u0027s not to say that all new ideas would work, but many companies are not really trying new stuff even though they say they do.\u003C/p\u003E\u003Cp\u003EAnd without having detailed knowledge about rocketry, I think the problem could be similar here. Major rocket developers feel that their strength lies in producing cheap rockets from serial production that need a bare minimum amount fuel. For reusability, you\u0027re strapping on extra fuel in order to reduce production series. That just does not fit in the mindsets of these developers, it seems stupid. It is the opposite of what they\u0027ve been doing. So they try halfhearted stuff like reusable boosters, but they would never dare to do rockets that are designed to be reusable to begin with, because it would make their primary strenghts useless. It would be like admitting that what they\u0027ve been doing before was leading down the wrong path.\u003C/p\u003E\n"},{"CreatedByName":"Frozen_Heart","CreatedById":118627,"CreatedDateTime":"2015-02-24T11:07:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EAlso, the last I heard is that the plans for 2nd stage have been scraped. Any changes in that plan?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey can\u0027t do it without impacting the payload of the Falcon 9 so much that it is no longer worth it. The ISP of Kerosene is just too low which is partially why they are switching to methane for the Raptor engine. As the Falcon Heavy uses the same upper stage as the Falcon 9 by extension it will also not be able to have it reused.\u003C/p\u003E\u003Cp\u003EPersonally I think that a 9 Raptor, methane powered launch system would be a good option. Similar thrust to the Falcon Heavy but single core and benefits from the Raptors much higher ISP. They core would also not be nearly as far downrange as the central core of the Heavy and so easier to recover.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2015-02-24T11:27:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SeaDog\u0022 data-cite=\u0022SeaDog\u0022\u003E\u003Cdiv\u003EI agree that there are many armchair engineers who don\u0027t understand the difficulties of complex systems. My own field is more related to robotics and automatic control than rocketry, and I often feel the need to be the party pooper who tells everyone that the robots from for example boston dynamics arent really that revolutionary. They\u0027re basically just a development of 70\u0027s technology and that the real reason why our world isn\u0027t run by robots is simply because it\u0027s still insanely expensive to have robot do something that you can have a poor human do for one dollar per hour. We\u0027re absolutely not on the edge of some sci-fi robot revolution, sorry.\u003Cp\u003EAt the same time though, I do think you have to realize that simply because major players don\u0027t do something doesn\u0027t mean it\u0027s impossible. Back to my own field of autonomous control, I think major car manufacturers are lazy when it comes autonomous vehicles and machines. I think the basic problem is that they\u0027re good at making cars and machines that are fun, safe and easy to drive. All manufacturers develop their machines around the operator. If you try to make self driving machines, you\u0027re bringing the operator out of the equation, and nothing scares the major manufacturers more than that, becuase building around the operator is what they think they\u0027re good at. So they only do halfhearted attempts, because they feel the idea is fundamentally bad. I\u0027ve been in touch with the industry on these halfhearted attempts, and it\u0027s amazing to se a company try and do something that it actually doesn\u0027t believe in. They\u0027re doing a project mostly to show investors that it doesn\u0027t work. Mindboggling. That\u0027s not to say that all new ideas would work, but many companies are not really trying new stuff even though they say they do.\u003C/p\u003E\u003Cp\u003EAnd without having detailed knowledge about rocketry, I think the problem could be similar here. Major rocket developers feel that their strength lies in producing cheap rockets from serial production that need a bare minimum amount fuel. For reusability, you\u0027re strapping on extra fuel in order to reduce production series. That just does not fit in the mindsets of these developers, it seems stupid. It is the opposite of what they\u0027ve been doing. So they try halfhearted stuff like reusable boosters, but they would never dare to do rockets that are designed to be reusable to begin with, because it would make their primary strenghts useless. It would be like admitting that what they\u0027ve been doing before was leading down the wrong path.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENone took self driving cars seriously before the Darpa challenges even if it would have obvious benefits for military use. Afterwards everyone want to use them in normal traffic who is far harder because you can not have many accidents, however its where the big money is. \u003C/p\u003E\u003Cp\u003ESpace rocket evolved from ICBM and still share some of the thinking. \u003C/p\u003E\u003Cp\u003EAnother issue is that perfect is the enemy of good enough, or why bother just reusing the first stage, most of the earlier reusable designs has used wings. This is an obvious solution however it transfer your booster into an huge supersonic plane something who is expensive. You then have to calculate the development costs against the expected number of launches. Then find the cash to develop it.\u003C/p\u003E\n"},{"CreatedByName":"bigdad84","CreatedById":49379,"CreatedDateTime":"2015-02-25T02:32:08Z","Content":"\n\u003Cp\u003ESoooooo, when\u0027s the next launch?\u003C/p\u003E\n"},{"CreatedByName":"sgt_flyer","CreatedById":57690,"CreatedDateTime":"2015-02-25T03:09:12Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022http://spaceflightnow.com/launch-schedule/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://spaceflightnow.com/launch-schedule/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ETandem sat launch - with a launch window between 03h49 AM and 4h34 AM on march 2nd (GMT time). (10H49 PM / 11h34 PM on march 1st EST time). First tandem launch falcon 9 has to make - but very heavy (seems they did not add the landing legs on this one - so no recovery attempt, they need the full payload capability)\u003C/p\u003E\u003Cp\u003EThe two sats uses boeing 702sp satellite bus - no chemical propellants onboard, those use only ion thrusters \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2015-02-25T04:22:54Z","Content":"\n\u003Cp\u003EIt\u0027s not really a tandem launch from the Spacex side; these sats are built to connect together without any extra support structures, and separate after orbital insertion.\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2015-02-25T08:48:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022bigdad84\u0022 data-cite=\u0022bigdad84\u0022\u003E\u003Cdiv\u003ESoooooo, when\u0027s the next launch?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe next booster recovery attempt is expected to be CRS flight 6, tentatively scheduled no earlier than the second week of April.\u003C/p\u003E\u003Cp\u003ETwo more launches in between now and then, but neither will have the fuel margins for landing attempts.\u003C/p\u003E\n"},{"CreatedByName":"Airlock","CreatedById":101601,"CreatedDateTime":"2015-03-01T03:49:23Z","Content":"\n\u003Cp\u003EIs that a Falcon on your strongback, or are you just happy to see me? \u003C/p\u003E\u003Cp\u003EThere will be no landing attempt on this flight, so I will not be covering the launch in the OP. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\n"},{"CreatedByName":"Airlock","CreatedById":101601,"CreatedDateTime":"2015-03-01T22:00:08Z","Content":"\n\u003Cp\u003EJRTI is in port in JAX. Under repairs after that wave damage.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/57lOY\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"RocketPilot573","CreatedById":62803,"CreatedDateTime":"2015-03-02T03:14:40Z","Content":"\n\u003Cp\u003EWeather 90% \u003Ca href=\u0022http://spaceflightnow.com/2015/02/28/falcon-9-mission-status-center/\u0022 rel=\u0022external nofollow\u0022\u003EGO\u003C/a\u003E!\u003C/p\u003E\n"},{"CreatedByName":"Wingman703","CreatedById":137567,"CreatedDateTime":"2015-03-02T03:32:19Z","Content":"\n\u003Cp\u003EStream just went live, even though its another \u0027boring\u0027 sat launch, still tuning in.\u003C/p\u003E\n"},{"CreatedByName":"Frida Space","CreatedById":60943,"CreatedDateTime":"2015-03-02T03:58:46Z","Content":"\n\u003Cimg src=\u0022https://3.bp.blogspot.com/-rNBnFVTHZWQ/VPPff7XktqI/AAAAAAAADhA/d7mbZ0Kj4yk/s1600/liftoff.PNG\u0022 alt=\u0022liftoff.PNG\u0022\u003E\n"},{"CreatedByName":"astropapi1","CreatedById":57507,"CreatedDateTime":"2015-03-02T04:01:55Z","Content":"\n\u003Cp\u003EDid I... Did I miss something?\u003C/p\u003E\u003Cp\u003EDamn, just tuned in to the guy saying \u0022Thanks for watching!\u0022 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2015-03-02T04:05:26Z","Content":"\n\u003Cp\u003EWe had a few moments to enjoy zero G liquid oxygen tank interior. Very nice, like some magic portal.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s12.postimg.org/m8axxgoy5/falcon9eutelsatmarch2nd2015.png\u0022 alt=\u0022falcon9eutelsatmarch2nd2015.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Airlock","CreatedById":101601,"CreatedDateTime":"2015-03-02T04:54:45Z","Content":"\n\u003Cdiv\u003E\u003C/div\u003E\n"}]}