{"TopicId":135747,"ForumId":44,"TopicTitle":"Blue Origin Thread (merged)","CreatedByName":"Aethon","CreatedById":110755,"CreatedDateTime":"2014-09-10T15:20:34Z","PageNum":279,"Articles":[{"CreatedByName":"_Augustus_","CreatedById":115084,"CreatedDateTime":"2016-10-07T11:59:12Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222790407\u0022 data-ipsquote-contentid=\u0022135747\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221475767299\u0022 data-ipsquote-userid=\u002298962\u0022 data-ipsquote-username=\u0022Streetwind\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n20 hours ago, Streetwind said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nPerhaps we\u0027ll also go back to the Moon on the egos of billionaires, too \u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBlue Origin\u0027s suborbital rocket is named after the first US astronaut who did a suborbital spaceflight. Blue Origin\u0027s orbital rocket is named after the first US astronaut who did an orbital spaceflight. Blue Origin\u0027s next secret project is named after the first US astronaut who walked on the Moon... what does this tell us? \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nCould be a whole number of things, really, but that \u003Cem\u003Eis\u003C/em\u003E kind of a strong nod towards the Moon. Also consider that Blue Origin works closely with ULA, and ULA wants to develop cislunar space in the coming decades.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI would agree with this. \n\u003C/p\u003E\n"},{"CreatedByName":"Lukaszenko","CreatedById":95776,"CreatedDateTime":"2016-10-07T12:49:58Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222791630\u0022 data-ipsquote-contentid=\u002288441\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221475835800\u0022 data-ipsquote-userid=\u002291005\u0022 data-ipsquote-username=\u0022Northstar1989\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Northstar1989 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nRisk equations are probability times consequence.  For instance a 1% chance of losing a million dollars is a much larger risk than a 10% chance of losing 10 dollars.  There is a much larger chance of something going wrong with the lander architecture (say a bad docking causing a tiny hull breach near one of the dicking ports, or one of the landers becoming inoperable), but the consequences are much less for most such failures.\n\u003C/p\u003E\n\u003Cp\u003E\nThe overall risk is less because, for example, losing one of four redundant landers (and 2-3 crew members with it) in a crash due to a landing computer failure is not nearly so bad as losing the entire ITS due to a couple of the thermal tiles failing in a repeat of the Columbia disaster.  Putting all your eggs in different baskets increases your chances of losing an egg or two- but greatly decreases your chances of losing ALL your eggs...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI don\u0027t know man...something\u0027s off in these risk calculations.\n\u003C/p\u003E\n\u003Cp\u003E\nWhich lander would you rather be on? The 1 of many that has a 10% chance of failing, or the single one with many more people....that has a 1% chance of failing?\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m pretty sure a tiny lander with 2-3 people crashing would be pretty darn bad. Maybe not as bad as a 100 person lander crashing, but certainly not merely 2-3% as bad. If there\u0027s a situation where putting all your eggs in one basket, and making sure that basket is as good as you can make it, then this one is it. \n\u003C/p\u003E\n"},{"CreatedByName":"Frozen_Heart","CreatedById":118627,"CreatedDateTime":"2016-10-07T13:01:14Z","Content":"\n\u003Cp\u003E\nI think Musk has decided on this architecture not because it is the best or the most efficient, but because it has the fewest vehicles to develop and so will be cheaper and quicker to produce and has the highest chance of being built.\n\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2016-10-07T17:41:56Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222791791\u0022 data-ipsquote-contentid=\u002288441\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221475845274\u0022 data-ipsquote-userid=\u0022118627\u0022 data-ipsquote-username=\u0022Frozen_Heart\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Frozen_Heart said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI think Musk has decided on this architecture not because it is the best or the most efficient, but because it has the fewest vehicles to develop and so will be cheaper and quicker to produce and has the highest chance of being built.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nTrue, an more efficient transfer interplanetary rocket would cut fuel needs to an faction, However an NTR would require hydrogen to max effect it would also be disposable as you could not land on Mars with it. Other engines will either take too long to develop or don\u0027t help much in the Mars in 80-120 days plan. \u003Cbr\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Spaceception","CreatedById":152800,"CreatedDateTime":"2016-10-08T01:07:47Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222789529\u0022 data-ipsquote-contentid=\u0022135747\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221475710348\u0022 data-ipsquote-userid=\u0022147986\u0022 data-ipsquote-username=\u0022Bluegillbronco2\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 10/5/2016 at 7:32 PM, Bluegillbronco2 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nJust a quick note. According to the Blue Origin website the \u003Cabbr title=\u0022Launch Escape System\u0022\u003ELES\u003C/abbr\u003E system puts out 70,000 lbs of thrust. And the capsule weighs 6,000 according to the live stream commentator. That means the thing has a \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E off the booster of 11. Quite impressive.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nTurn it up to 11!\n\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2016-10-08T04:46:32Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222791685\u0022 data-ipsquote-contentid=\u002288441\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221475838952\u0022 data-ipsquote-userid=\u0022135480\u0022 data-ipsquote-username=\u0022Gkirmathal\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn Friday, October 07, 2016 at 6:15 AM, Gkirmathal said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/91005-northstar1989/\u0026amp;do=hovercard\u0022 data-mentionid=\u002291005\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/91005-northstar1989/\u0022 rel=\u0022\u0022\u003E@Northstar1989\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nYes I think you are correct, but I also think Musk is fully aware of this and that he is limited in what he can currently accomplish financially. And that makes it a rather Catch-22 situation for them when designing anything. Sacrifices to have to be made \u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe ITS design shown last week, seems to me, \u003Cem\u003Ea compromise\u003C/em\u003E between what is currently financial possible for SpaceX in the coming two decades and what is technically possible. That is why I think Musk initially chose the easy road.\n\u003C/p\u003E\n\u003Cp\u003E\nMaybe RedDragon will add to their current design idea\u0027s, maybe it will not. We don\u0027t know yet. Might be fully possible that they conclude after RedDragon, they really need an extra LMO only system with ITS. We don\u0027t know yet.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso agree on the need to lay some more initial foundations, although think of it, you have a \u0027small\u0027 budget with an \u003Cem\u003Euncertain global economical future.\u003C/em\u003E What would you do, extend R\u0026amp;D time with the risk of the whole program coming to a halt due to future economics going bad. Or, design a system now, current ITS plans, which can be build within a foreseeable time frame and with the current economical situation, with the current tech.\n\u003C/p\u003E\n\u003Cp\u003E\nAs much as I would personally ALSO, like you, want to have separate lander systems for Mars LO/LEO/Moon. \u003Cstrong\u003EI\u003C/strong\u003E have to give in that currently it would make it too complex to design, for ONE company, within the time frame Musk wants to accomplish it. Like I said, maybe RedDragon will add to their plans.\n\u003C/p\u003E\n\u003Cp\u003E\nAbout the Moon, IMO it would be more possible within 4 years to design something around Falcon Heavy. But I think the Chinese will beat the West to it.\n\u003C/p\u003E\n\u003Cp\u003E\nAs for the heated discussion you have with Derek, I really think you are both correct. Only your idea lays about 20 years in the future \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E And that is not bad! We need to think and be able to discuss about any possibility and not be harsh about it. Every idea has it\u0027s place in time \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou have a point...  You\u0027re right- Musk\u0027s current plan is a compromise between an ideal system, and one that doesn\u0027t risk too much on the global economy...  Perhaps, seen from that perspective, it makes perfect sense for Musk to do what he\u0027s doing.  But I\u0027m not entirely sold on that- if the global economy really crashes hard enough (ssay, due to Peak Oil) I\u0027m not sure *either* plan will survive.\n\u003C/p\u003E\n\u003Cp\u003E\nSo I don\u0027t think there\u0027s that much added risk from extending the R\u0026amp;D timeline out a bit- in fact, just the opposite- Musk has a steady cashflow from SpaceX and Tesla Motors right now.  If he stays reliant on that income for longer, rather than borrowing money to get the ITS developed sooner, there\u0027s actually *less* risk involved...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nRegards,\n\u003C/p\u003E\n\u003Cp\u003E\nNorthstar\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222791778\u0022 data-ipsquote-contentid=\u002288441\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221475844598\u0022 data-ipsquote-userid=\u002295776\u0022 data-ipsquote-username=\u0022Lukaszenko\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn Friday, October 07, 2016 at 7:49 AM, Lukaszenko said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI don\u0027t know man...something\u0027s off in these risk calculations.\n\u003C/p\u003E\n\u003Cp\u003E\nWhich lander would you rather be on? The 1 of many that has a 10% chance of failing, or the single one with many more people....that has a 1% chance of failing?\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m pretty sure a tiny lander with 2-3 people crashing would be pretty darn bad. Maybe not as bad as a 100 person lander crashing, but certainly not merely 2-3% as bad. If there\u0027s a situation where putting all your eggs in one basket, and making sure that basket is as good as you can make it, then this one is it. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe 10% risk was just a number used to illustrate the concept.  In reality it\u0027s probably less than that.  But even if it\u0027s not, the 10% risk would be of any of the landers crashing by the end of 12 uses, not a specific lander crashing on a specific launch.\n\u003C/p\u003E\n\u003Cp\u003E\nThis is a perfect example of how the human brain is bad at comparing probabilities, and why we need to do the math...\n\u003C/p\u003E\n\u003Cp\u003E\nIf you compare  the numbers for a 10 or even 25% chance of losing one 2-man lander crew in 55 or 60 flights (because you could probably increase the per-ITS payload 10-20% with a lander architecture) vs. a 0.5% chance of losing all 100 souls on the ITS in a catastrophic failure, your individual chances of survival are actually *higher* with the lander architecture.  That\u0027s because your chances are only 1 in 55 to 1 in 60 of being on the lander that crashes if that occurs (an event with an only 10-25% chance of happening at all), whereas your odds are 100% of being on the ITS if it burns up or crashes...\n\u003C/p\u003E\n\u003Cp\u003E\nThe odds of death are 1 in 200 with the \u0022classic\u0022 ITS architecture vs. between 1 in 220 and 1 in 600 with the lander architecture, depending on the odds of catastrophic lander failure (1 in 10, to 1 in 4) and number of total manned lander flights (55 to 60).  Your odds are somewhere between 10% and 200% better of surviving landing with a lander architecture.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nRegards,\n\u003C/p\u003E\n\u003Cp\u003E\nNorthstar\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222792155\u0022 data-ipsquote-contentid=\u002288441\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221475862116\u0022 data-ipsquote-userid=\u002257801\u0022 data-ipsquote-username=\u0022magnemoe\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n22 hours ago, magnemoe said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nTrue, an more efficient transfer interplanetary rocket would cut fuel needs to an faction, However an NTR would require hydrogen to max effect it would also be disposable as you could not land on Mars with it. Other engines will either take too long to develop or don\u0027t help much in the Mars in 80-120 days plan. \u003Cbr\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNothing about landers, cyclers, or cargo-crew specialization requires NTR\u0027s.  In fact, nothing about them requires any technology the ITS won\u0027t already have... (the lander architecture is lower-tech in fact, since it doesn\u0027t really *need* composite fuel tanks in order to save you a lot of mass...)\n\u003C/p\u003E\n\u003Cp\u003E\nNTR\u0027s are way out there.  Not saying they couldn\u0027t be done, but the stuff I\u0027m describing is actually much lower-tech (Buzz Aldrin did most of his work on Cycler Ship architectures in the 70\u0027s, for crying out loud!)\n\u003C/p\u003E\n\u003Cp\u003E\nThat said, there will always be those who say it cannot be done\u0022.  Just like, *not coincidentally*, most of the people who are criticizing me for arguing Musk should be using landers and maybe eventually a Cycler or Cargo/Crew seperation are the *SAME* people saying Musk\u0027s ITS plans are unrealistic for \u0022all but glossy-eyed fanboys\u0022 and will never be accomplished.\n\u003C/p\u003E\n\u003Cp\u003E\nHint, again, that\u0027s *not* a coincidence. There will always be naysayers.  There were plenty of people who said we\u0027d never make it to the Moon (and for that matter, plenty who still deny it ever happened), and there are and will be plenty more who say we\u0027ll never colonize Mars.  It\u0027s much easier to play the cynic than to think of real solutions, real ways you could accomplish something better, more efficiently, safer, cheaper...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222791741\u0022 data-ipsquote-contentid=\u002288441\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221475841551\u0022 data-ipsquote-userid=\u00227272\u0022 data-ipsquote-username=\u0022Nibb31\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn Friday, October 07, 2016 at 6:59 AM, Nibb31 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNorthstar, I think you really have to let it go.\n\u003C/p\u003E\n\u003Cp\u003E\nMusk\u0027s space program is Musk\u0027s space program. He\u0027s been working at it for years, employing thousands of bright people to think up the mission architecture, and this is what he has come up with. It complies to his requirements, which are dictated by SpaceX\u0027s business plan, technological capability, and schedule. And it also has to look cool.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat it doesn\u0027t involve are cyclers, landers, and smaller vehicles with more frequent launches. You can discuss these things as much as you want, but those ideas are not part of Musk\u0027s vision, and nobody is going to make him throw away years of SpaceX studies and prototyping. His plan has plenty of flaws that make it pretty unrealistic for anyone who isn\u0027t a starry-eyed fanboy, but you\u0027re not going to change the basic architecture. Posting page after page of walls of text on the subject won\u0027t change his mind. I suggest that if you want to open a thread to discuss the Northstar Mars Colonization Architecture, you do so.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nStudies?  Prototyping?  Musk\u0027s plans haven\u0027t gotten to that point yet.  He\u0027s still working on the Raptor engine and the composite fuel-tanks.  He hasn\u0027t even *begun* to challenge the seriously difficult problem of safe orbital refueling, as far as anyone knows.  He definitely hasn\u0027t shifted \u0022thousands of bright people\u0022 to the overall mission architecture yet (that would be a MUCH larger effort than the \u00225% of SpaceX\u0027s technical staff\u0022 he says were *recently* shifted to working on challenges in some way related to his Mars plan or spacecraft)- in fact, he\u0027s said himself the architecture may be subject to changes...\n\u003C/p\u003E\n\u003Cp\u003E\nI find your suggestion of creating a \u0022Northstar Mars Colonization Architecture\u0022 rude and condescending (although, coincidentally, I have given some thought to reviving the long-dead Duna Mission Architecture Challenge on these forums with a new thread if my own on a couple occasions...  But that\u0027s not the same as what we\u0027re discussing here.)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nRegards,\n\u003C/p\u003E\n\u003Cp\u003E\nNorthstar\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nJust some numbers to inform future discussions...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022line-height:1.6;\u0022\u003EDelta-V requirements:\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n3.8 km/s (approx., depending on ascent efficiency) for launch from Martian surface to LMO\n\u003C/p\u003E\n\u003Cp\u003E\n3.9-4.2 km/s approx. Delta-V provided by ITS booster before engine cutoff (note- actual cutoff speed much lower, includes gravity and aero losses)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022line-height:1.6;\u0022\u003E5.4 km/s to LEO from ITS booster seperation\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022line-height:1.6;\u0022\u003E5.7 km/s for return from LMO to LEO\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022line-height:1.6;\u0022\u003E8 km/s (not including aerobraking) for 3-5 month to Mars and capture.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022line-height:1.6;\u0022\u003E9.5 km/s (not including aerobraking) for low-energy return from Martian surface to LEO\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022line-height:1.6;\u0022\u003E9.2-9.6 km/s (total, for highly efficient ascents) Delta-V for ascent to LEO from Earth\u0027s surface\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022line-height:1.6;\u0022\u003EI hope these figures can lead to a more informed discussion.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022line-height:1.6;\u0022\u003ERegards,\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022line-height:1.6;\u0022\u003ENorthstar\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2016-10-08T10:44:34Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/91005-northstar1989/\u0026amp;do=hovercard\u0022 data-mentionid=\u002291005\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/91005-northstar1989/\u0022 rel=\u0022\u0022\u003E@Northstar1989\u003C/a\u003E Please concatenate your posts, there is no need to double, triple or quadruple post here. \n\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2016-10-08T10:47:18Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222793088\u0022 data-ipsquote-contentid=\u002288441\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221475923474\u0022 data-ipsquote-userid=\u002212858\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 minutes ago, Red Iron Crown said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/91005-northstar1989/\u0026amp;do=hovercard\u0022 data-mentionid=\u002291005\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/91005-northstar1989/\u0022 rel=\u0022\u0022\u003E@Northstar1989\u003C/a\u003E Please concatenate your posts, there is no need to double, triple or quadruple post here. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nVery difficult to do, as I\u0027m posting from mobile (hence all the typo\u0027s, and edits to fix them) and the mobile site doesn\u0027t seem to allow me to easily multi-quote multiple different people like I can from my laptop...\n\u003C/p\u003E\n\u003Cp\u003E\nApologies if I missed a way to do so.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nRegards,\n\u003C/p\u003E\n\u003Cp\u003E\nNorthstar\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-10-08T10:48:02Z\u0022 title=\u002210/08/2016 10:48  AM\u0022 data-short=\u00227 yr\u0022\u003EOctober 8, 2016\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2016-10-08T10:47:55Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222792933\u0022 data-ipsquote-contentid=\u002288441\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221475903825\u0022 data-ipsquote-userid=\u002291005\u0022 data-ipsquote-username=\u0022Northstar1989\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, Northstar1989 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNothing about landers, cyclers, or cargo-crew specialization requires NTR\u0027s.  In fact, nothing about them requires any technology the ITS won\u0027t already have... (the lander architecture is lower-tech in fact, since it doesn\u0027t really *need* composite fuel tanks in order to save you a lot of mass...)\n\u003C/p\u003E\n\u003Cp\u003E\nNTR\u0027s are way out there.  Not saying they couldn\u0027t be done, but the stuff I\u0027m describing is actually much lower-tech (Buzz Aldrin did most of his work on Cycler Ship architectures in the 70\u0027s, for crying out loud!)\n\u003C/p\u003E\n\u003Cp\u003E\nThat said, there will always be those who say it cannot be done\u0022.  Just like, *not coincidentally*, most of the people who are criticizing me for arguing Musk should be using landers and maybe eventually a Cycler or Cargo/Crew seperation are the *SAME* people saying Musk\u0027s ITS plans are unrealistic for \u0022all but glossy-eyed fanboys\u0022 and will never be accomplished.\n\u003C/p\u003E\n\u003Cp\u003E\nHint, again, that\u0027s *not* a coincidence. There will always be naysayers.  There were plenty of people who said we\u0027d never make it to the Moon (and for that matter, plenty who still deny it ever happened), and there are and will be plenty more who say we\u0027ll never colonize Mars.  It\u0027s much easier to play the cynic than to think of real solutions, real ways you could accomplish something better, more efficiently, safer, cheaper...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNo NTR is not needed, however most other Mars missions focus on better engines to keep mass faction up and launch size down as this saves money.\u003Cbr\u003E\nMusk goes the other way around, lets build an giant reusable rocket to lift the fuel. \u003Cbr\u003E\u003Cbr\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2016-10-08T10:51:04Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222793091\u0022 data-ipsquote-contentid=\u002288441\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221475923638\u0022 data-ipsquote-userid=\u002291005\u0022 data-ipsquote-username=\u0022Northstar1989\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 minute ago, Northstar1989 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents ipsClearfix\u0022\u003E\n\u003Cp\u003E\nVery difficult to do, as I\u0027m posting from mobile (hence all the typo\u0027s, and edits to fix them) and the mobile site doesn\u0027t seem to allow me to easily multi-quote multiple different people like I can from my laptop...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nClick the plus sign under each post to multiquote, works on mobile or computer. If you are unable to avoid multiposting on mobile then I will have to ask you to wait until you are on a device where you can; it is unfair to other people attempting to participate in the conversation to have half the posts on each page be from one poster.\n\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2016-10-08T10:52:41Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222793092\u0022 data-ipsquote-contentid=\u002288441\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221475923675\u0022 data-ipsquote-userid=\u002257801\u0022 data-ipsquote-username=\u0022magnemoe\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 minutes ago, magnemoe said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNo NTR is not needed, however most other Mars missions focus on better engines to keep mass faction up and launch size down as this saves money.\u003Cbr\u003E\nMusk goes the other way around, lets build an giant reusable rocket to lift the fuel. \u003Cbr\u003E\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBecause a giant reusable rocket is cheaper than developing an NTR.  \u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nUnless I\u0027m severely mistaken, building a space-rated NTR would be orders of magnitude more expensive than developing a lander, an interceptor ship to go with a Cycler (because you don\u0027t need anything special for the Cycler- the current ITS design would already make a fine Cycler Ship), or a cargo-only ITS.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222793095\u0022 data-ipsquote-contentid=\u002288441\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221475923864\u0022 data-ipsquote-userid=\u002212858\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 minutes ago, Red Iron Crown said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nClick the plus sign under each post to multiquote, works on mobile or computer. If you are unable to avoid multiposting on mobile then I will have to ask you to wait until you are on a device where you can; it is unfair to other people attempting to participate in the conversation to have half the posts on each page be from one poster.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI tried that before, and it did nothing on mobile.  But I just tried it again, and *this time* I noticed a popup on the bottom of my screen that says \u0022quote 2 posts\u0022 which I may have missed before due to its small size.  When I tap it (touchscreen, no clicks here) it works!\n\u003C/p\u003E\n\u003Cp\u003E\nStill doesn\u0027t let me manually merge posts though (it still auto-merges two posted in rapid succession, like it did just now), or add a quote to an existing post w/o overwriting the original post entirely...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nRegards,\n\u003C/p\u003E\n\u003Cp\u003E\nNorthstar\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-10-08T10:59:55Z\u0022 title=\u002210/08/2016 10:59  AM\u0022 data-short=\u00227 yr\u0022\u003EOctober 8, 2016\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Technical Ben","CreatedById":10512,"CreatedDateTime":"2016-10-08T11:26:41Z","Content":"\n\u003Cp\u003E\nIf I was a space company, with VASMIR (small scale for now), ion or other types of engines, I\u0027d offer to \u0022one up\u0022 Elon with a cycler. \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAs in, he provides his current mission profile. Offer an extra ticket to people for the cycler. Perhaps with a re-usable Mars lander (Blue Origins style?) offer cargo and postage too!\n\u003C/p\u003E\n\u003Cp\u003E\nWant the new iPhone 9? Not getting it from Elon, so you\u0027ll need postage on that!\n\u003C/p\u003E\n"},{"CreatedByName":"Mitchz95","CreatedById":82292,"CreatedDateTime":"2016-10-08T13:37:36Z","Content":"\n\u003Cp\u003E\nConspiracy theory: Elon is deliberately making the ITS unnecessarily inefficient to invite competitors to design their own colony architecture, making the colonization of Mars a proper space race.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022:confused:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 title=\u0022:confused:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"shynung","CreatedById":101096,"CreatedDateTime":"2016-10-08T14:06:43Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222793202\u0022 data-ipsquote-contentid=\u002288441\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221475933856\u0022 data-ipsquote-userid=\u002282292\u0022 data-ipsquote-username=\u0022Mitchz95\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n28 minutes ago, Mitchz95 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nConspiracy theory: Elon is deliberately making the ITS unnecessarily inefficient to invite competitors to design their own colony architecture, making the colonization of Mars a proper space race.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022:confused:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 title=\u0022:confused:\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI sure hope MSNW finishes that fusion rocket they\u0027re working on sooner than later.\n\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2016-10-08T15:21:07Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222792933\u0022 data-ipsquote-contentid=\u002288441\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221475903825\u0022 data-ipsquote-userid=\u002291005\u0022 data-ipsquote-username=\u0022Northstar1989\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n16 hours ago, Northstar1989 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNothing about landers, cyclers, or cargo-crew specialization requires NTR\u0027s.  In fact, nothing about them requires any technology the ITS won\u0027t already have... (the lander architecture is lower-tech in fact, since it doesn\u0027t really *need* composite fuel tanks in order to save you a lot of mass...)\n\u003C/p\u003E\n\u003Cp\u003E\nNTR\u0027s are way out there.  Not saying they couldn\u0027t be done, but the stuff I\u0027m describing is actually much lower-tech (Buzz Aldrin did most of his work on Cycler Ship architectures in the 70\u0027s, for crying out loud!)\n\u003C/p\u003E\n\u003Cp\u003E\nThat said, there will always be those who say it cannot be done\u0022.  Just like, *not coincidentally*, most of the people who are criticizing me for arguing Musk should be using landers and maybe eventually a Cycler or Cargo/Crew seperation are the *SAME* people saying Musk\u0027s ITS plans are unrealistic for \u0022all but glossy-eyed fanboys\u0022 and will never be accomplished.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou missed the point. The point is that there is no point trying to convice us that Musk should use cyclers or separate landers. Musk\u0027s architecture is done. You might not like it, but that\u0027s what they are working on. If you want to change Musk\u0027s mind, then write to him, not to us.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nStudies?  Prototyping?  Musk\u0027s plans haven\u0027t gotten to that point yet.  He\u0027s still working on the Raptor engine and the composite fuel-tanks.  \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhat he presented at the IAC is the result of several years of internal studies. The Raptor engin and the composite tanks are prototypes. The ITC is literally built around that tank and those engines. They are the core of the design.\n\u003C/p\u003E\n\u003Cp\u003E\n5% of the workforce of SpaceX is 250 people. That\u0027s a pretty large team for a side-project at this stage, and that represents a lot of money invested already. Those people aren\u0027t stupid. They know about cyclers, landers, and orbital mechanics. They have done the math and come up with the current plan because that is what fits Musk\u0027s requirements and capabilities.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHe hasn\u0027t even *begun* to challenge the seriously difficult problem of safe orbital refueling, as far as anyone knows.  \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThere are dozens of problems that he hasn\u0027t started to tackle, and some of them are serious dealbreakers for the whole plan. But that\u0027s how he\u0027s decided to roll. It\u0027s his money to spend. It\u0027s not up to you or anyone of us to tell him otherwise.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI find your suggestion of creating a \u0022Northstar Mars Colonization Architecture\u0022 rude and condescending (although, coincidentally, I have given some thought to reviving the long-dead Duna Mission Architecture Challenge on these forums with a new thread if my own on a couple occasions...  But that\u0027s not the same as what we\u0027re discussing here.)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nMusk has his architecture. You have yours, and it\u0027s not the same. You\u0027ve made your point. At this stage, I don\u0027t understand what you\u0027re trying to accomplish in this thread. Musk doesn\u0027t read the KSP forums. And we can\u0027t do anything to change his mind.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-10-08T21:43:50Z\u0022 title=\u002210/08/2016 09:43  PM\u0022 data-short=\u00227 yr\u0022\u003EOctober 8, 2016\u003C/time\u003E by Nibb31\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-10-08T15:59:47Z","Content":"\n\u003Cp\u003E\nI agree. This thread will be back on track once they return to flight, but generally I think the ITS glop should never have been merged with this thread that until recently was largely about SpaceX \u003Cem\u003Eoperations\u003C/em\u003E. Even with unbuilt SpaceX stuff, the thread needs to stick to real stuff. Alternate uses for ITS? That\u0027s game. Alternate mission architectures using ITS? Sure, until we have some real F9 launches to talk about. Spacecraft that Musk doesn\u0027t have a Powerpoint presentation about? Make a new thread.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-10-08T16:01:28Z\u0022 title=\u002210/08/2016 04:01  PM\u0022 data-short=\u00227 yr\u0022\u003EOctober 8, 2016\u003C/time\u003E by tater\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Technical Ben","CreatedById":10512,"CreatedDateTime":"2016-10-08T16:07:47Z","Content":"\n\u003Cp\u003E\nI\u0027ve had trouble getting enough fuel up attempting this in KSP (with the exception of using nuclear rockets, that need no refuelling).\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m not sure if I need to make my crew capsule smaller, of tanker larger (which would need a larger first stage to lift it)...\n\u003C/p\u003E\n"},{"CreatedByName":"StrandedonEarth","CreatedById":89439,"CreatedDateTime":"2016-10-08T18:54:58Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222793359\u0022 data-ipsquote-contentid=\u002288441\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221475942387\u0022 data-ipsquote-userid=\u0022119411\u0022 data-ipsquote-username=\u0022tater\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, tater said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI agree. This thread will be back on track once they return to flight, but generally I think the ITS glop should never have been merged with this thread that until recently was largely about SpaceX \u003Cem\u003Eoperations\u003C/em\u003E. Even with unbuilt SpaceX stuff, the thread needs to stick to real stuff. Alternate uses for ITS? That\u0027s game. Alternate mission architectures using ITS? Sure, until we have some real F9 launches to talk about. Spacecraft that Musk doesn\u0027t have a Powerpoint presentation about? Make a new thread.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI concur. I dislike having to wade through pages of ITS arguments to see if there are any updates on F9 investigations and operations. I think it should be separate threads about ITS and F9-based missions. I certainly don\u0027t think arguments about the pros and cons of different ITS architectures belong here\n\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2016-10-09T01:11:16Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222793359\u0022 data-ipsquote-contentid=\u002288441\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221475942387\u0022 data-ipsquote-userid=\u0022119411\u0022 data-ipsquote-username=\u0022tater\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 hours ago, tater said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI agree. This thread will be back on track once they return to flight, but generally I think the ITS glop should never have been merged with this thread that until recently was largely about SpaceX \u003Cem\u003Eoperations\u003C/em\u003E. Even with unbuilt SpaceX stuff, the thread needs to stick to real stuff. Alternate uses for ITS? That\u0027s game. Alternate mission architectures using ITS? Sure, until we have some real F9 launches to talk about. Spacecraft that Musk doesn\u0027t have a Powerpoint presentation about? Make a new thread.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOriginally I *did* started posting all this alternative architecture stuff in a different thread that got merged in here.  It\u0027s not my fault ot got merged.  And I shouldn\u0027t have to abandon my entire line of discussion just because a moderstor merged two threads and you, a player, don\u0027t like the topic...  If the mods thought this was off-topic, they should have never merged the threads...\n\u003C/p\u003E\n\u003Cp\u003E\nAnyways, your point is no different than the point you\u0027ve made 100 times before, often on threads I myself started that *were* dedicated to a unique idea (like Suborbital Spaceplanes, Cycler Ships, or Microwave Beamed Power).  Remember your criticisms on those threads, Nibb?  They were *identical*.  I don\u0027t appreciate that you keep making the same rude, confrontational things any time I suggest a new idea.  It\u0027s not polite, and it\u0027s not right, and you really should stop.\n\u003C/p\u003E\n\u003Cp\u003E\nANYTHING space-related that people discuss and hasn\u0027t been done before might theoretically be \u0022pointless\u0022.  But by discussing an idea, you not only spread it, you also work out the kinks and refine it.  If these ideas ever *were* submitted to SpaceX, they really ought to be debated more first, for instance.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd I already have encouraged anybody here who agrees with any of these ideas to write them up and submit arguments for them to SpaceX.  So maybe something might actually come of this discussion...\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222793230\u0022 data-ipsquote-contentid=\u002288441\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221475935603\u0022 data-ipsquote-userid=\u0022101096\u0022 data-ipsquote-username=\u0022shynung\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 hours ago, shynung said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI sure hope MSNW finishes that fusion rocket they\u0027re working on sooner than later.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt sounded like a pie-in-the-sky idea to me when I read about it (way more than, say, dedicated landers- which are really just an extension of the concept used in Apollo).  Do you think it has any serious chance of actually working?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nRegards,\n\u003C/p\u003E\n\u003Cp\u003E\nNorthstar\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-10-09T01:18:37Z\u0022 title=\u002210/09/2016 01:18  AM\u0022 data-short=\u00227 yr\u0022\u003EOctober 9, 2016\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-10-09T01:57:33Z","Content":"\n\u003Cp\u003E\n I\u0027m not at all suggesting that SpaceX not be a topic of deeply speculative discussion, I just think it derails a standing thread to do so \u003Cem\u003Ehere\u003C/em\u003E. The threads that were merged I said should not have been merged. That said, ITS threads at least sort of belong here. ITS is a specific spacecraft, however. I\u0027d say if it is so nonexistent that Elon doesn\u0027t even have a slide about it for a talk, it deserves to be in another thread.\n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2016-10-09T03:12:58Z","Content":"\n\u003Cp\u003E\nOne can name a new thread: \u0022Musk must...\u0022.\n\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-10-09T03:39:03Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222794129\u0022 data-ipsquote-contentid=\u002288441\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221475982778\u0022 data-ipsquote-userid=\u0022129408\u0022 data-ipsquote-username=\u0022kerbiloid\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n26 minutes ago, kerbiloid said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOne can name a new thread: \u0022Musk must...\u0022.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSay that three times, fast!\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-10-09T03:39:12Z\u0022 title=\u002210/09/2016 03:39  AM\u0022 data-short=\u00227 yr\u0022\u003EOctober 9, 2016\u003C/time\u003E by tater\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"shynung","CreatedById":101096,"CreatedDateTime":"2016-10-09T04:24:32Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222794004\u0022 data-ipsquote-contentid=\u002288441\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221475975476\u0022 data-ipsquote-userid=\u002291005\u0022 data-ipsquote-username=\u0022Northstar1989\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Northstar1989 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt sounded like a pie-in-the-sky idea to me when I read about it (way more than, say, dedicated landers- which are really just an extension of the concept used in Apollo).  Do you think it has any serious chance of actually working?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nPretty sure. It\u0027s being jointly developed by MSNW and The University of Washington, and backed by NASA through the Innovative Advanced Concepts program. They\u0027re aiming for a full scale ground test by 2020, and orbital demonstration by mid-20\u0027s.\n\u003C/p\u003E\n\u003Cp\u003E\nMSNW doesn\u0027t exactly have their own space program, though, so it\u0027s up to NASA or some other organization to actually use the fusion motor for their spacecraft.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-10-09T04:49:30Z\u0022 title=\u002210/09/2016 04:49  AM\u0022 data-short=\u00227 yr\u0022\u003EOctober 9, 2016\u003C/time\u003E by shynung\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2016-10-09T10:43:16Z","Content":"\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAnyways, your point is no different than the point you\u0027ve made 100 times before, often on threads I myself started that *were* dedicated to a unique idea (like Suborbital Spaceplanes, Cycler Ships, or Microwave Beamed Power).  Remember your criticisms on those threads, Nibb?  They were *identical*.  I don\u0027t appreciate that you keep making the same rude, confrontational things any time I suggest a new idea.  It\u0027s not polite, and it\u0027s not right, and you really should stop.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou\u0027re taking things too personally. I don\u0027t resort to ad hominems, so it would be great if you didn\u0027t either. None of my criticisms are directed personally to you. In most cases, I don\u0027t even look at the name of the person I\u0027m replying to. I didn\u0027t even remember (or care) who brought those other subjects up.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd it\u0027s not that the ideas are stupid. Some ideas are actually smart, but that doesn\u0027t mean they are practical. When you come up with a wall of text claiming that SpaceX should be using cyclers, then you are the one who is insulting. Any aerospace engineer knows perfectly well what a cycler is, and although there might be some benefits in using one, there are also some very strong reasons that make it impractical for the current architecture.\n\u003C/p\u003E\n\u003Cp\u003E\nBut in this case, I\u0027m not even criticizing your ideas. I\u0027m just saying that your ideas have no place in a SpaceX thread, because they have nothing to do with SpaceX.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAnd I already have encouraged anybody here who agrees with any of these ideas to write them up and submit arguments for them to SpaceX.  So maybe something might actually come of this discussion...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSo why don\u0027t you? You\u0027ve literally spent hours in this thread, writing down your ideas of how SpaceX could do so much better. That time could have been so much more profitable if you had spent it directly writing to SpaceX.\n\u003C/p\u003E\n\u003Cp\u003E\nThe problem is that you are assuming that when Elon Musk picked a bunch of smart folks at SpaceX to think about a Mars mission architecture several years ago, those people didn\u0027t go through the different options. They most certainly did consider cyclers and LMO rendez-vous. And they rejected thos ideas for reasons. There is no point in advocating the obvious, they already know what a cycler is or what the gains of a separate lander are. If they didn\u0027t choose those options, it\u0027s because they are not interested, not because they are ignorant or stupid. Which is why I\u0027m asking you respectfully to move on and either start a different thread about alternative Mars mission profiles or to leave this thread to discussion about the Falcon, Dragon, and the ITS.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-10-09T10:52:00Z\u0022 title=\u002210/09/2016 10:52  AM\u0022 data-short=\u00227 yr\u0022\u003EOctober 9, 2016\u003C/time\u003E by Nibb31\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Lukaszenko","CreatedById":95776,"CreatedDateTime":"2016-10-09T11:56:43Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222792910\u0022 data-ipsquote-contentid=\u002288441\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221475901992\u0022 data-ipsquote-userid=\u002291005\u0022 data-ipsquote-username=\u0022Northstar1989\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 10/8/2016 at 6:46 AM, Northstar1989 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThis is a perfect example of how the human brain is bad at comparing probabilities, and why we need to do the math...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt\u0027s an example of MY brain calculating the wrong numbers. I assumed you were talking about a larger number of less reliable landers. In fact, your calculations (and indeed previous posts) show that you were actually talking a larger number of MORE reliable landers. I don\u0027t need to do the math to see that this will be safer.\n\u003C/p\u003E\n\u003Cp\u003E\nObviously if you compare putting your eggs into one basket or putting your eggs into more and stronger baskets, the more \u0026amp; stronger will be the safer option.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-10-09T11:57:20Z\u0022 title=\u002210/09/2016 11:57  AM\u0022 data-short=\u00227 yr\u0022\u003EOctober 9, 2016\u003C/time\u003E by Lukaszenko\u003C/strong\u003E\n\u003C/span\u003E\n"}]}