{"TopicId":136155,"ForumId":24,"TopicTitle":"Hello, There!","CreatedByName":"Ultimate Steve","CreatedById":161505,"CreatedDateTime":"2016-04-05T23:44:29Z","PageNum":1,"Articles":[{"CreatedByName":"Ultimate Steve","CreatedById":161505,"CreatedDateTime":"2016-04-05T23:44:29Z","Content":"\n\u003Cp\u003E\nHello, everyone, I am Ultimate Steve. I am definitely not new to KSP in any way, I joined back in 0.19. KSP is probably the best game I have ever bought, and I have no Idea why I didn\u0027t join the forums earlier. Just wanted to introduce myself. I have been to most of the bodies in the game in one form or another, except for moho (can\u0027t seem to get an encounter) Eeloo (Never bothered) and Vall (not enough fuel left on my J5 mothership). I have done crewed landings on Kerbin\u0027s moons, Duna and Ike, all of Jool\u0027s moons (except Vall) and Gilly. I am also really excited for 1.1 (but I don\u0027t have steam... must wait). Did I manage to break the record by lurking for 3 years?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBy the way, if there is a way to add the KSP planet names to the forum\u0027s spellchecker dictionary, I suggest that you do that. It\u0027s only my first post and It\u0027s already annoying me.\n\u003C/p\u003E\n"},{"CreatedByName":"Starhawk","CreatedById":131400,"CreatedDateTime":"2016-04-06T00:59:56Z","Content":"\n\u003Cp\u003E\nHello Ultimate Steve and welcome to the forum!\n\u003C/p\u003E\n\u003Cp\u003E\nVall is a really cool place to visit.\n\u003C/p\u003E\n\u003Cp\u003E\nThat spellchecker is in your web browser.  You can usually add words to the dictionary by right-clicking on them.\n\u003C/p\u003E\n\u003Cp\u003E\nHappy landings!\n\u003C/p\u003E\n"},{"CreatedByName":"Ultimate Steve","CreatedById":161505,"CreatedDateTime":"2016-04-06T01:33:38Z","Content":"\n\u003Cp\u003E\nThanks for the spellcheck tip!\n\u003C/p\u003E\n\u003Cp\u003E\nI do want to go to Vall at some point, but my lander was out of fuel on my first mission. I did, however, station my mothership around Vall during that mission, and it is still there (I used the more efficient transfer ship to get home). Maybe I\u0027ll use it in the future. I\u0027ll probably have to start a mission report on that mission.\n\u003C/p\u003E\n"},{"CreatedByName":"Kerbinchaser","CreatedById":160817,"CreatedDateTime":"2017-05-25T17:57:00Z","Content":"\n\u003Cp\u003E\nWelcome! JK man. Just trolling ya. \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E \n\u003C/p\u003E\n"},{"CreatedByName":"Green Baron","CreatedById":107381,"CreatedDateTime":"2017-05-28T11:31:09Z","Content":"\n\u003Cp\u003E\nThe Vall Henge is a must see once in a ksp-player\u0027s life !\n\u003C/p\u003E\n\u003Cp\u003E\nUnfortunately i am experiencing massive problems with ksp, otherwise i\u0027d send you a postcard.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd welcome, though are a little longer here than i am :-)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEdit: ouch, this is an old one. Stupid me ...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-05-28T11:35:38Z\u0022 title=\u002205/28/2017 11:35  AM\u0022 data-short=\u00227 yr\u0022\u003EMay 28, 2017\u003C/time\u003E by Green Baron\u003C/strong\u003E\n\u003C/span\u003E\n"}]}