{"TopicId":136726,"ForumId":16,"TopicTitle":"What effect does SAS placement have, if any?","CreatedByName":"troyfawkes","CreatedById":109437,"CreatedDateTime":"2016-04-11T21:50:39Z","PageNum":1,"Articles":[{"CreatedByName":"troyfawkes","CreatedById":109437,"CreatedDateTime":"2016-04-11T21:50:39Z","Content":"\n\u003Cp\u003E\nSo, this is probably a really dumb question from someone with as many hours in this game as i have, but:\n\u003C/p\u003E\n\u003Cp\u003E\nWhat effect does SAS placement have on control? E.g. if I put a wheel well outside of my CoM, what changes? What if I flip it vertically? What if it\u0027s off my CoM in two or three dimensions?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-04-11T21:51:04Z\u0022 title=\u002204/11/2016 09:51  PM\u0022 data-short=\u00228 yr\u0022\u003EApril 11, 2016\u003C/time\u003E by troyfawkes\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Foxster","CreatedById":113764,"CreatedDateTime":"2016-04-11T21:52:21Z","Content":"\n\u003Cp\u003E\nAs far as I know it makes no difference. Wherever you place them, and with whatever orientation, they cause the craft to rotate about the CoM.  \n\u003C/p\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2016-04-11T22:06:03Z","Content":"\n\u003Cp\u003E\nWhile placement of the SAS wheels itself has no effect on the amount of torque it generates, it will cause twisting and bending of the parts that \u0022transmit\u0022 the torque. For that reason it makes sense to place them close to the COM, just to prevent bending, vibrations and other Bad Things.\n\u003C/p\u003E\n"},{"CreatedByName":"HebaruSan","CreatedById":156657,"CreatedDateTime":"2016-04-11T22:06:25Z","Content":"\n\u003Cp\u003E\nOrientation (flipping) of the part definitely doesn\u0027t matter. Position seems to be a matter of some dispute.\n\u003C/p\u003E\n\u003Cp\u003E\nAs far as I can tell, a reaction wheel\u0027s torque force is applied from the position of its part, which affects both what it does and how effective it is. For example, if you have a long, bendy rocket and you put reaction wheels just at one end, it\u0027ll bend when you use them. (And if your command pod is also at that end, the directional SAS modes will set up a destructive oscillation, because SAS uses the command pod\u0027s current orientation to decide which direction to push, so the further off center it is, the longer it\u0027ll push in the opposite direction, and so on until the craft explodes.) But if both are at the center, then the outer segments will swing around, but less catastrophically. Similarly, if you have a big heavy craft, a reaction wheel at the edge will behave as if it\u0027s trying to strong-arm the entire thing around from that distance, whereas at the center it will have more leverage.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ll try to remember to run some tests on this. It shouldn\u0027t be too hard to loft some representative test craft, but I\u0027m not sure how to best measure angular acceleration. Might have to settle for counting rotations with a stopwatch.\n\u003C/p\u003E\n"},{"CreatedByName":"troyfawkes","CreatedById":109437,"CreatedDateTime":"2016-04-11T22:40:27Z","Content":"\n\u003Cp\u003E\nHmm, maybe worth it to just create a modded part with extreme torque and throw is on the end of a very long series of long struts. Could probably do it clamped on the launchpad. Also, sounds like FUN \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2016-04-11T22:57:58Z","Content":"\n\u003Cp\u003E\nConservation of momentum tells us that it doesn\u0027t really matter where you put them. They will apply the same torque wherever they are on the ship, even though they technically break other parts of CoM*.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, if a torque-inducing control device is too far from your command pod - and too far from other torque-inducing control devices, then your ship will tend to develop a wobble. If you\u0027re (un)lucky, this wobble could be at just the right frequency to shake your ship apart. The further apart they are, the more likely and more violent the shaking.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E*Reaction wheels don\u0027t exactly break the Conservation of Momentum law, but they\u0027d eventually be spinning faster than the speed of light the way they allow you to spin around an infinite number of times.\u003C/em\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Plusck","CreatedById":153264,"CreatedDateTime":"2016-04-12T00:00:54Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222508692\u0022 data-ipsquote-contentid=\u0022136726\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221460412363\u0022 data-ipsquote-userid=\u002278303\u0022 data-ipsquote-username=\u0022Kerbart\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Kerbart said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhile placement of the SAS wheels itself has no effect on the amount of torque it generates, it will cause twisting and bending of the parts that \u0022transmit\u0022 the torque. For that reason it makes sense to place them close to the COM, just to prevent bending, vibrations and other Bad Things.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027m of the opinion that there is a lot of overestimating the power of torque wheels and their ability to cause problems, when in fact it\u0027s a combination of many factors (where the torque wheels are actually minor contributors) that causes this sort of problem.\n\u003C/p\u003E\n\u003Cp\u003E\nSo I agree absolutely to the first paragraph here: \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222508693\u0022 data-ipsquote-contentid=\u0022136726\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221460412385\u0022 data-ipsquote-userid=\u0022156657\u0022 data-ipsquote-username=\u0022HebaruSan\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, HebaruSan said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOrientation (flipping) of the part definitely doesn\u0027t matter. Position seems to be a matter of some dispute.\n\u003C/p\u003E\n\u003Cp\u003E\nAs far as I can tell, a reaction wheel\u0027s torque force is applied from the position of its part, which affects both what it does and how effective it is. For example, if you have a long, bendy rocket and you put reaction wheels just at one end, it\u0027ll bend when you use them. (And if your command pod is also at that end, the directional SAS modes will set up a destructive oscillation, because SAS uses the command pod\u0027s current orientation to decide which direction to push, so the further off center it is, the longer it\u0027ll push in the opposite direction, and so on until the craft explodes.) But if both are at the center, then the outer segments will swing around, but less catastrophically. Similarly, if you have a big heavy craft, a reaction wheel at the edge will behave as if it\u0027s trying to strong-arm the entire thing around from that distance, whereas at the center it will have more leverage.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ll try to remember to run some tests on this. It shouldn\u0027t be too hard to loft some representative test craft, but I\u0027m not sure how to best measure angular acceleration. Might have to settle for counting rotations with a stopwatch.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhile I agree with the general principles, I think that the game gives a misleading impression of the problem and, specifically, I think that reaction wheel placement merely compounds a pre-existing problem. That pre-existing problem generally consists in having far too many weak joints between the controlling pod and the CoM of the vessel, and having reaction wheels just next to that controlling pod, and using an active SAS function and excessive gimbal, and trying to go sideways against the airflow.\n\u003C/p\u003E\n\u003Cp\u003E\nCertainly, if you have a large space station held together with docking ports, reaction wheels at the edges can cause significant flexing of the different parts. However, that is a problem that can be easily fixed by just letting go of the controls for a short while.\n\u003C/p\u003E\n\u003Cp\u003E\nThe major problem generally occurs on atmospheric ascent. It looks like the reaction wheel is \u0022bending\u0022 the ship but in fact the forces exerted by reaction wheels are far too weak to do that. Take a few reaction wheels, stick them on top of a heavily-clamped stack of three or four fuel tanks and you\u0027ll find that they hardly budge even if you try to develop a rocking motion.\n\u003C/p\u003E\n\u003Cp\u003E\nSo what must actually be happening is that in the atmosphere, and particularly with active SAS, the reaction wheel induces a minimal amount of flex which then multiplies the far larger forces exerted by the engines (giving slightly different vectors to the momentum of each part) and by drag. That is (IMO) the real culprit. And that flex leads the controlling pod to overcorrect, which leads to oscillation that can rip a ship apart. However, it\u0027s the engines and aero forces which provide the necessary force to do that - reaction wheels on their own simply can\u0027t.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat reaction wheels \u003Cu\u003E\u003Cem\u003Edo\u003C/em\u003E\u003C/u\u003E do, however, is add joints, which can weaken craft as a whole. Putting a reaction wheeel in the middle of a tall stack (especially in the 2.5m scale) can actually make bending worse by doubling the amount of flexing in the middle of the stack. And that\u0027s why (IMO) moving the reaction wheel to the centre - thereby creating a double joint in the middle of a stack -  is (IMO) a fatal solution to a wobble problem.\n\u003C/p\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2016-04-12T00:21:53Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222508863\u0022 data-ipsquote-contentid=\u0022136726\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221460419254\u0022 data-ipsquote-userid=\u0022153264\u0022 data-ipsquote-username=\u0022Plusck\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n21 minutes ago, Plusck said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe major problem generally occurs on atmospheric ascent. It looks like the reaction wheel is \u0022bending\u0022 the ship but in fact the forces exerted by reaction wheels are far too weak to do that. Take a few reaction wheels, stick them on top of a heavily-clamped stack of three or four fuel tanks and you\u0027ll find that they hardly budge even if you try to develop a rocking motion.\n\u003C/p\u003E\n\u003Cp\u003E\nSo what must actually be happening is that in the atmosphere, and particularly with active SAS, the reaction wheel induces a minimal amount of flex which then multiplies the far larger forces exerted by the engines (giving slightly different vectors to the momentum of each part) and by drag. That is (IMO) the real culprit. And that flex leads the controlling pod to overcorrect, which leads to oscillation that can rip a ship apart. However, it\u0027s the engines and aero forces which provide the necessary force to do that - reaction wheels on their own simply can\u0027t.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAnd yet... when I have a tallish-stack with a SAS unit in the payload (on top, not in the center), I find the whole bunch a lot easier to launch (less noodling) when I turn SAS off, then when I keep it on. If noodling is the result of a SAS wheel in the center, then why is it causing noodling when it\u0027s placed at the top of the stack, and do the problems disappear when I turn the SAS wheel off?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-04-12T00:22:12Z\u0022 title=\u002204/12/2016 12:22  AM\u0022 data-short=\u00228 yr\u0022\u003EApril 12, 2016\u003C/time\u003E by Kerbart\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Plusck","CreatedById":153264,"CreatedDateTime":"2016-04-12T00:40:15Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222508887\u0022 data-ipsquote-contentid=\u0022136726\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221460420513\u0022 data-ipsquote-userid=\u002278303\u0022 data-ipsquote-username=\u0022Kerbart\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n19 minutes ago, Kerbart said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAnd yet... when I have a tallish-stack with a SAS unit in the payload (on top, not in the center), I find the whole bunch a lot easier to launch (less noodling) when I turn SAS off, then when I keep it on. If noodling is the result of a SAS wheel in the center, then why is it causing noodling when it\u0027s placed at the top of the stack, and do the problems disappear when I turn the SAS wheel off?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhen you say you turn SAS off, do you mean you disable the wheel or you deactivate SAS generally? I tend to avoid noodling by toggling engine gimbal on and off (except with the Vector, which needs to have gimbal reduced to about 10% to start with anyway).\n\u003C/p\u003E\n\u003Cp\u003E\nStill, I\u0027m not saying that an SAS wheel in the centre causes noodling, but rather that it makes it worse because noodling is due to excessive forces on joints. It\u0027s the flexing joints which make engines and lift/drag apply opposing forces to different parts of the ship, which are emphasised rather than damped by the SAS/autopilot function.\n\u003C/p\u003E\n\u003Cp\u003E\nThe actual force applied by torque wheels adds slightly to that problem - but it\u0027s further compounded by the wheels being in the command pod too. The command pod goes very slightly off its original heading and tries to correct. The reaction wheels by the pod start to correct this quickly, but the engine/control surfaces at the base of the rocket have already sent a ripple of movement up the stack, so when that reaches the pod it swings the other way (and in the worst case, this swing is emphasised by the straining reaction wheels which haven\u0027t yet managed to correct the heading from the command pod\u0027s PoV) and starts trying to correct the other way.\n\u003C/p\u003E\n\u003Cp\u003E\nAnother thing that happens is that once a joint starts to flex significantly, it seems to require much less effort to flex back the way. Perhaps reaction wheels alone are enough to send a pre-flexed joint back to opposite flex? I\u0027m sure this could be tested with large stacks of short fuel tanks.\n\u003C/p\u003E\n\u003Cp\u003E\n(edit - one final thing when you said \u0022in the payload\u0022: fairing joints are terrible, so anything with a lever arm to flex that joint is going to cause problems. You didn\u0027t mention using a fairing but it\u0027s also a compounding factor. So basically, I suppose I\u0027m trying to say that reaction wheels should always be placed right next to the weakest joint, preferably on the side facing the CoM, so that they don\u0027t add weakness unnecessarily and don\u0027t have leverage to add to flex which is going to happen anyway).\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-04-12T00:46:03Z\u0022 title=\u002204/12/2016 12:46  AM\u0022 data-short=\u00228 yr\u0022\u003EApril 12, 2016\u003C/time\u003E by Plusck\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"HebaruSan","CreatedById":156657,"CreatedDateTime":"2016-04-12T01:32:55Z","Content":"\n\u003Cp\u003E\nYou guys have never choked up on a baseball bat? I think the physics name is Moment of Inertia, but it\u0027s been a looong time and I need a refresher...\n\u003C/p\u003E\n"},{"CreatedByName":"Plusck","CreatedById":153264,"CreatedDateTime":"2016-04-12T02:07:01Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222508989\u0022 data-ipsquote-contentid=\u0022136726\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221460424775\u0022 data-ipsquote-userid=\u0022156657\u0022 data-ipsquote-username=\u0022HebaruSan\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n23 minutes ago, HebaruSan said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYou guys have never choked up on a baseball bat? I think the physics name is Moment of Inertia, but it\u0027s been a looong time and I need a refresher...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIn space, nobody can \u003Cs\u003Ehear you scream\u003C/s\u003E apply leverage.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s counter-intuitive, but in space it makes no difference where you place your reaction wheels. The torque applied has exactly the same force no matter where the source is located compared to the CoM.\n\u003C/p\u003E\n\u003Cp\u003E\nThat means that the only consideration for placing torque wheels is what to do about bendy joints and confused \u0022control from here\u0022 parts. Which is enough for plenty of disagreement ; )\n\u003C/p\u003E\n"},{"CreatedByName":"HebaruSan","CreatedById":156657,"CreatedDateTime":"2016-04-12T02:54:10Z","Content":"\n\u003Cp\u003E\nUpdate: My attempt to create comparable test crafts for this is being undermined by the absurd structural weakness of the Advanced Reaction Wheel Module, Large. After I put the end-grip version in orbit, the mid-grip variant needed additional parts to avoid ridiculous flex on ascent. Hopefully four cubic octagonals and four strut connectors won\u0027t be enough to distort the results.\n\u003C/p\u003E\n\u003Cp\u003E\nCan the large reaction wheel part be made less ... silly?\n\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2016-04-12T14:18:54Z","Content":"\n\u003Cp\u003E\nTorque applied to the spacecraft is the same regardless of placement.\n\u003C/p\u003E\n\u003Cp\u003E\nConcentrating all the wheel is one place is bad, though, as it can cause bending. My rules of thumb are:\n\u003C/p\u003E\n\u003Cp\u003E\n1. If there\u0027s only one wheel put it as close to the CoM as possible.\u003Cbr\u003E\n2. If more than one wheel, distribute them as evenly as possible throughout the craft.\u003Cbr\u003E\n3. Alternately, strut the craft enough that bending is a non-issue, then place wherever is convenient.\n\u003C/p\u003E\n"},{"CreatedByName":"Vegetal","CreatedById":147251,"CreatedDateTime":"2016-04-12T16:06:25Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222508887\u0022 data-ipsquote-contentid=\u0022136726\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221460420513\u0022 data-ipsquote-userid=\u002278303\u0022 data-ipsquote-username=\u0022Kerbart\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n15 hours ago, Kerbart said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAnd yet... when I have a tallish-stack with a SAS unit in the payload (on top, not in the center), I find the whole bunch a lot easier to launch (less noodling) when I turn SAS off, then when I keep it on. If noodling is the result of a SAS wheel in the center, then why is it causing noodling when it\u0027s placed at the top of the stack, and do the problems disappear when I turn the SAS wheel off?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe problem here has nothing to do with reaction wheels, but SAS PID configuration and engine gimbals.\n\u003C/p\u003E\n\u003Cp\u003E\nIn simpler terms: SAS is tuned very aggressively in KSP, and will gimbal your engines HARD during launch, which has much more torqueing capability than reaction wheels, causing the noodle effect. The distance between the command module and the actual engine is also a big factor, as it tends to create a constructive wave across the length of the rocket.\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-04-13T00:39:21Z","Content":"\n\u003Cp\u003E\nA note to \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/156657-hebarusan/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022156657\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/156657-hebarusan/\u0022\u003E@HebaruSan\u003C/a\u003E, who\u0027s having some skepticism about the \u0022placement doesn\u0027t matter\u0022 (in terms of torque effectiveness);\n\u003C/p\u003E\n\u003Cp\u003E\nAs several other posters have said here:  it really doesn\u0027t matter.  Really.  Put your reaction wheels anywhere, they will have \u003Cem\u003E\u003Cu\u003Eexactly the same effect\u003C/u\u003E\u003C/em\u003E in terms of rotating the craft.\n\u003C/p\u003E\n\u003Cp\u003E\nThat\u0027s what the laws of physics say.  It\u0027s also what the game actually does (I\u0027ve experimentally verified it).\n\u003C/p\u003E\n\u003Cp\u003E\nUnderstanding just \u003Cem\u003E\u003Cu\u003Ewhy\u003C/u\u003E\u003C/em\u003E that is the case can be tricky, so I really don\u0027t blame you.  \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E  For a detailed explanation of exactly why that is, take a look here:\n\u003C/p\u003E\n\u003Ciframe data-embedcontent=\u0022\u0022 frameborder=\u00220\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/127667-where-to-put-reaction-wheels/\u0026amp;do=embed\u0026amp;embedComment=2320917\u0026amp;embedDo=findComment\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\nSo, reaction wheel placement \u003Cem\u003E\u003Cu\u003Ecan\u003C/u\u003E\u003C/em\u003E have an effect in terms of making your ship wobble, so you should use appropriate strategy there if you have a big, bendy craft.  But other than wobble problems, no, it really doesn\u0027t matter.\n\u003C/p\u003E\n"},{"CreatedByName":"HebaruSan","CreatedById":156657,"CreatedDateTime":"2016-04-13T02:27:39Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222510754\u0022 data-ipsquote-contentid=\u0022136726\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221460507961\u0022 data-ipsquote-userid=\u0022125662\u0022 data-ipsquote-username=\u0022Snark\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Snark said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nA note to \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/156657-hebarusan/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022156657\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/156657-hebarusan/\u0022\u003E@HebaruSan\u003C/a\u003E, who\u0027s having some skepticism about the \u0022placement doesn\u0027t matter\u0022 (in terms of torque effectiveness);\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah, at this point I accept that I\u0027m probably* wrong, since this community is rarely unanimous if there\u0027s any real room for doubt. But as you say, it\u0027s tricky, and I need to see it for myself. I\u0027ve thought of a better test craft design than my initial plan, which should lend itself to a decent imgur album.\n\u003C/p\u003E\n\u003Cp\u003E\n*: You can ignore this word if you want to work with normal standards of evidence. I\u0027m really just withholding judgment till I perform an experiment that I find satisfactory.\n\u003C/p\u003E\n"}]}