{"TopicId":136932,"ForumId":16,"TopicTitle":"Using maths to calculate optimum Rapier speedrun","CreatedByName":"AeroGav","CreatedById":152027,"CreatedDateTime":"2016-04-14T09:57:39Z","PageNum":1,"Articles":[{"CreatedByName":"AeroGav","CreatedById":152027,"CreatedDateTime":"2016-04-14T09:57:39Z","Content":"\n\u003Cp\u003E\nHi guys,   \n\u003C/p\u003E\n\u003Cp\u003E\nas you probably know,  the thrust output of all air breathing engines is modified by two factors in KSP\n\u003C/p\u003E\n\u003Cp\u003E\n1) the atmospheric density curve, specified in the config file.   With all stock engines, thrust gets less the higher you go, though the Rapier does well in this regard since thrust loss with altitude is slow up to 20km.\n\u003C/p\u003E\n\u003Cp\u003E\n2) the velocity curve specified in the config file.    With some subsonic designs like the Wheesley and Goliath, the trend is only downward with increasing speed, but most actually gain thrust initially, before tailing off as you go faster still.   The Rapier again does best here, peaking at a higher speed (mach 3.7) than any other engine and  tailing off in power more slowly above optimum.\n\u003C/p\u003E\n\u003Cp\u003E\nSo,   the goal of air-breathing flight is to reach the highest possible speed and altitude before engaging the lower ISP closed cycle engines.  This is where the tradeoff comes in.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you accelerate to mach 3.7,  the velocity at which Rapiers produce maximum thrust, then you will be able to reach a higher altitude before your specific excess power reaches zero.  On the other hand, I\u0027ve noticed that thrust declines VERY quickly above 23km, halving between 24km and 26km for example.\n\u003C/p\u003E\n\u003Cp\u003E\nGiven that power holds up pretty well , is it worth going over your max power speed, and accepting a lower peak altitude instead?\n\u003C/p\u003E\n\u003Cp\u003E\nCan anyone remember the equation that shows what altitude can be reached from a given velocity in a vertical climb, assuming no drag.  Eg. an object moving 100m/s straight up, how far will it reach before falling back ?  With this info,   the total energy (kinetic \u002B potential) of each speedrun method can be calculated to find the best.\n\u003C/p\u003E\n\u003Cp\u003E\neg. i can plot a graph of thrust vs speed and air density, calculate \u0022total energy\u0022 to get the optimum?\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\u003C/p\u003E\n\u003Cp\u003E\nFrom the Rapier config file velocity curve -\n\u003C/p\u003E\n\u003Cp\u003E\n            key = 3.75,    8.5\u003Cbr\u003E\n            key = 4.5,      7.3 \u003Cbr\u003E\n            key = 5.5,      3\u003Cbr\u003E\n            key = 6,         0\n\u003C/p\u003E\n\u003Cp\u003E\nSo, peak power at mach 3.75 is 8.5 times it\u0027s static rating (!).\n\u003C/p\u003E\n\u003Cp\u003E\nAt mach 4.5 it holds on pretty well, still going 7.3 times static - 85% of peak power.\n\u003C/p\u003E\n\u003Cp\u003E\nAfter that it falls off a cliff somewhat,  only  3 times static thrust at mach 5.5  - a mere 35% of peak power.\n\u003C/p\u003E\n\u003Cp\u003E\nAt mach 6, thrust falls to zero.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, exceeding mach 4.5 below 30km is going to overheat any mark 2 design, so this is kind of moot.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Empress Neptune","CreatedById":158189,"CreatedDateTime":"2016-04-14T12:28:09Z","Content":"\n\u003Cp\u003E\nI\u0027m not sure what you\u0027re asking. Specifically, how do you envision climbing in air mode? Potential energy won\u0027t help you get to orbit, so there is no reason to look at it. If you make your vertical velocity too big, you will have to deal with a costly circularization burn.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIn my experience, you only need enough vertical speed to break 30 km altitude. I tend to have 200-300 m/s vertical speed when switching to closed cycle. I go as fast as I can, as horizontal speed will make you climb once you go fast enough anyway. The goal is to get as close to that speed as possible while in jet mode. Heating is the only real limit. Try playing around with heatshield noses if you want efficiency. 1500\u002B m/s in jet mode is a massive gain in efficiency.\n\u003C/p\u003E\n"},{"CreatedByName":"zolotiyeruki","CreatedById":150224,"CreatedDateTime":"2016-04-14T13:59:45Z","Content":"\n\u003Cp\u003E\nHeating is the limit for me as well--I can\u0027t seem to get over 1200-1300m/s in the 20-25km altitude range without blowing up, so I usually end up switching to closed cycle mode around 21km and 1km/s.  my craft might also be a bit underpowered, though.\n\u003C/p\u003E\n"},{"CreatedByName":"AeroGav","CreatedById":152027,"CreatedDateTime":"2016-04-14T14:08:48Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222513458\u0022 data-ipsquote-contentid=\u0022136932\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221460636889\u0022 data-ipsquote-userid=\u0022158189\u0022 data-ipsquote-username=\u0022Empress Neptune\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Empress Neptune said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027m not sure what you\u0027re asking. Specifically, how do you envision climbing in air mode? Potential energy won\u0027t help you get to orbit, so there is no reason to look at it. If you make your vertical velocity too big, you will have to deal with a costly circularization burn.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027m not sure you understand my post, but I probably didn\u0027t explain myself very well.     I think you are talking about a zoom climb scenario.   I was referring to steady state operation in jet mode.    Imagine you career games where you built a plane with early jet engines and are trying to see the max altitude it can reach sustainably (not a zoom climb, where it stalls and falls back again).     That is similar to how things go at the end of the airbreathing phase of my spaceplane launches.   When climb rate has more or less died away, i start the NERV engines.\n\u003C/p\u003E\n\u003Cp\u003E\nNow, do you trim the plane to maintain Mach 3.75, which is the speed at which rapiers deliver max thrust, and use excess power to climb.  This will yield the highest altitude before specific excess power drops to zero, and the aircraft can only climb by trading airspeed for altitude which is, as you point out, useless.\n\u003C/p\u003E\n\u003Cp\u003E\nOr do you go for a slightly higher speed, which will yield a lower altitude, but may be worthwhile because power tails off more slowly between mach 3.75 and mach 4.5 than the way it falls off a cliff above 24km.\n\u003C/p\u003E\n\u003Cp\u003E\nWhich one gives more total energy?\n\u003C/p\u003E\n\u003Cp\u003E\n---------------------------\n\u003C/p\u003E\n\u003Cp\u003E\nBTW I\u0027d dispute the assertion, \u0022potential energy is useless\u0022.  \n\u003C/p\u003E\n\u003Cp\u003E\nPotential energy = height.\n\u003C/p\u003E\n\u003Cp\u003E\nKinetic energy = speed\n\u003C/p\u003E\n\u003Cp\u003E\nGoing to orbit is the process of going from  0 in both to at least 70km altitude and mach 7.  Kinetic is the lion\u0027s share of the work, but potential energy \u0022height\u0022 is by no means useless.  \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n---------------------------------------\n\u003C/p\u003E\n\u003Cp\u003E\nOK,  i need to drink a lot of caffeine and dig around the kinematic equations i vaguely remember from my school days.    That way i can quantify how valuble (say) 100m in altitude is compared to 100 m/s in velocity.\n\u003C/p\u003E\n\u003Cp\u003E\nIn otherwords, if you threw  a baseball straight up at 100 m/s on Kerbin but there was no air resistance, how high would it go.  What is the formula that gives this..\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-04-14T14:13:10Z\u0022 title=\u002204/14/2016 02:13  PM\u0022 data-short=\u00228 yr\u0022\u003EApril 14, 2016\u003C/time\u003E by AeroGav\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Empress Neptune","CreatedById":158189,"CreatedDateTime":"2016-04-14T15:38:53Z","Content":"\n\u003Cp\u003E\nI understand the question better now. NERV engines make a difference, I haven\u0027t actually used them in atmosphere for SSTO\u0027s. I would think what is more efficient will depend on your NERV TWR. If it\u0027s low, you will need to build up vertical speed to give them time to accelerate you.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOn potential energy, you do need it in that you need height to orbit, but PE is more of a side effect of orbit than something that gets you there. In other words, if you started at zero energy total and then got 70 km worth of PE, you wouldn\u0027t orbit. If you were given KE instead, you would actually make orbit automatically.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe formula for distance from constant acceleration is d = v_initial*t \u002B .5*acceleration*time^2. I forgot to mention that in my first post.\n\u003C/p\u003E\n"},{"CreatedByName":"AeroGav","CreatedById":152027,"CreatedDateTime":"2016-04-14T16:08:05Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222513680\u0022 data-ipsquote-contentid=\u0022136932\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221460648333\u0022 data-ipsquote-userid=\u0022158189\u0022 data-ipsquote-username=\u0022Empress Neptune\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n14 minutes ago, Empress Neptune said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI understand the question better now. NERV engines make a difference, I haven\u0027t actually used them in atmosphere for SSTO\u0027s. I would think what is more efficient will depend on your NERV TWR. If it\u0027s low, you will need to build up vertical speed to give them time to accelerate you.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220160412202320_1_zpspirhnsei.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i1144.photobucket.com/albums/o492/narostel/20160412202320_1_zpspirhnsei.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOne Rapier, Two NERVs and two droppable Panther engines as \u0022boosters\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://s1144.photobucket.com/user/narostel/media/Penta%20Project/26km%20mach%204_zps5fgs7yfd.jpg.html\u0022\u003E\u003Cimg src=\u0022http://i1144.photobucket.com/albums/o492/narostel/Penta%20Project/26km%20mach%204_zps5fgs7yfd.jpg\u0022 class=\u0022ipsImage\u0022 alt=\u002226km%20mach%204_zps5fgs7yfd.jpg\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m kind of thinking about things from an aircraft point of view and not an orbital mechanics one.    Flying at 2 degrees AoA where lift:drag ratio is best, it needs about 40kn of thrust to simply stay airborne.  Anything over that can be used to climb and accelerate, it does a mixture of both so that it stays at more or less the same angle of attack as the air gets thinner,  because that\u0027s how the pitch trim has been set.   Over time, an increasing portion of gravity is counteracted by orbital effect rather than wing lift.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://s1144.photobucket.com/user/narostel/media/Penta%20Project/42km%20mach%206_zpsioe3hbyb.jpg.html\u0022\u003E\u003Cimg src=\u0022http://i1144.photobucket.com/albums/o492/narostel/Penta%20Project/42km%20mach%206_zpsioe3hbyb.jpg\u0022 class=\u0022ipsImage\u0022 alt=\u002242km%20mach%206_zpsioe3hbyb.jpg\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n40 seconds before MECO.\n\u003C/p\u003E\n\u003Cp\u003E\n---------------------------------------\n\u003C/p\u003E\n\u003Cp\u003E\nAs you can see in this case we\u0027re not really lobbing ourselves upwards on a ballistic arc hoping to accelerate to orbital speed before coming down again,   rather just flying up like a low powered transport plane.    Obviously the more total energy i can get out of the RAPIERs the better , because their ISP is 4.25 times higher than that of the NERVs.        But,  you have to take into account what would in a rocket be called \u0022gravity losses\u0022,  ie.  if the airbreathing engines are only making 45kn, i might still be gaining energy, but 90% of the fuel is just being used to stand still so i\u0027d actually get more per pound of fuel by starting up the thirsty closed cycle engine.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nCheers for the formula !\n\u003C/p\u003E\n"},{"CreatedByName":"zolotiyeruki","CreatedById":150224,"CreatedDateTime":"2016-04-18T20:25:08Z","Content":"\n\u003Cp\u003E\nFWIW, I use a small tweak on my space planes that seems to have a dramatic effect on their efficiency:  I pitch my lifting surfaces upwards by 5 degrees in the hangar, and above 20km, I point the craft prograde.  Due to some of the nuances of the game\u0027s drag model, this give a significant improvement--you minimize the fuselage drag while maintaining lift from your wings.  This effect gets amplified with long craft.  I had a plane with 4 or 5 mk1 fuel tanks, and a 5 degree AoA (of the fuselage) effectively *doubled* my drag.\n\u003C/p\u003E\n"},{"CreatedByName":"Empiro","CreatedById":112072,"CreatedDateTime":"2016-04-18T20:36:00Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222520890\u0022 data-ipsquote-contentid=\u0022136932\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221461011108\u0022 data-ipsquote-userid=\u0022150224\u0022 data-ipsquote-username=\u0022zolotiyeruki\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 minute ago, zolotiyeruki said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nFWIW, I use a small tweak on my space planes that seems to have a dramatic effect on their efficiency:  I pitch my lifting surfaces upwards by 5 degrees in the hangar, and above 20km, I point the craft prograde.  Due to some of the nuances of the game\u0027s drag model, this give a significant improvement--you minimize the fuselage drag while maintaining lift from your wings.  This effect gets amplified with long craft.  I had a plane with 4 or 5 mk1 fuel tanks, and a 5 degree AoA (of the fuselage) effectively *doubled* my drag.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat\u0027s a pretty nifty trick. I think the biggest issue in stock aerodynamics is that as soon as you pitch up and increase your AoA, the drag increases by a ridiculous amount without any corresponding changes in lift or your velocity vector. I\u0027ve found the best trajectory in stock is to have your velocity vector at a good 10-15 degrees above horizon so that when you switch to rocket engines you don\u0027t need to pitch up and bleed away all of your speed.\n\u003C/p\u003E\n\u003Cp\u003E\nIronically since 1.0, I\u0027ve found it much easier to make SSTOs using FAR.\n\u003C/p\u003E\n"},{"CreatedByName":"AeroGav","CreatedById":152027,"CreatedDateTime":"2016-04-18T21:05:25Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222520890\u0022 data-ipsquote-contentid=\u0022136932\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221461011108\u0022 data-ipsquote-userid=\u0022150224\u0022 data-ipsquote-username=\u0022zolotiyeruki\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n19 minutes ago, zolotiyeruki said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nFWIW, I use a small tweak on my space planes that seems to have a dramatic effect on their efficiency:  I pitch my lifting surfaces upwards by 5 degrees in the hangar, and above 20km, I point the craft prograde.  Due to some of the nuances of the game\u0027s drag model, this give a significant improvement--you minimize the fuselage drag while maintaining lift from your wings.  This effect gets amplified with long craft.  I had a plane with 4 or 5 mk1 fuel tanks, and a 5 degree AoA (of the fuselage) effectively *doubled* my drag.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWere you getting sufficient drag to show up on the F12 aero forces display as per my screenshots?  As you can see I\u0027m not experiencing enough to show up as red lines on the aero forces display, except when accelerating through the transonic region 10-15km.    Even then the red lines are coming off the wings and engine nozzles not the fuselage body.\n\u003C/p\u003E\n\u003Cp\u003E\nThat said, my airplane isn\u0027t one that would benefit so much from this tweak , due to having the type 2 lifting fuselage, and also having far more wing than fuselage generally.   It also flys at very small AoA, due to the large wing.\n\u003C/p\u003E\n\u003Cp\u003E\nI did try using incidence angle but didn\u0027t like it.  For a start, the SPH provides no way to rotate a precise number of degrees, you have to use the rotate tool in fine mode and do it by eye , which drives me crazy.   What if you have multiple wing sections attached to the fuselage, how to you get them all at the same angle ?\n\u003C/p\u003E\n\u003Cp\u003E\nSecond,  it causes the wings to stall out before the canards and fuselage lift, which creates some nasty departure characteristics.  On a tail plane rather than canard design, i guess having the wings stall first is actually a good thing, so this is preferable, but definitely not on a canard.\n\u003C/p\u003E\n\u003Cp\u003E\nThird, it\u0027s hard to optimise over the whole range of AoA used in the flight.    I start at about 1.5 AoA  during my speedrun - say mach 4.5 and 24km,   and increase to an AoA of 5 by mach 6 and 30km\u002B.      Using too much incidence would result in negative AoA on the fuselage at certain points.  Again, this is a function of my design.    Most Spaceplanes I see people make have tiny lift surfaces.  I\u0027ve seen someone build a type 2 with 6 engines and only a pair of Big S strakes for wings.  It was pitched up at 25-30 AoA above 20km so would benefit from your advice.  \n\u003C/p\u003E\n\u003Cp\u003E\nI don\u0027t feel all my wings are dead weight because they are also holding 90% of the fuel.   But in an LF/O setup that would not be the case, you might feel differently.  Also, I designed that thing to be capable of landing on Duna.     It touched down at just 32 m/s,   which is safe and easy.   A previous design I did had similar weight but only two pairs of wings and came in at 70m/s.  Took twenty attempts to land without damaging it.\n\u003C/p\u003E\n"},{"CreatedByName":"zolotiyeruki","CreatedById":150224,"CreatedDateTime":"2016-04-19T14:36:07Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222520981\u0022 data-ipsquote-contentid=\u0022136932\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221461013525\u0022 data-ipsquote-userid=\u0022152027\u0022 data-ipsquote-username=\u0022AeroGav\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n17 hours ago, AeroGav said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWere you getting sufficient drag to show up on the F12 aero forces display as per my screenshots?  As you can see I\u0027m not experiencing enough to show up as red lines on the aero forces display, except when accelerating through the transonic region 10-15km.    Even then the red lines are coming off the wings and engine nozzles not the fuselage body.\n\u003C/p\u003E\n\u003Cp\u003E\nThat said, my airplane isn\u0027t one that would benefit so much from this tweak , due to having the type 2 lifting fuselage, and also having far more wing than fuselage generally.   It also flys at very small AoA, due to the large wing.\n\u003C/p\u003E\n\u003Cp\u003E\nI did try using incidence angle but didn\u0027t like it.  For a start, the SPH provides no way to rotate a precise number of degrees, you have to use the rotate tool in fine mode and do it by eye , which drives me crazy.   What if you have multiple wing sections attached to the fuselage, how to you get them all at the same angle ?\n\u003C/p\u003E\n\u003Cp\u003E\nSecond,  it causes the wings to stall out before the canards and fuselage lift, which creates some nasty departure characteristics.  On a tail plane rather than canard design, i guess having the wings stall first is actually a good thing, so this is preferable, but definitely not on a canard.\n\u003C/p\u003E\n\u003Cp\u003E\nThird, it\u0027s hard to optimise over the whole range of AoA used in the flight.    I start at about 1.5 AoA  during my speedrun - say mach 4.5 and 24km,   and increase to an AoA of 5 by mach 6 and 30km\u002B.      Using too much incidence would result in negative AoA on the fuselage at certain points.  Again, this is a function of my design.    Most Spaceplanes I see people make have tiny lift surfaces.  I\u0027ve seen someone build a type 2 with 6 engines and only a pair of Big S strakes for wings.  It was pitched up at 25-30 AoA above 20km so would benefit from your advice.  \n\u003C/p\u003E\n\u003Cp\u003E\nI don\u0027t feel all my wings are dead weight because they are also holding 90% of the fuel.   But in an LF/O setup that would not be the case, you might feel differently.  Also, I designed that thing to be capable of landing on Duna.     It touched down at just 32 m/s,   which is safe and easy.   A previous design I did had similar weight but only two pairs of wings and came in at 70m/s.  Took twenty attempts to land without damaging it.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI never looked at the aero forces while I was testing it.  Rather, I measured it based on fuel consumption and speed over a (very!) long atmospheric flight, so it may be less applicable if you\u0027re trying to get to orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nI love the look of the Mk2 parts, but their aerodynamics (or rather, how they work in the aero and physics model of the game) leave much to be desired.  In order to get lift from them, you have to have positive AoA, but then you incur significant drag penalties.  In my experience, the drag penalties are greater than the lift benefits from Mk2 parts.  Wings don\u0027t really have parasitic drag \u003Cem\u003Eper se\u003C/em\u003E in the game, only induced drag (which is still non-zero at 0 AoA, to give some of the same effect).  For the same fuel capacity and lift, wings \u002B Mk1 parts are lighter and have far less drag than Mk2 parts.  \n\u003C/p\u003E\n\u003Cp\u003E\nStalling isn\u0027t really an issue, due to the high speeds we\u0027re talking about, and also thanks to the \u003Cem\u003Every\u003C/em\u003E forgiving nature of the aero model in the game.  Of course, since I don\u0027t use the Mk2 parts as much, it\u0027s not as much of an issue for me.\n\u003C/p\u003E\n\u003Cp\u003E\nIn order to get an accurate and consistent AoA on my wings, I don\u0027t use the rotate tool.  Rather, I Shift\u002BQ (or whatever direction I need) to rotate the parts exactly 5 degrees when attaching them.  When flying, once I get up to 21km or so, I use Pilot Asssistant to hold a 0 degree pitch.  As the craft accelerates, the wings (which still have AoI) keep it going up.  Minimizing drag issue becomes increasingly important as the Rapiers lose thrust with altitude and speed.  Near the end of my long atmospheric flight, I was at the point where the Rapier thrust was \u0026lt;10kN, my speed was well over 1600m/s, and my altitude was 27km or so (this was back pre-1.0.5, and the thermal model was easier).\n\u003C/p\u003E\n\u003Cp\u003E\nWet wings are awesome.  I wish we had one or two more medium-small sizes of them.\n\u003C/p\u003E\n"},{"CreatedByName":"AeroGav","CreatedById":152027,"CreatedDateTime":"2016-04-19T15:09:32Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222522143\u0022 data-ipsquote-contentid=\u0022136932\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221461076567\u0022 data-ipsquote-userid=\u0022150224\u0022 data-ipsquote-username=\u0022zolotiyeruki\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n23 minutes ago, zolotiyeruki said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI never looked at the aero forces while I was testing it.  Rather, I measured it based on fuel consumption and speed over a (very!) long atmospheric flight, so it may be less applicable if you\u0027re trying to get to orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nI love the look of the Mk2 parts, but their aerodynamics (or rather, how they work in the aero and physics model of the game) leave much to be desired.  In order to get lift from them, you have to have positive AoA, but then you incur significant drag penalties.  In my experience, the drag penalties are greater than the lift benefits from Mk2 parts.  Wings don\u0027t really have parasitic drag \u003Cem\u003Eper se\u003C/em\u003E in the game, only induced drag (which is still non-zero at 0 AoA, to give some of the same effect).  For the same fuel capacity and lift, wings \u002B Mk1 parts are lighter and have far less drag than Mk2 parts.  \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah aesthetically,  it\u0027s MK2 \u0026gt; MK1 \u0026gt; MK 3.      Really don\u0027t like the look of mark 3, and the lack of inline cockpit, and none of the stock wings are as large as i\u0027d like for a Mk3 aircraft (except the Fat-S airliner wing, which looks out of place on a spacecraft and hasn\u0027t got a great temperature tolerance).\n\u003C/p\u003E\n\u003Cp\u003E\nMK2 of course will always have more drag than mk1 because of the increased frontal area.  Nobody picks mark 2 parts for the fuselage lift, the reason my aircraft has mk2 fuselage parts is because a mk1 cargo bay wouldn\u0027t hold all that much.  MK3 are worse again, and they have very poor engine mount options.   The mk2 bicoupler is decent enough,  but the mark 3 engine mounting plate - in the style of the space shuttle - creates enormous amounts of drag.  Instead people end up clustering a silly amount of mark 1 sized nacelles radially.  \n\u003C/p\u003E\n\u003Cp\u003E\nYou can see in my screenshots there is neither lift nor drag appearing on the aero forces display at the AoA and dynamic pressure regimes I encounter when flying to orbit.\n\u003C/p\u003E\n"}]}