{"TopicId":136940,"ForumId":16,"TopicTitle":"solar orbit rescue / interplanetary travel tips","CreatedByName":"badgerduck","CreatedById":158007,"CreatedDateTime":"2016-04-14T13:34:03Z","PageNum":1,"Articles":[{"CreatedByName":"badgerduck","CreatedById":158007,"CreatedDateTime":"2016-04-14T13:34:03Z","Content":"\n\u003Cp\u003E\nHi All\n\u003C/p\u003E\n\u003Cp\u003E\nLong story short, back when I started playing KSP in v 0.22 I got some Kerbals stranded in solar orbit (primary mission objective was - \u0022how high will this one go...\u0022). I\u0027ve always had in mind to rescue them and now I have got some more experience and a limited amount of skill, I\u0027m going to give it a go.\n\u003C/p\u003E\n\u003Cp\u003E\nMy question is really - does anyone have any tips for efficiently getting from one solar orbit to another and making a rendezvous with another object (bearing in mind I\u0027m not aiming at something with any gravity so will have to do all the braking with the engines)?\n\u003C/p\u003E\n\u003Cp\u003E\nThanks\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Hodari","CreatedById":157578,"CreatedDateTime":"2016-04-14T21:31:50Z","Content":"\n\u003Cp\u003E\nIf you can do a rendezvous in Low Kerbin Orbit(and if you can\u0027t do that yet, you should obviously practice there first), then it\u0027s the exact same process to do it in orbit around the Sun.  Obviously, the speeds involved will be a bit higher and the orbital period is much longer, so make sure you\u0027re launching at the right time so that you end up in the same orbital plane(since the other mission launched from Kerbin as well, I\u0027d assume there won\u0027t be too much of an inclination difference anyway) and as close to the same point in the orbit as possible.  Then just do a normal rendezvous.\n\u003C/p\u003E\n"},{"CreatedByName":"Plusck","CreatedById":153264,"CreatedDateTime":"2016-04-15T00:08:49Z","Content":"\n\u003Cp\u003E\nAs Hodari said, exactly.\n\u003C/p\u003E\n\u003Cp\u003E\nYour original post actually quite clearly states the main issue: your target has no gravity so everything has to be done with engines. Therefore, unlike a planetary intercept, it really matters a lot what sort of angle you have as you meet your target orbit. If your rescue ship comes in on a slow elliptical orbit while the target is ciruclar, you\u0027ll have a huge difference in velicity and it will be extremely expensive. So yeah, try to make the encounter gentle... it doesn\u0027t cost much to set up (except in Kerbal time) but the end result can make a huge difference.\n\u003C/p\u003E\n"},{"CreatedByName":"Empiro","CreatedById":112072,"CreatedDateTime":"2016-04-15T03:13:41Z","Content":"\n\u003Cp\u003E\nFor interplanetary intercepts, the big thing to look at is where the ascending / descending nodes are with respect to your close encounter point. The encounter will never be close unless that node is right at your intercept point. Even a .1 degree difference in inclination will result in no encounter except at the ascending / descending nodes.\n\u003C/p\u003E\n\u003Cp\u003E\nThe second thing to watch out for is that a slight difference in orbit (e.g you cross your target\u0027s orbit) will result in a large difference in encounter velocity, and it will cost you a lot of fuel to match the target\u0027s orbit, so try your best to get the orbits to just barely be touching each other if possible. If you\u0027re in a rush then this might not be possible.\n\u003C/p\u003E\n\u003Cp\u003E\nThe final thing to note is that your encounter distance can be in the thousands of kilometers and still be successful. You simply need to pay attention 1-2 hours before the close encounter, and push the retrograde velocity marker toward the target retrograde as soon as you notice it diverge.\n\u003C/p\u003E\n"},{"CreatedByName":"badgerduck","CreatedById":158007,"CreatedDateTime":"2016-06-05T19:11:24Z","Content":"\n\u003Cp\u003E\nThanks for the tips everyone. I\u0027ve rescued one of them now although it took a bit of time...\n\u003C/p\u003E\n"}]}