{"TopicId":137236,"ForumId":55,"TopicTitle":"Improved graphics on planet surfaces?","CreatedByName":"Mr falcor","CreatedById":162136,"CreatedDateTime":"2016-04-18T09:18:07Z","PageNum":1,"Articles":[{"CreatedByName":"Mr falcor","CreatedById":162136,"CreatedDateTime":"2016-04-18T09:18:07Z","Content":"\n\u003Cp\u003E\nWould just like to thank squad for their excellent work ☺ can\u0027t wait to play the full release of ksp. However I would like to ask if squad have any plans to upgrade  the graphics on planet surfaces like duna etc and add more unique geographical futures to explore?simmiler to what they have done with mun  and kerbin.i understand they were restricted by the old unity engine and 32 bit before. Again love your work ☺\n\u003C/p\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2016-04-18T13:43:23Z","Content":"\n\u003Cp\u003E\nYeah I know they\u0027ve expressed interest somewhat recently in a big graphics pass which would be amazing. Everybody is crossing their fingers on clouds, but even on kerbin the texture tiling isn\u0027t always the best. This may have to do with the kind of radical scale changes you experience in this game. I\u0027m not a programmer but I\u0027m guessing an intermediate texture map in between what you see from high up and what you see from the surface might help. I have no idea the memory cost of these things but long story short, yes they\u0027re interested in this. \n\u003C/p\u003E\n"},{"CreatedByName":"Mr falcor","CreatedById":162136,"CreatedDateTime":"2016-04-18T14:20:07Z","Content":"\n\u003Cp\u003E\nYeah will keep my fingers crossed \u003Cimg alt=\u0022:confused:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 title=\u0022:confused:\u0022\u003Eanything that will increase ingame immersion is a bonus,I really like the new external IVA view  \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003Eand I also believe I saw on a video of a new fishing animation on ksp???... or maybe I was dreaming lol\n\u003C/p\u003E\n"},{"CreatedByName":"goldenpeach","CreatedById":34566,"CreatedDateTime":"2016-04-18T14:24:04Z","Content":"\n\u003Cp\u003E\nThe fishing animation is not in the stock game: you have to download the mod to go fishing.\n\u003C/p\u003E\n"},{"CreatedByName":"zarakon","CreatedById":5160,"CreatedDateTime":"2016-04-19T20:45:48Z","Content":"\n\u003Cp\u003E\nEeloo in particular could use some love.  It looks neat and shiny from orbit with interesting brown line features.  But once you actually get down to the surface it\u0027s not like that at all.  The white shiny parts turn into greyish dirt that just look like a slightly lighter-colored Mun.  The cracks in the surface turn out to be not as deep as they look, and have no real detail.  The brown parts end up with the same texture as the white-ish parts, just brownish instead.  For a place that takes so long to get to, it\u0027s pretty underwhelming.\n\u003C/p\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2016-04-19T23:49:05Z","Content":"\n\u003Cp\u003E\nHaaaa-woops! Wrong thread!\n\u003C/p\u003E\n\u003Cp\u003E\n*does the charleston off stage*\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-04-20T00:04:39Z\u0022 title=\u002204/20/2016 12:04  AM\u0022 data-short=\u00228 yr\u0022\u003EApril 20, 2016\u003C/time\u003E by Pthigrivi\u003C/strong\u003E\n\u003C/span\u003E\n"}]}