{"TopicId":13732,"ForumId":32,"TopicTitle":"My first docking success!","CreatedByName":"Bluejayek","CreatedById":18471,"CreatedDateTime":"2012-07-06T03:55:56Z","PageNum":1,"Articles":[{"CreatedByName":"Bluejayek","CreatedById":18471,"CreatedDateTime":"2012-07-06T03:55:56Z","Content":"\n\u003Cp\u003EI finally managed to perform a successful docking maneurver! \u003C/p\u003E\u003Cp\u003EFor this, I had a ship in a 5 million meter orbit around kerbin, almost circular (part of a ship array I had orbiting here). I launched my docking ship up there, spent half an hour circularising the orbit and synchronizing, and then another hour fiddling around with rcs until I got it.\u003C/p\u003E\u003Cp\u003EI tried to grab on sideways first, and that didnt work, it just sent the ship spinning away, which almost made me quit right there. Then, I tried to grab onto the front, but the contact broke off as I was tryin to fly away with it. Finally, I managed a solid contact with the front of the craft, and was able to burn to deorbit it, and switched over to safely land the brave kerbals back on wet water \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EVery satisfying to have it work, and very fiddly to do so.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/cuz9c\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/cuz9c\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Anachronda","CreatedById":23187,"CreatedDateTime":"2012-07-06T04:53:22Z","Content":"\n\u003Cp\u003ECongratulations! You\\\u0027re a better man than I; I always get in trouble when I get close enough that I should be closing with the RCS thrusters. One of these days I\\\u0027ll get it.\u003C/p\u003E\n"},{"CreatedByName":"Pluto100","CreatedById":26442,"CreatedDateTime":"2012-07-06T05:38:49Z","Content":"\n\u003Cp\u003EAwesome! Good job!\u003C/p\u003E\n"},{"CreatedByName":"Bluejayek","CreatedById":18471,"CreatedDateTime":"2012-07-06T17:55:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Anachronda\u0022 data-cite=\u0022Anachronda\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ECongratulations! You\\\u0027re a better man than I; I always get in trouble when I get close enough that I should be closing with the RCS thrusters. One of these days I\\\u0027ll get it.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EKeep trying! As I mentioned, this successs took an hour messing around with the RCS thrusters before I got it right. \u003C/p\u003E\u003Cp\u003EA couple tips: \u003C/p\u003E\u003Cp\u003E1) Popping time warp to third setting for a second and then back down will kill the rotation of your ship, and the ship you are trying to dock with. You might consider this cheating, but it is very useful, and much easier then swapping over to the other craft to kill its rotation when you accidentally bump it\u003C/p\u003E\u003Cp\u003E2) Try to make sure your RCS thrusters are symetric verticalls as well as radially on your craft. For exampl,e if you only have RCS on the bottom of a long craft every thrust you make with it to move up/down left/right will additionally cause you to start tilting, even with ASAS on.\u003C/p\u003E\u003Cp\u003E3) ASAS. Really, this is neccesary.... way to hard to try to close in with RCS if you also have to keep adjusting alignment. \u003C/p\u003E\u003Cp\u003E4) Bring enough RCS fuel. You don\\\u0027t want to run out when you are just inches away.\u003C/p\u003E\u003Cp\u003EGood luck \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}