{"TopicId":137609,"ForumId":16,"TopicTitle":"Starting fresh career in 1.1 - tips to keep it tidy","CreatedByName":"Callmedave","CreatedById":62412,"CreatedDateTime":"2016-04-21T16:10:37Z","PageNum":1,"Articles":[{"CreatedByName":"Callmedave","CreatedById":62412,"CreatedDateTime":"2016-04-21T16:10:37Z","Content":"\n\u003Cp\u003E\nIm going to start a new career in 1.1. I had issues where my previous saves were messy, I had lots of redundant craft floating around, and I lost track of what each was for. I did name them \u0027Mun sat 1\u0027 or \u0027Contract probe\u0027 etc, but i still ended up with a lot of random craft. so much so that when i log on, i looked at all the mess and logged off again. (kind of opening a door to a cupboard to clean it, seeing how bad it is and closing the cupboard again)\n\u003C/p\u003E\n\u003Cp\u003E\nI would like a better method for naming my craft, maybe some kind of coding system? so i know what they are for and what i should be doing with them. What methods do you use?\n\u003C/p\u003E\n\u003Cp\u003E\nI like the idea of not leaving any space junk, de-orbiting lifter stages, etc. Il be playing with remote tech and happy to install any other mods you recommend to help.\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-04-21T16:53:03Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222528192\u0022 data-ipsquote-contentid=\u0022137609\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221461255037\u0022 data-ipsquote-userid=\u002262412\u0022 data-ipsquote-username=\u0022Callmedave\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n24 minutes ago, Callmedave said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI would like a better method for naming my craft, maybe some kind of coding system? so i know what they are for and what i should be doing with them. What methods do you use?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nMy own method is a combination of:\n\u003C/p\u003E\n\u003Col\u003E\u003Cli\u003E\naggressively renaming things as \u0022debris\u0022\n\u003C/li\u003E\n\u003Cli\u003E\nfollowing a consistent exploration regimen that reduces the number of craft involved\n\u003C/li\u003E\n\u003Cli\u003E\nnaming conventions\n\u003C/li\u003E\n\u003C/ol\u003E\u003Cp\u003E\nAggressive debris naming:\n\u003C/p\u003E\n\u003Cp\u003E\nThis is the equivalent of clearing stuff out of my house and stuffing in the attic.  Unless there\u0027s a convincing case that I\u0027m going to need this for something soon, then as soon as I\u0027m done with a ship I rename it to the debris category to get it out of my face.  This includes just about all contract-placed craft.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nConsistent exploration regimen:\n\u003C/p\u003E\n\u003Cp\u003E\nNon-RT:  I\u0027ll generally send one (and only one) initial probe to pave the way, generally with an orbital resource scanner on it.  Always named \u0022\u0026lt;planet\u0026gt; Surveyor\u0022.  Leave in place so that I can pick up \u0022science from space around \u0026lt;planet\u0026gt;\u0022 contracts for free.\n\u003C/p\u003E\n\u003Cp\u003E\nRT:  Instead of a Surveyor, I send a Relay.  It\u0027s like a Surveyor, but big and packs a lot of antennas and is destined for a high circular polar orbit.  It does a low orbit on initial arrival to get the resource survey done, then transfers to the higher orbit for relay status.\n\u003C/p\u003E\n\u003Cp\u003E\nLow-orbit ring of commsats to establish surface and near-space coverage around the planet:  they\u0027re named \u0022\u0026lt;planet\u0026gt; Comsat \u0026lt;N\u0026gt;\u0022, and I leave them \u0022visible\u0022 only in early stages of exploration when I don\u0027t have many planets covered.  Then I rename them to debris (which makes them invisible, but they still function for RT).\n\u003C/p\u003E\n\u003Cp\u003E\nAn appropriate set of names for crewed ships, e.g. motherships (\u0022Mission\u0022), extractors (\u0022Miner\u0022), science landers (\u0022Lander\u0022), always named after the destination.\n\u003C/p\u003E\n\u003Cp\u003E\nShips designed for one-off contracts have a standard naming convention so that I have \u0027em around in the VAB for future reference, to save time if a similar contract comes up.  The name is always \u0022\u0026lt;destination\u0026gt; (Station|Outpost) \u0026lt;crew capacity\u0026gt; [modifiers for add-ons]\u0022.  Thus, \u0022Put a station in a solar orbit that supports nine kerbals and has cupola and a science lab\u0022 will be \u0022Solar Outpost IX-CL\u0022, or \u0022Put a base on Minmus that supports five kerbals\u0022 would be \u0022Minmus Outpost V\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI used to have much more of a clutter problem because I kept reacting with \u0022but I might need that!\u0022 anxiety and never threw anything away.  Then I just got ruthless about it and marked anything that\u0027s not immediately needed as debris, and life got simpler.  If I *really* need it I can go hunt through the debris list.  \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI really wish that KSP had an extra few ship types (e.g. \u0022Custom1,\u0022 \u0022Custom2\u0022, \u0022Custom3\u0022) that aren\u0027t otherwise used for anything, so that I could (for example) just decide that \u0022I will reserve Custom1 for all my RT communication satellites\u0022 and put them all there, which would make managing things a lot easier.\n\u003C/p\u003E\n"},{"CreatedByName":"KocLobster","CreatedById":159324,"CreatedDateTime":"2016-04-21T17:02:48Z","Content":"\n\u003Cp\u003E\nThis kind of thing bothers me too, although I never let it get to the point that you let it get to. You can start by deleting all your unused vessels, unless you\u0027re dead set on starting a new career. Either way, I suggest adopting the strategy of creating ships that don\u0027t leave debris, it\u0027s actually really easy.\n\u003C/p\u003E\n\u003Cp\u003E\nEnsure that each stage will be decoupled in an orbit that eventually destroys it; do this for everything but your payload. This helps keep things in the tracking center to a minimum.\n\u003C/p\u003E\n\u003Cp\u003E\nAs for naming, I do something simple similar to you. I name everything by [Celestial destination] [Type of craft] [Number of crafts \u003Cem\u003Ethat already exist \u003Cstrong\u003Ecurrently in flight\u003C/strong\u003E, \u003C/em\u003Ethat share the same celestial destination \u003Cu\u003Eand\u003C/u\u003E type of craft]\u003Cem\u003E.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThis means that a lot of ships end up with the numeral designation of 1, but this just makes sense to me. Why have a 2 when it\u0027s the only ship out there in existence?\n\u003C/p\u003E\n\u003Cp\u003E\nSome examples:\n\u003C/p\u003E\n\u003Cp\u003E\nMun Probe 1\n\u003C/p\u003E\n\u003Cp\u003E\nMun Station 1\n\u003C/p\u003E\n\u003Cp\u003E\nDuna Probe 1\n\u003C/p\u003E\n\u003Cp\u003E\nMinmus Lander 1\n\u003C/p\u003E\n\u003Cp\u003E\nMun Probe 2 (if it\u0027s launched before Mun Probe 1 finishes its mission)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI don\u0027t usually have an extreme amount of ships all at the same time, typically less than 15 different crafts at a time, and so this isn\u0027t confusing. Maybe it would be if I had a ton or used realism/RSS mods.\n\u003C/p\u003E\n\u003Cp\u003E\nFor those ships that just couldn\u0027t help but leave some debris somewhere, I just delete them from the tracking center. It\u0027s far easier and not worth it to manually destroy them with a Klaw-\u0026gt;deorbit, or explosives (if you have a mod that has that, like KIS/KAS).\n\u003C/p\u003E\n\u003Cp\u003E\nHope this helps. It works very well for me.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-04-21T17:05:00Z\u0022 title=\u002204/21/2016 05:05  PM\u0022 data-short=\u00228 yr\u0022\u003EApril 21, 2016\u003C/time\u003E by KocLobster\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Empiro","CreatedById":112072,"CreatedDateTime":"2016-04-21T18:49:47Z","Content":"\n\u003Cp\u003E\nIf you carefully plan out all of your stages, you can definitely avoid creating any debris at all. I personally like using a 1.5 stage to orbit design, because a good sustainer engine (like the Skipper or Swivel) plus boosters will almost make it into orbit. For example, for a hypothetical Mun mission:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nBoosters: dropped into the ocean early\n\u003C/li\u003E\n\u003Cli\u003E\nCore stage: dropped when PE is ~20km\n\u003C/li\u003E\n\u003Cli\u003E\nTransfer stage: transfers to the Mun, circularizes, performs most of the landing burn, and is dropped a few KM from the surface of the Mun\n\u003C/li\u003E\n\u003Cli\u003E\nLander stage: performs the final landing, takeoff, and return to Kerbin. Detached from command pod before entering the atmosphere\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nI\u0027ve actually gone entire careers with only a few pieces of debris (usually due to mistakes) drifting about. Most of my satellites also had enough fuel to crash into something once their mission was complete.\n\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2016-04-21T18:56:37Z","Content":"\n\u003Cp\u003E\nThe \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/81114-110-2016-04-20-haystack-continued-v0500\u0022 rel=\u0022\u0022\u003EHaystack\u003C/a\u003E mod can help you with selecting and viewing craft in a more reasonable, organized manner.\n\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2016-04-21T18:57:02Z","Content":"\n\u003Cp\u003E\nMy goal in every career is 0 debris and 0 ships around after they have reached end of life. This keeps things pretty tidy and makes me feel good to boot.\n\u003C/p\u003E\n\u003Cp\u003E\nI will only delete ships and debris if one of these is true:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nIt will crash or touch atmosphere\n\u003C/li\u003E\n\u003Cli\u003E\nIt will cross a sphere of influence boundary\n\u003C/li\u003E\n\u003Cli\u003E\nIt is escaping from Sun.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nThe first and last are obvious. The middle one though, you can safely assume that the craft will get into one or the other state eventually.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-04-21T18:58:00Z\u0022 title=\u002204/21/2016 06:58  PM\u0022 data-short=\u00228 yr\u0022\u003EApril 21, 2016\u003C/time\u003E by 5thHorseman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Wemb","CreatedById":121979,"CreatedDateTime":"2016-04-22T12:15:47Z","Content":"\n\u003Cp\u003E\nThere\u0027s also a mod which can automatically number your launches, I believe - though I\u0027ve not used it myself yet, but I keep seeing it in the list of 1.1 compatible mods in CKAN.\n\u003C/p\u003E\n\u003Cp\u003E\nDon\u0027t have KSP here, but this might be it.\n\u003C/p\u003E\n\u003Ciframe data-embedcontent=\u0022\u0022 frameborder=\u00220\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/129124-launch-numbering/\u0026amp;do=embed\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWemb\n\u003C/p\u003E\n"}]}