{"TopicId":137794,"ForumId":21,"TopicTitle":"Trebuchet: Fling a Stayputnik 200 meters or more!","CreatedByName":"pTrevTrevs","CreatedById":131541,"CreatedDateTime":"2016-04-22T23:21:48Z","PageNum":1,"Articles":[{"CreatedByName":"pTrevTrevs","CreatedById":131541,"CreatedDateTime":"2016-04-22T23:21:48Z","Content":"\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nThis game has seen many creations which the creators cannot have imagined would be possible, like stock piston engines, rotating hinges, and even submarines. However, as far as I know, this is the first real trebuchet to be created in Kerbal Space Program\u003Cb\u003E*. \u003C/b\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:11px;\u0022\u003E*Scott Manley \u003Cem\u003Edid\u003C/em\u003E make a trebuchet several years ago, however it had no sling, no hinge, and used a mod for the bearing.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022j5fZPiR.png\u0022 src=\u0022http://i.imgur.com/j5fZPiR.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nFor those who do not know, a trebuchet is a form of siege weapon used in the Middle Ages in Europe. Before gunpowder artillery was invented, the trebuchet was the largest, most powerful weapon used against fortified castles, and many were so large that they had to be built on the site of the siege itself, as they were too massive to be transported easily. The biggest trebuchets were able to lob boulders weighing nearly half a ton hundreds of meters\u003Csup\u003E[citation needed]\u003C/sup\u003E. A trebuchet in general is actually quite simple, being essentially a first class lever. The energy needed to operate the arm is provided by gravity (or lots of really strong guys pulling on ropes, in the case of a traction trebuchet), and an extremely heavy counterweight is mounted on the end opposite the throwing arm. A sling is often used to transfer as much energy as possible to the projectile, and the counterweight is usually mounted on a hinge to relieve stress on the arm and help conserve energy. This design proved so effective that trebuchets continued to be used in warfare long after gunpowder weapons arrived on the battlefield, and their construction is so simple that many people still build recreations of them today. \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u00222qQAxCc.jpg\u0022 src=\u0022http://i.imgur.com/2qQAxCc.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nThe projectile fired by my trebuchet is a stayputnik probe core. It may be too light to smash buildings, but because of its weight (or lack thereof), I can make the counterweight lighter and still get a cool looking projectile. The sling is a KAS winch, which can be extended to various lengths to allow for different release angles. The only problem with this (aside from the fact that I had to use a mod) is that the projectile must be released by an action group, making it nearly impossible to achieve a consistent, repeatable release.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022m0mvj8y.png\u0022 src=\u0022http://i.imgur.com/m0mvj8y.png\u0022\u003E As you can see, I can launch the projectile a considerable distance using nothing but the power of gravity and instinct. By tuning the length of the sling and finding the best time to release the projectile, I daresay that this machine could actually launch even farther, but I haven\u0027t tested it yet.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u002225FkizT.jpg\u0022 src=\u0022http://i.imgur.com/25FkizT.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nHere\u0027s the trebuchet after firing. Technically it can be reloaded because it uses a KAS winch, but I\u0027m not sure if the action group used to release the ball would remain. To give you an idea of just how big this is, try and find the Kerbal standing in front of the machine.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cu\u003EFIRING PROCEDURE\u003C/u\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Col\u003E\u003Cli\u003E\nStage once to release the hinge. This allows it to swing freely.\n\u003C/li\u003E\n\u003Cli\u003E\nExtend the sling to the desired length. I typically use 10 meter long sling for my shots.\n\u003C/li\u003E\n\u003Cli\u003E\nStage again to release the arm. it should not fire because of the landing legs I have placed in the way.\n\u003C/li\u003E\n\u003Cli\u003E\nPress G to retract the landing legs, allowing the arm to swing upwards. Once you do this, you have committed to the shot, and you must act fast in these next steps to get a good angle and range.\n\u003C/li\u003E\n\u003Cli\u003E\nSwitch to the arm (it\u0027s a good idea to test which key you need to press before you pull the legs back) and watch for the sling to reach your desired release point\n\u003C/li\u003E\n\u003Cli\u003E\nOnce the sling is in position, press 1, triggering AG1, which releases the projectile from the sling\n\u003C/li\u003E\n\u003Cli\u003E\n???\n\u003C/li\u003E\n\u003Cli\u003E\nProfit!!\n\u003C/li\u003E\n\u003C/ol\u003E\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:22px;\u0022\u003E\u003Cu\u003E\u003Ca href=\u0022https://drive.google.com/file/d/0B-NU1M-kaIhgc3BQNEVWbTNJcWM/view?usp=sharing\u0022 rel=\u0022external nofollow\u0022\u003EDOWNLOAD\u003C/a\u003E\u003C/u\u003E\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:22px;line-height:35.2px;\u0022\u003E\u003Cb\u003ERequired Mod: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/83468-105-kerbal-attachment-system-kas-055/\u0022 rel=\u0022\u0022\u003EKAS\u003C/a\u003E\u003C/b\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nIf you can make a further shot than me, post a picture of it here, and I\u0027ll keep a leaderboard of record shots. Whoever can make the furthest shot will get... uh... an honorary Kerbal Siege Engineer certification? Yeah, that sounds good. If you make it on the leaderboard, you can make people refer to you as \u003Cem\u003E*insert name here*, KSE\u003C/em\u003E. Sounds cool, right? I can probably come up with a cool badge for your signature too, although I don\u0027t know how well MS Paint will work for that...\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nAnyway, Enjoy!\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-04-22T23:23:00Z\u0022 title=\u002204/22/2016 11:23  PM\u0022 data-short=\u00228 yr\u0022\u003EApril 22, 2016\u003C/time\u003E by pTrevTrevs\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Majorjim!","CreatedById":61954,"CreatedDateTime":"2016-04-22T23:33:20Z","Content":"\n\u003Cp\u003E\nIt looks extraordinarily awesome! You have to make a castle to go with it to loose projectiles at! Great work on this mate.\n\u003C/p\u003E\n"},{"CreatedByName":"Darth Lazarus","CreatedById":60937,"CreatedDateTime":"2016-04-22T23:47:08Z","Content":"\n\u003Cp\u003E\nwell this thing is awesome \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"pTrevTrevs","CreatedById":131541,"CreatedDateTime":"2016-04-23T03:42:51Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222532128\u0022 data-ipsquote-contentid=\u0022137794\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221461368000\u0022 data-ipsquote-userid=\u002261954\u0022 data-ipsquote-username=\u0022Majorjim\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Majorjim said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt looks extraordinarily awesome! You have to make a castle to go with it to loose projectiles at! Great work on this mate.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHmm, now there\u0027s an idea. Build a target to shoot at... I\u0027m afraid that the trebuchet would be too inaccurate to make it worth shooting at anything smaller than the VAB itself. However, I\u0027ve been wondering whether it would be possible to use KAS winches to build a ballista, that sort of thing would be more accurate against a smaller target. I\u0027m not really sure whether or not I can get KAS winches to \u0022stretch\u0022 to create the tension neccessary to launch a Stayputnik that way though. \n\u003C/p\u003E\n\u003Cp\u003E\nOnly one way to find out, I guess, After all, I wasn\u0027t sure whether a sling on a trebuchet could work, but here\u0027s the release thread with evidence that a sling is in fact possible.\n\u003C/p\u003E\n"},{"CreatedByName":"kennyc222","CreatedById":209626,"CreatedDateTime":"2022-01-31T05:49:20Z","Content":"\n\u003Cp\u003E\nage of empire IV vibe! I am playing AOE IV but also ksp too at the same time! i want just more AOE IV siege weapons to be built in KSP...bring back the mighty imperial age from space age! \n\u003C/p\u003E\n"}]}