{"TopicId":137963,"ForumId":44,"TopicTitle":"Generation Ship","CreatedByName":"GussieFinknottle","CreatedById":162703,"CreatedDateTime":"2016-04-24T11:22:01Z","PageNum":1,"Articles":[{"CreatedByName":"GussieFinknottle","CreatedById":162703,"CreatedDateTime":"2016-04-24T11:22:01Z","Content":"\n\u003Cp\u003E\nI\u0027m currently writing a story set in a sci-fi world I\u0027m building. It\u0027s hard science.\n\u003C/p\u003E\n\u003Cp\u003E\nBasically, humanity has developed 10% of lightspeed travel. Having mostly used it to send spaceships to asteroids and mine them, or to planets in the Solar System (which they can all reach in under a day).\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, several countries decide to set off on \u0022Colonyships\u0022, what has also been called a Generation ship in other fiction. They can fit about 20,000 people comfortably, and the population is maintained at that level. One of these countries is heading to Alpha Centauri, which will take about 43 years. The ship is artificially pressurised and has artificial gravity. I\u0027m currently designing the ship and I\u0027m trying to figure out what they\u0027d need.\n\u003C/p\u003E\n\u003Cp\u003E\nSo far, I\u0027ve got this on it. Note that there are several floors to the ship, including several recreation ones, two cargo ones, sixteen residential ones and one administrative one:\n\u003C/p\u003E\n\u003Cp\u003E\nRecreational Floor:\n\u003C/p\u003E\n\u003Cpre\u003E\n-Planetarium\u003C/pre\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cpre\u003E\n-Cinemas\u003C/pre\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cpre\u003E\n-Cafés\u003C/pre\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cpre\u003E\n-VR Café (VR of being on Earth, which most people have not seen)\u003C/pre\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cpre\u003E\n-Libraries\u003C/pre\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cpre\u003E\n-Bookshops\u003C/pre\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cpre\u003E\n-Shopping Centers (with robot/hologram vendors instead of real human beings)\u003C/pre\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cpre\u003E\n\u0026gt;Musical Instrument Shop\u003C/pre\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cpre\u003E\n\u0026gt;\u003C/pre\u003E\n\u003Cp\u003EClothing shops\n\u003C/p\u003E\n\u003Cpre\u003E\n\u0026gt;\u003C/pre\u003E\n\u003Cp\u003EEtc...\n\u003C/p\u003E\n\u003Cpre\u003E\n-Apartments (Residential Area/Grid)\n\n-School\u003C/pre\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cpre\u003E\n-Gyms\n\n-Zero Gravity rooms (for admiring the view, sensation or sports)\u003C/pre\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cpre\u003E\n\u003C/pre\u003E\n\u003Cp\u003E \u003C/p\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cpre\u003E\nAdministration Floor:\u003C/pre\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cpre\u003E\n-Lab (Frozen embryos of four of each Earth Animal, male and female)\u003C/pre\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cpre\u003E\n-Hospital\u003C/pre\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cpre\u003E\n-Cockpit\u003C/pre\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cpre\u003E\n-Supercomputer running the ship\u003C/pre\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cpre\u003E\n-Hologram interface handler/server\u003C/pre\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cpre\u003E\n-Wifi server\u003C/pre\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cpre\u003E\n\u003C/pre\u003E\n\u003Cp\u003E \u003C/p\u003E\n\u003Cpre\u003E\nCargo Levels:\u003C/pre\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cpre\u003E\n-Drone Bay\u003C/pre\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cpre\u003E\n-Weapon(s) depot\n\n\nWhat more could be put on it?\u003C/pre\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-04-24T12:11:38Z","Content":"\n\u003Cp\u003E\nSo whats wrong with your story, alot.\n\u003C/p\u003E\n\u003Cp\u003E\n1. you don\u0027t need weapons (unless multiple cultures that are in conflict have sent ships, unlikely very expensive)\u003Cbr\u003E\u003Cbr\u003E\n2. you don\u0027t need or even want 0.1 speed of light to get to asteroids. Fusion driven generational ships do not accelerate fast enough. They do provide power to reach the outer solar system, it would still take weeks to get there with the most optimistic fusion drive. The pulse plate nuclear drives are somewhat faster, again, not really suitable for mining, alot of latent radioactivity. Probably best to stick with speeds of 0.001c to reach those asteroids. You don\u0027t really need a generation ship to go to alpha centuri at 0.1c, the generation ship would come later, the ship you sent would be a seed ship, it would do the most rudementary terraforming assuming you found a terraformable planet that did not already have competitive life on it.\n\u003C/p\u003E\n\u003Cp\u003E\nYou need a stock pile of raw materials (Primarily at the front of the ship that will absorb the cosmic radiation your ship produces) but also can be used to make LEDs and other electrons, you also need an engineering bay. In addition you need a science and telescopy bay and lab for searching out materials, and a ship building bay that can allow you to build the hulls of extensions and place them around your ship or attach them to asteroids. The ship needs an INRU, Bookshops obsolete, library since most are scientist you need a feed to Earth and its all electronic now.\n\u003C/p\u003E\n\u003Cp\u003E\n3. Frozen embryo\u0027s, problem you need wombs, which could be cultured in a lab, the problem is that you don\u0027t have enough lab space, and you wont need it till you arrive, so you really really need and engineering bay. The a husbandry bay cause there aint no place for animals on alpha centuri, beta, or proxima. Even if you found a suitable planet, first you need things like bacteria, cyanobacteria, water plants, brine shrimp and other sea-life, seeds for trees, etc. It would take you 1000 years at this rate, then you could ship in animals along with at least a few wombs of immune neutral animals.\n\u003C/p\u003E\n"},{"CreatedByName":"sevenperforce","CreatedById":157695,"CreatedDateTime":"2016-04-24T15:39:11Z","Content":"\n\u003Cp\u003E\nFour of each animal is also not nearly enough to create any sort of sustainable population, either. If you want a small temporary breeding population of tasty or useful animals, a few hundred embryos per desired species might be enough. But if you want a permanent sustainable population you will need 100,000 individuals minimum in order to have enough genetic diversity for the population to survive in the wild, and that is if you have already achieved 95%\u002B terraforming on the target world. \n\u003C/p\u003E\n\u003Cp\u003E\nIf the trip only takes 45 years, why would most of the passengers have never seen Earth?\n\u003C/p\u003E\n\u003Cp\u003E\nIs artificial gravity based on linear acceleration, centrifugal acceleration, or handwaved? Handwaved selectable artificial gravity is technology on a level with Alcubierre FTL drive.\n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2016-04-24T17:17:33Z","Content":"\n\u003Cp\u003E\nThey obviously had decided to eliminate any existing biosphere, replacing it with terrestrial lifeforms.\n\u003C/p\u003E\n\u003Cp\u003E\nThen, in advance of this fleet of intrusion, they must send a vanguard of huge uncrewed eradicator ships, with huge amount of the terrestrial\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222535911\u0022 data-ipsquote-contentid=\u0022137963\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221461499898\u0022 data-ipsquote-userid=\u0022107380\u0022 data-ipsquote-username=\u0022PB666\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, PB666 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nbacteria, cyanobacteria, water plants\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n(especially chlorella), and pulverize this biological stuff onto the desired planets.\n\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2016-04-24T18:13:23Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222535837\u0022 data-ipsquote-contentid=\u0022137963\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221461496921\u0022 data-ipsquote-userid=\u0022162703\u0022 data-ipsquote-username=\u0022GussieFinknottle\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, GussieFinknottle said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt\u0027s hard science.\n\u003C/p\u003E\n\u003Cp\u003E\nBasically, humanity has developed 10% of lightspeed travel. Having mostly used it to send spaceships to asteroids and mine them, or to planets in the Solar System (which they can all reach in under a day).\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nlol.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWhy would you need robot hologram/vendors when you have a whole population of people doing nothing? Why do you need shops if nobody works ? Does your ship have an economy ? What is it based on ? What wealth can be created in a closed loop environment ?\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, having a single floor for work, another for shopping, another for work, etc... means that you get traffic jams between each area on shift rotation hours. Have you never played Sim City ?\n\u003C/p\u003E\n\u003Cp\u003E\n4 of each animal ? That\u0027s just as silly as Noah\u0027s ark\u0027s 2 of each animal. That\u0027s not enough to develop a viable population of anything. And every animal on Earth ? There are 8.7 million species on Earth, and we only know about 10% of them.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-04-24T18:48:51Z\u0022 title=\u002204/24/2016 06:48  PM\u0022 data-short=\u00228 yr\u0022\u003EApril 24, 2016\u003C/time\u003E by Nibb31\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-04-24T18:34:37Z","Content":"\n\u003Cp\u003E\nYou actually could create a viable population now with the new insitu technique. The deal is that you would need the genetic blue print, you could replace key genes within the brood stock, as the population expands you introduce new genes and combinations. But again that requires infrastructure. You need keystone species in each ecosystem. Similar animals can use a single species as a womb species.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2016-04-24T21:43:35Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222536323\u0022 data-ipsquote-contentid=\u0022137963\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221461512351\u0022 data-ipsquote-userid=\u0022157695\u0022 data-ipsquote-username=\u0022sevenperforce\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, sevenperforce said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nFour of each animal is also not nearly enough to create any sort of sustainable population, either. If you want a small temporary breeding population of tasty or useful animals, a few hundred embryos per desired species might be enough. But if you want a permanent sustainable population you will need 100,000 individuals minimum in order to have enough genetic diversity for the population to survive in the wild, and that is if you have already achieved 95%\u002B terraforming on the target world. \n\u003C/p\u003E\n\u003Cp\u003E\nIf the trip only takes 45 years, why would most of the passengers have never seen Earth?\n\u003C/p\u003E\n\u003Cp\u003E\nIs artificial gravity based on linear acceleration, centrifugal acceleration, or handwaved? Handwaved selectable artificial gravity is technology on a level with Alcubierre FTL drive.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nid imagine they would use stored sperm and embryos and just use the 4 as breeders. they would be all female. when one gets to old or dies then another is impregnated with a female embryo. embryos would be pre-sexed and sourced from genetically diverse stock. this allows you to maintain a high genetic diversity without needing to keep a large population going. upon arrival all 4 are impregnated with female embryos, and this goes on until a large genetically diverse population of breeders is established. they they are all artificially inseminated and are allowed to procreate naturally from that point onward. 4 is probably just the minimum number at which the odds for total failure are sufficiently small, issues with pregnancy, disease, infertility, even issues with the environment like depressurization events.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-04-24T21:46:12Z\u0022 title=\u002204/24/2016 09:46  PM\u0022 data-short=\u00228 yr\u0022\u003EApril 24, 2016\u003C/time\u003E by Nuke\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"insert_name","CreatedById":150339,"CreatedDateTime":"2016-04-25T00:43:54Z","Content":"\n\u003Cp\u003E\nyou need some sort of lander, and a place to maintain it unless you only want to visit asteriods\n\u003C/p\u003E\n"},{"CreatedByName":"shynung","CreatedById":101096,"CreatedDateTime":"2016-04-25T11:11:19Z","Content":"\n\u003Cp\u003E\nRather than 4 of each animal (there\u0027s about 8.7 million of them, and that\u0027s the ones we already know, there\u0027s probably more), it\u0027s more useful to carry 100-150 embryos of only the useful species, like livestock(cattle, pigs, chicken), beasts of burden(horses, mules), and companions(cats and dogs).\n\u003C/p\u003E\n\u003Cp\u003E\nOr, better yet, cut down the species count by striking out livestock species, and grow synthetic meat. That, or have the beasts-of-burden species do double-duty as livestock.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, you\u0027d need something to keep the population busy while en-route. A bored population is can be very easily incited to do something drastic, like rioting and breaking stuff. This means it might not be in your best interest to automate almost everything inside the ship (no robot workers), so that the population has something to do.\n\u003C/p\u003E\n\u003Cp\u003E\nIn addition, you might want to have some sort of manufacturing capability on board. Everything from simple tools to high-tech machinery breaks down no matter how robust they are built, so it\u0027s a good idea to be able to manufacture spare parts from raw materials found en-route (or carried on board; lightly-processed stuff like steel plates are denser than ready-made items like gears). Not just a stash of ready-made spare parts, mind you; different equipments needs different spare parts (you can\u0027t fix a mechanical transmission with a processor chip), and there\u0027s no sure way of knowing how much of which part will break more. This will also be another way of keeping the populace occupied.\n\u003C/p\u003E\n"},{"CreatedByName":"radonek","CreatedById":84077,"CreatedDateTime":"2016-04-25T16:13:55Z","Content":"\n\u003Cp\u003E\nI don\u0027t think frozen embryos will make it. Freezing stop intracellular DNA repair mechanisms and they will accumulate radiation damage, which would be pretty severe on 0.1c. \n\u003C/p\u003E\n"},{"CreatedByName":"shynung","CreatedById":101096,"CreatedDateTime":"2016-04-25T16:21:27Z","Content":"\n\u003Cp\u003E\nGood point.\n\u003C/p\u003E\n\u003Cp\u003E\nAt that point, it may be cheaper to store the DNA sequences of said embryos\u0027 species in a storage/archive system, and use this to clone them when needed using blank ovum cells and synthetic wombs.\n\u003C/p\u003E\n\u003Cp\u003E\nThough, if we already have that, it\u0027s a step away from simply storing a bunch of sequences from different humans, and cloning them at the destination using the same tech used to clone the animals. The problem then comes down to a reliable automated parenting system to raise enough humans for them to continue procreating the old-fashioned way.\n\u003C/p\u003E\n"},{"CreatedByName":"HebaruSan","CreatedById":156657,"CreatedDateTime":"2016-04-25T16:33:04Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222538886\u0022 data-ipsquote-contentid=\u0022137963\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221461601287\u0022 data-ipsquote-userid=\u0022101096\u0022 data-ipsquote-username=\u0022shynung\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 minutes ago, shynung said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe problem then comes down to a reliable automated parenting system to raise enough humans for them to continue procreating the old-fashioned way.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIs that a humane thing to do to your colonists? Wouldn\u0027t it be confusing and traumatic to grow up in isolation from all others of your species with only a computer to give you any kind of education or culture? I doubt you could even test that system on Earth (as you surely ought to before relying on it at a distance of light years!) without violating laws about ethical experiments on humans.\n\u003C/p\u003E\n"},{"CreatedByName":"shynung","CreatedById":101096,"CreatedDateTime":"2016-04-25T18:08:36Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222538905\u0022 data-ipsquote-contentid=\u0022137963\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221461601984\u0022 data-ipsquote-userid=\u0022156657\u0022 data-ipsquote-username=\u0022HebaruSan\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, HebaruSan said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIs that a humane thing to do to your colonists? Wouldn\u0027t it be confusing and traumatic to grow up in isolation from all others of your species with only a computer to give you any kind of education or culture? I doubt you could even test that system on Earth (as you surely ought to before relying on it at a distance of light years!) without violating laws about ethical experiments on humans.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNot necessarily in complete isolation; they could have social interactions with each other.\n\u003C/p\u003E\n\u003Cp\u003E\nThough, that\u0027s a good point.\n\u003C/p\u003E\n"}]}