{"TopicId":138811,"ForumId":20,"TopicTitle":"Engine Pre-cooler cooling?","CreatedByName":"Errol","CreatedById":118622,"CreatedDateTime":"2016-05-03T04:04:18Z","PageNum":1,"Articles":[{"CreatedByName":"Errol","CreatedById":118622,"CreatedDateTime":"2016-05-03T04:04:18Z","Content":"\n\u003Cp\u003E\nSo I\u0027m wondering if the Engine Pre-cooler has any actual cooling functionality or not, and if not, since we have radiator modules in stock, would it be difficult to MM config a radiator module into the part\u0027s .cfg? My idea would be to set it up to use no EC and instead of being toggled on by a tweakable its state is instead dependent on airflow through the intake module. No airflow, no cooling. Perhaps it look at the max air flow and treat that as 100% cooling, and scale linearly from there.\n\u003C/p\u003E\n"},{"CreatedByName":"IAN 4000","CreatedById":162981,"CreatedDateTime":"2016-05-03T07:05:45Z","Content":"\n\u003Cp\u003E\nNope. The engine pre-cooler adds more intake air. And it holds 40 units of fuel. That\u0027s all it does. \n\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2016-05-03T08:27:19Z","Content":"\n\u003Cp\u003E\nYou could MM an active radiator module into it no problem. Even one that only cools parts directly attached to it (like engines). Unless you actually want to cool the spaceplane on reentry, not the engines, in which case you are probably better off with radiator panels on the top of the plane (perhaps clipped slightly into it), where they will be shielded from reentry heat and able to work.\n\u003C/p\u003E\n\u003Cp\u003E\nAs for intake air helping with cooling - that may be more tricky. A resource is supposed to take its heat energy along when it is pumped from part to part now, as a new feature in 1.1. The problem is, I don\u0027t know if that applies to \u0022vessel-global\u0022 resources like IntakeAir. You basically have three cases.\n\u003C/p\u003E\n\u003Cp\u003E\nCase 1: IntakeAir, in its function as a vessel-global resource, never actually flows anywhere. An engine consumes it directly from the (hidden) storage in an intake. As such, IntakeAir can take on heat energy from the intake it is stored in (i.e. the engine precooler), and that heat would be destroyed upon its consumption by the engine.\n\u003C/p\u003E\n\u003Cp\u003E\nCase 2: KSP actually simulates the IntakeAir transfer from intake to engine. In that case, IntakeAir may actually cool the engine prior to its consumption.\n\u003C/p\u003E\n\u003Cp\u003E\nCase 3: IntakeAir is such a transient thing that it never gets around to cooling anything.\n\u003C/p\u003E\n\u003Cp\u003E\nIf case 1 is true, then all you need to do is implement the radiator module to make the precooler really hot, so that the air it collects takes up the most heat energy possible in the very short time it has available for this. In both of the other cases, you would have to write a custom plugin to implement your cooling. In case 2 specifically, it may actually be pointless to do anything at all.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, even if case 1 is true, I\u0027m not sure how much cooling you could actually get out of IntakeAir. There\u0027s no guarantee Squad actually chose realistic volumes and masses for their air intake simulation. It\u0027s entirely possible that they just used a number that works, because it literally makes zero difference in anything whatsoever in the game... \u003Cem\u003Euntil\u003C/em\u003E you start wanting to determine the thermal mass per second going through the intake.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-03T08:34:18Z\u0022 title=\u002205/03/2016 08:34  AM\u0022 data-short=\u00228 yr\u0022\u003EMay 3, 2016\u003C/time\u003E by Streetwind\u003C/strong\u003E\n\u003C/span\u003E\n"}]}