{"TopicId":138878,"ForumId":70,"TopicTitle":"Radially attached part bug","CreatedByName":"Hodari","CreatedById":157578,"CreatedDateTime":"2016-05-03T21:06:09Z","PageNum":1,"Articles":[{"CreatedByName":"Hodari","CreatedById":157578,"CreatedDateTime":"2016-05-03T21:06:09Z","Content":"\n\u003Cp\u003E\nAside from the frequent VAB crashes, I\u0027ve noticed one other bug since updating to 1.1.x.  Seems to be a problem with radially attached parts\n\u003C/p\u003E\n\u003Cp\u003E\nVersion 1.1.2.1260 x64\n\u003C/p\u003E\n\u003Cp\u003E\nMods: currently using KER, RSS, SMURFF, KSCswitcher, though I noticed the same issue before when not using these mods.\n\u003C/p\u003E\n\u003Cp\u003E\nCraft file of my vessel :   \u003Ca href=\u0022http://pastebin.com/8Y1M7i7S\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://pastebin.com/8Y1M7i7S\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nWhile building it, I removed and reattached some of the parts, including the boosters and radial decouplers a few times which may or may not have been part of what caused the problems.\n\u003C/p\u003E\n\u003Cp\u003E\nBoth while building the craft initially and when viewing it in the VAB after reverting, everything looks normal enough:\u003Cbr\u003E\u003Cimg alt=\u0022http://i.imgur.com/k0VDBjk.jpg\u0022 src=\u0022http://i.imgur.com/k0VDBjk.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nHowever when I actually try to launch it, notice the staging diagram:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022http://i.imgur.com/pBXAt6W.png\u0022 src=\u0022http://i.imgur.com/pBXAt6W.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nInstead of just the 3 boosters like it should be, it shows a cluster of 3...and then another cluster of 2 AND a single one.  Also(possibly related, or possibly just due to not having struts yet), the ship seems to constantly want to roll in one direction, even with SAS on.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso note that in the VAB, KER correctly shows the part count as being 30.  The load vessel dialogue box also shows this and in fact I still haven\u0027t upgraded the VAB, so I couldn\u0027t actually have more than 30 parts as would be the case if those \u0022extra\u0022 boosters and decouplers were actually there.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"stupid_chris","CreatedById":62017,"CreatedDateTime":"2016-05-03T22:30:42Z","Content":"\n\u003Cp\u003E\nNo, those are not clusters. You might notice the numbers have different colours. What this is doing is that it is separating your stack of three engines so that each has it\u0027s own fuel gauge. The numbers are just listing engine 1, engine 2, etc. The last engine of the group has a green number indicating it\u0027s the end of this stack. Else you\u0027d only have one fuel gauge for all three engines, which makes no sense (think of liquid fuel engines having different amount of available fuel each)\n\u003C/p\u003E\n"}]}