{"TopicId":138924,"ForumId":32,"TopicTitle":"Crashes Post 1.1.X Simple Question for the affected ones","CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2016-05-04T06:34:30Z","PageNum":5,"Articles":[{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2016-06-01T03:56:40Z","Content":"\n\u003Cp\u003E\nle sigh, 2 runs today 1 for an hour then i shut down for errands, second run less than 10 minutes from click to play with about 7 of those being on the initial options screen, with start game being one of them, the rest of that time, barely a minute and 20 seconds or so was in the VAB. run as admin was the test theory. \n\u003C/p\u003E\n"},{"CreatedByName":"autumnalequinox","CreatedById":114782,"CreatedDateTime":"2016-06-06T04:47:35Z","Content":"\n\u003Cp\u003E\nStill in my career game, I had days without a crash and then bam:  one after the other and now only when deleting parts or loading large craft.\n\u003C/p\u003E\n"},{"CreatedByName":"kBob","CreatedById":102132,"CreatedDateTime":"2016-06-06T06:58:23Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222596467\u0022 data-ipsquote-contentid=\u0022138924\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221463960293\u0022 data-ipsquote-userid=\u002278020\u0022 data-ipsquote-username=\u0022AlamoVampire\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn ‎5‎/‎22‎/‎2016 at 4:38 PM, AlamoVampire said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThen it\u0027s all our machines, at least those affected, which is less likely than it being unity, which seems the most likely given evidence at hand.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOr maybe you all have one or several programs that are interacting with KSP/Unity.  I asked once before but I\u0027ll try once more has anybody experiencing crashes (I\u0027ve had none, both 32 and 64 bit intensive use) tried to kill \u003Cem\u003Eevery\u003C/em\u003E single process on their computer that isn\u0027t essential to keeping the OS running?  Then run KSP to see if it helps, hurts makes no difference. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nUntil this is done (hopefully by several people) given that not everyone is having problems I\u0027m going to suspect some kind of interaction from one or more programs external to KSP/Unity, it certainly wouldn\u0027t be the first time in history that something like this has happened (and it may of course be that there are several causes and this is one of them for x% of users), and this has been especially true for complex simulators.  If it doesn\u0027t help then that is a step closer to finding the real problem; if it does help then tracking down the culprit shouldn\u0027t be too hard.\n\u003C/p\u003E\n"},{"CreatedByName":"steve_v","CreatedById":69272,"CreatedDateTime":"2016-06-06T08:07:30Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222618603\u0022 data-ipsquote-contentid=\u0022138924\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221465196303\u0022 data-ipsquote-userid=\u0022102132\u0022 data-ipsquote-username=\u0022kBob\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n56 minutes ago, kBob said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI asked once before but I\u0027ll try once more has anybody experiencing crashes (I\u0027ve had none, both 32 and 64 bit intensive use) tried to kill \u003Cem\u003Eevery\u003C/em\u003E single process on their computer that isn\u0027t essential to keeping the OS running?  Then run KSP to see if it helps, hurts makes no difference. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOf course, though \u0022kill \u003Cem\u003Eevery\u003C/em\u003E single process\u0022 is a pretty ham-fisted way of going about it.\u003Cbr\u003E\nAs I am running GNU/Linux, my procedure goes something like: Boot in runlevel 1 (AKA \u0022recovery mode\u0022 \u003Cimg alt=\u0022:rolleyes:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 title=\u0022:rolleyes:\u0022\u003E), su to normal user, start X session \u002B TWM \u002B Xterm, launch KSP.\u003Cbr\u003E\nResult: no change.\u003Cbr\u003E\nThis pretty much rules out \u0022programs external to KSP/Unity\u0022 IMO, I don\u0027t see how one can get much closer to the bare minimum operational OS configuration short of not starting X... but KSP needs X (and a basic WM if you want a mouse) to run.\n\u003C/p\u003E\n"},{"CreatedByName":"kBob","CreatedById":102132,"CreatedDateTime":"2016-06-06T08:53:39Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222618647\u0022 data-ipsquote-contentid=\u0022138924\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221465200450\u0022 data-ipsquote-userid=\u002269272\u0022 data-ipsquote-username=\u0022steve_v\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nJust now, steve_v said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOf course, though \u0022kill \u003Cem\u003Eevery\u003C/em\u003E single process\u0022 is a pretty ham-fisted way of going about it.\u003Cbr\u003E\nAs I am running GNU/Linux, my procedure goes something like: Boot in runlevel 1 (AKA \u0022recovery mode\u0022 \u003Cimg alt=\u0022:rolleyes:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 title=\u0022:rolleyes:\u0022\u003E), su to normal user, start X session \u002B TWM \u002B Xterm, launch KSP.\u003Cbr\u003E\nResult: no change.\u003Cbr\u003E\nThis pretty much rules out \u0022programs external to KSP/Unity\u0022 IMO, I don\u0027t see how one can get much closer to the bare minimum operational OS configuration short of not starting X... but KSP needs X (and a basic WM if you want a mouse) to run.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThanks.  Nothing ham fisted about it.  Most people are running Windows and each version of Windows has slightly different ways of clean booting (though all get down to msconfig which let\u0027s you kill off many processes in a checklist).  I was trying to keep things simple (36 years of working with PC\u0027s has taught me to keep it simple).  I\u0027d assume if someone wanted to do this but wasn\u0027t sure how to they\u0027d ask and I\u0027d point them to step by step instructions from Microsoft (or Apple I\u0027m sure I could find those instruction since I don\u0027t currently have a Mac).   Another way around this, in Windows, is to use task manager and kill off whatever doesn\u0027t stop the system from running enough to get KSP running, this has the advantage of not disturbing how the computer boots which some people prefer also it can list processes msconfig doesn\u0027t, but it can take awhile unless you already know which processes are mandatory for system stability).\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027d still like to see some others try it especially Windows users (since that\u0027s what I run, though dual booting Linux is in my future plans) since there may be more than one problem as I tried to explain; one data point isn\u0027t exactly definitive.    After that if it also doesn\u0027t help any Windows users I have some other ideas and would like to compare some things internal to KSP vs. how I\u0027m doing it...but first we need to truly eliminate external causes.\n\u003C/p\u003E\n\u003Cp\u003E\nBut if you\u0027d be willing we could try the in KSP comparisons.  Probably be best to do it via PM right now to keep this thread less cluttered.  I\u0027m ignoring system specs right now since from what I\u0027ve read this seems to be affecting a variety of systems from lap tops to fairly high powered.  So PM if you\u0027d be willing to do a little hunting...something makes me run 100% and you less.\n\u003C/p\u003E\n"},{"CreatedByName":"SciMan","CreatedById":12748,"CreatedDateTime":"2016-06-08T22:47:24Z","Content":"\n\u003Cp\u003E\nEvery time my KSP has crashed without leaving a crash report, the last thing I did before it crashed was \u0022Delete parts in the VAB or SPH\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nEvery. Single. Time.\n\u003C/p\u003E\n\u003Cp\u003E\nEvery time it\u0027s crashed WITH a crash report, it\u0027s been an Out Of Memory error.\n\u003C/p\u003E\n\u003Cp\u003E\nSometimes I can play 4 hours or more (lots of it in the VAB) without a single crash. Sometimes I place 5 parts and delete one, and it crashes (right after starting). I don\u0027t see any pattern for it, except that it\u0027s always the VAB or SPH, without fail.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve heard rumors that this is a multithreading issue. If so, it\u0027s going to be harder than usual to figure out what\u0027s causing it.\u003Cbr\u003E\nI\u0027ve heard other rumors that say setting the frame limiter to 180fps (as high as it will go), and disabling V-sync will help to reduce how often it occurs.\u003Cbr\u003E\nI always did that anyways, IDK if it\u0027s making my game crash less or not.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSystem specs:\n\u003C/p\u003E\n\u003Cp\u003E\nOS: Windows 7 Home Premium 64-bit\n\u003C/p\u003E\n\u003Cp\u003E\nCPU: Intel Core i7 4930k at stock clock (3.4Ghz, 6 physical cores with hyperthreading)\n\u003C/p\u003E\n\u003Cp\u003E\nMotherboard: ASUS Rampage IV Black edition\n\u003C/p\u003E\n\u003Cp\u003E\nGPU: 2x Nvidia GTX 970, (driver v361.91) (ASUS Strix if that makes any difference)\n\u003C/p\u003E\n\u003Cp\u003E\nRAM: 16GB DDR3 Mushkin (4x 4Gb)\n\u003C/p\u003E\n\u003Cp\u003E\nKSP is installed on a Samsung 840 Evo 128GB SSD. No idea if it helps load times or not.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m pretty sure this isn\u0027t a problem with my computer. I built the thing 9 months ago and haven\u0027t had any major issues once I got it running (UEFI is not MFT, and they\u0027re not compatible).\n\u003C/p\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2016-06-09T00:20:50Z","Content":"\n\u003Cp\u003E\nIf the dev notes are anything togo by, the crashes sources seem to be identified. Time to see what happens when the patch comes down the pipe \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \n\u003C/p\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2016-06-15T00:08:07Z","Content":"\n\u003Cp\u003E\nI hope this thread has proven useful.\n\u003C/p\u003E\n"}]}