{"TopicId":13893,"ForumId":39,"TopicTitle":"[Artwork] Khy\u0026#039;s art-thread","CreatedByName":"khyperia","CreatedById":25539,"CreatedDateTime":"2012-07-09T07:36:34Z","PageNum":1,"Articles":[{"CreatedByName":"khyperia","CreatedById":25539,"CreatedDateTime":"2012-07-09T07:36:34Z","Content":"\n\u003Cp\u003EThis is my first KSP fanart, ever. They took an average of 5-10 minutes each. I told my friend \u0027Hey, KSP fanart sounds like fun, why not.\u0027 And so I drew at 3:30 am in the morning. Might actually spend a good few hours tomorrow making something actually good, when I\\\u0027m not about to die from need of sleep.\u003C/p\u003E\u003Cp\u003EIf you could tell me how good my dead brain did making these, it would make me feel very happy (even if it you tell me they suck. Just tell me what sucks about them.)\u003C/p\u003E\u003Cp\u003EPerspective on cylinders is \u003Cem\u003Ehard\u003C/em\u003E.\u003C/p\u003E\u003Cp\u003E\u003Csub\u003EI want docking. Bad.\u003C/sub\u003E\u003C/p\u003E\u003Cp\u003EI\\\u0027ll probably keep posting in this thread whenever I make something, instead of spamming a new thread every day or two.\u003C/p\u003E\u003Cp\u003E(If I failed at attaching the images, sorry, this is my first post on the forums. I\\\u0027ve been lurking for a while.)\u003C/p\u003E\n"},{"CreatedByName":"thermobaric","CreatedById":31322,"CreatedDateTime":"2012-07-09T11:17:17Z","Content":"\n\u003Cp\u003Ea pretty good drawing for 10 minutes each \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E. show us more :3\u003C/p\u003E\n"},{"CreatedByName":"khyperia","CreatedById":25539,"CreatedDateTime":"2012-07-09T21:43:22Z","Content":"\n\u003Cp\u003EDrawing kerbals is hard. Also, can totally see Jeb doing that, getting close to the surface and he\\\u0027s still flying around outside.\u003C/p\u003E\u003Cp\u003EAbout 15-20 minutes on each. I really want to actually spend a lot of time on one, upwards of three hours, but I think I\\\u0027m going to practice a bit more drawing cylinders in perspective (grr), and also getting the general style of KSP down- I\\\u0027ve never drawn artificial, angular things before.\u003C/p\u003E\u003Cp\u003ETell me if there\\\u0027s any problems, the thumbs my previous post look a little wonky at a small size because my lines were so light. I should probably increase opacity of my pen. (if anyone\\\u0027s wondering, I\\\u0027m doing these with Paint Tool SAI \u002B a Wacom Bamboo Create tablet)\u003C/p\u003E\n"},{"CreatedByName":"thermobaric","CreatedById":31322,"CreatedDateTime":"2012-07-10T13:56:45Z","Content":"\n\u003Cp\u003Ei love the second pic, i tought it was a screen before i clicked on it. love ya style!\u003C/p\u003E\n"},{"CreatedByName":"Ascensiam","CreatedById":12621,"CreatedDateTime":"2012-07-11T00:38:06Z","Content":"\n\u003Cp\u003Ethat Sun.png is pretty impressive, i\\\u0027d love to see more.\u003C/p\u003E\n"},{"CreatedByName":"Tankaa","CreatedById":4152,"CreatedDateTime":"2012-07-11T14:20:52Z","Content":"\n\u003Cp\u003EThat second one is very good. (It\\\u0027s also one of the few situations where lens flare is reasonable.) You should try inking some of this stuff and/or cleaning up the sketchwork, your sketching, coloring, and shading skills are pretty solid.\u003C/p\u003E\n"}]}