{"TopicId":138924,"ForumId":32,"TopicTitle":"Crashes Post 1.1.X Simple Question for the affected ones","CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2016-05-04T06:34:30Z","PageNum":2,"Articles":[{"CreatedByName":"steve_v","CreatedById":69272,"CreatedDateTime":"2016-05-05T08:40:49Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222562473\u0022 data-ipsquote-contentid=\u0022138924\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221462436165\u0022 data-ipsquote-userid=\u002278020\u0022 data-ipsquote-username=\u0022AlamoVampire\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n15 minutes ago, AlamoVampire said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nthere was/is a huge debate about garbage cleanup and memory leaks somewhere on this forum, wonder if thats tied in?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nRelated, as it\u0027s mono that handles garbage collection for managed (read KSP/mods) code. There are performance issues with the way it does this, but it\u0027s not the same issue we\u0027re seeing here.\u003Cbr\u003E\nSo far indications are that this crashing has something to do with how mono allocates memory from the host OS, not how KSP allocates memory within mono, if that makes any sense.\n\u003C/p\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2016-05-05T08:42:35Z","Content":"\n\u003Cp\u003E\nkinda like, how one is allocated money in paycheck would be the between ksp/host os and what you BUY with said paycheck would be the with in mono? i know, a lame compare, but, its 340am and im wiped out lol with that lame compare, ima go to bed. ill check back later in the day\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-05T08:43:20Z\u0022 title=\u002205/05/2016 08:43  AM\u0022 data-short=\u00228 yr\u0022\u003EMay 5, 2016\u003C/time\u003E by AlamoVampire\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Curveball Anders","CreatedById":107529,"CreatedDateTime":"2016-05-05T08:54:25Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222562495\u0022 data-ipsquote-contentid=\u0022138924\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221462437353\u0022 data-ipsquote-userid=\u002278020\u0022 data-ipsquote-username=\u0022AlamoVampire\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n16 minutes ago, AlamoVampire said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nthat kinda sorta kinda makes sense to me. for my own use, ill look at it like STTNG thru voyagers universal translator of sorts, letting everyone speak lol\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAnd like the universal translator it\u0027s doesn\u0027t always work the way you expected \u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"XrayLima","CreatedById":88466,"CreatedDateTime":"2016-05-05T09:10:34Z","Content":"\n\u003Cp\u003E\nI\u0027ve been very lucky, I\u0027ve yet to get a CTD in about 20 hours of play on 1.1.2, but I have had numerous issues with mods.  Probably apocryphal, but I put that down to, before updating, fully backing up my KSP folder and then deleting it enitrely, firstly through \u0022Remove local files\u0022 in steam then deleting the residual contents in the KSP folder, then reinstalling clean.  I then copy in .cft files as an when I want them from the backup or as integral mods become ready.  I\u0027ve said goodbye to my pre 1.1 saves (they live on in my playable 1.0.5 backup folder if I fancy them again) which is a shame but I think worth the cost.  The mods I\u0027ve had issues with often claim to be 1.1 ready, but still have niggles.  Like I say, probably apocryphal but removing all traces of the game prior to 1.1.2 (crash logs, screenshots, dumps, etc) then reinstalling has made me a very happy kerbonaut!\n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2016-05-05T09:40:24Z","Content":"\n\u003Cp\u003E\nSo, KSP has switched to a new version of Unity, and now there is stability issues. I\u0027m glad to finally see a serious discussion about the problem. I freely admit that I know very little about the specifics of mono or .NET framework, but when I see and hear about how this miracle of code can run on multiple platforms from a variety of manufacturers, I become suspicious. Of course, we also have Java, which is much the same, but with Java, it falls to the user to install Java, along with its runtime environment, and ensure that it is up to date, a little bit different than with the \u0022forced\u0022 updates from Micro$oft. I haven\u0027t had any serious problems with Minecraft or it\u0027s many public releases over the last few years. Yes, there is the occasional crash , but nothing like what I experienced when using the new KSP 64 bit 1.1 based on Unity 5.\n\u003C/p\u003E\n\u003Cp\u003E\nI fully understand that when taking a huge leap forward like KSP has, that there are going to be growing pains. I also expect that in time, many of the issues that we currently face with the game will be ironed out. Fine, no problem. I can deal with that, and would be happy, privileged even, to take part and help with the ongoing development of the game. But, when I\u0027m fed a line of crap like I was with the recent exclusive Steam release, it is an insult to what little intelligence that I have. I have very little sympathy for the political maneuvering involved with the push to release on consoles or the new \u0022walmart\u0022 of the internet, Steam. Greed comes into play. Dollar signs begin floating in peoples head, and the noble intentions around the game, education and awareness about space flight in general, become clouded. My frustration with this process comes not from the problems with Unity and KSP and crashes, but rather the lack of open and honest dialogue, like we see here in this thread, from Squad on the issue. I also realize that I am wishing for what amounts to a developers utopia, where everything just falls into place and works like it should. I guess the point of my rambling is that there are more issues that need to be, or could be, addressed besides just mono and .NET that could help stabilize the overall product and keep people like me involved with the project, rather than sitting on the sidelines and feeling discarded.\n\u003C/p\u003E\n"},{"CreatedByName":"steve_v","CreatedById":69272,"CreatedDateTime":"2016-05-05T09:52:50Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222562501\u0022 data-ipsquote-contentid=\u0022138924\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221462437755\u0022 data-ipsquote-userid=\u002278020\u0022 data-ipsquote-username=\u0022AlamoVampire\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, AlamoVampire said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nkinda like, how one is allocated money in paycheck would be the between ksp/host os and what you BUY with said paycheck would be the with in mono?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI guess you could say that, Let\u0027s say the OS is giving mono the paycheck, and mono is spending it on running KSP.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen I say \u0022KSP\u0022 I mean squads code in KSP_Data, \u003Cem\u003Enot\u003C/em\u003E the KSP.exe / KSP.x86_64 executable - that\u0027s actually the Unity player in disguise. Confusing I know. I hate this Unity/mono BS and I\u0027d prefer to work directly on the host OS, but that makes multiplatform support much harder, and game devs like easy these days... Hence the popularity of Unity.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m not particularly articulate explaining such things in layman\u0027s terms, and my own knowledge is somewhat limited, but here goes my \u003Cs\u003Etake\u003C/s\u003E lengthy ramble on this bug:\u003Cbr\u003E\u003Cbr\u003E\nMono abstracts memory management for the code it runs, it asks the OS for a bunch of memory, then parcels it out to managed code.\u003Cbr\u003E\nIf managed code running in the mono runtime, lets say KSP or a KSP mod, wants more memory than mono has already obtained from the OS then mono will ask for more.\u003Cbr\u003E\nWhen the managed code stops using that memory, monos garbage collector comes along, notices it\u0027s not being used any more, and frees it so that mono can give it back.\u003Cbr\u003E\u003Cbr\u003E\nSide note: The garbage collector \u0022stutter\u0022 that some people (me for one) are getting liquidy about is happening because the garbage collector temporarily pauses execution of managed code (KSP) while it does this scan for unused memory. Result: sudden lag spike every few seconds. The more unused memory there is to free the worse this gets.\n\u003C/p\u003E\n\u003Cp\u003E\nThe error that accompanies the crashes I\u0027m seeing is: \u0022*** Error in \u0060./KSP.x86_64\u0027: double free or corruption\u0022 This is followed by a stack trace, and KSP dies with \u0022aborted\u0022 printed to the console.\n\u003C/p\u003E\n\u003Cp\u003E\nThose errors are coming the from the OS memory management functions (Glibc), free() is the call that mono/Unity will be making to the OS to \u0022give back\u0022 memory it doesn\u0027t need any more.\u003Cbr\u003E\u003Cbr\u003E\nDoing this free() twice for the same bit of memory is a very, very bad idea as free()ing will wipe whatever that memory contained. If mono has already told the OS that it can have it back, then goes and nukes it again, strange and unpredictable things are bound to happen.\n\u003C/p\u003E\n\u003Cp\u003E\nIn normal operation mono will ask for memory, put something in it, free it, ask for more (probably getting the same memory location it just freed because that\u0027s convenient for the OS), put something in it, and so on in rapid-fire fashion to meet the needs of the code it\u0027s running.\u003Cbr\u003E\nIf it frees some memory that has already been freed and reused elsewhere the contents of that bit of memory are now going to be either nothing or garbage, depending on the order of operations. There\u0027s no way to tell, and chaos (and random crashes) ensue.\u003Cbr\u003E\u003Cbr\u003E\nGlibc has a \u0022memory police\u0022 function, and it will kill (\u0022abort\u0022) anything it catches doing this. This is a good plan as crashing immediately is generally better than letting it get away with corrupting it\u0027s own memory - otherwise it\u0027s going to crash sooner or later anyway, and in a way that\u0027s \u003Cem\u003Ereally\u003C/em\u003E hard to debug.\n\u003C/p\u003E\n\u003Cp\u003E\nFiguring out exactly where mono/Unity is doing this double free(), without source code and/or help from the unity devs is not going to be easy, if it\u0027s possible at all. Compounding this is the fact that Unity is multithreaded - multiple instances(threads) of mono will be running at the same time, and if they step on each others memory things \u003Cem\u003Ewill\u003C/em\u003E go boom sooner or later.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:10px;\u0022\u003ENote for any coders that read this and are horrified: I realise this is not entirely accurate, I\u0027m trying (and failing) to simplify. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-05T10:03:31Z\u0022 title=\u002205/05/2016 10:03  AM\u0022 data-short=\u00228 yr\u0022\u003EMay 5, 2016\u003C/time\u003E by steve_v\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2016-05-05T10:06:11Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/69272-steve_v/\u0026amp;do=hovercard\u0022 data-mentionid=\u002269272\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/69272-steve_v/\u0022 rel=\u0022\u0022\u003E@steve_v\u003C/a\u003E Kinda makes sense sorta. Ive been given the idea of scorched earthing ksp as it may help. But its 5 am and time for sleep lol thanks!\n\u003C/p\u003E\n\u003Cp\u003E\nspecial note: i am glad this thread is useful. Heres hoping it gets stickied.\n\u003C/p\u003E\n"},{"CreatedByName":"steve_v","CreatedById":69272,"CreatedDateTime":"2016-05-05T10:36:33Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222562536\u0022 data-ipsquote-contentid=\u0022138924\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221462441224\u0022 data-ipsquote-userid=\u002257144\u0022 data-ipsquote-username=\u0022Otis\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n56 minutes ago, Otis said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBut, when I\u0027m fed a line of crap like I was with the recent exclusive Steam release, it is an insult to what little intelligence that I have. I have very little sympathy for the political maneuvering involved with the push to release on consoles or the new \u0022walmart\u0022 of the internet, Steam.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis yanked my chain too TBH. Particularly because the excuse was \u0022we have no way of distributing daily patches\u0022 - this is total BS. Squad had a patcher, but they dumped it about a year ago and though it\u0027s now back, it still isn\u0027t working properly. IIRC the dude that wrote it left (or was fired) but don\u0027t quote me on that. My point is that this situation was \u003Cem\u003Eentirely avoidable\u003C/em\u003E.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nGreed comes into play.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAs it tends to do with any commercial software project. Can\u0027t say I like it either, but what can you do?\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMy frustration with this process comes not from the problems with Unity and KSP and crashes, but rather the lack of open and honest dialogue, like we see here in this thread, from Squad on the issue.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nLikewise, I also suspect it\u0027s some internal marketing drive (greed, probably) setting deadlines that are driving the devs to the ragged edge and pushing for releases that clearly aren\u0027t ready.\u003Cbr\u003E\nIf Squad had come out and said \u0022sorry guys, we\u0027ve got unity bugs here that we can\u0027t fix in time, this is going to be late\u0022 I\u0027d be quite satisfied.\u003Cbr\u003E\nBugs happen, but buggy releases \u003Cem\u003Eshould not\u003C/em\u003E. Head-in-sand \u0022release anyway\u0022 mania just annoys everybody.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThis is getting a tad off-topic, but I just couldn\u0027t resist a quick stab at our lords and masters over this SNAFU. \u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-05T10:37:45Z\u0022 title=\u002205/05/2016 10:37  AM\u0022 data-short=\u00228 yr\u0022\u003EMay 5, 2016\u003C/time\u003E by steve_v\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2016-05-05T22:18:46Z","Content":"\n\u003Cp\u003E\nAnyone else have any thoughts or data points to add?\n\u003C/p\u003E\n"},{"CreatedByName":"diggzakk","CreatedById":116618,"CreatedDateTime":"2016-05-06T08:22:56Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222561154\u0022 data-ipsquote-contentid=\u0022138924\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221462385444\u0022 data-ipsquote-userid=\u0022155221\u0022 data-ipsquote-username=\u0022wibou7\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 04/05/2016 at 8:10 PM, wibou7 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMaybe, maybe not.\n\u003C/p\u003E\n\u003Cp\u003E\nKSP was perfectly stable for me pre-1.1. On 1.1.2, it crashes about once every hour or so.\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nsame for me, i cant even remember if there was a single crash for me all the time before 1.1, but now its horrible, i mean the first crash a day in a not so important situation is acceptable, keep cool.. restart.. but if the second crash doesnt take more then an hour later and happens as you right now finish your new rocket design or whatsoever.. well then leave it, i leave it for that day totally.. its so frustrating that it doesnt help to start any other game, the day is over, so over that i dont start the game for the next three days no more, to risky to destroy my whole mood\n\u003C/p\u003E\n\u003Cp\u003E\ni start to consider to go back with my 1.0.5 from today on, there is no noteable performance difference for me anyways, i will miss the new rightclick on any marker in mapview, but its not worth the frustrating crash element\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-06T08:23:44Z\u0022 title=\u002205/06/2016 08:23  AM\u0022 data-short=\u00228 yr\u0022\u003EMay 6, 2016\u003C/time\u003E by diggzakk\u003C/strong\u003E\n\u003Cbr\u003Emistype\n\u003C/span\u003E\n"},{"CreatedByName":"Curveball Anders","CreatedById":107529,"CreatedDateTime":"2016-05-06T08:29:44Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222563742\u0022 data-ipsquote-contentid=\u0022138924\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221462486726\u0022 data-ipsquote-userid=\u002278020\u0022 data-ipsquote-username=\u0022AlamoVampire\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 hours ago, AlamoVampire said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAnyone else have any thoughts or data points to add?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nMy only data point could be that I haven\u0027t had any crashes in any 1.1.x (except due to my own stupidity when moving files in use ...)\n\u003C/p\u003E\n\u003Cp\u003E\nBut I could add that I\u0027m professionally paranoid (as in infosec consultant) and my win10 is \u003Cstrong\u003Every\u003C/strong\u003E clean from any form of crud (including stuff from MS).\n\u003C/p\u003E\n"},{"CreatedByName":"Bloodbunny","CreatedById":67274,"CreatedDateTime":"2016-05-06T17:51:16Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222562449\u0022 data-ipsquote-contentid=\u0022138924\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221462434870\u0022 data-ipsquote-userid=\u0022119581\u0022 data-ipsquote-username=\u0022BoilingCold\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 5/5/2016 at 0:54 AM, BoilingCold said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMy post 1.1 crashes were frequent enough that I considered KSP unplayable for me until fixed.\n\u003C/p\u003E\n\u003Cp\u003E\nI uninstalled KSP completely, deleting all mods, reinstalled from Steam, reinstalled mods - only mods labelled as 1.1.2 compatible by CKAN and started a new game. Crashes have gone completely for me.\n\u003C/p\u003E\n\u003Cp\u003E\nI installed EVE yesterday, despite it not being listed as 1.1.2 compatible yet and promptly started getting crashes again. Uninstalled EVE and it\u0027s fine again.\n\u003C/p\u003E\n\u003Cp\u003E\nI know this won\u0027t help anyone who\u0027s getting crashes in unmodded, fresh installs, but if you\u0027re running an old modded install try a completely fresh start, it might help.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYep, I did this, and it seems to have slowed the crashes down at least. I haven\u0027t had any so far since doing this, but can never say 100% that I won\u0027t. I\u0027ve had to treat ANY mod not explicitly marked for 1.1.2 as outdated, and use CKAN for everything, but the game is playable again. As an aside, EVE is marked as incompatible with 1.1.2, so no surprise about crashes there.\n\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2016-05-07T02:01:27Z","Content":"\n\u003Cp\u003E\nMine crashes every time I go to the VAB the second time. And of course my error reports are huge files...\n\u003C/p\u003E\n"},{"CreatedByName":"Basto","CreatedById":158312,"CreatedDateTime":"2016-05-07T02:44:10Z","Content":"\n\u003Cp\u003E\nI had not had a single CTD in 1.1.2 until I installed a mod that uses Module Manager(Real Plume).  Uninstalled and have been playing all night since then without an issue.\n\u003C/p\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2016-05-07T04:24:30Z","Content":"\n\u003Cp\u003E\nWell, as I sit writing this, I have slashed and burned KSP from the annals of my computers memory. The only things that remain from the ORIGINAL install from .21 \u0026lt;yes, until today, ive had the same install for ksp since I got it\u0026gt; through now are 2 save games with their ships and what not in a secured location. Steam is currently in the down load process and install process. I am going to try the game absolutely clean before adding mods and the save files back into the mix to see what happens. I will of course keep everyone who is keeping an eye on this thread updated.\n\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2016-05-07T04:26:22Z","Content":"\n\u003Cp\u003E\nI did a hard reinstall. This time it crashed after I hit apply in the settings...\n\u003C/p\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2016-05-07T04:30:50Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222566498\u0022 data-ipsquote-contentid=\u0022138924\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221462595182\u0022 data-ipsquote-userid=\u0022127797\u0022 data-ipsquote-username=\u0022Bill Phil\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 minutes ago, Bill Phil said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI did a hard reinstall. This time it crashed after I hit apply in the settings...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\ndid it now? Was this a mod free or modded install that went toes up on you? \n\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2016-05-07T05:01:02Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222566501\u0022 data-ipsquote-contentid=\u0022138924\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221462595450\u0022 data-ipsquote-userid=\u002278020\u0022 data-ipsquote-username=\u0022AlamoVampire\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n30 minutes ago, AlamoVampire said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\ndid it now? Was this a mod free or modded install that went toes up on you? \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt was mod free.\n\u003C/p\u003E\n"},{"CreatedByName":"Bloodbunny","CreatedById":67274,"CreatedDateTime":"2016-05-07T05:05:24Z","Content":"\n\u003Cp\u003E\nWell, I tried the nuclear option, and installed ONLY 1.1.2 mods through CKAN. I then started up KSP and went into the SPH. I started designing a simple plane with modded parts... about 20 minutes in....BAM.. \u0022KSP_x64.exe has stopped working\u0022 Back to looking at my wallpaper...\n\u003C/p\u003E\n\u003Cp\u003E\nThe best explanation I can come up with is the same that others have theorized: there is something fundamentally wrong with Unity 5, in the way that it handles calls for memory. When I got to thinking about it, it makes sense, and reminds me of a personal experience. Back in 2009 I built a gaming PC, with an air cooled i7 965. I didn\u0027t know it at the time, but it had a cooling problem. You wouldn\u0027t know it to look at the case, or even to use it for everyday use/gaming. It idled at 30 degrees, and only got up to around 55 on intense games. However, if you stress tested it, with Prime95, or any similar program, it would heat up like a nuclear inferno, to 100C and then shut down... though it was basically stable, stressing it made it cry uncle and quit.\n\u003C/p\u003E\n\u003Cp\u003E\nApplying that story to KSP and Unity 5, Squad tested their build running stock.. Stock KSP is not that taxing on the Unity engine, and will run more or less without problems. Once mods are added in, it makes it become more stressful on the engine... the more mods added, the more the stress level.. mods are acting as Prime95 did on my old PC; making Unity cry uncle and quit. That is why when I have 5 small mods added, I won\u0027t notice much change, but when 20 mods are added, including big memory hog parts mods, the game may run 5 minutes before quitting.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSO.. in summary, we basically have the same system as we did with Unity 4 and 32 bit KSP... mods have to be limited to avoid crashing.. how ironic.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cs\u003EI note that some folks are having crash problems with stock, and others are running 20\u002B mods without issue. I\u0027m willing to bet that the stability is based on PC performance, beefy top end gaming PCs can run a metric ton of mods with few issues, mid range PCs are crashing with mods, and potatoes are crashing with stock.\u003C/s\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nDisproven: The crashes are not related to overall PC performance, and seem to be at near complete random. The only coorelation I find is that the number of mods added, make the likelihood of a CTD more likely with each action performed.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-08T05:43:02Z\u0022 title=\u002205/08/2016 05:43  AM\u0022 data-short=\u00228 yr\u0022\u003EMay 8, 2016\u003C/time\u003E by Bloodbunny\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2016-05-07T05:20:08Z","Content":"\n\u003Cp\u003E\nWhen I had my mods installed on my original install of KSP, I had \u0026lt;prior to scorching earth\u0026gt; only MechJeb, Novapunch, Proc Fairings and KIS/KAS and save for Novapunch which has yet to see an update since KSP 1.0.2 all mods were installed. \n\u003C/p\u003E\n"},{"CreatedByName":"Bloodbunny","CreatedById":67274,"CreatedDateTime":"2016-05-07T05:29:24Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222566545\u0022 data-ipsquote-contentid=\u0022138924\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221462598408\u0022 data-ipsquote-userid=\u002278020\u0022 data-ipsquote-username=\u0022AlamoVampire\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 minutes ago, AlamoVampire said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhen I had my mods installed on my original install of KSP, I had \u0026lt;prior to scorching earth\u0026gt; only MechJeb, Novapunch, Proc Fairings and KIS/KAS and save for Novapunch which has yet to see an update since KSP 1.0.2 all mods were installed. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNovapunch is quite a large parts mod, AND not updated for 1.1.2. It\u0027s quite possible that it was the primary culprit.\n\u003C/p\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2016-05-07T05:31:39Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/67274-bloodbunny/\u0026amp;do=hovercard\u0022 data-mentionid=\u002267274\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/67274-bloodbunny/\u0022 rel=\u0022\u0022\u003E@Bloodbunny\u003C/a\u003E and you could very well be right on that, BUT, it does NOT seem to be a common link to other folks crashing out with this CTD randomness. But, for now, until my newest issue gets resolved, I am not bothering with restoring save files or mods, because being stuck at 1680 X 1050 when I was able prior to slashing and burning KSP at 1920 X 1080 has made the game visually displeasing for me after getting used to the max resolution \u003Cimg alt=\u0022;.;\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 title=\u0022;.;\u0022\u003E \n\u003C/p\u003E\n"},{"CreatedByName":"steve_v","CreatedById":69272,"CreatedDateTime":"2016-05-07T08:10:54Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222566549\u0022 data-ipsquote-contentid=\u0022138924\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221462598964\u0022 data-ipsquote-userid=\u002267274\u0022 data-ipsquote-username=\u0022Bloodbunny\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Bloodbunny said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNovapunch is quite a large parts mod, AND not updated for 1.1.2. It\u0027s quite possible that it was the primary culprit.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\na: I don\u0027t have NovaPunch installed.\u003Cbr\u003E\u003Cbr\u003E\nb: This also occurs in the \u003Cem\u003Estock game\u003C/em\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nc: If part mods (or any mods for that matter) can cause native memory-managemant faults, there\u0027s something horribly wrong with the CLI runtime. Isolating managed code from this kind of thing is the whole point in having such a runtime.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s not mods causing this. Mods might be exacerbating it, but if that\u0027s the case then they are simply revealing a flaw in the underlying system.\n\u003C/p\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2016-05-07T08:21:46Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/69272-steve_v/\u0026amp;do=hovercard\u0022 data-mentionid=\u002269272\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/69272-steve_v/\u0022 rel=\u0022\u0022\u003E@steve_v\u003C/a\u003E which is why i was openly dubious about it being mods alone. while they may be over taxing a broken system, they (squad OR unity) need to address the issue with haste, or this may be the start of the end for the game. especially if its mods exacerbating this, it means we cannot mod our games as we wish, which ends the fun for a lot of people including myself. but, i do not want to start doomsdaying this yet. hope yet remains!\n\u003C/p\u003E\n"},{"CreatedByName":"STS Fallacy","CreatedById":163087,"CreatedDateTime":"2016-05-07T09:58:58Z","Content":"\n\u003Cp\u003E\nThat thing got me thinking. I normally don\u0027t use windows - my laptop is a mac and my desktop runs linux, but I borrowed my brother\u0027s laptop and installed KSP there. Got a CTD after \u002B- 30 minutes of playing. And another 45 minutes after that - with OneDrive installed. Removed it, got another CTD after an hour or so. \n\u003C/p\u003E\n\u003Cp\u003E\nPlayed KSP 1.1.2 for about 30 hours on my mac. One CTD. And for ten hours on my linux. No CTD. \n\u003C/p\u003E\n\u003Cp\u003E\nWhich means... \u003Cspan style=\u0022font-size:8px;\u0022\u003E(no offense, I\u0027m just joking)\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nWindows is the reason of those crashes. \n\u003C/p\u003E\n\u003Cp\u003E\nNow seriously: That dll was the reason of all three windows CTDs I had. Something fishy going on in there.\n\u003C/p\u003E\n"}]}