{"TopicId":139150,"ForumId":29,"TopicTitle":"How to tell when a docking field is engaged? [Answered]","CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-05-06T16:20:29Z","PageNum":1,"Articles":[{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-05-06T16:20:29Z","Content":"\n\u003Cp\u003E\nHow do I programmatically examine a docking port and answer the question \u0022is the docking field engaged\u0022?  (i.e. \u0022has it latched on to something, but not yet actually docked\u0022)\n\u003C/p\u003E\n\u003Cp\u003E\nI would have thought there\u0027d be a boolean field (or similar) on ModuleDockingNode, but I\u0027ve looked over that class and haven\u0027t been able to spot any likely-looking candidates.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOn a somewhat related note:  When two ships are docked, and you undock them, the docking ports deliberately are inactive (no docking field) until the docking ports are separated by at least a certain minimum threshold distance.  At that point, the ports \u0022reset\u0022 and become dockable again.  Would also be interested in knowing how to detect that state or transition.  In other words:  how to distinguish \u0022field is ready, but not engaged because they\u0027re not close enough\u0022 versus \u0022field is temporarily disabled because they just undocked and haven\u0027t reached the reset point yet\u0022.\n\u003C/p\u003E\n"},{"CreatedByName":"Padishar","CreatedById":97386,"CreatedDateTime":"2016-05-06T17:58:36Z","Content":"\n\u003Cp\u003E\nYou should be able to look at ModuleDockingNode.state.  This is a string of the name of the current state of the docking state machine.  I think the state should be \u0022Acquire\u0022 or \u0022Acquire (dockee)\u0022 when it is actively pulling in.  Not sure what it will be after undocking but before port reset but it should be easy enough for you to log it and find out...\n\u003C/p\u003E\n"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2016-05-06T18:30:59Z","Content":"\n\u003Cp\u003E\nWhen the module is within the acquisition range and is the dominant port the state will be \u0022Acquire\u0022. But the other port (not necessarily on the other vessel) will be \u0022Docked (dockee)\u0022, even though it hasn\u0027t docked yet; the inactive port also won\u0027t have its magnets engaged. The active port switches to \u0022Docked (docker)\u0022 once you dock.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen you undock, and haven\u0027t passed the reengage distance, it will be \u0022Disengage\u0022, I think.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen the docking port isn\u0027t doing anything it will be \u0022Ready\u0022; if it\u0027s a shielded port I thing it might be \u0022Disabled\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-05-06T20:38:39Z","Content":"\n\u003Cp\u003E\nExcellent, thanks guys!  Just what I was looking for.  \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222565530\u0022 data-ipsquote-contentid=\u0022139150\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221462559459\u0022 data-ipsquote-userid=\u002257416\u0022 data-ipsquote-username=\u0022DMagic\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, DMagic said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhen the module is within the acquisition range and is the dominant port the state will be \u0022Acquire\u0022. But the other port (not necessarily on the other vessel) will be \u0022Docked (dockee)\u0022, even though it hasn\u0027t docked yet\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSo, if I\u0027m understanding correctly:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nWhen a docking is happening, it\u0027s an asymmetric process in the code.\n\u003C/li\u003E\n\u003Cli\u003E\nOne port is the docker, the other is the dockee.\n\u003C/li\u003E\n\u003Cli\u003E\nThe \u0022status\u0022 string field is what I should look at.\n\u003C/li\u003E\n\u003Cli\u003E\n\u0022Docking field engaged\u0022 is indicated on the \u003Cem\u003E\u003Cu\u003Edocker\u003C/u\u003E\u003C/em\u003E by a value of \u0022Acquire\u0022\n\u003C/li\u003E\n\u003Cli\u003E\nHowever, the status for the \u003Cem\u003E\u003Cu\u003Edockee\u003C/u\u003E\u003C/em\u003E will say \u0022Docked\u0022\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nIs that correct?\n\u003C/p\u003E\n\u003Cp\u003E\nIf that\u0027s the case, then it sounds like it\u0027s easy for me to detect when a port is in the state \u0022I am the docker, and the field is engaged but I\u0027m not yet docked.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nBut how can I detect that state for the dockee?  That is, how do I detect the state \u0022I am the dockee, and someone has engaged a docking field on me but is not yet docked\u0022?  i.e. how to distinguish that from simply being docked?\n\u003C/p\u003E\n"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2016-05-06T21:50:26Z","Content":"\n\u003Cp\u003E\nBoth docking ports keep a reference to the matching node; otherNode. You can watch the status of both docking ports to decide when they are engaged and when they are actually docked.\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-05-06T22:31:56Z","Content":"\n\u003Cp\u003E\nAh!  Perfect.  Thank you, I should be able to get everything I need from that, and the asymmetry wart just needs a few extra lines of code to work around.\n\u003C/p\u003E\n\u003Cp\u003E\nThanks for the answers!\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-05-07T04:43:53Z","Content":"\n\u003Cp\u003E\nJust as a follow-up:  I just now did a bit of experimentation to verify the various possible state strings.  Here\u0027s what I found:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nWhen nothing\u0027s attached, the port says \u0022Ready\u0022.\n\u003C/li\u003E\n\u003Cli\u003E\nWhen something\u0027s attached, but from the vehicle editor and not from docking, then it\u0027s \u0022PreAttached\u0022.\n\u003C/li\u003E\n\u003Cli\u003E\nWhen the docking field is engaged, but not yet docked:  it\u0027s either \u0022Acquire (dockee)\u0022 or \u0022Acquire\u0022 (the docker doesn\u0027t have the suffix, for some reason)\n\u003C/li\u003E\n\u003Cli\u003E\nWhen they\u0027re actually docked, it\u0027s \u0022Docked (dockee)\u0022 or \u0022Docked (docker)\u0022\n\u003C/li\u003E\n\u003Cli\u003E\nWhen they\u0027ve undocked but haven\u0027t gotten far enough to reset yet, it\u0027s \u0022Disengage\u0022 for both docker and dockee\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nSo, it looks as though I never have to look at the otherNode to get the relevant status.  I can just use the string, and starts-with-\u0022Acquire\u0022 or starts-with-\u0022Disengage\u0022 as appropriate.\n\u003C/p\u003E\n"}]}