{"TopicId":139952,"ForumId":70,"TopicTitle":"Weird anomaly when using Docking Port Jr.","CreatedByName":"Azamorn","CreatedById":164338,"CreatedDateTime":"2016-05-17T09:11:20Z","PageNum":1,"Articles":[{"CreatedByName":"Azamorn","CreatedById":164338,"CreatedDateTime":"2016-05-17T09:11:20Z","Content":"\n\u003Cp\u003E\nI\u0027ve been building a station in LKO that is going to land on the Mun, I\u0027m not that far into the tech tree yet so I\u0027ve been attaching modules with the docking port jr. \u003Cbr\u003E\nEverything went fine with putting it together in orbit, have 4 modules attached that gives me atleast 3000 units of fuel. The problem I\u0027m seeing is that Mechjeb and Kerbal Engineer Redux is not taking the fuel from the modules into consideration when calculating the DeltaV, While i should be having easily 3000 dV or more it\u0027s only displaying 200 dV, as a work around I\u0027m using the TAC Fuel Balance mod to get fuel into the main tank.\u003Cbr\u003E\u003Cbr\u003E\nAnyone else experienced this issue before?\n\u003C/p\u003E\n"},{"CreatedByName":"Perry Apsis","CreatedById":97519,"CreatedDateTime":"2016-05-17T12:16:43Z","Content":"\n\u003Cp\u003E\nI suppose as a matter of form I should ask whether you clicked the \u0022disable crossfeed\u0022 button on the ports. It defaults to enabled, but it\u0027s worth checking. Also worth checking is whether you have any separators or decouplers between the ports and the rest of the ship (crossfeed defaults to disabled on those).\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Malich","CreatedById":152798,"CreatedDateTime":"2016-05-17T15:01:56Z","Content":"\n\u003Cp\u003E\nOr enable staging. If the staging of the pods happens before the engine it won\u0027t count it \n\u003C/p\u003E\n"},{"CreatedByName":"Norcalplanner","CreatedById":112223,"CreatedDateTime":"2016-05-17T19:35:41Z","Content":"\n\u003Cp\u003E\nYou have to upgrade one of the KSC buildings to enable resource transfer - can\u0027t remember which one at the moment.\n\u003C/p\u003E\n"}]}