{"TopicId":139973,"ForumId":39,"TopicTitle":"The diary of a Kerbonaut in training --- short novel/story","CreatedByName":"Columbia","CreatedById":135031,"CreatedDateTime":"2016-05-17T16:44:12Z","PageNum":1,"Articles":[{"CreatedByName":"Columbia","CreatedById":135031,"CreatedDateTime":"2016-05-17T16:44:12Z","Content":"\n\u003Cp\u003E\n~~~~ENTRY 1 -- \u0022APPLICATION TO THE SPACE PROGRAM\u0022~~~\n\u003C/p\u003E\n\u003Cp\u003E\nWell, seems like the space program\u0027s putting up applications again for astronauts. Pretty rare, nowadays they usualll0y have enough for about.. what, 5 space stations worth? And so far, 1,500 applicants have out forward their resumes, mine included. The only thing I really have that would probably help is a degree in Mechanical Engineering.\n\u003C/p\u003E\n\u003Cp\u003E\nSo basically, I\u0027ll most likely be an engineer/repairman/whatever, if I ever got in. Fun, isn\u0027t it?\n\u003C/p\u003E\n\u003Cp\u003E\nAnyways, what next missions would the Kerbal Space Program (let\u0027s just call it KSP now) have in store? The only thing they\u0027re putting forward are tourist missions (using the \u0022Tourist SSTO I.\u0022 Who named this crap?) as well as.. a mission to Duna.\n\u003C/p\u003E\n\u003Cp\u003E\nI know their launcher under development is the \u0022Duna Launcher Thing\u0022 (What\u0027s the address of the guy who names KSPs\u0027 rockets?) and it\u0027s supposed to be what\u0027s called an \u0022Apollo-style landing\u0022. No idea what that means, but it involves rendezvous and docking.\n\u003C/p\u003E\n\u003Cp\u003E\nWhatever, I\u0027ll go back to playing Human Space Program. Damn, it\u0027s addicting.\n\u003C/p\u003E\n\u003Cp\u003E\n~~ENTRY 1.5 \u0022WHAT\u0027S THIS??~~~\n\u003C/p\u003E\n\u003Cp\u003E\nHuman Space Program is insane. The developers named Kerbin \u0022Earth\u0022, it\u0027s larger, and the parts seem to be like the 3.75m parts IRL. What?\n\u003C/p\u003E\n\u003Cp\u003E\n~~~ENTRY 2 \u0022OOOH, I WAS ACCEPTED!\u0022~~~~\n\u003C/p\u003E\n\u003Cp\u003E\nOh yes, oh yes, oh yes!!\n\u003C/p\u003E\n\u003Cp\u003E\nI was accepted for the Engineer role! I\u0027ll go to the Astronaut Complex for more details, but it\u0027ll be a long and hard training process (\u0022long and hard\u0022( ͡° ͜ʖ ͡°)) that\u0027ll take months, probably even years.\n\u003C/p\u003E\n\u003Cp\u003E\nThat\u0027s nice, I\u0027m being paid to use their equipment and learn things! Universities should follow the space program\u0027s path.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, what the hell is with the \u0022STS\u0022 program parts in HSP? They look like the space program\u0027s Mk3 series, except far uglier.\n\u003C/p\u003E\n\u003Cp\u003E\nI slapped a \u0022Space Shuttle\u0022 together, slapped it on top of a B747 (Kerbal, isn\u0027t it?) and made it glide.\n\u003C/p\u003E\n\u003Cp\u003E\nOh my god, it flies so crappily. And the 747 looks \u003Cem\u003Ehorrifying!\u003C/em\u003E \n\u003C/p\u003E\n\u003Cp\u003E\n~~~ENTRY 3~~~~\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m driving to the Kerbal Space Center now. I haven\u0027t been to the outside world in a long time and it\u0027s good to see some light again. The Space Center\u0027s the only thing really gleaming outside anyways. So it\u0027s pretty recognizable..\n\u003C/p\u003E\n\u003Cp\u003E\nOh god, it\u0027s huge! To put it straight..\n\u003C/p\u003E\n\u003Cp\u003E\n*AHEM*\n\u003C/p\u003E\n\u003Cp\u003E\nThe whole thing seemed so magnificent, with the structures gleaming in all their glory. The VAB was so impressive in its size, a single Kerbal seeming to be molecular compared to the shining structure-- Screw this, I give up.\n\u003C/p\u003E\n\u003Cp\u003E\nI can\u0027t do crap with literature anyways.\n\u003C/p\u003E\n\u003Cp\u003E\nI parked right outside the runway. While there wasn\u0027t a fence (genius these architects are) there was a big sign telling me to be aware of jet blast. As far as my vocabulary is concerned, jet blast sends you flying, so you should probably stay away from it. I checked the signs. The astronaut complex looks.. okay? I mean, it\u0027s a small building, but pretty massive compared to the Administration building. But come on, the Admin. Building has a pool! \n\u003C/p\u003E\n\u003Cp\u003E\nI parked my rover near the lot, and decided to walk to the pool.\n\u003C/p\u003E\n\u003Cp\u003E\nFaaaaaaake! Turns out the water is just.. light making it look like water. Wankers.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyways, I entered the building. Because I\u0027m an engineer, I\u0027ll be serving as an engineer in the VAB as part of the training. Of course, I\u0027ll have the actual astronaut training as well because.. you know.\n\u003C/p\u003E\n\u003Cp\u003E\n~~~ENTRY FOUR~~~\n\u003C/p\u003E\n\u003Cp\u003E\nOkay, so I was assigned to work on the SRBs. There\u0027s things about O-Rings, there\u0027s rocketry things, and others. The boosters were already tested, so that\u0027s good. \n\u003C/p\u003E\n\u003Cp\u003E\nThe booster\u0027s for a rocket to test the capsule. I still don\u0027t get why I was assigned to the booster. As an engineer, my job would be to repair rover wheels and extend solar panels, not learn how to try shutting down an SRB without wrecking it completely.\n\u003C/p\u003E\n\u003Cp\u003E\nThe training was sufficient. I was able to fit the segments with ease.\n\u003C/p\u003E\n\u003Cp\u003E\n~~~ENTRY FIVE~~~\n\u003C/p\u003E\n\u003Cp\u003E\nThere was an argument today at Rockomax about whether conditions would work for the launcher, notably the SRBs. Oh well. I couldn\u0027t give two craps about it, honestly. Just follow whatever the higher-ups do I guess.\n\u003C/p\u003E\n\u003Cp\u003E\nMy first mission turns out to be taking ourselves to the space station \u0022Low on funds so it\u0027s pretty small\u0022. Seriously, the giy who names them needs to get his head banged in or go back to school. Training\u0027s going to start soon\n\u003C/p\u003E\n\u003Cp\u003E\n~~~ENTRY FIVE (2)~~~\n\u003C/p\u003E\n\u003Cp\u003E\nTurns out no one really knows who named these ships. How lame.\n\u003C/p\u003E\n\u003Cp\u003E\n~~~ENTRY SIX~~~~\n\u003C/p\u003E\n\u003Cp\u003E\nToday, I was forced into staying into a cramped box with three other Kerbonauts as training. We got acquainted with each other before we were forced to stay there for a few days. Food was already stored in the capsule. Apparently it\u0027s simulating a rendezvous to the station. Ughhhh. Never again.\n\u003C/p\u003E\n\u003Cp\u003E\n~~~ENTRY SEVEN~~~~\n\u003C/p\u003E\n\u003Cp\u003E\nOh, launch day\u0027s today! That\u0027s nice.\n\u003C/p\u003E\n\u003Cp\u003E\nI went to KSC to watch the launch, and sat by a bench. It\u0027s one of the stepping stones for the \u0022Duna mission thing\u0022 to be.. completed And um.. for Kerbalkind to know.. things.\n\u003C/p\u003E\n\u003Cp\u003E\nThis log isn\u0027t meant to be poetic.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s particularly cold today, probably because Winter\u0027s coming around.\n\u003C/p\u003E\n\u003Cp\u003E\nSo it lifted off, yeah, yeah. It looks good. Okay. That\u0027s good as well. It\u0027s very nice.\n\u003C/p\u003E\n\u003Cp\u003E\n~~~~~~~~~~~~~~~~~\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EThe rocket rumbled off the launchpad, it\u0027s core and boosters shaking at the sheer power of the engines. The setup slowly lifted off the launchpad, smoke and fapor bombarding the whole of the launchpad. Soon enough, it was blasting into the heavens.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003ESensors were scattered all over the rocket to send data back to Mission Control -- Speed, altitude and position.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ci\u003EThe sensors responsible for detecting how close the rocket was to a certain marker on the \u0022navball\u0022 froze as the rocket started accelerating more and more and the cold winds battered it.\u003C/i\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ci\u003EThis caused the guidance system to malfunction, so for every course change, it would not stop before the node, but after. This caused the rocket to swing to one side, miss the designated node, swing to it again and miss, causing it to wobble.\u003C/i\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ci\u003EEventually, the shaking was too much for the rocket. The forces placed on it were too much, and it eventually started a slow disintegration.\u003C/i\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ci\u003EThe attachment nodes of the boosters snapped, causing them to thrust inwards into the core of the rocket, and causing the whole setup to break apart slosly, until the only thing left that looked like a rocket was the capsule, which was spinning repeatedly and eventually broke up. \u003C/i\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ci\u003EIn KSC, the debris field was monstrous. The impact wasn\u0027t severe, but property was damaged nonetheless. The boosters were destroyed before causing any damage, and evacuations started.\u003C/i\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ci\u003E~~~~~~~~~~ENTRY EIGHT\u003C/i\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n..Um.. yea.\n\u003C/p\u003E\n\u003Cp\u003E\nThe rocket disintegrated. \n\u003C/p\u003E\n\u003Cp\u003E\nFrom what I saw, it must have been a problem with the unreliable SAS. The roclet started to wobble, slowly at first, then eventually oscillate damn hard \u0027til it broke up.\n\u003C/p\u003E\n\u003Cp\u003E\nNo news from the space program right now, but it seems that they\u0027ll have to ground anything related to the Duna mission. Training will continue, of course.\n\u003C/p\u003E\n\u003Cp\u003E\n~~~~ENTRY NINE~~~~~\n\u003C/p\u003E\n\u003Cp\u003E\nThe KSC was in total chaos today. Some were totally grieved by the events, others pointing fingers. Overall, a @%$#storm. I learned about orbital mechanics. Turns out rendezvous is damn complicated, and uses a lot of RCS.\n\u003C/p\u003E\n\u003Cp\u003E\nI also learned how to \u0022stand near a drill.\u0022 Why? Apparently, when someone assigned the role of engineer stands near it, it becomes more efficient at extracting things.\n\u003C/p\u003E\n\u003Cp\u003E\nDon\u0027t question the logic.\n\u003C/p\u003E\n\u003Cp\u003E\n~~~~ENTRY 10~~~~\n\u003C/p\u003E\n\u003Cp\u003E\nI flew a fighter jet today! It was scary, especially with my instructor seemingly not to give two craps about WALKING ON THE WING while I was piloting. He\u0027s crazy. In case you might know him he\u0027s Jeb K. One of the better known pilots bsck in the day when rocket failures were a common thing and the KSC still looked like trash. \n\u003C/p\u003E\n\u003Cp\u003E\nI could have killed a legend. Just saying.\n\u003C/p\u003E\n\u003Cp\u003E\n~~~ENTRY 11~~~\n\u003C/p\u003E\n\u003Cp\u003E\nOkay, so I learned the jiu-jitsu (or Japanese martial art thing) of extending a solar panel in the case of mechanical failure. Really any Kerbonaut could do that, but apparently, engineers have good hands. \n\u003C/p\u003E\n\u003Cp\u003E\nI guess being an engineer isn\u0027t that boring. \n\u003C/p\u003E\n\u003Cp\u003E\n~~~~ENTRY 12~~~~\n\u003C/p\u003E\n\u003Cp\u003E\nOh, rover wheels.\n\u003C/p\u003E\n\u003Cp\u003E\nReally any old layman who\u0027s driven a car for an hour could fix it well. But as with everything the Space Program has, it has to be done with precise hands (omgggg im so special xDDDD). Seriously, you might as well just have a pilot and a scientist.. On second thought, going to space would be nice.\n\u003C/p\u003E\n\u003Cp\u003E\n~~~ENTRY 13~~~~\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m learning to sew cloth!\n\u003C/p\u003E\n\u003Cp\u003E\nFor what reason, you may ask, my fellow reader? Well.. to repack a parachute. \n\u003C/p\u003E\n\u003Cp\u003E\nWhy couldn\u0027t they just fit another pair of parachutes on their rockets instead of having to waste the time and effort of training Kerbonauts to repack things?\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, they\u0027re hiring new VAB workers after the destruction of the rocket. The space program wants to make sure that any worker doesn\u0027t get caugt up in other duties while assembling things. \n\u003C/p\u003E\n\u003Cp\u003E\nSo I no longer need to work with filthy SRBs! Thank god!\n\u003C/p\u003E\n\u003Cp\u003E\n~~~~~~ENTRY 14~~~~~\n\u003C/p\u003E\n\u003Cp\u003E\nI practiced EVA today. A nightmare. My god. No, reader, it isn\u0027t all fun and games in zero-g, the side effects would be extreme, and even then the suit is so difficult to move around in. Also, it\u0027s pretty horrifying to see yourself in space, the only thing separating you and certain death a few layers of padding and machinery.\n\u003C/p\u003E\n\u003Cp\u003E\n~~~ENTRY 15~~~~\n\u003C/p\u003E\n\u003Cp\u003E\nMy logs are getting shorter and shorter. My time\u0027s getting more and more used up, so it\u0027s tedious to fill up. Tedious as heck.\n\u003C/p\u003E\n\u003Cp\u003E\nThe space program finally relessed a report, blaming the faulty SAS systems after freezing up in flight. Surprising, really, that it wasn\u0027t given as much a big deal as other failures. Perhaps because it was unmanned.\n\u003C/p\u003E\n\u003Cp\u003E\n~~~~~~~~~~~~~\n\u003C/p\u003E\n\u003Cp\u003E\nI.. have completely forgotten about this log. For a damn long time. Shame. \n\u003C/p\u003E\n\u003Cp\u003E\nTraining\u0027s done, our mission is tomorrow morning. I\u0027m somewhat scared for the outcome, and even thsn if nothing goes wrong, I might not be used to the forces. What about the side effects of zero-g?\n\u003C/p\u003E\n\u003Cp\u003E\nBefore going to sleep, I finally got to build a replica of the space station and docked to it a few times to replicate the mission. But that\u0027s not accurate because conditions are different anyways.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyways, goodnight, reader! I\u0027m off for now. Hopefully I can bring this, but I\u0027ll mostly be busy in my experiments and work on making sure everything works on the station. I can fill it out when I want to.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ll be bringing a camera too, I guess. Why not?\n\u003C/p\u003E\n\u003Cp\u003E\n~~~~END/MIGHT BE CONTINUED~~~~\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"OrtwinS","CreatedById":19144,"CreatedDateTime":"2016-05-18T10:56:25Z","Content":"\n\u003Cp\u003E\nNice, I like the little Human cross-overs like the entire \u0027how to name a rocket\u0027 thing.\n\u003C/p\u003E\n\u003Cp\u003E\nYou  might want to throw in a training mission trick for our trainee. Fly-by Mun, plant a flag on Minmus, pop out of Kerbin\u0027s SOI and get back alive -\u0026gt; And he gets a promotion to 3-star Engineer.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, you could implement a change in the universe\u0027s basic structural mechanics like installing a mod (something like Kerbal Krash System, which makes engineers actually usefull)\n\u003C/p\u003E\n"},{"CreatedByName":"Columbia","CreatedById":135031,"CreatedDateTime":"2016-05-22T09:48:54Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222588464\u0022 data-ipsquote-contentid=\u0022139973\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221463568985\u0022 data-ipsquote-userid=\u002219144\u0022 data-ipsquote-username=\u0022OrtwinS\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 5/18/2016 at 6:56 PM, OrtwinS said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNice, I like the little Human cross-overs like the entire \u0027how to name a rocket\u0027 thing.\n\u003C/p\u003E\n\u003Cp\u003E\nYou  might want to throw in a training mission trick for our trainee. Fly-by Mun, plant a flag on Minmus, pop out of Kerbin\u0027s SOI and get back alive -\u0026gt; And he gets a promotion to 3-star Engineer.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, you could implement a change in the universe\u0027s basic structural mechanics like installing a mod (something like Kerbal Krash System, which makes engineers actually usefull)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThanks, I\u0027ll write the next part when I have time. I\u0027m thinking of sending him to train for the Duna mission (once he gets back from the space stationof course), and a similar mission to put his engineering to the test, perhaps. Or he could just be the one having to deal with the problems of the station.\n\u003C/p\u003E\n"}]}