{"TopicId":140350,"ForumId":51,"TopicTitle":"In praise of 1970s technology","CreatedByName":"AeroGav","CreatedById":152027,"CreatedDateTime":"2016-05-23T13:30:48Z","PageNum":1,"Articles":[{"CreatedByName":"AeroGav","CreatedById":152027,"CreatedDateTime":"2016-05-23T13:30:48Z","Content":"\n\u003Cp\u003E\nAfter all the min-maxing it was refreshing to spend a weekend on the less used concepts.  Particularly, the much maligned Space Shuttle and all those things in the middle of the tech tree you never use.  I\u0027m talking about the techs that come after the starting items you\u0027re forced to use in career mode and all the sexy spaceplane stuff i beeline for.\n\u003C/p\u003E\n\u003Cp\u003E\nTo start with,  I had a look at the problem of Centre of Gravity management with rear mounted engines.  Tried to make it as foolproof as possible with no mods.  Results in a rather stubby but not uncomely aircraft.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220160522011928_1_zpsznh1vrgc.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022564\u0022 src=\u0022http://i1144.photobucket.com/albums/o492/narostel/20160522011928_1_zpsznh1vrgc.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe way rocket fuel drains front to back can really mess with your spaceplane.   This one has only one rocket fuel tank, the largest available in mk3 size, and it sits right on the CG of the aircraft.  At the back is a tri-adapter the 3 lightweight and efficient Terrier engines.   At the start of the closed cycle phase, these might not have a good margin over the drag losses , so we have a pair of thuds, on the centreline of the fuselage, one on top, one below.   They are not very efficient but an action group can bring them in at times of need.   As radial mount engines, they don\u0027t need any nacelles, and take their fuel direct from the big tank without ducts, all of which lowers drag.\n\u003C/p\u003E\n\u003Cp\u003E\nWe also have 4 whiplashes, between the wings.   The Thuds and Whiplash are mounted towards the front of the plane, offsetting the weight of the Terriers at the back.  This keeps our CG right in the middle of the large tank, so CG does not move in either direction as it empties.\n\u003C/p\u003E\n\u003Cp\u003E\nOne problem i was not able to solve was jet engines still taking fuel out of the rocket tank when they have a perfectly good set of fuel filled wings. Also, where to put a cargo bay?    If the fuel tank is at our CG, cargo will necessarily be in front of or behind it.  This could lead to handling differences loaded vs empty.\n\u003C/p\u003E\n\u003Cp\u003E\nNext, was a space shuttle-alike .  It solves some of these problems (but needs mods) and is tricky to fly, as these things tend to be. Ended up needing 3 mods, tweakscale, GPOFuelSpeedPump and ModularFuelTanks to make it work.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022true\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/JS7JLRed-cc?feature=oembed\u0022 width=\u0022480\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nThe original Shuttle concept was  for a smaller orbiter launched off the back of a large, high speed/altitude carrier plane.   This was my take on it.  In my imagined Kerbal universe, it was the STS\u0027s replacement following a number of fatal accidents.    As a result, safety was paramount\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022true\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/mhFx5f3rVPY?feature=oembed\u0022 width=\u0022480\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nSticking with 70s tech, it uses Whiplash (Pratt \u0026amp; Whitney J58 ) for the carrier plane, and NERV on the orbiter.  The cargo bay is small, so it\u0027s not really suited to construction tasks.  Still, there\u0027s space for a few science instruments, and it has enough delta V to explore the Kerbin SOI somewhat.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022true\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/f9C_gp_p_KA?feature=oembed\u0022 width=\u0022480\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nUnfortunately while the carrier plane has a probe core and is perfectly controllable with the orbiter released, the game deletes it as soon as the orbiter flies out of physics range.  So the 100% re-usable nature of this system is lost.  2 Mods for this -  GPOSpeedFuelPump and ModularFuelTanks.\n\u003C/p\u003E\n\u003Cp\u003E\n Personally i think this little orbiter is cute, and with all its safety systems, \u0022very NASA\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you\u0027re interested in any of these aircraft,  I can put them on KerbalX for download.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-23T13:35:31Z\u0022 title=\u002205/23/2016 01:35  PM\u0022 data-short=\u00228 yr\u0022\u003EMay 23, 2016\u003C/time\u003E by AeroGav\u003C/strong\u003E\n\u003C/span\u003E\n"}]}