{"TopicId":140630,"ForumId":44,"TopicTitle":"Man vs. Probe.","CreatedByName":"ValleyTwo","CreatedById":157095,"CreatedDateTime":"2016-05-27T17:22:01Z","PageNum":1,"Articles":[{"CreatedByName":"ValleyTwo","CreatedById":157095,"CreatedDateTime":"2016-05-27T17:22:01Z","Content":"\n\u003Cp\u003E\n\u003Cimg alt=\u0022Bender-Wallpaper-bender-21042702-1024-76\u0022 class=\u0022ipsImage\u0022 height=\u0022750\u0022 src=\u0022http://images4.fanpop.com/image/photos/21000000/Bender-Wallpaper-bender-21042702-1024-768.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThis is a question I have.  I don\u0027t mind robotic explorers and probes.  Yes, sooner or later mankind has to go out there.  But i have no problem with drowning the planets in beeping rovers.\n\u003C/p\u003E\n\u003Cp\u003E\nBut people always say, one person on Mars within a few hours could do what all the probes and rovers have ever done there.  Really?  I would like to see if we can get a solid number.  Let me explain.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen you take into account fuel, food, energy, protection, and all the rest, how much would it cost to send one person to Mars?  All I want is a ball park figure.\n\u003C/p\u003E\n\u003Cp\u003E\nThen I want to compare that to one unmanned mission to Mars.  In other words, how many unmanned missions could we drop on Mars with the same account it would take to send one human (who has many skills) to Mars and back again?  Yes, remember, we need to return that one person, plus rocks, back to Mars.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd in the end, can one Man do more science than the probes (using the same amount of money) could do?  If we have, for example, a dozen probes who can land in a dozen places, surely the information they get would be vast and more varied then one guy in a spacesuit who can only walk/drive so far during the daylight hours.  And has to leave after a certain point.\n\u003C/p\u003E\n\u003Cp\u003E\nOr example: Mars Pathfinder cost a total of 175 million US Dollars.  That seems to nice number to use as an example for Unmanned missions to Mars.  Also the fact that is survived longer than they thought it would is may be something to take into account on the side of the probes.\n\u003C/p\u003E\n\u003Cp\u003E\nIs there a number, a bottom line in cash, for a manned mission to Mars?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Gaarst","CreatedById":126740,"CreatedDateTime":"2016-05-27T17:29:47Z","Content":"\n\u003Cp\u003E\nThe Constellation Program was estimated between $150 and $300 billion. Now, someone is going to tell you that SpaceX can do it in 2 months for ten bucks, but I seriously doubt Spacex\u0027s estimations.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway, a manned mission is considerably more expensive than a probe, it has always been such and will always be. Just consider the hardware: return mission so larger booster, and need to develop all the tech to host a group of astronauts for over a year.\n\u003C/p\u003E\n\u003Cp\u003E\nAn astronaut \u003Cem\u003Emay \u003C/em\u003Ebe more efficient than a probe/rover, but if you\u0027re just looking for money/science benefits, it\u0027s not worth the trouble.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-27T17:30:05Z\u0022 title=\u002205/27/2016 05:30  PM\u0022 data-short=\u00228 yr\u0022\u003EMay 27, 2016\u003C/time\u003E by Gaarst\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2016-05-27T18:22:28Z","Content":"\n\u003Cp\u003E\nIt takes 30 years to send a manned mission to Mars. It takes 10 years to design and build several robotic missions for a fraction of the cost.\n\u003C/p\u003E\n\u003Cp\u003E\nThe manned mission spends 6 months on the surface, a large part of which is dedicated to staying alive, monitoring and maintaining support systems and attending to biological needs. A robotic probe can spend several years and study seasonal variations.\n\u003C/p\u003E\n\u003Cp\u003E\nHumans are limited to EVAs of a couple of hours, and within a safe radius around their lander or base. Robots can study many different environments for years and travel longer distances.\n\u003C/p\u003E\n\u003Cp\u003E\nHumans are limited to their visual acuity from around 1m70 above ground, while being distracted by navigating, monitoring supplies and trying not to fall over. Robots are controlled by entire teams of scientists, monitoring arrays of sensors that can extensively study every inch of terrain.\n\u003C/p\u003E\n\u003Cp\u003E\nThe only scientific reason to send humans to other planets is to learn about sending humans to other planets.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-27T18:23:11Z\u0022 title=\u002205/27/2016 06:23  PM\u0022 data-short=\u00228 yr\u0022\u003EMay 27, 2016\u003C/time\u003E by Nibb31\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-05-27T18:23:52Z","Content":"\n\u003Cp\u003E\nIf you were to give a probe program an identical budget to a manned program to visit the same body, the results would not even be close. Robots are always better if the goal is non-medical science, no exceptions. This difference increases literally daily with improved robotic capabilities.\n\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2016-05-27T19:23:24Z","Content":"\n\u003Cp\u003E\nIt\u0027s going to cost hundreds of billions of dollars to send people. But, in all that money, large amounts will be dedicated to probes. The Apollo program necessitated quite a few probe launches. For Mars, a good communication network would be needed, maybe even improved mapping systems, and potentially landers to examine the landing site. Plus, with hundreds of billions, who\u0027s going to care if 10 or 20 billion were for probes. \n\u003C/p\u003E\n"},{"CreatedByName":"FleshJeb","CreatedById":111640,"CreatedDateTime":"2016-05-27T19:40:53Z","Content":"\n\u003Cp\u003E\n\u003Ca href=\u0022https://en.wikipedia.org/wiki/Mars_Direct\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Mars_Direct\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nMars Semi-Direct quotes $55 billion over ten years for a four-person mission. I recall reading that Mars Direct was $40 billion.\n\u003C/p\u003E\n\u003Cp\u003E\nPersonally, I\u0027m in the \u0022Mars to Stay\u0022 camp.  \u0022\u003Cspan style=\u0022color:rgb(37,37,37);font-family:sans-serif;font-size:14px;font-style:normal;font-variant:normal;font-weight:normal;letter-spacing:normal;line-height:22.4px;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;float:none;background-color:rgb(255,255,255);\u0022\u003ETwenty or more persons could be sent for the cost of returning four.\u003C/span\u003E\u0022 If we\u0027re going to be so cost-conscious, we can\u0027t afford to be risk-averse.\n\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-05-27T20:33:21Z","Content":"\n\u003Cp\u003E\n$40 billion would provide vastly more science return as probes than people. Every kg of people, and stuff to keep people alive (in other words a large percentage of the mass delivered to Mars) could instead be samples returned, or additional probes. The ability to have more autonomous rovers, etc is increasing rapidly, nothing we\u0027ve landed has been nearly as sophisticated from a self-driving standpoint as a google car, for example.\n\u003C/p\u003E\n"},{"CreatedByName":"cubinator","CreatedById":150330,"CreatedDateTime":"2016-05-27T22:36:42Z","Content":"\n\u003Cp\u003E\nI agree that rovers and probes are much cheaper and easier. But it\u0027s not all about science. Humans want to go there. We want to toss red, dusty pebbles in low-G along a riverbed that dried four billion years ago. We want to watch an eclipse wander over Jupiter\u0027s bands from a seat on a Galilean moon. We want to float past the rings of Saturn before donning wingsuits on the shores of a methane lake on Titan. That is the reason for human space travel. It\u0027s not because \u0022humans are better at science\u0022 (humans can do science just fine with robots gathering data millions of miles away). It\u0027s because \u003Cem\u003Espace is awesome\u003C/em\u003E, and we want to go there.\n\u003C/p\u003E\n\u003Cp\u003E\nOn a shorter note, it costs \u003Cem\u003Eway\u003C/em\u003E more to send humans to space than probes, and probes can do pretty much everything we can except analyze data, which is easily beamed back home for the scientists to look at from their comfy swivel chairs and monitors. As robot technology advances, the \u0022more science\u0022 argument for human space exploration is becoming weaker and weaker. But the advancements in reusable spaceflight will make it way cheaper to send humans to space, so in the end both humans and robots will be in space a lot. Ok, I guess that wasn\u0027t much shorter. \u003Cimg alt=\u0022:blush:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 title=\u0022:blush:\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-27T22:37:35Z\u0022 title=\u002205/27/2016 10:37  PM\u0022 data-short=\u00228 yr\u0022\u003EMay 27, 2016\u003C/time\u003E by cubinator\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Robotengineer","CreatedById":104525,"CreatedDateTime":"2016-05-27T22:53:57Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222604066\u0022 data-ipsquote-contentid=\u0022140630\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221464370187\u0022 data-ipsquote-userid=\u0022126740\u0022 data-ipsquote-username=\u0022Gaarst\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, Gaarst said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe Constellation Program was estimated between $150 and $300 billion. Now, someone is going to tell you that SpaceX can do it in 2 months for ten bucks, but I seriously doubt Spacex\u0027s estimations.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway, a manned mission is considerably more expensive than a probe, it has always been such and will always be. Just consider the hardware: return mission so larger booster, and need to develop all the tech to host a group of astronauts for over a year.\n\u003C/p\u003E\n\u003Cp\u003E\nAn astronaut \u003Cem\u003Emay \u003C/em\u003Ebe more efficient than a probe/rover, but if you\u0027re just looking for money/science benefits, it\u0027s not worth the trouble.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhy do SpaceX fans get such a bad rap? You way over exaggerated, Elon will do it in 3 months for a hundred bucks. \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022:wink:\u0022\u003E\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222604125\u0022 data-ipsquote-contentid=\u0022140630\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221464373348\u0022 data-ipsquote-userid=\u00227272\u0022 data-ipsquote-username=\u0022Nibb31\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Nibb31 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt takes 30 years to send a manned mission to Mars. It takes 10 years to design and build several robotic missions for a fraction of the cost.\n\u003C/p\u003E\n\u003Cp\u003E\nThe manned mission spends 6 months on the surface, a large part of which is dedicated to staying alive, monitoring and maintaining support systems and attending to biological needs. A robotic probe can spend several years and study seasonal variations.\n\u003C/p\u003E\n\u003Cp\u003E\nHumans are limited to EVAs of a couple of hours, and within a safe radius around their lander or base. Robots can study many different environments for years and travel longer distances.\n\u003C/p\u003E\n\u003Cp\u003E\nHumans are limited to their visual acuity from around 1m70 above ground, while being distracted by navigating, monitoring supplies and trying not to fall over. Robots are controlled by entire teams of scientists, monitoring arrays of sensors that can extensively study every inch of terrain.\n\u003C/p\u003E\n\u003Cp\u003E\nThe only scientific reason to send humans to other planets is to learn about sending humans to other planets.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou are using traditional NASA numbers, for a traditional NASA type mission, on a traditional NASA timeline. If NASA were to actually do a Mars mission, it would resemble Mars Direct rather than the style of mission you are basing your assumptions on. \n\u003C/p\u003E\n\u003Cp\u003E\nOf course, science isn\u0027t the point of sending humans to Mars. Colonizing Mars is the point of sending people to Mars. Comparing humans and robots for space activities is comparing like comparing apples and oranges. Robots are for exploration and people are for expanding, exploiting, and exploration. \n\u003C/p\u003E\n"},{"CreatedByName":"radonek","CreatedById":84077,"CreatedDateTime":"2016-05-27T23:29:54Z","Content":"\n\u003Cp\u003E\nI don\u0027t think its so clear cut. For instance look at Rosetta mission, you have spacecraft doing all the maneuvering, spending ten years on its way, freezing almost to death for a time. Thats robotics at its best. And then it fails on something man not only can do better, but would in fact find trivial. Obvious lesson is that machines are bad at dealing with unexpected, but what people IMO miss here is how light lag can make anything unexpected. This will only get worse farther you go, until true AI is invented. And I\u0027m not holding my breath for that.\n\u003C/p\u003E\n\u003Cp\u003E\nOther thing is versatility. If its about landing somewhere, looking around and maybe grabbing a rock, you sure can\u0027t beat a robotic probe. But thats a low-hanging fruit. Once you start, you know, turning the stones, drill cores, climbing fissures, exploring caves, things get… complicated. So far there is only one field where you can compare man and probes - the moon. And that one shows that probes may operate at fraction of cost of manned expedition, but also at fraction of capabilities. Most advanced robotic probe of today, which I think today is MSL, is so utterly lacking compared to what two guys in space suits could do it just does not make sense to me to compare price tag. And again there is a less obvious point - as probes get more capable, they also get more complicated and error prone, and in the end more likely to fail without human intervention.\u003Cbr\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-05-28T00:13:48Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222604539\u0022 data-ipsquote-contentid=\u0022140630\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221464391794\u0022 data-ipsquote-userid=\u002284077\u0022 data-ipsquote-username=\u0022radonek\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n36 minutes ago, radonek said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\ncut for length\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe moon is not an example of the superiority of humans at all. Probes to the moon are not remotely comparable with Apollo. Given the same resources, probes would have gathered more samples. They would have left more experiments. People only did more because we spent more. That\u0027s even assuming the same 60s tech. Right now, resources being equal robots are always better than people for everything except the raw adventure/stunt aspect of it. \n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m fine with sending people, but it should be argued for \u0022just because,\u0022 not because it has any rational reason behind it.\n\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2016-05-28T00:34:08Z","Content":"\n\u003Cp\u003E\nRobots can never replace the experience of actually going somewhere. When we went to the Moon, mankind discovered something unexpected: Earth. Astronauts were almost overwhelmed seeing that tiny blue ball in the vast expanse of black. Even the pictures they brought back have probably changed our idea and concept of Earth forever. Walking around on arid Mars, so far away from Earth, will undoubtedly yield new experiences. Mankind is curious and even though we can quench our curiosity temporarily with smart technology, the itch to go out there and have a look ourselves will never be satisfied until we do exactly that.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222604585\u0022 data-ipsquote-contentid=\u0022140630\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221464394428\u0022 data-ipsquote-userid=\u0022119411\u0022 data-ipsquote-username=\u0022tater\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n21 minutes ago, tater said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027m fine with sending people, but it should be argued for \u0022just because,\u0022 not because it has any rational reason behind it.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Cspan\u003EI guess that is what I argued in a nutshell. However, do not underestimate how valuable boots on the ground can be. Having a few smart people walking around that can go off script or suddenly have an idea strike them could yield very different results. Currently, we send probes for very specific and narrow purposes. Even though astronauts will also be equipped with a limited tool set, the observations being made will likely be much broader than those being made with robots.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nDo not forget a lot of major discoveries have been made on accident. Even the rovers have had a little share of that, with a broken wheel exposing unusual materials just below the surface. Humans in person are much better at identifying and explorer these kind of things.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-28T00:38:46Z\u0022 title=\u002205/28/2016 12:38  AM\u0022 data-short=\u00228 yr\u0022\u003EMay 28, 2016\u003C/time\u003E by Camacha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-05-28T01:34:29Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222604607\u0022 data-ipsquote-contentid=\u0022140630\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221464395648\u0022 data-ipsquote-userid=\u002259088\u0022 data-ipsquote-username=\u0022Camacha\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n46 minutes ago, Camacha said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nRobots can never replace the experience of actually going somewhere. When we went to the Moon, mankind discovered something unexpected: Earth. Astronauts were almost overwhelmed seeing that tiny blue ball in the vast expanse of black. Even the pictures they brought back have probably changed our idea and concept of Earth forever. Walking around on arid Mars, so far away from Earth, will undoubtedly yield new experiences. Mankind is curious and even though we can quench our curiosity temporarily with smart technology, the itch to go out there and have a look ourselves will never be satisfied until we do exactly that.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EI guess that is what I argued in a nutshell. However, do not underestimate how valuable boots on the ground can be. Having a few smart people walking around that can go off script or suddenly have an idea strike them could yield very different results. Currently, we send probes for very specific and narrow purposes. Even though astronauts will also be equipped with a limited tool set, the observations being made will likely be much broader than those being made with robots.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nDo not forget a lot of major discoveries have been made on accident. Even the rovers have had a little share of that, with a broken wheel exposing unusual materials just below the surface. Humans in person are much better at identifying and explorer these kind of things.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nDidn\u0027t change my view, having them buy and bring in TV sets to watch the landings at school, that changed my view, cause we didn\u0027t have TV at home. \n\u003C/p\u003E\n\u003Cp\u003E\nI think that the most important contributions that NASA has made, steps above everything else it has done was \n\u003C/p\u003E\n\u003Cp\u003E\n1. The hubble space telescope, even in its redundancies with ground based scopes its made them so much more useful. Long live the HST, curse it be the one who pulls its plug. \n\u003C/p\u003E\n\u003Cp\u003E\n2. The moon rocks, because from these we learned more than anything else how earth formed and why we have an earth moon system and the other inner planets either have none or asteroid sized moons. \n\u003C/p\u003E\n\u003Cp\u003E\n3. The pioneer and voyager mission, if for no other readon demonstrate to people what tenacity and conservation when coupled can achieve, the average pc lasts about 4 years, these things are heading  into thier fifth decdes and like the moon rocks still producing science, still producing publications,\n\u003C/p\u003E\n\u003Cp\u003E\nall  three are legacy systems that just crank. \n\u003C/p\u003E\n\u003Cp\u003E\nLooking at a blue marble does not tell you anything about life other than it oxidizes water and retints the atmosphere and land. I prefer to see my blue marble on a boat on a channel overlooked by  boca chica. \n\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2016-05-28T01:59:00Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222604676\u0022 data-ipsquote-contentid=\u0022140630\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221464399269\u0022 data-ipsquote-userid=\u0022107380\u0022 data-ipsquote-username=\u0022PB666\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n30 minutes ago, PB666 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nDidn\u0027t change my view\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt does not matter, it changed the views of many people and through that, the world.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nLooking at a blue marble does not tell you anything about life other than it oxidizes water and retints the atmosphere and land.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou might personally feel that way, yet again, so many people felt and feel differently. Seeing the little ball we live on together that way brought a new appreciation for the fragility and small scale of that world that feels infinite when you are on it. It is no accident that protecting the environment has since become a bigger and bigger priority - environmental organisations have used the image extensively. When you Google the word \u003Cem\u003EEarth\u003C/em\u003E, those very first pictures pop up. Even 40 years later, \u003Ca href=\u0022http://www.airspacemag.com/photos/top-nasa-photos-of-all-time-9777715/?no-ist\u0022 rel=\u0022external nofollow\u0022\u003Emankind\u003C/a\u003E is \u003Ca href=\u0022http://www.techinsider.io/overview-effect-nasa-apollo8-perspective-awareness-space-2015-8\u0022 rel=\u0022external nofollow\u0022\u003Estill\u003C/a\u003E fascinated by \u003Ca href=\u0022http://www.independent.co.uk/news/science/forty-years-since-the-first-picture-of-earth-from-space-1297569.html\u0022 rel=\u0022external nofollow\u0022\u003Ethem\u003C/a\u003E, as it has been since the \u003Ca href=\u0022https://en.wikipedia.org/wiki/The_Blue_Marble\u0022 rel=\u0022external nofollow\u0022\u003Eimages were released\u003C/a\u003E.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe famous Apollo 8 picture of Earthrise over the moon that established our planetary facthood and beauty and rareness (dry moon, barren space) and began to bend human consciousness.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nFor the exact same reason, the Voyager space craft was used \u003Ca href=\u0022https://upload.wikimedia.org/wikipedia/commons/7/73/Pale_Blue_Dot.png\u0022 rel=\u0022external nofollow\u0022\u003Eto image Earth\u003C/a\u003E as seen from the fringes of our solar system. Scientifically the value was practically nil, yet it is one of the more profound images that Voyager shot. Though I admit the \u003Ca href=\u0022http://www.nasa.gov/sites/default/files/p50142.jpg\u0022 rel=\u0022external nofollow\u0022\u003EJupiter shots\u003C/a\u003E are pretty awe-inspiring too \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-28T02:04:20Z\u0022 title=\u002205/28/2016 02:04  AM\u0022 data-short=\u00228 yr\u0022\u003EMay 28, 2016\u003C/time\u003E by Camacha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2016-05-28T09:06:59Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222604504\u0022 data-ipsquote-contentid=\u0022140630\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221464389637\u0022 data-ipsquote-userid=\u0022104525\u0022 data-ipsquote-username=\u0022Robotengineer\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 hours ago, Robotengineer said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYou are using traditional NASA numbers, for a traditional NASA type mission, on a traditional NASA timeline. If NASA were to actually do a Mars mission, it would resemble Mars Direct rather than the style of mission you are basing your assumptions on. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe whole point of NASA\u0027s Mars Design Reference Architecture plans are to figure out how NASA would actually do it. The DRA 5.0 had elements of Mars Direct, but it still took 5 Ares V launches to send people to Mars and back.\n\u003C/p\u003E\n\u003Cp\u003E\nThe more recent \u003Ca href=\u0022https://www.nasa.gov/sites/default/files/files/4-Status_of_EMC(1).pdf\u0022 rel=\u0022external nofollow\u0022\u003EEvolvable Mars Campaign\u003C/a\u003E, based on SLS, is even more ridiculous.\n\u003C/p\u003E\n\u003Cp\u003E\nThe original Mars Direct was debunked by Zubrin himself as being overly optimistic.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOf course, science isn\u0027t the point of sending humans to Mars. Colonizing Mars is the point of sending people to Mars. Comparing humans and robots for space activities is comparing like comparing apples and oranges. Robots are for exploration and people are for expanding, exploiting, and exploration. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe only entities that could fund a colonization effort are governments, but governments aren\u0027t in the business of colonization, and I don\u0027t see that becoming a political or social priority any time within this century. Space exploration isn\u0027t even mentioned in the current US presidential campaign. \n\u003C/p\u003E\n\u003Cp\u003E\nAs for private initiatives, there is no economical or social incentive for businesses or individuals to relocate to Mars. Colonization is a non-starter.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-28T09:20:35Z\u0022 title=\u002205/28/2016 09:20  AM\u0022 data-short=\u00228 yr\u0022\u003EMay 28, 2016\u003C/time\u003E by Nibb31\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2016-05-28T09:16:26Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222604955\u0022 data-ipsquote-contentid=\u0022140630\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221464426419\u0022 data-ipsquote-userid=\u00227272\u0022 data-ipsquote-username=\u0022Nibb31\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 minutes ago, Nibb31 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAs for private initiatives, there is no economical or social incentive for businesses or individuals to relocate to Mars. Colonization is a non-starter.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYet Musk has clearly stated he aims for Mars. For all intents and purposes, he is more likely to pull it off than NASA. NASA\u0027s budget and the surrounding politics are too complicated and fickle to pull off any large scale project now and in the foreseeable future. An entrepreneur with a vision, funding and no one to tell him to quit it, on the other hand, might fit the bill perfectly.\n\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2016-05-28T09:25:20Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222604960\u0022 data-ipsquote-contentid=\u0022140630\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221464426986\u0022 data-ipsquote-userid=\u002259088\u0022 data-ipsquote-username=\u0022Camacha\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 minutes ago, Camacha said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYet Musk has clearly stated he aims for Mars.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWe all know that thank you very much.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nFor all intents and purposes, he is more likely to pull it off than NASA.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNobody knows that.\n\u003C/p\u003E\n\u003Cp\u003E\nHe is still going to need major amounts of funding, which has to come from somewhere. SpaceX is a commercial launch provider, mostly funded by NASA and the DoD.\n\u003C/p\u003E\n\u003Cp\u003E\nFor Mars, he\u0027ll be on his own. He needs to find customers to sell tickets to.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNASA\u0027s budget and the surrounding politics are too complicated and fickle to pull off any large scale project now and in the foreseeable future. An entrepreneur with a vision, funding and no one to tell him to quit it, on the other hand, might fit the bill perfectly.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAnd where does that funding come from? What is the expected ROI for any potential investors?\n\u003C/p\u003E\n\u003Cp\u003E\nWe are veering off-topic again. Why does every thread have to turn into a SpaceX jerkfest?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-28T09:27:41Z\u0022 title=\u002205/28/2016 09:27  AM\u0022 data-short=\u00228 yr\u0022\u003EMay 28, 2016\u003C/time\u003E by Nibb31\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2016-05-28T09:42:04Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222604964\u0022 data-ipsquote-contentid=\u0022140630\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221464427520\u0022 data-ipsquote-userid=\u00227272\u0022 data-ipsquote-username=\u0022Nibb31\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 minutes ago, Nibb31 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWe are veering off-topic again. Why does every thread have to turn into a SpaceX [redacted]?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis went off the rails in one post. That has to be some kind of record \u003Cimg alt=\u0022:confused:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 title=\u0022:confused:\u0022\u003E You stated there is no incentive, I indicated that this incentive was already in effect. The intention and will is already there. That is not something for the far future, but has been voiced by someone that has shown to be at least somewhat capable has indicated he wants to get this done. Whether the funding and capabilities are there too is up for discussion, though Musk seems to be doing pretty well running a rocket business. None of the other companies are doing so well right now.\n\u003C/p\u003E\n\u003Cp\u003E\nNo need to get offensive. We already have enough of that. Any objective observer will establish Musk currently has a pretty feasible shot. I feel that is pretty realistic and does not deserve some sort of offensive description.\n\u003C/p\u003E\n"},{"CreatedByName":"G\u0026#039;th","CreatedById":98595,"CreatedDateTime":"2016-05-28T09:58:12Z","Content":"\n\u003Cp\u003E\nAll I can say is, even with todays tech, it would take a probe a hell of a lot longer (and at much greater chance of failure if a time limit is imposed) to locate a Genesis rock than two throttle jockeys with a crash course on field geology would. You could say the indefinite amount of time the probe could spend on the surface negates that idea, but the fact that the probe would \u003Cem\u003Ehave\u003C/em\u003E to use that time to deliver comparable results still supports the idea of human exploration. \n\u003C/p\u003E\n\u003Cp\u003E\nSpace exploration in general already suffers from results not being delivered in a timely manner despite the massive investment. Probes can go farther, last longer, and yes, over time, do more for less, but humans can bring results in a timeline that gets you a better budget. (this of course presuming that your ability to send humans isn\u0027t being hampered by poor management and improperly small budgets for stated goals, that is) \n\u003C/p\u003E\n\u003Cp\u003E\nBeyond that, you also have the issue that there are, in fact, things and places that probes simply cannot do and/or go, whereas humans can. You have the potential for rapid, in-situ sample processing, which combined with direct human collection will also result in much better results for the time and money spent. Places such as caves aren\u0027t something probes can explore with any sort of efficiency (without being dedicated, which in turn limits the returns for time and money spent). \n\u003C/p\u003E\n\u003Cp\u003E\nAs has been said before, ideally speaking, probes should go where humans cannot and do what would be a waste for a human to manage. Let humans do the rest. \n\u003C/p\u003E\n"},{"CreatedByName":"YNM","CreatedById":98447,"CreatedDateTime":"2016-05-28T10:53:10Z","Content":"\n\u003Cp\u003E\nIt really depends on which aspect you want to stick.\n\u003C/p\u003E\n\u003Cp\u003E\nLogical : Then you need the science. Easier said for unmanned, unless you\u0027re studying healthcare.\n\u003C/p\u003E\n\u003Cp\u003E\nPride : LETS STUCK THIS POLE TO THE (...) ! GET OUR MEN READY !\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nPolitics aside, I have to admire Hayabusa and Hayabusa2. While they\u0027re unmanned, people are really proud of it.\n\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-05-28T14:40:02Z","Content":"\n\u003Cp\u003E\nThere is no planetary science that cannot be done better by robots, and that reality is diverging from manned exploration at a rapid rate. None, particularly on the Moon, as nearly instant telepresence means that you can still look at a wheel problem and note stuff under the surface. Even in the \u002760s would could have collected more samples with robots given the same effort---but there would never have been the same effort without the manned stunt aspect.\n\u003C/p\u003E\n\u003Cp\u003E\nPictures of the Earth... can be taken without astronauts.\n\u003C/p\u003E\n\u003Cp\u003E\nThe only reason to send people is to send people, but don\u0027t fool yourself that more or better science is part of the reason, any data gathered by people is gravy, it\u0027s not about that.\n\u003C/p\u003E\n"},{"CreatedByName":"Elthy","CreatedById":63317,"CreatedDateTime":"2016-05-28T14:53:30Z","Content":"\n\u003Cp\u003E\nA human (trained in geology or similar) will be way, way faster than a rover in walking around the surface and watching for interessting rocks. Imagine what you have to do to get a rover to turn over a specific rock or dig a hole. Just getting a rover to take a closer look at something which is 100m away takes ages, while a human would simply walk there...\n\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-05-28T15:03:26Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222605225\u0022 data-ipsquote-contentid=\u0022140630\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221464447210\u0022 data-ipsquote-userid=\u002263317\u0022 data-ipsquote-username=\u0022Elthy\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 minute ago, Elthy said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nA human (trained in geology or similar) will be way, way faster than a rover in walking around the surface and watching for interessting rocks. Imagine what you have to do to get a rover to turn over a specific rock or dig a hole. Just getting a rover to take a closer look at something which is 100m away takes ages, while a human would simply walk there...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThose are not comparable, because you are comparing a low-cost rover to a high-cost manned mission. Give the rover the same 50-100 billion, and you\u0027ll have more, and/or better rovers. They will spend far longer on the surface, and will work longer hours within that longer time period.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen I took a lunar geology class from Jack Schmitt, I never asked him if his sample collection was qualitatively better than any of the other Apollo missions, and if so was it because of his training, or because Apollo 17 had a more interesting landing site. My gut says that given the volume of rocks they collected, and the limited collection area, it was likely pretty comparable.\n\u003C/p\u003E\n"},{"CreatedByName":"YNM","CreatedById":98447,"CreatedDateTime":"2016-05-28T15:34:46Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222605225\u0022 data-ipsquote-contentid=\u0022140630\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221464447210\u0022 data-ipsquote-userid=\u002263317\u0022 data-ipsquote-username=\u0022Elthy\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n37 minutes ago, Elthy said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nA human (trained in geology or similar) will be way, way faster than a rover in walking around the surface and watching for interesting rocks.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBut the rover would stay there for months looking around while the human have families and friends to look at. Similar end results.\n\u003C/p\u003E\n\u003Cp\u003E\nYeah, it really boils down to cost. Someone need to compare the cost of Apollo to the cost of Chang\u0027e or LRO maybe ?\n\u003C/p\u003E\n"},{"CreatedByName":"Atlas2342","CreatedById":155194,"CreatedDateTime":"2016-05-28T15:39:53Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222605225\u0022 data-ipsquote-contentid=\u0022140630\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221464447210\u0022 data-ipsquote-userid=\u002263317\u0022 data-ipsquote-username=\u0022Elthy\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n46 minutes ago, Elthy said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nA human (trained in geology or similar) will be way, way faster than a rover in walking around the surface and watching for interessting rocks. Imagine what you have to do to get a rover to turn over a specific rock or dig a hole. Just getting a rover to take a closer look at something which is 100m away takes ages, while a human would simply walk there...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell, I\u0027d say it\u0027s a case by case basis. Rovers, unlike humans, do not need air, food or water. They can survive for much longer in more hostile environments. But humans are better at well, human activities. They can act independently, think of ways to solve problems and others. Then, there\u0027s the cost comparison stated above by \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/119411-tater/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022119411\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/119411-tater/\u0022 rel=\u0022\u0022\u003E@tater\u003C/a\u003E...\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-28T15:40:33Z\u0022 title=\u002205/28/2016 03:40  PM\u0022 data-short=\u00228 yr\u0022\u003EMay 28, 2016\u003C/time\u003E by Atlas2342\u003C/strong\u003E\n\u003C/span\u003E\n"}]}