{"TopicId":140626,"ForumId":44,"TopicTitle":"How do quantum possibilities resolve?","CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-05-27T16:13:53Z","PageNum":1,"Articles":[{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-05-27T16:13:53Z","Content":"\n\u003Cp\u003E\n\u003Ca href=\u0022https://en.wikipedia.org/wiki/Many-worlds_interpretation\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Many-worlds_interpretation\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://en.wikipedia.org/wiki/Wave_function_collapse\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Wave_function_collapse\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://en.wikipedia.org/wiki/Pilot_wave\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Pilot_wave\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nNew study\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.washingtonpost.com/news/speaking-of-science/wp/2016/05/27/schrodingers-cat-just-got-even-weirder-and-even-more-confusing/\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.washingtonpost.com/news/speaking-of-science/wp/2016/05/27/schrodingers-cat-just-got-even-weirder-and-even-more-confusing/\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://www.sciencealert.com/schrodinger-s-cat-is-now-alive-and-dead-in-two-boxes-at-once-irl-experiment-reveals?utm_source=feedburner\u0026amp;utm_medium=feed\u0026amp;utm_campaign=Feed:%20sciencealert-latestnews%20%28ScienceAlert-Latest%29\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.sciencealert.com/schrodinger-s-cat-is-now-alive-and-dead-in-two-boxes-at-once-irl-experiment-reveals?utm_source=feedburner\u0026amp;utm_medium=feed\u0026amp;utm_campaign=Feed:%20sciencealert-latestnews%20%28ScienceAlert-Latest%29\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nSo what do you think the implication of this study is and which model\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-27T16:16:37Z\u0022 title=\u002205/27/2016 04:16  PM\u0022 data-short=\u00228 yr\u0022\u003EMay 27, 2016\u003C/time\u003E by PB666\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2016-05-27T18:00:37Z","Content":"\n\u003Cp\u003E\nOne step closer to the Quantum Entanglement communication? \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"justidutch","CreatedById":99185,"CreatedDateTime":"2016-05-27T18:16:36Z","Content":"\n\u003Cp\u003E\nThat\u0027s a lot of reading to be done in order to participate in the poll.  I will do it, but it may take several days...\n\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-05-27T19:23:42Z","Content":"\n\u003Cp\u003E\nI selected the first choice, however because the direct linkage between quantum and classic physics is a grey area, im inclined to believe that the wave function collapses at the limitation of quantum distances and time, that there is communication between outcomes via unseen virtual forces that allow only one outcome to resolve. \n\u003C/p\u003E\n\u003Cp\u003E\nThis new study suggests that you can observe both outcomes in our universe, so either the study has a major flaw or Occam\u0027s razor should be applied to the multiworld hypothesis. They would be forced to come up with a descriminator function. \n\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-05-27T22:37:28Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222604095\u0022 data-ipsquote-contentid=\u0022140626\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221464372037\u0022 data-ipsquote-userid=\u002257622\u0022 data-ipsquote-username=\u0022Scotius\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Scotius said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOne step closer to the Quantum Entanglement communication? \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nTechnically, the \u003Ca href=\u0022https://en.wikipedia.org/wiki/Wightman_axioms#W3_.28local_commutativity_or_microscopic_causality.29\u0022 title=\u0022Wightman axioms\u0022 rel=\u0022external nofollow\u0022\u003Emicroscopic causality postulate\u003C/a\u003E of \u003Ca href=\u0022https://en.wikipedia.org/wiki/Axiomatic_quantum_field_theory\u0022 title=\u0022Axiomatic quantum field theory\u0022 rel=\u0022external nofollow\u0022\u003Eaxiomatic quantum field theory\u003C/a\u003E implies the impossibility of superluminal communication using any phenomena whose behavior can be described by orthodox quantum field theory.\u003Csup\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Superluminal_communication#cite_note-Eberhard-4\u0022 rel=\u0022external nofollow\u0022\u003E[4]\u003C/a\u003E\u003C/sup\u003E A special case of this is the \u003Ca href=\u0022https://en.wikipedia.org/wiki/No-communication_theorem\u0022 title=\u0022No-communication theorem\u0022 rel=\u0022external nofollow\u0022\u003Eno-communication theorem\u003C/a\u003E, which prevents communication using the \u003Ca href=\u0022https://en.wikipedia.org/wiki/Quantum_entanglement\u0022 title=\u0022Quantum entanglement\u0022 rel=\u0022external nofollow\u0022\u003Equantum entanglement\u003C/a\u003E of a composite system shared between two spacelike-separated observers. Some authors have argued that using the no-communication theorem to deduce the impossibility of superluminal communication is circular, since the no-communication theorem assumes that the system is composite. -wikipedia\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBut think about this, if we can tweek the system to split the quantum state and deliver both outcomes, why can\u0027t we trick the system to deliver an outcome we want, forcing inverted collaboration to non-randomly present the entangled outcome on the other end. Radioactive decay is used to deliver the dead or alive outcome, because, we don\u0027t know what triggers decay, it is most certainly quantum, but the state of the outcome may be determined by the initial state of formation billions of years ago and interactions thereafter to the present. The experiment biases itself by using at-least a superficially random system, but like the above its all but a circular definition, if we assume (Or, should we assume) that radioactive decay is completely random quantum event, then the cats fate is only determined by decay randomness, it is either or dead or alive to itself, but both until we open the box and observe.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you want to review the various paradoxes, many of them faux, that observation creates you can read here. If you think these are answers, i think scientifically, unlike Bell\u0027s theorem, each are questions.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://en.wikipedia.org/wiki/Wave_function_collapse\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Wave_function_collapse\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://en.wikipedia.org/wiki/Quantum_decoherence\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Quantum_decoherence\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022220px-Double-slit_experiment_results_Tan\u0022 height=\u0022638\u0022 src=\u0022https://upload.wikimedia.org/wikipedia/commons/thumb/7/7e/Double-slit_experiment_results_Tanamura_2.jpg/220px-Double-slit_experiment_results_Tanamura_2.jpg\u0022 srcset=\u0022//upload.wikimedia.org/wikipedia/commons/thumb/7/7e/Double-slit_experiment_results_Tanamura_2.jpg/330px-Double-slit_experiment_results_Tanamura_2.jpg 1.5x, //upload.wikimedia.org/wikipedia/commons/thumb/7/7e/Double-slit_experiment_results_Tanamura_2.jpg/440px-Double-slit_experiment_results_Tanamura_2.jpg 2x\u0022 width=\u0022220\u0022\u003E\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe essential problem in this model of decoherance is that you have a precise beam of light, and you force-wave like qualities on what is detected as a particle, what I would say on a beam of light that travels preferentially as a field of an ideal behavior as a wave or particle. If you place a double-slit in that ideal path, you get a measurement of the particle above, which everyone sees. A form of decision base uncertainty the consequence is variance that was not apparent in the previous state (a precise beam) but what added the variance the double slit or the forcing of a more wavelike quality to an electromagnetic field at least momentarily. We now observe uncertainty. But is that the natural behavior or a forced behavior. In otherwords if you interfere with a deterministic state you can force random states, but both might simultaneously exist, and at the same time you are forcing an unpreferred decoherance in the system that later has to be resolved. In this case the probability of the preferred state is lowered, the forced states grow, but all the various states can relate through the most preferred state before resolving and the quantum limits can expand to fulfill the need. Under unforced circumstances no energy needed to be added to allow for this final outcome and everything can be resolved locally. For the variance spread state, the specific might occur polling of the environment with some preferential pathway appearing to resolve the indecision. One could imagine that a quantum event traveling, spiraling, searching for a resolution, and other event passes by also searching for a resolution, and then they resolve as observed, both determined but apparently random. For this reason, as I have said in the past I cannot put a finite limit on the action of virtual particles, the may prefer to act in very small space but it is not neccesary if they are forced.\n\u003C/p\u003E\n\u003Cp\u003E\nConsider a graphene tube between earth and alpha centuari. on the inside there is half of a long 4n\u002B2 orbital and on the other half is another, electrons of opposing spin states exist in either.  Suppose I put two electrons in at the exact center and they circulate in that orbital as a wavefunction, I then send two clocks, precisely synchronized at the same speed to earth and alpha centauri (assuming both have the same gravity). If I sample an electron, (I have a selective two identicle devices that rotates its frequency in tune with the spinfunction  of the electron so that I can only select that electron. By my choice spin -1/2 from the inside, and the wave function only allows that state to communicate at the speed of light. The other individual cannot sample another spin -1/2 from the inside with a similar device, because that molecular orbital can only have one electron of each type. The two electons existed apriori, I pulled one, the other exists and it could be at alpha centauri. If per chance I pulled both of the same state by forcing I created matter from very little energy, when (or) do I have to give the energy back? If many world exist, I get to keep the energy, some other world will have lost it. If communication exists I can only take the alternative spin state, because the entire orbital knows its state, whether and how many electrons exist and their state. I don\u0027t know the answer, but I still think that Bells theorum is not that, its a hypothesis, should be treated as such.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-05-31T18:14:52Z","Content":"\n\u003Cp\u003E\nI just want to add one more bit to this.\n\u003C/p\u003E\n\u003Cp\u003E\nThis is a quote by Carlo Ravolli, the leading expert of Quantum gravity . . . . .\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u0022 Here is an example: theoretical physics has not done great in the last decades. Why? Well, one of the reasons, I think, is that it got trapped in a wrong philosophy: the idea that you can make progress by guessing new theory and disregarding the qualitative content of previous theories. This is the physics of the \u0022why not?\u0022 Why not studying this theory, or the other? Why not another dimension, another field, another universe? Science has never advanced in this manner in the past. Science does not advance by guessing. It advances by new data or by a deep investigation of the content and the apparent contradictions of previous empirically successful theories. Quite remarkably, the best piece of physics done by the three people you mention is Hawking\u0027s black-hole radiation, which is exactly this. But most of current theoretical physics is not of this sort. Why? Largely because of the philosophical superficiality of the current bunch of scientists.\u0022 - \u003Ca href=\u0022http://blogs.scientificamerican.com/cross-check/the-philosophy-of-guessing-has-harmed-physics-expert-says/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://blogs.scientificamerican.com/cross-check/the-philosophy-of-guessing-has-harmed-physics-expert-says/\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-06-07T15:28:03Z","Content":"\n\u003Cp\u003E\n\u003Ca href=\u0022http://www.economist.com/news/science-and-technology/21699899-even-stephen-hawking-sometimes-turns-out-be-wrong-who-better-put-him-right\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.economist.com/news/science-and-technology/21699899-even-stephen-hawking-sometimes-turns-out-be-wrong-who-better-put-him-right\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-07-20T11:47:31Z","Content":"\n\u003Cp\u003E\n\u003Ca href=\u0022http://www.sciencenewsline.com/news/2016071915070033.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.sciencenewsline.com/news/2016071915070033.html\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2016-07-20T23:31:04Z","Content":"\n\u003Cp\u003E\nYup, lets ask a bunch of armchair scientists on a game forum. Forget reading serious papers, that\u0027s for losers.\n\u003C/p\u003E\n\u003Cp\u003E\nStop being ridiculous, it\u0027s not even funny anymore.\n\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-07-21T02:15:33Z","Content":"\n\u003Cp\u003E\nDid the article disagree with your breakfast? \n\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-07-28T12:36:04Z","Content":"\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022true\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/p-MNSLsjjdo?feature=oembed\u0022 width=\u0022480\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}