{"TopicId":140824,"ForumId":66,"TopicTitle":"My farewell to Kerbal Space Program","CreatedByName":"HarvesteR","CreatedById":4,"CreatedDateTime":"2016-05-30T17:05:54Z","PageNum":5,"Articles":[{"CreatedByName":"Azimech","CreatedById":50750,"CreatedDateTime":"2016-05-30T19:16:03Z","Content":"\n\u003Cp\u003E\nThank you Felipe! KSP helped me to find hidden talents in myself! If/when you\u0027re going to create a new game ... I\u0027d love to help you!\n\u003C/p\u003E\n"},{"CreatedByName":"Fredbear12returns","CreatedById":159864,"CreatedDateTime":"2016-05-30T19:16:44Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:\u0027lucida sans unicode\u0027, \u0027lucida grande\u0027, sans-serif;\u0022\u003E\u003Cem\u003ETO THE NEW ERA\u003C/em\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Martijn404","CreatedById":69022,"CreatedDateTime":"2016-05-30T19:19:34Z","Content":"\n\u003Cp\u003E\nThank you so much HarvesteR for the most brilliant game i could ever imagine. \n\u003C/p\u003E\n\u003Cp\u003E\nI still can\u0027t figure how KSP manages to let me fly from one whole world to another, when other games force a loading zone when going to the next room \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E  it\u0027s just amazing, and beautiful too. Never took so many ingame screenshots, from another approaching moon, crazy contraption or lazy sunrise. Never spend so many hours planning and preparing for a (nearly) perfect mission. Never stood away from the PC with my hands in the air celebrating, till my first KSP docking. \n\u003C/p\u003E\n\u003Cp\u003E\nAll the best and I hope you find happiness in your next projects \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nOh... and just imagine.. I am quite certain that the first astronaut who will land on Mars, 10 or 20 years from now, will have started his space dream playing Kerbal Space Program. How\u0027s that for a recommendation? \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-30T19:23:17Z\u0022 title=\u002205/30/2016 07:23  PM\u0022 data-short=\u00228 yr\u0022\u003EMay 30, 2016\u003C/time\u003E by Martijn404\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"HarvesteR","CreatedById":4,"CreatedDateTime":"2016-05-30T19:22:13Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222608448\u0022 data-ipsquote-contentid=\u0022140824\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221464635638\u0022 data-ipsquote-userid=\u00224143\u0022 data-ipsquote-username=\u0022Monger\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 minutes ago, Monger said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents ipsClearfix\u0022\u003E\n\u003Cp\u003E\nI am a little shocked. Not because you are leaving KSP (after more than 5 years, this kind of expected), but because you didn\u0027t mention at all what you are doing next.\n\u003C/p\u003E\n\u003Cp\u003E\nWhere are you going? What are you planning? Surely, you already know where you are going to. I really hope you are going in peace with the rest of the team and the project, because as I understood, things got a little tense in the last year.\n\u003C/p\u003E\n\u003Cp\u003E\nI still admire your vision for KSP, and the work you put into this dream. I really hope that you are able to dream again in a similar way for another project, but with the experience you have now. Please let us know what you will be working on, so we can follow the next project as closely as this one :-)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt\u0027s much too early to talk about what\u0027s coming next, but rest assured there is something coming. You\u0027ll hear of it in time. \n\u003C/p\u003E\n\u003Cp\u003E\nAs for the team, I\u0027m leaving on the best of terms with everyone. I\u0027m going to keep in touch with all of them.\n\u003C/p\u003E\n\u003Cp\u003E\nCheers\n\u003C/p\u003E\n"},{"CreatedByName":"Gojira","CreatedById":10884,"CreatedDateTime":"2016-05-30T19:22:54Z","Content":"\n\u003Cp\u003E\nHarvesteR, thank you so much for all you\u0027ve done. Your game singlehandedly made me want to change my career course, my entire life. I haven\u0027t been here since the beginning, but it\u0027s been a very long time, since 0.11 I think. We\u0027re all going to miss you. Good luck on your future endeavors. \u003Cimg alt=\u0022;.;\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 title=\u0022;.;\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nEdit: Who\u0027s going to take your place as lead developer?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-30T19:24:36Z\u0022 title=\u002205/30/2016 07:24  PM\u0022 data-short=\u00228 yr\u0022\u003EMay 30, 2016\u003C/time\u003E by Gojira\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Sheppard","CreatedById":93282,"CreatedDateTime":"2016-05-30T19:25:14Z","Content":"\n\u003Cp\u003E\nThank you so much for the best game out there. Fun, fascinating, breathtaking, SMART! You have truly opened new doors in gaming and expanded our horizons!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022W6N6f0S.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/W6N6f0S.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Ippo","CreatedById":107018,"CreatedDateTime":"2016-05-30T19:26:43Z","Content":"\n\u003Cp\u003E\nDear Felipe,\n\u003C/p\u003E\n\u003Cp\u003E\nwe never met and you don\u0027t even know who I am. Yet you have been one of the most influential persons in my life. Finding KSP has literally changed my life in a number of ways, making me meet so many wonderful people and even making me able to pursue my dream job. I will miss you \u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThank you.\n\u003C/p\u003E\n\u003Cp\u003E\nMichele\n\u003C/p\u003E\n"},{"CreatedByName":"Frank_G","CreatedById":100000,"CreatedDateTime":"2016-05-30T19:28:42Z","Content":"\n\u003Cp\u003E\nWow, what sad news. I hope you leave in peace and with new stars on the horizon. Thank you so much for everything you did.\n\u003C/p\u003E\n\u003Cp\u003E\nBe seeing you in orbit one day!\n\u003C/p\u003E\n"},{"CreatedByName":"Waxing_Kibbous","CreatedById":151611,"CreatedDateTime":"2016-05-30T19:29:58Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/4-harvester/\u0026amp;do=hovercard\u0022 data-mentionid=\u00224\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/4-harvester/\u0022 rel=\u0022\u0022\u003E@HarvesteR\u003C/a\u003E Thanks for the great game, I can\u0027t wait to see what other ideas are burning a hole in your brain that you need to get out \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"ShadowZone","CreatedById":112420,"CreatedDateTime":"2016-05-30T19:42:25Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/4-harvester/\u0026amp;do=hovercard\u0022 data-mentionid=\u00224\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/4-harvester/\u0022 rel=\u0022\u0022\u003E@HarvesteR\u003C/a\u003E, thank you for your tenacity to get KSP developed. Your game got me invested for 2800 hours and counting and I regret not one second of it. It lets me be creative in a way I have not been able to before. If not for KSP I would never have been able to make a YouTube channel and get more than 18000 followers. More importantly: KSP renewed my love for space travel I had ever since I was a little boy. And it educated me more on orbital mechanics, aerodynamics and spacecraft engineering than any of the stuff I have ever done in my life.\n\u003C/p\u003E\n\u003Cp\u003E\nSo there is only one thing left to say: THANK YOU! And best of luck for your future. Take KSP as an example to never give up on a great idea!\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-30T19:42:46Z\u0022 title=\u002205/30/2016 07:42  PM\u0022 data-short=\u00228 yr\u0022\u003EMay 30, 2016\u003C/time\u003E by ShadowZone\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Draconiator","CreatedById":133772,"CreatedDateTime":"2016-05-30T19:44:21Z","Content":"\n\u003Cp\u003E\nFelipe, if you need a boost on your new game, whatever it is....we\u0027ll help ya.  Just call us.\n\u003C/p\u003E\n"},{"CreatedByName":"Gilbershaft","CreatedById":135806,"CreatedDateTime":"2016-05-30T19:46:51Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/4-harvester/\u0026amp;do=hovercard\u0022 data-mentionid=\u00224\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/4-harvester/\u0022 rel=\u0022\u0022\u003E@HarvesteR\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThere are no words to adequately express my appreciation for what you have built. KSP is not only hands down my favorite game ever made, it has also reignited my passion for all things space. Here are a few things that come to mind when I think about KSP ...\n\u003C/p\u003E\n\u003Cp\u003E\n- I have over 1k hours in KSP and I still haven\u0027t ran out of things to do! There are not many games you can put that much time into and still have content. \u003Cbr\u003E\n- KSP is more than just a game. Just take a look at all the work that \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/112650-dasvaldez/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022112650\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/112650-dasvaldez/\u0022 rel=\u0022\u0022\u003E@DasValdez\u003C/a\u003E is doing. Its an amazing tool for science outreach. \u003Cbr\u003E\n- The Kerbal community is easily the best community in all of gaming. \n\u003C/p\u003E\n\u003Cp\u003E\nSorry for my rambling thoughts but as I said, there are no words, so I will simply say thank you. \n\u003C/p\u003E\n\u003Cp\u003E\no7\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"DoToH","CreatedById":68428,"CreatedDateTime":"2016-05-30T19:50:37Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/4-harvester/\u0026amp;do=hovercard\u0022 data-mentionid=\u00224\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/4-harvester/\u0022 rel=\u0022\u0022\u003E@HarvesteR\u003C/a\u003E: obrigado, gracias, thank you.\n\u003C/p\u003E\n"},{"CreatedByName":"GagaX","CreatedById":57813,"CreatedDateTime":"2016-05-30T19:54:19Z","Content":"\n\u003Cp\u003E\nKSP universe is so much better than this one we are forced to live in in reality. Thanx for creating it.\n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2016-05-30T19:55:56Z","Content":"\n\u003Cp\u003E\nRelevant XKCD:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 src=\u0022http://imgs.xkcd.com/comics/orbital_mechanics.png\u0022 alt=\u0022orbital_mechanics.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"yorshee","CreatedById":135011,"CreatedDateTime":"2016-05-30T19:57:47Z","Content":"\n\u003Cp\u003E\nOh! This is unexpected..!\n\u003C/p\u003E\n\u003Cp\u003E\nThanks for all the hard work you\u0027ve put into KSP for the past 5 years, Felipe! I may not have been here from the beginning, but I\u0027ve seen what the game was like in its infancy, and even before that (all the way back to the original \u0027Kerbolog\u0027) and it\u0027s really inspiring to see how far it\u0027s come! A game about piloting spacecrafts with realistic orbital mechanics sounds tedious and boring, but you\u0027ve made it into a super-fun game! Heck, I can even confidently say that KSP is my favourite game of all time. No other game has captured my interest for so long and even after playing it for a year and a half I\u0027m still finding new things to do in it and the KSP community is one of the best I\u0027ve ever been in and I\u0027m glad I\u0027m a part of it.\n\u003C/p\u003E\n\u003Cp\u003E\nGood luck with the future! I\u0027m sure any newgames you create will be just as unique and fun! \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E  Again, thank you!\n\u003C/p\u003E\n"},{"CreatedByName":"Moose Rocket Science","CreatedById":159931,"CreatedDateTime":"2016-05-30T20:00:07Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222608210\u0022 data-ipsquote-contentid=\u0022140824\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221464627954\u0022 data-ipsquote-userid=\u00224\u0022 data-ipsquote-username=\u0022HarvesteR\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, HarvesteR said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHi,\n\u003C/p\u003E\n\u003Cp\u003E\nThere’s no good way to ease into news like this, so here it is: I’m stepping down as Lead Developer of KSP.\n\u003C/p\u003E\n\u003Cp\u003E\nFor the last five and a half years, I put all my work, my thoughts and my time into KSP. I’ve watched it grow from this little unassuming idea for a 2D game in which you’d put together rocket parts to see how high you could get, into a complete spaceflight simulator, a space agency tycoon, a planetarium of truly astronomical scale, a home for little green men and their space program, a Kerbal space program.\n\u003C/p\u003E\n\u003Cp\u003E\nKSP has become far more than the game I imagined half a decade ago. When we first set out to take on this project, I could not have expected anything even remotely close to what it ended up becoming. To say KSP surpassed my every expectation would be, at best, a colossal understatement.\n\u003C/p\u003E\n\u003Cp\u003E\nThere was a time, years ago, when any single design decision of mine had the power to drastically change the direction of the project. There was the danger that by even moving ahead on development of one area instead of another, the entire feel of the game, the intent it carried, could be morphed into something else. There was a fine line we needed to stay on, lest we let the project slip and become something other than what we intended. That is no longer the case, and that’s a very good thing. It means that conceptually, the game is complete.\n\u003C/p\u003E\n\u003Cp\u003E\nThis isn’t to say KSP’s development is complete, however. Far from it. Plans for KSP reach far into the future, and there are enough ideas to keep us all going for years. The console versions are coming up, there are new updates in development, the list goes on. For myself, however, I desperately need to have something new, to create more than one game in my life.\n\u003C/p\u003E\n\u003Cp\u003E\nI need to make one thing perfectly clear: development on KSP will continue as always. No features, upgrades, bugfixes or anything of the sort are being discontinued because of my leaving.\n\u003C/p\u003E\n\u003Cp\u003E\nThis I say with absolute confidence, because I have complete trust in every member of the KSP team, and I know they are fully capable of handling anything that comes their way.\n\u003C/p\u003E\n\u003Cp\u003E\nThe KSP team deserves more praise than I can give them. This is a band of outstanding people, all brilliant and excellent at what they do, never tiring, never doing anything less than their best. I’m very proud of what we have accomplished together. It’s something I’ll carry with me for ever. I also know beyond any question that KSP would not have become what it is without every single one of them. I am forever grateful and in awe of all the work they put in.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd of course, I must give all my thanks to the founders at Squad, Ezequiel and Adrian, who took this wild leap of faith with me, putting their unconditional trust in me without ever requiring any failsafes or guarantees of success. We all know games are a notoriously risky proposition in the best of times, and they nonetheless extended their full support to me, at a time when none could tell what lay ahead.\n\u003C/p\u003E\n\u003Cp\u003E\nLastly, but most certainly not least, I have to thank every single one of you, the community, our players, kerbalnauts, space enthusiasts, reckless rocket engineers, our friends. All of you, who like us, believed in our weird little game and supported us throughout the years with your ever-inspired ideas, your unparalleled willingness to help, your relentless honesty and your unfailing loyalty. I cannot thank you enough for all of it, and I can only hope I am so lucky to see you again in whatever comes next.\n\u003C/p\u003E\n\u003Cp\u003E\nThis isn’t goodbye. It’s just farewell for now. In the meantime, however, I hope you all enjoy playing KSP as much as I enjoyed being part of its making.\n\u003C/p\u003E\n\u003Cp\u003E\nSigning off,\n\u003C/p\u003E\n\u003Cp\u003E\nFelipe Falanghe, aka HarvesteR\n\u003C/p\u003E\n\u003Cimg alt=\u0022image\u0022 src=\u0022https://67.media.tumblr.com/35128d94ad338ee594e25e719a48b7e1/tumblr_inline_o8031yfIhc1rr2wit_540.png\u0022\u003E\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nFarewell Felipe, I hope You do well.\n\u003C/p\u003E\n"},{"CreatedByName":"justspace103","CreatedById":64088,"CreatedDateTime":"2016-05-30T20:02:13Z","Content":"\n\u003Cp\u003E\nFarewell Felipe!\n\u003C/p\u003E\n\u003Cp\u003E\nyour game means the world to me! Thank you for creating the only game in which i never get bored of playing!\n\u003C/p\u003E\n\u003Cp\u003E\nGood luck!\n\u003C/p\u003E\n\u003Cp\u003E\n-Justspace103\n\u003C/p\u003E\n"},{"CreatedByName":"Civ_Kerman","CreatedById":164989,"CreatedDateTime":"2016-05-30T20:02:26Z","Content":"\n\u003Cp\u003E\nDear Felipe,\n\u003C/p\u003E\n\u003Cp\u003E\nIt has been an honor having you over the past few years as a lead director of Kerbal Space Program. What I truly think of KSP is that not only it is a mindblowing, simple, yet fun gaming experience, KSP has been a general game changer in the gaming industry as well.\n\u003C/p\u003E\n\u003Cp\u003E\nSince practically 2011 (ever since the popular Minecraft was released by Mojang), there has been usually a bad taste in early-access games in general. But, there is this just one game that blew everyone off their launchpad: Kerbal Space Program. From a small company based in Mexico, KSP has been such a journey ever since Alpha, from the time we, the players, had first figured out how to make a rocket to now in which we can control a mass space enterprise in .90 and 1.0...it has been a journey and I salute you.\n\u003C/p\u003E\n"},{"CreatedByName":"Thomassino","CreatedById":137899,"CreatedDateTime":"2016-05-30T20:07:05Z","Content":"\n\u003Cp\u003E\nOh KSP. I still remember the coincidence I stumbled upon it. It had NOTHING to do with science or spaceflight. Now, around 2 years later, I can tell you off hand how SSME fuel system works, its ISP, nozzle expansion ratio etc. KSP changed my life and I\u0027m so immensely grateful to all people who are in Squad for developing this awesome game, but my special thanks belongs to Felipe, he is the man who came up with the idea of little green men eagerly conquering space.\n\u003C/p\u003E\n\u003Cp\u003E\nSo again, thanks Felipe and good luck on your next projects. I\u0027m sure they\u0027ll be as good, if not even better than KSP itself.\n\u003C/p\u003E\n"},{"CreatedByName":"adson","CreatedById":99024,"CreatedDateTime":"2016-05-30T20:14:40Z","Content":"\n\u003Cp\u003E\nThank you for a wonderful game, \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/4-harvester/\u0026amp;do=hovercard\u0022 data-mentionid=\u00224\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/4-harvester/\u0022 rel=\u0022\u0022\u003E@HarvesteR\u003C/a\u003E, and the best wishes for the future!\n\u003C/p\u003E\n"},{"CreatedByName":"soulsource","CreatedById":110576,"CreatedDateTime":"2016-05-30T20:16:38Z","Content":"\n\u003Cp\u003E\nWow. I didn\u0027t see that coming. You were kind of a fixed-star on the sky of KSP, and somehow I was just expecting you to continue working on the project as lead developer until it reaches end of life...\u003Cbr\u003E\nFrom a real-world perspective it of course makes sense to move on, now that KSP has reached maturity.\n\u003C/p\u003E\n\u003Cp\u003E\nThank you very much for all the dedication you put into KSP. Also my life has been changed by this game. As some on this forum certainly know, I\u0027ve been studying physics, and earned a PhD in that field last year. Still, KSP fascinated me in a way that made me want to create something similar. Felipe, you can officially claim that your idea, KSP, was one of the major influences that me pursue a career as indie game developer.\u003Cbr\u003E\n(Don\u0027t worry, the project I work on is not a KSP clone, the only thing it has in common with KSP is that it has spaceships.)\n\u003C/p\u003E\n\u003Cp\u003E\nI think it\u0027s safe to assume that the whole KSP community is looking forward to hear from you, whenever you consider it the right time to reveal your next project. I wish you good luck with whatever it may be.\n\u003C/p\u003E\n"},{"CreatedByName":"Ozymandias_the_Goat","CreatedById":159377,"CreatedDateTime":"2016-05-30T20:17:37Z","Content":"\n\u003Cp\u003E\nThank you so much for this game. I just learned so much from it. Sad to see you go\u003Cimg alt=\u0022;.;\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 title=\u0022;.;\u0022\u003E, and good luck on whatever you do next.\n\u003C/p\u003E\n"},{"CreatedByName":"AlexisBV","CreatedById":81911,"CreatedDateTime":"2016-05-30T20:28:49Z","Content":"\n\u003Cp\u003E\nI wish there was a way to measure this, but I\u0027m sure KSP has a significant role in the resurgence of interest for space exploration. Yes, in the same league as recent SpaceX achievements.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThanks Felipe (and all the KSP team) for creating a life-changing eye-opening work of art.\n\u003C/p\u003E\n"},{"CreatedByName":"Daeridanii","CreatedById":157101,"CreatedDateTime":"2016-05-30T20:29:11Z","Content":"\n\u003Cp\u003E\n\u003Cfont face=\u0022verdana, geneva, sans-serif\u0022\u003EI haven\u0027t played KSP for long, but it has been a thoroughly enjoyable (and educational) experience. Such work is rare and deserving of thanks. So farewell, and good luck.\u003C/font\u003E\n\u003C/p\u003E\n"}]}