{"TopicId":140965,"ForumId":44,"TopicTitle":"Fermi Paradox","CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-06-01T18:23:36Z","PageNum":5,"Articles":[{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2016-06-05T19:14:33Z","Content":"\n\u003Cp\u003E\nYes, perhaps I read too much into it... but it also served a point I wanted to make, that we don\u0027t know what role stuff like glycine played in the emergence of life, and thus I though it was important to point out that in the lab we\u0027re quite close to a self replicating RNA molecule... no proteins involved... so one shouldn\u0027t read much of anything into glycine in space\n\u003C/p\u003E\n"},{"CreatedByName":"rtxoff","CreatedById":107622,"CreatedDateTime":"2016-06-05T21:36:08Z","Content":"\n\u003Cp\u003E\nHow conceited someone has to be to think that Earth is the only place in the Universe that can support sentient life? It\u0027s as good as believing in an omnipotent being that created us all and the best thing about it i don\u0027t need no data for it.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-05T21:42:13Z\u0022 title=\u002206/05/2016 09:42  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 5, 2016\u003C/time\u003E by gpisic\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2016-06-05T23:00:42Z","Content":"\n\u003Cp\u003E\nI dont think anyone argues that the entire universe can\u0027t support sentient life.\n\u003C/p\u003E\n\u003Cp\u003E\nJust that its not as common as they were thinking it would be when they formed SETI... and interstellar travel is really really hard.\n\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2016-06-06T07:08:54Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222618082\u0022 data-ipsquote-contentid=\u0022140965\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221465162568\u0022 data-ipsquote-userid=\u0022107622\u0022 data-ipsquote-username=\u0022gpisic\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 hours ago, gpisic said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHow conceited someone has to be to think that Earth is the only place in the Universe that can support sentient life? It\u0027s as good as believing in an omnipotent being that created us all and the best thing about it i don\u0027t need no data for it.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWe really don\u0027t have any clue one way or the other. We simply don\u0027t have enough samples to conclude either way.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Green Baron","CreatedById":107381,"CreatedDateTime":"2016-06-06T07:21:24Z","Content":"\n\u003Cp\u003E\nFor many people their belief is the only thing they have, i don\u0027t judge that. I for example \u0022believe\u0022 that microbial life is \u0022no big deal\u0022 given enough time in the right places under the right conditions, PB666 thinks it is. I have no hard data to support my \u0022belief\u0022. Problems arise when \u0022belief\u0022 is presented as \u0022scientific finding\u0022, as a fact that implicitly everyone else has to adopt.\n\u003C/p\u003E\n\u003Cp\u003E\nComing to science: as far as palaeontology is concerned nobody has enough data to \u003Cs\u003Esupport any hypothesis\u003C/s\u003E tell us about the probabilities of life-forming.There is a very nebulous basis about chemical elements (firewater, earth and air you know :-) and temperature and that radiation should not be too high plus some basic thoughts about what happened on earth once basic life had emerged (well, a fossil record).\n\u003C/p\u003E\n\u003Cp\u003E\nThe fermi paradox or drake equation is a nice party/forum-play and that\u0027s it.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nRight now interstellar travel is a fiction, and it may remain so given the distances and the constraints.\n\u003C/p\u003E\n\u003Cp\u003E\nEdit: ninja\u0027d by \u003Cspan\u003E@\u003C/span\u003ENibb31\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-06T07:30:40Z\u0022 title=\u002206/06/2016 07:30  AM\u0022 data-short=\u00228 yr\u0022\u003EJune 6, 2016\u003C/time\u003E by Green Baron\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"rtxoff","CreatedById":107622,"CreatedDateTime":"2016-06-06T09:20:37Z","Content":"\n\u003Cp\u003E\nI have no problem someone saying \u0022We have no clue if there is live out there\u0022, it is a perfectly valid statement. But i have a problem with someone saying there is no live out there because we have no data on it. It is completely wrong in every way, scientifically and logically. It\u0027s no shame to admit we do not know something, but it\u0027s a shame claiming something doesn\u0027t exist because we didn\u0027t detected it yet. As a scientist you have to be open minded for every possibility even that one that there is an omnipotent being that created us all (just think of the simulated universe scenario, someone created it on a super computer and the creator might be something as our omnipotent being).\u003Cbr\u003E\nRegarding the Fermi Paradox, because we don\u0027t really have the means detecting live on exoplanets this paradox can\u0027t be solved by our actual technology it\u0027s more of a philosophical question that can give us something to think about and lead us to many possibilities regarding our existence but one thing i am sure of, the Fermi Paradox can\u0027t answer us the question \u0022Are we alone?\u0022\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-06T09:21:28Z\u0022 title=\u002206/06/2016 09:21  AM\u0022 data-short=\u00228 yr\u0022\u003EJune 6, 2016\u003C/time\u003E by gpisic\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-06-07T15:44:14Z","Content":"\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.cfa.harvard.edu/news/2016-12\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.cfa.harvard.edu/news/2016-12\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Green Baron","CreatedById":107381,"CreatedDateTime":"2016-06-07T16:25:45Z","Content":"\n\u003Cp\u003E\nThanx. Well, it\u0027s not a new idea that life elsewhere is most probably carbon-based, given that carbon is quite abundant and quite reactive. I will not speculate about silicate or sulfur based \u0022life\u0022-forms.\n\u003C/p\u003E\n\u003Cp\u003E\nBuuuut :-) ... the following evolution, change in atmospheric gases, keeping a planets surface temp around 15°C for 4 billion years (interruptions to the cold side neglected), oxygen, iron, highly reactive metabolism, control loops between different environmental reservoirs for carbon (temperature) and other elements, plate-tectonics to renew surface material, magnetic field to shield from radiation, relatively quiet cosmic neighborhood, that sort of things is (imo) what forms the basis for a \u0022successful\u0022 evolution to, well, more or less intelligent beings :-)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-06-07T18:10:26Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222620698\u0022 data-ipsquote-contentid=\u0022140965\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221465316745\u0022 data-ipsquote-userid=\u0022107381\u0022 data-ipsquote-username=\u0022Green Baron\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Green Baron said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThanx. Well, it\u0027s not a new idea that life elsewhere is most probably carbon-based, given that carbon is quite abundant and quite reactive. I will not speculate about silicate or sulfur based \u0022life\u0022-forms.\n\u003C/p\u003E\n\u003Cp\u003E\nBuuuut :-) ... the following evolution, change in atmospheric gases, keeping a planets surface temp around 15°C for 4 billion years (interruptions to the cold side neglected), oxygen, iron, highly reactive metabolism, control loops between different environmental reservoirs for carbon (temperature) and other elements, plate-tectonics to renew surface material, magnetic field to shield from radiation, relatively quiet cosmic neighborhood, that sort of things is (imo) what forms the basis for a \u0022successful\u0022 evolution to, well, more or less intelligent beings :-)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nFirst generation of stars largely produce second row elements, like carbon, oxygen, nitorgen. \n\u003C/p\u003E\n\u003Cp\u003E\nBut  carbon is the only one that easily produces self homo- polymers in order to form its outer sell electrons. Consequently it would have a space preference for dust not gas phase, where oxygen has a prefenec for CO2. \n\u003C/p\u003E\n\u003Cp\u003E\nThus carbon cored worlds could exist, but we have seen no evidence. I have a different opinion, it might not be popular but i think you need, heavy iorn production to have the diversity of elements that favor life. Carbon richness favors tar formation, not life. As a consequence i think life comes late to our galaxy and generations of stars die before the conditions are ripe. \n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2016-06-08T11:02:13Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222620833\u0022 data-ipsquote-contentid=\u0022140965\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221465323026\u0022 data-ipsquote-userid=\u0022107380\u0022 data-ipsquote-username=\u0022PB666\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n16 hours ago, PB666 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nCarbon richness favors tar formation, not life.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhere carbon is, also much CO\u003Csub\u003E2\u003C/sub\u003E should be (just because there is plenty of O and because life likes O, otherwise this planet is not life-friendly in any case).\u003Cbr\u003E\nSo, if a carbon planet is enough warm to support life, i.e. near the star, it should be surrounded by thick CO\u003Csub\u003E2\u003C/sub\u003E atmosphere.\u003Cbr\u003E\nAnd the greenhouse effect and coal-like albedo would quickly turn this bitum into boiling bitum and all this planet — into a giant rectification column, before the hydrocarbons were cracked, hydrogen dissipated in space, and the planet was covered with red hot carbon layer .\n\u003C/p\u003E\n"},{"CreatedByName":"Plusck","CreatedById":153264,"CreatedDateTime":"2016-06-09T21:47:49Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222617653\u0022 data-ipsquote-contentid=\u0022140965\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221465143387\u0022 data-ipsquote-userid=\u0022107381\u0022 data-ipsquote-username=\u0022Green Baron\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 05/06/2016 at 6:16 PM, Green Baron said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\ntrying to get back to the Fermi Paradox:\n\u003C/p\u003E\n\u003Cp\u003E\n- the chemical basis for life(tm) is not rare in the universe (do we agree on that ?)\n\u003C/p\u003E\n\u003Cp\u003E\n- the emergence of microbial life is no big deal, given a few hundred million years and reasonable conditions (liquid water, not too hard radiation, stable environment) (agreed ?)\n\u003C/p\u003E\n\u003Cp\u003E\n- the further development of ecosystems is another thing: it took the earth \u0026gt;3 billion years from microbes to the ediacaran. What about nearby radiation events like supernovae, gamma ray bursts ? A highly active sun ? Would they reset the process ? I don\u0027t know, probably not. Our neighbor stars have a similar history as the sun, the cluster the sun formed in is highly dispersed. Should we look for stars with a similar history (path around the galaxy\u0027s center) ?\n\u003C/p\u003E\n\u003Cp\u003E\n- after the forming of complex ecosystems the development took on speed and diversity, and quickly recovered after several extinction events. Evolution is quite effective once it starts. Is that repeatable elsewhere ?\n\u003C/p\u003E\n\u003Cp\u003E\n- to support a big brain the body needs a lot of spare energy. No species developed such a \u0022useless\u0022 mass before. But without that brain we wouldn\u0027t ask ourselves why our landing legs explode. Is it likely that there is a similar development elsewhere, is it an outcome of evolution or just an incident (they happen) ?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWas trying to avoid a wall of text. To make it even shorter: i don\u0027t think we can solve the problem until positive discovery (edit), because the development of a more or less intelligent species able to communicate was a succession / development (gimmi the right word) and i don\u0027t even faintly know the probabilities for any of the steps involved being successful.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nI mostly agree with this, which is why the Fermi Paradox doesn\u0027t bother me much. The only one that I\u0027m not all that sure about is your second point - microbial life may well be a big deal and need a lot longer than a few hundred million years, so it may be that we just got lucky there.\n\u003C/p\u003E\n\u003Cp\u003E\nGetting from microbial to large fauna is a much bigger deal. Maybe we got lucky there too (so we\u0027re locally one of the first) or maybe we were unlucky and it could have happened within another few hundred million years (meaning that we are 2 billion years late on the local intelligent life scene).\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, I\u0027m pretty sold on the idea that we needed a relatively stable galaxy with very few supernovae to survive. Observed evidence seems to suggest that our galaxy is relatively quiet now, much quieter than the time our solar system formed with all those convenient heavy elements and also quieter than what we seen in the past in more distant galaxies. Having the planet scoured by gamma radiation every half billion years or so might not destroy any possibility of life, but would certainly make much of our evolutionary history impossible. Once again, that does tend to suggest that we could be \u0022early\u0022 on the intelligent-civilisation-on-rocky-planet scene: our sun formed in a cloud of relatively heavy elements just as the supernovae that made them were going out of style.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd the heavy-element situation is another crucial factor: if we hadn\u0027t had all that copper and iron lying around at our feet, would we ever have built machines and, eventually, a radio? \n\u003C/p\u003E\n\u003Cp\u003E\nAll in all, the history of intelligent life on this planet shows that there was an significant element of chance in the fact that we got this civilization going at all. Apparently (so I\u0027ve read) if we were to bomb ourselves back into the stone ages now, future generations would never have the ready resources they\u0027d need to do another industrial revolution and get back out to space.\n\u003C/p\u003E\n\u003Cp\u003E\nSo before getting any further on the question of being able to see signs of non-earth civilisations, there\u0027s plenty of reason to think that there aren\u0027t any close to us.\n\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-06-09T22:12:29Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222624388\u0022 data-ipsquote-contentid=\u0022140965\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221465508869\u0022 data-ipsquote-userid=\u0022153264\u0022 data-ipsquote-username=\u0022Plusck\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n21 minutes ago, Plusck said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAll in all, the history of intelligent life on this planet shows that there was an significant element of chance in the fact that we got this civilization going at all. Apparently (so I\u0027ve read) if we were to bomb ourselves back into the stone ages now, future generations would never have the ready resources they\u0027d need to do another industrial revolution and get back out to space.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nGiven that the knowledge base to build solar panels and wind turbines we could creep back up, but a whole lot of superfluous activities of society would have to be curtailed. BTW there\u0027s a hell of alot of coal left still in the ground (scary how much CO2 we could put int the ATM if we wanted to). And still a whole friggen lot of pre-biotic CH4 buried way down deep in the earths crust that can be extracted.\n\u003C/p\u003E\n"},{"CreatedByName":"Plusck","CreatedById":153264,"CreatedDateTime":"2016-06-09T23:12:58Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222624416\u0022 data-ipsquote-contentid=\u0022140965\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221465510349\u0022 data-ipsquote-userid=\u0022107380\u0022 data-ipsquote-username=\u0022PB666\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n47 minutes ago, PB666 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nGiven that the knowledge base to build solar panels and wind turbines we could creep back up, but a whole lot of superfluous activities of society would have to be curtailed. BTW there\u0027s a hell of alot of coal left still in the ground (scary how much CO2 we could put int the ATM if we wanted to). And still a whole friggen lot of pre-biotic CH4 buried way down deep in the earths crust that can be extracted.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNo, I mean really \u0022bombed back into the stone age\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nIf we kept our libraries and suchlike, sure, a couple of generations later we would be back up and running.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever in a post-apocalyptic setting, where remaining populations only survive by staying very far away from all of the irradiated cities for a few millennia, the existing mines would all collapse, our steel would rust and be washed out to sea, and virtually all of the remaining copper, coal, iron and oil deposits would be far too deep or too small to sustain an industrial revolution that would get us the tools and knowledge to get at all the deeper stuff again.\n\u003C/p\u003E\n\u003Cp\u003E\nIn that setting, it would take a very dedicated cult of warrior-monks to maintain enough knowledge to kickstart a recovery thousands of years down the line.\n\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-06-09T23:36:52Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222624463\u0022 data-ipsquote-contentid=\u0022140965\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221465513978\u0022 data-ipsquote-userid=\u0022153264\u0022 data-ipsquote-username=\u0022Plusck\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n18 minutes ago, Plusck said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNo, I mean really \u0022bombed back into the stone age\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nIf we kept our libraries and suchlike, sure, a couple of generations later we would be back up and running.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever in a post-apocalyptic setting, where remaining populations only survive by staying very far away from all of the irradiated cities for a few millennia, the existing mines would all collapse, our steel would rust and be washed out to sea, and virtually all of the remaining copper, coal, iron and oil deposits would be far too deep or too small to sustain an industrial revolution that would get us the tools and knowledge to get at all the deeper stuff again.\n\u003C/p\u003E\n\u003Cp\u003E\nIn that setting, it would take a very dedicated cult of warrior-monks to maintain enough knowledge to kickstart a recovery thousands of years down the line.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nKnowledge is pretty insideous, its not easy to kill off the old engineers who build the factories and the equipment. \n\u003C/p\u003E\n\u003Cp\u003E\nThe most dangerous weapon to humans is not technology, its ignorance, and the problem with ignorance in the long run is that it has a semi-targeted self-destructive effect.  The keepers of the technology are thus a semi-protected from the danger. What we learn in the modern ages that the technological war starters often end up on the losing end of the stick, maybe not immediately but in the long run. \n\u003C/p\u003E\n"},{"CreatedByName":"Green Baron","CreatedById":107381,"CreatedDateTime":"2016-06-10T12:03:02Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222624388\u0022 data-ipsquote-contentid=\u0022140965\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221465508869\u0022 data-ipsquote-userid=\u0022153264\u0022 data-ipsquote-username=\u0022Plusck\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n14 hours ago, Plusck said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nHowever, I\u0027m pretty sold on the idea that we needed a relatively stable galaxy with very few supernovae to survive. Observed evidence seems to suggest that our galaxy is relatively quiet now, much quieter than the time our solar system formed with all those convenient heavy elements and also quieter than what we seen in the past in more distant galaxies. Having the planet scoured by gamma radiation every half billion years or so might not destroy any possibility of life, but would certainly make much of our evolutionary history impossible. Once again, that does tend to suggest that we could be \u0022early\u0022 on the intelligent-civilisation-on-rocky-planet scene: our sun formed in a cloud of relatively heavy elements just as the supernovae that made them were going out of style.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI must say that find the idea \u0022we are early\u0022 and the implications of large distances between potential civilizations intriguing. The earlier a civilization, the more it sees from the surrounding universe. In an expanding an cooling universe the later they come, the more heavy elements they will have but the less they will see from their surrounding and the greater the distances will be.\n\u003C/p\u003E\n\u003Cp\u003E\nEinstein would be very sad about that ...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-10T12:04:13Z\u0022 title=\u002206/10/2016 12:04  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 10, 2016\u003C/time\u003E by Green Baron\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-06-10T16:54:55Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222625041\u0022 data-ipsquote-contentid=\u0022140965\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221465560182\u0022 data-ipsquote-userid=\u0022107381\u0022 data-ipsquote-username=\u0022Green Baron\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Green Baron said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI must say that find the idea \u0022we are early\u0022 and the implications of large distances between potential civilizations intriguing. The earlier a civilization, the more it sees from the surrounding universe. In an expanding an cooling universe the later they come, the more heavy elements they will have but the less they will see from their surrounding and the greater the distances will be.\n\u003C/p\u003E\n\u003Cp\u003E\nEinstein would be very sad about that ...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nEarly galaxies are formed with hydrogen, deuterium and some helium and traces of lithium. Of particularly note with fewer nucleating substances the differential local density of gas needs to be higher to initiate star formation, this then results in larger first generation (blue) stars that end their lives as supernova the largest of these in a galaxy is usually the nucleus for the GBH. You wont find yellow stars in these new galaxies. As the number of polyvalent cations and anions increase in space, so does the ability to aggregate matter into clumps, clumps form comets, in the deep coldness of space they aggregate and once the mass is sufficient they retain hydrogen and begin to form stars with lower surrounding densities of hydrogen. This allows the formation of yellow stars and red dwarfs. This process is relatively accelerated as galaxies merge and the disequilibrium causes a rapid increase in the size of the GBH. The friction and spiraling created by the GBH results in the production of powerful X-rays by the plasma reaching relativistic speeds as the gas spirals into the hole. The poles of the rotation produce large amounts of X-rays that blast hydrogen out of the galaxy as it approaches the GBH. First small amounts, but as the hydrogen hole increases, the remaining gas flattens into a disk and the X-rays are capable of purging a larger volume further away from the center. This then suppresses star formation and preferential to red and brown dwarf formation. Such galaxies appear with more red stars.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"rtxoff","CreatedById":107622,"CreatedDateTime":"2016-06-13T20:03:01Z","Content":"\n\u003Cp\u003E\nYes there have been aliens: \u003Ca href=\u0022http://www.nytimes.com/2016/06/12/opinion/sunday/yes-there-have-been-aliens.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.nytimes.com/2016/06/12/opinion/sunday/yes-there-have-been-aliens.html\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Plusck","CreatedById":153264,"CreatedDateTime":"2016-06-14T07:33:30Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222629468\u0022 data-ipsquote-contentid=\u0022140965\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221465848181\u0022 data-ipsquote-userid=\u0022107622\u0022 data-ipsquote-username=\u0022gpisic\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 hours ago, gpisic said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYes there have been aliens: \u003Ca href=\u0022http://www.nytimes.com/2016/06/12/opinion/sunday/yes-there-have-been-aliens.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.nytimes.com/2016/06/12/opinion/sunday/yes-there-have-been-aliens.html\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe problem with that is it doesn\u0027t address any of the issues raised in this thread.\n\u003C/p\u003E\n\u003Cp\u003E\nCutting through the verbiage, \u003Cem\u003E\u003Cu\u003Eall that that article says is that we have an extremely large number of planets on which life \u003Cstrong\u003Emight\u003C/strong\u003E start\u003C/u\u003E\u003C/em\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nThat\u0027s it. I have no particular reason to belittle the authors or their work, and their contribution certainly helps to refine the debate, but they are essentially just putting a number to what the general consensus appears to be anyway: \u003Cu\u003E\u003Cem\u003Elots\u003C/em\u003E\u003C/u\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nThe second part of the paper jumps straight past the next three huge barriers - probability of life, then probability of intelligent life, then probability that intelligent life becomes a technological civilisation - before simply feeding their numbers for habitable-zone planets into the equation.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd the final reason why I don\u0027t consider that the paper answers any real question about extraterrestrial life is that it utterly fails to consider the universe to be a changing place. But then again that is a problem with the Drake equation to start with.\n\u003C/p\u003E\n\u003Cp\u003E\nIn fact, the Drake equation needs another two factors:\n\u003C/p\u003E\n\u003Col\u003E\u003Cli\u003E\nprobability that the planet will remain in the habitable zone for long enough for a technological civilisation to develop. It took us slightly longer than 4 billion years to get here. How many solar systems last for significantly less than 4 billion years? It wouldn\u0027t take all that much more mass in our sun for our planet to be virtually dead by now (\u003Ca href=\u0022https://en.wikipedia.org/wiki/Stellar_evolution\u0022 rel=\u0022external nofollow\u0022\u003Ewith 1.5 solar masses, main sequence lasts 3 billion years...\u003C/a\u003E). The Drake equation assumes that any given planet in the habitable zone now will have a given probability of developing a civilization, but if you add a dynamic element it should state the probability that a civilization will develop \u003Cem\u003Ein the time that the planet will remain in the habitable zone\u003C/em\u003E. The worst thing about the paper is that they even consider the argument that we should be looking at sun-like stars (in the single footnote to the article) before then saying \u0022nah, sod that, we don\u0027t care\u0022... basically invalidating their own figures before they start.\n\u003C/li\u003E\n\u003Cli\u003E\nprobability that the planet is safe from total disaster for the time required to develop a civilisation. Again, the Drake equation doesn\u0027t take cosmological cataclysm into account. If you have supernovas going on in the neighbourhood every couple of billion years, then your chances of getting intelligent life (assuming our timeline is relatively standard) is precisely zero. A slight increase in frequency of comet strikes would also have ensured our non-existence today, therefore probability zero for civilisation. And Earth would still have been sitting happily in the habitable zone for billions of years.\n\u003C/li\u003E\n\u003C/ol\u003E\u003Cp\u003E\nSo sure, if you assume that all exoplanets are happily orbiting stars with around 1 solar mass or less, and have always been doing so, and don\u0027t have suffer any life-destroying pressures in their vicinity, then you could say that we are very unlikely to be first. But those assumptions are demonstrably false to start with.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd finally, there\u0027s the fallacy of conflating very high probabilty with certainty. Someone somewhere had to be first, and what, pray tell, was the probability that they were alone (using exactly the same methodology as the paper) when that actually happened?\n\u003C/p\u003E\n"},{"CreatedByName":"Green Baron","CreatedById":107381,"CreatedDateTime":"2016-06-14T07:59:24Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222630122\u0022 data-ipsquote-contentid=\u0022140965\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221465889610\u0022 data-ipsquote-userid=\u0022153264\u0022 data-ipsquote-username=\u0022Plusck\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n12 minutes ago, Plusck said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThat\u0027s it. I have no particular reason to belittle the authors or their work, and their contribution certainly helps to refine the debate, but they are essentially just putting a number to what the general consensus appears to be anyway: \u003Cu\u003E\u003Cem\u003Elots\u003C/em\u003E\u003C/u\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat was what i thought too. \u0022Oh no, not again the Drake equation\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nThe drake equation is based on assumptions of the 50s in a time of space fantasies and exorbitant space programs. It did its job by luring people into donations for a search program. It\u0027s not even an equation because the left value is a variable, so in most cases it is used by adjusting the right side in order to meet a desired \u0022lvalue\u0022 ...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-06-14T16:10:19Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222630122\u0022 data-ipsquote-contentid=\u0022140965\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221465889610\u0022 data-ipsquote-userid=\u0022153264\u0022 data-ipsquote-username=\u0022Plusck\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, Plusck said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe problem with that is it doesn\u0027t address any of the issues raised in this thread.\n\u003C/p\u003E\n\u003Cp\u003E\nCutting through the verbiage, \u003Cem\u003E\u003Cu\u003Eall that that article says is that we have an extremely large number of planets on which life \u003Cstrong\u003Emight\u003C/strong\u003E start\u003C/u\u003E\u003C/em\u003E.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBut that is all this line of propaganda ever brings forth, alot of implicit wording with vacuous support of. \n\u003C/p\u003E\n\u003Cp\u003E\nAnd more importantly to me, the more I hear these excremental arguments, the more I believe the reverse is true, that life is exceedingly rare. The kepler selected planets that get the focus are those that fit the criteria, planets more than a certain distance from their star (such as in the Pluto range) are exceedingly difficult to see because the probability that they transect goes down with distance because the angular of deviation from the line of site increases distance in and above the width of the star with distance.\n\u003C/p\u003E\n\u003Cp\u003E\nThus they are getting better of looking for earth like planets, but the evidences of Earths is becoming less and less probable. Which puts me into a defensible logical circumstance of not believing any of what the proponents say until they prove it.\n\u003C/p\u003E\n\u003Cp\u003E\nAlot of people are over enthusiatic about life\u0027s potential, we see this again in the thread about Titan. They are putting all sense and good science aside to support the enthusiam but they are proporting existence of life, where on Earth, nothing lives except in a dormant or cyst state, placing everything we know about organic chemistry aside to support non-existent special chemistry. Since I know the proponents will not look the articles up . . . . .\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAm Nat. 2016 Jan;187(1):1-18. doi: 10.1086/684193. Speciation, Ecological Opportunity, and Latitude (American Society of Naturalists Address).\u003Cbr\u003E\nEvolutionary hypotheses to explain the greater numbers of species in the tropics than the temperate zone include greater age and area, higher temperature and metabolic rates, and greater ecological opportunity. These ideas make contrasting predictions about the relationship between speciation processes and latitude, which I elaborate and evaluate. Available data suggest that per capita speciation rates are currently highest in the temperate zone and that diversification rates (speciation minus extinction) are similar between latitudes. In contrast, clades whose oldest analyzed dates precede the Eocene thermal maximum, when the extent of the tropics was much greater than today, tend to show highest speciation and diversification rates in the tropics. These findings are consistent with age and area, which is alone among hypotheses in predicting a time trend. Higher recent speciation rates in the temperate zone than the tropics suggest an additional response to high ecological opportunity associated with low species diversity. These broad patterns are compelling but provide limited insights into underlying mechanisms, arguing that studies of speciation processes along the latitudinal gradient will be vital. Using threespine stickleback in depauperate northern lakes as an example, I show how high ecological opportunity can lead to rapid speciation. The results support a role for ecological opportunity in speciation, but its importance in the evolution of the latitudinal gradient remains uncertain. I conclude that per capita evolutionary rates are no longer higher in the tropics than the temperate zone. Nevertheless, the vast numbers of species that have already accumulated in the tropics ensure that total rate of species production remains highest there. Thus, tropical evolutionary momentum helps to perpetuate the steep latitudinal biodiversity gradient. 26814593\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nPLoS Biol. 2014 Jan 28;12(1):e1001775. doi: 10.1371/journal.pbio.1001775. eCollection 2014. Faster speciation and reduced extinction in the tropics contribute to the Mammalian latitudinal diversity gradient. Rolland J1, Condamine FL2, Jiguet F3, Morlon H2. Author information\u003Cbr\u003E\nThe increase in species richness from the poles to the tropics, referred to as the latitudinal diversity gradient, is one of the most ubiquitous biodiversity patterns in the natural world. Although understanding how rates of speciation and extinction vary with latitude is central to explaining this pattern, such analyses have been impeded by the difficulty of estimating diversification rates associated with specific geographic locations. Here, we use a powerful phylogenetic approach and a nearly complete phylogeny of mammals to estimate speciation, extinction, and dispersal rates associated with the tropical and temperate biomes. Overall, speciation rates are higher, and extinction rates lower, in the tropics than in temperate regions. The diversity of the eight most species-rich mammalian orders (covering 92% of all mammals) peaks in the tropics, except that of the Lagomorpha (hares, rabbits, and pikas) reaching a maxima in northern-temperate regions. Latitudinal patterns in diversification rates are strikingly consistent with these diversity patterns, with peaks in species richness associated with low extinction rates (Primates and Lagomorpha), high speciation rates (Diprotodontia, Artiodactyla, and Soricomorpha), or both (Chiroptera and Rodentia). Rates of range expansion were typically higher from the tropics to the temperate regions than in the other direction, supporting the \u0022out of the tropics\u0022 hypothesis whereby species originate in the tropics and disperse into higher latitudes. Overall, these results suggest that differences in diversification rates have played a major role in shaping the modern latitudinal diversity gradient in mammals, and illustrate the usefulness of recently developed phylogenetic approaches for understanding this famous yet mysterious pattern. 24492316- \u003Ca href=\u0022http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3904837/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.ncbi.nlm.nih.gov/pmc/articles/PMC3904837/\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nFront Genet. 2014 Dec 2;5:420. doi: 10.3389/fgene.2014.00420. eCollection 2014. On the processes generating latitudinal richness gradients: identifying diagnostic patterns and predictions. Hurlbert AH1, Stegen JC2. We use a simulation model to examine four of the most common hypotheses for the latitudinal richness gradient and identify patterns that might be diagnostic of those four hypotheses. The hypotheses examined include (1) tropical niche conservatism, or the idea that the tropics are more diverse because a tropical clade origin has allowed more time for diversification in the tropics and has resulted in few species adapted to extra-tropical climates. (2) The ecological limits hypothesis suggests that species richness is limited by the amount of biologically available energy in a region. (3) The speciation rates hypothesis suggests that the latitudinal gradient arises from a gradient in speciation rates. (4) Finally, the tropical stability hypothesis argues that climatic fluctuations and glacial cycles in extratropical regions have led to greater extinction rates and less opportunity for specialization relative to the tropics. We found that tropical niche conservatism can be distinguished from the other three scenarios by phylogenies which are more balanced than expected, no relationship between mean root distance (MRD) and richness across regions, and a homogeneous rate of speciation across clades and through time. The energy gradient, speciation gradient, and disturbance gradient scenarios all produced phylogenies which were more imbalanced than expected, showed a negative relationship between MRD and richness, and diversity-dependence of speciation rate estimates through time. We found that the relationship between speciation rates and latitude could distinguish among these three scenarios, with no relation expected under the ecological limits hypothesis, a negative relationship expected under the speciation rates hypothesis, and a positive relationship expected under the tropical stability hypothesis. We emphasize the importance of considering multiple hypotheses and focusing on diagnostic predictions instead of predictions that are consistent with multiple hypotheses. \u003Ca href=\u0022http://www.ncbi.nlm.nih.gov/pmc/articles/pmid/25520738/\u0022 rel=\u0022external nofollow\u0022\u003E-http://www.ncbi.nlm.nih.gov/pmc/articles/pmid/25520738/\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis does limit life of course, you can have life at high temperatures and high hydrostatic pressures (hydro meaning water or fluid), but the reverse is not true very low temperatures are not acceptable. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-14T16:25:23Z\u0022 title=\u002206/14/2016 04:25  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 14, 2016\u003C/time\u003E by PB666\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Green Baron","CreatedById":107381,"CreatedDateTime":"2016-06-14T16:52:50Z","Content":"\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI must add:\n\u003C/p\u003E\n\u003Cp\u003E\nThere is a high gradient \u003Cu\u003Etoday\u003C/u\u003E because of an ice age (continent at one of the poles, circumpolar current, north/south landmass distribution, conveyor belt, north atlantic deep water formation, etc.). Mammalian diversification (mostly) falls into the time of cooling that lead to the ice age and diversity of todays climatic zones.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m pretty sure, had they looked 250my earlier, the result would have been totally different.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2016-06-14T16:58:00Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222629468\u0022 data-ipsquote-contentid=\u0022140965\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221465848181\u0022 data-ipsquote-userid=\u0022107622\u0022 data-ipsquote-username=\u0022gpisic\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n20 hours ago, gpisic said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYes there have been aliens: \u003Ca href=\u0022http://www.nytimes.com/2016/06/12/opinion/sunday/yes-there-have-been-aliens.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.nytimes.com/2016/06/12/opinion/sunday/yes-there-have-been-aliens.html\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nReharsh of old Drake all the way. First off as all others are saying, fewer good planets, more events who set back life. \n\u003C/p\u003E\n\u003Cp\u003E\nMine, intelligent life is probably rare, most don\u0027t developed an advanced technical civilization \n\u003C/p\u003E\n\u003Cp\u003E\nOn the other hand it\u0027s no reason why an solar system civilization should not last a billion years. Yes if they found that the matrix was more fun it would look dead to us \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-06-14T21:09:17Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222630657\u0022 data-ipsquote-contentid=\u0022140965\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221465923480\u0022 data-ipsquote-userid=\u002257801\u0022 data-ipsquote-username=\u0022magnemoe\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, magnemoe said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nReharsh of old Drake all the way. First off as all others are saying, fewer good planets, more events who set back life. \n\u003C/p\u003E\n\u003Cp\u003E\nMine, intelligent life is probably rare, most don\u0027t developed an advanced technical civilization \n\u003C/p\u003E\n\u003Cp\u003E\nOn the other hand it\u0027s no reason why an solar system civilization should not last a billion years.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe proof of the pudding is in the eating,\n\u003C/p\u003E\n\u003Cp\u003E\n1.) Lag effects\n\u003C/p\u003E\n\u003Cp\u003E\n2.) Space-time limitations\n\u003C/p\u003E\n\u003Cp\u003E\n3.) relevancy.\n\u003C/p\u003E\n\u003Cp\u003E\n4.) uncertainty.\n\u003C/p\u003E\n\u003Cp\u003E\nOK so lets just say there is a trillion civilizations have exist so far the visible universe . So we create an object that is 14 billion light years in diameter.\n\u003C/p\u003E\n\u003Cp\u003E\nTo the first 5 billion years of the universe, although the may exist in the comoving space that we now see as the first 5 billion years of the Universe, we will never see them. So now we are down to 250 billion or so. They may exist in a time frame that looks back to the beginning of the U and sees 13.8 billion years but they have no relevance at all to us.\n\u003C/p\u003E\n\u003Cp\u003E\nNext, lets talk about space-time limitations. Now lets just say that for any planet the likelihood of having sentients increases  by a curvilinear function from 5billion to 13.8 billion post big bang. And lets next argue that in that window only 1/10th (very generous) of the civilzations that have ever existed still now exist (some live in galaxies that just went red, whatever) no fuel for new stars and their stars basically are now red giants, to far to travel between viable stars). So right off the bat we are down to 25 billion, but the problem is that as we move away from Milky Way the odds of there existence drops because we head down on the curve, and the ones we theoretically could observe will have a tendency to be in older more massive galaxies that are dying. so that drops the whole thing down to about 2.5 billion in terms of relevancy, they could be sending us messages like do-this, don\u0027t do that, whatever, but there would never be any communication, even if one had quantum FTL communication, it would be of no benefit because there would need to a common source for entangled particles.\n\u003C/p\u003E\n\u003Cp\u003E\nNext relevancy, without quantum communication using entangled pairs (which is probably not possible) we have to gain communication at great distances, the problem is how they communicate or think we might communicate, may not be how we could recieve communications. It is clear that our current technologies are inadequate for ly distance communications, again this is an area were there could be great improvements but we cannot predict the direction of those improvements, so when we look at all the theoretically identifyable things in our range 2.5 billion, we have to consider whether we could mesh with them in a communicative manner. The only thing that I could imagine was an extremely powerful culture that could send quantum space-time signals from black holes by dropping large objects into the black hole, or something like this. This would be an obvious signal, but unfortunately would consume the galaxy, and the message would spread every direction, and they would have no idea if it was ever recieved. The message might be this \u0027Don\u0027t try to communicate by driving mass into a GBH\u0027. The alternative is they could laser target stars with a unique laser energy, some kind of laboratory metal that sends out a unique frequency, problem is this again needs to be targeted to a position where our star(s) will be when the laser light tracks the system. Again we don\u0027t know the frequency of the special metal and are we sophisticated enough to detect the signal, calculated its and ours comoving space time difference, back calculate the sending frequency and then determine which very rare or unnatural mineral created the light. This uses less energy but the problem is you need to a conversion of one kind of power into light, that uses alot of power. So basically I have to argue that communicating between galaxies is both energetic and not very frugal with sources that are needed for space civilzations to survive, remember that the key essential element for survival in space is energy. So this basically knocks down relevent life to our galaxy and a few local clusters, millions of potential sentient species. \n\u003C/p\u003E\n\u003Cp\u003E\nNext uncertainty, What if the drake equation is just a big screw up, what if life is far less common than we think, we know now, looking at other systems, some with hostile stars, and others with massive planets or with planets that are just too hot, that we greatly overestimated the possibility of life, that even planets with life more are marginal (e.g. mars like) for life in the past, a tiny rare minority are stabile under both tropical and long-lived enough to produce sentients. Since I can\u0027t address this starting with millions of sentients in our galaxy. There are places in our galaxy and local clusters that are just hard to see, to much dust, gas and other stars between us and them. So lets say that in that range maybe we have a perceptive line of sight 1/4 (I think im being generous) of the sentients in the galaxy or visible globular star clusters. So that takes us about a million, I would say maximum, perceivable lines of sight. But there are 300 billion stars in the galaxy and we only therefore can see 1 in 300,000 of these might have sentients. Some of these might not be space faring, because of the physics of their planets, or lack of resources. Others may have extensive cloud cover, or the sentients might be more philosophical and less technical. So lets say that such sentients exist on 1 in 300,000 stars how far would be have to travel to find them. Very crude calculation basically we have to travel 100 light years or so to find this culture. Hey, they could be sending us a very strong signal right at the moment, oh, but wait, why would they send a signal to earth, cause 100 years ago we basically were sending things out at long distances by morse code and crude wireless signals. So why would they think we even exist. I granted 10% of all that lived are still alive, but that means that are still alive are probably much more evolved communications, so could we detect them if they were signalling, maybe they are sending out the universal \u0027don\u0027t call us will call you when you figure out the code\u0027 signal. So from our point of view we might have to evolve another 10,000 years to be able to decipher the random-looking encryption they use. Or it may not be random at all, it might just appear to us that way, for them it might be hyper-efficient compression that you need sophisticated equipment to decompress.\n\u003C/p\u003E\n\u003Cp\u003E\nSo then we fall back on maybe we can passively observe them from Earth. So the earth travels around the sun at 150,000,000,000 meters. The half circumferance is around 500,000,000,000 meters. For us to detect them crossing in front of their star the have to pass 700,000,000 meters. So the odds of seeing a star passing in front of their star along our line of sight is  0.0014. OK so the maximum likelihood we would see an sentient civilizations planet in transect is now between 500 and 1000 light years away. So now given this we would need to survey 1,000,000,000 star-planets with the hopes of finding one with sentient life.\n\u003C/p\u003E\n\u003Cp\u003E\nGiven this:\n\u003C/p\u003E\n\u003Cp\u003E\nhow hard would it be to communicate 750 light years\u003Cbr\u003E\n1. round trip communication would be 1500 years\u003Cbr\u003E\n2. Probably not passive.\n\u003C/p\u003E\n\u003Cp\u003E\nHow about detection, could we passively detect sentients.\u003Cbr\u003E\n1. Artificial satellites are invisible at great distance\u003Cbr\u003E\n2. Interplanetary probes are excessively rare, and may not come with a roadmap back to the sender, and may not be a star recognized as having sentient life it if did. Most interplanetary probes are in interplanetary space, because of the gravity well they little time in the habitable zone, would be difficult to capture if they did. Note a hawkings-flyer would zip right by us and at 0.2c we would not see it unless it collided with something, in which case we might see a dramatic poof.\u003Cbr\u003E\n3. Organic signatures are ambiguous.\u003Cbr\u003E\n4. Should you be lucky you might capture a culture ending nuclear war, but that would obviate the whole reason for the search.\n\u003C/p\u003E\n\u003Cp\u003E\nThe critique here is how far between two points in space would passive identifiers be detectable, lets just say that within 20 ly passive detection is possible, the probability that two planets with sentient life exist within that distance is around 1/100,000 or so. So it is very unlikely the Earth might know this, but the problem is that if our signals reached them, now, you have outcomes.\n\u003C/p\u003E\n\u003Cp\u003E\nThey received the signals, say 60 years ago and:\n\u003C/p\u003E\n\u003Cp\u003E\na. misinterpret them as something else (scientific lag)\u003Cbr\u003E\nb. have decided to ban all communications with similar equipment so that we cannot detect them. (they are shy)\u003Cbr\u003E\nc. have sent a reply and we did not notice is and they took it as a snub. (they are snobbish)\u003Cbr\u003E\nb. have gone on radio black out as they (in about 750(0)(00) years) attack us. (they are aggressive paranoids)\u003Cbr\u003E\ne. they are attempting to communicate with us via some spiritual process and for whatever reasons its not realized or public.\u003Cbr\u003E\nf. they have already visited the planet but observe from great distance and have yet to decide that we are not yet worthy.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat we see is the sentient life problem becomes an issue of technological steps. Easily observed exo-sentients are hard to predict based on stars, the closest are probably greatly obscured from us, but far enough away, probablisitically speaking, that they or us would have to seek communication to detect them. The odds of them, based on our technology, not seeing us and us not seeing them is around 99.7%, the odds of either one of the two seeing the other one is about 0.25%. Therefore we would have to communicate with all potential stars (not just those that have transecting planets) in the vicinity of about 200 light years hoping that we are communicating with an sentient life, again we need that special technology that tells them, \u0027we are not noise, we have lasers and can make this artificial element and use it in a laser\u0027. Outside of that range would be the dyson ring range, were you see a very rare and powerful civilization which is probably in the range of 10,000s of light years away (if they are at all possible). This is the maximum extent of the zone of relevancy, things further away would be irrelevant to us. THe so-called civil universe is much smaller than the observable universe.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen we start the directed communication the response times could be 100s to 1000s of years, and the responses may not be what we expect. Thus that adds uncertainty.\n\u003C/p\u003E\n\u003Cp\u003E\nSo it begs the question are we even addressing the question properly.\n\u003C/p\u003E\n\u003Cp\u003E\nShould we not play the devil\u0027s advocate? There is no relevant sentient life, prove otherwise (my stance). And if this was the case how would we find adequate proof.(Disprove the null hypothesis).\n\u003C/p\u003E\n\u003Cp\u003E\n1. Improve telescopic methods (If you know me, I have been suggesting better telescopes as a game addition, I a champion of Hubble and I have proposed that we should have massive telescopes in space that cover 100s of meter) in the light and ultraviolet range.\u003Cbr\u003E\n2. Radio-telescopes on natural satellites that are not perturbed by communications here on earth or atmospheric interference.\u003Cbr\u003E\n3. A more systematic search of adjacent stars for planets, but a focus on stars like ours and a thinner habitable zone. IOW looking more broadly but being much more selective and much more focus on direct measures versus indirect measures. This might include placing telescopes in interplanetary space.\u003Cbr\u003E\n4. A focus on modernizing interplanetary communication, technological improvements in communication methods as to understand how sentients might communicate. Quantum teleportation/communication is still a place of rich expansion.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-06-16T15:12:11Z","Content":"\n\u003Cp\u003E\n\u003Ca href=\u0022https://gizmodo.com/new-calculation-shows-we-ll-make-contact-with-aliens-in-1782029426?\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://gizmodo.com/new-calculation-shows-we-ll-make-contact-with-aliens-in-1782029426?\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIf you are viewing this thread there is another thread discussing more recent news.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-06-20T16:04:07Z","Content":"\n\u003Cp\u003E\n\u003Ca href=\u0022https://arxiv.org/abs/1604.07687\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://arxiv.org/abs/1604.07687\u003C/a\u003E\n\u003C/p\u003E\n"}]}