{"TopicId":140919,"ForumId":21,"TopicTitle":"Duna Ion Probe (Kerin \u0026gt; Duna in 109 days)","CreatedByName":"Kadrush","CreatedById":158076,"CreatedDateTime":"2016-05-31T22:47:22Z","PageNum":1,"Articles":[{"CreatedByName":"Kadrush","CreatedById":158076,"CreatedDateTime":"2016-05-31T22:47:22Z","Content":"\n\u003Cp\u003E\nSo, I needed a probe that could arrive fast on Duna, before the main window opened, so I could make some science and mainly get the income bonuses of my Duna Program (Strategia mod). My main mods for this ship are OctoSat, Universal, Remote Tech, and DMagic. The ejection from kerbin were made by a 2.5m LF \u002B OX engine, as ejections with ion engines are a really bad idea. This probe has a few features:\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n1- A folded extreme range comm dish (octo sat) aimed directly to a relay sat on kerbol orbit (this sat has a lot of antenas which are aimed to several sats on kerbin and vice versa, meaning that with this system my probe can reach KSC without worries of comm blackout).\n\u003C/p\u003E\n\u003Cp\u003E\n2- A backup antena aimed directly to an specific sat on kerbin (set to active vessel), once on Duna that antena had enough cone cover to reach most of kerbin, so i changed the target\n\u003C/p\u003E\n\u003Cp\u003E\n3- 4 alkaline fuel cells (universal mod), one for each ion engine. Instead of counting on nuclear reactors or several solar panels / batteries, i choose to power my ion engines with those fuel cells, they are started only for the propulsion and turned off after, the rest of the time my probe is powered by 4 octo sat panels. The final part of it (as show on the pictures below) had 11.6k of delta v, and i used 6.7k to enter directly on Ike orbit (had a few contracts there).\n\u003C/p\u003E\n\u003Cp\u003E\n4- Several sci experiments, DMagic, Stock, Bluedog and other, I am playing with 70% science to avoid overkill in that field. Science Jr and Goo are Octosat models.\n\u003C/p\u003E\n\u003Cp\u003E\n5- A few omni antenas, so it can act as a relay for other probes once they arrive on Duna.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nHere is 2 pictures of it, if you guys like it i can post more.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00223I3Y4GM.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/3I3Y4GM.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Bk9rVSz.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/Bk9rVSz.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-31T22:48:37Z\u0022 title=\u002205/31/2016 10:48  PM\u0022 data-short=\u00228 yr\u0022\u003EMay 31, 2016\u003C/time\u003E by Kadrush\u003C/strong\u003E\n\u003Cbr\u003Egrammar (i hope)\n\u003C/span\u003E\n"}]}