{"TopicId":141159,"ForumId":16,"TopicTitle":"What conditions determine claw connection?","CreatedByName":"THX1138","CreatedById":113955,"CreatedDateTime":"2016-06-03T23:48:42Z","PageNum":1,"Articles":[{"CreatedByName":"THX1138","CreatedById":113955,"CreatedDateTime":"2016-06-03T23:48:42Z","Content":"\n\u003Cp\u003E\nI have to repeatedly ram vessels together at between 0.3-1.0 m/s to try to get the claw to connect. I can\u0027t determine a pattern to predict when it will work and when it won\u0027t and having to reload a save because a solar panel was knocked off on attempt #15 is a pain.\n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2016-06-04T00:51:44Z","Content":"\n\u003Cp\u003E\nKlaws are definitely harder to get to connect now. The most important determinations are where you impact, and your angle. On a flat surface, you need to be very nearly perpendicular to the surface (maybe 85 degrees). \u003Cem\u003E\u003Cstrong\u003EOn a curved surface, the klaw needs to be aimed at the centerline of the surface\u003C/strong\u003E\u003C/em\u003E (within a few centimeters) and be mostly perpendicular, too (maybe 80 degrees). The centerline thing is the part where you have to be very careful with your piloting, or use the automatic target tracking on the SAS.\n\u003C/p\u003E\n"},{"CreatedByName":"MachTurtle","CreatedById":153223,"CreatedDateTime":"2016-07-09T16:38:49Z","Content":"\n\u003Cp\u003E\nI\u0027ve been trying to test an asteroid propulsion system I\u0027m knocking together at the Kerbin launch site by dropping an Advanced Grabbing Unit onto the grassy area nearby.  I\u0027ve been increasing the drop height yet the Klaw never latches onto the ground.  Is this because I\u0027m not getting a fast enough contact speed or is Kerbin unklawable?\n\u003C/p\u003E\n"},{"CreatedByName":"Leftotian","CreatedById":157914,"CreatedDateTime":"2016-07-09T17:06:30Z","Content":"\n\u003Cp\u003E\nKlawing is basicly docking, it turns two crafts into one. Pretty sure you cant dock with a planet/moon.\n\u003C/p\u003E\n"},{"CreatedByName":"MachTurtle","CreatedById":153223,"CreatedDateTime":"2016-07-09T19:13:14Z","Content":"\n\u003Cp\u003E\nThat makes sense, Leftotian. I may try putting a layer of structural panels under my test rig for the klaw to grab. Thanks!\n\u003C/p\u003E\n"}]}