{"TopicId":141292,"ForumId":32,"TopicTitle":"Doom posting","CreatedByName":"Kertech","CreatedById":156079,"CreatedDateTime":"2016-06-06T08:36:54Z","PageNum":1,"Articles":[{"CreatedByName":"Kertech","CreatedById":156079,"CreatedDateTime":"2016-06-06T08:36:54Z","Content":"\n\u003Cp\u003E\nSo yes crashes can be annoying (like trying to build the same ship 3 times before giving up and going to bed and not picking the game up for a couple of days!) But KSP is still one of the best games I\u0027ve ever played and there is nothing else equal to it! There are things you can do, if it\u0027s a modded instal, remove some mods, it might not be squad. Also obvious things: periodically SAVE your ship in the VAB/SPH! That way you won\u0027t lose progres! Also report you bug \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/forum/69-technical-support-unmodded-installs/\u0022 rel=\u0022\u0022\u003Ehere\u003C/a\u003E and hopefully it\u0027ll be resolved! Shouting at the world is constructive, but being part of a solution will benefit everyone. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-06T08:37:31Z\u0022 title=\u002206/06/2016 08:37  AM\u0022 data-short=\u00228 yr\u0022\u003EJune 6, 2016\u003C/time\u003E by Kertech\u003C/strong\u003E\n\u003Cbr\u003Eforgot a bracket\u002BOCD never a good mix\n\u003C/span\u003E\n"},{"CreatedByName":"steve_v","CreatedById":69272,"CreatedDateTime":"2016-06-06T08:48:43Z","Content":"\n\u003Cp\u003E\nIf you can explain how complaining about people complaining is more constructive that complaining in the first place, please, go ahead. \u003Cimg alt=\u0022:rolleyes:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 title=\u0022:rolleyes:\u0022\u003E\u003Cbr\u003E\nAs for reporting bugs, I have. No dice, unless you count \u0022Known Unity issue, no fix\u0022 replies as \u0022constructive\u0022.\n\u003C/p\u003E\n"},{"CreatedByName":"p1t1o","CreatedById":74091,"CreatedDateTime":"2016-06-06T11:50:49Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222618680\u0022 data-ipsquote-contentid=\u0022141292\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221465202923\u0022 data-ipsquote-userid=\u002269272\u0022 data-ipsquote-username=\u0022steve_v\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, steve_v said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIf you can explain how complaining about people complaining is more constructive that complaining in the first place, please, go ahead. \u003Cimg alt=\u0022:rolleyes:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 title=\u0022:rolleyes:\u0022\u003E\u003Cbr\u003E\nAs for reporting bugs, I have. No dice, unless you count \u0022Known Unity issue, no fix\u0022 replies as \u0022constructive\u0022.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nDid you just complain about someone complaining about someone complaining? I take issue with that \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Atlas2342","CreatedById":155194,"CreatedDateTime":"2016-06-06T11:53:28Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222618837\u0022 data-ipsquote-contentid=\u0022141292\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221465213849\u0022 data-ipsquote-userid=\u002274091\u0022 data-ipsquote-username=\u0022p1t1o\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, p1t1o said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nDid you just complain about someone complaining about someone complaining? I take issue with that \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cem\u003E*Complainception* \u003C/em\u003E\u003C/span\u003E\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-06T13:03:11Z\u0022 title=\u002206/06/2016 01:03  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 6, 2016\u003C/time\u003E by Atlas2342\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Brainlord Mesomorph","CreatedById":110905,"CreatedDateTime":"2016-06-06T12:06:34Z","Content":"\n\u003Cp\u003E\n(yet another please stop complaining post?)\n\u003C/p\u003E\n\u003Cp\u003E\nI’m sorry, but we\u0027re not poodleing.\u003Cspan\u003E  \u003C/span\u003EThis isn’t “whaaaa, my toy is broken.”\n\u003C/p\u003E\n\u003Cp\u003E\nWhile users can post an infinite number of individual bug reports (apparently!) There still needs to be a discussion of the overall state of the game, and what, if I may call them, failures of strategy and management led to the current state.\n\u003C/p\u003E\n\u003Cp\u003E\nI’m a professional software developer so I have insight into the whole version number trickery thing, and what it takes to prep a product, roll it out, and support it.\u003Cspan\u003E  \u003C/span\u003EYou may not remember, but this game went very quickly from 0.25 to 0.9, 1.0,[EDIT: I forgot 1.05] 1.1, and now 1.1.2. (by my count this should be around version 0.7) And I don’t know whose idea it was to release version 1.0 as a Unity 4 product, and then upgrade the engine the Unity 5. \u003Cspan\u003E \u003C/span\u003EThat was an accident waiting to happen.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd as I write that, it suddenly occurs to me: They must have known this is going to happen.\u003Cspan\u003E  \u003C/span\u003EThey knew that by migrating to Unity 5 was going cause massive headaches, they had a relatively stable Unity 4 build, so they call that, 1.0.\u003Cspan\u003E  \u003C/span\u003EGet out of the prerelease section on Steam, then migrate to Unity5.  If they went to Unity5 first, it would be another six moths to a year before they would have something stable enough to call 1.0.\n\u003C/p\u003E\n\u003Cp\u003E\nBut what they didn’t count on is  by calling it 1.0 they essentially fired their entire free beta department (you and me).\u003Cspan\u003E  \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAnd they didn’t count on how angry we would be when our now post-1.0 product is buggier then it was in prerelease. \u003Cspan\u003E The g\u003C/span\u003Eame that I love (and I do) is now crashing every 20 minutes.\u003Cspan\u003E  \u003C/span\u003EAnd I’m certain it isn’t a single thing they haven’t heard from somebody else. \n\u003C/p\u003E\n\u003Cp\u003E\nWe’re trying to be patient, we really are.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-07T19:28:42Z\u0022 title=\u002206/07/2016 07:28  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 7, 2016\u003C/time\u003E by Brainlord Mesomorph\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Xavven","CreatedById":100398,"CreatedDateTime":"2016-06-06T14:05:30Z","Content":"\n\u003Cp\u003E\nI\u0027ve said it before and I\u0027ll say it again. The mere act of posting about the game crashing, I have no problem with. And there have been some so-called \u0022complaining threads\u0022 that were fairly level-headed and constructive. But there are also some that do come off as \u0022whaaaa, my toy is broken\u0022 and that\u0027s simply off-putting to me. I believe the dysphemism for it is \u0022rage quitting.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nPlease do report bugs and share your experiences with the game. Please don\u0027t be \u0022that guy\u0022 who rage quits. That is all.\n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2016-06-06T15:52:24Z","Content":"\n\u003Cp\u003E\nWhat I find most difficult about rage quitting is smashing only the stuff that needs to be smashed. I usually just go into a general \u0022smash everything\u0022 fit, and then later I have to replace the stuff that didn\u0027t need smashing, and I get mad all over again.\u003Cimg alt=\u0022:lol:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_laugh.png\u0022 title=\u0022:lol:\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-06T16:34:00Z\u0022 title=\u002206/06/2016 04:34  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 6, 2016\u003C/time\u003E by Red Iron Crown\u003C/strong\u003E\n\u003Cbr\u003EEasy with the language, please.\n\u003C/span\u003E\n"},{"CreatedByName":"The_Rocketeer","CreatedById":81727,"CreatedDateTime":"2016-06-06T15:59:59Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/110905-brainlord-mesomorph/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022110905\u0022 href=\u0022%7B___base_url___%7D/index.php?/profile/110905-brainlord-mesomorph/\u0022 rel=\u0022\u0022\u003E@Brainlord Mesomorph\u003C/a\u003E what does \u0027poodleing\u0027 mean? I\u0027ve never heard this word used this way!\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-06-06T16:08:55Z","Content":"\n\u003Cp\u003E\nSo, gonna take my moderator hat off for a moment.  I\u0027m speaking here purely as an avid KSP player, as a modder, and (not incidentally) as a professional software engineer with over 20 years of experience in the industry.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m not going to try to address the issue of complaints, or the manner in which they\u0027re given, or who complained about complainers, or any of that.  As I say, I\u0027m not speaking as a moderator, here, so I won\u0027t concern myself with that.  I do have a lot of relevant technical experience in this area, however, so I\u0027d like to make a few practical points about the nature of software, of software engineering, of shipping a product, and of bugs.\n\u003C/p\u003E\n\u003Cp\u003E\nIf I\u0027m understanding the points of contention, here (not just in this thread, but also in a lot of similar ones I\u0027ve seen), the complaints generally boil down to some combination of the following:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nKSP 1.1\u002B is overflowing chock full of bugs.  So badly that it\u0027s broken / unplayable / not possible to enjoy.\n\u003C/li\u003E\n\u003Cli\u003E\nAnd it shouldn\u0027t be, and Squad has been derelict in their duty for shipping software with so many bugs in it.\n\u003C/li\u003E\n\u003Cli\u003E\nAnd Squad should have done X instead of what they did, because Things Would Have Been Better then.  \u003Cspan style=\u0022font-size:10px;\u0022\u003E(Where \u0022X\u0022 varies from post to post, but is generally \u0022something different than what happened.\u0022)\u003C/span\u003E\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nSo, a few observations:\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u0022KSP 1.1\u002B is overflowing chock full of bugs.  So badly that it\u0027s broken / unplayable / not possible to enjoy.\u0022\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nReally?  What\u0027s your evidence for that?  I\u0027m not saying you\u0027re wrong-- simply stating it as an honest question, where\u0027s the evidence?\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve seen several people post polls in this forum, asking basically \u0022what\u0027s your experience\u0022 to get a feel for whether people are playing just fine, or having minor bug issues that don\u0027t impact game enjoyment, or broken/unplayable, or what.  And in every case I\u0027ve seen, the large majority of poll respondents say \u0022works just fine\u0022-- and the next biggest category is \u0022minor bugs, still enjoy the game.\u0022  I know that I play KSP just fine, and it works great, and I have a lot of fun doing it.  My last crash was a month ago; I think I\u0027ve had maybe a couple of them since 1.1 shipped.  In fact, I\u0027ve actually been getting considerably \u003Cem\u003E\u003Cu\u003Efewer\u003C/u\u003E\u003C/em\u003E crashes post-1.1 than pre-1.1.  And from what I\u0027ve read in the forums, I\u0027m far from alone in that experience.\n\u003C/p\u003E\n\u003Cp\u003E\nSo saying \u0022the game is broken\u0022 is hyperbole, at best.  Anyone who makes such sweeping statements is demonstrably wrong.  They\u0027re not helping anything.  You can say that \u003Cem\u003E\u003Cu\u003Eyou\u003C/u\u003E\u003C/em\u003E are having a problem, but not that \u0022the game is broken.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nNot only are such sweeping statements not helpful-- they\u0027re actually harmful, because they can lead to an \u0022echo chamber\u0022 effect in which people just hear this constant refrain and jump on the bandwagon without actually looking at the real issues.  It results in people who actually \u003Cem\u003E\u003Cu\u003Earen\u0027t\u003C/u\u003E\u003C/em\u003E having bugs erroneously jumping to that conclusion, which causes further confusion and doesn\u0027t help anyone.\n\u003C/p\u003E\n\u003Cp\u003E\nFor example:  consider airplane landing gear.  Lengthy discussion in spoiler section.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nSure, there may be bugs there.  I have to say \u0022may\u0022 because I haven\u0027t experienced any myself; I haven\u0027t had \u003Cu\u003E\u003Cem\u003Eany\u003C/em\u003E\u003C/u\u003E unexplainable problems with the landing gear at all.  I can land and take off just fine, including on the tier-0 runway, including landing on bumpy terrain.  And I\u0027m not some sort of airplane expert, either (I\u0027m mainly a rocket guy).  I did experience some cognitive dissonance initially (\u0022why the heck do my landing gear keep exploding?!\u0022), but as soon as I got the memo \u003Cspan style=\u0022font-size:10px;\u0022\u003E(namely, that \u0022gear is no longer magically indestructible\u0022 and \u0022it can only carry a certain amount of weight\u0022 and \u0022bigger gear = stronger\u0022)\u003C/span\u003E, I simply put bigger gear on my planes and the problem was solved.\n\u003C/p\u003E\n\u003Cp\u003E\nBut let\u0027s grant that there \u003Cem\u003E\u003Cu\u003Eare\u003C/u\u003E\u003C/em\u003E legitimate bugs there, which affect certain people in certain situations.  So, it\u0027s a good idea to raise that by posting angry \u0022Landing gear is broken!\u0022 posts in the forums, right?\n\u003C/p\u003E\n\u003Cp\u003E\n...Except that in virtually every such thread that I\u0027ve seen, when the other posters in the thread got to the bottom of the issue, it actually \u003Cem\u003E\u003Cu\u003Ewasn\u0027t a bug\u003C/u\u003E\u003C/em\u003E.  The large majority of cases appear to be player error.  \u0022Hey, every time I try to land my 30-ton plane on three tiny landing gear, they blow up!\u0022  Well, yes.  That\u0027s a \u003Cem\u003E\u003Cu\u003Edesign feature\u003C/u\u003E\u003C/em\u003E, not a bug.  It means you have to use bigger gear than you used to.  It means that the rules have changed and you have to adjust to the new rules, the same way that rocket-flyers did when the new aero arrived with 1.0.\n\u003C/p\u003E\n\u003Cp\u003E\nThat\u0027s not to play down the people who do have legitimate problems, and I\u0027m sure they\u0027re there, and when such a problem does crop up, sure, it\u0027s important to provide a useful, informative, reproducible piece of feedback so that somebody can go fix it.  But the cavalcade of people who are simply Doing It Wrong, blaring \u0022the game is broke!\u0022 all the time, causes a kind of \u0022echo chamber\u0022 in which that becomes What Everyone Is Saying.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd that\u0027s harmful-- because it means that people who are getting bitten by a \u003Cem\u003E\u003Cu\u003Edesign feature\u003C/u\u003E\u003C/em\u003E don\u0027t realize it, assume it\u0027s a bug, and don\u0027t learn how to adapt their play to the new rules of the game.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nThere\u0027s nothing wrong with being a vocal proponent of fixing something that\u0027s broken.  But please, for the sake of everyone in the forums, could you do this?\n\u003C/p\u003E\n\u003Col\u003E\u003Cli\u003E\n\u003Cu\u003E\u003Cem\u003EDon\u0027t\u003C/em\u003E\u003C/u\u003E jump to the conclusion that what happened to you is a bug in the game.\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cu\u003E\u003Cem\u003EDo\u003C/em\u003E\u003C/u\u003E bring it up-- not as an angry \u0022it\u0027s broke!\u0022, simply as a \u0022Here is what happened to me, is this a bug?\u0022\n\u003C/li\u003E\n\u003Cli\u003E\n...and provide plenty of relevant information when doing so, including a screenshot, and the relevant stats of your craft, and the list of what mods you\u0027re running.\n\u003C/li\u003E\n\u003C/ol\u003E\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u0022Never mind that it works fine for \u003Cem\u003E\u003Cu\u003Eyou\u003C/u\u003E\u003C/em\u003E or umpty thousand other people.  It\u0027s broken for \u003Cem\u003E\u003Cu\u003Eme\u003C/u\u003E\u003C/em\u003E and I\u0027m upset about that.\u0022\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nWell, of course you\u0027re upset.  I honestly can\u0027t blame you.  KSP is really fun, I\u0027ve been playing it for years, and if it got to a state where it was so badly broken I couldn\u0027t play it, then I\u0027d be upset, too.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, again, please be careful about laying blame.  Lengthy explanation in spoiler section, but the TL;DR is:  It\u0027s okay to be upset.  But please don\u0027t blame Squad unless it\u0027s demonstrably their fault.  And in many cases (e.g. your problem is game crashing, and you are running \u003Cem\u003E\u003Cu\u003Eany mods at all\u003C/u\u003E\u003C/em\u003E), then that is not the case.  Reproduce the crash in pure stock before you call it Squad\u0027s fault.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nLet\u0027s say you have an aggravating problem in which the game keeps crashing to desktop.  How sure are you that it\u0027s actually Squad\u0027s fault?  (Hint:  If you\u0027re running any mods at all, then you\u0027re not.)\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve had a \u003Cem\u003E\u003Cu\u003Eremarkably\u003C/u\u003E\u003C/em\u003E stable experience with the game, post-1.1.  Considerably fewer crashes than pre-1.1.  Works great.\n\u003C/p\u003E\n\u003Cp\u003E\nBut then, I run pretty close to stock, compared with an awful lot of KSP players.  I\u0027m not any kind of purist, I simply happen to like the stock experience and prefer to just gussy it up a little rather than completely overhaul it.  I\u0027m running fewer than a dozen mods, and none of them are \u0022big\u0022.  PlanetShine, Kopernicus, SpaceY \u003Cspan style=\u0022font-size:9px;\u0022\u003E(a parts pack with no code in it)\u003C/span\u003E, NavBall Docking Alignment Indicator.  A half-dozen of my own mods (none of which are really huge).  And that\u0027s about it.  No MechJeb, no KER, none of the big mods that really get into the guts of the game.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd running KSP with such a light mod load works just fine for me.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd I see an awful lot of KSP players out there who routinely play with \u003Cem\u003E\u003Cu\u003Edozens\u003C/u\u003E\u003C/em\u003E of mods installed.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd mods can cause crashes.\n\u003C/p\u003E\n\u003Cp\u003E\nSo if you\u0027re having crash problems, my first question is:  are you running stock?  \u003Cem\u003E\u003Cu\u003EPure\u003C/u\u003E\u003C/em\u003E stock?  Because unless you\u0027re running pure stock, how do you know that it wasn\u0027t the \u003Cem\u003E\u003Cu\u003Emod\u003C/u\u003E\u003C/em\u003E causing the crash, rather than KSP itself?\n\u003C/p\u003E\n\u003Cp\u003E\nAnd, if you \u003Cem\u003E\u003Cu\u003Earen\u0027t\u003C/u\u003E\u003C/em\u003E running pure stock... you\u0027re not doing yourself or anyone else a favor to complain about crashes.  Because not only is it not obvious whether the crash comes from KSP itself, but it\u0027s not \u0022actionable intelligence\u0022-- the KSP devs can\u0027t really do much with \u0022some random user running some random collection of mods that the KSP team didn\u0027t write had a crash.\u0022\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nIf you can reliably reproduce your crash in a stock game, then by all means report the bug to Squad in their bug tracker.  Mention it in the forums, so other users know about the issue.\n\u003C/p\u003E\n\u003Cp\u003E\nBut until and unless you do that... you\u0027re not in any position to point the Finger Of Blame™ at anyone.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u0022It\u0027s Squad\u0027s fault that there are so many bugs, and we should be mad at them.\u0022\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve ranted at this at length elsewhere, so I\u0027ll skip much of it here, but my response to that boils down to:  Bugs happen.  It is mathematically impossible to ship software without bugs in it\u003Cem\u003E.  \u003C/em\u003EIt\u0027s just a matter of how \u003Cem\u003E\u003Cu\u003Emany\u003C/u\u003E\u003C/em\u003E you ship with.  There are a lot of factors that go into that, but they come down to two things:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nPeople.\n\u003C/li\u003E\n\u003Cli\u003E\nTime.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nIf you can throw a couple of hundred engineers at the problem, with a comparably sized QA staff, then you can ship a really polished product.  Or if you can spend years and years working on it, you can also get your bug count really low.\n\u003C/p\u003E\n\u003Cp\u003E\nBut when you\u0027re a tiny indie game company with like half a dozen developers, and you have to push things out in \u003Cem\u003E\u003Cu\u003Emonths\u003C/u\u003E\u003C/em\u003E rather than years, there simply isn\u0027t the time to turn out software with six nines of reliability.  Cannot be done.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen you shell out your US$20 or $40 or whatever, what you\u0027re buying is the result of a tiny team of passionate, dedicated, hard-working people who are doing the best they can.  And I think they\u0027ve done a pretty good job.  I say this as a professional software engineer with over 20 years of experience in the industry, in companies large and small.  I have a pretty good idea of what \u0022crap\u0022 looks like, and I contend that KSP isn\u0027t it.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you are a professional software engineer \u003Cspan style=\u0022font-size:10px;\u0022\u003E(and I know I\u0027m not the only one here!)\u003C/span\u003E and differ with this opinion, then great, let\u0027s have a discussion.  \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBut if you\u0027re not in the industry, then with all due respect, you are in no position to have the slightest clue about what Squad \u0022should\u0022 be able to do, and you\u0027re not helping anyone by pointing the Finger Of Blame.\n\u003C/p\u003E\n\u003Cp\u003E\nYou \u003Cu\u003E\u003Cem\u003Ecan\u003C/em\u003E\u003C/u\u003E legitimately say that \u0022I don\u0027t like the experience I have as a player.\u0022  You can vote with your wallet, and decide that US$20 or $40 or whatever was too steep a price to pay for the thousands of hours of entertainment you\u0027ve gotten from the game, and warn your friends away, if you like.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u0022Okay, there are bugs, but they should have \u003Cem\u003E\u0026lt;done something different than what they did\u0026gt;.\u003C/em\u003E\u0022\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI hear this kind of statement frequently.  The \u003Cem\u003E\u0026lt;something different\u0026gt;\u003C/em\u003E varies from post to post.  They should have kept it in experimentals longer.  They should have used a different version numbering scheme.  They should have gone to Unity 5 earlier.  They should have gone to Unity 5 later.  And so on and so forth.\n\u003C/p\u003E\n\u003Cp\u003E\nNext mini-rant on the topic in yet another spoiler section, but it boils down to:  all the evidence indicates that these are smart, hard-working people who are doing their best.  Software development is \u003Cem\u003E\u003Cu\u003Ehard\u003C/u\u003E\u003C/em\u003E, and shipping software requires dealing with many constraints that people outside the industry (or even outside the particular company) can\u0027t appreciate.  So before playing armchair general and saying that Squad should have done something different than what they did, consider how it is that you know better than they do how to run their business.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nIt boils down to this:  If you believe that Squad\u0027s software management and release strategy is egregiously wrong-- and you think you know better than they do-- then on what do you base that assumption?  Are you in the software industry?  Do you work at Squad, and have visibility into all of their various constraints?  It\u0027s easy to be an armchair general.  It\u0027s easy to point a finger at what they did and say \u0022this thing they did here is bad, and they should have done this other thing instead.\u0022  But if you have no insight into \u003Cem\u003E\u003Cu\u003Ewhy\u003C/u\u003E\u003C/em\u003E they did that \u003Cspan style=\u0022font-size:10px;\u0022\u003E(hint: you don\u0027t)\u003C/span\u003E, then you\u0027re in no position to judge.  The \u003Cem\u003E\u0026lt;something different\u0026gt;\u003C/em\u003E you\u0027re proposing could have been \u003Cem\u003E\u003Cu\u003Eworse\u003C/u\u003E\u003C/em\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nFor you, me, or anyone who doesn\u0027t work at Squad to really be able to say \u0022they totally screwed up and should have done something different,\u0022 then essentially we\u0027d have to believe one of the following:\n\u003C/p\u003E\n\u003Col\u003E\u003Cli\u003E\nThey\u0027re masochists who enjoy being lambasted.\n\u003C/li\u003E\n\u003Cli\u003E\nThey\u0027re a bunch of evil jerks who don\u0027t give a darn about the player base.\n\u003C/li\u003E\n\u003Cli\u003E\nThey\u0027re a bunch of incompetent fumblethumbs who couldn\u0027t code their way out of a paper bag.\n\u003C/li\u003E\n\u003C/ol\u003E\u003Cp\u003E\nI think we can safely dispense with #1.  Nobody \u003Cem\u003E\u003Cu\u003Ewants\u003C/u\u003E\u003C/em\u003E to ship a buggy product.\n\u003C/p\u003E\n\u003Cp\u003E\n#2 certainly exists in the world... but from the enthusiastic engagement that I\u0027ve seen from Squad staff here in the forums, I really don\u0027t think that\u0027s it.  I\u0027ve never seen such a friendly, engaged company.  Time and time again I\u0027ll see a player post a problem, and an \u003Cem\u003E\u003Cu\u003Eactual developer\u003C/u\u003E\u003C/em\u003E will jump in and answer their question personally.  That\u0027s not just refreshing, it\u0027s \u003Cem\u003E\u003Cu\u003Eastonishing\u003C/u\u003E\u003C/em\u003E.  I\u0027ve never seen that level of commitment to users from any other software company.  They\u0027re batting that one out of the frickin\u0027 \u003Cem\u003E\u003Cu\u003Epark\u003C/u\u003E\u003C/em\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd as for #3... sure, there are incompetent coders out there in the world.  But I have seen zero evidence to suggest that anybody at Squad fits that category; quite the contrary.  For one thing, as a modder, I\u0027ve done a fair amount of poking around in KSP\u0027s internals, and I\u0027ve had a lot of technical discussions in which Squad devs joined in, and I have to say that they\u0027ve done a solid job.  Not perfect, and sure there are some rough edges here and there where KSP shows that something had to be turned out in a hurry-- but by and large, they\u0027re technically very impressive people who do good work.\n\u003C/p\u003E\n\u003Cp\u003E\nLook:  Nobody\u0027s perfect, including Squad.  I\u0027m not saying they never make mistakes.  But they\u0027re skilled, smart, hard-working people who are operating under time and manpower constraints, and very often in software development there are hard choices where the best you can do is pick the lesser of two evils.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you don\u0027t know the reasons that went into particular decisions, you\u0027re really not in any position to judge.  So maybe tone down the rhetoric a little?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nI don\u0027t work for Squad, so I don\u0027t know any better than you do what happens inside the company.  All I can do, like you, is look at the externally observable evidence and results.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd what I\u0027ve seen looks like a company that\u0027s doing things just fine, given the constraints they have to work with.  Not perfect, certainly, since nobody is.  But pretty darn reasonable, all things considered.\n\u003C/p\u003E\n\u003Cp\u003E\nDoesn\u0027t mean I\u0027m necessarily right \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E ...just the opinion of a 20\u002B year veteran software engineer, for what it\u0027s worth.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"DChurchill","CreatedById":60282,"CreatedDateTime":"2016-06-06T16:26:54Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222619095\u0022 data-ipsquote-contentid=\u0022141292\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221465228799\u0022 data-ipsquote-userid=\u002281727\u0022 data-ipsquote-username=\u0022The_Rocketeer\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n25 minutes ago, The_Rocketeer said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/110905-brainlord-mesomorph/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022110905\u0022 href=\u0022%7B___base_url___%7D/index.php?/profile/110905-brainlord-mesomorph/\u0022 rel=\u0022external\u0022\u003E@Brainlord Mesomorph\u003C/a\u003E what does \u0027poodleing\u0027 mean? I\u0027ve never heard this word used this way!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI expect that he\u0027s been hit by the Forum Profanity Filter\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Csup\u003ETM   \u003C/sup\u003E\u003C/span\u003E\u003Cimg alt=\u0022:sealed:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_lipssealed.gif\u0022 title=\u0022:sealed:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"JoeNapalm","CreatedById":67032,"CreatedDateTime":"2016-06-06T16:27:24Z","Content":"\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nJust going to throw out there that doing a full, clean reinstall takes less time than a doom posting, if you have any kind of reasonable internet.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you haven\u0027t done that, first, you should stop mid-rant and do so. Would probably prevent 90% of the frustrations being vented here.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you\u0027ve done that, and you\u0027re still having issues, my condolences -- you\u0027re not one of the people I\u0027m talking to, right now.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n-Jn-\n\u003C/p\u003E\n"},{"CreatedByName":"The_Rocketeer","CreatedById":81727,"CreatedDateTime":"2016-06-06T16:29:09Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/125662-snark/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022125662\u0022 href=\u0022%7B___base_url___%7D/index.php?/profile/125662-snark/\u0022 rel=\u0022external\u0022\u003E@Snark\u003C/a\u003E not that I disagree with your whole post - much good advice - but the \u0027KSP Since 1.1\u0027 poll I conducted (which I think is the only one that directly tackled the \u0027how often are you experiencing bugs\u0027 question) actually only showed a very small majority (\u0026lt;55%) having \u0027infrequent\u0027 bug problems, and a very large minority (\u0026gt;35%) having frequent bug problems. To dismiss these complaints out of hand for lack of evidence, or even suggest that such evidence doesn\u0027t exist, is a bit unfair.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-06T16:31:21Z\u0022 title=\u002206/06/2016 04:31  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 6, 2016\u003C/time\u003E by The_Rocketeer\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DChurchill","CreatedById":60282,"CreatedDateTime":"2016-06-06T16:32:25Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222619141\u0022 data-ipsquote-contentid=\u0022141292\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221465230549\u0022 data-ipsquote-userid=\u002281727\u0022 data-ipsquote-username=\u0022The_Rocketeer\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 minutes ago, The_Rocketeer said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/125662-snark/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022125662\u0022 href=\u0022%7B___base_url___%7D/index.php?/profile/125662-snark/\u0022 rel=\u0022external\u0022\u003E@Snark\u003C/a\u003E not that I disagree with your whole post - much good advice - but the \u0027KSP Since 1.1\u0027 poll I conducted (which I think is the only one that directly tackled the \u0027how often are you experiencing bugs\u0027 question) actually only showed a very small majority (\u0026lt;55%) having \u0027infrequent\u0027 bug problems, and a very large minority (\u0026gt;35%) having frequent bug problems. To dismiss these complaints out of hand for lack of evidence, or even suggest that such evidence doesn\u0027t exist, is a bit unfair.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSo what is it you want to happen?\n\u003C/p\u003E\n"},{"CreatedByName":"The_Rocketeer","CreatedById":81727,"CreatedDateTime":"2016-06-06T16:35:16Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/60282-dchurchill/\u0026amp;do=hovercard\u0022 data-mentionid=\u002260282\u0022 href=\u0022%7B___base_url___%7D/index.php?/profile/60282-dchurchill/\u0022 rel=\u0022external\u0022\u003E@DChurchill\u003C/a\u003E, in what sense? I want the devs to bring out a bugfix release as soon as it\u0027s ready and not before... beyond that, mostly I just want forum posts to be accurate and fair \u003Cs\u003Erather than inaccurate and unfair\u003C/s\u003E. \u0026lt;\u0026lt; this read as a bit accusatory which it wasn\u0027t supposed to be.\u003Cbr\u003E\u003Cbr\u003E\nAnd, so far as possible, kindness would always be good too. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-06T16:37:32Z\u0022 title=\u002206/06/2016 04:37  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 6, 2016\u003C/time\u003E by The_Rocketeer\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Wallygator","CreatedById":97357,"CreatedDateTime":"2016-06-06T16:38:02Z","Content":"\n\u003Cp\u003E\nA possible constructive intervention here would be for a new forum section be established called \u0027General Complaining\u0022.  When a complaining thread is discovered, it can be moved into this new section by a moderator.  \n\u003C/p\u003E\n\u003Cp\u003E\nThe benefit of this would be that when anyone needs to get their \u0022fix\u0022 regarding reading about complaining, they know where to go and that ALL the threads will be there with out the clutter of other non-complaining threads. Also, complaints would then be filtered out of the general discussion section and the propensity of a \u0022fanboy pile-on\u0022 suffocating a valid complaint would be reduced.\n\u003C/p\u003E\n\u003Cp\u003E\nI think this a pretty good idea - with the caveat that there is a bug reporting process and tracker, blah blah blah... just in case someone wants to report details of an error instead of general complaining.\n\u003C/p\u003E\n\u003Cp\u003E\nAll the above said,\u003Cstrong\u003E\u003Cu\u003E I do not advocate a clampdown on general complaining\u003C/u\u003E\u003C/strong\u003E - complaints are a good temperature check regarding overall community satisfaction. More complaints helps drive up squads motivation to undertake improvements --\u0026gt; Because many complaints are not just bug related.\n\u003C/p\u003E\n"},{"CreatedByName":"DChurchill","CreatedById":60282,"CreatedDateTime":"2016-06-06T16:43:05Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222619153\u0022 data-ipsquote-contentid=\u0022141292\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221465230916\u0022 data-ipsquote-userid=\u002281727\u0022 data-ipsquote-username=\u0022The_Rocketeer\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nJust now, The_Rocketeer said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/60282-dchurchill/\u0026amp;do=hovercard\u0022 data-mentionid=\u002260282\u0022 href=\u0022%7B___base_url___%7D/index.php?/profile/60282-dchurchill/\u0022 rel=\u0022external\u0022\u003E@DChurchill\u003C/a\u003E I want the devs to bring out a bugfix release as soon as it\u0027s ready and not before...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis is the only reasonable answer, I expect that\u0027s exactly what they\u0027re doing. Poodling why things happened or why didn\u0027t things happen about anything else isn\u0027t going to do anything. I don\u0027t think anyone is dismissing complaints out of hand but at some point, you have to turn on the noise filter.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022This is broken! How did it happen?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022It\u0027s being worked on.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022It\u0027s still broken! Why?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022They\u0027re working on it.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022But it\u0027s broken!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nAd nauseam.\n\u003C/p\u003E\n"},{"CreatedByName":"The_Rocketeer","CreatedById":81727,"CreatedDateTime":"2016-06-06T16:53:26Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/60282-dchurchill/\u0026amp;do=hovercard\u0022 data-mentionid=\u002260282\u0022 href=\u0022%7B___base_url___%7D/index.php?/profile/60282-dchurchill/\u0022 rel=\u0022\u0022\u003E@DChurchill\u003C/a\u003E I\u0027m glad you approve, but did u mean to suggest that my comments about accuracy and fairness weren\u0027t reasonable? \u003Cimg alt=\u0022:huh:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 title=\u0022:huh:\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\nI agree with your general point, but I don\u0027t think that \u0027complaints about complaints\u0027 is really a solution - this sort of response just draws out the thread. Before my polls I was guilty of the same (check the last few pages of the pinned Grand 1.1 Discussion Thread), but I decided that rather than prolong the debate, it would be better and more constructive to simply gather attitudes in one place by poll. Of course the polls then drew their own fire from various malcontents.\u003Cbr\u003E\u003Cbr\u003E\nI still think by far the best way to deal with these rage-quits or flamers is just to ignore them if you disagree and let them fade away. The best responses (and the only really valid ones) are those that offer advice about how to resolve the issue or that simply state it\u0027s a known bug and Squad are aware. Moaning about people moaning just makes an awful lot of moaning, and I think nearly all of us are pretty sick of moaning in general (yes the irony of this sentence isn\u0027t wasted on me, but what can a guy do?).\n\u003C/p\u003E\n"},{"CreatedByName":"Malich","CreatedById":152798,"CreatedDateTime":"2016-06-06T16:59:16Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222619141\u0022 data-ipsquote-contentid=\u0022141292\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221465230549\u0022 data-ipsquote-userid=\u002281727\u0022 data-ipsquote-username=\u0022The_Rocketeer\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n18 minutes ago, The_Rocketeer said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/125662-snark/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022125662\u0022 href=\u0022%7B___base_url___%7D/index.php?/profile/125662-snark/\u0022 rel=\u0022external\u0022\u003E@Snark\u003C/a\u003E not that I disagree with your whole post - much good advice - but the \u0027KSP Since 1.1\u0027 poll I conducted (which I think is the only one that directly tackled the \u0027how often are you experiencing bugs\u0027 question) actually only showed a very small majority (\u0026lt;55%) having \u0027infrequent\u0027 bug problems, and a very large minority (\u0026gt;35%) having frequent bug problems. To dismiss these complaints out of hand for lack of evidence, or even suggest that such evidence doesn\u0027t exist, is a bit unfair.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nbut this comes down to what they are considering as bugs. The lower strength landing gear is not a bug as such but if people keep blowing up their gear and voted as \u0022regular bugs\u0022 it\u0027s not an accurate poll. \n\u003C/p\u003E\n\u003Cp\u003E\nI find myself in the \u0022some bugs but not enough to spoil my fun\u0022 camp. I get a get a couple of CTDs for every 8 or 9 hours of play time, usually early on in a session such as my first EVA or my first revision to a larger design. Its frustrating I agree and part of me wishes Squad had fixed it before releasing. I\u0027d have been happy puttering on with 1.0.5 for a bit longer. But we all saw the forum users complaining every time 1.1 was pushed back regardless of how many bugs were being reported. Sometimes any parent is going to cave and give their kid something if they complain enough even if they know it will cause more problems in the long run just to get a moment (or 3 weeks in Squad\u0027s case) of peace to gather their wits and get ready for the next round.\n\u003C/p\u003E\n\u003Cp\u003E\nDo \u0022Its broke.... fix it\u0022 posts help? No.\n\u003C/p\u003E\n\u003Cp\u003E\nDo \u0022You\u0027re broke, fix yourself\u0022 posts help? No.\n\u003C/p\u003E\n\u003Cp\u003E\nDo \u0022I\u0027m having XYZ problem, this is my bug report, anyone go any clues?\u0022 posts help? ... Maybe.\n\u003C/p\u003E\n\u003Cp\u003E\nThe game WILL get fixed. When it gets fixed depends on how much useful information Squad has to work with (Not a 20 year software engineer but accident investigations are part of my job and its a similar concept). \u0022It\u0027s broken\u0022 tells them nothing. \u0022On a clean install if I try to put a 3 way symmetry  round a part that is itself 4 way symmetry the VAB explodes and Jed dances the Macarenna!\u0022 gives a very specific, reproducible method that they can look in to.\n\u003C/p\u003E\n\u003Cp\u003E\nto my mind, and this is my opinion only, complaining about the problem, complaining about Squad and complaining about the complaining is part of the problem, not the solution. It\u0027s clogging the forums, its diluting the useful information.\n\u003C/p\u003E\n\u003Cp\u003E\nPlease, please, please for the love or god and puppies stop with the complaints and start with the information!\n\u003C/p\u003E\n"},{"CreatedByName":"Brainlord Mesomorph","CreatedById":110905,"CreatedDateTime":"2016-06-06T17:00:11Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222619106\u0022 data-ipsquote-contentid=\u0022141292\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221465229335\u0022 data-ipsquote-userid=\u0022125662\u0022 data-ipsquote-username=\u0022Snark\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n52 minutes ago, Snark said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAnd it shouldn\u0027t be, and Squad has been derelict in their duty for shipping software with so many bugs in it.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nTHIS.\n\u003C/p\u003E\n\u003Cp\u003E\nAs a professional developer. THIS. \n\u003C/p\u003E\n\u003Cp\u003E\nYes, bugs happen, but just don\u0027t ship it yet.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-06T17:01:24Z\u0022 title=\u002206/06/2016 05:01  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 6, 2016\u003C/time\u003E by Brainlord Mesomorph\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DChurchill","CreatedById":60282,"CreatedDateTime":"2016-06-06T17:00:43Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222619181\u0022 data-ipsquote-contentid=\u0022141292\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221465232006\u0022 data-ipsquote-userid=\u002281727\u0022 data-ipsquote-username=\u0022The_Rocketeer\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 minute ago, The_Rocketeer said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/60282-dchurchill/\u0026amp;do=hovercard\u0022 data-mentionid=\u002260282\u0022 href=\u0022%7B___base_url___%7D/index.php?/profile/60282-dchurchill/\u0022 rel=\u0022external\u0022\u003E@DChurchill\u003C/a\u003E I\u0027m glad you approve, but did u mean to suggest that my comments about accuracy and fairness weren\u0027t reasonable? \u003Cimg alt=\u0022:huh:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 title=\u0022:huh:\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNot at all. I was pointing out your reasonableness and agreeing. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThese kind of threads are the boards attempt to moderate itself. No one want\u0027s to stifle anyone, it\u0027s just that lots of people are getting tired of it. Thus my question, what do you expect to happen? If it\u0027s anything other than what you answered, it\u0027s unreasonable and unlikely to happen. All that\u0027s been acknowledged. Yes, it\u0027s broken. Yes, it\u0027s being fixed. What else is there to say?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2016-06-06T17:01:18Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222619196\u0022 data-ipsquote-contentid=\u0022141292\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221465232411\u0022 data-ipsquote-userid=\u0022110905\u0022 data-ipsquote-username=\u0022Brainlord Mesomorph\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 minute ago, Brainlord Mesomorph said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYes, bugs happen, but just don\u0027t ship it.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSo basically the customer never gets the product they paid for?\n\u003C/p\u003E\n\u003Cp\u003E\nSeems legit (as a professional developer).\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-06T17:01:51Z\u0022 title=\u002206/06/2016 05:01  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 6, 2016\u003C/time\u003E by regex\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DChurchill","CreatedById":60282,"CreatedDateTime":"2016-06-06T17:03:39Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222619196\u0022 data-ipsquote-contentid=\u0022141292\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221465232411\u0022 data-ipsquote-userid=\u0022110905\u0022 data-ipsquote-username=\u0022Brainlord Mesomorph\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 minutes ago, Brainlord Mesomorph said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nTHIS.\n\u003C/p\u003E\n\u003Cp\u003E\nAs a professional developer. THIS. \n\u003C/p\u003E\n\u003Cp\u003E\nYes, bugs happen, but just don\u0027t ship it yet.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSorry, I think you\u0027re wrong here. Especially since 1.0.5 is still there.\n\u003C/p\u003E\n"},{"CreatedByName":"severedsolo","CreatedById":80345,"CreatedDateTime":"2016-06-06T17:04:18Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222619141\u0022 data-ipsquote-contentid=\u0022141292\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221465230549\u0022 data-ipsquote-userid=\u002281727\u0022 data-ipsquote-username=\u0022The_Rocketeer\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n35 minutes ago, The_Rocketeer said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/125662-snark/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022125662\u0022 href=\u0022%7B___base_url___%7D/index.php?/profile/125662-snark/\u0022 rel=\u0022external\u0022\u003E@Snark\u003C/a\u003E not that I disagree with your whole post - much good advice - but the \u0027KSP Since 1.1\u0027 poll I conducted (which I think is the only one that directly tackled the \u0027how often are you experiencing bugs\u0027 question) actually only showed a very small majority (\u0026lt;55%) having \u0027infrequent\u0027 bug problems, and a very large minority (\u0026gt;35%) having frequent bug problems. To dismiss these complaints out of hand for lack of evidence, or even suggest that such evidence doesn\u0027t exist, is a bit unfair.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNot gonna argue with your figures, but you do have to take into account that people are less likely to take to the forums/complain/look at/vote in polls about bugs when everything is working ok.\n\u003C/p\u003E\n\u003Cp\u003E\nI don\u0027t really have a point, just pointing out human nature I guess.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-06T17:04:46Z\u0022 title=\u002206/06/2016 05:04  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 6, 2016\u003C/time\u003E by severedsolo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DChurchill","CreatedById":60282,"CreatedDateTime":"2016-06-06T17:08:33Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222619198\u0022 data-ipsquote-contentid=\u0022141292\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221465232478\u0022 data-ipsquote-userid=\u002270807\u0022 data-ipsquote-username=\u0022regex\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 minutes ago, regex said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSo basically the customer never gets the product they paid for?\n\u003C/p\u003E\n\u003Cp\u003E\nSeems legit (as a professional developer).\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou pre-ordered duke nukem, didn\u0027t ya. \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2016-06-06T17:09:21Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222619208\u0022 data-ipsquote-contentid=\u0022141292\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221465232913\u0022 data-ipsquote-userid=\u002260282\u0022 data-ipsquote-username=\u0022DChurchill\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nJust now, DChurchill said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYou pre-ordered duke nukem, didn\u0027t ya. \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHah, no, but I remember the lesson I learned from Mechwarrior 2 to this day.\n\u003C/p\u003E\n"}]}