{"TopicId":141493,"ForumId":70,"TopicTitle":"KSP 0 Parts bug?","CreatedByName":"KerbalKid","CreatedById":157390,"CreatedDateTime":"2016-06-09T07:39:33Z","PageNum":1,"Articles":[{"CreatedByName":"KerbalKid","CreatedById":157390,"CreatedDateTime":"2016-06-09T07:39:33Z","Content":"\n\u003Cp\u003E\nSo... i decided to go on the launch schedule and make satellites from the schedule\n\u003C/p\u003E\n\u003Cp\u003E\nbut when i created the satellite for my Ariane 5 i went to my Falcon 9 satellite and take a\n\u003C/p\u003E\n\u003Cp\u003E\nsatellite from there but when i went to my Ariane 5 save with my first satellite i created\n\u003C/p\u003E\n\u003Cp\u003E\nIt just said this 0 parts in 8 stages and when i try to open it, it does the normal you can launch it and save it yatayatayata but when i click\n\u003C/p\u003E\n\u003Cp\u003E\nthe launch button it says Craft Size Unknown! so i decided maybe it was just a glitch\n\u003C/p\u003E\n\u003Cp\u003E\nand i exited the VAB and exited to the main menu and went back into the save and i went\n\u003C/p\u003E\n\u003Cp\u003E\nback into the VAB and it still said 0 parts i even closed ksp and returned to the VAB it still says this! is there any way i can fix this? also i did use mods on the craft like tweakscale and infernal robotics\u003Cimg class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/g8tz46J.png\u0022 alt=\u0022g8tz46J.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"ortyblz","CreatedById":138454,"CreatedDateTime":"2016-06-09T13:56:41Z","Content":"\n\u003Cp\u003E\nI\u0027ve run into the same problem, and posted \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/141412-ship-in-vab-has-size0/\u0022 rel=\u0022\u0022\u003Ehere\u003C/a\u003E.  I believe this is a craft file corruption since the game runs smoothly after exiting the VAB, or even after loading other craft in the VAB that utilize the same mods (with the only exception being UKS parts on the ship that is broken, I believe).  But I haven\u0027t ruled out everything.  I also have Tweakscale but not IR on my craft.  Is this an issue with only one of your crafts or more?  Were you able to load the craft in the VAB and edit it?  I don\u0027t have a solution for this.  Anyone?\n\u003C/p\u003E\n"}]}