{"TopicId":141592,"ForumId":44,"TopicTitle":"Could Titan host life?","CreatedByName":"RenegadeRad","CreatedById":161008,"CreatedDateTime":"2016-06-11T05:50:31Z","PageNum":1,"Articles":[{"CreatedByName":"RenegadeRad","CreatedById":161008,"CreatedDateTime":"2016-06-11T05:50:31Z","Content":"\n\u003Cp\u003E\nBefore you read, please don\u0027t bash my points, I found them in my research, I am just curious and need someone\u0027s non rude opinion and discussion about it.      \n\u003C/p\u003E\n\u003Cp\u003E\nTitan, the largest moon of Saturn, is at present an open question and a topic of scientific assessment and research. Titan is far colder than Earth, and its surface lacks stable liquid water; factors whichhave led some scientists to consider life there unlikely. It has a methane cycle analouge to earths water cycle and there are many other factors and analogyies which argue it may host complex probiotic life. Some reasons I found in my research (source - wiki, I know it is not the most reliable source, but I just found it and need someone smart enough here to discuss this)\n\u003C/p\u003E\n\u003Cp\u003E\n1) The Miller–Urey experiment and several following experiments have shown that with an atmosphere similar to that of Titan and the addition of UV radiation, complex molecules and polymer substances like tholins can be generated. The reaction starts withdissociation of nitrogen and methane, forming hydrogen cyanide and acetylene. Further reactions have been studied extensively.\n\u003C/p\u003E\n\u003Cp\u003E\n2) In October 2010, Sarah Horst of the University of Arizona reported finding the five nucleotide bases—building blocks of DNA and RNA—among the many compounds produced when energy was applied to a combination of gases like those in Titan\u0027s atmosphere. Horst also found amino acids, the building blocks ofprotein. She said it was the first time nucleotide bases and amino acids had been found in such an experiment without liquid water being present.\n\u003C/p\u003E\n\u003Cp\u003E\n3) On April 3, 2013, NASA reported that complexorganic chemicals could arise on Titan based on studies simulating the atmosphere of Titan.\n\u003C/p\u003E\n\u003Cp\u003E\n4) Laboratory simulations have led to the suggestion that enough organic material exists on Titan to start a chemical evolution analogous to what is thought to have started life on Earth. Although the analogy assumes the presence of liquid water for longer periods than is currently observable, several theories suggest that liquid water from an impact could be preserved under a frozen isolation layer. it has also been theorized that liquid-ammonia oceans could exist deep below the surface. Another model suggests an ammonia–water solution as much as 200 kilometres (120 mi) deep beneath a water-ice crust with conditions that, although extreme by terrestrial standards, are such that life could indeed survive. Heat transfer between the interior and upper layers would be critical in sustaining any subsurface oceanic life. Detection of microbial life on Titan would depend on its biogenic effects. That the atmospheric methane and nitrogen might be of biological origin has been examined, for example.\n\u003C/p\u003E\n\u003Cp\u003E\n5) It has been suggested that life could exist in the lakes of liquid methane on Titan, just as organisms on Earth live in water. Such organisms would inhale H2 in place of O2, metabolize it with acetylene instead ofglucose, and exhale methane instead of carbon dioxide.\n\u003C/p\u003E\n\u003Cp\u003E\n6) Although all living things on Earth (including methanogens) use liquid water as a solvent, it is speculated that life on Titan might instead use a liquid hydrocarbon, such as methane or ethane. Water is a stronger solvent than methane. However, water is also more chemically reactive, and can break down large organic molecules throughhydrolysis. A life-form whose solvent was a hydrocarbon would not face the risk of its biomolecules being destroyed in this way.\n\u003C/p\u003E\n\u003Cp\u003E\n7) In 2005, astrobiologist Chris McKay argued that if methanogenic life did exist on the surface of Titan, it would likely have a measurable effect on the mixing ratio in the Titan troposphere: levels of hydrogen and acetylene would be measurably lower than otherwise expected.\n\u003C/p\u003E\n\u003Cp\u003E\n8) In 2010, Darrell Strobel, from Johns Hopkins University, identified a greater abundance of molecular hydrogen in the upper atmospheric layers of Titan compared to the lower layers, arguing for a downward flow at a rate of roughly 1025 molecules per second and disappearance of hydrogen near Titan\u0027s surface; as Strobel noted, his findings were in line with the effects McKay had predicted ifmethanogenic life-forms were present. Same year, another study showed low levels of acetylene on Titan\u0027s surface, which were interpreted by McKay as consistent with the hypothesis of organisms consuming hydrocarbons. Although restating the biological hypothesis, he cautioned that other explanations for the hydrogen and acetylene findings are more likely: the possibilities of yet unidentified physical or chemical processes (e.g. a surface catalyst accepting hydrocarbons or hydrogen), or flaws in the current models of material flow. Composition data and transport models need to be substantiated, etc. Even so, despite saying that a non-biological catalytic explanation would be less startling than a biological one, McKay noted that the discovery of a catalyst effective at 95 K (−180 °C) would still be significant.\n\u003C/p\u003E\n\u003Cp\u003E\n9) As NASA notes in its news article on the June 2010 findings: \u0022To date, methane-based life forms are only hypothetical. Scientists have not yet detected this form of life anywhere. As the NASA statement also says: \u0022some scientists believe these chemical signatures bolster the argument for a primitive, exotic form of life or precursor to life on Titan\u0027s surface.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n10) In February 2015, a hypothetical cell membrane capable of functioning in liquidmethane in Titan conditions was modeled. Composed of small molecules containing carbon, hydrogen, and nitrogen, it would have the same stability and flexibility as cell membranes on Earth, which are composed ofphospholipids, compounds of carbon, hydrogen, oxygen, and phosphorus. This hypothetical cell membrane was termed an \u0022azotosome\u0022, a combination of \u0022azote\u0022, French for nitrogen, and \u0022liposome\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\n11) Despite these biological possibilities, there are formidable obstacles to life on Titan, and any analogy to Earth is inexact. At a vast distance from the Sun, Titan is frigid, and its atmosphere lacks CO2. At Titan\u0027s surface, water exists only in solid form. Because of these difficulties, scientists such as Jonathan Lunine have viewed Titan less as a likely habitat for life, than as an experiment for examining theories on the conditions that prevailed prior to the appearance of life on Earth. Although life itself may not exist, the prebiotic conditions on Titan and the associated organic chemistry remain of great interest in understanding the early history of the terrestrial biosphere. As a prebiotic experiment involves not only observation through spacecraft, but laboratory experiments, and chemical and photochemical modeling on Earth.\n\u003C/p\u003E\n\u003Cp\u003E\nTL\u0027DR \u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSo, what do you think?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-11T05:51:18Z\u0022 title=\u002206/11/2016 05:51  AM\u0022 data-short=\u00228 yr\u0022\u003EJune 11, 2016\u003C/time\u003E by RenegadeRad\u003C/strong\u003E\n\u003Cbr\u003EDamn autocorrect\n\u003C/span\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2016-06-11T06:31:25Z","Content":"\n\u003Cp\u003E\nWe will only know when we send a lander there with the proper experiments.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-11T08:04:53Z\u0022 title=\u002206/11/2016 08:04  AM\u0022 data-short=\u00228 yr\u0022\u003EJune 11, 2016\u003C/time\u003E by Nibb31\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RenegadeRad","CreatedById":161008,"CreatedDateTime":"2016-06-11T07:22:02Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222626216\u0022 data-ipsquote-contentid=\u0022141592\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221465626685\u0022 data-ipsquote-userid=\u00227272\u0022 data-ipsquote-username=\u0022Nibb31\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n50 minutes ago, Nibb31 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWe will only know when we send a lander there.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis is not the real Nibb31! I heard the smart fellow says something interesting without procrastinating the points! \u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nBut, you have a point. From wiki -\u0022Although the Cassini–Huygens mission was not equipped to provide evidence forbiosignatures or complex organic compounds, it showed an environment on Titan that is similar, in some ways, to ones theorized for the primordial Earth. Scientists surmise that the atmosphere of early Earth was similar in composition to the current atmosphere on Titan, with the important exception of a lack of water vapor on Titan.\u0022\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-11T07:24:36Z\u0022 title=\u002206/11/2016 07:24  AM\u0022 data-short=\u00228 yr\u0022\u003EJune 11, 2016\u003C/time\u003E by RenegadeRad\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2016-06-11T08:16:49Z","Content":"\n\u003Cp\u003E\nYou wouldn\u0027t really want water. Actually, any polar molecules are useless at these temperatures. Life is a delicate balance of bonds that are strong enough to hold things together, yet weak enough to be pulled apart with the right enzymes. Take DNA to cryogenic temperatures of Titan, and you couldn\u0027t replicate it no matter what sort of complex chemistry you throw at it. The bonds are simply too strong at that temperature, and anything that could pull them apart freezes.\n\u003C/p\u003E\n\u003Cp\u003E\nOn the other hand, Titan\u0027s temperature is just right for non-polar solvents, just like Earth\u0027s is just right for polar solvents. And hey, look at that, we have methane lakes there with environment that\u0027s just perfect for harboring life at these temperatures.\n\u003C/p\u003E\n\u003Cp\u003E\nNow for the finer points. Right of the bat, we are dramatically limiting the kinds of compounds we could possibly use for life on Titan. Is that a critical problem? No way to know, but I\u0027d bet this is the sort of thing that would increase amount of time needed for life to evolve. So will temperature, by the way. There is absolutely no way of getting around the fact that metabolism on Titan is going to be painfully slow. Meaning a long time, by Earth standards, between generations of anything living. Means evolution will be very slow.\n\u003C/p\u003E\n\u003Cp\u003E\nOn the net, I would certainly say life there is possible. Conditions are right, and all the signs we expect to be able to detect of potential life are there. But as Nibb31 says, without getting a lander there that\u0027s dedicated to life search, we aren\u0027t going to find out.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThat said, I think discovery of life on Titan would be by far the greatest discovery of human kind. If we find life on Mars, it\u0027d take a lot of work to prove that it doesn\u0027t have common origin with Earth\u0027s life. So even if we know that life exists her on Earth and either does or did exist on the Red Planet, we\u0027d still not be any wiser about life out there. If we find life on Titan, we\u0027ll know with absolute certainty that life evolved independently on two very different bodies in this Solar System. This would tell us beyond doubt that we are not alone in the universe. That in fact, it is filled with all kind of life.\n\u003C/p\u003E\n\u003Cp\u003E\nSo even if we consider life on Titan to be rather unlikely, we owe it to ourselves to check, because if it\u0027s there, we need to know.\n\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2016-06-11T08:23:37Z","Content":"\n\u003Cp\u003E\nTo answer the title: Yes.\n\u003C/p\u003E\n\u003Cp\u003E\nTo answer the post: Yes, it could. No, we can\u0027t know if it does until we actually look though.\n\u003C/p\u003E\n"},{"CreatedByName":"Spaceception","CreatedById":152800,"CreatedDateTime":"2016-06-11T12:30:03Z","Content":"\n\u003Cp\u003E\nI certainly think so.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd in the far future when we\u0027re colonizing it, Titan\u0027s methane seas will be under strict protection so we don\u0027t disturb its life \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-06-11T13:09:03Z","Content":"\n\u003Cp\u003E\nNo, not just because of the temperature, but because of something K2 did not mention. On earth you have a polar solvent and non-polar solvent. Polar solvents are mostly limited to above the freezing point of salt water. Non-polar solvents can really exist at any temperature above the freezing point of methane gas, there are non-polar solvents for all seasons. Life is strung between the two,literally. Problem is at liq.methane temperatures there are no polar solvents. Protein folding, polar/non-polar interactions.\n\u003C/p\u003E\n\u003Cp\u003E\n2nd problem is that organic reactions increase rate with 2x for every 10\u0027C. There have been some molecular biologist that claim, basically between -20\u0027C and -50\u0027C even if you put the very best cryogenic agents, everything comes to a dead stop.\n\u003C/p\u003E\n\u003Cp\u003E\n3rd problem, the ever defining lipid bilayers, they don\u0027t like temperatures below -20\u0027C\n\u003C/p\u003E\n\u003Cp\u003E\nThats the short list of reasons.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nGeothermal vents deep under the frozen shell of water on Titan, you might find poorly developed life, life deep in its crust. There is enough atmosphere, it would utilize sulfites and nitrites  and be turned over but the latent heat in the crust, but given titans small size there may not be much. Titan, basically is strung together because of it distance from the sun, in a volatile substance trap for things that are liberated from passing comets and from planets of the inner solar system (like mercury, venus and mars). If there was substantial heat coming from its core it would evolve more gas. So I think life on titan would be hard to find and fragile. Human life on titan. I would just remind that at liquid methane/nitrogen temperatures, its as hard as hell to keep the cold out, liquid anything colder than water burns the skin and fast.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"RenegadeRad","CreatedById":161008,"CreatedDateTime":"2016-06-11T13:41:42Z","Content":"\n\u003Cp\u003E\nMaybe, Just maybe the species would be extremophilic bacterium? kinda like Deinococcus radiodurans? We usually make a hypothesis upon how \u003Cem\u003Eour\u003C/em\u003E world works. Maybe life out there can develop in unimaginable conditions life which here would not develop because we are limited to such conditions, and they are limited to \u003Cem\u003Eour\u003C/em\u003E conditions?\n\u003C/p\u003E\n\u003Cp\u003E\nAccording to Dr. Ian Malcolm - \u0022Life, uh, finds a way...\u0022\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-11T13:43:25Z\u0022 title=\u002206/11/2016 01:43  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 11, 2016\u003C/time\u003E by RenegadeRad\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-06-11T14:44:32Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222626492\u0022 data-ipsquote-contentid=\u0022141592\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221465652502\u0022 data-ipsquote-userid=\u0022161008\u0022 data-ipsquote-username=\u0022RenegadeRad\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n50 minutes ago, RenegadeRad said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMaybe, Just maybe the species would be extremophilic bacterium? kinda like Deinococcus radiodurans? We usually make a hypothesis upon how \u003Cem\u003Eour\u003C/em\u003E world works. Maybe life out there can develop in unimaginable conditions life which here would not develop because we are limited to such conditions, and they are limited to \u003Cem\u003Eour\u003C/em\u003E conditions?\n\u003C/p\u003E\n\u003Cp\u003E\nAccording to Dr. Ian Malcolm - \u0022Life, uh, finds a way...\u0022\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe problem is, and we take advantage of this in the lab, that below -10\u0027C biological reactions slow to hideous rates. In a glycerol for example, enzymes can be kept active in freezer for years at around -20\u0027c, not frozen but also active at such a low rate they are essentially stopped. To preserve cells you can keep them alive in DMSO at below -50\u0027c for a long time, and in liquid nitrogen essentially forever. The biggest problem for cells are the membranes, which are largely non-polar in nature. Basically below -50\u0027C everything stops. Life requires complexity, but below -50\u0027C all the complex components are essentially stopped, not active, and limited to diffusion at slow rates, redox reactions (the back bone of energy production in living organisms), the overwhelming majority would take millions of years to complete.\n\u003C/p\u003E\n\u003Cp\u003E\nThere is a zone between 10\u0027C and around -10\u0027C where you can have super organisms, such as found in the ocean. This is because they live off of reduced oxidation and they tend to accumulate oil (very difficult to burn at such low temperatures). Animals that live at these temperatures tend to accumulate alot of fat, particularly the omega-3 fats as these are very cold tolerant fats. Because of the low rates of oxidation they tend not to age, and tend to grow extremely large, but that -10\u0027C is a critical point because of the rate of metabolism gets too low, such organisms become prey to warm blooded air-breathing creatures with large stores of insulating fat. below -20\u0027C the cryoprotectants required become so profound that systems cannot function, DNA cannot replicate, all kinds of bad things. Of course their can allways be something that can be active at -30\u0027C, but much below that, no.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2016-06-12T00:55:50Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222626463\u0022 data-ipsquote-contentid=\u0022141592\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221465650543\u0022 data-ipsquote-userid=\u0022107380\u0022 data-ipsquote-username=\u0022PB666\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 hours ago, PB666 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNo, not just because of the temperature, but because of something K2 did not mention. On earth you have a polar solvent and non-polar solvent. Polar solvents are mostly limited to above the freezing point of salt water. Non-polar solvents can really exist at any temperature above the freezing point of methane gas, there are non-polar solvents for all seasons. Life is strung between the two,literally. Problem is at liq.methane temperatures there are no polar solvents. Protein folding, polar/non-polar interactions.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nPolar connections between molecules are only necessary because they have to stand up to the 300K environment. You simply don\u0027t need bonds that strong at 90K. What you need is a range of bonds that are very weak to very strong at a given temperature, and at 90K you have that range.\n\u003C/p\u003E\n\u003Cp\u003E\nMetabolic rates do, in fact, change exponentially with temperature. But our rates are limited by energy flow primarily. A human body has full capacity to self-combust, purely in terms of how fast it can consume hydrocarbons if it throws all its enzymes at it. That\u0027s several orders of magnitude on normal rates. We have regulatory mechanisms to slow it down, because waste heat is a problem. So we have that overhead unused here on Earth. I would still expect fastest metabolism on Titan to be no faster than hundredth or even thousandth of that on Earth, but who cares? Life there has nothing to compete with, all geological changes are equally glacial, and energy flow allows for just these sort of rates anyhow.\n\u003C/p\u003E\n\u003Cp\u003E\nThere is no question that life that can exist on Titan can be engineered in principle. Environment is compatible with a form of life. What it comes down to, can life evolve over a few billion years on a moon where all processes are going to be a thousand times slower, and variety in available organic compounds is dramatically less.\n\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-06-12T13:59:34Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222627182\u0022 data-ipsquote-contentid=\u0022141592\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221465692950\u0022 data-ipsquote-userid=\u002257710\u0022 data-ipsquote-username=\u0022K^2\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n12 hours ago, K^2 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nPolar connections between molecules are only necessary because they have to stand up to the 300K environment. You simply don\u0027t need bonds that strong at 90K. What you need is a range of bonds that are very weak to very strong at a given temperature, and at 90K you have that range.\n\u003C/p\u003E\n\u003Cp\u003E\nMetabolic rates do, in fact, change exponentially with temperature. But our rates are limited by energy flow primarily. A human body has full capacity to self-combust, purely in terms of how fast it can consume hydrocarbons if it throws all its enzymes at it. That\u0027s several orders of magnitude on normal rates. We have regulatory mechanisms to slow it down, because waste heat is a problem. So we have that overhead unused here on Earth. I would still expect fastest metabolism on Titan to be no faster than hundredth or even thousandth of that on Earth, but who cares? Life there has nothing to compete with, all geological changes are equally glacial, and energy flow allows for just these sort of rates anyhow.\n\u003C/p\u003E\n\u003Cp\u003E\nThere is no question that life that can exist on Titan can be engineered in principle. Environment is compatible with a form of life. What it comes down to, can life evolve over a few billion years on a moon where all processes are going to be a thousand times slower, and variety in available organic compounds is dramatically less.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThermodynamics is the driving force of life, but to achieve thermodynamic potential one has to overcome kinetic energy barriers. Enzymes do this by lowering the transition state energy maximum that would otherwise be overcome by alternative reactions or slower rate or higher temperature. Without self replicating catalysis of the system there can be no life. To have it you have to have a system that can do this. As far as I know, no such low transition energy tolerant system exists. Thermodynamics is the driving force, but kinetics makes it possible. What are the energy drivers. ADP ---\u0026gt; ATP and NADP (NAD) -------\u0026gt; NADPH (NADH).  These absolutely do not have to be the drivers, but the problem is that at very low temperatures you cannot have the energy per bond that you can get at higher temperatures. The particular problem is the H: moiety, without it one would find it excessively difficult to polymerize. But at those energies you do not have the ability to overcome the kinetic barriers. The only two enzymes that we know of are RNA and protiens, both need an environment containing water. Of the two proteins are most potent, anyone who studies X-ray crystallography knows that enymes are surrounded by water and frequently are involved in the transtion state themselves, many of the most potent enzymes have metal cofactors in the binding site, and rely on the transition state oxidation states and complex non-covelant bond structure to achieve catalysis in which water participates in those reactions. The potency of these reactions elevates rate, and also elevates the rate of evolution. In Eucaryotes this is particularly important because the electron transport chain is a major source of mutations that drive evolution and a major impetus for recombinative replciation versus simple fission.\n\u003C/p\u003E\n\u003Cp\u003E\nThere is an idea in evolution that the rate of evolutionary diversification occurs fastest in the tropics. The driving force of evolution is light and permissive heat, for example one way animals survive in cold climate is to go into dormancy. The thermodynamic potential created by wavelengths that create transition state radicals is what drives very precise energy flow from hv into conversion of O-H bonds X-H bonds. This then is the major driver of the rest of the ecosystem. If you look at the lowest boiling point alcohols, around -100c. But these do not crystallize like water, but go through an amorphous transition state at very low temperatures, for example at  below −78.5\u0027C (the temperature of dry ice), 100% ethanol becomes thick like honey. So that our lowest potential OH bond now diffuses at an incredibly slow rate even before reaching. However at very low diffusion rates its difficult to transfer energy. Therefore the ability to use X-H bonds or build X-H bonds at such temperatures is limited.\n\u003C/p\u003E\n\u003Cp\u003E\nAgain, you might find something, a reaction or an interaction below -50\u0027C but it won\u0027t be complex, you wont find systems, and whatever you find, compared to Earth, would be unevolved, because it lacks two driving principles, thermodynamics (hv in sunlight) and permissive kinetics. The thermodynamics of titans limits the energy of bond formation, and the kinetics limits the rate life evolves. The fact that Titan is relatively small, means that its interior and mineral crust is probably rock solid and cold. Not the conditions that would predict life. Given it a pass.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://en.wikipedia.org/wiki/Europa_%28moon%29\u0022 title=\u0022Europa (moon)\u0022 rel=\u0022external nofollow\u0022\u003EEuropa\u003C/a\u003E , \u003Ca href=\u0022https://en.wikipedia.org/wiki/Enceladus\u0022 title=\u0022Enceladus\u0022 rel=\u0022external nofollow\u0022\u003EEnceladus\u003C/a\u003E maybe. I still think people are over enthusiastic about the potential, but since the subsurface volcanic potentials of both are black swans, the outer ends of probability suggest that a finding of life would not be entirely unexpected.\n\u003C/p\u003E\n"},{"CreatedByName":"autumnalequinox","CreatedById":114782,"CreatedDateTime":"2016-06-12T19:29:37Z","Content":"\n\u003Cp\u003E\nI\u0027ve always liked the idea of Titan \u0022lava life\u0022...if it turns out Titan is still geologically active (there is a compelling theory that it isn\u0027t:   \u003Cspan style=\u0022color:rgb(37,37,37);font-family:sans-serif;font-size:12.6px;font-style:normal;font-variant:normal;font-weight:normal;letter-spacing:normal;line-height:20.16px;text-align:left;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;float:none;\u0022\u003E\u003Cspan\u003E \u003C/span\u003E\u003C/span\u003E\u003Cspan style=\u0022color:rgb(37,37,37);font-family:sans-serif;font-size:12.6px;font-style:normal;font-variant:normal;font-weight:normal;letter-spacing:normal;line-height:20.16px;text-align:left;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;\u0022\u003E\u003Ccite style=\u0022font-style:inherit;\u0022\u003EMoore, J.M.; Pappalardo, R.T. (2008). \u0022Titan: Callisto With Weather?\u0022.\u003Cspan\u003E \u003C/span\u003E\u003Ci\u003EAmerican Geophysical Union, Fall Meeting 2008\u003C/i\u003E\u003Cspan\u003E \u003C/span\u003E\u003Cb\u003E11\u003C/b\u003E: 6.)\u003C/cite\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022color:rgb(37,37,37);font-family:sans-serif;font-size:12.6px;font-style:normal;font-variant:normal;font-weight:normal;letter-spacing:normal;line-height:20.16px;text-align:left;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;\u0022\u003E\u003Ccite style=\u0022font-style:inherit;\u0022\u003EThe energy potential is there near cryo-volcanic hotspots.  If any active surface flows can be detected and a probe sent there, well, that could be the good stuff.  But there are obviously way more informed posters in this thread. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/cite\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2016-06-13T03:04:39Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222627732\u0022 data-ipsquote-contentid=\u0022141592\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221465739974\u0022 data-ipsquote-userid=\u0022107380\u0022 data-ipsquote-username=\u0022PB666\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n12 hours ago, PB666 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThermodynamics is the driving force of life, but to achieve thermodynamic potential one has to overcome kinetic energy barriers.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhich are several orders of magnitude lower for reactions we are considering. Organic chemistry on Titan would be completely different. You keep using examples of molecules we see in living things here, but that\u0027s just stupid. Yes, these will all be frozen solid. But there are plenty of compounds that are a gas at Earth temperatures, which will allow for interesting complexes that can perform all the same functions, because their bonds, and consequently energy barriers, are so much lower.\n\u003C/p\u003E\n\u003Cp\u003E\nEssentially, everywhere you see hydrogen bonds in Earth chemistry, you want to use van der Waals interactions in Titan chemistry. If you do the math on typical reaction rates with that taken into consideration, you\u0027ll see that you can have things happening at merely 100th or so of Earth rates.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, as a general rule of thumb, if you are trying to make a thermodynamics argument when debating with a physicists, double-check your figures. This is the first thing we consider when we talk about viability of absolutely anything.\n\u003C/p\u003E\n\u003Cp\u003E\nIf I was going to take your argument at face value and expand on it, I would be saying something along the lines of, \u0022There can be no rivers on Titan. That would require precipitation, and we know that rate of evaporation drops exponentially with temperature, so you couldn\u0027t get enough moisture in the atmosphere for sufficient precipitation to occur.\u0022 Except, methane evaporates just fine under these conditions, because methane has much weaker bonds holding molecules together. Enough so to mostly offset the temperature difference. Which is why landscape of Titan looks almost terrestrial. Same exact thing applies to chemistry, because it\u0027s about the same thermodynamics in the end. Temperatures are lower, but so is absolutely every barrier that needs to be broken.\n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2016-06-13T04:02:55Z","Content":"\n\u003Cp\u003E\nHost - of course, create - unlikely.\n\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2016-06-13T07:15:16Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222627732\u0022 data-ipsquote-contentid=\u0022141592\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221465739974\u0022 data-ipsquote-userid=\u0022107380\u0022 data-ipsquote-username=\u0022PB666\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n17 hours ago, PB666 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe potency of these reactions elevates rate, and also elevates the rate of evolution. In Eucaryotes this is particularly important because the electron transport chain is a major source of mutations that drive evolution and a major impetus for recombinative replciation versus simple fission.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n#1) Only in rare cases is the rate of mutation the limiting step of evolution. The mutation rate must be kept low so that indicidual mutations can be segregated and selected. Selection pressure and conditions are limiting, not mutation rate.\n\u003C/p\u003E\n\u003Cp\u003E\n#2) ROS production by the mitochondrial ETC primarily causes damage to mitochondrial DNA, it doesn\u0027t drive mutation in the nuclear genome.\n\u003C/p\u003E\n\u003Cp\u003E\nMitochondrial do not undergo \u0022recombinative replication\u0022 and do basically undergo simple fission... so your statement here is just BS... as are the earlier arguments the K^2 addressed.\n\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-06-13T16:42:09Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222628754\u0022 data-ipsquote-contentid=\u0022141592\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221465802116\u0022 data-ipsquote-userid=\u002291917\u0022 data-ipsquote-username=\u0022KerikBalm\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, KerikBalm said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n#1) Only in rare cases is the rate of mutation the limiting step of evolution. The mutation rate must be kept low so that indicidual mutations can be segregated and selected. Selection pressure and conditions are limiting, not mutation rate.\n\u003C/p\u003E\n\u003Cp\u003E\n#2) ROS production by the mitochondrial ETC primarily causes damage to mitochondrial DNA, it doesn\u0027t drive mutation in the nuclear genome.\n\u003C/p\u003E\n\u003Cp\u003E\nMitochondrial do not undergo \u0022recombinative replication\u0022 and do basically undergo simple fission... so your statement here is just BS... as are the earlier arguments the K^2 addressed.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhere did I say mitochondria or bacteria could not undergo recombination. Meiosis is built largely into eucaryotic replicative system, and bacteria recombination is largely opportunistic. That means that in complex eucaryotes, life span is driven by then needs of recombination, in bacteria, lifespan is largely irrelevant.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EYour statement about ROS is wrong\u003C/strong\u003E. ROS production does damage eucaryotic DNA, and it is the major reason for the production of thioredoxin and glutathion within the cell, a process that requires energy expenditure in order to neutralize free radicals and prevent them from damaging cytosolic machinary. The redox potential inside the cytosol is maintained at -240 mV when the cell is proliferating and DNA is replicating.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12px;\u0022\u003ERedox environment of the cell as viewed through the redox state of the glutathione disulfide/glutathione couple.\u003Ca href=\u0022http://www.ncbi.nlm.nih.gov/pubmed/?term=Schafer%20FQ%5BAuthor%5D\u0026amp;cauthor=true\u0026amp;cauthor_uid=11368918\u0022 rel=\u0022external nofollow\u0022\u003ESchafer FQ\u003C/a\u003E\u003Csup\u003E1\u003C/sup\u003E, \u003Ca href=\u0022http://www.ncbi.nlm.nih.gov/pubmed/?term=Buettner%20GR%5BAuthor%5D\u0026amp;cauthor=true\u0026amp;cauthor_uid=11368918\u0022 rel=\u0022external nofollow\u0022\u003EBuettner GR\u003C/a\u003E.\u003Ca href=\u0022http://www.ncbi.nlm.nih.gov/pubmed/11368918#\u0022 title=\u0022Open/close author information list\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan\u003EAuthor information\u003C/span\u003E\u003C/a\u003E\u003C/span\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003ERedox state is a term used widely in the research field of free radicals and oxidative stress. Unfortunately, it is used as a general term referring to relative changes that are not well defined or quantitated. In this review we provide a definition for the redox environment of biological fluids, cell organelles, cells, or tissue. We illustrate how the reduction potential of various redox couples can be estimated with the Nernst equation and show how pH and the concentrations of the species comprising different redox couples influence the reduction potential. We discuss how the redox state of the glutathione disulfide-glutathione couple (GSSG/2GSH) can serve as an important indicator of redox environment. There are many redox couples in a cell that work together to maintain the redox environment; the GSSG/2GSH couple is the most abundant redox couple in a cell. Changes of the half-cell reduction potential (E(hc)) of the GSSG/2GSH couple appear to correlate with the biological status of the cell: proliferation E(hc) approximately -240 mV; differentiation E(hc) approximately -200 mV; or apoptosis E(hc) approximately -170 mV. These estimates can be used to more fully understand the redox biochemistry that results from oxidative stress. These are the first steps toward a new quantitative biology, which hopefully will provide a rationale and understanding of the cellular mechanisms associated with cell growth and development, signaling, and reductive or oxidative stress.\u003C/span\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EPMID:11368918\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nCatching the species before they leave the mitochondria is also important.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOMIM:\u003Ca href=\u0022http://omim.org/entry/133540\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://omim.org/entry/133540 \u0022\u003C/a\u003E All 6 presented with the congenital severe phenotype that included severe failure to thrive, severe mental retardation, congenital cataracts, loss of adipose tissue, joint contractures, distinctive face with small, deep-set eyes and prominent nasal bridge, kyphosis, and cachectic dwarfism.\u0022 \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://en.wikipedia.org/wiki/ERCC6\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/ERCC6\u003C/a\u003E does both.\n\u003C/p\u003E\n\u003Cp\u003E\nWe can contrast with the environment outside the cell in Seawater of 300 to 500 mV a difference of 1/2 to 1 volt in potential. And the extracellular environment.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12px;\u0022\u003EFree Radic Biol Med. 2000 Feb 15;28(4):625-35. Redox state of glutathione in human plasma. Jones DP1, Carlson JL, Mody VC, Cai J, Lynn MJ, Sternberg P. Thiol and disulfide forms of glutathione (GSH) and cysteine (Cys) were measured in plasma from 24 healthy individuals aged 25-35 and redox potential values (E(h)) for thiol/disulfide couples were calculated using the Nernst equation. Although the concentration of GSH (2.8 \u002B/- 0.9 microM) was much greater than that of GSSG (0.14 \u002B/- 0.04 microM), the redox potential of the GSSG/2GSH pool (-137 \u002B/- 9 mV) was considerably more oxidized than values for tissues and cultured cells (-185 to -258 mV). This indicates that a rapid oxidation of GSH occurs upon release into plasma. The difference in values between individuals was remarkably small, suggesting that the rates of reduction and oxidation in the plasma are closely balanced to maintain this redox potential. The redox potential for the Cys and cystine (CySS) pool (-80 \u002B/- 9 mV) was 57 mV more oxidized, showing that the GSSG/2GSH and the CySS/2Cys pools are not in redox equilibrium in the plasma. Potentials for thiol/disulfide couples involving CysGly were intermediate between the values for these couples. Regression analyses showed that the redox potentials for the different thiol/disulfide couples within individuals were correlated, with the E(h) for CySS-mono-Gly/(Cys. CysGly) providing the best correlation with other low molecular weight pools as well as protein disulfides of GSH, CysGly and Cys. These results suggest that E(h) values for GSSG/2GSH and CySS-mono-Gly/(Cys. CysGly) may provide useful means to quantitatively express the oxidant/antioxidant balance in clinical and epidemiologic studies.\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhile there is a thousand papers on the topic. The point is that the Host cell has numerous mechanisms.\n\u003C/p\u003E\n\u003Cp\u003E\n1. Scavenging - NADPH / thioredoxin / \u003Ca href=\u0022https://en.wikipedia.org/wiki/Thioredoxin_reductase\u0022 title=\u0022Thioredoxin reductase\u0022 rel=\u0022external nofollow\u0022\u003Ethioredoxin reductase\u003C/a\u003E, based reduction of glutathion\u003Cbr\u003E\n2. Repair - ERCC6 base-pair excision and replace, collectively UV radiation, free radical damage repair.\n\u003C/p\u003E\n\u003Cp\u003E\nAnn Hepatol. 2016 Mar-Apr;15(2):160-73. doi: 10.5604/16652681.1193701.\u003Cbr\u003E\nAm J Physiol Lung Cell Mol Physiol. 2015 Dec 1;309(11):L1367-75. doi: 10.1152/ajplung.00236.2015. Epub 2015 Oct 2.\n\u003C/p\u003E\n\u003Cp\u003E\nAs Redox related mitochondrial produced DNA damage as a process of the inflammasome and apoptosis.\u003Cbr\u003E\nRedox Biol. 2015 Dec;6:472-85. doi: 10.1016/j.redox.2015.09.005. Epub 2015 Sep 10.\u003Cbr\u003E\nCell Biol Int. 2016 Feb;40(2):166-76. doi: 10.1002/cbin.10549. Epub 2015 Oct 13.\u003Cbr\u003E\nJ Biol Chem. 2015 Nov 6;290(45):27425-37. doi: 10.1074/jbc.M115.667063. Epub 2015 Sep 28.\n\u003C/p\u003E\n\u003Cp\u003E\nThe most important thing here, is that when the protective machinery inside the cells is turned off, the cells degrade, this is often part of immune drive apoptosis. But more importantly, if the body consider the cells defective or infected, the immune system cannot often distinguish the two (a partial impetus for autoimmune disease - as a result you will read about ROS involved in autoimmune disease, and may be an impetus for anti-DNA antibodies in lupus), the ROS route of cell death is advantageous because it places infecting cells (i.e anaerobes and facultative anaerobes) at risk.\n\u003C/p\u003E\n\u003Cp\u003E\nIt should be noted that one paper postulated that because the rate of metabolism for heat production is higher in colder climates, that is the reason why mammalian cold climate species evolve slightly faster (this has been observed in human mitochondria, with slowest rates of evolution in Africa (L5 branch) and fastest rates of evolution for people who passed through temperate or arctic climate, B and D1-4 branches), resulting in the purifying selection/directional evolution arguement), but by the same token, tend to go extinct more quickly. Contrarily there is the potency that replicative machinery makes no mistakes and is completely protective from ROS. My own unpublished studies revealed that the number of mutations at rarely mutated sites increased with land travel distances from L5, the highest being the route through Beringia to South America, with a mean DT between L0k lineage of greater than 2.6 million years (about 10 times faster than expected and there were several lineages of comparable age) for the 3 of 20 bins that contained sites evolved most slowly in eutheria. In each of these bins there where 100s of mutations detected, the fastest rate of change was in the Arctic peoples, thus it appears the ROS activity and direction and purifying selection all acted on evolution of mtDNA. \n\u003C/p\u003E\n\u003Cp\u003E\nComp Biochem Physiol A Mol Integr Physiol. 2002 Aug;132(4):739-61.\u003Cbr\u003E\nProc Biol Sci. 2009 Oct 7;276(1672):3447-55. doi: 10.1098/rspb.2009.0752. Epub 2009 Jul 8.\u003Cbr\u003E\nBiochem J. 2007 Jun 1;404(2):345-51.\n\u003C/p\u003E\n\u003Cp\u003E\nWright, S., Keeling, J., and Gillman, L. (2006). The road from Santa Rosalia: A faster tempo of evolution in tropical climates. \u003Ci\u003EProceedings of the National Academy of Sciences\u003C/i\u003E 103:7718-7722.\u003Cbr\u003E\u003Ca href=\u0022http://www.sciencemag.org/news/2006/05/evolution-gets-hot-and-steamy\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.sciencemag.org/news/2006/05/evolution-gets-hot-and-steamy\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI stand by what I said, and science is not about guessing, saying that life should exist on a cold Titan \u003Cstrong\u003Eis nothing more than a really bad guess\u003C/strong\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nSo I have put up my science, where\u0027s yours?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2016-06-13T18:15:09Z","Content":"\n\u003Cp\u003E\n\u0022Where did I say mitochondria or bacteria could not undergo recombination\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nYou didn\u0027t... but specifically mammalian mitochondria don\u0027t. You said: \u0022the electron transport chain is a major source of mutations that drive evolution and a major impetus for recombinative replciation versus simple fission.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nThe electron transport chain is in mitochondria, which undergo \u0022simple\u0022 fission... so your statement is BS. You can throw up all the garbage citations you want ot try and obscure it, but you\u0027re just trying to bury your wrongness with text.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022So I have put up my science, \u0022 Sure,you linked to things about the redox environment... you linked jack squat showing that ETC products are a major source of mutations to the nuclear DNA. The mt DNA bears the brunt of the damage from ROS production...\n\u003C/p\u003E\n\u003Cp\u003E\nIt is true that there are other sources of ROS, and I shouldn\u0027t have been so specific, but you were specific about it being the ETC. You link to ERCC6... that deals with DNA repair, and does jack squat to back up your claims about causes of mutations or that such mutations can be said to \u0022drive evolution\u0022 Selection drives evolution, not mutations. Your Link to the OMIM entry showed defective DNA repair with increased sensitivity to radiation... again no link to your claim of \u0022\u0022the electron transport chain is a major source of mutations that drive evolution and a major impetus for recombinative replciation\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nYou linked to a 6 year old lay article that showed more accumulated mutations in tropical plants, with no causitive conclusion (higher evolution rates would lead to more sequence divergence... such a study does nothing to assert that a high mutation rate in itself drives evolution rates.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nYou put up \u0022Science Spam\u0022, not science backing your assertions.\n\u003C/p\u003E\n\u003Cp\u003E\nAgain, that assertion:\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022the electron transport chain is a major source of mutations that drive evolution and a major impetus for recombinative replciation versus simple fission.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://nar.oxfordjournals.org/content/early/2013/10/25/nar.gkt969.full\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://nar.oxfordjournals.org/content/early/2013/10/25/nar.gkt969.full\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThere you go... not much recombination going on in mitochondria... they divide by fission, they contain the frigging ETC... they bear the brunt of the damage when the ETC goes awry... if this ETC is a \u0022major impeturs for recombinative replication\u0022 then how come what contains the ETC does the opposite of what you claim the ETC promotes.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nScience Spam all you want, you posted a garbage statement and got called out on it.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-06-13T18:33:53Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222629310\u0022 data-ipsquote-contentid=\u0022141592\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221465841709\u0022 data-ipsquote-userid=\u002291917\u0022 data-ipsquote-username=\u0022KerikBalm\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n19 minutes ago, KerikBalm said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u0022Where did I say mitochondria or bacteria could not undergo recombination\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nYou didn\u0027t... but specifically mammalian mitochondria don\u0027t. You said: \u0022the electron transport chain is a major source of mutations that drive evolution and a major impetus for recombinative replciation versus simple fission.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nThe electron transport chain is in mitochondria, which undergo \u0022simple\u0022 fission... so your statement is BS. You can throw up all the garbage citations you want ot try and obscure it, but you\u0027re just trying to bury your wrongness with text.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022So I have put up my science, \u0022 Sure,you linked to things about the redox environment... you linked jack squat showing that ETC products are a major source of mutations to the nuclear DNA. The mt DNA bears the brunt of the damage from ROS production...\n\u003C/p\u003E\n\u003Cp\u003E\nIt is true that there are other sources of ROS, and I shouldn\u0027t have been so specific, but you were specific about it being the ETC. You link to ERCC6... that deals with DNA repair, and does jack squat to back up your claims about causes of mutations or that such mutations can be said to \u0022drive evolution\u0022 Selection drives evolution, not mutations. Your Link to the OMIM entry showed defective DNA repair with increased sensitivity to radiation... again no link to your claim of \u0022\u0022the electron transport chain is a major source of mutations that drive evolution and a major impetus for recombinative replciation\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nYou linked to a 6 year old lay article that showed more accumulated mutations in tropical plants, with no causitive conclusion (higher evolution rates would lead to more sequence divergence... such a study does nothing to assert that a high mutation rate in itself drives evolution rates.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nYou put up \u0022Science Spam\u0022, not science backing your assertions.\n\u003C/p\u003E\n\u003Cp\u003E\nAgain, that assertion:\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022the electron transport chain is a major source of mutations that drive evolution and a major impetus for recombinative replciation versus simple fission.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://nar.oxfordjournals.org/content/early/2013/10/25/nar.gkt969.full\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://nar.oxfordjournals.org/content/early/2013/10/25/nar.gkt969.full\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThere you go... not much recombination going on in mitochondria... they divide by fission, they contain the frigging ETC... they bear the brunt of the damage when the ETC goes awry... if this ETC is a \u0022major impeturs for recombinative replication\u0022 then how come what contains the ETC does the opposite of what you claim the ETC promotes.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nScience Spam all you want, you posted a garbage statement and got called out on it.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nTalk about misreading a post. Naer did is say that mitochondrial recombination is the result. What I said and explained in full is recombinative replication, as in the system, not the cell, as in meiosis, not simple fission. ROS can come from mitochondria and from other sources, but it IS, as the so-called \u0022Science spam\u0022 elucidated, a source of aging within the cells. It is undoubtably the major source of aging, and without a doubt the redundant ROS modulating species disappear, it becomes the source of cell death. It is the primary reason that immune cells use superoxide dismutase and ROS generation to kill intruders.\n\u003C/p\u003E\n\u003Cp\u003E\nP.S. I read your post, I wonder if you actually read mine.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-13T18:35:01Z\u0022 title=\u002206/13/2016 06:35  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 13, 2016\u003C/time\u003E by PB666\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2016-06-13T18:36:50Z","Content":"\n\u003Cp\u003E\nYes, I read your post with its moving goalposts\n\u003C/p\u003E\n\u003Cp\u003E\nI guess Loricifera Spinoloricus/Rugiloricus/Pliciloricus must not be evolving much anymore and must be going back to simple fission because they lack an ETC and thus the major source of mutations driving evolution and the impetus for recombination, eh?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-13T18:44:58Z\u0022 title=\u002206/13/2016 06:44  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 13, 2016\u003C/time\u003E by KerikBalm\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2016-06-13T21:41:32Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222629340\u0022 data-ipsquote-contentid=\u0022141592\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221465843010\u0022 data-ipsquote-userid=\u002291917\u0022 data-ipsquote-username=\u0022KerikBalm\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, KerikBalm said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYes, I read your post with its moving goalposts\n\u003C/p\u003E\n\u003Cp\u003E\nI guess Loricifera Spinoloricus/Rugiloricus/Pliciloricus must not be evolving much anymore and must be going back to simple fission because they lack an ETC and thus the major source of mutations driving evolution and the impetus for recombination, eh?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nETC changed evolution it did not stop evolution. How fast do you think free radical based evolution is going to occur on a world that has a redox potential (roughly not definable in an apolar solvent) of -400 and a temperature of -100 or less?\n\u003C/p\u003E\n\u003Cp\u003E\nMy point was, that if you change many aspects of the environment: 1) Temperature, 2) Redox potential (lower), 3) Surface pressure 4) UV/light potentials. That you have a really frozen surface were radiative evolution from the interior is neglible and there is no reason to expects that even the simplist things would evolve. Given the lack of oxygen and lack of mitochondria, one source of aging virtually disappears, when you drop blue/light UV down to miniscule levels a second source disappears, the only thing left is cosmic radiation. Since we don\u0027t have water we don\u0027t have replication enzymes, so we can\u0027t really compare DNA replication fidelity, and in any case at those temperatures they are pretty much not moving.\n\u003C/p\u003E\n\u003Cp\u003E\nQuoting myself in context\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhat are the energy drivers. ADP ---\u0026gt; ATP and NADP (NAD) -------\u0026gt; NADPH (NADH).  These absolutely do not have to be the drivers,\u003Cstrong\u003E but the problem is that at very low temperatures you cannot have the energy per bond that you can get at higher temperatures.\u003C/strong\u003E The particular problem is the H: moiety, without it one would find it excessively difficult to polymerize. But at those energies you do not have the ability to overcome the kinetic barriers. The only two enzymes that we know of are RNA and proteins, both need an environment containing water. Of the two proteins are most potent, anyone who studies X-ray crystallography knows that enymes are surrounded by water and frequently are involved in the transtion state themselves, many of the most potent enzymes have metal cofactors in the binding site, \u003Cstrong\u003Eand rely on the transition state oxidation states and complex non-covelant bond structure to achieve catalysis in which water participates in those reactions\u003C/strong\u003E. The potency of these reactions elevates rate, and also elevates the rate of evolution. In Eucaryotes this is particularly important because the electron transport chain is a major source of mutations that drive evolution and a major impetus for recombinative replication versus simple fission.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe key word is In Eucaryotes, not in eucaryotic organelles, but\u003Cstrong\u003E in eucaryotes\u003C/strong\u003E themselves  systems replicate by a complex process that eventuall results in some sort of embryogenesis. The point however is that single cell organisms can live in communities that share the same function, and lethal mutations do occur that cause death. But just as there are many mitochondria in each cell, the healthy cells can replace themselves. More importantly there is only 16384 \u002B/- 10 nt of human mtDNA, there is 3x10^9 bp of DNA, and although the rate for free radicals is higher the genome is tolerant about about 10 to 100 mutations per generation before something really  risky damage is done, if you had anywhere near the rate of mutation that occurs in the HVR of mtDNA, our genome would be cooked. One of the major proteins built do defend the mt is the ERCC6 which is made by the nucleus and shipped into mt. So not only is the nucleus just defending itself, its defending the mitochondria also.  During periods in which cells are rapidly mutating such mutations increase, such as in spermatogenisis in males. But that and other forces limit the finite lifetimes of eucaryotes, particular those with higher metabolisms. Specifically by the time a male is in his 60s (lower for chimpanzees), the spermatazoa have accumulated sufficiently large enough mutations as to make reproduction risk for multiple diseases (autism, schizophrenia). Mitochondria in the cell do die, and they do release free radicals in the process, and thus there is a defensive system, but during periods of environmental stress this can increase, such as migrating into an enviroment that requires more per day calorie consumption due to thermal losses. Compensatory mutations are expected and observed in the human mitochondrial DNA.\n\u003C/p\u003E\n\u003Cp\u003E\nThus when I say system, i mean system, not your favorite child organelle. The system undergoes recombination as a consequence of the finiteness of life that the system produces. The system has created a process (i.e. the eucaryotic organism) that relies on one step of meiosis during germ-cell replication. No goalpost has changed, this is how eucaryotes cheat death, at least until lineages go extinct, by sharing recombinant DNA between diverse future generations. But in cheating death, they have to die and in fact apoptosis is built into all stages of life. Bacterial can also share, including mitochondria is some species but not most higher mammals, but that is not germane to the argument, because for bacteria its more or less opportunistic. There are very few higher eurcaryotes that are parthenogenic, where has fissile replication is the standard organism replacement scheme in bacteria.\n\u003C/p\u003E\n\u003Cp\u003E\nThe great oxygenation event was a game changer for life on earth. It is not plausible on a non-photosynthetic world. It drives the ability to produce energy in process like endothery. The types of energy produced that can be devoted to new evolutionary process greatly increases. Genes undergo duplications, take on new functions, etc. The nervous system developes, the primary function of the system is taxis and muscle activity. Things like eating, swimming, again not possible without a thermodynamic potential between food sources and products. So on Titan endothermy, taxis, etc pretty much out of the question. Taxis is driven by ATP, again not available. So you get down to the components that make life complex, not available. Species that cannot burn oxygen, for example anaerobes, still exist in large numbers, but in the biosphere these are delegated to restricted areas of the ecosystem were metabolism is very slow. And so now you are down to the rates of life of things that live on top of petroleum formations that have division times in the 1000s of year range . . . . evolutions stops.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2016-06-14T03:15:24Z","Content":"\n\u003Cp\u003E\nPlease don\u0027t make the discussion personal. \n\u003C/p\u003E\n"}]}