{"TopicId":141798,"ForumId":21,"TopicTitle":"Low cost way to LKO, and aerodynamic heat shields.","CreatedByName":"MacLeod-Industries","CreatedById":165495,"CreatedDateTime":"2016-06-14T18:57:31Z","PageNum":1,"Articles":[{"CreatedByName":"MacLeod-Industries","CreatedById":165495,"CreatedDateTime":"2016-06-14T18:57:31Z","Content":"\n\u003Cp\u003E\n\u003Cu\u003E\u003Cem\u003ENo pictures, sorry. Use your imagination dangit.\u003C/em\u003E\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSo forever ago I made a plane that could go 1400 m/s. It was mk2 part size and had 4 ramjet engines. It has to have a heat shield on it because it goes so fast...\u003Cbr\u003E\nLater I slapped a mk2 cargo bay in there thinking... \u0022If I could get this into a suborbital flight, then if I just release a small probe with a lot of speratrons then I could get it into orbit.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nSo I did.\n\u003C/p\u003E\n\u003Cp\u003E\nI got to about 52,000 meters, the majority of the atmosphere gone, and released the probe.\n\u003C/p\u003E\n\u003Cp\u003E\nAlbeit \u003Cem\u003EThe Evil Kraken\u003C/em\u003E attacked the original probe design, so I couldn\u0027t get a perfect orbit but it was an amazing achievement.\n\u003C/p\u003E\n\u003Cp\u003E\nThe plane then re-enters near another large landmass... and you can turn the engines back on to control you landing...\n\u003C/p\u003E\n\u003Cp\u003E\nor crash like I did.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyways, it only took about 250 units of liquid only fuel to get up there, and then maybe 12 seperatrons to get the probe into orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nThat is pretty cheap in my opinion. Getting the entire plane into orbit is a little tedious and fuel intensive.\n\u003C/p\u003E\n\u003Cp\u003E\nFinally, the heat shield on the front of my plane is \u003Cstrong\u003ENOT\u003C/strong\u003E aerodynamic... it would be nice to have aerodynamic ones so you can make a fast plane, and still be protected.\n\u003C/p\u003E\n"},{"CreatedByName":"He_162","CreatedById":152811,"CreatedDateTime":"2016-06-15T01:03:46Z","Content":"\n\u003Cp\u003E\nPictures really help. Imagination isn\u0027t the extent to which this game can go, it goes much further.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nAnyway, I like the idea, I made a vehicle that used only sepratrons to get things into orbit, and I believe the last 3 stages on the satellite could fit in your bay, and bring it to orbit quite easily.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://kerbalx.com/He_162/STO\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://kerbalx.com/He_162/STO\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"MacLeod-Industries","CreatedById":165495,"CreatedDateTime":"2016-06-15T11:09:38Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222631268\u0022 data-ipsquote-contentid=\u0022141798\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221465952626\u0022 data-ipsquote-userid=\u0022152811\u0022 data-ipsquote-username=\u0022He_162\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 hours ago, He_162 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nPictures really help. Imagination isn\u0027t the extent to which this game can go, it goes much further.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nAnyway, I like the idea, I made a vehicle that used only sepratrons to get things into orbit, and I believe the last 3 stages on the satellite could fit in your bay, and bring it to orbit quite easily.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://kerbalx.com/He_162/STO\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://kerbalx.com/He_162/STO\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nActually, I got the idea from \u003Cem\u003EExplorer 1\u003C/em\u003E The first us satellite to get into orbit...\n\u003C/p\u003E\n\u003Cp\u003E\nI was recreating it, as I am making a NASA save with all of it\u0027s missions (And the few missions that came before, but there program was taken over by NASA, like Explorer 1\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nNow they used solid fuel in the orbiter stage. It had a burn time of 6 seconds... in clusters in 11, 3 and 1.\n\u003C/p\u003E\n\u003Cp\u003E\nSeperatrons burn for 5 seconds...\n\u003C/p\u003E\n\u003Cp\u003E\nThe Americans did it first... xD Just not a very well known concept.\n\u003C/p\u003E\n\u003Cp\u003E\nI am hoping to get the NASA save on here eventually, but I still have a lot of work to do.\n\u003C/p\u003E\n\u003Cp\u003E\nI will add pictures later then too.\n\u003C/p\u003E\n"}]}