{"TopicId":141718,"ForumId":16,"TopicTitle":"Trouble landing small planes: boom!","CreatedByName":"DarkGravity","CreatedById":143383,"CreatedDateTime":"2016-06-13T12:04:08Z","PageNum":1,"Articles":[{"CreatedByName":"DarkGravity","CreatedById":143383,"CreatedDateTime":"2016-06-13T12:04:08Z","Content":"\n\u003Cp\u003E\nI\u0027ve just returned after a year away. I started over in career, and I\u0027m having trouble landing planes without sploding. I\u0027ve got the LV 01s on the rear and a LV 05 in front. I\u0027m not trying to land on the runway, just on the smooth ground surrounding campus. I succeed about 1 in 20 landings currently. I slow lateral speed to about 60 m/s and try to  get my vertical speed to under -10 (-5 if I\u0027m really doing well). Seems pretty unforgiving. I remember landing planes for missions all around Kerbin a year ago where the land is not as smooth as near campus. Now I can\u0027t hardly land on the smooth ground. Any help will be appreciated!\n\u003C/p\u003E\n"},{"CreatedByName":"Evanitis","CreatedById":145424,"CreatedDateTime":"2016-06-13T12:26:20Z","Content":"\n\u003Cp\u003E\nWithout seeing a screenshot of the plane, I\u0027d probably blame the angle of descent. 60m/s horizontal should be slow enough - I did landings without a scratch by touching down at 80 m/s. (That\u0027s with Kerbal Krash Systems, so \u0027without a scratch\u0027 isn\u0027t just a figure of speech). That 5-10 m/s vertical speed sounds a bit too much though.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat I\u0027d try is to level out the flight really close to the ground (like 30-60m), so you have a zero~ish vertical speed. Horizontal velocity doesn\u0027t really matter at this point, as if you pitch up carefully, you\u0027ll bleed the rest of the speed without losing altitude too fast.\n\u003C/p\u003E\n\u003Cp\u003E\nThough a bumpy surface means you can\u0027t always keep an ideal distance and/or angle from the ground... That could make landings really tricky. I admit, I\u0027m a lot better at picking my landing spot than touching down at a bad one... thus I kinda\u0027 almost always aim KSC or an ocean. Those are the flattest and softest spots to go for, the latter also saves the cost and weight of landing gears too.\n\u003C/p\u003E\n\u003Cp\u003E\nThough by enough patience and f9 overuse, I\u0027m convinced that anything can land virtually anywhere.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022VRisO5z.png\u0022 class=\u0022ipsImage\u0022 height=\u0022408\u0022 src=\u0022http://i.imgur.com/VRisO5z.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"DarkGravity","CreatedById":143383,"CreatedDateTime":"2016-06-13T15:27:11Z","Content":"\n\u003Cp\u003E\nYeah. Tried another 50 landings. As gentle as I can. Not really any learning curve any more. The plane just sucks. I watched Scott Manley\u0027s vids and it is stable and all, but just no smooth control.  Have to wait till I can unlock better parts I guess. The retractable ones have twice the impact tolerance. Still much more unforgiving than what I remember from a year ago.\n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2016-06-13T15:34:59Z","Content":"\n\u003Cp\u003E\nThe LY01 and LY05 used to be indestructible. Physics has been added and now they are fragile. You cannot treat them like you used to, period. Don\u0027t carry more than 200 units of fuel, in a plane massing 5 tonnes, max.\n\u003C/p\u003E\n\u003Cp\u003E\nThe main point is that you need to learn to land like a feather. The grass at KSC is at an altitude of 66m. Scrub off your speed by porpoising before you get there. Get to a 75m altitude, in \u003Cem\u003Elevel flight\u003C/em\u003E. Cut the engines and just let the speed bleed off little by little by itself until your plane touches down. It should be below 55 m/s. (Then hit the brakes to prevent skidding.) Do not force your plane down onto the ground.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you don\u0027t have smooth control, then adding length to the plane can help a lot. Reducing the \u0022authority\u0022 of your pitch controls can help. Reducing the size of your pitch control surfaces can help.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-13T15:46:21Z\u0022 title=\u002206/13/2016 03:46  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 13, 2016\u003C/time\u003E by bewing\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Van Disaster","CreatedById":58876,"CreatedDateTime":"2016-06-13T15:43:01Z","Content":"\n\u003Cp\u003E\nDouble up on rear gear, use a braking parachute rather than wheel brakes until they sort wheels out. I\u0027m also on the \u0022too much vertical speed\u0022 bandwagon here, if I can\u0027t keep it below -1.5m/s I abort \u0026amp; go around.\n\u003C/p\u003E\n\u003Cp\u003E\nDon\u0027t forget 10m/s is 36km/h... running into a wall at that speed is going to cause damage.\n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2016-06-13T17:00:20Z","Content":"\n\u003Cp\u003E\nYou did say \u0022any help\u0022 -- so you might just want to try practicing on this plane: \u003Ca href=\u0022http://www.virtualrealitytoursllc.com/pix/basic_jet.craft\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.virtualrealitytoursllc.com/pix/basic_jet.craft\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThat\u0027s as easy to take off, fly, and land as a tier 4 plane can be, I think.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"ibanix","CreatedById":147140,"CreatedDateTime":"2016-06-14T04:17:32Z","Content":"\n\u003Cp\u003E\nLanding gear got a lot more fragile with 1.1. My gear sometimes explodes at 80m/s on *take off*. \n\u003C/p\u003E\n\u003Cp\u003E\nYou want less than 5m/s vertical and less than 50m/s horizontal speed on landing, to have a good shot not to explode landing gear. \n\u003C/p\u003E\n"},{"CreatedByName":"Sir Mildred Pierce","CreatedById":165661,"CreatedDateTime":"2016-06-20T02:37:42Z","Content":"\n\u003Cp\u003E\nI\u0027m kind of in the same boat, I mainly like to design rockets and do space stuff, but I decided to try out doing planes after not being in to it after a long while.  As far as I can tell, looking over what other people have said, is that after 1.1 came out the physics for planes seems a lot different.  I can barely control them now, even stock planes pretty squirrely.  Taking off has become a severe headache.  The landing gear are really touchy now and you have to have them perfectly aligned now, it seems.  Even when I get the landing gear aligned I spin out on the runway way too much.  If you can get your plane to take off and is stable in flight you are ahead of me.  Designing and flying planes just isn\u0027t enjoyable for me anymore and I think I\u0027m going to stick to rockets.\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-06-20T03:37:29Z","Content":"\n\u003Cp\u003E\nAnd just to be clear about landing-gear fragility:  \u003Cstrong\u003Esize matters\u003C/strong\u003E.  Bigger gear can take a lot more punishment than smaller gear.\n\u003C/p\u003E\n\u003Cp\u003E\nIt \u003Cem\u003E\u003Cu\u003Ereally matters\u003C/u\u003E\u003C/em\u003E how many tons of aircraft are coming down on each gear.  And landing generally puts more stress on the gear than just sitting or taxiing on the runway, so a plane that \u003Cem\u003E\u003Cu\u003Eseems\u003C/u\u003E\u003C/em\u003E fine on takeoff may actually be dangerously overloaded.\n\u003C/p\u003E\n\u003Cp\u003E\nThe smallest-size landing gear can only handle \u003Cem\u003Every\u003C/em\u003E light loads.  If your landing gear keep going poof on landing, try replacing them with one-size-bigger gear.  I did that, and suddenly all my landing problems went away-- can land a plane just fine, even on the bumpy green grassland terrain west of KSC, no problem.  And that\u0027s just flying mouse-and-keyboard, and I am by no means an airplane jock.\n\u003C/p\u003E\n\u003Cp\u003E\nTo take an extreme example:  just for grins, I tried mounting four of the biggest-size gear to a tiny test craft that was just a couple of tons, launched it vertically with a rocket engine, and brought it \u003Cem\u003E\u003Cu\u003Estraight down into the ground\u003C/u\u003E\u003C/em\u003E at 50 m/s.  Result:  Bounced lightly once and then settled down unscathed.  Totally unharmed.  Reason?  Ludicrously light mass loading compared to the size and strength of the gear.\n\u003C/p\u003E\n\u003Cp\u003E\nSo:  It\u0027s not \u0022how gently you land the plane\u0022 that matters-- it\u0027s how gently you land the plane \u003Cem\u003E\u003Cu\u003Etimes the plane\u0027s mass\u003C/u\u003E\u003C/em\u003E, and then \u003Cem\u003E\u003Cu\u003Edivided by the size/strength of the landing gear\u003C/u\u003E\u003C/em\u003E.  Lighter plane and/or bigger landing gear, and you can do some pretty rough landings with no problem.\n\u003C/p\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2016-06-20T04:21:56Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222638021\u0022 data-ipsquote-contentid=\u0022141718\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466393849\u0022 data-ipsquote-userid=\u0022125662\u0022 data-ipsquote-username=\u0022Snark\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n42 minutes ago, Snark said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAnd just to be clear about landing-gear fragility:  \u003Cstrong\u003Esize matters\u003C/strong\u003E.  Bigger gear can take a lot more punishment than smaller gear.\n\u003C/p\u003E\n\u003Cp\u003E\nIt \u003Cem\u003E\u003Cu\u003Ereally matters\u003C/u\u003E\u003C/em\u003E how many tons of aircraft are coming down on each gear.  And landing generally puts more stress on the gear than just sitting or taxiing on the runway, so a plane that \u003Cem\u003E\u003Cu\u003Eseems\u003C/u\u003E\u003C/em\u003E fine on takeoff may actually be dangerously overloaded.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIn addition, IRL large airplanes can\u0027t land with a full load of fuel. So if you\u0027re taking off with a boatload of fuel for a quick test flight you\u0027re going to have to find a way to get rid of all that fuel before you land, lightening the load on the gear significantly.\n\u003C/p\u003E\n"}]}