{"TopicId":141894,"ForumId":51,"TopicTitle":"[IMAGE HEAVY] Operation: Vulcan Verdict - A Manned Mission To Moho And Back","CreatedByName":"AOA1","CreatedById":125066,"CreatedDateTime":"2016-06-16T03:47:45Z","PageNum":1,"Articles":[{"CreatedByName":"AOA1","CreatedById":125066,"CreatedDateTime":"2016-06-16T03:47:45Z","Content":"\n\u003Cp\u003E\nThis is a version of a near-identical post on \u003Ca href=\u0022https://forums.sufficientvelocity.com/threads/image-heavy-operation-vulcan-verdict-a-ksp-mission-to-moho-and-back.29722/\u0022 rel=\u0022external nofollow\u0022\u003ESufficient Velocity\u003C/a\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nFor years, I have played the Kerbal Space Program. I have traveled world to world, exploring the very bizarre terrain scattered throughout the Kerbol system. From the space program\u0027s inaugural flight to the colonization of Laythe, my veracity was unbroken. Plans were finished and dreams were fulfilled, but there was always one world I never ventured to, one no Kerbal ever stepped foot on: The scorched ball of rock known as Moho.\n\u003C/p\u003E\n\u003Cp\u003E\nSomething important to note is that my visual mods and screenshot resolution vary within missions. Unfortunately, this was my fault and, though eventually corrected, it will plague the first series of images. Mod conflicts are wonderful, aren\u0027t they?\n\u003C/p\u003E\n\u003Cp\u003E\nFirst up, a Dawn-1B lifts off with an unmanned satellite. Known as the Vulcan OreSat, this satellite is to scan the planet for valuable resources and double as a reconnaissance orbiter. VOS will inject into Moho\u0027s orbit approximately two days before the manned spacecraft, entering a polar orbit four hours from then.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00223GzSgT9.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/3GzSgT9.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022xQcpszV.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/xQcpszV.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022lKRIi8g.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/lKRIi8g.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022e6W1oei.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/e6W1oei.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022wkyDx2f.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/wkyDx2f.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNext up is the interplanetary spacecraft. To carry a crew of three to Moho both safely and effectively, a nuclear tug must push a crew module and a lander to the planet. In this, I have opted for a near-minimalist approach while remaining in the general guidelines.\u003Cbr\u003E\u003Cbr\u003E\nIn the original plan, four launches were necessary to construct a spacecraft in orbit. Fortunately, I was able to shrink the nuclear propulsion stage and fit it into a single launch, lowering the total launches to three. This saved cost and time removes ~1000 ΔV from the spacecraft, leaving little room for error.\u003Cbr\u003E\u003Cbr\u003E\nThe first piece is the nuclear stage. Launched atop a Seraphim-II Heavy, the 200-ton Behemoth Nuclear Stage is injected into a circular, equatorial orbit of 125 km x 125 km.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022poNRoUQ.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/poNRoUQ.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022fycHINa.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/fycHINa.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022FzolIjl.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/FzolIjl.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThis booster separation remarkably resembles the R7\u0027s Korolev Cross. In fact, the bottom of the boosters actually push upwards, then the booster nosecones push away, separating the heavy boosters in a beautiful fashion.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022tDAWLVn.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/tDAWLVn.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022MFDJ4Uc.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/MFDJ4Uc.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022bz05D7a.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/bz05D7a.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00221Yzu0T9.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/1Yzu0T9.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nFollowing the launch of the Behemoth Nuclear Stage, a lander, Haven, will attach to the forward berthing node. This lander is a two-stage unit with excess ΔV to carry the primary module home, should the BNS fail. It\u0027s launch vehicle is a standard Seraphim-II with a Taurus upper stage and Proprietary Avionics Package (PAP). The Taurus deorbits itself shortly after separating from Haven.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022SWJdOj1.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/SWJdOj1.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022wgW3gF4.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/wgW3gF4.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022KEjX4yk.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/KEjX4yk.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022j2nauWM.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/j2nauWM.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSeveral days after Haven berthed with the BNS, the Moho transfer window lies only one day away. The well-trusted Wyvern crew module is to be the crew\u0027s living space and escape pod, while Haven provides room to stretch their legs. The launch vehicle, the Sentinel-1A, is a partially-reusable rocket that works in a similar fashion to the Falcon 9; first stage is recovered via boostback or, in this instance, barge, while the second stage is expended.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022X87UnH6.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/X87UnH6.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nScatterer \u002B EVE \u002B EngineLight = TERRIBLE ENGINE LIGHT\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00228UjtORJ.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/8UjtORJ.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00228STyaYd.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/8STyaYd.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA mobile pad on the ocean is the target of the first stage.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022JSZc9yU.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/JSZc9yU.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAbort tower jettison.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022133cYZl.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/133cYZl.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nUnfortunately, I never took any images of the Wyvern docking to the main ship. Also, broken sunflare. That is one of the reasons I was changing out visual mods.\n\u003C/p\u003E\n\u003Cp\u003E\nWith the vessel constructed, it was time to orbit thrice and then set off for the inner world. The crew were eager, Mission Control was prepared, the engines were ready for full-power. Only one more objective had to be fulfilled before the mission could commence, and that was... giving the ship a name?\u003Cbr\u003E\u003Cbr\u003E\nI\u0027m such an idiot. Throughout the entire planning, construction, launching, docking, and tracking of the spacecraft and planets, after giving every individual module a name, I never once considered to name the entire spacecraft. For basic communications purposes and being able to keep track of the damned ship, I rushed to create a true name, and fabricated one:\n\u003C/p\u003E\n\u003Cp\u003E\nShepherd of Fire.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022OH9nYE9.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/OH9nYE9.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022LF4ZmAO.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/LF4ZmAO.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nCurrently, this is where the mission stands. A maneuver node lies 65 days away for the Shepherd of Fire; 63 days from VOS. Both spacecraft will soon correct their orbital positions and traverse to the huggled world.\n\u003C/p\u003E\n\u003Cp\u003E\nCheck back for updates!\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-19T07:29:13Z\u0022 title=\u002206/19/2016 07:29  AM\u0022 data-short=\u00228 yr\u0022\u003EJune 19, 2016\u003C/time\u003E by AOA1\u003C/strong\u003E\n\u003Cbr\u003EExcess text due to copy from other forum.\n\u003C/span\u003E\n"}]}