{"TopicId":141867,"ForumId":21,"TopicTitle":"Small SSTO Spaceplane","CreatedByName":"Cascade253","CreatedById":165526,"CreatedDateTime":"2016-06-15T17:40:43Z","PageNum":1,"Articles":[{"CreatedByName":"Cascade253","CreatedById":165526,"CreatedDateTime":"2016-06-15T17:40:43Z","Content":"\n\u003Cp\u003E\nHi Everyone!\n\u003C/p\u003E\n\u003Cp\u003E\nFirst post here, I\u0027d like to share a small ssto spaceplane I\u0027ve been working on. Currently it\u0027s called the X-9 but I\u0027ll come up with a better name once it fully accomplishes it\u0027s mission goals. It uses all stock parts and alittle bit of stacking, only mods used are mechjeb, kerbal engineer, and stage recovery.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222BOcauE.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/2BOcauE.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nCraft File: \u003Ca href=\u0022https://www.dropbox.com/s/07z55i0ofnjgo1h/X-9.craft?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/07z55i0ofnjgo1h/X-9.craft?dl=0\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s based off a design I saw on this thread: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/130681-smallest-lightest-ssto/\u0026amp;page=2\u0022 rel=\u0022\u0022\u003Ehttp://forum.kerbalspaceprogram.com/index.php?/topic/130681-smallest-lightest-ssto/\u0026amp;page=2\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s main purpose is to act as a Ranger type craft and shuttle crew to and from Kerbal orbit. Eventually it may be incorporated into some type of Endurance mothership for interplanetary travel.\n\u003C/p\u003E\n\u003Cp\u003E\nCurrently the design can get to 100 km orbit reliably and can probably do 200 km just fine, but I need to get alittle bit more out of it. My main space station is in orbit at 400 km. What is not visible are 2 FLT-400 tanks stacked inside the docking port. Both are clickable with the docking port doors open for refueling purposes.\n\u003C/p\u003E\n\u003Cp\u003E\nThis latest design is the culmination of many tests, the X-8 (\u003Ca href=\u0022https://www.dropbox.com/s/37lkfsc2l0wky58/X-8.craft?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/37lkfsc2l0wky58/X-8.craft?dl=0\u003C/a\u003E) is the same craft but without the inline docking part which takes off 0.6T. This craft can reach a 400 km orbit with delta v to spare, but without monoprop or a docking port. Adding a standard docking port and 2 of the smallest monoprop tanks to the X-8 weighs more and has more drag from the exposed port and tanks than the X-9 design.\n\u003C/p\u003E\n\u003Cp\u003E\nA few notes about the flight profile: For both ships once 80 m/s has been reached rotate up and both will climb out easily. Where the X-8 and X-9 differ is breaking through the sound barrier. With the X-8 maintaining a nose heading angle of 15-20 degrees, it is able to punch on through just fine and let the rapier engine breath. After this adjusting the flight path so that ~1 km/s is reached around 15 km seems to make best use of the fuel on board, then mechjeb is used for final ascent to 100 km. For the X-9, with a nose angle of 10-15 degrees I have to level off at around 8 km in order to break through the barrier and get the rapier engine really going. This uses too much fuel and once in orbit I don\u0027t have enough fuel left over for the amount of ox I have. Adding more fuel probably won\u0027t solve the problem because the extra mass will make it that much harder in the initial flight phase from seen by adding just another 0.6T.\n\u003C/p\u003E\n\u003Cp\u003E\nThe design is surprisingly very stable and easy to fly and has good glide and reentry characteristics. From looking at the aerodynamic drag forces, the only major component comes from the center body. Eventually I may add acouple of vernier thrusters on the bottom hull for easy non-atmo landings, but first things first.\n\u003C/p\u003E\n\u003Cp\u003E\nI would very much appreciate any feedback you have on how to get just alittle bit more out of the design, and let me know what you think about it!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-15T18:59:22Z\u0022 title=\u002206/15/2016 06:59  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 15, 2016\u003C/time\u003E by Cascade253\u003C/strong\u003E\n\u003Cbr\u003Etag\n\u003C/span\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2016-06-16T10:11:53Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222632285\u0022 data-ipsquote-contentid=\u0022141867\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466012443\u0022 data-ipsquote-userid=\u0022165526\u0022 data-ipsquote-username=\u0022Cascade253\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n22 hours ago, Cascade253 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nFor the X-9, with a nose angle of 10-15 degrees\u003Cstrong\u003E \u003Cu\u003EI have to level off at around 8 km\u003C/u\u003E \u003C/strong\u003Ein order to break through the barrier and get the rapier engine really going. This uses too much fuel and once in orbit I don\u0027t have enough fuel left over for the amount of ox I have. Adding more fuel probably won\u0027t solve the problem because the extra mass will make it that much harder in the initial flight phase from seen by adding just another 0.6T.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThere\u0027s your problem. The best way to go supersonic is when the air density is high, at ground level, since the engines will give more thrust. Then, once you have them properly fed at around 400m/s at around 1,000m, you will see how your vertical speed increases dramatically with very small climb angles (10º or so). The result is that the whole climb can take as little as five minutes even with the lowest TWR that will get you supersonic, which is around 0.4-0.5 (with a decently low drag/mass ratio, i.e a pointy design). The old rules of the souposphere are long gone! The trick to be efficient since 1.0 is, therefore, to go as shallow as you can without burning up, and flying, quite literally, a straight line to orbit (your AoA will increase as kerbin curves below you).\n\u003C/p\u003E\n\u003Cp\u003E\nAs to the SSTO, it\u0027s really cool. Keep it up and I hope to see more from you!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nRune. SSTO\u0027ing can either be easier or harder depending on the flight profile... just like rockets. \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-16T15:52:37Z\u0022 title=\u002206/16/2016 03:52  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 16, 2016\u003C/time\u003E by Rune\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Cascade253","CreatedById":165526,"CreatedDateTime":"2016-06-16T15:19:42Z","Content":"\n\u003Cp\u003E\nThanks for the advice, I forgot to ask in my original post if anyone had suggestions for a better flight profile. I\u0027ll give it a shot and see how it goes\n\u003C/p\u003E\n"}]}