{"TopicId":141896,"ForumId":32,"TopicTitle":"KSP Physics","CreatedByName":"DiamondExcavater","CreatedById":72325,"CreatedDateTime":"2016-06-16T04:39:17Z","PageNum":1,"Articles":[{"CreatedByName":"DiamondExcavater","CreatedById":72325,"CreatedDateTime":"2016-06-16T04:39:17Z","Content":"\n\u003Cp\u003E\nI was watching MythBusters the other day and came across...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://www.discovery.com/tv-shows/mythbusters/mythbusters-database/laptop-lift-off/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.discovery.com/tv-shows/mythbusters/mythbusters-database/laptop-lift-off/ \u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe original video -\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.youtube.com/embed/_12L_Dme8Vc\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.youtube.com/embed/_12L_Dme8Vc\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nBasically (if these links don\u0027t work) the bees can\u0027t lift the laptop because of a few reasons but a major one being Newtons 3rd law. If the bee is pushing air down it can fly up, but if the air is hitting a large surface it pushes the surface down, and if the surface is attached to what ever is trying to fly up, it won\u0027t fly.\n\u003C/p\u003E\n\u003Cp\u003E\nI asked myself, is KSP\u0027s physics realistic and good enough to prove this law, I set up a rig as the following (sorry for no images)\n\u003C/p\u003E\n\u003Cp\u003E\n1. Simple probe core\n\u003C/p\u003E\n\u003Cp\u003E\n2. Fuel tank\n\u003C/p\u003E\n\u003Cp\u003E\n3. Rocket engine strong enough to lift the whole thing\n\u003C/p\u003E\n\u003Cp\u003E\n4. 2 long metal girders which hold a large flat surface made up of structural sheets of metal\n\u003C/p\u003E\n\u003Cp\u003E\nI ensured that the metal sheets were far enough from the engine to be able to see the flame, I proceeded to offset the metal sheets to ensure there were no gaps. I went to launch it and to my surprise it did not generate thrust, I tested numerously to see if it was a glitch in the launch pad, I remade the rig with the metal sheets separated a little. This caused the metal sheets to wobble (closing and opening its gap) each time it opened the thrust fluctuated from 0 to almost normal engine thrust. After seeing the results I flipped the girders upwards (lots of air resistance) yet it was able to lift off (this entire experiment was also done with hacked gravity which made no effect on the 0 thrust).\n\u003C/p\u003E\n\u003Cp\u003E\nI am really proud of Squad for having these very realistic physics in the game which I can imagine to be a pain (Results from newest release 1.1.2ish I think)\n\u003C/p\u003E\n\u003Cp\u003E\nSerious JOB WELL DONE! (I don\u0027t think physics were this good in the past KSP versions though)\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-16T04:47:41Z\u0022 title=\u002206/16/2016 04:47  AM\u0022 data-short=\u00228 yr\u0022\u003EJune 16, 2016\u003C/time\u003E by DiamondExcavater\u003C/strong\u003E\n\u003Cbr\u003EI fail at embeding\n\u003C/span\u003E\n"},{"CreatedByName":"Tourist","CreatedById":143403,"CreatedDateTime":"2016-06-16T05:01:22Z","Content":"\n\u003Cp\u003E\nIts got the most realistic physics of any space rocket builder involving Kerbals to date (as at 16/06/16).\n\u003C/p\u003E\n"},{"CreatedByName":"the_Demongod","CreatedById":150124,"CreatedDateTime":"2016-06-16T06:10:07Z","Content":"\n\u003Cp\u003E\nThey\u0027re good enough for the stock game. I personally prefer a little more which is why I use FAR for improved aero but for the average user I think they\u0027re just fine.\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-06-16T13:02:05Z","Content":"\n\u003Cp\u003E\nIRL, you\u0027d better be darn sure that your rocket exhaust doesn\u0027t hit anything that you care about... and the exhaust extends a long way back.\n\u003C/p\u003E\n\u003Cp\u003E\nKSP does model the \u0022exhaust exerts pressure on what it hits\u0022 effect; that\u0027s what killed the thrust in your experiment, and also why activating an engine in the middle of a vertical stack will rapidly heat up the part below it, but won\u0027t accelerate the rocket at all. It\u0027s also why, if you activate an engine simultaneously with blowing the stack decoupler immediately below it, the bottom stage you just separated gets blown violently backwards by the exhaust.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, there are limitations. The \u0022exhaust force zone\u0022 extends only a certain distance behind the rocket, much less of a distance than would be the case IRL. Also, the effect is, notably, completely absent with the ion engine; you get magic thrust even when it\u0027s buried in the middle of the rocket and its exhaust path is completely obstructed.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd of course there\u0027s the physical impossibility of KSP reaction wheels, which violate the laws of physics, though that\u0027s a deliberate design choice for playability reasons (one I happen to agree with). And a few other small \u0022rough edges\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nBut in general, yes, I think the game does a great job of being accurate enough for immersion without sacrificing playability. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"wumpus","CreatedById":133850,"CreatedDateTime":"2016-06-16T17:10:54Z","Content":"\n\u003Cp\u003E\nIsn\u0027t \u0022magical RCS\u0022 an important part of the game as well?  As in RCS has no effect on the ship you are docking with (presumably semi-plausible with deliberately inefficient design to minimize such effects, but of course non-zero IRL).  At least this was true back when Scott Manley released his docking videos and it has been close enough ever since.\n\u003C/p\u003E\n"},{"CreatedByName":"DiamondExcavater","CreatedById":72325,"CreatedDateTime":"2016-06-16T21:51:40Z","Content":"\n\u003Cp\u003E\nThere is the problem with unrealistic torque from reaction wheels, but without them the game would be extremely difficult with the amount of propellant needed to keep straight, especially with a ship that is staying out in space for ever... but reaction wheels could almost work RL right?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-16T21:53:27Z\u0022 title=\u002206/16/2016 09:53  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 16, 2016\u003C/time\u003E by DiamondExcavater\u003C/strong\u003E\n\u003Cbr\u003Econfused KSP with real life\n\u003C/span\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-06-16T21:58:25Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222634111\u0022 data-ipsquote-contentid=\u0022141896\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466113900\u0022 data-ipsquote-userid=\u002272325\u0022 data-ipsquote-username=\u0022DiamondExcavater\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 minutes ago, DiamondExcavater said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThere is the problem with unrealistic torque from reaction wheels, but without them the game would be extremely difficult with the amount of propellant needed to keep straight, especially with a ship that is staying out in space for ever... but reaction wheels could work almost like RL right?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNot quite sure I follow what you\u0027re saying.  Are you saying that the reaction wheels are realistic?  Or agreeing me that they\u0027re physically impossible?  (Not just \u0022are too powerful\u0022, but are \u003Cem\u003E\u003Cu\u003Eactually violating the laws of physics\u003C/u\u003E\u003C/em\u003E).  It\u0027s the final comment that \u0022could work almost like RL\u0022 that confuses me. What exactly are you asking?\n\u003C/p\u003E\n\u003Cp\u003E\nIf you\u0027re asking \u0022do they work almost like RL\u0022, the answer is an emphatic no.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you\u0027re asking \u0022would it be possible to program them to work like RL\u0022, the answer is \u0022yes, but it would be complicated enough that they\u0027d confuse everyone and the game would be a lot less fun to play for everyone except perhaps a few hard-core space nerds.\u0022  I feel confident in saying that because I think of \u003Cem\u003E\u003Cu\u003Emyself\u003C/u\u003E\u003C/em\u003E as a hard-core space nerd, but I\u0027m not hard-core enough to enjoy that level of realism-- I\u0027d dislike \u0027em, they\u0027re just more fun this way and I can live with the compromise-for-playability\u0027s-sake.\n\u003C/p\u003E\n"},{"CreatedByName":"tseitsei89","CreatedById":162979,"CreatedDateTime":"2016-06-17T00:25:57Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222634124\u0022 data-ipsquote-contentid=\u0022141896\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466114305\u0022 data-ipsquote-userid=\u0022125662\u0022 data-ipsquote-username=\u0022Snark\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Snark said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIf you\u0027re asking \u0022would it be possible to program them to work like RL\u0022, the answer is \u0022yes, but it would be complicated enough that they\u0027d confuse everyone and the game would be a lot less fun to play for everyone except perhaps a few hard-core space nerds.\u0022  I feel confident in saying that because I think of \u003Cem\u003E\u003Cu\u003Emyself\u003C/u\u003E\u003C/em\u003E as a hard-core space nerd, but I\u0027m not hard-core enough to enjoy that level of realism-- I\u0027d dislike \u0027em, they\u0027re just more fun this way and I can live with the compromise-for-playability\u0027s-sake.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nMaybe I am one of those \u0022space nerds\u0022 then (I actually wouldn\u0027t count myself as one tough...) \u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI mean I am totally ok with how reaction wheels currently work. It is a game after all.\n\u003C/p\u003E\n\u003Cp\u003E\nBUT\n\u003C/p\u003E\n\u003Cp\u003E\nI really don\u0027t see why (more) realistic reaction wheels would be that bad.. Then we would just have to use more RCS to control the attitude of our crafts but that\u0027s not really that hard either now is it? Just slap in one mono tank and few rcs ports at both ends of the ship and you\u0027ll be just fine in most cases...\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-06-17T01:32:54Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222634269\u0022 data-ipsquote-contentid=\u0022141896\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466123157\u0022 data-ipsquote-userid=\u0022162979\u0022 data-ipsquote-username=\u0022tseitsei89\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, tseitsei89 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI really don\u0027t see why (more) realistic reaction wheels would be that bad.. Then we would just have to use more RCS to control the attitude of our crafts but that\u0027s not really that hard either now is it? Just slap in one mono tank and few rcs ports at both ends of the ship and you\u0027ll be just fine in most cases...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe problem is that you\u0027d have to somehow keep track of the angular momentum currently stored in the wheels, which would be a pain to visualize and/or control.  And you\u0027d have to have separate controls for \u0022exert RCS torque\u0022 versus \u0022exert reaction-wheel torque\u0022.  It\u0027s the sort of thing that computer programs can handle just fine, but would be a nightmare for a human to control in a video game.\n\u003C/p\u003E\n"},{"CreatedByName":"strigon","CreatedById":123021,"CreatedDateTime":"2016-06-17T01:46:05Z","Content":"\n\u003Cp\u003E\nKSP\u0027s physics are a good simplification. They are advanced enough to model rocketry and aerodynamics with enough accuracy to teach a layman the core concepts of each. Considering it\u0027s just a simple game, that\u0027s impressive.\n\u003C/p\u003E\n\u003Cp\u003E\nThe issue becomes when we use broad phrases like \u0022realistic\u0022. Yes, the physics in KSP don\u0027t hold up under close scrutiny by anyone with actual experience in the matter, but so does, for example, the expression for momentum you learn in high school. And just like the expression for momentum, the accuracy and realism of KSP can range from \u0022More than adequate for our purposes; anything else would actively confuse matters\u0022 to \u0022nowhere near good enough\u0022.\n\u003C/p\u003E\n"},{"CreatedByName":"DiamondExcavater","CreatedById":72325,"CreatedDateTime":"2016-06-17T05:30:51Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222634124\u0022 data-ipsquote-contentid=\u0022141896\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466114305\u0022 data-ipsquote-userid=\u0022125662\u0022 data-ipsquote-username=\u0022Snark\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, Snark said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNot quite sure I follow what you\u0027re saying.  Are you saying that the reaction wheels are realistic?  Or agreeing me that they\u0027re physically impossible?  (Not just \u0022are too powerful\u0022, but are \u003Cem\u003E\u003Cu\u003Eactually violating the laws of physics\u003C/u\u003E\u003C/em\u003E).  It\u0027s the final comment that \u0022could work almost like RL\u0022 that confuses me. What exactly are you asking?\n\u003C/p\u003E\n\u003Cp\u003E\nIf you\u0027re asking \u0022do they work almost like RL\u0022, the answer is an emphatic no.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI am saying that the reaction wheels are unrealistic to an extent, the way I see it (I am not the strongest in this field) is that there is a spinning gyroscope or a \u0022wheel\u0022 that spins within certain parts of the ship (lets say centre of mass). This wheel is spinning at the very centre of the craft longitudinally up the long shaft of the craft, if it were to suddenly stop spinning it will exert a rotational force into the direction of the wheel rotation, which should rotate the craft. I read that the size and speed are important, but it can be possible to rotate ships.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you look at the probe core for the plane shape, it has torque wheels inside it, I think the wheels can cause rotation, the amount I don\u0027t know. I\u0027ve also seen the video showing the effect of torque on a spinning wheel, which shows a guy holding a rod with a metal wheel at the end, he spins the wheel using a drill and then lifts the (very heavy) wheel over his head with ease while also needing to rotate with the wheel. I don\u0027t know if I explained that properly, but I do agree the KSP torque might be a bit too strong, but possible to an extent. \n\u003C/p\u003E\n"},{"CreatedByName":"Cunjo Carl","CreatedById":162109,"CreatedDateTime":"2016-06-17T06:51:58Z","Content":"\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222634547\u0022 data-ipsquote-contentid=\u0022141896\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466141451\u0022 data-ipsquote-userid=\u002272325\u0022 data-ipsquote-username=\u0022DiamondExcavater\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, DiamondExcavater said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI am saying that the reaction wheels are unrealistic to an extent, the way I see it (I am not the strongest in this field) is that there is a spinning gyroscope or a \u0022wheel\u0022 that spins within certain parts of the ship (lets say centre of mass). This wheel is spinning at the very centre of the craft longitudinally up the long shaft of the craft, if it were to suddenly stop spinning it will exert a rotational force into the direction of the wheel rotation, which should rotate the craft. I read that the size and speed are important, but it can be possible to rotate ships.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYep, that\u0027s the idea! It would work just the way you\u0027re thinking, too. It doesn\u0027t even need to rely on gyroscopic precession, it can just be \u0027the reaction wheel spins one way so the ship spins the other way\u0027, though folks have definitely made some more complicated designs! The trouble Snark is pointing out is that there\u0027s a limit to to how fast the little wheels can spin, so there\u0027s a crippling limit on how fast they can spin your craft. Once a wheel is spinning as fast as it can go, it can\u0027t provide any more torque for that direction, which is called saturation.That would mean that once you\u0027ve used the reaction wheel a certain (small) amount in one direction, it would suddenly stop working! Realistic max rotation speeds for crafts are slow, and the reaction wheels would also saturate really really (really) fast if they\u0027re fighting external torques like aerodynamic effects, misaligned engines or rocket-gimbal, as commonly occur in KSP.\n\u003C/p\u003E\n\u003Cp\u003E\nTo desaturate a reaction control wheel so it can provide torque in that direction again, you would need to give the wheel a chance to slow down by torqueing against it with (for practical purposes) RCS, so we\u0027d need to bring RCS anyways. Ultimately, the reaction wheels would be useful for gentle attitude control or very slow manuevers, while the RCS would be used for any typical KSP style maneuvering. To model these effects correctly in-game, we\u0027d need to keep track of how fast each of the reaction wheels was spinning, or as Snark more directly put, how much angular momentum is stored in each of the wheels. Then, when the wheel is at max speed, cut out the wheel so it stops providing torque for that direction. We\u0027d also need a way to visualize all this, so we could know when we need to slow down the reaction wheels (aka dump momentum) before it becomes problematic. Though it sounds like a fun exercise, it also doesn\u0027t sound like fun day-to-day playing to me!\n\u003C/p\u003E\n\u003Cp\u003E\nFinally, if we want equal torque for all directions, the reaction wheels would be setup in a cube shaped housing, which is awkward. There\u0027s other designs (Hubble), but they get crazy complicated (Hubble). Alright, I hope that helps explain the nuances!\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-17T06:53:37Z\u0022 title=\u002206/17/2016 06:53  AM\u0022 data-short=\u00228 yr\u0022\u003EJune 17, 2016\u003C/time\u003E by Cunjo Carl\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"tseitsei89","CreatedById":162979,"CreatedDateTime":"2016-06-17T07:41:22Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222634349\u0022 data-ipsquote-contentid=\u0022141896\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466127174\u0022 data-ipsquote-userid=\u0022125662\u0022 data-ipsquote-username=\u0022Snark\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, Snark said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe problem is that you\u0027d have to somehow keep track of the angular momentum currently stored in the wheels, which would be a pain to visualize and/or control.  And you\u0027d have to have separate controls for \u0022exert RCS torque\u0022 versus \u0022exert reaction-wheel torque\u0022.  It\u0027s the sort of thing that computer programs can handle just fine, but would be a nightmare for a human to control in a video game.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSorry but is there something I can\u0027t really understand here?\n\u003C/p\u003E\n\u003Cp\u003E\nCouldn\u0027t you just add new \u0022bars\u0022 in the resource tab (where fuel, ec, oxidizer etc. are shown) for angular momentum in x y and z directions.\n\u003C/p\u003E\n\u003Cp\u003E\nYou could also simply just \u0022exert reaction wheel torque\u0022 when your rcs is turned off (R button in game) and \u0022exert rcs torque\u0022 when rcs is activated. \n\u003C/p\u003E\n\u003Cp\u003E\nAnd the last problem: \u0022resetting the angular momentum of reaction wheels\u0022. When you are landed they would obviously reset automatically. When in space we could simply have a button \u0022reset angular momentum\u0022 which would start to slow down all reaction wheels AND automatically (try to) counter any rotation caused to the ship with rcs if the ship has any of those.\n\u003C/p\u003E\n\u003Cp\u003E\nIMO these should work just fine but maybe I\u0027m missing something...\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-17T07:43:11Z\u0022 title=\u002206/17/2016 07:43  AM\u0022 data-short=\u00228 yr\u0022\u003EJune 17, 2016\u003C/time\u003E by tseitsei89\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"kBob","CreatedById":102132,"CreatedDateTime":"2016-06-17T08:35:34Z","Content":"\n\u003Cp\u003E\nI\u0027m no modder, yet, so I may be way off but wouldn\u0027t the saturation effect be achievable through timers?  As in it takes x seconds to reach saturation and x seconds to spin down, so just make the reaction wheel ineffective in the interval.  Not perfect since it ignores any effects during the spin down period (just assumes there are brakes/torques rods/whatever that can slow it down with no other side effects) but maybe a little closer to RL should someone care to make a new part, and pretty simple calculation wise  This way the RCS system just continues to work as it always does. \n\u003C/p\u003E\n\u003Cp\u003E\nOr for that matter just make a reaction wheel that works well for small rotations but loses it effect after the rotation exceeds x degrees then resets when the ship rotation has stopped.  Again the RCS system would just continue to work as normal.  Confusing for the player?  Perhaps, but one they would chose since they want that effect.  One possibility would be changeable parameter for the number of the degree cut off (to mimic different construction techniques and or sizes).\n\u003C/p\u003E\n\u003Cp\u003E\nThen there is a new part for when you want the challenge and the old part when you just want to do stuff the Kerbal way.  To me having the best of both worlds (realism vs. gameplay: let the player decide what he/she wants) is preferable.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWhile researching reaction wheels I came across these two product announcements about reaction wheel use, I can almost hear the  Kerbal salesman:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://spinoff.nasa.gov/spinoff1997/t3.html\u0022 rel=\u0022external nofollow\u0022\u003EHigh torque reaction wheel\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://www.nasa.gov/centers/ames/research/technology-onepagers/advanced_min_wheel.html\u0022 rel=\u0022external nofollow\u0022\u003EMinature reaction wheel\u003C/a\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-17T08:36:21Z\u0022 title=\u002206/17/2016 08:36  AM\u0022 data-short=\u00228 yr\u0022\u003EJune 17, 2016\u003C/time\u003E by kBob\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2016-06-17T09:14:49Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222634588\u0022 data-ipsquote-contentid=\u0022141896\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466146318\u0022 data-ipsquote-userid=\u0022162109\u0022 data-ipsquote-username=\u0022Cunjo Carl\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Cunjo Carl said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nYep, that\u0027s the idea! It would work just the way you\u0027re thinking, too. It doesn\u0027t even need to rely on gyroscopic precession, it can just be \u0027the reaction wheel spins one way so the ship spins the other way\u0027, though folks have definitely made some more complicated designs! The trouble Snark is pointing out is that there\u0027s a limit to to how fast the little wheels can spin, so there\u0027s a crippling limit on how fast they can spin your craft. Once a wheel is spinning as fast as it can go, it can\u0027t provide any more torque for that direction, which is called saturation.That would mean that once you\u0027ve used the reaction wheel a certain (small) amount in one direction, it would suddenly stop working! Realistic max rotation speeds for crafts are slow, and the reaction wheels would also saturate really really (really) fast if they\u0027re fighting external torques like aerodynamic effects, misaligned engines or rocket-gimbal, as commonly occur in KSP.\n\u003C/p\u003E\n\u003Cp\u003E\nTo desaturate a reaction control wheel so it can provide torque in that direction again, you would need to give the wheel a chance to slow down by torqueing against it with (for practical purposes) RCS, so we\u0027d need to bring RCS anyways. Ultimately, the reaction wheels would be useful for gentle attitude control or very slow manuevers, while the RCS would be used for any typical KSP style maneuvering. To model these effects correctly in-game, we\u0027d need to keep track of how fast each of the reaction wheels was spinning, or as Snark more directly put, how much angular momentum is stored in each of the wheels. Then, when the wheel is at max speed, cut out the wheel so it stops providing torque for that direction. We\u0027d also need a way to visualize all this, so we could know when we need to slow down the reaction wheels (aka dump momentum) before it becomes problematic. Though it sounds like a fun exercise, it also doesn\u0027t sound like fun day-to-day playing to me!\n\u003C/p\u003E\n\u003Cp\u003E\nFinally, if we want equal torque for all directions, the reaction wheels would be setup in a cube shaped housing, which is awkward. There\u0027s other designs (Hubble), but they get crazy complicated (Hubble). Alright, I hope that helps explain the nuances!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nTrue, however real world engines has far larger gimbal range than KSP engines, control system will simply rotate the engine to compensate for any unbalance. \u003Cbr\u003E\nreaction wheels has to be bleed of if they fight drag or tidal forces. even light pressure. \u003Cbr\u003E\u003Cbr\u003E\nMost real life manned crafts are heavy and is just used on short missions so they use rcs not reaction wheels, exception is ISS who is long term. \u003Cbr\u003E\nLike ion engines this is overpowered in KSP so we don\u0027t have 3 minutes rotations, this is not an issue for real probes but boring in a game. \n\u003C/p\u003E\n"},{"CreatedByName":"Matt77","CreatedById":69015,"CreatedDateTime":"2016-06-17T11:55:56Z","Content":"\n\u003Cp\u003E\nI think the physics are more than good enough.\n\u003C/p\u003E\n\u003Cp\u003E\nAt the start of my present career, unmanned and low-tech, I was using spin-stabilised rockets. I\u0027m sure it wasn\u0027t a glitch when a rapidly spinning one opened its chute, then hung at 90 degrees to the lines due I think to gyroscopic forces.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027d love to see the stock game make more use of the solid body physics with grabs, levers, bearings etc.\n\u003C/p\u003E\n"},{"CreatedByName":"DiamondExcavater","CreatedById":72325,"CreatedDateTime":"2016-06-17T12:06:53Z","Content":"\n\u003Cp\u003E\nImagine if KSP used body damage, similar to gta 5 with dent-able pieces and also terrain damage of sorts, I know this will be really heavy for an already heavy game (it\u0027s been growing since it came out) and will be annoying if you don\u0027t want damage, but the terrain could \u0022heal back\u0022 either way that would make ground impacts more fun like the start menu \u0022mum or bust\u0022 and also allow better survivability with the ground acting like water and enveloping  the craft in a way to slow it down faster, instead of these \u0022mostly\u0022 smooth surfaces which can\u0027t move. I am very very sure that a space craft will fair better if it \u0022crash\u0022 landed in sand rather than a stony area like mountains or even rock hard ice.. \n\u003C/p\u003E\n\u003Cp\u003E\nBtw are hot air balloons possible with a heat producing engines (all engines really lol) able to blow hot air into parachutes to blow them up? I\u0027m thinking no due to thermal damage on parachute and also KSP may not like old technologies \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-06-17T15:12:12Z","Content":"\n\u003Cp\u003E\nSo, several posts ago I made some comments in which I made, basically, two assertions:\n\u003C/p\u003E\n\u003Col\u003E\u003Cli\u003E\nKSP reaction wheels are physically impossible, because they violate the laws of physics.  They\u0027re not just \u0022too powerful\u0022, they\u0027re \u003Cem\u003E\u003Cu\u003Eimpossible\u003C/u\u003E\u003C/em\u003E, in the same sense that a perpetual-motion machine is impossible.\n\u003C/li\u003E\n\u003Cli\u003E\nIf the game were changed to implement in a realistic fashion (i.e. non-impossible), it would be un-fun, confusing, and not very playable for most players.\n\u003C/li\u003E\n\u003C/ol\u003E\u003Cp\u003E\nThe first statement is a matter of physical fact; the second is merely a strongly-held opinion.  \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E  I\u0027ve seen a variety of responses.  There have been a few responses to point #1 that indicate not quite understanding how reaction wheels work-- I\u0027m not criticizing, it\u0027s understandable, this stuff is far from obvious!  I\u0027d like to address some misconceptions.  I\u0027ll start with a few example quotes that seem to me to be making some mistaken assumptions about how this stuff works:\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222634269\u0022 data-ipsquote-contentid=\u0022141896\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466123157\u0022 data-ipsquote-userid=\u0022162979\u0022 data-ipsquote-username=\u0022tseitsei89\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n15 hours ago, tseitsei89 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI really don\u0027t see why (more) realistic reaction wheels would be that bad.. Then we would just have to use more RCS to control the attitude of our crafts but that\u0027s not really that hard either now is it? Just slap in one mono tank and few rcs ports at both ends of the ship and you\u0027ll be just fine in most cases...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI may be reading this incorrectly, but my interpretation of this is that you\u0027re assuming that \u0022reaction wheels are just like RCS, except much weaker.\u0022  Which is not the case-- they work in a completely different fashion and have very different rules about how they operate.  Using RCS is simple and intuitive, and the principle is obvious; it\u0027s pretty much a given that anybody reading this has an accurate picture in their heads about how it works.  This is not the case with reaction wheels, as I\u0027ll get into below.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222634547\u0022 data-ipsquote-contentid=\u0022141896\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466141451\u0022 data-ipsquote-userid=\u002272325\u0022 data-ipsquote-username=\u0022DiamondExcavater\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 hours ago, DiamondExcavater said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI am saying that the reaction wheels are unrealistic to an extent, the way I see it (I am not the strongest in this field) is that there is a spinning gyroscope or a \u0022wheel\u0022 that spins within certain parts of the ship (lets say centre of mass). This wheel is spinning at the very centre of the craft longitudinally up the long shaft of the craft, if it were to suddenly stop spinning it will exert a rotational force into the direction of the wheel rotation, which should rotate the craft. I read that the size and speed are important, but it can be possible to rotate ships.\n\u003C/p\u003E\n\u003Cp\u003E\n...I don\u0027t know if I explained that properly, but I do agree the KSP torque might be a bit too strong, but possible to an extent.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNo, you explained it perfectly clearly, you\u0027re just wrong.  \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E  (I mean that in the nicest way.)  You\u0027re perfectly correct that real reaction wheels can \u003Cu\u003E\u003Cem\u003Erotate\u003C/em\u003E\u003C/u\u003E a craft, but you\u0027re missing a subtle but vitally important point.  What they can\u0027t do-- because it would \u003Cem\u003E\u003Cu\u003Eviolate a fundamental law of physics\u003C/u\u003E\u003C/em\u003E, and which the KSP reaction wheels do, which is why they\u0027re impossible and not just \u0022too strong\u0022-- is to \u003Cem\u003E\u003Cu\u003Ecreate angular momentum\u003C/u\u003E\u003C/em\u003E.  More on this below.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222634638\u0022 data-ipsquote-contentid=\u0022141896\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466152534\u0022 data-ipsquote-userid=\u0022102132\u0022 data-ipsquote-username=\u0022kBob\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, kBob said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027m no modder, yet, so I may be way off but wouldn\u0027t the saturation effect be achievable through timers?  As in it takes x seconds to reach saturation and x seconds to spin down, so just make the reaction wheel ineffective in the interval.  Not perfect since it ignores any effects during the spin down period (just assumes there are brakes/torques rods/whatever that can slow it down with no other side effects)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNo.  I see that you understand the idea of saturation, which is great.  \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E  The problem is that the only way to de-saturate is to \u003Cem\u003E\u003Cu\u003Eexert counter-torque\u003C/u\u003E\u003C/em\u003E on the ship.  That is, every single scrap of torque that the reaction wheel previously generated in one direction, it has to then exert in the opposite direction to de-saturate, completely canceling out any angular momentum it previously imparted.  \u003Cem\u003E\u003Cu\u003EIt is physically impossible to \u0022slow it down with no other side effects\u0022\u003C/u\u003E\u003C/em\u003E, which is the vital point at the center of all this that most folks seem to miss.  If you\u0027ve got brakes or whatever to slow it down... those brakes are \u003Cem\u003E\u003Cu\u003Emounted on the ship\u003C/u\u003E\u003C/em\u003E, and the act of slowing the reaction wheel down will \u003Cem\u003E\u003Cu\u003Etwist the ship\u003C/u\u003E\u003C/em\u003E.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222634638\u0022 data-ipsquote-contentid=\u0022141896\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466152534\u0022 data-ipsquote-userid=\u0022102132\u0022 data-ipsquote-username=\u0022kBob\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, kBob said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOr for that matter just make a reaction wheel that works well for small rotations but loses it effect after the rotation exceeds x degrees then resets when the ship rotation has stopped.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNo, it doesn\u0027t work that way.  There\u0027s  no limit on \u0022degrees of rotation.\u0022  You could have a thousand-ton ship, and a little one-kilogram reaction wheel can rotate that giant ship by as many degrees as you like.  (It will take practically forever, but give it enough time and it\u0027ll get there.)  What it can\u0027t do (and which the KSP wheels can, which is what makes them impossible) is impart persistent rotation to the ship.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222634652\u0022 data-ipsquote-contentid=\u0022141896\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466154889\u0022 data-ipsquote-userid=\u002257801\u0022 data-ipsquote-username=\u0022magnemoe\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, magnemoe said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMost real life manned crafts are heavy and is just used on short missions so they use rcs not reaction wheels, exception is ISS who is long term. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nExcept that even the ISS needs to expend fuel.  RCS can do two very important things:  1. Adjust the rotational \u003Cu\u003E\u003Cem\u003Eposition\u003C/em\u003E\u003C/u\u003E of the craft.  2.  Adjust the rotational \u003Cem\u003E\u003Cu\u003Emomentum\u003C/u\u003E\u003C/em\u003E of the craft.  Reaction wheels can do #1, but not #2, which is why you pretty much have to have RCS regardless of whether you have reaction wheels.  Having the reaction wheels just means that they can use them for #1 tasks instead of wasting fuel on that.  The thing that\u0027s wrong with KSP reaction wheels is that they can do #2, which in real life is impossible.\n\u003C/p\u003E\n\u003Cp\u003E\nOkay, I hear you say, you keep going on and on about how \u0022it\u0027s impossible\u0022, Snark.  What\u0027s so impossible about it?\n\u003C/p\u003E\n\u003Cp\u003E\nHere\u0027s the deal:\n\u003C/p\u003E\n\u003Cp\u003E\nThere\u0027s a really important law of physics, right up there with the law of conservation of mass-energy, conservation of momentum, and so forth.  \u003Cstrong\u003E\u003Cu\u003E\u003Cem\u003EAngular momentum is conserved.\u003C/em\u003E\u003C/u\u003E\u003C/strong\u003E  Put simply, you can\u0027t make an object spin in one direction without making something else spin in the opposite direction.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, although angular \u003Cem\u003E\u003Cu\u003Emomentum\u003C/u\u003E\u003C/em\u003E is conserved, angular \u003Cem\u003E\u003Cu\u003Eposition\u003C/u\u003E\u003C/em\u003E is not, which is why reaction wheels are a thing.  Let\u0027s say you have a spaceship that has a reaction wheel on board.  The ship is floating in space, and is at a dead standstill, rotationally speaking.  Nothing\u0027s rotating at all:  not the ship, not the wheel.  Let\u0027s say the ship is pointed east, and you want it to be pointing west.  What do you do?\n\u003C/p\u003E\n\u003Cp\u003E\nSimple:  you start the reaction wheel spinning.  To start it spinning, you\u0027ve got an electric motor mounted on the ship.  It exerts torque on the wheel to start it spinning up to, let\u0027s say, 1000 RPM.  Doing that exerts an equal and opposite torque on the motor, which is mounted to the ship, so the ship starts rotating in the opposite direction to the wheel.  But since the ship is much, much bigger and more massive than the wheel, it rotates much more slowly than the wheel does.  Let\u0027s say it\u0027s rotating at 0.1 RPM.\n\u003C/p\u003E\n\u003Cp\u003E\nSo... you just wait five minutes (with the wheel spinning the whole time), after which the ship has rotated 180 degrees and is now pointing the direction you want it to.  Now you need to stop the ship.  How do you do this?  Easy:  Just apply brakes to the reaction wheel and stop it.  This torques the wheel in the opposite direction that you did when you spun it up... which means it torques the \u003Cem\u003E\u003Cu\u003Eship\u003C/u\u003E\u003C/em\u003E in the opposite direction that you initially started it rotating.  And it\u0027s a \u003Cem\u003E\u003Cu\u003Eprecisely\u003C/u\u003E\u003C/em\u003E equal and opposite amount (that\u0027s what conservation of angular momentum is all about).  So no high-tech is needed:  just put on the brakes and stop the wheel.  Presto, both ship and wheel are now precisely at a dead halt with no rotation, and the ship is pointed the opposite direction from what it was.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, that\u0027s what a reaction wheel \u003Cem\u003E\u003Cu\u003Ecan\u003C/u\u003E\u003C/em\u003E do.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat it \u003Cem\u003E\u003Cu\u003Ecannot\u003C/u\u003E\u003C/em\u003E do is supply a torque that permanently affects the rotation of the ship.  In the above scenario, suppose I have a ship that\u0027s \u003Cem\u003E\u003Cu\u003Ealready\u003C/u\u003E\u003C/em\u003E slowly rotating at 0.1 RPM, and I want to \u003Cem\u003E\u003Cu\u003Estop\u003C/u\u003E\u003C/em\u003E it.  Well, I \u003Cem\u003E\u003Cu\u003Ecan\u003C/u\u003E\u003C/em\u003E stop it with the reaction wheel (by spinning it up to 1000 RPM to counter the rotation)... and now I have the ship happily sitting there, stopped.  That\u0027s what I wanted, right?  Except that now my reaction wheel is spinning madly at 1000 RPM and I can\u0027t use it anymore for torque in that direction because that\u0027s as fast as it can go.  This is what we mean when we say the wheel is \u0022saturated\u0022.  \u003Cem\u003E\u003Cu\u003EAnd there is no way to de-saturate it without precisely mathematically UNdoing all the work that it just did\u003C/u\u003E\u003C/em\u003E.  Sure, you can stop the wheel rotating by applying the brakes... which will start the ship rotating again in exactly the direction and speed that it was going before you turned on the wheel.\n\u003C/p\u003E\n\u003Cp\u003E\nHere\u0027s an analogy that might help to think of it:  You have a big house (your ship), and one fairly small trash can (the reaction wheel).  The house contains a certain amount of trash (unwanted angular momentum).  Yes, you can clean up your house, to a certain limited extent, by picking up the trash and moving it into the trash can.  However... you can only put a certain amount of trash into the can, and then \u003Cem\u003E\u003Cu\u003Eit\u0027s full and can\u0027t hold any more.\u003C/u\u003E\u003C/em\u003E  Furthermore, there\u0027s no way to get rid of the trash in the trash can, because all the doors and windows are sealed shut and it\u0027s a closed system.  The only way to empty the trash can is to take the trash out of it and strew it around the house again.  The thing that\u0027s wrong about KSP reaction wheels is \u003Cem\u003E\u003Cu\u003Enot\u003C/u\u003E\u003C/em\u003E simply \u0022the trash can is unrealistically big\u0022 (though it is).  Rather, they\u0027re implemented in a way that \u003Cem\u003E\u003Cu\u003Emakes the trash magically disappear when you put it into the can\u003C/u\u003E\u003C/em\u003E.  And \u003Cem\u003E\u003Cu\u003Ethat\u003C/u\u003E\u003C/em\u003E is the impossible part.\n\u003C/p\u003E\n\u003Cp\u003E\nRCS isn\u0027t subject to these limitations.  In the above analogy, if you have RCS, you \u003Cem\u003E\u003Cu\u003Ecan\u003C/u\u003E\u003C/em\u003E empty the trash can, because RCS opens a window and tosses the trash out through that.  It doesn\u0027t actually \u003Cem\u003Edestroy\u003C/em\u003E the trash (which is impossible), but it gets it out of the house, which is all you care about.  \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSo that\u0027s it for the physical impossibility of KSP reaction wheels.\n\u003C/p\u003E\n\u003Cp\u003E\nMy other assertion is that making them behave in an actually realistic way would make the game confusing and un-fun for most users.  In this case, we\u0027re just talking about my opinion rather than physical law.  One could reasonably argue the opposite, as here:\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222634614\u0022 data-ipsquote-contentid=\u0022141896\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466149282\u0022 data-ipsquote-userid=\u0022162979\u0022 data-ipsquote-username=\u0022tseitsei89\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, tseitsei89 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSorry but is there something I can\u0027t really understand here?\n\u003C/p\u003E\n\u003Cp\u003E\nCouldn\u0027t you just add new \u0022bars\u0022 in the resource tab (where fuel, ec, oxidizer etc. are shown) for angular momentum in x y and z directions.\n\u003C/p\u003E\n\u003Cp\u003E\nYou could also simply just \u0022exert reaction wheel torque\u0022 when your rcs is turned off (R button in game) and \u0022exert rcs torque\u0022 when rcs is activated. \n\u003C/p\u003E\n\u003Cp\u003E\nAnd the last problem: \u0022resetting the angular momentum of reaction wheels\u0022. When you are landed they would obviously reset automatically. When in space we could simply have a button \u0022reset angular momentum\u0022 which would start to slow down all reaction wheels AND automatically (try to) counter any rotation caused to the ship with rcs if the ship has any of those.\n\u003C/p\u003E\n\u003Cp\u003E\nIMO these should work just fine but maybe I\u0027m missing something...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe answer to everything you just said is \u0022yes, you could do that.\u0022  Everything that you just described would be possible to implement.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever... I contend that there\u0027s basically no way to make this work in a way that the majority of players can wrap their heads around, and it would require difficult mental gymnastics to use appropriately even for someone who \u003Cem\u003E\u003Cu\u003Edoes\u003C/u\u003E\u003C/em\u003E have the right mental model (which would be very few people).\n\u003C/p\u003E\n\u003Cp\u003E\nWitness how hard it is just to get people to understand why KSP reaction wheels are currently impossible.  It\u0027s a hard concept.\n\u003C/p\u003E\n\u003Cp\u003E\nYes, you could have some X,Y,Z bars for angular momentum... but can \u003Cem\u003E\u003Cu\u003Eyou\u003C/u\u003E\u003C/em\u003E map that in your head?  As in, on the one hand you see three bars, and on the other hand you see your ship on the screen, oriented at some odd angle, spinning at some other angle, and you have to somehow do the mental transformation that this trio of bars \u003Cem\u003E\u003Cu\u003Ehere\u003C/u\u003E\u003C/em\u003E somehow maps to this complex 3D rotational situation over \u003Cem\u003E\u003Cu\u003Ethere\u003C/u\u003E\u003C/em\u003E?  Can \u003Cem\u003E\u003Cu\u003Eyou\u003C/u\u003E\u003C/em\u003E do that?  I\u003Cem\u003E\u0027\u003C/em\u003Em pretty sure that \u003Cem\u003E\u003Cu\u003EI\u003C/u\u003E\u003C/em\u003E couldn\u0027t, and I\u0027ve got a physics degree and know what a tensor is.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd an automatic system can\u0027t do all the work.  It requires advance planning and understanding by the player.  If I\u0027ve got my ship at a rotational dead halt, and I start it rotating slowly in one direction... \u003Cem\u003E\u003Cu\u003Ewhy\u003C/u\u003E\u003C/em\u003E did I just do that?  Did I do it because I want to change my rotational \u003Cem\u003E\u003Cu\u003Eposition\u003C/u\u003E\u003C/em\u003E and I intend to stop the motion once I\u0027ve rotated far enough?  Or did I do it because I want to change my rotational \u003Cem\u003E\u003Cu\u003Emomentum\u003C/u\u003E\u003C/em\u003E and I plan to leave it rotating?  In the former case, I should use the reaction wheel; in the latter case, I should use RCS.\n\u003C/p\u003E\n\u003Cp\u003E\nEither you make the user have to know and understand all that stuff-- in which I contend the game becomes confusing and un-fun for the vast majority of players, including me-- or else you somehow have a computer system that automatically takes care of all that, in which case why even bother having the two systems at all?  It would just be adding a bunch of complexity for no reason.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m not trying to say that \u003Cem\u003E\u003Cu\u003Enobody\u003C/u\u003E\u003C/em\u003E would enjoy working with realistic reaction wheels.  I\u0027m sure there are some hard-core realism nerds out there who like to use KSP as a \u003Cem\u003E\u003Cu\u003Esimulator\u003C/u\u003E\u003C/em\u003E rather than a game, and the more realistic the better, and they actually take joy in tricky physical interactions like that.  So maybe a mod would be nice, for people like that.\n\u003C/p\u003E\n\u003Cp\u003E\nBut that does not describe the overwhelming majority of KSP players (including me), who would merely be confused and annoyed by the complexity.\n\u003C/p\u003E\n"},{"CreatedByName":"Cunjo Carl","CreatedById":162109,"CreatedDateTime":"2016-06-17T15:19:19Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222634652\u0022 data-ipsquote-contentid=\u0022141896\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466154889\u0022 data-ipsquote-userid=\u002257801\u0022 data-ipsquote-username=\u0022magnemoe\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, magnemoe said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nTrue, however real world engines has far larger gimbal range than KSP engines, control system will simply rotate the engine to compensate for any unbalance. \u003Cbr\u003E\nreaction wheels has to be bleed of if they fight drag or tidal forces. even light pressure. \u003Cbr\u003E\u003Cbr\u003E\nMost real life manned crafts are heavy and is just used on short missions so they use rcs not reaction wheels, exception is ISS who is long term. \u003Cbr\u003E\nLike ion engines this is overpowered in KSP so we don\u0027t have 3 minutes rotations, this is not an issue for real probes but boring in a game. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nTotally agree, that\u0027s why I added the \u0022as seen in KSP\u0022 caveat. I\u0027m sure you\u0027ve also seen how often KSP realities and ambitions diverge from reality. I think that\u0027s part of the charm!\n\u003C/p\u003E\n\u003Cp\u003E\nAs another note, for adding SAS management of stored reaction wheel momentum, my KSP rockets have already been dancing jaunty jigs with their SAS since the 1.0 switch. I think adding \u0027manage control resources\u0027 to their priorities will only make them dance harder! \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E  ...  Come to think of it, \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/125662-snark/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022125662\u0022 href=\u0022%7B___base_url___%7D/index.php?/profile/125662-snark/\u0022 rel=\u0022external\u0022\u003E@Snark\u003C/a\u003E, I can write up a general PID controller solver no problem, do you think squad would want one? I know they like they like to do 100% code development in house, but would they want formulas? \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-17T15:22:13Z\u0022 title=\u002206/17/2016 03:22  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 17, 2016\u003C/time\u003E by Cunjo Carl\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-06-17T15:41:48Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222634959\u0022 data-ipsquote-contentid=\u0022141896\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466176759\u0022 data-ipsquote-userid=\u0022162109\u0022 data-ipsquote-username=\u0022Cunjo Carl\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n13 minutes ago, Cunjo Carl said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nCome to think of it, \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/125662-snark/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022125662\u0022 href=\u0022%7B___base_url___%7D/index.php?/profile/125662-snark/\u0022 rel=\u0022external\u0022\u003E@Snark\u003C/a\u003E, I can write up a general PID controller solver no problem, do you think squad would want one? I know they like they like to do 100% code development in house, but would they want formulas? \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell, so can I, and so I expect can lots of folks, and so can the devs at Squad, I expect.  They have some pretty smart people there who know their work.  And I suspect they know how to type \u0022PID formula\u0022 into the Google search box as well as you or I do.  KSP has its share of problems, but those problems are \u003Cem\u003E\u003Cu\u003Enot\u003C/u\u003E\u003C/em\u003E \u0022because the developers don\u0027t know how to code.\u0022  \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI don\u0027t work for Squad and therefore don\u0027t have any more insight than you do into the answer to your question.  However, speaking as an outside-observer-of-Squad for the past couple of years, not to mention as a professional software engineer with a couple of decades of industry experience, I\u0027d have to say that I\u0027d be astonished if they took you up on such an offer.  If they want the code, they can just write it.\n\u003C/p\u003E\n\u003Cp\u003E\nThe fact that SAS has such problems is not just a matter of \u0022here, take a couple of hours from someone who knows what they\u0027re doing, bang out the code and it\u0027s done.\u0022  There are good software-development reasons.  They have finite time, finite money, and finite staff.  They can\u0027t do everything at once.  And this isn\u0027t just a simple PID controller; the game has a lot of complex interactions among multiple parts (including ships that can wobble), and something that sounds good on paper can\u0027t actually be released to the players until it has been extensively tested in just about every possible scenario (which, given the Lego-like nature of KSP, is \u003Cem\u003E\u003Cu\u003Ea doubleplus much very big lot\u003C/u\u003E\u003C/em\u003E.)  This is especially the case since SAS is such a vital, central, game-unplayable-without-it feature to the game that they \u003Cem\u003E\u003Cu\u003Ereally\u003C/u\u003E\u003C/em\u003E can\u0027t take any chances with breaking it.\n\u003C/p\u003E\n\u003Cp\u003E\nThe TL;DR:  whenever you\u0027re using a piece of software, and you see something that looks like it ought to be easy, and is obviously sorely needed, and isn\u0027t there... there\u0027s probably a good reason it isn\u0027t (yet).\n\u003C/p\u003E\n\u003Cp\u003E\nSo my guess is that the idea\u0027s a non-starter.  But by all means bring it to \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/66485-squad/\u0026amp;do=hovercard\u0022 data-mentionid=\u002266485\u0022 href=\u0022%7B___base_url___%7D/index.php?/profile/66485-squad/\u0022 rel=\u0022\u0022\u003E@SQUAD\u003C/a\u003E\u0027s attention and see what they say.  \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"wumpus","CreatedById":133850,"CreatedDateTime":"2016-06-17T15:59:28Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222634952\u0022 data-ipsquote-contentid=\u0022141896\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466176332\u0022 data-ipsquote-userid=\u0022125662\u0022 data-ipsquote-username=\u0022Snark\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n40 minutes ago, Snark said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBut that does not describe the overwhelming majority of KSP players (including me), who would merely be confused and annoyed by the complexity.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nFrom the sound of it, it sounds like it would effect the game roughly as much as the need to settle the fuel before a burn in RO/RSS (maybe even less as there aren\u0027t particularly good reasons to wildly keep accelerating in the same axis).  I\u0027m guessing it is a lot harder to code (probably the hard part is showing how much angular momentum is available, but it might just be coded in too hard).\n\u003C/p\u003E\n\u003Cp\u003E\nBut it really looks like the modding difficulty is more than the degree of accuracy annoyance.  Look at how far the modding community went with N-body physics.  Now that is a seriously hard-coded limitation in KSP that several people just couldn\u0027t handle (I\u0027m in the \u0022please give us fake SOI at Lagrange points\u0022 camp, but wants to play with \u0022fuzzy boundries\u0022 at some point).\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-06-17T16:12:45Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222635015\u0022 data-ipsquote-contentid=\u0022141896\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466179168\u0022 data-ipsquote-userid=\u0022133850\u0022 data-ipsquote-username=\u0022wumpus\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 minutes ago, wumpus said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nFrom the sound of it, it sounds like it would effect the game roughly as much as the need to settle the fuel before a burn in RO/RSS (maybe even less as there aren\u0027t particularly good reasons to wildly keep accelerating in the same axis).  I\u0027m guessing it is a lot harder to code (probably the hard part is showing how much angular momentum is available, but it might just be coded in too hard).\n\u003C/p\u003E\n\u003Cp\u003E\nBut it really looks like the modding difficulty is more than the degree of accuracy annoyance.  Look at how far the modding community went with N-body physics.  Now that is a seriously hard-coded limitation in KSP that several people just couldn\u0027t handle (I\u0027m in the \u0022please give us fake SOI at Lagrange points\u0022 camp, but wants to play with \u0022fuzzy boundries\u0022 at some point).\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nActually, I think it\u0027s precisely the other way around in this case.\n\u003C/p\u003E\n\u003Cp\u003E\nModeling the reaction wheels would actually be very easy to do, programmatically.  You just give each reaction wheel two properties:  1. the current angular momentum stored in it (a vector), and 2. the storage capacity of the wheel (a scalar).  It would be really easy to model and code.\n\u003C/p\u003E\n\u003Cp\u003E\nThe problem is one of \u003Cem\u003E\u003Cu\u003Egame and UI design\u003C/u\u003E\u003C/em\u003E, and playability.  I think it would be really hard to come up with a really intuitive UI that would work for players... especially since the thing you\u0027re trying to model is a complicated physical concept that\u0027s \u003Cem\u003E\u003Cu\u003Eway\u003C/u\u003E\u003C/em\u003E harder to understand than ullage.\n\u003C/p\u003E\n\u003Cp\u003E\nIn short:  I\u0027d say that the reason it\u0027s not there isn\u0027t because it\u0027s hard to \u003Cem\u003Ecode\u003C/em\u003E (because it wouldn\u0027t be).  It\u0027s because it\u0027s hard to get humans to understand it well enough to have fun.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222635015\u0022 data-ipsquote-contentid=\u0022141896\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466179168\u0022 data-ipsquote-userid=\u0022133850\u0022 data-ipsquote-username=\u0022wumpus\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 minutes ago, wumpus said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBut it really looks like the modding difficulty is more than the degree of accuracy annoyance.  Look at how far the modding community went with N-body physics.  Now that is a seriously hard-coded limitation in KSP that several people just couldn\u0027t handle (I\u0027m in the \u0022please give us fake SOI at Lagrange points\u0022 camp, but wants to play with \u0022fuzzy boundries\u0022 at some point).\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat\u0027s a completely different problem.  N-body physics are \u003Cem\u003E\u003Cu\u003Ereally damn hard\u003C/u\u003E\u003C/em\u003E\u003Cem\u003E.  \u003C/em\u003EBy \u0022hard\u0022, I mean \u0022proven to be mathematically impossible to solve.\u0022  You can \u003Cem\u003Esimulate\u003C/em\u003E it to a certain degree of accuracy with a computer running an iterative solution... but it\u0027s a \u003Cem\u003E\u003Cu\u003Every\u003C/u\u003E\u003C/em\u003E difficult computational problem, excruciatingly hard to code in a way that\u0027s performant, and even an \u0022ideal\u0022 solution is going to blow up computationally as the number of objects increase.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E\u003Cu\u003EThat\u003C/u\u003E\u003C/em\u003E is why we don\u0027t have N-body physics, and aren\u0027t going to any time soon.\n\u003C/p\u003E\n\u003Cp\u003E\nAngular momentum (i.e. the \u0022Reaction Wheel Problem\u0022) is trivially simple in comparison; the difficulty there is with the player, not with the math or the code.\n\u003C/p\u003E\n"},{"CreatedByName":"kBob","CreatedById":102132,"CreatedDateTime":"2016-06-17T16:26:33Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222634952\u0022 data-ipsquote-contentid=\u0022141896\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466176332\u0022 data-ipsquote-userid=\u0022125662\u0022 data-ipsquote-username=\u0022Snark\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 minutes ago, Snark said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNo, it doesn\u0027t work that way.  There\u0027s  no limit on \u0022degrees of rotation.\u0022  You could have a thousand-ton ship, and a little one-kilogram reaction wheel can rotate that giant ship by as many degrees as you like.  (It will take practically forever, but give it enough time and it\u0027ll get there.)  What it can\u0027t do (and which the KSP wheels can, which is what makes them impossible) is impart persistent rotation to the ship.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nMy point wasn\u0027t to get exactly the way it would be in real life, just closer, in particular limiting it so it doesn\u0027t seem like the flywheel can keep accelerating infinity and never shatter; I was really just speculating on a couple of hopefully computationally easy ways to simulate the saturation effect.   So by limiting the amount of degrees, I\u0027m not saying that is the way it works in real life, I\u0027m saying that would be a quickie way (programming short cut) of including saturation into the problem as that is programmatically probably a quick way of approximating RL saturation, sure your ship keeps rotating it\u0027s just the reaction wheel is no longer helping.  \n\u003C/p\u003E\n\u003Cp\u003E\nNow as to how to slow it down using \u0022brakes\u0022 i.e. get rid of the excess momentum, well due to the complications my idea was to simply give a short period where the wheel no longer works, this way we don\u0027t have to calculate all the counter effects, while of course it\u0027s still not acting like it should in RL, at least it\u0027s a little closer.  This method is also, of course computationally easy (since you don\u0027t have to compute anything just wait a bit). \n\u003C/p\u003E\n\u003Cp\u003E\nAlso you can, if I understand how they work, use torque rods if you happen to be in a convenient magnetic field to bleed off the momentum without effecting the ship instead you bleed it of to whatever is generating the magnetic field (in LEO that would be the Earth, of course); sort of like we rob a planet of a bit of its momentum when we slingshot around it. \n\u003C/p\u003E\n\u003Cp\u003E\nOnce that is done and we have a more realistic wheel than we might go for the second part and simulate exactly how the reaction wheel works if we want to get closer to the real thing than our semi-realistic wheel.\n\u003C/p\u003E\n\u003Cp\u003E\nOf course, it may well be that 99.9% of people trying to use a realistic reaction wheel would quickly go back to the standard one, but it might be fun to try one and see how it works in RL and how it might complicate the game and so on. \n\u003C/p\u003E\n\u003Cp\u003E\nNice explanation, your examples are very good and helped my get an even better grasp on this.   I like the trash can analogy reminds me of my chemistry prof who explained the second law of thermodynamics with the simple example of how much more effort/energy is required in keeping your house clean rather than just letting entropy reign supreme. \n\u003C/p\u003E\n"},{"CreatedByName":"wumpus","CreatedById":133850,"CreatedDateTime":"2016-06-17T16:43:24Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222635032\u0022 data-ipsquote-contentid=\u0022141896\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466179965\u0022 data-ipsquote-userid=\u0022125662\u0022 data-ipsquote-username=\u0022Snark\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 minutes ago, Snark said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThat\u0027s a completely different problem.  N-body physics are \u003Cem\u003E\u003Cu\u003Ereally damn hard\u003C/u\u003E\u003C/em\u003E\u003Cem\u003E.  \u003C/em\u003EBy \u0022hard\u0022, I mean \u0022proven to be mathematically impossible to solve.\u0022\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI think a mathematician would quibble on your definition of \u0022proof\u0022.  Certainly any \u0022solution\u0022 would contain the same instability of a simulation (after a million years or so, changes in weather today would alter which side of the Sun the Earth ends up on).\n\u003C/p\u003E\n\u003Cp\u003E\nThere are two issues with KSP\u0027s gravity simulation:\n\u003C/p\u003E\n\u003Cp\u003E\n1.  The spacecraft is only effected by a single source of gravity: fixing this in \u0022unwarped time\u0022 is trivial.  Just add a \u0022F=Gm1m2/r**2\u0022 for each body in the system.  Problem: you can\u0027t have \u0022physicsless warp\u0022 anymore.  I\u0027m not sure how they deal with that (and does it make ion drives functional?).\n\u003C/p\u003E\n\u003Cp\u003E\n2.  The planets/moons are on rails.  Well, first you have to fix Jool\u0027s moons, because they have been known to be unstable for quite some time (and early simulation showed a moon ejected only after a few orbits).  Then your calculations bog down as you get to compute that \u0022F=Gm1m2/r**2\u0022 as it scales factorally over the number of bodies you are willing to calculate.  Somehow I suspect that for anyone willing to get rid of Squads SOI hack, they feel fixing this is necessary (I doubt it changes the game at all).\n\u003C/p\u003E\n\u003Cp\u003E\nIn the end, the problem is remarkably similar to the \u0022inertial wheel problem\u0022.  While doing the physics is *hard*, the reason you need to do hard physics is the UI (KSP players like warp and don\u0027t want to sit and watch in realtime).  Basically it comes down to how accurate you want your maneuver nodes.  Computing a maneuver node requires you to simulate all the physics for the entire length of time the maneuver node shows.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m guessing the UI for running out of available angular momentum is easy.  Using RCS to compensate while reducing the angular velocity of the wheels is something else.  I\u0027m sure there are kerbal players at APL (Johns Hopkins Applied Physics Laboratory, the place that runs Hubble), can we find them and ask them how they control Hubble\u0027s reaction wheels?\n\u003C/p\u003E\n"},{"CreatedByName":"Cunjo Carl","CreatedById":162109,"CreatedDateTime":"2016-06-17T16:45:25Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222634986\u0022 data-ipsquote-contentid=\u0022141896\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466178108\u0022 data-ipsquote-userid=\u0022125662\u0022 data-ipsquote-username=\u0022Snark\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n47 minutes ago, Snark said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWell, so can I, and so I expect can lots of folks, and so can the devs at Squad, I expect.  They have some pretty smart people there who know their work.  And I suspect they know how to type \u0022PID formula\u0022 into the Google search box as well as you or I do.  KSP has its share of problems, but those problems are \u003Cem\u003E\u003Cu\u003Enot\u003C/u\u003E\u003C/em\u003E \u0022because the developers don\u0027t know how to code.\u0022  \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI don\u0027t work for Squad and therefore don\u0027t have any more insight than you do into the answer to your question.  However, speaking as an outside-observer-of-Squad for the past couple of years, not to mention as a professional software engineer with a couple of decades of industry experience, I\u0027d have to say that I\u0027d be astonished if they took you up on such an offer.  If they want the code, they can just write it.\n\u003C/p\u003E\n\u003Cp\u003E\nThe fact that SAS has such problems is not just a matter of \u0022here, take a couple of hours from someone who knows what they\u0027re doing, bang out the code and it\u0027s done.\u0022  There are good software-development reasons.  They have finite time, finite money, and finite staff.  They can\u0027t do everything at once.  And this isn\u0027t just a simple PID controller; the game has a lot of complex interactions among multiple parts (including ships that can wobble), and something that sounds good on paper can\u0027t actually be released to the players until it has been extensively tested in just about every possible scenario (which, given the Lego-like nature of KSP, is \u003Cem\u003E\u003Cu\u003Ea doubleplus much very big lot\u003C/u\u003E\u003C/em\u003E.)  This is especially the case since SAS is such a vital, central, game-unplayable-without-it feature to the game that they \u003Cem\u003E\u003Cu\u003Ereally\u003C/u\u003E\u003C/em\u003E can\u0027t take any chances with breaking it.\n\u003C/p\u003E\n\u003Cp\u003E\nThe TL;DR:  whenever you\u0027re using a piece of software, and you see something that looks like it ought to be easy, and is obviously sorely needed, and isn\u0027t there... there\u0027s probably a good reason it isn\u0027t (yet).\n\u003C/p\u003E\n\u003Cp\u003E\nSo my guess is that the idea\u0027s a non-starter.  But by all means bring it to \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/66485-squad/\u0026amp;do=hovercard\u0022 data-mentionid=\u002266485\u0022 href=\u0022%7B___base_url___%7D/index.php?/profile/66485-squad/\u0022 rel=\u0022external\u0022\u003E@SQUAD\u003C/a\u003E\u0027s attention and see what they say.  \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI totally wasn\u0027t implying that squad doesn\u0027t know how to code, so I really hope it didn\u0027t come across that way! I feel exactly the opposite, in fact. To explain my point of view, one of the many hats I wear in my day job is a control systems engineer including many-complex-interacting-parts systems, so you know, not wanting to stick my nose in, it just got me thinking. On the other hand I\u0027ve also written physics analysis software and simple/unpopular videogames, so we\u0027ll say I have a front line experience and appreciation for what squad\u0027s accomplished, which is:\n\u003C/p\u003E\n\u003Cp\u003E\nA. A CAD system, which I pine for when using the professional alternatives. I\u0027m looking at you, autocad!\u003Cbr\u003E\nB. A multifacetted physics simulator that\u0027s accurate enough to be highly educational but simple enough to be highly enjoyable\u003Cbr\u003E\nC. A program which works on small ships across huge expanses of space\u003Cbr\u003E\nand D. An ongoing community of die-hard fans.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s bloody impressive! I also have an appreciation for how a small team can\u0027t have an expert in everything, so I don\u0027t worry too much when the control systems for my rocket start oscillating divergently. It was just a thought.\n\u003C/p\u003E\n\u003Cp\u003E\nWow, hot topic, apparently!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\n \n\u003C/p\u003E\n"}]}