{"TopicId":141905,"ForumId":16,"TopicTitle":"Eve 1.1.2 Surface level thrust.","CreatedByName":"Vaporized Steel","CreatedById":108520,"CreatedDateTime":"2016-06-16T09:25:36Z","PageNum":1,"Articles":[{"CreatedByName":"Vaporized Steel","CreatedById":108520,"CreatedDateTime":"2016-06-16T09:25:36Z","Content":"\n\u003Cp\u003E\nI haven\u0027t made a ascent rocket for Eve as of yet for a long time.\u003Cbr\u003E\nI did some 1.1.2 research, already knowing that the total sea level to orbit delta V costs 8K instead of 10k or even 12k when comparing to the earliest versions of KSP.\n\u003C/p\u003E\n\u003Cp\u003E\nit turned out this was a tradeoff.\u003Cbr\u003E\nIt may cost 8K delta V, but no matter what engine you use, even the best one which is the aerospike is only around 60% efficient at eves sea level, and I think on average would be 75% fuel efficient until more efficient vaccuum grade engines will take the final craft into orbit at higher altitudes.\n\u003C/p\u003E\n\u003Cp\u003E\nSo in terms of Delta V, yes it\u0027s 8K.\n\u003C/p\u003E\n\u003Cp\u003E\nIn terms of weight it is still weighing like a 10k delta V rocket. Plus, you will need much more engines of the same type to push that weight of the ground.\u003Cbr\u003E\nI managed to create a simple eve ascent rocket with a lander can into orbit. I\u0027m personally am very demanding of myself, and have build eve ascent rockets with 2 lander cans and even a ascent rocket for 4 kerbals in previous versions (the latter with external command seats)\n\u003C/p\u003E\n\u003Cp\u003E\nI tried a design with 2 lander cans. I run into issues where I need so much surface thrust that I either have to part clip girders or tail sections to accomodate enough engines just to get enough TWR, or switch to a candlestick design, or a combination of both.\n\u003C/p\u003E\n\u003Cp\u003E\nThe efficiency of engines on Eve re crap. It suffers the thrust ASL almost by half and the fuel consumption for engines in high pressure atmospheres is obviously a attempt at realism but very punishing.\u003Cbr\u003E\nOne thing bothers me,\n\u003C/p\u003E\n\u003Cp\u003E\nEve is the hardest planet because it has 1: the most gravity, and 2: the densest atmosphere. It should always remain this way. If theres any alternative I would get wet at it\u0027s a planet in the Solar system that\u0027s even harder.\u003Cbr\u003E\nAlthough it bothers me that Eve is hardest in both gravity and atmospheric density, The realistic changes to SLT makes eve harder in one area at the least. Which is strange because there seems to be no stepping stone in between eve Laythe, Tylo or Kerbin. I think there should be atleast a body that has similar gravity to eve but with little to no atmosphere.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd if Squad doesn\u0027t want to add additional bodies in the game, perhaps change the values of a already existing object.\u003Cbr\u003E\u003Cbr\u003E\u003Cstrong\u003EMy question: \u003C/strong\u003EWhat Kerbal grade rocket engine for a future KSP update based on a in real life counterpart would be produce a more efficient SLT? If such a engine design is unrealistic and thus shouldn\u0027t be added to the game is it possible to add a weightier engine, with the same bad efficieny, as long as it is a 1.25meter part with increased thrust so I don\u0027t have to use to many strap on engines? I care both about a alternative for increased ASL engine efficiency on EVE aswell as better SLT limiting the amount of engines to engineer slimmer rocket designs.\n\u003C/p\u003E\n\u003Cp\u003E\nI run into both problems as soon as I want to launch anything into orbit thats weightier then 1 lander can. Now you might suggest, \u0022just use one lander can\u0022 and send multiple rockets to the surface if you have more then one crew member there. A obvious thing to suggest. But I always like to have the freedom in KSP to push the limit, and on Eve this seems to be limited with the current stock parts. And any modded rocket part aswell as they suffer the same efficiency as long as they use rocket propellant.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-16T09:31:41Z\u0022 title=\u002206/16/2016 09:31  AM\u0022 data-short=\u00228 yr\u0022\u003EJune 16, 2016\u003C/time\u003E by Vaporized Steel\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"FullMetalMachinist","CreatedById":156531,"CreatedDateTime":"2016-06-16T13:11:08Z","Content":"\n\u003Cp\u003E\nYou might want to look into \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/128005-ohiobob/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022128005\u0022 href=\u0022%7B___base_url___%7D/index.php?/profile/128005-ohiobob/\u0022 rel=\u0022\u0022\u003E@OhioBob\u003C/a\u003E\u0027s \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/136342-112-eve-optimized-engines/\u0022 rel=\u0022\u0022\u003EEve Optimized Engines\u003C/a\u003E. \n\u003C/p\u003E\n"},{"CreatedByName":"Vaporized Steel","CreatedById":108520,"CreatedDateTime":"2016-06-16T13:27:28Z","Content":"\n\u003Cp\u003E\nMany thanks, I didn\u0027t know about that mod, what a relieve.\n\u003C/p\u003E\n\u003Cp\u003E\nUnless Squad considers the current challenge with stock nozzles a fair one, I think optimized engines for EVE should be stock to the game. I find it rather rare that default game functions over complicate a stock mission profile in the game, in this case only for the planet Eve. Unless someone suggest taking off from Jool \u003Cimg alt=\u0022:sticktongue:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 title=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"mk1980","CreatedById":163203,"CreatedDateTime":"2016-06-16T13:36:11Z","Content":"\n\u003Cp\u003E\nthe vector engine is also 1.25m, has about 5 times the thrust of an aerospike (at 4 times the weight) and has better Isp at sea level (295 for vector vs. 290 for aerospike).\n\u003C/p\u003E\n\u003Cp\u003E\nthe mammoth has pretty much the same thrust characteristics x4 since it\u0027s really just 4 vectors glued together. might be oversized, but it\u0027s sort of a \u0022lower part count\u0022 option if you want to go really crazy and decide to lift more than just 1-2 tons to orbit.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-16T13:36:31Z\u0022 title=\u002206/16/2016 01:36  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 16, 2016\u003C/time\u003E by mk1980\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Vaporized Steel","CreatedById":108520,"CreatedDateTime":"2016-06-16T13:46:07Z","Content":"\n\u003Cp\u003E\nThanks Mk1980.\u003Cbr\u003E\nMammoths couild be a option, I tried it, and I think it is oversized. Only in my design though, because it is definitely usefull. I want to make it fit into a 3.75m fairing, which seems possible with better engine alternatives. I used a design with vector engines, but I refrain in using them as throw aways because the design is asparagus obviously and only use them on the center core. Shedding one and each vector engine on a asparagus strap on tank is very wasteful. The vector is a little more efficient by isp, but in practice less efficient because of it\u0027s enormous weight, limiting any efficient use of it to the center core on the first stage. Although it definitely gets the thing off the ground that\u0027s for sure.\n\u003C/p\u003E\n\u003Cp\u003E\n1-2 ton to orbit designs are ideas of mine, 2 lander cans are just under 1 ton. I\u0027ll post a pic when I get back in 3 hours of my WIP if you want to get a idea.\n\u003C/p\u003E\n"},{"CreatedByName":"Foxster","CreatedById":113764,"CreatedDateTime":"2016-06-16T16:00:17Z","Content":"\n\u003Cp\u003E\nHave you got a good handle on the things you need for an Eve lander and re-orbiter?\n\u003C/p\u003E\n\u003Cp\u003E\nIts not all about thrust. Though obviously you have to use the right engines, which at this time mostly means aerospikes. What is is also important is minimising drag, your flight profile and avoiding heatplosion. \n\u003C/p\u003E\n\u003Cp\u003E\nYou have started wrong from the get-go using a lander can. Wrong shape. Yes, its light but that\u0027s not as important as that\u0027s it\u0027s as blunt as a blunt thing. You want a mk1 capsule (monopropellant removed) with a little nose cone. Your craft then needs a small number of thin (mk1) stacks. \n\u003C/p\u003E\n\u003Cp\u003E\nThen there is your flight profile. You have to get above the Eve soup, get the engines thrust up and also avoid heatplosion. If you try to fly your craft to orbit like you would on Kerbin then you are doomed.\n\u003C/p\u003E\n\u003Cp\u003E\nGetting a lander to Eve and back is very achievable but you have to do your research and get it built and flown right. \n\u003C/p\u003E\n\u003Cp\u003E\nOr I suppose you could just dumb down the game and install a mod to avoid actually thinking about the problem. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-16T16:06:05Z\u0022 title=\u002206/16/2016 04:06  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 16, 2016\u003C/time\u003E by Foxster\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Vaporized Steel","CreatedById":108520,"CreatedDateTime":"2016-06-16T18:50:11Z","Content":"\n\u003Cp\u003E\nHey thanks, I have flown a variety of rockets from eves surface into orbit, the thread is more about adding the goal of returning more then 1 kerbal into orbit.\u003Cbr\u003E\nYour tip on the Mk 1 pod seems great, thanks! I don\u0027t know how that will make things better though, as I already found out as of version 1.x.x that a sleak rocket design for aerodynamics does wonders.\u003Cbr\u003E\nWhat I did is put a tail section on top of the lander can to manage drag.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat would you think is better. A lander can with a pointy nosecone on top, or a Mk 1 capsule?\u003Cbr\u003E\nWith the bad SLT of stock engines I was forced to add strap on engines in combination with candlesticks. The latter term meaning to clip engines (aerospikes) above the strap on tanks who will fire to compensate when I asparagus stage the strap ones which have aerospikes attached to them.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m working on a new design with the eve optimized engine mods and when I\u0027m done I\u0027ll post a picture. I hope to get some advice based on the pic and then I go from there, which will be tommorow I guess.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-16T18:50:31Z\u0022 title=\u002206/16/2016 06:50  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 16, 2016\u003C/time\u003E by Vaporized Steel\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Foxster","CreatedById":113764,"CreatedDateTime":"2016-06-16T19:05:36Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222633831\u0022 data-ipsquote-contentid=\u0022141905\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466103011\u0022 data-ipsquote-userid=\u0022108520\u0022 data-ipsquote-username=\u0022Vaporized Steel\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n21 minutes ago, Vaporized Steel said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhat would you think is better. A lander can with a pointy nosecone on top, or a Mk 1 capsule?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe mk1 capsule. The problem with the lander can is that no matter what you put on top of it it is remains draggy. You can see this from the way it sticks out from other mk1 parts. Don\u0027t take my word for it, try launching some otherwise identical craft and see how they get on. \n\u003C/p\u003E\n\u003Cp\u003E\nEve is a harsh mistress. You have to carefully balance low mass and low drag. This is especially true with the topmost section. Mess this up even slightly and you are going to have to try to compensate with lots more extra thrust and fuel. \n\u003C/p\u003E\n\u003Cp\u003E\nIf you have a mk1-sized top to parts of your your craft then the best \u0022nosecone\u0022 is a circular intake. I\u0027ve tested this to death and its combination of low mass and low drag out-performs all the other mk1-sized pointy bits. \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222633831\u0022 data-ipsquote-contentid=\u0022141905\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466103011\u0022 data-ipsquote-userid=\u0022108520\u0022 data-ipsquote-username=\u0022Vaporized Steel\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n21 minutes ago, Vaporized Steel said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWith the bad SLT of stock engines I was forced to add strap on engines in combination with candlesticks. The latter term meaning to clip engines (aerospikes) above the strap on tanks who will fire to compensate when I asparagus stage the strap ones which have aerospikes attached to them.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m working on a new design with the eve optimized engine mods and when I\u0027m done I\u0027ll post a picture. I hope to get some advice based on the pic and then I go from there, which will be tommorow I guess\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027ll look forward to the pics because I can\u0027t picture what you mean here. And there really is no need for that mod, it is quite do-able with stock, just more challenging/interesting. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-16T19:11:29Z\u0022 title=\u002206/16/2016 07:11  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 16, 2016\u003C/time\u003E by Foxster\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Vaporized Steel","CreatedById":108520,"CreatedDateTime":"2016-06-16T19:07:24Z","Content":"\n\u003Cp\u003E\nlol, made me laugh\u003Cimg alt=\u0022:sticktongue:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 title=\u0022:sticktongue:\u0022\u003E\u003Cbr\u003E\nAnd Mk1 capsule it is then.\n\u003C/p\u003E\n\u003Cp\u003E\nEdit:\n\u003C/p\u003E\n\u003Cp\u003E\nThe term is \u0022Twisted candle\u0022\u003Cbr\u003E\nAnd it\u0027s probably made up since I read it somewhere by somebody on the forums.\u003Cbr\u003E\nAnd I found it easily apparently. \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/68532-staging-methods-overview/\u0022 rel=\u0022\u0022\u003EHere\u003C/a\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-16T19:16:51Z\u0022 title=\u002206/16/2016 07:16  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 16, 2016\u003C/time\u003E by Vaporized Steel\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Foxster","CreatedById":113764,"CreatedDateTime":"2016-06-16T19:30:28Z","Content":"\n\u003Cp\u003E\nAh, right, got it now. That\u0027s something I use for very high dV ion craft where I stage off ion engines and their Xenon tanks in clusters. \n\u003C/p\u003E\n\u003Cp\u003E\nProblem I can see with it for Eve though is drag. It will mean sticky-out bits, even if they are clipped. You have to keep things slim and streamlined or Eve will be mean to you. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-16T19:30:56Z\u0022 title=\u002206/16/2016 07:30  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 16, 2016\u003C/time\u003E by Foxster\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"OhioBob","CreatedById":128005,"CreatedDateTime":"2016-06-16T23:23:11Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222633855\u0022 data-ipsquote-contentid=\u0022141905\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466103936\u0022 data-ipsquote-userid=\u0022113764\u0022 data-ipsquote-username=\u0022Foxster\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn ‎6‎/‎16‎/‎2016 at 3:05 PM, Foxster said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAnd there really is no need for that mod, it is quite do-able with stock, just more challenging/interesting. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThere no reason not to use the mod either.  There isn\u0027t anything gimmicky about it, it\u0027s based on real science and engineering.  You wouldn\u0027t use a Poodle to launch from the surface of Kerbin, so why would you use an engine designed for Kerbin to launch from Eve?  Any engineer worth his salt would custom design an engine for the task at hand.  The only reason there aren\u0027t any comparable stock engines is probably because Squad didn\u0027t think of it.  The Vector is probably their answer to the need for an engine that will perform reasonable well on Eve; however, they had to get a bit gimmicky with its ISP curve to do so**.  I believe the Vector is less realistic than the mod engines.  In some ways the Vector and Aerospike make launching from Eve easier because they have good mid- to high-altitude performance, therefore you can retain them and operate them efficiently after ascending through the initial soup.  The mod engines really lose efficiency after the initial climb-out, meaning you have to either stage them and switch to a more efficient engine, or you have to settle for the lower efficiency.  \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/136342-112-eve-optimized-engines/\u0022 rel=\u0022\u0022\u003EEve Optimized Engines\u003C/a\u003E provides a realistic alternative and a new set of design possibilities and challenges.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\n(edit) ** My apologies to Squad.  I\u0027ve taken a closer look at the Vector engine and I now believe that it\u0027s ISP curve is reasonable.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-19T02:44:00Z\u0022 title=\u002206/19/2016 02:44  AM\u0022 data-short=\u00228 yr\u0022\u003EJune 19, 2016\u003C/time\u003E by OhioBob\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2016-06-17T06:15:33Z","Content":"\n\u003Cp\u003E\nI think that a stock electric propeller is the correct answer. No, you do not use rockets in a thick soup if you can help it. You let the aerodynamics of Eve\u0027s atmosphere work for you. And an electric propeller is one of the huge missing items from the game.\n\u003C/p\u003E\n"},{"CreatedByName":"Foxster","CreatedById":113764,"CreatedDateTime":"2016-06-17T06:24:58Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222634211\u0022 data-ipsquote-contentid=\u0022141905\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466119391\u0022 data-ipsquote-userid=\u0022128005\u0022 data-ipsquote-username=\u0022OhioBob\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, OhioBob said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThere no reason not to use the mod either.  There isn\u0027t anything gimmicky about it, it\u0027s based on real science and engineering.  You wouldn\u0027t use a Poodle to launch from the surface of Kerbin, so why would you use an engine designed for Kerbin to launch from Eve?  Any engineer worth his salt would custom design an engine for the task at hand.  The only reason there aren\u0027t any comparable stock engines is probably because Squad didn\u0027t think of it.  The Vector is probably their answer to the need for an engine that will perform reasonable well on Eve; however, they had to get a bit gimmicky with its ISP curve to do so.  I believe the Vector is less realistic than the mod engines.  In some ways the Vector and Aerospike make launching from Eve easier because they have good mid- to high-altitude performance, therefore you can retain them and operate them efficiently after ascending through the initial soup.  The mod engines really lose efficiency after the initial climb-out, meaning you have to either stage them and switch to a more efficient engine, or you have to settle for the lower efficiency.  \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/136342-112-eve-optimized-engines/\u0022 rel=\u0022\u0022\u003EEve Optimized Engines\u003C/a\u003E provides a realistic alternative and a new set of design possibilities and challenges.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWe\u0027ll have to agree to disagree on this one. It\u0027s only a difference in game-play philosophy.\n\u003C/p\u003E\n\u003Cp\u003E\nFor me, using some modded parts to fix a challenging issue removes the challenge and so, for me, the enjoyment. I might as well turn on infinite fuel or alter the aero model. \n\u003C/p\u003E\n\u003Cp\u003E\nI acknowledge that others feel different about this and they are right too. \n\u003C/p\u003E\n"},{"CreatedByName":"gilflo","CreatedById":62881,"CreatedDateTime":"2016-06-17T07:10:57Z","Content":"\n\u003Cp\u003E\nIMO, the best engines for EVE are the SpaceY Ratite, tweascaled, to get better long term efficiency in term of weigth/ TWR/DV, coupled to a 4 stages asparagus at the base ( 3 pairs \u002B 1 center) and 3 stages asparagus at the top.  Aerospikes are better in the first 5000m but they costly in term of weight. I design a 140T take off weight lander  for 2 Kerbals able to reach a 100km orbit from 300m take off altitude. What is the most  important in the design is the drag coefficient, you need to built the dragless ship you can in term of design.\n\u003C/p\u003E\n\u003Cp\u003E\nSee my Evalander in KerbalX\n\u003C/p\u003E\n"},{"CreatedByName":"Vaporized Steel","CreatedById":108520,"CreatedDateTime":"2016-06-17T09:27:52Z","Content":"\n\u003Cp\u003E\nOk, I followed Foxster\u0027s philosophy of making one pure stock.\n\u003C/p\u003E\n\u003Cp\u003E\nNow remember, before you go write and \u0022submit reply\u0022 to suggest making it wider down the bottom to add more engines, *cough* don\u0027t!\u003Cbr\u003E\u003Cbr\u003E\nRemember my \u003Cstrong\u003Edesign challenge\u003C/strong\u003E which is hidden somewhere in the OP. The width of the whole rocket \u003Cstrong\u003Emust fit into a 3.75m fairing\u003C/strong\u003E. Without the fairing bulging out in a visually severe way.\u003Cbr\u003E\nMaking the rocket any wider disabled me to do that.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://imgur.com/a/Q0FKh\u0022 rel=\u0022external nofollow\u0022\u003EImgur link\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nPicture 1 shows the bottom of the spacecraft. As much engines as one is willing to allow, overlapping one another. Unrealistic argueably, but atleast the exhaust of a aerospike nozzle is channeled through the center. Although the center vector engine definitely would rip the other engines apart. Luckily KSP doesn\u0027t model this because the exhaust forces are calculated as a straight line from the centre.And I\u0027m beginning to think whether this is even possible to do for a rocket with 2 pods from eves surface into orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nPicture 2 shows the rocket as a whole with mechjebs Delta V and SLT readout for eve. The surface thrust isn\u0027t even enough to lift off, But we get rather close, that\u0027s for sure.\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI limited the vectoring gimbal of the vector engine to just enough so that the rocket becomes maneouvreable.\n\u003C/p\u003E\n\u003Cp\u003E\nThe rocket lacks a twisted candle design in this case. Because that\u0027s only a usefull engineering strategy for maintaining TWR as you drop the strap on tanks. Which in turns requires more tanks as the added weight will reduce total Delta V.\n\u003C/p\u003E\n\u003Cp\u003E\nI tried to do this pure stock, and to meet the design challenge of making it fit into a fairing I needed to use the 0.625m Oscar B fuel tanks to add more fuel on the first stage by adding them as 4 more strap ons.\u003Cbr\u003E\nThis makes the total part count of the rocket well over 200 just for the rocket minus chutes, landing gear and ladders *ouch*\u003Cbr\u003E\nI haven\u0027t calculated it though but I believe the dead weight of a oscar B fuel tank is appauling. I had about the same SLT of near 0.92 without the Oscar B strap ons whom each have a aerospike engines at the bottom.\u003Cbr\u003E\nI\u0027ll be awaiting your responses. Remember that any design suggestion is welcome. The total weight of the rocket has no design requirements. As long as it fits into that fairing comfortably. Part clipping to add more engines seems necessary.\n\u003C/p\u003E\n\u003Cp\u003E\nI also used nose cones on the 1.25m tanks. I remember being suggested to use air intakes? Are the 1.25m circular air intakes also better then the 1.25m nosecones?\n\u003C/p\u003E\n"},{"CreatedByName":"Vaporized Steel","CreatedById":108520,"CreatedDateTime":"2016-06-17T10:56:29Z","Content":"\n\u003Cp\u003E\nFinally made something that worked,\n\u003C/p\u003E\n\u003Cp\u003E\nAlthough I find that the rocket looks like crap, so I\u0027m probably going to redesign it. It seems vectors are the way to go, atleast enough of them. The rocket can get two Kerbals into orbit. In this case from 1277meters altitude with 640meters per second spare delta V. Not sure if it means it\u0027s sea level ascent capable. In any case I could always perfect the piloting through the atmosphere and make better use of max aerodynamic pressures.\u003Cbr\u003E\u003Cbr\u003E\nIn between the 7th and 8th picture there should be another stage in operation, It was probably the most critical stage in terms of maneouvring so I forgot to tap F1 there.\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://imgur.com/a/HMzPy\u0022 rel=\u0022external nofollow\u0022\u003EPics\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nCompletely stock except for Mechjeb.\n\u003C/p\u003E\n"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2016-06-17T11:17:26Z","Content":"\n\u003Cp\u003E\nWhen I tried some experimentation in 1.0.4 of a Eve landing and take off vehicle, I found big variation in delta V (even my usual landing region is around 1500m). I was more focused on the landing design (not blowing into Eve atmosphere), I didn\u0027t focused too much on the ascending part of the lander.\n\u003C/p\u003E\n\u003Cp\u003E\nMy prototype used less than 7000m/s (VAC), but when I tried to size it down, I failed to reach orbit with 7000m/s. But as I had some flipping issue of the second stage (the whole rocket was finally unstable)\n\u003C/p\u003E\n\u003Cp\u003E\nIt appeared that ascent profile is very important for Eve. You can get hugh dV variation by changing your ascending path. I didn\u0027t test it enough to find a proper ascent profile though.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat ascent profile do you use for Eve ?\n\u003C/p\u003E\n"},{"CreatedByName":"Vaporized Steel","CreatedById":108520,"CreatedDateTime":"2016-06-17T11:41:49Z","Content":"\n\u003Cp\u003E\nShould be visible in the pics. Up to 12km I go straight up. Pitching to 70degrees between 12 - 20km. Gently, spread out across the altitude range specified. No immediate turns, which usually ends bad.\u003Cbr\u003E\nFrom 70 - 40 pitch between 20 - 60 km altitude, at which point things become very straight forward and you\u0027ll only be focusing on forward velocity.\u003Cbr\u003E\nAcross all altitudes engines burn at a average 1.5 TWR.\n\u003C/p\u003E\n\u003Cp\u003E\nIn the pics shown in the post before yours I had 8071M/s at lift off from 1277meters altitude. I reached 100/100km orbit with 641m/s to spare. Seems it got very close to the area of 7000m/s expenditure. And since this is my first eve attempt in version 1.x.x I believe, I am astounded that it takes so much less with the new aerodynamics involved.\u003Cbr\u003E\nI\u0027m sure I\u0027m going to get into other issues trying to get it to eve once I\u0027m done. Wish me luck.\n\u003C/p\u003E\n"},{"CreatedByName":"Foxster","CreatedById":113764,"CreatedDateTime":"2016-06-17T15:08:09Z","Content":"\n\u003Cp\u003E\nI have been using the big new heat shield since it was available but I did build one sea-level capable craft that fitted behind the next largest heat shield...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022phc64Sv.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/phc64Sv.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNot totally dissimilar to yours, just scaled down a tad. \n\u003C/p\u003E\n\u003Cp\u003E\n(That\u0027s another aerospike in the middle btw). \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-17T15:32:36Z\u0022 title=\u002206/17/2016 03:32  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 17, 2016\u003C/time\u003E by Foxster\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Vaporized Steel","CreatedById":108520,"CreatedDateTime":"2016-06-17T16:07:38Z","Content":"\n\u003Cp\u003E\nNice\u003Cimg alt=\u0022:confused:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 title=\u0022:confused:\u0022\u003E\u003Cbr\u003E\nI to am working on a scaled down version. I see you use circular intakes on each and every tank.\u003Cbr\u003E\nI\u0027m sure you have your reasons for choosing that particular intake.\u003Cbr\u003E\nBut the thing is, there are 2 1.25m circular intakes.\u003Cbr\u003E\nThe White/black ones, and white ones. And the stupid thing is, in stock they\u0027re both called \u0022circular intakes\u0022\u003Cbr\u003E\nAre the ones in your pic the best option or have you no clue...\n\u003C/p\u003E\n\u003Cp\u003E\nOne has a intake are of .060sq M and the other 0.75sq M.\u003Cbr\u003E\nThe former a effective base speed of 15m/s the other 50m/s\u003Cbr\u003E\nYour intakes with 2.0 intake air, the white ones with 1.9.\u003Cbr\u003E\nYours @ 0.05 Tons.\u003Cbr\u003E\nThe white ones a mere 0.0194tons.\u003Cbr\u003E\nAlthough I don\u0027t know if that tells you anything about total amount of drag.\n\u003C/p\u003E\n\u003Cp\u003E\nIm working on a new design, and havent finished it.\u003Cbr\u003E\nShould have enough delta V and TWR for 3 Kerbals. It uses the Mk 1 crew cabin from the \u0022utility tab\u0022\u003Cbr\u003E\nIt has the same width as the mk1 command pod so it should not induce extra drag. And it\u0027s only 0.5 ton per kerbal\u003Cimg alt=\u0022:cool:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 title=\u0022:cool:\u0022\u003E\u003Cbr\u003E\nAlthough I should really resdesign that 1st stage because it looks like ..... (lost for words)\n\u003C/p\u003E\n\u003Cp\u003E\nI used Advanced nosecones on top, for aesthetics instead of intakes. But I will change them to intakes if that turns out alot better, I\u0027ll do some testing.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022YPICYHu.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022569\u0022 src=\u0022http://i.imgur.com/YPICYHu.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Foxster","CreatedById":113764,"CreatedDateTime":"2016-06-17T17:28:42Z","Content":"\n\u003Cp\u003E\nStock doesn\u0027t have the two intakes your describe - think you must have picked one up from a mod. Stock has just the black and white one with the stats you mention. \n\u003C/p\u003E\n\u003Cp\u003E\nI did some really boring testing of the different mk1 nosecone options. I made a test rig with 4 identical craft on a single base and launched them all together, using MJ to keep them on-track. The circular intake got to the highest altitude consistently, meaning it\u0027s combination of low drag and low mass made it the winner. The Advanced Nose Cone - Type A was not very far behind and is a reasonable alternative if you need just a little more heat-proof. \n\u003C/p\u003E\n\u003Cp\u003E\nUsing the mk1 crew cabin is the way I\u0027d go too for some extra crew. Are you trying for a crew of 2 or 3?\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027d be interested to see if that new design works. Looks pretty draggy at the moment and I\u0027d be bit worried about using a couple of Vectors along with some Thuds but if it get\u0027s the job then well done!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-17T17:29:02Z\u0022 title=\u002206/17/2016 05:29  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 17, 2016\u003C/time\u003E by Foxster\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Vaporized Steel","CreatedById":108520,"CreatedDateTime":"2016-06-17T17:47:34Z","Content":"\n\u003Cp\u003E\nA crew of 3. I\u0027ll be redesigning later this week with 3 Mk 1 command pods instead of the crew cabin. But tell me how 3 Mk 1 command pods would be better then 1 mk 1 command pod and the crew cabin.\u003Cbr\u003E\nThe point of direction is where the air is coming from, and the Mk 1 command pod diverts the air away from the crew cabin. Which seems to me that no matter how much a drag value the cabin has it simply isn\u0027t collecting any air,\u003Cbr\u003E\nthe Mk 1 pod is. Either I don\u0027t understand it then or KSP is flawed.\n\u003C/p\u003E\n\u003Cp\u003E\nA crew of 3 consisting of Mk 1 command pods looks silly if you build them one on top of the other. Or are you suggesting something like this.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ccfK6LW.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022569\u0022 src=\u0022http://i.imgur.com/ccfK6LW.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nGood to know the stock intakes beats it.\u003Cbr\u003E\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-17T17:47:50Z\u0022 title=\u002206/17/2016 05:47  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 17, 2016\u003C/time\u003E by Vaporized Steel\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Foxster","CreatedById":113764,"CreatedDateTime":"2016-06-17T18:03:37Z","Content":"\n\u003Cp\u003E\nI wouldn\u0027t go with 3 x mk1 capsules. They would be draggy and weigh 2.4t. One mk1 capsule and a mk1 cabin inline with it will be less draggy and weight 1.88t. \n\u003C/p\u003E\n"},{"CreatedByName":"Vaporized Steel","CreatedById":108520,"CreatedDateTime":"2016-06-17T18:17:22Z","Content":"\n\u003Cp\u003E\nGood to know, seems I did it alright.\n\u003C/p\u003E\n\u003Cp\u003E\nA 3 man eve ascent vehicle is as far as I\u0027ll go. I finished mine.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://imgur.com/a/nfWuP\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/nfWuP\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nHyperedited it in the air below 1000meters, with 560m/s to spare in orbit. Not sure what it will do from actual sea level. The funny thing is that if I remove the first stage with the vectors completely, I have a much smaller 3 man craft which can get into orbit from 7km. Making it a lightweight alternative to launch from eves tallest mountain.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you can see any improvements to aerodynamic design, please share. All in all, great success.\n\u003C/p\u003E\n\u003Cp\u003E\nEDIT: So how do you post to make albums visible? Never done that...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-17T19:24:20Z\u0022 title=\u002206/17/2016 07:24  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 17, 2016\u003C/time\u003E by Vaporized Steel\u003C/strong\u003E\n\u003C/span\u003E\n"}]}