{"TopicId":141918,"ForumId":20,"TopicTitle":"CKAN pros/cons","CreatedByName":"Bombaatu","CreatedById":157643,"CreatedDateTime":"2016-06-16T17:58:08Z","PageNum":1,"Articles":[{"CreatedByName":"Bombaatu","CreatedById":157643,"CreatedDateTime":"2016-06-16T17:58:08Z","Content":"\n\u003Cp\u003E\nI have heard \u0027CKAN is the best thing since sliced bread\u0027 and \u0027CKAN is bad-wrong! Do-not-use!\u0027 (these are paraphrases, of course).\n\u003C/p\u003E\n\u003Cp\u003E\nI have used it and have not personally run into any issues. For those who believe it is bad - why? I have yet to see a coherent explanation of this.\n\u003C/p\u003E\n"},{"CreatedByName":"goldenpsp","CreatedById":113874,"CreatedDateTime":"2016-06-17T06:35:53Z","Content":"\n\u003Cp\u003E\nYou have a fire suit right?  It\u0027s super late so I should be sleeping but I will try to do my best to distill the issue down as best I can.\n\u003C/p\u003E\n\u003Cp\u003E\nFirst, CKAN isn\u0027t perfect (what is?).  When it works it works great.  When it fails, it can fail horribly.\n\u003C/p\u003E\n\u003Cp\u003E\nWhile I don\u0027t think any tool is a substitute for understanding the process, that is often what happens.  People will use CKAN and as a result never learn how to actually install a mod manually.  So when it fails they have no idea how to troubleshoot.  They take to the forums for support, which leads to the next point.\n\u003C/p\u003E\n\u003Cp\u003E\nHaving a mod on CKAN may not actually be a result of the mod author.  Since its inception, many mods on CKAN were a result of someone other than the mod author creating the CKAN metadata.  So suddenly a mod author may find their thread filled with CKAN support requests when they in fact didn\u0027t even know their mod was on CKAN. So suddenly you have a mod author frustrated with something he had no control, or even knowledge of.\n\u003C/p\u003E\n\u003Cp\u003E\nThis, in my opinion, has been the biggest cause of CKAN backlash.\n\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2016-06-17T07:42:34Z","Content":"\n\u003Cp\u003E\nIt\u0027s extra fun for a mod author who isn\u0027t involved with maintaining their own CKAN entries when he releases an update after weeks of grueling volunteer work, publishes it on three different download mirrors for everyone\u0027s convenience, and comes back the next day to discover that 80% of the responses read \u0022You forgot to update CKAN! I can\u0027t play like this!\u0022...\n\u003C/p\u003E\n\u003Cp\u003E\nOr let\u0027s say that the mod author \u003Cem\u003Edid\u003C/em\u003E put his mod on CKAN. Two months later he publishes an update, and goes to CKAN to tweak the metadata... Only to discover that community members have since changed it several times, neither asking nor notifying him. Oh, and by the way, the metadata spec changed four times since he last looked, so now he has to pore over the technical documentation to even understand what his own mod\u0027s metadata is doing!\n\u003C/p\u003E\n\u003Cp\u003E\nI mean, having the community able to create and maintain metadata can be a good thing, too - if you are an author with limited time, you can just lean back, and someone else will do the work for you. Sweet! But it\u0027s a double-edged sword, because it\u0027s impossible for an author to keep control over their own mod\u0027s listing and relationships, and as soon as someone else (maybe even just the automatic spacedock parser script) creates metadata, everyone assumes it\u0027s the author\u0027s doing and responsibility.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nStill, ultimately I think the KSP modding community is richer for the existence of CKAN. I may occasionally moan about it, but the advantages still outweigh the disadvantages. Especially for the players.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-17T07:45:04Z\u0022 title=\u002206/17/2016 07:45  AM\u0022 data-short=\u00228 yr\u0022\u003EJune 17, 2016\u003C/time\u003E by Streetwind\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"p1t1o","CreatedById":74091,"CreatedDateTime":"2016-06-17T09:51:03Z","Content":"\n\u003Cp\u003E\nTip-top-tip: When uninstalling a mod via CKAN, manually go into gamedata and remove the folder. CKAN sometimes leaves dome files behind which can cause headaches.\n\u003C/p\u003E\n\u003Cp\u003E\nOther than that, use CKAN, the effort it saves you by keeping things in a nice list is more than enough to risk the extra headaches, most of the best mods function perfectly well, the above problem is the worst I have experienced.\n\u003C/p\u003E\n"},{"CreatedByName":"evileye.x","CreatedById":153755,"CreatedDateTime":"2016-06-17T10:54:17Z","Content":"\n\u003Cp\u003E\nCKAN is very good thing actually. Other than pain in the ass for some moders,  it\u0027s a very nice tool for players,  especially for new players.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve got my \u0026gt;100 mods list with a help of CKAN.\n\u003C/p\u003E\n"},{"CreatedByName":"Kobymaru","CreatedById":107372,"CreatedDateTime":"2016-06-17T13:02:02Z","Content":"\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, goldenpsp said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhile I don\u0027t think any tool is a substitute for understanding the process, that is often what happens.  People will use CKAN and as a result never learn how to actually install a mod manually.  So when it fails they have no idea how to troubleshoot.  They take to the forums for support, which leads to the next point.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI wonder, do you say that about installers for windows programs too? Instead of clicking one single \u0022install.exe\u0022 file, do you expect users to know how to extract libraries, set firewall rules, create the right folders and create the right registry keys?\n\u003C/p\u003E\n\u003Cp\u003E\nI always viewed the \u0022well you should know what you are doing\u0022 attitude kind of... elitist. You know how it works, and the mod author does, and that\u0027s great! But I feel that there is no good reason to exclude technically less versed people from installing windows programs or installing mods.\n\u003C/p\u003E\n\u003Cp\u003E\nCKAN, and installers, packet repositories and \u0022app stores\u0022 might be a huge PITA for authors and maintainers - but I believe they are crucial to offer access to mods/programs to a lot of people.\n\u003C/p\u003E\n\u003Cp\u003E\nSeriously, could we all stop for a second and ponder if you would really tell your grandma that using the Android App store is bad, because she \u0022doesn\u0027t understand the process\u0022 and \u0022has no idea how to troubleshoot\u0022?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI think that most of the controversy about CKAN stems from very different (and sometimes conflicting) interests and points of views of two groups of people:\n\u003C/p\u003E\n\u003Cp\u003E\n1. Mod authors: Mod authors usually care only about \u0022their\u0022 mod, because that\u0027s the mod that they have control over. They care a lot less about incompatibilities, or figuring out bugs in other mods. They also don\u0027t care about the ease of installation. Why would they? It\u0027s really easy! Just download from here, copy this there, that here, don\u0027t forget that dependency. They\u0027ve done it a hundred times and don\u0027t get why people even bother with CKAN, because manual installation seems simpler.\n\u003C/p\u003E\n\u003Cp\u003E\n2. Users: Users usually only care about their game, and about playing. They see a mod in the forums, or highlighted somewhere, and they just want to \u0022play\u0022 it. They don\u0027t want to read installation instructions, they don\u0027t want to figure out dependencies or conflicts. Some users have dozens, maybe even a hundred of mods installed. Each and every single one of them is downloaded from a different location, has different folders, has different conventions, ... And the users are supposed to keep track of that?\u003Cbr\u003E\nWhat about updates? Even with KSP-AVC, keeping your game up-to-date is a nightmare. Imagine, you want to update 10 mods! 10 different websites, unpack 10 zips, delete the right folders, extract the right folders, and OH NO don\u0027t forget dependencies!\n\u003C/p\u003E\n\u003Cp\u003E\nThese two points of view are inherently incompatible, and will always cause troubles.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat CKAN *aims* to do is provide a buffer between those two groups. And well, buffers often enough take heat from both sides. And that\u0027s what\u0027s happening.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, goldenpsp said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHaving a mod on CKAN may not actually be a result of the mod author.  Since its inception, many mods on CKAN were a result of someone other than the mod author creating the CKAN metadata.  So suddenly a mod author may find their thread filled with CKAN support requests when they in fact didn\u0027t even know their mod was on CKAN. So suddenly you have a mod author frustrated with something he had no control, or even knowledge of.\n\u003C/p\u003E\n\u003Cp\u003E\nThis, in my opinion, has been the biggest cause of CKAN backlash.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell how else? CKAN is supposed to be *for users*. Sometimes, mod authors don\u0027t care about CKAN. Sometimes they care a little but then MIA for months. CKAN is supposed to be a more or less complete repository of (open source) mods. It\u0027s not a good idea to make everything dependent on the authors. That\u0027s what this whole \u0022abstraction layer\u0022 of CKAN is actually for.\n\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2016-06-17T13:51:09Z","Content":"\n\u003Cp\u003E\nCKAN is an unnecessary evil! It can be extremely useful in keeping installed mods up to date but there is nothing, and I do mean \u003Cstrong\u003Eabsolutely nothing,\u003C/strong\u003E CKAN does that can not be done just as easy and just as quickly manually.\u003Cbr\u003E\nKSP is extremely mod friendly. Installing or removing mods can not be any simpler. All you will need is the most basic knowledge of files structure. For people that grew up in the DOS or early Windows era these fundamentals are second nature. Sadly modern OS give the impression this has become obsolete. Nothing is farther from the truth. The basics are and always will be important. Do \u003Cstrong\u003Enot\u003C/strong\u003E rely on \u0027advanced\u0027 tools if you don\u0027t know the basics.\n\u003C/p\u003E\n\u003Cp\u003E\nI do not use CKAN. Not now, not ever!\u003Cbr\u003E\nAnything CKAN does you can do better.\n\u003C/p\u003E\n"},{"CreatedByName":"obsidian_x","CreatedById":145147,"CreatedDateTime":"2016-06-17T14:25:56Z","Content":"\n\u003Cp\u003E\nI don\u0027t mind ckan, I\u0027m a player though, not a modder.  \n\u003C/p\u003E\n\u003Cp\u003E\nI was a purest at the start, I would download a mod, and install it manually.  But then I\u0027m pretty lazy, so would never update a mod.  I guess it depends if you\u0027re a \u0022must have latest\u0022 or \u0022if it aint broke don\u0027t fix it\u0022 kind of person, you can then use ckan to update before you run the game.  Once you get more than 5 or so mods manual updates can be a tedious affair.\n\u003C/p\u003E\n\u003Cp\u003E\nThere\u0027s no standard location to get the mod - ie github, spacedock, curse etc etc.\n\u003C/p\u003E\n\u003Cp\u003E\nThere\u0027s no easy(tm) way to know when a mod is updated (although some can auto update).\n\u003C/p\u003E\n\u003Cp\u003E\nLooking at the folders in gamedata you can\u0027t easily tell what the mod is.  \n\u003C/p\u003E\n\u003Cp\u003E\nOn the other hand:\n\u003C/p\u003E\n\u003Cp\u003E\nCkan doesn\u0027t have dev builds (so you might wait longer to get a mod after a game release)\n\u003C/p\u003E\n\u003Cp\u003E\nIt will not update manually installed mods (I can see the reasons though)\n\u003C/p\u003E\n\u003Cp\u003E\nOccasionally I get weird exceptions etc when downloading/updating (although never broken my game)\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-17T14:27:51Z\u0022 title=\u002206/17/2016 02:27  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 17, 2016\u003C/time\u003E by obsidian_x\u003C/strong\u003E\n\u003Cbr\u003Eclarity\n\u003C/span\u003E\n"},{"CreatedByName":"goldenpsp","CreatedById":113874,"CreatedDateTime":"2016-06-17T17:59:06Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222634832\u0022 data-ipsquote-contentid=\u0022141918\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466168522\u0022 data-ipsquote-userid=\u0022107372\u0022 data-ipsquote-username=\u0022Kobymaru\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Kobymaru said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI wonder, do you say that about installers for windows programs too? Instead of clicking one single \u0022install.exe\u0022 file, do you expect users to know how to extract libraries, set firewall rules, create the right folders and create the right registry keys?\n\u003C/p\u003E\n\u003Cp\u003E\nI always viewed the \u0022well you should know what you are doing\u0022 attitude kind of... elitist. You know how it works, and the mod author does, and that\u0027s great! But I feel that there is no good reason to exclude technically less versed people from installing windows programs or installing mods.\n\u003C/p\u003E\n\u003Cp\u003E\nCKAN, and installers, packet repositories and \u0022app stores\u0022 might be a huge PITA for authors and maintainers - but I believe they are crucial to offer access to mods/programs to a lot of people.\n\u003C/p\u003E\n\u003Cp\u003E\nSeriously, could we all stop for a second and ponder if you would really tell your grandma that using the Android App store is bad, because she \u0022doesn\u0027t understand the process\u0022 and \u0022has no idea how to troubleshoot\u0022?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027m sure there is a technical term for when someone takes one argument and then attempts to extend it to everything, but I cannot think of it now.  Without writing volumes I\u0027ll just put these few things here to try and illustrate.\n\u003C/p\u003E\n\u003Cp\u003E\nFirst there is a vast difference between most applications and their associated installers VS KSP mods.  Many of these things are very regimented with stable rules on how and where things get installed and therefore installers can work pretty smoothly.  If you have ever dealt with iOS app development you would know just how strict Apple is in this regard to ensure their installer works near flawlessly.\n\u003C/p\u003E\n\u003Cp\u003E\nContrast that with KSP mods, which have pretty much no structure or guidelines other than \u0022it goes in the gamedata folder\u0022  There are no guidelines on how mods should work together, or handle dependencies with other mods.  You could say it is the Wild West of programming.\n\u003C/p\u003E\n\u003Cp\u003E\nIn short, if installers for windows programs, smartphones, etc worked as flawlessly as CKAN, then yes people should have a better understanding of what\u0027s going on under the hood.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, on that note, when \u0022understanding\u0022 mod installation for KSP consists mostly of \u0022the mod goes under gamedata\u0022 you neither have to be terribly technical nor elite to take a few moments to understand that.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd yea I have pondered that.  As I said above both smartphone platforms worked hard to make their installers work as flawlessly as possible.  The better argument for what you are trying to illustrate is that if my grandma came to me and said she wanted to root her phone, I\u0027d say you really should know what you are doing first.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222634832\u0022 data-ipsquote-contentid=\u0022141918\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466168522\u0022 data-ipsquote-userid=\u0022107372\u0022 data-ipsquote-username=\u0022Kobymaru\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Kobymaru said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWell how else? CKAN is supposed to be *for users*. Sometimes, mod authors don\u0027t care about CKAN.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI think you missed the whole point of what I was getting at.  The issue is that modders get hit with CKAN issues when they didn\u0027t even know their mod was on CKAN.  So it breeds ill will with modders as they now seem expected to troubleshoot CKAN, when they may not have even known their mod was on CKAN, or even how CKAN works.\n\u003C/p\u003E\n"},{"CreatedByName":"Diazo","CreatedById":81549,"CreatedDateTime":"2016-06-17T18:19:58Z","Content":"\n\u003Cp\u003E\nOverall, I personally see CKAN as a good thing, but it\u0027s not overwhelmingly so.\n\u003C/p\u003E\n\u003Cp\u003E\nAs a mod author who\u0027s been hit with a lot of these issues, CKAN\u0027s issues mostly boil down to the fact that it\u0027s \u003Cem\u003Etoo\u003C/em\u003E open.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s all good to open the CKAN up to allow anyone to add a mod to it as that gets more mods (and so faster adoption of CKAN) to happen, but it also means people who don\u0027t know what they are doing start messing around things break in very short order.\n\u003C/p\u003E\n\u003Cp\u003E\n3 times I\u0027ve had people \u0022help\u0022 by going to CKAN and updating my mods but breaking them instead. This is the biggest strike against CKAN, as a mod author I can\u0027t control my mods on it, all I can do is keep an eye on it and revert any breaking changes made as soon as I notice them.\n\u003C/p\u003E\n\u003Cp\u003E\nThe other strike against CKAN is that there is no dependency control with other mods. While it does a good job of checking which version of a mod work on a specific KSP version, there is no way for a mod author to say \u0022I need \u003Cem\u003Ethis\u003C/em\u003E version of this other mod for my mod to work\u0022. CKAN just always installs the latest version of a mod. I\u0027m pretty sure this is why FAR and CKAN have had so many issues playing nice with one another (or at least one of the reasons).\n\u003C/p\u003E\n\u003Cp\u003E\nOn the plus side, it does work most of the time and makes installing/uninstalling mods so much easier for the average player. As such it does make for a better game experience so I do consider CKAN\u0027s positives to outweigh the negatives.\n\u003C/p\u003E\n\u003Cp\u003E\nD.\n\u003C/p\u003E\n"},{"CreatedByName":"Stone Blue","CreatedById":77721,"CreatedDateTime":"2016-06-18T13:22:53Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222634832\u0022 data-ipsquote-contentid=\u0022141918\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466168522\u0022 data-ipsquote-userid=\u0022107372\u0022 data-ipsquote-username=\u0022Kobymaru\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 6/17/2016 at 9:02 AM, Kobymaru said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI wonder, do you say that about installers for windows programs too? Instead of clicking one single \u0022install.exe\u0022 file, do you expect users to know how to extract libraries, set firewall rules, create the right folders and create the right registry keys?\n\u003C/p\u003E\n\u003Cp\u003E\nI always viewed the \u0022well you should know what you are doing\u0022 attitude kind of... elitist. You know how it works, and the mod author does, and that\u0027s great! But I feel that there is no good reason to exclude technically less versed people from installing windows programs or installing mods.\n\u003C/p\u003E\n\u003Cp\u003E\nCKAN, and installers, packet repositories and \u0022app stores\u0022 might be a huge PITA for authors and maintainers - but I believe they are crucial to offer access to mods/programs to a lot of people.\n\u003C/p\u003E\n\u003Cp\u003E\nSeriously, could we all stop for a second and ponder if you would really tell your grandma that using the Android App store is bad, because she \u0022doesn\u0027t understand the process\u0022 and \u0022has no idea how to troubleshoot\u0022?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSorry, but I have to STRONGLY disagree with this stance... At least as presented specifically to this discussion\n\u003C/p\u003E\n\u003Cp\u003E\nThis is almost apples to oranges...\u003Cbr\u003E\u003Cbr\u003E\nYou\u0027re citing VERY complicated, in-depth, worst case, Holy Cow....\u003Cbr\u003E\u003Cbr\u003E\nAs far as installing KSP mods, Squad has made a VERY simple way to install mods to the game:\u003Cbr\u003E\u003Cbr\u003E\nPaste a /GameData folder containing the /\u0026lt;modname\u0026gt; folder, into the KSP_win folder... Click yes when asked to merge the folders in the popup... DONE\n\u003C/p\u003E\n\u003Cp\u003E\nHow much simpler can THAT get?... I DO say that if you dont know how to extract an archive (.zip/rar), or copy/paste folders, or understand ABSOLUTE basic folder structure, then YES, you have NO business modding KSP... Much less even using a computer... lol \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd YES, I have told my MOTHER, and a friends mother, nicely, but yes, they have no business using a computer, or smart phone, when they cant even grasp the concept of single-click vs dbl click on a mouse...Or single-tap vs dbl tap on a touchscreen... Theres just a point where if you dont get simple basics, then yeah, maybe you shouldnt be trying to run when you cant even stand...\u003Cbr\u003E\u003Cbr\u003E\nI mean, if someone cant grasp the basic concept (or ability) to drive a car, are you gonna still let them drive that car, on public roads, just because they CAN, and its elitist for the rest of us to tell them NO...??\u003Cbr\u003E\u003Cbr\u003E\nThere, I went wide with that one too... \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-18T13:29:17Z\u0022 title=\u002206/18/2016 01:29  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 18, 2016\u003C/time\u003E by Stone Blue\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2016-06-19T02:19:59Z","Content":"\n\u003Cp\u003E\nThe fact is several major modders are against CKAN and decline to support installations done using it. Ferram and I believe Roverdude have adopted that stance. Even with modders who don\u0027t have such an anti-CKAN stance, chances are if you have a problem and you used CKAN you\u0027ll be asked to reinstall the mod manually and see if it persists. For me this makes CKAN untenable to use.\n\u003C/p\u003E\n\u003Cp\u003E\nAt the moment the sad reality is KSP has \u003Cstrong\u003Eno\u003C/strong\u003E good solution for mod management. Doing it manually is being stuck in the dark ages and doesn\u0027t scale. CKAN has too tainted a record I feel. KSP-AVC offers only basic and limited functionality. Modpacks are not a thing with KSP. Curse haven\u0027t moved in yet, and most of the community wouldn\u0027t really want them too. Steam Workshop is unlikely to ever be supported, and based on my experience with Cities: Skylines it has shortcomings anyway.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat do I think a good solution would look like? Well I think it wouldn\u0027t use release .zips as-is like CKAN tries to. It needs a way to robustly handle things, including dependencies and conflicts between mods. I wonder if it would be possible to make use of one of the formats already used in Linux software packaging, where a lot of that kind of stuff already has solutions. A good solution also needs to be friendly to the modders - don\u0027t burden them with excessive work to create packages, and don\u0027t cause issues that aren\u0027t present with a manual install. And I would venture that it shouldn\u0027t try to rush to the update - new versions of mods warrant checking, both of themselves and where practical for compatibility. Major well-respected mods have had updated versions with serious bugs before now.\n\u003C/p\u003E\n"},{"CreatedByName":"Skalou","CreatedById":133496,"CreatedDateTime":"2016-06-19T19:39:06Z","Content":"\n\u003Cp\u003E\nEven if know how to install mod, I am using CKAN, and like it very much,\n\u003C/p\u003E\n\u003Cp\u003E\nmaybe not perfect but good enought for me, i have far less troubles by installing/updating them with C-KAN (only once, i needed to uninstall a mod manually before reinstalling it, but it was in KSP 0.90) than manually ( wrong folder install, missed a needed dependency, not updated,...)\n\u003C/p\u003E\n\u003Cp\u003E\nFor (Sir!) Roverdude ,i don\u0027t know his point if view on it, but a lot of his mod are available via this ( and FAR too),\n\u003C/p\u003E\n\u003Cp\u003E\ni understand the point of view of modders demanding to reinstall it manually in case of any troubles, it\u0027s a logical step and easy to do.\n\u003C/p\u003E\n\u003Cp\u003E\nSo if you are a C-KAN guy and reading this, thank you ! \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI hope the best in it\u0027s developpment to make it a must-have both for users and modders.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-19T19:41:01Z\u0022 title=\u002206/19/2016 07:41  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 19, 2016\u003C/time\u003E by Skalou\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"h0yer","CreatedById":112042,"CreatedDateTime":"2016-06-20T06:08:17Z","Content":"\n\u003Cp\u003E\nOddly enough, it never even ran on my machine, it just bugs out on executing the executable^^\n\u003C/p\u003E\n\u003Cp\u003E\nSo I resorted to always manually installing and updating stuff, since several years now, especially in the case of this whole RealStuff(TM) endeavour, never encoutered a single issue on any install, even the half baked ones work^^ (half baked RVE)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI have this \u0027rule\u0027 about external applications:\n\u003C/p\u003E\n\u003Cp\u003E\nIf they reduce the amount of thinking process necessary to fulfill the general task, I don\u0027t use them. I like my thinking processes, I like hearing myself think^^ I even argue with myself while doing it \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIf they reduce the amount of repetative dull clickety, I use them. I\u0027m physically lazy. Very lazy...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nC\u0027mon, I mean, it\u0027s just dragging and dropping labelled icons between labelled rectangular windows/more icons, you just need the very basics of computer haptics (moving a mouse/hitting buttons), the ability to read, and basic understanding about what goes where, and the will to read instructions, FAQs, how2stuffs, guides, and walkthroughs \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nTo reduce it further down to it\u0027s very essence:\n\u003C/p\u003E\n\u003Cp\u003E\nA handfull of named files dispersed over a handfull of named folders^\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\npeace\n\u003C/p\u003E\n"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2016-06-20T14:18:55Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222637536\u0022 data-ipsquote-contentid=\u0022141918\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466365146\u0022 data-ipsquote-userid=\u0022133496\u0022 data-ipsquote-username=\u0022Skalou\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n18 hours ago, Skalou said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents ipsClearfix\u0022\u003E\n\u003Cp\u003E\nEven if know how to install mod, I am using \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003E\u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E\u003C/abbr\u003E, and like it very much,\n\u003C/p\u003E\n\u003Cp\u003E\nmaybe not perfect but good enought for me, i have far less troubles by installing/updating them with C-KAN (only once, i needed to uninstall a mod manually before reinstalling it, but it was in KSP 0.90) than manually ( wrong folder install, missed a needed dependency, not updated,...)\n\u003C/p\u003E\n\u003Cp\u003E\nFor (Sir!) Roverdude ,i don\u0027t know his point if view on it, but a lot of his mod are available via this ( and \u003Cabbr title=\u0022Ferram Aeronautics Research (mod)\u0022\u003E\u003Cabbr title=\u0022Ferram Aeronautics Research (mod)\u0022\u003EFAR\u003C/abbr\u003E\u003C/abbr\u003E too),\n\u003C/p\u003E\n\u003Cp\u003E\ni understand the point of view of modders demanding to reinstall it manually in case of any troubles, it\u0027s a logical step and easy to do.\n\u003C/p\u003E\n\u003Cp\u003E\nSo if you are a C-KAN guy and reading this, thank you ! \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI hope the best in it\u0027s developpment to make it a must-have both for users and modders.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI support my own metadata as a necessary evil and out of self defense.  And it still has issues.  Updates are not instantaneous, there is no opt-in for partial updates, it totally messes things up if you mix manual and \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003E\u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E\u003C/abbr\u003E installs, you have \u0027random people on the internet\u0027 changing mods, etc.\n\u003C/p\u003E\n\u003Cp\u003E\nWhere \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003E\u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E\u003C/abbr\u003E completely (and I mean completely) dropped the ball was in how they chose to go about adoption.  Rather than have it opt-in, they allowed the players, not the mod author, to force your mod into \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003E\u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E\u003C/abbr\u003E and you got to deal with the headaches.  And at least in the case of Ferram, totally refused to de-list, even at the modder\u0027s request.  Heck, they\u0027ve refused to delete several dead mods of mine despite asking nicely a couple of times (I\u0027ve pretty much given up).\n\u003C/p\u003E\n\u003Cp\u003E\nYes.  \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003E\u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E\u003C/abbr\u003E is geared towards the user as their customer, to the detriment of the modders.  Which sounds fine if you\u0027re just a consumer of content.  But IMO is the wrong approach.  Content consumers need content creators (modders), not the other way around (i.e. without other users, we\u0027d just enjoy our content and perhaps share it with a couple of friends).  Systems that annoy / discourage content creators tend to be counterproductive.\n\u003C/p\u003E\n\u003Cp\u003E\nPersonally, I recommend KSP-AVC.  It\u0027s 100% opt in, rock solid (any issue I have ever had has been my own fault), does not force upgrades, and makes troubleshooting installs a breeze.  \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/32393-cybutek/\u0026amp;do=hovercard\u0022 data-mentionid=\u002232393\u0022 href=\u0022%7B___base_url___%7D/index.php?/profile/32393-cybutek/\u0022 id=\u0022ips_uid_4233_9\u0022 rel=\u0022external\u0022\u003E@cybutek\u003C/a\u003E took the right approach with that one, and it shows.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-20T14:19:27Z\u0022 title=\u002206/20/2016 02:19  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 20, 2016\u003C/time\u003E by RoverDude\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Stone Blue","CreatedById":77721,"CreatedDateTime":"2016-06-20T16:40:25Z","Content":"\n\u003Cp\u003E\nI totally agree with RoverDude... The thing with \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003E\u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E\u003C/abbr\u003E is that it makes it TOO easy to mod KSP... It dumbs EVERYTHING down... Adding a mod to KSP is very easy and simple. Anyone who wants to add mods to KSP should at least know how to manually install and remove mods. I can see the advantage of having 100 mods installed, and having a method that takes the tediousness out of having to manually check for updates all the time...\u003Cbr\u003E\u003Cbr\u003E\nIts kind of like the timeless argument for/against MechJeb... Some people complain that it makes it too easy to fly in KSP, and keeps people from learning how themselves... Where as theres a good argument for autopilot, for advanced users, who DO know how to do, manually, everything that \u003Cabbr title=\u0022Mechjeb (mod)\u0022\u003EMJ\u003C/abbr\u003E does, yet use it \u0026amp; like it because it removes the tediousness of basic tasks..\u003Cbr\u003E\u003Cbr\u003E\nI think it\u0027s been detrimental in the fact that its catered to the laziness of mod consumers. Go ahead and flame me, but the biggest argument I\u0027ve seen FOR \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003E\u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E\u003C/abbr\u003E, is that it saves people from having to actually scan thru the OP of a mod release, to take note of any mod dependencies and conflicts. It also makes it so people cant even take the first step of basic mod troubleshooting, and puts all the onus on the mod devs, or someone else in the community to step up and do it FOR them...\u003Cbr\u003E\u003Cbr\u003E\nI think its kind of like the movie Idiocracy... How much do you want to dumb things down?... If people just use \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003E\u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E\u003C/abbr\u003E, and dont even bother to see how simple it is to add mods to KSP, and dont bother to grasp the basic concept, it can actually keep people from realising how simple it is to make an actual mod.... So we could conceeivably have consumers, but no one to actually make mods, or even fix them...\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-20T16:43:09Z\u0022 title=\u002206/20/2016 04:43  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 20, 2016\u003C/time\u003E by Stone Blue\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2016-06-21T05:27:21Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222638477\u0022 data-ipsquote-contentid=\u0022141918\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466432335\u0022 data-ipsquote-userid=\u0022105198\u0022 data-ipsquote-username=\u0022RoverDude\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n14 hours ago, RoverDude said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhere \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003E\u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003E\u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E completely (and I mean completely) dropped the ball was in how they chose to go about adoption.  Rather than have it opt-in, they allowed the players, not the mod author, to force your mod into \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003E\u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003E\u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E and you got to deal with the headaches.  And at least in the case of Ferram, totally refused to de-list, even at the modder\u0027s request.  Heck, they\u0027ve refused to delete several dead mods of mine despite asking nicely a couple of times (I\u0027ve pretty much given up).\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nFor some context on my problems with \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E, I was ambivalent about my mods being listed initially (basically, I expected things to not go well, but I saw no reason to complain so long as \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E did not cause problems).  I was told by one of the \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E contributors that if I did have a problem, I could ask, and they would de-list the mods.  \u003Cabbr title=\u0022Ferram Aeronautics Research (mod)\u0022\u003EFAR\u003C/abbr\u003E v0.15 comes out, and due to \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E\u0027s metadata being incorrect for that version (\u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E has no archive/metadata error checking of any form for mod updates) \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E pushes out a completely broken install at the same time that I am attempting to bugfix a complete overhaul of the aero model.  Bug reports that I need to read to fix things get buried by \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E-only install issues that are being reported by people that I knew never had install issues before.  So in one swoop, \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E caused more install issues for me than I ever got before on the one thing where they were supposed to make things easier for modders (at least when they were pretending they cared about modders).\n\u003C/p\u003E\n\u003Cp\u003E\nA little over a month later, after fixing those \u003Cabbr title=\u0022Ferram Aeronautics Research (mod)\u0022\u003EFAR\u003C/abbr\u003E issues I\u0027m mulling over asking \u003Cabbr title=\u0022Ferram Aeronautics Research (mod)\u0022\u003EFAR\u003C/abbr\u003E to be de-listed over the entire mess, though not sure either way.  I look at the \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E policies, and lo and behold, they\u0027ve declared that non-All Rights Reserved mods shall not be de-listed.  A month after \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E causes hundreds of install errors on one of the most-used mods authored by one of the more outspoken critics of \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E.  I demanded it be de-listed simply on principle at this point.\n\u003C/p\u003E\n\u003Cp\u003E\nSo yeah, I have a few problems with \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E.  Unlike RD, who handles his metadata for his own sanity, I\u0027m ticked enough at them that I refuse to do that.  I don\u0027t think it\u0027s right that \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E can cause issues for you and then get you to handle the metadata for them under threat of more metadata errors and issues if you don\u0027t.\n\u003C/p\u003E\n"},{"CreatedByName":"Stone Blue","CreatedById":77721,"CreatedDateTime":"2016-06-21T13:04:09Z","Content":"\n\u003Cp\u003E\nDELETED\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-21T14:27:17Z\u0022 title=\u002206/21/2016 02:27  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 21, 2016\u003C/time\u003E by Stone Blue\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Diazo","CreatedById":81549,"CreatedDateTime":"2016-06-21T14:00:51Z","Content":"\n\u003Cp\u003E\nOkay, this is getting rather heated.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/77721-stone-blue/\u0026amp;do=hovercard\u0022 data-mentionid=\u002277721\u0022 href=\u0022%7B___base_url___%7D/index.php?/profile/77721-stone-blue/\u0022 rel=\u0022external\u0022\u003E@Stone Blue\u003C/a\u003E I was peripherally involved in the discussion when ferram made his original request to have \u003Cabbr title=\u0022Ferram Aeronautics Research (mod)\u0022\u003E\u003Cabbr title=\u0022Ferram Aeronautics Research (mod)\u0022\u003EFAR\u003C/abbr\u003E\u003C/abbr\u003E delisted and it generated pages and pages of discussion at the time.\n\u003C/p\u003E\n\u003Cp\u003E\nThe short answer is that the \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003E\u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E\u003C/abbr\u003E staff were able to make a logical case for why they would have a policy of not de-listing mods, it\u0027s not a case of them being flat out wrong.\n\u003C/p\u003E\n\u003Cp\u003E\nHow strong their case is and whether you agree or disagree with that policy is going to be personal opinion.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, that means this discussion has already been had. I can link the previous discussion if you want to read the positions for yourself, but otherwise I think the question posed at the start of this thread has been answered and would ask that this be dropped before people already entrenched in their position from the previous discussion use this thread to start yelling at each other about it.\n\u003C/p\u003E\n\u003Cp\u003E\nD.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-21T14:01:21Z\u0022 title=\u002206/21/2016 02:01  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 21, 2016\u003C/time\u003E by Diazo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"swjr-swis","CreatedById":152460,"CreatedDateTime":"2016-06-21T14:18:00Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222636044\u0022 data-ipsquote-contentid=\u0022141918\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466256173\u0022 data-ipsquote-userid=\u002277721\u0022 data-ipsquote-username=\u0022Stone Blue\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 6/18/2016 at 3:22 PM, Stone Blue said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nPaste a /GameData folder containing the /\u0026lt;modname\u0026gt; folder, into the KSP_win folder... Click yes when asked to merge the folders in the popup... DONE\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nExcept of course when merging is exactly the wrong thing to do. Maybe not that simple after all?\n\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2016-06-21T14:22:26Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222639875\u0022 data-ipsquote-contentid=\u0022141918\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466518680\u0022 data-ipsquote-userid=\u0022152460\u0022 data-ipsquote-username=\u0022swjr-swis\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 minutes ago, swjr-swis said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nExcept of course when merging is exactly the wrong thing to do. Maybe not that simple after all?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nMore often than not in those cases the mod author will clearly state in the installation instructions to first delete previous instalments. If you do not know how to read or how to delete a folder you have no place on a computer.\u003Cbr\u003E\nRemoving a previous instalment when updating is pretty much ALWAYS the best option anyway. And if not your back-up will revert everything to how it was.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-21T14:25:27Z\u0022 title=\u002206/21/2016 02:25  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 21, 2016\u003C/time\u003E by Tex_NL\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2016-06-21T14:25:50Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222639875\u0022 data-ipsquote-contentid=\u0022141918\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466518680\u0022 data-ipsquote-userid=\u0022152460\u0022 data-ipsquote-username=\u0022swjr-swis\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 minutes ago, swjr-swis said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents ipsClearfix\u0022\u003E\n\u003Cp\u003E\nExcept of course when merging is exactly the wrong thing to do. Maybe not that simple after all?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nReplace with \u0027Delete old version first then copy\u0027 and you\u0027ve hit the 99.9% use case.  Use KSP-AVC, and you\u0027re at 100%.\n\u003C/p\u003E\n\u003Cp\u003E\nRegarding de-listing, etc.  - this is still a very active topic, and one that I believe \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003E\u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E\u003C/abbr\u003E continues to step wrongly in.  Take this little tidbit from the current \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003E\u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E\u003C/abbr\u003E thread from a member of the \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003E\u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E\u003C/abbr\u003E project.  \n\u003C/p\u003E\n\u003Cp\u003E\n\u0022It\u0027s worth remembering also that not selecting the \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003E\u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E\u003C/abbr\u003E option on Spacedock does not mean that the mod won\u0027t be listed on \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003E\u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E\u003C/abbr\u003E. If a \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003E\u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E\u003C/abbr\u003E user asks for a given mod to be listed, we will generally do so, barring some legal block. Since you have licensed Larinax under CC-BY-SA-NC, you\u0027ve given us irrevocable permission to distribute it.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nThis is not neighborly.  It encourages restrictive licenses, and ultimately pushes more modders into actively opposing \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003E\u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-21T14:28:05Z\u0022 title=\u002206/21/2016 02:28  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 21, 2016\u003C/time\u003E by RoverDude\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Stone Blue","CreatedById":77721,"CreatedDateTime":"2016-06-21T14:26:37Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222639860\u0022 data-ipsquote-contentid=\u0022141918\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466517651\u0022 data-ipsquote-userid=\u002281549\u0022 data-ipsquote-username=\u0022Diazo\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 minutes ago, Diazo said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/77721-stone-blue/\u0026amp;do=hovercard\u0022 data-mentionid=\u002277721\u0022 href=\u0022%7B___base_url___%7D/index.php?/profile/77721-stone-blue/\u0022 rel=\u0022external\u0022\u003E@Stone Blue\u003C/a\u003EOkay, this is getting rather heated.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSorry, I dont see that its getting \u0022heated\u0022.... It\u0027s still civil, and no one is being singled out... I just think its a matter of strong opinions being stated... And because the last few of those opinions are negative toward what is considered by the majority of the community to be a positive thing, people will start to get their undies in a bind...\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222639860\u0022 data-ipsquote-contentid=\u0022141918\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466517651\u0022 data-ipsquote-userid=\u002281549\u0022 data-ipsquote-username=\u0022Diazo\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n13 minutes ago, Diazo said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe short answer is that the \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003E\u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003E\u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E staff were able to make a logical case for why they would have a policy of not de-listing mods, it\u0027s not a case of them being flat out wrong.\n\u003C/p\u003E\n\u003Cp\u003E\nHow strong their case is and whether you agree or disagree with that policy is going to be personal opinion.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI NEVER stated they were WRONG... I just basically stated I thought they had not given the ethical aspects full consideration, and I wanted to point out, not just where \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E is concerned, but to anyone thinking about picking up, or forking a mod on their own, that they should also ask themselves is it the RIGHT thing to do, and what is the RIGHT way to go about it...\u003Cbr\u003E\u003Cbr\u003E\nI totally agree, this is all personal opinion, as its CLEARLY not a matter of facts, since \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E is well within their rights and forum rules to do what they are doing, and to voice their case and reasoning... Its clearly all personal opinions on whether people choose to support, and use, as well as vocalise why they either do so, or do not... \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI will now delete my previous post, in order to keep things from escalating, and to keep those with thin skins from being offended, as I MAY have been a bit pointed in the last paragraph of my post.\n\u003C/p\u003E\n\u003Cp\u003E\nI also ask, that if anyone has quoted ANY part of said post, before I removed it, PLEASE remove it from your quote...\u003Cbr\u003E\u003Cbr\u003E\nI DO want to state, \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/81549-diazo/\u0026amp;do=hovercard\u0022 data-mentionid=\u002281549\u0022 href=\u0022%7B___base_url___%7D/index.php?/profile/81549-diazo/\u0022 rel=\u0022\u0022\u003E@Diazo\u003C/a\u003E, that I have the utmost respect for you...\n\u003C/p\u003E\n"},{"CreatedByName":"swjr-swis","CreatedById":152460,"CreatedDateTime":"2016-06-21T14:28:34Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222639877\u0022 data-ipsquote-contentid=\u0022141918\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466518946\u0022 data-ipsquote-userid=\u002258254\u0022 data-ipsquote-username=\u0022Tex_NL\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 minute ago, Tex_NL said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMore often than not in those cases the mod author will clearly state in the installation instructions to first delete previous instalments. If you do not know how to read or how to delete a folder you have no place on a computer.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nLike I said: not so simple after all. Now you have to search and check every mod release thread for specific instructions regarding each update, that may (or may not!) be stated in the \u003Cabbr title=\u0022Original Post(er). The first post in a thread, or the person who posted it.\u0022\u003EOP\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nFor one mod, 5 mods, 10 mods.. perhaps doable. For 50 mods? 100? 200? Updating each at their own random moments and may or may not have exceptions in the \u0027very simple\u0027 install procedure to take into account.\n\u003C/p\u003E\n"},{"CreatedByName":"Stone Blue","CreatedById":77721,"CreatedDateTime":"2016-06-21T14:30:02Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222639875\u0022 data-ipsquote-contentid=\u0022141918\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466518680\u0022 data-ipsquote-userid=\u0022152460\u0022 data-ipsquote-username=\u0022swjr-swis\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 minutes ago, swjr-swis said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nExcept of course when merging is exactly the wrong thing to do. Maybe not that simple after all?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat would be a case of where it would be very beneficial to actually pull up the mod release thread \u003Cabbr title=\u0022Original Post(er). The first post in a thread, or the person who posted it.\u0022\u003EOP\u003C/abbr\u003E, and actually scan thru it for that information?\u003Cbr\u003E\u003Cbr\u003E\nMaybe it IS that simple after all... \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}