{"TopicId":142064,"ForumId":55,"TopicTitle":"Adding and Enhancing Celestial Bodies","CreatedByName":"RatchetinSpace","CreatedById":65526,"CreatedDateTime":"2016-06-19T09:33:44Z","PageNum":1,"Articles":[{"CreatedByName":"RatchetinSpace","CreatedById":65526,"CreatedDateTime":"2016-06-19T09:33:44Z","Content":"\n\u003Cp\u003E\nA few members of the KSP community have been asking for new planets for a while, but the discussion was always around improving the old planets vs adding more. I personally would like to see both, however I\u0027ll get back to that.\n\u003C/p\u003E\n\u003Cp\u003E\nCurrently, Kerbin has no clouds or weather patterns of any kind, which are a very real thing in the actual Spacecraft and Aircraft industry, launches are often cancelled or delayed due to poor weather conditions and planes have to take wind and turbulence into consideration when taking off and landing. Also I think weather would make a great visual difference to the game. The space center (and whole of Kerbin for that matter) always look the same, light or dark with the occasional sunset and sunrise, imagine what I\u0027d look like with rain and thunderstorms. I\u0027m not saying add tornadoes that damage your space centre or anything crazy, just weather patterns which make for variety in every launch. The weather system could then be applied to all planets and moons with atmospheres, imagine a probe trying to make a pin-point landing through a Laythe thunderstorm, a rover in the thick of a Duna dust storm, a probe measuring the intense winds in Jool\u0027s upper atmosphere, or even a space plane having to land on the KSC runway when dealing with freak wind conditions.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd weather isn\u0027t the only thing planets could be enhanced by, geological features on far away worlds are what differentiate them from each other. Volcanoes on Io and Venus, moving ice sheets and subsurface oceans on Europa and Enceladus and aurora at the poles of Jool and Kerbin. What I\u0027m trying to say here, is I think there should be more to do and more rewards for landing worlds far away, expending thousands of m/s of Delta V.\n\u003C/p\u003E\n\u003Cp\u003E\nNow I\u0027ve been talking a lot about enhancing the current celestial bodies, but there is also the question of adding new ones. For a while a second gas giant has been proposed for the Kerbol System, along with possibly another large terrestrial planet in the outer solar system. The second gas giant would be an analogue of Saturn and have rings and an extensive moon system. This was discussed a while ago, and I hope that Squad is still interested in this implementation. While planet-packs are great and interesting to play around with, a stable, In-Game Saturn analogue and Ice-giant analogue I think is in order for a number of reasons.\n\u003C/p\u003E\n\u003Cp\u003E\n1. A planet as far out as these two worlds would further encourage players to learn the concepts of gravity assists, which would be mostly necessary because of the Delta V requirements\u003Cbr\u003E\n2. A planet that far out would also encourage players to establish more permanent fuel outposts and mining establishments. From my experience, manned missions to Laythe\u0027s surface and back are possible with SSTO\u0027s and a greater challenge for Delta V requirements would, I think, boost the number of people using space stations and mining bases.\u003Cbr\u003E\n3. Rings are gorgeous, and would add a great visual element to the game. No-one can deny that a ringed gas planet in KSP would be beautiful and I think this planet would become the screenshot central of KSP\u003Cbr\u003E\n4. Rings also offer more opportunities for Science gathering\u003Cbr\u003E\n5. Two more worlds makes for more diversity. Those far away worlds make for a new class of long-haul mission that I think could be inspiring for new players and challenging for the older players.\n\u003C/p\u003E\n\u003Cp\u003E\nI fully acknowledge the planet packs out there that many people work long hours developing. I have tried them and had a lot of fun, but the stock planets, the ones which come with the game I download I think are incomplete in scope and in depth. I don\u0027t want just some coloured balls to plant a flag on, I want other worlds. Worlds which are wondrous, beautiful and unique. I want to send robots there to do Science, I want to set Kerbals on their surfaces so they too can take one more giant step for Kerbal kind. I know that Squad puts lots of time and effort into developing this game and every update has come with exciting things for me and so many others to enjoy. I have loved computer games before I went to school and I love Science and Astronomy with all of my heart and seeing those two things combine has been an awesome experience for me. I hope Squad will read this and get something out of it.\n\u003C/p\u003E\n\u003Cp\u003E\nAs for the forum user who has read through this whole thing (thank you), what is your opinion on this topic? Are the celestial bodies detailed enough? Are they numerous enough?\n\u003C/p\u003E\n"},{"CreatedByName":"AeroAviation","CreatedById":104773,"CreatedDateTime":"2016-06-19T09:59:52Z","Content":"\n\u003Cp\u003E\nI would love this but I just fear that all these enhancements would drive my laptop off the edge and blow up in my face.\n\u003C/p\u003E\n"},{"CreatedByName":"solarbearman","CreatedById":159439,"CreatedDateTime":"2016-06-19T12:30:38Z","Content":"\n\u003Cp\u003E\nThe weather thing is very complex, my laptopotato will blow up.\n\u003C/p\u003E\n\u003Cp\u003E\nBut I\u0027d love to see clouds. Only if you can disable them. Because not everyone owns a good computer.\n\u003C/p\u003E\n"},{"CreatedByName":"kBob","CreatedById":102132,"CreatedDateTime":"2016-06-19T13:39:02Z","Content":"\n\u003Cp\u003E\nJust like in FSX/Prepar3d you would presumably be able to turn off weather and clouds.  Clouds seem to actually have more issues than winds etc. in the flight simulators  they get especially problematic when flying in and out of them especially for people with older/less powerful computers, the solution is to reduce or eliminate them (running at say 10% cloud cover vs. 90% can make a big difference, but at least even then you still have some clouds).  It is quite possible to have these features and still accommodate people with less than ideal computers (to a point).\n\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2016-06-20T09:24:23Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222637026\u0022 data-ipsquote-contentid=\u0022142064\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466328824\u0022 data-ipsquote-userid=\u002265526\u0022 data-ipsquote-username=\u0022RatchetinSpace\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n23 hours ago, RatchetinSpace said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n1. A planet as far out as these two worlds would further encourage players to learn the concepts of gravity assists, which would be mostly necessary because of the Delta V requirements\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNot really, just as it doesn\u0027t take so much more dV to get a Minmus intercept vs Mun intercept. I play with OPM, and I mostly don\u0027t bother with gravity assists... waiting for launch windows is long enough... waiting for the slowly orbiting outer planets to line up for a gravity assist... no thanks.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n2. A planet that far out would also encourage players to establish more permanent fuel outposts and mining establishments. From my experience, manned missions to Laythe\u0027s surface and back are possible with SSTO\u0027s and a greater challenge for Delta V requirements would, I think, boost the number of people using space stations and mining bases.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAgain... not really, see point #1 about the dV requirements not being so much higher... still Mun and minmus bases are good, and I already use them for Jool trips. The launch windows to the outer planets are even less frequent if you depart from Jool or bit vs Kerbin orbit... because Jool\u0027s orbital period is much longer.\n\u003C/p\u003E\n\u003Cp\u003E\nI had considered Duna as an alternative.... but it doesn\u0027t even really save much dV as opposed to departing from Minmus/Mun and dropping the PE right above kerbin before the final ejection burn.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n4. Rings also offer more opportunities for Science gathering\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHow, we won\u0027t have a ring biome... its not compatible witht he way biomes are set up... are we going to have procedural A class asteroids in the rings?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI would incorporate OPM as stock... but change Slate to be different from Tylo (its basically the same, just visually different.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve made it into a proper mars analogue... .376 surface gravity (25% higher than Duna\u0027s), 0.01 Atmosphere surface pressure (15% of Duna\u0027s).. radius stays the same so orbital velocity is significantly higher than Duna (both due to the higher surface gravity, and the larger size meaning more mass to have that surface gravity at a larger distance from the center)\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-20T09:24:42Z\u0022 title=\u002206/20/2016 09:24  AM\u0022 data-short=\u00228 yr\u0022\u003EJune 20, 2016\u003C/time\u003E by KerikBalm\u003C/strong\u003E\n\u003C/span\u003E\n"}]}