{"TopicId":142002,"ForumId":55,"TopicTitle":"Mk3 Cockpit heat buff","CreatedByName":"War Eagle 1","CreatedById":67109,"CreatedDateTime":"2016-06-18T05:44:27Z","PageNum":1,"Articles":[{"CreatedByName":"War Eagle 1","CreatedById":67109,"CreatedDateTime":"2016-06-18T05:44:27Z","Content":"\n\u003Cp\u003E\nDoes anyone else think that the MK3 cockpit needs a heat buff? I get that the real space shuttle took long glides to re enter. BUT for one thing this is KSP and two even if i do take less steep re-entries…there is no logical reason for the MK3 to over heat as easily as it does.\n\u003C/p\u003E\n"},{"CreatedByName":"Jarin","CreatedById":71395,"CreatedDateTime":"2016-06-18T05:45:49Z","Content":"\n\u003Cp\u003E\nThe Mk2 has some issues too. I tend to overcome it with a dorsal radiator right behind the cockpit.\n\u003C/p\u003E\n"},{"CreatedByName":"War Eagle 1","CreatedById":67109,"CreatedDateTime":"2016-06-18T05:47:28Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222635811\u0022 data-ipsquote-contentid=\u0022142002\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466228749\u0022 data-ipsquote-userid=\u002271395\u0022 data-ipsquote-username=\u0022Jarin\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nJust now, Jarin said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe Mk2 has some issues too. I tend to overcome it with a dorsal radiator right behind the cockpit.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nso place it behind it?  I\u0027ve been clipping them in or putting them on the side\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Jarin","CreatedById":71395,"CreatedDateTime":"2016-06-18T05:52:29Z","Content":"\n\u003Cp\u003E\nMy spaceplanes tend to have two of the smallest extendible radiator, mounted dorsally, one right behind the cockpit and one back near the engines (left off if I\u0027m not running nukes). A high AoA on re-entry keeps them out of the airstream, and you can keep them extended down almost to 35km altitude. I typically keep the nose at 45 degrees and re-enter with a relatively shallow angle.\n\u003C/p\u003E\n\u003Cp\u003E\nIf coming in from outsystem or minmus, you probably want to make a pass or two to bleed speed off first, but this works great from 3-500km AP.\n\u003C/p\u003E\n\u003Cp\u003E\nEdit: This also lets you push your flight profile a bit on the way up; getting a bit more heat on ascent, without risking nukes trying to explode you when circularizing. Just activate the radiators as you rise past 40km.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-18T05:54:34Z\u0022 title=\u002206/18/2016 05:54  AM\u0022 data-short=\u00228 yr\u0022\u003EJune 18, 2016\u003C/time\u003E by Jarin\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"mk1980","CreatedById":163203,"CreatedDateTime":"2016-06-18T09:29:40Z","Content":"\n\u003Cp\u003E\ni think the cockpits in general could use better heat resistance (on par with the tanks of the same format, not significantly worse). the nose of the craft takes by far the most heat during reentry, so it\u0027s a bit awkward that the \u0022default\u0022 nose parts are literally the worst parts for that job. in practice, it\u0027s usually not worth the hassle to use a cockpit at all. a probe core can get the job done, and if you want to bring kerbals up, you get better crew capacity per mass by using passenger cabins.\n\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2016-06-18T11:21:06Z","Content":"\n\u003Cp\u003E\nI found my Mk2 and Mk3 cockpits stopped overheating when I started allowing them to cool after ascent. If I scream up to orbit and reenter after only an orbit or two then it hasn\u0027t had a chance to shed the heat from ascent, meaning they would likely get too hot during the reentry phase.\n\u003C/p\u003E\n\u003Cp\u003E\nA big part is finding the right reentry path. Too shallow is as bad as too steep, you have to find the sweet spot.\n\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2016-06-18T13:53:47Z","Content":"\n\u003Cp\u003E\nI haven\u0027t had problems with the mk3.... some problems with the mk2 when I get really aggressive, but thats fine.\n\u003C/p\u003E\n\u003Cp\u003E\nIts the mk1 that gives me the the most heating troubles. All the other ones make it down from LKO just fine.\n\u003C/p\u003E\n"},{"CreatedByName":"Sereneti","CreatedById":163637,"CreatedDateTime":"2016-06-18T14:45:08Z","Content":"\n\u003Cp\u003E\nThe MK3 can use the small heat-shild...\u003Cbr\u003E\n(and yes, the small heat-shield are enough for the mk3 cockpit)\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\nThe MK2 needs a small buff (ore an attach-point like the mk3)\n\u003C/p\u003E\n"}]}