{"TopicId":142234,"ForumId":18,"TopicTitle":"A Constellation of Dying Stars-Hard Sci fi TV show idea","CreatedByName":"meve12","CreatedById":65193,"CreatedDateTime":"2016-06-22T05:30:06Z","PageNum":1,"Articles":[{"CreatedByName":"meve12","CreatedById":65193,"CreatedDateTime":"2016-06-22T05:30:06Z","Content":"\n\u003Cp\u003E\nI had an idea for a hard scifi TV show setting a few days ago.\n\u003C/p\u003E\n\u003Cp\u003E\nGoogle doc with notes:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://docs.google.com/document/d/1YxMypvopOI8HXbXfzCRvth9ynoLbY5qxpBGWlX33Tf8/pub\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://docs.google.com/document/d/1YxMypvopOI8HXbXfzCRvth9ynoLbY5qxpBGWlX33Tf8/pub\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe short of it:\n\u003C/p\u003E\n\u003Cp\u003E\nThere\u0027s a thriving, increasingly posthuman interplanetary civilization.\n\u003C/p\u003E\n\u003Cp\u003E\nThen a dim neutron star blows through the Solar System and wrecks everything in it.\n\u003C/p\u003E\n\u003Cp\u003E\nThe last of humanity and associated species now resides in six humongous generational ships called Arks, as well as other less ambitious starships, enroute to other solar systems with exoplanets.\n\u003C/p\u003E\n\u003Cp\u003E\nOne of the arks develops Alcubierre drive. Several feats of espionage later, all the Arks have Alcubierre drives.\n\u003C/p\u003E\n\u003Cp\u003E\nThe drives, however, can\u0027t move enough mass to either move an Ark or evacuate it faster than just having the Ark arrive as planned.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat Alcubierre ships can do, however, is set up seed colonies and mining outposts around neighboring stars, or carry freight and mail. Or, in the case of the show itself, checking out and salvaging/culturally integrating/rescuing slowships-there\u0027s a lot of them, they tend to be somewhat shoddy, and not all of them weathered the slower than light exodus very well.\n\u003C/p\u003E\n\u003Cp\u003E\nWould like more ideas for worldbuilding. I kicked this around on /tg as well, but it didn\u0027t get any attention worth note.\n\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2016-06-22T16:00:46Z","Content":"\n\u003Cp\u003E\nSounds like it would be easier if they just pulled a \u0022Songs of Distant Earth\u0022 and sent out seed ships, followed by colony ships. Although it would be better, if you start out in space, to build in-space colonies like Gundam (the one realistic aspect of the original series).\n\u003C/p\u003E\n"},{"CreatedByName":"meve12","CreatedById":65193,"CreatedDateTime":"2016-06-22T16:31:00Z","Content":"\n\u003Cp\u003E\nI\u0027ll say several slowships are in fact seed ships of some variety. Although the evacuation wasn\u0027t exactly coordinated.\n\u003C/p\u003E\n\u003Cp\u003E\nThe important thing to note about the setting is that nothing in the Solar System survives when The Cannonball comes through-just being in space wouldn\u0027t save you. You need to be outside the Solar system.\n\u003C/p\u003E\n\u003Cp\u003E\nSpaceborne colonies is a possibility for when the Arks arrive (They\u0027re not exactly designed to land) but even then they\u0027d still need lots of metals, plastic feedstock and such, and they have the tech for relatively cheap surface-to-orbit travel.(Which I\u0027m saying is laser launchers)\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-22T16:47:02Z\u0022 title=\u002206/22/2016 04:47  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 22, 2016\u003C/time\u003E by meve12\u003C/strong\u003E\n\u003Cbr\u003EForgot some words\n\u003C/span\u003E\n"},{"CreatedByName":"Xorth Tanovar","CreatedById":71205,"CreatedDateTime":"2016-06-22T17:35:00Z","Content":"\n\u003Cp\u003E\n..or the Earthlings had enough time/resources for just one Ark, a la \u0022Phoenix Without Ashes\u0022 style. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOr similar to the one-season show \u0022Earth 2\u0022, advance party gets to the target system only to crash upon it....22 years to get everything up and running for the inbound Ark.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nCountless storylines abound...\n\u003C/p\u003E\n"}]}