{"TopicId":142471,"ForumId":16,"TopicTitle":"1.1.3- Having Terrible Time","CreatedByName":"ghost_sox","CreatedById":162992,"CreatedDateTime":"2016-06-25T11:47:42Z","PageNum":1,"Articles":[{"CreatedByName":"ghost_sox","CreatedById":162992,"CreatedDateTime":"2016-06-25T11:47:42Z","Content":"\n\u003Cp\u003E\nHello all,\n\u003C/p\u003E\n\u003Cp\u003E\nJust thought I\u0027d post a little about my frustrating experiences with KSP since purchasing it.\u003Cbr\u003E\nI can\u0027t seem to get anything right with this game.  I\u0027ve been playing flight sims for 20 years dating back to Pro Pilot for Windows 95/98 and getting deep into MS Flight Sim and Combat Flight Sim.   But KSP just keeps putting me through the wringer and I\u0027m getting tired of failing all the time and having to launch again, and again, and again.  When I get one thing corrected, something else comes up.  For example..\u003Cbr\u003E\u003Cbr\u003E\nSimple Orbit...\u003Cbr\u003E\nIt takes me 4 to 7 tries to get a descent orbit.\u003Cbr\u003E\nOn one attempt,  I\u0027ll be burning horizonally just fine but the periapsis raises sooo slooooww.    Then the apoapsis begins climbing very fast and next thing I know,  my apoapsis is halfway to Mun while the periapsis is only 65km.\u003Cbr\u003E\u003Cbr\u003E\nOk, now,  I finally get into orbit after about 3 or 4 tries.  I have feul so lets try a Mun flyby.   RIGHT!\u003Cbr\u003E\nSet a maneuver node and get my apoapsis out to Munar orbit,  move the node to get a Mun encounter.   Easy right?\u003Cbr\u003E\nComes time to burn,  line up with the blue marker and burn when the timer hits 0,  burn until the white meter is gone and the clock reaches 0 on burn time,   my orbit is way, way past Mun with no encounter.  \u003Cbr\u003E\nI try it again,  this time burning 1/2 before and 1/2 after node encounter.   Now I don\u0027t even get anywhere near my node\u0027s path,  I get some orbit way off of where I want.   I can\u0027t get this right and I really want to get into this game and I\u0027m trying really hard but I\u0027m getting beyond frustrated and ready to move on to other games.  I\u0027m so tired or re-launching.  Why does this game have to be so DARN HARD???????\u003Cbr\u003E\u003Cbr\u003E\nOk,  I get close to Mun after a bit of luck and somehow got the node right, (don\u0027t kow how I did it).   I am nice and close and now I can\u0027t steer my ship,  I\u0027m tumbling all over the place and there\u0027s no way to get home because I\u0027ve lost control of my ship,  REVERT YET AGAIN!  UGGHHH!!   I\u0027m beginning to hate this game.\u003Cbr\u003E\u003Cbr\u003E\nEVERY TIME I get something corrected,  something else goes wrong.\u003Cbr\u003E\nThen,  when I get the tumbling right,  the game crashed!\n\u003C/p\u003E\n\u003Cp\u003E\nI don\u0027t know what I\u0027m doing wrong or why this has to be so complicated.  I shouldn\u0027t need to research for 2 hours just to get a descent orbit and I have given up on even trying a Mun landing,  I can\u0027t even loop around it and return home like Apollo 13 did.   Either this is the hardes flight sim ever made or I\u0027m just getting to old for this crap and need to hang up my virtual wings.  I don\u0027t want to hate KSP but it\u0027s getting easier and easier by the launch.\n\u003C/p\u003E\n\u003Cp\u003E\nJust venting,\u003Cbr\u003E\nThanks for reading and enjoy your day.\u003Cbr\u003E\u003Cbr\u003E\nThe Controversial Ghost\n\u003C/p\u003E\n"},{"CreatedByName":"kBob","CreatedById":102132,"CreatedDateTime":"2016-06-25T12:13:31Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/162992-ghost_sox/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022162992\u0022 href=\u0022%7B___base_url___%7D/index.php?/profile/162992-ghost_sox/\u0022 rel=\u0022\u0022\u003E@ghost_sox\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nHmmm, well I\u0027ve been doing flight sims since I had an instrument only sim on my TRS-80 (so you can probably guess how old I\u0027m feeling).\n\u003C/p\u003E\n\u003Cp\u003E\nAs to your problems.  First, flight sim experience isn\u0027t going to help a lot in KSP though some of the terminology will be familiar and when flying planes it will help a bit but for rockets about the only thing is you will know to rely on your instruments (especially the navball) rather than visual ques (a common beginner mistake).\n\u003C/p\u003E\n\u003Cp\u003E\nAre you in sandbox or career mode?  If in sandbox give career a try, by limiting your choices it helps guide you to a more successful experience. \n\u003C/p\u003E\n\u003Cp\u003E\nIf you are able to watch internet video you might try some of the many tutorial beginner videos (I can\u0027t so I\u0027ll leave it to others to recommend specific ones).\n\u003C/p\u003E\n\u003Cp\u003E\nAsk specific question (and post pictures) in the game play forum, you\u0027ll get lots of help.  And search that forum there\u0027s lot\u0027s of good advice about how to do these things.\n\u003C/p\u003E\n\u003Cp\u003E\nAre you really remembering how long it first took you to master a flight simulator?  Bet it took more than a few hours.\n\u003C/p\u003E\n\u003Cp\u003E\nSounds like maybe you are being a bit heavy on the controls, but without details I\u0027m just guessing.\n\u003C/p\u003E\n\u003Cp\u003E\nIf your are still having trouble with the maneuver modes maybe you are trying to push yourself to far too soon.  Make sure you can orbit Kerbin and return safely.  Next do a Mun encounter (not orbit) and return first, once you can do that, then go for a Mun orbit and safe return.  After that try \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/116376-how-to-get-to-the-moons-with-an-example-sandbox-rocket-that-can-do-it/#comment-2074250\u0022 rel=\u0022\u0022\u003Ethis\u003C/a\u003E Mun landing tutorial (not a video).  Also something I didn\u0027t now about those nodes for a long time, when the cursor is in the circle of one of the adjustment knobs (like prograde) you can use the mouse wheel to change it rather than dragging it for fine tuning it.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nF5 quicksave and especially alt/mod-F5 and alt/mod-F9 named quicksave/load are your friends, save often so you can go back and retry (and not lose too much in the event of a crash--some people seem to have better KSP stability than others, e.g. I\u0027ve had 3 crashes in the last 200\u002B hours of use, not counting a corrupted upgrade but that wasn\u0027t KSP\u0027s fault \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E ).\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-25T12:14:25Z\u0022 title=\u002206/25/2016 12:14  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 25, 2016\u003C/time\u003E by kBob\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Green Baron","CreatedById":107381,"CreatedDateTime":"2016-06-25T12:32:28Z","Content":"\n\u003Cp\u003E\nJust read the instructions :-)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSeriously, there is a nice wiki with tutorials and a lot of sample crafts, youtube videos etc. That\u0027ll help with errors like burn when timer hits zero (start burning around timer-burntime/2, plus a little for mass loss during burntime). \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003E\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003E\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003E\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003E\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E should not be too high, around 1.4 to 1.7 on the pad, that\u0027ll avoid that AP rises too fast. Start turning a few degrees to the east after clearing the tower, a little more when around 5.000, go through 12.000 with about 45°, these are rough house numbers but they work. Use throttle, every honest rocket throttles down during flight.\n\u003C/p\u003E\n\u003Cp\u003E\nProper staging helps as well. Sample mun-lander rocket for not having to read 2 hours (but try 2 days until it works):\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022e7ynyqx.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/e7ynyqx.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-25T12:43:16Z\u0022 title=\u002206/25/2016 12:43  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 25, 2016\u003C/time\u003E by Green Baron\u003C/strong\u003E\n\u003Cbr\u003EScoff\n\u003C/span\u003E\n"},{"CreatedByName":"FullMetalMachinist","CreatedById":156531,"CreatedDateTime":"2016-06-25T13:09:38Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/162992-ghost_sox/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022162992\u0022 href=\u0022%7B___base_url___%7D/index.php?/profile/162992-ghost_sox/\u0022 rel=\u0022\u0022\u003E@ghost_sox\u003C/a\u003E,\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m sorry that you\u0027re having a hard time with the game. But before you get too frustrated, remember that even though it\u0027s a game, it \u003Cem\u003Eis\u003C/em\u003E (roughly) simulating rocket science, which is very, very hard. \n\u003C/p\u003E\n\u003Cp\u003E\nI very strongly recommend that you try the in-game tutorials. They were recently redone for the 1.1 update, and they are quite good. They will walk you through building and flying a rocket to orbit, and then to and from the Mun. \n\u003C/p\u003E\n\u003Cp\u003E\nOnce you feel you\u0027re comfortable with what the tutorials show you, I suggest playing a Science game for a while (not career). It seems to me that sandbox is \u0022too much too soon\u0022 for newer players to have access to all the parts at once. And with Science mode you don\u0027t have to worry about contracts or funds or reputation or hiring astronauts or building upgrades. \n\u003C/p\u003E\n"},{"CreatedByName":"Rocket In My Pocket","CreatedById":154640,"CreatedDateTime":"2016-06-25T13:14:48Z","Content":"\n\u003Cp\u003E\nSteps to obtain a proper orbit that won\u0027t take 2 hours to read:\n\u003C/p\u003E\n\u003Col\u003E\u003Cli\u003E\nTake off from pad, heading out over the sea, start dipping your nose down ever so slightly.\n\u003C/li\u003E\n\u003Cli\u003E\nLet the rocket slowly tilt down until it\u0027s at a 45 degree angle, this should be completed before you\u0027ve reached 10,000m\n\u003C/li\u003E\n\u003Cli\u003E\nContinue burning at 45 degrees until you \u003Cabbr title=\u0022Apoapsis\u0022\u003E\u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E\u003C/abbr\u003E is at 75km.\n\u003C/li\u003E\n\u003Cli\u003E\nCut throttle and wait until your time to \u003Cabbr title=\u0022Apoapsis\u0022\u003E\u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E\u003C/abbr\u003E is 30 seconds. (You can see this by mousing over the \u003Cabbr title=\u0022Apoapsis\u0022\u003E\u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E\u003C/abbr\u003E marker in map mode, but I recommend using the \u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003E\u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKER\u003C/abbr\u003E\u003C/abbr\u003E mod instead.)\n\u003C/li\u003E\n\u003Cli\u003E\nNose down until your navball marker is on the line separating the blue/brown halves of the navball.\n\u003C/li\u003E\n\u003Cli\u003E\nBurn prograde being careful to keep your time to \u003Cabbr title=\u0022Apoapsis\u0022\u003E\u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E\u003C/abbr\u003E between 5-25 seconds. (I usually shoot for around 10 seconds.) If time to \u003Cabbr title=\u0022Apoapsis\u0022\u003E\u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E\u003C/abbr\u003E gets too low, nose up. If it gets to high, nose down.\n\u003C/li\u003E\n\u003Cli\u003E\nOnce your \u003Cabbr title=\u0022Periapsis\u0022\u003E\u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E\u003C/abbr\u003E is at 75km cut throttle.\n\u003C/li\u003E\n\u003Cli\u003E\nCongrats! You\u0027re in a nice circular orbit of 75km/75km.\n\u003C/li\u003E\n\u003C/ol\u003E\u003Cp\u003E\nIf you have \u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003E\u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKER\u003C/abbr\u003E\u003C/abbr\u003E installed you\u0027ll be able to see your crafts Delta V as you are building it. You will need roughly 3,400Dv to reach orbit. (It never hurts to bring extra. You want a margin for error.) As far as general rocket construction goes, you can break it down into 4 basic stages. Your first stage should be Solid Rocket Boosters like the \u0022Thumper\u0022 \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/BACC_%22Thumper%22_Solid_Fuel_Booster\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.kerbalspaceprogram.com/wiki/BACC_\u0022Thumper\u0022_Solid_Fuel_Booster\u003C/a\u003E as they have high Thrust to Weight ratio which you will need down low in the atmo. Your second stage should be a medium engine like the \u0022Reliant\u0022 \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/LV-T30_%22Reliant%22_Liquid_Fuel_Engine\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.kerbalspaceprogram.com/wiki/LV-T30_\u0022Reliant\u0022_Liquid_Fuel_Engine\u003C/a\u003E, and the third stage should be a low \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003E\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E\u003C/abbr\u003E/High efficiency engine like the \u0022Terrier\u0022 \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/LV-909_%22Terrier%22_Liquid_Fuel_Engine\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.kerbalspaceprogram.com/wiki/LV-909_\u0022Terrier\u0022_Liquid_Fuel_Engine\u003C/a\u003E Then atop all that you have the \u0022payload\u0022 stage, which are the actual bits you want to get into space such as the command pod and science gathering parts. (Some parachutes and a heatshield wouldn\u0027t hurt either if you are planning on coming home!)\n\u003C/p\u003E\n\u003Cp\u003E\nIf you have any other questions please don\u0027t hesitate to ask, best of luck!\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-25T13:15:38Z\u0022 title=\u002206/25/2016 01:15  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 25, 2016\u003C/time\u003E by Rocket In My Pocket\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sardia","CreatedById":149922,"CreatedDateTime":"2016-06-25T13:32:31Z","Content":"\n\u003Cp\u003E\nCan we see a picture of your rocket?\n\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2016-06-25T14:07:22Z","Content":"\n\u003Cp\u003E\nRemoved a couple of posts, it is not helpful or productive to tell a new player who is struggling to \u0022git gud\u0022. They came here to get help (and vent a little), not to be belittled.\n\u003C/p\u003E\n"},{"CreatedByName":"Dedjal","CreatedById":57220,"CreatedDateTime":"2016-06-25T14:25:23Z","Content":"\n\u003Cp\u003E\nRaise your ap by burning at pe. Raise your pe by burning at ap.\n\u003C/p\u003E\n\u003Cp\u003E\nOrbital mechanics is not something you really learn in a flight sim...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOh, and the navball is your friend, cling to it like gollum.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen you finally understand how the navball works, you can do anything.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-25T14:28:19Z\u0022 title=\u002206/25/2016 02:28  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 25, 2016\u003C/time\u003E by Dedjal\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MircoMars","CreatedById":61811,"CreatedDateTime":"2016-06-25T14:37:20Z","Content":"\n\u003Cp\u003E\nI understand your frustration, may I offer some advice:\n\u003C/p\u003E\n\u003Cp\u003E\n1. use sandbox mode, as it gives you usable pilots from the start and doesn\u0027t restrict your part choices.\n\u003C/p\u003E\n\u003Cp\u003E\n2. set yourself small goals: orbit and return;  orbit, mun flyby and return etc...\n\u003C/p\u003E\n\u003Cp\u003E\n3. check youtube tutorials. \u003Ca href=\u0022https://www.youtube.com/playlist?list=PLYu7z3I8tdEm5nyZU3a-O2ak6mBYXWPAL\u0022 rel=\u0022external nofollow\u0022\u003EScott Manley\u0027s are a bit old, but pretty good\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n4. explosions are fun! \n\u003C/p\u003E\n"},{"CreatedByName":"Kertech","CreatedById":156079,"CreatedDateTime":"2016-06-25T14:53:56Z","Content":"\n\u003Cp\u003E\nWhen using the count down to burn time you need to start burning before your marker, if the estimated burn time is up it is half of that before and half of that after, what you\u0027re trying to achieve is all the acceleration happening at 0sec, but cause that would require an infinite accelleration you need to start before, e.g. A 2 minute burn will begin at -1minute and end at \u002B1minute. Hope that clears things up and happy mun encountering! \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe the other way to reach the mun though is just time warp until it appears just over the horizon, burn prograde, watch the map screen until you get an encounter! Just make sure you have a more or less 0\u0027 inclination.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nhappy flying\n\u003C/p\u003E\n\u003Cp\u003E\nAfter re reading I would also suggest, if you AP is flying off, cut your engines, fly to apoapsis, then burn prograde there! If you\u0027re way too high then it\u0027ll only take a few hundred \u003Cabbr title=\u0022Delta-V\u0022\u003Edv\u003C/abbr\u003E!\n\u003C/p\u003E\u003Cp\u003E\nThe navball is the greatest tool in the world!\n\u003C/p\u003E\n"},{"CreatedByName":"Divstator","CreatedById":161990,"CreatedDateTime":"2016-06-25T14:58:15Z","Content":"\n\u003Cp\u003E\nYou mentioned something about tumbling out of control and I haven\u0027t seen it mentioned here yet. You do have \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E turned on correct? Because without it, it is REALLY difficult, to fly smaller craft especially.\n\u003C/p\u003E\n"},{"CreatedByName":"Raptor9","CreatedById":67915,"CreatedDateTime":"2016-06-25T14:58:21Z","Content":"\n\u003Cp\u003E\nTo reiterate what \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/156531-fullmetalmachinist/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022156531\u0022 href=\u0022%7B___base_url___%7D/index.php?/profile/156531-fullmetalmachinist/\u0022 rel=\u0022external\u0022\u003E@FullMetalMachinist\u003C/a\u003E, \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/57220-dedjal/\u0026amp;do=hovercard\u0022 data-mentionid=\u002257220\u0022 href=\u0022%7B___base_url___%7D/index.php?/profile/57220-dedjal/\u0022 rel=\u0022external\u0022\u003E@Dedjal\u003C/a\u003E and \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/61811-mircomars/\u0026amp;do=hovercard\u0022 data-mentionid=\u002261811\u0022 href=\u0022%7B___base_url___%7D/index.php?/profile/61811-mircomars/\u0022 rel=\u0022external\u0022\u003E@MircoMars\u003C/a\u003E said, try the in-game tutorials, click on the book-looking \u0022KSPedia\u0022 app button and read some info in there, and if all that doesn\u0027t help you, check out Scott Manley on youtube.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve been playing flight sims since F-19 Stealth Fighter on MS-DOS, and I have to say orbital mechanics are not intuitive at all when compared to previous flight sim experience.  But once it \u0022clicks\u0022, you\u0027ll be stranding Kerbals on Duna in no time.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-25T14:59:10Z\u0022 title=\u002206/25/2016 02:59  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 25, 2016\u003C/time\u003E by Raptor9\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Green Baron","CreatedById":107381,"CreatedDateTime":"2016-06-25T15:10:24Z","Content":"\n\u003Cp\u003E\n... aah, the tumbling: did you ran out of electricity cause you forgot solar panels ? Guess when this happened to me last time ...\n\u003C/p\u003E\n"},{"CreatedByName":"MircoMars","CreatedById":61811,"CreatedDateTime":"2016-06-25T15:55:56Z","Content":"\n\u003Cp\u003E\nF5 for quicksave saves a lot of grieve if used before and after important maneuvers. hold F9 for quickload. (alt \u002B F5 / F9 enables naming saves)\n\u003C/p\u003E\n\u003Cp\u003E\nah and something I read very early about this game:\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Other games might have a learning curve, KSP has a learning wall.\u0022\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-25T15:59:21Z\u0022 title=\u002206/25/2016 03:59  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 25, 2016\u003C/time\u003E by MircoMars\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ghost_sox","CreatedById":162992,"CreatedDateTime":"2016-06-25T16:21:32Z","Content":"\n\u003Cp\u003E\nThanks for all the replies....\n\u003C/p\u003E\n\u003Cp\u003E\nNow for some of my own...\n\u003C/p\u003E\n\u003Cp\u003E\nFirst a quote...   \u003Cbr\u003E\n\u0022\u0022  \u003Cspan style=\u0022color:rgb(39,42,52);font-family:\u0027Helvetica Neue\u0027, Helvetica, Arial, sans-serif;font-size:14px;font-style:normal;font-variant:normal;font-weight:normal;letter-spacing:normal;line-height:22.4px;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;float:none;background-color:rgb(255,255,255);\u0022\u003EJust read the instructions\u003C/span\u003E \u0022\u0022\u003Cbr\u003E\nI believe in my initial post I have stated that I\u0027ve researched for hours.   More than just reading the directions.   I have watched video after video including Manley.  I have done the tuts section.\n\u003C/p\u003E\n\u003Cp\u003E\n.I understand how the navball works.  \n\u003C/p\u003E\n\u003Cp\u003E\nI have \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E enabled and have a one star pilot in career mode.  \u003Cbr\u003E\nI often burn too much feul to get into orbit on one flight,   start tumbling evweywhere on another.   On this other one I will lose the ability to move the navball entirely.    Charge can run out in just one orbit?    Why am I losing the ability to move the ball entirely?   If it isn\u0027t this,  it\u0027s that.   Fix this,  that breaks.   Fix that,  this happens.\u003Cbr\u003E\nI am launching the same mission over and over and over again with backward progress.   I orbited the Mun and didn\u0027t have enough fuel to return.  OK,  cool,  Revert,   Now I can\u0027t get into orbit again.  Revert,  now I start tumbling before reaching Mun,  Revert,  Now I can\u0027t \u0022steer\u0022 entirely.   Yikes.   So I\u0027m losing these abilities with the same DARN ROCKET.   Sometimes I can steer,  but sometimes I tumble,  sometimes I lose \u0022steering\u0022 altogether.   I know you don\u0027t \u0022steer\u0022 in space,  just can\u0027t think of what else to call it.\n\u003C/p\u003E\n\u003Cp\u003E\nThis is just plain too hard.   There needs to be a way to tone it down a bit.   I mean,  I am a man of science,  been studying space and astronomy since 6th grade (over 30 years)   and this game makes me feel stupid.   \n\u003C/p\u003E\n\u003Cp\u003E\nI have been playing for about a month and a half.   You\u0027d think I could land on the Mun by now...   Nope,  I haven\u0027t even tried it.  I have only orbited it.   I guess I just plain don\u0027t get it.\u003Cbr\u003E\u003Cbr\u003E\nThe AP issue I speak of happens while ascending into space...  Holding the nose at the horizon and burning should keep the AP where it is and raise the PE,  which it does,  for a while until the AP suddenly climbs WAY WAY faster than the PE,  resulting in an AP of 600km and a PE of only 100km.    I have tried burning slightly above prograde after passing the AP point,  which works for a few seconds.   Sometimes I can get a descent orbit but most times I end up using all my fuel on raising the PE which takes FOREVER to climb.\u003Cbr\u003E\nAfter passing the AP on the way up,  the AP SHOOTS up and the PE CRAWLS up.\u003Cbr\u003E\nHow the heck can you make the PE rise faster while keeping the AP close to stable?  I have tried stronger engines and weaker engines.  I\u0027ve tinkered with \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E.    Ugghh     No matter what I do,  that AP shoots up while that PE slowly ticks up.   That\u0027s my biggest issue,  along with the loss of control (tumbling and moving the ball entirely).\n\u003C/p\u003E\n\u003Cp\u003E\nI appreciate a game that is challenging.  I don\u0027t mind learning it,  but I\u0027m getting to a point where I\u0027m going to put it down and fire up Prison Architect again LOL.   I\u0027m not having fun,  I\u0027m constantly frustrated.  But I\u0027ve waited for a game like this for a few decades.   Major disappointment..    I want to be able to play this but I didn\u0027t realize it would have such a steep learning curve.   I\u0027ve played some complicated games before,  (Battlecruiser / Universal Combat anyone? LOL)  but  KSP has half the controls but twice the complications.\n\u003C/p\u003E\n"},{"CreatedByName":"Jas0n","CreatedById":57441,"CreatedDateTime":"2016-06-25T16:30:49Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222646935\u0022 data-ipsquote-contentid=\u0022142471\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466871692\u0022 data-ipsquote-userid=\u0022162992\u0022 data-ipsquote-username=\u0022ghost_sox\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 minutes ago, ghost_sox said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe AP issue I speak of happens while ascending into space...  Holding the nose at the horizon and burning should keep the AP where it is and raise the PE,  which it does,  for a while until the AP suddenly climbs WAY WAY faster than the PE,  resulting in an AP of 600km and a PE of only 100km.    I have tried burning slightly above prograde after passing the AP point,  which works for a few seconds.   Sometimes I can get a descent orbit but most times I end up using all my fuel on raising the PE which takes FOREVER to climb.\u003Cbr\u003E\nAfter passing the AP on the way up,  the AP SHOOTS up and the PE CRAWLS up.\u003Cbr\u003E\nHow the heck can you make the PE rise faster while keeping the AP close to stable?  I have tried stronger engines and weaker engines.  I\u0027ve tinkered with \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003E\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E\u003C/abbr\u003E.    Ugghh     No matter what I do,  that AP shoots up while that PE slowly ticks up.   That\u0027s my biggest issue,  along with the loss of control (tumbling and moving the ball entirely).\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIf your AP is climbing way faster than PE it means that you\u0027re roughly at PE and burning prograde. When you are at that point, shut off your engines and coast to AP and burn prograde there to raise your PE. And if your AP is too high, burn retrograde at PE to lower AP. \n\u003C/p\u003E\n"},{"CreatedByName":"Green Baron","CreatedById":107381,"CreatedDateTime":"2016-06-25T16:31:37Z","Content":"\n\u003Cp\u003E\nOk. We do it step by step, one after the other.\n\u003C/p\u003E\n\u003Cp\u003E\nBuild that craft in the picture (without the science stuff on top, instead place a large blue parchute). Launch it and try to do a nice gravity turn, pitch a little over after launch, let it go, it should hit 10-12.000 with 45°, that\u0027s what we like. You\u0027ll need a few tries until you get that. Afterwords you may need to keep the nose a little below the prograde marker. Keep on burning until AP is 100km. During that hold the nose down a little below prograde. When the ap reaches 100 cut the engine. Your speed should be around 1500m/s or so, more is better, less is ok. AP is 1-3 min away, that\u0027s ok for now.\n\u003C/p\u003E\n\u003Cp\u003E\nSet a maneuver node at ap for circularization. Orient your coasting rocket to the blue marker. Half the burntime before the node you fire up until the yellow marker is 0 (or close to). Hit x. Voila, circular orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nGot it that far ? Than we do the next step.\n\u003C/p\u003E\n\u003Cp\u003E\nEdit: don\u0027t.forget.the.solar.panels :-)\n\u003C/p\u003E\n\u003Cp\u003E\nEditedit: don\u0027t forget the staging, press space when the outer engines die and maintain full throttle for ease, you can optimize later.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-25T16:43:56Z\u0022 title=\u002206/25/2016 04:43  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 25, 2016\u003C/time\u003E by Green Baron\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Stargate525","CreatedById":53585,"CreatedDateTime":"2016-06-25T16:32:08Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222646935\u0022 data-ipsquote-contentid=\u0022142471\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466871692\u0022 data-ipsquote-userid=\u0022162992\u0022 data-ipsquote-username=\u0022ghost_sox\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 minutes ago, ghost_sox said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe AP issue I speak of happens while ascending into space...  Holding the nose at the horizon and burning should keep the AP where it is and raise the PE,  which it does,  for a while until the AP suddenly climbs WAY WAY faster than the PE,  resulting in an AP of 600km and a PE of only 100km.    I have tried burning slightly above prograde after passing the AP point,  which works for a few seconds.   Sometimes I can get a descent orbit but most times I end up using all my fuel on raising the PE which takes FOREVER to climb.\n\u003C/p\u003E\n\u003Cp\u003E\nAfter passing the AP on the way up,  the AP SHOOTS up and the PE CRAWLS up.\u003Cbr\u003E\nHow the heck can you make the PE rise faster while keeping the AP close to stable?  I have tried stronger engines and weaker engines.  I\u0027ve tinkered with \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003E\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003E\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E.    Ugghh     No matter what I do,  that AP shoots up while that PE slowly ticks up.   That\u0027s my biggest issue,  along with the loss of control (tumbling and moving the ball entirely).\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt sounds like you\u0027re burning, and your periapsis is getting ahead of you. The best spot to raise your PE is at AP, and you burn straight prograde. If you\u0027re halfway between the two, heading for the AP, you actually need to burn DOWNWARDS (towards the planet) in order to more efficiently raise your periapsis.\n\u003C/p\u003E\n\u003Cp\u003E\nIt sounds, sorry to say, that you\u0027re not really getting the swing of orbital mechanics. They are very counter-intuitive coming out of a flight-sim flight perspective (burning backwards makes you go faster, etc.), and can take a while to get to the point where you\u0027re getting it. My advice is to ignore everything but the map mode and fly by navball, which lets you see what\u0027s happening to your orbit as you burn.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-25T16:34:31Z\u0022 title=\u002206/25/2016 04:34  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 25, 2016\u003C/time\u003E by Stargate525\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Jas0n","CreatedById":57441,"CreatedDateTime":"2016-06-25T16:33:38Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222646935\u0022 data-ipsquote-contentid=\u0022142471\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466871692\u0022 data-ipsquote-userid=\u0022162992\u0022 data-ipsquote-username=\u0022ghost_sox\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 minutes ago, ghost_sox said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nstart tumbling evweywhere on another.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAs for the tumbling out of control, make sure that you have fins to stabilize your rocket and that you\u0027re not pointing too far away from your prograde vector when you\u0027re in the atmosphere.\n\u003C/p\u003E\n"},{"CreatedByName":"kBob","CreatedById":102132,"CreatedDateTime":"2016-06-25T16:35:26Z","Content":"\n\u003Cp\u003E\nWell if you can break your problems down then ask specific question, and again post pictures! you might get even more specific help than the good answers you\u0027ve already had, if you don\u0027t want to play KSP that\u0027s fine but many do successfully, but sure it can be frustrating when it is then it\u0027s time for a break.  To me this is what I wanted Microsoft Space Simulator to be (which despite its detailed help and tutorials was not an easy program: space is complex).  But it really sounds to me like you tried to advance too far too fast before understanding some basic things.  Have you tried starting out with a new career as I suggested?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-25T16:53:42Z\u0022 title=\u002206/25/2016 04:53  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 25, 2016\u003C/time\u003E by kBob\u003C/strong\u003E\n\u003Cbr\u003Emissing words put in\n\u003C/span\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2016-06-25T16:36:49Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222646935\u0022 data-ipsquote-contentid=\u0022142471\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466871692\u0022 data-ipsquote-userid=\u0022162992\u0022 data-ipsquote-username=\u0022ghost_sox\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n12 minutes ago, ghost_sox said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHolding the nose at the horizon and burning should keep the AP where it is and raise the PE\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis is incorrect, and I think reveals misconceptions you have about orbital mechanics.\n\u003C/p\u003E\n\u003Cp\u003E\nThe only way you can not modify your \u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E at all is to burn at it. Burning horizontally relative to the horizon has NOTHING to do with maintaining an Apoapsis. During ascent, you TEND to not raise your Apoapsis MUCH but that is a side effect of you being closer to your Apoapsis than your Periapsis, not due to you burning sideways.\n\u003C/p\u003E\n"},{"CreatedByName":"Dedjal","CreatedById":57220,"CreatedDateTime":"2016-06-25T16:42:50Z","Content":"\n\u003Cp\u003E\n\u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E and pe is not fixed points. They only show you where your highest orbit is (ap) and where your orbit is at its lowest (pe).\n\u003C/p\u003E\n\u003Cp\u003E\nwhen you burn, your orbit changes, so your ap and pe changes too!\n\u003C/p\u003E\n\u003Cp\u003E\nif you burn like mad at ap, eventually the orbit will show that you are now at pe, even though you started your burn at ap! And ap is suddenly waaaaay over there, high in the sky/space.\n\u003C/p\u003E\n\u003Cp\u003E\nit is simple. \u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E and pe only shows you the highest and lowest point of your orbit. So if you break like mad, the point occupied by you, will become the new highest point, and if you burn like mad, your local point will end up being the lowest point in your new orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n Disclaimer, I may be wrong regarding ap being highest and pe being lowest, too lazy to double check.\n\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2016-06-25T16:44:28Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222646935\u0022 data-ipsquote-contentid=\u0022142471\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466871692\u0022 data-ipsquote-userid=\u0022162992\u0022 data-ipsquote-username=\u0022ghost_sox\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n13 minutes ago, ghost_sox said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThis is just plain too hard.   There needs to be a way to tone it down a bit.   I mean,  I am a man of science,  been studying space and astronomy since 6th grade (over 30 years)   and this game makes me feel stupid.   \n\u003C/p\u003E\n\u003Cp\u003E\nI have been playing for about a month and a half.   You\u0027d think I could land on the Mun by now...   Nope,  I haven\u0027t even tried it.  I have only orbited it.   I guess I just plain don\u0027t get it.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nRather than offer specific advice for the troubles you\u0027re experiencing, I\u0027d like to address this.\n\u003C/p\u003E\n\u003Cp\u003E\nI sympathize. I was definitely in the \u0022slow learner\u0022 category when I first picked up KSP, and it took me a long time before I even made orbit, let alone a successful Mun landing. It does get better. And more importantly, the accomplishments along the way are immensely satisfying, exactly \u003Cem\u003Ebecause they are hard\u003C/em\u003E and you had to really work at them.\n\u003C/p\u003E\n\u003Cp\u003E\nKSP is a challenging game, no doubt about it, especially at first. But it is also a uniquely rewarding game, because it doesn\u0027t dumb down the difficult concepts but instead challenges you to figure them out. So my advice would be: Keep trying, use tutorials (whether written or video, whatever works for you), and, most of all, have fun.\n\u003C/p\u003E\n"},{"CreatedByName":"322997am","CreatedById":146422,"CreatedDateTime":"2016-06-25T16:58:59Z","Content":"\n\u003Cp\u003E\nI can recommend a few things that helped me. In the beginning it probably took my about 50 tries to get into orbit. So I can recommend the following:\n\u003C/p\u003E\n\u003Cp\u003E\n1. Start first stage with a few srbs. They will help you get higher and are cheap and can be dropped.\n\u003C/p\u003E\n\u003Cp\u003E\n2. Do not exceed 350 m/s until over 20 kms \n\u003C/p\u003E\n\u003Cp\u003E\n3. Do not give up. When you finally get it, it is worth It.\n\u003C/p\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2016-06-25T17:00:55Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222646693\u0022 data-ipsquote-contentid=\u0022142471\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221466855262\u0022 data-ipsquote-userid=\u0022162992\u0022 data-ipsquote-username=\u0022ghost_sox\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, ghost_sox said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOn one attempt,  I\u0027ll be burning horizonally just fine but the periapsis raises sooo slooooww.    Then the apoapsis begins climbing very fast and next thing I know,  my apoapsis is halfway to Mun while the periapsis is only 65km.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSimple advice: don\u0027t try to make a circular orbit in one go. As soon as apoapsis reaches the desired altitude, kill the engines, coast to AP, and circularise there.\n\u003C/p\u003E\n\u003Cp\u003E\nNot-so-simple advice: watch your time-to-apoapsis (you\u0027ll need an information mod for this), and throttle down to keep it at about one minute during the second half of the ascent. As you\u0027re getting closer to circularizing, throttle down even more so time-to-apoapsis becomes almost zero. You may need to throttle down to almost nothing, and it may take minutes. I suggest you watch in map view what happens to your orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}