{"TopicId":142481,"ForumId":16,"TopicTitle":"How to improve aerodynamics on this monstrosity.","CreatedByName":"Vaporized Steel","CreatedById":108520,"CreatedDateTime":"2016-06-25T15:48:18Z","PageNum":1,"Articles":[{"CreatedByName":"Vaporized Steel","CreatedById":108520,"CreatedDateTime":"2016-06-25T15:48:18Z","Content":"\n\u003Cp\u003E\nIn v1.1.2 I made this. See the picture \u003Ca href=\u0022http://imgur.com/a/YAkTo\u0022 rel=\u0022external nofollow\u0022\u003EAlbum\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cu\u003EThat is my old design, which this one is based on.\u003C/u\u003E\u003Cbr\u003E\nIt can reenter eves atmosphere and glide to the 7500m mountain top, albeit if I reenter close enough to the coordinates.\n\u003C/p\u003E\n\u003Cp\u003E\nThe pics in the album just show the vessel, obviously it doesn\u0027t glide very well, because it has that heatshield attached. But I can\u0027t find the exact pictures anymore. Just try to forget that heatshield is on there and focus on the rest of the design as in how it looks aerodynamically. Without that heatshield that one glides farther then my new design.\n\u003C/p\u003E\n\u003Cp\u003E\nNow I made something similar, that glides just as straight, but a whole lot less far.\n\u003C/p\u003E\n\u003Cp\u003E\nTo test the glideability of the vehicle I hyperedit it 10000m above the runway coordinates and add 400m/s velocity with hyperedit in all my test runs and aim for the runway island to see how far it can glide.\n\u003C/p\u003E\n\u003Cp\u003E\n10000m altitude with the given speed is about the same altitude and speed whereby I know I can detach my inflatable heatshield with a rocket and commence gliding operations. On Eve that altitude will be higher ofcourse.\u003Cbr\u003E\nMy new design can glide from the \u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003E\u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003E\u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003E\u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E coordinates at given speed and altitude through hyperedit exactly to the abandoned island runway strip (which is 33 kilometers)\u003Cbr\u003E\nMy old design in the picture album above did 41 kilometers. (but it was 12 tons heavier, and didn\u0027t had a nosecone that my new design has.\n\u003C/p\u003E\n\u003Cp\u003E\nHere are 2 pictures.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ne2j9Zg.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022569\u0022 src=\u0022http://i.imgur.com/ne2j9Zg.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022d9ZCDkW.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022569\u0022 src=\u0022http://i.imgur.com/d9ZCDkW.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nPicture 1 shows the full vessel.\n\u003C/p\u003E\n\u003Cp\u003E\nPicture 2 shows what lies under that inflatable heatshield. A action group will fire away that heatshield and reveal the nosecone underneath.\u003Cbr\u003E\nOn my old design this was a flat surface.\u003Cbr\u003E\nOn the first picture you can see that I build the main fairing into a bulletshape. My logic that this would push airaway, also reducing aerodynamic load on the fairing below.\n\u003C/p\u003E\n\u003Cp\u003E\nThen I did some tests.\u003Cbr\u003E\nIt seems that fairings do not interact with aerodynamics.\u003Cbr\u003E\nWhen I do a test flight whereby I jettison the lower fairing (the wide one) there is no change to my gliding velocity at all. It\u0027s as if fairings do not induce aerodynamic load at all.\u003Cbr\u003E\nIs this a joke or something, shouldn\u0027t there be interference between my fairing and the air.\u003Cbr\u003E\nIn any way, why could my old design glide further, which to me looked less aerodynamic, and this on glides 7 kilometers short.\u003Cbr\u003E\nThe fun thing is, this design is lighter then my previous design. It did had other wings.\u003Cbr\u003E\nBut I realized I couldn\u0027t use the FAT-455 Aeroplane wings because they would burn up during Eve re-entry. So I needed the BIG-S ones as you can see on the pic.\n\u003C/p\u003E\n\u003Cp\u003E\nThey are angled, but they do have a few more Lift rating when put together then the FAT-455 Aeroplane wings.\u003Cbr\u003E\nAnd since this vehicle is lighter, I would actually need less lift.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat happens is that this vehicle slows down to around 100 m/s up to 45 m/s in between 10000meters up to sea level. A little more slow then my previous design.\u003Cbr\u003E\nWhich means it\u0027s somehow less aerodynamic, even although it looks more aerodynamic.\u003Cbr\u003E\nNow I don\u0027t expect such a monstrosity to glide far, but I would atleast want it to do similar to my old design.\u003Cbr\u003E\u003Cbr\u003E\nAnd my question is, if you can see it (I don\u0027t) why this design glides worse and what I may be able to replicate as I did on my old design to meet the same gliding specifications.\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-25T15:59:42Z\u0022 title=\u002206/25/2016 03:59  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 25, 2016\u003C/time\u003E by Vaporized Steel\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2016-06-25T17:30:26Z","Content":"\n\u003Cp\u003E\nThere has been a bug with struts that make them cause an immense amount of drag. I do not know if it was fixed in ver 1.1.3 -- I haven\u0027t tested it yet. But I see some struts on this ship that you do not have on the other one. So that would be my guess as to where the extra drag is from. Try removing the struts on the wings and see what happens.\n\u003C/p\u003E\n\u003Cp\u003E\n-- I think you can get rid of that giant tail, too. If you fly it properly, you probably don\u0027t need it at all, but a much smaller one would save you a lot of weight and drag.\n\u003C/p\u003E\n\u003Cp\u003E\n-- And if you \u003Cem\u003Ereally\u003C/em\u003E want to improve the aerodynamics, then I\u0027d guess you can probably also toss all those rear stabilizers and replace them with one more set of BigS wings.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-25T17:34:50Z\u0022 title=\u002206/25/2016 05:34  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 25, 2016\u003C/time\u003E by bewing\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Vaporized Steel","CreatedById":108520,"CreatedDateTime":"2016-06-25T17:54:48Z","Content":"\n\u003Cp\u003E\nGood call on the tail. Ill try that. Because of the great drag that causes slow gliding speed I need a whole lot of pitch authority to keep the nose up. Which is why I need that many rear stabalizers. \n\u003C/p\u003E\n\u003Cp\u003E\nReplacing them with more big s wings throws of the lift/mass balance. \n\u003C/p\u003E\n\u003Cp\u003E\nAs for the struts. I didn\u0027t know. Ill try that. Pretty bad that bug exists, I see if I can do with less.\n\u003C/p\u003E\n"},{"CreatedByName":"AeroGav","CreatedById":152027,"CreatedDateTime":"2016-06-25T19:59:01Z","Content":"\n\u003Cp\u003E\nOne area me and BeWing differ is on fins - my belief is that they don\u0027t have much penalty at all, since they are \u0022wings\u0022 (just at a 90 degree angle) and wings only create drag when at an angle relative to airflow - most of the time this should be zero or close to it.   There\u0027s a mass penalty but in the grand scheme of things I wouldn\u0027t personally sacrifice handling qualities for it.  That said,  I\u0027ve not run any empirical tests to prove this,\n\u003C/p\u003E\n\u003Cp\u003E\nWhy are you looking to improve the aerodynamics of this ship?  I\u0027m guessing this is so that it can take off again.\n\u003C/p\u003E\n\u003Cp\u003E\nIn which case you are probably looking at low supersonic drag.\n\u003C/p\u003E\n\u003Cp\u003E\nWing drag is proportional to \u003Cabbr title=\u0022Angle of Attack\u0022\u003EAoA\u003C/abbr\u003E. You can try to minimise by having enough wing area to never have to exceed 5 degrees \u003Cabbr title=\u0022Angle of Attack\u0022\u003EAoA\u003C/abbr\u003E in order to get sufficient lift.  \n\u003C/p\u003E\n\u003Cp\u003E\nBody drag is an exhaustive testing process.   Press ALT F12 to bring up the DEBUG menu  and on the Physics Tab, Aero Submenu, check the box that says display aero data in action menus.  And simply run tests on one part vs another to get the best low drag fuselage.   What I know from the last tests I ran in 1.1.2 is that procedural fairings are about the draggiest possible item you can put on, some nose cones and fuselage diameter adapters are better than others,  but all are better than fairings.  \n\u003C/p\u003E\n\u003Cp\u003E\nRadially attach as few things as possible, keep as much inside service bays as you can.\n\u003C/p\u003E\n\u003Cp\u003E\nA small point, worth a percent or two - at the moment you are holding the nose up  with a combination of canards lifting the front end,  and tailplanes pushing down on the rear.\n\u003C/p\u003E\n\u003Cp\u003E\nThe tailplanes are making negative lift at the cost of drag, which in turn means the wings need to generate extra lift to overcome not only the craft\u0027s weight but the tailplane\u0027s downforce.    If possible, use only canards to raise the nose, the rear wings can be passive lift generators only like BeWing suggested.\n\u003C/p\u003E\n\u003Cp\u003E\nTo be honest the effect is not that large in steady flight, it\u0027s more noticeable in high G manuvers (which this ship isn\u0027t intended for) or at very slow flight near the stall .\n\u003C/p\u003E\n\u003Cp\u003E\nDo make sure that when flying at best gliding speed,  you are not needing excessive control surface deflection to hold the nose up. Like more than 30%.    Control surfaces are like small wings and drag goes up exponentially at large angles.   To keep the angle of deflection down, fit more canards.  It this results in the plane being able to overstress itself and break up at high G, or stall itself too easily at low speed, then right click and lower the control surface authority in the tweakables.    Two canards at 50% authority generate less drag than one at 100% if it\u0027s mostly maxed out.    Obviously make sure this doesn\u0027t move your centre of lift too far forward ofc, you might need to shift the wings back to allow for the extra canards.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, this is where it helps to have a CG that doesn\u0027t move much as the tanks empty that way you can be stable throughout the flight without being excessively nose heavy at any point and suffer with trim drag.\n\u003C/p\u003E\n\u003Cp\u003E\nUnfortunately I\u0027ve never come up with a mk3 design that could manage this and still be able to flow fuel to all its engines without ducts or game mods.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Vaporized Steel","CreatedById":108520,"CreatedDateTime":"2016-06-25T22:33:55Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/152027-aerogav/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022152027\u0022 href=\u0022%7B___base_url___%7D/index.php?/profile/152027-aerogav/\u0022 rel=\u0022external\u0022\u003E@AeroGav\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThere was a issue, with the aerodynamics overlay function. What happened is that the aerodynamic overlay button was represented farther back. At a place near the rear near my control surface area. The problem is that I\u0027m limited at the front to attach more control surfaces. So I could only place them at the rear.\n\u003C/p\u003E\n\u003Cp\u003E\nYou must understand that at this craft there is little ways to attach the wings and make them structural. Especially on the front which is just a cone that fits on the top end of the cargo which is a pointy rocket.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EAerodynamics overlay\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAfter I switched the vehicle from the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E to \u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003E\u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003E\u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003E\u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E I was seeing the center of lift wrong. Ever since I restarted KSP and reload the vehicle back in the \u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003E\u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003E\u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003E\u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E I am seeing it how it actually is. And I didn\u0027t know because I couldn\u0027t see before restarting KSP. This is a bug I guess.\n\u003C/p\u003E\n\u003Cp\u003E\nSince I knew I had to replace more wings forward I attached them as roll Tail fins and the center of lift is now at the right place.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m not sure if you could replicate the bug. It\u0027s probably because of \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E/\u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003E\u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003E\u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003E\u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E switching and that the vehicle is very complex, inside out.\u003Cbr\u003E\u003Cbr\u003E\nNow the issue is also solved that I have to constantly hold S to pull up. reducing drag like you have stated in your comment. I should have expected the \u003Cabbr title=\u0022Center of Lift\u0022\u003E\u003Cabbr title=\u0022Center of Lift\u0022\u003E\u003Cabbr title=\u0022Center of Lift\u0022\u003E\u003Cabbr title=\u0022Center of Lift\u0022\u003ECOL\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E issue, but your willing to believe what the game tells you and look for other answers.\n\u003C/p\u003E\n\u003Cp\u003E\nThe craft now glides 40.5 kilometers instead of 33 in the same Hyperedit test glide. So I\u0027m satisfied.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EEdit: \u003C/strong\u003EAerodynamic overlay changed again. Rare!\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-25T22:41:18Z\u0022 title=\u002206/25/2016 10:41  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 25, 2016\u003C/time\u003E by Vaporized Steel\u003C/strong\u003E\n\u003C/span\u003E\n"}]}