{"TopicId":142478,"ForumId":46,"TopicTitle":"Signature Making","CreatedByName":"Joeybafoey","CreatedById":156273,"CreatedDateTime":"2016-06-25T14:18:34Z","PageNum":1,"Articles":[{"CreatedByName":"Joeybafoey","CreatedById":156273,"CreatedDateTime":"2016-06-25T14:18:34Z","Content":"\n\u003Cp\u003E\nI\u0027m making my signature right now, and I need to know: can you use html, and how do I upload a picture from my computer? There doesn\u0027t seem to be an option for inserting something (that I just spent 10 minutes making) that is on your computer, only \u0022existing attachments\u0022 of which I have none. How do I upload one?\n\u003C/p\u003E\n\u003Cp\u003E\nIt should be noted that I don\u0027t particularly care if I sound like a \u0022noob\u0022.\n\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2016-06-25T14:55:12Z","Content":"\n\u003Cp\u003E\nYou can (kind of) use HTML, and you will need to put your image somewhere you can link to it. I believe Imgur works. Upload it there, and then when you view the page on Imgur with your (full) image on it, right click that image and \u0022copy image location\u0022 or (if that\u0027s not available) open it in a new tab. That new tab will contain the link to the image and not the \u0022imgur page.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nBy \u0022kind of\u0022 with HTML, you can\u0027t enter it directly but you CAN write an HTML page, open it in a web browser, copy the page (not the source) and paste it into your signature. I did this for the table that is in my signature, before remaking it when I got a bit more comfortable with the wonky way the forum implements formatting.\n\u003C/p\u003E\n\u003Cp\u003E\nI suggest trying to make your signature using the tools provided, it\u0027ll make it much easier to modify it later. Resorting to external HTML does work, but IMO it should be a (viable) last resort\n\u003C/p\u003E\n\u003Cp\u003E\nIf you say what you\u0027re trying to do, some of us may be able to help.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-25T14:55:56Z\u0022 title=\u002206/25/2016 02:55  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 25, 2016\u003C/time\u003E by 5thHorseman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"nightingale","CreatedById":119307,"CreatedDateTime":"2016-06-25T15:07:50Z","Content":"\n\u003Cp\u003E\n\u002B1 on the external HTML if you\u0027re trying to make something complex (I just finished redoing my signature using that method last night).  The forum stylesheets will make it look a little bit different than what you see if you just make an HTML and open it manually, so I\u0027d suggest heading over to the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/102569-the-great-forum-test-thread/\u0022 rel=\u0022\u0022\u003Egreat forum test thread\u003C/a\u003E and copy\u002Bpasting it in there to make sure you\u0027re happy with it before you update your sig.\n\u003C/p\u003E\n"}]}