{"TopicId":142822,"ForumId":44,"TopicTitle":"Homemade model rocket fuel","CreatedByName":"sevenperforce","CreatedById":157695,"CreatedDateTime":"2016-06-30T02:24:05Z","PageNum":1,"Articles":[{"CreatedByName":"sevenperforce","CreatedById":157695,"CreatedDateTime":"2016-06-30T02:24:05Z","Content":"\n\u003Cp\u003E\nThinking about making my own rocket motors for hobby rockets. However, my chemistry is not nearly as good as my physics, so I\u0027m a touch uncertain as to what fuel\u002Boxidizer combinations would be best.\n\u003C/p\u003E\n\u003Cp\u003E\nI can get finely powdered potassium nitrate easily enough for the oxidizer. Mixing it with confectioner\u0027s sugar would make classic R-candy. But what about making a paste out of the potassium nitrate and something like mineral oil? Would it not produce a good burn surface? What about a mixture of sugar, mineral oil, and the K nitrate?\n\u003C/p\u003E\n\u003Cp\u003E\nInterested in specific impulse, probable \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E ratios, general safety, and ease of handling.\n\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2016-06-30T09:31:39Z","Content":"\n\u003Cp\u003E\nRocket candy must never ever be made without dissolving the sugar, and I don\u0027t mean melting it (extremely high probability of ignition and the mixture isn\u0027t homogeneous because the salt won\u0027t dissolve in molten sucrose) but dissolving in a solvent that dissolves both it and potassium nitrate. The cheapest solvent that does it is distilled water (avoid tap water because of limescale).\n\u003C/p\u003E\n\u003Cp\u003E\nUsual mixture is sucrose:KNO\u003Csub\u003E3\u003C/sub\u003E=40:60 with a pinch of iron(III) oxide. It simply has to be dissolved in warm water and then evaporated and stirred constantly on a hot plate. When enough water evaporates, the procedure gets dangerous because hotspots can occur. Also, the mixing must not be such that it introduces air bubbles because those will quite possibly cause the engine to explode when the reaction front reaches them.\n\u003C/p\u003E\n\u003Cp\u003E\nThe end result has to be a hot plasticine-like mass that still has some water in it and needs to be either immediately ram-packed into the engine or made into little cylinders and sealed in plastic baggies because it\u0027s deliquescent.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIt takes a lot of practice and the consequences can be disastrous if you don\u0027t know what you\u0027re doing. Always assume it will ignite and take proper measures. Rcandy is very stable and not subjectible to usual dangers but be careful.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-07-01T07:13:13Z\u0022 title=\u002207/01/2016 07:13  AM\u0022 data-short=\u00228 yr\u0022\u003EJuly 1, 2016\u003C/time\u003E by lajoswinkler\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2016-06-30T11:44:02Z","Content":"\n\u003Cp\u003E\nMy first stop on a quest to find performance data on various home-grown fuels would be your national amateur rocketry organization. They will have forums where such things are probably discussed at length.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd who knows, there might just be a subreddit on the topic... \u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/p\u003E\n"}]}