{"TopicId":143012,"ForumId":69,"TopicTitle":"LY-01 and LY-05 landing gear issues.","CreatedByName":"Jakalth","CreatedById":136495,"CreatedDateTime":"2016-07-03T04:36:35Z","PageNum":1,"Articles":[{"CreatedByName":"Jakalth","CreatedById":136495,"CreatedDateTime":"2016-07-03T04:36:35Z","Content":"\n\u003Cp\u003E\nBoth of the early game landing gear have issues that are making early career aircraft nearly impossible to use in 1.1.3 of KSP...  The craft I am trying to fly is only 6 tons and designed for flying observation missions.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe LY-01 landing gear has a severe attachment problem after I attach them to the side of the mk.1 liquid fuel tank(has the same problem with the science jr.) of my tiny early craft.  They initially attach to the craft fine, but if I have to move them slightly using the tool:move, they instantly snap to the opposite side of the fuselage, glitching completely through it.  Any attempts to move them further just causes them to move even further to the opposite side of the fuselage, and move up higher.  This brings the wheels so close together they it completely defeats the purpose of using these landing gear.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe LY-05 steerable landing gear has an odd issue with interactions with the ground and other objects.  About 1 out of 3 times I try to take off, these landing gear clip into the ground, acting like a strong brake, preventing the aircraft from getting up enough speed to take off, and sometimes preventing it from moving all together.  When this happens, the info box for the landing gear says the gear is \u0022blocked\u0022, even though the same gear, when I restart it from launch, have no errors when the landing gear is not \u0022stuck\u0022 in the ground.  This issues just as often happens when trying to land.  The stearable gear sticks into the ground on touchdown, tearing the whole aircraft apart due to the sudden resistance.\n\u003C/p\u003E\n"},{"CreatedByName":"Vaporized Steel","CreatedById":108520,"CreatedDateTime":"2016-07-03T15:39:54Z","Content":"\n\u003Cp\u003E\nGear blocked, stuck? Never got that, but you say it happens after the LY-05 clips into the ground.\n\u003C/p\u003E\n\u003Cp\u003E\nThis is a common problem using early landing gear on lightweight aircraft.\n\u003C/p\u003E\n\u003Cp\u003E\nDampener and spring strength are options when you right click on your landing gear in the \u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003E\u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E\u003C/abbr\u003E. On lightweight aircraft you want to slide both options to max.\n\u003C/p\u003E\n\u003Cp\u003E\nAs for attaching the LY-01.\n\u003C/p\u003E\n\u003Cp\u003E\nI dont think that issue is ly 01 specific. Youll probably run into it since the gear is so small. If you want to move tool any part to far away from its main position theyre likely to clip to one another in symmetry.\n\u003C/p\u003E\n\u003Cp\u003E\nFirst plave the ly 01 as close to the position you can without using move tool. Then finally trim the position with move tool. If that doesnt fix it because the gear is to small to move correctly you should try a bigger landing gear and forget about the ly 01.\n\u003C/p\u003E\n\u003Cp\u003E\nDont forget you can attach them to both the fuselage and the wing. But if you attach to the wing make sure to either strut the gear or place them close together to avoid instability.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-07-03T15:41:43Z\u0022 title=\u002207/03/2016 03:41  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 3, 2016\u003C/time\u003E by Vaporized Steel\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Jakalth","CreatedById":136495,"CreatedDateTime":"2016-07-03T20:17:39Z","Content":"\n\u003Cp\u003E\nI\u0027ll try the dampener and spring option and see if that helps any.  As it stands I can\u0027t even get the plane to take off without flopping about on the runway like a fish, once it gets over 40m/s.  At that point, either the craft kicks to one side and goes into a \u0022slight damage may be acquired\u0022 roll, or one of the LY-01 gear explodes causing the craft to vault into the air and fly.  Either way, the craft is lost since I need to be able to land it for the missions I plan on using it for.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe part snap issue with the LY-01 isn\u0027t the initial placement.  It initially places just fine.  It\u0027s when I have to move it using the move tool.  For example:\n\u003C/p\u003E\n\u003Cp\u003E\n1: landing gear is placed on left side of fuselage with attachment point being on the center left of the fuselage\n\u003C/p\u003E\n\u003Cp\u003E\n2: select move tool\n\u003C/p\u003E\n\u003Cp\u003E\n3: click on ANY of the move arrows\n\u003C/p\u003E\n\u003Cp\u003E\n4: landing gears attachment point instantly switches to the top right of the fuselage so that the gear is mostly inside the fuselage and no longer even reaches the ground.\n\u003C/p\u003E\n\u003Cp\u003E\n5: using move tool to bring it back to where it was only causes it to jump even further to the top right\n\u003C/p\u003E\n\u003Cp\u003E\n6: landing gear has to be removed and placed again to get it to attach properly again.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nas for the LY-05, well, it just seems to have an odd (hitbox?) that doesn\u0027t always seem to recognize where the ground starts.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAs for bigger landing gear...  It\u0027s early in career mode and I don\u0027t have the science to purchase any of the other 4 landing gear.  I can\u0027t get the science without doing these survays since mission control only gives me missions I can not complete this early in the game.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIn case your wondering, I\u0027ve been playing this game for 911 hours and I bought this game over 2 years ago.  So feel free to get a bit technical with your ideas if you think they might help.  I\u0027ll try them out.\n\u003C/p\u003E\n"},{"CreatedByName":"Vaporized Steel","CreatedById":108520,"CreatedDateTime":"2016-07-03T20:32:08Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/136495-jakalth/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022136495\u0022 href=\u0022%7B___base_url___%7D/index.php?/profile/136495-jakalth/\u0022 rel=\u0022external\u0022\u003E@Jakalth\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nYou know, I don\u0027t use the Ly 01 or Ly 05 landing gears very much, although It\u0027s definitely true it needs max spring and dampening in the landing gear options.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, I do get exactly the same problem as you do. Regardless of whether I attach these gears to the fuselage or the wings. That said, I think it is a bug, because even if there is a workaround for this, this shouldn\u0027t happen.\u003Cbr\u003E\nThey completely relocate themselves to a position where they are.......... useless...\n\u003C/p\u003E\n\u003Cp\u003E\nI hope others can confirm this, as a bug, or anything else,\n\u003C/p\u003E\n\u003Cp\u003E\nMaybe you can make sure they can be attached in the proper position without using the Move : Tool option in the \u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003E\u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003E\u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003E\u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003E\u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-07-03T20:34:42Z\u0022 title=\u002207/03/2016 08:34  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 3, 2016\u003C/time\u003E by Vaporized Steel\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Jakalth","CreatedById":136495,"CreatedDateTime":"2016-07-03T22:25:20Z","Content":"\n\u003Cp\u003E\nyeah... if the LY-01 gear are attached correctly, somehow, on the first try, they work just fine.  the rotate tool can be used on them and no issues arise, at all.  So they are safe to rotate at least.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAlso, after some trial, and a lot of having to revert, it seems the LY-05 steerable gear are simply unusable.  At speeds over 10m/s, they go into a self feeding left/right oscillation if any steering input is applied to the craft they are attached to.  Even if the landing gear themselves have their steering disabled.  If the LY-05 is placed on the front of the aircraft, in a tricycle landing gear arrangement, the aircraft will wobble and spin out, or cause the failure of one of the other landing gear, before the craft has even reached take off speed.  But if the LY-05 is used in a tail drager arrangement, the LY-05 in the rear of the craft, then this oscillation goes away.  but, other problem arise..\n\u003C/p\u003E\n\u003Cp\u003E\nI have not found a way to safely land with the LY-05 landing gear on the craft.  Even at speeds as low as 50m/s, with no more then 1.2m/s vertical speed, the LY-05 landing gear is destroyer on touchdown.  Not only is their hitbox bornked, their stability in severe question, and their ability to take even the lightest touchdowns in question, but they also seem to never loose the wheel stress they accumulate as long as they are in contact with the ground.  Yep, tested this next to the runway with a wide wheelbase test vehicle.  As long as the LY-05 land gear are in contact with the ground, then any stresses they feel are added together and the stress never goes down, even if the vehicle is at a full stop.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nTurns out that, other then the move tool bug with the LY-01 land gear, they actually are quite stable.  Using ONLY LY-01 landing gear on an aircraft turns it into a craft that travels down the runway smoothly and is able to safely make slightly bumpy landings in the grass next to the runway at speeds over 70m/s.  But using only LY-01 gear means your aircraft will not be able to turn, at all, unless you have enough \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003Esas\u003C/abbr\u003E authority to force the wheels to slide.\n\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2016-07-05T17:26:03Z","Content":"\n\u003Cp\u003E\nThe fixed gear had to have part of the model removed to prevent some other wheels issues. This has, unfortunately, had the side effect of causing offset gizmo attachment issues.\n\u003C/p\u003E\n\u003Cp\u003E\nIf desired, you can increase the max allowable offset by editing the settings.cfg. There\u0027s an option in there named something like FINE_OFFSET (I forget the exact name offhand) that defaults to 0.2. If you increase that, then you can have a higher amount of offset if you hold SHIFT while dragging the offset handles.\n\u003C/p\u003E\n\u003Cp\u003E\nCheers,\u003Cbr\u003E\n-Claw\n\u003C/p\u003E\n"}]}