{"TopicId":143235,"ForumId":69,"TopicTitle":"KSP unresponsive on save load","CreatedByName":"MSA-S23","CreatedById":164976,"CreatedDateTime":"2016-07-06T18:50:55Z","PageNum":1,"Articles":[{"CreatedByName":"MSA-S23","CreatedById":164976,"CreatedDateTime":"2016-07-06T18:50:55Z","Content":"\n\u003Cp\u003E\nHi,\n\u003C/p\u003E\n\u003Cp\u003E\nI just picked KSP up from the store - I\u0027ve been running the demo for a year now and finally got around to buying the full version - yay! I played around for about 2 hours, testing out the...everything, but then I deleted my tester save and started a career mode game. Unfortunately, it never loaded. The application became unresponsive and I had to force quit it. I have since tried making new saves, starting scenarios, starting lessons. It seems that whenever I start any save of any type, the game kills itself.\n\u003C/p\u003E\n\u003Cp\u003E\nI have no trouble with loading - it goes smoothly and I\u0027m able to use the title screen just fine. I\u0027ve tried uninstalling the game and re-installing the game, nothing changes.\n\u003C/p\u003E\n\u003Cp\u003E\nI bought the game off of the KSP store - I am \u003Cstrong\u003Enot using steam\u003C/strong\u003E, that\u0027s right, I\u0027m \u003Cstrong\u003Enot using steam.\u003C/strong\u003E I don\u0027t run any mods, heavy programs, or other games and my computer has ample RAM, so it\u0027s not that. It\u0027s a game internal thing, because it was working before.\n\u003C/p\u003E\n\u003Cp\u003E\nI run a mid-2014 Macbook Pro running Mac OS X 10.11 with 16 GB of RAM.\n\u003C/p\u003E\n\u003Cp\u003E\nHopefully I can leave the spinny-beachball-of-death behind and actually play KSP!\n\u003C/p\u003E\n\u003Cp\u003E\nCheers,\n\u003C/p\u003E\n\u003Cp\u003E\nMSA-S23\n\u003C/p\u003E\n"},{"CreatedByName":"MSA-S23","CreatedById":164976,"CreatedDateTime":"2016-07-08T02:05:57Z","Content":"\n\u003Cp\u003E\nIt turns out it was a problem with the install - I redownloaded it and it\u0027s now working fine. Thanks a lot! (not meant as a sarcastic comment)\n\u003C/p\u003E\n\u003Cp\u003E\nCheers,\n\u003C/p\u003E\n\u003Cp\u003E\nMSA-S23\n\u003C/p\u003E\n"},{"CreatedByName":"Rocket In My Pocket","CreatedById":154640,"CreatedDateTime":"2016-07-08T11:58:05Z","Content":"\n\u003Cp\u003E\nSounds like a read/write protection issue.\n\u003C/p\u003E\n\u003Cp\u003E\nIf it happens again make sure to check that the KSP folder isn\u0027t set to \u0022read only.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nAlso make sure you are launching the KSP.exe as an Admin. Both of these things can be done from the properties menu via right clicking. Glad to hear it\u0027s working for you now!\n\u003C/p\u003E\n"}]}