{"TopicId":143277,"ForumId":70,"TopicTitle":"Argon/ Lithium battery life?","CreatedByName":"maceemiller","CreatedById":130574,"CreatedDateTime":"2016-07-07T09:54:54Z","PageNum":1,"Articles":[{"CreatedByName":"maceemiller","CreatedById":130574,"CreatedDateTime":"2016-07-07T09:54:54Z","Content":"\n\u003Cp\u003E\nHi all. So Im using \u003Cabbr title=\u0022Real Solar System (mod)\u0022\u003ERSS\u003C/abbr\u003E (not \u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E) and have made a Juno replica. For the first time Im using Near Future Propulsion and NF Solar. I have Lithium and Argon fuel/engines and I know they use a lot of electrical energy but I cant seem to keep the electrical power once the engines have fired. I have a rechargable battery on Juno, 3 big NF solar panels and have even stuck a nuclear reactor on it for testing (yes, Ive turned the reactor on) but whatever I try my electrical energy depletes so fast then I flameout? Any ideas? Thanks \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2016-07-07T14:52:58Z","Content":"\n\u003Cp\u003E\nRealism Overhaul is running a really, really outdated compatibility patch for Near Future engines. You say you are not running the full \u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E suite, but please make sure anyways that there\u0027s nothing unintentionally modifying the engines.\n\u003C/p\u003E\n\u003Cp\u003E\nMeanwhile: all engines list their power usage in the editor. The biggest and thirstiest engines can get as high as 3000 Ec/second. With such an engine, if you had 1000 Ec worth of battery storage, your engine would flame out after a third of a second. That is perfectly normal and expected in such a case. You will need to plan your power production and consumption as you build the ship, and keep in mind that solar panels only produce 4% of their rated output at Jupiter.\n\u003C/p\u003E\n\u003Cp\u003E\nNow, I\u0027m reading between the lines here, but maybe what you are asking isn\u0027t about any of that? Are you maybe asking why your spacecraft loses control after you flame out, and you can\u0027t throttle down anymore? Because that is a thing that happens with probe cores that run out of power: you lose control of the vessel. And if there is an engine running that consumes more power than your spacecraft produces, it will steal all the power that gets produced. The probe core never gets any, and you never get control back, so you can never turn the engine off...\n\u003C/p\u003E\n\u003Cp\u003E\nThis is stock KSP behavior, unfortunately, and has nothing to do with Near Future. It\u0027s just a lot easier to do with a Colossus MPDT than it is with the stock Dawn, due to the much greater power draw.\n\u003C/p\u003E\n\u003Cp\u003E\nThe TL;DR is still the same though: plan your power production and consumption before launch, so you don\u0027t run the risk of running out of Ec. \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Zhetaan","CreatedById":125721,"CreatedDateTime":"2016-07-07T15:46:43Z","Content":"\n\u003Cp\u003E\nHow much battery capacity do you have?  It sounds as though your engines are outstripping your ability to produce power.  Using an NFE reactor to test wouldn\u0027t work very well, either, for the same reason:  NFE reactors are designed to produce steady output for constant electrical loads.  Intermittent loads require the reactors to spool up or down, which takes enough time that they can\u0027t keep up with the demand unless there are electrical reserves.\n\u003C/p\u003E\n\u003Cp\u003E\nTo test it, try a big battery stack instead of a reactor and see whether you can run the engine for a longer time.\n\u003C/p\u003E\n\u003Cp\u003E\nGenerally, the way to design these kinds of missions when using NFE is to acknowledge the fact that you can\u0027t use solar power to run electrical engines directly with anything smaller than blanket arrays, and instead make use of the fact that solar runs constantly but the engines run intermittently.  Batteries have mass, of course, so you have to mind that battery mass in much the same fashion as you do mass fraction for chemical rockets.  You could, for example, put a couple millions of EC in batteries on your craft and run the engines forever--which you will need to do in order for those engines to push it anywhere meaningful.\n\u003C/p\u003E\n\u003Cp\u003E\nThere are several ways to squeeze the most out of batteries while keeping the craft both light and capable.  One is to use (for example) half the batteries, but also to thrust-limit the engine so that it only uses battery capacity at half the rate.  You only get half the thrust, though, so the engine has to run twice as long.  Total savings:  whatever \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E you get from not carrying half the batteries, and the reduced drain rate compared to the solar panel input rate is a better charge ratio.  It might be enough to let the solar panels keep up enough to complete your burn.\n\u003C/p\u003E\n\u003Cp\u003E\nAnother is to use capacitors.  This is one of the intended uses of NFE capacitors; you store charge in them when you have extra power so that you can use it when you need extra power.  Functionally, it\u0027s exactly the same as extra batteries, except that capacitors have a much better charge-mass ratio than batteries do.  Keep in mind that with capacitors, you still need to carry some batteries; the charge needs somewhere to go when you release it.\n\u003C/p\u003E\n\u003Cp\u003E\nYet another is to use blanket solar arrays.  This is heavy-handed and the electric engine equivalent of \u0027moar boostrz!\u0027 but it bears mentioning to illustrate that the problem with running electrical engines is less one of capacity and more one of charge-discharge rate.  With enough panels, you can direct-drive your engines with any battery configuration.\n\u003C/p\u003E\n\u003Cp\u003E\nYou can use RTGs, not to replace the panels, but to supplement them.  Every \u003Cabbr title=\u0022Radio-isotope Thermo-electric Generator (a.k.a. Mars rover heating device)\u0022\u003ERTG\u003C/abbr\u003E is a constant .75 EC/s of charge rate that your panels don\u0027t have to supply (unless you\u0027re using DecayingRTG, as well), at the cost of terrible mass ratio.\n\u003C/p\u003E\n\u003Cp\u003E\nLastly, you can do what Juno did:  use a chemical rocket for orbital insertion and rely on the solar panels to run everything else.\n\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2016-07-07T16:16:31Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222665228\u0022 data-ipsquote-contentid=\u0022143277\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221467906403\u0022 data-ipsquote-userid=\u0022125721\u0022 data-ipsquote-username=\u0022Zhetaan\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n29 minutes ago, Zhetaan said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNFE reactors are designed to produce steady output for constant electrical loads.  Intermittent loads require the reactors to spool up or down, which takes enough time that they can\u0027t keep up with the demand unless there are electrical reserves.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWas true in the past, is no longer true these days \u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E You can use the power slider to instantly change output.\n\u003C/p\u003E\n"},{"CreatedByName":"Zhetaan","CreatedById":125721,"CreatedDateTime":"2016-07-07T17:53:41Z","Content":"\n\u003Cp\u003E\n\u003Cspan\u003E\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/98962-streetwind/\u0026amp;do=hovercard\u0022 data-mentionid=\u002298962\u0022 href=\u0022%7B___base_url___%7D/index.php?/profile/98962-streetwind/\u0022 rel=\u0022external\u0022\u003E@Streetwind\u003C/a\u003E:\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nOn seeing your signature, I suppose you would have the last word.  It\u0027s been some time since I was last able to run NF Tech (though I have it now; I just haven\u0027t run any of the big electric engines yet).\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-07-07T18:00:20Z\u0022 title=\u002207/07/2016 06:00  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 7, 2016\u003C/time\u003E by Zhetaan\u003C/strong\u003E\n\u003C/span\u003E\n"}]}