{"TopicId":143754,"ForumId":20,"TopicTitle":"Spaceplane Guys","CreatedByName":"grant977","CreatedById":133596,"CreatedDateTime":"2016-07-13T23:57:30Z","PageNum":1,"Articles":[{"CreatedByName":"grant977","CreatedById":133596,"CreatedDateTime":"2016-07-13T23:57:30Z","Content":"\n\u003Cp\u003E\nWhat are you guys using for landing gear? I am trying to do a sandbox with one rule you must fly back from space but I need good landing gear.\n\u003C/p\u003E\n"},{"CreatedByName":"Gaarst","CreatedById":126740,"CreatedDateTime":"2016-07-14T00:03:42Z","Content":"\n\u003Cp\u003E\n1.1 is not the version for spaceplanes... or planes... or anything that has wheels really. The wheels colliders (or whatever describes their behaviour) are broken, and will not be fixed before 1.2 as that requires a Unity update.\n\u003C/p\u003E\n\u003Cp\u003E\nNow there are probably some neat landing gears out there (you might need to give more information about what you are searching for) but know that some unexpected behaviours are expected.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEdit: might be sensible to add that even though wheels are broken, you might do perfectly well with some designs, so don\u0027t let that put you off from (at least) trying.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-07-14T00:05:47Z\u0022 title=\u002207/14/2016 12:05  AM\u0022 data-short=\u00227 yr\u0022\u003EJuly 14, 2016\u003C/time\u003E by Gaarst\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Jimbo Jangles","CreatedById":165798,"CreatedDateTime":"2016-07-14T02:05:27Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222675018\u0022 data-ipsquote-contentid=\u0022143754\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221468454622\u0022 data-ipsquote-userid=\u0022126740\u0022 data-ipsquote-username=\u0022Gaarst\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Gaarst said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n...know that some unexpected behaviours are expected.\n\u003C/p\u003E\n\u003Cp\u003E\nEdit: might be sensible to add that even though wheels are broken, you might do perfectly well with some designs, so don\u0027t let that put you off from (at least) trying.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nGood advice on both counts. Do give it a try with the stock gear. I usually have more trouble taking off than landing. A lot of people are saying to use bigger gear than the stress tolerance data indicates, but I\u0027ve found that using gear with 2/1 or greater stress tolerance/ship mass ratio is usually a bad idea in terms of stability on landing.\n\u003C/p\u003E\n\u003Cp\u003E\nI get a lot more bouncing and swerving when my gear aren\u0027t at least a little flattened out, and not from adjusting the springs lower either. I try to dial in the total gear tolerances to be slightly, maybe 10-20% over the weight of the plane. Obviously there is no tweakable setting for stress tolerance.\n\u003C/p\u003E\n\u003Cp\u003E\nI will mix and match from small to large (rarely extra large) retractable gears, varying the total number, placement, and friction settings to get a good match. The key reason I try to get it that close is that a 30t spaceplane might only mass 5-10t on landing. \n\u003C/p\u003E\n\u003Cp\u003E\nHope that helps! \n\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2016-07-14T02:13:34Z","Content":"\n\u003Cp\u003E\nOnce some progress is made on fixing the landing gear and the mod gets updated, you will definitely want to look at \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/89874-105-adjustable-landing-gear-v120-masscost-scaling-tech-nodes-drag-may-30/\u0022 rel=\u0022\u0022\u003EAdjustable Landing Gear\u003C/a\u003E.  It\u0027s just between a rock and a hard place because of the bugs in 1.1.\n\u003C/p\u003E\n\u003Cp\u003E\nHonestly, I\u0027d say try the stock gear and when it begins to frustrate you to no end that you can\u0027t find a good mounting spot for them so that they are wide enough not to flip the plane and level enough to not to hold the plane correctly and straight enough to not have the wheels crooked (this will inevitably happen if you like to build a variety of designs), then it\u0027s time for Adjustable Landing Gear.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-07-14T02:15:09Z\u0022 title=\u002207/14/2016 02:15  AM\u0022 data-short=\u00227 yr\u0022\u003EJuly 14, 2016\u003C/time\u003E by Alshain\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Van Disaster","CreatedById":58876,"CreatedDateTime":"2016-07-14T12:38:12Z","Content":"\n\u003Cp\u003E\nBaha is on indefinite leave due to life so I\u0027d not hold your breath for ALG - the dll source is there but not the model source. Never know, something similar might end up stock in 1.2.\n\u003C/p\u003E\n\u003Cp\u003E\nUntil then I\u0027m making stock wheels work - unless I have a particularily stable craft I use parachute brakes. Realchute can be set up to autodeploy on touchdown.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-07-14T13:51:24Z\u0022 title=\u002207/14/2016 01:51  PM\u0022 data-short=\u00227 yr\u0022\u003EJuly 14, 2016\u003C/time\u003E by Van Disaster\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"grant977","CreatedById":133596,"CreatedDateTime":"2016-07-14T22:34:59Z","Content":"\n\u003Cp\u003E\nI mainly and trying to make landing only space planes like shuttle for now. I miss adjustable gear badly. I guess its try and make stock work for now.\n\u003C/p\u003E\n"}]}