{"TopicId":144115,"ForumId":51,"TopicTitle":"Duna: The final destination!","CreatedByName":"Dogenutt","CreatedById":151770,"CreatedDateTime":"2016-07-19T05:16:58Z","PageNum":1,"Articles":[{"CreatedByName":"Dogenutt","CreatedById":151770,"CreatedDateTime":"2016-07-19T05:16:58Z","Content":"\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cstrong\u003EDuna\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nDuna: The final destination for Doge Space Agency, well known for proposing their ideas of laying foundations for large scale colonization.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nRecently in the year 1998, DSA have finally managed to land on Duna with a unmanned probe. Duna III the third of the Duna series. Duna I was a sateillite that sucessly went into orbit with duna in 1978 and then the infamous Duna II was a manned mission to land on Duna and back to kerbin, But however due to limitations with the technology at the time Duna II was cancelled and scrapped. Duna III now in the 90s the technology required for landing on Duna was now available... Altough the first 7 attempts to land the lander were failures ether missing the landing, missing Duna entirely, or worst case scenario crash landing; But after the 7 attempts the 8th one proved to be sucessful landing the north pole on Duna and collected a great amount of data from the north pole!\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022hvmcyeO.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/hvmcyeO.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nThe Duna III lander weighing at a 3.8 tons!\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nCurrently there is a planned mission in the works for a manned mission to land on Duna and back to kerbin! The same idea as the scrapped Duna II mission but with a chance to succeed! The current ETA for the mission is around 2018 due to other projects.\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n(Notice this is still is a work in progress meaning that engineers are trying figure how the vending machine works while uploading the results to this mysterious website)\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nSo more to come soon? And when? Whenever the next mission is completed which is [INSERT DATE AND NUMBER].\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n(And yes this is my first time landing on duna \\o/)\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-07-19T05:17:44Z\u0022 title=\u002207/19/2016 05:17  AM\u0022 data-short=\u00227 yr\u0022\u003EJuly 19, 2016\u003C/time\u003E by Dogenutt\u003C/strong\u003E\n\u003C/span\u003E\n"}]}