{"TopicId":144254,"ForumId":81,"TopicTitle":"Space planes don\u0026#039;t seem to work on XBO","CreatedByName":"danowat","CreatedById":166732,"CreatedDateTime":"2016-07-21T08:09:23Z","PageNum":1,"Articles":[{"CreatedByName":"danowat","CreatedById":166732,"CreatedDateTime":"2016-07-21T08:09:23Z","Content":"\n\u003Cp\u003E\nAnyone managed to get space planes working?, they either just explode immediately on loading, just sit there bouncing up and down until they explode, or manage a take off, start bouncing on the gear and explode.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve tried numerous designs that work on the PC version.\n\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2016-07-21T13:01:33Z","Content":"\n\u003Cp\u003E\nLots of PC players have trouble too, it\u0027s mainly down to the wheels. Circumvent the issue by trying a \u003Cabbr title=\u0022Vertical Take-Off and Landing\u0022\u003EVTOL\u003C/abbr\u003E?\n\u003C/p\u003E\n"},{"CreatedByName":"WD2501","CreatedById":166730,"CreatedDateTime":"2016-07-22T06:44:48Z","Content":"\n\u003Cp\u003E\nI\u0027ve gotten planes to work, just haven\u0027t been able to get to space with them yet. Not a bug preventing me from getting to space, just my designs. Yaw and roll controls are fine, but I need to work on pitch controls, secondary engines, a control group for switching engine types, fuel balance ( for primary and secondary engines) and not burning up on atmospheric exit. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI take my time placing wheels and adjust if necessary, and fight the turning during takeoff.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nPossible workarounds, \u003Cabbr title=\u0022Vertical Take-Off and Landing\u0022\u003EVTOL\u003C/abbr\u003E or move plane to top of hanger, add boosters and launch supports. Or make a space plane with a rocket assisted launch from the launchpad in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E.\n\u003C/p\u003E\n"},{"CreatedByName":"danowat","CreatedById":166732,"CreatedDateTime":"2016-07-22T07:58:07Z","Content":"\n\u003Cp\u003E\nRight, I made a very simple bush plane tail dragger with straight wings, and it was fine.\n\u003C/p\u003E\n\u003Cp\u003E\nThere seems to be an issue with the centre of aerodynamic lift on swept wings (straight ones seem fine) can anyone with the latest PC version show the centre of aero on a very simple, plain, fuselage with just the swept wings in place?\n\u003C/p\u003E\n"},{"CreatedByName":"sPeaRr","CreatedById":166600,"CreatedDateTime":"2016-07-23T11:55:57Z","Content":"\n\u003Cp\u003E\nCenter of lift just behind and slightly above the center or mass with the rear landing gear right between then two and your plane will fly.  The wheels have to be pointed straight down (no angle) or you will dog shake your wings off.\n\u003C/p\u003E\n"},{"CreatedByName":"DaCana","CreatedById":166743,"CreatedDateTime":"2016-07-23T14:36:51Z","Content":"\n\u003Cp\u003E\nwhen i had this issue on PC, plane With weels keep shaking on the runway, if i havent totaly forgotten, i think i had just put the weels the wrong way, as in going backwards. Havent buildt planes yet on xb1, but it might atleast be Worth trying out, if you have not already.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-07-23T14:37:17Z\u0022 title=\u002207/23/2016 02:37  PM\u0022 data-short=\u00227 yr\u0022\u003EJuly 23, 2016\u003C/time\u003E by DaCana\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"erikinthebakery","CreatedById":166663,"CreatedDateTime":"2016-07-25T22:51:49Z","Content":"\n\u003Cp\u003E\nI\u0027ve been able to get planes into the air using a combination of a rocket engine and some of the starter jet engines. I have had some instances where there is an odd explosion well in front of my plane on takeoff and then the whole thing blows up.\n\u003C/p\u003E\n\u003Cp\u003E\nMostly now I am launching planes as rockets (because I haven\u0027t upgraded my Spaceplane Hanger yet) ;-)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2016-07-26T22:15:39Z","Content":"\n\u003Cp\u003E\nThe Aeris4A works, though I seem to lose a wheel every time I launch, so I add a few parachutes for the \u0027landing\u0027.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m too used to building on the PC to get on with the console \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E/\u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E so far, so have not tried a custom spaceplane.\n\u003C/p\u003E\n"}]}