{"TopicId":144265,"ForumId":70,"TopicTitle":"Save files randomly delete ships","CreatedByName":"Artheus","CreatedById":162290,"CreatedDateTime":"2016-07-21T12:38:43Z","PageNum":1,"Articles":[{"CreatedByName":"Artheus","CreatedById":162290,"CreatedDateTime":"2016-07-21T12:38:43Z","Content":"\n\u003Cp\u003E\nHello everyone!\n\u003C/p\u003E\n\u003Cp\u003E\nAs the title already says, in my modded main install are frequently ships going missing (at least 4 by now, 3 of them interplanetary) . I did not remove any modpacks required for them. The Victims are manned, unmanned, modded or stock. It even happened when I did not have anymods installed but \u003Cabbr title=\u0022Kerbal Alarm Clock (mod)\u0022\u003EKAC\u003C/abbr\u003E and graphical ones. For saving before closing the game, I use the Save button on the escape menu in the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E view. I tried manually editing the ships from previous saves where they still existed in, but failed and nothing happened.\n\u003C/p\u003E\n\u003Cp\u003E\nI also can\u0027t load previous save files from the escape menu, as the game crashes when I try to do so. When I have set up an alarm for that vessel and it dissapears, \u003Cabbr title=\u0022Kerbal Alarm Clock (mod)\u0022\u003EKAC\u003C/abbr\u003E states \u0022vesselID not found\u0022. It seems to be a variation of the nullspace/hell kraken, as when I have last switched to a vessel that went to the grave some saves later, the altidude meter changed to white, speed went to NaN, black main screen. The only way to fix it was alt-f4 to save the vessel, but it also happens when I do not switch to the vessel before, it can randomly dissappear at any time as I feel. Does anyone know a trick to edit the save mechanic to prevent this or some other tips? It really bugs me out, lost the Eeloo rover, a manned moho mission,  the 1.000.000 funds refueling station in Kerbin orbit and a contract kerbol refueling station with duna landers on it already.\n\u003C/p\u003E\n"}]}