{"TopicId":144443,"ForumId":20,"TopicTitle":"Advanced Science Mod Idea","CreatedByName":"Leslie110501","CreatedById":166969,"CreatedDateTime":"2016-07-24T10:57:43Z","PageNum":1,"Articles":[{"CreatedByName":"Leslie110501","CreatedById":166969,"CreatedDateTime":"2016-07-24T10:57:43Z","Content":"\n\u003Cp\u003E\nSo basicly I know how to basicly code in Lua and Java. But thats it. I would love to learn more but it\u0027s kinda hard. Well anyways that\u0027s why I can\u0027t code a mod myself.\n\u003C/p\u003E\n\u003Cp\u003E\nI had the idea of revolutionizing science. So heres my Idea, step by step, I hope that some mod developer picks up my Idea and creates such mod \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12px;\u0022\u003ESo there would be different kinds of science. For example Atmospheric(maybe also specificly for different things in the atmosphere like Oxygen and Hydron or other stuff), Ground(Again, maybe different materials and even mod support, so for example Karbonite), Space, Magnetosphere, etc.\u003C/span\u003E Then you would need to completely remove the tech tree(you could also just integrate it into the tech tree but that wouldn\u0027t work as good maybe) and add a Menu where you have all Parts but split up into categories kinda like the current tech tree: Small \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003E\u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003E\u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003E\u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E\u0027s, Small Science(Maybe more creative names), etc. and you need to unlock the group first. Then you can simply unlock these parts in the group. Now, to unlock different parts you need the different types of science. For example if you have a mod where you can freeze kerbals or store hydrogen into tanks which need to be cooled(yes, thats a refference), then you need \u0022Freeze Science\u0022 or maybe \u0022Cold Science\u0022 and you can only get it from cold places. On the cold poles on kerbin for example you only get smaller amounts not suitable for unlocking big things. But when you go to Eeloo, then you get waaaaaay more cold science because eeloo is freezingly cold. Then if you want to unlock a Hydrogen Tank with a cooling system integrated, you need to have, I don\u0027t know, maybe 200 Cold science, 100 Hydrogen Science and Some \u0022Basic Science\u0022 which you can find everywhere. This basic science is something you also get. Its for stuff like the hull of the tank. Maybe if thats not fitting my idea, you could also just make a material science  or even especially metal science. Now you would also need a ton of new science equipment. Liquid analyser for liquid science, Atmospheric Data for Hydrogen, Oxygen and maybe even Nitrogen, if necessary, A Telescope for Visual Science an so on.\n\u003C/p\u003E\n\u003Cp\u003E\nSo yeah, that was swirling around in my head for ages and now I have finally signed up and posted my idea. I hope you like it. Have a nice day \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nEDIT: I would design this mod kind of like the Interstellar mod with the reactors and warp drives etc. It looks really cool in my opinion.\n\u003C/p\u003E\n"}]}