{"TopicId":145294,"ForumId":29,"TopicTitle":"Orbit Pack Distance - why so small and can I enlarge it without invoking the kraken?","CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2016-08-03T07:45:43Z","PageNum":1,"Articles":[{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2016-08-03T07:45:43Z","Content":"\n\u003Cp\u003E\nI noticed the following is the default setting for distances while in orbit.  I was trying to debug why kOS docking scripts were having such trouble controlling the non-active vessel and realized it happened when the vessel got a short distance away but was still visible and loaded and decided to print out these values:\n\u003C/p\u003E\n\u003Cpre class=\u0022ipsCode prettyprint lang-html prettyprinted\u0022\u003E\n\u003Cspan class=\u0022pln\u0022\u003EPhysicsGlobals.Instance.VesselRangesDefault.orbit.load   : 2250m\nPhysicsGlobals.Instance.VesselRangesDefault.orbit.unload : 2500m\nPhysicsGlobals.Instance.VesselRangesDefault.orbit.pack   : 350m\nPhysicsGlobals.Instance.VesselRangesDefault.orbit.unpack : 200m\u003C/span\u003E\u003C/pre\u003E\n\u003Cp\u003E\nDoes anyone know why the pack/unpack distances are so drastically small \u003Cem\u003Efor orbit \u003C/em\u003Ecompared to the load/unload distances?  I think I might understand the need for it with vessels landed on the ground, because as the active vessel moves away from a landed vessel, the ground terrain mesh might become more coarse, invoking Kraken-riffic intersections between vessel and the re-positioned ground polygons.\n\u003C/p\u003E\n\u003Cp\u003E\nBut the pack/unpack distances are *also* very small for ships drifting in orbit, where presumably it\u0027s not so bad, and I assume even with single-precision floats you still don\u0027t get the Kraken at a mere 350 meters away.\n\u003C/p\u003E\n\u003Cp\u003E\nIs there a really good reason for the value to be that small, and am I inviting disaster if I set it higher?  I\u0027m not talking about setting it super high - just making it closer to the load/unload distances so people can presume \u0022if I can see the vessel on screen and it\u0027s not just a single dot, that means the vessel is fully functional.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"nathan1","CreatedById":144486,"CreatedDateTime":"2016-08-24T18:39:56Z","Content":"\n\u003Cp\u003E\nThis is a bit of a late reply, but I\u0027m pretty sure BDArmory increases those values. I\u0027ve made my own mini-mod that increases them to about 3km and I haven\u0027t noticed any problems with it.\n\u003C/p\u003E\n"}]}