{"TopicId":145686,"ForumId":66,"TopicTitle":"Devnote Tuesday: I ain\u0026#039;t getting on no plane!","CreatedByName":"SQUAD","CreatedById":66485,"CreatedDateTime":"2016-08-09T23:07:21Z","PageNum":5,"Articles":[{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2016-08-11T09:10:23Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222712451\u0022 data-ipsquote-contentid=\u0022145686\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221470864027\u0022 data-ipsquote-userid=\u002261954\u0022 data-ipsquote-username=\u0022Majorjim!\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 hours ago, Majorjim! said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nRiight I see, you can mark a spot on the surface without a part being there. Got ya. Thanks for the explanation.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNot only that, but from the look of it it\u0027s the same as for \u0022explore at coordinates x,y\u0022 contracts; that is, you can set it as target and get it\u0027s heading on your navball.\n\u003C/p\u003E\n"},{"CreatedByName":"Icemanau","CreatedById":145438,"CreatedDateTime":"2016-08-11T10:56:42Z","Content":"\n\u003Cp\u003E\nI have yet to hear of an autopilot that has the ability to reset things in the physical world or be able to think creatively in an emergency...\n\u003C/p\u003E\n\u003Cp\u003E\nYou know, things like those pesky circuit breakers that control the power going to the autopilot or switches that are required to be manually operated for safety reasons. The autopilot was designed to do one thing and one thing only, that one thing is to fly the plane/spacecraft along a predetermined path to the destination at the designated speed.\n\u003C/p\u003E\n\u003Cp\u003E\nIt can\u0027t think that \u0022Oh the engine is one fire, I have to land at the nearest airport\u0022 or \u0022that storm is looking rather severe, I will have to change course to go around it\u0022. That is why we still have pilots in this day and age, to deal with the unexpected and emergency situations. It also allows the pilot to relax and do other things while in the air rather than concentrating on flying the aircraft 100% of the time they are in the air. After all, you just can\u0027t pull over to take a leak or get a snack while in the air. They also can\u0027t deal Take Offs and Landings, they are still the performed by the pilot due to the number of decisions to be made during each task. A pilot can feel an unusual vibration that an autopilot doesn\u0027t and can abort the take off or landing, or can see something on the runway further ahead than the best sensors can pick up with any sort of clarity at the speeds they are going at.\n\u003C/p\u003E\n\u003Cp\u003E\nIf they ever build an airliner without provision for manual flight control via a pilot, I guarantee that I will never fly on it and will do my best to convince family and friends not to either.\n\u003C/p\u003E\n\u003Cp\u003E\nAs for the Autonomous cars, they still require a person sitting in the drivers seat with their hands on the wheel at all times. In an emergency, the driver is still expected to take control and deal with said emergency. The emergency could be any number of things that crop up in day to day driving, like a kid or animal running out in front of the car, a flat tyre or the bridge/road collapsing in front of the car.\n\u003C/p\u003E\n\u003Cp\u003E\nSame with the autopilots on ships, they still require a helmsman ON DUTY at all times while the ship is under way. Again, it is to deal with the unexpected and emergencies.\n\u003C/p\u003E\n\u003Cp\u003E\nAs for changing a wheel on any of the Mars rovers, do you know how to remove/install bearings, remove a motor from it\u0027s housing and pull any drive gear from it\u0027s shaft?\n\u003C/p\u003E\n\u003Cp\u003E\nThat\u0027s the sort of construction used on the wheels of the Mars rovers. Not a simple set of nuts which will allow the wheel to be easily pulled off. They are generally fitted directly to the individual motor shafts and require some serious hardware to remove in a decent amount of time. Most of the wheel failure on the Mars rovers are due to dust getting into the sealed bearings and damaging the bearings to the point that they jam. Not a 10 minute job with a lug wrench to fix. Then again, there wouldn\u0027t be much call to change a tyre on a rover as very few of them have pneumatic tyres.\n\u003C/p\u003E\n\u003Cp\u003E\nMost probes are designed to be as rugged as possible which negates the \u0027Ease of repair\u0027 philosophy used in the commercial transport industry especially for items like wheels with pneumatic tyres.\n\u003C/p\u003E\n\u003Cp\u003E\nRegards\n\u003C/p\u003E\n"},{"CreatedByName":"Broco","CreatedById":4320,"CreatedDateTime":"2016-08-11T12:02:35Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222711251\u0022 data-ipsquote-contentid=\u0022145686\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221470784041\u0022 data-ipsquote-userid=\u002266485\u0022 data-ipsquote-username=\u0022SQUAD\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 10.8.2016 at 1:07 AM, SQUAD said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nKerbnet is essentially software that will reside on all probe cores\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI just wet myself a little, especially that they are available everywhere. This is exactly what I needed for my \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E landing. Because of my graphic mods I couldn\u0027t see the surface from space because of clouds and I missed some great landing sites (making my landing harder than it needed to be). This is basically one of the key features I missed in KSP, thank you so much guys.\n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2016-08-11T13:21:32Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222712491\u0022 data-ipsquote-contentid=\u0022145686\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221470865383\u0022 data-ipsquote-userid=\u002269507\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n16 hours ago, Geschosskopf said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNo, that\u0027s not how it works.  The dreadful class system functions the same way in all types of game.  The only difference with sandbox is, all Kerbals start with 5 starts. But still only pilots can use \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003E\u003Cabbr title=\u0022Stability Augmentation System\u0022\u003E\u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E, still only scientists can reset Goo, and still only engineers can fix flats.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nUnless we\u0027re playing a different game (not being funny here; I do have a ton of mods), in sandbox and science modes all Kerbals can fix tyres and use \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003E\u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E\u003C/abbr\u003E. Plus all probe cores have full \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003E\u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E\u003C/abbr\u003E. Otherwise it is the same as career though.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-08-11T14:42:51Z\u0022 title=\u002208/11/2016 02:42  PM\u0022 data-short=\u00227 yr\u0022\u003EAugust 11, 2016\u003C/time\u003E by Guest\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Terwin","CreatedById":139655,"CreatedDateTime":"2016-08-11T14:09:22Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222712491\u0022 data-ipsquote-contentid=\u0022145686\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221470865383\u0022 data-ipsquote-userid=\u002269507\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n16 hours ago, Geschosskopf said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNope.  Pilots are trained to turn \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003E\u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E\u003C/abbr\u003E off and on.  Period.  The other Kerbals can do everything else.  Or at least they can now, before this horrible, terrible idea of allowing pilots to monopolize even more flight controls comes out in the next update.  This is NOT making pilots more useful, it\u0027s making them into even more parasitic ballast than they already are.\n\u003C/p\u003E\n\u003Cp\u003E\nYou do know why we\u0027re moving to autonomous cars, right?  And why airlines and trains and even ships are on autopilot nearly all the time, right?  It\u0027s because machines control vehicles much better than people do.  The Skylon doesn\u0027t even have a cockpit.  The whole idea of pilots being a vital part of a space program is decidedly obsolete.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nUnless you have a probe core, \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E *IS* the pilot taking control and doing what you asked instead of you being in direct control.\n\u003C/p\u003E\n\u003Cp\u003E\nAutopilot is *great* for a pre-defined path with a limited number of unknowns and the ability to call upon a human if things go wrong.\n\u003C/p\u003E\n\u003Cp\u003E\n In general, exploration is not a place where you have limited unknowns and a well-defined path.  \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n16 hours ago, Geschosskopf said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNope, I don\u0027t.  They are a new-fangled invention contemporary with the introduction of the class system, in a poorly conceived attempt to give pilots some reason to exist as a class.  I learned to play KSP without them.  Besides, the point-to-whatever system is so poorly implemented that you still have to point the ship that way yourself.  If you try to let it point the ship there itself, it overshoots by a mile, reverses, overshioots by 3/4 mile, repeat for 5 minutes, so takes forever to settle down, assuming this happens before you run out of \u003Cabbr title=\u0022Reaction Control System\u0022\u003E\u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E\u003C/abbr\u003E.  Now, the system has improved slightly on this over time, and I hear more improvements are coming.  But the system is unnecessary to start with, and doesn\u0027t work anyway, so it\u0027s just a waste of system resources.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI find them to be quite useful, but if you never take advantage of any of the benefits of having a pilot on board, I can see why you do not care for them.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n16 hours ago, Geschosskopf said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNo, that\u0027s not how it works.  The dreadful class system functions the same way in all types of game.  The only difference with sandbox is, all Kerbals start with 5 starts.  But still only pilots can use \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003E\u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E\u003C/abbr\u003E, still only scientists can reset Goo, and still only engineers can fix flats.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHave you actually tried it?  Last time I checked, all Kerbals in my sandbox game had the 5 star abilities of every class.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd according to \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/162845-string-witch/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022162845\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/162845-string-witch/\u0022 rel=\u0022\u0022\u003E@String Witch\u003C/a\u003E this is the same in Science mode(I have not used science mode much).\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n16 hours ago, Geschosskopf said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAnd you know what?  The thing I hate the most about the whole class system is that you can\u0027t totally mod it out of existence, nor create your own classes, or omnipotent Kerbals.  Have you ever looked at the Traits.cfg file?  It defines class names, which have various skills associated with them.  So you think, no problem, I\u0027ll just give all Kerbals all the skills.  But sadly it doesn\u0027t work that way.  Some things in the game, such as resetting Goo or using \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003E\u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E\u003C/abbr\u003E to build stuff, key off the class name instead of the presence or absence of a skill.  Why?\n\u003C/p\u003E\n\u003Cp\u003E\nIf things changed so that class name was NOT used to decide which Kerbal could do what, but instead the check was for applicable skill, then I\u0027d find the existing class system more tolerable, because I could effectively eliminate it.  Or modify it as I saw fit.  So rather than making a bad system even worse with the changes to pilot skills, just make the system fully moddable so everybody can be happy.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSo, try science mode or sandbox, those have no cost for hiring Kerbals and they are all omni-capable.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222712571\u0022 data-ipsquote-contentid=\u0022145686\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221470868087\u0022 data-ipsquote-userid=\u0022151611\u0022 data-ipsquote-username=\u0022Waxing_Kibbous\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n15 hours ago, Waxing_Kibbous said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAm I the only one who likes Kerbal classes? It\u0027s an interesting logistical challenge that adds a bit more challenge. Admittedly I use the field experience mod- allowing Kerbals to level up while on a mission seems to me to be a good next step- one way to make it work is to only allow Kerbals that are in a vessel that is connected to \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u003C/abbr\u003E via the new comm network to level up.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI quite like the class system myself.\n\u003C/p\u003E\n"},{"CreatedByName":"Jovus","CreatedById":117163,"CreatedDateTime":"2016-08-11T14:16:27Z","Content":"\n\u003Cp\u003E\nI must be weird, but if we\u0027re talking about systems that we don\u0027t like and wish were changed/overhauled/completely rethought, the class system isn\u0027t top of my list. Top of my list is the contract system.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI want it gone, and in its place some kind of funding management where we promise goals and are rated on the completion of those goals. Where we\u0027re still limited by funds, but we don\u0027t have to go do inane things we don\u0027t want to and we aren\u0027t penalized for doing things we do want to.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n(Then the class system.)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBut before all of that, these optimization and bugfixing passes. Ultimately, if none of the above ever gets addressed, and KSP runs like a dream, I\u0027ll be happy.\n\u003C/p\u003E\n"},{"CreatedByName":"Jovus","CreatedById":117163,"CreatedDateTime":"2016-08-11T16:31:33Z","Content":"\n\u003Cp\u003E\nActually, to build on that...\n\u003C/p\u003E\n\u003Cp\u003E\nThat\u0027s one of the things that might (properly managed) make multiplayer really fun rather than just KSP with a chat system attached. You bid for \u0027contracts\u0027 - by which I mean not the current system, but something more like winning a DoD contract of \u0027develop a new launcher\u0027 or \u0027go to the Mun\u0027 or \u0027set up a Minmus base capable of XYZ and its support satellites\u0027. The contract has a rough guideline of how much the offering agency is willing to spend; whoever puts in the lowest bid gets the contract. Penalties for failing to provide according to the terms of the contract in the time provided are severe. Reputation is a factor as well; some agencies are willing to accept a somewhat-higher bid in order to go with a space program with a higher reputation.\n\u003C/p\u003E\n\u003Cp\u003E\nFailure of a contract involves both financial and reputational penalties.\n\u003C/p\u003E\n\u003Cp\u003E\nIn single-player, the competition would probably be stripped out, with perhaps agencies offering less to start with to compensate for the downward pressure of multiplayer competition. Or not.\n\u003C/p\u003E\n\u003Cp\u003E\nAll of this is a very rough idea and would need a lot of fleshing out before I\u0027d say \u0027this is a good thing\u0027, but the idea intrigues me.\n\u003C/p\u003E\n\u003Cp\u003E\nThen again, it\u0027s pretty off-topic here.\n\u003C/p\u003E\n"},{"CreatedByName":"StahnAileron","CreatedById":139783,"CreatedDateTime":"2016-08-11T17:29:34Z","Content":"\n\u003Cp\u003E\nRegarding pilots: considering the changes done to correct the \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E system so it\u0027s monolithic and more stable and not as \u0022loose\u0022 is it is now, perhaps the gameplay for Pilot level would be how well they actually maneuver when \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E is engaged. Low level is a bit wobbly (difficulty keeping on target) and a tendency to over- and undershoot. Higher level are smoother and more precise. (I\u0027d like to say let this bleed over into manual control as well when you have a Kerbal Pilot onboard, but that\u0027ll liquid off players, me included.)\n\u003C/p\u003E\n\u003Cp\u003E\nIf they ever implement on-rails maneuver node execution (because I hate having to micro manage every phase of a flight in the late game), pilot levels could affect accuracy/precision/efficiency of those maneuvers. Probe cores would rside in the middle (better than a low level pilot, but not as good as an experienced pilot). Also, with a comm system, perhaps lag time for maneuvers in probes. (So maneuvers far from Kerbin need planning; real-time control is not fully reliable.)\n\u003C/p\u003E\n\u003Cp\u003E\nYeah, more idea for \u0022patching\u0022 the pilot classes, but I like to think my ideas have (arguable) more substance to them for consideration in the future than the current system. I\u0027m still of the mind that by \u0022late-/endgame\u0022, I should be mostly (macro-)managing and directing the Space Program overall rather than micromanaging every action and event.\n\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2016-08-11T18:04:12Z","Content":"\n\u003Cp\u003E\nThe most annoying part of the class system is the weird way to gain levels - followed by the lack of a 1.5m two-kerbal capsule.\n\u003C/p\u003E\n\u003Cp\u003E\nFor me at least.\n\u003C/p\u003E\n"},{"CreatedByName":"FlyingCola","CreatedById":161862,"CreatedDateTime":"2016-08-11T18:21:47Z","Content":"\n\u003Cp\u003E\nWhat? So basically Remote tech is being implemented in the game?\n\u003C/p\u003E\n"},{"CreatedByName":"Bombaatu","CreatedById":157643,"CreatedDateTime":"2016-08-11T18:38:10Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222713532\u0022 data-ipsquote-contentid=\u0022145686\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221470938652\u0022 data-ipsquote-userid=\u002270338\u0022 data-ipsquote-username=\u0022KerbMav\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n34 minutes ago, KerbMav said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe most annoying part of the class system is the weird way to gain levels - followed by the lack of a 1.5m two-kerbal capsule.\n\u003C/p\u003E\n\u003Cp\u003E\nFor me at least.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThere are two mods that can take of this. The first is Field Experience (don\u0027t have to land on Kerbin to gain the experience) and the second is the K2 Command Pod.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAlso, Mark One Laboratory Extensions (or MOLE) has an extension to the Mk1 Pod that adds a second seat, while increasing the diameter to 1.875m. It also has the 2-Kerbal \u0022Brumby\u0022 pod (also 1.875) that emulates the Gemini capsule.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-08-11T18:38:35Z\u0022 title=\u002208/11/2016 06:38  PM\u0022 data-short=\u00227 yr\u0022\u003EAugust 11, 2016\u003C/time\u003E by Bombaatu\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2016-08-11T19:01:58Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222713038\u0022 data-ipsquote-contentid=\u0022145686\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221470900490\u0022 data-ipsquote-userid=\u002273725\u0022 data-ipsquote-username=\u00225thHorseman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 hours ago, 5thHorseman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAnd if I recall, this never made anybody angry. \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell if you are expecting the impossible, then the game shouldn\u0027t have been made.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222713553\u0022 data-ipsquote-contentid=\u0022145686\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221470939707\u0022 data-ipsquote-userid=\u0022161862\u0022 data-ipsquote-username=\u0022FlyingCola\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n42 minutes ago, FlyingCola said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhat? So basically Remote tech is being implemented in the game?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNo.  A slightly more in depth \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/51591-112-antennarange-1113-enforce-and-encourage-antenna-diversity/\u0022 rel=\u0022\u0022\u003EAntennaRange\u003C/a\u003E is being implemented in the game.  It\u0027s no where near the level of RemoteTech.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-08-11T19:04:16Z\u0022 title=\u002208/11/2016 07:04  PM\u0022 data-short=\u00227 yr\u0022\u003EAugust 11, 2016\u003C/time\u003E by Alshain\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"HvP","CreatedById":146104,"CreatedDateTime":"2016-08-11T19:40:27Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222713138\u0022 data-ipsquote-contentid=\u0022145686\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221470913002\u0022 data-ipsquote-userid=\u0022145438\u0022 data-ipsquote-username=\u0022Icemanau\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, Icemanau said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI have yet to hear of an autopilot that has the ability to reset things in the physical world or be able to think creatively in an emergency...\n\u003C/p\u003E\n\u003Cp\u003E\nYou know, things like those pesky circuit breakers that control the power going to the autopilot or switches that are required to be manually operated for safety reasons. The autopilot was designed to do one thing and one thing only, that one thing is to fly the plane/spacecraft along a predetermined path to the destination at the designated speed...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAgreed. Consider Armstrong in Gemini 8 when the \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E system went haywire and threw them into an uncontrolled tumble. Or Armstrong again in Apollo 11 when he had to take manual control from the guidance system that was putting them down into a field of boulders. Or the geology training for the Apollo 15 crews and later that allowed them to search for primordial lunar material in context. Or the EVA mission that successfully repaired the Hubble telescope, turning it from one of the biggest mistakes in engineering to one of the greatest accomplishments.\n\u003C/p\u003E\n\u003Cp\u003E\nIt seems to me that piloting, scientific, and engineering skill sets are well represented in the real life history of space exploration. I will certainly admit that our space program tends to train the astronauts in all of these disciplines simultaneously, mostly due to limited space and cost for additional crew. But with the operation of the ISS it has been much more common to compartmentalize the skill sets of payload specialists depending on the exact nature of the work being done.\n\u003C/p\u003E\n"},{"CreatedByName":"Curveball Anders","CreatedById":107529,"CreatedDateTime":"2016-08-11T21:35:50Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222713038\u0022 data-ipsquote-contentid=\u0022145686\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221470900490\u0022 data-ipsquote-userid=\u002273725\u0022 data-ipsquote-username=\u00225thHorseman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n14 hours ago, 5thHorseman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAnd if I recall, this never made anybody angry. \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNo?\u003Cbr\u003E\nLink to, nah , the broken_workflow.png is too old ...\n\u003C/p\u003E\n"},{"CreatedByName":"TiktaalikDreaming","CreatedById":136290,"CreatedDateTime":"2016-08-12T06:30:58Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222711944\u0022 data-ipsquote-contentid=\u0022145686\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221470841878\u0022 data-ipsquote-userid=\u002275006\u0022 data-ipsquote-username=\u0022NathanKell\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 11/08/2016 at 1:11 AM, NathanKell said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNope, none of these things. It means vessel.angularVelocity (a value that is used by our PID, and by many mods), which \u003Cem\u003Ereports vessel angular velocity \u003C/em\u003E(note, doesn\u0027t set, reports), which currently just reports the angular velocity of the root part, will now report the mass-weighted average of the angular velocities of the parts. (I.e. vessel.angularVelocity = sum[For each part](part.angularVelocity * part.mass / vessel.mass). Again, this is merely \u003Cem\u003Ereporting\u003C/em\u003E, obviously the physics engine is doing the actual integration.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/133181-boris-barboris/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022133181\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/133181-boris-barboris/\u0022 rel=\u0022\u0022\u003E@Boris-Barboris\u003C/a\u003E talked about this a while ago and should be rather happy with this change.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nDoes \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E use this value?  If so, woop!!!   :-) \n\u003C/p\u003E\n"},{"CreatedByName":"DaMachinator","CreatedById":164681,"CreatedDateTime":"2016-08-12T11:23:04Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222712496\u0022 data-ipsquote-contentid=\u0022145686\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221470865456\u0022 data-ipsquote-userid=\u002281697\u0022 data-ipsquote-username=\u0022kiwi1960\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 8/10/2016 at 5:44 PM, kiwi1960 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOK, a question..... Antenna ranges.... not that I care much either way, now... but what happens when you send a probe to the Mun (which isn\u0027t that far away FOR MY POINT TO BE MADE)..... and it ends on the other side of the Mun.... will there be a signal blackout?\n\u003C/p\u003E\n\u003Cp\u003E\nI ask this question because if there will be signal blackouts, then I can see people having to have at least four com-sats orbiting each planet and moon JUST to prevent black outs...\n\u003C/p\u003E\n\u003Cp\u003E\nUnless of course.... you just go with the flow and don\u0027t care about losing contact with a horny Jeb all alone in a capsule with that gorgeous Valentina..... \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou can do it with three commsats. You can do connections in between planets with two commsats around each planet. You can do better connections with two sats in an orbit of every body possible to minimize the chance of signal loss due to another body getting in the way.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nFor a properly done omni commsat constellation, the area of continuous uninterrupted coverage will be a torus. In most cases (all cases if the constellation has a continuous connection to KSP) it will be a torus that intersects itself in the middle.\n\u003C/p\u003E\n"},{"CreatedByName":"DaMachinator","CreatedById":164681,"CreatedDateTime":"2016-08-12T11:50:42Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222713282\u0022 data-ipsquote-contentid=\u0022145686\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221470924562\u0022 data-ipsquote-userid=\u0022139655\u0022 data-ipsquote-username=\u0022Terwin\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n21 hours ago, Terwin said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nUnless you have a probe core, \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003E\u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E\u003C/abbr\u003E *IS* the pilot taking control and doing what you asked instead of you being in direct control.\n\u003C/p\u003E\n\u003Cp\u003E\nAutopilot is *great* for a pre-defined path with a limited number of unknowns and the ability to call upon a human if things go wrong.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt so happens space travel involves predefined paths with a limited number of unknowns. The paths are determined by the most efficient possible path within a time constraint, and with some simplifications, can be precalculated rather trivially. In KSP, things go wrong for three reasons, unless you play with mods like DangIt that make stuff fail randomly:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nUser error (It\u0027s time for a redesign.)\n\u003C/li\u003E\n\u003Cli\u003E\nGame bugs (Hold F9 to load latest quicksave.)\n\u003C/li\u003E\n\u003Cli\u003E\nInsufficient precision (Correction burns or quickloading, largely avoided by a good autopilot.)\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222713282\u0022 data-ipsquote-contentid=\u0022145686\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221470924562\u0022 data-ipsquote-userid=\u0022139655\u0022 data-ipsquote-username=\u0022Terwin\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n21 hours ago, Terwin said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI find them to be quite useful, but if you never take advantage of any of the benefits of having a pilot on board, I can see why you do not care for them\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhat benefits? The only thing pilots are useful for is flying aircraft. Unless you\u0027re good enough at aircraft design to not need \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nThe only class with a benefit in my personal experience is the scientist, who saves a complete set of experiments and sensors (or more than one - up to 4 sets for interplanetary missions where the target body has an atmosphere) in weight and space.\n\u003C/p\u003E\n\u003Cp\u003E\nAdditionally, once some of the space center buildings (Either Tracking Station or Mission Control or possibly both) are upgraded, all vessels have complete \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E functionality with any control module available, making pilots really and truly useless.\n\u003C/p\u003E\n\u003Cp\u003E\nNot that they weren\u0027t already because...\n\u003C/p\u003E\n\u003Cpre class=\u0022ipsCode\u0022\u003E\n@lazyglobal off.\n\nclearscreen.\n\nprint \u0022Initializing guidance systems.\u0022.\n\nrun once maneuverlib.\n\n\u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E off.\n\nlock throttle to 1.0.\n\nlocal steer is up.\n\nlock steering to steer.\n\nprint \u0022Initialization complete. Beginning countdown.\u0022.\n\nfrom {local ttl is 10.} UNTIL ttl = 0 STEP {set ttl to ttl-1.} DO {\n  print ttl.\n}\n\nstage.\n\nset steer to heading(90,75).\u003C/pre\u003E\n\u003Cp\u003E\n...is better than any pilot will ever be.\n\u003C/p\u003E\n"},{"CreatedByName":"Frank_G","CreatedById":100000,"CreatedDateTime":"2016-08-12T14:28:40Z","Content":"\n\u003Cp\u003E\nAwesome. Kerbnet looks great and it was so needed for good stock mission planning.\n\u003C/p\u003E\n"},{"CreatedByName":"Wallygator","CreatedById":97357,"CreatedDateTime":"2016-08-12T14:48:15Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222711945\u0022 data-ipsquote-contentid=\u0022145686\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221470841884\u0022 data-ipsquote-userid=\u0022105624\u0022 data-ipsquote-username=\u0022Pthigrivi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 10 August 2016 at 4:11 PM, Pthigrivi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWe\u0027ve discussed this before and there are some problems with this--primarily grind. If you link experience to tasks like repairing things and conducting experiments players will end up repetitively breaking and repairing wheels and conducting menial experiments at \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E. Its one of those things that sounds intuitive but actually leads to some really dull gameplay. I don\u0027t have any problem with gaining experience from exploration. Its just an abstraction, and at the very least rewards players for getting out there and really playing the game rather than fussing about with tasks that aren\u0027t central to it. Im not saying such a system couldn\u0027t work, just that constructing it in such a way as to avoid repetitive ancillary tasks is more difficult than people realize.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou appear to equate training with grinding meaning the spending of time - a valid position, but not one i subscribe to. I equate training with a singular event prior to a mission meaning the spending of funds.  \n\u003C/p\u003E\n\u003Cp\u003E\nIn my mental model experience is what is paraded in front of the masses with ticker tape and presidential medals. Training is what allows a kerbal to flip a switch correctly.\n\u003C/p\u003E\n\u003Cp\u003E\nKSP currently commingles these two concepts to the detriment of both.\n\u003C/p\u003E\n\u003Cp\u003E\nEDIT: Also sorry to forget mentioning this but I really like the concept of Kerbnet - looking forward to seeing how it plays.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-08-12T14:53:05Z\u0022 title=\u002208/12/2016 02:53  PM\u0022 data-short=\u00227 yr\u0022\u003EAugust 12, 2016\u003C/time\u003E by Wallygator\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"something","CreatedById":157505,"CreatedDateTime":"2016-08-12T20:11:38Z","Content":"\n\u003Cp\u003E\nKerbnet? Am I the only person who gets that s a Skynet reference? Don\u0027t program it. Don\u0027t use it or the machines take over after landing an ICBM in your garden...\n\u003C/p\u003E\n"},{"CreatedByName":"0111narwhalz","CreatedById":110660,"CreatedDateTime":"2016-08-12T21:07:15Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222714805\u0022 data-ipsquote-contentid=\u0022145686\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221471032698\u0022 data-ipsquote-userid=\u0022157505\u0022 data-ipsquote-username=\u0022something\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n55 minutes ago, something said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nKerbnet? Am I the only person who gets that s a Skynet reference? Don\u0027t program it. Don\u0027t use it or the machines take over after landing an ICBM in your garden...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe fact that it will \u0022reside on all probe cores\u0022 concerns me in this respect.\n\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2016-08-12T21:09:46Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222714218\u0022 data-ipsquote-contentid=\u0022145686\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221470983458\u0022 data-ipsquote-userid=\u0022136290\u0022 data-ipsquote-username=\u0022TiktaalikDreaming\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n14 hours ago, TiktaalikDreaming said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents ipsClearfix\u0022\u003E\n\u003Cp\u003E\nDoes \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003E\u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E\u003C/abbr\u003E use this value?  If so, woop!!!   :-) \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nTo a limited extent yes, which is why I got around to making the change.\n\u003C/p\u003E\n"},{"CreatedByName":"TiktaalikDreaming","CreatedById":136290,"CreatedDateTime":"2016-08-12T21:47:53Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222714850\u0022 data-ipsquote-contentid=\u0022145686\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221471036186\u0022 data-ipsquote-userid=\u002275006\u0022 data-ipsquote-username=\u0022NathanKell\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n30 minutes ago, NathanKell said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nTo a limited extent yes, which is why I got around to making the change.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAwesome.  That should assist long wobbly rockets somewhat.\n\u003C/p\u003E\n\u003Cp\u003E\nOr at least reduce the need to set a central part as the root.  And take away the guess work of which part would be a good choice.  All great news for those of us who build really large wobble rockets and constantly forget to set the root part.  :-)\n\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2016-08-12T22:24:13Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222714805\u0022 data-ipsquote-contentid=\u0022145686\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221471032698\u0022 data-ipsquote-userid=\u0022157505\u0022 data-ipsquote-username=\u0022something\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, something said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nKerbnet? Am I the only person who gets that\u0027s a Skynet reference?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSee page 4 \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBest,\u003Cbr\u003E\n-Slashy\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Slaghead","CreatedById":150721,"CreatedDateTime":"2016-08-12T23:44:51Z","Content":"\n\u003Cp\u003E\nIs there a list of bugs that are being worked on somewhere or do we have to wait for the update to come out to see the changelog?\n\u003C/p\u003E\n\u003Cp\u003E\nI love the new features but I am having a dickens of a time dealing with the bugs that cause Kerbals to board a ship from EVA but their bodies not despawning.  And glitching clamp-o-trons that I have to edit the persistence file outside of the game to fix.  Tell me those are being worked on and I\u0027ll be happy.\n\u003C/p\u003E\n\u003Cp\u003E\nIRT the class system, I don\u0027t hate it.  I don\u0027t like that you have to send Kerbals to the multiple other bodies in order to gain experience because I have had exactly 0 successful landing/return missions.  Yes, I am bad at the game maybe but that\u0027s a steep penalty.  I don\u0027t have a single Kerbal above level 2 and that was only barely and recently.  I am pretty sure I am not the only one who has difficulty moving Kerbals around.  If it\u0027s to force the player to other bodies in the solar system, the contract system already does that well enough IMO.  If people want to grind to max out Kerbals ASAP, then it would be a grind mechanic.  But for me, earning XP from simply performing their job (flying, sciencing, engineering) simply makes more sense and, at least for me, would be organic growth and I\u0027d eventually have some higher level Kerbals.\n\u003C/p\u003E\n\u003Cp\u003E\n/I have never completed the tech tree. I have gotten exactly 1 Kerbal to level 2.  I have gotten Kerbals to the Mun but have yet to develop a system that gets them back home.\n\u003C/p\u003E\n"}]}