{"TopicId":14564,"ForumId":16,"TopicTitle":"RCS Fuel Tank Ordering","CreatedByName":"Fortunateson1969","CreatedById":29798,"CreatedDateTime":"2012-07-18T16:31:54Z","PageNum":1,"Articles":[{"CreatedByName":"Fortunateson1969","CreatedById":29798,"CreatedDateTime":"2012-07-18T16:31:54Z","Content":"\n\u003Cp\u003EYou\\\u0027d think that the wee little RCS tanks I put on the very top of my ship would be used very last, as that\\\u0027s how I ordered them in the stage list and the giant one for my first stage would be used first. \u003C/p\u003E\u003Cp\u003EHowever, KSP has different plans. I can\\\u0027t right click on them to disable flow-is there something that I\\\u0027m missing to order RCS tank usage? I\\\u0027ve never had this problem before.\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2012-07-19T01:31:37Z","Content":"\n\u003Cp\u003EThe game seems to often to use RCS tanks in the order they were placed. If you add RCS tanks to a lower stage, and then go back and put some in a stage above that, the higher ones will be used first. Basicaly, take the RCS tanks off the top, replace them, rinse and repeat for each RCS tank. That\\\u0027s a workaround, but I think the devs are planning on redoing the staging logic sometime, which will hopefully fix this.\u003C/p\u003E\n"},{"CreatedByName":"Fortunateson1969","CreatedById":29798,"CreatedDateTime":"2012-07-19T15:15:39Z","Content":"\n\u003Cp\u003EWoof. \u003C/p\u003E\u003Cp\u003EI suppose that\\\u0027s just a tribute to the alpha-ness of the game \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2012-07-19T21:00:42Z","Content":"\n\u003Cp\u003EYeah \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EHarv has said they\\\u0027ll fix it sometime soon, but I haven\\\u0027t heard much about it since then.\u003C/p\u003E\n"},{"CreatedByName":"duckunlimited2","CreatedById":14973,"CreatedDateTime":"2012-07-20T20:34:50Z","Content":"\n\u003Cp\u003EI actually believe the game will use the RCS fuel tank that is the most \u0027away\u0027 from the command pod. When I mean \u0027away\u0027 I mean how far is it connected wise, not actual distance. Example: Lets say you have a command pod with a structural piece connected below you then a fuel tank connected below that. Both the structural piece and fuel tank have some radial RCS tanks attached to them. Because, the fuel tank is attached to the structural part which in turn is connected to the command pod, the RCS tank on the fuel tank will be used first instead of the structural part\\\u0027s RCS tank because its directly attached to the command pod which is closer connection wise. You get what I\\\u0027m saying? The order at which RCS tanks are used are based on how far the RCS tank is away from the command pod connection wise, and it starts at the farthest RCS tank. Its a simple concept but it can get pretty complicated.\u003C/p\u003E\u003Cp\u003ESource: my own observations\u003C/p\u003E\n"}]}