{"TopicId":145853,"ForumId":21,"TopicTitle":"Let\u0026#039;s build a V3 cannon in KSP!","CreatedByName":"MedwedianPresident","CreatedById":12212,"CreatedDateTime":"2016-08-13T01:01:25Z","PageNum":1,"Articles":[{"CreatedByName":"MedwedianPresident","CreatedById":12212,"CreatedDateTime":"2016-08-13T01:01:25Z","Content":"\n\u003Cp\u003E\nMany people know that at the end of the war, the Nazis had a secret plan to build a big supercannon that would then be used to bombard London from various locations in Luxembourg and Belgium. The cannon would utilize a long tube to which shorter tubes with explosives would be attached to accelerate an artillery shell to supersonic speeds.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 src=\u0022https://img.ifcdn.com/images/fbeddac73d50031b7646c052ecbcf3f4f2b146e69fefa7c5cfca67196fb56fad_1.jpg\u0022 alt=\u0022fbeddac73d50031b7646c052ecbcf3f4f2b146e6\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBasically, there were several smaller tubes attached to the main tube through which the projectile traveled at 45-degree angles, in which explosive changes were placed. The gases resulting from the detonations would be directed in the direction of the acceleration, and the explosives were timed accurately to ignite when the projectile, which was accelerating in the tube, would pass by them.\n\u003C/p\u003E\n\u003Cp\u003E\nI imagine that this is a good concept to recreate in Kerbal Space Program, with the explosives being replaced by rocket engines or \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E\u0027s in order to negate the timing problem. Such a cannon could not only be used for ballistic bombardment of various locations on Kerbin but also to launch small (or large) payloads into orbit and maybe even beyond.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat do you think? Show your builds! I will of course also try to work with this interesting concept.\n\u003C/p\u003E\n"},{"CreatedByName":"Crocket","CreatedById":146960,"CreatedDateTime":"2016-08-18T18:42:21Z","Content":"\n\u003Cp\u003E\nFollowing, will post results soon-ish.\n\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2016-08-18T19:01:27Z","Content":"\n\u003Cp\u003E\nSince this will end up being a build-sharing thread, it has been moved to the build-sharing subforum. \n\u003C/p\u003E\n"},{"CreatedByName":"THE NARWHAL","CreatedById":138145,"CreatedDateTime":"2016-08-18T19:27:06Z","Content":"\n\u003Cp\u003E\nMany people have made smaller versions of this such as Danny2462\u0027s Mass Relay, but i have also seen youtubers use other configurations of Mainsails to fire kerbals. However, with the new overheating, i doubt this will be feasable, Possibly Tweakscale could be used to shrink heat shields to fit in a 1.25m structural tube, then use that as the vehicle.\n\u003C/p\u003E\n"}]}