{"TopicId":146275,"ForumId":16,"TopicTitle":"Missing or invalid parts while loading crafts in VAB","CreatedByName":"New Horizons","CreatedById":133013,"CreatedDateTime":"2016-08-21T12:54:22Z","PageNum":1,"Articles":[{"CreatedByName":"New Horizons","CreatedById":133013,"CreatedDateTime":"2016-08-21T12:54:22Z","Content":"\n\u003Cp\u003E\nWhen playing with mods sometimes parts get lost, when you delete or update mods. Is there a way to find out, which parts are missing?\n\u003C/p\u003E\n"},{"CreatedByName":"LN400","CreatedById":140595,"CreatedDateTime":"2016-08-21T13:04:06Z","Content":"\n\u003Cp\u003E\nFirst thing I would check when updating a mod is the change log. Most (or all) mods have a change log either on their front page here, in the zip archive or on the download site. Any removing of parts should be mentioned there.\n\u003C/p\u003E\n"},{"CreatedByName":"ZooNamedGames","CreatedById":103726,"CreatedDateTime":"2016-08-21T13:35:25Z","Content":"\n\u003Cp\u003E\nThere is a way to find what parts are missing and possibly removing them (which may cause glitches). Firstly load the craft up in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E (yes, I know it won\u0027t load), when it gives you the part error write down the \u003Cem\u003Eexact\u003C/em\u003E names for those parts. Then go to your KSP install location and go to the Saves folder. Then go to your saved game name, into the building you saved the craft (so it should look like [KSP Install]\u0026gt;Saves\u0026gt;[Save Name]\u0026gt;\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E or \u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E). Open the craft file in notepad and hit ctrl\u002Bf to open the find window. Then use the search feature to find that part. Here\u0027s where the bugs come in, if you carefully delete that entire part, it might let you reuse the craft but again, expect bugs.\n\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2016-08-22T02:08:19Z","Content":"\n\u003Cp\u003E\n:Like \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/103726-zoonamedgames/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022103726\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/103726-zoonamedgames/\u0022 rel=\u0022\u0022\u003E@ZooNamedGames\u003C/a\u003E games says, the game will tell you which specific part is missing.  If the ship was in flight, you\u0027ll get the message as soon as the game loads you to the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E view.  If you\u0027re trying to load a ship in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E or \u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E, it will tell you then.  Then you have a choice.  You can either do like he said and delete the part from the ship in your save file (either manual as above or with the KML savefile editor mod).  Or, you can just reinstall that mod.\n\u003C/p\u003E\n"}]}