{"TopicId":14642,"ForumId":39,"TopicTitle":"The Story of how Plaatinum Aerospace came to be.","CreatedByName":"Plaatinum Aerospace","CreatedById":30569,"CreatedDateTime":"2012-07-19T14:46:18Z","PageNum":1,"Articles":[{"CreatedByName":"Plaatinum Aerospace","CreatedById":30569,"CreatedDateTime":"2012-07-19T14:46:18Z","Content":"\n\u003Cp\u003EJust a story....\u003C/p\u003E\u003Cp\u003EIntroduction\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003EThis is a work of fiction. All references to any real objects and persons is entirely coincidental or intended by the author. Kerbal Space Program is copyrighted by SQUAD Inc. All rights reserved. Plaatinum Aerospace is copyrighted by Plaatinum Aerospace Technologies and its affiliate, Quasar Starships. All rights reserved. \u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EChapter 1: Plaatinum_Spark\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003EAeon Kerman, just after graduating from the University of Kalgary (College of Aerospace Engineering and Avionics), decided to join the Kerbin Planetwide Aerospace Administration (KPAA) as a spaceship computer designer. Soon he got bored and he quit, fleeing into the mountains, forming his very own \u0027mad scientist\\\u0027s lair\u0027. Later he joined at the Kerbal Space Center as a engineer. There he remains as a part-time job. \u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EChapter 2: Plaatinum_Nova\u003C/p\u003E\u003Cp\u003EPlaatinum_Nova needs a biography. His name is Jacob Kerman\u003C/p\u003E\u003Cp\u003EChapter 3: Plaatinum_Quasar\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003EMitchell Kerman is an Elon Musk-sort-of-person who co-founded FoodFriend.kerb FoodFriend is an online service that works like this: You order food online, and it arrives at your house is six-to-eight weeks! The other founder, Billy-Bob-Joe Kerman, did not think it through, so Mitchell left and took most of the money, leaving Billy-Bob-Joe with the Kerbal equivalent on 100 USD and a travel trailer. \u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EChapter 4: The meeting of Spark, Nova, and Quasar.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003ESpark, Nova, and Quasar (Aeon, Jacob, Mitchell) met at the Kerbal Space Center and quickly became friends. They kept their jobs (part-time) and founded Plaatinum Aerospace Technologies and Quasar Starships. Aeon became CEO, Jacob became the Head Exploration officer due to his astronomy skills (he had the second highest IQ on Kerbin \u003Csup\u003Ecitaton needed\u003C/sup\u003Ewith an IQ of 37, beaten only by Aeon with an IQ of 120, beating most of the fabled \u0027human\u0027 race as well as everyone on Kerbin (the average is 33 \u003Csup\u003Ecitation needed\u003C/sup\u003E. Mitchell became Chief constrution Officer. Later, they joined Gold Stingray Inc. \u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThanks for Reading! Feel free to comment on anything or maybe some of the staff can answer the citations! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EPlaatinum_Spark, with input from Plaatinum_Nova and Plaatinum_Quasar.\u003C/p\u003E\n"}]}