{"TopicId":146435,"ForumId":34,"TopicTitle":"Repurposed Stock Parts and Stockalike Parts","CreatedByName":"InfiniteAtom","CreatedById":152189,"CreatedDateTime":"2016-08-23T22:08:51Z","PageNum":1,"Articles":[{"CreatedByName":"InfiniteAtom","CreatedById":152189,"CreatedDateTime":"2016-08-23T22:08:51Z","Content":"\n\u003Cp\u003E\nATTENTION: EVERYTHING IS PROBABLY BROKEN!\u003Cbr\u003E\u003Cbr\u003E\nThis is a \u0022mod\u0022 I made for KSP which I feel adds some parts that are missing in default KSP or should be added to default KSP. This is my first mod and will be added to as I have time. Current parts include: A mk16 parachute that can be deployed at 700m/s but it is heavy and expensive. A high power ion engine with the cost of increased fuel and energy use, it should be about 1.25 meters in diameter. Last, A bigger version of the FAT-455 aircraft wing meant for mk3 planes that need more lift than a standard FAT-455 wing can provide. It has increased fuel capacity and cost. Also, everything on this list has a modified description, cost, entry cost along with a few other changes. If there are ANY issues with this mod, please tell me. I know nearly nothing about code so if something goes wrong I am requesting assistance from the KSP forum community. This mod should work will all versions of KSP that are greater than version 1.1, but also with KSP 1.0.5 and higher. Enjoy the mod! \u003Cu\u003E\u003Cem\u003E\u003Cstrong\u003E(Pictures will be added soon) \u003C/strong\u003E\u003C/em\u003E\u003C/u\u003E\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nDisclaimer:\n\u003C/p\u003E\n\u003Cp\u003E\nI own no rights to the original texture and config files in this mod, excepts rights that come with purchase of KSP. Squad and or Porkjet own rights to the original files. I do however own rights to the modified files, and if I see this mod re-uploaded by someone else who claims it as their own I will request it to be removed.\u003Cbr\u003E\nLink to official KSP website: \u003Ca href=\u0022https://kerbalspaceprogram.com/en/\u0022 rel=\u0022\u0022\u003Ehttps://kerbalspaceprogram.com/en/\u003C/a\u003E\u003Cbr\u003E\nLink to Porkjet\u0027s profile on the KSP Forums:  \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/92433-porkjet/\u0022 rel=\u0022\u0022\u003Ehttp://forum.kerbalspaceprogram.com/index.php?/profile/92433-porkjet/\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nDownload Link: \u003Ca href=\u0022https://spacedock.info/mod/1198/Repurposed%20Stock%20Parts%20and%20Stockalike%20Parts\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://spacedock.info/mod/1198/Repurposed Stock Parts and Stockalike Parts\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n*Cough* Welp, I got busy and I guess this didn\u0027t get updated. I\u0027ll get around to updating this eventually.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-06-03T00:16:12Z\u0022 title=\u002206/03/2018 12:16  AM\u0022 data-short=\u00226 yr\u0022\u003EJune 3, 2018\u003C/time\u003E by InfiniteAtom\u003C/strong\u003E\n\u003Cbr\u003EAdding info.\n\u003C/span\u003E\n"}]}