{"TopicId":146436,"ForumId":16,"TopicTitle":"Rockets tip over while i initiate gravity turn","CreatedByName":"SnakeNation","CreatedById":168004,"CreatedDateTime":"2016-08-23T22:29:25Z","PageNum":1,"Articles":[{"CreatedByName":"SnakeNation","CreatedById":168004,"CreatedDateTime":"2016-08-23T22:29:25Z","Content":"\n\u003Cp\u003E\nSo basically whenever i launch a rocket, E.G a rocket to haul a space station up into orbit, it tips over. After the roll, i initiate the pitch, but then quickly loose control and my space ship literally tips over facing the ground. I tried MechJeb, Manual flight, but nothing works. Any help would be much appreciated.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-08-23T22:29:44Z\u0022 title=\u002208/23/2016 10:29  PM\u0022 data-short=\u00227 yr\u0022\u003EAugust 23, 2016\u003C/time\u003E by SnakeNation\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-08-23T22:42:14Z","Content":"\n\u003Cp\u003E\nIt\u0027s because your rocket is aerodynamically unstable, so it wants to point backwards.\n\u003C/p\u003E\n\u003Cp\u003E\nYour next question is \u0022well, what\u0027s \u003Cem\u003E\u003Cu\u003Ewrong\u003C/u\u003E\u003C/em\u003E with my rocket, and what do I need to change so it doesn\u0027t do that?\u0022  \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThat\u0027s hard to answer without seeing a screenshot.  If you post a screenshot, we can give more specific advice.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, general rule of thumb:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nHeavy and pointy stuff goes in the front\n\u003C/li\u003E\n\u003Cli\u003E\nLight and draggy goes in the back\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nMake sure your \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E is as high towards the front of the rocket as possible, and stick fins on the back to help stabilize it.\n\u003C/p\u003E\n\u003Cp\u003E\nBeyond that... screenshot please?\n\u003C/p\u003E\n"},{"CreatedByName":"SinBad","CreatedById":158888,"CreatedDateTime":"2016-08-23T22:42:32Z","Content":"\n\u003Cp\u003E\nTry rolling the rocket in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003Evab\u003C/abbr\u003E to change the launch orientation, handy for skipping that roll manouver.\n\u003C/p\u003E\n\u003Cp\u003E\nFor the tipping over, pics of your rocket, please?\n\u003C/p\u003E\n"},{"CreatedByName":"foamyesque","CreatedById":2982,"CreatedDateTime":"2016-08-23T22:43:25Z","Content":"\n\u003Cp\u003E\nMost likely answer is you lose aerodynamic stability as you burn fuel. Have you tried placing fins on the bottom?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nScreenshots would allow more specific advice.\n\u003C/p\u003E\n"},{"CreatedByName":"mythbusters844","CreatedById":72313,"CreatedDateTime":"2016-08-23T23:08:04Z","Content":"\n\u003Cp\u003E\nhow are you doing your gravity turn? if you\u0027re going to 10km or so and turning 45 degrees, then there\u0027s pretty much nothing you can do to stop it from flipping over. you have to do a \u003Ca href=\u0022https://en.wikipedia.org/wiki/Gravity_turn\u0022 rel=\u0022external nofollow\u0022\u003Ereal gravity turn\u003C/a\u003E in order to not flip over. wait until you get up to about 100 m/s or so, then just barely pitch your rocket towards the horizon in the heading you want to go (5 or so degrees should be enough). then maintain prograde as closely as possible and keep slowly pitching down (but make sure to not stray too much off the prograde vector or you\u0027ll make your ascent less efficient and you\u0027ll risk flipping over) so you\u0027re at about 50-40 degrees or so above the horizon at ~10km and you should be only a few degrees over the horizon by the time your apoapsis gets to your target altitude.\n\u003C/p\u003E\n"},{"CreatedByName":"DD_bwest","CreatedById":164906,"CreatedDateTime":"2016-08-23T23:14:11Z","Content":"\n\u003Cp\u003E\nwhat altitude do you start it at?  what is your speed at that time?  how much are you turning over?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nalso i recomend you turn your rocket in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003Evab\u003C/abbr\u003E to avoid the roll, makes things simpler and less to go wrong.\n\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2016-08-23T23:52:37Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222727283\u0022 data-ipsquote-contentid=\u0022146436\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221471991365\u0022 data-ipsquote-userid=\u0022168004\u0022 data-ipsquote-username=\u0022SnakeNation\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, SnakeNation said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSo basically whenever i launch a rocket, E.G a rocket to haul a space station up into orbit, it tips over. After the roll, i initiate the pitch, but then quickly loose control and my space ship literally tips over facing the ground. I tried MechJeb, Manual flight, but nothing works. Any help would be much appreciated.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIf you can\u0027t fly it and \u003Cabbr title=\u0022Mechjeb (mod)\u0022\u003EMJ\u003C/abbr\u003E can\u0027t fly it you probably want to start with something a bit smaller than a space station in one go.\n\u003C/p\u003E\n\u003Cp\u003E\nPossibly teaching you to suck eggs but it\u0027s your first post so I don\u0027t know what experience you have: first get \u003Cem\u003Esomething\u003C/em\u003E into space, then into orbit.  Once you can reliably orbit you can start to get ambitious - and go back to smaller stuff when it doesn\u0027t work, which it won\u0027t, until you get the hang of design my practicing lots and lots of stuff.\n\u003C/p\u003E\n"},{"CreatedByName":"Magzimum","CreatedById":167187,"CreatedDateTime":"2016-08-24T06:48:31Z","Content":"\n\u003Cp\u003E\nThe advanced answers are already given above: move the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E around, improve the gravity turn. But the really easy and basic solution is to just stick giant fins on the back of that rocket. If it still flips, make them bigger.\n\u003C/p\u003E\n\u003Cp\u003E\nObviously, if you manage to somehow make the rocket behave itself without the need for extra fins, that would improve the efficiency, as fins in the end are nothing but a source of extra drag.\n\u003C/p\u003E\n\u003Cp\u003E\nBut post pictures. Imgur is really easy to use, and with some pics you get far more feedback!\n\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2016-08-24T08:16:48Z","Content":"\n\u003Cp\u003E\nUse long rockets if your fairing is wide, this give an long arm between the front an the fins. \u003Cbr\u003E\nIf you launch something very bulky with lots of drag you might want to do an slower and higher than normal gravity turn, say mechjeb turn shape 60. \u003Cbr\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Stoney3K","CreatedById":139954,"CreatedDateTime":"2016-08-24T13:21:31Z","Content":"\n\u003Cp\u003E\nMost obvious answer: Try to narrow down the payload and maybe assemble the big station in multiple stages in orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s a lot easier to launch an arrow into orbit than it is to launch a tennis ball or a pancake.\n\u003C/p\u003E\n"},{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2016-08-25T11:41:15Z","Content":"\n\u003Cp\u003E\nGood big fins (delta wing, tail fin etc), and reasonable \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E (at least 1.5). Some alierons on them won\u0027t hurt.\n\u003C/p\u003E\n\u003Cp\u003E\nFor fins to work, your speed must exceed some 50-100m/s. Otherwise aerodynamics is nonexistent. That\u0027s why you need good \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E - with poor \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E and low speed your rocket is a pencil standing upright on your fingertip. With good air flow going (speed!) the fins will be stabilizing it.\n\u003C/p\u003E\n\u003Cp\u003E\nDepending on \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E the point where you initiate the gravity turn and its depth changes. With huge \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E you may want to start immediately and dip pretty deep, as the fins will make the dip due to gravity turn very shallow once aero kicks in. With heavy payloads and underpowered engines... no, you don\u0027t start the gravity turn later. You add moar boosters.\n\u003C/p\u003E\n"}]}