{"TopicId":146850,"ForumId":20,"TopicTitle":"Comprehensive guide to FAR spaceplanes?","CreatedByName":"Boom_Mcsplodey","CreatedById":133903,"CreatedDateTime":"2016-08-31T02:42:26Z","PageNum":1,"Articles":[{"CreatedByName":"Boom_Mcsplodey","CreatedById":133903,"CreatedDateTime":"2016-08-31T02:42:26Z","Content":"\n\u003Cp\u003E\nIs there an up-to-date comprehensive guide to building spaceplanes with \u003Cabbr title=\u0022Ferram Aerospace Research (mod)\u0022\u003EFAR\u003C/abbr\u003E floating around somewhere out there?  I\u0027ve been trying my hardest to build planes and am having no luck at all.  Most of the time my planes will end up barreling off the end of the runway at 200m/s without ever being able to pitch up beforehand.  If I\u0027m lucky they\u0027ll survive that launch and won\u0027t pitch up and down wildly enough to crash straight into the sea. I\u0027ve managed to brute force some SSTOs to orbit but am left with no payload, range, or rendezvous capabilities.  If those planes survive reentry without breaking up they crash land because they can\u0027t fly slow enough without dropping like rocks.  This is all beyond frustrating and I don\u0027t even know where to start fixing it.\n\u003C/p\u003E\n\u003Cp\u003E\nI know there must be a way to read the \u003Cabbr title=\u0022Ferram Aerospace Research (mod)\u0022\u003EFAR\u003C/abbr\u003E analysis to help fix stability and maneuverability issues.  I also know there\u0027s a way to use flaps, slats, and more complex control surfaces to make takeoff and landing easier.  The problem is that I can\u0027t find any decent guides or tutorials on the subject.  Most of the guides I\u0027ve found will say stuff like \u0022make sure the numbers in this dialog box are green\u0022 and \u0022smooth out this curve\u0022 without actually explaining \u003Cem\u003Ehow\u003C/em\u003E to do any of that.  Does anyone know of some complete but straightforward guides on this stuff?  A \u0022\u003Cabbr title=\u0022Ferram Aerospace Research (mod)\u0022\u003EFAR\u003C/abbr\u003E spaceplanes for dummies\u0022 of sorts?\n\u003C/p\u003E\n"},{"CreatedByName":"Van Disaster","CreatedById":58876,"CreatedDateTime":"2016-08-31T05:33:56Z","Content":"\n\u003Cp\u003E\nNo, not really - however concentrate on making normal aircraft first, from the basics you\u0027re describing you have rather large design issues. Barrelling off the runway could be because you have no control authority, not enough wing, misplaced landing gear or your \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E/lift balance is all out of whack - similarily not being able to fly slow enough could also be a balance issue or simple too-high wing loading.\n\u003C/p\u003E\n\u003Ciframe data-embedcontent=\u0022\u0022 frameborder=\u00220\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/109098-official-far-craft-repository/\u0026amp;do=embed\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\nThis is the thread to post in to ask for help about \u003Cabbr title=\u0022Ferram Aerospace Research (mod)\u0022\u003EFAR\u003C/abbr\u003E craft design ( the mod thread is to ask about things directly related to the mod itself ) - you might want to read through it, if you\u0027re going to post asking for help be sure to put some screenshots in - many of us can spot the more obvious problems instantly.\n\u003C/p\u003E\n"},{"CreatedByName":"Boom_Mcsplodey","CreatedById":133903,"CreatedDateTime":"2016-08-31T19:42:55Z","Content":"\n\u003Cp\u003E\nThanks for the info.  As far as \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E/\u003Cabbr title=\u0022Center of Lift\u0022\u003ECoL\u003C/abbr\u003E goes I know to try to keep the \u003Cabbr title=\u0022Center of Lift\u0022\u003ECoL\u003C/abbr\u003E right behind the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E.  I also know a similar thing can be said about main landing gear.  My basic understanding of flaps and slats in the real world is that they\u0027re used to temporarily increase lift to allow for lower speeds at takeoff and landing, but this seems to be some of the most advanced stuff in the game.  I\u0027ll have to take a close look at that thread.\n\u003C/p\u003E\n"},{"CreatedByName":"Van Disaster","CreatedById":58876,"CreatedDateTime":"2016-08-31T20:49:56Z","Content":"\n\u003Cp\u003E\n\u003Cabbr title=\u0022Ferram Aerospace Research (mod)\u0022\u003EFAR\u003C/abbr\u003E is rather more complicated than that - for starters lift centres move around depending on speed \u0026amp; \u003Cabbr title=\u0022Angle of Attack\u0022\u003EAoA\u003C/abbr\u003E, you need to pay attention to the numbers \u003Cabbr title=\u0022Ferram Aerospace Research (mod)\u0022\u003EFAR\u003C/abbr\u003E gives you, the \u003Cabbr title=\u0022Center of Lift\u0022\u003ECoL\u003C/abbr\u003E ball is an extremely rough estimation that is also rather dependent on craft shape. Flaps deflect down so unless you position them very carefully you\u0027ll get a pitching effect. Anyway, that thread is a good start, post there with more details \u0026amp; pics.\n\u003C/p\u003E\n"}]}