{"TopicId":146903,"ForumId":51,"TopicTitle":"Bringing Debris to the Masses","CreatedByName":"MaxL_1023","CreatedById":152317,"CreatedDateTime":"2016-09-01T03:53:32Z","PageNum":1,"Articles":[{"CreatedByName":"MaxL_1023","CreatedById":152317,"CreatedDateTime":"2016-09-01T03:53:33Z","Content":"\n\u003Cp\u003E\nHello,\n\u003C/p\u003E\n\u003Cp\u003E\nI am making this thread to post all my current and future mission pictures, for as long as I am sending Kerbals, Debris and Kerballed Debris throughout the inner and outer Solar System. In reverse chronological order, the following document what I have been doing. If anyone has any recommendations for good spots to visit (especially in \u003Cabbr title=\u0022Real Solar System (mod)\u0022\u003ERSS\u003C/abbr\u003E) point me in the right direction - I suspect there are many hidden gems within the trillions of available square kilometers. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ETriton Lander\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOne place which I have never managed to visit was Neptune\u0027s moon Triton. Renowned as the coldest measured place in the solar system, the only large retrograde moon and as cryovolcanically active, it is said that the gentle slops host the best skiing in the Solar System! (Carl Sagan). The gravity is light (about half of the Moons), and the atmosphere is thin enough to not necessitate any protection. The only minor issue is getting there. \n\u003C/p\u003E\n\u003Cp\u003E\nKSP\u0027s contract generator insisted that I make it to Neptune (and therefore Triton) within 15 years of launch. I decided to accept the challenge, as it paid out more than a million in Funds which mostly financed the mission. I knew that I would need at least 30 km/s of Delta-V. After designing the launcher stage, I realized that I sorely missed the Hangar Extended mod. Long story short, the image below displays what I put into the pre-transfer parking orbit. The vessel massed about 3000 tons, with 24000 m/s of delta-v in the tanks. The launch margin was the remaining 435 m/s, which was not usable due to the SSMEs being single ignition. \n\u003C/p\u003E\n\u003Cp\u003E\nLauncher Details:\n\u003C/p\u003E\n\u003Cp\u003E\nStage 1: 42 RD-170s\n\u003C/p\u003E\n\u003Cp\u003E\nStage 2: 40 SSMEs\n\u003C/p\u003E\n\u003Cp\u003E\nStage 3: 12 J2-X\n\u003C/p\u003E\n\u003Cp\u003E\nStage 4: 3 J2-X\n\u003C/p\u003E\n\u003Cp\u003E\nStage 5: 5 Aestus-II\n\u003C/p\u003E\n\u003Cp\u003E\nStage 6: 12 1KN Thrusters\n\u003C/p\u003E\n\u003Cp\u003E\nIn the future, remind me to use smaller rockets. KSP barely managed to load the vessel, and the Launchpad exploded under the weight of the ship. Thankfully, it made it into orbit. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Neptune%20Mission%20-%20Earth%20Orbit_zp\u0022 class=\u0022ipsImage\u0022 height=\u0022563\u0022 src=\u0022http://i1036.photobucket.com/albums/a448/MaxL_1023/Neptune%20Mission%20-%20Earth%20Orbit_zpslzmw39uw.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nTo get to Neptune in a reasonable amount of time, a transfer orbit was fairly useless. It would only require about 8 km/s, but takes 40 years! Thankfully, Mechjeb has a porkchop plot which let me select the optimal launch time and trajectory to get me to Neptune in under 15 Years. I ended up needing about 11.5 km/s - I budgeted for 13.5, meaning that I did over-design my rocket. It might be useful for Pluto though, due to the larger amount of delta-v needed to enter orbit (no oberth effect due to Pluto\u0027s small mass). \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Neptune%20Transfer_zpsfjaj2is5.png\u0022 class=\u0022ipsImage\u0022 height=\u0022563\u0022 src=\u0022http://i1036.photobucket.com/albums/a448/MaxL_1023/Neptune%20Transfer_zpsfjaj2is5.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAfter 13 years, a couple course corrections, a plane change and about 5000 m/s worth of orbital maneuvering, I made it to Triton\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E. I matched Triton\u0027s plane on approach to Neptune, then set my Perapsis to about 15000 KM. I burned there to enter orbit, and closed an Apoapsis at about twice Triton\u0027s orbital height. Then, I raised my PE to near Triton\u0027s orbit and corrected my orbit to get a fairly quick encounter. Due to Triton\u0027s low density, it already appears larger than Neptune even at the very edge of its \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E! My maneuvering allowed me to approach at a fairly low velocity, making an orbital insertion fairly simple. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Triton%20Encounter_zpsk8elghet.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i1036.photobucket.com/albums/a448/MaxL_1023/Triton%20Encounter_zpsk8elghet.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBelow is the view after inserting into a roughly 450x450 km polar orbit (scansat FTW). I liked the atmospheric haze illuminated by the shrunken sun. I am glad I brought RTGs - I would need a football field worth of solar panels to turn on my avionics. I stayed in this orbit for a couple months until I got 100% surface coverage. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Triton%20Orbit_zps5qta1jyk.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022564\u0022 src=\u0022http://i1036.photobucket.com/albums/a448/MaxL_1023/Triton%20Orbit_zps5qta1jyk.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOne more orbital picture, showing Neptune highlighted against Triton\u0027s limb. In KSP it is quite well lit even at this distance from the sun, and appears about 4 times larger than the Earth would from the Moon.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Triton%20Orbit%202_zps3mgbh3ss.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022566\u0022 src=\u0022http://i1036.photobucket.com/albums/a448/MaxL_1023/Triton%20Orbit%202_zps3mgbh3ss.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nFinally, I landed on Triton\u0027s Flatlands. I noticed that I had a chance to catch a solar eclipse - sadly KSP just showed the sun shining through Neptune so I decided to wait and get the \u0022Diamond Ring\u0022 effect instead. The atmosphere also seems a lot thicker than I expected, appearing to be extremely optically dense considering its pressure. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Triton%20Landing_zpsde57cffs.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022563\u0022 src=\u0022http://i1036.photobucket.com/albums/a448/MaxL_1023/Triton%20Landing_zpsde57cffs.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI checked my instrument readings - it seems like there is about 10 times as much air as there should be. Triton\u0027s atmosphere is about 1/70000th that of Earth (14 microbar) which would be 0.0014 KPA. Also, it is about 100 degrees warmer! I guess there was some global warming since Voyager 2 passed by. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Triton%20Landing%202_zpsksmaozao.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022563\u0022 src=\u0022http://i1036.photobucket.com/albums/a448/MaxL_1023/Triton%20Landing%202_zpsksmaozao.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEither way, this is what I got from Triton. I suspect the \u003Cabbr title=\u0022Real Solar System (mod)\u0022\u003ERSS\u003C/abbr\u003E developers have not gotten this far out yet with detailed biome/texturing, which makes sense since most players would likely go to Mars or the Moon and do base/station missions as opposed to just throwing probes around. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nFinally, an older shot from a concurrent Kerballed mission -\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Lunar%20Landing_zpsiggee8es.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i1036.photobucket.com/albums/a448/MaxL_1023/Lunar%20Landing_zpsiggee8es.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe first moon landing in this career! I had a mothership with a science lab in orbit (docking is a pain in the cheeks!) and used the 2-person lander can provided in RP-0. I used a single-engine \u002B drop tank configuration, as the Aestus engine is very powerful and efficient compared to the original Apollo equipment. It was a bit tricky to land without throttling - I ended up hitting the surface at about 5 m/s and bouncing a few feet. Next up is trying to land a science lab. That will require a large rocket, especially if I want to be able to bring the crew back!\n\u003C/p\u003E\n\u003Cp\u003E\nI will post any future missions as additions to this \u003Cabbr title=\u0022Original Post(er). The first post in a thread, or the person who posted it.\u0022\u003EOP\u003C/abbr\u003E - thanks to anyone who read this thread and feel free to share your own KSP adventures either here or elsewhere!\n\u003C/p\u003E\n"},{"CreatedByName":"MaxL_1023","CreatedById":152317,"CreatedDateTime":"2016-09-02T01:42:45Z","Content":"\n\u003Cp\u003E\nSo it turns out I left Bob and Haybie sitting in a LEO Science Lab (The space station \u0022Spacelab III\u0022) for the last 18 years. The station has a habitation module and a docking port - time to launch a rescue mission! I do hope there are only two Kerbals up there - the Pod only has 3 seats and Jeb needs to fly it. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe launch was standard, with a first stage consisting of a single SSME, and a TRITON nuclear engine as the upper stage and orbital maneuvering engine. The response time and \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E of the TRITON is more than offset by its 642s vacuum \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E, plus the 75% LOX fuel mixture which drastically cuts tank volume. Spacelab III was in a 450km polar orbit - thanks to mechjeb for telling me when to launch to match the inclination - much better than trying to eyeball it. Intercept was basically entering a 450x300 km orbit until a close approach came up, then raising PE to slow the intercept velocity. MInor corrections allowed a reasonable approach, although it did take me 5 days on account of leaving my PE a little too high for a quick encounter, besides launching when the Spacelab was on the other side of the planet. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Docking%201_zpsmaqvx4bo.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022563\u0022 src=\u0022http://i1036.photobucket.com/albums/a448/MaxL_1023/Docking%201_zpsmaqvx4bo.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe docking approach was slow, and complicated by both the need to match orientation, the somewhat sketchy KSP docking controls ( or my lack of pilot skill, likely the latter) and the annoying tendency for the auto-capture mechanism to wobble my craft around like two mating Sea Cows. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Docking%202_zps1in3ddub.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022565\u0022 src=\u0022http://i1036.photobucket.com/albums/a448/MaxL_1023/Docking%202_zps1in3ddub.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEventually, I managed to dock. Nothing really impressive with my station - just a bunch of science equipment from DMagic, Scansat and RP-0 mixed with a lab, a hab module and associated solar panels, antennas and \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E blocks. Thankfully, my two Kerbals did not reproduce in space, meaning I had enough seats to take them back to Earth. The LEO science data is basically exhausted now - the next stop would be Mars or Venus orbit ( I put one around the moon along with my landing mission). \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Docking%203_zpsvhgpdcti.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022561\u0022 src=\u0022http://i1036.photobucket.com/albums/a448/MaxL_1023/Docking%203_zpsvhgpdcti.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nTo summarize the remainder, I undocked, deorbited using the nuclear engine (PE to about 56 KM) and did a lifting re-entry by toggling the pod\u0027s descent mode. This feature is so useful that it is worth the extra weight compared to some of the other non RP-0 pods, as it reduces the G-load and makes lunar re-entries much easier to control. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Docking%204_zpsfmbu49je.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022564\u0022 src=\u0022http://i1036.photobucket.com/albums/a448/MaxL_1023/Docking%204_zpsfmbu49je.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Deorbit%201_zpsijine06p.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022561\u0022 src=\u0022http://i1036.photobucket.com/albums/a448/MaxL_1023/Deorbit%201_zpsijine06p.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nPeak G-load topped out at 5Gs at about 50km up. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Deorbit%202_zpsxgc2z7qz.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022563\u0022 src=\u0022http://i1036.photobucket.com/albums/a448/MaxL_1023/Deorbit%202_zpsxgc2z7qz.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI semi-deployed the chutes at about 5000 meters, and made a DIY solar eclipse visible to a random camera floating via T. Kerman\u0027s patented gravioli manipulation. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Deorbit%203_zps0f9izqpr.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022567\u0022 src=\u0022http://i1036.photobucket.com/albums/a448/MaxL_1023/Deorbit%203_zps0f9izqpr.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nFinally, I displayed my shamefully low graphics settings by splashing down while appearing to be floating in the air. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Splashdown_zpskeqc7wtu.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022563\u0022 src=\u0022http://i1036.photobucket.com/albums/a448/MaxL_1023/Splashdown_zpskeqc7wtu.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI now have 2 more scientists available who have proven able to stay reasonably sane (by kerbal standards anyways) after an 18 year space mission. When I decide to send Kerbals to Mars or Jupiter\u0027s Moons, I know who to pick. \n\u003C/p\u003E\n\u003Cp\u003E\nNext up, I am planning to put a lander on Mercury. Since I have no clue how to time a Venus flyby to reduce the approach velocity, I am just going to torch ship it. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-09-02T03:40:59Z\u0022 title=\u002209/02/2016 03:40  AM\u0022 data-short=\u00227 yr\u0022\u003ESeptember 2, 2016\u003C/time\u003E by MaxL_1023\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MaxL_1023","CreatedById":152317,"CreatedDateTime":"2016-09-02T03:41:24Z","Content":"\n\u003Cp\u003E\nUpdated with mission photos. \n\u003C/p\u003E\n"},{"CreatedByName":"MaxL_1023","CreatedById":152317,"CreatedDateTime":"2016-12-06T01:40:43Z","Content":"\n\u003Cp\u003E\nAlright everyone - I am starting a KSP stream:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.twitch.tv/maxl_1023\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.twitch.tv/maxl_1023\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI will be on fairly regularly and will use this thread to post updates. I also have a Youtube channel:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.youtube.com/channel/UC0QP0BvaZg2x2z1YK3tt3AQ\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.youtube.com/channel/UC0QP0BvaZg2x2z1YK3tt3AQ\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n(It is a couple years old) which I am revitalizing by posting my streams and any other interesting videos. Bear with me for the first little while as I iron out any technical glitches. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"MaxL_1023","CreatedById":152317,"CreatedDateTime":"2016-12-06T21:06:41Z","Content":"\n\u003Cp\u003E\nI will be streaming this evening. I couldn\u0027t find the streaming calendar, so I will just post in this thread until I dig it up somewhere. \n\u003C/p\u003E\n"},{"CreatedByName":"MaxL_1023","CreatedById":152317,"CreatedDateTime":"2016-12-07T00:31:05Z","Content":"\n\u003Cp\u003E\nStream is online! (likely until 10 or 10:30 eastern time).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.twitch.tv/maxl_1023\u0022 rel=\u0022external nofollow\u0022 style=\u0022color:rgb(60,105,148);text-decoration:underline;background-color:rgb(255,255,255);font-family:\u0027Helvetica Neue\u0027, Helvetica, Arial, sans-serif;font-size:14px;font-style:normal;font-weight:normal;letter-spacing:normal;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;\u0022\u003Ehttps://www.twitch.tv/maxl_1023\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Wallygator","CreatedById":97357,"CreatedDateTime":"2016-12-07T01:35:11Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222877830\u0022 data-ipsquote-contentid=\u0022146903\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221481070665\u0022 data-ipsquote-userid=\u0022152317\u0022 data-ipsquote-username=\u0022MaxL_1023\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, MaxL_1023 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nStream is online! (likely until 10 or 10:30 eastern time).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.twitch.tv/maxl_1023\u0022 rel=\u0022external nofollow\u0022 style=\u0022color:rgb(60,105,148);text-decoration:underline;background-color:rgb(255,255,255);font-family:\u0027Helvetica Neue\u0027, Helvetica, Arial, sans-serif;font-size:14px;font-style:normal;font-weight:normal;letter-spacing:normal;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;\u0022\u003Ehttps://www.twitch.tv/maxl_1023\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOnly saw a few minutes of your stream, but it was entertaining. Keep it up!\n\u003C/p\u003E\n\u003Cp\u003E\nNice - I appreciate folks that make the effort to stream their efforts. \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"MaxL_1023","CreatedById":152317,"CreatedDateTime":"2016-12-07T03:14:43Z","Content":"\n\u003Cp\u003E\nLesson Learned : Rovers are easy to make - hard to fit into service bays!\n\u003C/p\u003E\n"},{"CreatedByName":"MaxL_1023","CreatedById":152317,"CreatedDateTime":"2016-12-08T00:22:12Z","Content":"\n\u003Cp\u003E\nStream is online!\n\u003C/p\u003E\n"},{"CreatedByName":"MaxL_1023","CreatedById":152317,"CreatedDateTime":"2016-12-08T02:29:47Z","Content":"\n\u003Cp\u003E\nI somehow managed to get a rover to float in space 5km above Iota, motionless. Gotta love KSP troll physics!\n\u003C/p\u003E\n"},{"CreatedByName":"MaxL_1023","CreatedById":152317,"CreatedDateTime":"2016-12-09T01:13:58Z","Content":"\n\u003Cp\u003E\nStreaming again! Today I am going to finally fix those rovers and potentially make an attempt at a crewed Niven landing. \n\u003C/p\u003E\n"},{"CreatedByName":"MaxL_1023","CreatedById":152317,"CreatedDateTime":"2016-12-10T00:17:09Z","Content":"\n\u003Cp\u003E\nI have uploaded two videos splitting my last livestream  one focusing on rover shenanigans (breakdancing, etc.) and the other detailing the design and launch of the Niven project. If you want to see a 20,000 ton rocket, go no farther than:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.youtube.com/channel/UC0QP0BvaZg2x2z1YK3tt3AQ\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.youtube.com/channel/UC0QP0BvaZg2x2z1YK3tt3AQ\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI will also be streaming very shortly - this one will be interesting, as my mission is en-route to Niven with a orbiter, lander and satellite ready to go!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.twitch.tv/maxl_1023\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.twitch.tv/maxl_1023\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nGalileo\u0027s Space Porn, free of charge!\n\u003C/p\u003E\n"},{"CreatedByName":"MaxL_1023","CreatedById":152317,"CreatedDateTime":"2016-12-10T01:30:34Z","Content":"\n\u003Cp\u003E\n\u003Cem\u003ELessons learned:\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E1. Do not put all the mass on top\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E2. The undersize signals intelligence satellite is not a ballute\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E3. Do not decouple parachutes, landing legs and half your fuel while supersonic 4km up.\u003C/em\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"MaxL_1023","CreatedById":152317,"CreatedDateTime":"2016-12-10T02:21:17Z","Content":"\n\u003Cp\u003E\nStream is online, live from the surface of Niven!\n\u003C/p\u003E\n"},{"CreatedByName":"MaxL_1023","CreatedById":152317,"CreatedDateTime":"2016-12-11T00:49:34Z","Content":"\n\u003Cp\u003E\nStreaming - today the target is Tellumo. \n\u003C/p\u003E\n"},{"CreatedByName":"MaxL_1023","CreatedById":152317,"CreatedDateTime":"2016-12-11T03:01:29Z","Content":"\n\u003Cp\u003E\nObservations:\n\u003C/p\u003E\n\u003Cp\u003E\nFrom the surface of Tellumo, Lili orbits so quickly that you can see it moving without any time warping!\n\u003C/p\u003E\n\u003Cp\u003E\nHoly crap, Tellumo re-entry is insane!\n\u003C/p\u003E\n\u003Cp\u003E\nAntennas suck in 10x - time for more config editing!\n\u003C/p\u003E\n"},{"CreatedByName":"MaxL_1023","CreatedById":152317,"CreatedDateTime":"2016-12-12T00:18:35Z","Content":"\n\u003Cp\u003E\nStreaming now - a follow up mission to Tellumo/Lili, followed by an attempt to capture and land a Class A asteroid!\n\u003C/p\u003E\n"},{"CreatedByName":"MaxL_1023","CreatedById":152317,"CreatedDateTime":"2016-12-12T03:03:47Z","Content":"\n\u003Cp\u003E\nOk - Tellumo/Lili was bugged out just a bit - I messed a few things up. \n\u003C/p\u003E\n\u003Cp\u003E\nI have designed a ship which should be able to capture and land a Class A asteroid - I will stream that attempt tomorrow!\n\u003C/p\u003E\n"},{"CreatedByName":"MaxL_1023","CreatedById":152317,"CreatedDateTime":"2016-12-12T23:20:47Z","Content":"\n\u003Cp\u003E\nStreaming now - the asteroid Capture mission is a go!\n\u003C/p\u003E\n"},{"CreatedByName":"MaxL_1023","CreatedById":152317,"CreatedDateTime":"2016-12-13T01:29:46Z","Content":"\n\u003Cp\u003E\nOk - the CLASS A asteroid weighs \u003Cspan style=\u0022font-size:36px;\u0022\u003E15000 TONS!!!\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003EThis is not going to work as planned. \u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"MaxL_1023","CreatedById":152317,"CreatedDateTime":"2016-12-14T00:40:05Z","Content":"\n\u003Cp\u003E\nNow streaming the Gratian program!\n\u003C/p\u003E\n"},{"CreatedByName":"MaxL_1023","CreatedById":152317,"CreatedDateTime":"2016-12-15T01:20:16Z","Content":"\n\u003Cp\u003E\nThe lander is designed and the crew is ready - now streaming the first Kerballed mission to Gratian!\n\u003C/p\u003E\n"},{"CreatedByName":"MaxL_1023","CreatedById":152317,"CreatedDateTime":"2016-12-16T01:14:21Z","Content":"\n\u003Cp\u003E\nAfter returning home, the crew decides what to do next while the intrepid ion probe continues to explore. Streaming live on Twitch!\n\u003C/p\u003E\n"},{"CreatedByName":"MaxL_1023","CreatedById":152317,"CreatedDateTime":"2016-12-16T20:44:06Z","Content":"\n\u003Cp\u003E\nI have split apart my last few livestreams into a series of highlights based around mission objectives. If you are looking to see anything specific without needing to watch an entire recorded stream, this is the place. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.youtube.com/channel/UC0QP0BvaZg2x2z1YK3tt3AQ\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.youtube.com/channel/UC0QP0BvaZg2x2z1YK3tt3AQ\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"MaxL_1023","CreatedById":152317,"CreatedDateTime":"2016-12-17T02:38:01Z","Content":"\n\u003Cp\u003E\nNow streaming - we have 4 scientists in orbit and we need to return them to Gael! Problem is - their lab can\u0027t survive re-entry!\n\u003C/p\u003E\n"}]}