{"TopicId":147042,"ForumId":16,"TopicTitle":"Angle of Inclination","CreatedByName":"qoonpooka","CreatedById":134904,"CreatedDateTime":"2016-09-04T04:17:26Z","PageNum":1,"Articles":[{"CreatedByName":"qoonpooka","CreatedById":134904,"CreatedDateTime":"2016-09-04T04:17:26Z","Content":"\n\u003Cp\u003E\nSo I\u0027ve finally parked my first station around Minmus. It\u0027s got everything I\u0027ll want from it later: two orange tanks, lots of docking ports, plenty of monoprop and EC. Even got a nice contract to put it there (I would\u0027ve done so anyway, it\u0027s my interplanetary refueling station now.)\u003Cbr\u003E\u003Cbr\u003E\nThing is, I can\u0027t seem to get it\u0027s orbit fully equatorial.  5.3 degrees is the closest I can get, and I can\u0027t seem to find any combination of burns that get it closer.  The maneuver nodes are useless because they don\u0027t show me the AoI.  \u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKER\u003C/abbr\u003E doesn\u0027t help much, it only tells me where I\u0027m at, not how to get where I want to go; nor does it show the stats of the node\u0027s orbit...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAny advice on finding equatorial orbits on my own?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022U1kKkdZ.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022http://i.imgur.com/U1kKkdZ.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-09-04T04:18:18Z\u0022 title=\u002209/04/2016 04:18  AM\u0022 data-short=\u00227 yr\u0022\u003ESeptember 4, 2016\u003C/time\u003E by qoonpooka\u003C/strong\u003E\n\u003Cbr\u003EImage link broken\n\u003C/span\u003E\n"},{"CreatedByName":"IncongruousGoat","CreatedById":157062,"CreatedDateTime":"2016-09-04T04:52:09Z","Content":"\n\u003Cp\u003E\nIf you get your camera aligned parallel to the plane of the ecliptic, you should be able to eyeball where your orbit intercepts said plane, giving you the place you should burn. For the burn itself, you can try to plan it using a maneuver node, but it would probably be easier to just eyeball the whole thing and burn normal/antinormal until your orbit looks flat (or until \u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKER\u003C/abbr\u003E gives you a satisfactorily low number).\n\u003C/p\u003E\n\u003Cp\u003E\nThat said... Your station is in orbit of Minmus. Any incoming spacecraft will almost certainly have to perform some sort of correction burn to get into the plane of your space station anyways due to Minmus\u0027s inclined orbit, so other than aesthetics there\u0027s no reason to shoot for a perfectly equatorial orbit. Plus, the cost of plane-change maneuvers in high Minmus orbit is very low.\n\u003C/p\u003E\n"},{"CreatedByName":"HvP","CreatedById":146104,"CreatedDateTime":"2016-09-04T06:09:23Z","Content":"\n\u003Cp\u003E\nKerbal Engineer does have an option that will make this easier.\n\u003C/p\u003E\n\u003Cp\u003E\nIn the Flight Engineer box that\u0027s open in your screenshot click edit and find the Orbital subsection. You will find a list of available statistics that you can add to your information readouts. Among the info you can add are the ones for \u0022Time to Equ. \u003Cabbr title=\u0022Ascending Node\u0022\u003EAN\u003C/abbr\u003E\u0022 and \u0022Time to Equ. \u003Cabbr title=\u0022Descending Node\u0022\u003EDN\u003C/abbr\u003E\u0022. Click the \u0022INSTALL\u0022 button next to the appropriate selections. These will show a counter for how long until you reach your equatorial ascending node or descending node along your current orbit. When the timer ticks down to near 00 then just burn Normal (towards the north pole, the purple triangle on the navball) if you are at your descending node, or burn Anti-Normal (South, the purple triangle with dashes around it) if you are at your ascending node.\n\u003C/p\u003E\n\u003Cp\u003E\nNote, those selections are specifically for your inclination relative to the planetary body you are orbiting. If you want to find your inclination relative to another spacecraft that you want to rendezvous with then you need to go into the RENDEZVOUS subsection where it says \u0022Selected Category\u0022 in the \u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKER\u003C/abbr\u003E edit menu. From there choose \u0022Time to Rel. \u003Cabbr title=\u0022Ascending Node\u0022\u003EAN\u003C/abbr\u003E\u0022 or \u0022Time to Rel. \u003Cabbr title=\u0022Descending Node\u0022\u003EDN\u003C/abbr\u003E\u0022 to show when you need to burn to match planes with another craft you have targeted.\n\u003C/p\u003E\n\u003Cp\u003E\nYou can also add this information to your HUD displays by clicking the \u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKER\u003C/abbr\u003E toolbar icon and clicking the EDIT button next to the various items listed as \u0022Orbital\u0022, \u0022Vessel\u0022, \u0022Delta V\u0022, etc...\n\u003C/p\u003E\n\u003Cp\u003E\nThere is a treasure trove of other options too that you can add which you may find quite helpful.\n\u003C/p\u003E\n\u003Cp\u003E\nI hope this made sense.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-09-04T06:17:19Z\u0022 title=\u002209/04/2016 06:17  AM\u0022 data-short=\u00227 yr\u0022\u003ESeptember 4, 2016\u003C/time\u003E by HvP\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"OhioBob","CreatedById":128005,"CreatedDateTime":"2016-09-04T06:20:24Z","Content":"\n\u003Cp\u003E\nI believe \u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKER\u003C/abbr\u003E can give you \u003Cem\u003Eargument of periapsis\u003C/em\u003E (looks like you\u0027ll have to add it to your Orbital display).  Argument of periapsis is the angular distance between the ascending node and the point of periapsis.  This will allow you to estimate the location of the ascending node.  Once you\u0027ve estimated the location of the \u003Cabbr title=\u0022Ascending Node\u0022\u003EAN\u003C/abbr\u003E, place a maneuver node there and execute the plane change.\n\u003C/p\u003E\n\u003Cp\u003E\nFor example, if the argument of periapsis is 60 degrees, then the \u003Cabbr title=\u0022Ascending Node\u0022\u003EAN\u003C/abbr\u003E is 60 degrees before \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E.  You just have to be able to estimate a 60 degree angle to find the \u003Cabbr title=\u0022Ascending Node\u0022\u003EAN\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n(edit)\n\u003C/p\u003E\n\u003Cp\u003E\nWhile I was writing this, \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/146104-hvp/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022146104\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/146104-hvp/\u0022 rel=\u0022\u0022\u003E@HvP\u003C/a\u003E posted his solution.  I didn\u0027t realize that \u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKER\u003C/abbr\u003E included time to nodes.  I think his solution is easier than mine.\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-09-04T06:21:47Z\u0022 title=\u002209/04/2016 06:21  AM\u0022 data-short=\u00227 yr\u0022\u003ESeptember 4, 2016\u003C/time\u003E by OhioBob\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DD_bwest","CreatedById":164906,"CreatedDateTime":"2016-09-04T07:53:41Z","Content":"\n\u003Cp\u003E\n\u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKER\u003C/abbr\u003E should be able to give you the info needed..\n\u003C/p\u003E\n\u003Cp\u003E\nI use \u003Cabbr title=\u0022Mechjeb (mod)\u0022\u003EMJ\u003C/abbr\u003E for info windows, and what you should be looking for, as HvP mentioned, is the \u0022time to equatorial \u003Cabbr title=\u0022Descending Node\u0022\u003EDN\u003C/abbr\u003E\u0022 or \u003Cabbr title=\u0022Ascending Node\u0022\u003EAN\u003C/abbr\u003E.     youll want to burn as close to one of those as possible.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cabbr title=\u0022Mechjeb (mod)\u0022\u003EMJ\u003C/abbr\u003E has a manuever node editor that will also let you adjust your maneuver nodes directly on things like \u003Cabbr title=\u0022Ascending Node\u0022\u003EAN\u003C/abbr\u003E, \u003Cabbr title=\u0022Descending Node\u0022\u003EDN\u003C/abbr\u003E, ap, pe.\n\u003C/p\u003E\n"},{"CreatedByName":"fourfa","CreatedById":151713,"CreatedDateTime":"2016-09-04T17:52:27Z","Content":"\n\u003Cp\u003E\nmisread the \u003Cabbr title=\u0022Original Post(er). The first post in a thread, or the person who posted it.\u0022\u003EOP\u003C/abbr\u003E, sorry\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-09-04T17:53:41Z\u0022 title=\u002209/04/2016 05:53  PM\u0022 data-short=\u00227 yr\u0022\u003ESeptember 4, 2016\u003C/time\u003E by fourfa\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"qoonpooka","CreatedById":134904,"CreatedDateTime":"2016-09-05T02:35:58Z","Content":"\n\u003Cp\u003E\nThanks HvP! That was exactly what I needed!\n\u003C/p\u003E\n"}]}