{"TopicId":147243,"ForumId":20,"TopicTitle":"Mods to improve performance","CreatedByName":"Justin38","CreatedById":168211,"CreatedDateTime":"2016-09-07T18:42:24Z","PageNum":1,"Articles":[{"CreatedByName":"Justin38","CreatedById":168211,"CreatedDateTime":"2016-09-07T18:42:24Z","Content":"\n\u003Cp\u003E\nHello Everyone!\n\u003C/p\u003E\n\u003Cp\u003E\nI was wondering if anyone knew of any mods that help improve performance. Such as texture reductions. Also any tips on changing the settings in the game to improve performance?\n\u003C/p\u003E\n\u003Cp\u003E\nThanks!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"RA3236","CreatedById":150734,"CreatedDateTime":"2016-09-07T21:50:21Z","Content":"\n\u003Cp\u003E\nHi \u003Ca data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/168211-justin38/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022168211\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/168211-justin38/\u0022 rel=\u0022\u0022\u003E@Justin38\u003C/a\u003E,\n\u003C/p\u003E\n\u003Cp\u003E\nI understand your issue with performance, however, at the moment the most popular mod for increasing performance (DynamicTextureLoader) hasn\u0027t been updated to 1.1.\n\u003C/p\u003E\n\u003Cp\u003E\nFor your question on texture reductions, quite a few mods already do this (I especially use Ven\u0027s Stock Revamp).\n\u003C/p\u003E\n\u003Cp\u003E\nAnd for the settings, change all of the Graphics ones to minimum, and try upping them a bit until you get the balance between graphics and FPS. Try changing texture resolution and game quality especially, as these can hinder performance.\n\u003C/p\u003E\n"},{"CreatedByName":"DuoDex","CreatedById":107061,"CreatedDateTime":"2016-09-07T23:47:14Z","Content":"\n\u003Cp\u003E\nPunted to correct subforum.\n\u003C/p\u003E\n"},{"CreatedByName":"Norcalplanner","CreatedById":112223,"CreatedDateTime":"2016-09-08T06:33:13Z","Content":"\n\u003Cp\u003E\nKeep in mind that KSP is typically CPU-bound rather than GPU-bound.  With larger ships and hundreds of parts interacting with each other every frame, the game will take as much processor as you can throw at it to calculate all the in-game physics.  With 1.1 and 64 bit, the need for texture reductions really isn\u0027t there anymore.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat are the specs on your system?  I\u0027d recommend at least 8 GB of RAM, a dedicated graphics card, and a processor with at least two cores running at a decent speed.  In the meantime, cranking down the graphics settings will help a bit.  In particular, lower the quality of the aero fx, turn off ground scatter, choose low detail terrain, and use the quarter size texture option.\n\u003C/p\u003E\n"}]}