{"TopicId":147314,"ForumId":55,"TopicTitle":"Rocket Part Revamp Discussion Thread","CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2016-09-09T00:39:02Z","PageNum":13,"Articles":[{"CreatedByName":"Spacetraindriver","CreatedById":149403,"CreatedDateTime":"2016-12-19T18:33:39Z","Content":"\n\u003Cp\u003E\nGeez this went from \u0022Ohh cool new models!\u0022 To \u0022WE MUST REVAMP THE WHOLE GAME!!!\u0022 Everyone is looking at each part individually when it\u0027s all about what you do with those parts. No one launches just a fuel tank do they? The combination of all these parts to make a craft is what\u0027s important.\n\u003C/p\u003E\n\u003Cp\u003E\nI have nothing against any of the parts in the game, or the comedy, or style, personally, though if fuel tanks from Jeb\u0027s Junkyard look better than a HUGE company\u0027s (rokomax) then MAYBE we need a SLIGHT change. Or mods. MODS.\n\u003C/p\u003E\n"},{"CreatedByName":"Bloojay","CreatedById":162865,"CreatedDateTime":"2017-06-15T07:25:59Z","Content":"\n\u003Cp\u003E\nWill these ever make a Comeback? I know that the people managing KSP right now aren\u0027t the people who made it but surely they must want to do something like this\n\u003C/p\u003E\n"},{"CreatedByName":"Anuter","CreatedById":175934,"CreatedDateTime":"2017-06-15T08:43:07Z","Content":"\n\u003Cp\u003E\nSquad has recently presented some art for the DLC new parts, that show that textures can be toggleable. This feature plus the new parts are a good reason to finish the part revamp that was originally planned for the 1.2 version.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe real question is \u0022does it extend to base-game parts?\u0022\n\u003C/p\u003E\n"},{"CreatedByName":"klgraham1013","CreatedById":105132,"CreatedDateTime":"2017-06-15T12:58:51Z","Content":"\n\u003Cp\u003E\nI\u0027m highly doubtful we\u0027ll see an art pass until KSP2.\n\u003C/p\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2017-06-17T16:52:13Z","Content":"\n\u003Cp\u003E\nDISCLAIMER: What follows is my personal opinion to which people are free to agree with or repudiate at his or her discretion. My opinion represents exactly that. My opinion.\n\u003C/p\u003E\n\u003Cp\u003E\nTo be perfectly blunt, with KSP now in TT2\u0027s um... hands, I have no faith or hope or expectation to see the art pass ever happen. I simply do not believe they care enough to unify the graphics in such a way. I hope I am wrong I really do. Time will tell.\n\u003C/p\u003E\n\u003Cp\u003E\nDISCLAIMER: The preceding post is my personal opinion to which people are free to agree with or repudiate at his or her discretion. My opinion represents exactly that. My opinion.\n\u003C/p\u003E\n\u003Cp\u003E\ntime 11:52:20\n\u003C/p\u003E\n"}]}