{"TopicId":147685,"ForumId":44,"TopicTitle":"The Natural Base?","CreatedByName":"BT Industries","CreatedById":156823,"CreatedDateTime":"2016-09-14T22:29:44Z","PageNum":1,"Articles":[{"CreatedByName":"BT Industries","CreatedById":156823,"CreatedDateTime":"2016-09-14T22:29:44Z","Content":"\n\u003Cp\u003E\nI\u0027ve been thinking about this for a while and my question is:\n\u003C/p\u003E\n\u003Cp\u003E\nWhat is your opinion on there being a natural base or counting system?\n\u003C/p\u003E\n\u003Cp\u003E\nTaking a Platonic view of the universe, is there any \u0027system\u0027 to the universe regarding numbers, not just \u0027there are \u003Ci\u003Ex \u003C/i\u003Eapples\u0027?\n\u003C/p\u003E\n\u003Cp\u003E\nI mean, we might just be measuring the universe \u003Ci\u003Ewrong.\u003C/i\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nMost people would probably default to either base one or binary (base two), but \u003Ci\u003Ewhy? \u003C/i\u003EIs there any reason that the numbers one and two are \u003Ci\u003Especial? \u003C/i\u003EThis brings us to my second questions:\n\u003C/p\u003E\n\u003Cp\u003E\nIntegers. Why are they considered different and get precedence over other numbers? What is even the \u003Ci\u003Edefinition \u003C/i\u003Eof an integer, I mean even though the number 5 doesn\u0027t have any decimals in base ten, if written in base Pi, it\u0027s irrational. It might also be that \u003Ci\u003Ex \u003C/i\u003Ewhole apples are necessarily an integer number of apples, but the operating word is \u003Ci\u003Ewhole \u003C/i\u003Eand it might just be us that are centred around whole, full and integer, even though they might not be \u003Ci\u003Edifferent \u003C/i\u003E or \u003Ci\u003Especial \u003C/i\u003Ein any way.\n\u003C/p\u003E\n\u003Cp\u003E\n-T\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n(P.S. Maths counts as science in this forum \u003Ci\u003Eright?\u003C/i\u003E)\n\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2016-09-14T22:42:45Z","Content":"\n\u003Cp\u003E\nWhat\u0027s more important is the idea of numbers and counting with them. The bases and systems used are arbitrary, so long as they can be successfully used.\n\u003C/p\u003E\n\u003Cp\u003E\nSince logarithm base e is called the natural logarithm, then the natural base would be e... But that\u0027s a base in the context of exponents and logarithms.\n\u003C/p\u003E\n"},{"CreatedByName":"LN400","CreatedById":140595,"CreatedDateTime":"2016-09-15T00:11:01Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222756885\u0022 data-ipsquote-contentid=\u0022147685\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221473892184\u0022 data-ipsquote-userid=\u0022156823\u0022 data-ipsquote-username=\u0022BT Industries\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, BT Industries said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027ve been thinking about this for a while and my question is:\n\u003C/p\u003E\n\u003Cp\u003E\nWhat is your opinion on there being a natural base or counting system?\u003Cstrong\u003E [Q1]\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nTaking a Platonic view of the universe, is there any \u0027system\u0027 to the universe regarding numbers, not just \u0027there are \u003Ci\u003Ex \u003C/i\u003Eapples\u0027? \u003Cstrong\u003E[Q2]\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI mean, we might just be measuring the universe \u003Ci\u003Ewrong.\u003C/i\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nMost people would probably default to either base one or binary (base two), but \u003Ci\u003Ewhy? \u003C/i\u003EIs there any reason that the numbers one and two are \u003Ci\u003Especial? \u003C/i\u003E\u003Cstrong\u003E[Q3]\u003C/strong\u003E\u003Ci\u003E \u003C/i\u003EThis brings us to my second questions:\n\u003C/p\u003E\n\u003Cp\u003E\nIntegers. Why are they considered different and get precedence over other numbers? \u003Cstrong\u003E[Q4]\u003C/strong\u003E What is even the \u003Ci\u003Edefinition \u003C/i\u003Eof an integer, I mean even though the number 5 doesn\u0027t have any decimals in base ten, if written in base Pi, it\u0027s irrational. It might also be that \u003Ci\u003Ex \u003C/i\u003Ewhole apples are necessarily an integer number of apples, but the operating word is \u003Ci\u003Ewhole \u003C/i\u003Eand it might just be us that are centred around whole, full and integer, even though they might not be \u003Ci\u003Edifferent \u003C/i\u003E or \u003Ci\u003Especial \u003C/i\u003Ein any way.\n\u003C/p\u003E\n\u003Cp\u003E\n-T\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n(P.S. Maths counts as science in this forum \u003Ci\u003Eright?\u003C/i\u003E)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nMy 2.14632... cents:\n\u003C/p\u003E\n\u003Cp\u003E\nA1: I don\u0027t think any number is more natural than others, What it comes down to is notation and only that. The value of a number is independent from whichever symbols we choose. A base number is there for no other reason than to allow a consistent system of notation.\n\u003C/p\u003E\n\u003Cp\u003E\nA2: If the physicists are correct then there is a system. By that I mean there are laws of nature that are the same wherever you go. That\u0027s system right there. The maths in science is not about describing some kind of absolute reality but to allow us to predict future events when the initial conditions are known. They create models of the real world, models with a limited field of applications. So far, physics have shown some staggering promise and many mathematicians and physicists are themselves amazed at how well maths can be used to describe and predict. This speaks for a systematic universe.\n\u003C/p\u003E\n\u003Cp\u003E\n A3: 1 and 2 are not special in base 2. 0 and 1 are. There are 2 symbols for a very good reason. If you think of them not as numbers but 2 different  logical statements, then you have here the minimum number of logical statements that still allows conveying of information. Everything can be expressed using 2 and only 2 symbols, the complete work of Shakespeare can be written in 0s and 1s. Less than 2 statementss and it is impossible to convey information. 2 is therefor the lowest number of digits one can construct a consistent number system from. It doesn\u0027t mean it\u0027s more natural or easier to use though,\n\u003C/p\u003E\n\u003Cp\u003E\nA4: To look at integers, one need to look at 2 other values first: The Unit and no units. An integer is nothing more than a value constructed entirely of units. If pi is your base, then pi/pi becomes the unit and since that is constructed of units, then it is an integer and 5 isn\u0027t. Pi/pi can then be written using the symbol 1 but 5 would be a symbol for an irrational number just like pi is in base 10. Integers aren\u0027t more special than that but once you have a set of integers, then they will share some properties not shared by any onther, non-integer number.\n\u003C/p\u003E\n\u003Cp\u003E\nAnother thing is, we have created a universe of mathematics based on how we percieve the world. We see 1 apple, 34 sheep. We count units because that\u0027s how our brains and sensory organs are wired. It allows us to function in a society. We understand that 1 sheep is not 2 sheep, we understand that if we have some sheep and lose a few then we will have fewer sheep than before. We count units and we created systems that allow us to note down on clay or paper how much of this and that we have. One such system is the base 10 system we use, with symbols slowly getting acceptance before being agreed on they work for our purposes.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnyway, just my take on it.\n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2016-09-15T05:41:23Z","Content":"\n\u003Cp\u003E\nBecause apples have clear borders. When there are hundreds of apples, we count them by weight and not necessary in integer numbers.\u003Cbr\u003E\nInteger numbers mark clicks when you cross a border.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-09-15T05:41:44Z\u0022 title=\u002209/15/2016 05:41  AM\u0022 data-short=\u00227 yr\u0022\u003ESeptember 15, 2016\u003C/time\u003E by kerbiloid\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"wumpus","CreatedById":133850,"CreatedDateTime":"2016-09-15T22:55:56Z","Content":"\n\u003Cp\u003E\nSince base 2 can\u0027t be reduced, it would presumably count.  But that is hardly the only way to represent numbers.\n\u003C/p\u003E\n\u003Cp\u003E\nConsider the Godel base system: describe a number by multiplying prime numbers together (I think his system used only single primes and thus was sparse, perhaps some sort of inductive means to describe the numbers of each prime...).  Also using only ones and zeros hardly forces you to use binary.  Binary is simply the most efficient means to code numbers with ones and zeros if you want to describe integers equally.  But try looking up arithmetic coding (typically used in data compression, especially compared to Huffman compression): you can encode different bases (not just powers of 2) efficiently in binary (of course there will be leftovers for finite numbers when not using powers of 2).\n\u003C/p\u003E\n\u003Cp\u003E\nI really don\u0027t think this can be answered (unless you really pull off a base-e system.  And then only if you manage to pull it off without \u0022cheating\u0022 by using arithmetic compression).  But I see no reason to believe that adding various powers of a single number times various coefficients is the only \u0027natural\u0027 number system.\n\u003C/p\u003E\n"},{"CreatedByName":"cubinator","CreatedById":150330,"CreatedDateTime":"2016-09-16T00:01:11Z","Content":"\n\u003Cp\u003E\n4 is the base for life on Earth, so that might be something.\n\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2016-09-16T00:08:02Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222758795\u0022 data-ipsquote-contentid=\u0022147685\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221473980156\u0022 data-ipsquote-userid=\u0022133850\u0022 data-ipsquote-username=\u0022wumpus\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n43 minutes ago, wumpus said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSince base 2 can\u0027t be reduced, it would presumably count.  But that is hardly the only way to represent numbers.\n\u003C/p\u003E\n\u003Cp\u003E\nConsider the Godel base system: describe a number by multiplying prime numbers together (I think his system used only single primes and thus was sparse, perhaps some sort of inductive means to describe the numbers of each prime...).  Also using only ones and zeros hardly forces you to use binary.  Binary is simply the most efficient means to code numbers with ones and zeros if you want to describe integers equally.  But try looking up arithmetic coding (typically used in data compression, especially compared to Huffman compression): you can encode different bases (not just powers of 2) efficiently in binary (of course there will be leftovers for finite numbers when not using powers of 2).\n\u003C/p\u003E\n\u003Cp\u003E\nI really don\u0027t think this can be answered (unless you really pull off a base-e system.  And then only if you manage to pull it off without \u0022cheating\u0022 by using arithmetic compression).  But I see no reason to believe that adding various powers of a single number times various coefficients is the only \u0027natural\u0027 number system.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBase 2 is not very practical for brains like ours, its perfect for digital stuff who is on or off. Note that flash memory tend have four values in an cell making it base 4. \u003Cbr\u003E\nFor us its base 10 as we started with counting on fingers, most cultures tend to use base 5, know from roman numbers but lots of civilizations had the same base 5 system. \u003Cbr\u003E\nBase 10 is better as it gives shorter numbers while its easy to remember the numbering. Roman numbers and the other systems are also hopeless for doing math. \u003Cbr\u003E\nWas the Arab numbers developed by traders and accountants in India? makes some sense. \u003Cbr\u003E\u003Cbr\u003E\nAn alien is likely to follow this, number of fingers and you want an reasonable high number, you could get away with three fingers if flexible like three thumbs however base 3 would be low so you go for 6 or perhaps 12. \u003Cbr\u003E\nOT / OT Fermi tread crossover/  could an bad numbering system hurt you say you discover printing and push for literacy while using something as impractical for calculation as roman numbers. \u003Cbr\u003E\nOr would people working with numbers develop something more like the arab numerals base 8-20 is irrelevant for their own use, probably convert before doing public presentation like US scientists use the metric system outside of public stuff. \n\u003C/p\u003E\n"},{"CreatedByName":"LN400","CreatedById":140595,"CreatedDateTime":"2016-09-16T08:05:38Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222758915\u0022 data-ipsquote-contentid=\u0022147685\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221473984482\u0022 data-ipsquote-userid=\u002257801\u0022 data-ipsquote-username=\u0022magnemoe\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, magnemoe said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBase 10 is better as it gives shorter numbers while its easy to remember the numbering. Roman numbers and the other systems are also hopeless for doing math. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe huge difference between base anything systems as we know them, and Roman numerals is we have a positional system and the Romans, at best, had a pseudo-positional system. That\u0027s the difference that makes it possible for us to do calculus. Any Roman trying to invent calculus would have be droven mad.\n\u003C/p\u003E\n\u003Cp\u003E\nAnother thing is, there are societies today where the people traditionally had no concept of numbers greater than say 3. To them, the entire number universe consisted of these numbers: One, two and three. Any number greater than 3 was not considered a number but was to them \u0022many\u0022 a bit like we use infinity. Negative numbers, don\u0027t be ridiculous. Fractions, forget it, has nothing to do with numbers, they would think. They are still modern humans but their culture took some turns that eventually led to this.\n\u003C/p\u003E\n\u003Cp\u003E\nEDIT: Perhaps another interesting question would be: Are positional systems the way to go, or could there be other systems that inherently includes the properties of a positional system while also possessing other properties that could be extremely useful in describing the world around us?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-09-16T08:21:29Z\u0022 title=\u002209/16/2016 08:21  AM\u0022 data-short=\u00227 yr\u0022\u003ESeptember 16, 2016\u003C/time\u003E by LN400\u003C/strong\u003E\n\u003C/span\u003E\n"}]}