{"TopicId":147601,"ForumId":16,"TopicTitle":"Bases fall apart when I come back to them","CreatedByName":"Spodershibe","CreatedById":150741,"CreatedDateTime":"2016-09-14T03:11:26Z","PageNum":1,"Articles":[{"CreatedByName":"Spodershibe","CreatedById":150741,"CreatedDateTime":"2016-09-14T03:11:26Z","Content":"\n\u003Cp\u003E\nSo I leave my base for a couple years to go do something else, and then I come back to it, and it completely runs down. Parts randomly detach from it, parts break, and my base is rendered unusable, with my Kerbals doomed to eternity at a broken base. Is there something I should be doing? Is it one of my mods?\n\u003C/p\u003E\n"},{"CreatedByName":"DrLicor","CreatedById":165712,"CreatedDateTime":"2016-09-20T08:53:51Z","Content":"\n\u003Cp\u003E\nHmm thats how the game should work, never had this.\n\u003C/p\u003E\n\u003Cp\u003E\nHave you installed mods during this savegame?\n\u003C/p\u003E\n\u003Cp\u003E\nInstalling mods can mess up with saves, especially with existing ships/bases.\n\u003C/p\u003E\n\u003Cp\u003E\nYou also could install:\n\u003C/p\u003E\n\u003Ciframe data-embedcontent=\u0022\u0022 frameborder=\u00220\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/50911-113-kerbal-joint-reinforcement-v32-63016-now-with-win64-compatibility/\u0026amp;do=embed\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\nAnd when loading a base, acitvate the cheat menu (alt\u002BF12) and activate the unbreakable joints.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-09-21T15:18:00Z","Content":"\n\u003Cp\u003E\nBases can be... odd sometimes.  They can get into clipping problems with terrain, where when you come back to them, the game decides \u0022oh noes, object intersecting terrain!\u0022 and treats it like a collision, flinging stuff upwards, and general hilarity ensues.  (Not sure if this is what you\u0027re running into, but it might be.)\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve had pretty good luck with bases in which I make sure that \u003Cem\u003E\u003Cu\u003Enothing touches the ground except lander legs\u003C/u\u003E\u003C/em\u003E.  That is, each component of my base is standing on legs.  The game \u003Cem\u003E\u003Cu\u003Edoes\u003C/u\u003E\u003C/em\u003E handle \u0022standing on legs on the ground\u0022 well, and I generally don\u0027t have problem with stuff leaping as long as follow this design principle.\n\u003C/p\u003E\n"}]}