{"TopicId":147984,"ForumId":16,"TopicTitle":"Need Advice - Rover Construction","CreatedByName":"shadragon","CreatedById":167998,"CreatedDateTime":"2016-09-17T20:39:36Z","PageNum":1,"Articles":[{"CreatedByName":"shadragon","CreatedById":167998,"CreatedDateTime":"2016-09-17T20:39:36Z","Content":"\n\u003Cp\u003E\nHi Guys and Gals, \n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m building a rover to take on the monstrous gravity and severe environmental conditions of Minmus. Ok, ok, I\u0027ll be using it elsewhere as well. The concept was to have a science jr mounted on top in the center (center of mass) then attach a coupler to the top of that and detach from a landing vehicle to be designed later. There\u0027s more stuff to go on, but not until I solve this major issue. \n\u003C/p\u003E\n\u003Cp\u003E\nI made a single girder width rover, but it was too tippy, so I widened it. However, now I can\u0027t find a way to get a mount point on top near center of mass without way too many compromises.  \n\u003C/p\u003E\n\u003Cp\u003E\nAny ideas welcome. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E Craft File here: \u003Ca href=\u0022https://drive.google.com/open?id=0ByOS7LT3mpnBUzJtRC1wMnRTeDg\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://drive.google.com/open?id=0ByOS7LT3mpnBUzJtRC1wMnRTeDg\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"LN400","CreatedById":140595,"CreatedDateTime":"2016-09-17T21:25:10Z","Content":"\n\u003Cp\u003E\nI had a look at it. Try this:\n\u003C/p\u003E\n\u003Cp\u003E\nPlace a Science Jr somewhere near the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E. It doesn\u0027t have to be spot on but somewhere near is good. Rotate it to face the right way.\n\u003C/p\u003E\n\u003Cp\u003E\nNow use the \u0022Tool Move\u0022 button in the \u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E and drag the part to \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E. Hold down shift while dragging for fine tuning.\n\u003C/p\u003E\n\u003Cp\u003E\nI managed to get it facing right side up, bottom flush with the bottom of the chassis, smack dab in the middle of \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E.\n\u003C/p\u003E\n"},{"CreatedByName":"shadragon","CreatedById":167998,"CreatedDateTime":"2016-09-18T00:48:58Z","Content":"\n\u003Cp\u003E\nWorked after a fashion. I kept hitting an invisible wall that didn\u0027t allow me to pull it all the way, so I used an octagonal strut to mount it, then pulled and rotated it into position. Sitting on the launch pad now. Cheers. \n\u003C/p\u003E\n"}]}