{"TopicId":148186,"ForumId":44,"TopicTitle":"Vandenberg AFB Canyon Fire","CreatedByName":"Rybo","CreatedById":154876,"CreatedDateTime":"2016-09-20T01:14:27Z","PageNum":1,"Articles":[{"CreatedByName":"Rybo","CreatedById":154876,"CreatedDateTime":"2016-09-20T01:14:27Z","Content":"\n\u003Cp\u003E\nI\u0027m sure some of you are aware but for those that aren\u0027t there is currently a wildfire burning on Vandeberg AFB South Base (where all the major SLCs are). The news reports are slow and hardly accurate so I will do my best to provide accurate details as I receive them and clear up some of the misguided info being disseminated.\n\u003C/p\u003E\n\u003Cp\u003E\nThe fire started on Saturday 9/17/16 at approximately 5:20PM local. Cause is still undetermined but the rumor on base is arson as there was no lightning producing storms in the area. There are two main rumored motives for arson currently circulating (AKA what I\u0027ve overheard while eating meals at the BX): delay/destroy WorldView-4, or further damage SpaceX. The latter is not as common but boy do the people that think that have vivid imaginations. I\u0027ve heard crazy stuff ranging from \u0022ULA can\u0027t handle the competition and saw an opportunity to take SpaceX down\u0022 to \u0022I saw Tory Bruno himself hiking in that area on Saturday...just sayin.\u0022 Personally, I suspect something much less sinister (but still stupid) like someone tossing a lit cigarette butt out the car window on their way to work. I see it happen two to three times a day and it seems the most logical explanation.\n\u003C/p\u003E\n\u003Cp\u003E\nAs of 4:45ish this afternoon my supervisor told me that he was told by the 30th Space Wing commander that the fire has grown to just under 6,000 acres and continues to burn in a northwesterly direction almost directly towards SLC-3 where AV-062 and WorldView-4 are inside the MST. It remains 0% contained and the fire line is currently 1.2 miles away and moving towards the SLC at an approximate rate of 100 feet per hour. Simple math says that if it continues at that rate the fire will reach the SLC-3 perimeter in about 63 hours. The firefighting crew consists of about 560 people from various agencies (one of whom is my uncle from Cal Fire that coordinates the S-2 retardant drops).\n\u003C/p\u003E\n\u003Cp\u003E\nNow here\u0027s what the news gets wrong: The launch of WorldView 4 was NOT TECHNICALLY DELAYED BY THE FIRE. Rather, it was delayed by the lack of necessary personnel to staff the launch. Weather briefings are GO across the board with the winds keeping the smoke and ash mostly south of the pad and blowing out to the southwest. Some firefighter we talked to explained it with some firefighter jargon but the gist of it is that due to convective patterns wildfires tend to burn in a direction somewhat orthogonal to the horizontal component of the velocity vector of the wind. So that\u0027s how the wind is mostly blowing southwesterly but the fire is mostly burning northwesterly. If that\u0027s actually why, I haven\u0027t got a clue. But the winds here are generally blowing to the southeast and fire is generally burning to the northwest so I can\u0027t argue.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ll do my best to keep this updated with current info but I don\u0027t frequent the forums as often as I used to. If you have questions I will do my best to answer them if I can.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, my apologies if this is the incorrect forum. Moderators feel free to move it as needed.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-09-20T01:17:09Z\u0022 title=\u002209/20/2016 01:17  AM\u0022 data-short=\u00227 yr\u0022\u003ESeptember 20, 2016\u003C/time\u003E by Rybo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Dman979","CreatedById":123837,"CreatedDateTime":"2016-09-20T01:51:10Z","Content":"\n\u003Cp\u003E\nWell.\n\u003C/p\u003E\n\u003Cp\u003E\nI didn\u0027t know this was even happening. Thank you for being my only sourced on this.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m assuming that you work at Vandenberg? Also, what are SLCs?\n\u003C/p\u003E\n"},{"CreatedByName":"insert_name","CreatedById":150339,"CreatedDateTime":"2016-09-20T02:13:19Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222765406\u0022 data-ipsquote-contentid=\u0022148186\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221474336270\u0022 data-ipsquote-userid=\u0022123837\u0022 data-ipsquote-username=\u0022Dman979\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n15 minutes ago, Dman979 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWell.\n\u003C/p\u003E\n\u003Cp\u003E\nI didn\u0027t know this was even happening. Thank you for being my only sourced on this.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m assuming that you work at Vandenberg? Also, what are SLCs?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSLC is an acronym for Space Launch Complex. \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/154876-rybo/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022154876\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/154876-rybo/\u0022 rel=\u0022\u0022\u003E@Rybo\u003C/a\u003Ealso is the fire entirely on the base?\n\u003C/p\u003E\n"},{"CreatedByName":"Rybo","CreatedById":154876,"CreatedDateTime":"2016-09-20T03:01:05Z","Content":"\n\u003Cp\u003E\nIt is \u003Cem\u003Ealmost\u003C/em\u003E entirely contained on South Base. A VERY small portion (several hundred square feet at most) of private land on the east of the base (just south of Honda Creek) is burning. The exact-ish location is this stand of trees here: \u003Ca href=\u0022https://www.google.com/maps/place/Vandenberg\u002BAir\u002BForce\u002BBase/@34.5885295,-120.5466949,413m/data=!3m1!1e3!4m5!3m4!1s0x0:0xd7ea9c09f025e90f!8m2!3d34.7420267!4d-120.5724404\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.google.com/maps/place/Vandenberg\u002BAir\u002BForce\u002BBase/@34.5885295,-120.5466949,413m/data=!3m1!1e3!4m5!3m4!1s0x0:0xd7ea9c09f025e90f!8m2!3d34.7420267!4d-120.5724404\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nMy understanding is that 1) it isn\u0027t expected to continue burning in that direction due to less dry fuel and 2) efforts there are a significantly lower priority than protecting SLC-3. If you include the Atlas V, WorldView-4, fuel, and SLC-3 facilities, total value is upward of 1.5 billion USD, probably closer to 2 billion USD.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/123837-dman979/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022123837\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/123837-dman979/\u0022 rel=\u0022\u0022\u003E@Dman979\u003C/a\u003E I work for Lockheed Martin and I am currently on TDY at Vandenberg.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI would also like to further clarify the reason for the WV-4 delay. For all launches a there are USAF firefighter and hazmat teams standing by in the event of a catastrophic failure. Launch can not and will not proceed without them in place. When the wildfire broke out they were re-tasked with containment and thus can\u0027t be on launch duty. In my humble non-firefighter opinion the 26th is an EXTREMELY optimistic launch date. However, if they are able to bring in more Cal Fire or US Forestry Service dudes they may be able to spare the required launch personnel which is what I HOPE happens. \n\u003C/p\u003E\n"},{"CreatedByName":"Rybo","CreatedById":154876,"CreatedDateTime":"2016-09-20T16:38:05Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003EUpdate as of 9/20 at 8AM local\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe fire doubled in size overnight and is now just over 10,200 acres. South Base is no longer accessible to anyone except firefighting and other emergency personnel. It is now less than 1 mile from SLC-3, It has burned all the way to the SLC-6 (ULA pad where the Deltas launch) perimeter, and it\u0027s about a third of a mile from SLC-4 (SpaceX pad). It is my understanding that they have a Falcon 9 in their processing facility but luckily, SLC-6 is mostly vacant. SLC-8 is also threatened, but protecting it is a much lower priority. For those that may be curious, SLC-2 that has the Delta II for already erected for JPSS-1 is on North Base west of the runway and is not threatened.\n\u003C/p\u003E\n\u003Cp\u003E\nLooking on Google Maps I measured the distance from where it looks like the fire is to SLC-3 and it looks like it is between 4,500 and 4,800 feet away. It jumped Bear Canyon Rd and Spring Canyon Rd overnight but firefighters dug a massive trench which has slowed most of the fire line closest to SLC-3 from advancing. Hopefully it doesn\u0027t jump it like it did the previous lines. Overall containment is estimated to be 15-22%.  Airborne firefighting efforts resumed around 7am as soon as it was light enough to safely do so and will continue until there isn\u0027t enough daylight with an emphasis on the lines and trenches protecting the SLCs. A coworker told me this morning that on his drive in he saw some of the helos filling their buckets up at the Home Depot in Lompoc.\n\u003C/p\u003E\n\u003Cp\u003E\nWinds are still keeping most of the smoke and ash south of the pad. The wind is generally calm but somewhat erratic with the fringes of tropical storm Paine beginning to push into SoCal. Unfortunately the rain coming with Paine are expected to stay well south of VAFB and there is no rain in the forecast in the foreseeable future.\n\u003C/p\u003E\n\u003Cp\u003E\nI have also confirmed that some of the facilities at SLC-3 are some of the facilities mentioned in the news as being on generator power. The spacecraft and rocket remain healthy but most of the WV-4 folks I\u0027ve talked to are sweating bullets. Scratch that...they are sweating M1A1 Abrams shells. And understandably so.\n\u003C/p\u003E\n\u003Cp\u003E\nLastly, if any of you live in the area and have access to Vandenberg AFB with an appropriate DBIDS or CAC card, the 30th Civil Engineering Squadron is accepting food and snack donations for the firefighters. They are set up in the command conference room in building 11442 off of Utah Ave.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-09-20T16:44:51Z\u0022 title=\u002209/20/2016 04:44  PM\u0022 data-short=\u00227 yr\u0022\u003ESeptember 20, 2016\u003C/time\u003E by Rybo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Rybo","CreatedById":154876,"CreatedDateTime":"2016-09-20T17:43:58Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003EUpdate as of 9/20 at 10AM local\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nFire is now over 11,000 acres but fire lines are holding near all SLCs. I have confirmed that SpaceX has a Falcon 9 at their facility along with 10 Iridium sats. \n\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2016-09-20T18:04:04Z","Content":"\n\u003Cp\u003E\nAre firefighters allowed to use counter-fires? Wind direction seems to be favourable - blowing towards the main fire. Or is that tactic a no-go because of the vicinity of many vulnerable obiects?\n\u003C/p\u003E\n"},{"CreatedByName":"Jovus","CreatedById":117163,"CreatedDateTime":"2016-09-20T18:34:18Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/154876-rybo/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022154876\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/154876-rybo/\u0022 rel=\u0022\u0022\u003E@Rybo\u003C/a\u003E this is really cool that you\u0027ve made this thread to keep us updated. Thanks.\n\u003C/p\u003E\n\u003Cp\u003E\nYou\u0027re making me wish I were near Vandenberg to help out.\n\u003C/p\u003E\n\u003Cp\u003E\nI had idly wondered if the fire had something to do with the hydrogen leak that scrubbed the launch initially, but it\u0027s clear from this that no, it doesn\u0027t. Speaking of, you said that (as far as you know) the rocket itself is green across the board?\n\u003C/p\u003E\n\u003Cp\u003E\nKnow that at least some of us are paying attention to this and rooting for ULA. Just \u0027cause we like SpaceX doesn\u0027t mean we don\u0027t like you too. There are never enough rockets in the sky.\n\u003C/p\u003E\n"},{"CreatedByName":"Rybo","CreatedById":154876,"CreatedDateTime":"2016-09-20T19:59:32Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003EUpdate as of 9/20 at 12PM local\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nSlightly improved containment numbers but only because parts of the fire have reached coastal areas with less fuel and those areas are containing themselves, so to speak. Growth has continued but I don\u0027t have an official acreage number yet. I don\u0027t have confirmation but rumors are that fire has started to burn down into the valley just southwest of the pad. This is considered an extremely high risk area because the hydrazine storage tanks are buried underground just northwest of the SLC-3 fence about 800-1000 feet away. There are 3 towers with IR sensors on top that are pointed at the tanks that can be seen here: \u003Ca href=\u0022https://www.google.com/maps/@34.6397972,-120.5901545,58m/data=!3m1!1e3\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.google.com/maps/@34.6397972,-120.5901545,58m/data=!3m1!1e3\u003C/a\u003E My best guess is that if the fire burns into that valley the IR sensors will get saturated with heat and no longer provide accurate information on the status of the hydrazine tanks. I will try to find out if if the tanks have anything in them.\n\u003C/p\u003E\n\u003Cp\u003E\nAnother rumor (and my primary concern) is that the air intakes for the SLC-3 facilities will quickly be overwhelmed by the smoke and particulate matter. Many parts of the inside of the MST are clean rooms, specifically the bottom floor where the flame bucket and the RD-180 nozzles are, the 4th or 5th floor where one of the avionics service bay access doors is, and the 14th-17th floors where the payload and fairing mates to the centaur. There is also a comms room underneath the pad we call the meat locker (temperature is kept around 58 degrees F) that is a very low level clean room. The umbilical that connects to the payload prior to launch runs throughout the entire length of the tower and terminates in this room and is connected to several large sets of equipment called \u0022test sets\u0022 or \u0022racks\u0022 used to command and communicate with the spacecraft. Lack of adequate airflow also results in heat buildup which can be detrimental to both the rocket and the spacecraft.\n\u003C/p\u003E\n\u003Cp\u003E\nPersonal side note...the smell of smoke has been present since Sunday on North Base, but it got MUCH stronger today. Went to lunch at Sissy\u0027s in Lompoc and had some ash on the car when I left which is the first time this has happened to me since it all started. I usually eat at the BX or the Pacific Coast Club though so that\u0027s probably why I haven\u0027t seen ash until now.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/57622-scotius/\u0026amp;do=hovercard\u0022 data-mentionid=\u002257622\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/57622-scotius/\u0022 rel=\u0022\u0022\u003E@Scotius\u003C/a\u003E Winds are variable to the southeast. I\u0027m assuming by counter-fires you mean controlled burns. I\u0027m no expert but to me it would see that it\u0027s simply too late and too high risk for that now.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/117163-jovus/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022117163\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/117163-jovus/\u0022 rel=\u0022\u0022\u003E@Jovus\u003C/a\u003E Glad you like the thread. I figured if something like this would matter to anyone it would be this community. The latest health update I got was a few hours ago but at the time, yes, AV-062 and WorldView-4 were both healthy and happy. This could quickly change if the particle counters in the clean rooms get angry and tell the launch team that there is crap in the air. I will do my best to get better info if I can, however, I\u0027m not directly supporting this launch so I don\u0027t have any real need-to-know. As such, I\u0027m trying not to ask for too much but I\u0027ll keep providing updates as I get them.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-09-21T23:38:53Z\u0022 title=\u002209/21/2016 11:38  PM\u0022 data-short=\u00227 yr\u0022\u003ESeptember 21, 2016\u003C/time\u003E by Rybo\u003C/strong\u003E\n\u003Cbr\u003Etypo\n\u003C/span\u003E\n"},{"CreatedByName":"Rybo","CreatedById":154876,"CreatedDateTime":"2016-09-21T16:46:27Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003EUpdate as of 9/21 at 8:30AM local\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe acreage total in this mornings briefing was 13,100 acres total with 55% containment. The IR image from last nights overflight is haunting. I expect that Justin Ray will be given a copy sometime today to publish to Spaceflight Now. Firefighting crews were complemented late yesterday afternoon with about 400 new personnel from various agencies. I don\u0027t remember the exact number but somewhere around 1,200 total emergency personnel, of which about 1,000 are directly involved with fighting the fire. Big progress was made late last night and early this morning and all of the major fire lines are holding very well. Winds today are expected to be stronger (15-20mph) and shifting to the northwest which is expected to help the fight. As mentioned before, fires tend to burn orthogonal to the wind (still not sure I understand how or why, but I trust that the firefighter that explained it to me knows more about it than I do). In theory the fire should start pushing more towards the southwest or northeast and take some of the pressure off the crews manning the lines protecting the SLCs.\n\u003C/p\u003E\n\u003Cp\u003E\nULA and WorldView-4 techs and engineers were also allowed limited access to a portion of the pad facilities and the booster and payload remain GO for launch. The clean room air handlers were inspected and are in better shape than originally thought and the particle counters show no increase in particulate matter over the last 48 hours. At this point the outlook has certainly improved but it\u0027s far from over. The huge flames and the eerie glow at night looking from North Base to South Base still have me doubt if the 26th is really doable for launch but the Commander remains confident in his firefighting airmen and the crews helping them.\n\u003C/p\u003E\n"},{"CreatedByName":"_Augustus_","CreatedById":115084,"CreatedDateTime":"2016-09-21T17:07:20Z","Content":"\n\u003Cp\u003E\nHow are the other rockets currently?\n\u003C/p\u003E\n"},{"CreatedByName":"Rybo","CreatedById":154876,"CreatedDateTime":"2016-09-21T17:40:13Z","Content":"\n\u003Cp\u003E\nF9-030 is safe inside the SpaceX processing facility along with the 10 Iridium sats. I believe that is the only other booster currently on South Base. To my knowledge, AV-068 is not at VAFB yet.\n\u003C/p\u003E\n"},{"CreatedByName":"_Augustus_","CreatedById":115084,"CreatedDateTime":"2016-09-21T17:54:04Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222767882\u0022 data-ipsquote-contentid=\u0022148186\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221474479613\u0022 data-ipsquote-userid=\u0022154876\u0022 data-ipsquote-username=\u0022Rybo\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n13 minutes ago, Rybo said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nF9-030 is safe inside the SpaceX processing facility along with the 10 Iridium sats. I believe that is the only other booster currently on South Base. To my knowledge, AV-068 is not at VAFB yet.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhen\u0027s the launch of F9-030?\n\u003C/p\u003E\n"},{"CreatedByName":"Rybo","CreatedById":154876,"CreatedDateTime":"2016-09-21T17:55:07Z","Content":"\n\u003Cp\u003E\nTBD.\n\u003C/p\u003E\n"},{"CreatedByName":"Mitchz95","CreatedById":82292,"CreatedDateTime":"2016-09-21T18:07:10Z","Content":"\n\u003Cp\u003E\nProbably not for a while, if they haven\u0027t found the cause of the Amos-6 failure yet.\n\u003C/p\u003E\n\u003Cp\u003E\nHow long did it take them to figure out CRS-7 again?\n\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2016-09-21T20:24:00Z","Content":"\n\u003Cp\u003E\n\u003Ca href=\u0022http://www.latimes.com/local/lanow/la-me-ln-vandenberg-fire-grows-20160921-snap-story.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.latimes.com/local/lanow/la-me-ln-vandenberg-fire-grows-20160921-snap-story.html\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nA firefighter has died after a rollover crash of a water tender.\n\u003C/p\u003E\n"},{"CreatedByName":"Rybo","CreatedById":154876,"CreatedDateTime":"2016-09-21T23:12:25Z","Content":"\n\u003Cp\u003E\nSuper sad, but if you\u0027ve ever driven through that roundabout it\u0027s easy to see how it could have happened. There are accidents there pretty frequently. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.google.com/maps/@34.664665,-120.4078546,233m/data=!3m1!1e3\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.google.com/maps/@34.664665,-120.4078546,233m/data=!3m1!1e3\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAs a side note, if you\u0027re ever visiting there is a kickass little strawberry stand that\u0027s usually set up 200-300 yards west of there. I\u0027m not sure the guy even speaks English but I\u0027m confident that they\u0027re the best strawberries on this planet.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/82292-mitchz95/\u0026amp;do=hovercard\u0022 data-mentionid=\u002282292\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/82292-mitchz95/\u0022 rel=\u0022\u0022\u003E@Mitchz95\u003C/a\u003E I wouldn\u0027t use that as a baseline to guess how long it will take. Generally speaking, in-flight failures are significantly harder to diagnose than a rocket sitting on the pad that is physically connected to a network. That said, I wouldn\u0027t be surprised if they don\u0027t launch again until early next year.\n\u003C/p\u003E\n"},{"CreatedByName":"Jovus","CreatedById":117163,"CreatedDateTime":"2016-09-21T23:16:49Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/154876-rybo/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022154876\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/154876-rybo/\u0022 rel=\u0022\u0022\u003E@Rybo\u003C/a\u003E I don\u0027t know how close you\u0027ve been following SpaceX, but the sounds they\u0027re making indicate they have no clue what caused the malfunction. Maybe that\u0027s changed, but apparently whatever-it-was didn\u0027t show up in any of their telemetry or diagnostics.\n\u003C/p\u003E\n\u003Cp\u003E\nGlad to hear that the rockets are still OK and the particle count didn\u0027t increase because of the smoke. Those clean rooms can be a real bear to re-clean if something gets through.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you know, what\u0027s the civilian damage from the fire so far? Are there neighborhoods or what-not near by? Unfortunately I\u0027ve never been in the Vandenberg area. Oh, and I take it no news is good news regarding the hydrazine tanks?\n\u003C/p\u003E\n"},{"CreatedByName":"Rybo","CreatedById":154876,"CreatedDateTime":"2016-09-21T23:36:10Z","Content":"\n\u003Cp\u003E\nI haven\u0027t been following their investigation too closely, but I\u0027m certainly rooting for them. Despite not seeing the cause yet, they still have access to WAY more information than they would have had if the booster had launched. Transmitting data over a physical umbilical is much easier, faster, and more efficient than sending it UHF once those umbilical lines are pulled at launch. At least that\u0027s the case with an Atlas. I\u0027m not familiar with their processes and sequences so perhaps they do something differently (but I don\u0027t know why they would).\n\u003C/p\u003E\n\u003Cp\u003E\nThere isn\u0027t really anything out there to worry about. Lots of farmland mostly, although I\u0027m not sure what the crops are. Best guess is soy or peanuts or some other small plant like that. There are a few structures around those fields but nothing noteworthy like a neighborhood. The biggest building I think is a large white barn that I think is used to store their field tractors.\n\u003C/p\u003E\n\u003Cp\u003E\nThe hydrazine tanks are fine....you would know if they weren\u0027t \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022:wink:\u0022\u003E Hydrazine makes big booms.\n\u003C/p\u003E\n"},{"CreatedByName":"Rybo","CreatedById":154876,"CreatedDateTime":"2016-09-22T01:47:44Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003EUpdate as of 9/21 at 6PM local\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nContainment continues to generally improve but some setbacks are expected tomorrow and/or Friday with high winds (25-30mph gusting to 40-50mph). Crews are prepping by doubling fire lines/breaks and the aviation component of the fight has been bolstered by an additional DC-10 that made several passes today. I\u0027m not sure where they are flying from since, to my knowledge, none of the closest airports (Lompoc, Santa Maria, Santa Barbara, etc) have adequate runway length. Luckily there are still a slew of other aircraft and helos supporting and a water or retardant drop is happening at least every 10-15 minutes, sometimes back to back to back. It\u0027s actually really cool to watch them do their thing...the professionalism and sense of urgency is profound.\n\u003C/p\u003E\n\u003Cp\u003E\nUnfortunately the on-scene fire chief says 100% containment is not expected until \u003Cem\u003Eat least\u003C/em\u003E the end of the month. \u003Cabbr title=\u0022Center of Lift\u0022\u003ECol\u003C/abbr\u003E Moss clarified that that DOES NOT mean that launch can\u0027t proceed on the 26th if the necessary people can take time to stand launch duty and weather, air quality, LV, and SC, etc. are GO. He declined to comment on when he expected launch would occur and said he stands by the initial projection of no earlier than the 26th. He further clarified that the launch conditions must be satisfactory to all parties, not just the wing.\n\u003C/p\u003E\n"},{"CreatedByName":"Rybo","CreatedById":154876,"CreatedDateTime":"2016-09-22T20:45:58Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003EUpdate as of 9/22 at 12PM local\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nDespite the wind I hear that huge are being made. I haven\u0027t been able to attend any of the space wing or fire briefings today due to work commitments but I\u0027m hoping to be able to attend the one this evening. People at the BX told me there has only been minor acreage growth and containment is at 75%. All the major lines held overnight and are still holding. The tempo certainly hasn\u0027t decreased and drops are still quite regular and base is still buzzing with emergency vehicles and helos. It\u0027s like a non-stop airshow.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ll try to get one more update tonight before the weekend and then I\u0027m going to enjoy adult beverages and a trip to meet General Sherman!\n\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2016-09-22T22:44:01Z","Content":"\n\u003Cp\u003E\nA new fire has started on the north base; \u003Ca href=\u0022http://www.ksby.com/story/33161972/new-fire-breaks-out-at-vandenberg-air-force-base?utm_medium=social\u0026amp;utm_source=twitter_KSBY\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.ksby.com/story/33161972/new-fire-breaks-out-at-vandenberg-air-force-base?utm_medium=social\u0026amp;utm_source=twitter_KSBY\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Rybo","CreatedById":154876,"CreatedDateTime":"2016-09-23T04:20:27Z","Content":"\n\u003Cp\u003E\nDAMN! I was mostly working in 8337 today and never saw anything when I left around 3. This is the first I\u0027m even hearing of it but I was at Chumash from like 4 to like 20 minutes ago. I\u0027m also a bit intoxicated though so maybe that\u0027s it haha. Glad I took tomorrow off, hope it doesn\u0027t spread too much since I usually work southeast of there at the JSOC at the corner of California and 13th.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/348-kryten/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022348\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/348-kryten/\u0022 rel=\u0022\u0022\u003E@Kryten\u003C/a\u003E in my absence this weekend while I look at huge trees I pass the torch to you to keep this thread updated with any info you get. \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"mikegarrison","CreatedById":137807,"CreatedDateTime":"2016-09-23T06:12:48Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222770234\u0022 data-ipsquote-contentid=\u0022148186\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221474604427\u0022 data-ipsquote-userid=\u0022154876\u0022 data-ipsquote-username=\u0022Rybo\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Rybo said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nDAMN! I was mostly working in 8337 today and never saw anything when I left around 3. This is the first I\u0027m even hearing of it but I was at Chumash from like 4 to like 20 minutes ago. I\u0027m also a bit intoxicated though so maybe that\u0027s it haha. Glad I took tomorrow off, hope it doesn\u0027t spread too much since I usually work southeast of there at the JSOC at the corner of California and 13th.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/348-kryten/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022348\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/348-kryten/\u0022 rel=\u0022\u0022\u003E@Kryten\u003C/a\u003E in my absence this weekend while I look at huge trees I pass the torch to you to keep this thread updated with any info you get. \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nPassing the torch may not be quite the ideal choice of words in this instance.\n\u003C/p\u003E\n"},{"CreatedByName":"Kryten","CreatedById":348,"CreatedDateTime":"2016-09-23T09:58:22Z","Content":"\n\u003Cp\u003E\nThe fire on south base is pretty much contained now, evacuation orders for communities outside the base have been lifted and specialists are starting to enter south base to evaluate the damage.\n\u003C/p\u003E\n\u003Cp\u003E\nThe fire on north base (what they\u0027re calling the airport road fire) is now 250 acres. It\u0027s currently moving away from residential areas, and plenty of civilian facilities on north base are still open.\n\u003C/p\u003E\n\u003Cp\u003E\nThe launch of WorldView 4 on the 26th has now formally been cancelled, although it was never likely. They\u0027re now looking at launch in \u0027early October,\u0027.\n\u003C/p\u003E\n"}]}