{"TopicId":148176,"ForumId":55,"TopicTitle":"Suggestion: Options menu toggle for rocket exhaust smoke","CreatedByName":"The_Rocketeer","CreatedById":81727,"CreatedDateTime":"2016-09-19T22:42:25Z","PageNum":1,"Articles":[{"CreatedByName":"The_Rocketeer","CreatedById":81727,"CreatedDateTime":"2016-09-19T22:42:25Z","Content":"\n\u003Cp\u003E\nExhaust smoke is very resource intensive and can cause significant FPS slowdown on slower machines using a lot of engines. This can already be disabled with a bit of config editing, it would be great if that was made easier by having a settings toggle to disable it in-game.\n\u003C/p\u003E\n"},{"CreatedByName":"NoMrBond","CreatedById":69263,"CreatedDateTime":"2016-09-19T23:52:52Z","Content":"\n\u003Cp\u003E\nSmokescreen already lets you do this (if you\u0027re not mod averse)\n\u003C/p\u003E\n\u003Cp\u003E\nOtherwise 1.2 already seems to handle particles a lot better (if you haven\u0027t tried the 1.2 prereleases), plus Sarbian is doing development for Squad now, and Unity 5.5 has a significant particle system upgrade so... fingers crossed for KSP 1.3? (since it\u0027s too late to add features for 1.2).\n\u003C/p\u003E\n"},{"CreatedByName":"The_Rocketeer","CreatedById":81727,"CreatedDateTime":"2016-09-21T23:23:57Z","Content":"\n\u003Cp\u003E\n\u003Cspan\u003E\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/69263-nomrbond/\u0026amp;do=hovercard\u0022 data-mentionid=\u002269263\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/69263-nomrbond/\u0022 rel=\u0022\u0022\u003E@NoMrBond\u003C/a\u003E\u003C/span\u003EI\u0027m not mod averse.\u003Cbr\u003E\u003Cbr\u003E\nThat said, I don\u0027t give a hoot if mods exist that do this - I can edit a config file all by myself, that\u0027s not the point. The point is the the game\u0027s system demands can be significantly reduced by making the smoke effect optional, just like you can lower texture resolution and get rid of terrain scatters. That\u0027s my suggestion.\u003Cbr\u003E\u003Cbr\u003E\nFrankly the idea of downloading a mod to make the game less resource-intensive is perverse \u003Cimg alt=\u0022:confused:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 title=\u0022:confused:\u0022\u003E \u003Cbr\u003E\u003Cbr\u003E\nWhile I don\u0027t really expect this to be implemented - the majority of requests made here, even the really good ones, aren\u0027t - I saw a new feature added to 1.2 within the last 48 hours at another community-member\u0027s request, so I guess we can all live in hope.\n\u003C/p\u003E\n"},{"CreatedByName":"NoMrBond","CreatedById":69263,"CreatedDateTime":"2016-09-21T23:33:13Z","Content":"\n\u003Cp\u003E\nI was suggesting it was more likely for the particle system to get some attention because Sarbian is onboard with Squad now, not less likely because a mod exists for it\n\u003C/p\u003E\n\u003Cp\u003E\nThat said, you probably want to make any 1.2 specific suggestions down in the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/forum/82-12-pre-release-branch/\u0022 rel=\u0022\u0022\u003E1.2 forum\u003C/a\u003E, rather than the general suggestions forum\n\u003C/p\u003E\n"},{"CreatedByName":"pandaman","CreatedById":130621,"CreatedDateTime":"2016-09-22T05:57:21Z","Content":"\n\u003Cp\u003E\nAs a graphics setting option I think it\u0027s quite a good idea.  Either a slider to control intensity, or a few intensity presets - none, low, med, high (default to high which is the current level).\n\u003C/p\u003E\n"},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2016-09-22T08:44:23Z","Content":"\n\u003Cp\u003E\nI too am in favor of such a feature. My PC can handle hundreds of parts, but having not shelled out for graphics hardware I have trouble when zillions of particles start showing up on screen.\n\u003C/p\u003E\n"},{"CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2016-09-22T11:02:12Z","Content":"\n\u003Cp\u003E\nThe smoke particles are a bit excessive. For example, the jet engines should have almost no smoke coming out of them. Wouldn\u0027t mind having them a bit optimized.\n\u003C/p\u003E\n"},{"CreatedByName":"DrLicor","CreatedById":165712,"CreatedDateTime":"2016-09-22T11:21:21Z","Content":"\n\u003Cp\u003E\nIf you install RealPlume, you can diable everything what comes out of a exhaust.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}