{"TopicId":148660,"ForumId":51,"TopicTitle":"HSP: Mission complete.","CreatedByName":"Hotaru","CreatedById":135669,"CreatedDateTime":"2016-09-25T23:12:15Z","PageNum":5,"Articles":[{"CreatedByName":"Hotaru","CreatedById":135669,"CreatedDateTime":"2017-02-18T22:06:03Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222959908\u0022 data-ipsquote-contentid=\u0022148660\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221487454334\u0022 data-ipsquote-userid=\u0022157505\u0022 data-ipsquote-username=\u0022something\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n21 minutes ago, something said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhat kind of OS / processor / graphics combination do you use (and what\u0027s your FPS?) to get these images? They look pretty stunning and I guess that comes at a certain requirement, concerning your hardware...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNot as impressive as I expect you\u0027re picturing. 2009 Mac Pro with Windows 7 in Bootcamp, although I sometimes play KSP on OS X as well. Can\u0027t remember what the processor is off the top of my head but the graphics card is a Radeon 5870. It\u0027s not spectacular but considering it\u0027s nearly a decade old and has had about half its parts upgraded or replaced over the years, it handles modern games surprisingly well.\n\u003C/p\u003E\n\u003Cp\u003E\nFPS is anywhere from 10 or so up to around 30, depending on what I\u0027m doing. The graphics mods don\u0027t actually cost me much FPS, most of my lag seems to be from part count. Persistence and Endurance stations are both near 200 parts with a couple of spacecraft docked, and the FPS there is around 15. It\u0027s a \u003Cem\u003Esteady \u003C/em\u003E15 though, which I find a lot more tolerable than a stuttery 45 (which is what, for instance, GTA V gets).\n\u003C/p\u003E\n\u003Cp\u003E\nI also keep my physics delta per frame very low (like 0.005 or something, I don\u0027t remember) which runs everything in slow-motion but improves FPS by 50% or so. I use physics warp as a sort of \u0022turbo boost,\u0022 taking advantage of a glitch that causes it to reset the delta per frame setting, if I want to switch to worse FPS but real time, but I have to restart if I want to go back to slow-but-smooth mode.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-02-18T22:06:41Z\u0022 title=\u002202/18/2017 10:06  PM\u0022 data-short=\u00227 yr\u0022\u003EFebruary 18, 2017\u003C/time\u003E by Hotaru\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"StupidAndy","CreatedById":171175,"CreatedDateTime":"2017-02-18T23:14:47Z","Content":"\n\u003Cp\u003E\nthree down...\u003Cspan style=\u0022font-size:8px;\u0022\u003Eadd eeloo, and apparently dres exists here,,.\u003C/span\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003ENINE TO GO\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Hotaru","CreatedById":135669,"CreatedDateTime":"2017-02-20T04:43:22Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/171175-stupidandy/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022171175\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/171175-stupidandy/\u0022 rel=\u0022\u0022\u003E@StupidAndy\u003C/a\u003E Let\u0027s not get ahead of ourselves... so far we\u0027ve only proved the \u003Cem\u003Egravitational influence\u003C/em\u003E of Dres. We still haven\u0027t made \u003Cem\u003Eabsolutely\u003C/em\u003E sure. (Also I\u0027m curious how you figure \u003Cem\u003Enine \u003C/em\u003Eto go. I count twelve!)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Ijzksj8.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/Ijzksj8.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe Bravado 4 landing craft, LC-3, during its descent to the surface of Ike.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBravado 3: back to Duna.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nHalf a year after its departure from Kerbin, the Bravado 3/4 flotilla begins arrival maneuvers in the Duna system.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222CsvV11.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/2CsvV11.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBravado 3 is the first to enter Duna\u0027s sphere of influence; it deploys its sub-satellite, which is directed into a polar mapping orbit while the main spacecraft adjusts its course to rendezvous with the LC-2 lander.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022CsyWSkw.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/CsyWSkw.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe sub-satellite successfully burns into polar orbit and surveys the surface of Duna for ore deposits.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022DJgN1NB.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/DJgN1NB.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBecause of the two Aqualung tankers launched with the flotilla, fuel is less of a concern for these missions than it was for Bravado 2. Bravado 3 performs a full propulsive capture, without aerobraking, to put it on course to encounter the landing craft on the next orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022fTXfrug.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/fTXfrug.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe orbiter rendezvouses with LC-2, left behind by Bravado 2, in low Duna orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022eBam3vv.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/eBam3vv.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nUnkermanned tanker ship Aqualung 14 arrives in Duna orbit a few days later and refuels the combined Bravado 3 spacecraft.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022tEJH5Vx.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/tEJH5Vx.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOnce the tanker has been jettisoned, flight engineer Deblian performs an EVA to repack LC-2\u0027s parachutes.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022N0NC3Hu.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/N0NC3Hu.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter surveying several potential landing sites, the crew boards the landing craft and begins the descent to the surface, targeting a site Duna\u0027s lowlands.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022qoHQXZv.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/qoHQXZv.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThey land safely, though about 30 kilometers beyond the intended site, successfully proving the spacecraft\u0027s ability to land at higher elevations. Left to right: scientist Kathelyn, commander Lodald, engineer Deblian.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBravado 4: Ike!\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022sMLSsXO.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/sMLSsXO.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nMeanwhile, Bravado 4 performs a direct capture into orbit of Duna\u0027s satellite Ike.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022bKMG6Hd.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/bKMG6Hd.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe combined spacecraft is refueled in low Ike orbit by tanker Aqualung 16. Unlike Bravado 3, which will only have enough fuel for a single landing on Duna, Bravado 4 will have enough for at least three--and possibly more--landings on Ike. Although the lander makes its first descent to the surface fully-fueled, later landings may be performed with the side tanks empty to save weight.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022tfFYR0Q.jpg?2\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/tfFYR0Q.jpg?2\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ETraissa: first Kerman on Ike!\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022cM9tmv3.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/cM9tmv3.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nObligatory group shot: scientist Johndo, commander Kerzer, engineer Traissa. The crew will remain on the surface for a while before returning to the orbiter to refuel and performing additional landings; Mission Control hopes they will ultimately be able to perform a fairly complete survey of Ike\u0027s equatorial biomes.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSagacity 7: investigations into the existence of Dres.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022rflLUgY.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/rflLUgY.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAlthough the Rationality 5 orbiter had confirmed that Dres shows up on sensors and can be orbited, some skeptics remained unconvinced of its actual existence. Sagacity 7 arrived in Dres orbit with two mini-landers to answer the next big question: can Dres be landed on?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022yGvr6PA.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/yGvr6PA.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nLander \u0022A\u0022 touched down in a crater in the northern hemisphere, returning the first science data and images from the surface.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022MWxia2S.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/MWxia2S.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nLander \u0022B\u0022 landed in the lowlands. The engineering team confirms that both probes definitely landed on \u003Cem\u003Esomething\u003C/em\u003E; while the scientific community agrees this is result definitively proves the existence of Dres, there are still lingering suggestions that Sagacity 7 actually suffered a bizarre navigational error and the photos are actually of the Mun.\n\u003C/p\u003E\n\u003Cp\u003E\nThe Space Program administration concludes that a kermanned mission is necessary to demonstrate once and for all the existence of the purported \u0022planet.\u0022 Although beyond the reach of the Bravado system, Dres will be the first objective of its successor, built around the Brillig rocket and tentatively named Project Daring.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"StupidAndy","CreatedById":171175,"CreatedDateTime":"2017-02-20T04:44:12Z","Content":"\n\u003Cp\u003E\nI miscounted...my math brain not working right now\n\u003C/p\u003E\n\u003Cp\u003E\nlets recount\n\u003C/p\u003E\n\u003Cp\u003E\nMoho, Eve, Gilly, Dres, Laythe Vall Pol Bop Tylo, Eeloo, what am I missing?\n\u003C/p\u003E\n\u003Cp\u003E\ntheres 16 right?\n\u003C/p\u003E\n\u003Cp\u003E\n10 down? I really cant math today...\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-02-20T04:48:51Z\u0022 title=\u002202/20/2017 04:48  AM\u0022 data-short=\u00227 yr\u0022\u003EFebruary 20, 2017\u003C/time\u003E by StupidAndy\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Hotaru","CreatedById":135669,"CreatedDateTime":"2017-02-20T05:00:48Z","Content":"\n\u003Cp\u003E\nActually now I figure 14 to go (11 if you only count solid-ground landings) and 3 done (4 if you count Kerbin). [Kerbol], Moho, Eve, Gilly, [asteroids], Dres, Ike, [Jool], Laythe, Vall, Tylo, Bop, Pol, Eeloo.\n\u003C/p\u003E\n"},{"CreatedByName":"StupidAndy","CreatedById":171175,"CreatedDateTime":"2017-02-20T05:06:41Z","Content":"\n\u003Cp\u003E\ncant really land on asteroids, more like fly over and touch them on EVA, and...the less said about kerbol the better, jool if you break it you can have some funny science things when you land\n\u003C/p\u003E\n"},{"CreatedByName":"rkarmark","CreatedById":158904,"CreatedDateTime":"2017-02-20T06:58:12Z","Content":"\n\u003Cp\u003E\nDRES DOES NOT EXIST THOSE PHOTOS WHERE FROM THE MUN! \u003Cimg alt=\u0022:sticktongue:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 title=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"StupidAndy","CreatedById":171175,"CreatedDateTime":"2017-02-20T18:04:05Z","Content":"\n\u003Cp\u003E\nno...they were from IKE!!!\n\u003C/p\u003E\n"},{"CreatedByName":"Hotaru","CreatedById":135669,"CreatedDateTime":"2017-02-22T04:25:56Z","Content":"\n\u003Cp\u003E\n\u003Cimg alt=\u0022Okk9joz.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/Okk9joz.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EBrevity II\u003C/em\u003E exploring the highlands of the Mun.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBase Constancy and \u003Cem\u003EBrevity II\u003C/em\u003E: surface ops on the Mun.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022A1s9gn4.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/A1s9gn4.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA Brillig IVB rocket launched Base Constancy, the Space Program\u0027s first attempt to establish a permanent presence on the surface of another celestial body.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022v2bpAmO.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/v2bpAmO.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s not much more than a science lab and hab module with legs, but it will provide more science income and serve as a base for surface exploration of the Mun.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022HjWXGmL.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/HjWXGmL.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe crew of station \u003Cem\u003EPersistence\u003C/em\u003E landed LC-1 in the Northwest Crater to \u003Cs\u003Erescue from the Kraken\u003C/s\u003E make minor repairs to dropship Impertinence 1. \u003Cem\u003E(OOC: There\u0027s a persistent bug where landed vessels sometimes load at odd angles. I\u0027ve figured out some ways to avoid it, such as loading a flag or Kerbal near a landed ship rather than the ship itself, but none of the workarounds worked for the dropship so I had to make it load properly by bringing the lander within physics range.)\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222hTIeHs.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/2hTIeHs.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nMeanwhile, another Brillig IVB launched \u003Cem\u003EBrevity II\u003C/em\u003E, a Mark IV rover.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022lQdLQLL.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/lQdLQLL.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nShuttlepod Defiance 10 carried the six-kerman crew of Expedition Constancy 1 to the rover, where flight engineer Paty made repairs to wheels damaged by the rocket\u0027s payload fairing.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00225oQ1o1J.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/5oQ1o1J.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe crew--commander Geneming, pilot Vasya, engineer Paty, and scientists Eririne, Darina, and Gledia--rode the Brillig second stage aboard the rover to Munar orbit, where they werepicked up by the dropship.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022E4vHQKQ.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/E4vHQKQ.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nImpertinence 1 and the rover landed safely about 15 kilometers from Base Constancy; pilot Vasya watched the dropship return to orbit. \u003Cem\u003E(OOC: He was on EVA so I could load him instead of the rover to avoid the loading-at-an-angle bug. I think at one point I had figured out what mod was causing that issue but damn if I can remember now and it\u0027s not serious enough to bother narrowing it down. I\u0027d be curious if anybody else knows about it, though.)\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022pOkxaRQ.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/pOkxaRQ.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EBrevity II\u003C/em\u003E made the short drive from the landing site to Base Constancy.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Q5G2g6b.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/Q5G2g6b.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOnce the base was operational, Vasya, Paty, and Gledia made a roughly 140-kilometer round trip to the Farside Crater, collecting data from several biomes to fill up the base\u0027s lab. \u003Cem\u003E(OOC: Manual on the way out, BV on the way back.)\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022qJRfzPm.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/qJRfzPm.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nConstancy will operate the same way as the other stations, with six-kerman crews on two-year tours, while \u003Cem\u003EBrevity II\u003C/em\u003E keeps it supplied with science data.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBravado 4: exploring Ike.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00228jNPQDp.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/8jNPQDp.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe crew of Bravado 4 continued the exploration of Ike, returning to the orbiter to refuel after each landing. They explored the Southeast Range...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022b5v1PXV.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/b5v1PXV.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n...the Western Ridge...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022H8E4SVC.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/H8E4SVC.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n...and the Central Range. Enough fuel remains in the orbiter for at least one, and possibly two, additional landings--targeting the Midlands and the Eastern Ridge.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nDefiance 11 and 12: Kerbin system ops.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Qp5UN7Z.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/Qp5UN7Z.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nCrew rotations: shuttlepod Defiance 11 launched to station \u003Cem\u003EPatience II \u003C/em\u003Ewith P2 Janbe, P0 Chadgan, P0 Jate, E0 Corrick, S2 Tangel, and S2 Alvis, returning to Kerbin with the previous crew. Defiance 12 (above) brought P2 Lemlock, P0 Gilbree, E3 Lizdrien, E2 Joelin, S4 Ziggy, and S1 Valcee to station \u003Cem\u003EEndurance I\u003C/em\u003E. The crew made a landing in the flats of Minmus (the science team at \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E discovered that biome was still unvisited) before handing off the spacecraft to the previous station crew, who returned to Kerbin after a stop at \u003Cem\u003EPatience II\u003C/em\u003E to deliver data and get that station\u0027s lab producing science again.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Hotaru","CreatedById":135669,"CreatedDateTime":"2017-02-26T18:02:38Z","Content":"\n\u003Cp\u003E\nBoring stuff:\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nSo I got to fiddling around with mods in an effort to reduce lag. After much painstaking adding, removing, and testing framerate, I only ended up losing a couple of fairly unimportant ones. I did, however, update Stock Visual Enhancements, and whether because I switched to the low-res version from the mid-res one, because \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/150430-galileo/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022150430\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/150430-galileo/\u0022 rel=\u0022\u0022\u003E@Galileo\u003C/a\u003E has \u003Cem\u003Eseverely\u003C/em\u003E optimized it since the version I was using, or both, my framerate is--no exaggeration--\u003Cem\u003Edouble\u003C/em\u003E what it was before. Station\u003Cem\u003E Endurance\u003C/em\u003E in Minmus orbit was my benchmark--it was getting 10-15 FPS in slow motion before, and now it\u0027s up to 25-30 in real time. Night and day. Words cannot express how nice it is to have the game running really smoothly again.\n\u003C/p\u003E\n\u003Cp\u003E\nIn fact it now runs \u003Cem\u003Eso \u003C/em\u003Esmoothly that I decided to have yet another try at installing Stock Visual Terrain. I\u0027ve already tried that mod twice before in this save and both times decided it was too big an FPS killer--but for whatever reason (again, it\u0027s possible Galileo has improved it since I last tried), it now works great and costs me less than 5 FPS. So I think I\u0027m finally going to be able to stick with it, which is brilliant because it really does make terrain look absolutely spectacular. It\u0027s not in use in most of the screenshots in this update (most of them were taken before I started messing with my mods) but it should be really noticeable in the next one.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso I\u0027ve decided to cancel the \u003Cem\u003ELeadership Initiative \u003C/em\u003Estrategy, mainly because for some reason it was slowly draining my reputation (it has declined from almost 70% to 60% since activating the strategy). I honestly think the strategies are a bit bugged; for some reason rep is a condition for activating the science to funds strategy, and the game has strange ideas about which strategies conflict with which other ones. So I\u0027m just going to stick to good old \u003Cem\u003EPatents Licensing\u003C/em\u003E for the time being. Right now it\u0027s at 91%, once my rep is high enough I\u0027ll re-buy it at 100% and then probably be done with the admin building entirely.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nTL;DR: Fixed lag issues, updated SVE, installed SVT, fiddled with strategies.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022HxEMEP0.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/HxEMEP0.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EStarbus Valerie\u003C/em\u003E on the Mun.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nStarbus S-100: a new passenger rocket.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022k9lo7yf.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/k9lo7yf.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA Brillig IVC rocket orbited \u003Cem\u003EStarbus Valerie\u003C/em\u003E, the prototype of a new class of passenger rockets built for operations between planetary orbits and the surfaces of airless bodies.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00220Jv79Zy.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/0Jv79Zy.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe launch went smoothly, including the off-center deployment of the boosters to avoid hitting \u003Cem\u003EValerie\u003C/em\u003E\u0027s landing pods.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022EEhIWa3.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/EEhIWa3.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nDefiance 13 met \u003Cem\u003EValerie\u003C/em\u003E at station \u003Cem\u003EPatience II\u003C/em\u003E to transfer the crew for the new ship\u0027s shakedown cruise, pilot Melxie and engineer Erithis.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022NhEkhEW.jpg?3\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/NhEkhEW.jpg?3\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNormally the ship needs only a single pilot and accommodates sixteen passengers. For this test flight, Melxie flew it from the cockpit...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022lZDMfXz.jpg?2\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/lZDMfXz.jpg?2\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n...while Erithis tried out the passenger cabin. \u003Cem\u003E(OOC: There\u0027s a lot of unused space in the Mk 3 crew cabin so for roleplay purposes I tend to assume it has sleeping and living spaces on an unseen lower deck as justification for using it on interplanetary trips.)\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Ccij4NP.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/Ccij4NP.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThey make a safe landing in the Munar East Crater.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSpoiler: Mun anomaly (visible from orbit if you look hard enough).\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022iWGoQaz.jpg?3\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/iWGoQaz.jpg?3\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nDuring the ascent back to orbit, the crew observed a rock arch on the rim of the crater; a future expedition from Base Constancy will investigate it more closely.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ZspezSq.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/ZspezSq.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EValerie\u003C/em\u003E returned safely to a 250x250 kilometer orbit where it met Defiance 13 to return the crew to Kerbin. On the whole the S-100 behaved very well, although the crew noted a disconcerting habit of sliding very slowly downhill while landed and suggested some changes to its reaction control system. It will remain in Kerbin orbit to await refueling before commencing regular passenger operations to the Mun and Minmus.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBravado 5: Gilly expedition.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022g5i4WXZ.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/g5i4WXZ.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA Frumious VI rocket launched Bravado 5, the Space Program\u0027s first kermanned expedition to Gilly. The crew are commander Melxie, engineer Erithis, and scientist Agalinne.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00221aZ6UWQ.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/1aZ6UWQ.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter tanker Aqualung 19 refueled the spacecraft and delivered its comms array, a Brillig IVB launched Aqualung 20 to act as a departure stage.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022dBIb5F4.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/dBIb5F4.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nUnlike previous Bravado missions, the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E engineers decided it would be easier to equip the entire Bravado spacecraft for landing on Eve\u0027s tiny satellite than to bring a separate landing craft. Bravado 5 will make a complete survey of Gilly before returning to Kerbin.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBravado 6: Objective Jool and the end of an era.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022zGl77hQ.jpg?2\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/zGl77hQ.jpg?2\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nKerbin-based telescopes have recently observed major changes to the giant planet Jool: in addition to developing a ring system (!), the weather patterns of the planet\u0027s atmosphere have changed as well. \u003Cem\u003E(OOC: Obviously this is because I updated SVE.)\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nOriginally, Bravado 5 was intended to be the final mission of the program. But the public is much more taken with the new, more interesting Jool than with a rock orbiting Eve, and when the science team pointed out that the next window to Jool opened just a few weeks after the previous mission\u0027s departure, even the notoriously stingy \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E administration couldn\u0027t resist taking a closer look. (The scientists conveniently forgot to mention that three probes are already in the Jool system with a fourth outbound.)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022SQOjgXV.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/SQOjgXV.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe administration authorized Bravado 6, the final mission of the program and the final flight of the venerable Frumious rocket. Aboard are mission commander Burmin, flight engineer Carena, and scientist Laselle.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00227sHpZJ3.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/7sHpZJ3.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAqualung 21 delivered fuel and a comms array to the spacecraft in Kerbin orbit, while Aqualung 22 acted as a departure stage.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022fDjIULj.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/fDjIULj.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe combined Aqualung 22/Bravado 6 spacecraft departed Kerbin, targeting an arrival at Jool just over a year later.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00227MhHHJe.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/7MhHHJe.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBravado 6 will complete a close flyby of the Joolian satellite Tylo which will redirect it on a course back to Kerbin.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-02-26T18:06:54Z\u0022 title=\u002202/26/2017 06:06  PM\u0022 data-short=\u00227 yr\u0022\u003EFebruary 26, 2017\u003C/time\u003E by Hotaru\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KAL 9000","CreatedById":140704,"CreatedDateTime":"2017-02-26T18:33:31Z","Content":"\n\u003Cp\u003E\nAfter the conclusion of the Bravado program, what\u0027s next for HSP?\n\u003C/p\u003E\n"},{"CreatedByName":"Hotaru","CreatedById":135669,"CreatedDateTime":"2017-02-26T18:42:50Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222968582\u0022 data-ipsquote-contentid=\u0022148660\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221488134011\u0022 data-ipsquote-userid=\u0022140704\u0022 data-ipsquote-username=\u0022KAL 9000\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nJust now, KAL 9000 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAfter the conclusion of the Bravado program, what\u0027s next for HSP?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe successor to Bravado is Project Daring, which will be similar in general concept but built around the Brillig rocket and using more complex staging to achieve longer ranges. Daring 1 is planned to target Dres, although new kermanned missions will probably be on hiatus at least until the return of Bravado 5, if nothing else to keep my \u003Cabbr title=\u0022Kerbal Alarm Clock (mod)\u0022\u003EKAC\u003C/abbr\u003E window from getting too cluttered and this thread from getting too confusing.\n\u003C/p\u003E\n"},{"CreatedByName":"KAL 9000","CreatedById":140704,"CreatedDateTime":"2017-02-26T20:23:12Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222968592\u0022 data-ipsquote-contentid=\u0022148660\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221488134570\u0022 data-ipsquote-userid=\u0022135669\u0022 data-ipsquote-username=\u0022Hotaru\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Hotaru said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe successor to Bravado is Project Daring, which will be similar in general concept but built around the Brillig rocket and using more complex staging to achieve longer ranges. Daring 1 is planned to target Dres, although new kermanned missions will probably be on hiatus at least until the return of Bravado 5, if nothing else to keep my \u003Cabbr title=\u0022Kerbal Alarm Clock (mod)\u0022\u003EKAC\u003C/abbr\u003E window from getting too cluttered and this thread from getting too confusing.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nCool!\n\u003C/p\u003E\n"},{"CreatedByName":"Hotaru","CreatedById":135669,"CreatedDateTime":"2017-03-01T00:53:50Z","Content":"\n\u003Cp\u003E\nBoring stuff: Finally got tired of babysitting my science labs endlessly and edited the config to increase the science buffer from 500 to 2000. Don\u0027t think this will have any gameplay effect other than not having to transmit science as often to keep them running.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022WbC3js2.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/WbC3js2.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBravado 5 in the lowlands of Gilly.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSuper Aqualung 1: next-generation unkermanned tanker.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022tL4FEqJ.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/tL4FEqJ.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe first Brillig VI rocket launched unkermanned tanker ship Super Aqualung 1, the prototype for a new class of tanker designed to service larger ships such as the Starbus S-100 and \u003Cem\u003EPersistence\u003C/em\u003E-class mobile station.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022YJZW6GN.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/YJZW6GN.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAlthough it had to use some of its own fuel to achieve orbit (even the Brillig VI, the Space Program\u0027s largest current launch vehicle, isn\u0027t able to put it all the way in orbit), Super Aqualung 1 successfully rendezvoused with and refueled \u003Cem\u003EStarbus Valerie\u003C/em\u003E in Kerbin orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00221JrDCv1.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/1JrDCv1.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt then completed a transfer to the Mun, where it refueled station \u003Cem\u003EPersistence \u003C/em\u003Ebefore deorbiting and impacting on the Munar surface. The two tasks together would\u0027ve required at least half a dozen standard Aqualung missions; even with a less-than-adequate launch vehicle, the new system was able to accomplish them in a single flight. \u003Cem\u003E(OOC: And after two years, I think I\u0027ve finally managed to come up with a Vernor quad design I\u0027m satisfied with.)\u003C/em\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nKerbin system ops.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022eKkek9M.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/eKkek9M.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe crew of station \u003Cem\u003EPersistence\u003C/em\u003E explored the Mun\u0027s Northern Basin.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022BIRqzHz.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/BIRqzHz.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nDefiance 14 lifted off with Expedition \u003Cem\u003EPersistence-\u003C/em\u003E3, P2 Gemliana, E2 Chris, E2 Phoberta, E2 Mitrie, S2 Thomptrey, and S2 Addan. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022zUAEadS.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/zUAEadS.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt returned to Kerbin with the previous crew.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022LJHGRaV.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/LJHGRaV.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nGilbree took the Pugnacity lander down from station \u003Cem\u003EEndurance\u003C/em\u003E to collect samples and data from the highlands of Minmus.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBravado 4: finishing up on Ike.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022uA6Sjm3.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/uA6Sjm3.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe crew of Bravado 4 completed the final two landings of the mission, on the Eastern Range...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022jsCVzDQ.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/jsCVzDQ.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n...and in the midlands. With the midland landing, the sixth of the mission, Bravado 4 has now surveyed all the equatorial biomes of Ike.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOrdrin: asteroid retrieval. \n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nThe science team had long wanted their very own asteroid to study, so the engineers devised a plan to retrieve one with a specially modified Aqualung and a purpose-built deorbit module.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022vTTXfPq.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/vTTXfPq.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA Brillig IVB rocket launched Aqualung 23, with a claw in place of the standard docking port, to encounter and capture a recently-discovered Class A asteroid, XQF-459 Ordrin. \u003Cem\u003E(OOC: Ordrin Kerman was my first ever Kerbal on the Mun, back in 0.90.)\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022NfPrtSO.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/NfPrtSO.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAs the Aqualung approached its target and returned the first clear images of it, the scientists began to suspect that Ordrin was not an ordinary asteroid.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022VBEnQSk.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/VBEnQSk.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt proved to be a \u0022Magic Boulder,\u0022 a class of asteroid with distinctive veins of glowing ore, the existence of which was, up to now, only theoretical. Aqualung 23 captured it and moved it into a 250-kilometer Kerbin orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Wn9hqa0.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/Wn9hqa0.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe science team wanted samples from the asteroid before it was exposed to Kerbin\u0027s atmosphere, so Defiance 15, with pilot Eiliel, engineer Statha, and scientists Wenmy and Erigee, rendezvoused with Ordrin and collected material from it in Kerbin orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022jeOHypq.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/jeOHypq.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOnce Defiance 15 was safely back at \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, a Manxome IV rocket launched Asteroid Descent Module 1.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00226THgOol.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/6THgOol.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe module attached itself to Ordrin, and after a final nudge out of orbit from Aqualung 23, the pair entered the atmosphere of Kerbin. The asteroid landed about 100 kilometers west of \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022SGBwasO.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/SGBwasO.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe engineers hadn\u0027t given much thought in advance to how to move Ordrin around once it was on the surface; they hastily rigged up a flatbed version of the Mark IV rover. The idea was that the rover would lower its ramp and reverse quickly under the asteroid so it would roll up onto the flatbed and connect with the claw. \u003Cem\u003E(OOC: What I wouldn\u0027t give for a \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E winch right about now.)\u003C/em\u003E Eiliel, Statha, and Erigee set out in the modified rover to attempt to retrieve the asteroid.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022kg5pd6e.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/kg5pd6e.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nTo the amazement of everyone, it actually worked. It didn\u0027t hurt that Ordrin was apparently made of magical space pumice; despite its size, it only weighed just over 2 tons (for comparison, the rover weighs 10 tons).\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022F0iQH0P.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/F0iQH0P.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe rover proved to handle surprisingly well even with the asteroid on its flatbed, and the crew made the long drive back to \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E with little trouble. \u003Cem\u003E(OOC: Most of the drive was with BV but the first and last 10 kilometers or so were manual.)\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Dr3eqzD.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/Dr3eqzD.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe \u0022asteroid truckers\u0022 with their cargo in front of the Kerbonaut Building. Left to right: Erigee, Eiliel, Statha. The administration wants to turn Ordrin into a permanent monument; the engineers are still working on a way to pick it up and mount it on a pedestal.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBravado 5 at Gilly.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022MxslCDw.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/MxslCDw.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n200 days after its departure from Kerbin, Bravado 5 entered the sphere of influence of Eve.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022C0ejI5X.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/C0ejI5X.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA burn at periapsis made it the first kermanned mission to enter orbit of the kerbolar system\u0027s largest terrestrial planet, while another burn at apoapsis put it on course to encounter Gilly.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022I269h48.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/I269h48.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAqualung 20 was jettisoned and set on a trajectory to impact Eve, while Bravado 5 captured into Gilly orbit under its own power.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022YZAdjtf.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/YZAdjtf.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter surveying landing sites and collecting science data from orbit, the crew brought the ship down to the surface for a landing in the lowlands.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00229MgdRmE.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/9MgdRmE.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EAgalinne: first kerman on Gilly!\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022N9P7OBt.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/N9P7OBt.jpg?1\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-03-01T00:54:06Z\u0022 title=\u002203/01/2017 12:54  AM\u0022 data-short=\u00227 yr\u0022\u003EMarch 1, 2017\u003C/time\u003E by Hotaru\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DunaRocketeer","CreatedById":103193,"CreatedDateTime":"2017-03-01T08:15:44Z","Content":"\n\u003Cp\u003E\nWhat a great idea that asteroid flatbed is. You keep coming up with interesting spins on routine missions.\n\u003C/p\u003E\n\u003Cp\u003E\nAny thoughts as to creating more economical boosters? Those Brillig rockets can\u0027t come cheap!\n\u003C/p\u003E\n"},{"CreatedByName":"KAL 9000","CreatedById":140704,"CreatedDateTime":"2017-03-01T15:43:57Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222971598\u0022 data-ipsquote-contentid=\u0022148660\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221488356144\u0022 data-ipsquote-userid=\u0022103193\u0022 data-ipsquote-username=\u0022DunaRocketeer\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, DunaRocketeer said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAny thoughts as to creating more economical boosters? Those Brillig rockets can\u0027t come cheap!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nA \u003Cem\u003Egiant\u003C/em\u003E, \u003Cem\u003Ebooster-powered\u003C/em\u003E \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E!\n\u003C/p\u003E\n"},{"CreatedByName":"KAL 9000","CreatedById":140704,"CreatedDateTime":"2017-03-01T15:44:00Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222971598\u0022 data-ipsquote-contentid=\u0022148660\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221488356144\u0022 data-ipsquote-userid=\u0022103193\u0022 data-ipsquote-username=\u0022DunaRocketeer\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, DunaRocketeer said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAny thoughts as to creating more economical boosters? Those Brillig rockets can\u0027t come cheap!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nA \u003Cem\u003Egiant\u003C/em\u003E, \u003Cem\u003Ebooster-powered\u003C/em\u003E \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E!\n\u003C/p\u003E\n"},{"CreatedByName":"Hotaru","CreatedById":135669,"CreatedDateTime":"2017-03-03T02:04:49Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/103193-dunarocketeer/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022103193\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/103193-dunarocketeer/\u0022 rel=\u0022\u0022\u003E@DunaRocketeer\u003C/a\u003E Not really. Economy isn\u0027t much of a priority at the moment; the Space Program has 8.4 million spacebucks in the bank right now and plenty of income both from contracts and from science labs.\n\u003C/p\u003E\n\u003Cp\u003E\nIn my last career save, in 1.0.2, I had fund rewards set \u003Cem\u003Emuch\u003C/em\u003E lower, basically to the point that everything had to be as close to fully reusable as possible. (I also used KCT, which meant turnaround time was an issue as well.) Setting up the reusable systems was a fun challenge, but actually using them in practice was pretty tedious. After a while it felt like 90% of my time was spent cycling Aqualungs between Minmus and \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E and babysitting reusable rockets back down to \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E. So I made a conscious decision for this save that my priority would be playability rather than cost-efficiency.\n\u003C/p\u003E\n\u003Cp\u003E\nThat said, I do have some future plans that will involve recovering payloads from orbit, and those will require some sort of reusable vehicle with a payload bay, whether a shuttle, a reusable rocket, or a spaceplane.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBoring stuff:\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nA pretty big new mod this time: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/96670-122-250-2016-12-28-ubiozur-welding-ltd-continued/\u0022 rel=\u0022\u0022\u003EUbioZur Welding Ltd\u003C/a\u003E.  It\u0027s a bit of a stretch calling this stock gameplay (I inquired in the Jool-5 thread and was told that, while allowed, it would count as modded), but it\u0027ll allow me to do a lot of severely cool stuff that just wouldn\u0027t be possible on my computer otherwise, and frankly the structural rigidity it provides can be pretty easily achieved these days with autostruts anyway.\n\u003C/p\u003E\n\u003Cp\u003E\nMy practical part count limit is around 250, and while that\u0027s generally enough for basic spacecraft, complicated structures like toruses can inflate the part count pretty quick considering they serve very little actual gameplay purpose. I did a quick test flight of a \u003Cem\u003EPersistence\u003C/em\u003E doppelganger with the torus section welded; it saved about 50 parts compared to the original and ran a lot smoother. More elaborate welding will allow for much more impressive structures--bigger toruses, space hangars, monuments... I\u0027ve been getting all sorts of interesting ideas.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nTL;DR: Part welding.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Cpuc9Ql.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/Cpuc9Ql.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe crew of Bravado 3 return to Duna orbit aboard LC-2.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nRoley and Ordrin: more fun with asteroids.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00225SUQBq9.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/5SUQBq9.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe engineers were divided on how to lift Ordrin onto its pedestal; some suggested a traditional crane while others favored a \u003Cabbr title=\u0022Vertical Take-Off and Landing\u0022\u003EVTOL\u003C/abbr\u003E aircraft. In the end the crane camp won, and the complicated machine they came up with successfully lifted the asteroid onto the pedestal. Fears that connecting the asteroid to a non-active claw would destroy the planet proved to be unfounded. \u003Cem\u003E(OOC: I\u0027ve never done much of this kind of engineering before but I was surprised how well the crane worked. It\u0027s built around two \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/61954-majorjim/\u0026amp;do=hovercard\u0022 data-mentionid=\u002261954\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/61954-majorjim/\u0022 rel=\u0022\u0022\u003E@Majorjim!\u003C/a\u003E-style thermometer hinges, which proved both surprisingly easy to set up and a lot sturdier than they look.) \u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Cqd2CTd.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/Cqd2CTd.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAlthough nobody is quite sure what it\u0027s a monument \u003Cem\u003Eto\u003C/em\u003E exactly, everybody agrees Ordrin looks quite nice on the lawn outside the Kerbonaut Building.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022XtfKVQq.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/XtfKVQq.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe operation to retrieve Ordrin went so well the engineers decided to send up Aqualung 24 to try and get another one, MWP-797 Roley. \u003Cem\u003E(OOC: Roley Kerman was the first kerbal on Minmus in one of my old 0.90 saves, and the subject of one of my first forum posts.)\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022aVBJ8A6.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/aVBJ8A6.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nTo the astonishment of the science team, Roley turns out to be another Magic Boulder. \u003Cem\u003E(OOC: Everyone agrees the spawn rate of Magic Boulders is somewhere in the neighborhood of 1 in 20, which means the chances of getting two in a row--let alone the first two of the entire space program--are about 1 in 400. Not completely impossible, but if it happens a third time I\u0027m going to start investigating whether some mod or other is making ALL asteroids spawn as Magic Boulders, which would be severely annoying. Fortunately there\u0027s no real gameplay benefit to them.)\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022XNy65AG.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/XNy65AG.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA Manxome IV rocket launches another descent module to meet Roley and Aqualung 24 in Kerbin orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ro885Xp.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/ro885Xp.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nRoley is quite a bit denser than Ordrin, but the descent module still manages to land it safely.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBravado 3 and 4: departures from Duna and Ike.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022M5nxcOj.jpg?2\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/M5nxcOj.jpg?2\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter a year and a half on the surface, the crew of Bravado 3 board LC-2 to return to Duna orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022IN94Up3.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/IN94Up3.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe landing craft is once again left in orbit for future reuse, and the crew transfers to the orbiter to return to Kerbin.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022wkqU4la.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/wkqU4la.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe crew of Bravado 4 return to their orbiter as well; LC-3 is left in Ike orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022QEeafRE.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/QEeafRE.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBravado 4 departs the Duna system via an Oberth maneuver, saving a considerable amount of delta-v compared to Bravado 3\u0027s direct departure.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nLucidity 1: probing the atmosphere of Jool.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ireKlHB.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/ireKlHB.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nMore than a year after its launch, Lucidity 1 arrived in the Joolian system, greeted by an unusual triple shadow on the giant planet\u0027s surface. Also it has rings now, for some reason.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022X61Rniv.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/X61Rniv.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe probe completed the Space Program\u0027s first full gravity capture with a close flyby of Tylo.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022lzeNayA.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/lzeNayA.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt then used the gravity of Vall and Laythe to lower its periapsis to just above the Joolian atmosphere.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ZzW00cD.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/ZzW00cD.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe probe approached the planet, returning the first close-up images of its rings.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022qabEUEg.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/qabEUEg.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nMost of its remaining fuel is spent circularizing in low Joolian orbit, 50 kilometers above the edge of the planet\u0027s atmosphere.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00229S3FEVo.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/9S3FEVo.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe last of the fuel was spent on the deorbit burn, and the probe entered the atmosphere of Jool.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022PSpTs6g.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/PSpTs6g.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nTo the surprise of everyone, it survived entry without any trouble, deployed its parachute and high-gain antenna, and transmitted science data back to Kerbin during the long descent through the Joolian atmosphere.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022CH9PotS.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/CH9PotS.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt was eventually destroyed by atmospheric pressure, having completed the Space Program\u0027s first descent into the atmosphere of the kerbolar system\u0027s largest planet. Its readings suggest that an ascent from the lower atmosphere may be possible, although such a mission would require an enormous amount of delta-v.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EImmutability\u003C/em\u003E and \u003Cem\u003EStarbus Valerie\u003C/em\u003E: a new Kerbin space station and tourism ops.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00223v8VzAX.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/3v8VzAX.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA Brillig V rocket launched Kerbin station \u003Cem\u003EImmutability\u003C/em\u003E, which will eventually replace \u003Cem\u003EPatience II\u003C/em\u003E, into a 250-kilometer orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022IhEv4DF.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/IhEv4DF.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBuilt around the same torus module as Munar station \u003Cem\u003EPersistence\u003C/em\u003E, \u003Cem\u003EImmutability\u003C/em\u003E lacks its own propulsion system and uses welded construction, which the engineers are convinced is both sturdier and higher-performance than duct tape.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022VgpsIsg.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/VgpsIsg.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe ultimate plan is for a permanent fuel depot to be placed in Munar orbit; in the meantime, a Brillig VI launched Super Aqualung 2 to serve as a temporary depot for \u003Cem\u003EStarbus Valerie\u003C/em\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ImhC2cP.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/ImhC2cP.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nTwo Defiance shuttlepods operating as Hotaru Star Lines Flights 3 and 4 carried a load of six tourists to the station for \u003Cem\u003EValerie\u003C/em\u003E\u0027s first regular passenger run. The flight crews were P1 Virlina and E1 Statha on HSL-3 and P2 Hayberta and E2 Rotine on HSL-4; P2 Eiliel went along to pilot \u003Cem\u003EValerie\u003C/em\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00229YwGaFB.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/9YwGaFB.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe shuttlepods met \u003Cem\u003EValerie\u003C/em\u003E at station \u003Cem\u003EImmutability\u003C/em\u003E; because the station has only two docking ports, they had to perform a complicated series of dockings and undockings to transfer their passengers to the Starbus.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022L0rouZ4.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/L0rouZ4.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIn a \u003Cs\u003Estupid hotdog stunt\u003C/s\u003E carefully planned demonstration of precision maneuvering, HSL-3 commander Virlina navigated the shuttlepod through the station\u0027s torus.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022sa1Mob0.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/sa1Mob0.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe passengers and flight commander Eiliel boarded \u003Cem\u003EStarbus Valerie\u003C/em\u003E, which departed the station for the first commercial landing on the Mun.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022dLdWiUs.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/dLdWiUs.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EValerie \u003C/em\u003Ewas refueled in Munar orbit by Super Aqualung 2 before departing for Minmus.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022zZp91TA.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/zZp91TA.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNone of the passengers actually had tickets to land on Minmus, but the PR people wanted some shots for the brochures so Eiliel took \u003Cem\u003EValerie\u003C/em\u003E down anyway and posed for a picture in the Great Flats of Minmus before taking the ship back to \u003Cem\u003EImmutability\u003C/em\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00225Spr5e0.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/5Spr5e0.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe crew and passengers returned safely to Kerbin aboard the two shuttlepods. Due to a shortage of kerbonauts, \u003Cem\u003EImmutability\u003C/em\u003E has not yet received a full crew; the upcoming hiring of the sixth kerbonaut class and reduction in standard station crews from six to four at the next rotation will free up more kerbonauts for expeditions to the next generation of space stations.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Majorjim!","CreatedById":61954,"CreatedDateTime":"2017-03-03T08:49:43Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222973751\u0022 data-ipsquote-contentid=\u0022148660\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221488506689\u0022 data-ipsquote-userid=\u0022135669\u0022 data-ipsquote-username=\u0022Hotaru\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, Hotaru said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nsnip\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\ngorgeous pictures mate!\n\u003C/p\u003E\n"},{"CreatedByName":"Hotaru","CreatedById":135669,"CreatedDateTime":"2017-03-06T02:53:32Z","Content":"\n\u003Cp\u003E\n\u003Cimg alt=\u0022G2m15Gp.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/G2m15Gp.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe sixth kerbonaut class with a prototype heavy mobile base. Left to right, back row: Ribnard, Leeuna, Barsen, Tambe, Asene, Jenra. Front row: Gergun, Daphthy, Madette, Gregger.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe second Duna flotilla: station \u003Cem\u003EPermanence \u003C/em\u003Eand \u003Cem\u003EStarbus Elizabeth\u003C/em\u003E.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nWith Bravado 3 and 4 on their way back to Kerbin, the administration decides it\u0027s finally time to move on from preliminary reconnaissance of the Duna system to full-scale exploration, beginning by establishing kermankind\u0027s first (mostly) permanent presence outside the Kerbin system.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022HmJBqVq.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/HmJBqVq.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA Brillig V rocket launched Duna station \u003Cem\u003EPermanence.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022yODJpNY.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/yODJpNY.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nDefiance 16, piloted by P2 Eiliel and P1 Virlina, delivered the station\u0027s first crew, commander P2 Hayberta, engineer E2 Jochelle, and scientists S1 Wenmy and S0 Tambe.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022UUos0Wz.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/UUos0Wz.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe station departed Kerbin orbit for Duna under tow from its orbital stage, which will be jettisoned after the spacecraft arrives in Duna orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00228JakNwe.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/8JakNwe.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nTo provide fuel for further landings, two Super Aqualungs were sent to the Duna system as well. Super Aqualung 3 was launched by a Brillig VI...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00224n3lyY0.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/4n3lyY0.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n...while Super Aqualung 4, a revised model with a more efficient engine, went up on an experimental Brillig VII, which proved only marginally more efficient. While a more powerful Brillig VIII is on the drawing board, the engineers are forced to admit that the Super Aqualung will never really live up to its potential until a new generation of launch vehicles becomes available.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022rKe27pa.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/rKe27pa.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFinally, a Brillig IV launched \u003Cem\u003EStarbus Elizabeth\u003C/em\u003E, the first of three planned spacecraft of the new S-101 type, to Duna. The S-101 incorporates lessons learned from the prototype S-100 \u003Cem\u003EValerie\u003C/em\u003E--notably an improved reaction control system, a ventral docking port, and a high-gain antenna for interplanetary travel. Two of the spacecraft will operate a regular passenger service between Kerbin and Duna; the third will be used for operations within the Kerbin system.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nMunar ops.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022xOGjwjn.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/xOGjwjn.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe crew of Mun station \u003Cem\u003EPersistence\u003C/em\u003E explored the Polar Crater aboard LC-1.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBravado 3 and 4: return to Kerbin.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022CQvdSgw.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/CQvdSgw.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBravado 3 returned safely to Kerbin at the conclusion of the second kermanned mission to the surface of Duna.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002213iLFiv.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/13iLFiv.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA few days later, Bravado 4 reentered Kerbin\u0027s atmosphere at the end of the first mission to Ike.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022wNjyUsH.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/wNjyUsH.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-03-06T03:35:24Z\u0022 title=\u002203/06/2017 03:35  AM\u0022 data-short=\u00227 yr\u0022\u003EMarch 6, 2017\u003C/time\u003E by Hotaru\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Mister_Spaceman","CreatedById":173500,"CreatedDateTime":"2017-03-06T04:41:18Z","Content":"\n\u003Cp\u003E\nWow. Really cool. This thread inspired my latest career saves. In my visual save (Visual mods only. I wonder where that idea came from.), I completed my first ever landings on Minmus. (I would give a quick report, but this isn\u0027the the place.)\n\u003C/p\u003E\n"},{"CreatedByName":"Hotaru","CreatedById":135669,"CreatedDateTime":"2017-03-07T16:34:57Z","Content":"\n\u003Cp\u003E\n\u003Cimg alt=\u0022iKapNJ1.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/iKapNJ1.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBravado 6 during its initial encounter with Jool.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nStation \u003Cem\u003EPermanence\u003C/em\u003E: arrival at Duna.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022gYUUuLi.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/gYUUuLi.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSuper Aqualung 4 was the first ship of the flotilla to arrive in the Duna system; it parked in Duna orbit, where it will provide fuel for future landings.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022GsP42AM.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/GsP42AM.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNext was station \u003Cem\u003EPermanence\u003C/em\u003E, with its four-kerman crew.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022mEfc5k6.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/mEfc5k6.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe station was refueled by Super Aqualung 3, and the transfer stage was jettisoned to impact Duna.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022PTol7tB.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/PTol7tB.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSuper Aqualung 3 then rendezvoused with and refueled lander LC-2, which docked at the station. The station crew will use it for further exploration of the surface of Duna.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBravado 6 at Jool.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nThe original flight plan called for Bravado 6 to encounter the Joolian satellite Tylo, the gravity of which would redirect it back toward Kerbin. During the flight out, however, the engineers realized that the planned trajectory would result in the spacecraft arriving back at Kerbin nearly a decade after its launch. While a burn at Tylo periapsis could have cut two years off the return trip, they came to the conclusion that it would actually be \u003Cem\u003Efaster\u003C/em\u003E for Bravado 6 to enter Joolian orbit, even if it had to wait for resupply from Kerbin to return.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Edp2OHl.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/Edp2OHl.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSo as the spacecraft approached Jool, it was redirected from its original course to encounter Tylo onto a new trajectory to fly by Laythe, using the innermost moon\u0027s gravity to reduce the capture burn.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00226HvJpmx.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/6HvJpmx.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThis was mission commander Burmin\u0027s view of Laythe and Jool during the spacecraft\u0027s approach.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022WQEDMp5.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/WQEDMp5.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EBurmin, Laselle \u0026amp; Carena: first kermen in the Joolian system!\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022szPu5Cn.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/szPu5Cn.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe spacecraft passed within 200 kilometers of the surface of Laythe, close enough to collect detailed scientific data and observations.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022PMY7qZQ.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/PMY7qZQ.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt then flew through the moon\u0027s shadow and approached Jool.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022rc0ljMr.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/rc0ljMr.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe crew became the first kermen to see the recently\u003Cs\u003E-inexplicably materialized\u003C/s\u003E-discovered rings of Jool up close.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022qtUVDJR.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/qtUVDJR.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nScientist Laselle performed an EVA to make close observations of the rings. \u003Cs\u003EFortunately for her, ionizing radiation hasn\u0027t been invented yet. \u003C/s\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022a3Zn7ZH.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/a3Zn7ZH.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe spacecraft passed into the shadow of Jool and the crew prepared for the capture maneuver.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022iD0ff31.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/iD0ff31.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBravado 6 completed its insertion burn at periapsis, putting it in a wide elliptical orbit of Jool.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022p2LlfUT.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/p2LlfUT.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt still has plenty of fuel left; the current plan is for it to complete encounters with the three inner Joolian satellites before eventually using the gravity of Tylo to eject itself out of the system and back towards Kerbin.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Hotaru","CreatedById":135669,"CreatedDateTime":"2017-03-09T19:10:19Z","Content":"\n\u003Cp\u003E\n\u003Cimg alt=\u00220ATT8mw.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/0ATT8mw.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBravado 6 during its second flyby of Laythe.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBravado 6: exploring the moons of Jool.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022m6LHjn7.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/m6LHjn7.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBravado 6 returned to the inner Joolian system after its first orbit, using the gravity of Laythe to lower its apoapsis and redirect it to a distant encounter with Vall...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022AQewGxP.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/AQewGxP.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n...a third pass by Laythe...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022UlyIO3x.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/UlyIO3x.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n...and its final encounter, a close flyby of Tylo.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00226CvTiC6.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/6CvTiC6.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA burn on the night side of Tylo sent the ship out of the Joolian system and on course to return to Kerbin in about two years.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nDuna flotilla: \u003Cem\u003EStarbus Elizabeth\u003C/em\u003E arrival.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022IbIu87Y.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/IbIu87Y.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EStarbus Elizabeth\u003C/em\u003E, which was launched on a slower transfer than the rest of the flotilla, arrived in Duna orbit and was refueled by Super Aqualung 3.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nCrew rotations and Kerbin system ops.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Z6XjpA4.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/Z6XjpA4.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nTo keep more kerbonauts available for interplanetary missions, standard station crews are being reduced from six kermen to four. Defiance 17 brought P3 Lodald, E3 Deblian, S3 Kathelyn, and rookie S0 Jenra to Base Constancy on the Mun via station \u003Cem\u003EPersistence\u003C/em\u003E; it returned to Kerbin with the previous crew. Defiance 18 (shown) delivered P2 Eiliel, E0 Barsen, S1 Darina, and S0 Leeuna to station \u003Cem\u003EPatience II \u003C/em\u003Efor the final expedition to that station.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022IsYT2dA.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/IsYT2dA.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nDefiance 19 carried P4 Kerzer, E3 Paty, S2 Tangel, and S0 Ribnard to station \u003Cem\u003EEndurance I \u003C/em\u003Eat Minmus, making a landing to collect science data from the satellite\u0027s slopes before returning to Kerbin with the previous crew.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBravado 5: exploring Gilly.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022UCxJiDj.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/UCxJiDj.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBravado 5 lifted off from its initial landing site in the lowlands of Gilly to explore the other biomes.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00227wnDdoD.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/7wnDdoD.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt landed next in the small satellite\u0027s midlands...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022AiuF7gL.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/AiuF7gL.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n...and finally in the highlands. The three landings constitute a complete survey of Gilly; apart from possible future mining in support of Eve operations, the Space Program administration has little further interest in the moon.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ft2wm2I.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/ft2wm2I.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nHaving completed what may be kermankind\u0027s first and last visit to Gilly, Bravado 5 departed for Kerbin.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nDaring 1: test flight.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022bvIFmXb.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/bvIFmXb.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA Brillig IV rocket launched Daring 1, an unkermanned test flight of the seven-kerman capsule for the next generation of interplanetary expeditions.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022qMa383Y.jpg?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/qMa383Y.jpg?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe spacecraft completed a circuit around the Mun before using its service module engine to put it on a hyperbolic trajectory back towards Kerbin, simulating an interplanetary reentry at 4 kilometers per second. Although there was some overheating \u003Cem\u003E(OOC: Heat shields continue to not correctly protect same-sized fairings, as we learned a while ago with the Circumspection program)\u003C/em\u003E, the spacecraft survived reentry and made a safe splashdown near \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E. The first operational use of the new vehicle will be Daring 2, currently planned to be a kermanned mission to Dres.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"KAL 9000","CreatedById":140704,"CreatedDateTime":"2017-03-10T13:09:09Z","Content":"\n\u003Cp\u003E\nHow do you get the decals with the vehicle names and numbers?\n\u003C/p\u003E\n"},{"CreatedByName":"Hotaru","CreatedById":135669,"CreatedDateTime":"2017-03-10T14:38:21Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/140704-kal-9000/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022140704\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/140704-kal-9000/\u0022 rel=\u0022\u0022\u003E@KAL 9000\u003C/a\u003E\u003Ca href=\u0022https://spacedock.info/mod/1132/NEBULA%20Decals%20Continued\u0022 rel=\u0022external nofollow\u0022\u003E Nebula decals\u003C/a\u003E. Actually I\u0027m still using the same old 0.25 version of it I\u0027ve been using since 0.90, which works fine; not sure what is updated about the one on Spacedock other than the bundled dependencies, but whatever. Good to know it\u0027s being actively maintained, anyway.\n\u003C/p\u003E\n"}]}