{"TopicId":148662,"ForumId":51,"TopicTitle":"From Student to Astronaut. (A fictional journal)","CreatedByName":"NSEP","CreatedById":165635,"CreatedDateTime":"2016-09-26T00:54:40Z","PageNum":1,"Articles":[{"CreatedByName":"NSEP","CreatedById":165635,"CreatedDateTime":"2016-09-26T00:54:40Z","Content":"\n\u003Cp\u003E\nSjaak Bruyn is a citizen of Doggerland, he is smart guy, he has the memory of an Elephant and stays calm in every situation. With this skill he could become an Astronaut. Sjaak wanted to be  and Astronaut, so he took the job. This is his story:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:\u0027Comic Sans MS\u0027, cursive;\u0022\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003EDay 1\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EMy first day in Doggers Space Village was awesome. Underway to the village, the bus had to stop because there was this HUGE Mammoth lazing around on the road, i have never seen such a creature before. They had to move it by making a trail of Mammoth candy leading to somewhere else. After half an hour, we could go on with our journey. I had to stop at a small town near the village, i met some amazing people, telling me about the Mammoths. I saw a little boy riding a baby Mammoth! How cute! But after that meeting and greeting, a mysterious looking taxi was waiting for me, it was time to go. The taxi driver was annoyed that i was not suited up correctly, he said this was serious business. And later, the taxi driver just opened the door and said \u0022get out!\u0022. So i got out, and he drove away. The first the i saw was a huge fountain, with some people walking around it. But behind the fountian, i saw a building, that looked like a 5 star hotel. But it is my home for like 5 years. So when i got acces to my appartement, i got in and was shocked, because it looked like a mansion, but hey, it is for Astronaut people, why not! I looked around my room, i put all my stuff in the right place, and then it was dinner time. Everybody who lived here got to one of the three special themed restaurants under the appartement complex. 300 people live in this compex. So i was hearing and seeing about 100 people. A busy restaurant it is! Then later that night, i got back to my room. And then there is me, writhing this in my journal. It was an awsome day, and there us alot more to come\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:\u0027Comic Sans MS\u0027, cursive;\u0022\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003E- Sjaak Bruyn\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2016-09-26T00:59:11Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003EOh god, Comic Sans\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nInteresting story, though.\n\u003C/p\u003E\n"},{"CreatedByName":"NSEP","CreatedById":165635,"CreatedDateTime":"2016-09-26T01:01:17Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222774295\u0022 data-ipsquote-contentid=\u0022148662\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221474851551\u0022 data-ipsquote-userid=\u0022152223\u0022 data-ipsquote-username=\u0022Aperture Science\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 minute ago, Aperture Science said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EOh god, Comic Sans\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nInteresting story, though.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIdk what is wrong with my device but comic sans does not look comic sansey anymore.\n\u003C/p\u003E\n"},{"CreatedByName":"NSEP","CreatedById":165635,"CreatedDateTime":"2016-09-26T01:24:44Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003EDay 2\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EToday is the day i got to start becoming Astronaut, i went up early, ate breakfast at the restaurant and went to my class. It was a computer classroom, i thought we had to do some advanced rocket science with the computers, but instead, we had to play this game called \u0022Kerbal\u0022 for 2 hours. I thought they were treating us like little kids, bu pt is pretty fun to be honest, we had to build a space station in those first 2 hours. They also told us that the average player of this game needs to take 400 hours of gameplay, just to learn on how to into orbit. Instead, i did it in 20 minutes. It did not take me long to make the station. After that, we got a lesson on how to make a station. We had to do it again, but now with more knowledge of what you are doing. When we did that, we went for a lunch break. After the break, we got to play this other game called orbiter 2016. It is a simulator program, and we had to get into orbit, this time, without the extra lessom. I figured it out quickly. After that, the school day is over.\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:28px;\u0022\u003E-\u003Cspan style=\u0022font-family:Georgia, serif;\u0022\u003ESjaak Bruyn\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n"}]}