{"TopicId":149284,"ForumId":38,"TopicTitle":"History Kerbal (or Kerbal History in reverse if you will)","CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2016-10-04T21:27:41Z","PageNum":1,"Articles":[{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2016-10-04T21:27:41Z","Content":"\n\u003Cp\u003E\nI\u0027m sure many others have fond memories of the various Kerbal History threads (and perhaps some less fond memories...), but as I recall they were all plagued by one problem above all others: They kept starting at the dawn of civilization and prophesying that the \u0022current\u0022 year was some number like 5000, and as a result we ended up with silly figures like the Jebediah being 3000 years old, and also we missed out on important events in prehistory.\n\u003C/p\u003E\n\u003Cp\u003E\nSo here\u0027s my go at it. In this edition we start at the current year, i.e. Year 1, Day 1, 0h, 0m as displayed whenever one of us takes control of a new save game. Then we go \u003Cem\u003Ebackward\u003C/em\u003E just a little bit at a time, listing important events that led up to that point and then what events led up to those. The game will of course end when we reach the Big Bang, but who\u0027s to say how many billions of posts that will take?\n\u003C/p\u003E\n\u003Cp\u003E\nRules!\u003Cbr\u003E\n- No repeated MLP, Homestuck, Doctor Who, etc. references. I hate to call out specific fandoms like this but we\u0027ve all seen what can happen. If the Kau or the KIONICLEs want to make one or two cursory appearances I won\u0027t press F9, but we\u0027ll all be sad if the thread derails and crashes.\u003Cbr\u003E\n- Don\u0027t jump back zillions of years at once. I don\u0027t want to see the second or third post be \u0022Year -13750000000: The Big Bang. Thread Locked.\u0022\u003Cbr\u003E\n- No other horrible thread-killing events. Since we\u0027re going backward in time it\u0027s very hard to say \u0022Year 5: Kerbol explodes,\u0022 but I don\u0027t doubt people\u0027s creativity in coming up with ways to ruin everything. ;P\u003Cbr\u003E\n- No going forward in time! If someone violates Rule 2 and jumps back too many years, you can try to fill in the gap with a few events, but don\u0027t go forgetting and posting stuff going forward in time or we\u0027ll all get very lost and confused very fast.\u003Cbr\u003E\n- I reserve the right to add a few new rules in case some nasty contingency appears. Also if a post is exceptionally stupid I reserve the right to mark it as \u0022non-canon,\u0022 but as much as possible I\u0027d like to leave it to the people in the thread to fix problems with clever narratives.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cs\u003EExamples\u003C/s\u003E last few events, to get the ball rolling:\u003Cbr\u003E\u003Cstrong\u003EYear 1, Day 1\u003C/strong\u003E: The official Kerbal Space Program opens its doors for its first day of business at the newly constructed Kerbal Space Center.\u003Cbr\u003E\u003Cstrong\u003ELate Year 0 BK\u003C/strong\u003E (Before Kerbal Space Program): The Mark 1 Pod memorial is erected to commemorate the long service of the now-retired Mark 1 Pod. Three of the last remaining original rocket parts are transported to the Island Airstrip to be stored and preserved for posterity.\u003Cbr\u003E\u003Cstrong\u003EYear 0 BK\u003C/strong\u003E: The old northern Kerbal Space Center closes its doors for the last time and most of its employees are transferred to the new equatorial Kerbal Space Center.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E(From here we count up BK years the same way we count up BC years on Earth, i.e. 10 BC was the year before 9 BC.)\u003C/em\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Delfinus","CreatedById":154315,"CreatedDateTime":"2016-10-05T21:49:49Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003EYear 1 BK\u003C/strong\u003E: the last flight launched from the Northern \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, an orbital flight intended to study the effects of Zero-G on snacks, lands in the ocean, marking the end of the Northern Space Program.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cb\u003EEarly Year 1 BK\u003C/b\u003E:\u003Cb\u003E \u003C/b\u003Ethe treaty to establish the international Kerbal Space Program at a space center near the equator is signed by many of the major world powers.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-10-05T21:51:43Z\u0022 title=\u002210/05/2016 09:51  PM\u0022 data-short=\u00227 yr\u0022\u003EOctober 5, 2016\u003C/time\u003E by DolphinDude3\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2016-10-05T22:47:55Z","Content":"\n\u003Cp\u003E\nYear 2 BK: Kerbodyne Inc. develops the KS-25 rocket engine and releases it as part of two production rocket modules, the KS-25 \u0022Vector\u0022 high-gimbal-range engine and the KS-25x4 \u0022Mammoth\u0022 heavy lift engine. Unfortunately no launch pad currently in existence is capable of supporting or launching rockets large enough to employ the latter, nor most designs using their existing Size 3 tank lineup, so Kerbodyne puts together a lobby group to push for the construction of the new space center.\n\u003C/p\u003E\n\u003Cp\u003E\nYear 2 BK: Vader Kerman successfully captures his daughter Leia Kerman and from her extracts the location of the stolen plans for the new Kerbal Space Center.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:10px;\u0022\u003E(Yay, a response! I was getting worried this thread would die right off the bat)\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"EGB9000","CreatedById":165193,"CreatedDateTime":"2016-10-06T04:03:07Z","Content":"\n\u003Cp\u003E\nYear 3 BK: Jebediah and his two brothers join his sister Valentina at the Northern Space Program, and begin training for space flights. Jebediah proves to be an exceptional pilot.\n\u003C/p\u003E\n\u003Cp\u003E\nYear 4 BK: Jebediah Kerman founds Jebediah Kerman\u0027s Junkyard and Spacecraft Parts Co. Repurposing and remaking older, more reliant engine designs for customers. The Northern Space Program buys in quickly and funds his company.\n\u003C/p\u003E\n\u003Cp\u003E\nYear 5 BK: Jebediah and his brothers quit work at C7 over alleged underpayment.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-10-06T04:10:31Z\u0022 title=\u002210/06/2016 04:10  AM\u0022 data-short=\u00227 yr\u0022\u003EOctober 6, 2016\u003C/time\u003E by EGB9000\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SpaceplaneAddict","CreatedById":149322,"CreatedDateTime":"2016-10-07T21:04:01Z","Content":"\n\u003Cp\u003E\nYear 6 BK: An angry mob kills the Flat Kerbinists\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Andem","CreatedById":155578,"CreatedDateTime":"2016-10-07T22:17:02Z","Content":"\n\u003Cp\u003E\nYear 7 BK: First jet engine concept put into testing.\n\u003C/p\u003E\n"},{"CreatedByName":"legoclone09","CreatedById":142607,"CreatedDateTime":"2016-10-08T00:21:20Z","Content":"\n\u003Cp\u003E\nYear 8BK Concept for jet engines created, none ever made yet.\n\u003C/p\u003E\n"},{"CreatedByName":"EGB9000","CreatedById":165193,"CreatedDateTime":"2016-10-08T02:15:57Z","Content":"\n\u003Cp\u003E\nYear 9BK: The first nuclear reactor goes online in a secret research facility on Mün.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n(I\u0027m not saying it\u0027s aliens, but it\u0027s aliens.)\u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-10-08T02:18:15Z\u0022 title=\u002210/08/2016 02:18  AM\u0022 data-short=\u00227 yr\u0022\u003EOctober 8, 2016\u003C/time\u003E by EGB9000\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2016-10-08T04:13:22Z","Content":"\n\u003Cp\u003E\nYear 9 BK: Construction is completed on the secret Munar nuclear reactor, but its first test run is postponed amid scares of sabotage by a society of Flat Kerbinists.\n\u003C/p\u003E\n\u003Cp\u003E\nYear 8 BK: Vader Kerman\u0027s daughter Leia runs away from home and steals the plans for the new Kerbal Space Center, intending to sell them to the Flat Kerbinists.\n\u003C/p\u003E\n\u003Cp\u003E\nYear 8 BK: A coalition of Jeb\u0027s Junkyard, Rockomax, and Zaltonic Electronics forms to build the first experimental nuclear power plant based on a hugely scaled-up version of the LV-N rocket motor. To quell potential concerns of an environmental catastrophe, an extremely expensive mission is begun to construct the reactor on the Mun.\n\u003C/p\u003E\n"},{"CreatedByName":"EGB9000","CreatedById":165193,"CreatedDateTime":"2016-10-08T19:15:51Z","Content":"\n\u003Cp\u003E\nYear 10 BK: Jeb\u0027s Junkyard is informally created, selling rebranded and improved C7 technologies. The NKR general Vader Kerman\u0027s daughter defects to the Flat Kerbinists.\n\u003C/p\u003E\n\u003Cp\u003E\nYear 11 BK: The Fascist regime of the Equatorial Peninsular Democratic Republic is successful in suppressing a coup. A secret terrorist organization is created by the EPDR under the codename \u0027Flat Kerbinists\u0027 to create terror and panic in  the Northern Kerbal Republic.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nYear 1 BK: The EPDR is overthrown in a second coup, allowing for the constuction of the equatorial space center.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-10-08T19:39:42Z\u0022 title=\u002210/08/2016 07:39  PM\u0022 data-short=\u00227 yr\u0022\u003EOctober 8, 2016\u003C/time\u003E by EGB9000\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2016-10-09T19:05:45Z","Content":"\n\u003Cp\u003E\nYear 12 BK: C7 Aerospace narrowly avoids bankruptcy when its acquisition of PorkWorks pays off and their new line of aircraft components turns out to be really popular.\n\u003C/p\u003E\n\u003Cp\u003E\nYear 13 BK: Vader Kerman is promoted to general by the NKR president Palpatine Kerman.\n\u003C/p\u003E\n\u003Cp\u003E\nYear 13 BK: C7 Aerospace falls into economic hard times and is forced to liquidate most of its assets, which are for some reason primarily bought out by Jebediah Kerman, a billionaire and daredevil test pilot.\n\u003C/p\u003E\n"},{"CreatedByName":"EGB9000","CreatedById":165193,"CreatedDateTime":"2016-10-09T23:00:58Z","Content":"\n\u003Cp\u003E\nLate Year 14 BK: After a successful repulsion of EPDR troops from the NKR, an armistice is signed between the NKR and EPDR.\n\u003C/p\u003E\n\u003Cp\u003E\nYear 14 BK: Captain Vader Kerman saves 23 Kerbals when he crash lands a heavily damaged gunship after a Combat mission over EPDR territory. \n\u003C/p\u003E\n\u003Cp\u003E\nEarly Year 15 BK: The EPDR invades the south eastern part of the NKR.\n\u003C/p\u003E\n\u003Cp\u003E\nYear 16 BK: A satellite is deployed in Kerbol orbit and returns impressive data about Kerbol. An autopsy is performed on one of the strange \u0027Tall Pink Men\u0027, proving the existence of intelligent alien life. A strange circular spacecraft is found during a North polar expedition.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-10-09T23:10:07Z\u0022 title=\u002210/09/2016 11:10  PM\u0022 data-short=\u00227 yr\u0022\u003EOctober 9, 2016\u003C/time\u003E by EGB9000\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2016-10-13T05:25:05Z","Content":"\n\u003Cp\u003E\nYear 17 BK: A rather clunky but expensive-looking spacecraft crash-lands in District K, its crew of \u0022Tall Pink Men\u0022 mysteriously unable to restore its functionality. For some time they try to make a living amongst Kerbalkind, but prove unable to subsist on a diet of \u0022snacks\u0022 and die off one by one.\n\u003C/p\u003E\n\u003Cp\u003E\nYear 18 BK: The New Kerbal Republic, or NKR, declassifies its data on induced nuclear fission, enabling the development of the LV-N Atomic Rocket Motor. Despite the NKR\u0027s grandiose claims, most of the \u0022cutting-edge research\u0022 that was done was simply the stuffing of a radiothermal generator into a liquid fuel tank. Nevertheless, an exclusive license for mass production of the new engine is secured by C7 Aerospace and huge amounts of capital are invested in it.\n\u003C/p\u003E\n"},{"CreatedByName":"EGB9000","CreatedById":165193,"CreatedDateTime":"2016-10-14T00:31:01Z","Content":"\n\u003Cp\u003E\nYear 19 BK: Wernher Kerman finishes work building missiles for the EPDR.\n\u003C/p\u003E\n"},{"CreatedByName":"KAL 9000","CreatedById":140704,"CreatedDateTime":"2016-10-14T15:14:22Z","Content":"\n\u003Cp\u003E\nYear 20 BK: The quadruplets (Jeb, Bill, Bob, and Val) are born to proud parents (Kerbals reach maturity faster than humans) \n\u003C/p\u003E\n\u003Cp\u003E\nYear 21 BK: Rich old billionaire Mortimer Kerman retires from his accounting job after having made his fortune.\n\u003C/p\u003E\n\u003Cp\u003E\nYear 22 BK: Young Kerbling HarvesteR Kerman decides he wants to start a space program when he grows up.\n\u003C/p\u003E\n\u003Cp\u003E\nYear 23 BK: The 100th anniversary of the invention of snacks is celebrated.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-10-14T15:14:42Z\u0022 title=\u002210/14/2016 03:14  PM\u0022 data-short=\u00227 yr\u0022\u003EOctober 14, 2016\u003C/time\u003E by KAL 9000\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"EGB9000","CreatedById":165193,"CreatedDateTime":"2016-10-19T00:59:49Z","Content":"\n\u003Cp\u003E\nYear 24 BK: Bobdir Kerman publicly becomes the first Kerbal on Mün.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-10-20T00:55:24Z\u0022 title=\u002210/20/2016 12:55  AM\u0022 data-short=\u00227 yr\u0022\u003EOctober 20, 2016\u003C/time\u003E by EGB9000\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Klassy KSP","CreatedById":165859,"CreatedDateTime":"2016-10-19T01:27:54Z","Content":"\n\u003Cp\u003E\nYear 25 BK: Dean, Orbit, and Gene Kerman become the first Kerbals to orbit the mun. \n\u003C/p\u003E\n\u003Cp\u003E\nYear 26 BK: The Jool V Mun rocket performs its first unmanned test. \n\u003C/p\u003E\n\u003Cp\u003E\nLate Year 27 BK:  Adventurer 3 becomes the first spacecraft to fly by Duna \n\u003C/p\u003E\n\u003Cp\u003E\nEarly Year 27 BK: The Jool I rocket disintegrates in mid air when it hits Mach 1 killing all onboard. This delays the Kapollo program and a lot of Kerbal money has been invested in strut technology. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-10-19T23:31:28Z\u0022 title=\u002210/19/2016 11:31  PM\u0022 data-short=\u00227 yr\u0022\u003EOctober 19, 2016\u003C/time\u003E by Klassy KSP\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"greenTurtle1134","CreatedById":167701,"CreatedDateTime":"2016-10-19T01:51:53Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222811886\u0022 data-ipsquote-contentid=\u0022149284\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221476840474\u0022 data-ipsquote-userid=\u0022165859\u0022 data-ipsquote-username=\u0022Klassy KSP\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n23 minutes ago, Klassy KSP said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYear 25 BK: Dean, Orbit, and Gene Kerman become the first Kerbals to orbit the mun.\n\u003C/p\u003E\n\u003Cp\u003E\nYear 26 BK: The Jool V Mun rocket performs its first unmanned test.\n\u003C/p\u003E\n\u003Cp\u003E\nLate Year 27 BK:  Adventurer 3 becomes the first spacecraft to fly by Duna \n\u003C/p\u003E\n\u003Cp\u003E\nEarly Year 27 BK: The Jool I rocket disintegrates in mid air when it hits Mach 1 killing all onboard. This delays the Kapollo program and a lot of Kerbal money has been invested in strut technology.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHm... considering the space program is just boosters and parachutes at Time Zero/Zero, is this really realistic? I think we\u0027re supposed to be doing the history before space tech was developed.\n\u003C/p\u003E\n"},{"CreatedByName":"Klassy KSP","CreatedById":165859,"CreatedDateTime":"2016-10-19T02:21:13Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222811927\u0022 data-ipsquote-contentid=\u0022149284\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221476841913\u0022 data-ipsquote-userid=\u0022167701\u0022 data-ipsquote-username=\u0022greenTurtle1134\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n22 hours ago, greenTurtle1134 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHm... considering the space program is just boosters and parachutes at Time Zero/Zero, is this really realistic? I think we\u0027re supposed to be doing the history before space tech was developed.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIn this timeline the kerbals have simple rocket tech at this time.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-10-20T00:06:51Z\u0022 title=\u002210/20/2016 12:06  AM\u0022 data-short=\u00227 yr\u0022\u003EOctober 20, 2016\u003C/time\u003E by Klassy KSP\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2016-10-19T05:34:25Z","Content":"\n\u003Cp\u003E\nNah, we\u0027re doing fine. Space exploration was nothing new when the modern \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E got started, as evidenced by all those agencies who ask you to save their Kerbals stranded around the Mun within five minutes of your first unmanned flyby ;P (Oh, and also the old space center)\n\u003C/p\u003E\n\u003Cp\u003E\n28 BK: \u0022The Jool Report\u0022 hits the box office and makes millions with its gripping, if exaggerated, depiction of the adventures of the crew of the \u003Cem\u003EWindward Spirit\u003C/em\u003E and their slaying of what appeared to be the legendary Kraken.\n\u003C/p\u003E\n\u003Cp\u003E\n29 BK: The crew of the \u003Cem\u003EWindward Spirit\u003C/em\u003E is finally released from quarantine and their mission report from Bop declassified. Why they went to Bop when the Mun hadn\u0027t even been explored yet, however, remains a mystery. They become instant celebrities, and first mate Vader Kerman is appointed the new general of the NKR airship armada.\n\u003C/p\u003E\n\u003Cp\u003E\n29 BK: Kerbodyne Inc. is founded.\n\u003C/p\u003E\n"},{"CreatedByName":"Klassy KSP","CreatedById":165859,"CreatedDateTime":"2016-10-19T23:57:29Z","Content":"\n\u003Cp\u003E\nLate 30 BK: KRAKEN-1 is launched into a solar orbit to study this mysterious \u0027KRAKEN\u0027.\n\u003C/p\u003E\n\u003Cp\u003E\nEarly 30 BK: Adventurer 3 is launched from the old space center.\n\u003C/p\u003E\n\u003Cp\u003E\nLate 31 BK: A strange signal originating in the Joolian system is detected by a small satellite launched 1 year earlier by Rockomax Conglomerate. Deemed \u0027KRAKEN\u0027 by scientists in the NKR.\n\u003C/p\u003E\n\u003Cp\u003E\nEarly 31 BK: The ONSC (old northern space program) Starts the Kapollo Program and the Jool I and Jool V rockets (manufactured by Rockomax) Are selected to Be the main boosters to be used in the Kapollo program and hopefully successfully putting kerbals on Mun.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-10-20T00:42:22Z\u0022 title=\u002210/20/2016 12:42  AM\u0022 data-short=\u00227 yr\u0022\u003EOctober 20, 2016\u003C/time\u003E by Klassy KSP\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"CRITAWAKETS","CreatedById":101250,"CreatedDateTime":"2016-10-20T00:05:59Z","Content":"\n\u003Cp\u003E\nMid-32 BK: Extermination of the Androkerbs is successful.\n\u003C/p\u003E\n\u003Cp\u003E\nEarly 34 BK: Angry kerbals decide to take up residence on Minmus and they call themselves the Androkerb.\n\u003C/p\u003E\n"},{"CreatedByName":"Klassy KSP","CreatedById":165859,"CreatedDateTime":"2016-10-20T00:18:17Z","Content":"\n\u003Cp\u003E\n35 BK: Adventurer 1 and Adventurer 2 are Launched from the ONSC to fly-by Minmus and Mun.  \n\u003C/p\u003E\n\u003Cp\u003E\n36 BK: A new science experiment is invented called \u0027Mystery Goo\u003Csup\u003Etm\u003C/sup\u003E.\u0022 This allows unmanned vehicles to study space without the need for crew to report on the situation.\n\u003C/p\u003E\n\u003Cp\u003E\nEarly 36 BK: a Dwarf Planet named \u0027Dres\u0027 is discovered. When it was first discovered astronomers thought they were looking at Ike but after they could not see Duna next to it they confirmed it is indeed a new Dwarf planet. \n\u003C/p\u003E\n\u003Cp\u003E\nLate 37 BK: Edlu Kerman is the first Kerbal to preform a spacewalk.\n\u003C/p\u003E\n\u003Cp\u003E\nEarly 37 BK: Archibald Kerman becomes the first Kerbal in Orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-10-20T00:44:32Z\u0022 title=\u002210/20/2016 12:44  AM\u0022 data-short=\u00227 yr\u0022\u003EOctober 20, 2016\u003C/time\u003E by Klassy KSP\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"EGB9000","CreatedById":165193,"CreatedDateTime":"2016-10-20T01:01:15Z","Content":"\n\u003Cp\u003E\nLets just say that there was a bunch of secret missions performed by the EPDR before all the public missions. Alright? Good.\n\u003C/p\u003E\n\u003Cp\u003E\nYear 38 BK: The last EPDR mission to Duna is performed, the spacecraft suffers a major engine failure on Kerbin reentry and burns up in the atmosphere, killing all 12 of the crew.\n\u003C/p\u003E\n"},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2016-10-20T01:30:19Z","Content":"\n\u003Cp\u003E\n38 BK: The \u003Cem\u003EWindward Spirit\u003C/em\u003E returns from its journey to the Jool system and, after reporting they had encountered what they believed to be a malevolent extraterrestrial beast, its crew were immediately placed in quarantine. After this point they all went through a battery of tests, both psychological and physiological, to determine the veracity of their story and the effects such an encounter might have had on them.\n\u003C/p\u003E\n\u003Cp\u003E\n39 BK: Communication with the \u003Cem\u003EWindward Spirit\u003C/em\u003E is lost somewhere in the vicinity of Bop. It is surmised by several of Kerbin\u0027s major electronics manufacturers that it might be wise to set up a Deep Space Network. To aid in this endeavor, competing companies Ionic Electronics, Symphonic Electronics, and Protonic Electronics merge to form the new Ionic Symphonic Protonic Electronics.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-10-20T01:33:17Z\u0022 title=\u002210/20/2016 01:33  AM\u0022 data-short=\u00227 yr\u0022\u003EOctober 20, 2016\u003C/time\u003E by parameciumkid\u003C/strong\u003E\n\u003Cbr\u003Ederp\n\u003C/span\u003E\n"}]}