{"TopicId":149485,"ForumId":69,"TopicTitle":"Awful terrain detail","CreatedByName":"Saylorock93","CreatedById":163745,"CreatedDateTime":"2016-10-08T10:07:15Z","PageNum":1,"Articles":[{"CreatedByName":"Saylorock93","CreatedById":163745,"CreatedDateTime":"2016-10-08T10:07:16Z","Content":"\n\u003Cp\u003E\nHello guys! Even if i have everything maxed out in the graphic options, everything far enough (talking about terrain, so mostly mountains, and mostly from orbit distance) looks really awful, like it\u0027s always on the lowest iteration and it\u0027s not \u0022loading and getting more detailed\u0022\u003Cbr\u003E\u003Cbr\u003E\nI\u0027ll put a pic to show. Is this normal? \u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u00222BMppA.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://imagizer.imageshack.us/v2/1024x768q90/924/2BMppA.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nEdit: i resized the pic from 1080 to this one, obviously the original pic shows better how everything is blurry, flat and ugly\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-10-08T10:08:27Z\u0022 title=\u002210/08/2016 10:08  AM\u0022 data-short=\u00227 yr\u0022\u003EOctober 8, 2016\u003C/time\u003E by Saylorock93\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Benoit Hage","CreatedById":104585,"CreatedDateTime":"2016-10-09T21:14:30Z","Content":"\n\u003Cp\u003E\nLooks pretty normal to me...\n\u003C/p\u003E\n\u003Cp\u003E\nWhat makes you think your game is different from what you\u0027ve seen on internet?\n\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2016-10-09T21:26:03Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222794917\u0022 data-ipsquote-contentid=\u0022149485\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221476047670\u0022 data-ipsquote-userid=\u0022104585\u0022 data-ipsquote-username=\u0022Benoit Hage\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n15 minutes ago, Benoit Hage said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nLooks pretty normal to me...\n\u003C/p\u003E\n\u003Cp\u003E\nWhat makes you think your game is different from what you\u0027ve seen on internet?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBecause everyone posting screenshots on the internet uses Eve, Scatterer, and/or Texture Replacer.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cabbr title=\u0022Original Post(er). The first post in a thread, or the person who posted it.\u0022\u003EOP\u003C/abbr\u003E, sadly this is normal.  If you want better you need to go with mods.  Start \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/143288-113-1082-stock-visual-enhancements/\u0022 rel=\u0022\u0022\u003Ehere\u003C/a\u003E.  Then go \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/143828-113-stock-visual-terrain-142/#comment-2676888\u0022 rel=\u0022\u0022\u003Ehere\u003C/a\u003E.  Finally, \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/103963-wip12113-scatterer-atmospheric-scattering-v00255-02102016-modulemanager-compatibility/\u0022 rel=\u0022\u0022\u003Ehere\u003C/a\u003E. That\u0027s just for the planet\u0027s visuals, there are a ton of great non-planet visual mods too.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-10-09T21:30:07Z\u0022 title=\u002210/09/2016 09:30  PM\u0022 data-short=\u00227 yr\u0022\u003EOctober 9, 2016\u003C/time\u003E by Alshain\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"fireblade274","CreatedById":134571,"CreatedDateTime":"2016-10-10T06:28:42Z","Content":"\n\u003Cp\u003E\nThough hopefully there will be a 1.3 graphical update\n\u003C/p\u003E\n"},{"CreatedByName":"Saylorock93","CreatedById":163745,"CreatedDateTime":"2016-10-10T09:07:24Z","Content":"\n\u003Cp\u003E\nThank you for answering guys, the fact is that i\u0027m already using scatterer (it was off in the screenshot cause of incom. with 1.2). What i\u0027m talking about is not the quality of light effects, maybe clouds and fake city lights, but mostly about how often mountains are totally flat from LO distance, and you can see looking at shores how they\u0027re incredibly low in poly count. \u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022scatterer-1456285817.4561393.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022https://spacedock.info/content/blackrack_378/scatterer/scatterer-1456285817.4561393.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nShouldn\u0027t we have this level of detail also from LO at least?\n\u003C/p\u003E\n"},{"CreatedByName":"Vaporized Steel","CreatedById":108520,"CreatedDateTime":"2016-10-10T15:27:23Z","Content":"\n\u003Cp\u003E\nKSP is not a high end graphics game and never will be. But admitted I think there is some room for improvement. Atleast give us a slider for auto generated textures like trees (with a tree line this time please)\u003Cbr\u003E\nIt\u0027s kind of a fixed objective of any game developer to make the game playable for everyone.\n\u003C/p\u003E\n\u003Cp\u003E\nDon\u0027t expect major changes for that reason, and I\u0027ll explain why more specifically if you want to know.\u003Cbr\u003E\nKSP already is CPU intensive. I have a overclocked 4.3ghz 3570K Processor with 8gigs of ram. This particular processor seems to do very well for ksp according to a chart I read sometime ago. The reason for this has to do with calculations (flops) per clock which is technical and I\u0027ll spare you. Most newer CPUs are better at this but the 3570k in this instance has that and a high base clock \u002B overclockability. Other CPUs might not work as good as mine.\u003Cbr\u003E\nI get 15\u002B fps just on my 200 part vessels and even lower if I go near 300 parts (which is where things are still tolerable)\n\u003C/p\u003E\n\u003Cp\u003E\nWhat your suggesting is to make the game besides CPU demanding also GPU demanding. The problem there is that the CPU supplies RAW pre-calculated data for your GPU. The higher the graphics, the more the CPU has to do to serve the needs of the GPU. This is minal though, especially in KSP, so mostly this should not be a bottlenecking factor. But because your CPU in KSP is already pretty much stressed atleast on one if not multiple cores any more load is only going to get the FPS further down.\n\u003C/p\u003E\n\u003Cp\u003E\nSo making KSP with higher end graphics will exponentiate the performance losses because the CPU now has to do a 2nd thing while already stressed with it\u0027s basic physics and KSP related calculations. This is why you see frames per second loss if you got a variety of graphics mod installed on KSP. So expect FPS loss if you are going to mod. With the right settings a proper CPU and enough RAM it should still be very playable, regardless of your gamedata folder contents.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nI see it is basically a trend for CPU intensive sandbox environments to have lower graphics. Take vanilla FSX for example. Because programmers are often limited to choose either a CPU or GPU intensive environment because a environment that has both elements will always make the CPU a bottleneck no matter what Extreme overclock edition \u002B phase change cooling you\u0027ll choose.\u003Cbr\u003E\u003Cbr\u003E\n \n\u003C/p\u003E\n"}]}