{"TopicId":149615,"ForumId":39,"TopicTitle":"From Kerbin To The Mun [Series in Development]","CreatedByName":"Kalidor","CreatedById":151719,"CreatedDateTime":"2016-10-10T19:32:27Z","PageNum":1,"Articles":[{"CreatedByName":"Kalidor","CreatedById":151719,"CreatedDateTime":"2016-10-10T19:32:27Z","Content":"\n\u003Cp\u003E\nGreetings,\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve been firing Kerbals into space for 728 hours and finally got the time to work on this little side project of mine.\n\u003C/p\u003E\n\u003Cp\u003E\nOnce 1.2 has dropped and my mod list is back up-to-date I will be writing a fan series chronicling the early years of the Kerbal Space Programme. This isn\u0027t the first series of its type but I\u0027m hoping the back story and history I have in mind for it will make it an entertaining read for you.\n\u003C/p\u003E\n\u003Cp\u003E\nIn brief, the series will start in the aftermath of a brief but catastrophic nuclear war between the 4th Kerbin Empire and the fledging Independent Kerbal States (IKS) (Separatists wanting to escape the heavy taxation imposed by the Emperor). Again this is nothing new but I couldn\u0027t think of a better reason for the Kerbals to develop rockets other than for military purposes. Utilising aging piston engine aircraft the IKS Pilots wage a guerrilla war against the Empire to damage their infrastructure - facing early jet aircraft flown by the Imperial pilots. With mounting losses the Emperor turns to Dr. Werner Von-Kerman to develop a terror weapon that can bring the rogue states into line. The attacks serve to strengthen the IKS resolve and - enlisting support from sympathetic factions within the Empire - they launch a full scale assault on Kerbin City to remove the Empire from power. Faced with a shameful defeat the Emperor invokes a \u0022Scorched Kerbin\u0022 protocol and commits suicide. Though the IKS win the battle and the Empire falls the political and environmental fallout are catastrophic - rendering large swathes of Kerbin uninhabitable.\n\u003C/p\u003E\n\u003Cp\u003E\nAs the Kerbin Reconstruction Authority (KRA - Interim Government) desperately searches for a way to ensure the survival of Kerbal Kind by designating areas of Kerbin Blue, Yellow or Red Zones depending on their levels of radiation. There are very few Blue Zones (Rad Free) and most of the population live in Yellow Zones. As the KRA faces the daunting prospect of having to make some tough decisions an amazing discovery is made in Kerbin\u0027s irradiated waters...one that may hold the key to repairing the damage to Kerbin\u0027s ecosystem. With the clock to extinction ticking the KRA appoint Major Gene Kerman to oversee what will ultimately become the KSP. Bringing together old enemies, new allies...and a thrill seeking scrap merchant eager to leave his mark on history...from Kerbin to the Mun will document the early years of the KSP before the programme was officially founded.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EMain Characters\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nLt. Jedidiah Kerman (Former IKS Pilot) - Scrap Merchant, Air Race Pilot, Amateur Rocketry Enthusiast.\u003Cbr\u003E\nCapt. Valentina Kerman (Former Imperial Pilot) - Aerospace Technology Reporter for Kerbin City Times Newspaper.\u003Cbr\u003E\nBill Kerman (Civilian Engineer) - Project Leader for KRA.\u003Cbr\u003E\nBob Kerman (Civilian Scientist) - Field Researcher for Kerbin City University.\u003Cbr\u003E\nMajor. Gene Kerman (Imperial Paramilitary Ops Officer, IKS Sympathiser) - Director, KRA Logistics Division \u003Cbr\u003E\nDoctor. Werner Von-Kerman (Former Imperial Scientist) - War Criminal awaiting trial for crimes against Kerbal Kind.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ESeries Goals\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n1) Provide an exciting backstory and History to Kerbal Space Programme.\n\u003C/p\u003E\n\u003Cp\u003E\n2) Provide detailed Spacecraft Plans and Craft Files for Readers to replicate the missions documented.\n\u003C/p\u003E\n\u003Cp\u003E\n3) Provide detailed Mission Reports (In Lieu of Creating a Mission Pack at a later date - Currently Beyond My Skill Level)\n\u003C/p\u003E\n\u003Cp\u003E\n4) Develop New and Existing Characters to carry the series forward.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ECommunity Inclusion\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIt will likely take some time to update my mod library but when its complete I will list the mods used to create the series. This will be a Stock-a-Like series so as much as I love packs such as Bluedog Design Bureau the craft used in the series will be original designs...perhaps \u003Cem\u003Einspired\u003C/em\u003E by real-world spacecraft but by no means carbon copies.\n\u003C/p\u003E\n\u003Cp\u003E\nThrowing the forum open, is there anything you would like to see in this series...all ideas are considered as long as they stay true to the plot. Also accepting help and assistance from artists and craft designers as my personal approach is more \u0022Form follows Function\u0022 and it would be nice to have a bit of eye candy for people to look at. Mission Patches are cool too!\n\u003C/p\u003E\n\u003Cp\u003E\nLook forward to speaking with you.\n\u003C/p\u003E\n\u003Cp\u003E\nKal \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Kalidor","CreatedById":151719,"CreatedDateTime":"2016-10-20T21:53:51Z","Content":"\n\u003Cp\u003E\nWell, Almost up to date with Mod List and had some ideas about the fanfic...decided to tell the story from a different perspective.\n\u003C/p\u003E\n\u003Cp\u003E\nHopefully be posting the foreword and prologue in the coming week or so...if feedback is positive I will carry on writing.\n\u003C/p\u003E\n\u003Cp\u003E\nWithout giving too much away, the thread will be entitled\u003Cstrong\u003E \u0022From Kerbin to the Mun\u0022 - The Official Biography of Maj. Valentina Kerman.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EKal\u003C/strong\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"TheKosanianMethod","CreatedById":163034,"CreatedDateTime":"2016-10-20T22:09:13Z","Content":"\n\u003Cp\u003E\nSounds awesome! Can\u0027t wait to see the first part. Good luck!\n\u003C/p\u003E\n"},{"CreatedByName":"Kalidor","CreatedById":151719,"CreatedDateTime":"2016-10-20T23:02:34Z","Content":"\n\u003Cp\u003E\nCheers \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/163034-thekosanianmethod/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022163034\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/163034-thekosanianmethod/\u0022 rel=\u0022\u0022\u003E@TheKosanianMethod\u003C/a\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nMods, can you please close this thread...I\u0027m going to post another to officially start my fanfic.\n\u003C/p\u003E\n\u003Cp\u003E\nThanks\n\u003C/p\u003E\n\u003Cp\u003E\nKal\n\u003C/p\u003E\n"}]}