{"TopicId":149835,"ForumId":16,"TopicTitle":"Controls Busted","CreatedByName":"ZanZaru","CreatedById":170179,"CreatedDateTime":"2016-10-13T01:05:06Z","PageNum":1,"Articles":[{"CreatedByName":"ZanZaru","CreatedById":170179,"CreatedDateTime":"2016-10-13T01:05:06Z","Content":"\n\u003Cp\u003E\nI played KSP during 1.1 for several days and i do understand how the game controls work.  \n\u003C/p\u003E\n\u003Cp\u003E\nWhen 1.2 released i decided to begin a new game in career mode.  For some reason now in the new game the games default controls for flight in a completely unmodded game version 1.2 DO NOT WORK.  To be more exact, I\u0027m just starting again so of course the first few steps are building small rockets etc etc (you know the drill) as i launch the first rocket to get into space the games DEFAULT keyboard controls do absolutely nothing at all to the rocket, i mean absolutely freaking nothing the gauge that shows you your pitch yaw roll inputs are all sitting there perfectly still as if receiving no input form me what so ever as i hit the WASDQE buttons.  However the camera is receiving those keyboard inputs and the keyboard that (at least in the past game) should be giving control input to the rocket are instead moving the camera all over the place as the rocket goes straight up and only straight up.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat am i missing here?????  As far as i know i changed no settings at all from my last game to this one.  Did i hit some stupid little toggle somewhere or something?\n\u003C/p\u003E\n"},{"CreatedByName":"FullMetalMachinist","CreatedById":156531,"CreatedDateTime":"2016-10-13T02:33:15Z","Content":"\n\u003Cp\u003E\nIs there a chance that when you installed 1.2 you upgraded on top of your existing 1.1 game? If so that could be the problem. The old settings might not have been correctly overwritten by the new install.\n\u003C/p\u003E\n\u003Cp\u003E\nI \u003Cem\u003Ethink\u003C/em\u003E that if you delete the settings.cfg file in the main KSP folder then the game will create a new one with the default values. Or you can try downloading and running a completely fresh install. \n\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2016-10-13T03:39:44Z","Content":"\n\u003Cp\u003E\nCrewed ship or probe core? What does it look like? Have you tried re-mapping the input keys? \n\u003C/p\u003E\n"},{"CreatedByName":"DD_bwest","CreatedById":164906,"CreatedDateTime":"2016-10-13T04:30:43Z","Content":"\n\u003Cp\u003E\nPictures can help us figure out whats going on.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\non a similar note, today i was launching a rocket to duna, first try after launch i had essentially no control..  so i revert and tried again, this time staging just made a sound and nothing more..\n\u003C/p\u003E\n\u003Cp\u003E\nturns out rigid attachment was causing a joint to break, that caused the whole thing to mess up whenever the physics tried to load lol\n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2016-10-13T07:44:38Z","Content":"\n\u003Cp\u003E\nThere is always the possibility of a corrupted download -- did you get your 1.2 upgrade from steam? If so, did you go through the verification process?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}