{"TopicId":150394,"ForumId":32,"TopicTitle":"Two Settings Questions","CreatedByName":"ansaman","CreatedById":78227,"CreatedDateTime":"2016-10-20T01:24:27Z","PageNum":1,"Articles":[{"CreatedByName":"ansaman","CreatedById":78227,"CreatedDateTime":"2016-10-20T01:24:27Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:16px;\u0022\u003EA lot of people here are a lot more knowledgeable about computer graphics and settings especially regarding KSP. I have a very modest desktop system and I get pretty reasonable performance... it is playable. \u003C/span\u003E\u003C/strong\u003E\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:16px;\u0022\u003EWhat difference does half-res versus full-res make regarding performance and visuals?\u003C/span\u003E\u003C/strong\u003E\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:16px;\u0022\u003EWhat sort of changes happen if you change the max physics-delta per frame setting (default .04)? I know it can keep the simulation from slowing down if it is increased, but is there a downside?\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2016-10-20T01:59:04Z","Content":"\n\u003Cp\u003E\nI find that reducing the texture resolution is basically ineffectual as far as the stock game is concerned. Any computer from the last three years or so, even with integrated graphics, should run at full resolution quite easily, so \u003Cstrong\u003EI say leave the texture resolution setting at Full\u003C/strong\u003E for best visual appearance.\n\u003C/p\u003E\n\u003Cp\u003E\nWith mods like \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E it can be another story, as while the stock textures tend to be in the neighborhood of 512x512, many \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E packs come with 4096x4096 textures or bigger. In that case, the settings menu won\u0027t do much to save you anyway, but you can manually resize the images in the GameData folder (back this up first if you aren\u0027t a 1337 H4X0R).\n\u003C/p\u003E\n\u003Cp\u003E\nThe Max Delta-Time setting is a limit on how much time is allowed to go by in between frames. If it\u0027s very very low, then as the game renders in (up to) 60 frames per second, time will slow down in the game to ensure that the physics processing doesn\u0027t ruin the framerate. If it\u0027s very very high, then when the game isn\u0027t running at 60 fps, a long time may pass between frames (like a whole quarter second for example). If this occurs, the game will end up extrapolating the positions, velocities, and forces on various parts a long way from what they were in the last frame. In the end this results in things like rounding errors and other \u0022bad guesses\u0022 by the physics engine, which in practical terms means you\u0027re more likely to summon the Kraken.\n\u003C/p\u003E\n\u003Cp\u003E\nRunning the game at high physics delta-time settings is more or less the same as running the game in physical timewarp mode but still displaying everything at 1x speed. So if you notice, say, a rover\u0027s wheels jump up and down or a plane can\u0027t hold its attitude at 4x timewarp, you\u0027ll see the same thing happen if you quadruple the delta-time setting. Thus \u003Cstrong\u003EI recommend keeping the physics delta-time at a low number\u003C/strong\u003E - personally I have it all the way down at the minimum of 0.03. This also happens to keep the framerate playably high when dealing with massive 1000\u002B part count ships.\n\u003C/p\u003E\n\u003Cp\u003E\nHopefully this helped ^^;\n\u003C/p\u003E\n"},{"CreatedByName":"ansaman","CreatedById":78227,"CreatedDateTime":"2016-10-20T03:13:09Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222813818\u0022 data-ipsquote-contentid=\u0022150394\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221476928744\u0022 data-ipsquote-userid=\u0022101649\u0022 data-ipsquote-username=\u0022parameciumkid\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, parameciumkid said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHopefully this helped ^^;\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYes, it did... a lot. I changed the physics delta time to .06 and everything seems OK, but I will be careful. I don\u0027t know how much is pushing my luck.\n\u003C/p\u003E\n"}]}