{"TopicId":15051,"ForumId":25,"TopicTitle":"Mass Transit","CreatedByName":"Extraneous","CreatedById":16940,"CreatedDateTime":"2012-07-24T14:10:31Z","PageNum":1,"Articles":[{"CreatedByName":"Extraneous","CreatedById":16940,"CreatedDateTime":"2012-07-24T14:10:31Z","Content":"\n\u003Cp\u003EWith the addition of EVAs and variable crew numbers, I was wondering - how many crew can YOU land on a single lander? A one-man landing is the same as in 0.15. A three-man landing is harder, but no doubt possible to our many landing fans. But - are more Kerbals than this possible? Only one way to find out - challenging the community!\u003C/p\u003E\u003Cp\u003EScoring: One point per Kerbal landed. Extra kudos for doing ridiculous things on the way there, earning ALL points that you are applicable for (for example, Mun and Minmus flight would get \u002B4 points):\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E- All crew survive mission: \u002B1\u003C/p\u003E\u003Cp\u003E- Your lander takes no damage when landing: \u002B1\u003C/p\u003E\u003Cp\u003E- Your lander returns home: \u002B1\u003C/p\u003E\u003Cp\u003E- Your lander returns to the area around the KSC: \u002B1\u003C/p\u003E\u003Cp\u003E- Land on the Mun: \u002B1\u003C/p\u003E\u003Cp\u003E- Land on Minmus: \u002B2\u003C/p\u003E\u003Cp\u003E- Land on the Mun and Minmus in the same flight: \u002B1\u003C/p\u003E\u003Cp\u003E- Landing made with one or more crew members holding ladders during descent: \u002B1\u003C/p\u003E\u003Cp\u003E- Landing made with all crew except pilot holding ladders during descent: \u002B2\u003C/p\u003E\u003Cp\u003E- Landing made with another ship attached in some way to yours (landing leg grip perhaps): \u002B2\u003C/p\u003E\u003Cp\u003E- Anything I missed in this list? Add points anyway! (\u002B1) \u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ETell me your scores, complete with pictures for anything that needs proof, you crazy people.\u003C/p\u003E\u003Cp\u003ERules: You can launch as many rockets as you want - so long as you land everything in one go. You could, for example, set a few small landers in orbit before nabbing them up with your big landing claw monstrosity, but they must all land in the same group - no landing them one craft at a time! If you have a ridiculous number of little green fellows out there, try and enjoy yourself too!\u003C/p\u003E\u003Cp\u003E(I believe this is doable! My score is 5 - 3 crew on a Mun landing that I managed to return from. I tried to get Jernand to EVA whilst starting my descent: sadly he fell off when I got a bit scared about going too fast and hit the ground, at which point I landed on him, breaking one of the landing legs in the process. RCS managed to get me back upright, at which point I left hurriedly in the hope that nobody had noticed my mistake. I guess you have to start slowing down earlier and make your deceleration less sudden.)\u003C/p\u003E\u003Cp\u003ELeaderboards:\u003C/p\u003E\u003Cp\u003E-----\u003C/p\u003E\u003Cp\u003E-----\u003C/p\u003E\u003Cp\u003E-----\u003C/p\u003E\u003Cp\u003E-----\u003C/p\u003E\u003Cp\u003E-----\u003C/p\u003E\n"},{"CreatedByName":"Khrissetti","CreatedById":29557,"CreatedDateTime":"2012-07-24T14:43:34Z","Content":"\n\u003Cp\u003EAh! I was planning on building a space bus this evening just for the hell of it, now I have a reason! The only thing which I think will halt my dreams is lag as more and more kerbals are added.\u003C/p\u003E\n"},{"CreatedByName":"Matticus88","CreatedById":30754,"CreatedDateTime":"2012-07-24T16:38:01Z","Content":"\n\u003Cp\u003EWith the \u0027Crew Tank\u0027 \u003Ca href=\u0022http://kerbalspaceprogram.com/forum/index.php?topic=10138.0\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/forum/index.php?topic=10138.0\u003C/a\u003E You can easily send many kerbals up into space at once, just gotta transfer them from other rockets into the crew tanks first \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"neistridlar","CreatedById":20296,"CreatedDateTime":"2012-07-24T21:17:58Z","Content":"\n\u003Cp\u003EI think this Challenge needs to be limited to stock parts only, else you could just mod the command module to hold as many kerbals as you like.\u003C/p\u003E\n"},{"CreatedByName":"A Fat Pokemon","CreatedById":29245,"CreatedDateTime":"2012-07-31T14:28:21Z","Content":"\n\u003Cp\u003ETo my tests before I ever saw the challenge, kerbals will drift through walls on higher warps so this challenge would take a really long time \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Khrissetti","CreatedById":29557,"CreatedDateTime":"2012-08-01T13:25:28Z","Content":"\n\u003Cp\u003Eyeah, this is what I discovered. I\\\u0027ll post my perfectly workable design \\\u0027The Cage\\\u0027 later on, unfortunately the lag on my computer with multiple kerbals hanging on the side makes this challenge a no-go for me. I wouldn\\\u0027t mind waiting an hour or so to land the craft on the Mun but I can\\\u0027t be bothered when I\\\u0027m down to painful FPS ratings the whole way.\u003C/p\u003E\u003Cp\u003ESorry, it\\\u0027s a good challenge and entirely possible but my computer just isn\\\u0027t up to the job.\u003C/p\u003E\n"},{"CreatedByName":"Railsmith","CreatedById":27174,"CreatedDateTime":"2012-08-01T16:07:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Extraneous\u0022 data-cite=\u0022Extraneous\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E(landing leg grip perhaps)\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhen I read this I immediately thought \u0027Spaceship! Now with kung-fu grip!\u0027 XD\u003C/p\u003E\u003Cp\u003EBut yeah, once I get rendezvouses figured out I\\\u0027m going to try this out with kerbals hanging onto the sides like remora on a shark. Good challenge!\u003C/p\u003E\n"},{"CreatedByName":"dodrian","CreatedById":12564,"CreatedDateTime":"2012-08-01T22:01:12Z","Content":"\n\u003Cp\u003EPerhaps not what you had in mind, but using the Crew Tank, I landed 14 Kerbals on Minimus. I could have had more, the craft holds up to 18.\u003C/p\u003E\u003Cp\u003EI staged the excursion from the Mun, I had an established base there, and the craft was originally there as an emergency return-to-Kerbin vehicle. But then I decided to change the mission spec!\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022http://kerbalspaceprogram.com/forum/index.php?action=dlattach;topic=16902.0;attach=29117\u0022 alt=\u0022index.php?action=dlattach;topic=16902.0;attach=29117\u0022\u003E\u003C/p\u003E\u003Cp\u003ECaptain Bill leads the crew\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"SteevyT","CreatedById":6183,"CreatedDateTime":"2012-08-01T22:55:20Z","Content":"\n\u003Cp\u003EAny ideas how to get Kerbals into this lander?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/QVUL8.jpg\u0022 alt=\u0022QVUL8.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\n"}]}