{"TopicId":150576,"ForumId":55,"TopicTitle":"Allow text entry of numerical tweakables","CreatedByName":"Allocthonous","CreatedById":169833,"CreatedDateTime":"2016-10-22T07:21:21Z","PageNum":1,"Articles":[{"CreatedByName":"Allocthonous","CreatedById":169833,"CreatedDateTime":"2016-10-22T07:21:21Z","Content":"\n\u003Cp\u003E\nThis shows up mostly for the \u0027authority limit\u0027 tweakable on aerodynamic control surfaces, but anytime I go to adjust one I find myself fighting the interface to get it to the correct value. Sometimes it is flat out impossible to make it show up as, say, 20 instead of 19 or 21. What\u0027s worse, it\u0027s not \u003Cem\u003Econsistent\u003C/em\u003E, which means that you might have one control surface that can be adjusted to that number just fine, but its neighbor won\u0027t. This does horrible things to my inner perfectionist.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, could we take that space where the number for the tweakable\u0027s current value is displayed, and turn it into a text entry box? Keep the slider working as normal, but please let me highlight that number and enter a value.\n\u003C/p\u003E\n"},{"CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2016-10-22T10:39:45Z","Content":"\n\u003Cp\u003E\nI agree.\n\u003C/p\u003E\n"},{"CreatedByName":"klgraham1013","CreatedById":105132,"CreatedDateTime":"2016-10-22T10:54:41Z","Content":"\n\u003Cp\u003E\nYes please.\n\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2016-10-22T12:25:50Z","Content":"\n\u003Cp\u003E\nThis is a long standing gripe of mine, would love to see direct numerical entry implemented.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s especially frustrating when you need the numbers of two tweakables to match, like if you\u0027re thrust-limiting two or more engines or balancing liquid fuel with oxidizer.\n\u003C/p\u003E\n"},{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2016-10-22T13:11:31Z","Content":"\n\u003Cp\u003E\nVery much this! It\u0027s a much needed feature.\u003Cbr\u003E\u003Cbr\u003E\nI would suggest the interface for it should be; \u003Cbr\u003E\n- right click to open the menu as normal (and it appears exactly the same as it is with the slider).\u003Cbr\u003E\n- hit tab (as it\u0027s not used in the editors and is intuitively the key to select fields) and it turns the first slider on the menu into a text field AND selects the current value.\u003Cbr\u003E\n- hit tab again to move to the next slider and turn it into a text field.\u003Cbr\u003E\n- shift \u002B tab to move to the previous field (you know, principle of least surprise and all that).\u003Cbr\u003E\nand for bonus points\u003Cbr\u003E\n- hitting enter would turn the current text field back into a slider \u003Cbr\u003E\n- hitting esc would also turn the current text field back into a slider, but would revert it to the previous value. \u003Cbr\u003E\n- ctrl\u002Benter would set the value for that particular attribute on all parts of the same type that are in the same stage. (maybe not this one).\n\u003C/p\u003E\n"},{"CreatedByName":"pandaman","CreatedById":130621,"CreatedDateTime":"2016-10-22T16:35:08Z","Content":"\n\u003Cp\u003E\nI\u0027ll chip in with my humble support for this great idea too.\n\u003C/p\u003E\n\u003Cp\u003E\nThis would save a fair bit of twiddling sliders that won\u0027t play nicely. \n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2016-10-22T22:39:21Z","Content":"\n\u003Cp\u003E\nYes.\n\u003C/p\u003E\n"},{"CreatedByName":"Waxing_Kibbous","CreatedById":151611,"CreatedDateTime":"2016-10-23T02:58:30Z","Content":"\n\u003Cp\u003E\nBlender has a nice way of handling this, I agree that having numerical inputs would be a solid little tweak.\n\u003C/p\u003E\n"},{"CreatedByName":"SpacePilotMax","CreatedById":139367,"CreatedDateTime":"2016-10-23T15:24:50Z","Content":"\n\u003Cp\u003E\nYES YES YES\n\u003C/p\u003E\n"}]}