{"TopicId":150625,"ForumId":18,"TopicTitle":"I\u0026#039;m writing a book.","CreatedByName":"daniel l.","CreatedById":57763,"CreatedDateTime":"2016-10-22T20:32:42Z","PageNum":1,"Articles":[{"CreatedByName":"daniel l.","CreatedById":57763,"CreatedDateTime":"2016-10-22T20:32:42Z","Content":"\n\u003Cp\u003E\nHello guys. Recently I started work on a project. It has nothing to do with my existing solar colonies project. It will be a sci-fi horror novel. With a hopefully unique twist.\n\u003C/p\u003E\n"},{"CreatedByName":"NSEP","CreatedById":165635,"CreatedDateTime":"2016-10-22T21:21:41Z","Content":"\n\u003Cp\u003E\nCool! Looking forward to what you write! Already know the plot for it, or is it top secret?\n\u003C/p\u003E\n"},{"CreatedByName":"The Raging Sandwich","CreatedById":164377,"CreatedDateTime":"2016-10-22T21:28:33Z","Content":"\n\u003Cp\u003E\nNice! Followed!\n\u003C/p\u003E\n"},{"CreatedByName":"daniel l.","CreatedById":57763,"CreatedDateTime":"2016-10-22T21:44:30Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222818673\u0022 data-ipsquote-contentid=\u0022150625\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221477171301\u0022 data-ipsquote-userid=\u0022165635\u0022 data-ipsquote-username=\u0022NSEP\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n22 minutes ago, NSEP said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nCool! Looking forward to what you write! Already know the plot for it, or is it top secret?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI already know the plot. And am writing it. But once I finish the first chapter I will post it here as a preview.\n\u003C/p\u003E\n"},{"CreatedByName":"NSEP","CreatedById":165635,"CreatedDateTime":"2016-10-22T21:44:30Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222818687\u0022 data-ipsquote-contentid=\u0022150625\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221477171713\u0022 data-ipsquote-userid=\u0022164377\u0022 data-ipsquote-username=\u0022The Raging Sandwich\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n15 minutes ago, The Raging Sandwich said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNice! Followed!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nDid that too \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022:wink:\u0022\u003E!\n\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2016-10-23T16:49:30Z","Content":"\n\u003Cp\u003E\nTrying to get into writing myself. Having trouble with the whole \u0022show, don\u0027t tell\u0022 concept. My writing comes out very bland. Just big info dumps.\n\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2016-10-23T21:37:51Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222819768\u0022 data-ipsquote-contentid=\u0022150625\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221477241370\u0022 data-ipsquote-userid=\u002266349\u0022 data-ipsquote-username=\u0022Motokid600\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Motokid600 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nTrying to get into writing myself. Having trouble with the whole \u0022show, don\u0027t tell\u0022 concept. My writing comes out very bland. Just big info dumps.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nMaybe make it an interview? For example, in the book World War Z, the main character goes around after the big event and interviews people about it. It\u0027s an interesting format, and it might make it a bit easier. The interviewer could ask questions about that info, and then the info dump makes some sense for the story\u0027s progression.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222818581\u0022 data-ipsquote-contentid=\u0022150625\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221477168362\u0022 data-ipsquote-userid=\u002257763\u0022 data-ipsquote-username=\u0022daniel l.\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn ‎10‎/‎22‎/‎2016 at 3:32 PM, daniel l. said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHello guys. Recently I started work on a project. It has nothing to do with my existing solar colonies project. It will be a sci-fi horror novel. With a hopefully unique twist.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nGood luck, man. This could be very interesting.\n\u003C/p\u003E\n"},{"CreatedByName":"daniel l.","CreatedById":57763,"CreatedDateTime":"2016-10-23T22:01:12Z","Content":"\n\u003Cp\u003E\nHere is the first chapter. It\u0027s mostly introductory and is shorter than the others will be but it should sate your curiosity.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nComing of the Dark.\u003Cbr\u003E\nBy Daniel Leahey.\u003Cbr\u003E\n \u003Cbr\u003E\n1. Preparations\u003Cbr\u003E\n \u003Cbr\u003E\n//LETTER FROM JOE WILLIAMS ON DORADO COLONY//\u003Cbr\u003E\n \u003Cbr\u003E\nDear Robert. How is life on Ceres? I heard you moved there recently from Mars. How is Amy doing? Have you managed the guts to tell her how you feel or are you the same shy chicken I knew in the Academy?\u003Cbr\u003E\n \u003Cbr\u003E\nAs for me… I’m still just settling in here on Dorado, There is a lot to learn being a first time colonist. For example: Did you know that Dorado has no rotation? We didn’t find out until halfway there when our telescopes detected it. Its odd living on a world where the day lasts half an orbital period and the nights are almost as long. The days are very bright, Lit in fact by two sun’s, We didn’t see it until our ship got closer but this star has a binary companion that orbits so close to its bigger sibling that they look like one star from a distance. As bright as our dual Sun is it will eventually have to go down as on any planet that isn’t tidally locked. And we have no idea what will happen when it does go down, we were lucky enough to land on the day side of Dorado, We have no advance knowledge of what will happen when it goes completely dark. We intended to mount an expedition to the night side weeks ago but where thwarted when we discovered that what registered as land from space was in fact a sticky gelatinous sea separating the two primary continents. I’m not looking forward to this long night, As you know I was always afraid of the dark, I recalled to you once an incident when I was on a date and she turned off the lights for a movie, I became immediately uncomfortable and had to explain to her that despite all my insistence on logical thought, My subconscious mind still maintained a superstitious attitude that in the dark… Frightful things came out. I can still remember her laugh; while the rest of the date went well and we eventually married (and later divorced) I never quite got over the humiliation. Also of interest: I found some plants just a kilometer away from our base. Interestingly they glow in the dark, I don’t really know why but they do. Many of my co-workers have suggested different theories but none of them seem right to me. I feel I must inform you that this will be my last letter to you for at least nine weeks as our side of the planet will be facing away from Sol and our satellite relays are not functioning properly. I the meantime I give you full control over my property back home, The estate should automatically unlock for you once this message has successfully been verified.\u003Cbr\u003E\n \u003Cbr\u003E\nSincerely\u003Cbr\u003E\n \u003Cbr\u003E\nJoe\u003Cbr\u003E\n \u003Cbr\u003E\n//END OF MESSAGE TIMESTAMP 1/5/2210CE 4:15PM//\u003Cbr\u003E\n \u003Cbr\u003E\n \u003Cbr\u003E\n \u003Cbr\u003E\n//PERSONAL LOG: COLONIST 3RD RANK JOE WILLIAMS 1/5/2210CE-ONWARD//\u003Cbr\u003E\n---------------------\u003Cbr\u003E\nI sent a message to Robert today; I didn’t want to tell him that it could be my last. We don’t have any idea if we will survive the night at all, For the last week or se we have been stocking up on supplies from our replication systems, Because we don’t have the power to sustain all our systems on battery alone for nearly nine weeks, we will have no choice but to power down most systems such as: replicators, environmental systems, And… Lights (I would not have joined this mission if only I knew!). We’ve also been searching the local area for edible plant life. //END OF ENTRY//\u003Cbr\u003E\n \u003Cbr\u003E\n//1/6/2210CE//\n\u003C/p\u003E\n\u003Cp\u003E\nThe search teams have returned with several interesting items. We cannot even tell apart fruit and vegetable if either even exist here. Most items turned out to be poisonous except one, the scientists say that it has no known toxic elements so I volunteered to try it. When I took a bite the juices exploded out all over my face, luckily there was no acidic content in it. The fruit (that\u0027s what I\u0027ll call it.) tasted very oddly, which is expected since the biology of this planet is significantly different from our own. Afterwards I felt kind of weird, when the doctors examined me they couldn\u0027t find anything wrong but I felt wrong. The feeling eventually subsided and we all agreed not to consume this fruit unless we absolutely have to. //END OF ENTRY//\n\u003C/p\u003E\n\u003Cp\u003E\n//1/7/2210CE//\n\u003C/p\u003E\n\u003Cp\u003E\nProgress is really being made. We have very little idea what we will need other than the average provisions but we have plenty of contingencies on the drawing board. The sun is a little lower today, the shadows are longer and more noticeable. Strangely, plant growth has accelerated in the shadows, new kinds of plants are sprouting up all over the place, always in the darkest areas. None of us have ever seen anything like it.  However, despite it evidently being dim enough for them to start growing, they are still slowed by the remaining light, we know this because we brought one of them indoors and turned off the lights, it began to grow exponentially faster, it also revealed itself  to be quite predatory, as it grew it immediately was attracted to a potted plant in the corner and grew towards it, eventually wrapping itself around the stem and inserting root like appendages into the plant. The victim immediately began to wilt and died within a matter of minutes whereas the the vampiric night dweller only grew even faster, luckily it appeared to show no interest in us. However now that. I\u0027ve seen what it looks like fully grown, I\u0027m not looking forward to the forests of them that will soon be growing. //END OF ENTRY//\n\u003C/p\u003E\n\u003Cp\u003E\n//1/8/2210CE//\u003Cbr\u003E\nThe plants have grown even taller today. They seem almost intelligent, our observations show that beneath the surface their roots are interconnected meaning that they start out separate and grow into a single entity. I find them really unnerving, in fact: I am relocating to new quarters on the side of the colony furthest from those plants. Everybody is extremely tense. Especially one of the kitchen staff; Harold Vager, he started acting suspiciously and when captain Donnerson and the rest of us interrogated him, He confessed to having eaten several of the fruit, he apparently wasn\u0027t convinced of the serious risk and decided to taste test them to find how they should be best prepared. How a man of such foolishness could be allowed to join this mission I do not know, but the captain ordered him confined to quarters under guard until the effects are confirmed to have worn off. Aside from all that, I carried out a survey of the animal life, like the daylight plant life they glow in the dark, We have already determined that the vampiric plants do not have a taste for animal life and that the day plants glow to repel the night plants. Are there night animals we should be afraid of? We will soon find out, the sun is now just barely above the horizon.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"The Raging Sandwich","CreatedById":164377,"CreatedDateTime":"2016-10-23T22:08:11Z","Content":"\n\u003Cp\u003E\nLove it!\n\u003C/p\u003E\n"},{"CreatedByName":"NorthernDevo","CreatedById":161219,"CreatedDateTime":"2016-10-26T01:53:52Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222819768\u0022 data-ipsquote-contentid=\u0022150625\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221477241370\u0022 data-ipsquote-userid=\u002266349\u0022 data-ipsquote-username=\u0022Motokid600\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn ‎2016‎-‎10‎-‎23 at 0:49 PM, Motokid600 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nTrying to get into writing myself. Having trouble with the whole \u0022show, don\u0027t tell\u0022 concept. My writing comes out very bland. Just big info dumps.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSpeaking as a writer who is, if not professional, at least financially compensated for his work, if I could offer a suggestion I would offer this: You know that whole \u0022show, don\u0027t tell\u0022 thing? STOP THINKING THAT WAY!!! That\u0027s flippin\u0027 grade-8 writing theory and has NO bearing on actual good fiction!\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Tell\u0022 offers some of the most powerful, evocative and creative aspects of English fiction and to ignore good non-first-person description wipes out a vast range of this wonderful, weird language\u0027s creative ability. FORGET \u0022Show\u0022 and \u0022Tell\u0022. Forget the rules. Forget EVERYTHING high-school creative writing teaches. Writing is an ART - and while art is creative expression within a studied range of rules part of the art is knowing where to \u003Cem\u003Ebreak\u003C/em\u003E the rules. Tolkien is a classic example: Following the rules \u0022The Lord Of The Rings\u0022 is one of the worst books ever written; there are \u003Cem\u003Ebooks\u003C/em\u003E detailing how bad LOTR is...and it should be remembered that as an Oxford translator/transliterator John Ronald was probably one of the most knowledgeable scholars of the English language and historical myth of his time.  The criticism doesn\u0027t change the fact that LOTR is one of the most powerful and wonderful stories ever written. (And...just for your info, LOTR is, by high-school definition, almost entirely \u0027tell\u0027; as is the vast history and supporting works of Middle Earth.)\n\u003C/p\u003E\n\u003Cp\u003E\nForget the rules. Forget the dime-store philosophy and the advice given by high-school teachers that never wrote a bloody thing. You want to write? Do this:\n\u003C/p\u003E\n\u003Cp\u003E\nLie back. Close your eyes. \u003Cem\u003ESee\u003C/em\u003E your story. See it, love it, appreciate it. Embrace your story as its father (or mother, sorry). Bring it into the world with all its complexity, pleasure and love. Then go to your computer and write what is in your heart. DON\u0027T worry if it\u0027s good, just write! Let your heart pour out through your fingers; lose yourself in your story. THEN the real story will come out; not when you worry and wonder about the rules you learned in school.\n\u003C/p\u003E\n\u003Cp\u003E\nDo that again...and again...and again.\n\u003C/p\u003E\n\u003Cp\u003E\nDo it for at least 8000 hours; the bare \u003Cem\u003Eminimum\u003C/em\u003E a person needs to learn a new trade and don\u0027t fool yourself; if you want to express yourself as a writer that is \u003Cem\u003Eexactly\u003C/em\u003E what you\u0027re doing - learning a new trade; the trade of the novelist.\n\u003C/p\u003E\n\u003Cp\u003E\nWriting is HARD.\n\u003C/p\u003E\n\u003Cp\u003E\nLearn the rules, and learn when to break them. Write, write, write; don\u0027t care about quality. Quality isn\u0027t important.  As you write for thousands of pages and thousands of hours, your own voice, your \u003Cem\u003Eown unique style\u003C/em\u003E, will develop. The very American concept of a layman sitting down and \u0022writing the great American novel\u0022 (insert country of choice here) is a myth - all great novelists have developed their art through years of work, study, rejection, frustration, despair, hope, pleasure, doubt and practice, practice, practice.\n\u003C/p\u003E\n\u003Cp\u003E\nOne last thing: the moment it stops being fun STOP! If it ain\u0027t fun you\u0027re not being creative; period. Get up, walk away and come back when you want to. There\u0027s no timetable.\n\u003C/p\u003E\n\u003Cp\u003E\nGood luck.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-10-26T02:13:04Z\u0022 title=\u002210/26/2016 02:13  AM\u0022 data-short=\u00227 yr\u0022\u003EOctober 26, 2016\u003C/time\u003E by NorthernDevo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KAL 9000","CreatedById":140704,"CreatedDateTime":"2016-10-26T23:36:52Z","Content":"\n\u003Cp\u003E\nInteresting! Where exactly is Dorado, and is the \u0022horror\u0022 part that the plants have mind-control abilities or something?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-10-26T23:37:17Z\u0022 title=\u002210/26/2016 11:37  PM\u0022 data-short=\u00227 yr\u0022\u003EOctober 26, 2016\u003C/time\u003E by KAL 9000\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"daniel l.","CreatedById":57763,"CreatedDateTime":"2016-10-27T03:11:47Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222825214\u0022 data-ipsquote-contentid=\u0022150625\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221477525012\u0022 data-ipsquote-userid=\u0022140704\u0022 data-ipsquote-username=\u0022KAL 9000\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, KAL 9000 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nInteresting! Where exactly is Dorado, and is the \u0022horror\u0022 part that the plants have mind-control abilities or something?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe location of Dorado is something I\u0027m still considering, I may actually just have the entire star system be fictional. As for the plants... that is a possibility but I\u0027m aiming for a unique storyline.\n\u003C/p\u003E\n"},{"CreatedByName":"KAL 9000","CreatedById":140704,"CreatedDateTime":"2016-10-27T15:10:41Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222825415\u0022 data-ipsquote-contentid=\u0022150625\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221477537907\u0022 data-ipsquote-userid=\u002257763\u0022 data-ipsquote-username=\u0022daniel l.\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 hours ago, daniel l. said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe location of Dorado is something I\u0027m still considering, I may actually just have the entire star system be fictional. As for the plants... that is a possibility but I\u0027m aiming for a unique storyline.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIs it a habitable planet in a different star system?\n\u003C/p\u003E\n"},{"CreatedByName":"daniel l.","CreatedById":57763,"CreatedDateTime":"2016-10-27T19:16:27Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222826040\u0022 data-ipsquote-contentid=\u0022150625\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221477581041\u0022 data-ipsquote-userid=\u0022140704\u0022 data-ipsquote-username=\u0022KAL 9000\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, KAL 9000 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIs it a habitable planet in a different star system?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYes \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}