{"TopicId":150663,"ForumId":16,"TopicTitle":"World-Firsts contracts - any efficient way to do them?","CreatedByName":"Magzimum","CreatedById":167187,"CreatedDateTime":"2016-10-23T08:58:17Z","PageNum":1,"Articles":[{"CreatedByName":"Magzimum","CreatedById":167187,"CreatedDateTime":"2016-10-23T08:58:17Z","Content":"\n\u003Cp\u003E\nWhen 1.2 came out, I started a fresh career. Loving all the improvements thus far. But kinda struggling to appreciate the World-firsts contracts. My problem is that they keep sending me back to the same places, which is a bit of a grind. \n\u003C/p\u003E\n\u003Cp\u003E\nFirst a flyby, then orbiting-gather-science-and-return, then a docking mission... and it asks these for a planet, but also (and separately) for the moons. So, it appears that the game wants me to fly to Duna/Ike about 4-6 times before it is satisfied that I have explored it enough. You can of course just warp forward until you get a different contract, but it will keep recycling the ones you haven\u0027t completed, so at some point it keeps spamming me with docking missions around Duna and Ike, which I don\u0027t want to do because they are boring and yield very little science (I got that science when I landed on Duna).\n\u003C/p\u003E\n\u003Cp\u003E\nHow do you guys achieve these targets efficiently? I am now considering to always send multiple ships: one lander with all the science and crew, and as a bunch of dummy-ships, just so that they can dock. The lander will then do its mission, return, while the dummy ships wait patiently in orbit until the contract comes up. At least I can do that docking contract without waiting for the transfer window. These can also carry a thermometer in case someone wants to pay me for science-from-orbit. It appears a little silly to send so many ships - especially when I will get to Jool and its 5 moons. Also, it appears a little weird to send ships ahead to anticipate a contract that hasn\u0027t even come up yet. \n\u003C/p\u003E\n\u003Cp\u003E\nDid any of you already come up with a quicker way to satisfy the Kerbin World-Firsts Record-Keeping Society? \n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2016-10-23T10:16:58Z","Content":"\n\u003Cp\u003E\nAFAIK, it is supposed to not ask you to do anything more once you have landed somewhere. If you go somewhere (Duna) on your first \u0022flyby\u0022 contract mission -- then land a little probe on every moon, and on the main planet. ie. *overly* complete that first mission, so that there is nothing left to do. Then the World\u0027s First contracts should cross that one off the list and never ask you about it again.\n\u003C/p\u003E\n"},{"CreatedByName":"Magzimum","CreatedById":167187,"CreatedDateTime":"2016-10-23T10:48:21Z","Content":"\n\u003Cp\u003E\nTrue, it\u0027s a \u0022world firsts\u0022 so it does not double any missions. For example, it asked me to orbit Duna, then return. I did that, and got the cash (and the science). Now it asks me to dock on or around Duna, or to dock on or around Ike, or to orbit Ike and return. \n\u003C/p\u003E\n\u003Cp\u003E\nObviously, I could just do all these missions in one go, but I wouldn\u0027t get paid for the docking missions and the Ike visit, because they will only show up one at a time, and only after I returned from the 1st mission.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEven with the trick of sending docking probes ahead, I think that I still need multiple launch windows (one for Duna, one for Ike) to get crews to the ground because the missions don\u0027t show up sooner. I am just trying to see if people have found tricks to advance quicker. \n\u003C/p\u003E\n\u003Cp\u003E\nI also wonder if I can use two probes, dock them around Duna, then undock, fly to Ike, and dock these same ones again, completing both missions (assuming these missions appear when I need them). \n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2016-10-23T11:09:53Z","Content":"\n\u003Cp\u003E\nWell, the \u0022explore\u0022 contract system had bad bugs that really made it non-functional until 1.2. So nobody has had any more time than you to develop any tricks yet. But yeah, if you want to complete multiple \u0022explore\u0022 contracts for the same CB with just one launch, that\u0027s going to be a tricky thing. You will need to leave an extremely capable mothership in the vicinity of your CB for a long time, and slowly release probes to complete each contract as it comes up. That\u0027s a toughie!\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-10-23T11:10:44Z\u0022 title=\u002210/23/2016 11:10  AM\u0022 data-short=\u00227 yr\u0022\u003EOctober 23, 2016\u003C/time\u003E by bewing\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Magzimum","CreatedById":167187,"CreatedDateTime":"2016-11-21T20:03:09Z","Content":"\n\u003Cp\u003E\nMy feelings towards the new World-firsts contracts start to incline towards positive for the early career stages. However, I would strongly recommend that they (they being the developers) drop the \u0022\u003Cem\u003Erendezvous\u003C/em\u003E\u0022 and \u0022\u003Cem\u003Edocking two vessels in orbit of ...\u003C/em\u003E\u0022, because those just take too much time and slow things down too much. \n\u003C/p\u003E\n\u003Cp\u003E\nI just completed a Jool-5 (still proud), and therefore orbited, landed on, and returned from every moon in that system. But the contract system is not satisfied, and keeps suggesting rendezvous or docking missions on or around the Joolian moons... while my interests are now at Dres, Moho and Eeloo (in that order, don\u0027t worry Dres!). Basically, I would assume that of all contracts, the \u0022World Firsts\u0022 would be the one aiming for new horizons, while the other contracts would now exploit the fact that I can visit Jool, and ask me to haul ore around and rescue some Kerbonauts from the surface of Laythe. \n\u003C/p\u003E\n\u003Cp\u003E\nI think that two docking missions (one in orbit or Kerbin, one in orbit of the Mun) would be sufficient. \n\u003C/p\u003E\n\u003Cp\u003E\n[/rant]\n\u003C/p\u003E\n"},{"CreatedByName":"monstah","CreatedById":95210,"CreatedDateTime":"2016-11-21T20:08:12Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222859500\u0022 data-ipsquote-contentid=\u0022150663\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221479758589\u0022 data-ipsquote-userid=\u0022167187\u0022 data-ipsquote-username=\u0022Magzimum\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 minutes ago, Magzimum said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMy feelings towards the new World-firsts contracts start to incline towards positive for the early career stages. However, I would strongly recommend that they (they being the developers) drop the \u0022\u003Cem\u003Erendezvous\u003C/em\u003E\u0022 and \u0022\u003Cem\u003Edocking two vessels in orbit of ...\u003C/em\u003E\u0022, because those just take too much time and slow things down too much. \n\u003C/p\u003E\n\u003Cp\u003E\nI just completed a Jool-5 (still proud), and therefore orbited, landed on, and returned from every moon in that system. But the contract system is not satisfied, and keeps suggesting rendezvous or docking missions on or around the Joolian moons... while my interests are now at Dres, Moho and Eeloo (in that order, don\u0027t worry Dres!). Basically, I would assume that of all contracts, the \u0022World Firsts\u0022 would be the one aiming for new horizons, while the other contracts would now exploit the fact that I can visit Jool, and ask me to haul ore around and rescue some Kerbonauts from the surface of Laythe. \n\u003C/p\u003E\n\u003Cp\u003E\nI think that two docking missions (one in orbit or Kerbin, one in orbit of the Mun) would be sufficient. \n\u003C/p\u003E\n\u003Cp\u003E\n[/rant]\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAgreed. Getting somewhere new is an achievement. Doing the same thing there? Not so much.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022I\u0027m Mark Watney, and I just took the first leak on Mars.\u0022 Funny in the book. Unamusing in KSP \u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E \n\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2016-11-21T20:55:44Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222819263\u0022 data-ipsquote-contentid=\u0022150663\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221477213097\u0022 data-ipsquote-userid=\u0022167187\u0022 data-ipsquote-username=\u0022Magzimum\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 10/23/2016 at 3:58 AM, Magzimum said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHow do you guys achieve these targets efficiently?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell, these awards come up by themselves whether there\u0027s a contract for them or not.  Every time you go to a planet\u0027moon for the 1st time, or do something new there, then you get whatever award there is for that.  So my advice is to just plan your missions, do what you do, and pick up the free money that rolls in as a result.\n\u003C/p\u003E\n\u003Cp\u003E\nThere are scads of these awards.  I doubt I can name them all, but it\u0027s something like this:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nEnter \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E gives \u0022fly-by\u0022\n\u003C/li\u003E\n\u003Cli\u003E\nBe in an impact trajectory with the planet/moon and get \u0022suborbital flight\u0022\n\u003C/li\u003E\n\u003Cli\u003E\nEntering a stable, closed orbit gives \u0022orbit\u0022.\n\u003C/li\u003E\n\u003Cli\u003E\nDo an EVA and get \u0022EVA at Planet X\u0022.\n\u003C/li\u003E\n\u003Cli\u003E\nLanding will give both \u0022landing\u0022 and (if applicable) \u0022atmospheric flight.\n\u003C/li\u003E\n\u003Cli\u003E\nDoing science in at least most of these places gives rewards for that.\n\u003C/li\u003E\n\u003Cli\u003E\nGrabbing an asteroid counts as \u0022building a station\u0022 so you can get this at Kerbin, in solar orbit, and anywhere else you have asteroids.\n\u003C/li\u003E\n\u003Cli\u003E\nDocking 2 ships is somehow different from building a station and can be done everywhere.\n\u003C/li\u003E\n\u003C/ul\u003E\n"},{"CreatedByName":"Magzimum","CreatedById":167187,"CreatedDateTime":"2016-11-22T11:56:33Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222859599\u0022 data-ipsquote-contentid=\u0022150663\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221479761744\u0022 data-ipsquote-userid=\u002269507\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n15 hours ago, Geschosskopf said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWell, these awards come up by themselves whether there\u0027s a contract for them or not.  Every time you go to a planet\u0027moon for the 1st time, or do something new there, then you get whatever award there is for that.  So my advice is to just plan your missions, do what you do, and pick up the free money that rolls in as a result.\n\u003C/p\u003E\n\u003Cp\u003E\nThere are scads of these awards.  I doubt I can name them all, but it\u0027s something like this:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nEnter \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E gives \u0022fly-by\u0022\n\u003C/li\u003E\n\u003Cli\u003E\nBe in an impact trajectory with the planet/moon and get \u0022suborbital flight\u0022\n\u003C/li\u003E\n\u003Cli\u003E\nEntering a stable, closed orbit gives \u0022orbit\u0022.\n\u003C/li\u003E\n\u003Cli\u003E\nDo an EVA and get \u0022EVA at Planet X\u0022.\n\u003C/li\u003E\n\u003Cli\u003E\nLanding will give both \u0022landing\u0022 and (if applicable) \u0022atmospheric flight.\n\u003C/li\u003E\n\u003Cli\u003E\nDoing science in at least most of these places gives rewards for that.\n\u003C/li\u003E\n\u003Cli\u003E\nGrabbing an asteroid counts as \u0022building a station\u0022 so you can get this at Kerbin, in solar orbit, and anywhere else you have asteroids.\n\u003C/li\u003E\n\u003Cli\u003E\nDocking 2 ships is somehow different from building a station and can be done everywhere.\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI realize that. After said \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/152258-jool-5-with-25-kerbals/\u0022 rel=\u0022\u0022\u003EJool-5\u003C/a\u003E, which cost me nearly 3 million funds, I came back 2 million richer (i.e. I must have made around 5 million by all the world-firsts). The possible income is sufficient, perhaps even too much (I play \u0027normal\u0027 settings, already told myself to go for \u0027hard\u0027 next time). My Program ™ has enough income, so that is not the topic of this \u003Cs\u003Erant\u003C/s\u003E thread (this comment is not a criticism of your post either, btw... I agree and like the summary you gave)...\n\u003C/p\u003E\n\u003Cp\u003E\nI just think that specifically the World-Firsts-contracts that pop up in Mission Control could be improved. In the early career, the World-Firsts give me exactly the challenges that I like and that I need to advance (so, that\u0027s a compliment to the game), but now that I have explored several planets and moons it feels more like a homework exercise than an award. From a World-Firsts, I would expect the contract to come up to either explore one of the unexplored planets, or to accelerate a satellite to \u0026gt;50 km/s and blast it out of the solar system... or something that\u0027s worth being on the front page of the Kerbal Times. Doing a docking-mission around Bop, when I just did an Apollo-style landing just doesn\u0027t feel very newsworthy to me.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-11-22T11:58:36Z\u0022 title=\u002211/22/2016 11:58  AM\u0022 data-short=\u00227 yr\u0022\u003ENovember 22, 2016\u003C/time\u003E by Magzimum\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2016-11-22T11:58:41Z","Content":"\n\u003Cp\u003E\nThe \u0022dock\u0022 and \u0022rendezvous\u0022 stuff should be at Kerbin only. Other worlds should just have flyby, orbit, land, and \u0022plant a flag and return.\u0022 Except Jool on those last 2 \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Magzimum","CreatedById":167187,"CreatedDateTime":"2016-11-22T12:05:24Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222860405\u0022 data-ipsquote-contentid=\u0022150663\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221479815921\u0022 data-ipsquote-userid=\u002273725\u0022 data-ipsquote-username=\u00225thHorseman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 minutes ago, 5thHorseman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe \u0022dock\u0022 and \u0022rendezvous\u0022 stuff should be at Kerbin only. Other worlds should just have flyby, orbit, land, and \u0022plant a flag and return.\u0022 Except Jool on those last 2 \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAgreed. And the differentiation between \u0022Splashdown\u0022 and \u0022Landing\u0022 for Eve and Laythe adds something too... although I would prefer it if they would combine that into a single contract: Send 2 ships, one should land, one should splash down, both should send back science. (I was frustrated after succesfully landing a probe, that the next assignment was to visit the same place again for a splashdown).\n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2016-11-22T14:38:50Z","Content":"\n\u003Cp\u003E\nYou do know that if you don\u0027t like the contract you are offered, you can just wait until it times out and it\u0027ll randomly generate a new one that may well be more to your liking?\n\u003C/p\u003E\n"}]}