{"TopicId":150861,"ForumId":51,"TopicTitle":"Kerbodyne Space Program","CreatedByName":"The Space Dino","CreatedById":163476,"CreatedDateTime":"2016-10-26T08:26:31Z","PageNum":1,"Articles":[{"CreatedByName":"The Space Dino","CreatedById":163476,"CreatedDateTime":"2016-10-26T08:26:31Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022color:#ff8c00;\u0022\u003E\u003Cspan style=\u0022font-size:28px;\u0022\u003E\u003Cu\u003E\u003Cstrong\u003EKerbodyne Space Program\u003C/strong\u003E\u003C/u\u003E\u003C/span\u003E\u003Cspan style=\u0022font-size:26px;\u0022\u003E \u003C/span\u003E\u003C/span\u003E(Basically my first career mode in a story)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cstrong\u003EChapter 1: A Beginning\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAfter The Great Disaster, all kerbals were wiped out from the face of Kerbin except for those engineers and astronomers plus a few hundred other civilians that everyone had called crazy who built a giant bunker at the equator near the coast. They decided it was just too boring to stay on Kerbin so they decided to start a space program to explore the universe. At first, when they were building the facilities no one had any idea what they would call it, so they just warped a name of a company called Rocketdyne from Human Space Program, a game they created to pass out time in the bunker while chaos ensured above ground.\n\u003C/p\u003E\n\u003Cp\u003E\nAs soon as the facilities were completed, Wernher von Kerman immediately asked Gene Kerman to ask the few companies in their \u0022bunker city\u0022 to provide them with contracts to fund them. And soon enough, Gene found a few, and Wernher and the R\u0026amp;D guys got to work.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022fe0pkqC.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/fe0pkqC.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022QDlTGm5.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/QDlTGm5.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ay4x54N.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/ay4x54N.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022oiBH8wr.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/oiBH8wr.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nJebediah Kerman got out and took a short swim ( and some science apparently ) which made Gene a little worried. With some cash and science now, Gene bought some snacks for everyone from below while Wernher looked at what he could do with the science he got.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022oFjjfSm.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/oFjjfSm.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWernher spent all his science on the only nodes available while Gene got more contracts to do. During one of the contracts, Bob Kerman climbed out and ran around \u003Cem\u003Ein a spacesuit. \u003C/em\u003EThat made Gene worry if all his kerbonauts were mad. Wernher thought it was fine because the \u0022spacesuits\u0022 was technically just tinfoil.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022gOWyjwk.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/gOWyjwk.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-10-27T03:05:30Z\u0022 title=\u002210/27/2016 03:05  AM\u0022 data-short=\u00227 yr\u0022\u003EOctober 27, 2016\u003C/time\u003E by The Space Dino\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"The Space Dino","CreatedById":163476,"CreatedDateTime":"2016-10-27T04:00:41Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cstrong\u003EChapter 2: A Space Program\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAs the funding (and snacks) poured into the space program, Wernher was on the quest to harvest more science, which he thought was tasty even though he couldn\u0027t taste it. Wernher slapped a bunch of science modules together and called it his \u0022science masterpiece\u0022. Apparently the space center \u003Cem\u003Eitself\u003C/em\u003E \u003Cs\u003Eneeds to\u003C/s\u003E can be researched, even though they built it themselves. An astronomer from below blames this on some magical kraken thingie.\n\u003C/p\u003E\n\u003Cp\u003E\n \u003Cimg alt=\u0022Gu5qm2N.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/Gu5qm2N.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWernher continued to abuse the fact that every single building of the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E was a individual biome and continued to farm science. He was beginning to forget that this was a space program, not a science jacuzzi.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022sDPTR6y.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/sDPTR6y.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022a2d00AF.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/a2d00AF.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWernher got back to the R\u0026amp;D complex and prepared to \u0022bath\u0022 in science until Gene ran in and held a contract in Wernher\u0027s face.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022m85KgMn.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/m85KgMn.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022You want to do this Wernher? It\u0027s really exciting! The other guys are running out of snacks because of their excitement. I bet they will go crazy when the snacks run out and I don\u0027t want that to happen.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nWernher then snapped back out of his science craziness and got serious. Gene felt a little uncomfortable.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Let\u0027s do this. Time to go to space.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nWernher then researched the tech needed to build the rocket.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00229wBPNkk.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/9wBPNkk.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nHe rushed back to the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E and caught everyone munching on snacks.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022I\u0027ve accepted that contract. Drop those snacks and get to work!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nAll the snacks were thrown aside and they started to build a prototype. Wernher named it the Kerbodyne 3 (because Kerbodyne 2 nearly killed Jeb).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022fXNCuaa.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/fXNCuaa.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"The Space Dino","CreatedById":163476,"CreatedDateTime":"2016-10-31T08:31:15Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003EChapter 3:  An Orbital Attempt\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe Kerbodyne 3 was rolled out to the launch pad and was prepared for launch. Jeb reported that the systems were nominal.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022T2yYEli.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/T2yYEli.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022Jeb, we are go for launch. Are you ready?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Gene, I\u0027m always ready for everything, don\u0027t you know?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Okay then, LAUNCH!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022gcfglUo.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/gcfglUo.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe Flea kicked in and the Kerbodyne 3 lifted off the launchpad. \n\u003C/p\u003E\n\u003Cp\u003E\n\u0022All systems are nominal-\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Gene, I saw that coming.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Aww... that was a fail.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nThe Flea burnt out and the Swivel kicked in, which explosively decoupled the Flea in a great \u003Cs\u003Efirework\u003C/s\u003E bang. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022oppZ1pa.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/oppZ1pa.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022jMoeIoy.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/jMoeIoy.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nJeb flew on top of the rocket while Mission Control cautiously watched the rocket.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Preparing for second stage ignition and first stage seperation... 3,2,1, mark!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Decoupler fired and second stage activated!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022V8ADLzS.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/V8ADLzS.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022Engine cutoff! Map view shows that we are going to space!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022FmozHpX.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/FmozHpX.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022Jeb, how\u0027s the view?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022 I can see the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, some water, some islands...\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Take a picture then!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Picture? What picture?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022You know, take a picture with that camera we told you to bring.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Oh, that camera! I... kinda left it in the Astronaut Centre...\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022NOO! JEB! MY SCIENCE!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Calm down Wernher, we can always send another mission...\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Orbital insertion burn started!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022f6tSYIs.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/f6tSYIs.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022Already, Booster?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022While you guys were fussing about that camera we were preparing for the most important part of the mission. \u003Cstrong\u003EYou \u003C/strong\u003Eare the flight director, you\u0027re supposed to tell \u003Cstrong\u003Eus\u003C/strong\u003E to do stuff!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Okay... sorry...\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Telemetry says we are out of fuel, and were still suborbital!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Y583OHH.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/Y583OHH.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022Hey Jeb, you\u0027re not going to orbit today.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Oh never mind, I\u0027m enjoying the view you\u0027ll never see...\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nGene then destroyed the CapCom console with a sledgehammer that no one knew where he got it from and left the control room. Meanwhile, Wernher was already at the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E with the engineers building another rocket.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Guys... I guess we\u0027ll have to bring Jeb back without Gene then.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nThe reentry was pretty much quiet apart from the random sparks from the broken CapCom console. And they could not communicate with Jeb either, since the plasma around the capsule blocked communications anyway, plus the CapCom console was totaled. Thank god telemetry was invented, if not who knows what Jeb might do without anyone watching him...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022RYlXVKO.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/RYlXVKO.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAs Jeb reentered the atmosphere he was once again enjoying the view. What a coincidence that he had landed in the middle of a sunset. The capsule splashed down into the ocean with the water still sizzling around it as it was still hot from the reentry heating. Jeb pulled out the snacks he secretly stashed in his spacesuit. For some reason the people at the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E would not let him bring any because they were concerned about the affects of zero gravity on snacks. ( Apparently the kerbals were only concerned about the edibility and taste of the snacks, not the crumbs that the usually crispy snacks would produce.)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00225FW4Ca8.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/5FW4Ca8.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022i2Fnkam.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/i2Fnkam.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWhen Jeb got back to the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, he was given a ton of shiny plaques and medals and trophies for being the first kerbal in space. But by then, Wernher and his magical engineering team had built the Kerbodyne 4, fitted with new thermometers and radial decouplers. Jeb was \u003Cem\u003Eliterally \u003C/em\u003Ethrown into the capsule and was rolled out to the launchpad. With a sudden BOOM, Jeb was once again flung into the sky. Finally he was caught by surprise. For once.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-11-02T08:13:22Z\u0022 title=\u002211/02/2016 08:13  AM\u0022 data-short=\u00227 yr\u0022\u003ENovember 2, 2016\u003C/time\u003E by The Space Dino\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"The Space Dino","CreatedById":163476,"CreatedDateTime":"2016-11-03T08:29:14Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003EChapter 4: Achieving Goals\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAs Jeb continued to fly upwards, the kerbals at Mission Control had totally forgotten about celebrating and snacks. They would have kept doing missions without having snacks until it was completed...\n\u003C/p\u003E\n\u003Cp\u003E\nThe Hammer SRBs cut out and the Swivel kicked in, propelling the rocket out of the atmosphere. Jeb was still confused what was going on. No one was saying anything on the comms and he had just been thrown in like that. He decided it was a awesome dream and just enjoyed the ride. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022qGL0BIF.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/qGL0BIF.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe Swivel stage was decoupled and the LV-909 kicked in. With its Isp of 345, Wernher was sure this would bring Jeb to orbit, just that if it had enough fuel to work with, that is.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022CK2D8jP.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/CK2D8jP.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nEveryone was holding their breath as the orbital lines got longer and they were getting closer to a full circle, which was what they hoped for. Jeb was actually \u003Cem\u003Esleeping \u003C/em\u003Eat this point because his \u0022awesome\u0022 dream was getting kinda boring apparently. \n\u003C/p\u003E\n\u003Cp\u003E\nAnd then his ears nearly blew up. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022fOnibe8.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/fOnibe8.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nEveryone at the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E was shouting in happiness except Gene, who no one knew went where. Jeb was still confused when Wernher shouted over the speaker:\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022JEB! GET OUT IN YOUR SPACESUIT AND GRAB THAT SCIENCE!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Grab?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022GET \u003Cabbr title=\u0022Ascending Node\u0022\u003EAN\u003C/abbr\u003E EVA REPORT!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Huh?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022JUST GET OUT AND DO A REPORT ON WHAT YOU SEE!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Oh....\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nJeb got out in his \u003Cs\u003Etinfoil\u003C/s\u003E spacesuit and just held onto the spacecraft. Technically all he could see was the hatch of the capsule but Wernher said that the science was collected and he could get back in. Weird. Just weird. It was also kind of relieving for Jeb because that spacesuit only had a bunch of ice in it as coolant.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022njfIdJT.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/njfIdJT.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter a lot of EVA science and one orbit, Mission Control activated the LV-909 for a few seconds to lower the apoapsis for reentry. Of course they did it because they didn\u0027t trust Jeb. Closer to the atmosphere the LV-909 stage was decoupled and Jeb was told to hang on. Jeb didn\u0027t know what \u0022hang on\u0022 meant though, so he just held onto a \u003Cem\u003Ebutton \u003C/em\u003E( for no reason, who knows what he was thinking ).\n\u003C/p\u003E\n\u003Cp\u003E\nAs he reentered the atmosphere it got a little stuffy. Then it got really stuffy. Then it was like an oven. Jeb thought he saw some smoke. There was just a fiery blaze outside his spacecraft. Then it started to shudder. He finally realised what \u0022hang on\u0022 meant.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022p7npzS6.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/p7npzS6.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe unheated decent was just fine, the parachutes never failed ( so far ).There was sweat up to his ankles already. When it splashed down into the water Jeb immediately popped the hatch and jumped into the water.\n\u003C/p\u003E\n\u003Cp\u003E\nBad idea.\n\u003C/p\u003E\n\u003Cp\u003E\nThe water was bubbling from the reentry heat. He jumped back into the capsule and the beacon fell out.\n\u003C/p\u003E\n\u003Cp\u003E\nEven worse idea.\n\u003C/p\u003E\n\u003Cp\u003E\nJeb was stuck in the middle of the sea for a day until he was finally picked up by the recovery teams.He didn\u0027t receive any medals or plaques or anything when he got back to the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nMaybe they had gotten bored waiting for him.\n\u003C/p\u003E\n"},{"CreatedByName":"The Space Dino","CreatedById":163476,"CreatedDateTime":"2016-11-08T08:02:15Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003EChapter 5: Taking A Further Leap\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nA contract was accepted to fly by the Mun after Jeb\u0027s mission, but they did not have the technology to reach the Mun, nor did they have enough science to get them. Another orbital mission to get moar science from high above Kerbin was put into action and Wernher and his magical engineering team got to work. It was called the the Korbiteer 1, even though it was technically the \u003Cem\u003Esecond\u003C/em\u003E spacecraft to go to orbit. They \u003Cs\u003Esticked with duct tape\u003C/s\u003E attached two \u0027Thumper\u0027 \u003Cs\u003Efireworks\u003C/s\u003E SRBs to the Kerbodyne 4 and added one more fuel tank to the core stage. Once again, Jeb was squeezed into the pod and shot into space. The launch pad was also upgraded so that they could launch bigger rockets in the future. They also had a lot of money anyway.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022HsB4r0A.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/HsB4r0A.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter a while, the rocket had already broken the sound barrier below 10km, which was way too much \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E. Wernher jotted that down in his brain, since his brain was technically better than a notebook, at least he thought so.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022zLqZoR6.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/zLqZoR6.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe SRBs were jettisoned perfectly without any explosions, thankfully.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022NIiOMI5.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/NIiOMI5.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe orbital insertion burn was also perfect and there was also no fear of running out of fuel. Wernher\u0027s magical team had apparently mastered going to orbit in two missions. They were magical, after all.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222ytbNxJ.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/2ytbNxJ.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOnboard cameras were also added to make the space program less magical, since some people were thinking that the space program was just a video game and what they did was all fake.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222x6TckD.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/2x6TckD.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNevertheless, orbit was achieved successfully and after letting Jeb enjoy the view the spacecraft was boosted into a higher orbit for the science.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022JQhKMcR.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/JQhKMcR.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWhile grabbing all that science at the apoapsis a nice view of Kerbin and the Mun appeared. Of course Jeb stopped the science and kept looking out the window.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022kAMcgCO.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/kAMcgCO.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe periapsis was lowered to 35km and Jeb wasn\u0027t even hearing what Mission Control told him, because he was too busy enjoying the view. \n\u003C/p\u003E\n\u003Cp\u003E\nNear the atmosphere the LV-909 stage was ditched and the capsule started heating up. Really fast.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022uYzTr6Z.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/uYzTr6Z.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe reentry this time took a while because the capsule was coming back down from a high orbit and had a higher velocity. Jeb did not know that, since he was enjoying the view while Mission Control was telling him the Do\u0027s and Dont\u0027s. He got a little unpatient and turned the capsule sideways to increase drag to the capsule to slow down.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Wait Jeb don-\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:72px;\u0022\u003EBOOM!\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nUh-oh.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022fK7WWoD.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/fK7WWoD.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nGene, who had just finally appeared out of nowhere, came into Mission Control and slammed the big blue \u0022Reset Universe\u0022 button.\n\u003C/p\u003E\n\u003Cp\u003E\nThe whole mission was done again. Jeb did not seem to recognise that he had maybe done this mission before. He was just enjoying the view.\n\u003C/p\u003E\n\u003Cp\u003E\nGene planned to seal off the windows on any spacecraft with Jeb in it.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-11-14T08:13:27Z\u0022 title=\u002211/14/2016 08:13  AM\u0022 data-short=\u00227 yr\u0022\u003ENovember 14, 2016\u003C/time\u003E by The Space Dino\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TheEpicSquared","CreatedById":158667,"CreatedDateTime":"2016-11-09T19:53:08Z","Content":"\n\u003Cp\u003E\nNice story\n\u003C/p\u003E\n"},{"CreatedByName":"Lokachop","CreatedById":171474,"CreatedDateTime":"2016-11-14T13:51:43Z","Content":"\n\u003Cp\u003E\nbest story ever\n\u003C/p\u003E\n"},{"CreatedByName":"The Space Dino","CreatedById":163476,"CreatedDateTime":"2016-11-14T14:02:46Z","Content":"\n\u003Cp\u003E\nThanks for the support guys! I will have a new chapter coming right up tomorrow. Stay tuned!\n\u003C/p\u003E\n"},{"CreatedByName":"The Space Dino","CreatedById":163476,"CreatedDateTime":"2016-11-15T01:50:39Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003EChapter 6: Target Practice\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nGene wanted to take a break from all that spacecraft launching and grabbed a contract to test a jet engine in flight. Wernher and his magical team slapped a plane together quickly and rolled it out to the runway, or dirt strip, maybe.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022qTKxm7b.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/qTKxm7b.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nTurns out building a plane and taking off from a dirt strip was harder than they thought. The first few times the plane did not want to get off the ground. When it finally got into the air they \u003Cem\u003Erejoiced\u003C/em\u003E. Then when Jeb tried to pitch up it flipped. Good thing parachutes were on that thing.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022OrJSwaC.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/OrJSwaC.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nTurns out flying is much harder then going to space.\n\u003C/p\u003E\n\u003Cp\u003E\nScrew that contract.\n\u003C/p\u003E\n\u003Cp\u003E\nNo one gave any plane contracts after that.\n\u003C/p\u003E\n\u003Cp\u003E\nA contract for a Mun flyby was accepted and Wernher\u0027s team were delighted that they did not have to build planes again. The new rocket was named the Munshot I and was rolled out to the launchpad with Jeb in it again. No windows this time. Only blue tape to make it look like they had one.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022rF27m9S.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/rF27m9S.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe launch was textbook. The transfer to the Mun went well too. The trajectory was good and they got an encounter. Science was picked up from the Mun. After a short burn the trajectory back would hit the atmosphere. The LV-909 stage was jettisoned before hitting the atmosphere. Jeb was still babbling about not having any windows. Of course Gene muted him.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022DF0eGxv.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/DF0eGxv.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe spacecraft was reentering at a higher velocity so the heat built up. And fast. The heat shield was holding but the Goo canister experiments were burning up. Gene spinned the spacecraft to shed off some heat but they were also deviating from their path slightly. Jeb stopped the spin and fixed the trajectory. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022itb6PQT.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/itb6PQT.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBad idea.\n\u003C/p\u003E\n\u003Cp\u003E\nSomething went BOOM outside the spacecraft. It did not sound good. There was also a bunch of smoke and debris.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022GrqO8Kp.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/GrqO8Kp.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThey had been going so fast that the atmosphere could not bring them back down to Kerbin. A damage check from the magical third-person camera confirmed that the goo was gone.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022NOOOO! JEB! NOT MY SCIENCE \u003Cem\u003EAGAIN\u003C/em\u003E!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nThat was when Wernher became obsessed with the service bay.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Kyu0VzW.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/Kyu0VzW.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nJeb went around Kerbin again and reentered the atmosphere again and finally got back into the atmosphere. Good thing they had extra batteries on that thing.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Nj7GGQd.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/Nj7GGQd.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nJeb decided he wanted to have some fun after that boring flight and turned the spacecraft around. Gene did not say anything. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022cY61UwD.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/cY61UwD.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nJeb splashed down and did not jump out of the spacecraft this time. He activated the beacon and the recovery teams picked him up in an hour. When he got back to the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E Gene was already working on another mission: To land on the Mun.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-11-17T08:13:09Z\u0022 title=\u002211/17/2016 08:13  AM\u0022 data-short=\u00227 yr\u0022\u003ENovember 17, 2016\u003C/time\u003E by The Space Dino\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"The Space Dino","CreatedById":163476,"CreatedDateTime":"2016-11-17T08:12:43Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003EChapter 7: Broken Cameras\u003C/strong\u003E\u003C/p\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\nThere were two tourists who wanted to go to space so badly that they said they would shut down the space program if they could not go to space. Gene had to reluctantly accept so Wernher and his magical team got to work. They stuck a bunch of parts together and called it the Take-Your-Tourist-Everywhere.\u003C/p\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\nWho has time to name a rocket if they’re frustrated? \u003C/p\u003E\n\u003Cp\u003E\u003C/p\u003EJeb was again put into the capsule because tourists can’t control anything. \u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe rocket was rolled out to the launch pad and well, got launched.\u003C/p\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00220U2LwuE.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/0U2LwuE.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe SRBs were ignited and it was pretty obvious that Wernher had overdid the \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E on the boosters. \u003C/p\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\nNo one cared.\u003C/p\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222YXXINR.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/2YXXINR.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nDuring the launch the tourists were actually \u003Ci\u003Escared\u003C/i\u003E. Why would they even go on this trip if they were scared? \u003C/p\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe ascent went well and they were in orbit quickly.\u003C/p\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022wmNbZkQ.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/wmNbZkQ.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter a couple orbit the tourists were satisfied and the spacecraft deorbited and reentered back into the atmosphere.\u003C/p\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022eaDzozI.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/eaDzozI.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe descent went well too and while they were a few meters above the ground Jeb got out of the spacecraft for science.\u003C/p\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\nFor once.\u003C/p\u003E\n\u003Cp\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022VlUfxVG.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/VlUfxVG.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:28px;\u0022\u003E“JEB!!! WHAT IN THE WORLD ARE YOU DOING?!!!”\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n“Gene, it’s just for sci-“\n\u003C/p\u003E\n\u003Cp\u003E\n*capsule’s comms and Gene’s mike break*\n\u003C/p\u003E\n\u003Cp\u003E\nJeb got back in just as they landed and he activated the beacon. The recovery teams came quickly and picked them up.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen they got back Wernher and his magical team had already built the rocket to land on the Mun, the Munshot II. There was also a contract to plant a flag on the Mun for extra cash.\n\u003C/p\u003E\n\u003Cp\u003E\nValentina was put into the capsule and was blasted off into space. The ascent went well, so did the Mun transfer, even though it was the first time they were doing it. The Mun capture went well too and Val was soon the first Kerbal in Mun orbit. The spacecraft then went on a landing trajectory.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022We are around fifty meters up, descending at 3 m/s.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Mission Control, this is the Munshot II and we have kicked up dust!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n*mission control celebrates like crazy*\n\u003C/p\u003E\n\u003Cp\u003E\nVal got out of the spacecraft and did some science, walked around and did some science, then planted the classical flag.\n\u003C/p\u003E\n\u003Cp\u003E\nAfter the glorious moments Val blasted off from the Mun to head back to Kerbin.\n\u003C/p\u003E\n\u003Cp\u003E\nSuddenly they realised that they had not been paying attention to the fuel gauge.\n\u003C/p\u003E\n\u003Cp\u003E\nGene hit the reset button.\n\u003C/p\u003E\n\u003Cp\u003E\nThe mission was done again and again and again and again and again and again with different variants of the spacecraft. Even Val was getting \u003Cem\u003Ebored\u003C/em\u003E of going to the Mun again and again and again and again and again and again.\n\u003C/p\u003E\n\u003Cp\u003E\nThen something happened.\n\u003C/p\u003E\n\u003Cp\u003E\nOn the last trip to the Mun Gene did not want to reset again so he decided Munshot II would be a orbital mission only. When Val tried to do an EVA report the universe glitched out and she was sent flying away from the spacecraft.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EReally\u003C/strong\u003E fast.\n\u003C/p\u003E\n\u003Cp\u003E\nGene directed Val to thrust herself into orbit at apoapsis since she was apparently on a sub-orbital trajectory. Thankfully she was going \u003Cem\u003Eaway\u003C/em\u003E from the Mun, not \u003Cem\u003Etowards\u003C/em\u003E. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00229pc5W5C.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/9pc5W5C.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u0022Gene, what am I going to do now?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Well, since in space you don\u0027t need anything to live apart from wearing a spacesuit you\u0027ll stay in orbit until we pick you up later.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Okay then...\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022kBUH1IZ.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/kBUH1IZ.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nEveryone at the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E then took a month\u0027s break after that.\n\u003C/p\u003E\n\u003Cp\u003E\nTalk about emptiness.\n\u003C/p\u003E\n"},{"CreatedByName":"The Space Dino","CreatedById":163476,"CreatedDateTime":"2017-01-25T08:18:48Z","Content":"\n\u003Cp\u003E\nNo,no, I \u003Cem\u003Eam \u003C/em\u003Ebringing this back to life. ( After 2 months\u0027 break \u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EChapter 8: That Big Grey Rock\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAfter the break ( while Valentina was still stuck around the Mun ) there came a contract to put a satellite in a specific orbit of the Mun. As the Munshot II wasn\u0027t coming back any time soon with the science, well why not just go pick it up. A probe was smacked together, named the Mun Contractor ( no time for fancy names ) and was sent on its way.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022iJW6oiX.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/iJW6oiX.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnother textbook launch and the probe was soon in orbit. As they cut the engine they checked the fuel and saw this:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022pDa2lPy.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/pDa2lPy.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nExactly 0.01 units of fuel and oxidiser left. Precision controlling,eh?\n\u003C/p\u003E\n\u003Cp\u003E\nOnce again, another trans-munar injection although the encounter was way off from the intended orbit. Good thing the LV-909 is overpowered.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022nwfoTc9.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/nwfoTc9.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter some tinkering around it was fixed and they just waited for it to get to the Mun. The capture was done with the controllers at Mission Control eating snacks. Gene did not say anything. Weird...\n\u003C/p\u003E\n\u003Cp\u003E\nApparently the mission was harder than they thought. Mission Control fiddled around with the probe for a few hours and they got it close, but not close enough. Weird...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ip8BP4F.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/ip8BP4F.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter more fiddling around the contractors gave them the funds and they were done ( FINALLY ). No way any of the kerbals at the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E were gonna do that kind of contract again. They played around with it later and the probe was left in an eccentric orbit with some fuel left for later use.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022bpYWAOG.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/bpYWAOG.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nMeanwhile Jeb did some more of those \u0022test this part\u0022 contracts and had more fun. Wernher just threw him the \u0022manual\u0022 and told Jeb to fly it himself. No insurance provided to him too. Guess they \u003Cem\u003Ereally \u003C/em\u003Ewanted to get rid of him after the previous flights.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022kR84y1D.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/kR84y1D.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cs\u003E-END-\u003C/s\u003E  \u003Cspan style=\u0022font-family:\u0027Comic Sans MS\u0027, cursive;\u0022\u003E( no no no this is not going to be the end of this. Below are parts added by Gene Kerman. Dont tell anyone the space program wanted to cover this up )\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:\u0027Comic Sans MS\u0027, cursive;\u0022\u003ESo right after Wernher did all his fancy R\u0026amp;D stuff those stupid tourists came back again. HOW I HATE THOSE KERBALS SO MUCH!!!!!!!!!\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:\u0027Comic Sans MS\u0027, cursive;\u0022\u003EOkay, back to the point. So Wernher reluctantly built a Take-Your-Tourist-Anywhere-Remote-Control for them, and also to test out the new probe tech. And most importantly without that Jeb guy.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022wlDRAmA.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/wlDRAmA.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n  \u003Cspan style=\u0022font-family:\u0027Comic Sans MS\u0027, cursive;\u0022\u003EAnd it also turned out that we Jeb left some junk in the ocean. Why do we even need to clean up after him?\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00228YU9VII.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/8YU9VII.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:\u0027Comic Sans MS\u0027, cursive;\u0022\u003EThey were kept in orbit for a while until they started to mess with the telemetry. We did turn off comms. We aimed for them to land near the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E and hopefully in some mud too as to the west the mountains dump tons of water on the soil below them. Dont wanna know how their reentry felt but they came down on the other side of the mountain from the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E. Then we saw the mountain closing in and we quickly deployed the parachute but forgot to look at the speedometer.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nKABOOM BOOM BBOM BBOOOM!!!!!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022SkTUooJ.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/SkTUooJ.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:\u0027Comic Sans MS\u0027, cursive;\u0022\u003ETAKE THAT YOU STUPID TOURISTS!!!! \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-family:\u0027Comic Sans MS\u0027, cursive;\u0022\u003EAnd it also turned out that the Reset button was not functioning too.(YEAH) We lost some funds and rep but we have loads of them anyway.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cfont face=\u0022Comic Sans MS, cursive\u0022\u003EIf the other Kerbals out of the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E finds out about this the Space Program is ded. Thats why i told u not to tell anyone. No one picked up their shattered remains from the mountain. And from the telemetry i found this photo of one of the tourists which i warped:\u003C/font\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00229nPJJku.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/9nPJJku.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n"}]}