{"TopicId":150904,"ForumId":25,"TopicTitle":"The PBS Colonization Challenge","CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2016-10-26T19:15:39Z","PageNum":1,"Articles":[{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2016-10-26T19:15:39Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003EThe PBS Colonization Challenge\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n It\u0027s time for Kerbalkind to colonize the solar system!  Using the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/133606-12-kerbal-planetary-base-systems-v132-24th-october-16/\u0022 rel=\u0022\u0022\u003EPlanetary Base Systems\u003C/a\u003E (PBS) mod in conjunction with \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/146465-12-tac-life-support-v0125-release-14th-oct-2016/\u0022 rel=\u0022\u0022\u003ETAC Life Support\u003C/a\u003E, this has become a very real prospect.  Mission Control has taken a contract of absurd proportions for this without your consent (what else is new?), but fortunately it\u0027s pretty flexible.  As long as you fulfill at least part of the contract, they\u0027ll be happy.  Of course, if you can fulfill the whole thing (or go above and beyond), they\u0027ll be even happier.\n\u003C/p\u003E\n\u003Cp\u003E\n (How did they get a contract in a Sandbox file, you ask?  It\u0027s better you not know the answer to that one...)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EThe Contract\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n Mission Control\u0027s really done it this time...  The contract for this mission is just plain absurd.  Rockomax has requested that you colonize every single celestial body in the solar system (except Jool and the sun, for obvious reasons).  This means at least 6 Kerbals per planet or moon, able to sustain themselves without outside resources being delivered to them.  They\u0027d really like it if you could somehow get 300 Kerbals per celestial body, which sounds like a huge chore...\n\u003C/p\u003E\n\u003Cp\u003E\n The contract further stipulates that they should be able to traverse the planet or moon if possible via rover.  They also want full communications at all times with Kerbin via the Deep Space Network.  And every colony is tasked with being able to produce fuel for any visiting spacecraft to boot.  They\u0027re even demanding a full complement of scientific experiments, and a processing lab.  As if that wasn\u0027t enough, the contract ALSO stipulates that there needs to be an (unoccupied) orbital station for each planet/moon, and a means for the Kerbals living on the surface to return to Kerbin.  Apparently there\u0027s something in there about an orbital zero-G sports arena too, but that bit is pretty vague...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EFulfilling the Contract\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n We know this contract is absurd, so we\u0027ve broken the whole thing down into a more manageable system.  The priorities for the contract have been weighted, adjusted, and just generally shifted about so they actually make sense to anyone not versed in Kerbal legalese.  We\u0027ve called the resulting values Priority Offering Integration Numeric Tabulations, or POINTs.\n\u003C/p\u003E\n\u003Cp\u003E\n Here\u0027s how it works out:\n\u003C/p\u003E\n\u003Cp\u003E\n* Each colony MUST contain a minimum of 6 Kerbals\u003Cbr\u003E\n* Each colony MUST have enough self-sustaining life support for all inhabitants\u003Cbr\u003E\n* Meeting these two requirements is worth \u003Cstrong\u003E10 POINTs\u003C/strong\u003E\u003Cbr\u003E\n* Each additional colonist (fully supported, remember!) is worth \u003Cstrong\u003E1 POINT\u003C/strong\u003E; our cutoff is 30 total, meaning a maximum of \u003Cstrong\u003E24 POINTs\u003C/strong\u003E extra\u003Cbr\u003E\n* Including a rover (or rovers) is worth \u003Cstrong\u003E2 POINTs\u003C/strong\u003E; it/they MUST be able to carry at least half of your colonists at any given time\u003Cbr\u003E\n* You can get an extra \u003Cstrong\u003E1 POINT\u003C/strong\u003E if your rover(s) can carry all of your colonists at any given time\u003Cbr\u003E\n* Having a shielded storage area for the rover(s) is worth \u003Cstrong\u003E1 POINT\u003C/strong\u003E, but only if all rovers can be stored at any given time!\u003Cbr\u003E\n* Having a DSN connection back to Kerbin at all times is worth \u003Cstrong\u003E2 POINTs\u003C/strong\u003E\u003Cbr\u003E\n* Having a fully-decked-out science array (just the stock experiments) with lab is worth \u003Cstrong\u003E1 POINT\u003C/strong\u003E\u003Cbr\u003E\n* Having a mining system that produces fuel for spaceships (you have to have some way to actually get the fuel to them, remember!) is worth \u003Cstrong\u003E2 POINTs\u003C/strong\u003E\u003Cbr\u003E\n* Having an orbital station able to hold as many Kerbals as the colony is populated with is worth \u003Cstrong\u003E6 POINTs\u003C/strong\u003E\u003Cbr\u003E\n* We have no idea how the zero-G sports thing would work, honestly, but it\u0027s worth \u003Cstrong\u003E1 POINT\u003C/strong\u003E anyway; we\u0027ll leave it to your discretion...\u003Cbr\u003E\n* Having a means to return to Kerbin is worth a variable amount of POINTs, based on the body in question; see below\n\u003C/p\u003E\n\u003Cp\u003E\n This means that a fully decked-out colony with full orbital support is worth \u003Cstrong\u003E50 POINTs\u003C/strong\u003E.  But that\u0027s just the base score, of course; not all bodies are created equal after all!  There are multipliers involved based on which bodies you choose.  POINTs are worth:\n\u003C/p\u003E\n\u003Cp\u003E\nMun: 1x (return bonus: 2 POINTs)\u003Cbr\u003E\nMinmus: 1x (return bonus: 2 POINTs)\u003Cbr\u003E\nDuna: 2x (return bonus: 8 POINTs)\u003Cbr\u003E\nIke: 2.5x (return bonus: 7 POINTs)\u003Cbr\u003E\nEve: 3x (return bonus: 100 POINTs)\u003Cbr\u003E\nGilly: 3.5x (return bonus: 10 POINTs)\u003Cbr\u003E\nDres: 3.5x (return bonus: 12 POINTs)\u003Cbr\u003E\nMoho: 5x (return bonus: 30 POINTs)\u003Cbr\u003E\nLaythe: 5x (return bonus: 40 POINTs)\u003Cbr\u003E\nTylo: 5x (return bonus: 50 POINTs)\u003Cbr\u003E\nVall: 4x (return bonus: 25 POINTs)\u003Cbr\u003E\nBop: 4x (return bonus: 20 POINTs)\u003Cbr\u003E\nPol: 4x (return bonus: 20 POINTs)\u003Cbr\u003E\nEeloo: 5x (return bonus: 30 POINTs)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\u003Cem\u003EColony Extensions\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n The contract has an additional clause concerning multiple colonies!  Once you\u0027ve filled an entire colony on a planet or moon (ie. you have 30 Kerbals living there), you can add another site.  And once that site\u0027s full up, you can add another!  For sanity\u0027s sake, the population is capped at 10 colonies per planet or moon.  That\u0027s a lot of Kerbals, after all!\n\u003C/p\u003E\n\u003Cp\u003E\n Sites at least 5KM apart from one another can be designated as separate colonies, scoring an additional \u003Cstrong\u003E10 POINTs\u003C/strong\u003E for the first 6 colonists at that new site (and of course, \u003Cstrong\u003E1 POINT\u003C/strong\u003E per additional Kerbal up to 30 total colonists and \u003Cstrong\u003E24 POINTs\u003C/strong\u003E extra).  However, separate sites like this MUST have rovers that can reach one another, present at all sites!  You can\u0027t get any additional POINTs for DSN connection or rover storage or anything from this, either; anything your colonies as a whole have for a planet or moon for those sorts of things, that\u0027s it for those bonuses.\n\u003C/p\u003E\n\u003Cp\u003E\n You do NOT need to provide additional space on the orbital station for the extra colony\u0027s Kerbals, but (assuming you want the return bonus) you DO need to provide sufficient facilities to allow for all Kerbals present to return to Kerbin in one grand exodus if the need arises.  In other words, you need to be able to get all resident Kerbals off the surface of the planet or moon they\u0027re on within a reasonable timeframe and get them all back to Kerbin within a very close timeframe to one another.  No Kerbal left behind, in short!  The upshot is, you get the return bonus amount for each colony built when the requirements are met.  Now that\u0027s generosity!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\u003Cem\u003ELimitations and Bonuses\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n Time is of the essence in this contract, or at least that\u0027s what they keep telling us.  Rockomax has set a hard time limit of 25 years to get all of your colonies in place.  Any longer than that and they\u0027re not interested.  What a bunch of skinflints!\n\u003C/p\u003E\n\u003Cp\u003E\n (That\u0027s 25 years from the first launch to any given body for that body, mind.  They\u0027re not crazy, just strict.)\n\u003C/p\u003E\n\u003Cp\u003E\n For some reason Rockomax really wants that zero-G sports thing to happen.  They said something about \u0022bonus POINTs for really creative entries\u0022.  We asked them how they knew about POINTs, but they didn\u0027t have an answer for us.  There may be a covert Rockomax agent in Mission Control...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\u003Cem\u003EProof of Delivery\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n To get credit for all of your hard work, you need to show:\n\u003C/p\u003E\n\u003Cp\u003E\n* At least 1 shot of the launch process; you don\u0027t have to show every single one!\u003Cbr\u003E\n* At least 1 shot of the completed colony, showcasing all features\u003Cbr\u003E\n* At least 1 shot per orbital feature included (station, relay, etc.)\u003Cbr\u003E\n* A map shot showing the DSN connection, if you\u0027re going for that bonus; we\u0027ll let you skip this requirement for the Mun since it\u0027s Kerbin-synchronous\u003Cbr\u003E\n* A map shot showing the distance between colonies for multiple sites\n\u003C/p\u003E\n\u003Cp\u003E\n You can expand locations at a later date, and enhance what they offer as you see fit.  For sanity\u0027s sake, it\u0027s recommended that you have separate save files for each planet or moon colonization effort.  Otherwise, you\u0027re going to have some serious slowdown issues by your fifth or sixth colonization effort...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\u003Cem\u003EMods\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n You can\u0027t really participate in this challenge without the mods required to do it.  Those mods are:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/133606-12-kerbal-planetary-base-systems-v132-24th-october-16/\u0022 rel=\u0022\u0022\u003EPlanetary Base Systems\u003C/a\u003E (obviously, right?)\u003Cbr\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/146465-12-tac-life-support-v0125-release-14th-oct-2016/\u0022 rel=\u0022\u0022\u003ETAC Life Support\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n Some recommended mods include:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/142594-12-kerbal-attachment-system-kas-v060/\u0022 rel=\u0022\u0022\u003EKerbal Attachment System\u003C/a\u003E\u003Cbr\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/101928-112-kerbal-inventory-system-kis-1212/\u0022 rel=\u0022\u0022\u003EKerbal Inventory System\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n As for other mods, go for it!  The only stipulation I have is that you not use any \u0022cheat-y\u0022 mods (ie. with parts or functionality that either let you bypass the game\u0027s challenges entirely or are just plain overpowered).  MechJeb, Kerbal Engineer Redux, Kerbal Alarm Clock, and other \u0022assistance\u0022 mods are allowed, BUT you have to specify that you\u0027ve used them so I can list them alongside your score.  I don\u0027t have any beef against those sorts of things (I use \u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKER\u003C/abbr\u003E and \u003Cabbr title=\u0022Kerbal Alarm Clock (mod)\u0022\u003EKAC\u003C/abbr\u003E both!), particularly for something this massive in scope.  However, there is a certain point of pride for some players in doing something like this entirely on their own.  For their sake, let\u0027s all be honest about what tools we\u0027re using.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\u003Cem\u003ESome Useful Information\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n This can be a pretty daunting challenge for newcomers, so here are a number of handy tips to help your efforts along.\n\u003C/p\u003E\n\u003Cp\u003E\n* Each greenhouse module produces enough food for 6 Kerbals, and needs 1 algae farm, access to ore via a rock drill, and access to water via a water drill to function (plus standard life support resources)\n\u003C/p\u003E\n\u003Cp\u003E\n* You should probably also add a carbon extractor and water purifier, as well as space to store life support and life support byproducts (and ore too!)\n\u003C/p\u003E\n\u003Cp\u003E\n* Powering the lot of this is going to take around 15 electric charge per second at all times; prepare accordingly\n\u003C/p\u003E\n\u003Cp\u003E\n* You have to activate greenhouses and the like for them to do anything, and you need Kerbals manning greenhouses in particular to get anything out of them\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\u003Cstrong\u003EColonization Hall of Fame\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n Here you can see who\u0027s who in the PBS challenge!  Every colony\u0027s value, as well as the grand total value of all colonies founded, can be found here.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EEidahlil\u003C/strong\u003E - 225 POINTs (using \u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKER\u003C/abbr\u003E and MechJeb)\u003Cbr\u003E\n Vall Colony - 225 POINTs\n\u003C/p\u003E\n\u003Cp\u003E\nSky Render - 43 POINTs (using \u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKER\u003C/abbr\u003E and \u003Cabbr title=\u0022Kerbal Alarm Clock (mod)\u0022\u003EKAC\u003C/abbr\u003E)\u003Cbr\u003E\n Mun Colony \u0022Shelby\u0022 - 43 POINTs\n\u003C/p\u003E\n\u003Cp\u003E\n And here\u0027s my own first contribution!  Basically, this is just a sample of how the whole thing generally works.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022pbs_mun1.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://www.skyrender.net/lp2/ksp/pbs_mun1.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n Here\u0027s the core of the first colony sent up, straight to the Mun!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022pbs_mun2.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://www.skyrender.net/lp2/ksp/pbs_mun2.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n The nice thing about the Mun is, if you land in just the right spot (ie. anywhere on literally half the Mun), you always have connectivity to Kerbin via the DSN.  Ergo, easy 2 POINTs right there!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022pbs_mun3.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://www.skyrender.net/lp2/ksp/pbs_mun3.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n The launch stage is ditched just before landing, so it blows up in a pleasing manner and lets me soft-land this colony base.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022pbs_mun4.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://www.skyrender.net/lp2/ksp/pbs_mun4.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n For assembly, I basically relied on reaction wheels and the Mun\u0027s low gravity to allow me to rock-and-roll these things off the sides and top of the rocket stack.  Then I used the wheels to roll them over to the hub, and link up!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022pbs_mun5.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://www.skyrender.net/lp2/ksp/pbs_mun5.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n Here\u0027s the colony as it ended up.  Nothing fancy, but ripe for expansion.  And expanded it will be, of course!  That\u0027s half the fun of these challenges.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EMun Colony \u0022Shelby\u0022\u003C/strong\u003E\u003Cbr\u003E\n6 Colonists \u002B Life Support - 10 POINTs\u003Cbr\u003E\nDSN Connection - 2 POINTs\u003Cbr\u003E\u003Cem\u003ETotal - 12 POINTs\u003C/em\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-11-01T21:28:19Z\u0022 title=\u002211/01/2016 09:28  PM\u0022 data-short=\u00227 yr\u0022\u003ENovember 1, 2016\u003C/time\u003E by SkyRender\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2016-10-26T21:29:23Z","Content":"\n\u003Cp\u003E\nJust to show how easy it is to work with this particular colonization kit, I\u0027ve made a quick expansion to Shelby.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022pbs_mun6.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://www.skyrender.net/lp2/ksp/pbs_mun6.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThis time I\u0027m sending up some auxiliary equipment: science lab, mining/conversion unit, and extra power.  It\u0027s kinda lopsided...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022pbs_mun7.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://www.skyrender.net/lp2/ksp/pbs_mun7.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAn old trick for rendezvous taught by Scott Manley is to use a maneuver node over your target to kill your lateral velocity, then fire at the halfway mark of total burn time.  It works pretty well!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022pbs_mun8.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://www.skyrender.net/lp2/ksp/pbs_mun8.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThis time decoupling was a bit trickier since I couldn\u0027t do heavy rolls thanks to the solar panels.  But I managed it in the end!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022pbs_mun9.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://www.skyrender.net/lp2/ksp/pbs_mun9.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAll linked up!  Shelby is better-equipped now for survival and science.  Huzzah!  The mining unit, incidentally, has a \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E winch on it for fuel transfer to any visiting spacecraft.  See why I recommended that mod?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EMun Colony \u0022Shelby\u0022\u003C/strong\u003E\u003Cbr\u003E\n6 Colonists \u002B Life Support - 10 POINTs\u003Cbr\u003E\nDSN Connection - 2 POINTs\u003Cbr\u003E\nScience Array - 1 POINT\u003Cbr\u003E\nFuel Refinery - 2 POINTs\u003Cbr\u003E\u003Cem\u003ETotal - 15 POINTs\u003C/em\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-10-27T07:24:15Z\u0022 title=\u002210/27/2016 07:24  AM\u0022 data-short=\u00227 yr\u0022\u003EOctober 27, 2016\u003C/time\u003E by SkyRender\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2016-10-27T07:21:21Z","Content":"\n\u003Cp\u003E\nThe example continues!  Shelby has had two new expansions.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022pbs_mun10.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://www.skyrender.net/lp2/ksp/pbs_mun10.jpg\u0022\u003E\u003Cbr\u003E\u003Cimg alt=\u0022pbs_mun11.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://www.skyrender.net/lp2/ksp/pbs_mun11.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThey may look similar on the outside, but on the inside they couldn\u0027t be more different!  The first contains a garage with an 18-Kerbal rover along with 6 more Kerbals and their life support.  The second contains 6 more Kerbals and their life support, plus additional power.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022pbs_mun12.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://www.skyrender.net/lp2/ksp/pbs_mun12.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nConstruction for both works the same as the previous ones: drop, rock-n-roll, wheel over.  I took a different approach for the new hubs, though: I linked two sides of the hub with modules and used their combined wheel power to bring the lot of them over!  Module #3 in each case just docked afterward.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022pbs_mun13.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://www.skyrender.net/lp2/ksp/pbs_mun13.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nHere\u0027s the results after expansion #3...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022pbs_mun14.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://www.skyrender.net/lp2/ksp/pbs_mun14.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd after expansion #4!  Shelby\u0027s score just jumped like crazy thanks to all those new Kerbals!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EMun Colony \u0022Shelby\u0022\u003C/strong\u003E\u003Cbr\u003E\n6 Colonists \u002B Life Support - 10 POINTs\u003Cbr\u003E\n\u002B12 Colonists - 12 POINTs\u003Cbr\u003E\nFull-Capacity Rover - 3 POINTs\u003Cbr\u003E\nRover Garage - 1 POINT\u003Cbr\u003E\nDSN Connection - 2 POINTs\u003Cbr\u003E\nScience Array - 1 POINT\u003Cbr\u003E\nFuel Refinery - 2 POINTs\u003Cbr\u003E\u003Cem\u003ETotal - 31 POINTs\u003C/em\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-10-27T07:23:39Z\u0022 title=\u002210/27/2016 07:23  AM\u0022 data-short=\u00227 yr\u0022\u003EOctober 27, 2016\u003C/time\u003E by SkyRender\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TopHeavy11","CreatedById":154744,"CreatedDateTime":"2016-10-27T12:40:19Z","Content":"\n\u003Cp\u003E\nLooks cool! When (or if) PBS gets upgraded to 1.2, I\u0027ll be sure to attempt this challenge!\n\u003C/p\u003E\n"},{"CreatedByName":"Nils277","CreatedById":122414,"CreatedDateTime":"2016-10-27T13:09:44Z","Content":"\n\u003Cp\u003E\nNice challenge! \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \u003Cbr\u003E\nShould i make a badge that the winner can show in their signature?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/154744-topheavy11/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022154744\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/154744-topheavy11/\u0022 rel=\u0022\u0022\u003E@TopHeavy11\u003C/a\u003E PBS is ready for 1.2 for more than two weeks now \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-10-27T13:09:55Z\u0022 title=\u002210/27/2016 01:09  PM\u0022 data-short=\u00227 yr\u0022\u003EOctober 27, 2016\u003C/time\u003E by Nils277\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TopHeavy11","CreatedById":154744,"CreatedDateTime":"2016-10-27T13:31:25Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222825897\u0022 data-ipsquote-contentid=\u0022150904\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221477573784\u0022 data-ipsquote-userid=\u0022122414\u0022 data-ipsquote-username=\u0022Nils277\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n21 minutes ago, Nils277 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNice challenge! \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \u003Cbr\u003E\nShould i make a badge that the winner can show in their signature?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/154744-topheavy11/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022154744\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/154744-topheavy11/\u0022 rel=\u0022\u0022\u003E@TopHeavy11\u003C/a\u003E PBS is ready for 1.2 for more than two weeks now \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOh... \u003Cimg alt=\u0022:blush:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 title=\u0022:blush:\u0022\u003E.\n\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2016-10-27T14:35:49Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222825897\u0022 data-ipsquote-contentid=\u0022150904\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221477573784\u0022 data-ipsquote-userid=\u0022122414\u0022 data-ipsquote-username=\u0022Nils277\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Nils277 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNice challenge! \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \u003Cbr\u003E\nShould i make a badge that the winner can show in their signature?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSure, that sounds great!  I fell in love with your mod the moment I saw it.  It\u0027s exactly what I was looking for, and it looks very stock-alike on top of everything else!  The included TACLS compatibility (complete with custom-molded parts for the base system\u0027s quarter-pipe side-mount modules) sealed the deal for me.\n\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2016-10-27T18:24:15Z","Content":"\n\u003Cp\u003E\nAnd one last sample update!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022http://www.skyrender.net/lp2/ksp/pbs_mun15.jpg\u0022 class=\u0022ipsImage\u0022 alt=\u0022pbs_mun15.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThis time I\u0027m sending the Mun its own orbital station!  It also has a relay network attached, just to show what that might look like.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022http://www.skyrender.net/lp2/ksp/pbs_mun16.jpg\u0022 class=\u0022ipsImage\u0022 alt=\u0022pbs_mun16.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nPBS is even useful for orbital purposes.  I had this cool idea for a spoke-arm station, but...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022http://www.skyrender.net/lp2/ksp/pbs_mun17.jpg\u0022 class=\u0022ipsImage\u0022 alt=\u0022pbs_mun17.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWith no Kerbals on board to help guide the process, it wasn\u0027t going to happen.  Maybe later...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022http://www.skyrender.net/lp2/ksp/pbs_mun18.jpg\u0022 class=\u0022ipsImage\u0022 alt=\u0022pbs_mun18.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nHere\u0027s one of the relays, incidentally.  Pretty basic, but it does the trick.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022http://www.skyrender.net/lp2/ksp/pbs_mun19.jpg\u0022 class=\u0022ipsImage\u0022 alt=\u0022pbs_mun19.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI also added another expansion to Shelby!  6 more Kerbals, life support for them, and another rover.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022http://www.skyrender.net/lp2/ksp/pbs_mun20.jpg\u0022 class=\u0022ipsImage\u0022 alt=\u0022pbs_mun20.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nDecoupling and assembly went... mostly as usual.  Shelby has a bit of a haunting from the phantom force ghouls now, being so big and all, so docking this lot actually took almost an hour...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022http://www.skyrender.net/lp2/ksp/pbs_mun21.jpg\u0022 class=\u0022ipsImage\u0022 alt=\u0022pbs_mun21.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIn the end, they all got assembled.  Shelby is done for now, standing as an example for others on how this challenge might work.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EMun Colony \u0022Shelby\u0022\u003C/strong\u003E\u003Cbr\u003E\n6 Colonists \u002B Life Support - 10 POINTs\u003Cbr\u003E\n\u002B18 Colonists - 18 POINTs\u003Cbr\u003E\nFull-Capacity Rovers - 3 POINTs\u003Cbr\u003E\nRover Garages - 1 POINT\u003Cbr\u003E\nDSN Connection - 2 POINTs\u003Cbr\u003E\nScience Array - 1 POINT\u003Cbr\u003E\nFuel Refinery - 2 POINTs\u003Cbr\u003E\nOrbital Station - 6 POINTs\u003Cbr\u003E\u003Cem\u003ETotal - 43 POINTs\u003C/em\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Eidahlil","CreatedById":169310,"CreatedDateTime":"2016-10-31T20:22:57Z","Content":"\n\u003Cp\u003E\nMy Vall Colony, named \u0022Vall Colony\u0022, is finally on the ground and running.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://imgur.com/a/MSfv4\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/MSfv4\u003C/a\u003E (Sorry, the imgur image sorting is completely broken, so the order is off.)\n\u003C/p\u003E\n\u003Cp\u003E\nThe planetary base was shipped all in one piece and has hanging skyways as a core design point, to take advantage of the low gravity of Vall. It is staffed by 30 \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E personnel, but it\u0027s long-term life support is rated for up to 32.5, to allow for visitors. It also has proper planetary habitats for 32 kerbals, though more can fit for short periods in the various planetary observation cupolas. It has two planetary docking ports and can be extended with planetary modules, but currently no such extension is planned.\n\u003C/p\u003E\n\u003Cp\u003E\nThe support modules include 16 greenhouse containers, 6 algae farms, a water drill, 4 elektrons and 4 hydrogen fuel cells. It also has 3 ore drills and an \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E unit, to allow replenishing the greenhouse soil and making fuel for the shuttle and any other spaceships.\n\u003C/p\u003E\n\u003Cp\u003E\nIt has two garages containing one 16 seat rover each. The base also has a lab unit and a full suite of the stock experiments.\n\u003C/p\u003E\n\u003Cp\u003E\nThe orbital station can accommodate 32 kerbals but has no long term life support. However, it\u0027s supplies module can be detached and carried to the planetary base by the shuttle for replenishment (usually using those 2.5 extra kerbal capacity). The station also has a 800G rated communications array and can support orbital and ground operations throughout Kerbal space. Due to the low efficiency of solar panels, electricity is provided by 4 \u003Cabbr title=\u0022Radio-isotope Thermo-electric Generator (a.k.a. Mars rover heating device)\u0022\u003ERTG\u003C/abbr\u003E generators, rated for one eternity each.\n\u003C/p\u003E\n\u003Cp\u003E\nThe orbital station also has fuel storage and can be used to refuel spacecraft, though the fuel has to be brought up from the surface by the shuttle.\n\u003C/p\u003E\n\u003Cp\u003E\nIt also has a sports area in the form of a repurposed Mk3 cargo bay, complete with a Stayputnik brand smart ball. Just don\u0027t forget to dock the ball back in place before warping.\n\u003C/p\u003E\n\u003Cp\u003E\nTravel between the two is facilitated by an orbital shuttle with a capacity of one pilot and 32 passengers (remote control autopilot available). The shuttle usually hails between the planetary base and orbital station, but, after refuellng at the orbital station, it has a range of 2.8km/s \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E and can be used for expeditions within Jool \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E. It also has powerful \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E to allow aggressive maneuvers and translation in non-zero-G environments, such as when landing back on the elevated pad in the planetary base.\n\u003C/p\u003E\n\u003Cp\u003E\nThe shuttle can also be used for an emergency return to Kerbin. It only has passenger seats, which are rather uncomfortable, but our surveys show 80% of kerbals would choose sitting in super-economy class for 2 years over certain death. After refuelling at the orbital station and docking with a sealed emergency supplies module, it has over 2km/s \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E, which should be enough to get back to Kerbin with a gravity assist from Tylo or Laythe and some aerobraking in Kerbin. The supplies module would be jettisoned before landing, and the shuttle was tested to require only about 100m/s \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E to perform a hot landing on Kerbin.\n\u003C/p\u003E\n\u003Cp\u003E\nCommunications is provided by two Communotron 88-88 dishes on the planetary base and a relay satellite in geosynchronous orbit. The relay satellite can sometimes be blocked from direct sight to Kerbin by Jool, but most of the time it will see another satellite within the Kerbol system and can establish a link. However, as the communication satellite ring between Duna and Dres is yet to be completed, an outage is possible, if unlikely.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022wxWchc9.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/wxWchc9.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIn all fairness, this was initially planned as a Gilly base, however, upon deeper inspection Gilly was found to lack water in any sort of shape, so it was quickly redesignated as a Vall base instead. Bonus that I have not done a Jool mission in a long while. Gus quickly slapped on a few more boosters for the launch, switched the Terriers on the shuttle for Aerospikes, Gene declared that this is sufficient, as the base will use aerocapture when within Jool \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E, and the base was launched.\n\u003C/p\u003E\n\u003Cp\u003E\nA few weeks later Linus sheepishly entered the mission control, and admitted to doing the math on that aerocapture maneuver. Turns out the craft would be entering Jool at 8km/s, which is too fast for anything but the space gym to survive. We would have a choice of not slowing down at all, being on fire, or both. So, after a year of panic, it was determined that using a gravity assist to get captured is, indeed, possible.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, turns out that, while using an Elektron and a Fuel Cell at the same time produces oxygen and electricity at the expense of tiny amounts of water, the Fuel Cells don\u0027t actually like working. If you are in space, and want to turn that hydrogen back into water, the fuel cells won\u0027t work because your electricity is full. If you are on the ground, and want to turn that hydrogen into electricity, the fuel cells won\u0027t work because the water drill has filled up the water containers. So, in short, they work practically never. A local engineer ended up modding them with a script he calls \u0022dumpExcess = true\u0022 to fix that, but only after two weeks of sending gravity experiments home to use up electricity to get some water to drink and make oxygen out of.\n\u003C/p\u003E\n\u003Cp\u003E\nAh, the scoring, I think the mission fulfills all the requirements, if ~99.95% DSN coverage is good enough, and has a (not fully tested) way to return home.\n\u003C/p\u003E\n\u003Cp\u003E\nLovely challenge and mods, I instantly fell in love with the bigger 6 way PBS connector, and, as you can see, used it everywhere. Also, the \u003Ca href=\u0022https://github.com/Nils277/KerbalPlanetaryBaseSystems/wiki/Life-Support-Guide\u0022 rel=\u0022external nofollow\u0022\u003EPBS life support guide \u003C/a\u003Eis really nice and helped a lot. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2016-11-01T21:26:24Z","Content":"\n\u003Cp\u003E\nWowza!  You went whole-hog on that bad boy!  Let\u0027s get your tally up, then...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EEidahlil\u0027s Vall Colony\u003C/strong\u003E\u003Cbr\u003E\n6 Colonists \u002B Life Support - 10 POINTs\u003Cbr\u003E\n\u002B24 Colonists - 24 POINTs\u003Cbr\u003E\nFull-Capacity Rovers - 3 POINTs\u003Cbr\u003E\nRover Garages - 1 POINT\u003Cbr\u003E\nDSN Connection - 2 POINTs\u003Cbr\u003E\nScience Array - 1 POINT\u003Cbr\u003E\nFuel Refinery - 2 POINTs\u003Cbr\u003E\nOrbital Station - 6 POINTs\u003Cbr\u003E\nZero-G Sports Arena - 1 POINT\u003Cbr\u003E\nVall Multiplier - 4x\u003Cbr\u003E\nReturn Bonus - 25 POINTs\u003Cbr\u003E\u003Cem\u003ETotal - 225 POINTs\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe maximum score for Vall!  Not bad at all, I must say.  I\u0027m doubly impressed that you did all of that in two whole launches!  Well done indeed.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-11-01T21:28:33Z\u0022 title=\u002211/01/2016 09:28  PM\u0022 data-short=\u00227 yr\u0022\u003ENovember 1, 2016\u003C/time\u003E by SkyRender\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nils277","CreatedById":122414,"CreatedDateTime":"2016-11-02T13:19:18Z","Content":"\n\u003Cp\u003E\nOh, here is the banner for the winner \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022OBVLRUx.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/OBVLRUx.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-11-02T13:19:43Z\u0022 title=\u002211/02/2016 01:19  PM\u0022 data-short=\u00227 yr\u0022\u003ENovember 2, 2016\u003C/time\u003E by Nils277\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Zachary13","CreatedById":163982,"CreatedDateTime":"2016-11-21T03:53:30Z","Content":"\n\u003Cp\u003E\nQuestion,\n\u003C/p\u003E\n\u003Cp\u003E\nCan we use the orbital station as a return vehicle? Also, are BetterBurnTime and Transfer Window Planner \u0022Cheat-y?\u0022\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-11-21T04:02:34Z\u0022 title=\u002211/21/2016 04:02  AM\u0022 data-short=\u00227 yr\u0022\u003ENovember 21, 2016\u003C/time\u003E by Zachary13\u003C/strong\u003E\n\u003C/span\u003E\n"}]}