{"TopicId":150947,"ForumId":32,"TopicTitle":"Radiator Panel (small) Warranty Voided","CreatedByName":"Moesly_Armlis","CreatedById":112247,"CreatedDateTime":"2016-10-27T11:48:33Z","PageNum":1,"Articles":[{"CreatedByName":"Moesly_Armlis","CreatedById":112247,"CreatedDateTime":"2016-10-27T11:48:33Z","Content":"\n\u003Cp\u003E\n\u003Cb\u003ERadiator Panel (small)\u003C/b\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022196px-Radiator_Panel_(small).png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://wiki.kerbalspaceprogram.com/images/thumb/a/aa/Radiator_Panel_(small).png/196px-Radiator_Panel_(small).png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFor a long time now I always tried to figure out a use for this part that becomes available early in career. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022yvNoFoi.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/yvNoFoi.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022QDlxpKe.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/QDlxpKe.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThis kerbal corral allows the team to acquire EVA science from space without upgrading the Astronaut Complex.  The kerbal exits before launch and the panels restrain in case the kerbal lets go off the ladder due to unconsciousness.  Once in space science from EVA can be completed and then back into the command module for the return.  Time warp is a bit of a problem though because the kerbal passes through the enclosure and physics time warp is used primarily.  If physicsless time warp is used on lets say a trip to Mun then the kerbal needs to use the EVA pack to return to the vessel and grab the ladder before maneuvers.\n\u003C/p\u003E\n\u003Cp\u003E\nProbodobodyne Inc.now tells me the warranty is voided.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnyone else care to share how you alternatively use the radiator parts.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2016-10-27T13:43:22Z","Content":"\n\u003Cp\u003E\nMostly.... I don\u0027t use them. Except for \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E, but even then its situational and I try to use bigger ones to reduce part count.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve tried using them on spaceplanes to allow them to cool down faster so that they can deorbit right after getting to orbit (and deploying a payload)... as they are often quite hot after the ascent... but I would want to recover for 100%, and they cool down enough in half an orbit even without radiators.\n\u003C/p\u003E\n"},{"CreatedByName":"septemberWaves","CreatedById":160814,"CreatedDateTime":"2016-10-27T14:04:30Z","Content":"\n\u003Cp\u003E\nI\u0027ve used them as an early fairing before. That\u0027s about it though.\n\u003C/p\u003E\n"},{"CreatedByName":"moogoob","CreatedById":118251,"CreatedDateTime":"2016-10-27T14:53:58Z","Content":"\n\u003Cp\u003E\nThat\u0027s ingenious! I only use them with the Nuke - but since the big Nuke heat buff in 1.0 it\u0027s been gradually nerfed to need steadily less and less radiator so they\u0027re less crucial.\n\u003C/p\u003E\n"},{"CreatedByName":"ZentroCatson","CreatedById":143939,"CreatedDateTime":"2016-10-27T15:00:03Z","Content":"\n\u003Cp\u003E\nThat\u0027s a very kerbal idea, but it\u0027s none the less genious!\n\u003C/p\u003E\n\u003Cp\u003E\nI use the radial radiators (Heh, that rhymes!) for cooling spaceplanes on ascent and descent. They don\u0027t help as much as heatshields, but they\u0027re more aerodynamic.\n\u003C/p\u003E\n"},{"CreatedByName":"Overland","CreatedById":119812,"CreatedDateTime":"2016-10-27T18:57:14Z","Content":"\n\u003Cp\u003E\nI use them on locomotives..never quite sure if they work or not..although back before they were standard I did enjoy battling mountains with generators running hot..juggling rpm, torque and heat.. I never quite get the same enjoyable battles now though...maybe radiators do work?\n\u003C/p\u003E\n\u003Cp\u003E\nI never quite thought about it until now \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022qqjNEwJ.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/qqjNEwJ.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-10-27T19:02:04Z\u0022 title=\u002210/27/2016 07:02  PM\u0022 data-short=\u00227 yr\u0022\u003EOctober 27, 2016\u003C/time\u003E by Overland\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"panzer1b","CreatedById":95108,"CreatedDateTime":"2016-10-27T19:26:51Z","Content":"\n\u003Cp\u003E\nIve used then quite alot for asthetic exteriors.  At least some of the smaller scale organic looking vessels use them to create nice curves, and ive used them to create a few highly detailed landers similar to the MAV from that movie about that guy on mars which used the radiators externally as its hull (airless bodies you dont care about the drag problem and for takeoff you just cram the thing in a fairing).  I also habitually use them to create heavy cannon barrels (they look cool and they make sense from a roleplay standpoint where they would be cooling the cannons).  That and they are useful for BDA combat as with enough, you can considerably improve your armor protection against smaller weapons like the 50cals.  Stock, not that useful though.\n\u003C/p\u003E\n\u003Cp\u003E\nOtherwise, i use them for IRSU units (you pretty much need a radiator for it to be efficient).  Aside from that, there arent really any uses for radiators.  When 1.0 came out nukes kinda needed em since they overheated super fast, but in 1.2 and even 1.1.3, the heat generation on them is low enough to be negligible for all but really bad designs.  The only other time i can think of that you actually need them would be sundiving or something crazy like that, under normal circumstances i highly doubt you would ever need to deal with heating to bother bringing radiators...\n\u003C/p\u003E\n"},{"CreatedByName":"kBob","CreatedById":102132,"CreatedDateTime":"2016-10-27T20:56:41Z","Content":"\n\u003Cp\u003E\nWell, dang, I use them as radiators on my capsules if I have the part count available, seems to help me during reentry so I can be a bit more careless with how fast I come in.  Now I feel silly as I see what they are really for, Kerbal playpens!\n\u003C/p\u003E\n"},{"CreatedByName":"Moesly_Armlis","CreatedById":112247,"CreatedDateTime":"2016-10-27T21:58:53Z","Content":"\n\u003Cp\u003E\nThe first simulation went and cooked Bob in the upper atmosphere.  Next time turning on a radiator to see if that can keep him cool.\n\u003C/p\u003E\n\u003Cp\u003E\nThe second simulation used a steeper profile to escape atmosphere.  The extra delta V needed for this maneuver only allowed for a sub orbital flight.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022arRSfMX.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/arRSfMX.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe lifter needs some further design.  The vessel started to handle poorly when approaching 400 m/s.  The corral is not aerodynamic.  Previous games I used the 1.25m Service Bay but now having issues with them spaghettifying the kerbal.\n\u003C/p\u003E\n\u003Cp\u003E\nEngine parts available are the Reliant,Swivel Terrier,Thumper, Hammer, Flea.  The lifter I chose was assembled from a Hammer Swivel and the Terrier.  The lack of \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E in the lower atmosphere is now having me consider using the Reliant or the Thumper with small Fins. \n\u003C/p\u003E\n\u003Cp\u003E\nThe two \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E modules in the command pods are helpful in stability.   Previous version would have \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E shut off when switching to Bob and now the new 1.2 update has fixed this problem.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-10-27T21:59:21Z\u0022 title=\u002210/27/2016 09:59  PM\u0022 data-short=\u00227 yr\u0022\u003EOctober 27, 2016\u003C/time\u003E by MoeslyArmlis\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SpacedCowboy","CreatedById":92106,"CreatedDateTime":"2016-10-27T23:58:39Z","Content":"\n\u003Cp\u003E\nMoesly, you are one nasty, sick, and inkermane puppy!\n\u003C/p\u003E\n\u003Cp\u003E\nGlad that\u0027s all workin\u0027 out for ya.\n\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2016-10-28T03:22:38Z","Content":"\n\u003Cp\u003E\nAesthetics mostly. Since I don\u0027t do any mining they\u0027re pretty much completely useless. I really enjoyed having a use for them with the nuclear engines though, in a weird way it made sense that running Aerozine 50 through a nuclear engine and getting near hydrogen isp would make the engine overheat.\n\u003C/p\u003E\n"},{"CreatedByName":"Rath","CreatedById":138223,"CreatedDateTime":"2016-10-28T06:18:03Z","Content":"\n\u003Cp\u003E\nThat is a great sig quote...\n\u003C/p\u003E\n"},{"CreatedByName":"panzer1b","CreatedById":95108,"CreatedDateTime":"2016-10-28T16:45:59Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222826962\u0022 data-ipsquote-contentid=\u0022150947\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221477624958\u0022 data-ipsquote-userid=\u002270807\u0022 data-ipsquote-username=\u0022regex\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n13 hours ago, regex said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAesthetics mostly. Since I don\u0027t do any mining they\u0027re pretty much completely useless. I really enjoyed having a use for them with the nuclear engines though, in a weird way it made sense that running Aerozine 50 through a nuclear engine and getting near hydrogen isp would make the engine overheat.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI agree with you completely on that regard.  Not that i give a crap about whether this is \u0022realistic\u0022 or not, but it gave the NTRs a distinct disadvantage that offset its super high \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E.  Right now you can slap a nuke on 90% of ships and have no heat problems whatsoever, given the higher \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E, there is plain and simply no reason to use anything but NTRs or ions depending on craft size if you are only going into space.  Yeah i dont play career so i dont care about funds (that is a valid reason not to use nukes), and i also dont make vessels so exceedingly heavy that a cluster of nukes is unable to push it with a reasonable \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nAll in all, i strongly support a increase in heat generated by the NTR to something akin to 1.0 level where long burns without a radiator would be a major problem.  That said, i have a \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E to laythe and back made in 1.0 that didnt have 1 radiator and still would never overheat unless you tried to do a 4000dV burn in 1 shot (there is no reason to ever do that from my experience).  In other words, 1.0\u0027s nuke heat was something to consider, but was at least somewhat of a challenge to deal with if you had extremely lousy \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E and didnt have a radiator.  Never understood why they removed this, nukes could use another distinct downside besides the long engine (makes landing on them kinda hard) and the high dry mass (makes em ill suited for small scale, but they still end up with a much lighter ship for a given amount of \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E for anything 20\u002B tons)...\n\u003C/p\u003E\n"}]}