{"TopicId":150962,"ForumId":46,"TopicTitle":"Dev blog PR","CreatedByName":"SpannerMonkey(smce)","CreatedById":50907,"CreatedDateTime":"2016-10-27T18:50:44Z","PageNum":1,"Articles":[{"CreatedByName":"SpannerMonkey(smce)","CreatedById":50907,"CreatedDateTime":"2016-10-27T18:50:44Z","Content":"\n\u003Cp\u003E\nHi all,   I\u0027ve been haunting the KSP forums since 2012, i don;t think in all that time I\u0027ve seen the front page look as negative as it does now.\n\u003C/p\u003E\n\u003Cp\u003E\n  Once upon a time there were regular posts in the dev blogs,  with some little gem or other, and I\u0027ve not got out of the habit of glancing at them when i log on, and for the recent weeks one thing stands out, ignoring the fact that the pre release had little mention there,  the full release wasn\u0027t mentioned at all i think, not even the HelloGreen thing, so what leaps out at you?\n\u003C/p\u003E\n\u003Cp\u003E\n  Two sets of goodbyes, i think on the whole the community has come to terms with the whole business, and it\u0027s time to put something a little more positive in the devblogs if only to brighten the mood of the first page most people see. Or is it some kind of unofficial memorial ? \u003Cspan style=\u0022font-size:11px;\u0022\u003Ewhich is odd if it is , in the time some of those guys worked around here I\u0027ve had two jobs, \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E nobody stays put \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI can\u0027t imagine it\u0027s particularly inviting to someone looking at the forum for the first time,  as most will have had at least 1 digital game fail to meet the promises of developers and seen companies fall apart by now and at first glance it looks like it was happening here too, even if it wasn\u0027t \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nCheers\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nthen followed ten mins of procrastination while i wondered if to press the post button or not, \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-10-27T18:51:37Z\u0022 title=\u002210/27/2016 06:51  PM\u0022 data-short=\u00227 yr\u0022\u003EOctober 27, 2016\u003C/time\u003E by SpannerMonkey(smce)\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Gordon Fecyk","CreatedById":157121,"CreatedDateTime":"2016-10-27T20:06:14Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222826329\u0022 data-ipsquote-contentid=\u0022150962\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221477594244\u0022 data-ipsquote-userid=\u002250907\u0022 data-ipsquote-username=\u0022SpannerMonkey(smce)\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n58 minutes ago, SpannerMonkey(smce) said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI don\u0027t think in all that time I\u0027ve seen the front page look as negative as it does now.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIn my opinion, Kerbal Space Program is growing up. Gone from the confines of early access and having reached two major milestones since, it\u0027s discovering the \u0027real world\u0027 of PC and now console gaming. That world is not a pleasant one, and the \u0027new kid\u0027 is attracting unwanted attention. Reminds me of Grade 4 back home. And Grade 8, and Grade 10. And a few other milestones I\u0027d rather forget.\n\u003C/p\u003E\n\u003Cp\u003E\nThe tone was quite different here, because in early access there were very low expectations. Even I, who would gladly lash out at an established developer for not following best current practices on Windows, am holding back something fierce. I genuinely love the premise of KSP, and only the Steam edition makes installing it somewhat sane because Valve is taking care of the workarounds needed to run this game somewhat safely. So I just sit back, and if anyone asks for my professional IT opinion I suggest they get a Steam account and purchase KSP from there.\n\u003C/p\u003E\n\u003Cp\u003E\nThat tone is changing with KSP\u0027s popularity expanding. We\u0027re attracting the console generation here, and they are used to the quality (ahem) of Call of Duty, Halo, Gears of War, Fallout, and so on with very large amounts of development time behind them. With more YouTube exposure we\u0027re also attracting the wretched hive of scum and villainy that is the YouTube Comments Section. And our teenage space sim franchise is learning the hard way that the real world sucks and groups of real people can and will be evil.\n\u003C/p\u003E\n\u003Cp\u003E\nHow our community and developers respond to this will define it for good. It\u0027s time to live away from home and make the hard decisions.\n\u003C/p\u003E\n\u003Cp\u003E\n--\n\u003C/p\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2016-10-27T20:30:38Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222826329\u0022 data-ipsquote-contentid=\u0022150962\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221477594244\u0022 data-ipsquote-userid=\u002250907\u0022 data-ipsquote-username=\u0022SpannerMonkey(smce)\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, SpannerMonkey(smce) said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n(...) so what leaps out at you?\n\u003C/p\u003E\n\u003Cp\u003E\n  Two sets of goodbyes, i think on the whole the community has come to terms with the whole business, and it\u0027s time to put something a little more positive in the devblogs if only to brighten the mood of the first page most people see. Or is it some kind of unofficial memorial ? (...) I can\u0027t imagine it\u0027s particularly inviting to someone looking at the forum for the first time,  as most will have had at least 1 digital game fail to meet the promises of developers and seen companies fall apart by now and at first glance it looks like it was happening here too, even if it wasn\u0027t \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nGood point. As we say in marketing: perception is reality.\n\u003C/p\u003E\n\u003Cp\u003E\nI always found it curious that Squad doesn\u0027t seem to care about its outside appearance regarding the future of the development of the game. Surely there are some occasional “\u003Cem\u003Ebut we really do! There IS a future!” \u003C/em\u003Eposts but words are cheap, especially when they are not backed by the \u003Cem\u003Eperceived\u003C/em\u003E reality (which might not be the \u003Cem\u003Ereal\u003C/em\u003E reality). Especially when words are not needed if actions speak for themselves (see: companies who \u003Cem\u003Eclaim\u003C/em\u003E that “our workers are our biggest asset”).\n\u003C/p\u003E\n\u003Cp\u003E\nLuckily Squad doesn\u0027t need words to convince us. A solid 1.3 release, as well as fixing the console problems, will do the trick. Time will tell!\n\u003C/p\u003E\n"},{"CreatedByName":"pxi","CreatedById":78711,"CreatedDateTime":"2016-10-27T21:40:29Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222826478\u0022 data-ipsquote-contentid=\u0022150962\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221477600238\u0022 data-ipsquote-userid=\u002278303\u0022 data-ipsquote-username=\u0022Kerbart\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n46 minutes ago, Kerbart said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nLuckily Squad doesn\u0027t need words to convince us. A solid 1.3 release, as well as fixing the console problems, will do the trick. Time will tell!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAgreed.  Some of the best communication I\u0027ve seen from Squad came from the devs on the front line (a great example of this would be Harvester\u0027s post from years back explaining how he re-did the craters on the Mun by using a quadtree implementation).\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, especially in the last year or so, communication has more and more gone in the direction of vague assertions that great things are around the corner, only Squad can\u0027t talk about them right now, but omfg you\u0027re going to love it.  There are times when it\u0027s hard to judge whether that thing that Squad were hyping so hard even made it in because we were never told \u0022that\u0027s the thing we were hyping\u0022.  A good example of this would be to think back a couple of releases to that time when we were told that something was in the works that was going to make us (the community) very proud of them (Squad).\n\u003C/p\u003E\n\u003Cp\u003E\nFortunately KSP is a decent product, and I think the devs, both past and current deserve respect for the work they\u0027ve done.\n\u003C/p\u003E\n\u003Cp\u003E\nLet the end-product do the talking.\n\u003C/p\u003E\n"}]}