{"TopicId":151140,"ForumId":16,"TopicTitle":"Annoying Docking","CreatedByName":"DrDress","CreatedById":156575,"CreatedDateTime":"2016-10-30T10:49:29Z","PageNum":1,"Articles":[{"CreatedByName":"DrDress","CreatedById":156575,"CreatedDateTime":"2016-10-30T10:49:29Z","Content":"\n\u003Cp\u003E\nWhen I dock two spacecrafts, it really bugs me that the axis of my craft doesn\u0027t align with the control keys (WASD). So for example if I press W the ship doesn\u0027t go up, but it goes left or something. I usually have to look at the \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E exhaust when I press a button to see what direction it tries to put my ship.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIsn\u0027t there a way to make it more \u0022videogame-like\u0022? Like if you were seeing it from the cockpit (first person), or seeing from directly behind (third person) or something?\n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2016-10-30T11:07:38Z","Content":"\n\u003Cp\u003E\nHit C or the \u0022View\u0022 button on the pilot\u0027s portrait to get a cockpit view.\n\u003C/p\u003E\n\u003Cp\u003E\nBut otherwise, you need to rotate your ship so the top is pointing up before the WASD keys will act like they are pointing in the \u0022standard\u0022 direction.\n\u003C/p\u003E\n"},{"CreatedByName":"Clipperride","CreatedById":149816,"CreatedDateTime":"2016-10-30T13:58:59Z","Content":"\n\u003Cp\u003E\nWhen docking, I cycle the camera view (V) until it\u0027s on \u0022Locked\u0022.  If you then position the camera behind your vessel and try the H/M, J/L and I/K keys you\u0027ll see the ship move as expected.\n\u003C/p\u003E\n\u003Cp\u003E\nOne other option is to place a small rectangular girder section to indicate \u0022up\u0022 relative to the pilot.  That\u0027s also handy if you are docking fore or aft (ie inline) with another ship and alignment is important.  Again, a small girder, or similar, next to each docking port, gives you a reference point.\n\u003C/p\u003E\n\u003Cp\u003E\nIf I want to be precise about docking; I get to within about 30m, choose the \u0022Locked\u0022 camera view, then come to a stop relative to the target.  Turn off the \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E thrusters (so you remain stationary) and use the WASD keys to rotate the active ship to the correct angle for docking (ie the orientation you would want you active ship to be in a moment before docking).  \n\u003C/p\u003E\n\u003Cp\u003E\nThen, turning the \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E back on, I use the IKJL keys to move \u0022up\u0022, \u0022down\u0022, \u0022left\u0022, \u0022right\u0022 until I get the targeted docking port symbol on the NAV ball in the centre of the -v- mark.  Finally a touch of H/M to move slowly forward and dock. If, when you start to move forward, the prograde symbol isn\u0027t also in the centre of the -v- on the NAV ball, use IKJL to move it until the prograde symbol, targeted docking port symbol and the -v- are neatly lined up. As you move in, you can (with \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E thrusters turned off again) use Q/E to rotate into alignment.\n\u003C/p\u003E\n\u003Cp\u003E\n(You\u0027d never guess I got paid by the word would you?? Old habits die hard)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-10-30T14:02:20Z\u0022 title=\u002210/30/2016 02:02  PM\u0022 data-short=\u00227 yr\u0022\u003EOctober 30, 2016\u003C/time\u003E by Clipperride\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ForScience6686","CreatedById":144187,"CreatedDateTime":"2016-10-30T14:10:41Z","Content":"\n\u003Cp\u003E\nI\u0027ll  use lights on larger craft,  and set the individual colors do I have a quick visual reference.   other than that,  the suggestion for cycling the view to locked is the best method.\n\u003C/p\u003E\n"},{"CreatedByName":"RX2000","CreatedById":164186,"CreatedDateTime":"2016-10-30T14:22:29Z","Content":"\n\u003Cp\u003E\nHad the same problem when I first started trying to dock. As mentioned above, your best bet is to change the camera mode to \u0022locked.\u0022\n\u003C/p\u003E\n"},{"CreatedByName":"Plusck","CreatedById":153264,"CreatedDateTime":"2016-10-30T14:49:47Z","Content":"\n\u003Cp\u003E\nThe other (and imho better) option is just to ignore what\u0027s going on in the external view (except for one single vital bit of info - distance to target), and concentrate exclusively on the NavBall.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you\u0027ve lined up the docking ports once, then they are going to stay perfectly lined up unless you rotate yourself or phantom forces are at work. So instead of rotating to point to target if it drifts off centre, translate to push the approach vector on the other side of target to bring it back to you. Microwarping from time to time just to make sure nothing is rotating on its own is sometimes necessary. With that, you hardly need to look at the screen at all.\n\u003C/p\u003E\n"},{"CreatedByName":"FullMetalMachinist","CreatedById":156531,"CreatedDateTime":"2016-10-30T15:41:17Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222830310\u0022 data-ipsquote-contentid=\u0022151140\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221477838987\u0022 data-ipsquote-userid=\u0022153264\u0022 data-ipsquote-username=\u0022Plusck\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n48 minutes ago, Plusck said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe other (and imho better) option is just to ignore what\u0027s going on in the external view (except for one single vital bit of info - distance to target), and concentrate exclusively on the NavBall.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis. When I dock, I only look at the \u0027main\u0027 part of the screen for distance to target and roll orientation to the target. The rest of the time my eyes are glued to the navball. \n\u003C/p\u003E\n\u003Cp\u003E\nJust make sure that when you start your \u0027close approach\u0027 you set your own docking port to \u0022control from here\u0022 and set the other port as the target. \n\u003C/p\u003E\n"},{"CreatedByName":"DrDress","CreatedById":156575,"CreatedDateTime":"2016-10-30T17:04:50Z","Content":"\n\u003Cp\u003E\nThanks for the tips. I\u0027ll try the the camera lock.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe nav ball thing seems like a half-solution to me, since I still need to align the ports with out knowing how my ship will rotate.\n\u003C/p\u003E\n"},{"CreatedByName":"DD_bwest","CreatedById":164906,"CreatedDateTime":"2016-10-30T17:45:32Z","Content":"\n\u003Cp\u003E\ndoing it with the navball is by far the best method. its even possible to dock in map view if you know how to use the navball.  have them looking at eachother so centered on the rarget marker in the navball.  then have 1 ship move towards the other and center your prograde marker ontop  of the target.  \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222830515\u0022 data-ipsquote-contentid=\u0022151140\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221477847090\u0022 data-ipsquote-userid=\u0022156575\u0022 data-ipsquote-username=\u0022DrDress\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n42 minutes ago, DrDress said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThanks for the tips. I\u0027ll try the the camera lock.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe nav ball thing seems like a half-solution to me, since I still need to align the ports with out knowing how my ship will rotate.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nif you go by the navball your ship will always rotate the way you want it.  the wasd keys will always corresond with the same movement on the navball. to allign the ports, select the docking ports as you target and make it point to the pinkish target marker on the navball.  switch vehicles and do the same.  \n\u003C/p\u003E\n"},{"CreatedByName":"Plusck","CreatedById":153264,"CreatedDateTime":"2016-10-30T18:42:15Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222830515\u0022 data-ipsquote-contentid=\u0022151140\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221477847090\u0022 data-ipsquote-userid=\u0022156575\u0022 data-ipsquote-username=\u0022DrDress\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, DrDress said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe nav ball thing seems like a half-solution to me, since I still need to align the ports with out knowing how my ship will rotate.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe main thing is \u003Cem\u003E\u003Cu\u003Enot to rotate your ship at all,\u003C/u\u003E\u003C/em\u003E after lining them up the first time. This is very important.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you align the ports on two craft that are vitrually stationary with respect to each other, then warp halfway around the planet, then stop, the two ports will be facing exactly the same way as before. They won\u0027t be facing each other, but they will be facing exactly opposite directions. Warp halfway around again and they\u0027ll be facing each other again.\n\u003C/p\u003E\n\u003Cp\u003E\nSo as you move around the orbit, the ports remain perfectly aligned... except that the ships drift to the side.\n\u003C/p\u003E\n\u003Cp\u003E\nTherefore, as you approach, \u003Cem\u003E\u003Cu\u003Eyou must not rotate\u003C/u\u003E\u003C/em\u003E: if you do that the other port will not be aligned and will never be aligned properly.\u003Cbr\u003E\nYou use translate to push the prograde vector to the other side of the target: that means you are heading to the other side of the target, and the target will drift back until it\u0027s perfectly centred again. You translate back to cancel the sideways movement, and you\u0027re perfectly aligned again.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe only exception to that is if both ships are using \u0022rotate to target\u0022: but it is finnicky and can easily fail to work for the ship you\u0027re not controlling, is not really an option for massive vessels like space stations, and is really a bad idea unless you have massive amounts of monoprop (you need to activate \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E for translation, but the ship will then use a lot of \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E trying to keep the target centred using rotation... often cancelling out whatever movements you\u0027re trying to make in the first place).\n\u003C/p\u003E\n"}]}