{"TopicId":151219,"ForumId":18,"TopicTitle":"Civilization VI Stories","CreatedByName":"astrokerb","CreatedById":151932,"CreatedDateTime":"2016-10-31T15:05:38Z","PageNum":1,"Articles":[{"CreatedByName":"astrokerb","CreatedById":151932,"CreatedDateTime":"2016-10-31T15:05:38Z","Content":"\n\u003Cp\u003E\n Civilization VI, the sixth installment in the \u003Cem\u003ECivilziation\u003C/em\u003E video game series, is now available for everyone who doesn\u0027t use Linux, which probably includes you, so if you have it and you\u0027ve already played an entire game of it, tell us what happened!\n\u003C/p\u003E\n\u003Cp\u003E\nI played as China on king difficulty. I built as many wonders as I could once I had four cities with moderately good production. Greece declared war on me and I captured Athens, which eventually had enough production to finish late-game units in five turns. They declared war on me again, and I conquered them. I conquered the Scythians and the Spanish after they declared war on me. By that point my empire took up roughly half of my continent. I declared a holy war on Norway and launched a nuclear strike on Nidaros. I won a culture victory because I had 97 tourists coming to see my nation\u0027s great works and thirty others seeing the wonders, which was one more tourist than I needed to win, although the row of seven Seaside Resorts on my coast probably helped a bit as well.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-10-31T20:27:36Z\u0022 title=\u002210/31/2016 08:27  PM\u0022 data-short=\u00227 yr\u0022\u003EOctober 31, 2016\u003C/time\u003E by astrokerb\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Cydonian Monk","CreatedById":69224,"CreatedDateTime":"2016-10-31T17:34:21Z","Content":"\n\u003Cp\u003E\nI started a game as Gilgamesh. Marathon length, Monarch difficulty, largest map size. Met some great friends: Brazil and France. Declared friendships all around, everybody happy and friendly except The Congo, who I discovered late. Suddenly around turn 60 both of my friends spawn 30 or so warriors, both declare war on me, and Brazil captures both of my cities. Game Over.\n\u003C/p\u003E\n\u003Cp\u003E\nThat\u0027s the only complete game I\u0027ve had.\n\u003C/p\u003E\n\u003Cp\u003E\nMy second game as Japan is still on-going, same difficulty settings. I\u0027ve reached a pre-Industrial stalemate, constantly repelling the Scythians, The Congo, and the warmonger Gandhi. Boring game aside from the endless war.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m not sure I\u0027m going to play it again until some things get tweaked or patched.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-10-31T17:34:51Z\u0022 title=\u002210/31/2016 05:34  PM\u0022 data-short=\u00227 yr\u0022\u003EOctober 31, 2016\u003C/time\u003E by Cydonian Monk\u003C/strong\u003E\n\u003C/span\u003E\n"}]}