{"TopicId":151911,"ForumId":51,"TopicTitle":"Operation Underhill (Fuel Infrastructure)","CreatedByName":"Opus_723","CreatedById":170390,"CreatedDateTime":"2016-11-12T09:04:26Z","PageNum":1,"Articles":[{"CreatedByName":"Opus_723","CreatedById":170390,"CreatedDateTime":"2016-11-12T09:04:26Z","Content":"\n\u003Cp\u003E\nHi all! This will be my first mission report, so that\u0027s exciting. I only started playing KSP a few months ago, and I\u0027ve only played sporadically, but I\u0027m loving the game, and I know I\u0027ll be playing it for years to come. But so far I haven\u0027t done anything I felt warranted a mission report. I haven\u0027t even finished the tech tree. I\u0027ve landed on the Mun and Minmus, built a small science station in \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E, started work on a small Mun base, sent a few probes and rovers to the Duna and Eve systems. The biggest mission I\u0027ve launched was my recent first landing and return of a couple of Kerbals from Duna, which was a huge milestone.\n\u003C/p\u003E\n\u003Cp\u003E\nBut now I\u0027ve been dreaming up even bigger projects: large expeditions, expanding my Mun base and building more on other worlds, interplanetary stations, and adventures to the outer and inner planets. The stuff I want to do is far beyond anything I\u0027ve set a precedent for. If I\u0027m going to do all of this in career, I need to plan ahead.\n\u003C/p\u003E\n\u003Cp\u003E\nSo I\u0027ve decided that I need to invest the time, effort, and funds into some mining and fuel infrastructure. My goal is to set up a system where I can mine the Mun and process fuel there and send it up to an orbital fuel depot. I\u0027ll also set up a depot in \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E and ferry fuel there from the Mun depot as needed. I know that it would be easier to mine Minmus, but I want to start with the Mun as a challenge. If I can build a substantial mining operation on the Mun, then I can build an even more effective system on Minmus some time in the future. The operation is going to be fairly ambitious, as I want it to be as future-proof as I can make it. I plan to make depots with far more fuel than I could use right now. I think every single launch in the assembly of this operation will be larger than my Duna mission, often by a huge margin. Fingers crossed.\n\u003C/p\u003E\n\u003Cp\u003E\nHopefully this is interesting to some people, and it might serve as inspiration to any other rookies like me that want to try something like this. I know most people here could probably design something far more efficient and lovely than what I\u0027ve come up with, but I think it\u0027ll be good to have a newbie mission report. I\u0027m sure I\u0027ll have some educational failures along the way \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022:wink:\u0022\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, this is going to be expensive, so I\u0027ll have to take some breaks here and there to raise funds. I\u0027ll leave a note when that happens so that everyone knows I haven\u0027t just given up and gone home.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway, first pictures in the next post!\n\u003C/p\u003E\n"},{"CreatedByName":"Opus_723","CreatedById":170390,"CreatedDateTime":"2016-11-12T10:35:48Z","Content":"\n\u003Cp\u003E\nFirst Launch was successful!\n\u003C/p\u003E\n\u003Cp\u003E\nBut first, a bit of context. I\u0027ve never done even a tiny mining operation before, so I slapped together a testbed to make sure I understood how the parts worked. This little ship is Olivine, and I sent it to the Mun. I planned ahead when I started work on Canis Base, so I already had the best ore spot mapped out. This is absolutely the only prior mining experience I have:\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot88.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s15.postimg.org/4zujvlw5n/screenshot88.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nNow, to demonstrate the ridiculous learning curve I\u0027m forcing on myself, here is the crux of my new mining operation: Tower Station.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot93.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s11.postimg.org/54giyfvqb/screenshot93.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n16 large drills, 4 ISRUs, large battery capacity for night-time emergencies, tanks for Liquid Fuel, L\u002BOx mix, and monopropellant so that it can still do some work while the fuel ferries are away, and spacious seating for 29 kerbals, including a fancy cupola so the engineer isn\u0027t too bored.The 4 Senior Docking Ports are meant to be a bit flexible so that docking doesn\u0027t jolt the tower too much, and one of them will be used to attach the solar panel and radiator banks, which will arrive separately. The rest will remain open for the fuel rovers.  I might be biting off more than I can chew, but here we go!\n\u003C/p\u003E\n\u003Cp\u003E\nNow, this thing weighs about 150 tons dry. I have never launched anything close to that into orbit, let alone to the Mun. And I\u0027m doing this in career, so we need to save as much money as possible. I needed something truly massive. And I needed it to be 100% reusable. Can we do it?\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot7.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s16.postimg.org/nu2mw78g5/screenshot7.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot6.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s14.postimg.org/jfeuu90ip/screenshot6.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nYes! HAHA! I\u0027ve never launched anything that massive before. And I\u0027ve never built a reusable launcher before, so this is just fantastic. That is the new Atlas Reusable Heavy Lift System, carrying Tower Station and a disposable skycrane that will land the station on the Mun\u0027s surface. The tug that will take that whole mess to the Mun will come up on the next launch. And yeah, the parachutes are way overkill. I\u0027ll come back to that. For now, we\u0027ve just got to get Tower Station and Bill into orbit...\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot13.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s11.postimg.org/4iurzwv03/screenshot13.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot23.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s12.postimg.org/q3q130lrx/screenshot23.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot25.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s18.postimg.org/vxpxuakjt/screenshot25.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n The Atlas actually makes a surprisingly good gravity turn. I\u0027m ridiculously pleased with it so far. Now, we part ways with Tower Station and Bill. The Atlas itself is entirely remote controlled.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot32.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s13.postimg.org/qgdvjvfc7/screenshot32.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot33.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s18.postimg.org/gnk5amkft/screenshot33.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nBill will stay in a parking orbit until we bring the ferry up. Our challenge now is to... *gulp*.... land the Atlas. It\u0027s designed for a powered landing, and it even has to burn a little bit on reentry to keep it at safe speeds since the central docking port is unshielded, so this is a bit tricky. The insane number of parachutes is not strictly necessary, but I\u0027m honestly still learning how to land this thing, so the margin of error is appreciated. Here we go!\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot64.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s17.postimg.org/gyfd7e4gv/screenshot64.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot65.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s22.postimg.org/7cemlebpt/screenshot65.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot67.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s21.postimg.org/60v93qrg7/screenshot67.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot75.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s14.postimg.org/yy8reut1d/screenshot75.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot86.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s14.postimg.org/wu9wk8qkx/screenshot86.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nIT WOOORKED!!! Phew! I\u0027m ecstatic that the first mission was a success! But Atlas will undergo some slight improvements:\n\u003C/p\u003E\n\u003Cp\u003E\n1.) We\u0027ll add a couple of small solar panels. The batter drained substantially as I waited for the orbit to come back around to the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E. I set \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E to retrograde the whole way down, and I ended up doing a couple of unnecessary burns just to keep the battery charged. \n\u003C/p\u003E\n\u003Cp\u003E\n2.) The upper parts of the arms will get some struts. The Atlas performed beautifully in flight, but the landing sent those arms wobbling more than I like.\n\u003C/p\u003E\n\u003Cp\u003E\n*EDIT* 3.) I just realized looking at the pictures that the Mammoth engines are on crooked!\u003Cimg alt=\u0022:confused:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 title=\u0022:confused:\u0022\u003E We\u0027ll have to fix that too.\n\u003C/p\u003E\n\u003Cp\u003E\nWith these tweaks I think I will be using this lifter for a long time. I recovered about half of the funds from this launch, and most of what I spent was just the dry mass of the station. (Still cost a lot though *grumble*).\n\u003C/p\u003E\n\u003Cp\u003E\nThat\u0027s it for now. The next mission will be to bring up the ferry that will take Tower Station to the Mun. This project has a long way to go...\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-11-13T01:16:45Z\u0022 title=\u002211/13/2016 01:16  AM\u0022 data-short=\u00227 yr\u0022\u003ENovember 13, 2016\u003C/time\u003E by Opus_723\u003C/strong\u003E\n\u003Cbr\u003EReplace Picture\n\u003C/span\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2016-11-12T22:52:25Z","Content":"\n\u003Cp\u003E\nWelcome aboard!  I wish you well in your endeavors.\n\u003C/p\u003E\n"},{"CreatedByName":"Opus_723","CreatedById":170390,"CreatedDateTime":"2016-11-14T02:37:41Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222848449\u0022 data-ipsquote-contentid=\u0022151911\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221478991145\u0022 data-ipsquote-userid=\u002269507\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 11/12/2016 at 2:52 PM, Geschosskopf said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWelcome aboard!  I wish you well in your endeavors.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThanks! I\u0027m actually having a lot of fun documenting the process. I\u0027ve never done a long-term project like this, and I hope the mission report will keep me motivated long enough to finish.\n\u003C/p\u003E\n\u003Cp\u003E\nSecond launch complete! Today we brought up the Charon Class Ferry, along with Jeb and Val. Val is actually going to pilot Tower Station down to the Mun\u0027s surface with Bill, but I hadn\u0027t decided which pilot was going yet when I launched. But here she is.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot102.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s17.postimg.org/rcbvqtf27/screenshot102.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot108.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s11.postimg.org/rb81pfttf/screenshot108.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot118.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s21.postimg.org/aneu9yvc7/screenshot118.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nCharon was designed to take payloads as far out as Jool, and after Operation Underhill is complete it will serve as a workhorse for more exotic missions. It is also my first attempt at a permanently skybound ship, and it will rely on the performance of my new fuel infrastructure. Since it was designed for interplanetary cargo, it should be able to tug a far more massive payload to the Mun. In fact, I haven\u0027t docked it to Tower Station yet because I\u0027ve decided, after a bunch of calculations, that Charon will be bringing several more pieces of Operation Underhill on its first trip, which I\u0027ll have to squeeze in front of the mining tower itself. If I\u0027m correct, we can just barely bring enough equipment along to actually start the mining operation and refuel Charon in Munar orbit before returning to Kerbin for more equipment. This will save me several trips and a planned fuel launch that I think I can skip now. I hope this works.\n\u003C/p\u003E\n\u003Cp\u003E\nBrief update on the Atlas: It now comes with slightly fewer parachutes! It\u0027s also getting easier to land now. I think I can even take some more off. Tower Station and its skycrane was the heaviest payload and Atlas was pushed to its fuel limits. The rest of Operation Underhill should go pretty smoothly, as long as I keep managing to find flat ground to land on. Upper arm struts seem to have eliminated the landing wobble. But of course, the important thing is that it looks cool.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot119.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s22.postimg.org/yvyj350nl/screenshot119.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot130.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s14.postimg.org/br69q7o69/screenshot130.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cu\u003ENext Mission:\u003C/u\u003E\u003C/strong\u003E Atlas will bring up the solar array and radiator bank for Tower Station, as soon as I decide how to secure them for launch.\n\u003C/p\u003E\n"},{"CreatedByName":"Star Treader","CreatedById":170249,"CreatedDateTime":"2016-11-14T08:31:21Z","Content":"\n\u003Cp\u003E\nThis looks pretty good!\n\u003C/p\u003E\n"},{"CreatedByName":"Opus_723","CreatedById":170390,"CreatedDateTime":"2016-11-18T10:43:52Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222849968\u0022 data-ipsquote-contentid=\u0022151911\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221479112281\u0022 data-ipsquote-userid=\u0022170249\u0022 data-ipsquote-username=\u0022Star Treader\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 11/14/2016 at 0:31 AM, Star Treader said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThis looks pretty good!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThanks! I\u0027m still terrified I\u0027m gonna get to the Mun and realize that I screwed up a vital part.... *shudder*.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway, onward and upward!\n\u003C/p\u003E\n\u003Cp\u003E\n----\n\u003C/p\u003E\n\u003Cp\u003E\nPresenting the new and improved Atlas Reusable Heavy Launch System! Now with only....Um....\u003Cspan style=\u0022font-size:9px;\u0022\u003Efifty-two parachutes.\u003C/span\u003E\u003Cspan style=\u0022font-size:11px;\u0022\u003E *\u003C/span\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EAhem.*\u003C/span\u003E\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot156.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s3.postimg.org/79ll7alvn/screenshot156.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12px;\u0022\u003ESo I\u0027m not a \u003Cem\u003Ebrave\u003C/em\u003E person. But that\u0027s 16 less than I used on the first launch! Anyway, the solar array and the radiator bank (AKA the S\u002BR Utilities Package) are kind of funky looking, awkward things. I designed the docking ports on Tower Station and the yet-to-be-debuted fuel rovers around each other, and I didn\u0027t feel like adding any more complications, so I just stripped the fuel rover down to its skeleton to make dockable equipment beds. It\u0027s not pretty, but it works. They were also tricky to load up because they don\u0027t weigh the same. I couldn\u0027t fit them vertically, so they had to go lengthwise, and I messed around offsetting girders until I got the center of mass just right. Strapped to Atlas and ready to go!\u003C/span\u003E\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot157.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s16.postimg.org/gx0p1iolh/screenshot157.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot158.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s15.postimg.org/bmf3s6r7v/screenshot158.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot165.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s12.postimg.org/bkjqxsdj1/screenshot165.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot179.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s17.postimg.org/bfuk3mlhb/screenshot179.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nCharon will come pick that up in a little bit. But we have more important news. I TOTALLY LANDED A SHIP AT THE \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E YOU GUYS!!!!!\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot191.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s16.postimg.org/i4m5wezt1/screenshot191.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot193.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s11.postimg.org/a12pdmvlf/screenshot193.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nYeah, I\u0027ve never done that before, with any ship. I burned way too much fuel to make that happen, so I lost some funds. BUT IT WAS WORTH IT! All the kerbals are like, \u0022what\u0027s that sound?\u0022 Then the ATLAS LANDS OUTSIDE THEIR WINDOWS ON THE GRASS and they\u0027re like \u0022whaaat?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n*AHEM*\n\u003C/p\u003E\n\u003Cp\u003E\nIt was also the first night landing of the Atlas, so that is a significant milestone, and will be noted accordingly.\n\u003C/p\u003E\n\u003Cp\u003E\nAlright, that was silly, but I was excited. It\u0027s time to get back to work. Jeb and Val rendezvous\u0027d with the utilities package and carefully docked with it.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot200.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s21.postimg.org/8z5v4fc5z/screenshot200.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot208.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s11.postimg.org/y05mtuv9f/screenshot208.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot213.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s21.postimg.org/60b1y2aav/screenshot213.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot218.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s14.postimg.org/wa6moin8h/screenshot218.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot222.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s21.postimg.org/3zcrub66f/screenshot222.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot228.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s13.postimg.org/sptbai5nb/screenshot228.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nThat\u0027s it for now! Next I need to dock this whole mess to Tower Station. It\u0027s getting awfully heavy, so I don\u0027t think that will be fun. But at least I included some \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E thrusters on the girders in the utilities payload so that my thrust isn\u0027t horrible unbalanced.\n\u003C/p\u003E\n"},{"CreatedByName":"Opus_723","CreatedById":170390,"CreatedDateTime":"2016-11-19T09:57:44Z","Content":"\n\u003Cp\u003E\nJeb, Val and Bill worked through the night to dock the Charon ferry and its payload to Tower Station. The ferry and utilities weigh almost 300 tons and Tower Station just over 200, so that was... tedious. And of course, only the heavier one had any \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E or a pilot. Bill helpfully \u003Cem\u003Epointed\u003C/em\u003E the tower toward the ferry as best he could though.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot234.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s17.postimg.org/fi8jknhvj/screenshot234.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot247.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s13.postimg.org/54zlmtfrr/screenshot247.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot250.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s17.postimg.org/6t5d05o8f/screenshot250.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot252.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s11.postimg.org/nf8q8hdrn/screenshot252.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot254.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s18.postimg.org/sfq2juqmh/screenshot254.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAt last, we\u0027ve got everything we nee...\n\u003C/p\u003E\n\u003Cp\u003E\nBut wait! I said we were going to refuel Charon at the Mun! How are we going to get the fuel back up to Charon? Well, we\u0027re bringing one more thing along, but it doesn\u0027t need to hitch a ride. Introducing the Sisyphus Class Fuel Ascent Rover:\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot290.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s18.postimg.org/trs5hssqh/screenshot290.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot262.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s14.postimg.org/rjyd499z5/screenshot262.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot271.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s18.postimg.org/uion2z9mh/screenshot271.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThis is Sisyphus L, a remote-controlled rover/lifter which will lift 35,000 units of liquid fuel and 3,000 units of monopropellant to munar orbit on each ascent. It\u0027s the first of a  pair. The other will carry liquid-oxygen mix and even more monopropellant. For the initial setup of the mining station and fuel depots, though, we\u0027ll just need liquid fuel for the heavy-duty tugs, so Sisyphus L will do for now. Since it\u0027s meant to lift its heavy full tanks to munar orbit, it has plenty of \u003Cabbr title=\u0022Delta-V\u0022\u003Edv\u003C/abbr\u003E to get to the Mun on its own with empty tanks. So it\u0027ll just follow behind Charon.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot282.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s14.postimg.org/n81wmjlj5/screenshot282.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot281.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s11.postimg.org/6kmmh4rur/screenshot281.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nYeah, I didn\u0027t really need to rendezvous them, but I couldn\u0027t resist a group photo.\n\u003C/p\u003E\n\u003Cp\u003E\nSo here we are, with Phase I of Operation Underhill assembled and ready to burn. \u003Cstrong\u003EOn to the Mun.\u003C/strong\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Opus_723","CreatedById":170390,"CreatedDateTime":"2016-11-30T07:46:03Z","Content":"\n\u003Cp\u003E\nMeh...\n\u003C/p\u003E\n\u003Cp\u003E\nI apologize for the cliffhanger, but real life has gotten in the way. First holidays, now grad school applications. And I need to do some math before I start the munar burn, since I want to try a simple-but-sorta-neat formula that I derived for low thrust maneuvers. And with all that weight behind Charon, this is the perfect opportunity.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, unfortunately, the mission is on pause until I make some progress on my applications.\n\u003C/p\u003E\n"},{"CreatedByName":"Cherubiel","CreatedById":164793,"CreatedDateTime":"2016-11-30T08:34:37Z","Content":"\n\u003Cp\u003E\nHey, this looks great! I like the reusable launch system you are using. Very efficient and finances will be thankful I guess. Will be looking forward to future plans.\n\u003C/p\u003E\n\u003Cp\u003E\nCongratulations on the successful landing right at \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E as well \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Opus_723","CreatedById":170390,"CreatedDateTime":"2016-12-10T11:17:54Z","Content":"\n\u003Cp\u003E\nOkay! I finally got time to make some progress here, so here we go!\n\u003C/p\u003E\n\u003Cp\u003E\nThe Charon ferry was originally designed to take moderate payloads to other planets, but its inaugural mission today is the bring a 323-ton payload to low munar orbit. But since it was built for distance rather than thrust, it has a problem here. With Tower Station, its skycrane, and the equipment beds in tow, Charon can only accelerate at 1.5m/s^2. That\u0027s sort of impractical for getting a Mun intercept efficiently. I could boost to a higher parking orbit, where the 10-minute burn I need would take a smaller fraction of the orbital period, but it would be more fuel-efficient if I could still do it straight from my 74km orbit. I could just waste the fuel, since Charon is such a beast, but I wanted to work out this trick so that I could be assured of using it in the future if I ever need it. So here\u0027s my solution.\n\u003C/p\u003E\n\u003Cp\u003E\nI split the long burn into 10 burns less than a minute long, so that I was always pretty much on my periapsis. The problem with this is that the Mun swings around way further than usual while you\u0027re going on all of those progressively longer intervening orbits. So where do you point the apoapsis to be sure you\u0027ll hit the Mun in the end? I majored in physics, so I was able to dust out the cobwebs in my brain to derive a formula for the new period of an orbit based on the delta-v you add. From there it was just a matter of making a quick excel spreadsheet to calculate the periods of all the successive orbits and add them up to get the total time of the maneuver. Then I could compare that to the Mun\u0027s orbital period to find the angle I needed to lead the Mun by. Turned out I needed to aim 217 degrees ahead of the Mun.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Excel.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s17.postimg.org/om0m6p8lr/Excel.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nSo, hoping I hadn\u0027t made a mistake, I took off. I\u0027m ashamed to say it, but after all of that math, I just eyeballed the angle. I couldn\u0027t figure out how to measure it quantitatively in stock, so this was pretty nervewracking. Here we are leaving the Sisyphus rover behind on the first burn:\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot377.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s23.postimg.org/5trn3k5gr/screenshot377.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot379.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s24.postimg.org/ze12mkp51/screenshot379.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nThen it was a rather boring task of orbit, burn, orbit, burn, repeat. The orbit doesn\u0027t change much for the first five burns or so, and the Mun hardly moves, but we do make some progress eventually....\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot380.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s29.postimg.org/7x660yrfr/screenshot380.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot382.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s18.postimg.org/kxfzatjop/screenshot382.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot386.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s29.postimg.org/terf91dqv/screenshot386.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot387.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s24.postimg.org/c3mrs0nzp/screenshot387.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot388.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s23.postimg.org/93484md9n/screenshot388.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot391.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s24.postimg.org/ullvt5dt1/screenshot391.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nAnd there\u0027s my Mun intercept! The math all came out perfectly! Sure enough, when I came back around to the last burn node, the Mun was sitting right on the horizon where I needed it to be!\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot397.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s28.postimg.org/jpepde0pp/screenshot397.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nIn fact, the math worked almost too well. At least the course correction was obvious enough:\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot399.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s18.postimg.org/ecf3zhpqx/screenshot399.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot405.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s27.postimg.org/vqhulpmmb/screenshot405.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nFinally, we brought Sisyphus L off the starting line as well.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot414.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s17.postimg.org/tk1wbh2f3/screenshot414.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot415.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s29.postimg.org/jm3sxuw2v/screenshot415.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nThat was quite a lot of report for just the intitial burn to the Mun, so I\u0027m going to break this post here and write up the rest of the journey in a minute.\n\u003C/p\u003E\n"},{"CreatedByName":"Opus_723","CreatedById":170390,"CreatedDateTime":"2016-12-10T11:55:51Z","Content":"\n\u003Cp\u003E\nWith Val doing all of the piloting, Jeb was going a little stir-crazy on the long trip, so he went on an EVA to inspect the payload and serve as a scale for glamour shots.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot423.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s27.postimg.org/je2w2zknn/screenshot423.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot424.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s28.postimg.org/orvnnp6q5/screenshot424.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot426.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s28.postimg.org/hz8pu8jkd/screenshot426.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot430.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s28.postimg.org/ggybtyhot/screenshot430.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot435.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s27.postimg.org/8auuot83n/screenshot435.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot442.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s23.postimg.org/s66upxdjf/screenshot442.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nWhile Jeb completed that \u003Cem\u003Every important job\u003C/em\u003E, Val was busy preparing for the capture maneuver as Charon approached the Mun, which came off perfectly.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot446.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s27.postimg.org/qf0g1hi1v/screenshot446.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot449.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s24.postimg.org/adj33xnxx/screenshot449.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot452.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s28.postimg.org/n3gwsl1wt/screenshot452.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot463.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s24.postimg.org/l3h60uyo5/screenshot463.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nSisyphus L wasn\u0027t far behind, and it had enough thrust to burn directly into its final 20km polar orbit.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot468.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s29.postimg.org/hbg4xz4pz/screenshot468.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot471.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s29.postimg.org/d5e486tsn/screenshot471.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot478.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s29.postimg.org/kuy435wfr/screenshot478.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot497.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s30.postimg.org/5jwwhj9xt/screenshot497.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nFinally, Charon completed its capture orbit and performed one final burn to lower the apoapsis into a 20km parking orbit.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot483.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s27.postimg.org/the0g3dsz/screenshot483.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot485.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s24.postimg.org/hheaos9g5/screenshot485.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot494.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s18.postimg.org/u1d45tzo9/screenshot494.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nThat\u0027s it for now! Tower Station and Sisyphus L will remain aloft in their parking orbits until the final landing site, which has already been scouted out since I am in the process of constructing a base there, comes around to the day side of the Mun so that Val and Bill can land with more precision. We\u0027re finally getting to the exciting stuff!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cu\u003ENext Mission:\u003C/u\u003E  Landing Tower Station.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-12-10T18:31:30Z\u0022 title=\u002212/10/2016 06:31  PM\u0022 data-short=\u00227 yr\u0022\u003EDecember 10, 2016\u003C/time\u003E by Opus_723\u003C/strong\u003E\n\u003Cbr\u003EAdded next mission\n\u003C/span\u003E\n"},{"CreatedByName":"Cherubiel","CreatedById":164793,"CreatedDateTime":"2016-12-11T20:53:55Z","Content":"\n\u003Cp\u003E\nVery nice! You did maths and everything. It truly is a shame KSP doesn\u0027t have some tool to get an ejection and phase angle readout. Even when using a launch window planner to get everything down to the fourth decimal, I have to eyeball the angles.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway, keep on moving all that mass.\n\u003C/p\u003E\n"},{"CreatedByName":"Opus_723","CreatedById":170390,"CreatedDateTime":"2016-12-14T09:10:02Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222884003\u0022 data-ipsquote-contentid=\u0022151911\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221481489635\u0022 data-ipsquote-userid=\u0022164793\u0022 data-ipsquote-username=\u0022Cherubiel\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 12/11/2016 at 0:53 PM, Cherubiel said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nVery nice! You did maths and everything. It truly is a shame KSP doesn\u0027t have some tool to get an ejection and phase angle readout. Even when using a launch window planner to get everything down to the fourth decimal, I have to eyeball the angles.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway, keep on moving all that mass.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThanks! I have to admit, I\u0027m considering that I should probably have gone higher thrust, if only to save myself a lot of tedium. This landing was kind of adhoc, and I was afraid I wouldn\u0027t be able to kill my velocity fast enough.\n\u003C/p\u003E\n\u003Cp\u003E\nSpeaking of which...\n\u003C/p\u003E\n\u003Cp\u003E\nTHE LANDING!\n\u003C/p\u003E\n\u003Cp\u003E\nTower Station will be the resource extraction complement to my existing Mun base, Canis Base. Canis Base was actually my very first attempt at base building, and I started it shortly after my first Mun landing. It\u0027s not the most elegant thing, but I think the first modules came out pretty good for a first attempt. The resident scientist Sany Kerman has provided a considerable amount of science since arriving at the base. Canis base unfortunately never got beyond a science lab and a communications/power generation module. My construction method relied on disposable rovers, which quickly accumulated into a small junkyard since I was also using separate connectors between modules. I decided that I needed to rethink my methods before the debris got out of hand, and left the base unfinished while I worked on other projects (my first Duna landing, then Operation Underhill) for awhile.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot498.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s27.postimg.org/qoyy9o1v7/screenshot498.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nOne of my next projects after I set up Tower Station and its associated fuel infrastructure is to come back and give Canis Base the attention and expansion it deserves. After transitioning to a new construction method while grandfathering in these initial modules, I plan to develop it into a glorious hub for all Mun exploration, commerce, and science. But that\u0027s all a project for another day. Today is Tower Station\u0027s day to shine.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot559.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s29.postimg.org/866wc71vr/screenshot559.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot562.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s29.postimg.org/hjpl1x6g7/screenshot562.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nThe landing, as I said, was tricky. I couldn\u0027t do anything close to a suicide burn, due to the low acceleration the heavy mass and weak thud engines. I ended up sort of frantically setting one maneuver node after another, burning off about 100 m/s at a time while moving my projected landing closer and closer to Canis Base. I wanted to keep Tower Station at a remove from the science base, so the landing didn\u0027t have to be super precise. We can\u0027t have the noise from the mining equipment disturbing anyone\u0027s sleep, after all (and a bit of distance might help frame rates in the future as well). But I am surprised and pleased to say that Val brought this beast to a gentle landing less than 500m from the base proper!\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot565.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s23.postimg.org/k61pb936j/screenshot565.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot569.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s23.postimg.org/d8w6axhor/screenshot569.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot578.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s29.postimg.org/ft16ipnrb/screenshot578.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot582.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s27.postimg.org/onr1jljlf/screenshot582.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot590.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s24.postimg.org/oemppyo9x/screenshot590.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nAll that was left to do was detach the sky crane and send it off to a glorious crash landing.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot602.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s24.postimg.org/l1q8auxmt/screenshot602.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot607.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s30.postimg.org/eqpfxpqqp/screenshot607.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot608.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s27.postimg.org/3sp8u9d4z/screenshot608.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot616.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s30.postimg.org/ivqdo2asx/screenshot616.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nNow that fancy cupola actually has a view! Also, I brought that old mining test Olivine over a bit closer for a proper comparison. So far, I feel quite proud of my second attempt at mining in KSP!\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot621.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s23.postimg.org/o44jc5f2z/screenshot621.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot623.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s27.postimg.org/hg3woi9ub/screenshot623.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nFinally, Valentina hopped out of the cupola, stretched her legs, and then jetted over to settle into Canis Base with Sany and Taniella until the next crew shift arrives and she can catch a ride back to Kerbin. Bill, on the other hand, is going to be running Tower Station until we get a proper engineer training program going. I also discovered that Tower Station lives up to its name, and actually looks quite impressive on the horizon from Canis Base.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot625.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s28.postimg.org/h44wk5ye5/screenshot625.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot628.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s30.postimg.org/fsdn4cphd/screenshot628.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot631.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s27.postimg.org/zdszjsbwj/screenshot631.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot636.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s23.postimg.org/3vsidwkaz/screenshot636.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot638.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s27.postimg.org/f3ajd984j/screenshot638.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot642.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s24.postimg.org/sd4j7rqmt/screenshot642.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot647.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s27.postimg.org/qlqji9mmr/screenshot647.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cu\u003ENext Mission:\u003C/u\u003E\u003C/strong\u003E We\u0027re almost ready to fire up the mining operation! Tower Station still needs its full accoutrement of radiators and solar panels before we can safely turn on those drills and ore processors. The equipment beds are still in orbit with Jeb, so we have two more landings before Operation Underhill can officially break ground. Nonetheless, finally landing the core of the operation on the Mun\u0027s surface is a huge milestone, and I want to take the moment to thank everyone who has been following along! Whether you\u0027ve commented, liked a post, or just checked in without making your presence known, I\u0027ve enjoyed writing this mission report for you all, and I probably wouldn\u0027t have stuck with this project without it. I\u0027m still pretty new to KSP and I know there are far more polished and ambitious projects on these forums, so thanks for stopping by to read mine anyway!\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-12-14T09:20:12Z\u0022 title=\u002212/14/2016 09:20  AM\u0022 data-short=\u00227 yr\u0022\u003EDecember 14, 2016\u003C/time\u003E by Opus_723\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tiber9","CreatedById":144299,"CreatedDateTime":"2016-12-14T17:42:36Z","Content":"\n\u003Cp\u003E\nVery impressive and precise low thrust landing! And, from my perspective, this is totally a well organized and ambitious project, so thanks for documenting it. \n\u003C/p\u003E\n"},{"CreatedByName":"Opus_723","CreatedById":170390,"CreatedDateTime":"2016-12-17T03:48:11Z","Content":"\n\u003Cp\u003E\nAssembly is coming along nicely. Jeb made a small adjustment to Charon\u0027s orbit to account for the rotation of the Mun since Tower Station landed. After that, he undocked the large radiator bank that will be needed to keep those 16 large drills and 4 \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E nice and cool.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot679.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s23.postimg.org/kswqxg5m3/screenshot679.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot684.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s27.postimg.org/be1x6p0ir/screenshot684.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot686.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s27.postimg.org/r671i247n/screenshot686.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nThese equipment beds, as I mentioned before, are just the stripped down skeletons of the Sisyphus class fuel lifter, so they\u0027re tremendously overbuilt for a Mun landing. I didn\u0027t even fill those tanks halfway. I just calculated how much fuel I needed to get the \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E for a Mun landing and filled them up that much plus a bit extra. They could be more elegant, but after fine tuning the Sisyphus docking ports to line up with Tower Stations ports, I really didn\u0027t want to do all that work again.\n\u003C/p\u003E\n\u003Cp\u003E\nThe upside, though, is that I got a break from all of that low thrust maneuvering and got to do a pretty straightforward Mun landing. These beds are a little spindly, so the wobble at full thrust was a little concerning, but it didn\u0027t end up causing any problems.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot690.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s28.postimg.org/l9coj5qp9/screenshot690.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot692.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s27.postimg.org/xfshdtisj/screenshot692.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot694.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s23.postimg.org/sxge0873v/screenshot694.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot702.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s30.postimg.org/rqe9fb57l/screenshot702.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nThen it was just a short drive over to the station, and we were ready to dock. The largest rover wheels are great for docking, I think, since you can rotate the vehicle in place. If you need to translate laterally, just rotate in place, drive forward a bit, then rotate back. Still, this was a bit more difficult than in my testing on Kerbin since the ground here isn\u0027t perfectly flat. It took a few tries to get the docking ports just right (the largest ports are very picky). I was glad that I made Tower Station\u0027s ports very flexible. The tower was hardly affected by even my most clumsy docking attempts, and the flexibility is probably the only reason I was able to dock at all given the slight slope.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, a bit of a pain, considering that I will have to dock this way every time I want to lift fuel to low munar orbit in the future. But it\u0027s not as awful as I was afraid it might be. And the Sisyphus rovers will lift massive amounts of fuel to orbit. More than I know what to do with, in fact. So I won\u0027t have to do this very often. All things considered, this docking process is something I can live with, and I\u0027ll presumably get better at it over time.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot709.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s30.postimg.org/iaf3g35z5/screenshot709.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot716.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s28.postimg.org/gxcthxc0d/screenshot716.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot720.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s29.postimg.org/njgf4j4nr/screenshot720.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot721.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s23.postimg.org/6zxphqqbv/screenshot721.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot722.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s28.postimg.org/u2tqxd4t9/screenshot722.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot723.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s24.postimg.org/md6jaxjwl/screenshot723.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSo we have our radiator bank! I won\u0027t extend them yet, though, even if we have the battery capacity to run them for quite awhile. We\u0027ll wait until the solar array is attached. Then I\u0027ll unveil Tower Station in all of its glory when we fire up those drills and break ground!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cu\u003ENext Mission:\u003C/u\u003E Landing and attaching the Solar Array\u003C/strong\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Opus_723","CreatedById":170390,"CreatedDateTime":"2016-12-19T08:35:29Z","Content":"\n\u003Cp\u003E\nSame procedure as before: we needed to do a quick orbital adjustment, as the Mun has rotated under us since we landed the radiator bank. Jeb is dealing with an asymmetric payload this time, though. His strategy was to turn on all of the \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E thrusters and slowly throttle up the nukes, making sure he didn\u0027t start to spin out of control. He settled into the sweet spot and it worked out okay.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot739.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s27.postimg.org/d0wmla39f/screenshot739.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot745.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s23.postimg.org/44w5eiihn/screenshot745.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot748.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s30.postimg.org/vz7x30koh/screenshot748.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThen the undocking of the solar array, followed by a straightforward landing (or as straightforward as it gets when piloting a spindly skeleton frame of I-bars with a bunch of engines strapped on).\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot753.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s24.postimg.org/x8qr6npl1/screenshot753.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot754.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s27.postimg.org/jd1l72wyb/screenshot754.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot761.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s28.postimg.org/shusfhgkt/screenshot761.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot763.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s23.postimg.org/59j37yf3f/screenshot763.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot766.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s23.postimg.org/exvxys0vv/screenshot766.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot770.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s23.postimg.org/a8kyao7y3/screenshot770.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot775.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s27.postimg.org/6xsutjb2r/screenshot775.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nThe mobile bed drove on over to Tower Station and proceeded to dock. This time I discovered that shutting down the rear engines and lightly firing the engines closest to the docking port gives me a VERY helpful bit of vertical wiggle. I got a successful dock almost instantly when I tried that, even though I barely moved. I\u0027ll definitely remember that when docking the Sisyphus class rovers.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot782.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s29.postimg.org/ps3qkahjr/screenshot782.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot787.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s24.postimg.org/hi3nljh7p/screenshot787.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot792.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s23.postimg.org/wtu6rh9zf/screenshot792.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot793.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s29.postimg.org/pf80xbxcn/screenshot793.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nAnd the assembly of Tower Station is COMPLETE!!! Bill is ready to break ground!\n\u003C/p\u003E\n\u003Cp\u003E\nBut the grand unveiling deserves its own post! \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Opus_723","CreatedById":170390,"CreatedDateTime":"2016-12-19T09:20:03Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003E*AHEM*\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EBegin initiation sequence.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EExtending Solar Array...\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cimg alt=\u0022screenshot796.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s29.postimg.org/xs75sw7s7/screenshot796.png\u0022 width=\u00221000\u0022\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EActivating Radiator Bank....\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cimg alt=\u0022screenshot805.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s29.postimg.org/vm6otnqw7/screenshot805.png\u0022 width=\u00221000\u0022\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cb\u003EEngaging Drills....\u003C/b\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cb\u003E\u003Cimg alt=\u0022screenshot809.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s28.postimg.org/mypby6aml/screenshot809.png\u0022 width=\u00221000\u0022\u003E\u003C/b\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cb\u003EFiring up Fuel Processors....\u003C/b\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cb\u003E\u003Cimg alt=\u0022screenshot812.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s24.postimg.org/3luoszgh1/screenshot812.png\u0022 width=\u00221000\u0022\u003E\u003C/b\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cb\u003ETower Station online! Operation Underhill has broken ground!!!\u003C/b\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cb\u003E\u003Cimg alt=\u0022screenshot817.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s27.postimg.org/6wv33t8zn/screenshot817.png\u0022 width=\u00221000\u0022\u003E\u003C/b\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWe did it!!! Bill has banged on all the right pipes and the mining equipment is creating more fuel than I can handle! In less than six in-game hours, the station filled all of its on-site tanks. That\u0027s 4 orange tanks of L\u002BOx mix, an additional 10,000 units of liquid fuel, and 4 of the largest monopropellant tanks. It also filled 9 small ore tanks which are on standby in the lower deck. All of that in less than six hours, and I only have a level 3 engineer. Once I train up a level 5, this station is going to be an absolute dream to work with.\n\u003C/p\u003E\n\u003Cp\u003E\nYou can see all of the resource capacities in the upper right corner of this shot:\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot821.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s24.postimg.org/8mhegbl0l/screenshot821.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nBy the way, I also do love the view from Canis Base now:\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot823.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s28.postimg.org/dfik4sw19/screenshot823.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBut all of that capacity is just for local emergencies on the Mun and to keep Bill from getting too bored in between fuel ascents. It will be dwarfed by what we can accomplish by docking the Sisyphus class rovers. Our next project, now that Tower Station is operational, will be to attempt our first orbital refuel. Charon could do with topping off after lugging all that mass to the Mun. After all, Jeb has more work to do. Operation Underhill is just getting started.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ENext Mission: Landing and Fueling Sisyphus L\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-12-21T23:14:07Z\u0022 title=\u002212/21/2016 11:14  PM\u0022 data-short=\u00227 yr\u0022\u003EDecember 21, 2016\u003C/time\u003E by Opus_723\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Opus_723","CreatedById":170390,"CreatedDateTime":"2016-12-21T23:21:22Z","Content":"\n\u003Cp\u003E\n\u003Cu\u003EQuick update:\u003C/u\u003E Tower Station was very nearly destroyed by the almighty Kraken last night. Thankfully Bill is an accomplished student of Autostrut, and with quick thinking he was able to calm the Kraken\u0027s wrath before the station was torn apart by rogue gravitational waves. Tower Station is unharmed.\n\u003C/p\u003E\n\u003Cp\u003E\nThe moral of the story kids, is that the kraken doesn\u0027t like spindly little I-beam skeletons with lots of wobbly solar panels attached, and you should autostrut them BEFORE landing such things (and docking them to even more such things with part counts in the hundreds) on the Mun.\n\u003C/p\u003E\n\u003Cp\u003E\nEverything appears perfectly functional now, though. A real update will come soon.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-12-21T23:22:10Z\u0022 title=\u002212/21/2016 11:22  PM\u0022 data-short=\u00227 yr\u0022\u003EDecember 21, 2016\u003C/time\u003E by Opus_723\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Opus_723","CreatedById":170390,"CreatedDateTime":"2016-12-27T07:18:06Z","Content":"\n\u003Cp\u003E\nHere we go: our first refuel mission.\n\u003C/p\u003E\n\u003Cp\u003E\nSisyphus L descended from its parking orbit to a smooth Mun landing. Fairly routine. Looks neat with all the thrusters going though.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot843.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s23.postimg.org/l6dyjmf4b/screenshot843.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot850.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s28.postimg.org/v3k5pa1rx/screenshot850.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nThen we drove on over to Tower Station and docked for the fuel-up. This is thankfully getting much quicker after the practice I got with the equipment beds. That and I discovered the \u0022Aim Camera\u0022 feature which makes the alignment WAY easier as you can see.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot858.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s28.postimg.org/p3ssgvhst/screenshot858.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot862.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s29.postimg.org/tpw7hu84n/screenshot862.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot863.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s29.postimg.org/odljxylnr/screenshot863.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot876.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s24.postimg.org/gjwhadfyt/screenshot876.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nAfter a very painless time warp, we had 35,000 units of liquid fuel ready to put into orbit. We also topped off the chemical rockets with L\u002BOx mix and the monoprop tanks as well. Sisyphus was now quite heavy. I was a bit nervous to see how well I could actually control it in flight. I waited for the launch window to meet up with Charon, and we attempted our first laden ascent! Sorry the first liftoff images are dark, I was forced to do a night ascent to meet Charon properly. We quickly got high enough to see the Sun and take some better shots, though. We ran into Charon across the terminator on the day side.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot882.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s29.postimg.org/az028xi3b/screenshot882.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot884.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s29.postimg.org/5at9axhon/screenshot884.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot887.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s27.postimg.org/5q3ambx5f/screenshot887.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot890.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s27.postimg.org/uadrc8fc3/screenshot890.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot893.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s24.postimg.org/v6fkmbgd1/screenshot893.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nSurprisingly for its mass, docking the Sisyphus to Charon was rather painless. The \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E seems nicely balanced.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot894.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s24.postimg.org/yhu2h4yed/screenshot894.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot897.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s28.postimg.org/cvopgkzst/screenshot897.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot900.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s27.postimg.org/ane1idx6r/screenshot900.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot901.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s27.postimg.org/dtis9bn0j/screenshot901.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot904.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s28.postimg.org/rqw9pt6q5/screenshot904.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot907.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s24.postimg.org/4zi9z8ukl/screenshot907.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot909.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s29.postimg.org/kzliqyvuf/screenshot909.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nAnd there we go! We proceeded to refuel Charon completely! This marks a milestone for me. I have, for the first time, mined ore on a celestial body, processed it, and transferred the fuel to a ship in orbit!\n\u003C/p\u003E\n\u003Cp\u003E\nSisyphus L still has quite a bit of fuel left over, so it will simply stay in orbit for now, serving as a temporary depot until more permanent infrastructure can be put into place. Charon, on the other hand, has to get back to Kerbin. Jeb\u0027s got work to do yet.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot912.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s27.postimg.org/6f3w21i6r/screenshot912.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot913.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s30.postimg.org/do86xg48x/screenshot913.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot917.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s23.postimg.org/k8p4t4myj/screenshot917.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot918.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s29.postimg.org/eiavqdg2f/screenshot918.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot930.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s29.postimg.org/y0awu0dd3/screenshot930.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot938.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s29.postimg.org/lmxad5cpj/screenshot938.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nJust a few housekeeping tasks left. This is a fun one though: I don\u0027t actually need that set of girders that the equipment beds were attached to anymore, so we should really dispose of it. I meant to deorbit it at the Mun and just slam them into the surface several posts ago. But then it occurred to me that Charon would be heading back to Kerbin, and I thought of something much more dramatic.\n\u003C/p\u003E\n\u003Cp\u003E\nDirect reentry from the Mun.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot940.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s24.postimg.org/wf7cmmoid/screenshot940.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot943.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s29.postimg.org/pj7hszhdj/screenshot943.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot945.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s24.postimg.org/9x30pvaz9/screenshot945.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot946.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s29.postimg.org/pzsmgl4c7/screenshot946.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot948.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s28.postimg.org/7lg0qm6d9/screenshot948.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot951.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s28.postimg.org/b2p0dt2t9/screenshot951.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot952.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s23.postimg.org/b6ucygrsb/screenshot952.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot955.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s23.postimg.org/y60rfmbd7/screenshot955.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nWe got some nice fireworks off of that one! I think its important to bring a few things along on a mission that are \u003Cem\u003Esupposed\u003C/em\u003E to blow up. It helps Jeb stave off the temptation to blow up the important equipment and/or himself.\n\u003C/p\u003E\n\u003Cp\u003E\nMeanwhile, Charon adjusted into a \u003Cem\u003Enon\u003C/em\u003E-deadly orbit and performed a periapsis burn to get its apoapsis away from the Mun\u0027s orbit. Jeb then took one more long-ish orbit out in order to adjust the inclination efficiently in order to get a nice equatorial orbit. One more burn and Charon is now settled into a tidy 120km parking orbit around Kerbin, ready to pick up the next payload when its ready.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot963.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s29.postimg.org/oaxuvvahj/screenshot963.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nAlright everyone! This concludes \u003Cspan style=\u0022font-size:14px;\u0022\u003EPhase I\u003C/span\u003E of Operation Underhill. We have completed Tower Station and broken ground! Our mining operation is humming along nicely, and we have tested every component of the system. Our space program now has the proven infrastructure and capability to refuel liquid-only ships in Munar orbit, provided they have a large docking port. This alone should be extraordinarily useful to our future endeavors.\n\u003C/p\u003E\n\u003Cp\u003E\nBut we\u0027re not done yet!\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ll be taking a short-ish break from this mission report in order to raise funds for the next phase of Operation Underhill. But as soon as the funds are ready, we\u0027ll begin \u003Cstrong\u003E\u003Cu\u003EPhase II\u003C/u\u003E\u003C/strong\u003E!\n\u003C/p\u003E\n\u003Cp\u003E\nPhase II centers on the construction of \u003Cstrong\u003ELupus Station\u003C/strong\u003E, an orbital Mun fuel depot and shipyard. It will be the orbital complement to Canis Base, serving as an entry hub for all visitors to the Mun, a launch point for interplanetary travel, and as the munar fuel reservoir for Tower Station\u0027s mining operations. Thanks to everyone who has followed this mission report so far, I hope you\u0027ve enjoyed it!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Opus_723","CreatedById":170390,"CreatedDateTime":"2017-01-27T21:09:25Z","Content":"\n\u003Cp\u003E\nQuick update:\n\u003C/p\u003E\n\u003Cp\u003E\nContracts are all wrapped up! I snatched up a bunch of Ike contracts at once, then sent a miner and a scanner to Ike to gather some ore, do some gravity scans, and test some parts. I also rescued a couple of kerbals in Kerbin\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E so that we have enough crew to keep all of the upcoming infrastructure occupied.\n\u003C/p\u003E\n\u003Cp\u003E\nI had tons of money, so I also set up a relay system that gets me a workable signal in Duna\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E for all of my old probes with 5k antennas, sent my first ever ion-drive probe to Dres to collect a bunch of science, and finished upgrading my runway and the astronaut complex. After all of that, I still have over 3 million funds left in the bank, so Phase II of Operation Underhill should have all of the funding it needs.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m gonna give the operations checklist a once-over and make sure I\u0027ve got Lupus Station set up the way I want it. Once I\u0027m confident in the plan, (and done toying around with the new plane parts I just unlocked) Phase II will commence!\n\u003C/p\u003E\n"},{"CreatedByName":"Opus_723","CreatedById":170390,"CreatedDateTime":"2017-02-02T04:46:02Z","Content":"\n\u003Cp\u003E\nPhase II has begun!\n\u003C/p\u003E\n\u003Cp\u003E\nThe Lupus Station core isn\u0027t particularly heavy without the fuel pods, but it is very large and unwieldly. Definitely the largest thing I have ever tried to launch into orbit. The original plan was to launch the core in at least two pieces on Atlas and dock them together, then use Charon to tug it to the Mun. I was feeling a little gutsy, however, and designed a new launcher shell around the whole thing, including a small tug. Charon will get a break to go do other things.\n\u003C/p\u003E\n\u003Cp\u003E\nI present to you the launch of Lupus Station!\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot1266.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s29.postimg.org/wxz2slxhj/screenshot1266.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot1269.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s23.postimg.org/uin1dpobf/screenshot1269.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot1272.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s28.postimg.org/61db2b0jh/screenshot1272.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot1274.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s30.postimg.org/jwbvhwxwx/screenshot1274.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot1282.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s30.postimg.org/wzoa0yiox/screenshot1282.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot1292.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s29.postimg.org/aq9w4owp3/screenshot1292.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot1298.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s27.postimg.org/9r2h4rbdf/screenshot1298.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot1304.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s27.postimg.org/r3eb12a43/screenshot1304.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot1302.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s27.postimg.org/wqmp91k7n/screenshot1302.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nThat thing flew WAY better than I expected.\n\u003C/p\u003E\n\u003Cp\u003E\nNow, you probably noticed that the launch stage is pretty intertwined with the space station itself. We have to ditch the fuel tanks without damaging that large ring. The ring will serve as the shipyard for refueling as well as construction. In the future, large interplanetary motherships will be built piece by piece and fueled at Lupus Station, ready to leave Kerbin\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E with little effort. This will also let me get away with low accelerations which are frustrating in Low Kerbin Orbit. \n\u003C/p\u003E\n\u003Cp\u003E\nBut back to the current problem. I fired some seperatrons as well as the Thuds on the orange tank tug, hoping to slip the fuel tanks out of the ring without damaging anything. The large fins force me to go the long way, though (putting the ring in the back near the fins made the launch more aerodynamically stable, so that wasn\u0027t an oversight, just unfortunate). This was absolutely terrifying, and I didn\u0027t quite pull it off... I nicked off one of my struts. I probably could have carefully placed the separatrons around the center of mass of the empty tanks, but I didn\u0027t feel like making the tanks into subassemblies and I just eyeballed it. So the tanks tilted a bit and I lost a strut.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s alright though. I don\u0027t really need that strut. Right? Right.\n\u003C/p\u003E\n\u003Cp\u003E\nRight.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot1320.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s24.postimg.org/vxtxws6et/screenshot1320.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot1325.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s24.postimg.org/gd2m867xx/screenshot1325.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot1327.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s27.postimg.org/ekaqh7n4j/screenshot1327.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot1331.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s23.postimg.org/6303s046z/screenshot1331.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot1333.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s23.postimg.org/ts13syx3v/screenshot1333.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot1358.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s30.postimg.org/evi4tt08h/screenshot1358.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nAnd of course, we were responsible and dumped all of those tanks into the ocean.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot1335.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s24.postimg.org/qgk5bhqhh/screenshot1335.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot1348.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022https://s29.postimg.org/hnp3qzufb/screenshot1348.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nAll in all, a pretty great first mission for Phase II of Operation Underhill! \u003Cspan style=\u0022font-size:8px;\u0022\u003E(except for that one strut)\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003ELupus Station is much further along that I expected it would be by now. Launching the whole skeleton in one go has really accelerated things. It already dwarfs Ouroboros Station, the first and only other station I have built. But it won\u0027t look truly impressive until we attach the fuel pods. This is going to be a massive fuel depot, storing over 100,000 units of rocket fuel, over 175,000 units of liquid only, and over 9000 units of monopropellant ,  so...\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cstrong\u003E\u003Cu\u003ENext Mission:\u003C/u\u003E\u003C/strong\u003E \u003Cstrong\u003ELaunch Lupus Station fuel pods to \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-12-16T08:20:23Z\u0022 title=\u002212/16/2017 08:20  AM\u0022 data-short=\u00226 yr\u0022\u003EDecember 16, 2017\u003C/time\u003E by Opus_723\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Opus_723","CreatedById":170390,"CreatedDateTime":"2017-12-16T07:52:12Z","Content":"\n\u003Cp\u003E\nMy apologies to anyone who was vaguely interested in how this turned out. I was having a lot of fun working on this project, when unfortunately, my laptop got dropped and the screen was destroyed beyond repair. I dejectedly tucked it in a box and made a mental note to try to recover as much of my stuff from it as I could later, as I was getting ready to move to another state around that time.  I\u0027ve still been playing KSP off and on, but it has felt a bit hollow this year. Sandbox has always felt too directionless and overpowered for my taste. I don\u0027t feel like I should go to Jool until I\u0027ve gone to Duna, etc. But I didn\u0027t really have the heart to start over on a new career either. Especially the fundraising. So I was a bit bummed, to say the least.\n\u003C/p\u003E\n\u003Cp\u003E\nIn all the rush of the move (and starting my Physics Ph.D.!) I almost forgot about the old laptop, stuck in a box that sort of went directly to storage without getting unpacked because it was full of semi-useless junk. Today, however, I finally dug out that old laptop, and through a lot of trial and error clicking blindly around the dead parts of the screen, managed to get my old save file onto a thumb drive! I just booted it all up, and it all still seems to work on KSP 1.3! There was a harrowing moment when Tower Station, upon loading, jumped about a meter into the air, but the shock absorption was enough to keep everything together upon landing.\n\u003C/p\u003E\n\u003Cp\u003E\nSo what I\u0027m saying is...\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m back in business! Lupus Station is still orbiting Kerbin, and I expect to resume Operation Underhill shortly, although I might make some tweaks to the original plan since I have become a bit more experienced at the game since earlier this year. Look for an update soon!\n\u003C/p\u003E\n"},{"CreatedByName":"Opus_723","CreatedById":170390,"CreatedDateTime":"2017-12-17T00:49:27Z","Content":"\n\u003Cp\u003E\nAnd now for the first mission of the resumed space program.\n\u003C/p\u003E\n\u003Cp\u003E\nToday we moved Lupus Station to Munar orbit! I think originally I had planned to attach the fuel pods and then drag the whole thing to the Mun. But I\u0027ve decided, upon reviewing the crafts in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E, to redesign the fuel transport system, so I decided to go ahead and bring the station to the Mun while I work on that. I originally planned to have fuel pods that could be picked up by a tug and transferred from one station to another, but I\u0027ve decided that, given the sheer size of the fuel pods, it would be more fuel-efficient to add some engines and \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E to the pods themselves and convert them into full-fledged fuel tankers. The redesign is actually progressing quite quickly, but I was eager to post some new pictures after the long hiatus, so I\u0027m going to go ahead and document the transfer of Lupus Station to the Mun.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot481.png\u0022 class=\u0022ipsImage\u0022 height=\u0022578\u0022 src=\u0022https://s33.postimg.org/g4ixzdc4f/screenshot481.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot487.png\u0022 class=\u0022ipsImage\u0022 height=\u0022578\u0022 src=\u0022https://s33.postimg.org/wsag1velr/screenshot487.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot493.png\u0022 class=\u0022ipsImage\u0022 height=\u0022578\u0022 src=\u0022https://s33.postimg.org/k0w9vdcjj/screenshot493.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot497.png\u0022 class=\u0022ipsImage\u0022 height=\u0022578\u0022 src=\u0022https://s33.postimg.org/unq30ssen/screenshot497.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot502.png\u0022 class=\u0022ipsImage\u0022 height=\u0022578\u0022 src=\u0022https://s33.postimg.org/6jzbcipdb/screenshot502.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot511.png\u0022 class=\u0022ipsImage\u0022 height=\u0022578\u0022 src=\u0022https://s33.postimg.org/jbdhj2ovj/screenshot511.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nAfter entering a circular polar orbit of altitude 20km, we ditched the tug, crashing it into the munar surface.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot512.png\u0022 class=\u0022ipsImage\u0022 height=\u0022578\u0022 src=\u0022https://s33.postimg.org/pp2kmdjhr/screenshot512.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot513.png\u0022 class=\u0022ipsImage\u0022 height=\u0022578\u0022 src=\u0022https://s33.postimg.org/42nk5dfsf/screenshot513.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot515.png\u0022 class=\u0022ipsImage\u0022 height=\u0022578\u0022 src=\u0022https://s33.postimg.org/vq09jhvu7/screenshot515.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot526.png\u0022 class=\u0022ipsImage\u0022 height=\u0022578\u0022 src=\u0022https://s33.postimg.org/wfj1vx99b/screenshot526.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot528.png\u0022 class=\u0022ipsImage\u0022 height=\u0022578\u0022 src=\u0022https://s33.postimg.org/r445b8abz/screenshot528.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nAnd now Lupus Station has become my very first space station around a body other than Kerbin!\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot529.png\u0022 class=\u0022ipsImage\u0022 height=\u0022578\u0022 src=\u0022https://s33.postimg.org/4s6chwgdr/screenshot529.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot531.png\u0022 class=\u0022ipsImage\u0022 height=\u0022578\u0022 src=\u0022https://s33.postimg.org/xukmkqi33/screenshot531.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOur next task is to make the station functional as a fuel depot by launching and docking at least some of its accompanying fleet of fuel tankers. Then Sisyphus L will actually have some work to do!\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m really glad I\u0027ll actually get to see this project through to completion. I had big plans for this setup, and I\u0027m dreaming up new plans as I go. My hope is that the results will be quite grand.\n\u003C/p\u003E\n"},{"CreatedByName":"Opus_723","CreatedById":170390,"CreatedDateTime":"2017-12-19T07:44:14Z","Content":"\n\u003Cp\u003E\nFirst fuel tanker went up today! It\u0027s been awhile since I launched Atlas, so it was good to see it in action again!\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot551.png\u0022 class=\u0022ipsImage\u0022 height=\u0022578\u0022 src=\u0022https://s33.postimg.org/v1xuk30cf/screenshot551.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot584.png\u0022 class=\u0022ipsImage\u0022 height=\u0022578\u0022 src=\u0022https://s33.postimg.org/cavx9gvcv/screenshot584.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot591.png\u0022 class=\u0022ipsImage\u0022 height=\u0022578\u0022 src=\u0022https://s33.postimg.org/57o1u0ajj/screenshot591.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot594.png\u0022 class=\u0022ipsImage\u0022 height=\u0022578\u0022 src=\u0022https://s33.postimg.org/8r9zjz5lb/screenshot594.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nThe fuel tanker launched carrying only a small fraction of its fuel capacity, which was just enough the get to the Mun on its own.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot600.png\u0022 class=\u0022ipsImage\u0022 height=\u0022578\u0022 src=\u0022https://s33.postimg.org/avucl9wzz/screenshot600.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot603.png\u0022 class=\u0022ipsImage\u0022 height=\u0022578\u0022 src=\u0022https://s33.postimg.org/khnx10b4v/screenshot603.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot607.png\u0022 class=\u0022ipsImage\u0022 height=\u0022578\u0022 src=\u0022https://s33.postimg.org/khnx120v3/screenshot607.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nTo rendezvous with the station in a polar orbit, we only barely captured on the first burn, letting the tanker swing out on a long orbit and then perform a plane correction to align its orbit with the station\u0027s. Then it was just a matter of circularizing and performing a Hohmann transfer to the station. The view approaching the station was just awesome.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot613.png\u0022 class=\u0022ipsImage\u0022 height=\u0022578\u0022 src=\u0022https://s33.postimg.org/z0v22uz9b/screenshot613.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot620.png\u0022 class=\u0022ipsImage\u0022 height=\u0022578\u0022 src=\u0022https://s33.postimg.org/l76pdvbtr/screenshot620.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot624.png\u0022 class=\u0022ipsImage\u0022 height=\u0022578\u0022 src=\u0022https://s33.postimg.org/sn5yzphjj/screenshot624.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot626.png\u0022 class=\u0022ipsImage\u0022 height=\u0022578\u0022 src=\u0022https://s33.postimg.org/maqtpewcf/screenshot626.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot634.png\u0022 class=\u0022ipsImage\u0022 height=\u0022578\u0022 src=\u0022https://s33.postimg.org/qwmxxtur3/screenshot634.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot642.png\u0022 class=\u0022ipsImage\u0022 height=\u0022578\u0022 src=\u0022https://s33.postimg.org/hc3baznfj/screenshot642.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot652.png\u0022 class=\u0022ipsImage\u0022 height=\u0022578\u0022 src=\u0022https://s33.postimg.org/n09m28ugf/screenshot652.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nAnd that\u0027s our first tanker! The station\u0027s not terribly symmetric yet, but we have actual fuel storage capacity now! This is meant to be a liquid fuel tank, although some of the parts can store L\u002BOx mix in a pinch. But we\u0027ve only got Sisyphus L in operation so far, so we couldn\u0027t bring up oxygen from the surface anyway. Now at least Charon has a fancy station to refuel at rather than docking with Sisyphus itself. The point is, between Sisyphus L, Tower Station and Lupus Station, we now have all the functioning parts of a liquid fuel supply chain!\n\u003C/p\u003E\n\u003Cp\u003E\nOur next task will be a quick and straightforward one: there\u0027s no reason to leave Sisyphus L drifting out in space anymore, so we\u0027ll dock it to Lupus Station and transfer its remaining fuel. After that, we\u0027ll go ahead and outfit Lupus station with its second liquid fuel tanker, as well as a monoprop pod, to bring the liquid fuel supply chain to full capacity.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-12-19T07:45:06Z\u0022 title=\u002212/19/2017 07:45  AM\u0022 data-short=\u00226 yr\u0022\u003EDecember 19, 2017\u003C/time\u003E by Opus_723\u003C/strong\u003E\n\u003C/span\u003E\n"}]}