{"TopicId":152910,"ForumId":44,"TopicTitle":"Properties of a Mega-Earth","CreatedByName":"Ar-cen-ciel","CreatedById":171536,"CreatedDateTime":"2016-12-03T03:11:06Z","PageNum":1,"Articles":[{"CreatedByName":"Ar-cen-ciel","CreatedById":171536,"CreatedDateTime":"2016-12-03T03:11:06Z","Content":"\n\u003Cp\u003E\nSuppose that there\u0027s a planet roughly the size of Kepler-10c that could sustain life, what would be its distance from its sun?\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, since it has a much stronger gravity than our Earth, is it possible to achieve spaceflight in such planet? And what\u0027s the minimum size for a meteor to penetrate its atmosphere and its impact velocity?\n\u003C/p\u003E\n"},{"CreatedByName":"Jonfliesgoats","CreatedById":168077,"CreatedDateTime":"2016-12-03T08:24:42Z","Content":"\n\u003Cp\u003E\nThe more we explore, the more we learn our assumptions are wrong.  Tiny pluto has an atmosphere and tectonics!  A low gravity place like Titan has a thick atmosphere.\n\u003C/p\u003E\n\u003Cp\u003E\nSo we can\u0027t really know what sort of atmosphere would exist around a super-earth.  A lot depends on things which we can\u0027t predict by mass alone.  Large bodies should have enough of a magnetic field to protect an atmosphere from being blasted away by solar radiation, but there are so many variables at play that we simply don\u0027t know.\n\u003C/p\u003E\n\u003Cp\u003E\nWould spaceflight be possible?  Yes.  It\u0027s just a matter of how much energy you need to pack into a given rocket. The engineering may be more challenging, but not impossible.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you think that is challenging, imagine being a sea-creature from the inside of Europa that wants to fly in space!  Europa-squid could do it though.  They\u0027d have to work their way to the surface first.\n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2016-12-04T03:07:33Z","Content":"\n\u003Cp\u003E\nAfter a rocky planet appears, a gravitaional differentiation starts inside. Iron sinks, silicates rise, Heat is being released,\u003Cbr\u003E\nHydrates and carbonates decay, releasing water and carbon dioxide stored from the protoplanet times.\u003Cbr\u003E\nWater and CO\u003Csub\u003E2\u003C/sub\u003E rise and release as volcanic gases. Volcano gas is mostly water steam and CO\u003Csub\u003E2\u003C/sub\u003E.\u003Cbr\u003E\nIf it\u0027s enough cold, water condenses as an ocean, while carbon dioxide stays gaseous. So, atmosphere gets N\u003Csub\u003E2\u003C/sub\u003E → N\u003Csub\u003E2\u003C/sub\u003E\u002BCO\u003Csub\u003E2\u003C/sub\u003E\u002BH\u003Csub\u003E2\u003C/sub\u003EO, as on early Earth,\n\u003C/p\u003E\n\u003Cp\u003E\nTaking that total mass of released gases is proportional to decayed rocks mass, so to planet mass, we can presume that the ocean volume is proportional to the planet mass, i.e. V\u003Csub\u003Eocean\u003C/sub\u003E~R\u003Csup\u003E3\u003C/sup\u003E.\u003Cbr\u003E\nOcean surface is proportional to the planet surface: S\u003Csub\u003Eocean\u003C/sub\u003E ~ R\u003Csup\u003E2\u003C/sup\u003E.\u003Cbr\u003E\nSo, ocean depth is ~R\u003Csup\u003E3\u003C/sup\u003E/R\u003Csup\u003E2\u003C/sup\u003E~R\u003Csub\u003Eplanet\u003C/sub\u003E\u003Cbr\u003E\nEarth ocean average depth ~3.7 km.\n\u003C/p\u003E\n\u003Cp\u003E\nSurface detail height/depth is limited by gravity. The greater is gravity, the greater is pressure onto the mountain foot / trench wall.\u003Cbr\u003E\nMountain mass ~size\u003Csup\u003E3\u003C/sup\u003E, foot area ~size\u003Csup\u003E2\u003C/sup\u003E. So, pressure ~size\u003Csup\u003E3\u003C/sup\u003E/size\u003Csup\u003E2\u003C/sup\u003E~size.\u003Cbr\u003E\nStress limit is a fixed value defined by atomic bounds energy. So, max.size ~pressure\u003Csup\u003E-1\u003C/sup\u003E.\u003Cbr\u003E\nAs pressure ~gravity, max.detail height ~gravity\u003Csup\u003E-1\u003C/sup\u003E.\u003Cbr\u003E\nFor example the Earth rocky details are limited with ~10 km. And we can see Everest 9 and Mariana -11.\u003Cbr\u003E\nGravity = GM/r2 = G V density/r\u003Csup\u003E2\u003C/sup\u003E ~r\u003Csup\u003E3\u003C/sup\u003E/r\u003Csup\u003E2\u003C/sup\u003E~r.\u003Cbr\u003E\nSo, max.detail height ~r\u003Csup\u003E-1\u003C/sup\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nHere we see that ocean depth is ~r, while mountain/trench height ~r\u003Csup\u003E-1\u003C/sup\u003E.\u003Cbr\u003E\nIncreasing the Earth, we can estimate:\u003Cbr\u003E\nx * 3.8 = 10 / x;\u003Cbr\u003E\nx\u003Csup\u003E2\u003C/sup\u003E = 10 / 3.8\u003Cbr\u003E\nx = sqrt(10 / 3.8) = 1.6\n\u003C/p\u003E\n\u003Cp\u003E\nSo, Earth will be covered with ocean if scale it up by 1.6 times.\u003Cbr\u003E\nM = 1.6\u003Csup\u003E3\u003C/sup\u003E = 4 M\u003Csub\u003Eearth\u003C/sub\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe greater is mass, the less is gas dissipation, but the dense is atmosphere, the greater is pressure.\u003Cbr\u003E\nBoth are greenhouse gases. Greenhouse effect will heat up and additionally rise pressure.\u003Cbr\u003E\nWater absorbs CO\u003Csub\u003E2\u003C/sub\u003E very well. Earth ocean contains 140 times more CO\u003Csub\u003E2\u003C/sub\u003E than atmosphere.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, a Superearth CO2 will be totally absorbed by the ocean, while the water steam pressure rise up to critical value.\u003Cbr\u003E\nThe Superearth ocean becomes a hybride of atmosphere and hydrosphere at once.\n\u003C/p\u003E\n\u003Cp\u003E\nUnder huge pressure the inner layers of the ocean get solid making hot ice.\u003Cbr\u003E\nAnd we get a typical ice giant like Uranus or Neptune.\n\u003C/p\u003E\n\u003Cp\u003E\nIf it\u0027s too close to the star and gets heated up to 1000 K, it loses atmo and hydro, becoming a naked rocky core without any water.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, there is no possible Superearth at all.\u003Cbr\u003E\nIt\u0027s either under-Uranus, or super-Venus.\n\u003C/p\u003E\n"},{"CreatedByName":"Ar-cen-ciel","CreatedById":171536,"CreatedDateTime":"2016-12-04T03:18:44Z","Content":"\n\u003Cp\u003E\n@kerbiloid So a Kepler-10c sized superearth would be either an ocean planet or an ice giant at Earth\u0027s temperature?\n\u003C/p\u003E\n"},{"CreatedByName":"MaxL_1023","CreatedById":152317,"CreatedDateTime":"2016-12-04T03:32:55Z","Content":"\n\u003Cp\u003E\nIce Giants in the traditional sense (Methane/Hydrogen atmospheres) wouldn\u0027t form at Earth\u0027s temperature, unless you consider a Nitrogen/Oxygen/Water Vapor Atmosphere which reaches water\u0027s critical point before the nominal sea level. Then, you would have the atmosphere gradually transitioning to high-pressure forms of ice, with no liquid water. You would need more mass to hold onto hydrogen, likely more than 4 Earth Masses. \n\u003C/p\u003E\n\u003Cp\u003E\nThe key for a planet in the 2-5 Earth Mass range is how much volatile material gets incorporated at formation. A 5 earth mass planet would have 5 times the volatile material if it formed in exactly the same spot, assuming it still loses all hydrogen and helium but holds onto water (Methane would be photodissociated back into Carbon Dioxide, Water and some escaping hydrogen). In that situation, silicate weathering should deplete most of the primordial atmosphere through plate tectonics, locking away all but a few atmospheres worth of material as carbonate rocks after the planet cools from its formation. However, if it has too much volatile material it can get an atmosphere thick enough to prevent water from condensing and turn into the \u0022hot ice\u0022 giant - I suspect anything above 4 or 5 earth masses is likely to run into this situation.\n\u003C/p\u003E\n\u003Cp\u003E\nThere are stable earth-like climate states for larger planets - I heard the limit somewhere near 5 earth masses before plate tectonics stops and you \u0022forget\u0022 to weather down the atmosphere. A 2 or 3 earth mass planet might actually be better for life than earth, with a stronger magnetic field, more archipelago type landforms, shallow oceans and a longer geologically active lifetime. \n\u003C/p\u003E\n\u003Cp\u003E\nMore study is needed though - until we get better observation data (why couldn\u0027t we have gotten the terrestrial planet finder Darn it) we are guessing.\n\u003C/p\u003E\n\u003Cp\u003E\nEdit: Kepler-10C is way too big - that is a hot ice type planet. It would probably have a significant hydrogen envelope if it was far enough out to have liquid water (say 270K black body instead of 584K). In fact, I suspect it still has some hydrogen in its atmosphere, just not enough to budge its mass/radius relationship.  \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-12-04T03:36:06Z\u0022 title=\u002212/04/2016 03:36  AM\u0022 data-short=\u00227 yr\u0022\u003EDecember 4, 2016\u003C/time\u003E by MaxL_1023\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2016-12-04T17:14:41Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222874111\u0022 data-ipsquote-contentid=\u0022152910\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221480821524\u0022 data-ipsquote-userid=\u0022171536\u0022 data-ipsquote-username=\u0022Ar-cen-ciel\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n13 hours ago, Ar-cen-ciel said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n@kerbiloid So a Kepler-10c sized superearth would be either an ocean planet or an ice giant at Earth\u0027s temperature?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nImho, it can be or icy giant or burnt icy giant, or super-Venus wannabe icy giant.\n\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2016-12-04T20:12:08Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222874127\u0022 data-ipsquote-contentid=\u0022152910\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221480822375\u0022 data-ipsquote-userid=\u0022152317\u0022 data-ipsquote-username=\u0022MaxL_1023\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n16 hours ago, MaxL_1023 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe key for a planet in the 2-5 Earth Mass range is how much volatile material gets incorporated at formation. A 5 earth mass planet would have 5 times the volatile material if it formed in exactly the same spot, assuming it still loses all hydrogen and helium but holds onto water (Methane would be photodissociated back into Carbon Dioxide, Water and some escaping hydrogen). In that situation, silicate weathering should deplete most of the primordial atmosphere through plate tectonics, locking away all but a few atmospheres worth of material as carbonate rocks after the planet cools from its formation. However, if it has too much volatile material it can get an atmosphere thick enough to prevent water from condensing and turn into the \u0022hot ice\u0022 giant - I suspect anything above 4 or 5 earth masses is likely to run into this situation.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI seem to recall reading about a recent paper where the upper limit for a \u0022super Earth\u0022 was well below 5 earth masses. Any larger and its more of a mini neptune. You mention hydrogen and helium escaping... but at 5 earth masses, it will hold on to that hydrogen and helium. Sure early in its formation, its not 5 earth masses, but atmosphere loss isn\u0027t instant either. Also it would be forming when the disk around the star is still rather dense, and before all that interplanetary gas is cleared out - so it can then accumulate these volatile a little later (still a short time frame in astronomical terms), no?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://en.wikipedia.org/wiki/Super%E2%80%90Earth#2016\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Super‐Earth#2016\u003C/a\u003E\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe limit between rocky planets and planets with a thick gaseous envelope is calculated with theoretical models. Calculating the effect of the active XUV saturation phase of G-type stars over the loss of the primitive nebula-captured hydrogen envelopes in extrasolar planets, it\u0027s obtained that planets with a core mass of more than 1.5 Earth-mass (1.15 Earth-radius max.), most likely cannot get rid of their nebula captured hydrogen envelopes during their whole lifetime.\u003Csup\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Super%E2%80%90Earth#cite_note-66\u0022 rel=\u0022external nofollow\u0022\u003E[66]\u003C/a\u003E\u003C/sup\u003E Other calculations point out that the limit between envelope-free rocky super-Earths and sub-Neptunes is around 1.75 Earth-radii, as 2 Earth-radii would be the upper limit to be rocky (a planet with 2 Earth-radii and 5 Earth-masses with a mean Earth-like core composition would imply that 1/200 of its mass would be in a H/He envelope, with an atmospheric pressure near to 2.0 GPa or 20,000 bar).\u003Csup\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Super%E2%80%90Earth#cite_note-67\u0022 rel=\u0022external nofollow\u0022\u003E[67]\u003C/a\u003E\u003C/sup\u003E Whether or not the primitive nebula-captured H/He envelope of a super-Earth is entirely lost after formation also depends on the orbital distance. For example, formation and evolution calculations of the \u003Ca href=\u0022https://en.wikipedia.org/wiki/Kepler-11\u0022 title=\u0022Kepler-11\u0022 rel=\u0022external nofollow\u0022\u003EKepler-11\u003C/a\u003E planetary system show that the two innermost planets Kepler-11b and c, whose calculated mass is ≈2 \u003Ca href=\u0022https://en.wikipedia.org/wiki/Earth_mass\u0022 title=\u0022Earth mass\u0022 rel=\u0022external nofollow\u0022\u003EM\u003Csub\u003E⊕\u003C/sub\u003E\u003C/a\u003E and between ≈5 and 6 M\u003Csub\u003E⊕\u003C/sub\u003E respectively (which are within measurement errors), are extremely vulnerable to envelope loss.\u003Csup\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Super%E2%80%90Earth#cite_note-dangelo_bodenheimer_2016-68\u0022 rel=\u0022external nofollow\u0022\u003E[68]\u003C/a\u003E\u003C/sup\u003E In particular, the complete removal of the primordial H/He envelope by energetic stellar photons appears almost inevitable in the case of Kepler-11b, regardless of its formation hypothesis.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"MaxL_1023","CreatedById":152317,"CreatedDateTime":"2016-12-04T20:21:01Z","Content":"\n\u003Cp\u003E\nThe issue with this is that it assumes that the planet cores form from the original protoplanetary disk before the gas dissipates. Earth and Potentially Super-Earth type planets can form from collisional accretion of smaller Moon-Mars size bodies after the gas dissipation. In fact, one theory of the solar system postulates that the current terrestrial planets formed from remnant material after an earlier generation of super-earths spiraled into the Sun after Jupiter and Saturn\u0027s migration disrupted the inner solar system.\n\u003C/p\u003E\n\u003Cp\u003E\nI don\u0027t think many bodies will get to 5 earth masses when forming late, but if Earth and Venus did than it is not beyond possibility to have somewhat larger bodies. These would not have to worry about hydrogen capture at any rate. \n\u003C/p\u003E\n"},{"CreatedByName":"MichaelPoole","CreatedById":152964,"CreatedDateTime":"2017-01-24T18:02:21Z","Content":"\n\u003Cp\u003E\nThe problem with \u0022theoretical models\u0022 is that they are often wrong. Don\u0027t get me wrong, they are useful tools, but nothing more. In this case, a planet is \u003Cstrong\u003Eproven\u003C/strong\u003E to have a mass, radius and density that mean it lacks a huge hydrogen envelope, yet is as massive as Uranus, so I am gonna believe the empirical evidence. There were plenty of models showing Pluto must be geologically dead too.\n\u003C/p\u003E\n"},{"CreatedByName":"78stonewobble","CreatedById":97559,"CreatedDateTime":"2017-01-25T15:07:22Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222875142\u0022 data-ipsquote-contentid=\u0022152910\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221480882861\u0022 data-ipsquote-userid=\u0022152317\u0022 data-ipsquote-username=\u0022MaxL_1023\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn ‎04‎-‎12‎-‎2016 at 9:21 PM, MaxL_1023 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe issue with this is that it assumes that the planet cores form from the original protoplanetary disk before the gas dissipates. Earth and Potentially Super-Earth type planets can form from collisional accretion of smaller Moon-Mars size bodies after the gas dissipation. In fact, one theory of the solar system postulates that the current terrestrial planets formed from remnant material after an earlier generation of super-earths spiraled into the Sun after Jupiter and Saturn\u0027s migration disrupted the inner solar system.\n\u003C/p\u003E\n\u003Cp\u003E\nI don\u0027t think many bodies will get to 5 earth masses when forming late, but if Earth and Venus did than it is not beyond possibility to have somewhat larger bodies. These would not have to worry about hydrogen capture at any rate. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOr just that where the solar system formed was somewhat rare in gases, but rich in rocks?\n\u003C/p\u003E\n\u003Cp\u003E\nSo possibly unlikely, to very unlikely, but not completely impossible?\n\u003C/p\u003E\n"},{"CreatedByName":"MichaelPoole","CreatedById":152964,"CreatedDateTime":"2017-01-25T20:16:36Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222933997\u0022 data-ipsquote-contentid=\u0022152910\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221485356842\u0022 data-ipsquote-userid=\u002297559\u0022 data-ipsquote-username=\u002278stonewobble\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, 78stonewobble said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOr just that where the solar system formed was somewhat rare in gases, but rich in rocks?\n\u003C/p\u003E\n\u003Cp\u003E\nSo possibly unlikely, to very unlikely, but not completely impossible?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI don\u0027t think it is very unlikely at all considering we already discovered such a planet. Way too much of this is theory, it reminds me of the oceans of oil theory of Venus or how Jovian moons were supposed to be barren cratered rocks before Voyager.\n\u003C/p\u003E\n"},{"CreatedByName":"78stonewobble","CreatedById":97559,"CreatedDateTime":"2017-01-26T12:44:09Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222934369\u0022 data-ipsquote-contentid=\u0022152910\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221485375396\u0022 data-ipsquote-userid=\u0022152964\u0022 data-ipsquote-username=\u0022MichaelPoole\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n16 hours ago, MichaelPoole said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI don\u0027t think it is very unlikely at all considering we already discovered such a planet. Way too much of this is theory, it reminds me of the oceans of oil theory of Venus or how Jovian moons were supposed to be barren cratered rocks before Voyager.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell I haven\u0027t really been keeping up on planet discoveries, so that might be the case. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI was just going by the arguments against.\n\u003C/p\u003E\n"}]}