{"TopicId":153151,"ForumId":70,"TopicTitle":"Maneuver Calculation Glitch","CreatedByName":"cgwhite4","CreatedById":170331,"CreatedDateTime":"2016-12-07T16:49:58Z","PageNum":1,"Articles":[{"CreatedByName":"cgwhite4","CreatedById":170331,"CreatedDateTime":"2016-12-07T16:49:58Z","Content":"\n\u003Cp\u003E\nIn KSP 1.2.1, I had been noticing an issue with maneuver calculations.  I am running Extraplanetary Launchpads, Kerbal Attachment System, and Module Manager, and I frequently launch missions from my EL-supported bases on Minmus and Gilly.  Gilly is used more frequently due to launch window frequency.  During some recent missions to Duna, my Trans-Duna Injection would be long enough that I would still be burning when I exited Gilly\u0027s Hill Sphere.  At the moment I transitioned to Eve\u0027s influence, the maneuver calculation would be thrown off, projecting me beyond Dres and requiring that the rest of the burn be completed without accurate delta V information (or worse, requiring me to switch the \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E to hold position mode to avoid a directional change that would ruin the TDI burn).\n\u003C/p\u003E\n\u003Cp\u003E\nUpon yesterday\u0027s release of KSP 1.2.2, things got worse.  I launched a vessel from Kerbin on a mission to Gilly to recrew the base there.  I was able to get into a parking orbit, but during my Cis-Eve Injection, as soon as my projected course exited Kerbin\u0027s Hill Sphere, the maneuver calculation was again thrown off (this time, much more severely).  The transport vessel does not contain any EL parts, and has only one \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E part: a connector port (previous missions to Duna and Ike that experienced this issue in KSP 1.2.1 lacked even this connector port).  At around the same time as my update to KSP 1.2.2, I updated \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E to 0.6.1, which was active when I attempted the Cis-Eve Injection.  As for the other two mods I am using, I have currently EL on 5.5.4, and \u003Cabbr title=\u0022Module Manager (mod)\u0022\u003EMM\u003C/abbr\u003E on 2.7.5.  I currently suspect that this is a KSP issue, not a mod issue (particularly since it has affected craft that had no mod-based parts whatsoever).  \n\u003C/p\u003E\n\u003Cp\u003E\nHas anyone else experienced a maneuver calculation glitch (perhaps serious enough to ruin your maneuver) when either your vessel or your projected path crosses a Hill Sphere Boundary (e.g., entering that of Mun or Minmus, or exiting that of Kerbin into interplanetary space)?\n\u003C/p\u003E\n\u003Cp\u003E\nEdit: On closer inspection, I noticed that my trajectory was briefly passing through the Hill Sphere of one of Kerbin\u0027s moons without the glitch occurring at that point.  It is only occurring when I my trajectory goes interplanetary.  I have also now been able to extricate myself from this situation using similar techniques to how I kept my previous Trans-Duna Injections on target.  I am now in Gilly orbit preparing for my landing, and did not experience this issue during the Eve capture, Gilly intercept, or Gilly capture burns.  I suspect it may occur again in the future unless the underlying problem is found and patched, but for now, I have worked around it.\n\u003C/p\u003E\n\u003Cp\u003E\nEdit #2: The issue has recurred for another mission of similar profile (another Gilly recrew).  Between this mission and the previous one, I sent another mission from Gilly to Duna, and like in 1.2.1, the issue occurred as it exited Gilly\u0027s Hill Sphere mid-burn.\n\u003C/p\u003E\n\u003Cp\u003E\nEdit #3: In yet another Cis-Eve Injection (same mission profile), I have discovered that the glitch will not occur if I am in object view (instead of map view which I have been for previous instances).  If I am in object view when my trajectory exits Kerbin\u0027s Hill Sphere, I observe the \u0022camera snap\u0022 where it pivots about my craft to view it from another angle, which I can use as a signal for when it is safe to switch back to map mode.  The issue is still occurring, however, if and at the point at which my trajectory re-intercepts Kerbin (i.e., my orbit goes out first due to needing Eve to gain on me, and ends up exactly 1 Kerbal year long), as well as for Trans-Duna Injections from Gilly when my vessel itself (not its trajectory) exits Gilly\u0027s Hill Sphere (One of the countermeasures I am using as a workaround requires me to be in object view so I can see my altimeter and know when to switch \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E modes).\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-12-19T03:49:49Z\u0022 title=\u002212/19/2016 03:49  AM\u0022 data-short=\u00227 yr\u0022\u003EDecember 19, 2016\u003C/time\u003E by cgwhite4\u003C/strong\u003E\n\u003Cbr\u003ENew information/workaround\n\u003C/span\u003E\n"},{"CreatedByName":"Freshmeat","CreatedById":111048,"CreatedDateTime":"2016-12-25T21:18:07Z","Content":"\n\u003Cp\u003E\nI have encountered a similar problem, going Kerbin-Moho. Will try your workarounds. I use a host of mods, but not EL, so I do not think it is the issue.\n\u003C/p\u003E\n\u003Cp\u003E\nI run KSP 64 bit on a win 7 enterprise. No specific information found in KSP.log, but I will try to keep exact time on when it happens.\n\u003C/p\u003E\n\u003Cp\u003E\nFound the issue on the \u003Ca href=\u0022http://bugs.kerbalspaceprogram.com/issues/12757\u0022 rel=\u0022external nofollow\u0022\u003Ebug tracker\u003C/a\u003E and added a piece of information: What happens is that the maneuver node gets relocated to the next patched conic. If you move it in time, it gets located back.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-12-26T21:39:10Z\u0022 title=\u002212/26/2016 09:39  PM\u0022 data-short=\u00227 yr\u0022\u003EDecember 26, 2016\u003C/time\u003E by Freshmeat\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"cgwhite4","CreatedById":170331,"CreatedDateTime":"2017-03-13T01:56:49Z","Content":"\n\u003Cp\u003E\nIn addition to these issues still persisting for quite some time (mainly causing me problems when launching from Gilly), I am now experiencing another maneuver calculation issue while attempting to calculate a Cis-Moho Injection from Gilly.  This time, the problem is occurring during calculation, instead of during the resulting burn.  The intercept indicator keeps locking on to a \u0022false intercept\u0022 shortly ahead of my position but nowhere near Moho\u0027s orbit, instead of the node (descending or ascending) near the intersection of the calculated orbit and Moho\u0027s orbit.  I may be arriving way early or way late, but I need to know which to know what adjustments I need to make to my orbit to get an encounter, and that can only happen if the intercept indicator tells me what is happening at the appropriate node instead of getting distracted by a \u0022false intercept\u0022.  It would be very helpful if the intercept indicator could be adjusted so that \u0022false intercepts\u0022 could be ignored.  My current mods are EL 5.7.1, \u003Cabbr title=\u0022Module Manager (mod)\u0022\u003EMM\u003C/abbr\u003E 2.7.5, \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E 0.6.2, and \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E 0.7.3 (0.7.3 is a Beta of an eventual 1.0, and is non-conflicting with 0.6.2, according to IgorZ).  However, I do not believe any of these mods could be causing the problem.\n\u003C/p\u003E\n\u003Cp\u003E\nPerhaps one way to eliminate/workaround this problem is allowing for orange and purple intercept indicators if the target is a celestial object (at this point, this only happens if the target is a vessel).  This way, even if the orange intercept indicator got distracted by the \u0022false intercept\u0022, the purple intercept indicator would then appear on the correct node, allowing me to see what is really happening (whether I am early or late) and take the necessary corrective action.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EEdit: \u003C/strong\u003EI tried making an SFS-edit to move a piece of space junk into Moho\u0027s Hill Sphere to lock on to as an alternative target, but no intercept indicators appeared.  When positioning the junk just outside of Moho\u0027s Hill Sphere, I was able to get an intercept indicator, but it failed to provide me with sufficient accuracy due to deviations between its orbit and that of Moho (which become significant in the time it takes for Moho to move from its current position to the intercept position.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EEdit #2: \u003C/strong\u003EAfter double-checking with Alexmoon\u0027s calculator, it appears I have gotten very unlucky as to the time my vessel was completed (via Extraplanetary Launchpads) and launched from Gilly.  This suggests I will have to try a different, riskier, and more aggressive approach with my burn.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EEdit #3:\u003C/strong\u003E The strategy change enabled me to get a good intercept, and my vessel is now safely on the surface of Moho.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EEdit #4: \u003C/strong\u003EThis bug has now also been observed while attempting to intercept Bop from Pol, occurring when my trajectory re-intercepted Pol.  Looks like it is not just interplanetary trajectories that are affected, but also interlunar trajectories at Jool.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-04-15T13:23:31Z\u0022 title=\u002204/15/2017 01:23  PM\u0022 data-short=\u00227 yr\u0022\u003EApril 15, 2017\u003C/time\u003E by cgwhite4\u003C/strong\u003E\n\u003Cbr\u003EBug occurred in new situation\n\u003C/span\u003E\n"}]}