{"TopicId":153298,"ForumId":29,"TopicTitle":"Where is a good place to learn C#?","CreatedByName":"tg626","CreatedById":112361,"CreatedDateTime":"2016-12-10T09:19:14Z","PageNum":1,"Articles":[{"CreatedByName":"tg626","CreatedById":112361,"CreatedDateTime":"2016-12-10T09:19:14Z","Content":"\n\u003Cp\u003E\nI know it a little, as in \u0022knows enough to be dangerous\u0022, but it seems clear that a more complete knowledge would be to my advantage.\n\u003C/p\u003E\n\u003Cp\u003E\nSo for those who are formally trained, what would you suggest?\n\u003C/p\u003E\n\u003Cp\u003E\nI have googled it, but I find lots of options, some of which seem to bundle c# with a wealth of other things, but I\u0027m just interested in c# and I don\u0027t want to just pick one at random.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m not new to programming either, started with BASIC and went on from there to mucking around hacking c\u002B\u002B code, but skipped much of the structural stuff so classes and things like static, public, private, etc. don\u0027t mean much to me... Nor do the rules of asynchronous execution - which if you know basic makes sense since those programs followed a straight line - so within a function I\u0027m fine, but the further out you get the shakier I become.  lots of trial and error, and that\u0027s slow going...\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-12-10T16:39:09Z\u0022 title=\u002212/10/2016 04:39  PM\u0022 data-short=\u00227 yr\u0022\u003EDecember 10, 2016\u003C/time\u003E by tg626\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"neitsa","CreatedById":165882,"CreatedDateTime":"2016-12-10T16:49:17Z","Content":"\n\u003Cp\u003E\nHello,\n\u003C/p\u003E\n\u003Cp\u003E\nThe only thing I can think of is: buy good book(s) about the language.\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\n The C# Player\u0027s Guide (2nd Edition)\n\u003C/li\u003E\n\u003Cli\u003E\nC# 6.0 in a Nutshell: The Definitive Reference\n\u003C/li\u003E\n\u003Cli\u003E\nMicrosoft Visual C# Step by Step (8th Edition)\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nI\u0027m not very fond of general online tutorials as a starter, they are good to expose specific features but won\u0027t teach you the basics, at least they can\u0027t rival a 400 to 600 pages book after all.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you have a specific question about how something works, go to the Microsoft (MSDN) web site (there are also some \u003Ca href=\u0022https://msdn.microsoft.com/en-us/library/67ef8sbd.aspx\u0022 rel=\u0022external nofollow\u0022\u003Egood guides\u003C/a\u003E | \u003Ca href=\u0022https://msdn.microsoft.com/en-us/library/kx37x362.aspx\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E there). There\u0027s usually an example about the feature you are searching for (e.g \u003Ca href=\u0022https://msdn.microsoft.com/en-us/library/79b3xss3.aspx\u0022 rel=\u0022external nofollow\u0022\u003EWhat\u0027s a static class and static members\u003C/a\u003E).\n\u003C/p\u003E\n\u003Cp\u003E\nLastly, if you are interested in KSP plugins development, you should at least:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nUnderstand the \u003Ca href=\u0022https://docs.unity3d.com/Manual/ExecutionOrder.html\u0022 rel=\u0022external nofollow\u0022\u003Ebasic principles\u003C/a\u003E of the engine\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/60381-ksp-plugin-framework-plugin-examples-and-structure-v11-apr-6/\u0022 rel=\u0022\u0022\u003ERead tutorials\u003C/a\u003E dedicated to KSP\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nNote that Unity is still stuck at the 3.5 framework features \u003Cstrong\u003Ebut\u003C/strong\u003E you can still use some of the features of the C# 6 language (e.g. Null propagation or interpolation strings) in a KSP plugin: the framework and language versions are two different things. \n\u003C/p\u003E\n"},{"CreatedByName":"Diazo","CreatedById":81549,"CreatedDateTime":"2016-12-10T17:10:02Z","Content":"\n\u003Cp\u003E\nAs you have a background in programming already, there are decent online lessons.\n\u003C/p\u003E\n\u003Cp\u003E\nI can\u0027t find a link because it\u0027s been so long, but there was a set of 7 online videos that I used to get going.\n\u003C/p\u003E\n\u003Cp\u003E\nAs for KSP specific stuff, looking at other people\u0027s code is really the only way to go. Asking questions on the forum also works, but the more specific the better answers you will get.\n\u003C/p\u003E\n\u003Cp\u003E\nD.\n\u003C/p\u003E\n"},{"CreatedByName":"tg626","CreatedById":112361,"CreatedDateTime":"2016-12-11T01:42:03Z","Content":"\n\u003Cp\u003E\nThanks guys, the books are on my Xmas list and I\u0027ll have a look at the online resources you all suggested!\n\u003C/p\u003E\n"},{"CreatedByName":"sarbian","CreatedById":57146,"CreatedDateTime":"2016-12-11T15:14:59Z","Content":"\n\u003Cp\u003E\nAn amazing site to have around when you know a little more is \u003Ca href=\u0022https://www.dotnetperls.com/\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dotnetperls.com/\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nYou get good tips and examples for about every part of the language. \n\u003C/p\u003E\n"}]}