{"TopicId":153458,"ForumId":81,"TopicTitle":"KSP on console - my experience","CreatedByName":"gustchenchi","CreatedById":151258,"CreatedDateTime":"2016-12-13T15:41:53Z","PageNum":1,"Articles":[{"CreatedByName":"gustchenchi","CreatedById":151258,"CreatedDateTime":"2016-12-13T15:41:53Z","Content":"\n\u003Cp\u003E\nDisclaimer: I am a KSP beginner with limited (just over 32 hours logged on X1) experience. This is my experience and if not the same as yours, I don\u0027t mind as long as you don\u0027t mind.\n\u003C/p\u003E\n\u003Cp\u003E\nI bought KSP on Steam about 2 years ago. I played on my Ultrabook and loved it. It reignited my interest in gaming after many years. However, my PC had limited resources and I wanted to continue playing space games, so I bought a Xbox since Elite Dangerous was just leaving GPP.\n\u003C/p\u003E\n\u003Cp\u003E\nFast forward quite some time, and the rumors of a KSP on console became a reality. I bought it the same day. I started it and expected it to be at least very similar to the PC version I still have. The first thing that changed was the control scheme, very difficult at first to get used to. It seemed that FTE didn\u0027t spend a lot of thought on this. Also, it seemed a difficult game on its own right. After a couple of tries, I decided to continue to play other games until I felt it was the time to return to KSP.\n\u003C/p\u003E\n\u003Cp\u003E\nWell, that time came when I saw the KSP printed guide book that was published not long ago. I got it and read the basic fundamentals, which I didn\u0027t get right before. With renewed enthusiasm I started a Science mode game, and since then I have learned a lot about the game and how to use the control scheme. I got used to it, and worked around it when it was not cooperating.\n\u003C/p\u003E\n\u003Cp\u003E\nNow, I am enjoying the game more than ever. I know there are no mods, and on my mind I don\u0027t count on them anyway. It\u0027s all about the small victories instead: the first orbit, the first Mun flyby, the first Munar landing... \n\u003C/p\u003E\n\u003Cp\u003E\nKSP on console made me play KSP again, and for me that\u0027s great.\u003Cimg alt=\u0022image?url=z951ykn43p4FqWbbFvR2Ec.8vbDhj8\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022https://images-eds-ssl.xboxlive.com/image?url=z951ykn43p4FqWbbFvR2Ec.8vbDhj8G2Xe7JngaTToCFwz45eCqqJAGLJf6g9Yq5UeEVm2rOprY6ghDOnyvqo3tzdKy_icj4WFo68KgNNkNfvFtrCqHnTSOhpIi1755EUHnndej9ZgjuOlskCqq12bSnBQ5kVfdLC5imCblEqb9A3MGmNZh0s8QocS3IPUPx\u0026amp;format=jpg\u0026amp;h=640\u0026amp;w=1138\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n"}]}