{"TopicId":153541,"ForumId":16,"TopicTitle":"How Do You Land On Duna and Get Back","CreatedByName":"Rileysam10","CreatedById":172547,"CreatedDateTime":"2016-12-15T01:49:46Z","PageNum":1,"Articles":[{"CreatedByName":"Rileysam10","CreatedById":172547,"CreatedDateTime":"2016-12-15T01:49:46Z","Content":"\n\u003Cp\u003E\nI have been trying to land on Duna (KSP\u0027s Mars) for a very long time, and when i say very long i mean very long. I have even set up a fully fledged base on the mun, and explored all of kerbin. I\u0027m in career, so i cant really make a very expensive ship. My \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E is almost finished upgrading, as well as my launch pad, so no need to worry about how many parts i use. I have really been trying this for almost a year now, so some help would be appreciated. I have almost landed on duna before, but i broke up in the atmosphere and now there are about 10 pieces of debris on the planet. I would also like to safely return my kerbal, or drone, depending on if i would like to send a manned mission yet or not. I have been trying to do everything NASA style, as my space program name is IKSP, or International Kerbin Space Program. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n-Rileysam10\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-12-15T03:15:07Z","Content":"\n\u003Cp\u003E\nHello, and welcome to the forums!  \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIf you\u0027re finding it difficult, you might try an unmanned probe to Duna first, just for landing practice.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you want to do a land-and-return vehicle, one handy way to practice is to do something like this:\n\u003C/p\u003E\n\u003Col\u003E\u003Cli\u003E\nsave your game\n\u003C/li\u003E\n\u003Cli\u003E\nlaunch just the \u0022lander / ascent\u0022 part of your duna ship to the launchpad\n\u003C/li\u003E\n\u003Cli\u003E\nuse the \u0022Set Orbit\u0022 function on the debug cheat menu to put it directly into orbit of Duna\n\u003C/li\u003E\n\u003Cli\u003E\nnow practice landing it and taking off again.  \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/li\u003E\n\u003Cli\u003E\ntweak ship as needed, repeat steps 2-4\n\u003C/li\u003E\n\u003Cli\u003E\nonce you\u0027re happy with it, load the save you made in step #1 (to undo all the cheating) and then work from there\n\u003C/li\u003E\n\u003C/ol\u003E\u003Cp\u003E\nGeneral tip for landing on Duna:  use a combination of parachutes and engine.  The air is so thin that if you try to land on parachutes alone, you end up spamming so many parachutes that the mass just kills you; and if you try to use engines-only, that\u0027s a whole lot of \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E wasted.  You definitely want to have some drogue chutes on your ship, again because of Duna\u0027s thin atmosphere-- they can deploy at lower pressures and open at higher speeds.\n\u003C/p\u003E\n\u003Cp\u003E\nAn example of an easy, cheap, and lightweight way to land on Duna is:\n\u003C/p\u003E\n\u003Col\u003E\u003Cli\u003E\nPut a couple of the small radial drogue chutes, plus an appropriate number (not too many) of regular chutes.\n\u003C/li\u003E\n\u003Cli\u003E\nSet the drogues to open fairly high up (say, 4000 meters instead of the default 2500), ditto the regular chutes (say, 2000 meters instead of the regular 1000).\n\u003C/li\u003E\n\u003Cli\u003E\nGo ahead and trigger all the chutes long before you get down to the appropriate altitude.  They\u0027ll deploy when they can.\n\u003C/li\u003E\n\u003Cli\u003E\nThe drogues slow you down some, the regular chutes slow you down further.  Now you\u0027re dropping those last couple of hundred meters to touchdown, but pretty fast (like, 20-30 meters per second).\n\u003C/li\u003E\n\u003Cli\u003E\nUse a brief burst of rocket thrust right before touchdown to slow to a safe landing speed.\n\u003C/li\u003E\n\u003C/ol\u003E\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2016-12-15T04:24:31Z","Content":"\n\u003Cp\u003E\nFor taking off from Duna, I like to do a gravity turn as if I\u0027m taking off from Kerbin, only cut everything in half. So I want to be at 45 degrees when I\u0027m 5km up instead of 10km, and by the time my \u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E is at about 30 I\u0027m sideways, instead of 60. I try to make sure my ascent vehicle has similar \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E as a Kerbin ascent vehicle, though that can be hard because Duna\u0027s so light.\n\u003C/p\u003E\n\u003Cp\u003E\nIt helps that Terriers (which are great vacuum engines but not so great in atmosphere) work okay even on the surface, due to Duna\u0027s low pressure. If your ship\u0027s small enough, you can get by with just one of those but testing is the only way to be 100% sure. Like \u003Cspan\u003ESnark suggests with just landing, I suggest you use the debug menu to put your ship into orbit, land it, and then take off to orbit again to test the entire \u003C/span\u003Eprocess before leaving home, at least the first few times you do it.\n\u003C/p\u003E\n"},{"CreatedByName":"bigcalm","CreatedById":143587,"CreatedDateTime":"2016-12-15T23:26:14Z","Content":"\n\u003Cp\u003E\nInstead of an all-in-one type vessel, consider sending several vessels around the same time.  As long as you\u0027re ok with how to rendevzous you should be fine.\n\u003C/p\u003E\n\u003Cp\u003E\n* An interplanetary craft, designed to push your kerbals to and from Kerbin orbit and Duna orbit.  This will need around 4000 ms delta v (from Kerbin orbit)\n\u003C/p\u003E\n\u003Cp\u003E\n* A lander - sent separately and not intended to return back to Kerbin.  It\u0027s purpose is to rendezvous with the other vessel in orbit, transfer the crew (either via EVA or docking), land on the surface, plant your flag and get back into orbit.  Your lander will need around 2500 ms delta v - half to land, half to get back into orbit.  It\u0027ll also need an additional 2000 ms delta v from kerbin orbit to get to Duna.\n\u003C/p\u003E\n\u003Cp\u003E\nAs snark recommends, I would also recommend adding some drogue chutes to your lander.  However, don\u0027t rely on them for safe landing -- Duna does not have a thick enough atmosphere likely to cause you problems - chutes are mainly to help you orient yourself in the right direction so you can burn your engines to avoid smashing into the ground.\n\u003C/p\u003E\n\u003Cp\u003E\nNuclear engines are fantastic for interplanetary because they\u0027re the most efficient (vacuum) engine in the game - though they can\u0027t normally be used for landing as they\u0027re not powerful enough.  Stage appropriately!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"archnem","CreatedById":135259,"CreatedDateTime":"2016-12-16T05:00:13Z","Content":"\n\u003Cp\u003E\nI\u0027ve done quite a few Duna landings, with a few different mission architectures, everything from direct, one ship all the way missions to launching an armada of different support craft.\n\u003C/p\u003E\n\u003Cp\u003E\nDuna\u0027s biggest drawback is also its biggest strength - the thin atmosphere.  I regularly use NERVs on my landers, since even on the ground the air is so thin they still get great \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E.  If this feels too cheaty to you, 909s work great as well. \n\u003C/p\u003E\n\u003Cp\u003E\nI also use parachutes - in my direct missions, the same lander that I use to land on Duna eventually returns to Kerbin. If I just use the amount of parachutes I need for Kerbin, this still will slow my craft to 20-30m/s, and I only have to use a little fuel at the end of the landing to get under 6m/s.  Also, a few airbrakes are really light-weight and help as well.\n\u003C/p\u003E\n\u003Cp\u003E\nThe trick w/ chutes is twofold.  First, you want tweak them in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E to deploy as high as possible and with as little air pressure as possible.  I usually set my drogues to 5000m, 0 pressure, and then stagger my other chutes to deploy in batches between 4000-2500m.  This keeps the chutes from ripping the craft in half by deploying all at once. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSecond, the Dunar (Dunan?) atmosphere is gonna be way too thin to slow you down enough for chute deploy before you smack into the ground, even with airbrakes.  You\u0027ll need to use your engines to slow you down some before you can deploy the chutes.  How high ofc, depends on the craft in question and your \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E, the higher your \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E, the longer you can wait to burn, and the shorter the burn will be.  But the important part is, you can\u0027t count on Duna\u0027s atmosphere to slow you down like, at all.\n\u003C/p\u003E\n"},{"CreatedByName":"Stargate525","CreatedById":53585,"CreatedDateTime":"2016-12-16T05:39:40Z","Content":"\n\u003Cp\u003E\nMy quick and dirty way to design a Duna lander is that if it can hit space on Kerbin using a standard ascent profile, it\u0027s got plenty of juice to make Duna. That usually overengineers the lander by quite a margin, but I prefer having surplus fuel. They make for great emergency fuel deposits in case I\u0027m not as efficient for later missions.\n\u003C/p\u003E\n"},{"CreatedByName":"DD_bwest","CreatedById":164906,"CreatedDateTime":"2016-12-17T01:02:22Z","Content":"\n\u003Cp\u003E\nearly on i always high over estimated what it would take to land and get back, i thought it would take a heck of a lot.  Over time though i realized how little you actually need.  I find the \u0022easiest\u0022  method to be a single launch mission that does not include orbital rendezvous.  but that could be because i really like my Tiny return pod.  The gravity is light enough, and the atmosphere thin enough that a single spark engine is all that is needed to launch from duna, and at 320 \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E its not to bad for heading home either. this tiny simple craft can get you back to kerbin from the surface of duna. its around 2300deltaV.   So if you were to build a lander with a second stage similar in design and purpose, all you have to do is land.  any extra fuel in the landing stage you can use to boost yourself up, detach and head home.  Put the science gear on the landing stage to conserve weight and pull data.     But if you dont like putting jeb in a tin can for so long its not a great method.  as for chutes, a whole bunch of drogues set to open mighty early help a lot and slow you down for your main chutes.  Use the chutes for assistance and engines for right at landing to bring your speed down to something your legs will handle.\u003Cimg alt=\u0022PSA1kLi.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/PSA1kLi.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nit has a z-100 on the back you cant see, and i drained the monoprop.\n\u003C/p\u003E\n"},{"CreatedByName":"Foxster","CreatedById":113764,"CreatedDateTime":"2016-12-17T10:47:06Z","Content":"\n\u003Cp\u003E\nDD_bwest is pointing you in the right direction. \n\u003C/p\u003E\n\u003Cp\u003E\nIt is extremely tempting with KSP to throw on more things or use the next size up of something. This leads to the mass of a craft ballooning, just like it does with real-life rocketry. \n\u003C/p\u003E\n\u003Cp\u003E\nYou need to start with \u0022what is the absolute minimum I need for this mission?\u0022. Then think carefully about what can be thrown away along the way, such as science experiments that can be dumped before returning. \n\u003C/p\u003E\n\u003Cp\u003E\nHere\u0027s a craft that will get a Kerbal from Kerbin to the surface of Duna and back with a mass of 23t at launch from Kerbin...\n\u003C/p\u003E\n\u003Cp\u003E\nCraft file: \u003Ca href=\u0022https://www.dropbox.com/s/tzn3be8pxet1bny/Duna%20ion%20mission%205.craft?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/tzn3be8pxet1bny/Duna ion mission 5.craft?dl=0\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022mtuRXFa.png?1\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/mtuRXFa.png?1\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-12-17T20:13:58Z\u0022 title=\u002212/17/2016 08:13  PM\u0022 data-short=\u00227 yr\u0022\u003EDecember 17, 2016\u003C/time\u003E by Foxster\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Rileysam10","CreatedById":172547,"CreatedDateTime":"2016-12-19T23:58:32Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222888187\u0022 data-ipsquote-contentid=\u0022153541\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221481766586\u0022 data-ipsquote-userid=\u0022172547\u0022 data-ipsquote-username=\u0022Rileysam10\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 12/14/2016 at 6:49 PM, Rileysam10 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI have been trying to land on Duna (KSP\u0027s Mars) for a very long time, and when i say very long i mean very long. I have even set up a fully fledged base on the mun, and explored all of kerbin. I\u0027m in career, so i cant really make a very expensive ship. My \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E is almost finished upgrading, as well as my launch pad, so no need to worry about how many parts i use. I have really been trying this for almost a year now, so some help would be appreciated. I have almost landed on duna before, but i broke up in the atmosphere and now there are about 10 pieces of debris on the planet. I would also like to safely return my kerbal, or drone, depending on if i would like to send a manned mission yet or not. I have been trying to do everything NASA style, as my space program name is IKSP, or International Kerbin Space Program. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n-Rileysam10\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThank you for all the help! I have been sending duna missions in campaign for a while now, and the space-craft series is called Operio. Operio I was a un-manned mission and sadly failed lifting off from the launch pad, and exploded under its own wait. I later modified my craft so it wasnt so heavy. Operio II was the first unmanned mission to duna. It brought home a lot of science and funds, and with that, Operio III was the first manned mission to duna. Jeb and Bob took the mission. Luckily, Bob is a 3 star and Jeb is a 2 star. Half way to duna, the ion thrusters blew up from a bug. But it wasnt all that bad. The acceleration of the craft would hit duna anyway. I prepared for landing, but the landing gear wouldnt go out. I was getting very worried, the landing gear still didnt go out. With no landing gear, I still managed to hit softly enough that the craft didnt get damaged. I landed perfectly, and got home with enough science to create my next mission. Thank you so much for the support everybody!\n\u003C/p\u003E\n"}]}