{"TopicId":153660,"ForumId":24,"TopicTitle":"Frank from twitch (new)","CreatedByName":"Frankp2491","CreatedById":172644,"CreatedDateTime":"2016-12-18T04:10:37Z","PageNum":1,"Articles":[{"CreatedByName":"Frankp2491","CreatedById":172644,"CreatedDateTime":"2016-12-18T04:10:37Z","Content":"\n\u003Cp\u003E\nHello all, \n\u003C/p\u003E\n\u003Cp\u003E\nSo my name is Frank, older undergrad student in computer science and physics. I am in love with this game I saw it on twitch yesterday and needed to get it. So I played the demo yesterday hated the fact that it was much older then the version I was watching on twitch so I bought it this morning when I knew I had more time. Anyhow snowed here today so I didn\u0027t have much time during the day to play fast forward and I have been tinkering for about 3/4 hours now. I have gotten a stock rocket Kerbal X (stock) up into orbit I orbited it about 20x around in hyper speed just to make sure I could do it before trying something else. So now I want to actually try and practice some more functional applications to the game. There is obviously a ton I am still oblivious to but I figure since this isn\u0027t costing me or the US 30 trillion to blow something up I might as well learn by making mistakes. I am looking to see what else I can do to get into the game. I want to launch a base station, try and launch some probes and whatever else is possible to do on this game. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIf someone could point me in the direction of some good resources.  I am finding the that my problem in looking for the information is that I don\u0027t know how vast this game is, and so I don\u0027t even know where to technically begin. \n\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2016-12-18T06:29:17Z","Content":"\n\u003Cp\u003E\nSince the game is still being adjusted and added-to, there are no guides to the whole game. We do have \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/forum/16-gameplay-questions-and-tutorials/\u0022 rel=\u0022\u0022\u003Ea gameplay/tutorials subforum\u003C/a\u003E, though, if there are specific things you would like to investigate. But really, the best way to learn KSP is to do what you are doing, and just play it. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E Start with small rockets and build larger ones as you get the hang of things. \n\u003C/p\u003E\n\u003Cp\u003E\nWelcome to the game and to the forum. \n\u003C/p\u003E\n"},{"CreatedByName":"Dman979","CreatedById":123837,"CreatedDateTime":"2016-12-18T08:02:57Z","Content":"\n\u003Cp\u003E\nWelcome aboard, \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/172644-frankp2491/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022172644\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/172644-frankp2491/\u0022 rel=\u0022\u0022\u003E@Frankp2491\u003C/a\u003E!\n\u003C/p\u003E\n\u003Cp\u003E\nMy advice would be to try crazy things. It\u0027s fun, and you really get an understanding of why things work this way. As an experiment, build a crazy overbuilt rocket and a regular one. Fly, compare results.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, you have a leg up over most new players, since you\u0027re a grad student in physics. Basically, KSP is Newtonian and Patched Conics. None of that fancy-schmancy relativity or n-body crap.\n\u003C/p\u003E\n"},{"CreatedByName":"James Kerman","CreatedById":160462,"CreatedDateTime":"2016-12-18T09:24:15Z","Content":"\n\u003Cp\u003E\nWelcome to the forums and KSP, Frank.\n\u003C/p\u003E\n\u003Cp\u003E\nAfter orbiting Kerbin the next thing to do is flyby either the Mun or Minmus on a free return trajectory.\n\u003C/p\u003E\n\u003Cp\u003E\nAlways remember explosions in KSP = progress.\n\u003C/p\u003E\n"},{"CreatedByName":"Frankp2491","CreatedById":172644,"CreatedDateTime":"2016-12-19T03:18:14Z","Content":"\n\u003Cp\u003E\nThanks friends, yea I am enjoying this a lot. There is a lot of stuff I am 100% oblivious of, and to what it pertains. I love this game though even though I have 99% failed launches I gotta get used to it a lot haha. I will check out the link provided if you guys stumble across and good resources though let me know because as of now I am mostly confused I would say 95% confused 5% fun haha would like to narrow that margin down over time.\n\u003C/p\u003E\n"}]}