{"TopicId":153758,"ForumId":44,"TopicTitle":"News Regarding Ram Accelerators","CreatedByName":"Jonfliesgoats","CreatedById":168077,"CreatedDateTime":"2016-12-20T02:44:30Z","PageNum":1,"Articles":[{"CreatedByName":"Jonfliesgoats","CreatedById":168077,"CreatedDateTime":"2016-12-20T02:44:30Z","Content":"\n\u003Cp\u003E\nRAIL guns are slowly developing and are even being considered for Zumwalt class destroyers.  Have there been any developments with ram accelerators?  They were supposed to be able to get objects up to 6-8km/s.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-12-20T02:58:11Z\u0022 title=\u002212/20/2016 02:58  AM\u0022 data-short=\u00227 yr\u0022\u003EDecember 20, 2016\u003C/time\u003E by Jonfliesgoats\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"p1t1o","CreatedById":74091,"CreatedDateTime":"2016-12-20T09:25:32Z","Content":"\n\u003Cp\u003E\nHavn\u0027t heard anything.\n\u003C/p\u003E\n\u003Cp\u003E\nHonestly, due to drag being proportional to the square of velocity, I dont expect much excitement in this field for a while. The Zumwalt is/was already supposed to have LRLAP projectiles capable of hitting precise targets at something like 80-100 miles, I dont see a huge increase in muzzle velocity improving too much on that due to drag in the lower atmosphere.\n\u003C/p\u003E\n\u003Cp\u003E\nMy gut feeling is you could *maybe* double the range, but not an order of magnitude increase. But the LRLAP projectiles have already been severely cut back due to costs. Each shell costs about the same as a tomahawk cruise missile which can already do the job at more than 10x the range (and a larger warhead).\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://en.wikipedia.org/wiki/Long_Range_Land_Attack_Projectile\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Long_Range_Land_Attack_Projectile\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2016-12-20T11:54:32Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222894210\u0022 data-ipsquote-contentid=\u0022153758\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221482225932\u0022 data-ipsquote-userid=\u002274091\u0022 data-ipsquote-username=\u0022p1t1o\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, p1t1o said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHavn\u0027t heard anything.\n\u003C/p\u003E\n\u003Cp\u003E\nHonestly, due to drag being proportional to the square of velocity, I dont expect much excitement in this field for a while. The Zumwalt is/was already supposed to have LRLAP projectiles capable of hitting precise targets at something like 80-100 miles, I dont see a huge increase in muzzle velocity improving too much on that due to drag in the lower atmosphere.\n\u003C/p\u003E\n\u003Cp\u003E\nMy gut feeling is you could *maybe* double the range, but not an order of magnitude increase. But the LRLAP projectiles have already been severely cut back due to costs. Each shell costs about the same as a tomahawk cruise missile which can already do the job at more than 10x the range (and a larger warhead).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://en.wikipedia.org/wiki/Long_Range_Land_Attack_Projectile\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Long_Range_Land_Attack_Projectile\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nLRLAP was an rocket assisted shell, lots of the reason for canceling it was that the Zumwalt was cut to 3 ships and it would be too expensive to develop an shell who could only by used by them. \u003Cbr\u003E\nIts too long to be used in army 155 mm guns. \u003Cbr\u003E\u003Cbr\u003E\nThen the navy looked at the combination of long range artillery and smart shells they found that the best would be to shoot almost straight up and then turn towards target high up. \u003Cbr\u003E\nPretty much like the old KSP 0.9 gravity turn. As you only have friction and no trust after shooting this makes sense, \u003Cbr\u003E\nYou could use an gun who only shoot straight up who would be easier to install, downside was that you could only use smart shells with good manoeuverability and it would not work for direct fire so they went for normal guns. \u003Cbr\u003E\n----\u003Cbr\u003E\u003Cbr\u003E\nRam accelerators is something else, its an simple ramjet launched in an tube filled with and oxidizer / fuel mix and the ramjet burn the mixture while flying down the tube. \u003Cbr\u003E\nNot an weapon system as I see it, rate of firs would be low, worse you would need time to fill the tube then you had to shoot or vent as the gasses separates, if the tube get to hot you risk that the mix ignite. Fun idea however, I wounder how good acceleration you could get. \n\u003C/p\u003E\n"},{"CreatedByName":"wumpus","CreatedById":133850,"CreatedDateTime":"2016-12-20T12:55:51Z","Content":"\n\u003Cp\u003E\nI think something easier to commercialize would be the electric catapults being used for carriers.\n\u003C/p\u003E\n\u003Cp\u003E\nOf course, real rockets are unlikely to be happy at anything other than their designed acceleration.  Put more force on them than the rocket has and don\u0027t expect the sides to handle the stress.  I always assumed that rail-gun/catapult-\u0026gt;scramjet would be the \u0022launch of the future\u0022, but KSP (and forum) has made me suspect that such might even harder than a space elevator.\n\u003C/p\u003E\n"},{"CreatedByName":"Jonfliesgoats","CreatedById":168077,"CreatedDateTime":"2016-12-20T16:13:00Z","Content":"\n\u003Cp\u003E\nEach LRAP round was super expensive.  With reduced Zumwalt numbers it was 800k usd per shot!  \n\u003C/p\u003E\n\u003Cp\u003E\nThere\u0027s an interesting historic note regarding expensive ordnance here.  In the twenties and thirties torpedoes were so expensive that the US navy didn\u0027t test them in large numbers.  When we went to war, the torpedoes were less than fifty percent reliable due to problems in the detonation mechanism,  The result was that engineering had to be done, literally, on cruises in submarines to improve the torpedo performance.  Beyond this, the improvements were resisted by administrators in the Navyas late as 1943.  There was literally a deadly amount of administrative inertia in the peacetime navy which had to be overcome.  It took about two years to get Air Corps  to shift paradigms in certain ways too, so this wasn\u0027t restricted to the Navy.\n\u003C/p\u003E\n\u003Cp\u003E\nThe US military is generally more transparent than other armed forces, and part of winning our next real fight is acknowledging that we aren\u0027t as adaptive as we should be.  This plagued us in the Civil War and all Allied powers in the First World War.  It is prudent to think that we will face similar timeframes to adjust in future conflict rather than assume we have achieved a level of adaptability not achieved by our predecessors.\n\u003C/p\u003E\n\u003Cp\u003E\nBack to the subject at hand:\n\u003C/p\u003E\n\u003Cp\u003E\n I think they are having trouble getting the RAIL barrels to survive a reasonable number of firings.  Thanks for the updates regarding the ram accelerators.  \n\u003C/p\u003E\n\u003Cp\u003E\nI think the ram accelerators were considered more for delivery to orbit via something like a space gun.\n\u003C/p\u003E\n\u003Cp\u003E\nSpeaking of electromagnetic catapults, have they finally worked out the teething problems with those on the Ford class carriers?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-12-20T16:24:45Z\u0022 title=\u002212/20/2016 04:24  PM\u0022 data-short=\u00227 yr\u0022\u003EDecember 20, 2016\u003C/time\u003E by Jonfliesgoats\u003C/strong\u003E\n\u003C/span\u003E\n"}]}