{"TopicId":153837,"ForumId":16,"TopicTitle":"First interplanetary attempt","CreatedByName":"Some Kerbal","CreatedById":171846,"CreatedDateTime":"2016-12-22T04:11:24Z","PageNum":1,"Articles":[{"CreatedByName":"Some Kerbal","CreatedById":171846,"CreatedDateTime":"2016-12-22T04:11:24Z","Content":"\n\u003Cp\u003E\nGetting to the point where I am ready to start moving out to some of the other planetary bodies. I have been able to launch some satellites toward most of the planets and not using proper launch windows for most of them will require extra \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E and travel time. Satellites aside, I picked Duna for my first manned missions.\n\u003C/p\u003E\n\u003Cp\u003E\nI have a sweet little ship that has the science lab and science modules sitting atop some atomic engines with enough \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E to get me there during the upcoming launch window. I also want to send out a little lander to drop to the surface a gather up science and a mining unit of some sort. I have questions about the mining set up.\n\u003C/p\u003E\n\u003Cp\u003E\nI have been able to make a self contained extractor/converter for use on Mun and Minmus - I know it is not as economical for Mun as it is for Minmus but there were mining contracts to be had and the ship completed the process without too much hassle. I used the cheat function to float this ship out to Duna to do test landing and return to orbit and found that I am getting slightly worse rate of return than the Mun setup so I was considering a multi unit mining operation. I toyed a bit with creating it in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E when i got to wondering how I was going to get the multiple parts to Duna and land them. So I figured I would ask others what their mode of operation would be for something like this. Say you have a 3 piece mining base - Extractor/converter, fuel holder (something on wheels to shuttle between the converter and the transport ship), and a transport ship to run the goods to orbit - How would you get the pieces to the destination planet? One big conglomeration or multiple ships?\n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2016-12-22T04:38:45Z","Content":"\n\u003Cp\u003E\nFirst, from your description, it seems you may not realize that the ore production rate depends on exactly where you land on each CB. It varies a lot. You can\u0027t really just land in one spot and say \u0022Oh, the production rate on Duna \u0026lt; Mun \u0026lt; Minmus\u0022. If you send an orbital survey scanner, you can get a much better idea of where to land to get good ore production. Your Duna extractor may actually get a lot more than your Minmus extractor if you land carefully.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBeyond that, generally, the way it works for me is this:\n\u003C/p\u003E\n\u003Cp\u003E\nIt is fairly useful for me to have a decent-sized load of fuel in \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E as early in the game as I can. Because of the short trip times, this actually means that it\u0027s easier for me to set up my first drill on the Mun. Also, exploring the Mun\u0027s biomes takes a lot of fuel, and exploring Minmus takes almost none. So, when I have the very first opportunity I send one drill each to both the Mun and Minmus, but the Mun one goes into operation first. And that one gets most of my focus. I have a drill that\u0027s stationary, an \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E \u002B fuel tank on a rover, and a small ascent tanker to take the fuel to a waiting tanker in orbit. The drill is an independent ship, and the rover \u002B ascent vehicle is one more ship when I launch them from \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E. So I make a bunch of fuel early. I have a bunch in \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E and orbiting Mun and Minmus.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd then I start getting contracts for additional drilling rigs on Mun and Minmus. So maybe I launch one more each. So now I have too many, because I already have all the fuel I need. But I make a couple extra high-tech \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E rovers. And they all refuel themselves. So now they are all ready to leave.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, eventually the Duna and Gilly xfer windows open. And the drills I send are the extra ones. Along with the high tech \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E rovers. Along with high-tech landers that double as ascent tankers. Which is the nice thing ... by the time I\u0027m ready to go interplanetary, I\u0027ve got all the high tech goodies already built and in space. Usually the drills have Skipper drives, so it works best to dock them to a high tech lander (with nuke engines) to do the traveling. But I never build anything new to go to Duna or Gilly. I reuse a lot of my now-extraneous infrastructure.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2016-12-22T09:08:59Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222896528\u0022 data-ipsquote-contentid=\u0022153837\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221482381525\u0022 data-ipsquote-userid=\u0022154251\u0022 data-ipsquote-username=\u0022bewing\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, bewing said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nFirst, from your description, it seems you may not realize that the ore production rate depends on exactly where you land on each CB. It varies a lot. You can\u0027t really just land in one spot and say \u0022Oh, the production rate on Duna \u0026lt; Mun \u0026lt; Minmus\u0022. If you send an orbital survey scanner, you can get a much better idea of where to land to get good ore production. Your Duna extractor may actually get a lot more than your Minmus extractor if you land carefully.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI could be wrong, but the way I read it, what he means with \u0022rate of return\u0022 is how much fuel is left over in his tanker after reaching orbit. Taking off from Duna takes more fuel than taking off from the Mun, so if he tried it with the same tanker, than that tanker would be left with less once in orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222896518\u0022 data-ipsquote-contentid=\u0022153837\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221482379884\u0022 data-ipsquote-userid=\u0022171846\u0022 data-ipsquote-username=\u0022Some Kerbal\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, Some Kerbal said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSay you have a 3 piece mining base - Extractor/converter, fuel holder (something on wheels to shuttle between the converter and the transport ship), and a transport ship to run the goods to orbit - How would you get the pieces to the destination planet? One big conglomeration or multiple ships?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nDepends on the wheeled vehicle, really. It will be asymmetric by definition, so whether or not you can neatly stack all three parts together for launch (or even for in-orbit assembly) will be determined by how you build that.\n\u003C/p\u003E\n\u003Cp\u003E\nIf it was me? I\u0027d go the path of least resistance. If I can stack it on a single launcher in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E, then it all goes to Duna on that. If I can\u0027t, it goes via three separate standard launches.\n\u003C/p\u003E\n\u003Cp\u003E\nOf course, I probably wouldn\u0027t bother with a three-part refueling base in the first place, as lazy as I am \u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E Just the thought of trying to line up docking ports between a rover and a stationary structure over and over again just to provide what\u0027s literally the cheapest part of any mission gives me massive \u0022can\u0027t be arsed\u0022 vibes. If I really was so low on cash that I couldn\u0027t send enough fuel for my needs directly from Kerbin, then I\u0027d probably already have a Minmus mining operation in place (with drill-refinery-tanker combo vessels, or using mods to skip the rover middleman), filling some absurd mega-tanker in orbit that joins the exploration ship on the way to Duna and provides all the refueling ever required without any in-situ operations. That mega-tanker could then again return to Kerbin together with the exploration ship, and fulfill the same role with every other destination planet in the system as well. It would have to, considering the up-front investment compared to how dirt cheap fuel is. Buuut... well, I\u0027m not usually that low on cash, so eh. Monolithic expendable mission it is. \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-12-22T09:12:13Z\u0022 title=\u002212/22/2016 09:12  AM\u0022 data-short=\u00227 yr\u0022\u003EDecember 22, 2016\u003C/time\u003E by Streetwind\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2016-12-22T09:16:56Z","Content":"\n\u003Cp\u003E\nIt may be the cheapest part of any mission, but it\u0027s also the heaviest, by definition. \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnd your reading may indeed be more correct than mine.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Palaceviking","CreatedById":166883,"CreatedDateTime":"2016-12-22T10:10:16Z","Content":"\n\u003Cp\u003E\nMine on ike, unless you have a mining contract for duna, it\u0027s easier and you\u0027ll get better return even after transferring to duna orbit.\n\u003C/p\u003E\n"},{"CreatedByName":"James Kerman","CreatedById":160462,"CreatedDateTime":"2016-12-22T10:35:54Z","Content":"\n\u003Cp\u003E\nI have a standard mobile \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E called the \u0022Wide Load\u0022 that fits inline in the rocket and functions as the base of my lander.  I design a lander/ascent sky crane that sits on top of the docking port sr.\n\u003C/p\u003E\n\u003Cp\u003E\nWith this combination you can do Ike and Duna in the same mission.  Ike first without undocking because you don\u0027t want to try and lift the rover back through the duna atmosphere.  Once refuelled the sky crane heads home and the claw becomes the fuel delivery system because trying to line up docking ports on uneven terrain is painful.\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022GfN4quJ.png\u0022 class=\u0022ipsImage\u0022 height=\u0022561\u0022 src=\u0022http://i.imgur.com/GfN4quJ.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nDeployed on Duna with a science rover.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022mhhTJhm.png\u0022 class=\u0022ipsImage\u0022 height=\u0022561\u0022 src=\u0022http://i.imgur.com/mhhTJhm.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-12-22T10:36:52Z\u0022 title=\u002212/22/2016 10:36  AM\u0022 data-short=\u00227 yr\u0022\u003EDecember 22, 2016\u003C/time\u003E by James Kerman\u003C/strong\u003E\n\u003Cbr\u003EEdited to make more sense.\n\u003C/span\u003E\n"},{"CreatedByName":"Ohm is Futile","CreatedById":172721,"CreatedDateTime":"2016-12-22T15:41:33Z","Content":"\n\u003Cp\u003E\nIt might sound a little stupid, but I have to ask: why bother with the mining rig? Is it because you want to or because you feel you have to? If it\u0027s the latter, then no, you really don\u0027t need to. Just send extra fuel straight from Kerbin if you really need it. If it\u0027s the former, then you were given good advice by \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/98962-streetwind/\u0026amp;do=hovercard\u0022 data-mentionid=\u002298962\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/98962-streetwind/\u0022 rel=\u0022\u0022\u003E@Streetwind\u003C/a\u003E. As \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/166883-palaceviking/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022166883\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/166883-palaceviking/\u0022 rel=\u0022\u0022\u003E@Palaceviking\u003C/a\u003E said, you should mine on Ike, much easier and more efficient and \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/160462-james-kerman/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022160462\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/160462-james-kerman/\u0022 rel=\u0022\u0022\u003E@James Kerman\u003C/a\u003E\u0027s rig looks good, using the claw to dock and transfer fuel to a tanker.\n\u003C/p\u003E\n\u003Cp\u003E\nAs for my own personal tidbit, for large missions I find that mutiple launches make designing the initial ascent from Kerbin stages a million times easier. Better yet, launch top stages without/nearly without fuel and use an \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E refueling station to fill them up before going interplanetary. The reduced weight means you can get by using a much smaller, easier to manage and cheaper launch stages. It all depends on your patience for the number of steps and docking maneuvers you are willing to tolerate before heading off to another planet.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-12-22T15:42:26Z\u0022 title=\u002212/22/2016 03:42  PM\u0022 data-short=\u00227 yr\u0022\u003EDecember 22, 2016\u003C/time\u003E by Ohm is Futile\u003C/strong\u003E\n\u003Cbr\u003EMakes more sense\n\u003C/span\u003E\n"},{"CreatedByName":"Some Kerbal","CreatedById":171846,"CreatedDateTime":"2016-12-23T01:33:29Z","Content":"\n\u003Cp\u003E\nHaving the mining capability at the moment is more of a want to than a requirement. I had it in my head that trying to figure out how to transport a mining operation would be easier than taking enough fuel for extraneous operations like a couple landings with a science ship. \n\u003C/p\u003E\n\u003Cp\u003E\nThanks all. I will ponder on the answers\n\u003C/p\u003E\n"},{"CreatedByName":"Some Kerbal","CreatedById":171846,"CreatedDateTime":"2016-12-23T02:51:40Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222896735\u0022 data-ipsquote-contentid=\u0022153837\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221482402954\u0022 data-ipsquote-userid=\u0022160462\u0022 data-ipsquote-username=\u0022James Kerman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n16 hours ago, James Kerman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nthe claw becomes the fuel delivery system because trying to line up docking ports on uneven terrain is painful.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAm I reading this correctly? You can connect two ships using the claw and then transfer fuel? \n\u003C/p\u003E\n\u003Cp\u003E\nI thought you had to be connected by a docking port\n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2016-12-23T03:24:48Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222897925\u0022 data-ipsquote-contentid=\u0022153837\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221482461500\u0022 data-ipsquote-userid=\u0022171846\u0022 data-ipsquote-username=\u0022Some Kerbal\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n32 minutes ago, Some Kerbal said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAm I reading this correctly? You can connect two ships using the claw and then transfer fuel? \n\u003C/p\u003E\n\u003Cp\u003E\nI thought you had to be connected by a docking port\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou read it correctly. A klaw is a type of docking port. My favorite type, in fact.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"James Kerman","CreatedById":160462,"CreatedDateTime":"2016-12-23T07:42:36Z","Content":"\n\u003Cp\u003E\nYou should test it on your vessel on Kerbin first to make sure the vessel you want to refuel can be \u0022grabbed\u0022 at various angles and inclinations. \n\u003C/p\u003E\n\u003Cp\u003E\nThe claw will merge the rover with the target vessel so I make the rover automated and I get the engineer bonus if I have one in the vessel being refuelled.\n\u003C/p\u003E\n"},{"CreatedByName":"Palaceviking","CreatedById":166883,"CreatedDateTime":"2016-12-23T08:44:00Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222897925\u0022 data-ipsquote-contentid=\u0022153837\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221482461500\u0022 data-ipsquote-userid=\u0022171846\u0022 data-ipsquote-username=\u0022Some Kerbal\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Some Kerbal said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAm I reading this correctly? You can connect two ships using the claw and then transfer fuel? \n\u003C/p\u003E\n\u003Cp\u003E\nI thought you had to be connected by a docking port\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt depends on your settings when you started your career,  whether you unticked allow crossfeed across all parts (can\u0027t remember the wording). \n\u003C/p\u003E\n"},{"CreatedByName":"Some Kerbal","CreatedById":171846,"CreatedDateTime":"2016-12-24T17:34:11Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222898151\u0022 data-ipsquote-contentid=\u0022153837\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221482478956\u0022 data-ipsquote-userid=\u0022160462\u0022 data-ipsquote-username=\u0022James Kerman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 12/22/2016 at 11:42 PM, James Kerman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYou should test it on your vessel on Kerbin first to make sure the vessel you want to refuel can be \u0022grabbed\u0022 at various angles and inclinations. \n\u003C/p\u003E\n\u003Cp\u003E\nThe claw will merge the rover with the target vessel so I make the rover automated and I get the engineer bonus if I have one in the vessel being refuelled.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nJames, I copied your \u0027wide load\u0027 idea above to get an idea but I was having problems getting drive power to the wheels. I put a probe core on top to give me command of the vessel and put it on the launch pad. While I could steer, I did not seem to have power to go forward or backward. The only movement I got was slowly rolling off the pad toward the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E as the pad appears to be slightly unlevel. The breaks did work. I could stop the movement but I could not get the vessel to move in the opposite direction.  It seems like I should. Any idea what I might be doing wrong? I pretty much copied your model above\n\u003C/p\u003E\n"},{"CreatedByName":"Ohm is Futile","CreatedById":172721,"CreatedDateTime":"2016-12-24T20:34:31Z","Content":"\n\u003Cp\u003E\nThe probe core could potentially not be facing the right direction compared to the wheels, which leads to all sorts of strange issues with either wheels or rocket controls.\n\u003C/p\u003E\n"},{"CreatedByName":"James Kerman","CreatedById":160462,"CreatedDateTime":"2016-12-24T23:45:39Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222899769\u0022 data-ipsquote-contentid=\u0022153837\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221482600851\u0022 data-ipsquote-userid=\u0022171846\u0022 data-ipsquote-username=\u0022Some Kerbal\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, Some Kerbal said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nJames, I copied your \u0027wide load\u0027 idea above to get an idea.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nMerry Xmas,\n\u003C/p\u003E\n\u003Cp\u003E\nI have had some problems since the new wheel model was introduced but I do have 2 of these things working.    Also I built those ones before I finished the tech tree so I would upgrade to the ruggedized tyres.\n\u003C/p\u003E\n\u003Cp\u003E\nFirst hack gravity using the debug console (alt \u002B F12 on windows).  Then try disabling drive and steering on one end and see what happens.\n\u003C/p\u003E\n\u003Cp\u003E\nA test to make sure the wheels are not in opposition is to observe them on the pad just steering in one direction or the other.  Are they all rotating correctly or are they opposed?\n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2016-12-25T01:07:14Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222899769\u0022 data-ipsquote-contentid=\u0022153837\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221482600851\u0022 data-ipsquote-userid=\u0022171846\u0022 data-ipsquote-username=\u0022Some Kerbal\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, Some Kerbal said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n I put a probe core on top\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNope. The probe core or other control point must absolutely be facing in the direction you want to be \u0022forward\u0022 -- otherwise you are guaranteed lots of problems. Like wheels fighting each other and not pushing you forward.\n\u003C/p\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2016-12-25T07:07:58Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222897953\u0022 data-ipsquote-contentid=\u0022153837\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221482463488\u0022 data-ipsquote-userid=\u0022154251\u0022 data-ipsquote-username=\u0022bewing\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 23 December 2016 at 2:24 PM, bewing said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYou read it correctly. A klaw is a type of docking port. My favorite type, in fact.\n\u003C/p\u003E\n\u003Cp\u003E\n.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNot any more; Klaws default to no crossfeed allowed now. Which is how it always should have been, really.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen I\u0027m doing a mining operation, I usually don\u0027t bother with a separate mining rig. You lose too much fuel while you\u0027re bringing it to orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nInstead, I normally just build the mining rig into the mothership and land the whole thing. You don\u0027t need a huge vessel if you do it right:\n\u003C/p\u003E\n\u003Ciframe data-embedcontent=\u0022\u0022 frameborder=\u00220\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/153653-kerbodyne-planet-hopper-grand-tour-in-one-launch/\u0026amp;do=embed\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2016-12-25T08:16:26Z","Content":"\n\u003Cp\u003E\nYou don\u0027t need fuel crossfeed if you just use manual transfers. Which work just fine.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"James Kerman","CreatedById":160462,"CreatedDateTime":"2016-12-25T10:03:33Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222900161\u0022 data-ipsquote-contentid=\u0022153837\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221482628034\u0022 data-ipsquote-userid=\u0022154251\u0022 data-ipsquote-username=\u0022bewing\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, bewing said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNope. The probe core or other control point must absolutely be facing in the direction you want to be \u0022forward\u0022\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThanks mate, great advice.  I was wondering why it works properly when I select a claw and \u0022control from here\u0022 but not in other circumstances.\n\u003C/p\u003E\n"},{"CreatedByName":"juvilado","CreatedById":106978,"CreatedDateTime":"2016-12-27T11:16:23Z","Content":"\n\u003Cp\u003E\nI\u0027d make a rocket with a landing module, that landing module has two stages, the bottom is \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E and the top a tiny return probe. For landing aerobraking and some chutes, can use radial engines of return probe to slow down, then refuelled with \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E. If you want, can make \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E mobile attaching wheels, but will be boring to move and the % of ore gain wont be much. Suggest landing on Duna Pole, i think there is better ore.\n\u003C/p\u003E\n"},{"CreatedByName":"psychogre","CreatedById":102521,"CreatedDateTime":"2016-12-30T17:57:21Z","Content":"\n\u003Cdiv style=\u0022color:rgb(0,0,0);font-family:Tahoma;font-size:16px;font-style:normal;font-weight:normal;letter-spacing:normal;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;\u0022\u003E\nLike you, I am intending to go interplanetary \u0027soon\u0027.\u003Cbr\u003E\nMy previous foray (using v0.90) did not go well - ran out of fuel far too soon, and ended up relying on the \u0027infinite fuel\u0027 setting to complete my goal of landing on a few of the moons of Jool.\u003Cbr\u003E\nRestarting my career mode with v1.04, I wanted to do things \u0027right\u0027 on my next interplanetary trip, so bringing along an \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E is a requirement for me.  I\u0027d never used one before, so I set up a mining base on Minmus to get the hang of the whole process.  Rather than a single self-contained setup, I ended up with a collection of smaller landers: drills\u002B\u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E, power\u002Bstorage, fuel ferry, science lander, and an orbiting base ship.\n\u003C/div\u003E\n\u003Cdiv style=\u0022color:rgb(0,0,0);font-family:Tahoma;font-size:16px;font-style:normal;font-weight:normal;letter-spacing:normal;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;\u0022\u003E\n\u003Cimg alt=\u0022audOw79.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022http://imgur.com/audOw79.png\u0022 width=\u00221000\u0022\u003E\u003C/div\u003E\n\u003Cdiv style=\u0022color:rgb(0,0,0);font-family:Tahoma;font-size:16px;font-style:normal;font-weight:normal;letter-spacing:normal;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;\u0022\u003E\nI also started using the \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E/\u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E mods, which has enabled me to also go salvage cast-off rocket stages orbiting Minmus from earlier flights, collect stranded Kerbals and their derelicts - these I attached to those salvaged parts, fueled up and sent them back to Kerbin (I\u0027ve sent some supply ships with extra docking ports, heat shields and parachutes for these operations).  I use the \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E pipe connections to link the mining base ships together, and to also transfer fuel to the ferry ship.\n\u003C/div\u003E\n\u003Cdiv style=\u0022color:rgb(0,0,0);font-family:Tahoma;font-size:16px;font-style:normal;font-weight:normal;letter-spacing:normal;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;\u0022\u003E\n \n\u003C/div\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222896518\u0022 data-ipsquote-contentid=\u0022153837\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221482379884\u0022 data-ipsquote-userid=\u0022171846\u0022 data-ipsquote-username=\u0022Some Kerbal\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 12/21/2016 at 11:11 PM, Some Kerbal said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSay you have a 3 piece mining base - Extractor/converter, fuel holder (something on wheels to shuttle between the converter and the transport ship), and a transport ship to run the goods to orbit - How would you get the pieces to the destination planet? One big conglomeration or multiple ships?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cdiv style=\u0022color:rgb(0,0,0);font-family:Tahoma;font-size:16px;font-style:normal;font-weight:normal;letter-spacing:normal;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;\u0022\u003E\n\u003Cbr\u003E\nOne of your questions has gone unanswered:  how to take a collection of smaller craft on an interplanetary trip.\u003Cbr\u003E\nDocking landers to the front of your main ship may be prone to wobbling during a burn.  My first solution to this problem was a ship that I call the \u0027Bison\u0027, where the lander is tucked on the backside, being \u0027pulled\u0027 along.\n\u003C/div\u003E\n\u003Cdiv style=\u0022color:rgb(0,0,0);font-family:Tahoma;font-size:16px;font-style:normal;font-weight:normal;letter-spacing:normal;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;\u0022\u003E\n\u003Cimg alt=\u00220fXjb3B.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022http://imgur.com/0fXjb3B.png\u0022 width=\u00221000\u0022\u003E\u003C/div\u003E\n\u003Cdiv style=\u0022color:rgb(0,0,0);font-family:Tahoma;font-size:16px;font-style:normal;font-weight:normal;letter-spacing:normal;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;\u0022\u003E\n \n\u003C/div\u003E\n\u003Cdiv style=\u0022color:rgb(0,0,0);font-family:Tahoma;font-size:16px;font-style:normal;font-weight:normal;letter-spacing:normal;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;\u0022\u003E\nHaving had more practice with ship modifications using \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E, I have taken this idea to the next level, connecting two of these \u0027Bison\u0027 ships to make five places for my mining base landers to be docked for an interplanetary trip.  I probably will need to pay attention to the balancing of mass of those docked ships.  This \u0027carrier\u0027 ship is still under construction (a set of 4 NERV engines are enroute), but I am hoping this will all work how I think it should.\n\u003C/div\u003E\n\u003Cdiv style=\u0022color:rgb(0,0,0);font-family:Tahoma;font-size:16px;font-style:normal;font-weight:normal;letter-spacing:normal;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;\u0022\u003E\n\u003Cimg alt=\u0022QelzolE.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022http://imgur.com/QelzolE.png\u0022 width=\u00221000\u0022\u003E\u003C/div\u003E\n\u003Cdiv style=\u0022color:rgb(0,0,0);font-family:Tahoma;font-size:16px;font-style:normal;font-weight:normal;letter-spacing:normal;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;\u0022\u003E\n \n\u003C/div\u003E\n\u003Cdiv style=\u0022color:rgb(0,0,0);font-family:Tahoma;font-size:16px;font-style:normal;font-weight:normal;letter-spacing:normal;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;\u0022\u003E\nThis imgur album shows a bit more of the construction involved: \u003Ca href=\u0022http://imgur.com/a/2k1Vi\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/2k1Vi\u003C/a\u003E\n\u003C/div\u003E\n"},{"CreatedByName":"IncongruousGoat","CreatedById":157062,"CreatedDateTime":"2016-12-30T18:38:12Z","Content":"\n\u003Cp\u003E\n I would argue that bringing an \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E rig along in the first place is unnecessary. The thing is, the rig is heavy, power-hungry, and difficult to use correctly. It\u0027s probably less mass to just build a ship with enough delta-V to do the mission. I mean, it\u0027s Duna, so even without aerobraking or gravity assists the delta-V cost \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E-LDO is only ~1800 m/s. Return is only going to cost 700-800 m/s, since (I assume) you\u0027re aerobraking at Kerbin. Then you just need a couple of small landers for Duna and Ike (and yes, the Ike lander can start in low Duna orbit). With nuclear engines, those transfer delta-V numbers aren\u0027t particularly big. Trying to use \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E here just seems like over-complicating things, especially if this is your first interplanetary voyage.\n\u003C/p\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2016-12-31T05:55:59Z","Content":"\n\u003Cp\u003E\nFor your first interplanetary run, I\u0027d recommend doing it real style.\n\u003C/p\u003E\n\u003Cp\u003E\nFirst, send a one-way robot probe. Then a robot sample return mission. \u003Cem\u003EThen\u003C/em\u003E send some Kerbals.\n\u003C/p\u003E\n\u003Cp\u003E\nGet the trial and error done before you start spreading little green entrails over the scenery.\n\u003C/p\u003E\n"}]}