{"TopicId":153835,"ForumId":20,"TopicTitle":"The mod I want to make (Question for mod making)","CreatedByName":"AntiT","CreatedById":172763,"CreatedDateTime":"2016-12-22T03:51:14Z","PageNum":1,"Articles":[{"CreatedByName":"AntiT","CreatedById":172763,"CreatedDateTime":"2016-12-22T03:51:14Z","Content":"\n\u003Cp\u003E\nI played KSP lots of time. But this is first time using KSP forum. lol\n\u003C/p\u003E\n\u003Cp\u003E\nI want to create a mod that adds an airlock and such a system. As you know, when leave or enter the spacecraft, you need a process of adjusting pressure.\n\u003C/p\u003E\n\u003Cp\u003E\nSo i want to implement that.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat should I do?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E[What I think]\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n - Mk.1 pod opens only once and can not be reentered. (This is because it blows the door.)\n\u003C/p\u003E\n\u003Cp\u003E\n - Other pods or cockpits, cupolas require a decompression process when Kerbals exit and a little air when they enter. (This will be oxygen in TAC LS)\n\u003C/p\u003E\n\u003Cp\u003E\n - You can also put radial or inline airlock to allow the Kerbals to go in and out.\n\u003C/p\u003E\n"},{"CreatedByName":"Ser","CreatedById":104207,"CreatedDateTime":"2016-12-22T07:42:50Z","Content":"\n\u003Cp\u003E\nGood idea. I\u0027d made it even more realistic restricting EVA for all pods and cockpits under insufficient pressure of breathable atmosphere, except for emergency exit (making a pod unusable or the whole vessel lose all the oxygen). If you want to go to space then use airlock. So that would require some additional engineering depending on what you\u0027re going to do, as you cannot just launch any tin can to space and do EVA as much as you wish. Also the airlock part could be placed slightly up the tech tree for some science collection had to be made to research it thus limiting activity in space and making a player stick more to Kerbin at early game.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-12-22T07:45:04Z\u0022 title=\u002212/22/2016 07:45  AM\u0022 data-short=\u00227 yr\u0022\u003EDecember 22, 2016\u003C/time\u003E by Ser\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SpannerMonkey(smce)","CreatedById":50907,"CreatedDateTime":"2016-12-23T17:10:50Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222896508\u0022 data-ipsquote-contentid=\u0022153835\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221482378674\u0022 data-ipsquote-userid=\u0022172763\u0022 data-ipsquote-username=\u0022AntiT\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 22/12/2016 at 3:51 AM, AntiT said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI want to create a mod that adds an airlock and such a system. As you know, when leave or enter the spacecraft, you need a process of adjusting pressure.\n\u003C/p\u003E\n\u003Cp\u003E\nSo i want to implement that.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nInteresting notion and i have a vague recollection of it being tried once before..... The first hurdle that is obvious to me aside from the ton of code needed,  is that non of the stock parts have functioning hatches in any other way than a simple collider switch,  this means that you will either just call the hatch an airlock and let the code do the business, but in the case of your mk1 pod part  1 use example it\u0027s going to look so wrong, you say the hatch is gone but players will see it still there in the model...  Or you create models for the hatches and place them via cfg or code, for every craft you intend to support, Or even harder create replicas of all the stock pods/cockpits  with functioning hatch parts to replace the stock models. \n\u003C/p\u003E\n\u003Cp\u003E\nSo a little more than a weekends project especially if you have limited code or part creation skills, or even lack one of them. I\u0027m sure though if the idea has enough interest for those who like the more realistic side of the game then you\u0027ll find some able hands willing to offer some assistance\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}