{"TopicId":153919,"ForumId":16,"TopicTitle":"Duna Surface Rescue Mission (with MKS Life Support)","CreatedByName":"techgamer17","CreatedById":161843,"CreatedDateTime":"2016-12-23T20:11:25Z","PageNum":1,"Articles":[{"CreatedByName":"techgamer17","CreatedById":161843,"CreatedDateTime":"2016-12-23T20:11:25Z","Content":"\n\u003Cp\u003E\nHi everyone.\n\u003C/p\u003E\n\u003Cp\u003E\nBefore I start, might I explain my recent mission that got me in this scenario...:\n\u003C/p\u003E\n\u003Cp\u003E\nToday I was faced with a contract to plant a flag on Duna, which obviously requires sending a manned mission over there. I accepted it because of the pay which was very high, and the potential science amount that I would get from surface samples ect.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway, I started constructing a ship which was going to be in two parts, the main lander and the transfer stage (which used nuclear engines). I might have to note that I\u0027m using a life support mod to make this playthrough more interesting, longer and harder [MKS Kolonization] Consequently, my ships have to be kitted up with life support stuff and this mission was estimated by me to take about 2.5 years or so, therefore I put the necessary amount of supplies in.\n\u003C/p\u003E\n\u003Cp\u003E\nWhile constructing the ship, the Delta V amount was concerning, but I was okay with it knowing only about 3-4000 \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E is required to get to Duna from \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E and back. I launched the lander into a 100km orbit around Kerbin ready for the transfer stage to dock with it. \n\u003C/p\u003E\n\u003Cp\u003E\nThe transfer stage was launched and docked, but the \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E amount was stupidly low, with about 830 m/s worth on the entire nuclear stage. I worked out why it was this bad after I docked when I realized it was so low because I had EXTRA weight to push to Duna (the heavy lander).\n\u003C/p\u003E\n\u003Cp\u003E\nAfter this, I was in two minds to just de-orbit and recover all of it but I just thought I could do it... The word there being \u0022thought\u0022...\n\u003C/p\u003E\n\u003Cp\u003E\nI burnt out of Kerbin orbit  (which took about 10 minutes I have to add), and then tried to get a decent encounter with Duna. At this part in the trip I had ditched the transfer stage as it had ran out of fuel, only barely getting me out of Kerbin orbit. I had around 1500 m/s worth of \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E in the tank, which didn\u0027t fill me with great happiness. \n\u003C/p\u003E\n\u003Cp\u003E\nI got a reasonable encounter with Duna, which put me in an aerobraking altitude. At this point I had literally 800 m/s in the tank, and I knew it wouldn\u0027t work. \n\u003C/p\u003E\n\u003Cp\u003E\nI landed it on Duna, in the highlands biome, which was cool as no other unmanned probe had been there, meaning extra science points. Strangely the delta v was up to 1100 m/s, but still not enough to even get into Duna orbit. \n\u003C/p\u003E\n\u003Cp\u003E\nNext I eva\u0027d Jeb, collected samples and planted the flag and then went back in the craft. \n\u003C/p\u003E\n\u003Cp\u003E\nNow I\u0027m literally sranded on Duna with 1100 m/s of delta v so I need to launch a rescue mission that will land near the Duna lander so I can take Jeb and Bill home again .\n\u003C/p\u003E\n\u003Cp\u003E\nGetting right to the point of this topic, I need to get a rescue mission over to Duna, which can land near the site and take off again and then get back to Kerbin. How much \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E might I need to accomplish this?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIf anyone can tell me it would be greatly appreciated. \n\u003C/p\u003E\n\u003Cp\u003E\nThanks.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\np.s if this is in the wrong forum, my bad and please move it to the correct one.\n\u003C/p\u003E\n"},{"CreatedByName":"septemberWaves","CreatedById":160814,"CreatedDateTime":"2016-12-23T20:29:35Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/161843-techgamer17/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022161843\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/161843-techgamer17/\u0022 rel=\u0022\u0022\u003E@techgamer17\u003C/a\u003E try \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/87463-121-community-delta-v-map-25-dec-6th/\u0022 rel=\u0022\u0022\u003Ethis delta-v map\u003C/a\u003E. Also, some pictures of your spacecraft would help in diagnosing the problem. I would attempt to provide some direct advice for your situation but I think it would be challenging to do so without seeing the spacecraft you used to get as far as you have. It\u0027s possible that launching a modification of your existing spacecraft would work, but it\u0027s also possible that you might need a complete redesign - it\u0027s impossible to judge without seeing what you have.\n\u003C/p\u003E\n\u003Cp\u003E\nThere are a couple of suggestions which I can make:\n\u003C/p\u003E\n\u003Cp\u003E\n1) It seems like you have a way to calculate your exact delta-v amounts, but you need to consider the payloads for each particular stage. Your transfer stage was inadequate because you did not do this. You can get an accurate reading of the delta-v for your transfer stage by attaching the Duna payload to it in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E (this is what the merge button is useful for).\n\u003C/p\u003E\n\u003Cp\u003E\n2) How confident are you with precision landings? If you are not particularly confident, either experiment with small probes on Minmus or bring along a rover on your Duna rescue mission.\n\u003C/p\u003E\n"},{"CreatedByName":"techgamer17","CreatedById":161843,"CreatedDateTime":"2016-12-23T21:06:32Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222898776\u0022 data-ipsquote-contentid=\u0022153919\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221482524975\u0022 data-ipsquote-userid=\u0022160814\u0022 data-ipsquote-username=\u0022eloquentJane\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n36 minutes ago, eloquentJane said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/161843-techgamer17/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022161843\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/161843-techgamer17/\u0022 rel=\u0022\u0022\u003E@techgamer17\u003C/a\u003E try \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/87463-121-community-delta-v-map-25-dec-6th/\u0022 rel=\u0022\u0022\u003Ethis delta-v map\u003C/a\u003E. Also, some pictures of your spacecraft would help in diagnosing the problem. I would attempt to provide some direct advice for your situation but I think it would be challenging to do so without seeing the spacecraft you used to get as far as you have. It\u0027s possible that launching a modification of your existing spacecraft would work, but it\u0027s also possible that you might need a complete redesign - it\u0027s impossible to judge without seeing what you have.\n\u003C/p\u003E\n\u003Cp\u003E\nThere are a couple of suggestions which I can make:\n\u003C/p\u003E\n\u003Cp\u003E\n1) It seems like you have a way to calculate your exact delta-v amounts, but you need to consider the payloads for each particular stage. Your transfer stage was inadequate because you did not do this. You can get an accurate reading of the delta-v for your transfer stage by attaching the Duna payload to it in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E (this is what the merge button is useful for).\n\u003C/p\u003E\n\u003Cp\u003E\n2) How confident are you with precision landings? If you are not particularly confident, either experiment with small probes on Minmus or bring along a rover on your Duna rescue mission.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOk thanks ive got a rescue probe going down to land at the spot now using the MechJeb landing autopilot, which will land EXACTLY where i tell it to. Ive done this tactic on the Mun loads of times for base building ect. \n\u003C/p\u003E\n"},{"CreatedByName":"septemberWaves","CreatedById":160814,"CreatedDateTime":"2016-12-23T21:21:39Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222898820\u0022 data-ipsquote-contentid=\u0022153919\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221482527192\u0022 data-ipsquote-userid=\u0022161843\u0022 data-ipsquote-username=\u0022techgamer17\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 minutes ago, techgamer17 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOk thanks ive got a rescue probe going down to land at the spot now using the MechJeb landing autopilot, which will land EXACTLY where i tell it to. Ive done this tactic on the Mun loads of times for base building ect. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt sounds like you know what you\u0027re doing a bit more than some people who I\u0027ve seen asking for help with these sorts of things on the forums. In any case, good luck with the rescue mission.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, whilst that delta-v map is accurate, it leaves some details to be desired. A fully propulsive landing on Duna rarely requires more than about 900m/s because landing craft usually end up entering engines-first and thus being draggy enough to aerobrake for 600m/s or more (it\u0027ll need at least 700m/s though, unless you use an enormously tedious high-periapsis re-entry). And for Jool it implies huge delta-v costs for entering orbit, when in reality it\u0027s fairly easy to fine-tune the Jool entry shortly after leaving Kerbin so that you get a free gravity capture thanks to Jool\u0027s moons. Such information is best acquired through experience in playing the game, and to be safe you should probably try to stick to the values it provides as your minimum delta-v. It also seems to only consider prograde equatorial orbits - other orbits take more delta-v to reach from the surface, or more delta-v to reach the surface from that orbit.\n\u003C/p\u003E\n"},{"CreatedByName":"Deddly","CreatedById":62955,"CreatedDateTime":"2016-12-23T21:21:56Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222898751\u0022 data-ipsquote-contentid=\u0022153919\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221482523885\u0022 data-ipsquote-userid=\u0022161843\u0022 data-ipsquote-username=\u0022techgamer17\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, techgamer17 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\np.s if this is in the wrong forum, my bad and please move it to the correct one.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027m guessing Gameplay Questions, but maybe it\u0027s more of a Mission Report? Depends on where you plan on taking the thread \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}