{"TopicId":154057,"ForumId":32,"TopicTitle":"Mun or Minmus?","CreatedByName":"something","CreatedById":157505,"CreatedDateTime":"2016-12-27T01:45:50Z","PageNum":1,"Articles":[{"CreatedByName":"something","CreatedById":157505,"CreatedDateTime":"2016-12-27T01:45:50Z","Content":"\n\u003Cp\u003E\nBoth, the Mun and Minmus are within the Kerbin \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E and going there is cheap and easy. And while the Mun was the first ever celestial body I went to all this excitement concerning the Mun has come to a halt. Analyzing my recent missions, I realized that most of them went to Minmus instead of the Mun. I have a base on Minmus for fuel production, an orbital lab an armada of (\u003Cabbr title=\u0022Vertical Take-Off and Landing\u0022\u003EVTOL\u003C/abbr\u003E) capable spaceplanes on Minmus but none of that on the Mun. In fact, most Mun missions are just flag spamming for new recruits to get them leveled up. Minmus just has a low gravity which makes returning stuff from it pretty easy, so I decided to build a base there...\n\u003C/p\u003E\n\u003Cp\u003E\nAm I the only person to neglect the Mun almost completely?  Beyond getting the science from the Munar/Minmusian biomes - are you visiting both celestial bodies equally, or are you biased towards one of them?\n\u003C/p\u003E\n"},{"CreatedByName":"Big Kerbie","CreatedById":133241,"CreatedDateTime":"2016-12-27T01:55:17Z","Content":"\n\u003Cp\u003E\nI don\u0027t think I\u0027m partial to either one. They both have thier challenges. I think I like going to the Mun best, but like you said, Minmus is easier to work with.\n\u003C/p\u003E\n"},{"CreatedByName":"Ultimate Steve","CreatedById":161505,"CreatedDateTime":"2016-12-27T02:01:27Z","Content":"\n\u003Cp\u003E\nMinmus has more science, more resources, is cheaper in \u003Cabbr title=\u0022Delta-V\u0022\u003EDV\u003C/abbr\u003E to get to, is easy to get into orbit of, and has these easy landing spots.\n\u003C/p\u003E\n\u003Cp\u003E\nThe Mun has more easter eggs, requires less planning to get to, and has extremely dramatic terrain (procedural generation FTW!), plus Kerbin is larger in the sky, making for better screenshots, and therefore is a better setting for mission reports.\n\u003C/p\u003E\n\u003Cp\u003E\nI think they\u0027re fairly equal.\n\u003C/p\u003E\n"},{"CreatedByName":"Vinhero100","CreatedById":170677,"CreatedDateTime":"2016-12-27T02:17:34Z","Content":"\n\u003Cp\u003E\nI would go for minimus. It\u0027s a few 100 more D/V to get to, but it\u0027s easier to make landers that actually have a decent thrust to weight ratio, and it has the ice plains! perfect for bases and transportation. And the scenery is much better than the mun\u0027s, like how you can get a sight of kerbin no matter where you land, unlike the mun which is tidally locked. Plus the mun is a dull gray, but minimus is a ice-cream like moon! Finally, it\u0027s easier to dock with orbiting stations and refulers. Team MINIMUS\n\u003C/p\u003E\n"},{"CreatedByName":"Just Jim","CreatedById":148725,"CreatedDateTime":"2016-12-27T02:21:30Z","Content":"\n\u003Cp\u003E\nIt depends on what I\u0027m doing, but for the most part, I look at Minmus as much easier, especially in the beginning of a career, but the Mun as much more exciting. Minmus can get kind of boring later in a career, but the Mun, however, is full of surprises, and there are places even the most seasoned players avoid. So I go to Minmus to build and refuel, I go to the Mun to play around and get a little crazy... \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-12-27T03:06:49Z\u0022 title=\u002212/27/2016 03:06  AM\u0022 data-short=\u00227 yr\u0022\u003EDecember 27, 2016\u003C/time\u003E by Just Jim\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2016-12-27T02:52:23Z","Content":"\n\u003Cp\u003E\nI too went to Mun first. I didn\u0027t go to Minmus for quite some time and I still remember how it felt to \u0022finally\u0022 get there. I didn\u0027t know at the time how it was essentially the same as Mun to get to and easier to land on and return from.\n\u003C/p\u003E\n\u003Cp\u003E\nThese days, I too ignore Mun for the most part. My basic career path is to get enough science to get \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E (the lion\u0027s share from farming Minmus) and then set up an \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E base (on Minmus) to fuel interplanetary ships (that are - if I\u0027m using Extraplanetary Launchpads - built on Minmus). Mun is - at best - a \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E I fly through on the way to Minmus to help my Kerbals get 3 stars of experience.\n\u003C/p\u003E\n"},{"CreatedByName":"ottothesilent","CreatedById":146852,"CreatedDateTime":"2016-12-27T03:16:23Z","Content":"\n\u003Cp\u003E\nI had heard that Minmus was easier to get to, but I never had any interest in it. To date, I\u0027ve got several hundred Munar landings under my belt, and probably under a dozen Minmus landings.\n\u003C/p\u003E\n"},{"CreatedByName":"Wcmille","CreatedById":151345,"CreatedDateTime":"2016-12-27T03:42:26Z","Content":"\n\u003Cp\u003E\nI have two reasons for Mun:\n\u003C/p\u003E\n\u003Cp\u003E\n1. I \u0022race the clock\u0022 and rarely speed up time for many days on end. I usually work on some other mission, and speed up the game only an hour or two at a time. You can get to Mun in under a day for ~830 \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E. Getting to Minmus takes days.\n\u003C/p\u003E\n\u003Cp\u003E\n2. I also like to have my interplanetary station at Mun, because refueling at Mun is like getting 600 \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E for free when you go interplanetary. You can do this from Minmus, but the Minmus orbital period is much longer, so you can miss ideal launch windows, and you don\u0027t get a nice, flat, ejection.\n\u003C/p\u003E\n\u003Ciframe data-embedcontent=\u0022\u0022 frameborder=\u00220\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/147616-most-efficient-way-from-minmus-refueling-station-to-interplanetary/\u0026amp;do=embed\u0026amp;comment=2757233\u0026amp;embedComment=2757233\u0026amp;embedDo=findComment#comment-2757233\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Nathair","CreatedById":102894,"CreatedDateTime":"2016-12-27T03:57:40Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222901593\u0022 data-ipsquote-contentid=\u0022154057\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221482804087\u0022 data-ipsquote-userid=\u0022161505\u0022 data-ipsquote-username=\u0022Ultimate Steve\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Ultimate Steve said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMinmus has more science, more resources, is cheaper in \u003Cabbr title=\u0022Delta-V\u0022\u003EDV\u003C/abbr\u003E to get to\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222901601\u0022 data-ipsquote-contentid=\u0022154057\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221482805054\u0022 data-ipsquote-userid=\u0022170677\u0022 data-ipsquote-username=\u0022Vinhero100\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Vinhero100 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI would go for minimus. It\u0027s a few 100 more D/V to get to\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nUm...\n\u003C/p\u003E\n"},{"CreatedByName":"Randazzo","CreatedById":136468,"CreatedDateTime":"2016-12-27T04:01:11Z","Content":"\n\u003Cp\u003E\nI\u0027ve always gone to the Mun first. It\u0027s just the most obvious target. Plus it has the allure of going to the \u0022Moon\u0022, arguably the most well-known missions of human space flight.\n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2016-12-27T04:20:28Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222901680\u0022 data-ipsquote-contentid=\u0022154057\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221482811060\u0022 data-ipsquote-userid=\u0022102894\u0022 data-ipsquote-username=\u0022Nathair\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n21 minutes ago, Nathair said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nUm...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt\u0027s cheaper to get to Mun, but cheaper to do a complete return mission to Minmus.\n\u003C/p\u003E\n"},{"CreatedByName":"Draco T stand-up guy","CreatedById":159383,"CreatedDateTime":"2016-12-27T04:26:10Z","Content":"\n\u003Cp\u003E\nMy plans for my present career is a Munar refuelling station utilising an ore shuttle or three between the station and the Munar surface. Mine the ore on Mun, ship it to the Munar Station where it\u0027s processed and then use it to fuel interplanetary ships which would also be constructed in Munar orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThat\u0027s the theory any way.\n\u003C/p\u003E\n"},{"CreatedByName":"kball","CreatedById":168090,"CreatedDateTime":"2016-12-27T04:55:24Z","Content":"\n\u003Cp\u003E\nI think I\u0027m split pretty even between the two as I find pros and cons to both.\n\u003C/p\u003E\n\u003Cp\u003E\nMinmus pros: less \u003Cabbr title=\u0022Delta-V\u0022\u003Edv\u003C/abbr\u003E, easy to land, marshmallowy\n\u003C/p\u003E\n\u003Cp\u003E\nCons: annoying mid course plane change, everything bounces around on the surface, have to be a little more careful on return reentry\n\u003C/p\u003E\n\u003Cp\u003E\nMun pros: simple to get to, stabler surface ops, more majestic, grand, mysterious\n\u003C/p\u003E\n\u003Cp\u003E\ncons: Precise landings can be stressful, tidally locked (less an issue with commnet i guess), lots of \u003Cabbr title=\u0022Delta-V\u0022\u003Edv\u003C/abbr\u003E \n\u003C/p\u003E\n"},{"CreatedByName":"IncongruousGoat","CreatedById":157062,"CreatedDateTime":"2016-12-27T05:23:23Z","Content":"\n\u003Cp\u003E\nMinmus, but only because of the caveman challenge, since it\u0027s so much easier to build a rover/science return capsule thingy for Minmus within the part and mass constraints. Beyond that, their differences might as well be so much Swiss cheese. My goals are in interplanetary space and I like one-off launches, never having been one for orbital assembly or fuel depots or mining bases.\n\u003C/p\u003E\n\u003Cp\u003E\nMinmus\u0027s smoother terrain is nice, though.\n\u003C/p\u003E\n"},{"CreatedByName":"MinimalMinmus","CreatedById":172387,"CreatedDateTime":"2016-12-27T08:50:55Z","Content":"\n\u003Cp\u003E\nI\u0027m somewhere in-between because I prefer Minmus, yet I go for the Mun more often because it is more challenging, and I want to visit every easter eggs in my savefile (by planting a flag on everyone), so obviously it\u0027s 6 EE versus 2 for Minmus. Also, the mission time to Mun is generally about 3 days, versus 2 weeks for Minmus.\n\u003C/p\u003E\n"},{"CreatedByName":"something","CreatedById":157505,"CreatedDateTime":"2016-12-27T11:26:10Z","Content":"\n\u003Cp\u003E\nWhen going interplanetary with big vessels, I usually ship the fuel to \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E in order to get myself a nice ejection with lots of Oberth. So it rarely matters where it comes from but since Minmus has lower \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E requirements, that\u0027s the place I mine...\n\u003C/p\u003E\n"},{"CreatedByName":"idamoofus","CreatedById":170167,"CreatedDateTime":"2016-12-27T15:32:23Z","Content":"\n\u003Cp\u003E\nI\u0027ve heard a lot of people give the advice (and I might agree) that new players should go to Minmus before the Mun. I\u0027d say it is easier overall, and will help prepare the inexperienced for a more challenging Mun landing.\n\u003C/p\u003E\n"},{"CreatedByName":"Birdco_Space","CreatedById":151699,"CreatedDateTime":"2016-12-28T07:27:07Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222901700\u0022 data-ipsquote-contentid=\u0022154057\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221482812770\u0022 data-ipsquote-userid=\u0022159383\u0022 data-ipsquote-username=\u0022Draco T stand-up guy\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn ‎12‎/‎27‎/‎2016 at 6:26 AM, Draco T stand-up guy said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMy plans for my present career is a Munar refuelling station utilising an ore shuttle or three between the station and the Munar surface. Mine the ore on Mun, ship it to the Munar Station where it\u0027s processed and then use it to fuel interplanetary ships which would also be constructed in Munar orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThat\u0027s the theory any way.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt\u0027s more efficient to refine the fuel on the mun, and shuttle it up, as you need a larger engine to lift what you mine, the weight of the refinery is a smaller % of your available thrust (though fueling from the mun is less efficient than minmus in total).   On Minmus, the opposite is true, due to the lower gravity.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWhen it comes to Refining operations, I prefer setting it up on the Mun, as the Mun is easier and quicker to get to than minmus, and thus allows a higher throughput of fuel movement to \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E with a set number of Tankers. \n\u003C/p\u003E\n"},{"CreatedByName":"Whisky Tango Foxtrot","CreatedById":172896,"CreatedDateTime":"2016-12-28T17:56:41Z","Content":"\n\u003Cp\u003E\nI spend more time around Minmus since its low gravity and flat surfaces made it easier to set up a mining base there, plus my Minmus Station contract required that the station be significantly larger than the Mun\u0027s and hold more fuel, necessitating that I put more priority on it. That multi-day travel time (plus the several aerobraking passes necessary to lower your apoapsis to \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E) is annoying, though, so I\u0027m looking forward to getting my Mun mining base up and running (I\u0027ve got the drill, tanks, converter and electrics landed already, but it\u0027s very tall and on a slight slope which make the whole thing lean over dangerously when I have a fuel tanker lander docked to the top. I\u0027ve got some new modules that I\u0027m going to attach to the sides of the base that should increase stability, but I\u0027m vacation right now and away from my main computer so that mission is going to have to wait until I get back.)\n\u003C/p\u003E\n"},{"CreatedByName":"phantom000","CreatedById":160599,"CreatedDateTime":"2016-12-29T03:28:23Z","Content":"\n\u003Cp\u003E\nI landed on Mun a couple times but after my 3rd straight failure to land and return I gave up on it and headed for Minmus. Minmus is harder to reach because it is farther away, has an inclined orbit relative to Kerbin and less gravity means your transition burn has to be more precise. Once there, getting down and back up is so much easier because of the lower gravity and smoother terrain. I have been to every biome on Minmus but have only visited Mun about three times.\n\u003C/p\u003E\n\u003Cp\u003E\nFor a new player i might suggest just skipping Mun altogether and go to Minmus first then come back for Mun later.\n\u003C/p\u003E\n"},{"CreatedByName":"Birdco_Space","CreatedById":151699,"CreatedDateTime":"2016-12-29T06:10:23Z","Content":"\n\u003Cp\u003E\nFor a new player playing Career, I would recommend orbital science around the Mun first, as orbit there is easier.  then plow that science into a lander for Minmus to do biome hopping.  Finally, use that science to build a Science lab mother ship and a small lander refueled from the station to gather all the biome science from the Mun and process for science and funds.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe Mun is a great training ground for extra terrestrial bodies like Moho, Ike, Dres, Eeloo, Val, and to a lesser extent Tylo and Duna, as the efficient method of landing there works for all these bodies.  For the first 5 bodies, a lander that works on Mun can be used on them with only minor mods for \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E, Delta V, and managing Electric charge and communications.  I like to take a new lander design there to optest it in career before sending one out on a multi year journey just to find out the design is missing some important features \n\u003C/p\u003E\n"},{"CreatedByName":"Aegolius13","CreatedById":165625,"CreatedDateTime":"2016-12-29T20:08:25Z","Content":"\n\u003Cp\u003E\nMinmus is definitely \u0022\u003Cabbr title=\u0022Original Post(er). The first post in a thread, or the person who posted it.\u0022\u003EOP\u003C/abbr\u003E\u0022 compared to the Mun in terms of getting science or refueling/mining.  Eventually you\u0027ll want the science from both, but Minimus is an easier start for sure.  \n\u003C/p\u003E\n\u003Cp\u003E\nHowever, I think the Mun is more useful as an interplanetary launch point (if you\u0027re into that sort of thing).  Since the Mun has a much shorter orbital period, you should be able to eject closer to the ideal launch window timing.  I would imagine the increased Oberth also compensates for Minmus\u0027 location higher in in Kerbin\u0027s gravity well.  \n\u003C/p\u003E\n"},{"CreatedByName":"FleshJeb","CreatedById":111640,"CreatedDateTime":"2016-12-30T00:35:24Z","Content":"\n\u003Cp\u003E\nThe Mun, because I can test lander and rover designs for Moho, Ike, Dres, Vall, and Eeloo there. It\u0027s close by, the gravity is similar, and the terrain is brutal. It\u0027ll even work for Duna and Tylo in a pinch. I just set the percentage on my engines to match the \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E I\u0027d get on those worlds. (Tylo: 0.167/0.800 = 21%)\n\u003C/p\u003E\n"},{"CreatedByName":"something","CreatedById":157505,"CreatedDateTime":"2016-12-31T12:43:15Z","Content":"\n\u003Cp\u003E\nSo far it seems as if the player base is fairly equally split between Mun and Minmus. Something around 6 favor the Mun, to 5 in between and 5 favor Minmus (if I counted correctly). Certainly, this is no representative user base, but well, you gotta take what you get...\n\u003C/p\u003E\n"},{"CreatedByName":"mrclucks","CreatedById":139561,"CreatedDateTime":"2017-01-02T21:29:07Z","Content":"\n\u003Cp\u003E\nI prefer minmus more than the mun.  Minmus has much lower gravity and many flat grounds (especially ones at ASL) which make it much easier to land and do hops to gather some sweet science.  I actually go to other planets before the mun, unless i am doing a fly by or just getting into orbit.  Only exception is if I am trying to do a whole bunch of minmus/mun tourist contracts and there are a few tourists who want to land on the mun\n\u003C/p\u003E\n"}]}