{"TopicId":154126,"ForumId":44,"TopicTitle":"New, Conductive Composites?","CreatedByName":"Jonfliesgoats","CreatedById":168077,"CreatedDateTime":"2016-12-28T16:51:34Z","PageNum":1,"Articles":[{"CreatedByName":"Jonfliesgoats","CreatedById":168077,"CreatedDateTime":"2016-12-28T16:51:34Z","Content":"\n\u003Cp\u003E\nLooks like Bombardier is adopting a British University\u0027s system of carbon nanotubes to make conductive composites. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://spectrum.ieee.org/nanoclast/aerospace/aviation/carbon-nanotubes-make-aerospace-composites-conduct\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://spectrum.ieee.org/nanoclast/aerospace/aviation/carbon-nanotubes-make-aerospace-composites-conduct\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nHow would the self-healing properties work?\n\u003C/p\u003E\n"},{"CreatedByName":"wumpus","CreatedById":133850,"CreatedDateTime":"2016-12-29T15:17:50Z","Content":"\n\u003Cp\u003E\nMost probably the same way modern silicon works.  You simply have excess logic/memory and only use the \u0022good\u0022 ones.  With data this is wildly more effective, since there exist algorithms that can store the \u0022backup\u0022 (call parity in the literature, but vastly more effective than the simple parity bits users used to encounter).  The chip then reads the data\u002Bparity and computes the corrected data (you need at least two bits of parity for every error in data\u002Bparity).  Last I heard, if you weren\u0027t pushing the limits of these systems, you didn\u0027t have enough density to be effective.\n\u003C/p\u003E\n\u003Cp\u003E\nLogic is a bit more basic.  Often multiple cores are produced, and only the working ones shipped set to work.  The chips in the PS3 were made with 8 cell processors, with one locked out (had there been a defective one, it would be locked out).  Note that for space applications, volume is so low that FPGAs are ideal.  FPGAs are basically \u0022programmable logic\u0022 that include massive amounts of transistors to emulate more massed produced chips (although typically at a cost in speed, money, and power consumption).  However in space applications, should one array be fried thanks to a cosmic ray or other space environment nastiness, ground control could ship up a new logic \u0022program\u0022 that doesn\u0027t use that particular array.  Note that \u0022self healing\u0022 this way (without re-computing and downloading from somebody with the source and expensive compiling software) would include some rather nasty delays (above and beyond the in-circuit delays already part of FPGA design).\n\u003C/p\u003E\n"},{"CreatedByName":"Jonfliesgoats","CreatedById":168077,"CreatedDateTime":"2016-12-30T05:50:00Z","Content":"\n\u003Cp\u003E\nI am interested, but I am having trouble following.  Are you saying that a material, like a carbon-fiber composite can be imbued with a memory or some sort of processing power?  And if these materials can be self healing, as briefly mentioned in the article, does that mean the carbon nanotubes can be reconfigured to original with, say, a heat treatment?  Does this also mean that an embedded circuit can be rewired at will?  \n\u003C/p\u003E\n\u003Cp\u003E\nComposites now are vulnerable to impact damage.  Hail that would cause cosmetic denting is destructive to composites.  Lightning and static dissipation requires conductive coatings and/or conductors to static wicks.  Does this stuff, theoretically, offer solutions to field maintenance on composites and electrical dissipation?\n\u003C/p\u003E\n"}]}