{"TopicId":154143,"ForumId":39,"TopicTitle":"Working on the script for a feature-length KSP film!","CreatedByName":"JKerman","CreatedById":166532,"CreatedDateTime":"2016-12-29T00:07:18Z","PageNum":1,"Articles":[{"CreatedByName":"JKerman","CreatedById":166532,"CreatedDateTime":"2016-12-29T00:07:18Z","Content":"\n\u003Cp\u003E\nI had an idea for a full-length feature film about the history of the space program\u0027s most well-known pilot: Jebediah Kerman! Many of you may not know this, but I AM Jebediah, and the film would be based off of true events which happened in my youth. Surprisingly, as a young pilot-in-training, I was actually quite a coward! I could barely sit in a cockpit without screaming my head off. The film would cover the story of how, when I was still in training, an \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E test failed, killing most of the test pilots, and causing the rest to leave. I was the only one left, because I\u0027d never heard about the disaster. At the same time, \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E workers had forgotten to put gyros onto the 50-million-fund Kerbal XXVI Mun mission, requiring a probe send them up after launch to add them to the spacecraft, piloted by Bill and Bob. However, with the munar intercept burn rapidly approaching, the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E had no probe cores, and required a pilot to perform the few simple tasks that pod-mounted autopilots could not do. I, being the only pilot left, was reluctantly selected to pilot the ship. I was tricked into thinking I was testing a simulator, then beaten unconscious and put into the capsule. When I woke up I was launched kicking and screaming into space. The docking went well, but I mistakenly jettisoned my own capsule, and therefore had to go to the Mun with Bill and Bob, and out-of-control adventure that, upon landing back at Kerbin, turned me into the cold-blooded badass I am today.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nLet me know what you think about the idea for a movie that tells the true story of my life!\n\u003C/p\u003E\n"},{"CreatedByName":"steuben","CreatedById":77368,"CreatedDateTime":"2016-12-29T00:50:28Z","Content":"\n\u003Cp\u003E\nBetter to ask in the fan works section than here. You can ask a mod to move this thread.\n\u003C/p\u003E\n\u003Cp\u003E\nto answer the question... It feels like a standard shanghaied to disaster and adventure plot. So it will depend on the finer details of your story and script.\n\u003C/p\u003E\n\u003Cp\u003E\nwithout knowing what your rodeo count looks like, I\u0027m going say write up the first 15 minutes of the script and post it for comment in fan works. Any of us in the will be able to provide pointers, critiques, and suggestions for additional resources.\n\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2016-12-30T03:55:50Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYou can ask a mod to move this thread. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nDone. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \n\u003C/p\u003E\n"},{"CreatedByName":"JKerman","CreatedById":166532,"CreatedDateTime":"2016-12-31T01:53:41Z","Content":"\n\u003Cp\u003E\nI just decided that it would be too long to fit into a movie, so I\u0027m going to make a series. It would be a bunch of 15-minute episodes, each sequentially telling more of the story of the Kerbal Space Program, all the way from its start more than 90 years ago. I have so far written one episode. It\u0027s about how Werner Von Kerman and his assistant Frederick were kicked out of the Kerbal Aeronautical Society for wasting money. Werner and Frederick subsequently found an old warehouse for sale on an island near the shore (today the location of the abandoned airfield), where they discovered the old, yellowed scientific papers written by Tchaikovsky Kerman more than 120 years prior. They then used the equations Tchaikovsky had written as a basis for the beginning of the Kerbal Space Program. Any ideas for episode 2? Keep in mind, though, that in real life, the two started out knowing absolutely nothing about rocketry, so failures were numerous, and I want to keep the show firmly grounded in reality. \n\u003C/p\u003E\n"},{"CreatedByName":"MinimalMinmus","CreatedById":172387,"CreatedDateTime":"2016-12-31T20:26:24Z","Content":"\n\u003Cp\u003E\nI like the idea! How about an episode during the second Kerbin war? It was the  invention of the first LFE s (for the V2) as well as the SRBs. Carreer-wise, it can be assimilated to the first flights, before the first sub orbitals.\n\u003C/p\u003E\n"},{"CreatedByName":"swjr-swis","CreatedById":152460,"CreatedDateTime":"2016-12-31T21:25:13Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222905801\u0022 data-ipsquote-contentid=\u0022154143\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221483149221\u0022 data-ipsquote-userid=\u0022166532\u0022 data-ipsquote-username=\u0022JKerman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n19 hours ago, JKerman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nTchaikovsky\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nJust a quick remark: Tchaikovsky = music composer. Tsiolkovsky = rocket scientist.\n\u003C/p\u003E\n"},{"CreatedByName":"JKerman","CreatedById":166532,"CreatedDateTime":"2017-01-04T23:26:53Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222906535\u0022 data-ipsquote-contentid=\u0022154143\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221483219513\u0022 data-ipsquote-userid=\u0022152460\u0022 data-ipsquote-username=\u0022swjr-swis\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn ‎12‎/‎31‎/‎2016 at 1:25 PM, swjr-swis said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nJust a quick remark: Tchaikovsky = music composer. Tsiolkovsky = rocket scientist.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI did that on purpose to make it funny.\n\u003C/p\u003E\n"},{"CreatedByName":"swjr-swis","CreatedById":152460,"CreatedDateTime":"2017-01-04T23:37:09Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222910822\u0022 data-ipsquote-contentid=\u0022154143\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221483572413\u0022 data-ipsquote-userid=\u0022166532\u0022 data-ipsquote-username=\u0022JKerman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 minutes ago, JKerman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI did that on purpose to make it funny.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWe at the FBI do not have a sense of humor we\u0027re aware of.\n\u003C/p\u003E\n"},{"CreatedByName":"Ozymandias_the_Goat","CreatedById":159377,"CreatedDateTime":"2017-01-04T23:52:17Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222906489\u0022 data-ipsquote-contentid=\u0022154143\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221483215984\u0022 data-ipsquote-userid=\u0022172387\u0022 data-ipsquote-username=\u0022MinimalMinmus\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 12/31/2016 at 3:26 PM, MinimalMinmus said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHow about an episode during the second Kerbin war?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nMy story for the four orange suits was that they met as soldiers in a Kerbal war, a battle of five armies sort of thing. It makes sense that the \u0022mostly reliable\u0022 KSP tech was developed for that. Good idea!\n\u003C/p\u003E\n"},{"CreatedByName":"steuben","CreatedById":77368,"CreatedDateTime":"2017-01-05T00:41:15Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222905801\u0022 data-ipsquote-contentid=\u0022154143\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221483149221\u0022 data-ipsquote-userid=\u0022166532\u0022 data-ipsquote-username=\u0022JKerman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn Friday, December 30, 2016 at 8:53 PM, JKerman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nKeep in mind,that in real life, the two started out knowing absolut el y nothing about rocketry, so failures were numerous, and I want to keep the show firmly grounded in  reality. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nReality? This! Is! KSP!\n\u003C/p\u003E\n\u003Cp\u003E\nYou may want to go with grounded within kerbal reality rather than ours. It will make things a bit easier. Especially since there is not a perfect one to one mapping between the two. \n\u003C/p\u003E\n\u003Cp\u003E\nAs for the everyone meets in a war background. Yeah it works but it\u0027s been done a fair bit. That is not to say the some of the characters can\u0027t have combat experience. If you go down that road go for something different. For example jeb and val both fought in the last war, on the same front, but on opposite side and frequently against each other directly.\n\u003C/p\u003E\n\u003Cp\u003E\nAs for direction... asking the gallery can be dangerous. You\u0027ll get lots of suggestions but little direction. It can work but you will need to keep your hands on the reigns and know where you\u0027re going. That being said ep 2 and 3 should be them exploring the fuels and the engines. \u0022Ignition!\u0022 by Clark would be a good backgrounder for it. \n\u003C/p\u003E\n"},{"CreatedByName":"JKerman","CreatedById":166532,"CreatedDateTime":"2017-01-05T02:36:01Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222910897\u0022 data-ipsquote-contentid=\u0022154143\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221483576875\u0022 data-ipsquote-userid=\u002277368\u0022 data-ipsquote-username=\u0022steuben\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, steuben said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nReality? This! Is! KSP!\n\u003C/p\u003E\n\u003Cp\u003E\nYou may want to go with grounded within kerbal reality rather than ours. It will make things a bit easier. Especially since there is not a perfect one to one mapping between the two. \n\u003C/p\u003E\n\u003Cp\u003E\nAs for the everyone meets in a war background. Yeah it works but it\u0027s been done a fair bit. That is not to say the some of the characters can\u0027t have combat experience. If you go down that road go for something different. For example jeb and val both fought in the last war, on the same front, but on opposite side and frequently against each other directly.\n\u003C/p\u003E\n\u003Cp\u003E\nAs for direction... asking the gallery can be dangerous. You\u0027ll get lots of suggestions but little direction. It can work but you will need to keep your hands on the reigns and know where you\u0027re going. That being said ep 2 and 3 should be them exploring the fuels and the engines. \u0022Ignition!\u0022 by Clark would be a good backgrounder for it. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nKeep in mind that I am Jebediah Kerman, and I have read all the history books.\n\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2017-01-05T13:15:01Z","Content":"\n\u003Cp\u003E\nI agree with Steuben that war as a background to the KSP has been done a fair bit. That\u0027s no reason not to do it of course but I also agree with Steuben\u0027s comment about going for something different if you do.\n\u003C/p\u003E\n\u003Cp\u003E\nAs an alternative source of inspiration you could look at the various amateur rocketry clubs and space societies that sprang up before the 2nd World War. \u003Ca href=\u0022https://en.wikipedia.org/wiki/British_Interplanetary_Society\u0022 rel=\u0022external nofollow\u0022\u003EThe British Interplanetary Society \u003C/a\u003Efor example, or the \u003Ca href=\u0022https://en.wikipedia.org/wiki/Verein_f%C3%BCr_Raumschiffahrt\u0022 rel=\u0022external nofollow\u0022\u003EVerein für Raumschiffahrt \u003C/a\u003Ein Germany. There was a Russian one too but I forget the name. What they all had in common though was a dream of going to space - and rockets were the way to get there.\n\u003C/p\u003E\n\u003Cp\u003E\nOn Earth of course, rockets were adapted as weapons first and space launchers second (and then primarily as a propaganda tool to begin with). However, the \u003Cem\u003Eoriginal\u003C/em\u003E spirit of the rocketry clubs - peaceful exploration of space by amateurs - would make a pretty good background to the KSP in my opinion. Going with that approach also fits with your idea of the early KSP knowing nothing about rocketry.\n\u003C/p\u003E\n\u003Cp\u003E\nFinally, if you\u0027ll forgive the shameless plug, your opening episode isn\u0027t a million miles away from my own headcanon. You\u0027re welcome to borrow any bits that look useful although you\u0027ll probably have your own, better ideas!\n\u003C/p\u003E\n\u003Cp\u003E\nThe very beginning (as told on the way back from the Mun.)\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nJames squeezed the last of the creva stew out of his ration pack and chewed it thoughtfully. He glanced at the comms panel, checking that the air to ground loop with Mission Control was switched off, then turned to face his crew.\n\u003C/p\u003E\n\u003Cp\u003E\n“Wernher,\u0022 he said at last. “Now that we\u0027ve finally got some downtime, perhaps you could answer a question for me?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nWernher looked at him quizzically. “I can try,\u0022 he replied. “What is it?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n“TMI,\u0022 said James slowly, “I saw your face when Jeb came on-loop - it looked like you were expecting it?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nWernher shrugged. “I wasn\u0027t told either,\u0022 he said, “but Jeb\u0027s been working towards this flight since he was a student at the Institute. If he wasn\u0027t up here himself, not a single kerbal in the \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E would have begrudged him the flight director\u0027s seat, Gene least of all.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nSherfel blinked. “How old is Jeb?\u0022 she asked.\n\u003C/p\u003E\n\u003Cp\u003E\n“He was nearly nine years out of the Institute when we launched the Kerbal 1,\u0022 Wernher said quietly, “and that wasn\u0027t yesterday.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nFor the first time that Wernher could remember, James looked genuinely impressed. “That\u0027s a long time,\u0022 he said softly. “And when his dream flight came up, he still didn\u0027t pull the boss slot.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n“No,\u0022 said Wernher. “We would have given it to him, but Jeb\u0027s always been scrupulous about fair crew selection. You wouldn\u0027t have guessed it from my tutorial group, but he\u0027s grown up to be one hell of a leader. I doubt anybody else could have kept us going long enough to see the Kerbal 1 fly.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n“You were Jeb\u0027s \u003Cem\u003Etutor\u003C/em\u003E?\u0022 exclaimed Sherfel.\n\u003C/p\u003E\n\u003Cp\u003E\nWernher nodded. “And supervisor for his final year project.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nSherfel caught the shift in his voice. “Sounds like there\u0027s a story there,\u0022 she said, checking the flight clock. “And we\u0027ve got a couple of hours before the next systems check. I could use something to pass the time.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n--------------\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EThe canteen doors swung shut. Wernher looked curiously at Jeb Kerman, sitting alone at a nearby table, prodding an unappetising mush of tubers, beans and greens around his plate. He walked over and sat down by the younger kerbal.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E“Mind if I join you, Jeb?\u0022\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EJeb laughed hollowly, “Sure. There might even be some stew left if you\u0027re unlucky.\u0022\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EWernher\u0027s face fell as he took in the empty canteen. “Oh well,“ he said, “Looks like sandwiches again. Anyhow - what\u0027s up, Jeb? Not like you to be sitting here on your own.\u0022\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EJeb looked moodily at his tutor. “Final year project.\u0022 he said briefly, “Still can\u0027t think of anything to do.\u0022\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E“I thought you were helping Bill with his stability augmentation system?\u0022 said Wernher.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E“Yeah, I thought about that,\u0022 said Jeb, “but I want to \u003C/em\u003Ebuild\u003Cem\u003E something, Wernher. Not a mockup for a wind tunnel, not a chunk of circuitry to plug into a test sim. I want to take something outside and see it \u003C/em\u003Efly.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E“Ahh,\u0022 said Wernher carefully, “I think I see the problem.\u0022\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EJeb pushed his plate away. “Yeah. I don\u0027t think a hobby shop plane is really going to cut it. What about you, Wernher? How are the jet intakes working?\u0022\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EWernher glanced around surreptitiously. “Variable geometry pre-cooling intakes,\u0022 he said absently, \u0022Theory looks sound, if I can build a light enough heat exchanger.\u0022 He looked at Jeb thoughtfully. “I\u0027ve been working on a side project though.\u0022 He got to his feet. “C\u0027mon. I think you need to see this.\u0022\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EThe two kerbals crossed the main quadrangle of the Kerbin Aeronautical Research Institute and headed for the large blocky building of the Jet Propulsion Department. As they walked, Jeb tried to keep up with Wernher\u0027s muttered monologue.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E“So anyway, I figured that if you can\u0027t get enough air through the intake at that altitude, then why not store it onboard. Or if not air, then something that would do the same job. Then I realised that you could power the whole aircraft like that - and with a much simpler engine. Just a pair of turbo-pumps, a combustion chamber and a nozzle really, although getting the details right was tricky. I thought about solids for a bit but they\u0027re not very controllable.\u0022\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EJeb choked. “You seriously thought about propelling an aircraft with fireworks?\u0022 he spluttered.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EWernher looked around frantically. “Shhhhh,\u0022 he whispered, “Yes, fireworks basically, but a bit more refined.\u0022 He pulled a key out of his pocket and unlocked the side door to the JPD. They hurried down the corridor to Wernher\u0027s workshop.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E“What\u0027s all this whispering and secrecy for?\u0022 asked Jeb.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EWernher gave him a sidelong look. “Well partly it\u0027s because I\u0027m not really ready to show this to anyone yet,\u0022 he said, “but also, I\u0027ve ummm borrowed one or two things from the lab to build the D1.\u0022\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E“D1?\u0022 said Jeb.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E“Demo 1,\u0022 said Wernher, stuffing equipment into two large bags. Jeb spotted a pair of gas cylinders and what looked like a tripod stand. “Not a very original name I admit, but nice and anonymous. OK, that\u0027s everything - let\u0027s go!\u0022\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E“Wernher - what on Kerbin is wrong with the Institute test range?\u0022\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E“I told you, Jeb - I\u0027m not ready to show this to anyone yet. You\u0027re only getting a sneak peek because you were looking so damn miserable in the canteen. Right - here we are.\u0022\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EJeb wiped the sweat from his forehead. The Institute buildings were safely out of sight, hidden by the hillside and a small copse of trees. The ground underfoot was hard packed and rocky and Wernher was having trouble setting up his tripod.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E“Ooof, OK that\u0027s far enough. Test rig next.\u0022\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EJeb looked at the spindly contraption. “Hold on.\u0022 he said slowly. “Isn\u0027t that...\u0022\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E“Borrowed!\u0022 said Wernher, “And I haven\u0027t done anything to it. Well, nothing that I can\u0027t undo anyway. Right - propellant tanks next.\u0022 He hung the gas cylinders on the makeshift test stand. Jeb raised his eyebrows as he recognised the name of a well known brand of camping gas stencilled on the side of one of them.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E“Stove gas, Wernher?\u0022\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E“Yes, yes, stove gas and nitrous oxide. OK, propellant lines are secure, just need to plug in the control box...\u0022\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EJeb eyed the finished article skeptically. The D1 seemed to consist of an oddly shaped nozzle attached to a metal ball which was studded with bits and pieces of equipment. Two thin hoses connected the ball to the gas cylinders, and the whole unlikely contrivance hung from the tripod on a rather expensive set of strain gauges. Cables trailed from various points into the control box in Wernher\u0027s hands.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E“Are you sure about this, Wernher?\u0022\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E“Perfectly sure. Here we go.\u0022\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EJeb glanced around for the nearest rock to hide behind as Wernher started mumbling to himself. \u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E“Valves open...gas generator on...\u0022\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EA small flame appeared at the tip of a tube.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E“Pumps spinning up - and ignition!\u0022\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EJeb heard a sharp metallic clicking from the depths of Wernher\u0027s contraption, jumping backwards as a gust of flame shot out of the nozzle with a whump of exploding gas. With a steadily building roar, the gust quickly focused into a bright blue flame. Jeb laughed.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E“It even sounds like a camping stove, Wernher.\u0022\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EWernher\u0027s only response was to point at the strain gauge assembly. Jeb leaned gingerly forward.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E\u0022Hey - not bad.\u0022 Then a thought struck him. “Wernher - you designed this for high altitude flight right? How high is high exactly?\u0022\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EWernher shrugged. “Whatever you like, provided there\u0027s still enough air for the wings.\u0022\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E“What about a vacuum?\u0022 Jeb raised his hand. “Yeah, yeah, can\u0027t fly in a vacuum I know,  but the engine should still work right?\u0022\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E“It should work better in a vacuum,\u0022 said Wernher slowly. “but why a.... oh you can\u0027t be serious, Jeb?\u0022\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EJeb\u0027s eyes gleamed. “Oh yes I can, Wernher. I think we need to give your camping stove a new name and I\u0027m thinking that LV-1 has a nice ring to it.\u0022\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E“LV-1?\u0022\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003E“Launch Vehicle One, Wernher. Launch. Vehicle. One!\u0022\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nWernher unclipped his water bottle and took a long drink. “And that\u0027s how it all started,\u0022 he said. “By the time Jeb finished his final year project, he\u0027d already founded the Kerbin Interplanetary Society and started work on a new LV-2 engine. He even put together a relatively conservative research proposal - complete with a raft of anticipated benefits for other Institute research programs - for a sounding rocket based on it. Unfortunately, the \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E also had a tendency to be... vocal about critics of our spaceflight ambitions, which the Institute rather took exception to. \u003Cstrong\u003EEventually of course, we were kicked out for wasting Institute time and resources on “overgrown toys and ridiculous flights of fancy.\u0022 \u0027\u003C/strong\u003E (emphasis added. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E )\n\u003C/p\u003E\n\u003Cp\u003E\n“But you kept going?\u0022 said Sherfel quietly.\n\u003C/p\u003E\n\u003Cp\u003E\n“We did,\u0022 said Wernher. “We pooled all our money to start up the junkyard business, partly to fund our experiments, and partly to get hold of some parts and raw materials.\u0022 He grinned. “Once we were established, Geneney had the bright idea of bidding on the Institute\u0027s recycling contract. I\u0027m sure at least one of the senior professors was highly amused to see us reduced to hauling Institute scrap, but most of our best early stock - including our first pressure suits - was basically recovered from Institute dumpsters.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nJames shook his head. “And you managed to build a crewed sub-orbital spacecraft out of it.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n“It took a lot longer than we expected,\u0022 said Wernher ruefully. “Not surprising really, given what we had to work with. But we made it. The Kerbal 1 flight was a success, Bill had the presence of mind to take his camera, and the rest you know about.\u0022 He rolled his shoulders. “Anyway, enough storytelling - we should probably check in with Mission Control.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nAnd skipping ahead.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EBefore the Space Program, before Mainsails and Mun rovers, before there was even such a thing as a probe core, there was just a group of friends with a shared dream, who refused to let that dream go.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cem\u003EThis is part of their story.\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIt was a bright sunlit afternoon as Geneney walked out to the launch pad. He could see the rocket in his minds eye. A gleaming tower of sculptured metal rising into the sky with a cluster of the latest generation engines at the base and the newest, most spacious capsule sitting proudly at the top. Ready to take him to the Mun, to Minmus or anywhere else he cared to go.\n\u003C/p\u003E\n\u003Cp\u003E\nHe sighed. The reality of course was rather different. A rusty launch tower constructed from old scaffolding. A bunker full of worn out monitors and other abandoned electronic gear. And a last ditch attempt at a rocket that they had built from whatever junk they could scavenge up and weld together. Wernher\u0027s original LV-1 engine had proven far far more difficult to scale up than any of them had imagined. Getting the stability augmentation system to work had eventually been an exercise in stubbornness rather than elegant engineering. And as for the decouplers.\n\u003C/p\u003E\n\u003Cp\u003E\nGeneney shook his head. Best not to think about the wretched decouplers.\n\u003C/p\u003E\n\u003Cp\u003E\nHe reached the first of the launch clamps and inspected it carefully. The rocket loomed above him, a battered metal cylinder with a tangle of plumbing at the base, connected to the familiar ribbed shape of the LV-15 engine bell. Four RT-5 solid fuel boosters attached to the sides by explosive bolts and a simple capsule secured to the top with more explosive bolts completed this most unlikely looking spacecraft. In Geneney\u0027s opinion \u0027booster\u0027 was an optimistic name for a squat drum of firework propellant with a cone attached to the bottom. As for sticking them on with explosive bolts...\n\u003C/p\u003E\n\u003Cp\u003E\nNo - best not to think about the decouplers. Besides they had worked well enough in testing and none of them had been able to get the hydraulic pusher system to work reliably.\n\u003C/p\u003E\n\u003Cp\u003E\nGeneney could hear voices far above him as Lucan helped the three cosmonauts into the capsule. An occasional mumbled comment from Bill, Bob\u0027s nervous chatter and Jeb, talking up a storm in his enthusiasm. Geneney smiled to himself. Bill was still a believer, Bob... well Bob was loyal. If his best friends were risking themselves in a home-brewed rocket, then Bob would be there alongside them. And as for Jeb, he had never given up, despite all the difficulties, frustrations and exploded prototypes. He\u0027d kept them going, with his permanent grin and irrepressible enthusiasm, even as the other members of the Kerbin Interplanetary Society had gradually drifted away. It helped that the grin hid a surprisingly competent engineer, otherwise Geneney was fairly sure that Wernher would have stuffed Jeb headfirst into the engine bell of the LV-10 test model and probably fired it too.\n\u003C/p\u003E\n\u003Cp\u003E\nHis smile faded. The LV-10 test had been a definite low point and they still hadn\u0027t figured out exactly what went wrong. The LV-15 worked, although it wasn\u0027t close to being powerful enough and all their attempts to cluster multiple LV-15s together had failed. Eventually even Jeb had conceded that the multiple LV-15 design was just too prone to overheating and suggested using a set of RT-5 \u0027Trashcan\u0027 engines instead.\n\u003C/p\u003E\n\u003Cp\u003E\nAll the launch clamps seemed to be in order and a loud clang from above announced that Lucan had finally closed the hatch of the \u003Cem\u003EKerbal 1\u003C/em\u003E. Geneney waited as Lucan clambered down the launch tower and the two kerbals hurried back to the control bunker.\n\u003C/p\u003E\n\u003Cp\u003E\n-------------\n\u003C/p\u003E\n\u003Cp\u003E\nGeneney tapped his microphone.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Kerbal 1, this is Control. How are you guys doing up there?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nJeb\u0027s voice crackled from the speakers.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Cool, calm and collected, Genie. How\u0027s that telemetry looking?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nIf Geneney knew Bill and Bob, then calm was most probably a lie, let alone collected. No point in breaking the facade though.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Wernher\u0027s just running the last tests on the decouplers now Jeb. Five minutes to launch.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nWernher pressed a button on his console and grunted in satisfaction as a set of indicator lights winked out. He flicked a switch and all five lights flickered briefly then lit up with a reassuring green glow.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022All rocket systems check out. Guidance control and launch sequencing transferred to booster. Ready when you are, Gene.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022OK then. We all know what we\u0027re doing. LV-15 engine start on my mark, 3 second hold down at full power as a last check, then we release the clamps and light up the Trashcans. That last bit is probably going to be a bit bouncy guys, so as soon as the LV-15 lights you\u0027ll probably want to hold on to something.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Gotcha, Genie.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nGeneney took a deep breath. \u0022LV-15 ignition in five...four...three...two...one.. Mark!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nLucan and Geneney turned towards the main monitor screen. Behind them they could hear Wernher rattling through the ignition checklist.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Firing gas generator, turbopumps powering up and IGNITION!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nFire erupted from the base of the \u003Cem\u003EKerbal 1,\u003C/em\u003E rapidly focusing into a single hard bright flame. A steadily increasing rumble could be heard outside as the LV-15 throttled up to full power.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Holding for three...two...one...\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nThe bunker shook to a thunderous roar as all four RT-5s ignited, sending sheets of flame washing across the launch pad. The image on the monitor flared brightly. Spots danced in front of Geneney\u0027s eyes as he stared at the screen trying desperately to spot the \u003Cem\u003EKerbal 1\u003C/em\u003E amongst all the static. As the image came back into focus, all Geneney could see was a badly scorched launch pad. The noise in his headphones suggested that this was due to a successful launch rather than a catastrophic explosion but the faint screams didn\u0027t sound at all good. The static on monitor 2 didn\u0027t look promising either.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Wernher - talk to me!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022LV-15 performing well, all four RT-5s are running. All decouplers intact,\u0022 came the calm response. \u0022Capsule telemetry and sensors offline.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nGeneney gripped the arms of his chair tightly. \u0022Which means?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022We have no way of telling how high the capsule is travelling, how fast or at what angle.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nLucan interrupted him \u0022If the decouplers haven\u0027t fired...I can still hear the engines in my headset, so the rocket should still be in one piece.\u0022 He snapped his fingers. \u0022The main data cable - it probably just came loose during the launch. Wernher, try SCE to Aux.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nGeneney\u0027s knuckles turned white as Wernher searched for the switch on his console. Then, with a click, monitor 2 lit up, as telemetry suddenly flooded in from the \u003Cem\u003EKerbal 1\u003C/em\u003E. A slow smile spread across Geneney\u0027s face as he got to his feet and slapped Lucan on the back. Above his head, the numbers for altitude and velocity of the \u003Cem\u003EKerbal 1\u003C/em\u003E were both steadily increasing.\n\u003C/p\u003E\n\u003Cp\u003E\n------------\n\u003C/p\u003E\n\u003Cp\u003E\n\u002210 seconds till burnout.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nGeneney kept his fingers firmly crossed as he waited for the Trashcans to shut down. Five seconds to go, two, one... and nothing. The roar of the engines still filled his headphones. Five more seconds, ten more seconds. He was just turning towards Wernher, when everything went quiet. There was a series of muffled explosions and four lights on Wernher\u0027s console winked out. He grabbed the microphone.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Kerbal 1, this is Control. Come in Kerbal 1! Jeb, Bill, Bob - can you hear me!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nJeb chuckled. \u0022Hearing you loud and clear, Genie if you\u0027d let us get a word in edgewise!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Jeb - thank the Kerm! Are you guys OK up there?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022The Bobcat here is looking a bit blue but we\u0027re all good. Nothing but Class A Badasses on \u003Cem\u003Ethis\u003C/em\u003E rocket ship!\u0022 Jeb paused to savour the moment. \u0022Yeah, this rocket ship...\u0022, his voice trailed away. \u0022Dammit guys we did it! Faster than any kerbal has ever travelled, higher than any kerbal has ever travelled and way \u003Cem\u003Eway \u003C/em\u003Enoisier than any kerbal has ever travelled! I told you those Trashcans would do the trick!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Well we\u0027ve still got a couple of things left to do, Jeb but yeah - those Trashcans definitely made it happen. Thirty seconds of fuel left for the LV-15.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nLucan was keeping a close eye on the telemetry. The \u003Cem\u003EKerbal 1\u003C/em\u003E was actually accelerating slightly now as the last litres of fuel drained away, until at last the engines shut down. The last light flickered out on Wernher\u0027s console accompanied by a final muffled bang from the speakers.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Shutdown and booster separation confirmed, Jeb. We figure you should top out at around thirty to thirty five thousand metres.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Thanks, Luco. Not bad for a first flight, not bad at all! Looks like I won that bet with the Bobcat too - he reckoned we\u0027d get to twenty five thousand at best!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nBob laughed nervously. \u0022Are you sure they were just the standard Trashcans, Jeb? If we get down from here in one piece, I\u0027m not sure I\u0027ll be able to get out of this seat, I got mashed into it so hard.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Didn\u0027t touch them, Bobcat. They sure did make for one heck of a ride though. What did you think, Bill? Hey - are you OK there, Bill? That window isn\u0027t coming loose is it?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Oh... Oh wow... Guys you need to see this.\u0022 Bill silently reached out a hand and Jeb wordlessly passed him the camera.\n\u003C/p\u003E\n\u003Cp\u003E\nGeneney blinked. He\u0027d never heard Jeb sound like that before. Almost awestruck.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022What is it, Jeb?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022It\u0027s Kerbin... just Kerbin. Only not quite and all of it at once. And the sky - it\u0027s full of more stars than you can believe. Greens and blues and brilliant white clouds and then black and stars.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022You\u0027re not making any sense, Jeb.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022No, no I don\u0027t think I am. You\u0027re gonna have to see this for yourself, Genie.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nGeneney sighed. \u0022You know we\u0027re never going to get another shot at this. The Kerbal 1 was all we had left,\u0022 he said sadly.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Actually, Genie, if even half of Bill\u0027s photos come out, I think you\u0027re going to get to see this quicker than you can imagine and in a bigger and better rocket than you can imagine too. Hey, Bill, if you\u0027re done with that camera, pass it over here. Genie, I\u0027m taking off my helmet, sticking the camera into it and wedging it under the control panel for safekeeping.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nGeneney\u0027s jaw dropped. \u0022What, why, what are you doing? What happens if you get an air leak?!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nJeb\u0027s voice was uncharacteristically serious. \u0022I\u0027ll just have to hold my breath, Genie. Whatever happens to Bill, Bob and me, you \u003Cem\u003Eneed\u003C/em\u003E this camera. It\u0027s all the proof that the Kerbin Interplanetary Society needs and it\u0027s going to change everything.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n---------\n\u003C/p\u003E\n\u003Cp\u003E\nTwo small green figures stood on the roof of a makeshift concrete bunker, anxiously peering out to sea. Geneney glanced at his watch and then scanned the horizon again, too nervous to look away for more than a moment. He knew that he probably wouldn\u0027t see the capsule from this distance but the parachute should be visible. And it should be visible any moment now. Beside him, Wernher suddenly stiffened and pointed at the sky. An orange streamer popped into view, plunged towards the ground and then fluttered skywards. Geneney\u0027s heart was in his mouth. If that was the drogue chute then...\n\u003C/p\u003E\n\u003Cp\u003E\nYES! Two orange discs burst into the sky and then unfurled into the welcome, welcome sight of two fully opened parachutes. Geneney and Wernher looked at each other, grinned in triumph and then threw themselves down the stairs as fast as they could.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Lucan, Wernher - boat. Now! We\u0027ve got three kerbonauts to pick up!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EEpilogue - two days later\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nFour members of the Kerbin Interplanetary Society were lounging about at the Jebediah Kerman Junkyard and Spare Parts Company. Bill was in Jeb\u0027s office working on his camera, whilst Jeb was out with a pair of customers, helping them rummage through a pile of old engine parts. As the three of them strolled back towards the office, Geneney overhead snatches of conversation.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Were you boys anything to do with a mighty lot of noise out by that old rusty tower the other day?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nJeb nodded, \u0022Yup, that was us, sir. Testing some bits and pieces from the junkyard.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nThe older of the two customers chuckled. \u0022People back in town reckon they saw one of those rockets flying into the sky.\u0022 He snorted. \u0022Load of nonsense if you ask me, never mind what those crazy interplanetary characters keep talking about. Although I have to admit, they do make some mighty fine explosions.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nGenneny stifled a grin as Jeb tried his best to keep a straight face. Just then Bill popped his head around the office door.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Hey guys - photo\u0027s came out nicely. You want to take a look?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nJeb smiled. \u0022Love to, Bill.\u0022 He turned towards his customers politely, \u0022and would you good kerbals care to join us?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nGeneney stared at Jeb\u0027s office wall. Most of Bill\u0027s photographs were blurry views of not very much, taken out of what was obviously a very small window. Several more showed what looked like maps. But none of the eight kerbals crammed into the room had eyes for anything other than the largest picture in the middle. This too was clearly a view through a window but beautifully sharp. A very obviously curved line down the middle separated inky blackness from brilliant blue, dusky brown and lush green. Far away in the distance, the familiar battered grey ball of the Mün rose over Kerbin.\n\u003C/p\u003E\n\u003Cp\u003E\nGeneney blinked back tears. Jeb was right. They had really done it. They could do it again. And there would be a Space Program.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nI don\u0027t really go into much detail about all the stuff that happened in between I\u0027m afraid but it sounds as though your series would!\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-01-05T13:19:31Z\u0022 title=\u002201/05/2017 01:19  PM\u0022 data-short=\u00227 yr\u0022\u003EJanuary 5, 2017\u003C/time\u003E by KSK\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"JKerman","CreatedById":166532,"CreatedDateTime":"2017-01-06T03:30:33Z","Content":"\n\u003Cp\u003E\nDid you know that I was born on the day Werner Von Kerman died? It was DESTINY!\n\u003C/p\u003E\u003Cp\u003E\nOh yes, I was thinking about using the song Surfing With the Alien by Joe Satriani for the opening titles. What do you think?\n\u003C/p\u003E\n"}]}