{"TopicId":15418,"ForumId":18,"TopicTitle":"Guns Of Icarus Online (Insane Zeppelin battles) Free Beta Keys!","CreatedByName":"Spider0804","CreatedById":10868,"CreatedDateTime":"2012-07-27T15:58:17Z","PageNum":1,"Articles":[{"CreatedByName":"Spider0804","CreatedById":10868,"CreatedDateTime":"2012-07-27T15:58:17Z","Content":"\n\u003Cp\u003EGuns Of Icarus Online (Insane Zeppelin battles) Free Beta Keys!\u003C/p\u003E\u003Cp\u003ESo I have run across the amazing game Guns of Icarus Online\u003C/p\u003E\u003Cp\u003EYou choose 1 out of 4 zeppelin each very different with different weapon amounts and locations.\u003C/p\u003E\u003Cp\u003EEach zeppelin can hold 4 people but you only need a captain, AI crew can take the other slots though they kind-of suck.\u003C/p\u003E\u003Cp\u003ENext you customize the blimp with the type of weapons you like and take to the skies as a captain of your vessel in domination or deathmatch matches.\u003C/p\u003E\u003Cp\u003EIt is in closed beta right now and if you go to the site DO NOT pay attention to the beta schedual, the server is open 24/7.\u003C/p\u003E\u003Cp\u003EIf piloting is not your thang you can be a gunner or engineer with special traits to damage enemies or repair the ship.\u003C/p\u003E\u003Cp\u003EThe development staff kindof implied that the servers would only be on at certain times but those were just dates for everyone to gather...so there is not a large playerbase on the off time right now.\u003C/p\u003E\u003Cp\u003EThere are 400 keys left on this site, please come and join me on the game.\u003C/p\u003E\u003Cp\u003EIf there is no one on please let me know and me and my 4 friends will pop on to give you a good show, there is also sandbox mode where you can test your ship alone.\u003C/p\u003E\u003Cp\u003EWebsite : \u003Ca href=\u0022http://gunsoficarus.com/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://gunsoficarus.com/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBeta Keys : \u003Ca href=\u0022http://ufbteam.com/en/forum/Actualit%C3%A9s/32824-Get-Gun-Of-Icarus-Online-Steam-Beta-Key.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://ufbteam.com/en/forum/Actualit%C3%A9s/32824-Get-Gun-Of-Icarus-Online-Steam-Beta-Key.html\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBeta Info/Guide : \u003Ca href=\u0022https://docs.google.com/document/pub?id=1Z5zkxRD1NwudycXQxxJ4V_W8CLm7DsUb0jb-3YrXNuQ#h.s3jm32r7oin2\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://docs.google.com/document/pub?id=1Z5zkxRD1NwudycXQxxJ4V_W8CLm7DsUb0jb-3YrXNuQ#h.s3jm32r7oin2\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EInstructions:\u003C/p\u003E\u003Cp\u003E1. Reply to beta key thread (You have to make an account)\u003C/p\u003E\u003Cp\u003E2. Get beta key from email\u003C/p\u003E\u003Cp\u003E3. Click games in steam\u003C/p\u003E\u003Cp\u003E4. Click activate product\u003C/p\u003E\u003Cp\u003E5. Put in beta key\u003C/p\u003E\u003Cp\u003E6. Enjoy\u003C/p\u003E\u003Cp\u003EP.S. At the map part, click the arrows to scroll through maps to see if anyone is waiting for a match.\u003C/p\u003E\u003Cp\u003EOtherwise you can click instant action.\u003C/p\u003E\n"}]}