{"TopicId":15448,"ForumId":20,"TopicTitle":"To Mech-Jeb or not to Mech-Jeb, that is the question...","CreatedByName":"Vostok","CreatedById":22467,"CreatedDateTime":"2012-07-27T21:34:11Z","PageNum":1,"Articles":[{"CreatedByName":"Vostok","CreatedById":22467,"CreatedDateTime":"2012-07-27T21:34:11Z","Content":"\n\u003Cp\u003EPersonally, I dislike the idea of a flight autopilot that flies the ship for you. Most of the fun for me is getting to do exactly what you want yourself, without the aid of a machine. For example, getting to a metre-perfect circular orbit by hand is far more rewarding than if a machine had done it for you. The same goes for rendezvous and landings.\u003C/p\u003E\u003Cp\u003ENow, I know many people prefer the more scientific side of KSP (i.e. the Kerbin Geographic Society) and I appreciate the need for simple, fast orbits in order to collect data with the minimum fuss, but when I hear of people performing their first ever moon landing/rendezvous/minmus landing etc, with mechjeb, I wonder \\\u0027where\\\u0027s the achievement?\\\u0027 Now, obviously there\\\u0027s the rocket design that, since 0.16, has (I think) made it easier to get items into orbit, and that does require skill, thought, and planning. But when it comes to it, I\\\u0027d feel that I cheated if I were to use a computer to perform the actual landing. I\\\u0027d prefer to be in touch with the ship itself.\u003C/p\u003E\u003Cp\u003E(I don\\\u0027t mind using it for orbital info, but I never really play the game accurately enough to warrant needing orbital information to 2d.p.)\u003C/p\u003E\u003Cp\u003EBesides, if you perform every landing and rendezvous using mechjeb, you never learn to do it manually. I don\\\u0027t know about anybody else, but my first ten landing attempts exploded, but I slowly got better and now, if a ship is capable of landing at all, I can land it 99% of the time using no RCS. The same for rendezvous and rescue landings, although I have only ever performed three rendezvous manoeuvres, I found each one massively easier than the last... But with mechjeb, you just don\\\u0027t get the chance to learn... which I find to be an opportunity wasted, so essentially, I reckon that for the true KSP experience, players really ought to steer relatively clear of mechjeb until they\\\u0027re confident in manual flights, since it\\\u0027s a learning experience that way. I\\\u0027ve learnt more about orbital manoeuvring than I could have thought possible since playing KSP. \u003C/p\u003E\u003Cp\u003ESo, any thoughts on the subject. I can tell that there will be two completely different categories of people, and, indeed, \\\u0027mediators\\\u0027 in between, but try to keep it civil.\u003C/p\u003E\u003Cp\u003EEDIT: This was NOT meant to be me telling everyone that mechjeb is wrong! :S It was giving my current views on the plugin, and asking for others\\\u0027 views on the same. \u003C/p\u003E\n"},{"CreatedByName":"E. F. Kranz","CreatedById":12617,"CreatedDateTime":"2012-07-27T21:39:50Z","Content":"\n\u003Cp\u003EI tried it once, didn\\\u0027t \u0027get\u0027 it, and haven\\\u0027t looked at it since.\u003C/p\u003E\u003Cp\u003EIt\\\u0027s kinda strange because I also install every interesting mod part that comes along, while some people would deride me for not using only the stock parts.\u003C/p\u003E\u003Cp\u003EI\\\u0027m clearly not a \u0027purist,\u0027 I just... I don\\\u0027t see the point in having a bot play the game for me.\u003C/p\u003E\n"},{"CreatedByName":"GalaxyGryphon","CreatedById":28587,"CreatedDateTime":"2012-07-27T21:40:53Z","Content":"\n\u003Cp\u003Ei use mechjeb because in my opinion, its not a guessing game, its freeking rocket science, im not going to guess where orbit anti normal is when doing maneuvers ect.\u003C/p\u003E\u003Cp\u003Ethere is no cheating in a single player game, play how it is fun.\u003C/p\u003E\n"},{"CreatedByName":"fowlplaychiken","CreatedById":30748,"CreatedDateTime":"2012-07-27T21:46:34Z","Content":"\n\u003Cp\u003EIMo mechjeb does not provide anywhere near as much power as even 1970\\\u0027s space systems; unless your after a pro-apollo experience I see no reason not to have mechjeb. I use it only when needed or lazy, and make sure to learn maneuvers manually first in case the \u0027computer fails\u0027 (mechjeb does sometimes)\u003C/p\u003E\n"},{"CreatedByName":"naryl","CreatedById":29580,"CreatedDateTime":"2012-07-27T21:48:45Z","Content":"\n\u003Cp\u003EAlways using MechJeb with opened Orbital info or Surface info depending on whether I\\\u0027m piloting a rocket or a plane. You don\\\u0027t have to use the autopilot. MechJeb is immensely useful just doing the calculations for you. Also ILS :3\u003C/p\u003E\n"},{"CreatedByName":"Tim_Barrett","CreatedById":3206,"CreatedDateTime":"2012-07-27T21:50:30Z","Content":"\n\u003Cp\u003EWell, it\\\u0027s not like anyone can use mechjeb. You still need to know the basics to use it in the first place.\u003C/p\u003E\u003Cp\u003EIn the future, if this does become a stock addition, I\\\u0027d like several modules for different kinds of computing. Possibly different parts for a basic computer to a larger but more high-tech one. Then it would be fair.\u003C/p\u003E\u003Cp\u003EEven in campaign, I doubt this is something you would start out with, or at least the complete extent of it for that matter.\u003C/p\u003E\n"},{"CreatedByName":"Accelerando","CreatedById":543,"CreatedDateTime":"2012-07-27T21:55:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vostok\u0022 data-cite=\u0022Vostok\u0022\u003E\u003Cdiv\u003Ewhen I hear of people performing their first ever moon landing/rendezvous/minmus landing etc, with mechjeb, I wonder \\\u0027where\\\u0027s the achievement?\\\u0027\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPerhaps the achievement is in building their spaceship so it doesn\\\u0027t rip itself apart, or looks cool, etc.? Not everybody needs to tend to their rocket once built to feel it\\\u0027s been validated as an achievement.\u003C/p\u003E\u003Cp\u003EI use MechJeb a lot because it lets me build and launch enormous rockets without having to worry too much about steering the damn thing every second it\\\u0027s under thrust. I play KSP so I can put into space lots of pretty things and big spaceships and cargo missions to my orbital space dock, not necessarily to worry about keeping my many ships from flipping over every step of the way. That\\\u0027s not achievement to me, it\\\u0027s annoying.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vostok\u0022 data-cite=\u0022Vostok\u0022\u003E\u003Cdiv\u003EBesides, if you perform every landing and rendezvous using mechjeb, you never learn to do it manually.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat is kind of a straw man. I doubt if there is really any significant faction who perform \u0027every\u0027 landing and rendezvous with MJ, even if they use it for their first flights. Frankly, I find that paying attention to how MechJeb flies provides a decent guide on how to do it yourself. And from what I\\\u0027ve seen of these discussions most MechJeb users (myself included) share your sentiment about the value of at least learning to fly manually.\u003C/p\u003E\n"},{"CreatedByName":"KerbalConfetti","CreatedById":33445,"CreatedDateTime":"2012-07-27T22:06:18Z","Content":"\n\u003Cp\u003EThe answer to the question is, definitively, \u0027personal preference\u0027.\u003C/p\u003E\n"},{"CreatedByName":"ultrasquid","CreatedById":10944,"CreatedDateTime":"2012-07-27T22:12:57Z","Content":"\n\u003Cp\u003EOnce there is a campaign mode for the game, with rules and mission objectives (even then being as freeform as possible) the MechJeb flight computer can be one of the things with which to reward the players. Specific features of MechJeb could unlock after the player achieves mastery of the related function in manual control mode. This way, the challenge is there, and players moving to more advanced levels would have the option of continuing to play using the skills they\\\u0027ve developed, or choose to let MechJeb handle those tasks and focus on other parts of the mission themselves.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2012-07-27T22:17:52Z","Content":"\n\u003Cp\u003EI want assists, such as information displays, and the SAS that I can turn on when I want and off when I want, but no more than that. But then again, I do leave avionics on to take some of the slop out of aircraft handling. Then again again, when I\\\u0027m building a plane, I make sure it handles well and is stable without SAS before I consider it finished. But I don\\\u0027t see the point of turning control of piloting and course-setting over to automation, because then I\\\u0027m just sitting here watching the game play itself, and the accomplishments wouldn\\\u0027t be mine. \u003C/p\u003E\u003Cp\u003E(You know, this thread is probably going to get ugly pretty quickly. This kind of discussion usually does.) \u003C/p\u003E\n"},{"CreatedByName":"MaxMurder","CreatedById":11958,"CreatedDateTime":"2012-07-27T22:22:21Z","Content":"\n\u003Cp\u003EI personally do not use mechjeb at all. However, i think that it would be a useful addition to the game when campaign and techtrees make it in:\u003C/p\u003E\u003Cp\u003EPlayers start out manually flying missions. Once techs become unlocked they get something akin to the Apollo \u003Ca href=\u0022http://apollo.spaceborn.dk/dsky-sim.html\u0022 rel=\u0022external nofollow\u0022\u003EDSKY\u003C/a\u003E computer. As they progress they are given more data modules and computer functions eventually ending with a KAL 9000 super computer system.\u003C/p\u003E\n"},{"CreatedByName":"Bekiekutmoar","CreatedById":23500,"CreatedDateTime":"2012-07-27T22:25:50Z","Content":"\n\u003Cp\u003EI play the game 100% vanilla, so no mods or add-ons like MechJeb. Sure, it takes more efforts to go into Kerbin orbit or land on one of the two moons, but that\\\u0027s part of the fun for me ... !\u003C/p\u003E\n"},{"CreatedByName":"Misterspork","CreatedById":9507,"CreatedDateTime":"2012-07-27T22:29:42Z","Content":"\n\u003Cp\u003ECome on, why does this keep popping up? NOW, let me end this by saying:\u003C/p\u003E\u003Cp\u003EThere are 3 types of Kerbonauts, those who like to fly, those who run Mission Control, and there are those that can read the tide of the velocity vectors.\u003C/p\u003E\u003Cp\u003EEssentially, some of us find the achievement in the CONSTRUCTION of the perfect machine, not finding achievement through avoiding pilot error. Others I am sure prefer flying their not-so-perfect machine, but I and others who use Mechjeb personally do not. So please, let\\\u0027s not bring this topic up again. All it leads to is nonsensical argument.\u003C/p\u003E\n"},{"CreatedByName":"duckunlimited2","CreatedById":14973,"CreatedDateTime":"2012-07-27T22:32:55Z","Content":"\n\u003Cp\u003EThe only time I ever used mechjeb was to put a space station up into orbit because it caused incredible lag that made it impossible to fly manually. I also had to help the mechjeb out a little in the gravity turn and the circularization process because it had trouble controlling the heavy build. It just illustrates a point: human finesse always triumphs over automation.\u003C/p\u003E\u003Cp\u003EBut I do admit that mechjeb is an \u003Cstrong\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003Eincredible\u003C/span\u003E\u003C/strong\u003E plugin. I was awestruck during the first few attempts of getting that station into orbit. ???\u003C/p\u003E\u003Cp\u003EEdit: I\\\u0027d also like to add that there are times and places for everything. I needed mechjeb on that launch and it did deliver.\u003C/p\u003E\n"},{"CreatedByName":"Dizzle","CreatedById":31588,"CreatedDateTime":"2012-07-27T22:39:29Z","Content":"\n\u003Cp\u003EI feel more personal achievement if I fly the entire mission myself, but the new large parts have so many problems with them, besides the fact that a large ship is difficult to steer, that I\\\u0027ll probably start using it soon for some operations.\u003C/p\u003E\n"},{"CreatedByName":"Rascal Nag","CreatedById":9451,"CreatedDateTime":"2012-07-27T22:46:39Z","Content":"\n\u003Cp\u003EI used it for a video I made with the fixed cameras, but when I\\\u0027m focusing on actually accomplishing something and not on making a video or anything, I do it manually.\u003C/p\u003E\n"},{"CreatedByName":"VincentMcConnell","CreatedById":14492,"CreatedDateTime":"2012-07-27T22:52:33Z","Content":"\n\u003Cp\u003EI know I can launch and go anywhere manually. But it\\\u0027s inefficient. I use MechJeb for almost everything now. Quick and easy and programmable.\u003C/p\u003E\u003Cp\u003EMechJeb4Life\u003C/p\u003E\n"},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2012-07-27T23:15:04Z","Content":"\n\u003Cp\u003EI expected a description of how \u0027to Mech-Jeb or not to Mech-Jeb\u0027 is a question to you; that you are in conflict with yourself about whether or not you should use mechjeb. \u003C/p\u003E\u003Cp\u003EBut it turns out you think it is or should be a question for others. \u003C/p\u003E\u003Cp\u003EI think it is not really a big question to most KSP players.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vostok\u0022 data-cite=\u0022Vostok\u0022\u003E\u003Cdiv\u003E\u003Cp\u003Eif you perform every landing and rendezvous using mechjeb\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMechjeb does not force anyone to do every landing and rendezvous with mechjeb. \u003C/p\u003E\u003Cp\u003EIn fact most the rendezvous functions have been broken for a long time, the whole thing has been removed in the current version (to be fixed and added later).\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EBut with mechjeb, you just don\\\u0027t get the chance to learn.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow would you know that if you do not use mechjeb? I say you are incorrect.\u003C/p\u003E\u003Cp\u003EI learned a lot from Mechjeb, even though i did my first Kerbin orbits and first Mun landings before mechjeb even existed. I achieved my first Kerbin orbit before i found out what the \u0027m\u0027 key does.\u003C/p\u003E\u003Cp\u003EAs far as i know it is Harvester\\\u0027s intention that KSP will offer guidance in learning rocketry; things that you don\\\u0027t need if you\\\u0027re an ace. The \u0027patched conics\u0027 orbit display in the map view makes it easier. Having a map in the first place makes it easier (early versions of KSP had no map). One mechjeb-like function has already been announced (rendezvous assistant).\u003C/p\u003E\u003Cp\u003EIt\\\u0027s a bit of a moot issue because KSP is very early in development. Between bugs, balance changes from one version to the next, and mod incompatibility, KSP\\\u0027s gameplay is a proverbial \u0027Wild West\u0027: anything goes. Some people are having a ball playing KSP without ever having left the surface of Kerbin.\u003C/p\u003E\u003Cp\u003EFinally: don\\\u0027t worry to much about other people\\\u0027s sense of achievement.\u003C/p\u003E\n"},{"CreatedByName":"KevinTMC","CreatedById":28909,"CreatedDateTime":"2012-07-27T23:39:34Z","Content":"\n\u003Cp\u003EI\\\u0027m glad this thread hasn\\\u0027t yet exploded in a fiery ball (like my last half-dozen attempts at building a spaceplane...there apparently aren\\\u0027t enough struts on Kerbal to hold my designs together). All discussions where people might feel they are being told they are Doing It Wrong are in constant danger of going boom, though, and to what purpose?\u003C/p\u003E\u003Cp\u003EBefore it gets locked, though, I would like to add my wholehearted support to the principle of \u0027learn to do it, in order to earn the privilege of automating it\u0027 that\\\u0027s been expressed several times here. The advanced mode of the final game really should operate like that--while easy mode should allow people to bypass it.\u003C/p\u003E\u003Cp\u003E(Because while I want to learn everything I can about what\\\u0027s going on, and want play aids and automation tools--MechJeb and patched conics and everything else--to feel more like rewards than crutches, other people will be turned off and quickly stop playing if they\\\u0027re forced to go through all that...and that\\\u0027s fine, I want to see everyone have their own fun their own way as much as possible.)\u003C/p\u003E\n"},{"CreatedByName":"Da_Dumples","CreatedById":32594,"CreatedDateTime":"2012-07-27T23:44:53Z","Content":"\n\u003Cp\u003EI personally don\\\u0027t like Mech-jeb, but that\\\u0027s just me. Flying a ship is the majority of the game and when you use Mech-Jeb it defeats the entire point of playing. You might as well let the computer do everything. :/\u003C/p\u003E\n"},{"CreatedByName":"Cooly568","CreatedById":17763,"CreatedDateTime":"2012-07-27T23:49:04Z","Content":"\n\u003Cp\u003EI use mechjeb only if I can\\\u0027t fly it myself\u003C/p\u003E\n"},{"CreatedByName":"ddavis425","CreatedById":14725,"CreatedDateTime":"2012-07-27T23:57:21Z","Content":"\n\u003Cp\u003EWhen I use MechJeb, I usually only do it to see in-depth orbital information, but if I really don\\\u0027t want to go through launching it by myself, I\\\u0027ll use the automated features. I keep seeing people make the argument of \u0027manual or die\u0027 and I think, \u0027I\\\u0027ve done everything that there is to do in this game by hand, what more do I have to do to earn the right to use an autopilot?\u0027\u003C/p\u003E\n"},{"CreatedByName":"sirscott","CreatedById":601,"CreatedDateTime":"2012-07-28T00:32:08Z","Content":"\n\u003Cp\u003EMecha jeb is a \u003Cem\u003ETOOL\u003C/em\u003E , and like any good tool it can only be used by somebody who understands the basics of its operation in the first place. As such , it is exceptionally usefull to those of us who strive to do something more than repeat every mistake caused by our inability to make a split-second course correction , or a timed burn that is far beyond human computing capabilities. Ill admit , it does cause you to avoid some of the crashing and burning (which some would say is the point of KSP) , but on the other hand it can only really be used after youve grasped the basics of space flight , and even then it will only go so far. For example I almost always use the Ascent computer function to automate orbital insertion , but have to go fully manual for any sort of roundevouz.\u003C/p\u003E\n"},{"CreatedByName":"pebble_garden","CreatedById":30150,"CreatedDateTime":"2012-07-28T01:52:04Z","Content":"\n\u003Cp\u003EI leave the matter to personal preference, and I can think of many reasons one might choose to fly manually or not. \u003C/p\u003E\u003Cp\u003EIf using MechJeb helps keep a KSP newcomer from getting too frustrated to continue, I say it\\\u0027s a good thing. Once they have a firmer grasp of the terminology and techniques, they\\\u0027ll likely want to try flying by hand anyway. It does a good job of showing hard numbers for your orbit and whatnot, so that\\\u0027s also useful even if you don\\\u0027t touch the autopilots.\u003C/p\u003E\u003Cp\u003EThey might use it to speed up their flight tests of new ship designs, helping to standardize the development process. \u003C/p\u003E\u003Cp\u003EOr it might simply be a quick way to get to the situation they really want to try, like an orbital rendezvous.\u003C/p\u003E\u003Cp\u003ESome people will always want to use MechJeb so they can concentrate on the other parts of the program they prefer. Also fine, in my opinion.\u003C/p\u003E\u003Cp\u003EMyself, I got started learning orbital mechanics in Orbiter, and its simple autopilot helped me a lot. Even so, it took me months to really understand OM. I am impressed with the functionality of MechJeb (it\\\u0027s a wonderful bit of programming!), but I prefer to fly by hand just because I\\\u0027m a nerd that way. \u003C/p\u003E\u003Cp\u003EI know I\\\u0027ve said it before, but I love KSP more than I can say. It\\\u0027s awesome. Thanks Squad!\u003C/p\u003E\n"},{"CreatedByName":"cardgame","CreatedById":12317,"CreatedDateTime":"2012-07-28T02:30:14Z","Content":"\n\u003Cp\u003EI think it\\\u0027s an amazing plugin and quite useful when an operation demands precision, such as designing the perfect minimal mun lander without human inefficiency interfering, or achieving a perfectly circular orbit.\u003C/p\u003E\u003Cp\u003E However, for most other purposes, I despise it. It completely removes the challenge in my eyes; as I have posted before, each and every one of my landings at Minmus is unique. I couldn\\\u0027t say the same if I used MechJeb. I furthermore believe that achievements such as landing a giant base on Minmus are worth less than they would otherwise be if they use MechJeb.\u003C/p\u003E\n"}]}