{"TopicId":154561,"ForumId":44,"TopicTitle":"Flying on Mars","CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2017-01-05T23:01:44Z","PageNum":1,"Articles":[{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2017-01-05T23:01:44Z","Content":"\n\u003Cp\u003E\nA subject that has long fascinated me, the idea that someday, decades or centuries after colonizing the planet, humans might someday be able to fly drones or even manned vehicles around Mars.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022line-height:1.6;\u0022\u003ETo be clear, this is completely impractical as an exploration concept.  NASA would have better luck with rovers or craft modeled after ultra high-altitude balloons here on Earth- which can reach altitudes exceeding 170,000 feet here on Earth (certainly high enough to fly in Mars\u0027 lower gravity and denser gaa composition).  But I like to wonder and dream about whether we\u0027ll someday see winged aircraft on Mars...\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022line-height:1.6;\u0022\u003EThe non-rocket aircraft with the current altitude record for level flight is the NASA Helios H-1, which reached level flight at 96,863 feet on August 13, 2001.  It was a subsonic monoplane flying-wing solar-electric propeller aircraft with an aspect-ratio of almost 31:1, a wing-area of 1976 sq ft, a wing-loading of 0.81 lb/sq ft, no wing-sweep, and a total gross weight of just 1600 lbs.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nMars\u0027 mean molar mass is about 43.34 g/mol, as opposed to about 29 g/mol on Earth, and the highest atmospheric pressure is found in Hellas Planitia is about 1,155 Pascals (by contrast Earth\u0027s sea-level pressure is defined as 101,325 Pascals).  So, the highest density air on Mars should have a density about (1155/101325) * (43.34/29) = 1.703%  Earth\u0027s sea-level density, equivalent to the density of air at about 95,000 ft (28.956 km) on Earth...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThis is already just barely within the flight-envelope of an aircraft with specifications similar to the Helios H-1 (which could fly at altitudes over 96,000 ft), but Mars\u0027 lower gravity should allow aircraft to fly substantially higher due to the reduced lift requirements, and allow different optimization of aircraft to obtain higher total lift and altitude-ceiling at the expense of mass.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWhat I am curious about, specifically, is what the best design characteristics would be of a winged aircraft on Mars...\n\u003C/p\u003E\n\u003Cp\u003E\nWould a solar electric-propeller monoplane like the Helios H-1 be the best option available? (even with radically improved materials, something like this couldn\u0027t be expected to fly more than a few thousand meters above the lowest-altitude parts of Mars with surface elevations below the nominal \u0022sea level\u0022 of Mars...)\n\u003C/p\u003E\n\u003Cp\u003E\nOr would it be worthwhile to go with something like a biplane or even triplane design to obtain lower wing-loading and better aspect-ratio? (the Helios H-1 wings were 11.5 inches from front to back.  With a biplane design, a better aspect-ratio could be achieved by making the wings thinner, to obtain similar wing-area while extending just as far from the Center of Mass...)  This was actually a design-strategy in some early aircraft that allowed higher altitude-ceiling, climb-rate, and better maneuverability on some early fighter designs at the expense of top speed- and on Mars, where attitude-ceiling would be the driving design-constraint, this would probably be a worthwhile tradeoff as well...\n\u003C/p\u003E\n\u003Cp\u003E\nAlternatively, if provided with electric supersonic jet engines (similar to what Elon Musk likes to fancifully talk about today) or even nuclear-thermal supersonic turbojets, a better strategy might be to opt for speed instead of low wing-loading to keep winged aircraft airborne.  This would require slightly futuristic propulsion methods, but there is nothing about the laws of physics that forbids obtaining your propulsion energy from batteries, solar panels, fuel-cells, and/or a tiny nuclear reactor instead of combustion. ..\n\u003C/p\u003E\n\u003Cp\u003E\nSupersonic design concepts might also be aided by breakthroughs in airframe design, if the Japan/MIT concept of a supersonic biplane ever comes to fruition- in which two wings are placed such that the shockwaves from each destructively interfere with each other, producing less than half the wave drag of a comparable wing-area monoplane and reduced sonic-boom.  However these designs have significant difficulty with low-speed flight, and while they might be able to fly perfectly well at low altitudes on Mars, would probably have extremely high takeoff and landing speeds that would require impractically long and smooth runways for even the lightest of craft...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThese ideas might all seem fanciful or even impossible, but they are not so pie-in-the sky as one might think, and I would appreciate if all individuals responding to this post keep the discussion optimistic and non-critical.\n\u003C/p\u003E\n\u003Cp\u003E\nLet me repeat myself- these concepts are on the very edge of what is possible, and many of you may feel they are *impossible*.  I do not mean this as a form of backseat or pre-emptive moderation, but I would appreciate if those of you who are critics and cynics respect those of us who would like to have a positive discussion of this concept, by refraining from quickly jumping to make such statements- as they will drown out all other discussion if you do not control yourselves from making highly-critical statements to this effect.  Out of respect for myself and other forum users, please avoid statements here to the effect that flight on Mars is impossible- the assumption that most people probably hold, and this discussion is meant to reconsider.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nRegards,\n\u003C/p\u003E\n\u003Cp\u003E\nNorthstar\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-01-05T23:08:58Z\u0022 title=\u002201/05/2017 11:08  PM\u0022 data-short=\u00227 yr\u0022\u003EJanuary 5, 2017\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"cubinator","CreatedById":150330,"CreatedDateTime":"2017-01-05T23:12:11Z","Content":"\n\u003Cp\u003E\nI think with Mars\u0027 (is it Mars\u0027 or Mars\u0027s? I can never tell...) low gravity and low atmospheric pressure rockets would be the preferred method of propulsion. Wings of some sort could help increase efficiency but I don\u0027t think you would want to land anything horizontally, unless you had some hefty wheels and a very long runway. It might be better to flip around and land vertically, perhaps even completely retracting the wings, especially if it is Musk\u0027s plan that brings us to the Red Planet in the first place.\n\u003C/p\u003E\n"},{"CreatedByName":"Codraroll","CreatedById":163815,"CreatedDateTime":"2017-01-05T23:44:55Z","Content":"\n\u003Cp\u003E\n\u003Ca href=\u0022https://what-if.xkcd.com/30/\u0022 rel=\u0022external nofollow\u0022\u003ERelevant?\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nWell, it certainly links a relevant article, namely \u003Ca href=\u0022http://www.x-plane.com/adventures/mars.html\u0022 rel=\u0022external nofollow\u0022\u003Ethis one\u003C/a\u003E. It is about modding the flight sim X-Plane into Martian conditions, and then trying to fly something there.\n\u003C/p\u003E\n\u003Cp\u003E\nThe problem seems to be inertia. To get the required amount of lift to stay airborne on Mars, you\u0027d have to go \u003Cem\u003Efast\u003C/em\u003E (Mach 1 just to get off the ground). And at such speeds, all turns will have to be large and sweeping, so as not to crush the pilot, passenger or craft. Not that you\u0027d be able to pull tight maneuvers at all, though, the atmosphere is thin enough and inertia high enough that a plane that tries to turn might find itself rotating, but continuing straight ahead. No yaw control for you.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, landing. How the heck do you land an aircraft at a thousand kilometres per hour, with no air to slow you down once you hit the ground? You\u0027d need a runway comparable to that of a large airport, outfitted with aircraft carrier-style arresting gear. Or a plain runway long enough to literally vanish over the horizon.\n\u003C/p\u003E\n\u003Cp\u003E\nA suborbital rocket hopper might be just as convenient as an airplane under such conditions.\n\u003C/p\u003E\n"},{"CreatedByName":"Jonfliesgoats","CreatedById":168077,"CreatedDateTime":"2017-01-06T00:11:12Z","Content":"\n\u003Cp\u003E\nThere are actually proposals and designs to fly fixed wing aircraft in the Martian atmosphere with current technology.  The low density atmosphere requires more speed for flight, but this is offered with extremely low wing loading.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.nasa.gov/centers/armstrong/features/mars_airplane.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.nasa.gov/centers/armstrong/features/mars_airplane.html\u003C/a\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-01-06T00:11:31Z\u0022 title=\u002201/06/2017 12:11  AM\u0022 data-short=\u00227 yr\u0022\u003EJanuary 6, 2017\u003C/time\u003E by Jonfliesgoats\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2017-01-06T00:15:39Z","Content":"\n\u003Cp\u003E\nNot relevant Codraroll or Cubinator, either post.  The one about flying a Cessna on Mars is particularly ridiculous...  We\u0027re talking about *highly* specialized aircraft here, and not necessarily for any real economic purpose.  Not to mention, something like the Helios H-1 doesn\u0027t have *that* much inertia Cordraroll (did you bother looking it up before posting?)  It has about a dozen tiny landing gear and only weighs 1600 lbs.  Brakes would be perfectly sufficient to slow it down on the runway...\n\u003C/p\u003E\n\u003Cp\u003E\nIn short...\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222911905\u0022 data-ipsquote-contentid=\u0022154561\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221483659895\u0022 data-ipsquote-userid=\u0022163815\u0022 data-ipsquote-username=\u0022Codraroll\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n32 minutes ago, Codraroll said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://what-if.xkcd.com/30/\u0022 rel=\u0022external nofollow\u0022\u003ERelevant?\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNo\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-01-06T00:17:29Z\u0022 title=\u002201/06/2017 12:17  AM\u0022 data-short=\u00227 yr\u0022\u003EJanuary 6, 2017\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Jonfliesgoats","CreatedById":168077,"CreatedDateTime":"2017-01-06T00:21:10Z","Content":"\n\u003Cp\u003E\nSo an airplane on Mars is actually feasible, but it would look and perfor, somewhat differently than ones we see here on earth.  Very large wings, very light materials and large diameter propellers would be feasible.  We can run some math to get an idea of what our martian airplane will be like.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSo, first, the Martian speed of sound near the surface is about 240m/s.  If we want to sustain flight above the speed of sound, energy and control become a little bit more challenging.  So supersonic Martian airplanes probably aren\u0027t in the cards for any application that has to work in remote and austere environments (mars.)\n\u003C/p\u003E\n\u003Cp\u003E\nSo we need to design a plane that can fly happily at, say, .85 the speed of sound on Mars.  Let\u0027s use 200m/s for our effective speed limit for a low altitude flyer on Mars.\n\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2017-01-06T00:24:47Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222911933\u0022 data-ipsquote-contentid=\u0022154561\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221483661472\u0022 data-ipsquote-userid=\u0022168077\u0022 data-ipsquote-username=\u0022Jonfliesgoats\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 minutes ago, Jonfliesgoats said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThere are actually proposals and designs to fly fixed wing aircraft in the Martian atmosphere with current technology.  The low density atmosphere requires more speed for flight, but this is offered with extremely low wing loading.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.nasa.gov/centers/armstrong/features/mars_airplane.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.nasa.gov/centers/armstrong/features/mars_airplane.html\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBasically a miniaturized glider- but a lot closer to the right idea...  If they could fly something like that, maybe the next step would be a slightly larger version with a pair of miniature electric propellers they could power from solar panels and batteries (it would still run out of juice, but probably last a bit longer...)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022line-height:1.6;\u0022\u003EI\u0027m curious aboutscaled-up aircraft that actually *fly* on Mars, not just glide, though...\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022line-height:1.6;\u0022\u003ERegards,\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022line-height:1.6;\u0022\u003ENorthstar\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Jonfliesgoats","CreatedById":168077,"CreatedDateTime":"2017-01-06T00:27:48Z","Content":"\n\u003Cp\u003E\nThe Martian atmosphere at the surface is roughly 7mb, .02kg/m^3 with a space height of 11km.  For a plane flying 1km above the surface we can simplify our discussion am just use figures for lift and drag for a given wing at this density.\n\u003C/p\u003E\n\u003Cp\u003E\nA typical plane will have a maximum coefficient of lift of about 1.8 or 2 clean.\n\u003C/p\u003E\n\u003Cp\u003E\nAlright!  So let\u0027s feed these values into our formulae and start figuring out what sort of wing area we need to fly 100kg of drone or 1000kg of bigger plane!\n\u003C/p\u003E\n\u003Cp\u003E\nSo, feeding our data into the lift equation, we see that 100kg plane at roughly .4g (Mars) and a wing area of 10m^2 would be able to fly at only 150kph or about 45m/s!\n\u003C/p\u003E\n\u003Cp\u003E\nLet\u0027s compare these values to modern materials before we get too happy, though.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-01-06T00:42:47Z\u0022 title=\u002201/06/2017 12:42  AM\u0022 data-short=\u00227 yr\u0022\u003EJanuary 6, 2017\u003C/time\u003E by Jonfliesgoats\u003C/strong\u003E\n\u003Cbr\u003EMissing a digit.\n\u003C/span\u003E\n"},{"CreatedByName":"Jonfliesgoats","CreatedById":168077,"CreatedDateTime":"2017-01-06T00:40:02Z","Content":"\n\u003Cp\u003E\nStyrofoam has a density of roughly 40kg/m^3.  Assuming our plane has a wing thickness of 10cm, which is a realistic average, we would have 40kg of foam before we think about motors, structural stuff, instruments, servos etc.  So we may be a little optimistic.\n\u003C/p\u003E\n\u003Cp\u003E\nStill a more realistic wing loading with common wing geometry could easily see a Martian plane flying well below 100m/s or 360kph.  \n\u003C/p\u003E\n\u003Cp\u003E\nNow, can an airplane made from foam and Mylar survive landing on mars at those speeds?  Well, a typical light, twin engine recip flies In Earth\u0027s atmosphere at 180knots, which is in the same ball park in terms of speed.  I can\u0027t imagine our foam plane surviving well if it lands on n unprepared Martian surface at that speed.\n\u003C/p\u003E\n\u003Cp\u003E\nSo some sort of creative recovery option needs to be devised, like a net for certain drones, parachute recovery (need a huge parachute) etc.\n\u003C/p\u003E\n\u003Cp\u003E\nFor bigger planes, the math and speeds are the same, but the structural challenge of flying men in foam and Mylar on Mars is tough.  Tough, but not insurmountable.  Similar loadings for man-carrying aircraft ere used in the construction of the Gossamer albatross.  Weight of survival gear, life support etc. complicates things, but this is still doable with great cost and risk.\n\u003C/p\u003E\n"},{"CreatedByName":"Jonfliesgoats","CreatedById":168077,"CreatedDateTime":"2017-01-06T00:51:02Z","Content":"\n\u003Cp\u003E\nSo we talked wings.   Now let\u0027s talk drag and thrust!\n\u003C/p\u003E\n\u003Cp\u003E\nA typical drag coefficient for a decently designed plane can get pretty low.  Drag and airplanes is complex, however.  If we are flying our plane on Mars, let\u0027s assume that that we are kind of draggy with  design optimized for delivery and research rather than performance.  We\u0027ll use a drag coefficient of .75 for ball-park Numbers.  \n\u003C/p\u003E\n\u003Cp\u003E\nA 10 square meter wing has some frontal area as do the other components of our plane.  I trust our engineers, but let\u0027s not depend on them too much.  So for area estimates, let\u0027s say we are blunt and draggy.  We will pretend we present as much area as a 3m diameter ball of amalgamated airplane parts. \n\u003C/p\u003E\n\u003Cp\u003E\nIf we feed relevant numbers into the drag equation, we can get an idea of thrust required to keep our plane flying at 100m/s.\n\u003C/p\u003E\n"},{"CreatedByName":"Jonfliesgoats","CreatedById":168077,"CreatedDateTime":"2017-01-06T01:06:42Z","Content":"\n\u003Cp\u003E\nSo we need 540N of thrust to maintain level flight, assuming our rough estimates of drag ar somewhat close.\n\u003C/p\u003E\n\u003Cp\u003E\nNow we have to figure out whether we can squeeze enough thrust out of a motor and energy source light enough to do this.\n\u003C/p\u003E\n\u003Cp\u003E\nSo let\u0027s see what sort of prop we need to generate enough thrust on mars!  Well, that really depends a lot on motors, propellers and other things.  Suffice to say that current electric props, especially in multi-engine arrangements can meet the energy demands of your Martian plane.\n\u003C/p\u003E\n\u003Cp\u003E\nSo can we fly a plane on mars?  Yup.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-01-06T01:15:08Z\u0022 title=\u002201/06/2017 01:15  AM\u0022 data-short=\u00227 yr\u0022\u003EJanuary 6, 2017\u003C/time\u003E by Jonfliesgoats\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"YNM","CreatedById":98447,"CreatedDateTime":"2017-01-06T01:59:54Z","Content":"\n\u003Cp\u003E\nI think this has been talked about a lot of times.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://www.x-plane.com/adventures/mars.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.x-plane.com/adventures/mars.html\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nHere\u0027s just a quote :\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBottom line: All airplanes on Mars are AIRBORNE TITANICS: Ripping blissfully along, unaware of their impending doom due to their inability to TURN against their tremendous inertia.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"James Kerman","CreatedById":160462,"CreatedDateTime":"2017-01-06T04:55:59Z","Content":"\n\u003Cp\u003E\nThe \u003Ca href=\u0022http://www.perlanproject.org/\u0022 rel=\u0022external nofollow\u0022\u003EPerlan project \u003C/a\u003Eis a high altitude concept aircraft by Airbus. \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThis will require the engineering of a spacecraft with glider wings that can fly in less than 3% of normal air density and at temperatures of minus 70 degrees C, conditions approximating the surface of Mars.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002233F9A1D600000578-3579629-image-a-7_14627\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.dailymail.co.uk/i/pix/2016/05/09/07/33F9A1D600000578-3579629-image-a-7_1462776796423.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Mitchz95","CreatedById":82292,"CreatedDateTime":"2017-01-06T06:47:17Z","Content":"\n\u003Cp\u003E\nHmm... could we make some kind of blimp hybrid? A plane with moderate amounts of lifting gas incorporated into the design to make it lighter? That way some of the lift is always available, meaning lower speeds would be needed to stay in the air. And it\u0027s not like aerodynamics would be much of a problem in that thin atmosphere...\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-01-06T06:48:56Z\u0022 title=\u002201/06/2017 06:48  AM\u0022 data-short=\u00227 yr\u0022\u003EJanuary 6, 2017\u003C/time\u003E by Mitchz95\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"YNM","CreatedById":98447,"CreatedDateTime":"2017-01-06T15:03:13Z","Content":"\n\u003Cp\u003E\nMartian atmospheric density is quite close to vacuum. You\u0027d want some vacuum balloon instead of gas-filled ones. The performance will still be quite poor, compared to Earth-based hot air balloon ones.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-01-06T15:04:39Z\u0022 title=\u002201/06/2017 03:04  PM\u0022 data-short=\u00227 yr\u0022\u003EJanuary 6, 2017\u003C/time\u003E by YNM\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"wumpus","CreatedById":133850,"CreatedDateTime":"2017-01-06T16:42:28Z","Content":"\n\u003Cp\u003E\nAssuming helios could fly on Earth at densities that would be extreme on Mars, I\u0027d assume that a Helios-Mars plane could be constructed with wildly less mass and therefore fly at more reasonable altitudes.  Remember, .38g not only means that the wings need only do 38% of the work, but that a huge wingspan and other supporting structures need only support 38% of what Earthbound planes would need to do.  This effect snowballs fast, similar to the rocket equation.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 style=\u0022margin:0px;padding:0px 15px;border-width:1px 1px 1px 2px;border-color:rgb(237,237,237) rgb(232,232,232) rgb(219,219,219) rgb(102,102,102);border-style:solid;clear:both;color:rgb(39,42,52);font-family:\u0027Helvetica Neue\u0027, Helvetica, Arial, sans-serif;font-size:14px;font-style:normal;font-variant:normal;font-weight:normal;letter-spacing:normal;line-height:20.3636360168457px;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;background:rgb(251,251,251);\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022 style=\u0022margin:0px;padding:5px 15px;color:rgb(34,34,34);font-weight:bold;font-size:13px;background:rgb(243,243,243);\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBottom line: All airplanes on Mars are AIRBORNE TITANICS: Ripping blissfully along, unaware of their impending doom due to their inability to TURN against their tremendous inertia.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp style=\u0022margin-bottom:0px;color:rgb(39,42,52);font-family:\u0027Helvetica Neue\u0027, Helvetica, Arial, sans-serif;font-size:14px;font-style:normal;font-variant:normal;font-weight:normal;letter-spacing:normal;line-height:20.3636360168457px;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;background-color:rgb(255,255,255);\u0022\u003E\nIf this is true then similar high altitude Earth planes (U2, SR-71, Helios H-1, Perlan) would be equally doomed.  While the U2 often operated in the \u0022coffin corner\u0022, It apparently wasn\u0027t \u003Cem\u003Ealways \u003C/em\u003Edoomed.  Just don\u0027t let Jeb get over enthusiastic and do one of those pre-release \u0022yank the stick over at 10km\u0022 maneuvers that \u0022work in KSP\u0022.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0px;color:rgb(39,42,52);font-family:\u0027Helvetica Neue\u0027, Helvetica, Arial, sans-serif;font-size:14px;font-style:normal;font-variant:normal;font-weight:normal;letter-spacing:normal;line-height:20.3636360168457px;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;background-color:rgb(255,255,255);\u0022\u003E\nTo be honest, I suspect *flying* on Mars is hardly the biggest problem for martian planes.  Getting the thing to Mars and assembling the redonkulous wingspan will be a real trick.  Also the planes I mentioned either use Edwards Air Force base or similar runways (at roughly STP) or are simply pulled into the air (Perlan?).  Building a sufficiently long runway on Mars is likely out of the question.  I\u0027d have to assume that JATO and \u0022rocket assisted landing\u0022 would be required.  Expect multiple JATO stages dropped as the thing slowly accelerates to speed while being held up by JATO rockets the whole way: it is entirely possible that the plane structures requirements will be dominated by the need to reduce the time the JATO supports the craft as much as possible (not to mention the weight of the \u0022landing rockets\u0022).\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0px;color:rgb(39,42,52);font-family:\u0027Helvetica Neue\u0027, Helvetica, Arial, sans-serif;font-size:14px;font-style:normal;font-variant:normal;font-weight:normal;letter-spacing:normal;line-height:20.3636360168457px;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;background-color:rgb(255,255,255);\u0022\u003E\nCould you build a circular \u0022launch/land\u0022 rail/runway?  Could you make it out of martian concrete?  I really don\u0027t think the JATO idea could possibly work.\n\u003C/p\u003E\n"},{"CreatedByName":"SR","CreatedById":154209,"CreatedDateTime":"2017-01-06T21:34:28Z","Content":"\n\u003Cp\u003E\nIt might be more effective to use a CO2 NTR or a CO/O2 chemical engine powered hopper.\n\u003C/p\u003E\n\u003Cp\u003E\nThey could both use simple \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E systems.\n\u003C/p\u003E\n\u003Cp\u003E\nA balloon on mars could lift aproximately10g/m3.\n\u003C/p\u003E\n\u003Cp\u003E\nA Martian balloon would be able to carry more mass than the same balloon at 10000ft on earth due to low gravity and high molecular mass of the atmosphere.\n\u003C/p\u003E\n\u003Cp\u003E\nA plane would probably be a bad idea because of the lack of runways.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever a hybrid aircraft might work.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever a colony might be able too use planes because they would be able to build runways and thicken the atmosphere.\n\u003C/p\u003E\n"},{"CreatedByName":"Jonfliesgoats","CreatedById":168077,"CreatedDateTime":"2017-01-06T22:29:05Z","Content":"\n\u003Cp\u003E\nThere are hybrid options too.  Heavier than air, lifting blimps. for example.  If we want to fly something on Mars, be it a plane, helicopter or blimp, it\u0027s actually not that tough to do initially.  Logisticallly, getting runways for planes would be tough.  Finding smooth places without pointy things could complicate life for blimps too (even mooring to a tower, eventually the blimp needs to come down for servicing.).  \n\u003C/p\u003E\n\u003Cp\u003E\nIn the seventies a Martian plane project was proposed that was going to use hyperbolic fuels in a reciprocating engine to power some sort or reciprocating motor with a propeller.  Today and in the near future, electric motors with lightweight batteries and solar arrays on wings may do more.\n\u003C/p\u003E\n"},{"CreatedByName":"Jonfliesgoats","CreatedById":168077,"CreatedDateTime":"2017-01-06T22:41:56Z","Content":"\n\u003Cp\u003E\nFor people concerned about turning an airplane at high altitude and speed, there are complications but they are not as severe as one may think.  The turn radius of a given plane on mars will be wider due to the higher true airspeeds involved.  The forces, however, are no big deal.  A plane banking fifteen degrees on Mars will feel the same forces as a plane banking fifteen degrees on earth.\n\u003C/p\u003E\n\u003Cp\u003E\nWith respect to coffin corner, a previous post rightly said that the problems there are manageable.  \n\u003C/p\u003E\n\u003Cp\u003E\nSo while we may not be flying aerobatic routines on mars, we actually can fly and get around alright.\n\u003C/p\u003E\n\u003Cp\u003E\nAs another person said, getting a plane delivered there and recovering it are more challenging than flying and propulsion.\n\u003C/p\u003E\n\u003Cp\u003E\nA Martian helicopter could be more feasible.\n\u003C/p\u003E\n"},{"CreatedByName":"Rath","CreatedById":138223,"CreatedDateTime":"2017-01-07T05:42:32Z","Content":"\n\u003Cp\u003E\nPerhaps the plane could work off of some sort of really high energy density batteries and solar panels, and never actually land, just be dropped from orbit and fly forever (Or until the electronics fail)?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIf it was big enough to incorporate mid-air docking, it could even have little rocket powered shuttles bring up crew to service it (If it was able to run with some of the engines off, and if it could fly at high enough altitude for wing walking for changing solar panels to be sensible) or even to use it as a long range inter-base transport.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-01-07T05:45:24Z\u0022 title=\u002201/07/2017 05:45  AM\u0022 data-short=\u00227 yr\u0022\u003EJanuary 7, 2017\u003C/time\u003E by Rath\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Jonfliesgoats","CreatedById":168077,"CreatedDateTime":"2017-01-07T12:14:19Z","Content":"\n\u003Cp\u003E\nPerhaps.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat about paragliders?  We have GPS guided ram-air parachutes for precise deliveries here on Earth.  It is entirely conceivable that a paraglide could be used for deliveries to locations on mars.  A paraplane would be deliverable to Mars too.\n\u003C/p\u003E\n"}]}