{"TopicId":154598,"ForumId":20,"TopicTitle":"KOS Scripting","CreatedByName":"alpha tech","CreatedById":84978,"CreatedDateTime":"2017-01-06T18:20:15Z","PageNum":1,"Articles":[{"CreatedByName":"alpha tech","CreatedById":84978,"CreatedDateTime":"2017-01-06T18:20:15Z","Content":"\n\u003Cp\u003E\nI Recently downloaded KOS and I kind of have an idea of what I want to do. I want to script multiple scripts to achieve an Apollo style Landing on the moon and to do this I have decided on the scripts I want to make.. The first one is the auto-launch program where the craft goes up to 5 - 10 km then preforms a gravity turn and is put on a heading until the objective altitude is reached then it coasts to Apogee then makes the circularization burn I also want it to script the if negative vertical velocity to trigger the abort action group and switch to a file that contains procedures for the abort to jettison the \u003Cabbr title=\u0022Launch Escape System\u0022\u003Eles\u003C/abbr\u003E and to deploy the parachutes. I need a program that will execute maneuver nodes, a lunar landing Descent and Liftoff, a reentry autopilot for displaying heat shield integrity and action groups. I will also need a few micro managing programs that I think I can code my self and some of this I may be able to do since I do not fully understand the Kerbal computing language.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"maculator","CreatedById":122127,"CreatedDateTime":"2017-04-04T12:16:20Z","Content":"\n\u003Cp\u003E\nThis is a late reply, I know.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve been browsing for some tutorials and guides on kos lately and I can only recommend you to go small first.\n\u003C/p\u003E\n\u003Cp\u003E\nI completed a script to knockout kerbal tourists in space and return them to the surface wich took me a while. Now that I managed to put tourists in orbit and return them my first script seems verry easy.\n\u003C/p\u003E\n\u003Cp\u003E\nNow im tweaking my tourist to orbit script a bit while reading through the documentation of kos and then I plan on put satelites in orbit and deorbit the ascent stage.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you go slow and step by step with small goals you\u0027ll have more fun then dreaming big and finding out your not skilled enough.\n\u003C/p\u003E\n\u003Cp\u003E\nI wish I knew how to use functions \u003Cimg alt=\u0022:/\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/ZNGIcon1.png\u0022 title=\u0022:/\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"jhousen","CreatedById":129754,"CreatedDateTime":"2017-04-09T05:56:56Z","Content":"\n\u003Cp\u003E\nyou\u0027re starting your gravity turn too late, you want a smooth turn from start to at least the upper middle atmosphere (about 20k)\n\u003C/p\u003E\n\u003Cp\u003E\nthe one I use is modelled after my manual flights and has the key points of:\n\u003C/p\u003E\n\u003Cp\u003E\n2400m 80 degrees\n\u003C/p\u003E\n\u003Cp\u003E\n12k 60 degrees\n\u003C/p\u003E\n\u003Cp\u003E\n24k 30 degrees\n\u003C/p\u003E\n\u003Cp\u003E\nthen the run to orbit\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nnote this is modelled after my own flying, I advise you to do the same, take a close look at how you manually do a task, then code to duplicate it\n\u003C/p\u003E\n"}]}