{"TopicId":154821,"ForumId":16,"TopicTitle":"Best method of ballistic missile reentry","CreatedByName":"RA3236","CreatedById":150734,"CreatedDateTime":"2017-01-11T06:36:51Z","PageNum":1,"Articles":[{"CreatedByName":"RA3236","CreatedById":150734,"CreatedDateTime":"2017-01-11T06:36:51Z","Content":"\n\u003Cp\u003E\nHey, I\u0027m having problems with overheating while building an ICBM for the Stock Weapons challenge. Is it better for heat load if I go more straight down from space (straight up sorta) or going orbital velocities in the upper atmosphere (like 55km or something)? Which seems like the approach to take to lesson the heat?\n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2017-01-11T07:33:36Z","Content":"\n\u003Cp\u003E\nIf you want your ICBM to look like a missile, then it will have very low drag. So it will not slow down quickly on reentry. So it will get very hot indeed. The only answer to that is a heat shield on the nose. There is no other way.\n\u003C/p\u003E\n"},{"CreatedByName":"Speeding Mullet","CreatedById":62635,"CreatedDateTime":"2017-01-11T07:34:48Z","Content":"\n\u003Cp\u003E\nHmm, that\u0027s a tough one and I can\u0027t back my answer up with facts as most people are looking to stop before they hit the ground in KSP \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nI would say however, that above about 35km in the atmosphere your craft is really only acting as a heatsoak which would suggest a skip out of the atmosphere and a relatively steep but not vertical re-entry would suit you well.\u003Cbr\u003E\u003Cbr\u003E\nI\u0027ve referenced/semi quoted \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/98962-streetwind/\u0026amp;do=hovercard\u0022 data-mentionid=\u002298962\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/98962-streetwind/\u0022 rel=\u0022\u0022\u003E@Streetwind\u003C/a\u003E from this post who may be able to help some more!\n\u003C/p\u003E\n\u003Ciframe data-embedcontent=\u0022\u0022 frameborder=\u00220\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/139368-help-with-re-entry-in-v112/\u0026amp;do=embed\u0026amp;comment=2570539\u0026amp;embedComment=2570539\u0026amp;embedDo=findComment\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\nUnless you are keeping it secret would be cool to check out your design!\n\u003C/p\u003E\n\u003Cp\u003E\nSM\n\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2017-01-11T09:54:45Z","Content":"\n\u003Cp\u003E\nFor reference, the reason why spending a lot of time in the upper atmosphere is bad for you is threefold:\n\u003C/p\u003E\n\u003Cp\u003E\n- KSP actually does some simple atmospheric layer modeling. At sea level, the temperature is nice and normal. Then as you go higher, air temperature drops a whole lot. The middle layer, the stratosphere, has very cold air. But what lies above the stratosphere? The so-called thermosphere. Sounds hot, doesn\u0027t it? Because it is. Air temperature in the thermosphere rises rapidly, and climbs very high. Much higher than at sea level. Eventually the thermosphere fades out into vacuum, which is cold again, but there\u0027s a temperature peak somewhere in the upper atmosphere. And since convective heat exchange is a thing that happens in KSP, that means that during reentry, you\u0027re dealing not only with shock heating but actually with hot air as well. And if you ever wondered why the heat load of your capsule goes down sharply as you pass a certain point on your way down: this is not only because you\u0027re starting to slow down more aggressively. It is also because you\u0027re transitioning out of the hottest part of the atmosphere into the coldest part of the atmosphere, and that literally air-cools your spacecraft.\n\u003C/p\u003E\n\u003Cp\u003E\n- Shock heating and drag don\u0027t increase the same way with atmospheric density. At the edge of vacuum, drag starts lower, but it scales up much faster than heat does. This means that if you go lower down, you\u0027re trading only a little more heat for a large amount of extra drag. In most cases, this is a trade very much in your favor. The only thing you need to avoid is exceeding your part heat thresholds. If you\u0027re not near that value, it\u0027s often a good idea to go down faster, earlier.\n\u003C/p\u003E\n\u003Cp\u003E\n- For the most part, people think about the maximum allowable part temperature as a transient state when thinking about how much reentry heat they can handle. \u0022When I come down like this, things never get hotter than 1600 K, and my part can handle 2000 K, so I\u0027ll be fine because temperature goes away again after the peak.\u0022 This simplification is okay on a typical ballistic reentry of a craft that comes out of cold space. But when you look more closely, temperature is a little more complicated. Temperature is the result of X amount of heat energy inserted into Y amount of thermal mass. The skin of a spacecraft has low thermal mass, which means that it responds very quickly to reentry heat. In fact, it would burn up within a second or two if it didn\u0027t have a way to get rid of the heat that is flowing into it. Four ways exist for the skin to shed heat. Convection sheds heat to surrounding gas or liquid as it flows past the skin. This works best in the stratosphere and worst in the thermosphere (see point 1 above). Blackbody radiation sheds heat independent of its surroundings. Conduction sheds heat by transferring it to other parts of the spacecraft - and in particular, to the internal structure of the same part. Finally, heatshields can do pyrolysis, which is to say, they consume large amounts of energy to fuel the chemical process of decomposing a part of themselves and shedding the glowing hot mass that results.\n\u003C/p\u003E\n\u003Cp\u003E\nAll of these ways share the same basic trait: they work better the hotter the skin is. And for the first three, it\u0027s specifically the temperature of the skin \u003Cem\u003Ein relation to its heat exchange partner\u003C/em\u003E. Convection works best if the air is cold. Blackbody radiation works best in the absence of incoming radiation (i.e. while in the shadow). Conduction works best when conducting to other parts, or to internals, which are cold. This has two implications. First, the hotter the skin gets, the more it resists getting even hotter. Taking a part from 90% to 100% heat load costs much, \u003Cem\u003Emuch\u003C/em\u003E more energy than taking it from 40% to 50%. That is why you sometimes survive reentry even though your heat bars look just about full - getting those last few degrees takes a lot of extra heat, because convection, conduction and radiation are all working at peak efficiency to transfer heat away from the loaded skin. Second - and this is the whole point I\u0027ve been building up to: the longer your reentry takes, the worse your tolerances get.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you spend a long time flying with high skin temperatures, then that heat is going to go somewhere else. It\u0027s going to transfer to parts that are not in the airstream, and it\u0027s going to transfer to the internals of the parts that are in the airstream. Internals have the majority of the thermal mass of a part, so they can take in a lot of energy and only increase in temperature slowly. But as they increase in temperature, the difference between them and the temperature of the skin gets reduced. This, in turn, means that conduction of heat away from the skin slows down over time as your craft soaks heat. And with conduction slowing down, the skin is going to have a problem. In order to not overheat, it must have the same heat flux outbound as it is getting inbound from shock heating. And in order to maintain its outbound heat flux while conduction is slowing down, it needs to increase its temperature so that all the other ways of losing heat improve. So the skin gets hotter, even if the external heat load doesn\u0027t change at all. And hotter. And hotter. Of course, if there are other parts on the craft that are not in the airstream (i.e. if it\u0027s not just a single capsule), then those parts will also start shedding heat via convection and radiation as they heat up. So the craft may never actually soak heat to the point of melting to slag. But it still creates a situation where your heat tolerances shrink over time. You can\u0027t go lower, because your skin is almost maxed out; and you can\u0027t stay where you are either, because you\u0027re just soaking heat without really slowing down, and making things worse as time goes on. It\u0027s really awkward. In extreme cases, you can literally burn up in the atmosphere from being too timid during reentry.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIn the case of an ICBM, as is the topic of this thread, heat soak while traveling through the thermosphere might cause the warhead to fail as it dives down towards its target, even if the heat load would nominally be survivable if the missile was cold. Therefore, I echo the suggestions given in favor of a suborbital hop outside the atmosphere. Whether or not you need a heatshield is something you\u0027ll need to figure out for yourself through testing. If you end up needing one, you could patch a nosecone using \u003Cabbr title=\u0022Module Manager (mod)\u0022\u003EMM\u003C/abbr\u003E to include ablator. I took care of documenting ModuleAblator on the community API documentation (link in my sig), so you can look up how it works there. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-01-11T10:24:38Z\u0022 title=\u002201/11/2017 10:24  AM\u0022 data-short=\u00227 yr\u0022\u003EJanuary 11, 2017\u003C/time\u003E by Streetwind\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Speeding Mullet","CreatedById":62635,"CreatedDateTime":"2017-01-11T10:08:36Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222917819\u0022 data-ipsquote-contentid=\u0022154821\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221484128485\u0022 data-ipsquote-userid=\u002298962\u0022 data-ipsquote-username=\u0022Streetwind\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 minutes ago, Streetwind said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nFor reference, the reason why spending a lot of time in the upper atmosphere is bad for you is threefold:\n\u003C/p\u003E\n\u003Cp\u003E\n*SNIP*\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBest ever response to me pulling someone I don\u0027t know into a thread.  Love love love the KSP community for this reason, and thanks for the education - it was an enlightening and thoroughly interesting read!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSM\n\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2017-01-11T10:18:08Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222917826\u0022 data-ipsquote-contentid=\u0022154821\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221484129316\u0022 data-ipsquote-userid=\u002262635\u0022 data-ipsquote-username=\u0022Speeding Mullet\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 minutes ago, Speeding Mullet said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBest ever response to me pulling someone I don\u0027t know into a thread.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou\u0027re welcome. Hope the wall of text won\u0027t crush any unsuspecting passerbys \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"RA3236","CreatedById":150734,"CreatedDateTime":"2017-01-11T12:05:49Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222917819\u0022 data-ipsquote-contentid=\u0022154821\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221484128485\u0022 data-ipsquote-userid=\u002298962\u0022 data-ipsquote-username=\u0022Streetwind\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Streetwind said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIn the case of an ICBM, as is the topic of this thread, heat soak while traveling through the thermosphere might cause the warhead to fail as it dives down towards its target, even if the heat load would nominally be survivable if the missile was cold. Therefore, I echo the suggestions given in favor of a suborbital hop outside the atmosphere. Whether or not you need a heatshield is something you\u0027ll need to figure out for yourself through testing. If you end up needing one, you could patch a nosecone using \u003Cabbr title=\u0022Module Manager (mod)\u0022\u003EMM\u003C/abbr\u003E to include ablator. I took care of documenting ModuleAblator on the community API documentation (link in my sig), so you can look up how it works there. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nMost of it was a TL;DR but I see what you mean about skin temperatures. The fairing and heat shield under the fairing fail at the exact moment the missile starts slowing down. Also, \u0022Stock Weapons Challenge\u0022 means no \u003Cabbr title=\u0022Module Manager (mod)\u0022\u003EMM\u003C/abbr\u003E config, but ill keep the reference. I agree that from that a suborbital hop would be good, just requiring a good amount of trial and error.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222917773\u0022 data-ipsquote-contentid=\u0022154821\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221484120088\u0022 data-ipsquote-userid=\u002262635\u0022 data-ipsquote-username=\u0022Speeding Mullet\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Speeding Mullet said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHmm, that\u0027s a tough one and I can\u0027t back my answer up with facts as most people are looking to stop before they hit the ground in KSP \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nI would say however, that above about 35km in the atmosphere your craft is really only acting as a heatsoak which would suggest a skip out of the atmosphere and a relatively steep but not vertical re-entry would suit you well.\u003Cbr\u003E\u003Cbr\u003E\nI\u0027ve referenced/semi quoted \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/98962-streetwind/\u0026amp;do=hovercard\u0022 data-mentionid=\u002298962\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/98962-streetwind/\u0022 rel=\u0022\u0022\u003E@Streetwind\u003C/a\u003E from this post who may be able to help some more!\n\u003C/p\u003E\n\u003Cp\u003E\nUnless you are keeping it secret would be cool to check out your design!\n\u003C/p\u003E\n\u003Cp\u003E\nSM\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nMy design is \u003Cabbr title=\u0022Original Post(er). The first post in a thread, or the person who posted it.\u0022\u003EOP\u003C/abbr\u003E for a missile, let\u0027s just say (proof of concept). The skip-and dive technique did not work very well (90km skip, 45 degree dive = explosion at 20km) The missile is currently MK 3 Orion parts with two boosters, but I\u0027m looking to decrease that as I add \u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKER\u003C/abbr\u003E for \u003Cabbr title=\u0022Delta-V\u0022\u003EDV\u003C/abbr\u003E readouts.\n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2017-01-11T13:58:58Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222917819\u0022 data-ipsquote-contentid=\u0022154821\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221484128485\u0022 data-ipsquote-userid=\u002298962\u0022 data-ipsquote-username=\u0022Streetwind\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Streetwind said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBlackbody radiation sheds heat independent of its surroundings.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe problem is that this statement is incorrect. Blackbody radiation only transfers heat if there is a transparent window to someplace really cold. This is why you will get radiative frost on a car on a clear night, but not on a cloudy night at the same temperature. So, when you are cruising along above 61km on Kerbin, your ship is merrily shedding heat to space through blackbody radiation. As soon as you enter a fireball, blackbody cooling shuts down. So you can cruise at very high altitudes for long periods and stay cold, even though you are in the thermosphere.\n\u003C/p\u003E\n\u003Cp\u003E\nAdditionally, Streetwind is ignoring a very large fifth sink for energy. Energy can not only be shed through drag (friction) -- the aerodynamics can also produce \u003Cstrong\u003E\u003Cem\u003Elift.\u003C/em\u003E\u003C/strong\u003E If your ship has a 50% lift to drag ratio, then a third of your kinetic energy that you are shedding is being turned into lift, which does not cause any heating at all. Body lift during reentry is an extremely important phenomenon.\n\u003C/p\u003E\n\u003Cp\u003E\nBeyond that, the faster you shed energy to your surroundings, the hotter the surroundings will get. The plasma ball around a ship traveling at 1800 m/s will not be nearly as hot as the plasma ball around a ship traveling at 3100 m/s at the same altitude. So while a quick descent will avoid heating problems early in your reentry, it makes them significantly worse later in your reentry. It is not a free trade.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd all of this can be demonstrated empirically. You don\u0027t need to take anybody\u0027s word for it. Just try it. If you try a shallow reentry method, where you stay above 61km for a very extended period, does your ship heatsplode every time? And if it doesn\u0027t then doesn\u0027t that mean there is a factor that Streetwind\u0027s arguments are not taking into account? Because according to those arguments, staying high should be 100% fatal. Keep in mind, though, that you need to be doing some productive braking while you are zooming along \u0027way up there. The whole point is to scrub kinetic energy -- so if you aren\u0027t slowing down, then you aren\u0027t doing it right.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-01-11T14:18:39Z\u0022 title=\u002201/11/2017 02:18  PM\u0022 data-short=\u00227 yr\u0022\u003EJanuary 11, 2017\u003C/time\u003E by bewing\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Magzimum","CreatedById":167187,"CreatedDateTime":"2017-01-11T14:27:11Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222917829\u0022 data-ipsquote-contentid=\u0022154821\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221484129888\u0022 data-ipsquote-userid=\u002298962\u0022 data-ipsquote-username=\u0022Streetwind\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Streetwind said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYou\u0027re welcome. Hope the wall of text won\u0027t crush any unsuspecting passerbys \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI just passed by and was delighted with the wall of text. I know a thing or two about heat transfer phenomena and I was happy to see that I have nothing to add to your post. Excellent work. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nJust a thought: The nose cones typically have a low mass. Would you think that in certain cases they actually heat up quicker than parts with worse aerodynamic properties but higher mass?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-01-11T14:29:20Z\u0022 title=\u002201/11/2017 02:29  PM\u0022 data-short=\u00227 yr\u0022\u003EJanuary 11, 2017\u003C/time\u003E by Magzimum\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2017-01-11T15:25:18Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222917955\u0022 data-ipsquote-contentid=\u0022154821\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221484143138\u0022 data-ipsquote-userid=\u0022154251\u0022 data-ipsquote-username=\u0022bewing\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, bewing said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe problem is that this statement is incorrect. Blackbody radiation only transfers heat if there is a transparent window to someplace really cold. This is why you will get radiative frost on a car on a clear night, but not on a cloudy night at the same temperature. So, when you are cruising along above 61km on Kerbin, your ship is merrily shedding heat to space through blackbody radiation. As soon as you enter a fireball, blackbody cooling shuts down. So you can cruise at very high altitudes for long periods and stay cold, even though you are in the thermosphere.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIs KSP\u0027s modeling that precise, though? Last time I watched the debug output of a part during reentry - which was in 1.1.3, mind - blackbody radiation happily continued from start to finish. Admittedly I don\u0027t have any empiric data from the current version, so who knows. it might have been changed.\n\u003C/p\u003E\n\u003Cp\u003E\nBesides, you\u0027re quoting that out of context. In that paragraph, I was talking about where the heat goes off to. I wanted to express the difference to convection, i.e that you don\u0027t need to have air around you for radiation to work. But I also didn\u0027t want to say that it \u0022sheds heat into empty space\u0022, because if we\u0027re talking about reentry, that\u0027s just confusing to the reader. Perhaps I could have worded it better, but I was kind of just streaming my thought into words. \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E I did mention later-on that blackbody radiation works best when there\u0027s a large heat difference between the skin and the medium it radiates into.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222917955\u0022 data-ipsquote-contentid=\u0022154821\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221484143138\u0022 data-ipsquote-userid=\u0022154251\u0022 data-ipsquote-username=\u0022bewing\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, bewing said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAdditionally, Streetwind is ignoring a very large fifth sink for energy. Energy can not only be shed through drag (friction) -- the aerodynamics can also produce \u003Cstrong\u003E\u003Cem\u003Elift.\u003C/em\u003E\u003C/strong\u003E If your ship has a 50% lift to drag ratio, then a third of your kinetic energy that you are shedding is being turned into lift, which does not cause any heating at all. Body lift during reentry is an extremely important phenomenon.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI was specifically talking about the heat energy that enters the skin of a part exposed to shock heating. You are completely correct in your description of what happens with other energies during reentry, but that\u0027s outside of what I examined here \u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E If heat was never created in the first place, then it is of no consequence to the heat simulation.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222917955\u0022 data-ipsquote-contentid=\u0022154821\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221484143138\u0022 data-ipsquote-userid=\u0022154251\u0022 data-ipsquote-username=\u0022bewing\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, bewing said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSo while a quick descent will avoid heating problems early in your reentry, it makes them significantly worse later in your reentry. It is not a free trade.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027d argue that yes, it is a free trade... IF you have the heat tolerance for the worse part later-on. In the reverse view: you would gain nothing from performing a slow, timid reentry that peaks at 1600 K if your capsule is rated for 2200 K, or you have a heatshield rated for 3100 K with a massive amount of pyrolysis flux fighting the gaining of temperature every step of the way. Just get right down there into it, IMHO!\n\u003C/p\u003E\n\u003Cp\u003E\nAdditionally, there are factors of orbital mechanics that can work in your favor or against you. The rate of descent is slowest when close to AP and close to PE, and it is the fastest in the middle of the two. If you set your reentry up right, that fast descent rate in the middle of the apses will see you rush through the upper atmosphere, and the combination of body lift and careful periapsis planning will nearly arrest your descent rate once you are approaching the stratosphere. Then you have a short time of nearly level flight in a regime with survivable shock heating, cooler air, and significant slowing force, all of which will contribute to a fast, safe and consitent reentry with moderate g-forces. If, in the opposite case, you leave from a low apopasis right above the atmosphere, you will spend time with a slow descent rate in the upper atmosphere, where what little drag you get will mostly just drop your periapsis lower. And as the air slowly gets thicker, your descent rate picks up, your periapsis continues dropping because you\u0027re still only halfway there, and you can potentially run into a situation where you hit the stratosphere fairly steeply and get a sharp deceleration spike with high g-forces and peak heat near the end of the reentry.\n\u003C/p\u003E\n\u003Cp\u003E\nSpaceplanes can usually prevent this, because they have the lift required to pull out of this dive; a capsule however lacks this lift, and such a trajectory is a very poor choice for it. Additionally, even a spaceplane doesn\u0027t gain anything from not making use of what heat tolerance it has available. It\u0027s just that their tolerances are much tighter to begin with, so it rarely comes up that a pilot says \u0022you know what, I could be more aggressive here\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222917955\u0022 data-ipsquote-contentid=\u0022154821\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221484143138\u0022 data-ipsquote-userid=\u0022154251\u0022 data-ipsquote-username=\u0022bewing\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, bewing said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAnd if it doesn\u0027t then doesn\u0027t that mean there is a factor that Streetwind\u0027s arguments are not taking into account? Because according to those arguments, staying high should be 100% fatal.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNow let\u0027s not put words into my mouth, mm\u0027kay? I said \u003Cem\u003E\u0022So the craft may never actually soak heat to the point of melting to slag\u0022\u003C/em\u003E as well as \u003Cem\u003E\u0022In extreme cases, you can literally burn up\u0022\u003C/em\u003E. That\u0027s a far cry from a supposed \u0022100% fatal\u0022, IMHO. I\u0027m pretty sure you\u0027d have to intentionally engineer a situation where you kill your craft from heat soak on stock Kerbin, because the game is so generous with tolerances. Now Eve, however...\n\u003C/p\u003E\n\u003Cp\u003E\nAnd do note that \u003Cabbr title=\u0022Original Post(er). The first post in a thread, or the person who posted it.\u0022\u003EOP\u003C/abbr\u003E is asking about the merits of having a ground-launched ICBM cruise through the upper atmosphere towards its target, at orbital velocity, potentially under constant thrust, followed by a non-braking dive into the thick lower atmosphere. With missiles being pointy, and thus unable to form a detached bow shock, that can be a pretty extreme and intentionally engineered scenario, depending on the distance he seeks to cover. Heat soak is a mechanic he needs to understand in order to grasp why that plan is more likely to end in failure than in the destruction of his enemies.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEDIT:\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222917979\u0022 data-ipsquote-contentid=\u0022154821\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221484144831\u0022 data-ipsquote-userid=\u0022167187\u0022 data-ipsquote-username=\u0022Magzimum\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Magzimum said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nJust a thought: The nose cones typically have a low mass. Would you think that in certain cases they actually heat up quicker than parts with worse aerodynamic properties but higher mass?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYes, but: nosecones are notoriously heat sensitive for reasons other than mass, too. The more pointy, the less a part is able to create a detached bow shock... in other words, a very pointy part has the shock heating pressed right up against it, while a very blunt part is pushing it ahead of itself and feels it less. Try googling up some wind tunnel images, it\u0027ll immediately become apparent what I mean \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWhich is why I keep telling new spaceplane pilots to keep their nose up, up, up during reentry. Not only do you generate more drag if you present yourself like a barn door, but you also don\u0027t want that pointy aerodynamic front anywhere near the center of your plasma shroud!\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-01-11T15:32:17Z\u0022 title=\u002201/11/2017 03:32  PM\u0022 data-short=\u00227 yr\u0022\u003EJanuary 11, 2017\u003C/time\u003E by Streetwind\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Magzimum","CreatedById":167187,"CreatedDateTime":"2017-01-11T17:19:48Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222918018\u0022 data-ipsquote-contentid=\u0022154821\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221484148318\u0022 data-ipsquote-userid=\u002298962\u0022 data-ipsquote-username=\u0022Streetwind\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Streetwind said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYes, but: nosecones are notoriously heat sensitive for reasons other than mass, too. The more pointy, the less a part is able to create a detached bow shock... in other words, a very pointy part has the shock heating pressed right up against it, while a very blunt part is pushing it ahead of itself and feels it less. Try googling up some wind tunnel images, it\u0027ll immediately become apparent what I mean \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWhich is why I keep telling new spaceplane pilots to keep their nose up, up, up during reentry. Not only do you generate more drag if you present yourself like a barn door, but you also don\u0027t want that pointy aerodynamic front anywhere near the center of your plasma shroud!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSure. But a spaceplane wants to shed its velocity and make a safe landing.\n\u003C/p\u003E\n\u003Cp\u003E\nAn ICBM on the other hand wants to maintain speed (to avoid making itself an easy target for intercept). So from that point of view, pointy bit forward, I\u0027d say. \n\u003C/p\u003E\n\u003Cp\u003E\nSo summing it up, the best design for an ICBM is long and slender, with a pointy nosecone if it doesn\u0027t blow up, and if the nose cone does blow up, a small diameter heat shield instead?\n\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2017-01-11T17:38:33Z","Content":"\n\u003Cp\u003E\nYes, that\u0027s what \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/150734-ra3236/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022150734\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/150734-ra3236/\u0022 rel=\u0022\u0022\u003E@RA3236\u003C/a\u003E has been doing, from what I read. Fairing to form a nosecose, heat shield under fairing.\n\u003C/p\u003E\n"},{"CreatedByName":"wumpus","CreatedById":133850,"CreatedDateTime":"2017-01-11T17:53:16Z","Content":"\n\u003Cp\u003E\nJust out of curiosity, is this all due to Kerbin\u0027s weird size, or does this matter on Earth reentry as well?  Looking at wiki (I know), I\u0027d expect any craft in [Earth\u0027s] thermosphere to be still in orbit.  Also while the temperature might be wildly higher, it is \u0022only\u0022 an order of magnitude higher in Kelvin, so the effects aren\u0027t quite as extreme as you\u0027d think (just expect to get ten times the heating for the same negative delta-v, assuming you can slow down *at all* in the Earth\u0027s thermosphere).\n\u003C/p\u003E\n\u003Cp\u003E\nJust another thing to learn if switching to \u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E.\n\u003C/p\u003E\n"},{"CreatedByName":"RA3236","CreatedById":150734,"CreatedDateTime":"2017-01-11T22:59:32Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/98962-streetwind/\u0026amp;do=hovercard\u0022 data-mentionid=\u002298962\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/98962-streetwind/\u0022 rel=\u0022\u0022\u003E@Streetwind\u003C/a\u003E I\u0027m trying to launch directly to KSC2. Its always the fairing that fails first, and I\u0027m guessing i hit a shock wave at 35km at 2200m/s. Launching to 55km should combat this, and the heat shield failing in two seconds flat after the second stage failed to maintain integrity. (Yes, I do have the warhead having an engine stuck to it, for testing purposes).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/167187-magzimum/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022167187\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/167187-magzimum/\u0022 rel=\u0022\u0022\u003E@Magzimum\u003C/a\u003E My current design (if it didn\u0027t blow up at 20km) is supposed to get within 20km of target and then activate the last engine to maintain speeds after the heating wears off.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/154251-bewing/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022154251\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/154251-bewing/\u0022 rel=\u0022\u0022\u003E@bewing\u003C/a\u003E My missile only explodes when a) the boosters accidentally fly into the last stage because I forget to place separatrons on it or b) when it hits the lower atmosphere.\n\u003C/p\u003E\n"},{"CreatedByName":"Tyko","CreatedById":164179,"CreatedDateTime":"2017-01-12T00:03:10Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222917829\u0022 data-ipsquote-contentid=\u0022154821\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221484129888\u0022 data-ipsquote-userid=\u002298962\u0022 data-ipsquote-username=\u0022Streetwind\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n13 hours ago, Streetwind said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYou\u0027re welcome. Hope the wall of text won\u0027t crush any unsuspecting passerbys \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNo, that was great and filled in a number of knowledge gaps for me. Thanks for taking the time.\n\u003C/p\u003E\n"}]}