{"TopicId":154938,"ForumId":16,"TopicTitle":"Where to put Radiator parts?","CreatedByName":"Noel32","CreatedById":137853,"CreatedDateTime":"2017-01-13T15:17:27Z","PageNum":1,"Articles":[{"CreatedByName":"Noel32","CreatedById":137853,"CreatedDateTime":"2017-01-13T15:17:27Z","Content":"\n\u003Cp\u003E\nMy question is, as the title says, where can I put radiators and have them still be effective. Can they be anywhere on the vessel or do they have to be on the part that needs cooling?\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2017-01-13T15:26:50Z","Content":"\n\u003Cp\u003E\nMoving to Gameplay Questions.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222920266\u0022 data-ipsquote-contentid=\u0022154938\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221484320647\u0022 data-ipsquote-userid=\u0022137853\u0022 data-ipsquote-username=\u0022Noel32\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 minutes ago, Noel32 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nCan they be anywhere on the vessel or do they have to be on the part that needs cooling?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nDepends on the radiator type.\n\u003C/p\u003E\n\u003Cp\u003E\nFor the \u003Cem\u003E\u003Cu\u003Edeployable\u003C/u\u003E\u003C/em\u003E radiators (i.e. the folding ones that rotate to stay edge-on to the sun), no, it doesn\u0027t matter where you put them.  At all.  You can have the hot stuff at one end of the ship, and the radiators at the opposite end-- doesn\u0027t matter, they pump heat from the whole ship.\n\u003C/p\u003E\n\u003Cp\u003E\nFor the \u003Cem\u003E\u003Cu\u003Estatic\u003C/u\u003E\u003C/em\u003E radiators, they need to be mounted close to the thing to cool.  Whether they only cool the parent part, or can extend their reach a bit farther, I\u0027m fuzzy on-- I get the impression that KSP has kinda gone back and forth on this somewhat over the past few versions, and in the past (pre-1.2) I observed them cooling stuff from all over the ship even though supposedly they\u0027re supposed only to cool locally.  So I\u0027m not completely clear on their exact behavior now (not least because I never use them, ever; the folding panels are just better).  However, broadly speaking, I believe that yes, their placement matters.\n\u003C/p\u003E\n"},{"CreatedByName":"DrLicor","CreatedById":165712,"CreatedDateTime":"2017-01-13T15:27:41Z","Content":"\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nQuoted from \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/110461-laie/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022110461\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/110461-laie/\u0022 rel=\u0022\u0022\u003E@Laie\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022\n\u003C/p\u003E\n\u003Cdiv\u003E\n\u003Cp\u003E\n\u0022Radiator panels\u0022 (the fixed type) assume the temperature of their parent part without noticable delay. There\u0027s also a smaller difference between core and skin temperature, but in my test case that difference wasn\u0027t very large even for the parent. In effect, they increase the surface area of the parent. Compared to fuel tanks of 16t and above, even the large panel doesn\u0027t provide much extra area, though. And anyway, radiation depends very much on temperature: in order to radiate well, a part has to be very hot. Which in this case means that the panel\u0027s parent has to be very hot -- a situation you probably want to avoid from the outset. Still, a panel or two may make the difference between a part going poof, or merely running dangerously hot. But as I said two sentences ago: if a part does not become dangerously hot, the panel will also have little to do.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Thermal control systems\u0022 (the extendable swivel type) gather heat from all over the vessel. They can easily be the hottest part on the ship and thus also radiate disproportional amounts of heat. For purposes of heat managment, it does not matter where you place them. However, they will break if they collide with other parts of your vessel, so you better make sure they have enough elbow room.\n\u003C/p\u003E\n\u003Cp\u003E\nSo far, it seems as if the fixed radiators were nearly useless. However, when in atmosphere they may also help with shedding heat through convection. Think of a nosecone that gets really hot during reentry and continues to dump heat into a nearby part long after you\u0027ve been through the worst of it. Or running a nuclear engine on a spaceplane, where nearby parts could conceivably become even hotter than the surrounding atmosphere. I did not test this, however.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n"},{"CreatedByName":"fourfa","CreatedById":151713,"CreatedDateTime":"2017-01-13T18:19:42Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222920271\u0022 data-ipsquote-contentid=\u0022154938\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221484321210\u0022 data-ipsquote-userid=\u0022125662\u0022 data-ipsquote-username=\u0022Snark\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Snark said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nFor the \u003Cem\u003E\u003Cu\u003Edeployable\u003C/u\u003E\u003C/em\u003E radiators (i.e. the folding ones that rotate to stay edge-on to the sun), no, it doesn\u0027t matter where you put them.  At all.  You can have the hot stuff at one end of the ship, and the radiators at the opposite end-- doesn\u0027t matter, they pump heat from the whole ship.\n\u003C/p\u003E\n\u003Cp\u003E\nFor the \u003Cem\u003E\u003Cu\u003Estatic\u003C/u\u003E\u003C/em\u003E radiators, they need to be mounted close to the thing to cool.  Whether they only cool the parent part, or can extend their reach a bit farther, I\u0027m fuzzy on-- I get the impression that KSP has kinda gone back and forth on this somewhat over the past few versions, and in the past (pre-1.2) I observed them cooling stuff from all over the ship even though supposedly they\u0027re supposed only to cool locally.  So I\u0027m not completely clear on their exact behavior now (not least because I never use them, ever; the folding panels are just better).  However, broadly speaking, I believe that yes, their placement matters.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIn terms of game lore, the deployable radiators have more mass than the statics for a given cooling capacity because they include a system of internal coolant pipes all over the ship (saw it somewhere in the KSPedia).  In terms of cooling capacity, the range of sizes goes much, much bigger than the static panels as well.\n\u003C/p\u003E\n\u003Cp\u003E\nThe static panels (AFIAK!) still only draw directly from the part they are attached to (the \u0027parent\u0027 part) and the ones connected to that (\u0027child\u0027 parts).  For instance, put down a 2.5m battery or reaction wheel.  Radially attach two large static panels to it.  Radially attach two large drills (which generate lots of heat while mining).  Drop a large \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E (another large heat source) on top.  Add an ore tank and power anywhere in the ship.  That is a complete mining package that will stay cool in any planet mining situation I\u0027ve tried (asteroids may vary).\n\u003C/p\u003E\n\u003Cp\u003E\nAs for the rest of Snark\u0027s post - consider that all hot parts naturally cool off over time, all by themselves.  If your \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E cockpit is glowing red hot when you reach orbit, its heat will partially radiate into space, and partially conduct into the other parts of the ship (which then also radiate heat away). If you add static radiators, they only directly cool the parent and child parts, but they do assist with that conducted heat by making their parts cooler.  Then, heat from other parts has a path to slowly flow to the cooler parts and be radiated away.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s basically academic though.  We run into heat from atmospheric flight, where are deployable radiators are uselessly draggy and fragile.  Static panels can help cool parts a bit in flight, but it\u0027s a tiny bandaid where the real cure is part selection (parts have different temp limits), cargo bays (where parts are shielded from aero friction), and flight path (flying too fast too low blows up parts radiators or no, and doesn\u0027t get you to space any better if that\u0027s where you\u0027re headed).  The nuclear engines used to get hot enough to blow up parts, but they don\u0027t now in ordinary use - radiators just aren\u0027t required.  Mining - this matters.  There is no effective mining without effective cooling, but it is 100% possible with statics (as described above).  That leaves sundiving - flying so close to the sun that parts overheat.  This, finally, is where you will have to do a lot of thermal engineering to see how close you can get before exploding.\n\u003C/p\u003E\n\u003Cp\u003E\nFor all other situations, radiators are essentially just roleplay.  My Apollo LM replica has one, because the real one does.  The panels also make nice fashion fairings and covers for ugly parts, edges, corners, lines, etc.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-01-13T18:24:19Z\u0022 title=\u002201/13/2017 06:24  PM\u0022 data-short=\u00227 yr\u0022\u003EJanuary 13, 2017\u003C/time\u003E by fourfa\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2017-01-16T10:58:19Z","Content":"\n\u003Cp\u003E\nRe: confusion regarding static radiators: They cool only the parent part. BUT all parts conduct heat to \u0022adjacent\u0022 (parent/child), and the speed is dependent on temperature gradient - so heat from hot parts goes to cool ones pretty fast. (the exception being radiators which draw heat out of parent, getting hot themselves).\n\u003C/p\u003E\n\u003Cp\u003E\nThat means: if you can\u0027t attach radiators directly to the \u0022hot part\u0022 (coincidentally, all \u0022interested\u0022: nuclear engine, drills, ISRUs and heatshields don\u0027t accept surface attachment) attach them to a parent or child of the \u0022hot part\u0022. The same fuselage a drill is attached to, a common battery you slap on top of \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E, etc, etc. (and while for nukes and heatshields you only care about not exploding, which by itself is not likely, \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E and drill thermal efficiency drops like a rock when they are too hot. Seriously, adding a radiator can improve your drill/\u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E output a good 15 times over!)\n\u003C/p\u003E\n\u003Cp\u003E\nBad caveat: they don\u0027t cool own children, but instead heat them badly. The child part would need to conduct heat to grandparent through the radiator - and radiator \u0022pumping heat\u0022 from its parent doesn\u0027t conduct heat TO parent, and will most likely be much hotter than the child part. So: do NOT attach drills to radiator panels. This looks like a great solution, but in reality it works really bad.\n\u003C/p\u003E\n\u003Cp\u003E\nSome extra thingies:\n\u003C/p\u003E\n\u003Cp\u003E\n- Static radiators actively draw heat and use electricity when you activate them, but they are essentially large surfaces with good thermal conductivity and emissivity meaning they work pretty well when switched off.\n\u003C/p\u003E\n\u003Cp\u003E\n- attaching radiator to radiator is not that bad, though not great.\n\u003C/p\u003E\n\u003Cp\u003E\n- placement/geometry of where you put the radiators is totally moot. You can attach them then use the offset tool to move them to the opposite end of the craft, or clip 50 radiator panels into each other, and they will work just fine.\n\u003C/p\u003E\n\u003Cp\u003E\n- they don\u0027t work well when they are over the capacity. Actually, then they heat the parent part. You won\u0027t get very good results on reentry, near the Sun, etc as radiators heated externally will soon saturate and the active cooling will falter.\n\u003C/p\u003E\n\u003Cp\u003E\n- active radiators are good in that they draw heat from the hot parts directly, and multiple to that, regardless of distance. You can have a base mining module and a base cooling module, no need to mix these - and a pair of big radiators will cool quite a few drills. But they are ridiculously fragile. Way more so than solar panels.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2017-01-16T11:10:05Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222923451\u0022 data-ipsquote-contentid=\u0022154938\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221484564299\u0022 data-ipsquote-userid=\u0022145504\u0022 data-ipsquote-username=\u0022Sharpy\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 minutes ago, Sharpy said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nRe: confusion regarding static radiators: They cool only the parent part. BUT all parts conduct heat to \u0022adjacent\u0022 (parent/child), and the speed is dependent on temperature gradient - so heat from hot parts goes to cool ones pretty fast. (the exception being radiators which draw heat out of parent, getting hot themselves).\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWas this silently changed? Last time I checked, they cooled the part they were attached to, and one hop out from that. Look into the part config, it should say \u0022maxHops = 2\u0022 or something similar, somewhere in the radiator Module.\n\u003C/p\u003E\n"},{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2017-01-16T11:12:02Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222923457\u0022 data-ipsquote-contentid=\u0022154938\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221484565005\u0022 data-ipsquote-userid=\u002298962\u0022 data-ipsquote-username=\u0022Streetwind\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nJust now, Streetwind said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWas this silently changed? Last time I checked, they cooled the part they were attached to, and one hop out from that. Look into the part config, it should say \u0022maxHops = 2\u0022 or something similar, somewhere in the radiator Module.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n*shrug* then maybe I\u0027m wrong. Regardless, don\u0027t attach drills to radiators. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E I\u0027m not sure how the hops are counted but apparently a drill right on a radiator is not within 2 hops \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2017-01-16T11:20:46Z","Content":"\n\u003Cp\u003E\nWell the thermal control systems have it set to 0, and that apparently means vessel-wide. One hop cannot mean cooling only itself, because that is both redundant and impossible (a radiator literally cannot actively cool itself, because any heat removed from itself would be added right back to itself), so it must mean the part it is attached to. Two hops can therefore only mean another hop outwards from that part.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd as for attaching things to radiators... yeah, that won\u0027t work because of the direction of the Unity part tree. The hops only look up the tree, not down. I\u0027m honestly surprised why surface attachment is even allowed on radiators in the first place \u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-01-16T11:21:34Z\u0022 title=\u002201/16/2017 11:21  AM\u0022 data-short=\u00227 yr\u0022\u003EJanuary 16, 2017\u003C/time\u003E by Streetwind\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Aegolius13","CreatedById":165625,"CreatedDateTime":"2017-01-16T19:03:17Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222923460\u0022 data-ipsquote-contentid=\u0022154938\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221484565122\u0022 data-ipsquote-userid=\u0022145504\u0022 data-ipsquote-username=\u0022Sharpy\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, Sharpy said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n*shrug* then maybe I\u0027m wrong. Regardless, don\u0027t attach drills to radiators. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E I\u0027m not sure how the hops are counted but apparently a drill right on a radiator is not within 2 hops \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI usually put my static radiators on fuel tanks, then attach drills and ISRUs to those tanks.  Works like a charm as far as heat control, so I\u0027m pretty sure the statics can cool two parts away.  \n\u003C/p\u003E\n"}]}