{"TopicId":154945,"ForumId":20,"TopicTitle":"[1.2.2] Ground Construction v [1.2.2]Extraplanetary Launchpads","CreatedByName":"Noel32","CreatedById":137853,"CreatedDateTime":"2017-01-13T16:47:26Z","PageNum":1,"Articles":[{"CreatedByName":"Noel32","CreatedById":137853,"CreatedDateTime":"2017-01-13T16:47:26Z","Content":"\n\u003Cp\u003E\nWhich should I use and why?\n\u003C/p\u003E\n"},{"CreatedByName":"DStaal","CreatedById":155685,"CreatedDateTime":"2017-01-13T18:28:02Z","Content":"\n\u003Cp\u003E\nBoth.  \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nGround Construction models a bit more near-term options for construction: You have to ship a portion of whatever you\u0027re building from Kerbin, although you can refine some of the materials in-place.  Basically, any parts beyond \u0027a bar/sheet of metal\u0027 get shipped up in a kit.  Also, you can only build while landed.  (It models your Kerbals going out and assembling the kit they\u0027ve been sent.). Think of it as IKEA for spaceflight: You get the flat-pack box from the store, then assemble in-place. \n\u003C/p\u003E\n\u003Cp\u003E\nExtraplanetary Launchpads is a bit more far-future: It models you being able to set up an entire production chain off-world, so you don\u0027t have to send anything from home, although you can.  You can build on planets or in-space, wherever you want, as long as you get the materials to your launchpad - and again, those materials don\u0027t have to come from Kerbin.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nTo me, starting with Ground Construction and building up the capability to do EL makes sense.  (Though it should be a longer process between the two than it is at the moment.). Both have strengths and weaknesses, and they compliment each other well.\n\u003C/p\u003E\n\u003Cp\u003E\nOne thing to note: Ground Construction is in the process of being integrated to work with MKS - as a part of that, it\u0027s building resource is going to change in the next release.\n\u003C/p\u003E\n"}]}